{
  "arxiv_id": "2509.11954v3",
  "url": "https://arxiv.org/abs/2509.11954v3",
  "pdf_url": "https://arxiv.org/pdf/2509.11954v3.pdf",
  "title": "A Pathway to Sub-meV Detection of the Dark Universe: Robust Electron Avalanche in the PN junction at 10 mK",
  "abstract": "The search for light dark matter and cosmic primordial neutrinos necessitates detectors with sub-millielectronvolt (sub-meV) energy thresholds. While superconducting quantum sensors have approached this sensitivity, they often face significant challenges regarding readout complexity and scalability. To address these limitations, we propose a hybrid Superconductor-Insulator-P-N (S-I-P-N) detector architecture. This concept combines the high sensitivity of superconducting Cooper pair breaking with the massive intrinsic gain of semiconductor electron avalanches. A critical prerequisite for this scheme is operation at millikelvin (mK) temperatures, raising the critical fundamental question of whether silicon PN junctions can sustain avalanche multiplication in a regime where carrier freeze-out is severe. Here, we experimentally validate the critical semiconductor amplification stage of the proposed detector. We demonstrate that Silicon Photomultipliers (SiPMs) retain robust Geiger-mode avalanche capabilities at 10 mK. We report a single-photoelectron gain of order 10$^6$ and a dark count rate as low as 5~mHz/mm$^2$, 7 orders of magnitude lower than at room temperature. These results confirm the viability of high-gain semiconductor readout in the deep cryogenic regime, clearing the primary obstacle regarding the semiconductor component for the realization of scalable, sub-meV threshold S-I-P-N detectors.",
  "authors": [
    "Aiqin Gao",
    "Yiming Guo",
    "Hengyu Wang",
    "Xilei Sun",
    "Xuegang Li",
    "Junhua Wang",
    "Junguang Lv",
    "Guopu Qu",
    "Lei Cao"
  ],
  "published": "2025-09-15T14:11:54Z",
  "updated": "2026-01-20T07:17:40Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}