{
  "arxiv_id": "2512.05589v2",
  "url": "https://arxiv.org/abs/2512.05589v2",
  "pdf_url": "https://arxiv.org/pdf/2512.05589v2.pdf",
  "title": "Design and Performance of a 96-channel Resistive PICOSEC Micromegas Detector for ENUBET",
  "abstract": "The PICOSEC-Micromegas (PICOSEC-MM) detector is a fast gaseous detector that achieves picosecond-level timing by coupling a Cherenkov radiator, typically an MgF2 crystal, to a Micromegas-based photodetector with a photocathode. This configuration allows the fast photoelectron-induced signal to suppress the intrinsic time jitter of gaseous detectors, enabling sub-20 ps timing precision while preserving the robustness and scalability of micro-pattern gaseous detector technologies. The 96-pad PICOSEC-MM detector is a large-area demonstrator optimized for precision timing in high-energy physics, building on research and development insights from earlier 7-pad resistive prototypes to validate scalability, uniformity, and robustness for the ENUBET project. It employs a 2.5 nm diamond-like carbon photocathode and a Micromegas board with a surface resistivity of 10 megaohms per square, and was characterized using 150 GeV/c muons at the CERN SPS beamline, with one-third of the active area instrumented per run. A dedicated alignment procedure for multi-pad PICOSEC-MM systems was used to reconstruct pad centers and merge measurements across regions, yielding a timing resolution of 43 ps and uniform signal arrival time distributions over the tested area. Mechanical flatness was identified as a key factor, with planarity tolerances within 10 micrometers required to maintain good timing resolution, and the successful operation of the 96-pad demonstrator confirms the scalability of the PICOSEC-MM concept toward robust, high-granularity, picosecond-level gaseous timing detectors for monitored neutrino beam experiments such as ENUBET.",
  "authors": [
    "A. Kallitsopoulou",
    "S. Aune",
    "Y. Angelis",
    "R. Aleksan",
    "A. Bonenfant",
    "J. Bortfeldt",
    "F. Brunbauer",
    "M. Brunoldi",
    "J. Datta",
    "D. Desforge",
    "G. Fanourakis",
    "D. Fiorina",
    "K. J. Floethner",
    "M. Gallinaro",
    "F. Garcia",
    "I. Giomataris",
    "K. Gnanvo",
    "F. J. Iguaz",
    "D. Janssens",
    "F. Jeanneau",
    "M. Kebbiri",
    "M. Kovacic",
    "B. Kross",
    "P. Legou",
    "M. Lisowska",
    "J. Liu",
    "C. Loiseau",
    "M. Lupberger",
    "I. Maniatis",
    "J. McKisson",
    "B. Moreno",
    "Y. Meng",
    "H. Muller",
    "E. Oliveri",
    "G. Orlandini",
    "A. Pandey",
    "T. Papaevangelou",
    "M. Pomorski",
    "E. F. Ribas",
    "L. Ropelewski",
    "D. Sampsonidis",
    "L. Scharenberg",
    "T. Schneider",
    "E. Scorsone",
    "L. Sohl",
    "M. van Stenis",
    "Y. Tsipolitis",
    "S. E. Tzamarias",
    "A. Utrobicic",
    "I. Vai",
    "R. Veenhof",
    "P. Vitulo",
    "X. Wang",
    "S. White",
    "W. Xi",
    "Z. Zhang",
    "Y. Zhou"
  ],
  "published": "2025-12-05T10:23:46Z",
  "updated": "2026-01-19T10:51:09Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}