{
  "arxiv_id": "2601.14767v1",
  "url": "https://arxiv.org/abs/2601.14767v1",
  "pdf_url": "https://arxiv.org/pdf/2601.14767v1.pdf",
  "title": "A SiPM-Based RICH Detector with Timing Capabilities for Isotope Identification",
  "abstract": "In this work, we present a novel compact particle identification (PID) detector concept based on Silicon Photomultipliers (SiPMs) optimized to perform combined Ring-Imaging Cherenkov (RICH) and Time-of-Flight (TOF) measurements using a common photodetector layer. The system consists of a Cherenkov radiator layer separated from a photosensitive surface equipped with SiPMs by an expansion gap. A thin glass slab, acting as a second Cherenkov radiator, is coupled to the SiPMs to perform Cherenkov-based charged particle timing measurements. We assembled a small-scale prototype instrumented with various Hamamatsu SiPM array sensors with pixel pitches ranging from 2 to 3 mm and coupled with 1 mm thick fused silica window. The RICH radiator consisted of a 2 cm thick aerogel tile with a refractive index of 1.03 at 400 nm. The prototype was successfully tested in beam test campaigns at the CERN PS T10 beam line with pions and protons. We measured a single-hit angular resolution of about 4 mrad at the Cherenkov angle saturation value and a time resolution better than 50 ps RMS for charged particles with Z = 1. The present technology makes the proposed SiPM-based PID system particularly attractive for space applications due to the limited detector volumes available. In this work, we present beam test results obtained with the detector prototype and we discuss possible configurations optimized for the identification of ions in space applications.",
  "authors": [
    "M. N. Mazziotta",
    "L. Congedo",
    "G. De Robertis",
    "M. Giliberti",
    "F. Licciulli",
    "A. Liguori",
    "L. Lorusso",
    "N. Nicassio",
    "G. Panzarini",
    "R. Pillera"
  ],
  "published": "2026-01-21T08:43:53Z",
  "updated": "2026-01-21T08:43:53Z",
  "categories": [
    "physics.ins-det",
    "astro-ph.IM",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.3390/particles8040094"
}