{
  "arxiv_id": "2601.12836v1",
  "url": "https://arxiv.org/abs/2601.12836v1",
  "pdf_url": "https://arxiv.org/pdf/2601.12836v1.pdf",
  "title": "Development of next-generation light-weight ternary Mg--Al--Li alloys for beampipe applications in particle accelerators",
  "abstract": "The current study reports the design of advanced light-weight materials for high-energy accelerator beampipe applications. The objective is to optimize the combined requirements of high radiation length and stiffness properties of the designed materials. The present study targets conventional beampipe materials such as aluminum, titanium, and stainless steel as primary performance benchmarks. These conventional beampipes are used at synchrotron radiation sources, such as Indus-1 and Indus-2 in India, the Nuclotron-based Ion Collider Facility in Russia, and the ring synchrotron facility SIS 100/300 at the Facility for Antiproton and Ion Research in Germany. In this context, a series of ternary Mg--Al--Li alloys is systematically investigated to enhance the figure of merit. Two aluminum--rich alloys, A1 ($\\mathrm{Al_{61.5}Li_{10.8}Mg_{27.7}}$) and A2 ($\\mathrm{Al_{66}Li_{19.4}Mg_{14.6}}$), along with three magnesium-rich alloys, M1 ($\\mathrm{Al_{23.9}Li_{29.3}Mg_{46.8}}$), M2 ($\\mathrm{Al_{19}Li_{20.6}Mg_{60.4}}$), and M3 ($\\mathrm{Al_{39.8}Li_{20.1}Mg_{40.1}}$) are explored. Thermodynamic stability, density, liquidus temperature, and phases are evaluated using Latin hypercube sampling within the Thermo-Calc TC-Python framework. Elastic properties are obtained from density functional theory calculations performed using the Vienna \\textit{Ab Initio} Simulation Package. Our results show that, although the elastic moduli ($E$) of the investigated Mg-Al-Li alloys are comparable to those of conventional beampipe materials, their significantly higher radiation lengths ($X_0$) lead to an overall improvement in the figure of merit $X_0 E^{1/3}$.",
  "authors": [
    "Kamaljeet Singh",
    "Kangkan Goswami",
    "Raghunath Sahoo",
    "Sumanta Samal"
  ],
  "published": "2026-01-19T08:47:10Z",
  "updated": "2026-01-19T08:47:10Z",
  "categories": [
    "physics.acc-ph",
    "cond-mat.mtrl-sci",
    "hep-ex"
  ],
  "primary_category": "physics.acc-ph"
}