{
  "arxiv_id": "2601.02588v2",
  "url": "https://arxiv.org/abs/2601.02588v2",
  "pdf_url": "https://arxiv.org/pdf/2601.02588v2.pdf",
  "title": "Integrated Radiation-Magneto-Hydrodynamic Simulations of Magnetized Burning Plasmas. I. Magnetizing Ignition-Class Designs",
  "abstract": "Motivated by breakthroughs in inertial confinement fusion (ICF), first achieving ignition conditions in National Ignition Facility (NIF) shot N210808 and then laser energy breakeven in N221204, modeling efforts here investigate the effect of imposed magnetic fields on integrated hohlraum simulations of igniting systems. Previous NIF experiments have shown yield and hotspot temperature to increase in magnetized, gas-filled capsules in line with scalings. In this work, we use the 2D radiation-magnetohydrodynamics code Lasnex with a Livermore ICF common model. Simulations are tuned to closely approximate data from unmagnetized experiments. Investigated here is the effect of imposed axial fields of up to 100 T on the fusion output of high-performing ICF shots, specifically the record BigFoot shot N180128, and HYBRID-E shots N210808 and N221204. The main observed effect is an increase in the hotspot temperature due to magnetic insulation. Namely, electron heat flow is constrained perpendicular to the magnetic field and alpha trajectories transition to gyro-orbits, enhancing energy deposition. In addition, we investigate the impact of applied magnetic fields to future NIF designs, specifically an example Enhanced Yield Capability design with 3 MJ of laser energy as well as a high-\\r{ho}R, low implosion velocity \"Pushered Single Shell\" design. In conclusion, magnetization with field strengths of 5-75 T is found to increase the burn-averaged ion temperature by 50% and the neutron yield by 2-12. Specifically, we see yield enhancement of at least 50% with only a 5-10 T applied magnetic field for N221204, while a 65 T field on N210808 with symmetrization gives an 8 increase in yield. This is all without further design optimization to best take advantage of an applied B field, which promises even greater improvements for designs tailored specifically towards magnetization.",
  "authors": [
    "B. Z. Djordjević",
    "D. J. Strozzi",
    "G. B. Zimmerman",
    "S. A. MacLaren",
    "C. R. Weber",
    "D. D. -M. Ho",
    "L. S. Leal",
    "C. A. Walsh",
    "J. D. Moody"
  ],
  "published": "2026-01-05T22:38:23Z",
  "updated": "2026-01-19T07:08:48Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}