[
  {
    "arxiv_id": "2601.13517v2",
    "url": "https://arxiv.org/abs/2601.13517v2",
    "pdf_url": "https://arxiv.org/pdf/2601.13517v2.pdf",
    "title": "Demonstration of a novel phase space painting method in a coupled lattice to mitigate space charge in high-intensity hadron beams",
    "abstract": "Multi-turn charge-exchange injection is the primary method of creating high-intensity hadron beams in circular accelerators, and phase space painting during injection enables tailoring of the accumulated phase space distribution. A technique we call eigenpainting allows injection of particles into a single mode of a coupled ring, providing full four-dimensional control of the phase space distribution. Under ideal conditions, uniform eigenpainting generates a linear-force equilibrium distribution in the transverse plane, with zero volume in four-dimensional transverse phase space, even including space charge. We have implemented eigenpainting for the first time in the Spallation Neutron Source (SNS) Accumulator Ring. Injecting 8.8 $μ$C of 800 MeV beam, we obtain a final ratio of intrinsic transverse emittances of $\\approx$2.4. We analyze the effect of space charge on the final distribution through comparison of the reconstructed phase space to particle-in-cell simulations.",
    "authors": [
      "Nicholas J. Evans",
      "Austin Hoover",
      "Timofey Gorlov",
      "Vasiliy Morozov"
    ],
    "published": "2026-01-20T02:10:00Z",
    "updated": "2026-01-21T18:02:30Z",
    "categories": [
      "physics.acc-ph",
      "physics.app-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2506.06814v2",
    "url": "https://arxiv.org/abs/2506.06814v2",
    "pdf_url": "https://arxiv.org/pdf/2506.06814v2.pdf",
    "title": "An analytical optimization of plasma density profiles for downramp injection in laser wake-field acceleration",
    "abstract": "We propose and detail a multi-step analytical procedure, based on an improved fully relativistic plane model for Laser Wake Field Acceleration, to tailor the initial density of a cold diluted plasma to the laser pulse profile, so as to control and optimize the partial wave-breaking of the plasma wave and maximize the acceleration of small bunches of electrons self-injected by the first wave-breaking at the density down-ramp, at least in the first stages of their acceleration phase. We find an excellent agreement with the results of Particle In Cell simulations obtained with the same input data.",
    "authors": [
      "Gaetano Fiore",
      "Paolo Tomassini"
    ],
    "published": "2025-06-07T14:45:03Z",
    "updated": "2026-01-21T17:48:08Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.18564v2",
    "url": "https://arxiv.org/abs/2509.18564v2",
    "pdf_url": "https://arxiv.org/pdf/2509.18564v2.pdf",
    "title": "Impact of Nitrogen and Oxygen Interstitials on Niobium SRF Cavity Performance",
    "abstract": "Superconducting radiofrequency (SRF) cavities are the leading technology for highly efficient particle acceleration, and their performance can be significantly enhanced through the controlled introduction of interstitial impurities into bulk niobium. Nitrogen doping has demonstrated a substantial reduction in surface resistance, which improves the quality factor of the cavities. More recently, oxygen doping has emerged as a promising alternative, demonstrating comparable reductions in surface resistance. In this study, we combine cavity measurements on 1.3 GHz niobium SRF cavities subjected to a range of nitrogen- and oxygen-based treatments with material characterizations performed on cavity cutouts processed under identical conditions. This approach allows us to quantitatively assess the contribution of each impurity to the reduction of surface resistance. We find that nitrogen is ten times more effective than oxygen in reducing surface resistance at 16 MV/m. We also observe an additive effect of O and N impurities in reducing R$_\\mathrm{T}$. We discuss these results in the context of field dependent nonequilibrium superconductivity, gap enhancement, and hydrogen trapping mechanisms.",
    "authors": [
      "Hannah Hu",
      "Young-Kee Kim",
      "Daniel Bafia"
    ],
    "published": "2025-09-23T02:41:21Z",
    "updated": "2026-01-21T17:05:03Z",
    "categories": [
      "physics.acc-ph",
      "cond-mat.supr-con"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2409.20446v2",
    "url": "https://arxiv.org/abs/2409.20446v2",
    "pdf_url": "https://arxiv.org/pdf/2409.20446v2.pdf",
    "title": "Phase projection errors in rf-driven optically pumped magnetometers",
    "abstract": "We investigate the phase relationship between the oscillating (rf) excitation field and the detected (light) power modulation in scalar rf-driven optically pumped magnetometers (OPMs), in particular in the $M_x$ configuration. While the static dependence of the demodulation phase on the direction of the external static magnetic field vector can be largely mitigated by aligning the oscillating rf field along the light propagation direction, we demonstrate that a dynamic (transient) phase response arises under magnetic field tilts. We analytically solve the corresponding modified Bloch equation and confirm agreement with experimental observations obtained using an $M_x$ magnetometer incorporating a paraffin-coated Cs vapor cell. The results reveal fundamental limitations of $M_x$ magnetometers regarding response time and accuracy, in particular when employed with active electronic feedback, such as a phase-locked loop. Therefore, this work is highly relevant to important magnetometry applications where the direction of the quasi-static magnetic field of interest is unknown \\textit{a priori} or varies over time, or in measurements requiring a large detection bandwidth. Such conditions are encountered in applications such as geomagnetic surveying, particularly with mobile platforms.",
    "authors": [
      "Zoran D. Grujić",
      "Marija Ćurĉić",
      "Aleksandra Kocić",
      "Antoine Weis",
      "Theo Scholtes"
    ],
    "published": "2024-09-30T16:05:10Z",
    "updated": "2026-01-21T14:21:12Z",
    "categories": [
      "physics.atom-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2601.14924v1",
    "url": "https://arxiv.org/abs/2601.14924v1",
    "pdf_url": "https://arxiv.org/pdf/2601.14924v1.pdf",
    "title": "Ring oscillator performance of the ATLAS inner tracker pixel readout chip",
    "abstract": "This paper presents experimental and simulation data to characterize the Ring Oscillators (RO) produced in 65-nm CMOS technology for the next promising generation of readout chips for the pixel detector in the Inner Tracker (ITk) at the ATLAS experiment at CERN. To enable a better understanding of the RO block embedded in ITkPixV1.1 single chip card (SCC), tests at various temperatures, voltages, accumulated total ionizing dose (TID) with X-ray irradiation, and high-temperature annealing will be presented. The objective of this study is to examine the RO output dependency based on different variable conditions and provide simulation data using Cadence, an electronic design automation (EDA) software to validate the experimental outcomes.",
    "authors": [
      "Yahya Khwaira",
      "Abdenour Lounis",
      "Maurice Cohen-Solal",
      "Mohsine Menouni",
      "Pierre Barrillon",
      "Denis Fougeron"
    ],
    "published": "2026-01-21T12:11:32Z",
    "updated": "2026-01-21T12:11:32Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.24851v2",
    "url": "https://arxiv.org/abs/2509.24851v2",
    "pdf_url": "https://arxiv.org/pdf/2509.24851v2.pdf",
    "title": "The development of a high granular crystal calorimeter prototype of VLAST",
    "abstract": "Very Large Area gamma-ray Space Telescope (VLAST) is the next-generation flagship space observatory for high-energy gamma-ray detection proposed by China. The observation energy range covers from MeV to TeV and beyond, with acceptance of 10 m^2sr. The calorimeter serves as a crucial subdetector of VLAST, responsible for high-precision energy measurement and electron/proton discrimination. This discrimination capability is essential for accurately identifying gamma-ray events among the background of charged particles. To accommodate such an extensive energy range, a high dynamic range readout scheme employing dual avalanche photodiodes (APDs) has been developed, achieving a remarkable dynamic range of 10^6. Furthermore, a high granular prototype based on bismuth germanate (BGO) cubic scintillation crystals has been developed. This high granularity enables detailed imaging of the particle showers, improving both energy resolution and particle identification. The prototype's performance is evaluated through cosmic ray testing, providing valuable data for optimizing the final calorimeter design for VLAST.",
    "authors": [
      "Yanshuo Zhang",
      "Qian Chen",
      "Dengyi Chen",
      "Jianguo Liu",
      "Yiming Hu",
      "Yunlong Zhang",
      "Yifeng Wei",
      "Zhongtao Shen",
      "Changqing Feng",
      "Jianhua Guo",
      "Shubin Liu",
      "Guangshun Huang",
      "Xiaolian Wang",
      "Zizong Xu"
    ],
    "published": "2025-09-29T14:38:01Z",
    "updated": "2026-01-21T09:29:53Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.11603v2",
    "url": "https://arxiv.org/abs/2601.11603v2",
    "pdf_url": "https://arxiv.org/pdf/2601.11603v2.pdf",
    "title": "The use of spectral indices in environmental monitoring of smouldering coal-waste dumps",
    "abstract": "The study aimed to evaluate the applicability of environmental indices in the monitoring of smouldering coal-waste dumps. A dump located in the Upper Silesian Coal Basin served as the research site for a multi-method analysis combining remote sensing and field-based data. Two UAV survey campaigns were conducted, capturing RGB, infrared, and multispectral imagery. These were supplemented with direct ground measurements of subsurface temperature and detailed vegetation mapping. Additionally, publicly available satellite data from the Landsat and Sentinel missions were analysed. A range of vegetation and fire-related indices (NDVI, SAVI, EVI, BAI, among others) were calculated to identify thermally active zones and assess vegetation conditions within these degraded areas. The results revealed strong seasonal variability in vegetation indices on thermally active sites, with evidence of disrupted vegetation cycles, including winter greening in moderately heated root zones - a pattern indicative of stress and degradation processes. While satellite data proved useful in reconstructing the fire history of the dump, their spatial resolution was insufficient for detailed monitoring of small-scale thermal anomalies. The study highlights the diagnostic potential of UAV-based remote sensing in post-industrial environments undergoing land degradation but emphasises the importance of field validation for accurate environmental assessment.",
    "authors": [
      "Anna Abramowicz",
      "Michal Laska",
      "Adam Nadudvari",
      "Oimahmad Rahmonov"
    ],
    "published": "2026-01-08T16:44:21Z",
    "updated": "2026-01-21T09:15:21Z",
    "categories": [
      "physics.geo-ph",
      "physics.ins-det",
      "stat.AP"
    ],
    "primary_category": "physics.geo-ph",
    "doi": "10.1016/j.rsase.2025.101865"
  },
  {
    "arxiv_id": "2601.14782v1",
    "url": "https://arxiv.org/abs/2601.14782v1",
    "pdf_url": "https://arxiv.org/pdf/2601.14782v1.pdf",
    "title": "Introducing Timepix2-Lite: A Miniaturized Readout Interface Enabling Nanosecond-Scale Half-Life Measurement",
    "abstract": "This paper presents Timepix2 Lite, a compact readout interface for the Timepix2 hybrid pixel detector, designed to provide high spatial and temporal resolution in a wide range of radiation detection applications. The Timepix2 Lite enables simultaneous energy and precise timing measurements on the nanosecond scale and supports advanced real-time data acquisition and visualization through the TrackLab software framework. Its compact and flexible architecture, enabled by the miniaturized design, allows seamless integration into diverse experimental setups, including nuclear spectroscopy, stratospheric balloon missions, and nanosecond-scale half-life measurements. As a case study, the half-life of the second excited state in 237Np was determined to be 67.5(7) ns for the 59.5 keV transition, consistent with previously reported results.",
    "authors": [
      "O. Pavlas",
      "B. Bergmann",
      "M. Holik",
      "M. Malich",
      "S. Pospisil",
      "P. Smolyanskiy",
      "V. Vicha",
      "R. Filgas"
    ],
    "published": "2026-01-21T09:04:24Z",
    "updated": "2026-01-21T09:04:24Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.14768v1",
    "url": "https://arxiv.org/abs/2601.14768v1",
    "pdf_url": "https://arxiv.org/pdf/2601.14768v1.pdf",
    "title": "Efficient and precise Cherenkov-based charged particle timing using SiPMs",
    "abstract": "Dedicated R&D efforts are currently underway to couple a thin Cherenkov radiator to Silicon Photomultiplier (SiPM) arrays for precise charged particle Time-of-Flight (ToF) measurements. The prompt nature of Cherenkov radiation makes it an ideal candidate for achieving ultimate timing performance in a ToF detector. Using a thin radiator with a high refractive index, such as fused silica, enables the generation of a fast signal from charged particles that exceed the Cherenkov threshold. A crucial requirement for approaching the target time resolution is the optimization of both the radiator material and thickness, as well as the optical coupling to the SiPM arrays. In this work, we present the main factors that affect the time resolution and the expected performance achieved through a detailed Monte Carlo simulation and the comparison with beam test results.",
    "authors": [
      "M. N. Mazziotta",
      "A. Di Mauro",
      "M. Giliberti",
      "A. Liguori",
      "L. Lorusso",
      "E. Nappi",
      "N. Nicassio",
      "G. Panzarini",
      "R. Pillera",
      "G. Volpe"
    ],
    "published": "2026-01-21T08:44:45Z",
    "updated": "2026-01-21T08:44:45Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.14767v1",
    "url": "https://arxiv.org/abs/2601.14767v1",
    "pdf_url": "https://arxiv.org/pdf/2601.14767v1.pdf",
    "title": "A SiPM-Based RICH Detector with Timing Capabilities for Isotope Identification",
    "abstract": "In this work, we present a novel compact particle identification (PID) detector concept based on Silicon Photomultipliers (SiPMs) optimized to perform combined Ring-Imaging Cherenkov (RICH) and Time-of-Flight (TOF) measurements using a common photodetector layer. The system consists of a Cherenkov radiator layer separated from a photosensitive surface equipped with SiPMs by an expansion gap. A thin glass slab, acting as a second Cherenkov radiator, is coupled to the SiPMs to perform Cherenkov-based charged particle timing measurements. We assembled a small-scale prototype instrumented with various Hamamatsu SiPM array sensors with pixel pitches ranging from 2 to 3 mm and coupled with 1 mm thick fused silica window. The RICH radiator consisted of a 2 cm thick aerogel tile with a refractive index of 1.03 at 400 nm. The prototype was successfully tested in beam test campaigns at the CERN PS T10 beam line with pions and protons. We measured a single-hit angular resolution of about 4 mrad at the Cherenkov angle saturation value and a time resolution better than 50 ps RMS for charged particles with Z = 1. The present technology makes the proposed SiPM-based PID system particularly attractive for space applications due to the limited detector volumes available. In this work, we present beam test results obtained with the detector prototype and we discuss possible configurations optimized for the identification of ions in space applications.",
    "authors": [
      "M. N. Mazziotta",
      "L. Congedo",
      "G. De Robertis",
      "M. Giliberti",
      "F. Licciulli",
      "A. Liguori",
      "L. Lorusso",
      "N. Nicassio",
      "G. Panzarini",
      "R. Pillera"
    ],
    "published": "2026-01-21T08:43:53Z",
    "updated": "2026-01-21T08:43:53Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.3390/particles8040094"
  },
  {
    "arxiv_id": "2601.14583v1",
    "url": "https://arxiv.org/abs/2601.14583v1",
    "pdf_url": "https://arxiv.org/pdf/2601.14583v1.pdf",
    "title": "Two-port CW measurements on RF cavities: Notes on self-consistency assessment and indirect methods",
    "abstract": "In the case of a radio-frequency (RF) cavity with a mismatched input coupler, a direct calculation of the power dissipation in the cavity and the intrinsic quality factor from continuous-wave (CW) measurements may have uncertainty due to systematic errors. Formulae for an indirect calculation of these quantities are derived for the case of a cavity with two couplers of fixed coupling strength. In this approach, the signal from the pickup coupler is used to infer the amplitude of the \"emitted wave\" from the input coupler. A graphical method for self-consistency assessment is evaluated. The impact of frequency offsets is considered. Applications of these methods are presented, drawing on cold tests of superconducting cavities produced for the Facility for Rare Isotope Beams.",
    "authors": [
      "Walter H. Hartung",
      "Wei Chang",
      "Sang-Hoon Kim",
      "Taro Konomi",
      "Ting Xu"
    ],
    "published": "2026-01-21T01:45:25Z",
    "updated": "2026-01-21T01:45:25Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.14463v1",
    "url": "https://arxiv.org/abs/2601.14463v1",
    "pdf_url": "https://arxiv.org/pdf/2601.14463v1.pdf",
    "title": "Lumped-Element Model of THz HEB Mixer Based on Sputtered MgB2 Thin Film",
    "abstract": "We present a comprehensive analysis and experimental study of THz hot-electron bolometer (HEB) mixers made from 40-nm-thick sputtered magnesium diboride (MgB2) thin films on high-resistivity silicon substrates. Using a lumped-element bolometric model, we achieve strong quantitative agreement with measurements of conversion gain, noise temperature, and local-oscillator (LO) coupling to the HEB devices. Our analysis shows that the sensitivity of current HEB devices is primarily limited by on-chip optical losses, with both Johnson and thermal-fluctuation noise contributing significantly to the overall noise temperature. Simulations of an optimized device with near-ideal optical coupling suggest that Johnson noise remains a substantial factor even with improved coupling. Further reduction of the noise temperature may require additional suppression of Johnson noise (via improved intrinsic conversion gain) beyond optimizing optical coupling efficiency. We emphasize the importance of accurate modeling to achieve good numerical agreement with experiments, thereby enabling understanding of the causes of sensitivity loss.",
    "authors": [
      "Changyun Yoo",
      "Changsub Kim",
      "Daniel P. Cunnane",
      "Boris S. Karasik"
    ],
    "published": "2026-01-20T20:35:50Z",
    "updated": "2026-01-20T20:35:50Z",
    "categories": [
      "cond-mat.supr-con",
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.supr-con"
  },
  {
    "arxiv_id": "2601.14028v1",
    "url": "https://arxiv.org/abs/2601.14028v1",
    "pdf_url": "https://arxiv.org/pdf/2601.14028v1.pdf",
    "title": "XFEL Imaging Techniques for High Energy Density and Inertial Fusion Energy Research at HED-HiBEF",
    "abstract": "The imaging platform developed at the High Energy Density - Helmholtz International Beamline for Extreme Fields (HED-HiBEF) instrument at the European XFEL and its applications to high energy density and fusion related research are presented. The platform combines the XFEL beam with the high-intensity short-pulse laser ReLaX and the high-energy nanosecond-pulse laser DiPOLE-100X. The spatial resolution is better than 500 nm and the temporal resolution of the order of 50 fs. We show examples of blast waves and converging cylindrical shocks in aluminium, resonant absorption measurements of specific charged states in copper with ReLaX and planar shocks in polystyrene material generated by DiPOLE-100X. We also discuss the possibilities introduced by combining this imaging platform with a kJ-class laser.",
    "authors": [
      "Alejandro Laso Garcia",
      "Mikhail Mishchenko",
      "Victorien Bouffetier",
      "Gabriel Perez-Callejo",
      "Karen Appel",
      "Alexey Arefiev",
      "Carsten Baehtz",
      "Erik Brambrink",
      "Mihail Cernaianu",
      "Domenico Doria",
      "Tobias Dornheim",
      "Gillis M. Dyer",
      "Nicolas Fefeu",
      "Eric Galtier",
      "Thomas Gawne",
      "Petru V. Ghenuche",
      "Sebastian Goede",
      "Johannes Hagemann",
      "Marie-Luise Herbert",
      "Hauke Höppner",
      "Lingen Huang",
      "Oliver Humphries",
      "Mae Jones",
      "Dimitri Khaghani",
      "Thomas Kluge",
      "Jayanath Koliyadu",
      "Dominik Kraus",
      "Hae Ja Lee",
      "Julian Lütgert",
      "Mikako Makita",
      "Jean-Paul Naedler",
      "Bob Nagler",
      "Motoaki Nakatsutsumi",
      "Quynh Nguyen",
      "Alexander Pelka",
      "Thomas R. Preston",
      "Chong Bing Qu",
      "Sripati V. Rahul",
      "Lisa Randolph",
      "Ronald Redmer",
      "Martin Rehwald",
      "Hans G. Rinderknecht",
      "Angel Rodriguez-Fernandez",
      "Joao J. Santos",
      "Ulrich Schramm",
      "Michal Smid",
      "Cornelius Strohm",
      "Jergus Strucka",
      "Minxue Tang",
      "Patrik Vagovic",
      "Milenko Vescovi",
      "Long Yang",
      "Karl Zeil",
      "Ulf Zastrau",
      "Thomas E. Cowan",
      "Toma Toncian"
    ],
    "published": "2026-01-20T14:52:33Z",
    "updated": "2026-01-20T14:52:33Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.07213v5",
    "url": "https://arxiv.org/abs/2506.07213v5",
    "pdf_url": "https://arxiv.org/pdf/2506.07213v5.pdf",
    "title": "AttoSHINE: Generation of continuous-wave terawatt-scale attosecond X-ray pulses at SHINE",
    "abstract": "Attosecond X-ray pulses are a critical tool for tracking ultrafast electron dynamics in condensed matter, molecular systems, and strongly correlated materials. Recent breakthroughs have pushed X-ray free electron lasers (XFELs) into the attosecond domain, significantly surpassing their previous femtosecond capabilities. Building on these advancements, this work investigates the potential of the Shanghai High Repetition Rate XFEL and Extreme Light Facility (SHINE), China's first continuous-wave (CW) XFEL, to generate intense attosecond X-ray pulses, thereby offering transformative capabilities for X-ray science. Through comprehensive start-to-end simulations, we show that SHINE is capable of producing hard X-ray pulses with peak powers reaching the terawatt-scale and average pulse durations of approximately 300 as. This is achieved using a self-chirping scheme within the existing machine configuration, requiring no additional hardware. Our findings demonstrate that CW XFELs can generate intense attosecond X-ray pulses at megahertz repetition rates, opening new opportunities for real-time studies of electronic dynamics in complex systems.",
    "authors": [
      "Bingyang Yan",
      "Chenzhi Xu",
      "Si Chen",
      "Duan Gu",
      "Ye Chen",
      "Jiawei Yan",
      "Haixiao Deng"
    ],
    "published": "2025-06-08T16:32:35Z",
    "updated": "2026-01-20T14:39:34Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.13980v1",
    "url": "https://arxiv.org/abs/2601.13980v1",
    "pdf_url": "https://arxiv.org/pdf/2601.13980v1.pdf",
    "title": "The Geometry of Flux Surfaces with Quasi-Poloidal Symmetry",
    "abstract": "Quasi-poloidal (QP) magnetic fields have desirable properties for confining plasma: no radial drift of guiding centres (with positive implications for neoclassical transport), zero Pfirsch-Schlüter current, a lower level of damping for poloidal flows, leading to reduced anomalous transport, and possible stability benefits. Despite their attractive properties, QP fields are not amenable to the near-axis expansion, a major theoretical tool for understanding toroidal fields. In this paper, we provide a novel framework for defining and understanding QP flux surfaces. This framework relies on a simplification that transforms the task of finding a quasi-poloidal flux surface from a 3D problem to a 2D problem. This simplification also applies to asymmetric magnetic mirrors with desirable properties. We sketch how this 2D problem can form the basis of an efficient optimisation problem for finding QP flux surfaces. We leverage this 2D problem for theoretical understanding: for instance, we identify one class of QP flux surfaces that are naturally flat mirrors (Velasco et al. 2023). The reduced model is validated against numerically optimised QP equilibria. We further utilise the reduced model to explain the prevalence of cusps, high mirror ratios, and narrow pinch points in these numerical equilibria.",
    "authors": [
      "Rishin Madan",
      "Wrick Sengupta",
      "Elizabeth J. Paul",
      "Mohammed Haque",
      "Richard Nies",
      "Amitava Bhattacharjee"
    ],
    "published": "2026-01-20T13:58:07Z",
    "updated": "2026-01-20T13:58:07Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.20417v2",
    "url": "https://arxiv.org/abs/2511.20417v2",
    "pdf_url": "https://arxiv.org/pdf/2511.20417v2.pdf",
    "title": "Comparative evaluation of future collider options",
    "abstract": "In anticipation of the completion of the High-Luminosity Large Hadron Collider (HL-LHC) programme by the end of 2041, CERN is preparing to launch a new major facility in the mid-2040s. According to the 2020 update of the European Strategy for Particle Physics (ESPP), the highest-priority next collider is an electron-positron Higgs factory, followed in the longer term by a hadron-hadron collider at the highest achievable energy. The CERN directorate established a Future Colliders Comparative Evaluation working group in June 2023. This group brings together project leaders and domain experts to conduct a consistent evaluation of the Future Circular Collider (FCC) and alternative scenarios based on shared assumptions and standardized criteria. This report presents a comparative evaluation of proposed future collider projects submitted as input for the Update of the European Strategy for Particle Physics. These proposals are compared considering main performance parameters, environmental impact and sustainability, technical maturity, cost of construction and operation, required human resources, and realistic implementation timelines. An overview of the international collider projects within a similar timeframe, notably the CEPC in China and the ILC in Japan is also presented, as well as a short review of the status and prospects of new accelerator techniques.",
    "authors": [
      "G. Arduini",
      "M. Benedikt",
      "F. Gianotti",
      "K. Jakobs",
      "M. Lamont",
      "R. Losito",
      "M. Meddahi",
      "J. Mnich",
      "N. Mounet",
      "D. Schulte",
      "F. Sonnemann",
      "S. Stapnes",
      "F. Zimmermann"
    ],
    "published": "2025-11-25T15:41:09Z",
    "updated": "2026-01-20T13:29:20Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.23731/CYRM-2025-0011"
  },
  {
    "arxiv_id": "2601.13905v1",
    "url": "https://arxiv.org/abs/2601.13905v1",
    "pdf_url": "https://arxiv.org/pdf/2601.13905v1.pdf",
    "title": "Reduction of SAXS Signal due to Doppler Broadening Induced Loss of Coherence",
    "abstract": "We present an analytical and numerical study of how Doppler-induced spectral broadening in laser-heated plasmas degrades the coherence of small-angle X-ray scattering (SAXS) signals, and show that the resulting loss of temporal coherence reduces the SAXS intensity. Applying this formalism to two benchmark geometries - single density steps (wires) and periodic gratings -- we obtain analytic estimates. For gratings, finite coherence simultaneously lowers Bragg-peak heights and broadens their widths, whereas for isolated steps only the overall scaling with q affected. We map the parameter space relevant to current SASE and self-seeded XFELs, revealing that Doppler effects remain managable for the trieval of geometry parameters (less than few 10 % error) for SASE bandwidths but become the dominant error source in seeded configurations or above-keV temperatures. Practical consequences for density-gradient retrieval and interface-sharpness measurements are quantified. The results supply clear criteria for when Doppler broadening must be included in SAXS data analysis and offer a route to infer electron temperature directly from coherence-loss signatures.",
    "authors": [
      "Thomas Kluge",
      "Uwe Hernandez Acosta",
      "Klaus Steiniger",
      "Ulrich Schramm",
      "Thomas E. Cowan"
    ],
    "published": "2026-01-20T12:31:52Z",
    "updated": "2026-01-20T12:31:52Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.13888v1",
    "url": "https://arxiv.org/abs/2601.13888v1",
    "pdf_url": "https://arxiv.org/pdf/2601.13888v1.pdf",
    "title": "Quasi-linear approach of bi-Kappa distributed electrons with dynamic $κ$ parameter. EMEC instability",
    "abstract": "In recent years, significant progress has been made in the velocity-moment-based quasi-linear (QL) theory of waves and instabilities in plasmas with nonequilibrium velocity distributions (VDs) of the Kappa (or $κ$) type. However, the temporal variation of the parameter $κ$, which quantifies the presence of suprathermal particles, is not fully captured by such a QL analysis, and typically $κ$ remains constant during plasma dynamics. We propose a new QL modeling that goes beyond the limits of a previous approach, realistically assuming that the quasithermal core cannot evolve independently of energetic suprathermals. The case study is done on the electron-cyclotron (EMEC) instability generated by anisotropic bi-Kappa electrons with $A=T_\\perp/T_\\parallel > 1$ ($\\parallel, \\perp$ denoting directions with respect to the background magnetic field). The parameter $κ$ self-consistently varies through the QL equation of kurtosis (fourth-order moment) coupled with temporal variations of the temperature components, relaxing the constraint on the independence of the low-energy (core) electrons and suprathermal high-energy tails of VDs. The results refine and extend previous approaches. A clear distinction is made between regimes that lead to a decrease or an increase in the $κ$ parameter with saturation of the instability. What predominates is a decrease in $κ$, i.e., an excess of suprathermalization, which energizes suprathermal electrons due to self-generated wave fluctuations. Additionally, we found that VDs can evolve toward a quasi-Maxwellian shape (as $κ$ increases) primarily in regimes with low beta and initial kappa values greater than five. Instability-driven relaxation only partially resolves temperature anisotropy in bi-Kappa electron VDs, as wave fluctuations generally act to further energize suprathermal electrons.",
    "authors": [
      "Pablo S Moya",
      "Roberto E Navarro",
      "Marian Lazar",
      "Peter H Yoon",
      "Rodrigo A López",
      "Stefaan Poedts"
    ],
    "published": "2026-01-20T12:00:37Z",
    "updated": "2026-01-20T12:00:37Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1051/0004-6361/202558299"
  },
  {
    "arxiv_id": "2601.10363v3",
    "url": "https://arxiv.org/abs/2601.10363v3",
    "pdf_url": "https://arxiv.org/pdf/2601.10363v3.pdf",
    "title": "A compact Optical Liquid Argon Facility at Roma Tre",
    "abstract": "In this paper we present a compact test facility for the measurement of optical properties of liquid argon as scintillation detector. The setup is under preparation at Roma Tre and it has a volume of 40 L liquid argon, which is liquefied from argon gas with a purity of $\\ge 99.9999\\%$ vol. To readout the scintillation photons from liquid argon with the highest intensity near 127 nm, we use the vacuum ultraviolet silicon photomultipliers from Hamamatsu. By submerging the photon detectors directly inside the liquid argon, we can eliminate the systematics from the wave length shifter and light guides which have been commonly used to detect the scintillation photons of liquid argon.",
    "authors": [
      "Hexi Shi",
      "Valerio D'Andrea",
      "Giuseppe Salamanna",
      "Krzysztof Szczepaniec",
      "Diego Tagnani"
    ],
    "published": "2026-01-15T13:10:24Z",
    "updated": "2026-01-20T11:44:29Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.13766v1",
    "url": "https://arxiv.org/abs/2601.13766v1",
    "pdf_url": "https://arxiv.org/pdf/2601.13766v1.pdf",
    "title": "Projected sensitivity to light WIMP-like particles of the BULLKID-DM experiment",
    "abstract": "BULLKID-DM is an experiment designed for the direct searches of particle dark matter candidates with mass around 1 GeV, or below, and cross-section with nucleons smaller than $10^{-40}$ cm$^2$. The detector consists of a stack of diced silicon wafers, acting as arrays of particle absorbers, sensed by multiplexed Kinetic Inductance Detectors. The target will amount to 800 g subdivided in more than 2000 silicon dice, with the aim of controlling the background from natural radioactivity by creating a fully active structure and by applying fiducialization techniques. In this work we present the projected sensitivity of BULLKID-DM to light WIMP-like particles considering also the other future experiments in the field.",
    "authors": [
      "Matteo Folcarelli",
      "A. Acevedo-Rentería",
      "L. E. Ardila-Perez",
      "L. Bandiera",
      "M. Calvo",
      "M. Cappelli",
      "R. Caravita",
      "F. Carillo",
      "U. Chowdhury",
      "D. Crovo",
      "A. Cruciani",
      "A. D'Addabbo",
      "D. Delicato",
      "M. De Lucia",
      "G. Del Castello",
      "M. del Gallo Roccagiovine",
      "F. Ferraro",
      "S. Fu",
      "R. Gartmann",
      "M. Grassi",
      "V. Guidi",
      "D. Helis",
      "T. Lari",
      "L. Malagutti",
      "A. Mazzolari",
      "A. Monfardini",
      "T. Muscheid",
      "D. Nicolò",
      "F. Paolucci",
      "D. Pasciuto",
      "L. Pesce",
      "C. Puglia",
      "D. Quaranta",
      "C. M. A. Roda",
      "S. Roddaro",
      "M. Romagnoni",
      "G. Signorelli",
      "F. Simon",
      "A. Tartari",
      "E. Vázquez-Jáuregui",
      "M. Vignati",
      "K. Zhao"
    ],
    "published": "2026-01-20T09:18:10Z",
    "updated": "2026-01-20T09:18:10Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.13746v1",
    "url": "https://arxiv.org/abs/2601.13746v1",
    "pdf_url": "https://arxiv.org/pdf/2601.13746v1.pdf",
    "title": "Hamiltonian hydrodynamic reductions of one-dimensional Vlasov equations",
    "abstract": "We investigate Hamiltonian fluid reductions of the one-dimensional Vlasov-Poisson equation. Our approach utilizes the hydrodynamic Poisson bracket framework, which allows us to systematically identify fundamental normal variables derived from the analysis of the Casimir invariants of the resulting Poisson bracket. This framework is then applied to analyze several well-established Hamiltonian closures of the onedimensional Vlasov equation, including the multi-delta distribution and the waterbag models. Our key finding is that all of these seemingly distinct closures consistently lead to the formulation of a unified form of parametric closures: When expressed in terms of the identified normal variables, the parameterization across all these closures is revealed to be polynomial and of the same degree. All these parametric closures are uniquely generated from one of the moments, called $μ$2, a cubic polynomial in the normal variables. This result establishes a structural connection between these different physical models, offering a path toward a more unified and simplified description of the one-dimensional Vlasov-Poisson dynamics through its reduced hydrodynamic forms with an arbitrary number of fluid variables.",
    "authors": [
      "Rayan Oufar",
      "Cristel Chandre"
    ],
    "published": "2026-01-20T09:03:04Z",
    "updated": "2026-01-20T09:03:04Z",
    "categories": [
      "math-ph",
      "nlin.CD",
      "physics.plasm-ph"
    ],
    "primary_category": "math-ph"
  },
  {
    "arxiv_id": "2601.13739v1",
    "url": "https://arxiv.org/abs/2601.13739v1",
    "pdf_url": "https://arxiv.org/pdf/2601.13739v1.pdf",
    "title": "The Hamilton-Jacobi Equation and its Application to Nonlinear Beam Dynamics: Comparison of Approaches",
    "abstract": "The rarely used Hamilton-Jacobi equation has been utilized as an elegant way to find the trajectories of mechanical systems and to derive symplectic maps. Further, the exact solution in kick approximation of Hamilton's equations of motion in interaction representation is written as a generalized one-turn twist map.   One can imagine that the nonlinear kick comes first, followed by the one-period rotation along the machine circumference, or a second alternative in which the one-period rotation occurs before the kick. There is a difference in the result of solving Hamilton's equations between the two cases, which is expressed in obtaining a standard forward twist map in the first case, or alternatively a backward map in the second one. This nontrivial and intuitively unclear peculiarity is usually ignored/overlooked in practically all specialized references on the topic.   Finally, the statistical properties and the behavior of the density distribution of a particle beam in configuration space under the influence of an isolated sextupole have been studied.",
    "authors": [
      "Stephan I. Tzenov"
    ],
    "published": "2026-01-20T08:52:42Z",
    "updated": "2026-01-20T08:52:42Z",
    "categories": [
      "physics.acc-ph",
      "nlin.SI",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.17856v2",
    "url": "https://arxiv.org/abs/2510.17856v2",
    "pdf_url": "https://arxiv.org/pdf/2510.17856v2.pdf",
    "title": "Carrier envelope phase and laser pulse shape effects on Schwinger vacuum pair production in super-Gaussian asymmetric electric fields",
    "abstract": "We investigate the combined effects of carrier envelope phase and laser pulse shape on electron-positron pair production in the presence of an external asymmetric super-Gaussian electric field by solving the quantum Vlasov equation. By varying the field asymmetry, the pulse shape from Gaussian to super-Gaussian, and the carrier envelope phase, we show the momentum distribution and the number density of created pairs to exhibit extreme sensitivity to these field characteristics. The effects are also qualitatively explained by analyzing the turning-point structures within the WKB formalism. We observed that multiphoton pair production dominates in the case of long falling-pulse asymmetry. For a short falling pulse with a flat-top super-Gaussian laser profile, pair production is further facilitated. For certain field parameters, we demonstrate that the number density can be enhanced by two to three orders of magnitude.",
    "authors": [
      "Abhinav Jangir",
      "Anees Ahmed"
    ],
    "published": "2025-10-15T05:58:06Z",
    "updated": "2026-01-20T07:44:14Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.11954v3",
    "url": "https://arxiv.org/abs/2509.11954v3",
    "pdf_url": "https://arxiv.org/pdf/2509.11954v3.pdf",
    "title": "A Pathway to Sub-meV Detection of the Dark Universe: Robust Electron Avalanche in the PN junction at 10 mK",
    "abstract": "The search for light dark matter and cosmic primordial neutrinos necessitates detectors with sub-millielectronvolt (sub-meV) energy thresholds. While superconducting quantum sensors have approached this sensitivity, they often face significant challenges regarding readout complexity and scalability. To address these limitations, we propose a hybrid Superconductor-Insulator-P-N (S-I-P-N) detector architecture. This concept combines the high sensitivity of superconducting Cooper pair breaking with the massive intrinsic gain of semiconductor electron avalanches. A critical prerequisite for this scheme is operation at millikelvin (mK) temperatures, raising the critical fundamental question of whether silicon PN junctions can sustain avalanche multiplication in a regime where carrier freeze-out is severe. Here, we experimentally validate the critical semiconductor amplification stage of the proposed detector. We demonstrate that Silicon Photomultipliers (SiPMs) retain robust Geiger-mode avalanche capabilities at 10 mK. We report a single-photoelectron gain of order 10$^6$ and a dark count rate as low as 5~mHz/mm$^2$, 7 orders of magnitude lower than at room temperature. These results confirm the viability of high-gain semiconductor readout in the deep cryogenic regime, clearing the primary obstacle regarding the semiconductor component for the realization of scalable, sub-meV threshold S-I-P-N detectors.",
    "authors": [
      "Aiqin Gao",
      "Yiming Guo",
      "Hengyu Wang",
      "Xilei Sun",
      "Xuegang Li",
      "Junhua Wang",
      "Junguang Lv",
      "Guopu Qu",
      "Lei Cao"
    ],
    "published": "2025-09-15T14:11:54Z",
    "updated": "2026-01-20T07:17:40Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.13583v1",
    "url": "https://arxiv.org/abs/2601.13583v1",
    "pdf_url": "https://arxiv.org/pdf/2601.13583v1.pdf",
    "title": "AAFIYA: Antenna Analysis in Frequency-domain for Impedance and Yield Assessment",
    "abstract": "This paper presents AAFIYA (Antenna Analysis in Frequency-domain for Impedance and Yield Assessment), a modular Python toolkit for automated characterization of radio-frequency antennas using measurement and simulation data. The toolkit provides a unified workflow for processing S-parameters, impedance, realized gain, beam patterns, polarization metrics, and calibration-based yield estimation, with support for standard Touchstone files and beam pattern data. AAFIYA is validated using measurements from an electromagnetic anechoic chamber involving Log Periodic Dipole Array (LPDA) reference antennas and Askaryan Radio Array (ARA) Bottom Vertically Polarized antennas over 100-850 MHz. Extracted metrics, including impedance matching, realized gain patterns, vector effective lengths, and cross-polarization ratio, are compared against full-wave simulations from HFSS and WIPL-D, showing good agreement across frequency and angle. The results demonstrate that AAFIYA enables accurate, reproducible, and publication-ready antenna analysis, and provides a flexible foundation for future extensions, including automated optimization and data-driven antenna design.",
    "authors": [
      "Mohammad Ful Hossain Seikh",
      "Rachel Jarvis",
      "James Stiles"
    ],
    "published": "2026-01-20T04:17:55Z",
    "updated": "2026-01-20T04:17:55Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.13577v1",
    "url": "https://arxiv.org/abs/2601.13577v1",
    "pdf_url": "https://arxiv.org/pdf/2601.13577v1.pdf",
    "title": "Toward Ultra-fast Treatments: Large Energy Acceptance Beam Delivery Systems and Opportunities for Proton Beam Therapy",
    "abstract": "Treatment delivery is largely determined by capabilities of the beam delivery system (BDS), where faster delivery can have many potential benefits including improved dosimetric quality, utility, cost effectiveness, patient throughput and comfort. Despite significant developments in accelerators, delivery methodologies, dose optimisation and more, the energy layer switching time (ELST) is still a persisting limitation in existing BDS. The ELST can contribute significantly to beam delivery time (BDT) and extend treatment times, requiring compensation by optimisation planning approaches, motion mitigation strategies, or active beam modification. This fundamental constraint can be addressed by increasing the narrow energy acceptance range of conventional beamlines to minimise the ELST, enabling ultra-fast delivery. A large energy acceptance (LEA) BDS has the potential to revolutionise PBT through immediate improvements to current treatment delivery and emerging delivery modalities: the complete exploitation of PBT - and unlocking its full potential - can only be made possible with advances in beam delivery technologies. We review the abundant opportunities offered by an ultra-fast BDS: shorter treatment times, reduced motion induced dose degradation, improved effectiveness of motion management techniques, possibilities for volumetric rescanning, bidirectional delivery, further planning optimisation, and novel delivery strategies. We overview the design concepts of several LEA proposals, technology requirements, and also discuss the remaining challenges and considerations with realising a LEA BDS in practice. There are multiple avenues requiring further development and study, however the clinical potential and benefits of this enabling technology are clear: ultra-fast delivery offers both immediate and future improvements to PBT treatments.",
    "authors": [
      "Jacinta Yap",
      "Adam Steinberg",
      "Hannah Norman",
      "Konrad Nesteruk",
      "Suzie Sheehy"
    ],
    "published": "2026-01-20T04:03:14Z",
    "updated": "2026-01-20T04:03:14Z",
    "categories": [
      "physics.med-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.med-ph"
  },
  {
    "arxiv_id": "2601.13517v1",
    "url": "https://arxiv.org/abs/2601.13517v1",
    "pdf_url": "https://arxiv.org/pdf/2601.13517v1.pdf",
    "title": "Demonstration of a novel phase space painting method in a coupled lattice to mitigate space charge in high-intensity hadron beams",
    "abstract": "Multi-turn charge-exchange injection is the primary method of creating high-intensity hadron beams in circular accelerators, and phase space painting during injection enables tailoring of the accumulated phase space distribution. A technique we call eigenpainting allows injection of particles into a single mode of a coupled ring, providing full four-dimensional control of the phase space distribution. Under ideal conditions, uniform eigenpainting generates a linear-force equilibrium distribution in the transverse plane, with zero volume in four-dimensional transverse phase space, even including space charge. We have implemented eigenpainting for the first time in the Spallation Neutron Source (SNS) Accumulator Ring. Injecting 8.8 $μ$C of 800 MeV beam, we obtain a final ratio of intrinsic transverse emittances of $\\approx$2.4. We analyze the effect of space charge on the final distribution through comparison of the reconstructed phase space to particle-in-cell simulations.",
    "authors": [
      "Nicholas J. Evans",
      "Austin Hoover",
      "Timofey Gorlov",
      "Vasiliy Morozov"
    ],
    "published": "2026-01-20T02:10:00Z",
    "updated": "2026-01-20T02:10:00Z",
    "categories": [
      "physics.acc-ph",
      "physics.app-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.14321v1",
    "url": "https://arxiv.org/abs/2601.14321v1",
    "pdf_url": "https://arxiv.org/pdf/2601.14321v1.pdf",
    "title": "High-Resolution Electron Paramagnetic Resonance",
    "abstract": "Electron paramagnetic resonance (EPR) is a valuable tool for physics, chemistry, biology and medicine, providing complementary spectroscopic information to NMR. It has long been known that EPR at high magnetic fields offers greater spectral resolution, but limitations in the THz instrumentation have prevented the full realization of these opportunities. Here we describe an EPR spectrometer at the high magnetic field of 14 T using 396 GHz excitation, which adapts techniques from liquid-state NMR to obtain sharp EPR resonances with a width of 210 ppb (full-width half-maximum). We use this to measure resonance positions, and hence g-factors, with a precision that reaches $\\pm$16 ppb. Our use of in-situ liquid-state NMR of our solvent within the same sample improves the accuracy of these measurements: it allows us to reference our EPR measurement back to dilute gas 3He NMR for which quantum calculations are accurate. We measure the g-factor of N@C60 in deuterated toluene as g = 2.002 099 09 (3), where the 3 in brackets means that the uncertainty on the last digit is $\\pm$3.",
    "authors": [
      "Colin J. Stephen",
      "Anton Tcholakov",
      "Maik Icker",
      "Stuart M. Graham",
      "Xiaoming Zhao",
      "Robert Day",
      "Jeanette Chattaway",
      "T. John S. Dennis",
      "Wolfgang Harneit",
      "Gavin W. Morley"
    ],
    "published": "2026-01-19T22:49:07Z",
    "updated": "2026-01-19T22:49:07Z",
    "categories": [
      "physics.ins-det",
      "physics.chem-ph",
      "quant-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "1501.02747v2",
    "url": "https://arxiv.org/abs/1501.02747v2",
    "pdf_url": "https://arxiv.org/pdf/1501.02747v2.pdf",
    "title": "A detailed and unified treatment of spin-orbit systems using tools distilled from the theory of bundles",
    "abstract": "We return to our study \\cite{BEH} of invariant spin fields and spin tunes for polarized beams in storage rings but in contrast to the continuous-time treatment in \\cite{BEH}, we now employ a discrete-time formalism, beginning with the $\\rm{Poincar\\acute{e}}$ maps of the continuous time formalism. We then substantially extend our toolset and generalize the notions of invariant spin field and invariant frame field. We revisit some old theorems and prove several theorems believed to be new. In particular we study two transformation rules, one of them known and the other new, where the former turns out to be an $SO(3)$-gauge transformation rule. We then apply the theory to the dynamics of spin-$1/2$ and spin-$1$ particle bunches and their density matrix functions, describing semiclassically the particle-spin content of bunches. Our approach thus unifies the spin-vector dynamics from the T-BMT equation with the spin-tensor dynamics and other dynamics. This unifying aspect of our approach relates the examples elegantly and uncovers relations between the various underlying dynamical systems in a transparent way. As in \\cite{BEH}, the particle motion is integrable but we now allow for nonlinear particle motion on each torus. Since this work is inspired by notions from the theory of bundles, we also provide insight into the underlying bundle-theoretic aspects of the well-established concepts of invariant spin field, spin tune and invariant frame field. Since we neglect, as is usual, the Stern-Gerlach force, the underlying principal bundle is of product formso that we can present the theory in a fashion which does not use bundle theory. Nevertheless we occasionally mention the bundle-theoretic meaningof our concepts and we also mention the similarities with the geometrical approach to Yang-Mills Theory.",
    "authors": [
      "Klaus Heinemann",
      "Desmond P. Barber",
      "James A. Ellison",
      "Mathias Vogt"
    ],
    "published": "2015-01-12T18:34:22Z",
    "updated": "2026-01-19T22:12:30Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.13413v1",
    "url": "https://arxiv.org/abs/2601.13413v1",
    "pdf_url": "https://arxiv.org/pdf/2601.13413v1.pdf",
    "title": "High Field Diamond Magnetometry Towards Tokamak Diagnostics",
    "abstract": "Nitrogen vacancy centres (NVC) in diamond have been widely used for near-dc magnetometry. The intrinsic properties of diamonds make them potential candidates for tokamak fusion power diagnostics, where radiation-hard magnetometers will be essential for efficient control. An NVC magnetometer placed in a tokamak will need to operate within a $\\geq$ 1 T magnetic field. In this work, we demonstrate fibre-coupled ensemble NVC optically detected magnetic resonance (ODMR) and magnetometry measurements at magnetic fields up to 1.2 T. Sensitivities of approximately 240 to 600 nT/$\\sqrt{\\textrm{Hz}}$ and 110 nT/$\\sqrt{\\textrm{Hz}}$ are achieved in a (10-150) Hz frequency range, for non-degenerate and near-$\\langle$111$\\rangle$ field alignments respectively.",
    "authors": [
      "S. M. Graham",
      "C. J. Stephen",
      "A. J. Newman",
      "A. M. Edmonds",
      "M. L. Markham",
      "G. W. Morley"
    ],
    "published": "2026-01-19T21:49:03Z",
    "updated": "2026-01-19T21:49:03Z",
    "categories": [
      "physics.app-ph",
      "physics.ins-det",
      "physics.optics",
      "physics.plasm-ph",
      "quant-ph"
    ],
    "primary_category": "physics.app-ph"
  },
  {
    "arxiv_id": "2601.13377v1",
    "url": "https://arxiv.org/abs/2601.13377v1",
    "pdf_url": "https://arxiv.org/pdf/2601.13377v1.pdf",
    "title": "Learning time-dependent and integro-differential collision operators from plasma phase space data using differentiable simulators",
    "abstract": "Collisional and stochastic wave-particle dynamics in plasmas far from equilibrium are complex, temporally evolving, stochastic processes which are challenging to model. In this work, we extend previous methods coupling differentiable kinetic simulators and plasma phase space diagnostics to learn collision operators that account for time-varying background distributions. We also introduce a more general integro-differentiable operator formulation to probe relevant terms in the collision operator. To validate the proposed methodology we use data generated by self-consistent electromagnetic Particle-in-Cell simulations. We show that both approaches recover operators that can accurately reproduce the plasma phase space dynamics while being more accurate than estimates based on particle track statistics. These results further demonstrate the potential of using differentiable simulators to infer collision operators for scenarios where no closed form solution exists or deviations from existing theory are expected.",
    "authors": [
      "Diogo D. Carvalho",
      "Luis O. Silva",
      "E. P. Alves"
    ],
    "published": "2026-01-19T20:25:01Z",
    "updated": "2026-01-19T20:25:01Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.07082v2",
    "url": "https://arxiv.org/abs/2511.07082v2",
    "pdf_url": "https://arxiv.org/pdf/2511.07082v2.pdf",
    "title": "The Use of O2 in Gas Mixtures for Drift Chambers",
    "abstract": "The use of Oxygen in gas mixtures for drift chambers is highly discouraged because Oxygen, being strongly electronegative, is generally believed to lead, even in very small quantities, to extremely reduced drift electron survival probability, thus preventing the detector's operation.The drift chamber of the MEG II experiment at PSI has been operating for several years with a gas mixture that mainly contains He:Isobutane in relative proportions of 90:10% by molar concentration, in addition to 1.5% Isopropanol and 0.5% Oxygen. Oxygen and Isopropanol are essential for the proper functioning of the chamber. The electron attachment in the mixture used has proven negligible for the proper operation of the chamber and agrees well with the Garfield++ simulation after correctly accounting for the three-body attachment simulation.",
    "authors": [
      "A. M. Baldini",
      "L. Bianco",
      "H. Benmansour",
      "G. Cavoto",
      "F. Cei",
      "M. Chiappini",
      "A. Corvaglia",
      "M. Francesconi",
      "E. Gabbrielli",
      "L. Galli",
      "G. Gallucci",
      "F. Grancagnolo",
      "E. G. Grandoni",
      "M. Grassi",
      "F. Leonetti",
      "D. Nicolo'",
      "M. Panareo",
      "D. Pasciuto",
      "A. Papa",
      "F. Renga",
      "S. Scarpellini",
      "A. Venturini",
      "C. Voena"
    ],
    "published": "2025-11-10T13:14:46Z",
    "updated": "2026-01-19T16:24:12Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.20594v2",
    "url": "https://arxiv.org/abs/2509.20594v2",
    "pdf_url": "https://arxiv.org/pdf/2509.20594v2.pdf",
    "title": "Anderson self-localization of light in pair plasmas",
    "abstract": "We demonstrate that in pair plasma weakly nonlinear electromagnetic waves, $a_0 \\leq 1$, experience Anderson self-localization. The beat between the driver and a back-scattered wave creates charge-neutral, large random density fluctuations $δn/n_0 \\gg 1$, and corresponding fluctuations of the dielectric permittivity $ε$ (random plasma density grating). Propagating in quasi-1D, waves in a medium with spatially random self-created fluctuations of dielectric permeability experience localization. {In the linear regime, the instability can be classified as Induced Brillouin Scattering; it is described by the parameter $ρ_L = \\left( a_0 { ω_{p}/ }ω\\right)^{2/3} \\leq 1 $, related to the Pierce parameter of Free Electron Lasers. In the cold case, the growth rate is $Γ\\approx ρ_{L} ω$ ($a_0 $ is laser nonlinearity parameter, $ω_p$ is plasma frequency, $ω$ is the laser frequency). } Anderson self-localization of light leads to (i) reflection of EM waves by the under-dense pair plasma; (ii) a wave already present inside the plasma separates into bright trapped pockets and dark regions. Mild initial thermal spread with $Θ\\equiv k_B T/(m_e c^2) \\approx a_0^2$, restores wave propagation by suppressing the seeds of parametrically unstable density fluctuations. A circularly polarized driver produces linearly polarized structures, with position angle varying randomly between the bright pulses. Time-variability of the resulting density structures does not suppress localization due to remaining corrections (not white noise). We discuss possible applications to astrophysical Fast Radio Bursts.",
    "authors": [
      "Maxim Lyutikov",
      "Victor Gurarie"
    ],
    "published": "2025-09-24T22:25:27Z",
    "updated": "2026-01-19T16:19:52Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE",
      "cond-mat.dis-nn"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.13179v1",
    "url": "https://arxiv.org/abs/2601.13179v1",
    "pdf_url": "https://arxiv.org/pdf/2601.13179v1.pdf",
    "title": "Depletion depth measurements of new large area silicon carbide detectors",
    "abstract": "The ion beam induced charge technique with proton microprobe is used to characterise newly developed p-n junction large area silicon carbide detectors. They were recently produced as part of the ongoing program to develop a new particle identification wall for the focal plane detector of the MAGNEX magnetic spectrometer at INFN - Laboratori Nazionali del Sud in view of the NUMEN experimental campaigns. Four silicon carbide devices are studied. Proton beams over a 1.26 to 6.00 MeV incident energy range are used to probe the active area and the depletion depth of each device. The energy loss tables for the silicon carbide material are checked, finding an empirical correction that is then used to quantify the depletion depth at the full depletion voltage through energy loss measurements of 3.40 MeV proton beams irradiating the back side of the devices. It is possible to fully deplete the devices provided that the epitaxial layer is grown properly on the substrate.",
    "authors": [
      "A. Spatafora",
      "D. Carbone",
      "L. La Fauci",
      "G. A. Brischetto",
      "D. Calvo",
      "F. Cappuzzello",
      "M. Cavallaro",
      "A. Crnjac",
      "K. Ivanković Nizić",
      "M. Jakšić",
      "D. Torresi",
      "S. Tudisco"
    ],
    "published": "2026-01-19T16:07:20Z",
    "updated": "2026-01-19T16:07:20Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1016/j.nima.2025.170670"
  },
  {
    "arxiv_id": "2601.13175v1",
    "url": "https://arxiv.org/abs/2601.13175v1",
    "pdf_url": "https://arxiv.org/pdf/2601.13175v1.pdf",
    "title": "Electromagnetic ghosts in pair plasmas",
    "abstract": "Collisions of two weakly nonlinear, $a_0 \\ll 1$, counter-propagating EM pulses in pair plasma leave behind a long-surviving collection of localized waves, {\\it an electromagnetic ghost}. Waves are trapped (localized) by the random large density fluctuations created by the beat between the pulses. The process is similar to random plasma density grating and/or Anderson-like wave localization. Structures survive for long, mesoscale times, while the EM energy slowly bleeds through high density walls of the density trap. Large guide magnetic field, $ω_B \\geq $ few $ω$, suppresses the formation of the ghosts.",
    "authors": [
      "Maxim Lyutikov"
    ],
    "published": "2026-01-19T16:01:46Z",
    "updated": "2026-01-19T16:01:46Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.17061v2",
    "url": "https://arxiv.org/abs/2509.17061v2",
    "pdf_url": "https://arxiv.org/pdf/2509.17061v2.pdf",
    "title": "The Nature of Turbulence at Sub-Electron Scales in the Solar Wind",
    "abstract": "The nature of turbulence at sub-electron scales has remained an open question, central to understanding how electrons are heated in the solar wind. This is primarily because spacecraft measurements have been limited to magnetic field fluctuations alone. We resolve this by deriving new high-resolution density fluctuations from spacecraft potential measurements of Parker Solar Probe resolving scales smaller than the electron gyro-radius ($ρ_e$). A systematic comparison of the density and magnetic spectra shows that both steepen near the electron scales. Notably, the density spectrum exhibits slopes close to $-10/3$, while the magnetic spectrum becomes consistently steeper than the density spectrum at scales smaller than $ρ_e$, indicating that the turbulence becomes electrostatic. These results are consistent with theoretical predictions of an electron entropy cascade, which may explain the irreversible dissipation of turbulent energy at sub-$ρ_e$ scales. The magnetic spectrum, however, is not as steep as expected for the electron entropy cascade, which may be due to limited signal-to-noise ratio and the presence of weakly damped electromagnetic fluctuations near $ρ_e$.",
    "authors": [
      "Shiladittya Mondal",
      "Christopher H. K. Chen",
      "Davide Manzini"
    ],
    "published": "2025-09-21T12:41:41Z",
    "updated": "2026-01-19T15:46:57Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2601.13123v1",
    "url": "https://arxiv.org/abs/2601.13123v1",
    "pdf_url": "https://arxiv.org/pdf/2601.13123v1.pdf",
    "title": "Aspects of Mechanical Engineering for Undulators",
    "abstract": "This paper gives an overview about aspects of mechanical engineering of undulators. It is based mainly on two types that are used in the SwissFEL facility. The U15 Undulator is an example of an in-vacuum type and the UE38 is an APPLE-X type. It describes the frame, the adjustment of the magnets with flexible keepers and the adjustment of the whole device with eccentric movers.",
    "authors": [
      "Haimo Joehri"
    ],
    "published": "2026-01-19T15:11:17Z",
    "updated": "2026-01-19T15:11:17Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.13120v1",
    "url": "https://arxiv.org/abs/2601.13120v1",
    "pdf_url": "https://arxiv.org/pdf/2601.13120v1.pdf",
    "title": "Innovations in High- and Ultra-precision Machining",
    "abstract": "Modern precision manufacturing faces the challenge of integrating accuracy requirements into a framework of agile and sustainable production technologies. This development leads to numerous further challenges, affecting almost all areas of precision manufacturing industry. To overcome those challenges, this article presents promising technologies and innovative solution concepts from the field of temperature measurement in the cutting zone, process design for advanced materials, the development of reconfigurable machine tools, the optimization of the temperature behaviour of high-speed spindles and the use of edge computing in machine tools. Using the presented solutions, modern precision machining can be made more future-oriented in terms of sustainability and resilience.",
    "authors": [
      "Eckart Uhlmann",
      "Mitchel Polte",
      "Toni Hocke",
      "Julius Tschöpel"
    ],
    "published": "2026-01-19T15:06:40Z",
    "updated": "2026-01-19T15:06:40Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.13067v1",
    "url": "https://arxiv.org/abs/2601.13067v1",
    "pdf_url": "https://arxiv.org/pdf/2601.13067v1.pdf",
    "title": "Oxygen atom density and kinetics in intermediate-pressure radiofrequency capacitively-coupled plasmas in pure O2",
    "abstract": "We have studied radiofrequency capacitively coupled plasmas in pure O2 using single mode laser cavity ringdown spectroscopy of oxygen atoms at 630 nm. The absolute atom densities and translational temperatures were determined over a range of pressures and RF power . At pressures of 267 Pa and above, the O atom mole fraction increases with RF power and decreases with pressure, reaching a maximum of 15 percent. However, at 133 and 67 Pa it passes through a distinct maximum with power before decreasing significantly. The atom recombination processes are probed by time resolved measurements in the afterglow of pulse modulated plasmas. At 133 and 67 Pa the atom loss is dominated by surface recombination, and we see clear evidence that this rate is increased by energetic ion bombardment, in agreement with a study from Bill Graham group. This effect partially explains the observed decrease in dissociation at high RF power. The time-resolved results also allow the O negative ion density to be determined and indicate the creation of ozone in the afterglow. At 133 Pa, the trends with RF power of the O2 dissociation, O negative ion density and gas temperature suggest a transition at high power to a plasma mode with fewer high energy electrons. At higher pressures gas phase recombination mechanisms become dominant, however gas convection driven by gas cooling in the afterglow makes it complex to analyse the time-resolved data.",
    "authors": [
      "Shu Zhang",
      "Andrey Volynets",
      "Garrett A. Curley",
      "Jean-Paul Booth"
    ],
    "published": "2026-01-19T13:57:39Z",
    "updated": "2026-01-19T13:57:39Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2410.02568v2",
    "url": "https://arxiv.org/abs/2410.02568v2",
    "pdf_url": "https://arxiv.org/pdf/2410.02568v2.pdf",
    "title": "Pattern formation and spatiotemporal chaos in relativistic degenerate plasmas",
    "abstract": "We numerically study the nonlinear interactions of high-frequency circularly polarized electromagnetic (EM) waves and low-frequency electron-acoustic (EA) density perturbations driven by the EM wave ponderomotive force in relativistic plasmas {(moderate, strong, and ultra-relativistic)} with two groups of electrons--the population of relativistic degenerate dense electrons (bulk plasma) and the sparse relativistic nondegenerate (classical) electrons, and immobile singly charged positive ions. By pattern selection, we show that many solitary patterns can be generated and drenched through modulational instability of EM waves at different spatial length scales and that the EM wave radiation spectra emanating from compact astrophysical objects may not settle into stable envelope solitons but into different incoherent states, including the emergence of temporal and spatiotemporal chaos due to collisions and fusions among the patterns with strong EA wave emission. The appearance of these states is confirmed by analyzing the Lyapunov exponent spectra, correlation function, and mutual information {as quantitative evidence}. As a result, the redistribution of wave energy from initially exciting many solitary patterns at large scales to a few new incoherent patterns with small wavelengths in the system occurs, leading to the onset of turbulence in astrophysical plasmas.",
    "authors": [
      "S. Das Adhikary",
      "A. P. Misra"
    ],
    "published": "2024-10-03T15:16:57Z",
    "updated": "2026-01-19T12:19:28Z",
    "categories": [
      "physics.plasm-ph",
      "nlin.CD",
      "nlin.PS"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.05589v2",
    "url": "https://arxiv.org/abs/2512.05589v2",
    "pdf_url": "https://arxiv.org/pdf/2512.05589v2.pdf",
    "title": "Design and Performance of a 96-channel Resistive PICOSEC Micromegas Detector for ENUBET",
    "abstract": "The PICOSEC-Micromegas (PICOSEC-MM) detector is a fast gaseous detector that achieves picosecond-level timing by coupling a Cherenkov radiator, typically an MgF2 crystal, to a Micromegas-based photodetector with a photocathode. This configuration allows the fast photoelectron-induced signal to suppress the intrinsic time jitter of gaseous detectors, enabling sub-20 ps timing precision while preserving the robustness and scalability of micro-pattern gaseous detector technologies. The 96-pad PICOSEC-MM detector is a large-area demonstrator optimized for precision timing in high-energy physics, building on research and development insights from earlier 7-pad resistive prototypes to validate scalability, uniformity, and robustness for the ENUBET project. It employs a 2.5 nm diamond-like carbon photocathode and a Micromegas board with a surface resistivity of 10 megaohms per square, and was characterized using 150 GeV/c muons at the CERN SPS beamline, with one-third of the active area instrumented per run. A dedicated alignment procedure for multi-pad PICOSEC-MM systems was used to reconstruct pad centers and merge measurements across regions, yielding a timing resolution of 43 ps and uniform signal arrival time distributions over the tested area. Mechanical flatness was identified as a key factor, with planarity tolerances within 10 micrometers required to maintain good timing resolution, and the successful operation of the 96-pad demonstrator confirms the scalability of the PICOSEC-MM concept toward robust, high-granularity, picosecond-level gaseous timing detectors for monitored neutrino beam experiments such as ENUBET.",
    "authors": [
      "A. Kallitsopoulou",
      "S. Aune",
      "Y. Angelis",
      "R. Aleksan",
      "A. Bonenfant",
      "J. Bortfeldt",
      "F. Brunbauer",
      "M. Brunoldi",
      "J. Datta",
      "D. Desforge",
      "G. Fanourakis",
      "D. Fiorina",
      "K. J. Floethner",
      "M. Gallinaro",
      "F. Garcia",
      "I. Giomataris",
      "K. Gnanvo",
      "F. J. Iguaz",
      "D. Janssens",
      "F. Jeanneau",
      "M. Kebbiri",
      "M. Kovacic",
      "B. Kross",
      "P. Legou",
      "M. Lisowska",
      "J. Liu",
      "C. Loiseau",
      "M. Lupberger",
      "I. Maniatis",
      "J. McKisson",
      "B. Moreno",
      "Y. Meng",
      "H. Muller",
      "E. Oliveri",
      "G. Orlandini",
      "A. Pandey",
      "T. Papaevangelou",
      "M. Pomorski",
      "E. F. Ribas",
      "L. Ropelewski",
      "D. Sampsonidis",
      "L. Scharenberg",
      "T. Schneider",
      "E. Scorsone",
      "L. Sohl",
      "M. van Stenis",
      "Y. Tsipolitis",
      "S. E. Tzamarias",
      "A. Utrobicic",
      "I. Vai",
      "R. Veenhof",
      "P. Vitulo",
      "X. Wang",
      "S. White",
      "W. Xi",
      "Z. Zhang",
      "Y. Zhou"
    ],
    "published": "2025-12-05T10:23:46Z",
    "updated": "2026-01-19T10:51:09Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.12850v1",
    "url": "https://arxiv.org/abs/2601.12850v1",
    "pdf_url": "https://arxiv.org/pdf/2601.12850v1.pdf",
    "title": "Accurate Simulation Pipeline for Passive Single-Photon Imaging",
    "abstract": "Single-Photon Avalanche Diodes (SPADs) are new and promising imaging sensors. These sensors are sensitive enough to detect individual photons hitting each pixel, with extreme temporal resolution and without readout noise. Thus, SPADs stand out as an optimal choice for low-light imaging. Due to the high price and limited availability of SPAD sensors, the demand for an accurate data simulation pipeline is substantial. Indeed, the scarcity of SPAD datasets hinders the development of SPAD-specific processing algorithms and impedes the training of learning-based solutions.   In this paper, we present a comprehensive SPAD simulation pipeline and validate it with multiple experiments using two recent commercial SPAD sensors. Our simulator is used to generate the SPAD-MNIST, a single-photon version of the seminal MNIST dataset, to investigate the effectiveness of convolutional neural network (CNN) classifiers on reconstructed fluxes, even at extremely low light conditions, e.g., 5 mlux. We also assess the performance of classifiers exclusively trained on simulated data on real images acquired from SPAD sensors at different light conditions. The synthetic dataset encompasses different SPAD imaging modalities and is made available for download. Project page: https://boracchi.faculty.polimi.it/Projects/SPAD-MNIST.html.",
    "authors": [
      "Aleksi Suonsivu",
      "Lauri Salmela",
      "Leevi Uosukainen",
      "Edoardo Peretti",
      "Radu Ciprian Bilcu",
      "Giacomo Boracchi"
    ],
    "published": "2026-01-19T09:04:43Z",
    "updated": "2026-01-19T09:04:43Z",
    "categories": [
      "physics.ins-det",
      "cs.CV"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1109/JSEN.2025.3645459"
  },
  {
    "arxiv_id": "2601.12836v1",
    "url": "https://arxiv.org/abs/2601.12836v1",
    "pdf_url": "https://arxiv.org/pdf/2601.12836v1.pdf",
    "title": "Development of next-generation light-weight ternary Mg--Al--Li alloys for beampipe applications in particle accelerators",
    "abstract": "The current study reports the design of advanced light-weight materials for high-energy accelerator beampipe applications. The objective is to optimize the combined requirements of high radiation length and stiffness properties of the designed materials. The present study targets conventional beampipe materials such as aluminum, titanium, and stainless steel as primary performance benchmarks. These conventional beampipes are used at synchrotron radiation sources, such as Indus-1 and Indus-2 in India, the Nuclotron-based Ion Collider Facility in Russia, and the ring synchrotron facility SIS 100/300 at the Facility for Antiproton and Ion Research in Germany. In this context, a series of ternary Mg--Al--Li alloys is systematically investigated to enhance the figure of merit. Two aluminum--rich alloys, A1 ($\\mathrm{Al_{61.5}Li_{10.8}Mg_{27.7}}$) and A2 ($\\mathrm{Al_{66}Li_{19.4}Mg_{14.6}}$), along with three magnesium-rich alloys, M1 ($\\mathrm{Al_{23.9}Li_{29.3}Mg_{46.8}}$), M2 ($\\mathrm{Al_{19}Li_{20.6}Mg_{60.4}}$), and M3 ($\\mathrm{Al_{39.8}Li_{20.1}Mg_{40.1}}$) are explored. Thermodynamic stability, density, liquidus temperature, and phases are evaluated using Latin hypercube sampling within the Thermo-Calc TC-Python framework. Elastic properties are obtained from density functional theory calculations performed using the Vienna \\textit{Ab Initio} Simulation Package. Our results show that, although the elastic moduli ($E$) of the investigated Mg-Al-Li alloys are comparable to those of conventional beampipe materials, their significantly higher radiation lengths ($X_0$) lead to an overall improvement in the figure of merit $X_0 E^{1/3}$.",
    "authors": [
      "Kamaljeet Singh",
      "Kangkan Goswami",
      "Raghunath Sahoo",
      "Sumanta Samal"
    ],
    "published": "2026-01-19T08:47:10Z",
    "updated": "2026-01-19T08:47:10Z",
    "categories": [
      "physics.acc-ph",
      "cond-mat.mtrl-sci",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.12819v1",
    "url": "https://arxiv.org/abs/2601.12819v1",
    "pdf_url": "https://arxiv.org/pdf/2601.12819v1.pdf",
    "title": "Validation of the COSINE-100U NaI(Tl) Encapsulation for Low-Temperature Operation in Liquid Scintillator",
    "abstract": "The COSINE-100U (upgrade) will enhance the sensitivity of the COSINE-100 dark matter search by operating the detector array immersed in liquid scintillator (LS) at $-30^oC$. To validate the detector design for these conditions, we constructed a module using the COSINE-100U encapsulation and performed a dedicated long-term stability study. The module was first monitored at room temperature for ~110 days in air, followed by a one-week immersion in LAB-based LS to verify initial compatibility. Upon confirming stable optical performance, the temperature was lowered to $-33^oC$. During approximately 150 days of continuous operation at low temperature, we observed no degradation in performance. These results demonstrate the chemical and mechanical robustness of the encapsulation, confirming its suitability for the COSINE-100U physics run.",
    "authors": [
      "Kihong Park",
      "Sungjin Cho",
      "Luis Eduardo Franca",
      "Chang Hyon Ha",
      "Jinyoung Kim",
      "Kyungwon Kim",
      "SungHyun Kim",
      "Won Kyung Kim",
      "Young Ju Ko",
      "Doohyeok Lee",
      "Hyunsu Lee",
      "InSoo Lee",
      "Seo Hyun Lee",
      "Sedong Park",
      "Gyunho Yu"
    ],
    "published": "2026-01-19T08:28:49Z",
    "updated": "2026-01-19T08:28:49Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.10829v2",
    "url": "https://arxiv.org/abs/2601.10829v2",
    "pdf_url": "https://arxiv.org/pdf/2601.10829v2.pdf",
    "title": "A Neutron Microscope Using a Nested Wolter-I Condenser and a Bank of Diffractive-Refractive Achromatic Objectives",
    "abstract": "We propose a nested Wolter-I mirror design for a neutron condenser, which is based on established X-ray telescope technology. We demonstrate through simulations that it can increase the flux density at the ESS imaging instrument ODIN by up to two orders of magnitude. Experimental measurements of reflectivity and figure errors on a prototype mirror element confirm the technical feasibility of the approach. Then, we discuss design strategies for an imaging objective to fully exploit the condenser specifications while achieving spatial resolutions comparable to those of X-ray micro-CT instruments. Analytically, we show that for monochromatic beams suitable solutions exist employing arrays of hundreds of identical objectives, realized either as compound refractive lenses (CRLs) or Fresnel zone plates (FZPs). To mitigate the inherent chromatic aberration of these optics, each individual objective could be replaced by an achromatic FZP/CRL combination. Key optical properties of the resulting microscope are estimated. This novel full-field microscopy concept for highly divergent, polychromatic neutron beams has the potential to improve temporal and spatial resolution for large samples and sample environments and to enable the simultaneous acquisition of hundreds of projections in neutron tomography.",
    "authors": [
      "Henning Friis Poulsen",
      "Cæcilie Andersen",
      "Nolan Ravinet",
      "Joan Vila-Comamala",
      "Mano Raj Dhanalakshmi Veeraraj",
      "Erik Bergbäck Knudsen",
      "Peter Kjær Willendrup",
      "Sonny Massahi",
      "Finn Erland Christensen",
      "Desiree Della Monica Ferreira",
      "Markus Strobl",
      "Christian David",
      "Luise Theil Kuhn"
    ],
    "published": "2026-01-15T20:01:53Z",
    "updated": "2026-01-19T07:49:34Z",
    "categories": [
      "physics.ins-det",
      "physics.acc-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.02588v2",
    "url": "https://arxiv.org/abs/2601.02588v2",
    "pdf_url": "https://arxiv.org/pdf/2601.02588v2.pdf",
    "title": "Integrated Radiation-Magneto-Hydrodynamic Simulations of Magnetized Burning Plasmas. I. Magnetizing Ignition-Class Designs",
    "abstract": "Motivated by breakthroughs in inertial confinement fusion (ICF), first achieving ignition conditions in National Ignition Facility (NIF) shot N210808 and then laser energy breakeven in N221204, modeling efforts here investigate the effect of imposed magnetic fields on integrated hohlraum simulations of igniting systems. Previous NIF experiments have shown yield and hotspot temperature to increase in magnetized, gas-filled capsules in line with scalings. In this work, we use the 2D radiation-magnetohydrodynamics code Lasnex with a Livermore ICF common model. Simulations are tuned to closely approximate data from unmagnetized experiments. Investigated here is the effect of imposed axial fields of up to 100 T on the fusion output of high-performing ICF shots, specifically the record BigFoot shot N180128, and HYBRID-E shots N210808 and N221204. The main observed effect is an increase in the hotspot temperature due to magnetic insulation. Namely, electron heat flow is constrained perpendicular to the magnetic field and alpha trajectories transition to gyro-orbits, enhancing energy deposition. In addition, we investigate the impact of applied magnetic fields to future NIF designs, specifically an example Enhanced Yield Capability design with 3 MJ of laser energy as well as a high-\\r{ho}R, low implosion velocity \"Pushered Single Shell\" design. In conclusion, magnetization with field strengths of 5-75 T is found to increase the burn-averaged ion temperature by 50% and the neutron yield by 2-12. Specifically, we see yield enhancement of at least 50% with only a 5-10 T applied magnetic field for N221204, while a 65 T field on N210808 with symmetrization gives an 8 increase in yield. This is all without further design optimization to best take advantage of an applied B field, which promises even greater improvements for designs tailored specifically towards magnetization.",
    "authors": [
      "B. Z. Djordjević",
      "D. J. Strozzi",
      "G. B. Zimmerman",
      "S. A. MacLaren",
      "C. R. Weber",
      "D. D. -M. Ho",
      "L. S. Leal",
      "C. A. Walsh",
      "J. D. Moody"
    ],
    "published": "2026-01-05T22:38:23Z",
    "updated": "2026-01-19T07:08:48Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2501.15873v3",
    "url": "https://arxiv.org/abs/2501.15873v3",
    "pdf_url": "https://arxiv.org/pdf/2501.15873v3.pdf",
    "title": "Exploring Nonlinear Drift Waves: Limiting Cases and Dynamics",
    "abstract": "A general equation for drift waves is derived incorporating both nonlinear electron density perturbation and ion vorticity effects. It is emphasized that the well-known Hasegawa-Mima (HM) equation for drift waves [A. Hasegawa and K. Mima, Phys. Fluids 21, 87 (1978)] includes only the ion vorticity term and neglects nonlinear electron density contribution that naturally arises from the electrons Boltzmann response. If ion vorticity term is ignored, then the general nonlinear equation reduces to an equation which can give two-dimensional soliton solution under an appropriate coordinate transformation. Furthermore, under the assumption that the normalized electrostatic potential depends only on one spatial coordinate along the predominant propagation direction, i.e. $Φ= Φ(y)$, the equation reduces to one-dimensional KdV equation [H. Saleem, Phys. Plasmas 31, 112102 (2024)]. Conversely, if the nonlinear electron density term is artificially suppressed and a two-dimensional potential $Φ= Φ(x, y)$ is considered, the equation reduces to Hasegawa-Mima equation supporting dipolar vortex solution. Because the HM equation ignores nonlinear electron density term, it cannot support one- or two-dimensional soliton solutions. Finally, the limiting forms of the general nonlinear equation are also briefly discussed using the reductive perturbation method (RPM).",
    "authors": [
      "Hamid Saleem"
    ],
    "published": "2025-01-27T08:50:32Z",
    "updated": "2026-01-19T06:21:57Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1063/5.0287093"
  },
  {
    "arxiv_id": "2601.09764v2",
    "url": "https://arxiv.org/abs/2601.09764v2",
    "pdf_url": "https://arxiv.org/pdf/2601.09764v2.pdf",
    "title": "DC response of an interferometer topology with an L-shaped cavity: a tabletop study",
    "abstract": "A new interferometer topology for kilohertz gravitational-wave detection was recently proposed in [Zhang et al. Phys. Rev. X 13, 021019 (2023)]. The design is based on an L-shaped optical cavity pumped through a Sagnac-like vortex. We report a tabletop experiment that characterizes the interferometer's optical response near DC. When the laser frequency is locked to the resonance of the L-shaped cavity, we observe that the cavity input coupler becomes effectively transparent, yielding a simple Michelson-like response. Moreover, the Sagnac vortex separates into upper and lower paths, which behave as two independent pumping paths driving the cavity. These observations are in agreement with theoretical predictions. Our results provide an intuitive physical picture of this interferometer topology and offer insight into its lock acquisition strategy.",
    "authors": [
      "Junlang Li",
      "Jiehong Huang",
      "Xinyao Guo",
      "Haixing Miao",
      "Yuchao Chen",
      "Xiaoman Huang",
      "Yuan Pan",
      "Chenjie Zhou",
      "Raffaele Flaminio",
      "Jameson Graef Rollins",
      "Bram Slagmolen",
      "Fan Zhang",
      "Teng Zhang",
      "Mengyao Wang"
    ],
    "published": "2026-01-14T08:59:01Z",
    "updated": "2026-01-19T06:03:24Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "gr-qc",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2502.04479v2",
    "url": "https://arxiv.org/abs/2502.04479v2",
    "pdf_url": "https://arxiv.org/pdf/2502.04479v2.pdf",
    "title": "Removal of radon progeny from delicate surfaces",
    "abstract": "$^{210}Po$ $α$-decay driven neutron background is a concern for many rare event search experiments. It is a difficult to control background because its radiogenic component depends on the air exposure history of parts. In this study, we demonstrate that about half of the radon progeny $^{210}Po$ can be removed from copper and silicon surfaces relatively easily by wiping a copper sample with acetone wetted tissue and a silicon detector with acetone soaked cotton balls. For a copper sample we demonstrate that long-lived $^{210}Pb$ is removed with similar effectiveness. For copper, allocated the longest counting time, additional wiping was found to be largely ineffective. For silicon, the removal effectiveness has large uncertainties. Additional cleaning showed a small but statistically significant effect. Capitalizing on this trivial cleaning step will allow experiments to relax their requirements on the allowable air exposure time during construction, leading to cost and time savings.",
    "authors": [
      "D. Chernyak",
      "A. Piepke"
    ],
    "published": "2025-02-06T20:08:42Z",
    "updated": "2026-01-19T05:17:16Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1140/epjp/s13360-025-07079-1"
  },
  {
    "arxiv_id": "2509.14906v2",
    "url": "https://arxiv.org/abs/2509.14906v2",
    "pdf_url": "https://arxiv.org/pdf/2509.14906v2.pdf",
    "title": "Multi-color XFEL pulses with variable color separation and time delay for multi-frame diffraction imaging",
    "abstract": "X-ray free-electron lasers (XFELs) of high brightness have opened new opportunities for exploring ultrafast dynamical processes in matter, enabling imaging and movies of single molecules and particles at atomic resolution. In this paper, we present a straightforward method for multi-frame diffraction imaging, using the same electron beam to generate four-color XFEL pulses with adjustable wavelength separation and time delay. The optical klystron scheme is introduced to enhance FEL intensity and reduce the total length of undulators. The time delay is tuned via a magnetic chicane between the undulators with various colors. Using parameters of SHINE, start-to-end simulations demonstrate the effectiveness and tunability of our method, achieving representative results such as time delays of hundreds of femtoseconds and four-color XFEL pulses spanning 1.8 to 2.7 nm with 0.3 nm intervals. The proposed scheme enables the recording of multi-frame diffraction images in a single exposure, providing a new perspective for ultrafast molecular and atomic dynamics studies.",
    "authors": [
      "Xiaodan Liu",
      "Hanxiang Yang",
      "Bingyang Yan",
      "Yue Wang",
      "Nanshun Huang",
      "Liqi Han",
      "Jie Cai",
      "Han Wen",
      "Jinqing Yu",
      "Haixiao Deng",
      "Xueqing Yan"
    ],
    "published": "2025-09-18T12:31:06Z",
    "updated": "2026-01-19T04:51:29Z",
    "categories": [
      "physics.acc-ph",
      "physics.optics"
    ],
    "primary_category": "physics.acc-ph"
  }
]