{
  "arxiv_id": "2510.23001v2",
  "url": "https://arxiv.org/abs/2510.23001v2",
  "pdf_url": "https://arxiv.org/pdf/2510.23001v2.pdf",
  "title": "Search for Invisible Decay Modes in Nuclear Gamma Cascades of a ${}^{46}$Sc Source Using a CsI (Tl) Detector",
  "abstract": "Dark matter remains one of the most compelling open questions in modern physics, motivating extensive searches for new light, weakly coupled particles beyond the Standard Model. Numerous experiments have probed a variety of dark matter candidates using diverse detector technologies, yet large regions of parameter space remain unexplored. In this work, we present a novel high-statistics search for invisible decay modes in nuclear $γ$ cascades, employing approximately 100~kg of CsI(Tl) scintillators at Texas A\\&M University. The key feature of this experiment is the use of a high-activity ${}^{46}$Sc radioactive source combined with a \"missing gamma\" technique, in which the absence of a photon in a well-identified cascade serves as a signature of new physics. Unlike appearance--disappearance experiments, this approach requires only a single photon conversion into a dark-sector particle, thereby enabling sensitivity to weaker couplings. With approximately 1000~hours of data collected using the current setup, no statistically significant excess was observed, consistent with existing constraints on dark-sector candidates such as axions and axion-like particles (ALPs), dark scalars, and dark photons in the sub-MeV mass range. This result highlights the sensitivity of the missing-gamma technique and motivates the development of a larger-scale detector with improved systematic control to extend dark-sector searches into previously unexplored regions of parameter space.",
  "authors": [
    "Sharada Sahoo",
    "Jing-han Chen",
    "Mahdi Mirzakhani",
    "Harikrishnan Ramani",
    "Rupak Mahapatra",
    "Surjeet Rajendran"
  ],
  "published": "2025-10-27T04:37:35Z",
  "updated": "2026-02-07T04:47:34Z",
  "categories": [
    "physics.ins-det",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det"
}