{
  "arxiv_id": "2602.06684v1",
  "url": "https://arxiv.org/abs/2602.06684v1",
  "pdf_url": "https://arxiv.org/pdf/2602.06684v1.pdf",
  "title": "First results from the E302 efficiency$\\unicode{x2013}$instability experiment at the FACET-II facility",
  "abstract": "The beam-breakup (BBU) instability in plasma accelerators is seeded by a transverse offset between the driver and a trailing bunch. The BBU instability induces oscillations in the trailing bunch, which are detrimental to its beam quality. When the instability is large, assuming little mitigation from ion motion and energy spread, the beam suffers emittance growth, and charge can be kicked transversely out of the plasma channel. The detrimental effect on beam quality is substantially worse at high efficiencies, which places constraints on the achievable power efficiency in applications such as linear colliders, where maintaining the beam quality is required. In this paper, we present the first experimental signatures of the BBU instability in data taken in the E302 experiment at the FACET-II facility at SLAC National Accelerator Laboratory. We use a specific beam-optical setup and a novel method to probe for transverse instabilities on diagnostic screens downstream of a magnetic dipole spectrometer. We complement the analysis with full 3D particle-in-cell (PIC) simulations of the plasma interaction using similar driver and trailing bunch parameters on a simulated FACET-II spectrometer.",
  "authors": [
    "O. G. Finnerud",
    "E. Adli",
    "R. Ariniello",
    "S. Corde",
    "T. N. Dalichaouch",
    "C. Emma",
    "S. Gessner",
    "C. Hansel",
    "M. J. Hogan",
    "C. Joshi",
    "D. Kalvik",
    "A. Knetsch",
    "C. A. Lindstrøm",
    "M. Litos",
    "N. Majernik",
    "K. A. Marsh",
    "B. D. O'Shea",
    "I. Rajkovic",
    "S. Rego",
    "D. Storey",
    "C. Zhang"
  ],
  "published": "2026-02-06T13:16:43Z",
  "updated": "2026-02-06T13:16:43Z",
  "categories": [
    "physics.acc-ph",
    "hep-ex"
  ],
  "primary_category": "physics.acc-ph"
}