{
  "arxiv_id": "2602.08743v1",
  "url": "https://arxiv.org/abs/2602.08743v1",
  "pdf_url": "https://arxiv.org/pdf/2602.08743v1.pdf",
  "title": "Preprint: Sheath thickness measurements with the biased plasma impedance probe, Agreement with Child Langmuir scaling",
  "abstract": "Plasma sheaths play a central role in plasma-surface interactions, yet their thickness remains challenging to measure experimentally. Although classical analytical models such as the Child-Langmuir (CL) sheath model provide clear predictions for sheath thickness, experimental validation has been limited because most diagnostics either rely on indirect, multi-step inference (e.g., Langmuir probes) or require invasive and technically demanding techniques. In this work, we demonstrate that the plasma impedance probe (PIP), when operated with a controlled DC bias, enables relatively direct, model-informed measurements of sheath thickness that are reasonably straightforward to implement experimentally. Across a range of discharge conditions, biased-PIP sheath thickness measurements are found to follow CL scaling closely, requiring a single, consistent empirical correction factor of $α\\approx 0.74$ to reconcile the measured thickness with CL predictions. Concurrent measurements of plasma density and electron damping show that probe biasing does not significantly perturb the bulk plasma density, supporting the validity of the biased-PIP approach. Building on this validation, we leverage the empirically determined $α$ factor to extend the floating (unbiased) PIP analysis to obtain model-dependent estimates of electron temperature and plasma potential without electrical biasing. A side-by-side comparison demonstrates close agreement between floating-PIP results and those obtained from a biased Langmuir probe. Taken together, these results establish the PIP as a complementary diagnostic to the Langmuir probe, expanding the range of accessible plasma measurements while providing experimental support for classical sheath models.",
  "authors": [
    "John Whitlock Brooks",
    "Richeek Dutta"
  ],
  "published": "2026-02-09T14:45:52Z",
  "updated": "2026-02-09T14:45:52Z",
  "categories": [
    "physics.plasm-ph",
    "physics.ins-det"
  ],
  "primary_category": "physics.plasm-ph"
}