{
  "arxiv_id": "2602.06329v1",
  "url": "https://arxiv.org/abs/2602.06329v1",
  "pdf_url": "https://arxiv.org/pdf/2602.06329v1.pdf",
  "title": "Shallow Trap States Control Electrical Performance of Amorphous Oxide Semiconductor Thin-Film Transistors",
  "abstract": "The performance of n-type amorphous oxide semiconductor thin-film transistors (TFTs) is largely controlled by the density of states (DoS) near the conduction band mobility edge. Here, the full subgap DoS of amorphous InGaZnO (a-IGZO) TFTs, used in display panels and dynamic random-access memory (DRAM) development, is measured by ultrabroadband photoconduction (UP-DoS) microscopy to within 0.1 eV of the mobility edge. The measured subgap DoS for 25 TFT processing conditions accurately predicts each transfer curve, showing how shallow defect states are electron traps that rigidly tune subthreshold swing, threshold voltage and drift mobility. For a set of TFTs, the subthreshold transfer characteristics can be independently simulated from the experimental shallow defect DoS, with no adjustable parameters. The full transfer curve is simulated by introducing a single parameter: the conduction band tail energy. Additionally, the simulation reveals that the shallow trap density controlling subthreshold behavior can be directly extracted from transfer curves. Finally, a systematic In-enrichment study, combined with DFT+U DoS simulations, enables identification of vacancy cation coordination environments for all experimentally observed subgap peaks. The dominant trap controlling conventional a-IGZO TFT performance is centered at ~0.32 eV below the conduction band mobility edge and is assigned to a Ga-Ga-In oxygen vacancy defect.",
  "authors": [
    "Måns J. Mattsson",
    "Jinhan Lee",
    "Christopher E. Malmberg",
    "Jared Parker",
    "Kyle T. Vogt",
    "Hyemi Kim",
    "Minji Hong",
    "Pilsang Yun",
    "Daewon Ha",
    "Taeyoon Lee",
    "Paul H. -Y. Cheong",
    "John F. Wager",
    "Matt W. Graham"
  ],
  "published": "2026-02-06T02:54:03Z",
  "updated": "2026-02-06T02:54:03Z",
  "categories": [
    "physics.app-ph",
    "cond-mat.mtrl-sci",
    "physics.ins-det"
  ],
  "primary_category": "physics.app-ph"
}