{
  "arxiv_id": "2602.06289v1",
  "url": "https://arxiv.org/abs/2602.06289v1",
  "pdf_url": "https://arxiv.org/pdf/2602.06289v1.pdf",
  "title": "CAGE: An Internal Source Scanning Cryostat for HPGe Characterization",
  "abstract": "The success of current and future-generation neutrinoless double beta decay experiments relies on the ability to eliminate or reduce extraneous backgrounds. In addition to constructing experiments using radiopure materials and handling in underground laboratories, it is necessary to understand and reduce known backgrounds in data analysis. The Large Enriched Germanium Experiment for Neutrinoless double beta Decay is searching for this decay using 76Ge-enriched high-purity germanium detectors submerged in an active liquid argon veto. A significant background in LEGEND is surface events from shallowly-impinging radiation on detector surfaces. In this paper we introduce the Collimated Alphas, Gammas, and Electrons (CAGE) scanning system, an internal-source scanning vacuum cryostat, designed to perform studies of surface events on sensitive surfaces of HPGe in a surface-lab. CAGE features a collimated radionuclide source inside a movable infrared shield that is able to perform precision scans of detector surfaces by utilizing three independent motor stages for source positioning. This allows detailed studies of pulse shapes as a function of source position and incident angle, where defining features can be extracted and exploited for removing surface backgrounds in data analysis in LEGEND. In this paper, we describe CAGE and demonstrate its performance with a commissioning run with 241Am. The commissioning run was completed with the source at normal incidence, and we estimate a beam spot precision of 3.1 mm, which includes positioning uncertainties and the beam-spot size. Using the 59.5 keV gamma population from 241Am, we show that low-energy photon events near the passivated surface feature risetimes that increase with radial distance from the detector center. We suggest a specific metric that can be used to discriminate low-energy gamma backgrounds in LEGEND with similar characteristics.",
  "authors": [
    "G. Othman",
    "C. Wiseman",
    "T. H. Burritt",
    "J. A. Detwiler",
    "M. P. Held",
    "R. Henning",
    "T. Mathew",
    "D. Peterson",
    "W. Pettus",
    "G. Song",
    "T. D. Van Wechel"
  ],
  "published": "2026-02-06T01:06:06Z",
  "updated": "2026-02-06T01:06:06Z",
  "categories": [
    "physics.ins-det",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det"
}