{
  "arxiv_id": "2504.00541v3",
  "url": "https://arxiv.org/abs/2504.00541v3",
  "pdf_url": "https://arxiv.org/pdf/2504.00541v3.pdf",
  "title": "LEP3: A High-Luminosity e+e- Higgs and ElectroweakFactory in the LHC   Tunnel",
  "abstract": "As stated in the 2019 European Strategy for Particle Physics (ESPP), it is of the utmost importance that the HL-LHC upgrade of the accelerator and the experiments be successfully completed in a timely manner. All necessary efforts should be devoted to achieving this goal. We also recall two of the principal recommendations of the 2019 ESPP for future accelerator initiatives, namely that 1) An electron-positron Higgs factory is the highest priority for the next collider (Rec. c). 2) Europe, together with its international partners, should investigate the technical and financial feasibility of a future hadron collider at CERN with a centre-of-mass energy of at least 100 TeV and with an electron-positron Higgs and electroweak factory as a possible first stage (Rec. e). A major objective in particle physics is always to operate an accelerator that allows a leap of an order of magnitude in the constituent centre-of-mass energy with respect to the previous one. We support FCC-ee and FCC-hh as the preferred option for CERN future, as it addresses both of the above recommendations.   The guidance for the 2025 ESPP requests, in addition to the preferred option, the inclusion of ``prioritised alternatives to be pursued if the chosen preferred option turns out not to be feasible or competitive''. Proposed alternatives to the preferred FCC option include linear, muon colliders and LHeC accelerators. In response to this request we propose reusing the existing LHC tunnel for an electron-positron collider, called LEP3, as a back-up alternative if the FCC cannot proceed. LEP3 leverages much of the R\\&D conducted for FCC-ee, offers high-precision studies of Z, W, and Higgs bosons below the tt threshold, and offers potential physics performance comparable or superior to other fallback options at a lower cost while supporting continued R\\&D towards a next-generation energy frontier machine.",
  "authors": [
    "C. Anastopoulos",
    "R. Assmann",
    "A. Ball",
    "O. Bruning",
    "O. Buchmueller",
    "T. Camporesi",
    "P. Collier",
    "J Dainton",
    "G. Davies",
    "J. R. Ellis",
    "B. Goddard",
    "L. Gouskos",
    "M. Klute",
    "M. Koratzinos",
    "G. Landsberg",
    "K. Long",
    "L. Malgeri",
    "F. Maltoni",
    "F. Moortgat",
    "C. Mariotti",
    "S. Myers",
    "J. A. Osborne",
    "M. Pierini",
    "D. R. Tovey",
    "D. Treille",
    "T. S. Virdee",
    "N. Wardle",
    "M. Zanetti"
  ],
  "published": "2025-04-01T08:47:19Z",
  "updated": "2025-11-04T15:25:53Z",
  "categories": [
    "physics.acc-ph",
    "hep-ex",
    "hep-ph"
  ],
  "primary_category": "physics.acc-ph"
}