{
  "arxiv_id": "2508.08533v2",
  "url": "https://arxiv.org/abs/2508.08533v2",
  "pdf_url": "https://arxiv.org/pdf/2508.08533v2.pdf",
  "title": "Transition to Petschek Reconnection in Subrelativistic Pair Plasmas:   Implications for Particle Acceleration",
  "abstract": "While relativistic magnetic reconnection in pair plasmas has emerged in recent years as a candidate for the origin of radiation from extreme astrophysical environments, the corresponding subrelativistic pair plasma regime has remained less explored, leaving open the question of how relativistic physics affects reconnection. In this paper, we investigate the differences between these regimes by contrasting 2D particle-in-cell simulations of reconnection in pair plasmas with relativistic magnetization ($\\sigma \\gg 1$) and subrelativistic magnetization ($\\sigma < 1$). By utilizing unprecedentedly large domain sizes and outflow boundary conditions, we demonstrate that lowering the magnetization results in a change in the reconnection geometry from a plasmoid chain to a Petschek geometry, where laminar exhausts bounded by slow-mode shocks emanate from a single diffusion region. We attribute this change to the reduced plasmoid production rate in the low-$\\sigma$ case: when the secondary tearing rate is sufficiently low, plasmoids are too few in number to prevent the system from relaxing into a stable Petschek configuration. This geometric change also affects particle energization: we show that while high-$\\sigma$ plasmoid chains generate power-law energy spectra, low-$\\sigma$ Petschek exhausts merely heat incoming plasma and yield negligible nonthermal acceleration. These results have implications for predicting the global current sheet geometry and the resulting energy spectrum in a variety of systems.",
  "authors": [
    "Adam Robbins",
    "Anatoly Spitkovsky"
  ],
  "published": "2025-08-12T00:22:43Z",
  "updated": "2025-10-31T23:18:05Z",
  "categories": [
    "physics.plasm-ph",
    "astro-ph.HE"
  ],
  "primary_category": "physics.plasm-ph"
}