{
  "arxiv_id": "2511.02381v1",
  "url": "https://arxiv.org/abs/2511.02381v1",
  "pdf_url": "https://arxiv.org/pdf/2511.02381v1.pdf",
  "title": "Laser diagnostics for negative ion source optimization: insights from   SPIDER at the ITER Neutral Beam Test Facility",
  "abstract": "The ITER Heating Neutral Beams (HNBs) require large, high-energy H/D atom beams (285/330 A/m^2 extracted current density, and 1/0.87 MeV acceleration energy, respectively for H and D). To address the associated challenges, the SPIDER negative ion RF beam source at the Neutral Beam Test Facility (NBTF) in Padova (Italy) serves as a full-scale source prototype with a 100 kV triode accelerator, for design validation and performance verification. SPIDER is equipped with two advanced laser diagnostics to monitor key plasma parameters; Cavity Ring-Down Spectroscopy (CRDS) is used to measure H$^-$\\slash D$^-$ ion densities, while Laser Absorption Spectroscopy (LAS) tracks caesium neutral density in the source. These measurements are essential for optimizing negative ion production and meeting ITER source targets. We present diagnostic upgrade details, recent experimental results, and correlations with other machine parameters. Since CRDS relies on a single 4.637-meter-long optical cavity, the longest used in such sources, it has demonstrated sensitivity to alignment. Based on recent experimental experience, structural improvements are being implemented to enhance both stability and measurement reliability. LAS has mainly been employed as a tool to monitor the caesium conditioning status of SPIDER. Additionally, due to a distributed measurement over four lines of sight, LAS has proven effective in monitoring the caesium distribution within the source. This work demonstrates the essential role of laser diagnostics in developing ITER-relevant plasma sources and informs ongoing efforts to improve measurement accuracy in challenging environments.",
  "authors": [
    "R. Agnello",
    "M. Barbisan",
    "R. Pasqualotto",
    "B. Pouradier-Duteil",
    "E. Sartori",
    "A. Tiso",
    "B. Zaniol"
  ],
  "published": "2025-11-04T09:03:09Z",
  "updated": "2025-11-04T09:03:09Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}