{
  "arxiv_id": "2511.00320v1",
  "url": "https://arxiv.org/abs/2511.00320v1",
  "pdf_url": "https://arxiv.org/pdf/2511.00320v1.pdf",
  "title": "Quantifying the Full Damage Profile of Focused Ion Beams via 4D-STEM   Precession Electron Diffraction and PSNR Metrics",
  "abstract": "Focused ion beams (FIBs) are widely used in nanofabrication for applications such as circuit repair, ultra-thin lamella preparation, strain engineering, and quantum device prototyping. Although the lateral spread of the ion beam is often overlooked, it becomes critical in precision tasks such as impurity placement in host substrates, where accurate knowledge of the ion-matter interaction profile is essential. Existing techniques typically characterise only the beam core, where most ions land, thus underestimating the full extent of the point spread function (PSF). In this work, we use four-dimensional scanning transmission electron microscopy (4D-STEM) to resolve the ion beam tail at defect densities equivalent to $<$0.1 ions nm$^{-2}$. Convergent beam electron diffraction (CBED) patterns were collected in calibration regions with known ion fluence and compared to patterns acquired around static dwell spots exposed to a 30 keV Ga$^{+}$ beam for 1-10 s. Cross-correlation using peak signal-to-noise ratio (PSNR) revealed that 4D-STEM datasets are ultra-sensitive for defect quantification and more robust against scanning artefacts than conventional dark-field imaging. This approach is complementary to image resolution methods enabling a comprehensive profiling of ion-induced damage even at low-dose regimes, offering a more accurate representation of FIB performance and supporting application tailoring beyond the conventional resolution metrics focused solely on the beam core.",
  "authors": [
    "M. G. Masteghin",
    "Z. P. Aslam",
    "A. P. Brown",
    "M. J. Whiting",
    "S. K. Clowes",
    "R. P. Webb",
    "D. C. Cox"
  ],
  "published": "2025-10-31T23:38:41Z",
  "updated": "2025-10-31T23:38:41Z",
  "categories": [
    "physics.ins-det",
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "physics.ins-det"
}