{
  "arxiv_id": "2511.02092v1",
  "url": "https://arxiv.org/abs/2511.02092v1",
  "pdf_url": "https://arxiv.org/pdf/2511.02092v1.pdf",
  "title": "Uncertainty Guided Online Ensemble for Non-stationary Data Streams in   Fusion Science",
  "abstract": "Machine Learning (ML) is poised to play a pivotal role in the development and operation of next-generation fusion devices. Fusion data shows non-stationary behavior with distribution drifts, resulted by both experimental evolution and machine wear-and-tear. ML models assume stationary distribution and fail to maintain performance when encountered with such non-stationary data streams. Online learning techniques have been leveraged in other domains, however it has been largely unexplored for fusion applications. In this paper, we present an application of online learning to continuously adapt to drifting data stream for prediction of Toroidal Field (TF) coils deflection at the DIII-D fusion facility. The results demonstrate that online learning is critical to maintain ML model performance and reduces error by 80% compared to a static model. Moreover, traditional online learning can suffer from short-term performance degradation as ground truth is not available before making the predictions. As such, we propose an uncertainty guided online ensemble method to further improve the performance. The Deep Gaussian Process Approximation (DGPA) technique is leveraged for calibrated uncertainty estimation and the uncertainty values are then used to guide a meta-algorithm that produces predictions based on an ensemble of learners trained on different horizon of historical data. The DGPA also provides uncertainty estimation along with the predictions for decision makers. The online ensemble and the proposed uncertainty guided online ensemble reduces predictions error by about 6%, and 10% respectively over standard single model based online learning.",
  "authors": [
    "Kishansingh Rajput",
    "Malachi Schram",
    "Brian Sammuli",
    "Sen Lin"
  ],
  "published": "2025-11-03T22:03:37Z",
  "updated": "2025-11-03T22:03:37Z",
  "categories": [
    "cs.LG",
    "cs.AI",
    "physics.plasm-ph"
  ],
  "primary_category": "cs.LG"
}