{
  "arxiv_id": "2511.00354v1",
  "url": "https://arxiv.org/abs/2511.00354v1",
  "pdf_url": "https://arxiv.org/pdf/2511.00354v1.pdf",
  "title": "Experimental investigation of plasma-electrode interactions on the   ZaP-HD sheared-flow-stabilized Z-pinch device",
  "abstract": "The ZaP-HD sheared-flow-stabilized (SFS) Z-pinch device is a testbed for experimental investigation of plasma-electrode interactions. The graphite electrode is exposed to a high temperature, high density Z-pinch plasma while supplying large pinch currents. In-situ measurements of the gross carbon erosion flux obtained with S/XB spectroscopy exceed the expected flux from physical sputtering, but have reasonable agreement with the expected sublimation flux. Comparison of the ionization mean free paths of neutrals produced through both erosion processes shows that sublimated carbon is ionized within the sheath while sputtered carbon is ionized beyond the sheath. This suggests a process of electrode recycling and self-healing through redeposition. The sputtered carbon is primarily responsible for net erosion. Ex-situ analysis of electrode material is enabled by the design of a removable coupon. Three different plasma exposure conditions varied the pinch current and number of pulses. Net mass loss measurements support the physical picture of electrode recycling. Erosion rates range from 0.01 to 0.1 mg/C, which are comparable to existing arc discharge devices. Measurements of the microscopic surface morphology and roughness reveal irregular consolidated structures and general smoothing except at high particle fluence. Crack formation suggests the importance of repetitive thermal cycles. Definitive features of sputtering such as pitting and cratering are absent, although further study is needed to attribute the observed changes to other processes. These results indicate some alignment with erosion processes in high-powered arc discharges, which successfully operate solid electrodes in extreme environments. This provides confidence in managing electrode erosion in the SFS Z-pinch configuration.",
  "authors": [
    "Amierul Aqil Khairi",
    "Uri Shumlak"
  ],
  "published": "2025-11-01T01:36:34Z",
  "updated": "2025-11-01T01:36:34Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}