[
  {
    "arxiv_id": "2510.08441v1",
    "url": "https://arxiv.org/abs/2510.08441v1",
    "pdf_url": "https://arxiv.org/pdf/2510.08441v1.pdf",
    "title": "Silicon Wafer Fracture Stress for Tracking Sensors in Particle Physics   Experiments",
    "abstract": "For the construction of the ATLAS Inner Tracker strip detector, silicon strip sensor modules are glued directly onto carbon fibre support structures using a soft silicone gel. During tests at temperatures below \\unit[-35]{$^{\\circ}$C}, several of the sensors were found to crack due to a mismatch in coefficients of thermal expansion between polyimide circuit boards with copper metal layers (glued onto the sensor) and the silicon sensor itself. While module assembly procedures were developed to minimise variations between modules, cold tests showed a wide range of temperatures at which supposedly comparable modules failed. The observed variance (fracture temperatures between \\unit[-35]{\\textcelsius} and \\unit[-70]{\\textcelsius}) for supposedly comparable modules suggests an undetected variation between modules suspected to be intrinsic to the silicon wafer itself. Therefore, a test programme was developed to investigate the fracture stress of representative sensor wafer cutoffs. This paper presents results for the fracture stress of silicon sensors used in detector modules.",
    "authors": [
      "Haider Abidi",
      "Vitaliy Fadeyev",
      "Tim Jones",
      "Akhil Kumar",
      "Tom Lee",
      "Luise Poley",
      "Craig Sawyer",
      "Giorgio Vallone",
      "Sven Wonsak"
    ],
    "published": "2025-10-09T16:52:31Z",
    "updated": "2025-10-09T16:52:31Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/10/P10020"
  },
  {
    "arxiv_id": "2508.08981v2",
    "url": "https://arxiv.org/abs/2508.08981v2",
    "pdf_url": "https://arxiv.org/pdf/2508.08981v2.pdf",
    "title": "A 28nm Multiply-Accumulate ASIC Architecture for On-Chip Data   Compression in MHz Frame Rate X-ray and Electron Pixel Detectors",
    "abstract": "Modern X-ray detector systems urgently require compact, efficient, and fast data compression schemes to handle the transmission of big data from pixel arrays, enabling frame rates in the MHz regime. In this work, a data compression ASIC that implements a streaming fixed-length lossy compression scheme is introduced and analyzed, proving the feasibility and benefits of on-chip compression. The compression scheme utilizes a vector matrix product logic, which performs a number of floating-point multiplications, additions, and accumulations. The logic is verified, synthesized, and shown to fit in the area resource available for the X-ray detector under study, which comprises 192 x 168 pixels each of 12-bit width, and having a total area of 20 mm x 20 mm, about 2 mm x 20 mm of which are available for the digital logic. Several system architectures, precisions, and compression ratios ranging from 100 to 250 were analyzed to pave the way for on-chip fixed-length compression (e.g., principal component analysis, singular value decomposition) and data reduction (e.g., azimuthal integration) for X-ray and electron detectors.",
    "authors": [
      "Rami Rasheedi",
      "Nicholas Contini",
      "Mohamed Adel Gharib",
      "Sebastian Strempfer",
      "Senthil Gnanasekaran",
      "Salma Abdelzaher",
      "Tejas Guruswamy",
      "Kazutomo Yoshii",
      "Mike Hammer",
      "Henry Shi",
      "Yu-Sheng Chen",
      "Lorenzo Rota",
      "Dionisio Doering",
      "Angelo Dragone",
      "Tao Zhou",
      "Antonino Miceli"
    ],
    "published": "2025-08-12T14:47:43Z",
    "updated": "2025-10-09T15:21:05Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.08285v1",
    "url": "https://arxiv.org/abs/2510.08285v1",
    "pdf_url": "https://arxiv.org/pdf/2510.08285v1.pdf",
    "title": "Simulation of the thermoelectric effect in a multi-metallic   superconducting cavity",
    "abstract": "Superconducting radio frequency accelerating cavities made with different material layers, such as copper, Nb or Nb3Sn, are susceptible to thermoelectric effects due to differences in Seebeck coefficients between the metals. A temperature gradient across the surfaces can drive thermoelectric currents, which may impact the cavity performance. A layered Cu/Nb/Nb3Sn single cell cavity was tested with cryocoolers in 2022. Three heaters were mounted on the cavity surface at different locations and three single axis cryogenic fluxgate magnetometers were attached close to the cavity equator. A linear increase in the magnetic field was measured while increasing the heaters power. The cavity setup was analysed with COMSOL and the results showed a trend similar to that observed in the experiment. This contribution details the approach chosen for the simulation and some of the challenges encountered.",
    "authors": [
      "N. K. Raut",
      "N. Stilin",
      "J. Vennekate",
      "S. Wang",
      "G. Ciovati"
    ],
    "published": "2025-10-09T14:35:16Z",
    "updated": "2025-10-09T14:35:16Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.18429/JACoW-NAPAC2025-THP070"
  },
  {
    "arxiv_id": "2501.01869v2",
    "url": "https://arxiv.org/abs/2501.01869v2",
    "pdf_url": "https://arxiv.org/pdf/2501.01869v2.pdf",
    "title": "Dual formulation of the maximum entropy method applied to analytic   continuation of quantum Monte Carlo data",
    "abstract": "Many fields of physics use quantum Monte Carlo techniques, but struggle to estimate dynamic spectra via the analytic continuation of imaginary-time quantum Monte Carlo data. One of the most ubiquitous approaches to analytic continuation is the maximum entropy method (MEM). We supply a dual Newton optimization algorithm to be used within the MEM and provide analytic bounds for the algorithm's error. The MEM is typically used with Bryan's controversial algorithm [Rothkopf, \"Bryan's Maximum Entropy Method\" Data 5.3 (2020)]. We present new theoretical issues that are not yet in the literature. Our algorithm has all the theoretical benefits of Bryan's algorithm without these theoretical issues. We compare the MEM with Bryan's optimization to the MEM with our dual Newton optimization on test problems from lattice quantum chromodynamics and plasma physics. These comparisons show that in the presence of noise the dual Newton algorithm produces better estimates and error bars; this indicates the limits of Bryan's algorithm's applicability. We use the MEM to investigate authentic quantum Monte Carlo data for the uniform electron gas at warm dense matter conditions and further substantiate the roton-type feature in the dispersion relation.",
    "authors": [
      "Thomas Chuna",
      "Nicholas Barnfield",
      "Tobias Dornheim",
      "Michael P. Friedlander",
      "Tim Hoheisel"
    ],
    "published": "2025-01-03T15:36:35Z",
    "updated": "2025-10-09T13:09:44Z",
    "categories": [
      "physics.comp-ph",
      "hep-lat",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.comp-ph",
    "doi": "10.1088/1751-8121/adf924"
  },
  {
    "arxiv_id": "2503.22220v2",
    "url": "https://arxiv.org/abs/2503.22220v2",
    "pdf_url": "https://arxiv.org/pdf/2503.22220v2.pdf",
    "title": "Machine learning based parametrization of the resolution function for   the first experimental area (EAR1) of the n_TOF facility at CERN",
    "abstract": "This study addresses a challenge of parametrizing a resolution function of the neutron beam from the neutron time of flight facility n_TOF at CERN. A difficulty stems from a fact that a resolution function exhibits rather strong variations in shape, over approximately 10 orders of magnitude in neutron energy. In order to avoid a need for a manual identification of the appropriate analytical forms - hindering past attempts at its parametrization - we take advantage of the versatile machine learning techniques. In particular, we parametrize it by training a multilayer feedforward neural network, relying on a key idea that such networks act as the universal approximators. The proof of concept is presented for a resolution function for the first experimental area of the n_TOF facility, from the third phase of its operation. We propose an optimal network structure for a resolution function in question, which is also expected to be optimal or near-optimal for other experimental areas and for different phases of n_TOF operation. In order to reconstruct several resolution function forms in common use from a single parametrized form, we provide a practical tool in the form of a specialized C++ class encapsulating the computationally efficient procedures suited to the task. Specifically, the class allows an application of a user-specified temporal spread of a primary proton beam (from a neutron production process at n_TOF) to a desired resolution function form.",
    "authors": [
      "Petar Žugec",
      "Marta Sabate Gilarte",
      "Michael Bacak",
      "Vasilis Vlachoudis",
      "Adria Casanovas",
      "Francisco Garcia Infantes"
    ],
    "published": "2025-03-28T08:12:34Z",
    "updated": "2025-10-09T11:32:45Z",
    "categories": [
      "physics.comp-ph",
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "physics.comp-ph",
    "doi": "10.1007/s41365-025-01820-2"
  },
  {
    "arxiv_id": "2507.20523v3",
    "url": "https://arxiv.org/abs/2507.20523v3",
    "pdf_url": "https://arxiv.org/pdf/2507.20523v3.pdf",
    "title": "Multi-Machine Scaling Laws for Fuel and Impurity Puffing Rates   Sufficient for Detachment Access: a Systematic Review of Magnetic Confinement   Fusion Devices",
    "abstract": "An open-source database encompassing 457 experimental and numerical entries from 32 machines among solid-walled tokamaks, stellarators and linear plasma devices is assembled. From there, we derive physics-informed multi-machine scaling laws predictive of fuel and impurity puffing rates sufficient to access plasma detachment -- leading candidate for a reactor-relevant solution to the open issue of plasma-wall interaction. Validation of our laws in up to 40 plasmas in low- and high-confinement mode also featuring advanced configurations demonstrates accuracy within a factor 1.5 in up to 50% of the instances, and within a factor 2 on average. Divertor volume alone is found to correlate to fuelling. The addition of plasma opaqueness leads to the empirically-calibrated law $\\Gamma_{\\text{D}}\\propto [n_{\\text{sep}}\\times a\\times(S_{\\text{div}}/V_{\\text{div}})^{-1.5}]^{1.05}$ valid across all toroidal devices. Its simplification to $\\Gamma_{\\text{D}}^{\\text{HDL}}\\propto 0.43\\times a^{1.58}\\times\\lambda_q^{-0.89}$ avoids a dependence on $n_{\\text{sep}}$ and bears intrinsic significance provided by the H/L density limit and the power fall-off length. Non-linearities of the impurity dynamics manifest in the seeding rate -- which the present work identifies both a generalised formula for, and the Greenwald-Eich-Scarabosio simplification $\\Gamma_{\\text{Z}}^{\\text{GES}}\\propto a^{1.51}\\times\\lambda_q^{-0.27}$. Similar relationships are defined for stellarators, closely following the mainstream but without providing data for validation -- which should stimulate further investigations. In the era of nuclear fusion reactor design, these results find immediate applicability in informing reactor fuel cycle design and edge plasma modelling. More generally, this study demonstrates that physics-based 0D laws able to relate detachment to the engineering actuators exist.",
    "authors": [
      "M. Moscheni",
      "A. Herrmann",
      "R. Kembleton",
      "M. Kryjak",
      "S. Lazerson",
      "F. Levi",
      "M. Siccinio",
      "P. Staniec",
      "T. Giegerich",
      "C. Tantos",
      "the Gauss Fusion GmbH Team"
    ],
    "published": "2025-07-28T05:11:10Z",
    "updated": "2025-10-09T09:40:59Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.06703v2",
    "url": "https://arxiv.org/abs/2510.06703v2",
    "pdf_url": "https://arxiv.org/pdf/2510.06703v2.pdf",
    "title": "Developing a Cost-Effective Spectrometer: A Practical Approach",
    "abstract": "The paper demonstrates the design and execution of a low-cost optical spectrometer that employs a webcam, diffraction grating & Python (a free, open-source programming language). The device's design prioritized economy and usability, with a black box casing to reduce stray light and increase measurement accuracy. A diffraction grating made from a DVD was used to split light into its constituent wavelengths, which were then collected by the camera. The calibration procedure used a RED TIDE USB650 Fiber Optic Spectrometer to set calibration values for various wavelength ranges, which ensured that the spectrometer's results closely matched those derived from the former, a high-cost industry-standard model. Spectrums of several light sources, such as red, green, blue, yellow, white, magenta, orange, and UV LEDs, as well as a green laser, were studied and compared. The results showed a high level of precision, with minimal divergence from industry-standard spectrometer measurements. This comparison was carried out utilizing Origin software, which allowed for extensive analysis and display of the spectrum data. In addition, the spectrometer captured data in real time, allowing users to watch live spectrum changes and ensure instant accessibility of results. Despite its simplicity and low cost, the spectrometer provides significant value for instructional and practical applications, making it a valuable tool in cost-constrained situations.",
    "authors": [
      "Mohammad Tahsin Alam",
      "Zafrin Jahan Nikita",
      "Yasir Mahmud",
      "Sheikh Hasib Cheragee",
      "Redwanul Talukder Zeem"
    ],
    "published": "2025-10-08T06:58:18Z",
    "updated": "2025-10-09T07:31:54Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2510.07875v1",
    "url": "https://arxiv.org/abs/2510.07875v1",
    "pdf_url": "https://arxiv.org/pdf/2510.07875v1.pdf",
    "title": "Ion Stochastic Heating by Low-frequency Alfvén Wave Spectrum",
    "abstract": "Finite-amplitude low-frequency Alfv\\'en waves are commonly found in plasma environments, such as space plasmas, and play a crucial role in ion heating. The nonlinear interaction between oblique Alfv\\'en wave spectra and ions has been studied. As the number of wave modes increases, ions are more likely to exhibit chaotic motion and experience stochastic heating. The stochastic heating threshold in the parameter space can be characterized by a single parameter, the effective relative curvature radius $P_{{eff.}}$. The results show excellent agreement with the chaotic regions identified through test particle simulations. The anisotropic characteristics of stochastic heating are explained using a uniform solid angle distribution model. The stochastic heating rate $Q=\\dot{T}$ is calculated, and its relationship with wave conditions is expressed as $Q/(\\Omega_i m_i v_A^2) = H(\\alpha) \\tilde{v}^3 \\tilde{B}_w^2 \\tilde{\\omega}_1$, where $\\alpha$ is propagating angle, $\\Omega_i$ is the gyrofrequency, $m_i$ is the ion mass, $v_A$ is the Alfv\\'en speed, $\\tilde{v}$ is the dimensionless speed, $\\tilde{B}_w$ is the dimensionless wave amplitude, and $\\tilde{\\omega}_1$ is the lowest dimensionless wave frequency.",
    "authors": [
      "Jingyu Peng",
      "Jiansen He"
    ],
    "published": "2025-10-09T07:26:29Z",
    "updated": "2025-10-09T07:26:29Z",
    "categories": [
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.07849v1",
    "url": "https://arxiv.org/abs/2510.07849v1",
    "pdf_url": "https://arxiv.org/pdf/2510.07849v1.pdf",
    "title": "Full-wave computation of SUb-atmospheric Radio-frequency Engine (SURE)",
    "abstract": "Near-space, which covers altitudes from 20 to 100 kilometers, has been receiving more and more attention because of its special strategic value. Airships and high-altitude balloons are two common types of low-speed vehicles that operate in this region. They can be used for jobs like monitoring, communication, and remote sensing, but they need efficient propulsion systems to work well. Earlier, we proposed a new type of electric propulsion system that can ionize the surrounding air to create plasma and produce thrust for near-space vehicles. However, in past experiments, not enough was known about how certain parameters affect power absorption and electromagnetic behavior. Therefore, in this study, we used computer simulations to examine how gas pressure (200 to 1000 Pa), input power (200 to 600 W), frequency (13.56 to 52.24 MHz), and different gas types ($Ar$, $N_2$, $H_2$, $He$) influence inductively coupled plasma inside a quartz tube. We especially focused on comparing two antenna designs: one with a single turn and one with five turns. In all the simulations, the single-turn antenna consistently absorbed power better than the five-turns antenna. Higher frequencies significantly influence both plasma power absorption and magnetic field characteristics. The optimal power absorption occurs at a filling gas pressure of 400 Pa. When varying the input power, we observed an initial decrease followed by an increasing trend, which may be related to ionization mechanisms. In comparisons among different gas types, the inelastic collision mechanisms in molecular gases lead to a notable reduction in plasma power absorption efficiency. The results from this work will help guide the design of future experiments for this electric propulsion concept.",
    "authors": [
      "Dingzhou Li",
      "Lei Chang",
      "Ye Tao"
    ],
    "published": "2025-10-09T06:48:28Z",
    "updated": "2025-10-09T06:48:28Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.07800v1",
    "url": "https://arxiv.org/abs/2510.07800v1",
    "pdf_url": "https://arxiv.org/pdf/2510.07800v1.pdf",
    "title": "Constraints on inelastic dark matter from the CDEX-1B experiment",
    "abstract": "We present limits on spin-independent inelastic WIMP-nucleus scattering using the 737.1 kg $\\cdot$ day dataset from the CDEX-1B experiment. Expected nuclear recoil spectra for various inelastic WIMP masses $m_\\chi$ and mass splittings $\\delta$ are calculated under the standard halo model. An accurate background model of CDEX-1B is constructed by simulating all major background sources. The model parameters are then determined through maximum likelihood estimation and Markov Chain Monte Carlo fitting. The resulting 90\\% confidence level upper limits on the WIMP-nucleon cross section $\\sigma_{\\mathrm{n}}$ exclude certain DAMA/LIBRA allowed regions: the $\\chi^2 < 4$ regions for $\\delta < 30$ keV at $m_\\chi = 250$ GeV and the $\\chi^2 < 9$ region for $\\delta < 50$ keV at $m_\\chi = 500$ GeV. The method is applicable to other inelastic dark matter scenarios, and the upcoming CDEX-50 experiment is expected to improve sensitivity by four orders of magnitude.",
    "authors": [
      "Y. F. Liang",
      "L. T. Yang",
      "Q. Yue",
      "K. J. Kang",
      "Y. J. Li",
      "H. P. An",
      "Greeshma C.",
      "J. P. Chang",
      "H. Chen",
      "Y. H. Chen",
      "J. P. Cheng",
      "J. Y. Cui",
      "W. H. Dai",
      "Z. Deng",
      "Y. X. Dong",
      "C. H. Fang",
      "H. Gong",
      "Q. J. Guo",
      "T. Guo",
      "X. Y. Guo",
      "L. He",
      "J. R. He",
      "H. X. Huang",
      "T. C. Huang",
      "S. Karmakar",
      "Y. S. Lan",
      "H. B. Li",
      "H. Y. Li",
      "J. M. Li",
      "J. Li",
      "M. C. Li",
      "Q. Y. Li",
      "R. M. J. Li",
      "X. Q. Li",
      "Y. L. Li",
      "B. Liao",
      "F. K. Lin",
      "S. T. Lin",
      "J. X. Liu",
      "R. Z. Liu",
      "S. K. Liu",
      "Y. D. Liu",
      "Y. Liu",
      "Y. Y. Liu",
      "H. Ma",
      "Y. C. Mao",
      "A. Mureed",
      "H. Pan",
      "N. C. Qi",
      "J. Ren",
      "X. C. Ruan",
      "M. B. Shen",
      "H. Y. Shi",
      "M. K. Singh",
      "T. X. Sun",
      "W. L. Sun",
      "C. J. Tang",
      "Y. Tian",
      "H. F. Wan",
      "G. F. Wang",
      "J. Z. Wang",
      "L. Wang",
      "Q. Wang",
      "Q. Wang",
      "Y. F. Wang",
      "Y. X. Wang",
      "H. T. Wong",
      "Y. C. Wu",
      "H. Y. Xing",
      "K. Z. Xiong",
      "R. Xu",
      "Y. Xu",
      "T. Xue",
      "Y. L. Yan",
      "N. Yi",
      "C. X. Yu",
      "H. J. Yu",
      "X. Yu",
      "M. Zeng",
      "Z. Zeng",
      "F. S. Zhang",
      "P. Zhang",
      "P. Zhang",
      "Z. Y. Zhang",
      "M. G. Zhao",
      "J. F. Zhou",
      "Z. Y. Zhou",
      "J. J. Zhu"
    ],
    "published": "2025-10-09T05:29:23Z",
    "updated": "2025-10-09T05:29:23Z",
    "categories": [
      "hep-ex",
      "hep-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2510.07792v1",
    "url": "https://arxiv.org/abs/2510.07792v1",
    "pdf_url": "https://arxiv.org/pdf/2510.07792v1.pdf",
    "title": "Aluminum-Based Superconducting Tunnel Junction Sensors for Nuclear   Recoil Spectroscopy",
    "abstract": "The BeEST experiment is searching for sub-MeV sterile neutrinos by measuring nuclear recoil energies from the decay of $^7$Be implanted into superconducting tunnel junction (STJ) sensors. The recoil spectra are affected by interactions between the radioactive implants and the sensor materials. We are therefore developing aluminum-based STJs (Al-STJs) as an alternative to existing tantalum devices (Ta-STJs) to investigate how to separate material effects in the recoil spectrum from potential signatures of physics beyond the Standard Model. Three iterations of Al-STJs were fabricated. The first had electrode thicknesses similar to existing Ta-STJs. They had low responsivity and reduced resolution, but were used successfully to measure $^7$Be nuclear recoil spectra. The second iteration had STJs suspended on thin SiN membranes by backside etching. These devices had low leakage current, but also low yield. The final iteration was not backside etched, and the Al-STJs had thinner electrodes and thinner tunnel barriers to increase signal amplitudes. These devices achieved 2.96 eV FWHM energy resolution at 50 eV using a pulsed 355 nm (~3.5 eV) laser. These results establish Al-STJs as viable detectors for systematic material studies in the BeEST experiment.",
    "authors": [
      "Spencer L. Fretwell",
      "Connor Bray",
      "Inwook Kim",
      "Andrew Marino",
      "Benjamin Waters",
      "Robin Cantor",
      "Ad Hall",
      "Pedro Amaro",
      "Adrien Andoche",
      "David Diercks",
      "Abigail Gillespie",
      "Mauro Guerra",
      "Cameron N. Harris",
      "Jackson T. Harris",
      "Leendert M. Hayen",
      "Paul Antoine Hervieux",
      "Geon Bo Kim",
      "Annika Lennarz",
      "Vincenzo Lordi",
      "Jorge Machado",
      "Peter Machule",
      "David McKeen",
      "Xavier Mougeot",
      "Francisco Ponce",
      "Chris Ruiz",
      "Amit Samanta",
      "José Paulo Santos",
      "Joseph Smolsky",
      "Caitlyn Stone-Whitehead",
      "Joseph Templet",
      "William K. Warburton",
      "K. G. Leach",
      "S. Friedrich"
    ],
    "published": "2025-10-09T05:11:47Z",
    "updated": "2025-10-09T05:11:47Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.07690v1",
    "url": "https://arxiv.org/abs/2510.07690v1",
    "pdf_url": "https://arxiv.org/pdf/2510.07690v1.pdf",
    "title": "Lithographic integration of TES microcalorimeters with SQUID multiplexer   circuits for large format spectrometers",
    "abstract": "Arrays of hundreds or thousands of low temperature detectors have been deployed for many experiments, both bolometers for long wavelength applications and calorimeters for shorter wavelength applications. One challenge that is common to many of these arrays is the efficient use of focal plane area to achieve a large fill fraction of absorbers coupled to detectors. We are developing an integrated fabrication of soft X-ray transition edge sensors (TES) and microwave SQUID multiplexers ($\\mu$MUX) with the goal of maximizing the fill fraction of the focal plane area on a scale of many thousand pixel detectors. We will utilize lithographically defined high density interconnects to circumvent limitations in existing solutions that use wirebonds or flip-chip bonds. Here we report the first demonstration of combining TES and $\\mu$MUX processes into a single TES-System-on-a-Chip (TES-SoC) fabrication on a silicon wafer. The $\\mu$MUX SQUIDs and TES electrothermal feedback circuits are microfabricated first and protected with passivating SiO$_2$, then the TES devices and TES-to-SQUID interconnects are fabricated, and finally the protective layer is removed before the fabrication of the microwave resonators. We show that the microwave SQUIDs are functional and have reasonable yield, and that we are able to read out the transition temperature of the connected TESs using those SQUIDs.",
    "authors": [
      "Robinjeet Singh",
      "Avirup Roy",
      "Daniel Becker",
      "Johnathan D. Gard",
      "Mark W. Keller",
      "John A. B. Mates",
      "Kelsey M. Morgan",
      "Nathan J. Ortiz",
      "Daniel R. Schmidt",
      "Daniel S. Swetz",
      "Joel N. Ullom",
      "Leila R. Vale",
      "Michael Vissers",
      "Galen C. O'Neil",
      "Joel C. Weber"
    ],
    "published": "2025-10-09T02:28:24Z",
    "updated": "2025-10-09T02:28:24Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.supr-con",
      "physics.app-ph",
      "quant-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.07603v1",
    "url": "https://arxiv.org/abs/2510.07603v1",
    "pdf_url": "https://arxiv.org/pdf/2510.07603v1.pdf",
    "title": "12th Low-Level RF Workshop (LLRF2025)",
    "abstract": "This volume contains contributions submitted to the 12th Low-Level RF Workshop which will be held in Newport News, Virginia, USA on October 12-16, 2025. This workshop continues the series of successful international workshops held in Newport News, USA (2001), Geneva, Switzerland (2005), Knoxville, USA (2007), Tsukuba, Japan (2009), Hamburg, Germany (2011), Tahoe City, USA (2013), Shanghai, China (2015), Barcelona, Spain (2017), Chicago, USA (2019), Brugg-Windisch, Switzerland (2022), and Gyeongju, South Korea (2023).",
    "authors": [
      "Dmitry Teytelman"
    ],
    "published": "2025-10-08T22:49:38Z",
    "updated": "2025-10-08T22:49:38Z",
    "categories": [
      "physics.acc-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.07510v1",
    "url": "https://arxiv.org/abs/2510.07510v1",
    "pdf_url": "https://arxiv.org/pdf/2510.07510v1.pdf",
    "title": "Efficient Radiofrequency Sensing with Fluorescence Encoding",
    "abstract": "Optically-active spin qubits have emerged as powerful quantum sensors capable of nanoscale magnetometry, yet conventional coherent sensing approaches are ultimately limited by the coherence time of the sensor, typically precluding detection in the sub-MHz regime. We present a broadly applicable fluorescence-encoding method that circumvents coherence-time constraints by transducing time-varying magnetic fields directly into modulated fluorescence signals. Using nitrogen-vacancy centers in diamond as a model system, we demonstrate shot-noise-limited sensitivity for AC magnetic fields spanning near-DC to MHz frequencies, with detection bandwidth tunable via optical excitation power. The technique captures complete spectral information in a single measurement, eliminating the need for point-by-point frequency scanning, and allows phase-sensitive multi-frequency detection with Hz-level resolution. This approach transforms quantum sensors into atomic-scale spectrum analyzers, with immediate applications for low-frequency RF communication, zero-field NMR, and bioelectronic sensing. Our approach is broadly applicable to the expanding class of optically-active spin qubits, including molecular systems and fluorescent proteins, opening new sensing regimes previously inaccessible to coherent techniques",
    "authors": [
      "Nicole Voce",
      "Paul Stevenson"
    ],
    "published": "2025-10-08T20:17:23Z",
    "updated": "2025-10-08T20:17:23Z",
    "categories": [
      "quant-ph",
      "physics.ins-det"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2510.07502v1",
    "url": "https://arxiv.org/abs/2510.07502v1",
    "pdf_url": "https://arxiv.org/pdf/2510.07502v1.pdf",
    "title": "Does Turbulence at the Correlation Scale Regulate the Statistics of   Magnetic Reconnection?",
    "abstract": "We study the statistics of dynamical quantities associated with magnetic reconnection events embedded in a sea of strong background magnetohydrodynamic (MHD) turbulence using direct numerical simulations. We focus on the relationship of the reconnection properties to the statistics of global turbulent fields. For the first time, we show that the distribution in turbulence of reconnection rates (determined by upstream fields) is strongly correlated with the magnitude of the global turbulent magnetic field at the correlation scale. The average reconnection rates, and associated dissipation rates, during turbulence are thus much larger than predicted by using turbulent magnetic field fluctuation amplitudes at the dissipation or kinetic scales. Magnetic reconnection may therefore be playing a major role in energy dissipation in astrophysical and heliospheric turbulence.",
    "authors": [
      "M. B. Khan",
      "M. A. Shay",
      "S. Oughton",
      "W. H. Matthaeus",
      "C. C. Haggerty",
      "S. Adhikari",
      "P. A. Cassak",
      "S. Fordin",
      "D. O'Donnell",
      "Y. Yang",
      "R. Bandyopadhyay",
      "S. Roy"
    ],
    "published": "2025-10-08T19:56:03Z",
    "updated": "2025-10-08T19:56:03Z",
    "categories": [
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.07485v1",
    "url": "https://arxiv.org/abs/2510.07485v1",
    "pdf_url": "https://arxiv.org/pdf/2510.07485v1.pdf",
    "title": "In-pixel integration of signal processing and AI/ML based data filtering   for particle tracking detectors",
    "abstract": "We present the first physical realization of in-pixel signal processing with integrated AI-based data filtering for particle tracking detectors. Building on prior work that demonstrated a physics-motivated edge-AI algorithm suitable for ASIC implementation, this work marks a significant milestone toward intelligent silicon trackers. Our prototype readout chip performs real-time data reduction at the sensor level while meeting stringent requirements on power, area, and latency. The chip is taped-out in 28nm TSMC CMOS bulk process, which has been shown to have sufficient radiation hardness for particle experiments. This development represents a key step toward enabling fully on-detector edge AI, with broad implications for data throughput and discovery potential in high-rate, high-radiation environments such as the High-Luminosity LHC.",
    "authors": [
      "Benjamin Parpillon",
      "Anthony Badea",
      "Danush Shekar",
      "Christian Gingu",
      "Giuseppe Di Guglielmo",
      "Tom Deline",
      "Adam Quinn",
      "Michele Ronchi",
      "Benjamin Weiss",
      "Jennet Dickinson",
      "Jieun Yoo",
      "Corrinne Mills",
      "Daniel Abadjiev",
      "Eric You",
      "Mira Littmann",
      "Karri DiPetrillo",
      "Arghya Ranjan Das",
      "Mia Liu",
      "David Jiang",
      "Mark S. Neubauer",
      "Morris Swartz",
      "Petar Maksimovic",
      "Alice Bean",
      "Chinar Syal",
      "Doug Berry",
      "Nhan Tran",
      "Lindsey Gray",
      "Farah Fahim"
    ],
    "published": "2025-10-08T19:35:15Z",
    "updated": "2025-10-08T19:35:15Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.07314v1",
    "url": "https://arxiv.org/abs/2510.07314v1",
    "pdf_url": "https://arxiv.org/pdf/2510.07314v1.pdf",
    "title": "GyroSwin: 5D Surrogates for Gyrokinetic Plasma Turbulence Simulations",
    "abstract": "Nuclear fusion plays a pivotal role in the quest for reliable and sustainable energy production. A major roadblock to viable fusion power is understanding plasma turbulence, which significantly impairs plasma confinement, and is vital for next-generation reactor design. Plasma turbulence is governed by the nonlinear gyrokinetic equation, which evolves a 5D distribution function over time. Due to its high computational cost, reduced-order models are often employed in practice to approximate turbulent transport of energy. However, they omit nonlinear effects unique to the full 5D dynamics. To tackle this, we introduce GyroSwin, the first scalable 5D neural surrogate that can model 5D nonlinear gyrokinetic simulations, thereby capturing the physical phenomena neglected by reduced models, while providing accurate estimates of turbulent heat transport.GyroSwin (i) extends hierarchical Vision Transformers to 5D, (ii) introduces cross-attention and integration modules for latent 3D$\\leftrightarrow$5D interactions between electrostatic potential fields and the distribution function, and (iii) performs channelwise mode separation inspired by nonlinear physics. We demonstrate that GyroSwin outperforms widely used reduced numerics on heat flux prediction, captures the turbulent energy cascade, and reduces the cost of fully resolved nonlinear gyrokinetics by three orders of magnitude while remaining physically verifiable. GyroSwin shows promising scaling laws, tested up to one billion parameters, paving the way for scalable neural surrogates for gyrokinetic simulations of plasma turbulence.",
    "authors": [
      "Fabian Paischer",
      "Gianluca Galletti",
      "William Hornsby",
      "Paul Setinek",
      "Lorenzo Zanisi",
      "Naomi Carey",
      "Stanislas Pamela",
      "Johannes Brandstetter"
    ],
    "published": "2025-10-08T17:59:10Z",
    "updated": "2025-10-08T17:59:10Z",
    "categories": [
      "physics.plasm-ph",
      "cs.AI",
      "stat.ML"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.07224v1",
    "url": "https://arxiv.org/abs/2510.07224v1",
    "pdf_url": "https://arxiv.org/pdf/2510.07224v1.pdf",
    "title": "Sextupole reduction via chaos suppression at the National Synchrotron   Light Source II",
    "abstract": "We revisit the nonlinear lattice design approach for the National Synchrotron Light Source II (NSLS-II) storage ring. By suppressing chaos, we identify alternative sextupole configurations to the original design, which relied on the conventional strategy of simultaneously minimizing Resonance Driving Terms (RDTs) and Amplitude-Dependent Detuning (ADD). These alternatives achieve comparable performance while requiring fewer sextupoles. A detailed comparison of two representative solutions is presented and supported by experimental validation. Our results show that the dynamic aperture correlates more strongly with global chaos than with individual RDTs, and that the importance of minimizing ADD may have been overstated in earlier design strategies.",
    "authors": [
      "Yongjun Li",
      "Minghao Song",
      "Yoshiteru Hidaka",
      "Victor Smaluk",
      "Timur Shaftan"
    ],
    "published": "2025-10-08T16:57:36Z",
    "updated": "2025-10-08T16:57:36Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.04385v2",
    "url": "https://arxiv.org/abs/2510.04385v2",
    "pdf_url": "https://arxiv.org/pdf/2510.04385v2.pdf",
    "title": "Structure-Preserving MHD-Driftkinetic Discretization for Wave-Particle   Interactions",
    "abstract": "We present a structure-preserving discretization of the hybrid magnetohydrodynamics (MHD)-driftkinetic system for simulations of low-frequency wave-particle interactions. The model equations are derived from a variational principle, assuring energetically consistent couplings between MHD fluids and driftkinetic particles. The spatial discretization is based on a finite-element-exterior-calculus (FEEC) framework for the MHD and a particle-in-cell (PIC) method for the driftkinetic. A key feature of the scheme is the inclusion of the non-quadratic particle magnetic moment energy term in the Hamiltonian, which is introduced by the guiding-center approximation. The resulting discrete Hamiltonian structure naturally organizes the dynamics into skew-symmetric subsystems, enabling balanced energy exchange. To handle the non-quadratic energy term, we develop energy-preserving time integrators based on discrete gradient methods. The algorithm is implemented in the open-source Python package $\\texttt{STRUPHY}$. Numerical experiments confirm the energy-conserving property of the scheme and demonstrate the capability to simulate energetic particles (EP) induced excitation of toroidal Alfv\\'en eigenmodes (TAE) without artificial dissipation or mode filtering. This capability highlights the potential of structure-preserving schemes for high-fidelity simulations of hybrid systems.",
    "authors": [
      "Byung Kyu Na",
      "Stefan Possanner",
      "Xin Wang"
    ],
    "published": "2025-10-05T22:34:28Z",
    "updated": "2025-10-08T16:41:00Z",
    "categories": [
      "physics.comp-ph",
      "cs.NA",
      "math.NA",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.comp-ph"
  },
  {
    "arxiv_id": "2510.07144v1",
    "url": "https://arxiv.org/abs/2510.07144v1",
    "pdf_url": "https://arxiv.org/pdf/2510.07144v1.pdf",
    "title": "Chaotic Motion of Ions In Finite-amplitude Low-frequency Alfvén Waves",
    "abstract": "Finite-amplitude low-frequency Alfv\\'en waves (AWs) are commonly found in plasma environments, such as space plasmas, and play a crucial role in ion heating. In this study, we examine the nonlinear interactions between monochromatic AWs and ions. When the wave amplitude and propagation angle lie within certain ranges, particle motion becomes chaotic. We quantify this chaotic behavior using the maximum Lyapunov exponent, $\\lambda_m$, and find that chaos depends on the particles' initial states. To characterize the proportion of chaotic particles across different initial states, we introduce the Chaos Ratio ($CR$). The threshold for the onset of global chaos is calculated as the contour line of $CR=0.01$. We analyze changes in the magnetic moment during particle motion and identify the physical image of chaos as pitch-angle scattering caused by wave-induced field line curvature (WFLC). Consequently, the condition for chaos can be expressed as the effective relative curvature radius $P_{eff.}<C$, with $C$ being a constant. We analytically determine the chaos region in the $(k_x,\\,k_z,\\,B_w)$ parameter space, and the results show excellent agreement with the global chaos threshold given by $CR=0.01$.",
    "authors": [
      "Jingyu Peng",
      "Jiansen He"
    ],
    "published": "2025-10-08T15:45:40Z",
    "updated": "2025-10-08T15:45:40Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2503.12702v3",
    "url": "https://arxiv.org/abs/2503.12702v3",
    "pdf_url": "https://arxiv.org/pdf/2503.12702v3.pdf",
    "title": "Unveiling a New $β$-Scaling of the Tearing Instability in Weakly   Collisional Plasmas",
    "abstract": "We investigate the linear tearing instability in weakly collisional plasmas using a non-ideal gyrotropic-MHD framework, uncovering a previously unknown scaling relation for the instability growth rate in high-$\\beta$ environments. Even starting from an isotropic equilibrium, our analysis reveals a $\\beta$-dependence, with the maximum growth rate scaling as $\\sigma_\\mathrm{max} \\tau_a \\propto \\beta^{-1/4}$, challenging the long-held assumption of $\\beta$-independence inherent in classical MHD formulations. This novel scaling emerges due to self-consistent fluctuations in pressure anisotropy, dynamically induced by perturbations in velocity and magnetic fields. Increasing plasma-$\\beta$ always suppresses the instability, whereas a background pressure anisotropy can either enhance or further suppress it, depending on its sign: for $p_{\\parallel,0} < p_{\\perp,0}$ the instability is strengthened, while for $p_{\\parallel,0} > p_{\\perp,0}$ it is weakened. Importantly, this effect is not limited to low-collisionality plasmas at high $\\beta$; it can also manifest in more collisional environments once the strict assumption of pressure isotropy is relaxed. This finding has profound implications for various astrophysical contexts characterized by high $\\beta$ and varying degrees of collisionality, including the solar corona and heliospheric current sheets, planetary magnetospheres, as probed by space missions, and the intracluster medium, where magnetic reconnection critically impacts magnetic field evolution and cosmic ray transport. Our results therefore question the universality of the widely-accepted plasmoid-mediated fast reconnection paradigm and underscore the necessity of incorporating pressure anisotropy effects into reconnection models for accurate representation of astrophysical plasmas.",
    "authors": [
      "Gabriel L. Ferreira-Santos",
      "Grzegorz Kowal",
      "Diego A. Falceta-Gonçalves"
    ],
    "published": "2025-03-16T23:59:32Z",
    "updated": "2025-10-08T15:16:25Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE",
      "astro-ph.SR"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2504.00913v2",
    "url": "https://arxiv.org/abs/2504.00913v2",
    "pdf_url": "https://arxiv.org/pdf/2504.00913v2.pdf",
    "title": "Determining the 3D Dynamics of Solar Flare Magnetic Reconnection",
    "abstract": "Solar flares are major space weather events that result from the explosive conversion of stored magnetic energy into bulk motion, plasma heating, and particle acceleration. While the standard flare model has proven highly successful in explaining key morphological features of flare observations, many aspects of the energy release are not yet understood. In particular, the turbulent three-dimensional structure of the flare current sheet is thought to play an important role in fast reconnection, particle acceleration, and bursty dynamics. Although direct diagnosis of the magnetic field dynamics in the corona remains highly challenging, rich information may be gleaned from flare ribbons, which represent the chromospheric imprints of reconnection in the corona. Intriguingly, recent solar imaging observations have revealed a diversity of fine structure in flare ribbons that hints at corresponding complexity in the reconnection region. We present high-resolution three-dimensional MHD simulations of an eruptive flare and describe our efforts to interpret fine-scale ribbon features in terms of the current sheet dynamics. In our model, the current sheet is characterized by many coherent magnetic structures known as plasmoids. We derive a model analogue for ribbons by generating a time series of field-line length maps (L-maps) and identifying abrupt shortenings as flare reconnection events. We thereby demonstrate that plasmoids imprint transient 'spirals' along the analogue of the ribbon front, with a morphology consistent with observed fine structure. We discuss the implications of these results for interpreting SolO, IRIS, and DKIST observations of explosive flare energy release.",
    "authors": [
      "Joel T. Dahlin",
      "Spiro K. Antiochos",
      "Peter F. Wyper",
      "Jiong Qiu",
      "C. Richard DeVore"
    ],
    "published": "2025-04-01T15:47:39Z",
    "updated": "2025-10-08T15:12:31Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2510.01221v2",
    "url": "https://arxiv.org/abs/2510.01221v2",
    "pdf_url": "https://arxiv.org/pdf/2510.01221v2.pdf",
    "title": "WISPFI Experiment: Prototype Development",
    "abstract": "Axions and axion-like particles (ALPs) are well-motivated dark matter (DM) candidates that couple to photons in external magnetic fields. The parameter space around $m_a \\sim 50~\\mu$eV remains largely unexplored by haloscope experiments. We present the first prototype of WISP Searches on a Fiber Interferometer (WISPFI), a table-top, model-independent scheme based on resonant photon-axion conversion in a hollow-core photonic crystal fiber (HC-PCF) integrated into a Mach-Zehnder interferometer (MZI). Operating near a dark fringe with active phase-locking, combined with amplitude modulation, the interferometer converts axion-induced photon disappearance into a measurable signal. A 2 W, 1550 nm laser is coupled into a 1 m-long HC-PCF placed inside a 2 T permanent magnet array, probing a fixed axion mass of $m_a \\simeq 49~$meV with a projected sensitivity of $g_{a\\gamma\\gamma} \\gtrsim 1.3 \\times 10^{-9}~\\text{GeV}^{-1}$ for a measurement time of 30 days. Future upgrades, including pressure tuning of the effective refractive index and implementation of a Fabry-P\\'erot cavity, could extend the accessible mass range and improve sensitivity, establishing WISPFI as a scalable platform to explore previously inaccessible regions of the axion parameter space.",
    "authors": [
      "Josep Maria Batllori",
      "Michael Frosz",
      "Dieter Horns",
      "Marios Maroudas"
    ],
    "published": "2025-09-22T08:25:04Z",
    "updated": "2025-10-08T14:43:39Z",
    "categories": [
      "hep-ex",
      "astro-ph.CO",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2510.07042v1",
    "url": "https://arxiv.org/abs/2510.07042v1",
    "pdf_url": "https://arxiv.org/pdf/2510.07042v1.pdf",
    "title": "Experimental Results from Early Non-Planar NI-HTS Magnet Prototypes for   the Columbia Stellarator eXperiment (CSX)",
    "abstract": "The Columbia Stellarator eXperiment (CSX) is an upgrade of the Columbia Non-neutral Torus (CNT) that aims to demonstrate a university-scale, quasi-axisymmetric stellarator using high-temperature superconducting (HTS) technology at an on-axis magnetic field target of 0.5 T. Due to the strain sensitivity of ReBCO (Rare-earth Barium Copper Oxides), adapting it to non-planar stellarator geometries requires new winding, structural, and cooling strategies. We report on the results of a staged prototype program (P1, P2, P3) employing 3D-printed, sectional aluminum coil frames with winding channels, gimballed constant-tension winding mechanics, and solder potting for radial current redistribution and passive quench mitigation. The first prototype, P1 (planar elliptical, double-pancake) tested additive manufacture, sectional joining and baseline winding, achieving predicted fields at 77 K. P2 (non-planar, higher strain) was wound to 42 turns, energized at 30-40 K to produce expected magnetic fields, and studied thermal gradients and resistance at up to 4.5 kAt. Design evolution in P3 introduces concave geometry with dual double-pancakes, 200 turns, and approaches the 70 kAt target at 20 K. In parallel, sub-microhm lap joints have been developed. Together, these results de-risk manufacturing, cooling interfaces, quench management, and diagnostics, paving the way for full-size non-planar HTS stellarator coils for CSX.",
    "authors": [
      "D. Schmeling",
      "M. Russo",
      "B. T. Gebreamlak",
      "T. J. Kiker",
      "A. R. Skrypek",
      "A. R. Hightower",
      "J. Xue",
      "S. Chen",
      "S. Sohaib",
      "C. Martinez",
      "K. F. Richardson",
      "L. Filor",
      "S. Komatsu",
      "L. Liu",
      "C. Paz-Soldan"
    ],
    "published": "2025-10-08T14:08:08Z",
    "updated": "2025-10-08T14:08:08Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.supr-con",
      "physics.app-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.05423v3",
    "url": "https://arxiv.org/abs/2507.05423v3",
    "pdf_url": "https://arxiv.org/pdf/2507.05423v3.pdf",
    "title": "The CMS Phase-2 Fast Beam Condition Monitor prototype test with beam",
    "abstract": "The Fast Beam Condition Monitor (FBCM) is a standalone luminometer for the High Luminosity LHC (HL-LHC) program of the CMS Experiment at CERN. The detector is under development and features a new, radiation-hard, front-end application-specific integrated circuit (ASIC) designed for beam monitoring applications. The achieved timing resolution of a few nanoseconds enables the measurement of both the luminosity and the beam-induced background. The ASIC, called FBCM23, features six channels with adjustable shaping times, enabling in-field fine-tuning. Each ASIC channel outputs a single binary asynchronous signal encoding time of arrival and time over threshold information. The FBCM is based on silicon-pad sensors, with two sensor designs presently being considered. This paper presents the results of tests of the FBCM detector prototype using both types of silicon sensors with hadron, muon, and electron beams. Irradiated FBCM23 ASICs and silicon-pad sensors were also tested to simulate the expected conditions near the end of the detector's lifetime in the HL-LHC radiation environment. Based on test results, direct bonding between the sensor and ASIC was chosen, and an optimal bias voltage and ASIC threshold for FBCM operation were proposed. The current design of the front-end test board was validated following the beam test and is now being used for the first front-end module, which is expected to be produced in summer 2025. These results represent a major step forward in validating the FBCM concept, first version of the firmware and establishing a reliable design path for the final detector.",
    "authors": [
      "G. Auzinger",
      "H. Bakhshiansohi",
      "A. E. Dabrowski",
      "A. G. Delannoy",
      "V. Dalavi",
      "N. Dienemann",
      "M. Dragicevic",
      "M. F. Garcia",
      "M. Guthoff",
      "B. Gyöngyösi",
      "M. Jenihhin",
      "Á. Kadlecsik",
      "J. Kaplon",
      "O. Karacheban",
      "B. Korcsmáros",
      "A. Lokhovitskiy",
      "W. H. Liu",
      "R. Loos",
      "S. Mallows",
      "D. Mihhailov",
      "M. Obradovic",
      "S. Orfanelli",
      "M. Pari",
      "G. Pásztor",
      "F. L. Pereira Carneiro",
      "M. Princova",
      "B. Ristic",
      "C. Romero",
      "J. Schwandt",
      "M. Sedghi",
      "A. Shevelev",
      "K. Shibin",
      "S. Spanier",
      "G. Steinbrueck",
      "D. P. Stickland",
      "A. Tsirou",
      "B. Ujvári",
      "M. Velasco",
      "P. G. Verdini",
      "G. J. Wegrzyn",
      "M. Wiehe",
      "D. Wilbern",
      "P. D. Winney"
    ],
    "published": "2025-07-07T19:11:42Z",
    "updated": "2025-10-08T12:59:39Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.00799v2",
    "url": "https://arxiv.org/abs/2507.00799v2",
    "pdf_url": "https://arxiv.org/pdf/2507.00799v2.pdf",
    "title": "Materials Design for the Synthesis of High Strength Radiopure Copper   Alloys for Rare Event Detection",
    "abstract": "Additive-free electroformed copper has emerged as the material of choice in exceptionally radiopure detectors for rare-event searches, based on its radiopurity, physical properties, and affordability. However, copper is ductile and of limited mechanical strength posing challenges for its use in future experiments. Electroformed copper-based alloys have been identified as a promising solution. However, their synthesis needs refining by exploring a complex parameter space of compositions and strengthening mechanisms. Here we show how a materials design approach may address current challenges and optimize alloy synthesis and processing. Alloy properties are predicted following thermal processing, using computational thermodynamics. The findings suggest a methodology to design high-performance, radiopure copper-based alloys suitable for next-generation rare-event experiments, while minimizing lengthy and expensive trial-and-error approaches. The impact on future experiments is exemplified through case-studies of the DarkSPHERE and XLZD experiments.",
    "authors": [
      "Dimitra Spathara",
      "Patrick Knights",
      "Konstantinos Nikolopoulos"
    ],
    "published": "2025-07-01T14:31:38Z",
    "updated": "2025-10-08T10:17:09Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2504.09264v2",
    "url": "https://arxiv.org/abs/2504.09264v2",
    "pdf_url": "https://arxiv.org/pdf/2504.09264v2.pdf",
    "title": "Exploring the Design and Measurements of Next-Generation 4H-SiC LGADs",
    "abstract": "This contribution presents the design, production, and initial testing of newly developed 4H-SiC Low Gain Avalanche Detectors (LGADs). The evaluation includes performance metrics such as the internal gain layer's efficiency in enhancing signal generation. Initial laboratory and Transient Current Technique (TCT) measurements provide insight into the device's stability and response to the signal.   Due to the increase of availability provided by the industry, 4H-SiC is emerging as a strong candidate for the next-generation of semiconductor detectors. Such sensors are promising due to the inherent radiation tolerance of 4H-SiC and its stable operation across a wide temperature range. However, due to the wider-bandgap of 4H-SiC compared to standard silicon, and difficulty to produce high-quality layers thicker than 50 \\textmu m, an internal charge multiplication layer needs to be introduced.   The presented 4H-SiC LGADs, fabricated by onsemi, are optimized for an N-type substrate and epi wafer. The initial TCT and laboratory test results demonstrate fast charge collection and uniform multiplication across multiple samples produced on a single wafer.",
    "authors": [
      "Peter Švihra",
      "Jan Chochol",
      "Vladimír Kafka",
      "Adam Klimsza",
      "Adam Kozelsky",
      "Jiří Kroll",
      "Roman Malousek",
      "Mária Marčišovská",
      "Michal Marčišovský",
      "Marcela Mikeštíková",
      "Michael Moll",
      "David Novák",
      "Radek Novotný",
      "Peter Slovák",
      "Radim Špetík",
      "Moritz Wiehe"
    ],
    "published": "2025-04-12T15:54:38Z",
    "updated": "2025-10-08T09:36:02Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1016/j.nima.2025.170742"
  },
  {
    "arxiv_id": "2510.06794v1",
    "url": "https://arxiv.org/abs/2510.06794v1",
    "pdf_url": "https://arxiv.org/pdf/2510.06794v1.pdf",
    "title": "3D simulations of negative streamers in CO$_2$ with admixtures of   C$_4$F$_7$N",
    "abstract": "CO$_2$ with an admixture of C$_4$F$_7$N could serve as an eco-friendly alternative to the extreme greenhouse gas SF$_6$ in high-voltage insulation. Streamer discharges in such gases are different from those in air due to the rapid conductivity decay in the streamer channels. Furthermore, since no effective photoionisation mechanism is known, we expect discharge growth to be more stochastic than in air. In this paper we investigate whether conventional fluid models can be used to simulate streamers in CO$_2$ with admixtures of C$_4$F$_7$N of 1 or 10%. We focus on 3D simulations of negative streamers. First we review cross section databases for C$_4$F$_7$N and CO$_2$. Then we compare a two-term Boltzmann solver with a Monte Carlo method to compute reaction and transport coefficients from the cross sections. Afterwards we compare 3D fluid simulations with the local field (LFA) or local energy approximation (LEA) against particle simulations. In general, we find that the results of particle and fluid models are quite similar. One difference we observe is that particle simulations are intrinsically stochastic, leading to more branching. Furthermore, the LEA model does not show better agreement with the particle simulations than the LFA model. We also discuss the effect and choice of different boundary conditions on the negative rod electrode.",
    "authors": [
      "Thomas J. G. Smits",
      "Jannis Teunissen",
      "Ute Ebert"
    ],
    "published": "2025-10-08T09:25:49Z",
    "updated": "2025-10-08T09:25:49Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.06773v1",
    "url": "https://arxiv.org/abs/2510.06773v1",
    "pdf_url": "https://arxiv.org/pdf/2510.06773v1.pdf",
    "title": "Influence of coil geometry and coil-plasma distance on the magnetic   field approximation error",
    "abstract": "We investigate analytically two questions:   1) How does the coil geometry influence the effect of electric current noise on the induced magnetic field?   2) How does the coil-plasma distance influence our ability to control the pointwise magnetic field error in terms of the average magnetic field error?   Regarding (1), we argue that the main geometric quantities of interest are the notion of reach and the volume of the region enclosed by the coils. Our main finding is a quantitative formula which shows that the larger the reach and the smaller the volume of the region enclosed by the coils, the smaller is the influence of the electric current uncertainty on the magnetic fields.   Regarding (2), we show that the pointwise magnetic field error can be controlled (modulo an explicit constant) by the average square-magnetic field-error times $(\\text{coil-plasma distance})^{-\\frac{3}{2}}$.",
    "authors": [
      "Wadim Gerner"
    ],
    "published": "2025-10-08T08:56:24Z",
    "updated": "2025-10-08T08:56:24Z",
    "categories": [
      "physics.plasm-ph",
      "math-ph",
      "math.MP"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.06771v1",
    "url": "https://arxiv.org/abs/2510.06771v1",
    "pdf_url": "https://arxiv.org/pdf/2510.06771v1.pdf",
    "title": "Low-noise Fourier Transform Spectroscopy Enabled by Superconducting   On-Chip Filterbank Spectrometers",
    "abstract": "Historically employed spectroscopic architectures used for large field of view mapping spectroscopy in millimetere and sub-millimetre astronomy suffer from significant drawbacks. On-chip filterbank spectrometers are a promising technology in this respect; however, they must overcome an orders-of-magnitude increase in detector counts, efficiency loss due to dielectric properties, and stringent fabrication tolerances that currently limit scaling to resolutions of order 1000 over a large array. We propose coupling a medium-resolution Fourier transform spectrometer to a low-resolution filterbank spectrometer focal plane, which serves as a post-dispersion element. In this arrangement, medium resolution imaging spectroscopy is provided by the Fourier transform spectrometer, while the low resolution filterbank spectrometer serves to decrease the photon noise inherent in typical broadband Fourier transform spectrometer measurements by over an order of magnitude. This is achieved while maintaining the excellent imaging advantages of both architectures. We present predicted mapping speeds for a filterbank-dispersed Fourier transform spectrometer from a ground-based site and a balloon-borne platform. We also demonstrate the potential that an instrument of this type has for an R~1000 line intensity mapping experiment using the James Clerk Maxwell Telescope as an example platform. We demonstrate that a filterbank-dispersed Fourier transform spectrometer would be capable of R~1000 measurements of CO power spectra with a signal-to-noise ratio of 10--100 with surveys of $10^5$--$10^6$ spectrometer hours.",
    "authors": [
      "Chris S. Benson",
      "Peter S. Barry",
      "Patrick Ashworth",
      "Harry Gordon-Moys",
      "Kirit S. Karkare",
      "Izaak Morris",
      "Gethin Robson"
    ],
    "published": "2025-10-08T08:55:05Z",
    "updated": "2025-10-08T08:55:05Z",
    "categories": [
      "astro-ph.IM",
      "astro-ph.GA",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2510.06770v1",
    "url": "https://arxiv.org/abs/2510.06770v1",
    "pdf_url": "https://arxiv.org/pdf/2510.06770v1.pdf",
    "title": "Modular Reactor for In Situ X-ray Scattering, Spectroscopy, and ATR-IR   Studies of Solvothermal Nanoparticle Synthesis",
    "abstract": "Understanding the chemical processes that occur during the solvothermal synthesis of functional nanomaterials is essential for their rational design and optimization for specific applications. However, these processes remain poorly understood, primarily due to the limitations of conventional ex situ characterization techniques and the technical challenges associated with in situ studies, particularly the design and implementation of suitable reactors. Here, we present a versatile cell suitable for in situ X-ray scattering, X-ray spectroscopy, and infrared spectroscopy studies performed during solvothermal synthesis under autoclave-like, inert conditions. The reactor enables precise control of the temperature between -20 C and 200 C, pressures up to 8 bar, magnetic stirring, and injection of gas or liquids. The reactor's capabilities are demonstrated by comprehensively studying the solvothermal synthesis of magnetite nanoparticles from iron acetylacetonate in benzyl alcohol through in situ X-ray scattering and spectroscopy, and ATR-IR spectroscopy.",
    "authors": [
      "Sani Y. Harouna-Mayer",
      "Melike Gumus Akcaalan",
      "Jagadesh Kopula Kesavan",
      "Tjark R. L. Groene",
      "Lars Klemeyer",
      "Sarah-Alexandra Hussak",
      "Lukas Grote",
      "a Davide Derelli",
      "Francesco Caddeo",
      "Cecilia Zito",
      "Paul Stützle",
      "Dorota Speer",
      "Ann-Christin Dippel",
      "Blanka Detlefs",
      "Yannik Appiarius",
      "Axel Jacobi von Wangelin",
      "Dorota Koziej"
    ],
    "published": "2025-10-08T08:54:49Z",
    "updated": "2025-10-08T08:54:49Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2303.09502v2",
    "url": "https://arxiv.org/abs/2303.09502v2",
    "pdf_url": "https://arxiv.org/pdf/2303.09502v2.pdf",
    "title": "M5 -- Mars Magnetospheric Multipoint Measurement Mission: A   multi-spacecraft plasma physics mission to Mars",
    "abstract": "Mars, lacking an intrinsic dynamo, is an ideal laboratory to comparatively study induced magnetospheres, which can be found in other terrestrial bodies as well as comets. Additionally, Mars is of particular interest to further exploration due to its loss of habitability by atmospheric escape and possible future human exploration. In this context, we propose the Mars Magnetospheric Multipoint Measurement Mission (M$^5$), a multi-spacecraft mission to study the dynamics and energy transport of the Martian induced magnetosphere comprehensively. Particular focus is dedicated to the largely unexplored magnetotail region, where signatures of magnetic reconnection have been found. Furthermore, a reliable knowledge of the upstream solar wind conditions is needed to study the dynamics of the Martian magnetosphere, especially the different dayside boundary regions but also for energy transport phenomena like the current system and plasma waves. This will aid the study of atmospheric escape processes of planets with induced magnetospheres. In order to resolve the three-dimensional structures varying both in time and space, multi-point measurements are required. Thus, M$^5$ is a five spacecraft mission, with one solar wind monitor orbiting Mars in a circular orbit at 5 Martian radii, and four smaller spacecraft in a tetrahedral configuration orbiting Mars in an elliptical orbit, spanning the far magnetotail up to 6 Mars radii with a periapsis within the Martian magnetosphere of 1.8 Mars radii. We not only present a detailed assessment of the scientific need for such a mission but also show the resulting mission and spacecraft design taking into account all aspects of the mission requirements and constraints such as mass, power, and link budgets. This mission concept was developed during the Alpbach Summer School 2022.",
    "authors": [
      "Cormac J. K. Larkin",
      "Ville Lundén",
      "Leonard Schulz",
      "Markus Baumgartner-Steinleitner",
      "Marianne Brekkum",
      "Adam Cegla",
      "Pietro Dazzi",
      "Alessia De Iuliis",
      "Jonas Gesch",
      "Sofia Lennerstrand",
      "Sara Nesbit-Östmann",
      "Vasco D. C. Pires",
      "Inés Terraza Palanca",
      "Daniel Teubenbacher",
      "Florine Enengl",
      "Marcus Hallmann"
    ],
    "published": "2023-03-16T17:21:30Z",
    "updated": "2025-10-08T07:59:57Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.EP",
      "astro-ph.IM",
      "physics.geo-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph",
    "doi": "10.1016/j.asr.2023.11.032"
  },
  {
    "arxiv_id": "2509.19178v2",
    "url": "https://arxiv.org/abs/2509.19178v2",
    "pdf_url": "https://arxiv.org/pdf/2509.19178v2.pdf",
    "title": "A noise-robust Monte Carlo method for electric field calculations in   EMC3",
    "abstract": "One of the main codes to analyze and optimize stellarator configurations is the EMC3 code, which implements a state-of-the-art 3D Monte Carlo plasma edge transport code. However, so far, a self-consistent treatment of the E x B drift is absent. This plasma drift is known to significantly impact the particle and heat distribution in the plasma edge. It is desirable to incorporate this drift into EMC3 to improve the predictive capabilities of the code. The calculation of the E x B drift requires the approximation of the electric field E, which is proportional to the gradient of the electric potential $ \\varphi $. In previous work, the gradient was calculated with a least squares method based on a finite difference approximation of the electric potential. However, due to the stochastic nature of EMC3, the output plasma fields computed by the code are inherently noisy. The finite difference method further amplifies the noise, with the amplification growing as the grid size decreases. We continue from, which introduced a new noise-robust method for 1D derivatives. We extend the noise-robust method to 2D and apply it to the electric potential. We show that a PDE can be derived that describes the evolution of the electric field in case of a uniform diffusion coefficient. This PDE allows us to approximate the electric field directly with a Monte Carlo simulation, thus avoiding the need for a finite difference approximation. We illustrate the accuracy of the method and the noise robustness with a test case.",
    "authors": [
      "William De Deyn",
      "Ruben De Wolf",
      "Vince Maes",
      "Giovanni Samaey"
    ],
    "published": "2025-09-23T15:49:50Z",
    "updated": "2025-10-08T07:22:37Z",
    "categories": [
      "math.NA",
      "cs.NA",
      "physics.plasm-ph"
    ],
    "primary_category": "math.NA"
  },
  {
    "arxiv_id": "2509.00164v5",
    "url": "https://arxiv.org/abs/2509.00164v5",
    "pdf_url": "https://arxiv.org/pdf/2509.00164v5.pdf",
    "title": "The potential applications of muography to revealing sea shipwrecks",
    "abstract": "Muon imaging, a non-invasive technique that utilizes naturally occurring cosmic muons, has emerged as a promising tool for exploring underwater objects, including shipwrecks. This study investigates the potential of muon radiography to examine the contents of wrecked ships in the Baltic Sea and other marine environments. These wrecks often pose significant environmental risks due to hazardous contents such as explosives and crude oil, making their detection and monitoring critical for environmental and safety considerations. Accurate modeling and imaging of such wrecks are therefore essential for assessing potential dangers and mitigating environmental impacts.   To model the underwater muon flux in this study, an approach similar to that used in underground muon experiments was adopted. Cosmic muons were propagated through seawater using GEANT4, modeling their energy loss as they traverse water. The muons' kinematics and energy depositions were recorded during this process. The resulting distributions were tabulated and used as input for the primary particle generation module. This method enabled the generation of a realistic underwater muon flux at the desired depth above the shipwreck, allowing us to simulate various shipwreck filling scenarios.   Assuming an exposure time of one week for a wreck located at 50 meters depth, our simulations demonstrate that muon imaging can sufficiently resolve density contrasts to distinguish between water, oil, and high-density materials. These results demonstrate the feasibility of muon radiography as a practical tool for underwater hazard assessment and shipwreck investigation.",
    "authors": [
      "Anzori Sh. Georgadze"
    ],
    "published": "2025-08-29T18:05:45Z",
    "updated": "2025-10-08T06:52:23Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.06665v1",
    "url": "https://arxiv.org/abs/2510.06665v1",
    "pdf_url": "https://arxiv.org/pdf/2510.06665v1.pdf",
    "title": "Doping of a Borexino-like Liquid Scintillator with Tellurium-Diols",
    "abstract": "One of the most promising approaches for future neutrinoless double beta decay searches is to incorporate a candidate isotope into the liquid scintillator of a next-generation neutrino detector. In this study, a sample of the high-performance 1,2,4-Trimethylbenzene-based liquid scintillator from the Borexino detector was loaded with different concentrations of Te-diols. Therefore,a novel and completely water-free synthesis in a non-acidic organic environment at room temperature was used. Key parameters of the loaded samples were analyzed and compared with those of the pure Borexino liquid. Both the emission spectrum and transmission remained nearly unchanged,even at high doping levels. The reduction in light yield was moderate, with approximately 8,400 photons emitted for a 1 MeV energy deposition by an electron at 1$\\%$ tellurium loading. The time profile of the light emission induced by alpha particles was also investigated, revealing that the scintillation response becomes significantly faster with increasing tellurium concentration.",
    "authors": [
      "Hans Th. J. Steiger",
      "Marco Beretta",
      "Manuel Böhles",
      "Alberto Garfagnini",
      "Arsenii Gavrikov",
      "Paolo Lombardi",
      "Kai Loo",
      "Elena Pasini",
      "Benedetta Rasera",
      "Andrea Serafini",
      "Michael Wurm"
    ],
    "published": "2025-10-08T05:32:35Z",
    "updated": "2025-10-08T05:32:35Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2506.18830v3",
    "url": "https://arxiv.org/abs/2506.18830v3",
    "pdf_url": "https://arxiv.org/pdf/2506.18830v3.pdf",
    "title": "Wave Topology in Hall MHD",
    "abstract": "Hall Magnetohydrodynamics (HMHD) extends ideal MHD by incorporating the Hall effect via the induction equation, making it more accurate for describing plasma behavior at length scales below the ion skin depth. Despite its importance, a comprehensive description of the eigenmodes in HMHD has been lacking. In this work, we derive the complete spectrum and eigenvectors of HMHD waves and identify their underlying topological structure. We prove that the HMHD wave spectrum is homotopic to that of ideal MHD, consisting of three distinct branches: the slow magnetosonic-Hall waves, the shear Alfv\\'en-Hall waves, and the fast magnetosonic-Hall waves, which continuously reduce to their ideal MHD counterparts in the limit of vanishing Hall parameter. Contrary to a recent claim, we find that HMHD does not admit any additional wave branches beyond those in ideal MHD. The key qualitative difference lies in the topological nature of the HMHD wave structure: it exhibits nontrivial topology characterized by a Weyl point-an isolated eigenmode degeneracy point-and associated nonzero Chern numbers of the eigenmode bundles over a 2-sphere in k-space surrounding the Weyl point.",
    "authors": [
      "Alejandro Mesa Dame",
      "Hong Qin",
      "Eric Palmerduca",
      "Yichen Fu"
    ],
    "published": "2025-06-23T16:46:34Z",
    "updated": "2025-10-08T05:16:13Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.06616v1",
    "url": "https://arxiv.org/abs/2510.06616v1",
    "pdf_url": "https://arxiv.org/pdf/2510.06616v1.pdf",
    "title": "Instrumentation of JUNO 3-inch PMTs",
    "abstract": "Over 25,600 3-inch photomultiplier tubes (PMTs) have been instrumented for the central detector of the Jiangmen Underground Neutrino Observatory. Each PMT is equipped with a high-voltage divider and a frontend cable with waterproof sealing. Groups of sixteen PMTs are connected to the underwater frontend readout electronics via specialized multi-channel waterproof connectors. This paper outlines the design and mass production processes for the high-voltage divider, the cable and connector, as well as the waterproof potting of the PMT bases. The results of the acceptance tests of all the integrated PMTs are also presented.",
    "authors": [
      "Jilei Xu",
      "Miao He",
      "Cédric Cerna",
      "Yongbo Huang",
      "Thomas Adam",
      "Shakeel Ahmad",
      "Rizwan Ahmed",
      "Fengpeng An",
      "Costas Andreopoulos",
      "Giuseppe Andronico",
      "João Pedro Athayde Marcondes de André",
      "Nikolay Anfimov",
      "Vito Antonelli",
      "Tatiana Antoshkina",
      "Didier Auguste",
      "Weidong Bai",
      "Nikita Balashov",
      "Andrea Barresi",
      "Davide Basilico",
      "Eric Baussan",
      "Marco Beretta",
      "Antonio Bergnoli",
      "Nikita Bessonov",
      "Daniel Bick",
      "Lukas Bieger",
      "Svetlana Biktemerova",
      "Thilo Birkenfeld",
      "Simon Blyth",
      "Anastasia Bolshakova",
      "Mathieu Bongrand",
      "Matteo Borghesi",
      "Dominique Breton",
      "Augusto Brigatti",
      "Riccardo Brugnera",
      "Riccardo Bruno",
      "Antonio Budano",
      "Jose Busto",
      "Marcel Büchner",
      "Anatael Cabrera",
      "Barbara Caccianiga",
      "Hao Cai",
      "Xiao Cai",
      "Yanke Cai",
      "Zhiyan Cai",
      "Stéphane Callier",
      "Steven Calvez",
      "Antonio Cammi",
      "Chuanya Cao",
      "Guofu Cao",
      "Jun Cao",
      "Yaoqi Cao",
      "Rossella Caruso",
      "Vanessa Cerrone",
      "Jinfan Chang",
      "Yun Chang",
      "Auttakit Chatrabhuti",
      "Chao Chen",
      "Guoming Chen",
      "Jiahui Chen",
      "Jian Chen",
      "Jing Chen",
      "Junyou Chen",
      "Pingping Chen",
      "Shaomin Chen",
      "Shiqiang Chen",
      "Xin Chen",
      "Yiming Chen",
      "Yixue Chen",
      "Yu Chen",
      "Ze Chen",
      "Zhangming Chen",
      "Zhiyuan Chen",
      "Jie Cheng",
      "Yaping Cheng",
      "Yu Chin Cheng",
      "Alexander Chepurnov",
      "Alexey Chetverikov",
      "Davide Chiesa",
      "Pietro Chimenti",
      "Po-Lin Chou",
      "Ziliang Chu",
      "Artem Chukanov",
      "Gérard Claverie",
      "Catia Clementi",
      "Barbara Clerbaux",
      "Claudio Coletta",
      "Simon Csakli",
      "Chenyang Cui",
      "Olivia Dalager",
      "Zhi Deng",
      "Ziyan Deng",
      "Xiaoyu Ding",
      "Xuefeng Ding",
      "Yayun Ding",
      "Bayu Dirgantara",
      "Carsten Dittrich",
      "Sergey Dmitrievsky",
      "David Doerflinger",
      "Dmitry Dolzhikov",
      "Haojie Dong",
      "Jianmeng Dong",
      "Evgeny Doroshkevich",
      "Marcos Dracos",
      "Frédéric Druillole",
      "Ran Du",
      "Shuxian Du",
      "Yujie Duan",
      "Katherine Dugas",
      "Stefano Dusini",
      "Hongyue Duyang",
      "Jessica Eck",
      "Timo Enqvist",
      "Andrea Fabbri",
      "Ulrike Fahrendholz",
      "Lei Fan",
      "Jian Fang",
      "Wenxing Fang",
      "Elia Stanescu Farilla",
      "Dmitry Fedoseev",
      "Li-Cheng Feng",
      "Qichun Feng",
      "Federico Ferraro",
      "Daniela Fetzer",
      "Marcellin Fotzé",
      "Amélie Fournier",
      "Aaron Freegard",
      "Feng Gao",
      "Alberto Garfagnini",
      "Arsenii Gavrikov",
      "Marco Giammarchi",
      "Nunzio Giudice",
      "Maxim Gonchar",
      "Guanghua Gong",
      "Hui Gong",
      "Yuri Gornushkin",
      "Marco Grassi",
      "Maxim Gromov",
      "Vasily Gromov",
      "Minhao Gu",
      "Xiaofei Gu",
      "Yu Gu",
      "Mengyun Guan",
      "Yuduo Guan",
      "Nunzio Guardone",
      "Rosa Maria Guizzetti",
      "Cong Guo",
      "Wanlei Guo",
      "Caren Hagner",
      "Hechong Han",
      "Ran Han",
      "Yang Han",
      "Vidhya Thara Hariharan",
      "Jinhong He",
      "Wei He",
      "Xinhai He",
      "Ziou He",
      "Tobias Heinz",
      "Patrick Hellmuth",
      "Yuekun Heng",
      "YuenKeung Hor",
      "Shaojing Hou",
      "Yee Hsiung",
      "Bei-Zhen Hu",
      "Hang Hu",
      "Jun Hu",
      "Tao Hu",
      "Yuxiang Hu",
      "Guihong Huang",
      "Hexiang Huang",
      "Jinhao Huang",
      "Junting Huang",
      "Kaixuan Huang",
      "Shengheng Huang",
      "Tao Huang",
      "Xin Huang",
      "Xingtao Huang",
      "Jiaqi Hui",
      "Lei Huo",
      "Cédric Huss",
      "Safeer Hussain",
      "Leonard Imbert",
      "Ara Ioannisian",
      "Adrienne Jacobi",
      "Arshak Jafar",
      "Beatrice Jelmini",
      "Xiangpan Ji",
      "Xiaolu Ji",
      "Huihui Jia",
      "Junji Jia",
      "Cailian Jiang",
      "Wei Jiang",
      "Xiaoshan Jiang",
      "Xiaozhao Jiang",
      "Yijian Jiang",
      "Yixuan Jiang",
      "Xiaoping Jing",
      "Cécile Jollet",
      "Li Kang",
      "Rebin Karaparabil",
      "Narine Kazarian",
      "Ali Khan",
      "Amina Khatun",
      "Khanchai Khosonthongkee",
      "Denis Korablev",
      "Konstantin Kouzakov",
      "Alexey Krasnoperov",
      "Sergey Kuleshov",
      "Sindhujha Kumaran",
      "Nikolay Kutovskiy",
      "Loïc Labit",
      "Tobias Lachenmaier",
      "Haojing Lai",
      "Cecilia Landini",
      "Lorenzo Lastrucci",
      "Sébastien Leblanc",
      "Matthieu Lecocq",
      "Frederic Lefevre",
      "Ruiting Lei",
      "Rupert Leitner",
      "Jason Leung",
      "Demin Li",
      "Fei Li",
      "Fule Li",
      "Gaosong Li",
      "Hongjian Li",
      "Huang Li",
      "Jiajun Li",
      "Min Li",
      "Nan Li",
      "Qingjiang Li",
      "Ruhui Li",
      "Rui Li",
      "Shanfeng Li",
      "Tao Li",
      "Teng Li",
      "Weidong Li",
      "Xiaonan Li",
      "Yi Li",
      "Yichen Li",
      "Yifan Li",
      "Yufeng Li",
      "Zhaohan Li",
      "Zhibing Li",
      "Zi-Ming Li",
      "Zonghai Li",
      "An-An Liang",
      "Jiajun Liao",
      "Minghua Liao",
      "Yilin Liao",
      "Ayut Limphirat",
      "Bo-Chun Lin",
      "Guey-Lin Lin",
      "Shengxin Lin",
      "Tao Lin",
      "Xianhao Lin",
      "Xingyi Lin",
      "Jiajie Ling",
      "Xin Ling",
      "Ivano Lippi",
      "Caimei Liu",
      "Fang Liu",
      "Fengcheng Liu",
      "Haidong Liu",
      "Haotian Liu",
      "Hongbang Liu",
      "Hongjuan Liu",
      "Hongtao Liu",
      "Hongyang Liu",
      "Jianglai Liu",
      "Jiaxi Liu",
      "Jinchang Liu",
      "Kainan Liu",
      "Min Liu",
      "Qian Liu",
      "Runxuan Liu",
      "Shenghui Liu",
      "Shulin Liu",
      "Xiaowei Liu",
      "Xiwen Liu",
      "Xuewei Liu",
      "Yankai Liu",
      "Zhen Liu",
      "Lorenzo Loi",
      "Alexey Lokhov",
      "Paolo Lombardi",
      "Claudio Lombardo",
      "Kai Loo",
      "Selma Conforti Di Lorenzo",
      "Haoqi Lu",
      "Junguang Lu",
      "Meishu Lu",
      "Shuxiang Lu",
      "Xianguo Lu",
      "Bayarto Lubsandorzhiev",
      "Sultim Lubsandorzhiev",
      "Livia Ludhova",
      "Arslan Lukanov",
      "Fengjiao Luo",
      "Guang Luo",
      "Jianyi Luo",
      "Shu Luo",
      "Wuming Luo",
      "Xiaojie Luo",
      "Vladimir Lyashuk",
      "Bangzheng Ma",
      "Bing Ma",
      "Qiumei Ma",
      "Si Ma",
      "Wing Yan Ma",
      "Xiaoyan Ma",
      "Xubo Ma",
      "Jihane Maalmi",
      "Jingyu Mai",
      "Marco Malabarba",
      "Yury Malyshkin",
      "Roberto Carlos Mandujano",
      "Fabio Mantovani",
      "Xin Mao",
      "Stefano M. Mari",
      "Agnese Martini",
      "Matthias Mayer",
      "Davit Mayilyan",
      "Yue Meng",
      "Anselmo Meregaglia",
      "Lino Miramonti",
      "Marta Colomer Molla",
      "Michele Montuschi",
      "Iwan Morton-Blake",
      "Massimiliano Nastasi",
      "Dmitry V. Naumov",
      "Elena Naumova",
      "Igor Nemchenok",
      "Elisabeth Neuerburg",
      "Alexey Nikolaev",
      "Feipeng Ning",
      "Zhe Ning",
      "Yujie Niu",
      "Hiroshi Nunokawa",
      "Lothar Oberauer",
      "Juan Pedro Ochoa-Ricoux",
      "Sebastian Olivares",
      "Alexander Olshevskiy",
      "Domizia Orestano",
      "Fausto Ortica",
      "Rainer Othegraven",
      "Yifei Pan",
      "Alessandro Paoloni",
      "George Parker",
      "Yatian Pei",
      "Luca Pelicci",
      "Anguo Peng",
      "Yu Peng",
      "Zhaoyuan Peng",
      "Elisa Percalli",
      "Willy Perrin",
      "Frédéric Perrot",
      "Pierre-Alexandre Petitjean",
      "Fabrizio Petrucci",
      "Oliver Pilarczyk",
      "Artyom Popov",
      "Pascal Poussot",
      "Ezio Previtali",
      "Fazhi Qi",
      "Ming Qi",
      "Xiaohui Qi",
      "Sen Qian",
      "Xiaohui Qian",
      "Zhonghua Qin",
      "Shoukang Qiu",
      "Manhao Qu",
      "Zhenning Qu",
      "Gioacchino Ranucci",
      "Thomas Raymond",
      "Alessandra Re",
      "Abdel Rebii",
      "Mariia Redchuk",
      "Bin Ren",
      "Yuhan Ren",
      "Cristobal Morales Reveco",
      "Barbara Ricci",
      "Komkrit Rientong",
      "Mariam Rifai",
      "Mathieu Roche",
      "Narongkiat Rodphai",
      "Fernanda de Faria Rodrigues",
      "Aldo Romani",
      "Bedřich Roskovec",
      "Arseniy Rybnikov",
      "Andrey Sadovsky",
      "Paolo Saggese",
      "Deshan Sandanayake",
      "Anut Sangka",
      "Ujwal Santhosh",
      "Giuseppe Sava",
      "Utane Sawangwit",
      "Michaela Schever",
      "Cédric Schwab",
      "Konstantin Schweizer",
      "Alexandr Selyunin",
      "Andrea Serafini",
      "Mariangela Settimo",
      "Junyu Shao",
      "Vladislav Sharov",
      "Hangyu Shi",
      "Hexi Shi",
      "Jingyan Shi",
      "Yanan Shi",
      "Vitaly Shutov",
      "Andrey Sidorenkov",
      "Apeksha Singhal",
      "Chiara Sirignano",
      "Jaruchit Siripak",
      "Monica Sisti",
      "Mikhail Smirnov",
      "Oleg Smirnov",
      "Thiago Sogo-Bezerra",
      "Sergey Sokolov",
      "Julanan Songwadhana",
      "Boonrucksar Soonthornthum",
      "Albert Sotnikov",
      "Warintorn Sreethawong",
      "Achim Stahl",
      "Luca Stanco",
      "Konstantin Stankevich",
      "Hans Steiger",
      "Jochen Steinmann",
      "Tobias Sterr",
      "Matthias Raphael Stock",
      "Virginia Strati",
      "Mikhail Strizh",
      "Alexander Studenikin",
      "Aoqi Su",
      "Jun Su",
      "Guangbao Sun",
      "Mingxia Sun",
      "Xilei Sun",
      "Yongzhao Sun",
      "Zhengyang Sun",
      "Narumon Suwonjandee",
      "Fedor Šimkovic",
      "Christophe De La Taille",
      "Akira Takenaka",
      "Xiaohan Tan",
      "Jian Tang",
      "Jingzhe Tang",
      "Qiang Tang",
      "Quan Tang",
      "Xiao Tang",
      "Minh Thuan Nguyen Thi",
      "Yuxin Tian",
      "Igor Tkachev",
      "Tomas Tmej",
      "Marco Danilo Claudio Torri",
      "Andrea Triossi",
      "Wladyslaw Trzaska",
      "Yu-Chen Tung",
      "Cristina Tuve",
      "Nikita Ushakov",
      "Carlo Venettacci",
      "Giuseppe Verde",
      "Maxim Vialkov",
      "Benoit Viaud",
      "Cornelius Moritz Vollbrecht",
      "Vit Vorobel",
      "Dmitriy Voronin",
      "Lucia Votano",
      "Caishen Wang",
      "Chung-Hsiang Wang",
      "En Wang",
      "Hanwen Wang",
      "Jiabin Wang",
      "Jun Wang",
      "Li Wang",
      "Meng Wang",
      "Meng Wang",
      "Mingyuan Wang",
      "Qianchuan Wang",
      "Ruiguang Wang",
      "Sibo Wang",
      "Tianhong Wang",
      "Wei Wang",
      "Wenshuai Wang",
      "Xi Wang",
      "Yangfu Wang",
      "Yaoguang Wang",
      "Yi Wang",
      "Yi Wang",
      "Yifang Wang",
      "Yuanqing Wang",
      "Yuyi Wang",
      "Zhe Wang",
      "Zheng Wang",
      "Zhimin Wang",
      "Apimook Watcharangkool",
      "Wei Wei",
      "Wei Wei",
      "Yadong Wei",
      "Yuehuan Wei",
      "Zhengbao Wei",
      "Liangjian Wen",
      "Jun Weng",
      "Christopher Wiebusch",
      "Rosmarie Wirth",
      "Bi Wu",
      "Chengxin Wu",
      "Diru Wu",
      "Qun Wu",
      "Yinhui Wu",
      "Yiyang Wu",
      "Zhaoxiang Wu",
      "Zhi Wu",
      "Michael Wurm",
      "Jacques Wurtz",
      "Dongmei Xia",
      "Shishen Xian",
      "Ziqian Xiang",
      "Fei Xiao",
      "Pengfei Xiao",
      "Xiang Xiao",
      "Wei-Jun Xie",
      "Xiaochuan Xie",
      "Yijun Xie",
      "Yuguang Xie",
      "Zhao Xin",
      "Zhizhong Xing",
      "Benda Xu",
      "Cheng Xu",
      "Donglian Xu",
      "Fanrong Xu",
      "Jiayang Xu",
      "Jinghuan Xu",
      "Meihang Xu",
      "Shiwen Xu",
      "Xunjie Xu",
      "Yin Xu",
      "Yu Xu",
      "Jingqin Xue",
      "Baojun Yan",
      "Qiyu Yan",
      "Taylor Yan",
      "Xiongbo Yan",
      "Yupeng Yan",
      "Changgen Yang",
      "Chengfeng Yang",
      "Fengfan Yang",
      "Jie Yang",
      "Lei Yang",
      "Pengfei Yang",
      "Xiaoyu Yang",
      "Yifan Yang",
      "Yixiang Yang",
      "Zekun Yang",
      "Haifeng Yao",
      "Jiaxuan Ye",
      "Mei Ye",
      "Ziping Ye",
      "Frédéric Yermia",
      "Jilong Yin",
      "Weiqing Yin",
      "Xiaohao Yin",
      "Zhengyun You",
      "Boxiang Yu",
      "Chiye Yu",
      "Chunxu Yu",
      "Hongzhao Yu",
      "Peidong Yu",
      "Xianghui Yu",
      "Zeyuan Yu",
      "Zezhong Yu",
      "Cenxi Yuan",
      "Chengzhuo Yuan",
      "Zhaoyang Yuan",
      "Zhenxiong Yuan",
      "Noman Zafar",
      "Kirill Zamogilnyi",
      "Jilberto Zamora",
      "Vitalii Zavadskyi",
      "Fanrui Zeng",
      "Shan Zeng",
      "Tingxuan Zeng",
      "Liang Zhan",
      "Yonghua Zhan",
      "Aiqiang Zhang",
      "Bin Zhang",
      "Binting Zhang",
      "Feiyang Zhang",
      "Han Zhang",
      "Haosen Zhang",
      "Honghao Zhang",
      "Jialiang Zhang",
      "Jiawen Zhang",
      "Jie Zhang",
      "Jingbo Zhang",
      "Junwei Zhang",
      "Lei Zhang",
      "Ping Zhang",
      "Qingmin Zhang",
      "Rongping Zhang",
      "Shiqi Zhang",
      "Shuihan Zhang",
      "Siyuan Zhang",
      "Tao Zhang",
      "Xiaomei Zhang",
      "Xin Zhang",
      "Xu Zhang",
      "Xuantong Zhang",
      "Yibing Zhang",
      "Yinhong Zhang",
      "Yiyu Zhang",
      "Yongpeng Zhang",
      "Yu Zhang",
      "Yuanyuan Zhang",
      "Yumei Zhang",
      "Zhenyu Zhang",
      "Zhijian Zhang",
      "Jie Zhao",
      "Runze Zhao",
      "Shujun Zhao",
      "Tianhao Zhao",
      "Hua Zheng",
      "Yangheng Zheng",
      "Li Zhou",
      "Shun Zhou",
      "Tong Zhou",
      "Xiang Zhou",
      "Xing Zhou",
      "Jingsen Zhu",
      "Kangfu Zhu",
      "Kejun Zhu",
      "Zhihang Zhu",
      "Bo Zhuang",
      "Honglin Zhuang",
      "Liang Zong",
      "Jiaheng Zou"
    ],
    "published": "2025-10-08T03:50:41Z",
    "updated": "2025-10-08T03:50:41Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.06588v1",
    "url": "https://arxiv.org/abs/2510.06588v1",
    "pdf_url": "https://arxiv.org/pdf/2510.06588v1.pdf",
    "title": "Sensor Co-design for $\\textit{smartpixels}$",
    "abstract": "Pixel tracking detectors at upcoming collider experiments will see unprecedented charged-particle densities. Real-time data reduction on the detector will enable higher granularity and faster readout, possibly enabling the use of the pixel detector in the first level of the trigger for a hadron collider. This data reduction can be accomplished with a neural network (NN) in the readout chip bonded with the sensor that recognizes and rejects tracks with low transverse momentum (p$_T$) based on the geometrical shape of the charge deposition (``cluster''). To design a viable detector for deployment at an experiment, the dependence of the NN as a function of the sensor geometry, external magnetic field, and irradiation must be understood. In this paper, we present first studies of the efficiency and data reduction for planar pixel sensors exploring these parameters. A smaller sensor pitch in the bending direction improves the p$_T$ discrimination, but a larger pitch can be partially compensated with detector depth. An external magnetic field parallel to the sensor plane induces Lorentz drift of the electron-hole pairs produced by the charged particle, broadening the cluster and improving the network performance. The absence of the external field diminishes the background rejection compared to the baseline by $\\mathcal{O}$(10%). Any accumulated radiation damage also changes the cluster shape, reducing the signal efficiency compared to the baseline by $\\sim$ 30 - 60%, but nearly all of the performance can be recovered through retraining of the network and updating the weights. Finally, the impact of noise was investigated, and retraining the network on noise-injected datasets was found to maintain performance within 6% of the baseline network trained and evaluated on noiseless data.",
    "authors": [
      "Danush Shekar",
      "Ben Weiss",
      "Morris Swartz",
      "Corrinne Mills",
      "Jennet Dickinson",
      "Lindsey Gray",
      "David Jiang",
      "Mohammad Abrar Wadud",
      "Daniel Abadjiev",
      "Anthony Badea",
      "Douglas Berry",
      "Alec Cauper",
      "Arghya Ranjan Das",
      "Giuseppe Di Guglielmo",
      "Karri Folan DiPetrillo",
      "Farah Fahim",
      "Rachel Kovach Fuentes",
      "Abhijith Gandrakota",
      "James Hirschauer",
      "Eliza Howard",
      "Shiqi Kuang",
      "Carissa Kumar",
      "Ron Lipton",
      "Mia Liu",
      "Petar Maksimovic",
      "Nick Manganelli",
      "Mark S Neubauer",
      "Aidan Nicholas",
      "Emily Pan",
      "Benjamin Parpillon",
      "Jannicke Pearkes",
      "Gauri Pradhan",
      "Shruti R Kulkarni",
      "Ricardo Silvestre",
      "Chinar Syal",
      "Nhan Tran",
      "Amit Trivedi",
      "Keith Ulmer",
      "Manuel Blanco Valentin",
      "Dahai Wen",
      "Jieun Yoo",
      "Eric You",
      "Aaron Young"
    ],
    "published": "2025-10-08T02:38:34Z",
    "updated": "2025-10-08T02:38:34Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.20658v3",
    "url": "https://arxiv.org/abs/2509.20658v3",
    "pdf_url": "https://arxiv.org/pdf/2509.20658v3.pdf",
    "title": "Regression of Suspension Violin Modes in KAGRA O3GK Data with Kalman   Filters",
    "abstract": "Suspension thermal modes in interferometric gravitational-wave detectors produce narrow, high-Q spectral lines that can contaminate gravitational searches and bias parameter estimation. In KAGRA, cryogenic mirrors are held by thick suspension fibers, designed to sustain such a low-temperature environment, which may further affect inharmonicity modes, fiber dimensions, and mechanical behavior compared to typical interferometers. As these modes remain a prominent source of narrowband contamination, we implement a Kalman filter to model and track violin lines, building on the methodology introduced in [1], and apply subtraction to KAGRA O3GK data. Using gravitational-wave template injections, we validate that the subtraction preserves matched-filter SNR while effectively suppressing line power. Comparisons of power spectral densities and residual analyses confirm that the method removes deterministic line contributions without introducing waveform distortions. This approach provides a cleaner strain channel for searches and parameter estimation and will become increasingly important for future low-temperature detectors with higher-Q suspensions, such as the Einstein Telescope.",
    "authors": [
      "Lucas Moisset",
      "Marco Meyer-Conde",
      "Christopher Allene",
      "Yusuke Sakai",
      "Dan Chen",
      "Nobuyuki Kanda",
      "Hirotaka Takahashi"
    ],
    "published": "2025-09-25T01:33:14Z",
    "updated": "2025-10-08T00:49:39Z",
    "categories": [
      "gr-qc",
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "gr-qc",
    "doi": "10.1103/jpr4-m3ck"
  },
  {
    "arxiv_id": "2507.19729v3",
    "url": "https://arxiv.org/abs/2507.19729v3",
    "pdf_url": "https://arxiv.org/pdf/2507.19729v3.pdf",
    "title": "Semi-Implicit Continuum Kinetic Modeling of Weakly Collisional Parallel   Transport in a Magnetic Mirror",
    "abstract": "We present implicit-explicit (IMEX) kinetic simulations of weakly collisional parallel plasma transport in magnetic mirror configurations using the continuum code \\textsc{COGENT}. The numerical scheme employs a Jacobian-free Newton--Krylov method with algebraic multigrid preconditioning to overcome the severe time-step limitations imposed by strong mirror forces in fully explicit schemes. Applied to parameters relevant to the WHAM mirror experiment, the IMEX approach enables time steps up to $2.5 \\times 10^4$ times larger than those permitted by explicit methods, resulting in a 2500x speedup in 1D--2V simulations of parallel transport with kinetic ions and Boltzmann electrons. Additionally, a reduced bounce-averaged model for a square mirror is implemented to support the computationally intensive fully kinetic simulations. The bounce-averaged formulation is used to evaluate the numerical convergence of the velocity-space discretization algorithms and to assess the role of the collision model by comparing simulations employing the nonlinear Fokker--Planck and the simplified Lenard--Bernstein--Dougherty collision operators.",
    "authors": [
      "M. Dorf",
      "M. Dorr",
      "V. Geyko",
      "D. Ghosh",
      "M. Umansky",
      "J. Angus"
    ],
    "published": "2025-07-26T01:04:25Z",
    "updated": "2025-10-08T00:33:47Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.06519v1",
    "url": "https://arxiv.org/abs/2510.06519v1",
    "pdf_url": "https://arxiv.org/pdf/2510.06519v1.pdf",
    "title": "Long wave infrared detection using probabilistic spintronic bolometer   arrays",
    "abstract": "The use of probabilistic spintronic devices for infrared radiation detection has introduced a shift in approach to thermal imaging. The integration of probabilistic magnetic tunnel junctions with infrared plasmonic nano-antennas achieves high-sensitivity digital-mode infrared sensors at room temperature. Here, we present a scalable approach towards multipixel plasmonic-spintronic bolometer array fabrication and readout. We fabricate proof-of-concept 2x2 row-column multiplexed probabilistic plasmonic sprintronic arrays and show their response to long-wave infrared radiation (8-14um) with high readout speeds (10K-1M counts per second). These spintronic, ultrafast, nanoscale (SUN) bolometers can result in novel high-pixel density CMOS compatible infrared detection platforms. Our work provides a broadband (9kHz to 3GHz) readout platform for future digital probabilistic detector applications. Furthermore, our approach addresses a key challenge associated with scaling infrared pixel sizes that can drive progress towards high pixel density detector arrays for infrared sensing and microscopy applications.",
    "authors": [
      "Utkarsh Singh",
      "Leif Bauer",
      "Angshuman Deka",
      "Mohamed Mousa",
      "Daien He",
      "Sakshi Gupta",
      "Bhagwati Prasad",
      "Zubin Jacob"
    ],
    "published": "2025-10-07T23:33:33Z",
    "updated": "2025-10-07T23:33:33Z",
    "categories": [
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.12608v2",
    "url": "https://arxiv.org/abs/2509.12608v2",
    "pdf_url": "https://arxiv.org/pdf/2509.12608v2.pdf",
    "title": "The impact of Alfvenic shear flow on magnetic reconnection and   turbulence",
    "abstract": "Magnetic reconnection is a fundamental and omnipresent energy conversion process in plasma physics. Novel observations of fields and particles from Parker Solar Probe (PSP) have shown the absence of reconnection in a large number of current sheets in the near-Sun solar wind. Using near-Sun observations from PSP Encounters 4 to 11 (Jan 2020 to March 2022), we investigate whether reconnection onset might be suppressed by velocity shear. We compare estimates of the tearing mode growth rate in the presence of shear flow for time periods identified as containing reconnecting current sheets versus non-reconnecting times, finding systematically larger growth rates for reconnection periods. Upon examination of the parameters associated with reconnection onset, we find that 85% of the reconnection events are embedded in slow, non-Alfvenic wind streams. We compare with fast, slow non-Alfvenic, and slow Alfvenic streams, finding that the growth rate is suppressed in highly Alfvenic fast and slow wind and reconnection is not seen in these wind types, as would be expected from our theoretical expressions. These wind streams have strong Alfvenic flow shear, consistent with the idea of reconnection suppression by such flows. This could help explain the frequent absence of reconnection events in the highly Alfvenic, near-Sun solar wind observed by PSP. Finally, we find a steepening of both the trace and magnitude magnetic field spectra within reconnection periods in comparison to ambient wind. We tie this to the dynamics of relatively balanced turbulence within these reconnection periods and the potential generation of compressible fluctuations.",
    "authors": [
      "Tamar Ervin",
      "Alfred Mallet",
      "Stefan Eriksson",
      "M. Swisdak",
      "James Juno",
      "Orlando M. Romeo",
      "Tai Phan",
      "Trevor A. Bowen",
      "Roberto Livi",
      "Phyllis L. Whittlesey",
      "Davin E. Larson",
      "Stuart D. Bale"
    ],
    "published": "2025-09-16T03:11:53Z",
    "updated": "2025-10-07T23:12:50Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph",
    "doi": "10.3847/2041-8213/ae0b56 10.3847/2041-8213/ae0b56 10.3847/2041-8213/ae0b56"
  },
  {
    "arxiv_id": "2510.06510v1",
    "url": "https://arxiv.org/abs/2510.06510v1",
    "pdf_url": "https://arxiv.org/pdf/2510.06510v1.pdf",
    "title": "Influence of Solar Sails on Magnetic Field Measurements in Space Plasmas",
    "abstract": "Solar sail technology is ready to be deployed in a satellite mission carrying a science-grade magnetometer. In preparation for such a mission, it is essential to characterize the interactions between the sail and the ambient plasma that could affect the magnetometer readings. The solar wind magnetic field is a key parameter in space weather prediction, because it governs the energy-releasing magnetic reconnection process at Earth's magnetopause. This paper investigates the influence of solar sails on the ambient magnetic field, particularly focusing on two critical electromagnetic effects: eddy currents and magnetic pileup. We find the induced eddy currents in the metallic sail can significantly perturb the local magnetic field at high frequencies. We also suggest that magnetic pileup can influence the spacecraft's environment when the sail size is comparable to the electron kinetic scales of the surrounding plasma. This research provides an initial guide for determining when sail-plasma interactions could impact magnetometer performance.",
    "authors": [
      "Konstantinos Horaites",
      "Juan V. Rodriguez",
      "Ying Liu"
    ],
    "published": "2025-10-07T23:04:15Z",
    "updated": "2025-10-07T23:04:15Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2510.06500v1",
    "url": "https://arxiv.org/abs/2510.06500v1",
    "pdf_url": "https://arxiv.org/pdf/2510.06500v1.pdf",
    "title": "Study of few-electron backgrounds in the LUX-ZEPLIN detector",
    "abstract": "The LUX-ZEPLIN (LZ) experiment aims to detect rare interactions between dark matter particles and xenon. Although the detector is designed to be the most sensitive to GeV/$c^2$--TeV/$c^2$ Weakly Interacting Massive Particles (WIMPs), it is also capable of measuring low-energy ionization signals down to a single electron that may be produced by scatters of sub-GeV/$c^2$ dark matter. The major challenge in exploiting this sensitivity is to understand and suppress the ionization background in the few-electron regime. We report a characterization of the delayed electron backgrounds following energy depositions in the LZ detector under different detector conditions. In addition, we quantify the probability for photons to be emitted in coincidence with electron emission from the high voltage grids. We then demonstrate that spontaneous grid electron emission can be identified and rejected with a high efficiency using a coincident photon tag, which provides a tool to improve the sensitivity of future dark matter searches.",
    "authors": [
      "D. S. Akerib",
      "A. K. Al Musalhi",
      "F. Alder",
      "J. Almquist",
      "C. S. Amarasinghe",
      "A. Ames",
      "T. J. Anderson",
      "N. Angelides",
      "H. M. Araújo",
      "J. E. Armstrong",
      "M. Arthurs",
      "A. Baker",
      "S. Balashov",
      "J. Bang",
      "J. W. Bargemann",
      "E. E. Barillier",
      "K. Beattie",
      "T. Benson",
      "A. Bhatti",
      "T. P. Biesiadzinski",
      "H. J. Birch",
      "E. Bishop",
      "G. M. Blockinger",
      "B. Boxer",
      "C. A. J. Brew",
      "P. Brás",
      "S. Burdin",
      "M. C. Carmona-Benitez",
      "M. Carter",
      "A. Chawla",
      "H. Chen",
      "Y. T. Chin",
      "N. I. Chott",
      "S. C. Contreras",
      "M. V. Converse",
      "R. Coronel",
      "A. Cottle",
      "G. Cox",
      "D. Curran",
      "C. E. Dahl",
      "I. Darlington",
      "S. Dave",
      "A. David",
      "J. Delgaudio",
      "S. Dey",
      "L. de Viveiros",
      "L. Di Felice",
      "C. Ding",
      "J. E. Y. Dobson",
      "E. Druszkiewicz",
      "S. Dubey",
      "C. L. Dunbar",
      "S. R. Eriksen",
      "A. Fan",
      "N. M. Fearon",
      "N. Fieldhouse",
      "S. Fiorucci",
      "H. Flaecher",
      "E. D. Fraser",
      "T. M. A. Fruth",
      "R. J. Gaitskell",
      "A. Geffre",
      "J. Genovesi",
      "C. Ghag",
      "A. Ghosh",
      "R. Gibbons",
      "S. Gokhale",
      "J. Green",
      "M. G. D. van der Grinten",
      "J. J. Haiston",
      "C. R. Hall",
      "T. Hall",
      "E. Hartigan-O'Connor",
      "S. J. Haselschwardt",
      "M. A. Hernandez",
      "S. A. Hertel",
      "G. J. Homenides",
      "M. Horn",
      "D. Q. Huang",
      "D. Hunt",
      "E. Jacquet",
      "R. S. James",
      "K. Jenkins",
      "A. C. Kaboth",
      "A. C. Kamaha",
      "M. K. Kannichankandy",
      "D. Khaitan",
      "A. Khazov",
      "J. Kim",
      "Y. D. Kim",
      "J. Kingston",
      "D. Kodroff",
      "E. V. Korolkova",
      "H. Kraus",
      "S. Kravitz",
      "L. Kreczko",
      "V. A. Kudryavtsev",
      "C. Lawes",
      "D. S. Leonard",
      "K. T. Lesko",
      "C. Levy",
      "J. Lin",
      "A. Lindote",
      "W. H. Lippincott",
      "J. Long",
      "M. I. Lopes",
      "W. Lorenzon",
      "C. Lu",
      "S. Luitz",
      "P. A. Majewski",
      "A. Manalaysay",
      "R. L. Mannino",
      "C. Maupin",
      "M. E. McCarthy",
      "G. McDowell",
      "D. N. McKinsey",
      "J. McLaughlin",
      "J. B. Mclaughlin",
      "R. McMonigle",
      "B. Mitra",
      "E. Mizrachi",
      "M. E. Monzani",
      "E. Morrison",
      "B. J. Mount",
      "M. Murdy",
      "A. St. J. Murphy",
      "H. N. Nelson",
      "F. Neves",
      "A. Nguyen",
      "C. L. O'Brien",
      "I. Olcina",
      "K. C. Oliver-Mallory",
      "J. Orpwood",
      "K. Y Oyulmaz",
      "K. J. Palladino",
      "N. J. Pannifer",
      "N. Parveen",
      "S. J. Patton",
      "B. Penning",
      "G. Pereira",
      "E. Perry",
      "T. Pershing",
      "A. Piepke",
      "S. S. Poudel",
      "Y. Qie",
      "J. Reichenbacher",
      "C. A. Rhyne",
      "G. R. C. Rischbieter",
      "E. Ritchey",
      "H. S. Riyat",
      "R. Rosero",
      "T. Rushton",
      "D. Rynders",
      "S. Saltão",
      "D. Santone",
      "A. B. M. R. Sazzad",
      "R. W. Schnee",
      "G. Sehr",
      "B. Shafer",
      "S. Shaw",
      "K. Shi",
      "T. Shutt",
      "C. Silva",
      "G. Sinev",
      "J. Siniscalco",
      "A. M. Slivar",
      "R. Smith",
      "V. N. Solovov",
      "P. Sorensen",
      "J. Soria",
      "A. Stevens",
      "T. J. Sumner",
      "A. Swain",
      "M. Szydagis",
      "D. R. Tiedt",
      "M. Timalsina",
      "Z. Tong",
      "D. R. Tovey",
      "J. Tranter",
      "M. Trask",
      "M. Tripathi",
      "A. Usón",
      "A. C. Vaitkus",
      "O. Valentino",
      "V. Velan",
      "A. Wang",
      "J. J. Wang",
      "Y. Wang",
      "L. Weeldreyer",
      "T. J. Whitis",
      "K. Wild",
      "L. Wolf",
      "F. L. H. Wolfs",
      "S. Woodford",
      "D. Woodward",
      "C. J. Wright",
      "Q. Xia",
      "J. Xu",
      "Y. Xu",
      "M. Yeh",
      "D. Yeum",
      "W. Zha",
      "H. Zhang",
      "T. Zhang"
    ],
    "published": "2025-10-07T22:31:42Z",
    "updated": "2025-10-07T22:31:42Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.06491v1",
    "url": "https://arxiv.org/abs/2510.06491v1",
    "pdf_url": "https://arxiv.org/pdf/2510.06491v1.pdf",
    "title": "CCAT: Readout of over 10,000 280 GHz KIDs in Mod-Cam using RFSoC   Electronics",
    "abstract": "Over the past decade, kinetic inductance detectors (KIDs) have emerged as a viable superconducting technology for astrophysics at millimeter and submillimeter wavelengths. KIDs spanning 210 - 850 GHz across seven instrument modules will be deployed in the Prime-Cam instrument of CCAT Observatory's Fred Young Submillimeter Telescope at an elevation of 5600 m on Cerro Chajnantor in Chile's Atacama Desert. The natural frequency-division multiplexed readout of KIDs allows hundreds of detectors to be coupled to a single radio frequency (RF) transmission line, but requires sophisticated warm readout electronics. The FPGA-based Xilinx ZCU111 radio frequency system on chip (RFSoC) offers a promising and flexible solution to the challenge of warm readout. CCAT uses custom packaged RFSoCs to read out KIDs in the Prime-Cam instrument. Each RFSoC can simultaneously read out four RF channels with up to 1,000 detectors spanning a 512 MHz bandwidth per channel using the current firmware. We use five RFSoCs to read out the >10,000 KIDs in the broadband 280 GHz instrument module inside a testbed receiver. Here, we describe and demonstrate the readout software and pipeline for the RFSoC system. We also present the preliminary averaged spectral responses of the 280 GHz instrument module using KIDs from the TiN array and the first Al array as a demonstration of the end-to-end performance of the readout and optical systems. These measurements demonstrate the foundation that will enable us to simultaneously read out over 10,000 KIDs with the RFSoC and represent a critical step toward reading out the ~100,000 KIDs in Prime-Cam in its future full capacity configuration.",
    "authors": [
      "Darshan A. Patel",
      "Yuhan Wang",
      "Cody J. Duell",
      "Jason E. Austermann",
      "James Beall",
      "James R. Burgoyne",
      "Scott Chapman",
      "Steve K. Choi",
      "Rodrigo G. Freundt",
      "Eliza Gazda",
      "Christopher Groppi",
      "Zachary B. Huber",
      "Johannes Hubmayr",
      "Ben Keller",
      "Lawerence T. Lin",
      "Philip Mauskopf",
      "Alicia Middleton",
      "Michael D. Niemack",
      "Cody Roberson",
      "Adrian K. Sinclair",
      "Ema Smith",
      "Jeff van Lanen",
      "Anna Vaskuri",
      "Benjamin J. Vaughan",
      "Eve M. Vavagiakis",
      "Michael Vissers",
      "Samantha Walker",
      "Jordan Wheeler",
      "Ruixuan",
      "Xie"
    ],
    "published": "2025-10-07T22:08:29Z",
    "updated": "2025-10-07T22:08:29Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2510.07348v1",
    "url": "https://arxiv.org/abs/2510.07348v1",
    "pdf_url": "https://arxiv.org/pdf/2510.07348v1.pdf",
    "title": "Bioinspired Tapered-Spring Turbulence Sensor for Underwater Flow   Detection",
    "abstract": "This paper presents a bio-inspired underwater whisker sensor for robust hydrodynamic disturbance detection and efficient signal analysis based on Physical Reservoir Computing (PRC). The design uses a tapered nylon spring with embedded accelerometers to achieve spatially distributed vibration sensing and frequency separation along the whisker. Towing-tank experiments and computational fluid dynamics simulations confirmed that the whisker effectively distinguishes vortex regimes across different fin angles and maintains Strouhal scaling with flow velocity, where higher speeds increase vibration intensity without affecting the dominant frequencies. Frequency-domain analysis, Shannon entropy, and machine learning further validated the sensing performance: vortex shedding frequencies were identified with less than 10\\% error, entropy captured the transition from coherent vortex streets to turbulence, and logistic regression achieved 86.0\\% classification accuracy with millisecond-level inference. These results demonstrate that structurally encoded whisker sensing provides a scalable and real-time solution for underwater perception, wake tracking, and turbulence-aware navigation in autonomous marine robots.",
    "authors": [
      "Xiao Jin",
      "Zhenhua Yu",
      "Thrishantha Nanayakkara"
    ],
    "published": "2025-10-07T21:23:09Z",
    "updated": "2025-10-07T21:23:09Z",
    "categories": [
      "physics.ins-det",
      "cs.RO",
      "physics.flu-dyn"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.26586v2",
    "url": "https://arxiv.org/abs/2509.26586v2",
    "pdf_url": "https://arxiv.org/pdf/2509.26586v2.pdf",
    "title": "Supergranulation and poleward migration of the magnetic field at high   latitudes of the Sun",
    "abstract": "Magnetoconvection at the solar surface governs the dynamics in the upper solar atmosphere and sustains the heliosphere. Properties of this fundamental process are poorly described near the solar poles. Here we report the first out-of-ecliptic remote-sensing observations of the south pole of the Sun from a high-latitude campaign of the Solar Orbiter spacecraft which reveal spatial and temporal evolution of supergranular convective cells. The supergranular cells have spatial scales of 20--40 Mm. From eight days of observations starting on 2025 March 16, our analysis shows that the magnetic network migrates poleward, on average, at high latitudes (above 60\\textdegree), with speeds in the range of 10--20 m s$^{-1}$, depending on the structures being tracked. These results shed light on the buildup of the polar magnetic field that is central to our understanding of the solar cycle and the heliospheric magnetic field.",
    "authors": [
      "L. P. Chitta",
      "D. Calchetti",
      "J. Hirzberger",
      "G. Valori",
      "E. R. Priest",
      "S. K. Solanki",
      "D. Berghmans",
      "C. Verbeeck",
      "E. Kraaikamp",
      "K. Albert",
      "T. Appourchaux",
      "F. J. Bailén",
      "L. R. Bellot Rubio",
      "J. Blanco Rodríguez",
      "A. Feller",
      "A. Gandorfer",
      "L. Gizon",
      "A. Lagg",
      "A. Moreno Vacas",
      "D. Orozco Suárez",
      "J. Schou",
      "U. Schühle",
      "J. Sinjan",
      "H. Strecker",
      "R. Volkmer",
      "J. Woch",
      "X. Li",
      "T. Oba",
      "A. Ulyanov"
    ],
    "published": "2025-09-30T17:43:25Z",
    "updated": "2025-10-07T20:28:41Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2510.04777v2",
    "url": "https://arxiv.org/abs/2510.04777v2",
    "pdf_url": "https://arxiv.org/pdf/2510.04777v2.pdf",
    "title": "Performance and long-term aging studies on Eco-Friendly Resistive Plate   Chamber detectors",
    "abstract": "Resistive Plate Chambers detectors are extensively used in several domains of Physics. In High Energy Physics, they are typically operated in avalanche mode with a high-performance gas mixture based on Tetrafluoroethane (C2H2F4), a fluorinated high Global Warming Potential greenhouse gas. The RPC EcoGas@GIF++ Collaboration has pursued an intensive R\\&D activity to search for new gas mixtures with low environmental impact, fulfilling the performance expected for the LHC operations as well as for future and different applications. Here, results obtained with new eco-friendly gas mixtures based on Tetrafluoropropene and carbon dioxide, even under high-irradiation conditions, will be presented. Long-term aging tests carried out at the CERN Gamma Irradiation Facility will be discussed along with their possible limits and future perspectives.",
    "authors": [
      "D. Ahmadi",
      "M. Tytgat"
    ],
    "published": "2025-10-06T12:53:05Z",
    "updated": "2025-10-07T17:37:42Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.06150v1",
    "url": "https://arxiv.org/abs/2510.06150v1",
    "pdf_url": "https://arxiv.org/pdf/2510.06150v1.pdf",
    "title": "Simulation of Muon-induced Backgrounds for the Colorado Underground   Research Institute (CURIE)",
    "abstract": "We present a comprehensive Monte Carlo simulation of muon-induced backgrounds for the Colorado Underground Research Institute (CURIE), a shallow-underground facility with $\\approx 415$~m.w.e. overburden. Using coupled \\textsc{mute} and \\textsc{geant4} frameworks, we characterize the production and transport of muon-induced secondaries through site-specific rock compositions and geometries, establishing a proof-of-concept for high-precision, end-to-end simulations. Our simulations employ angular-dependent muon energy distributions, which improve secondary flux accuracy. For the Subatomic Particle Hideout and Cryolab I research spaces, we predict total muon-induced neutron fluxes of $(3.78 \\pm 0.61_{\\text{sys}}) \\times 10^{-3}$~m$^{-2}$s$^{-1}$ and $(3.97 \\pm 0.65_{\\text{sys}}) \\times 10^{-3}$~m$^{-2}$s$^{-1}$, respectively, consistent with empirical depth parameterizations. The simulated neutron energy spectra exhibit the expected thermal, epithermal, evaporation, and spallation components extending to GeV energies. Electromagnetic backgrounds are expected to dominate the total flux, with $\\gamma$-ray components of $(5.54 \\pm 0.91_{\\text{sys}}) \\times 10^{-1}$~m$^{-2}$s$^{-1}$ and $(6.51 \\pm 1.06_{\\text{sys}}) \\times 10^{-1}$~m$^{-2}$s$^{-1}$ for the Subatomic Particle Hideout and Cryolab I facilities, respectively. These results provide quantitative background predictions for experimental design and sensitivity projections at shallow- and deep-underground facilities. They further demonstrate that local geology and overburden geometry influence muon-induced secondary yields and energy spectra, emphasizing the need for site-specific simulations for accurate underground background characterization. Therefore, the simulation framework has been made publicly available for the broader low-background physics community to enable meaningful inter-facility comparisons.",
    "authors": [
      "Dakota K. Keblbeck",
      "Eric Mayotte",
      "Uwe Greife",
      "Kyle G. Leach",
      "Wouter Van De Pontseele",
      "Caitlyn Stone-Whitehead",
      "Luke Wanner",
      "Grace Wagner"
    ],
    "published": "2025-10-07T17:21:18Z",
    "updated": "2025-10-07T17:21:18Z",
    "categories": [
      "hep-ex",
      "physics.comp-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2509.11255v2",
    "url": "https://arxiv.org/abs/2509.11255v2",
    "pdf_url": "https://arxiv.org/pdf/2509.11255v2.pdf",
    "title": "PhysDNet: Physics-Guided Decomposition Network of Side-Scan Sonar   Imagery",
    "abstract": "Side-scan sonar (SSS) has become an essential tool for seafloor mapping and underwater exploration. However, the measured intensity is entangled with seabed reflectivity, terrain elevation, and acoustic path loss, making the imagery highly view dependent and hindering robust interpretation. To address this challenge, we propose PhysDNet, a physics-guided multi-branch network that explicitly decouples SSS images into three interpretable fields: reflectivity, elevation, and path loss. The network employs attention augmented encoder decoder branches, imposes range wise consistency constraints on path loss, and incorporates a Lambertian based reconstruction to enable progressive selfsupervised training, thereby ensuring stable multi-task optimization while embedding physical priors into the learning process. Experiments demonstrate that the decomposed fields preserve geological structures, recover physically consistent illumination and attenuation, and enable accurate shadow prediction. These findings confirm that physics guided decomposition establishes a stable and interpretable domain for SSS analysis, enhancing both physical consistency and downstream applications such as registration and shadow interpretation.",
    "authors": [
      "Can Lei",
      "Hayat Rajani",
      "Nuno Gracias",
      "Rafael Garcia",
      "Huigang Wang"
    ],
    "published": "2025-09-14T12:54:42Z",
    "updated": "2025-10-07T16:27:38Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  }
]