{
  "arxiv_id": "2602.22172v1",
  "url": "https://arxiv.org/abs/2602.22172v1",
  "pdf_url": "https://arxiv.org/pdf/2602.22172v1.pdf",
  "title": "Effects of realistic laser intensity and phase distribution on high-charge laser wakefield acceleration",
  "abstract": "Laser wakefield acceleration (LWFA) can produce relativistic electron beams and various secondary particles in centimeter-long plasmas, making it a valuable particle source with important applications in many disciplines. In this work, we examine the effects of non-ideal transverse intensity and phase distribution of laser pulses on LWFA through both experimental measurements and particle-in-cell simulations. The complex transverse profile of the 75 TW laser pulses reduces the self-focused intensity in plasma compared with a transversely Gaussian laser. Furthermore, the sheath structure of the nonlinear plasma wake excited by realistic laser pulses is wider and more complicated than that of a Gaussian laser. These hinder the injection of the plasma electrons. As the laser pulse propagates through the plasma, its intensity profile gradually becomes elliptical and drives a plasma wake with a sharp sheath near the azimuths of the major axis, leading to an injection. When using a realistic laser profile in simulations, both the charge and energy of injected electrons closely match experimental results ($\\sim200$ pC of charge and $\\sim 200$ MeV peak energy), whereas the Gaussian laser simulations produce much higher charge ($\\sim500$ pC). Our findings reveal the difference in injection dynamics between LWFA driven by non-ideal laser pulses and those driven by Gaussian pulses, and are useful for applications of LWFA which demand high-charge electron beams.",
  "authors": [
    "Yuhui Xia",
    "Zhenan Wang",
    "Ziyao Tang",
    "Jianghao Hu",
    "Qianyi Ma",
    "Yuekai Chen",
    "Letian Liu",
    "Zhiyan Yang",
    "Hui Zhang",
    "Chenxu Wang",
    "Haoyang Lan",
    "Di Wu",
    "Xiuhong Yang",
    "Yixing Geng",
    "Yanying Zhao",
    "Xueqin Yan",
    "Xinlu Xu"
  ],
  "published": "2026-02-25T18:18:18Z",
  "updated": "2026-02-25T18:18:18Z",
  "categories": [
    "physics.plasm-ph",
    "physics.acc-ph"
  ],
  "primary_category": "physics.plasm-ph"
}