{
  "arxiv_id": "2502.05975v2",
  "url": "https://arxiv.org/abs/2502.05975v2",
  "pdf_url": "https://arxiv.org/pdf/2502.05975v2.pdf",
  "title": "Comparison of the detector response and calibration function of metallic   microcalorimeters for X-ray photons and external electrons",
  "abstract": "Metallic microcalorimeters (MMCs) are cryogenic single-particle detectors that rely on a calorimetric detection principle. Due to their excellent energy resolution, close-to-ideal linear detector response, fast signal rise time and the potential for \\SI{100}{\\%} quantum efficiency, MMCs outperform conventional detectors by several orders of magnitude in resolution. These attributes make them particularly interesting for a broad spectrum of applications, including a next-generation neutrino mass experiment based on the measurement of the tritium beta-decay spectrum, with an objective of achieving a sensitivity surpassing that of the pioneering KATRIN experiment. However, although MMCs have been used in measurements of photons and heavy ions with great success, no information is currently available on the interaction between MMCs and external light charged particles such as electrons. This work aims to provide such missing information and to demonstrate that MMC-based detectors are suitable for high-resolution spectroscopy of external electron sources. Particularly, we present the first-ever measurements of external electrons using a metallic microcalorimeter, comprehensively discuss the characteristics of the signal shape and the calibration function and give a direct comparison between well-defined conversion electron and X-ray photon signals from the same $^{83}$Rb/$^{83m}$Kr source.",
  "authors": [
    "Neven Kovac",
    "Fabienne Adam",
    "Sebastian Kempf",
    "Marie-Christin Langer",
    "Michael Müller",
    "Rudolf Sack",
    "Magnus Schlösser",
    "Markus Steidl",
    "Kathrin Valerius"
  ],
  "published": "2025-02-09T18:05:08Z",
  "updated": "2025-10-10T15:31:54Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.1016/j.nima.2025.170662"
}