{
  "arxiv_id": "2510.11024v1",
  "url": "https://arxiv.org/abs/2510.11024v1",
  "pdf_url": "https://arxiv.org/pdf/2510.11024v1.pdf",
  "title": "Improved Pixel-wise Calibration for Charge-Integrating Hybrid Pixel   Detectors with Performance Validation",
  "abstract": "The M\\\"ONCH hybrid pixel detector, with a 25 \\textmu m pixel pitch and fast charge-integrating readout, has demonstrated subpixel resolution capabilities for X-ray imaging and deep learning-based electron localization in electron microscopy. Fully exploiting this potential requires extensive calibration to ensure both linearity and uniformity of the pixel response, which is challenging for detectors with a large dynamic range. To overcome the limitations of conventional calibration methods, we developed an accurate and efficient correction method to achieve pixel-wise gain and nonlinearity calibration based on the backside pulsing technique. A three-dimensional lookup table was generated for all pixels across the full dynamic range, mapping the pixel response to a calibrated linear energy scale. Compared with conventional linear calibration, the proposed method yields negligible deviations between the calibrated and nominal energies for photons and electrons. The improvement in energy resolution ranges from 4% to 22% for 15-25 keV photons and from 16% to 23% for 60-200 keV electrons. Deep learning-based electron localization demonstrates a 4% improvement in spatial resolution when using the proposed calibration method. This approach further enables rapid diagnosis of the cause of bad pixels and estimation of bump-bonding yield.",
  "authors": [
    "X. Xie",
    "A. Bergamaschi",
    "M. Brückner",
    "M. Carulla",
    "R. Dinapoli",
    "S. Ebner",
    "K. Ferjaoui",
    "E. Fröjdh",
    "V. Gautam",
    "D. Greiffenberg",
    "S. Hasanaj",
    "J. Heymes",
    "V. Hinger",
    "M. Hürst",
    "V. Kedych",
    "T. King",
    "S. Li",
    "C. Lopez-Cuenca",
    "A. Mazzoleni",
    "D. Mezza",
    "K. Moustakas",
    "A. Mozzanica",
    "J. Mulvey",
    "M. Müller",
    "K. A. Paton",
    "C. Posada Soto",
    "C. Ruder",
    "B. Schmitt",
    "P. Sieber",
    "S. Silletta",
    "D. Thattil",
    "J. Zhang"
  ],
  "published": "2025-10-13T05:42:55Z",
  "updated": "2025-10-13T05:42:55Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}