{
  "arxiv_id": "2510.09198v1",
  "url": "https://arxiv.org/abs/2510.09198v1",
  "pdf_url": "https://arxiv.org/pdf/2510.09198v1.pdf",
  "title": "Crab-waist interaction region design and integration for the Super   Tau-Charm Facility",
  "abstract": "The Super Tau-Charm Facility (STCF) is a new-generation $e^+e^-$ collider proposed in China, designed to operate in the center-of-mass (CoM) energy range of 2-7 GeV. To achieve the design luminosity exceeding 5*10^34 cm^-2s^-1 at the optimal CoM energy of 4 GeV, a large crossing angle combined with the crab-waist correction scheme is adopted. However, this scheme introduces strong nonlinearities in the interaction region (IR) due to the extremely low vertical beta function of beta_y* <=1 mm, which significantly limits dynamic and momentum apertures of the collider ring. This paper presents a comprehensive modular optics design that addresses these challenges through several key features: 1) local chromaticity correction up to third order to enhance momentum bandwidth; 2) exact -I transformation between chromatic sextupole pairs for nonlinear cancellation; 3) minimization of the dispersion invariant along the IR to improve local momentum acceptance; 4) optimized beta functions at crab sextupole locations to reduce strength requirements and associated nonlinearities. Resonance driving terms analysis confirms effective suppression of geometric aberrations while preserving the intended crab-waist effects. When integrated into the collider ring, the design achieves a Touschek lifetime exceeding 300 s at beam energy of 2 GeV, meeting STCF requirements. The impact of fringe fields from superconducting quadrupoles is mitigated using octupole correctors, and detector solenoid effects are fully suppressed via local anti-solenoid compensation. Furthermore, the defined machine-detector interface layout ensures minimal synchrotron radiation background at the IP beryllium chamber, while ultra-high vacuum conditions are required to suppress beam-gas background. This IR design represents the current optimal solution for STCF and has been incorporated into the project's conceptual design report.",
  "authors": [
    "Linhao Zhang",
    "Tao Liu",
    "Ye Zou",
    "Penghui Yang",
    "Demin Zhou",
    "Jiancong Bao",
    "Ze Yu",
    "Yuhan Jin",
    "Yihao Mo",
    "Sangya Li",
    "Tianlong He",
    "Qing Luo",
    "Jingyu Tang"
  ],
  "published": "2025-10-10T09:39:49Z",
  "updated": "2025-10-10T09:39:49Z",
  "categories": [
    "physics.acc-ph"
  ],
  "primary_category": "physics.acc-ph"
}