{
  "arxiv_id": "2510.09727v1",
  "url": "https://arxiv.org/abs/2510.09727v1",
  "pdf_url": "https://arxiv.org/pdf/2510.09727v1.pdf",
  "title": "Neutron production with a 10 kW HiCANS based on SATELIT, a CEA-Saclay   target with liquid lithium",
  "abstract": "High-Current Accelerator-driven Neutron Sources (HiCANS) are currently under development across Europe to address the shortage of medium-scale neutron sources, as many research nuclear reactors have been decommissioned over the past several years. At CEA-Saclay, a HiCANS has been developed utilizing the IPHI accelerator, which delivers a 3 MeV proton beam with a current of up to 100 mA, and the CEA-Saclay liquid lithium target named SATELIT. In 2024-2025, a successful experimental campaign was conducted, during which a 10 kW proton beam was directed at the liquid lithium target for nearly 100 h to generate neutrons via the 7Li(p,n)7Be nuclear reaction. Throughout the experimental campaign, a total deposited beam power of 840~kW.h was accumulated, including two continuous operational days exceeding 11 h each. A polyethylene moderator coupled with SATELIT enabled the extraction of a thermal neutron beam, with a flux measured at 1.4 m from the extraction point exceeding $10^6$ n.cm$^{-2}$.s$^{-1}$, which is sufficient for numerous neutron applications. The next step for the long-term operation of this facility involves developing strategies to mitigate the radiological concerns associated with the accumulation of 7Be within the system. Overall, this work demonstrates that such facilities can play a significant role in the future of medium-scale neutron sources in Europe.",
  "authors": [
    "L. Thulliez",
    "N. Berton",
    "R. Boudouin",
    "N. Cavalière",
    "S. Cazaux",
    "T. Chaminade",
    "N. Chauvin",
    "D. Chirpaz",
    "J. -L. Courouau",
    "Q. Cridling",
    "P. Daniel-Thomas",
    "J. Darpentigny",
    "G. Debras",
    "G. Disset",
    "A. Drouart",
    "E. Dumonteil",
    "R. Duperrier",
    "R. Ferdinand",
    "E. Giner Demange",
    "J. -C. Guillard",
    "N. Jonqueres",
    "T. Lebrun",
    "D. Loiseau",
    "J. Mendes",
    "B. Mom",
    "F. Ott",
    "C. Péron",
    "J. Phocas",
    "Y. Reinert",
    "A. Roger",
    "Y. Sauce",
    "F. Senée",
    "M. Trocmé",
    "C. Veyssière",
    "D. Vurpillot",
    "X. Wohleber"
  ],
  "published": "2025-10-10T09:46:30Z",
  "updated": "2025-10-10T09:46:30Z",
  "categories": [
    "physics.acc-ph",
    "nucl-ex"
  ],
  "primary_category": "physics.acc-ph"
}