{
  "arxiv_id": "2510.11612v1",
  "url": "https://arxiv.org/abs/2510.11612v1",
  "pdf_url": "https://arxiv.org/pdf/2510.11612v1.pdf",
  "title": "Advancing Time-Resolved Spectroscopies with Custom Scanning Units and   Event-Based Electron Detection",
  "abstract": "Direct electron detection is revolutionizing electron microscopy by offering lower noise, reduced point-spread function, and increased quantum efficiency. Among these advancements, the Timepix3 hybrid-pixel direct electron detector stands out for its unique ability to output temporal information about individual hits within its pixel array. Its event-based architecture enables data-driven detection, where individual events are immediately read out from the chip. While recent studies have demonstrated the potential of event-based detectors in various applications in the context of continuous-gun scanning transmission electron microscopes (STEM), the use of such detectors with standard scanning units remains underdeveloped. In this work, we present a custom-designed, Timepix3-compatible scanning unit specifically developed to leverage the advantages of event-based detection. We explore its performance in enabling spatially and temporally resolved experiments, as well as its seamless interfacing with other time-resolved instruments, such as pulsed lasers and electron beam blankers. Additionally, we examine the prospects for achieving enhanced temporal resolution in time-resolved experiments using continuous-gun electron microscopes, identifying key challenges and proposing solutions to improve performance. This combination of custom hardware with advanced detection technology promises to expand the capabilities of electron microscopy in both fundamental research and practical applications.",
  "authors": [
    "Yves Auad",
    "Florian Castioni",
    "Jassem Baaboura",
    "Malo Bézard",
    "Jean-Denis Blazit",
    "Xiaoyan Li",
    "Adrien Teutrie",
    "Michael Walls",
    "Odile Stéphan",
    "Luiz H. G. Tizei",
    "Francisco de La Peña",
    "Mathieu Kociak"
  ],
  "published": "2025-10-13T16:50:22Z",
  "updated": "2025-10-13T16:50:22Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.1016/j.micron.2025.103925"
}