{
  "arxiv_id": "2505.06476v2",
  "url": "https://arxiv.org/abs/2505.06476v2",
  "pdf_url": "https://arxiv.org/pdf/2505.06476v2.pdf",
  "title": "A Flare-related Decimetric Type-IV Radio Burst Induced by the X2   Radiation of Electron Cyclotron Maser Emission",
  "abstract": "The radiation mechanism of decimetric wideband and pulsating radio bursts from the Sun (in terms of decimetric type-IV (t-IVdm) burst) and other flaring stars is a long-standing problem. Early investigations were based on the leading-spot hypothesis for the sun and yielded contradictory results. Here, we analyzed the flare-associated t-IVdm burst on 20110924 with medium-strong levels of polarization and from sources near a sunspot. We found that the emission is intermittent and the maximum $T_B$ exceeds 10$^{11}$ K, with well-defined upper and lower frequency cutoffs. The radio sources are left-handed polarized, located above the sunspot with a negative polarity. The sources align well with the sites of the second harmonic of the local electron gyrofrequency. These findings provide essential evidence that the burst is induced by the electron cyclotron maser emission (ECME) in the harmonic X mode. We further modeled the transport of downward-streaming energetic electrons along a coronal loop and found most electrons get mirrored within the specific altitude range of 20-100 Mm. This explains why such bursts tend to have well-defined spectral ranges. We also found the ECME-radiating energetic electrons exhibit a shell-like VDF instead of the generally-presumed loss-cone distribution. The study greatly expands the application of ECME in solar radio astronomy and provides solar samples for similar bursts from other flaring stars.",
  "authors": [
    "Maoshui Lv",
    "Ze Zhong",
    "Xiangliang Kong",
    "Hao Ning",
    "Feiyu Yu",
    "Bing Wang",
    "Baolin Tan",
    "Victor Melnikov",
    "Alexey Kuznetsov",
    "Hongqiang Song",
    "Ruisheng Zheng",
    "Yao Chen"
  ],
  "published": "2025-05-10T00:29:40Z",
  "updated": "2025-07-30T14:39:12Z",
  "categories": [
    "astro-ph.SR",
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.SR"
}