{
  "arxiv_id": "2406.10626v3",
  "url": "https://arxiv.org/abs/2406.10626v3",
  "pdf_url": "https://arxiv.org/pdf/2406.10626v3.pdf",
  "title": "A Wave-Based Simulation Model for Cross-Beam Energy Transfer and Stimulated Brillouin Scattering in Laser-Plasma Systems",
  "abstract": "We present WEBS (WavE-Based Simulations), an efficient wave-based simulation model designed to investigate the dynamic interplay between cross-beam energy transfer (CBET) and stimulated Brillouin scattering (SBS) in laser-plasma systems. By employing a unified Schrodinger-type envelope formulation for the laser and ion-acoustic waves, our model enables the use of a single, unconditionally stable Du Fort-Frankel numerical scheme, which maintains excellent long-term energy conservation even with coarse spatial grids. This approach not only achieves high computational efficiency validated against particle-in-cell simulations but also allows the selective activation or suppression of CBET and SBS processes, offering a clear diagnostic of their mutual coupling. Our simulations reveal that at high laser intensities, CBET and SBS reach a coupled steady state, leading to significant deviations from classical fluid theory predictions. Specifically, CBET gain is suppressed due to enhanced SBS reflectivity, while strong asymmetry in SBS reflectivity emerges between the interacting beams. These findings highlight regimes where the two instabilities strongly influence each other, providing critical insights for inertial confinement fusion research and offering a practical numerical tool for instability control and scenario design.",
  "authors": [
    "Y. Chen",
    "Qing Wang",
    "H. Wen",
    "Y. Z. J. Xu",
    "S. J. Peng",
    "W. Q. Li",
    "C. Y. Zheng",
    "Z. J. Liu",
    "L. H. Cao",
    "C. Z. Xiao"
  ],
  "published": "2024-06-15T13:20:09Z",
  "updated": "2025-12-12T02:43:55Z",
  "categories": [
    "physics.plasm-ph",
    "physics.comp-ph"
  ],
  "primary_category": "physics.plasm-ph"
}