{
  "arxiv_id": "2502.01945v3",
  "url": "https://arxiv.org/abs/2502.01945v3",
  "pdf_url": "https://arxiv.org/pdf/2502.01945v3.pdf",
  "title": "Cryogenic Thermal Modeling of Microwave High Density Signaling",
  "abstract": "Superconducting quantum computers require microwave control lines running from room temperature to the mixing chamber of a dilution refrigerator. Adding more lines without preliminary thermal modeling to make predictions risks overwhelming the cooling power at each thermal stage. In this paper, we investigate the thermal load of SC-086/50-SCN-CN semi-rigid coaxial cable, which is commonly used for the control and readout lines of a superconducting quantum computer, as we increase the number of lines to a quantum processor. We investigate the makeup of the coaxial cables, verify the materials and dimensions, and experimentally measure the total thermal conductivity of a single cable as a function of the temperature from cryogenic to room temperature values. We also measure the cryogenic DC electrical resistance of the inner conductor as a function of temperature, allowing for the calculation of active thermal loads due to Ohmic heating. Fitting this data produces a numerical thermal conductivity function used to calculate the static heat loads due to thermal transfer within the wires resulting from a temperature gradient. The resistivity data is used to calculate active heat loads, and we use these fits in a cryogenic model of a superconducting quantum processor in a typical Bluefors XLD1000-SL dilution refrigerator, investigating how the thermal load increases with processor sizes ranging from 100 to 225 qubits. We conclude that the theoretical upper limit of the described architecture is approximately 200 qubits. However, including an engineering margin in the cooling power and the available space for microwave readout circuitry at the mixing chamber, the practical limit is approximately 140 qubits.",
  "authors": [
    "Naomi Raicu",
    "Tom Hogan",
    "Xian Wu",
    "Mehrnoosh Vahidpour",
    "David Snow",
    "Matthew Hollister",
    "Mark Field"
  ],
  "published": "2025-02-04T02:38:24Z",
  "updated": "2025-12-12T21:30:12Z",
  "categories": [
    "quant-ph",
    "physics.ins-det"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1140/epjqt/s40507-025-00427-1"
}