{
  "arxiv_id": "2507.20413v2",
  "url": "https://arxiv.org/abs/2507.20413v2",
  "pdf_url": "https://arxiv.org/pdf/2507.20413v2.pdf",
  "title": "Electromagnetic Noise Characterization and Suppression in Low-Field MRI Systems",
  "abstract": "Purpose: Low-field MRI systems operate at single MHz-range frequencies, where signal losses are primarily dominated by thermal noise from the radio-frequency (RF) receive coils. Achieving operation close to this limit is essential for maximizing imaging performance and signal-to-noise ratio (SNR). However, electromagnetic interference (EMI) from cabling, electronics, and patient loading often degrades system performance. Our goal is to develop and validate a practical protocol that guides users in identifying and suppressing electromagnetic noise in low-field MRI systems, enabling operation near the thermal noise limit.   Methods: We present a systematic, stepwise methodology that includes diagnostic measurements, hardware isolation strategies, and good practices for cabling and shielding. Each step is validated with corresponding noise measurements under increasingly complex system configurations, both unloaded and with a human subject present.   Results: Noise levels were monitored through the incremental assembly of a low-field MRI system, revealing key sources of EMI and quantifying their impact. Final configurations achieved noise within 1.5x the theoretical thermal bound with a subject in the scanner. Image reconstructions illustrate the direct relationship between system noise and image quality.   Conclusion: The proposed protocol enables low-field MRI systems to operate close to fundamental noise limits in realistic conditions. The framework also provides actionable guidance for the integration of additional system components, such as gradient drivers and automatic tuning networks, without compromising SNR.",
  "authors": [
    "Teresa Guallart-Naval",
    "José M. Algarín",
    "Joseba Alonso"
  ],
  "published": "2025-07-27T21:13:27Z",
  "updated": "2025-12-12T17:32:19Z",
  "categories": [
    "physics.med-ph",
    "physics.ins-det"
  ],
  "primary_category": "physics.med-ph"
}