{
  "arxiv_id": "2512.12421v1",
  "url": "https://arxiv.org/abs/2512.12421v1",
  "pdf_url": "https://arxiv.org/pdf/2512.12421v1.pdf",
  "title": "Rethinking massive multiplexing in whispering gallery mode biosensing",
  "abstract": "Accurate, label-free quantification of multiple analytes in complex biological media remains a major challenge due to limited multiplexing, signal cross-correlations, and inconsistency across sensor samples and measurement runs. We introduce a multiplexed whispering-gallery-mode (WGM) biosensing framework that overcomes these barriers by jointly advancing photonic integration and data analytics. Our glass-chip platform enables massive, parallelized and flexible multiplexing of >10000 microresonators organized into up to 100 sensing channels, with universal and modular chip design and detection hardware, while maintaining loaded Q-factors of 10^6. Our novel hybrid deep-learning framework BioCCF that integrates domain adaptation with cross-channel fusion enables harmonization of responses across sensing chips and extraction of nonlinear correlations in complex mixtures. Using a highly heterogeneous dataset comprising over 200 hours of sensing data acquired from nine chips with different channel configurations, biological replicates, and repeated regeneration cycles, we demonstrate recalibration-free identification of solution (99.3\\% accuracy) and quantification of immunoglobulin G components with relative prediction error of 10^-4 under 5 min. The affordability and modularity of the platform enable distributed data acquisition and aggregation into shared repositories, providing a pathway toward continuously improving model generalization, cross-validation and a scalable, community-driven paradigm for biosensing.",
  "authors": [
    "Ivan Saetchnikov",
    "Elina Tcherniavskaia",
    "Andreas Ostendorf",
    "Anton Saetchnikov"
  ],
  "published": "2025-12-13T18:21:36Z",
  "updated": "2025-12-13T18:21:36Z",
  "categories": [
    "physics.optics",
    "physics.bio-ph",
    "physics.chem-ph",
    "physics.data-an",
    "physics.ins-det"
  ],
  "primary_category": "physics.optics"
}