{
  "arxiv_id": "2512.11126v1",
  "url": "https://arxiv.org/abs/2512.11126v1",
  "pdf_url": "https://arxiv.org/pdf/2512.11126v1.pdf",
  "title": "Experimental and Monte Carlo Simulation Studies to Investigate the Working Principle of Compact Nanodosimeters",
  "abstract": "In recent years, compact nanodosimetric detectors based on ion multiplication in low-pressure gas have been developed and gained attention in the scientific community. These detectors use strong electric fields to collect and multiply positive ions produced by the incident radiation in mm-sized cell holes in dielectric materials, achieving a nm-equivalent spatial resolution of the localization of ionization events, when scaled to liquid water with unit density. Their design assumes that ion impact ionizations of gas molecules within the cell holes dominate signal formation, yet this assumption has lacked direct physical verification. Electron emission from the cell hole walls due to ion impact could also contribute, requiring alternative designs to optimize efficiency.   To investigate this, a nanodosimetric detector featuring a single cell hole with a diameter of 1.5 mm in a dielectric plate was developed. Ion collection and multiplication were achieved by applying a negative high voltage to the glass cathode 0.5 mm below the cell hole, assisted by a low drift field above the plate. A grounded readout electrode with a 0.8 mm hole covers the cell hole to prevent interactions of collected ions with the hole walls. High signal yields in 1 mbar and 2 mbar propane gas were observed and indicated that ion impact ionizations of the gas molecules are indeed the primary mechanism for signal induction. The compact nanodosimeter setup was further modeled with Geant4-DNA and Garfield++ for deeper insight. The results of these studies are important for understanding and developing a new class of nanodosimeters with potential applications in particle therapy, radiation protection, space dosimetry, and particle physics.",
  "authors": [
    "Victor Merza",
    "Aleksandr Bancer",
    "Vladimir Bashkirov",
    "Ana Belchior",
    "Beata Brzozowska",
    "João F. Canhoto",
    "Piotr Gasik",
    "Jaroslaw Grzyb",
    "Khaled Katmeh",
    "Marcin Pietrzak",
    "Antoni Ruciński",
    "Reinhard Schulte"
  ],
  "published": "2025-12-11T21:14:52Z",
  "updated": "2025-12-11T21:14:52Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}