{
  "arxiv_id": "2512.11478v1",
  "url": "https://arxiv.org/abs/2512.11478v1",
  "pdf_url": "https://arxiv.org/pdf/2512.11478v1.pdf",
  "title": "Numerical investigation of kinetic instabilities in BGK equilibria under collisional effects",
  "abstract": "An unstable one-dimensional Bernstein-Greene-Kruskal (BGK) mode has been studied through high-precision numerical simulations. The initial turbulent, periodic equilibrium state is obtained by solving a Vlasov-Poisson system for initially thermalized electrons, with the addition of an external electric field able to trigger undamped, high-amplitude electron acoustic waves (EAWs). Once the external field is turned off, resonant particles are trapped in a stationary two-hole phase-space configuration. This equilibrium scenario is perturbed by some large-scale density noise, leading to an electrostatic instability with the merging of vortices into a final one-hole state. Numerical runs investigate several features of this regime, focusing on the dependence of the instability trigger time and growth rate on the rate of short-range collisions and grid resolution. According to Landau theory for weakly inhomogeneous equilibria, we observe that the growth rate of the instability depends only on the slope of the distribution function in the resonant region. Conversely, the onset time of the instability is affected by the collisional rate, which is able to postpone the onset of the instability. Moreover, by extending the simulations to a long-time scale, we investigate the saturation stage of the instability, which can be analyzed through the Hermite spectral analysis. In collisionless simulations where grid effects are negligible, the Hermite spectrum follows a power law typical of a constant enstrophy flux scenario. Otherwise, if collisional effects become significant, a cutoff is observed at high Hermite modes, leading to a decaying trend.",
  "authors": [
    "Sofia Zanelli",
    "Gabriele Celebre",
    "Sergio Servidio",
    "Francesco Valentini"
  ],
  "published": "2025-12-12T11:23:51Z",
  "updated": "2025-12-12T11:23:51Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}