[
  {
    "arxiv_id": "2512.12679v1",
    "url": "https://arxiv.org/abs/2512.12679v1",
    "pdf_url": "https://arxiv.org/pdf/2512.12679v1.pdf",
    "title": "HEL1OS -- A Hard X-ray Spectrometer on Board Aditya-L1",
    "abstract": "HEL1OS (High Energy L1 Orbiting X-ray Spectrometer) is one of the remote sensing payloads on board Aditya-L1 mission designed to continuously monitor and measure the time-resolved spectra of solar flares between 8 keV and 150 keV. This broad energy range has been covered by using compound semiconductor detectors: cadmium telluride (CdTe: 8 - 70 keV) and cadmium zinc telluride (CZT: 20 - 150 keV) with geometric areas of 0.5 cm$^2$ and 32 cm$^2$, respectively. A stainless steel collimator provides a field-of-view of 6$^\\circ$ $\\times$ 6$^\\circ$ optimized to limit the off-axis response while keeping the design within the instrument mass constraints. The in-house designed low-noise digital pulse processing-based front-end electronics has achieved a spectral resolution of $\\approx$ 1 keV at 14 keV (CdTe) and $\\approx$ 7 keV at 60 keV (CZT). The instrument is also equipped with processing and power electronics to process the signal, drive the electronics, bias the detectors with required low and high voltages for optimal performance of the overall system. In this article, we present design aspects of the instrument, results from the pre-launch ground-based tests, and the in-orbit operations, which have indicated optimal performance in line with that expected.",
    "authors": [
      "Anuj Nandi",
      "Manju Sudhakar",
      "Srikar Paavan Tadepalli",
      "Anand Jain",
      "Brajpal Singh",
      "Reenu Palawat",
      "Ravishankar B. T.",
      "Bhuwan Joshi",
      "Monoj Bug",
      "Anurag Tyagi",
      "Sumit Kumar",
      "Mukund Kumar Thakur",
      "Akanksha Baggan",
      "Srikanth T.",
      "Arjun Dey",
      "Veeresha D. R.",
      "Abhijit Avinash Adoni",
      "Padmanabhan",
      "Vivechana M. S.",
      "Evangelin Leeja Justin",
      "James M. P.",
      "Kinshuk Gupta",
      "Shalini Maiya P. R.",
      "Lakshmi A.",
      "Sajjade Faisal Mustafa",
      "Vivek R. Subramanian",
      "Gayatri Malhotra",
      "Shree Niwas Sahu",
      "Murugiah S.",
      "Medasani Thejasree",
      "Narayan Rao G. S.",
      "T Rethika.",
      "Motamarri Srikanth",
      "Ravi A.",
      "Nashiket Premlal Parate",
      "Nigar Shaji"
    ],
    "published": "2025-12-14T13:16:39Z",
    "updated": "2025-12-14T13:16:39Z",
    "categories": [
      "astro-ph.SR",
      "astro-ph.HE",
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.SR",
    "doi": "10.1007/s11207-025-02543-8"
  },
  {
    "arxiv_id": "2512.06651v3",
    "url": "https://arxiv.org/abs/2512.06651v3",
    "pdf_url": "https://arxiv.org/pdf/2512.06651v3.pdf",
    "title": "A Capacitor Model of the Helical Deflector: Revisiting Shamaev's Proposal and the Model in the Book",
    "abstract": "An RF helical deflector is a type of electron and ion optics device that applies a time-dependent rotating transverse electric or magnetic field by means of time-dependent RF voltage applied on two opposite conducting helical structures (wires, ribbons or other) to deflect charged particles (a single, bunch or beam) in a circular or spiral path. It is a perspective indirect timing system being concurrent for reaching picosecond time resolution, and have promise being excellent candidate for high precision time-of-flight detection. As a timing system, it converts the temporal structure of an electron beam into a spatial pattern -- particularly, an ellipse in the case of a single-frequency RF voltage and continuous electron pencil beam.   I propose a capacitor model of an RF helical deflector and compare it with the existing model in the Book \\cite{ZhigarevBook, Gevorgian2015}, interpret them and provide understanding of them. Furthermore, I analyze the latter, finding analytical formulas for the applied electric field, ellipse sizes (semi-axes) and rotation angle, lengths of the ellipse line, corresponding to the duration of electron pencil bunches or beams. The present article touches the topics of getting circle on resonance limit and of deflection sensitivity.",
    "authors": [
      "Hayk L. Gevorgyan"
    ],
    "published": "2025-12-07T04:27:08Z",
    "updated": "2025-12-14T09:19:27Z",
    "categories": [
      "physics.acc-ph",
      "physics.app-ph",
      "physics.class-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.12484v1",
    "url": "https://arxiv.org/abs/2512.12484v1",
    "pdf_url": "https://arxiv.org/pdf/2512.12484v1.pdf",
    "title": "Updated Simulation of GRETA Detector Response and Exploration of Temperature Sensitivity",
    "abstract": "The Gamma-Ray Energy Tracking Array (GRETA) is a next-generation gamma-ray spectrometer designed to push the frontiers of nuclear structure and astrophysics experiment. Its high sensitivity is enabled by high-precision localization of gamma-ray interactions within its active detector volume, and the subsequent tracking of gamma-ray scattering sequences. In order to perform gamma-ray tracking, we need to simulate signal generation in the detectors accurately. This requires both accurate calculations of charge movement in the semiconductor volume, as well as a faithful reproduction of real-world experimental effects such as the electronics response. This work addresses the fidelity of the calculated signals for GRETA in two ways. An updated approach has been applied to find an optimized parameterization of the electronics response, while the impact of the detector temperature was also explored to best reproduce experimental signals and improve the position localization performance for GRETA. The results suggest that the electronics response can be simplified without impacting performance, and that the response correction parameters can effectively compensate for the changes in signal which arise due to the crystal temperature, resulting in minimal sensitivity of the position resolution to the assumed temperature.",
    "authors": [
      "Arin Manohar",
      "Mario Cromaz",
      "Christopher Campbell",
      "Heather Crawford",
      "Marco Salathe"
    ],
    "published": "2025-12-13T22:49:55Z",
    "updated": "2025-12-13T22:49:55Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.12421v1",
    "url": "https://arxiv.org/abs/2512.12421v1",
    "pdf_url": "https://arxiv.org/pdf/2512.12421v1.pdf",
    "title": "Rethinking massive multiplexing in whispering gallery mode biosensing",
    "abstract": "Accurate, label-free quantification of multiple analytes in complex biological media remains a major challenge due to limited multiplexing, signal cross-correlations, and inconsistency across sensor samples and measurement runs. We introduce a multiplexed whispering-gallery-mode (WGM) biosensing framework that overcomes these barriers by jointly advancing photonic integration and data analytics. Our glass-chip platform enables massive, parallelized and flexible multiplexing of >10000 microresonators organized into up to 100 sensing channels, with universal and modular chip design and detection hardware, while maintaining loaded Q-factors of 10^6. Our novel hybrid deep-learning framework BioCCF that integrates domain adaptation with cross-channel fusion enables harmonization of responses across sensing chips and extraction of nonlinear correlations in complex mixtures. Using a highly heterogeneous dataset comprising over 200 hours of sensing data acquired from nine chips with different channel configurations, biological replicates, and repeated regeneration cycles, we demonstrate recalibration-free identification of solution (99.3\\% accuracy) and quantification of immunoglobulin G components with relative prediction error of 10^-4 under 5 min. The affordability and modularity of the platform enable distributed data acquisition and aggregation into shared repositories, providing a pathway toward continuously improving model generalization, cross-validation and a scalable, community-driven paradigm for biosensing.",
    "authors": [
      "Ivan Saetchnikov",
      "Elina Tcherniavskaia",
      "Andreas Ostendorf",
      "Anton Saetchnikov"
    ],
    "published": "2025-12-13T18:21:36Z",
    "updated": "2025-12-13T18:21:36Z",
    "categories": [
      "physics.optics",
      "physics.bio-ph",
      "physics.chem-ph",
      "physics.data-an",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2512.12163v1",
    "url": "https://arxiv.org/abs/2512.12163v1",
    "pdf_url": "https://arxiv.org/pdf/2512.12163v1.pdf",
    "title": "Large Errors in Kinetic Temperature Measurements Using Particle Tracking Velocimetry",
    "abstract": "We report on random errors in kinetic temperature measurements due to position uncertainty in particle tracking velocimetry. Using simulated data, we isolate the effects of spatial resolution and the frame rate on particle velocity calculations. A sample of particle velocities is generated from a Maxwellian distribution at a known temperature. Particle positions are assigned randomly and roughened to match a prescribed spatial resolution. Velocities are restored using the two-frame tracking method, and the kinetic temperature is calculated. By repeating this procedure, we obtain the discrepancy as a function of the spatial resolution and frame rate. Results show that, under typical experimental conditions, the restored kinetic temperature can deviate significantly from the true value, with spatial resolution playing a more dominant role than the frame rate.",
    "authors": [
      "Anton Kananovich",
      "Parth Mehrotra",
      "Surabhi Jaiswal"
    ],
    "published": "2025-12-13T04:03:18Z",
    "updated": "2025-12-13T04:03:18Z",
    "categories": [
      "physics.plasm-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2502.01945v3",
    "url": "https://arxiv.org/abs/2502.01945v3",
    "pdf_url": "https://arxiv.org/pdf/2502.01945v3.pdf",
    "title": "Cryogenic Thermal Modeling of Microwave High Density Signaling",
    "abstract": "Superconducting quantum computers require microwave control lines running from room temperature to the mixing chamber of a dilution refrigerator. Adding more lines without preliminary thermal modeling to make predictions risks overwhelming the cooling power at each thermal stage. In this paper, we investigate the thermal load of SC-086/50-SCN-CN semi-rigid coaxial cable, which is commonly used for the control and readout lines of a superconducting quantum computer, as we increase the number of lines to a quantum processor. We investigate the makeup of the coaxial cables, verify the materials and dimensions, and experimentally measure the total thermal conductivity of a single cable as a function of the temperature from cryogenic to room temperature values. We also measure the cryogenic DC electrical resistance of the inner conductor as a function of temperature, allowing for the calculation of active thermal loads due to Ohmic heating. Fitting this data produces a numerical thermal conductivity function used to calculate the static heat loads due to thermal transfer within the wires resulting from a temperature gradient. The resistivity data is used to calculate active heat loads, and we use these fits in a cryogenic model of a superconducting quantum processor in a typical Bluefors XLD1000-SL dilution refrigerator, investigating how the thermal load increases with processor sizes ranging from 100 to 225 qubits. We conclude that the theoretical upper limit of the described architecture is approximately 200 qubits. However, including an engineering margin in the cooling power and the available space for microwave readout circuitry at the mixing chamber, the practical limit is approximately 140 qubits.",
    "authors": [
      "Naomi Raicu",
      "Tom Hogan",
      "Xian Wu",
      "Mehrnoosh Vahidpour",
      "David Snow",
      "Matthew Hollister",
      "Mark Field"
    ],
    "published": "2025-02-04T02:38:24Z",
    "updated": "2025-12-12T21:30:12Z",
    "categories": [
      "quant-ph",
      "physics.ins-det"
    ],
    "primary_category": "quant-ph",
    "doi": "10.1140/epjqt/s40507-025-00427-1"
  },
  {
    "arxiv_id": "2506.09030v3",
    "url": "https://arxiv.org/abs/2506.09030v3",
    "pdf_url": "https://arxiv.org/pdf/2506.09030v3.pdf",
    "title": "Full-scatter vector field analysis of an overmoded and periodically-loaded cylindrical structure for the transportation of THz radiation",
    "abstract": "Highly overmoded and periodically loaded structures, such as the iris-line waveguide, offer an attractive solution for the efficient transportation of diffraction-prone THz pulses over long distances (hundreds of meters). This paper presents the full-scatter field theory that allows us to analytically derive all the spectral (modal) coefficients on the discontuities of the iris line. The spectral analysis uses vector fields, superseding scalar field descriptions, to account for diffraction loss as well as polarization effects and ohmic loss on practical conductive surfaces. An advanced application of Lorentz's reciprocity theory, using a generalized guided-field configuration, is developed to reduce complexity of the mode-matching problem over nonuniform sections. The used technique is quite general and applies to a wide class of structures, as it only assumes a paraxial incidence (i.e. a parabolic wave equation) along the axis of the structure. It removes the traditional assumption of very thin screens, allowing for the study of thicker screens in the high-frequency limit, while formulating the problem efficiently by scattering matrices whose coefficients are found analytically. The theory agrees with and expands previously established techniques, including Vainstein's asymptotic limit and the forward-scatter approximation. The used formulation also facilitates accurate visualization of the transient regime at the entrance of the structure and how it evolves to reach steady state.",
    "authors": [
      "Adham Naji",
      "Pawan Kumar Gupta",
      "Gennady Stupakov"
    ],
    "published": "2025-06-10T17:54:33Z",
    "updated": "2025-12-12T19:52:15Z",
    "categories": [
      "physics.acc-ph",
      "math-ph",
      "physics.app-ph",
      "physics.class-ph",
      "physics.optics"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.11768v1",
    "url": "https://arxiv.org/abs/2512.11768v1",
    "pdf_url": "https://arxiv.org/pdf/2512.11768v1.pdf",
    "title": "A low-cost ice melt monitoring system using wind-induced motion of mass-balance stakes",
    "abstract": "Surface ablation measurements of glaciers are critical for understanding mass change over time. Mass-balance stakes are commonly used for localized measurements, with the exposed length typically measured manually at infrequent intervals. This paper presents the design and validation of new instrumentation that automates mass-balance stake readings, thus enabling continuous measurements with high temporal resolution. The instrumentation comprises readout electronics that are mounted on mass-balance stakes to measure wind-induced vibrations. The stake vibrational frequency depends sensitively on the exposed length, and changes in the measured frequency therefore probe glacier surface melt and accumulation. Initial instrumentation field tests conducted at Color Lake on Umingmat Nunaat (Axel Heiberg Island), Nunavut, demonstrate centimeter-level precision on length measurements. The instrumentation can be attached to existing mass-balance stakes and is low-cost (~ $50 USD) in comparison to many other systems that perform automated surface ablation measurements. The accessibility of this instrumentation opens new possibilities for localized, high temporal resolution measurements of glacier surface activity at any locations where mass balance stakes are deployed.",
    "authors": [
      "Felix St-Amour",
      "H. Cynthia Chiang",
      "Jamie Cox",
      "Eamon Egan",
      "Ian Hendricksen",
      "Jonathan Sievers",
      "Laura Thomson"
    ],
    "published": "2025-12-12T18:29:29Z",
    "updated": "2025-12-12T18:29:29Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.20413v2",
    "url": "https://arxiv.org/abs/2507.20413v2",
    "pdf_url": "https://arxiv.org/pdf/2507.20413v2.pdf",
    "title": "Electromagnetic Noise Characterization and Suppression in Low-Field MRI Systems",
    "abstract": "Purpose: Low-field MRI systems operate at single MHz-range frequencies, where signal losses are primarily dominated by thermal noise from the radio-frequency (RF) receive coils. Achieving operation close to this limit is essential for maximizing imaging performance and signal-to-noise ratio (SNR). However, electromagnetic interference (EMI) from cabling, electronics, and patient loading often degrades system performance. Our goal is to develop and validate a practical protocol that guides users in identifying and suppressing electromagnetic noise in low-field MRI systems, enabling operation near the thermal noise limit.   Methods: We present a systematic, stepwise methodology that includes diagnostic measurements, hardware isolation strategies, and good practices for cabling and shielding. Each step is validated with corresponding noise measurements under increasingly complex system configurations, both unloaded and with a human subject present.   Results: Noise levels were monitored through the incremental assembly of a low-field MRI system, revealing key sources of EMI and quantifying their impact. Final configurations achieved noise within 1.5x the theoretical thermal bound with a subject in the scanner. Image reconstructions illustrate the direct relationship between system noise and image quality.   Conclusion: The proposed protocol enables low-field MRI systems to operate close to fundamental noise limits in realistic conditions. The framework also provides actionable guidance for the integration of additional system components, such as gradient drivers and automatic tuning networks, without compromising SNR.",
    "authors": [
      "Teresa Guallart-Naval",
      "José M. Algarín",
      "Joseba Alonso"
    ],
    "published": "2025-07-27T21:13:27Z",
    "updated": "2025-12-12T17:32:19Z",
    "categories": [
      "physics.med-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.med-ph"
  },
  {
    "arxiv_id": "2511.20445v2",
    "url": "https://arxiv.org/abs/2511.20445v2",
    "pdf_url": "https://arxiv.org/pdf/2511.20445v2.pdf",
    "title": "Diffusion for Fusion: Designing Stellarators with Generative AI",
    "abstract": "Stellarators are a prospective class of fusion-based power plants that confine a hot plasma with three-dimensional magnetic fields. Typically framed as a PDE-constrained optimization problem, stellarator design is a time-consuming process that can take hours to solve on a computing cluster. Developing fast methods for designing stellarators is crucial for advancing fusion research. Given the recent development of large datasets of optimized stellarators, machine learning approaches have emerged as a potential candidate. Motivated by this, we present an open inverse problem to the machine learning community: to rapidly generate high-quality stellarator designs which have a set of desirable characteristics. As a case study in the problem space, we train a conditional diffusion model on data from the QUASR database to generate quasisymmetric stellarator designs with desirable characteristics (aspect ratio and mean rotational transform). The diffusion model is applied to design stellarators with characteristics not seen during training. We provide evaluation protocols and show that many of the generated stellarators exhibit solid performance: less than 5% deviation from quasisymmetry and the target characteristics. The modest deviation from quasisymmetry highlights an opportunity to reach the sub 1% target. Beyond the case study, we share multiple promising avenues for generative modeling to advance stellarator design.",
    "authors": [
      "Misha Padidar",
      "Teresa Huang",
      "Andrew Giuliani",
      "Marina Spivak"
    ],
    "published": "2025-11-25T16:17:12Z",
    "updated": "2025-12-12T15:38:08Z",
    "categories": [
      "cs.LG",
      "physics.plasm-ph"
    ],
    "primary_category": "cs.LG"
  },
  {
    "arxiv_id": "2512.11641v1",
    "url": "https://arxiv.org/abs/2512.11641v1",
    "pdf_url": "https://arxiv.org/pdf/2512.11641v1.pdf",
    "title": "Design optimization of hadronic calorimeters for future colliders",
    "abstract": "Calorimeters are a crucial component in modern particle detectors. They are responsible for providing accurate energy measurements of particles produced in high-energy collisions. The demanding requirements set for next-generation collider experiments impose new challenges on the design of new detectors, and a systematic approach to their optimization is increasingly necessary. The performance of calorimeters is primarily characterized by their energy resolution, parameterized by a stochastic and a constant term, related to sampling fluctuations and non-uniformities respectively. To improve the reconstruction quality of physics objects in the calorimeter, both terms need to be taken into account. Changes in a longitudinally constrained design usually result in a trade-off between these terms, making optimization a non-trivial task. This work focuses on the optimization of a hadronic sampling calorimeter, based on the FCC-ee ALLEGRO detector concept. By controlling the absorber layer thickness in a Geant4 simulation, the impact of the passive to active material proportion on the deposited energy distribution and resolution can be analyzed. Our methodology aims at exploring the design space with practical considerations, paving the way for the development of a closed optimization framework that can evaluate multiple designs against physics performance targets.",
    "authors": [
      "Bruno Rodrigues",
      "Inês Ochoa",
      "Agostinho Gomes"
    ],
    "published": "2025-12-12T15:20:42Z",
    "updated": "2025-12-12T15:20:42Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.11631v1",
    "url": "https://arxiv.org/abs/2512.11631v1",
    "pdf_url": "https://arxiv.org/pdf/2512.11631v1.pdf",
    "title": "UK White Paper on Magnetic Reconnection",
    "abstract": "Magnetic reconnection powers explosive releases of magnetic energy, heating and particle acceleration throughout the plasma universe. Knowledge of this universal process is vital to understanding the Heliosphere, as it plays a key role in solar flares, coronal mass ejections, coronal heating, solar wind acceleration, geomagnetic storms, and interactions between the solar wind and planetary magnetospheres. As such, reconnection underpins multiple science objectives of multiple future space missions. The UK plays a leading role in this international field, through a combination of in situ measurements from Earth's magnetosphere and the solar wind, observations of the solar corona and chromosphere, and world-class numerical simulations and theory. This white paper identifies: Nine priority science objectives for reconnection research in the next decade; Recommendations to guide investment in theory, simulations and infrastructure; Mission priorities and required measurements to ensure the UK maintains and improves its world-class credentials in reconnection science.",
    "authors": [
      "Alexander J. B. Russell",
      "James A. McLaughlin",
      "Philippa Browning",
      "Jennifer Carter",
      "Luca Franci",
      "Heli Hietala",
      "Andrew Hillier",
      "Gunnar Hornig",
      "David MacTaggart",
      "Sarah Matthews",
      "James McKevitt",
      "Eric Priest",
      "Jack Reid",
      "Ben Snow",
      "Julia Stawarz",
      "Anthony Yeates",
      "Jeffersson Andres Agudelo Rueda",
      "William Bate",
      "Giulio Del Zanna",
      "Jonathan Eastwood",
      "Lucie Green",
      "Anshu Kumari",
      "Mike Lockwood",
      "Thomas Neukirch",
      "David Pontin",
      "Andy Smith",
      "Maria-Theresia Walach",
      "Peter Wyper"
    ],
    "published": "2025-12-12T15:09:58Z",
    "updated": "2025-12-12T15:09:58Z",
    "categories": [
      "astro-ph.IM",
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2506.18982v3",
    "url": "https://arxiv.org/abs/2506.18982v3",
    "pdf_url": "https://arxiv.org/pdf/2506.18982v3.pdf",
    "title": "First direct search for light dark matter interactions in a transition-edge sensor",
    "abstract": "We propose the use of transition-edge sensor (TES) single-photon detectors as a simultaneous target and sensor for direct dark matter searches, and report results from the first search of this kind. We perform a 489 h science run with a TES device optimized for the detection of 1064 nm photons, with a mass of ~0.2 ng and an energy threshold of ~0.3 eV, and set new limits on dark matter interactions with both electrons and nucleons for dark matter with mass below the MeV scale. With their excellent energy resolution, TESs enable search strategies that are complementary to recent results from superconducting nanowire single-photon detectors and kinetic inductance detectors. We show that next-generation TES arrays hold promise to probe new regions of light dark matter parameter space.",
    "authors": [
      "Christina Schwemmbauer",
      "Guy Daniel Hadas",
      "Yonit Hochberg",
      "Katharina-Sophie Isleif",
      "Friederike Januschek",
      "Benjamin V. Lehmann",
      "Axel Lindner",
      "Adriana E. Lita",
      "Manuel Meyer",
      "Gulden Othman",
      "Elmeri Rivasto",
      "José Alejandro Rubiera Gimeno"
    ],
    "published": "2025-06-23T18:00:03Z",
    "updated": "2025-12-12T15:07:21Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "hep-ph",
      "quant-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.11478v1",
    "url": "https://arxiv.org/abs/2512.11478v1",
    "pdf_url": "https://arxiv.org/pdf/2512.11478v1.pdf",
    "title": "Numerical investigation of kinetic instabilities in BGK equilibria under collisional effects",
    "abstract": "An unstable one-dimensional Bernstein-Greene-Kruskal (BGK) mode has been studied through high-precision numerical simulations. The initial turbulent, periodic equilibrium state is obtained by solving a Vlasov-Poisson system for initially thermalized electrons, with the addition of an external electric field able to trigger undamped, high-amplitude electron acoustic waves (EAWs). Once the external field is turned off, resonant particles are trapped in a stationary two-hole phase-space configuration. This equilibrium scenario is perturbed by some large-scale density noise, leading to an electrostatic instability with the merging of vortices into a final one-hole state. Numerical runs investigate several features of this regime, focusing on the dependence of the instability trigger time and growth rate on the rate of short-range collisions and grid resolution. According to Landau theory for weakly inhomogeneous equilibria, we observe that the growth rate of the instability depends only on the slope of the distribution function in the resonant region. Conversely, the onset time of the instability is affected by the collisional rate, which is able to postpone the onset of the instability. Moreover, by extending the simulations to a long-time scale, we investigate the saturation stage of the instability, which can be analyzed through the Hermite spectral analysis. In collisionless simulations where grid effects are negligible, the Hermite spectrum follows a power law typical of a constant enstrophy flux scenario. Otherwise, if collisional effects become significant, a cutoff is observed at high Hermite modes, leading to a decaying trend.",
    "authors": [
      "Sofia Zanelli",
      "Gabriele Celebre",
      "Sergio Servidio",
      "Francesco Valentini"
    ],
    "published": "2025-12-12T11:23:51Z",
    "updated": "2025-12-12T11:23:51Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.11456v1",
    "url": "https://arxiv.org/abs/2512.11456v1",
    "pdf_url": "https://arxiv.org/pdf/2512.11456v1.pdf",
    "title": "Multichannel SiPM test readout system for gamma-ray measurements with monolithic inorganic CeBr_{3}",
    "abstract": "Energy resolution and the detection efficiency for gamma quanta are fundamental properties in the construction of detectors for ionizing radiation. In this study, a SiPM-based photodetector coupled to a monolithic inorganic CeBr_{3} crystal is exposed to gamma rays in order to study the performance of the CeBr_{3} crystal. Measurements are made using three different radioactive sources - ^{137}Cs, ^{22}Na, and ^{60}Co. For each source, the measurements are conducted at several SiPM bias voltages. Furthermore, two CeBr_{3} crystals with different thicknesses are used in order to study how detector efficiency is affected by crystal dimensions. A preliminary analysis of the data is presented.",
    "authors": [
      "Veronika Asova",
      "Galin Bistrev",
      "Valentin Buchakchiev",
      "Venelin Kozhuharov"
    ],
    "published": "2025-12-12T10:48:38Z",
    "updated": "2025-12-12T10:48:38Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1742-6596/2794/1/012006"
  },
  {
    "arxiv_id": "2512.11365v1",
    "url": "https://arxiv.org/abs/2512.11365v1",
    "pdf_url": "https://arxiv.org/pdf/2512.11365v1.pdf",
    "title": "Temporal Substepping Scheme for Magnetohydrodynamics with Cell-based Adaptive Mesh Refinement on Staggered Grid",
    "abstract": "We present a new algorithm for numerical magnetohydrodynamics on staggered meshes preserving $\\nabla \\cdot B = 0$. Our algorithm is based on the constrained transport method and supports both cell-based adaptive mesh refinement and temporal substepping. We handle resolution changes directly on the logically Cartesian grid without needing interpolation or projection between nested or neighboring grids, nor coupling the solution between refinement levels.",
    "authors": [
      "Ilja Honkonen",
      "Riku Jarvinen",
      "David Phillips"
    ],
    "published": "2025-12-12T08:27:21Z",
    "updated": "2025-12-12T08:27:21Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.IM",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2505.13926v5",
    "url": "https://arxiv.org/abs/2505.13926v5",
    "pdf_url": "https://arxiv.org/pdf/2505.13926v5.pdf",
    "title": "An exploratory study of a tellurium-loaded liquid scintillator based on water and p-dioxane",
    "abstract": "Tellurium-loaded liquid scintillators are critical for neutrinoless double-beta decay experiments. However, conventional organic scintillators are constrained by the limited solubility of organic tellurium compounds compared with that of inorganic ones in water, whereas water-based scintillators are likely constrained by the destabilization of surfactants caused by inorganic tellurium compounds. In this work, a surfactant-free water-containing route is explored, in which an aqueous telluric acid solution is introduced into a water-miscible organic scintillator comprising p-dioxane, naphthalene, and PPO. The phase behavior of this system is mapped to delineate homogeneous-mixture domains and to estimate practical upper bounds on tellurium loading. Optical properties are characterized by UV-visible absorption spectroscopy and fluorescence spectroscopy. The scintillation light yield is obtained with a relative method that compares to a reference LAB-PPO scintillator. The measurements demonstrate scintillation quenching induced by water and by tellurium acid. These results provide benchmarks for water-containing and surfactant-free formulations and support the development of high-loading liquid scintillators for future detector design.",
    "authors": [
      "Ye Liang",
      "Haozhe Sun",
      "Zhe Wang"
    ],
    "published": "2025-05-20T04:42:24Z",
    "updated": "2025-12-12T08:03:19Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.11328v1",
    "url": "https://arxiv.org/abs/2512.11328v1",
    "pdf_url": "https://arxiv.org/pdf/2512.11328v1.pdf",
    "title": "$T_i/T_e$ Dependence of Core Turbulence and Transport in DIII-D QH-Mode Plasmas",
    "abstract": "This study investigates the effect of the ion-to-electron temperature ratio ($T_i/T_e$) on microturbulence driven transport in Quiescent H-mode (QH-mode) plasmas in the DIII-D tokamak. Utilizing the Gyrokinetic Toroidal Code (GTC) and the QH-mode equilibrium, we perform linear and nonlinear simulations to analyze transport properties and instability dynamics under variations of $T_i$ and $T_e$. Our results demonstrate that decreasing $T_i/T_e$ leads to a relative destabilization of trapped electron modes (TEM) over ion temperature gradient (ITG) modes, with the transition between these regimes dictated by $T_i/T_e$. When the electron temperature is increased at fixed ion temperature, we observe an increase in transport saturation levels. In contrast, decreasing the ion temperature at fixed electron temperature results in more modest transport enhancement. The radial correlation length, which characterizes eddy size, increases with rising $T_e$ and decreases with falling $T_i$, consistent with the observed trends in turbulent transport. Additionally, we examine the impact of impurity addition on turbulence and growth rates, finding that impurity presence does not significantly alter transport quantities compared to the impurity-free case. Finally, investigating helium as an alternative main ion species, we find that helium plasmas exhibit higher linear growth rates but result in lower transport saturation levels than deuterium plasmas, suggesting potential confinement benefits. These findings provide quantitative insights into the temperature ratio dependence in QH-mode plasmas and highlight the role of temperature profiles and zonal flows in influencing plasma confinement.",
    "authors": [
      "Abhishek Tiwari",
      "Kshitish Barada",
      "Jaya Kumar Alageshan",
      "Santanu Banerjee",
      "Tanmay Macwan",
      "Terry L. Rhodes",
      "Sarveshwar Sharma",
      "Zhihong Lin",
      "Animesh Kuley"
    ],
    "published": "2025-12-12T07:01:54Z",
    "updated": "2025-12-12T07:01:54Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.11310v1",
    "url": "https://arxiv.org/abs/2512.11310v1",
    "pdf_url": "https://arxiv.org/pdf/2512.11310v1.pdf",
    "title": "ALS-U AR RF Equipment Protection System",
    "abstract": "This paper presents the design and status of Accumulator Ring (AR) RF Equipment Protection System (EPS) of Advanced Light Source Upgrade project at LBNL. The key components of AR RF EPS include a Master Interlock PLC subsystem handling supervisory control and slow interlocks in \\SI{}{\\milli\\second} scale, an FPGA-based LLRF Controller managing fast interlocks in \\SI{}{\\micro\\second} scale, a 60 kW high-power amplifier with standalone PLC-based slow (\\SI{}{\\milli\\second} scale) and FPGA-based fast (\\SI{}{\\micro\\second} scale) protection systems, and an RF Drive Control Chassis acting as primary RF mitigation device. The design of AR RF EPS is presented along with internal RF and external AR subsystems interfaces.",
    "authors": [
      "Najm Us Saqib",
      "Christopher Toy",
      "Qiang Du",
      "Kevin Bender",
      "Shree Subhasish Basak",
      "Shreeharshini Murthy",
      "Jeong Han Lee",
      "David Nett"
    ],
    "published": "2025-12-12T06:16:21Z",
    "updated": "2025-12-12T06:16:21Z",
    "categories": [
      "physics.acc-ph",
      "eess.SY"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.18429/JACoW-IPAC2024-THPG20"
  },
  {
    "arxiv_id": "2512.11290v1",
    "url": "https://arxiv.org/abs/2512.11290v1",
    "pdf_url": "https://arxiv.org/pdf/2512.11290v1.pdf",
    "title": "Charge transport and mode transition in dual-energy electron beam diodes",
    "abstract": "This Letter uncovers five distinct charge transport modes and their transitions in dual-energy electron beam diodes. We, via fully kinetic particle-in-cell (PIC) simulations, establish that the specific mode (e.g., space charge oscillations) and the current transport characteristics are essentially governed by the interplay between the electron beam energy and injected current density. A more generalized analysis is conducted for n-component electron beams, and a theoretical piecewise function is proposed, which agrees well with the PIC results under designed conditions. The discovery provides a mechanistic picture of multiple electron beam transport in diodes, paving the way for novel designs of high-performance modern vacuum electronic devices.",
    "authors": [
      "Chubin Lin",
      "Jiandong Chen",
      "Huihui Wang",
      "Yangyang Fu"
    ],
    "published": "2025-12-12T05:34:30Z",
    "updated": "2025-12-12T05:34:30Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.11268v1",
    "url": "https://arxiv.org/abs/2512.11268v1",
    "pdf_url": "https://arxiv.org/pdf/2512.11268v1.pdf",
    "title": "Vibration Isolation for the Laser Interferometer Lunar Antenna",
    "abstract": "The Laser Interferometer Lunar Antenna (LILA) presents a novel concept for observing gravitational waves from astrophysical sources at sub-Hertz frequencies. Compared to the Earth, the seismic environment of the moon, while uncertain, is known to be orders of magnitude lower, opening the possibility for achieving this sub-Hz band. This band fills the gap between space-based detectors (mHz) and Earth-based detectors (10 Hz to a few kHz). The initial version of LILA, known as LILA Pioneer, calls for non-suspended optics, relying on the moon's resonant modes to respond to gravitational waves. However, the follow-on design, LILA Horizon, requires suspensions to realize in-band free floating test masses and to filter the residual seismic background. This paper will establish baseline designs for these suspensions for different assumptions of the seismic background.",
    "authors": [
      "Brett N. Shapiro"
    ],
    "published": "2025-12-12T04:13:38Z",
    "updated": "2025-12-12T04:13:38Z",
    "categories": [
      "gr-qc",
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "gr-qc"
  },
  {
    "arxiv_id": "2406.10626v3",
    "url": "https://arxiv.org/abs/2406.10626v3",
    "pdf_url": "https://arxiv.org/pdf/2406.10626v3.pdf",
    "title": "A Wave-Based Simulation Model for Cross-Beam Energy Transfer and Stimulated Brillouin Scattering in Laser-Plasma Systems",
    "abstract": "We present WEBS (WavE-Based Simulations), an efficient wave-based simulation model designed to investigate the dynamic interplay between cross-beam energy transfer (CBET) and stimulated Brillouin scattering (SBS) in laser-plasma systems. By employing a unified Schrodinger-type envelope formulation for the laser and ion-acoustic waves, our model enables the use of a single, unconditionally stable Du Fort-Frankel numerical scheme, which maintains excellent long-term energy conservation even with coarse spatial grids. This approach not only achieves high computational efficiency validated against particle-in-cell simulations but also allows the selective activation or suppression of CBET and SBS processes, offering a clear diagnostic of their mutual coupling. Our simulations reveal that at high laser intensities, CBET and SBS reach a coupled steady state, leading to significant deviations from classical fluid theory predictions. Specifically, CBET gain is suppressed due to enhanced SBS reflectivity, while strong asymmetry in SBS reflectivity emerges between the interacting beams. These findings highlight regimes where the two instabilities strongly influence each other, providing critical insights for inertial confinement fusion research and offering a practical numerical tool for instability control and scenario design.",
    "authors": [
      "Y. Chen",
      "Qing Wang",
      "H. Wen",
      "Y. Z. J. Xu",
      "S. J. Peng",
      "W. Q. Li",
      "C. Y. Zheng",
      "Z. J. Liu",
      "L. H. Cao",
      "C. Z. Xiao"
    ],
    "published": "2024-06-15T13:20:09Z",
    "updated": "2025-12-12T02:43:55Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2202.01054v5",
    "url": "https://arxiv.org/abs/2202.01054v5",
    "pdf_url": "https://arxiv.org/pdf/2202.01054v5.pdf",
    "title": "Improved quantum algorithms for linear and nonlinear differential equations",
    "abstract": "We present substantially generalized and improved quantum algorithms over prior work for inhomogeneous linear and nonlinear ordinary differential equations (ODE). Specifically, we show how the norm of the matrix exponential characterizes the run time of quantum algorithms for linear ODEs opening the door to an application to a wider class of linear and nonlinear ODEs. In Berry et al., (2017), a quantum algorithm for a certain class of linear ODEs is given, where the matrix involved needs to be diagonalizable. The quantum algorithm for linear ODEs presented here extends to many classes of non-diagonalizable matrices. The algorithm here is also exponentially faster than the bounds derived in Berry et al., (2017) for certain classes of diagonalizable matrices. Our linear ODE algorithm is then applied to nonlinear differential equations using Carleman linearization (an approach taken recently by us in Liu et al., (2021)). The improvement over that result is two-fold. First, we obtain an exponentially better dependence on error. This kind of logarithmic dependence on error has also been achieved by Xue et al., (2021), but only for homogeneous nonlinear equations. Second, the present algorithm can handle any sparse, invertible matrix (that models dissipation) if it has a negative log-norm (including non-diagonalizable matrices), whereas Liu et al., (2021) and Xue et al., (2021) additionally require normality.",
    "authors": [
      "Hari Krovi"
    ],
    "published": "2022-02-02T14:43:44Z",
    "updated": "2025-12-12T02:39:05Z",
    "categories": [
      "quant-ph",
      "cs.DS",
      "physics.plasm-ph"
    ],
    "primary_category": "quant-ph",
    "doi": "10.22331/q-2023-02-02-913"
  },
  {
    "arxiv_id": "2509.23039v2",
    "url": "https://arxiv.org/abs/2509.23039v2",
    "pdf_url": "https://arxiv.org/pdf/2509.23039v2.pdf",
    "title": "Angular Resolution Enhancement of Electron Backscatter Diffraction Patterns",
    "abstract": "We present a simple 'shift-and-add' based improvement in the angular resolution of single electron backscatter diffraction (EBSD) patterns. Sub-pixel image registration is used to measure the (sub-pixel) difference in projection parameters for patterns collected within a map, and then the pattern is shifted and added together. The resultant EBSD-pattern is shown to contain more angular information than a long-exposure single pattern, via 2D Fast Fourier Transform (FFT)-based analysis. In particular, this method has the potential to enhance the scope of small compact direct electron detectors (DEDs).",
    "authors": [
      "Ben Britton",
      "Tianbi Zhang"
    ],
    "published": "2025-09-27T01:32:25Z",
    "updated": "2025-12-12T02:03:23Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.11126v1",
    "url": "https://arxiv.org/abs/2512.11126v1",
    "pdf_url": "https://arxiv.org/pdf/2512.11126v1.pdf",
    "title": "Experimental and Monte Carlo Simulation Studies to Investigate the Working Principle of Compact Nanodosimeters",
    "abstract": "In recent years, compact nanodosimetric detectors based on ion multiplication in low-pressure gas have been developed and gained attention in the scientific community. These detectors use strong electric fields to collect and multiply positive ions produced by the incident radiation in mm-sized cell holes in dielectric materials, achieving a nm-equivalent spatial resolution of the localization of ionization events, when scaled to liquid water with unit density. Their design assumes that ion impact ionizations of gas molecules within the cell holes dominate signal formation, yet this assumption has lacked direct physical verification. Electron emission from the cell hole walls due to ion impact could also contribute, requiring alternative designs to optimize efficiency.   To investigate this, a nanodosimetric detector featuring a single cell hole with a diameter of 1.5 mm in a dielectric plate was developed. Ion collection and multiplication were achieved by applying a negative high voltage to the glass cathode 0.5 mm below the cell hole, assisted by a low drift field above the plate. A grounded readout electrode with a 0.8 mm hole covers the cell hole to prevent interactions of collected ions with the hole walls. High signal yields in 1 mbar and 2 mbar propane gas were observed and indicated that ion impact ionizations of the gas molecules are indeed the primary mechanism for signal induction. The compact nanodosimeter setup was further modeled with Geant4-DNA and Garfield++ for deeper insight. The results of these studies are important for understanding and developing a new class of nanodosimeters with potential applications in particle therapy, radiation protection, space dosimetry, and particle physics.",
    "authors": [
      "Victor Merza",
      "Aleksandr Bancer",
      "Vladimir Bashkirov",
      "Ana Belchior",
      "Beata Brzozowska",
      "João F. Canhoto",
      "Piotr Gasik",
      "Jaroslaw Grzyb",
      "Khaled Katmeh",
      "Marcin Pietrzak",
      "Antoni Ruciński",
      "Reinhard Schulte"
    ],
    "published": "2025-12-11T21:14:52Z",
    "updated": "2025-12-11T21:14:52Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.11116v1",
    "url": "https://arxiv.org/abs/2512.11116v1",
    "pdf_url": "https://arxiv.org/pdf/2512.11116v1.pdf",
    "title": "Characterization of CRYO ASIC for charge readout in the nEXO experiment",
    "abstract": "nEXO is a proposed next-generation experiment searching for the neutrinoless double beta decay of $^{136}$Xe using a tonne-scale liquid xenon (LXe) time projection chamber (TPC). To image the ionization signals from events in the liquid xenon, the detector will employ metallized fused-silica charge collection tiles instrumented with cryogenic application-specific integrated circuits (ASICs), referred to as CRYO ASIC, which are designed to operate directly in LXe to minimize input capacitance and pick-up noise. Here we present the performance of the CRYO ASIC mounted on an auxiliary printed circuit board and evaluated both in a cryogenic environmental chamber and in a dedicated LXe test stand. We demonstrate that the ASICs achieve the desired performance at liquid xenon temperatures, showing a gain stability better than 0.2% over 24-hour operation and reliable in-situ calibration using an on-chip pulser. In the LXe test stand, we show that boiling caused by the chip heat dissipation can be mitigated by operating the system above ~0.1 MPa. The in-LXe noise measured agrees with simulation, which indicates it the $150~e^-$ design requirement can be satisfied. These results establish CRYO ASIC as a viable low-noise in-LXe charge readout solution for nEXO.",
    "authors": [
      "Z. Li",
      "M. Yu",
      "E. Angelico",
      "A. Atencio",
      "A. Gupta",
      "P. Knauss",
      "A. Pena-Perez",
      "B. G. Lenardo",
      "P. Acharya",
      "A. Amy",
      "A. Anker",
      "I. J. Arnquist",
      "J. Bane",
      "V. Belov",
      "T. Bhatta",
      "A. Bolotnikov",
      "J. Breslin",
      "P. A. Breur",
      "J. P. Brodsky",
      "E. Brown",
      "T. Brunner",
      "B. Burnell",
      "E. Caden",
      "G. F. Cao",
      "L. Q. Cao",
      "D. Cesmecioglu",
      "D. Chernyak",
      "M. Chiu",
      "R. Collister",
      "M. Marquis",
      "T. Daniels",
      "L. Darroch",
      "R. DeVoe",
      "M. L. di Vacri",
      "X. Defay",
      "Y. Y. Ding",
      "D. Doering",
      "M. J. Dolinski",
      "A. Dragone",
      "B. Eckert",
      "A. Emara",
      "N. Fatemighomi",
      "W. Fairbank",
      "B. T. Foust",
      "D. Gallacher",
      "N. Gallice",
      "A. Gaur",
      "W. Gillis",
      "F. Girard",
      "A. Gorham",
      "K. Gracequist",
      "G. Gratta",
      "C. A. Hardy",
      "J. Hasi",
      "S. Hedges",
      "M. Heffner",
      "E. Hein",
      "H. Hernandez Herrera",
      "J. D. Holt",
      "A. Iverson",
      "X. S. Jiang",
      "A. Karelin",
      "D. Keblbeck",
      "C. Kenney",
      "I. Kotov",
      "A. Kuchenkov",
      "K. S. Kumar",
      "S. Lavoie",
      "A. Larson",
      "M. B. Latif",
      "K. G. Leach",
      "D. S. Leonard",
      "G. Lessard",
      "K. K. H. Leung",
      "G. Li",
      "X. Li",
      "C. Licciardi",
      "R. Lindsay",
      "R. MacLellan",
      "S. Majidi",
      "C. Malbrunot",
      "B. Markovic",
      "J. Masbou",
      "M. Medina-Peregrina",
      "S. Mngonyama",
      "B. Mong",
      "D. C. Moore",
      "K. Ni",
      "I. Nitu",
      "A. Nolan",
      "S. C. Nowicki",
      "J. C. Nzobadila Ondze",
      "A. Odian",
      "J. L. Orrell",
      "G. S. Ortega",
      "L. Pagani",
      "H. Peltz Smalley",
      "A. Piepke",
      "A. Pocar",
      "S. Prentice",
      "V. Radeka",
      "E. Raguzin",
      "R. Rai",
      "H. Rasiwala",
      "D. Ray",
      "B. Reese",
      "S. Rescia",
      "F. Retiere",
      "G. Richardson",
      "V. Riot",
      "R. Ross",
      "L. Rota",
      "P. C. Rowson",
      "R. Saldanha",
      "S. Sangiorgio",
      "S. Sekula",
      "T. Shetty",
      "L. Si",
      "F. Spadoni",
      "V. Stekhanov",
      "X. L. Sun",
      "S. Thibado",
      "T. Totev",
      "S. Triambak",
      "R. H. M. Tsang",
      "O. A. Tyuka",
      "T. Vallivilayil John",
      "E. van Bruggen",
      "M. Vidal",
      "S. Viel",
      "M. Walent",
      "H. Wang",
      "Q. D. Wang",
      "M. Watts",
      "W. Wei",
      "M. Wehrfritz",
      "L. J. Wen",
      "S. Wilde",
      "X. M. Wu",
      "H. Xu",
      "H. B. Yang",
      "L. Yang",
      "O. Zeldovich",
      "J. Zhao"
    ],
    "published": "2025-12-11T20:58:21Z",
    "updated": "2025-12-11T20:58:21Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.03654v2",
    "url": "https://arxiv.org/abs/2510.03654v2",
    "pdf_url": "https://arxiv.org/pdf/2510.03654v2.pdf",
    "title": "A Novel, Steerable, Low-Energy Proton Source for Detector Characterization",
    "abstract": "We report on the conversion of the Manitoba II mass spectrometer into a versatile low-energy proton beam facility. This infrastructure is adaptable to any detector-under-test (DUT), and has proven itself effective with the characterization of silicon detectors used in subatomic beyond-the-StandardModel (BSM) searches, namely the Nab experiment. A pencil beam of monoenergetic protons can be produced in a range from 25 keV to 35 keV, achieving a beamcurrent of ~1x10-18 A. Electrostatic steering plates were constructed to direct the Gaussian-profile proton beam over a 117mm diameter areaof-interest with full-width at half-maxima (FWHM) ranging from 0.6 mm to 1.26 mm. This work discusses the modifications and subsequent tests to confirm the beam specifications met the demands of the aforementioned detectors.",
    "authors": [
      "Nicholas Macsai",
      "August Mendelsohn",
      "David Harrison",
      "Russell Mammei",
      "Michael Gericke",
      "Leah Broussard",
      "Erick Smith",
      "Grant Riley",
      "Glenn Randall",
      "Mark Makela"
    ],
    "published": "2025-10-04T03:51:54Z",
    "updated": "2025-12-11T18:17:25Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex",
      "physics.acc-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2505.07979v2",
    "url": "https://arxiv.org/abs/2505.07979v2",
    "pdf_url": "https://arxiv.org/pdf/2505.07979v2.pdf",
    "title": "Demonstration of Efficient Radon Removal by Silver-Zeolite in a Dark Matter Detector",
    "abstract": "We present the performance of an efficient radon trap using silver-zeolite Ag-ETS-10, measured with a spherical proportional counter filled with an argon/methane mixture. Our study compares the radon reduction capabilities of silver-zeolite and the widely used activated charcoal, both at room temperature. We demonstrate that silver-zeolite significantly outperforms activated charcoal by three orders of magnitude in radon capture. Given that radon is a major background contaminant in rare event searches, our findings highlight silver-zeolite as a highly promising adsorbent, offering compelling operational advantages for both current and future dark matter and neutrino physics experiments. Furthermore, this not only offers great promise for developing future radon reduction systems in underground laboratories, but also paves the way for innovative, multidisciplinary advancements with far-reaching implications in science, engineering and environmental health.",
    "authors": [
      "Daniel Durnford",
      "Yuqi Deng",
      "Carter Garrah",
      "Patrick B. O'Brien",
      "Philippe Gros",
      "Michel Gros",
      "José Busto",
      "Steven Kuznicki",
      "Marie-Cécile Piro"
    ],
    "published": "2025-05-12T18:23:21Z",
    "updated": "2025-12-11T17:31:20Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2512.10830v1",
    "url": "https://arxiv.org/abs/2512.10830v1",
    "pdf_url": "https://arxiv.org/pdf/2512.10830v1.pdf",
    "title": "Cosmic Ray Measurements Using Charge and Light Readout in a Pixelated Liquid Argon Time Projection Chamber",
    "abstract": "Liquid argon time projection chambers have emerged as a competitive technology for detecting solar neutrinos. The SoLAr collaboration was formed to explore argon detectors with pixelated light and charge readout, aiming for high detection efficiency and improved energy resolution. Building on the success of an initial prototype, we present results obtained with a second SoLAr prototype (V2), a $30 \\times 30 \\times 30$ cm$^{3}$ time projection chamber operated in a cryostat containing several hundred kilograms of liquid argon. We report measurements of cosmic-ray muons using both tracking and calorimetry from light and charge sensors, and we highlight the improved performance achieved through combined charge and light reconstruction. These results demonstrate the promise of dual-readout detectors and motivate future prototyping efforts toward kiloton-scale facilities.",
    "authors": [
      "SoLAr Collaboration",
      "N. Anfimov",
      "A. Branca",
      "J. Bürgi",
      "L. Calivers",
      "P. Carniti",
      "E. Calvo",
      "E. Cristaldo",
      "C. Cuesta",
      "F. Declich",
      "R. Diurba",
      "P. Dunne",
      "D. A. Dwyer",
      "J. Evans",
      "A. C. Ezeribe",
      "A. Gauch",
      "I. Gil-Botella",
      "C. Gotti",
      "S. Greenberg",
      "D. Guffanti",
      "A. Karcher",
      "J. Kunzmann",
      "N. Lane",
      "S. Manthey Corchado",
      "N. McConkey",
      "A. Minotti",
      "A. Navrer-Agasson",
      "S. Parsa",
      "G. Pessina",
      "G. Ruiz Ferreira",
      "B. Russell",
      "S. Söldner-Rembold",
      "A. M. Szelc",
      "A. Tapper",
      "F. Terranova",
      "C. Tognina",
      "D. Trotta",
      "S. Tufanli",
      "H. Vieira de Souza",
      "G. Vitti Stenico",
      "A. Verdugo",
      "M. Weber",
      "I. Xiotidis"
    ],
    "published": "2025-12-11T17:24:26Z",
    "updated": "2025-12-11T17:24:26Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.10790v1",
    "url": "https://arxiv.org/abs/2512.10790v1",
    "pdf_url": "https://arxiv.org/pdf/2512.10790v1.pdf",
    "title": "Modeling Light Signals Using Data from the First Pulsed Neutron Source Program at the DUNE Vertical Drift ColdBox Test Facility at CERN Neutrino Platform",
    "abstract": "In this paper, we present a first quantitative test of detected light signals produced in a pulsed neutron source run in a small vertical drift LArTPC at the CERN neutrino platform ColdBox test facility. The ColdBox cryostat, detectors, neutron sources, and particle interactions are modeled and simulated using Fluka. A good agreement is found in the detected number of photoelectrons, with values below 650 photoelectrons in both data and simulation, for all four X-ARAPUCA photodetectors on the cathode in the LArTPC. A time constant is also fitted from the neutron-beam-off light signal spectrum and found consistent between data and MC. Several important systematic effects are discussed and serve as guides for future runs at larger LArTPCs.",
    "authors": [
      "A. Paudel",
      "W. Shi",
      "P. Sala",
      "F. Cavanna",
      "W. Johnson",
      "J. Wang",
      "W. Ketchum",
      "F. Resnati",
      "A. Heindel",
      "A. Ashkenazi",
      "E. Bertholet",
      "E. Bertolini",
      "D. A. Martinez Caicedo",
      "E. Calvo",
      "A. Canto",
      "S. Manthey Corchado",
      "C. Cuesta",
      "Z. Djurcic",
      "M. Fani",
      "A. Feld",
      "S. Fogarty",
      "F. Galizzi",
      "S. Gollapinni",
      "Y. Kermaïdic",
      "A. Kish",
      "F. Marinho",
      "D. Torres Muñoz",
      "A. Verdugo de Osa",
      "L. Paulucci",
      "W. Pellico",
      "V. Popov",
      "J. Rodriguez Rondon",
      "D. Leon Silverio",
      "S. Sacerdoti",
      "H. Souza",
      "R. C Svoboda",
      "D. Totani",
      "V. Trabattoni",
      "L. Zambelli"
    ],
    "published": "2025-12-11T16:34:13Z",
    "updated": "2025-12-11T16:34:13Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2512.10771v1",
    "url": "https://arxiv.org/abs/2512.10771v1",
    "pdf_url": "https://arxiv.org/pdf/2512.10771v1.pdf",
    "title": "Accurate laboratory testing of low-frequency triaxial vibration sensors under various environmental conditions",
    "abstract": "Triaxial vibration sensor are widely used used in various application. Recently, low-cost sensors based on micro electro mechanical system (MEMS) technology are also becoming more widely adopted. However, their measurement accuracy can be affected by environmental factors such as temperature. In this study, we developed an environmental testing system integrated with a triaxial vibration exciter. The system can reproduce long-stroke, low-frequency triaxial vibrations -- such as those caused by huge earthquakes -- under temperatures ranging from $-30~^\\circ\\mathrm{C}$ to $+80~^\\circ\\mathrm{C}$. Using this system, the measurement accuracy of vibration sensors can be evaluated under different environmental conditions. The system provides highly accurate reference measurements using a laser interferometer and reference accelerometers that are primarily calibrated within the system. The overall accuracy of the reference vibration measurement is estimated to be approximately 0.23~\\%. Based on these reference measurements, we investigated the accuracy of earthquake observations using a MEMS accelerometer as a demonstration. The system configuration and testing procedures are presented in this paper.",
    "authors": [
      "Tomofumi Shimoda",
      "Wataru Kokuyama",
      "Hideaki Nozato"
    ],
    "published": "2025-12-11T16:08:37Z",
    "updated": "2025-12-11T16:08:37Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.07666v2",
    "url": "https://arxiv.org/abs/2511.07666v2",
    "pdf_url": "https://arxiv.org/pdf/2511.07666v2.pdf",
    "title": "Response of a magnetically diverted tokamak plasma to a resonant magnetic perturbation",
    "abstract": "The safety-factor profile of a magnetically diverted tokamak plasma diverges logarithmically as the magnetic separatrix (a.k.a. the last closed magnetic flux-surface) is approached. At first sight, this suggests that, when determining the response of such a plasma to a static, externally generated, resonant magnetic perturbation (RMP), it is necessary to include an infinite number of rational magnetic flux-surfaces in the calculation, the majority of which lie very close to the separatrix. In fact, when finite plasma resistivity is taken into account, this turns out not to be the case. Instead, it is only necessary to include rational surfaces that lie in the region 0<Psi<Psi_c, where Psi is the normalized poloidal magnetic flux, and Psi_c<1 can be calculated from the edge plasma parameters. It is estimated that Psi_c= 0.9985 for an n=1 RMP, and Psi_c=0.9952 for an n=4 RMP, in a typical JET H-mode plasma.",
    "authors": [
      "R. Fitzpatrick"
    ],
    "published": "2025-11-10T22:22:12Z",
    "updated": "2025-12-11T15:49:07Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2005.07000v3",
    "url": "https://arxiv.org/abs/2005.07000v3",
    "pdf_url": "https://arxiv.org/pdf/2005.07000v3.pdf",
    "title": "A telecommunications system based on axion dark matter coherent transmission",
    "abstract": "In this manuscript we anticipate axion detection in order to theorize on a novel telecommunications system based on the coherent axion-two-photon vertex Primakoff effect conversion and reversion of microwave photons transmitting a modulated signal. We suggest a possible set-up for an experiment or industrial application using state-of-the-art technology and we estimate the output power and photon rate expected to be received as a function of the axion-photon coupling constant $g_{aγγ}$. We find that, although challenging,this system has no physical restriction to render it unfeasible. Finally, we summarize the advantages and disadvantages of a hypothetical axion-based telecommunications system compared to traditional telecommunication systems. We then extend the discussion, noting the more important conclusions.",
    "authors": [
      "Javier De Miguel-Hernández"
    ],
    "published": "2020-05-11T16:37:16Z",
    "updated": "2025-12-11T15:47:53Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.10728v1",
    "url": "https://arxiv.org/abs/2512.10728v1",
    "pdf_url": "https://arxiv.org/pdf/2512.10728v1.pdf",
    "title": "Optimized matching conditions for self-guided laser wakefield accelerators",
    "abstract": "We revisit the matching conditions for self-guided laser pulse propagation in plasma and refine their formulation to maximize the energy of electrons produced via laser wakefield acceleration. Bayesian optimization, combined with particle-in-cell simulations carried out in a quasi-three-dimensional geometry and a Lorentz-boosted frame, is employed. The optimization identifies the maximum electron energy that a self-guided laser wakefield accelerator, driven by a laser of a given energy, can produce, together with the corresponding acceleration distance. Our results further demonstrate that electrons with energies close to the maximum value can be obtained across a relatively wide range of input parameters and without the need for their precise tuning. This provides substantial flexibility for experimental implementation and significantly relaxes the operational constraints associated with self-guided laser wakefield accelerators.",
    "authors": [
      "P. Valenta",
      "K. G. Miller",
      "B. K. Russell",
      "M. Lamač",
      "M. Jech",
      "G. M. Grittani",
      "S. V. Bulanov"
    ],
    "published": "2025-12-11T15:10:31Z",
    "updated": "2025-12-11T15:10:31Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2310.16460v3",
    "url": "https://arxiv.org/abs/2310.16460v3",
    "pdf_url": "https://arxiv.org/pdf/2310.16460v3.pdf",
    "title": "Demonstration and frequency noise characterization of a 17 $μ$m quantum cascade laser",
    "abstract": "We evaluate the spectral performance of a novel continuous-wave room-temperature distributed feedback quantum cascade laser operating at the long wavelength of 17 $μ$m. By demonstrating broadband laser absorption spectroscopy of the $ν$2 fundamental vibrational mode of N2O molecules, we have determined the spectral range and established the spectroscopic potential of this laser. We have characterized the frequency noise and measured the line width of this new device, uncovering a discrepancy with the current consensus on the theoretical modeling of quantum cascade lasers. Our results confirm the potential of such novel narrow-line-width sources for vibrational spectroscopy. Extending laser spectroscopy to longer wavelength is a fascinating prospect that paves the way for a wide range of opportunities from chemical detection, to frequency metrology as well as for exploring light-matter interaction with an extended variety of molecules, from ultra-cold diatomic species to increasingly complex molecular systems.",
    "authors": [
      "M Manceau",
      "T E Wall",
      "H Philip",
      "A N Baranov",
      "Olivier Lopez",
      "M R Tarbutt",
      "R Teissier",
      "B Darquié"
    ],
    "published": "2023-10-25T08:35:51Z",
    "updated": "2025-12-11T15:05:01Z",
    "categories": [
      "physics.atom-ph",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2508.19653v3",
    "url": "https://arxiv.org/abs/2508.19653v3",
    "pdf_url": "https://arxiv.org/pdf/2508.19653v3.pdf",
    "title": "Charting the Luminosity Capabilities of the CERN Large Hadron Collider with Various Nuclear Species",
    "abstract": "The Large Hadron Collider (LHC) at CERN has been instrumental in recent advances in experimental high energy physics by colliding beams of protons and heavier nuclei at unprecedented energies. The present heavy-ion programme is based mainly on colliding lead nuclei. For future ion runs, there is strong interest to achieve a significantly higher integrated nucleon-nucleon luminosity, which might be achieved through collisions of species other than Pb. In this paper, we explore the nucleon-nucleon luminosity projections in the LHC for a selection of ion species ranging from He to Xe, and including Pb as reference. Alternative beam production schemes are investigated as a way to mitigate effects such as space charge that degrade the beam quality in the LHC injectors. In the most optimistic scenarios, we find up to about a factor~4 improvement in integrated nucleon-nucleon luminosity for a typical future one-month run, with respect to the present Pb programme. We also outline a future study programme and experiments to test the assumptions and refine the simulated projections put forward in this article.",
    "authors": [
      "E. Waagaard",
      "R. Bruce",
      "R. Alemany Fernandez",
      "H. Bartosik",
      "J. M. Jowett",
      "N. Triantafyllou"
    ],
    "published": "2025-08-27T08:01:30Z",
    "updated": "2025-12-11T14:48:31Z",
    "categories": [
      "physics.acc-ph",
      "nucl-ex"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.1016/j.nima.2025.171118"
  },
  {
    "arxiv_id": "2501.16950v3",
    "url": "https://arxiv.org/abs/2501.16950v3",
    "pdf_url": "https://arxiv.org/pdf/2501.16950v3.pdf",
    "title": "Generation of Deep Ultraviolet Optical Vortices via Amplitude and Phase Spiral Zone Plates",
    "abstract": "We present the development and experimental implementation of diffractive optical elements designed to generate optical vortices in the deep ultraviolet range (from 260 to 266 nm). These elements, fabricated using advanced lithographic and etching techniques, facilitate the efficient transformation of Gaussian beams into twisted modes carrying orbital angular momentum. Experimental tests conducted using the laser driver of an RF photoinjector at JINR successfully demonstrate the generation of deep-ultraviolet optical vortices with a topological charge of l = 1. These findings underscore the potential of structured light in the deep ultraviolet range for applications in relativistic electron beam studies and beam manipulation technologies.",
    "authors": [
      "A. S. Dyatlov",
      "M. A. Nozdrin",
      "A. N. Sergeev",
      "N. E. Sheremet",
      "S. S. Stafeev",
      "D. V. Karlovets"
    ],
    "published": "2025-01-28T13:47:06Z",
    "updated": "2025-12-11T10:57:36Z",
    "categories": [
      "physics.optics",
      "physics.acc-ph",
      "quant-ph"
    ],
    "primary_category": "physics.optics",
    "doi": "10.1364/AO.578189"
  },
  {
    "arxiv_id": "2510.13173v2",
    "url": "https://arxiv.org/abs/2510.13173v2",
    "pdf_url": "https://arxiv.org/pdf/2510.13173v2.pdf",
    "title": "The BUTTON-30 detector at Boulby",
    "abstract": "The BUTTON-30 detector is a 30-tonne technology demonstrator designed to evaluate the potential of hybrid event detection, simultaneously exploiting both Cherenkov and scintillation light to detect particle produced in neutrino interactions. The detector is installed at a depth of 1.1 km in the Boulby Underground Laboratory allowing to test the performance of this new technology underground in a low background environment. This paper describes the design and construction of the experiment.",
    "authors": [
      "J. Bae",
      "M. Bergevin",
      "E. P. Bernard",
      "D. S. Bhattacharya",
      "J. Boissevain",
      "S. Boyd",
      "K. Bridges",
      "L. Capponi",
      "J. Coleman",
      "D. Costanzo",
      "T. Cunniffe",
      "S. A. Dazeley",
      "M. V. Diwan",
      "S. R. Durham",
      "E. Ellingwood",
      "A. Enqvist",
      "T. Gamble",
      "S. Gokhale",
      "J. Gooding",
      "C. Graham",
      "E. Gunger",
      "J. J. Hecla",
      "W. Hopkins",
      "I. Jovanovic",
      "T. Kaptanoglu",
      "E. Kneale",
      "L. Lebanowski",
      "K. Lester",
      "V. A. Li",
      "M. Malek",
      "C. Mauger",
      "N. McCauley",
      "C. Metelko",
      "R. Mills",
      "A. Morgan",
      "F. Muheim",
      "A. Murphy",
      "M. Needham",
      "K. Ogren",
      "G. D. Orebi Gann",
      "S. M. Paling",
      "A. F. Papatyi",
      "A. Petts",
      "G. Pinkney",
      "J. Puputti",
      "S. Quillin",
      "B. Richards",
      "R. Rosero",
      "A. Scarff",
      "Y. Schnellbach",
      "P. R. Scovell",
      "B. Seitz",
      "L. Sexton",
      "O. Shea",
      "G. D. Smith",
      "R. Svoboda",
      "D. Swinnock",
      "A. Tarrant",
      "F. Thomson",
      "J. N. Tinsley",
      "C. Toth",
      "M. Vagins",
      "G. Yang",
      "M. Yeh",
      "E. Zhemchugov"
    ],
    "published": "2025-10-15T05:57:48Z",
    "updated": "2025-12-11T10:11:31Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2505.12874v3",
    "url": "https://arxiv.org/abs/2505.12874v3",
    "pdf_url": "https://arxiv.org/pdf/2505.12874v3.pdf",
    "title": "Optimization of 3D diamond detectors with graphitized electrodes based on an innovative numerical simulation",
    "abstract": "Future experiments at hadron colliders require an evolution of the tracking sensors to ensure sufficient radiation hardness as well as space and time resolution to handle unprecedented particle fluxes. 3D diamond sensors with laser-graphitized electrodes are promising candidates due to their strong binding energy, small atomic number, and high carrier mobility. However, the high resistance of the engraved electrodes delays the propagation of the induced signals towards the readout electronics, thereby degrading the precision of the timing measurements. So far, this effect has been the dominant factor limiting the time resolution of these devices, with other contributions, such as those due to electric field inhomogeneities or electronic noise, typically neglected. Recent advancements in graphitization technology, however, motivate a renewed effort in modeling signal generation in 3D diamond detectors, to achieve more reliable predictions. To this purpose, we apply an extended version of the Ramo-Shockley theorem, describing the effect of signal propagation as a time-dependent weighting potential, obtained by numerically solving the Maxwell's equations in a quasi-static approximation. We developed a custom spectral method solver and validated it against COMSOL MultiPhysics. The response of the modeled sensor to a beam of particles is then simulated using Garfield++ and is compared to the data acquired in a beam test carried on in 2021 by the TimeSPOT Collaboration at the SPS, at CERN. Based on the results obtained with this simulation workflow, we conclude that reducing the resistivity of the graphitic columns remains the priority for significantly improving the time resolution of 3D diamond detectors. Once achieved, optimization of the detector geometry and readout electronics design will become equally important steps to further enhance the timing performance of these devices.",
    "authors": [
      "Lucio Anderlini",
      "Alessandro Bombini",
      "Clarissa Buti",
      "Djunes Janssens",
      "Stefano Lagomarsino",
      "Giovanni Passaleva",
      "Michele Veltri"
    ],
    "published": "2025-05-19T08:58:39Z",
    "updated": "2025-12-11T10:11:19Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.08442v3",
    "url": "https://arxiv.org/abs/2512.08442v3",
    "pdf_url": "https://arxiv.org/pdf/2512.08442v3.pdf",
    "title": "High-OAM Deep Ultraviolet Twisted Light Generation for RF-Photoinjector Applications",
    "abstract": "We report on the generation and characterization of ultraviolet (wavelength 266 nm) twisted light with high orbital angular momentum (OAM) using three types of fabricated diffractive optical elements (DOEs): a reflective fork grating, a high-charge spiral phase plate (SPP), and binary axicons. All elements were integrated into a drive-laser beamline of an electron RF-photoinjector, enabling direct evaluation under accelerator-relevant conditions. The SPP produced a high-purity Laguerre-Gaussian mode with OAM l = 64 and a measured conversion efficiency of approximately 80%. Binary axicons generated quasi-Bessel twisted light with topological charges up to m = 10, exhibiting low divergence and stable multi-lobe ring structures. The fork grating reliably produced lower-order modes, l = 2-8, with good agreement between simulations and cylindrical-lens diagnostics. These results constitute, to our knowledge, the first comprehensive experimental demonstration of deep-UV high-OAM beams generated with fabricated DOEs and validated through mode-conversion measurements. The demonstrated techniques are compatible with high-power UV laser systems used in RF-photoinjectors and offer a practical route toward structured photocathode illumination and the generation of relativistic vortex electrons at a particle accelerator facility.",
    "authors": [
      "A. S. Dyatlov",
      "D. M. Dolgintsev",
      "V. V. Gerasimov",
      "V. V. Kobets",
      "V. P. Nazmov",
      "M. A. Nozdrin",
      "A. N. Sergeev",
      "D. S. Shokin",
      "K. E. Yunenko",
      "D. V. Karlovets"
    ],
    "published": "2025-12-09T10:15:02Z",
    "updated": "2025-12-11T08:45:42Z",
    "categories": [
      "quant-ph",
      "physics.acc-ph",
      "physics.optics"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2512.10406v1",
    "url": "https://arxiv.org/abs/2512.10406v1",
    "pdf_url": "https://arxiv.org/pdf/2512.10406v1.pdf",
    "title": "Generation of proton beams at switchback boundary-like rotational discontinuities in the solar wind",
    "abstract": "Alfvénic rotational discontinuities (RDs) are abundant in the inner heliosphere and can be used to model the boundary of switchbacks, i.e. Alfvénic magnetic kinks. To investigate the effects of RDs on proton kinetics, we model a pair of switchback-boundary-like RDs with a hybrid Particle-In-Cell (PIC) approach in a 2D system. We find that, at one of the boundary RDs, a significant population of protons remains trapped over long times, creating a secondary beam-like component with temperature anisotropy $T_\\perp/T_\\|\\gtrsim4$ in the proton velocity distribution function that excites ion cyclotron waves within the downstream portion of the transition layer. Further analysis suggests that the static electric field in the vicinity of the RD is the key factor in trapping the protons. This work indicates that switchback boundaries could represent a viable environment for the creation of proton beams in the heliosphere; it also highlights the need to investigate RD sub-structures, especially the embedded current systems of interplanetary RDs. Finally, this paper underscores the importance of high-resolution observations of the solar wind velocity distributions around RDs.",
    "authors": [
      "Rong Lin",
      "Fabio Bacchini",
      "Jiansen He",
      "Luca Pezzini",
      "Jingyu Peng"
    ],
    "published": "2025-12-11T08:16:22Z",
    "updated": "2025-12-11T08:16:22Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2511.08954v2",
    "url": "https://arxiv.org/abs/2511.08954v2",
    "pdf_url": "https://arxiv.org/pdf/2511.08954v2.pdf",
    "title": "Progress on the ALETHEIA project and a new approach to mitigate events overlap",
    "abstract": "The ALETHEIA project aims to search for low-mass dark matter using liquid helium (LHe)-filled time projection chambers (TPCs). While liquid argon and liquid xenon TPCs have been extensively employed in the field of direct dark matter detection, successful development of LHe TPCs has not yet been achieved. Launched in 2020, our project has made significant progress since then. These advancements have convinced us that a single-phase LHe TPC is technologically feasible. Compared to liquid xenon and liquid argon TPCs, one of the unique challenges for LHe TPCs is event overlap caused by the 13-second lifetime scintillation. We will demonstrate that this overlap can be entirely mitigated when the LHe temperature is maintained near 1.0 K. At this temperature, electron mobility is three orders of magnitude higher than at approximately 4.0 K, which is the temperature we initially proposed for the LHe TPC.",
    "authors": [
      "Junhui Liao"
    ],
    "published": "2025-11-12T03:59:38Z",
    "updated": "2025-12-11T07:50:49Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.10259v1",
    "url": "https://arxiv.org/abs/2512.10259v1",
    "pdf_url": "https://arxiv.org/pdf/2512.10259v1.pdf",
    "title": "A DC discharge plasma experiment for undergraduate laboratories",
    "abstract": "Plasma physics offers a wide range of fundamental phenomena, making it an excellent subject for undergraduate laboratory instruction. In this work, we present the design, construction, and characterization of a DC glow-discharge plasma chamber developed for the junior-level curriculum, a project carried out by two undergraduate students. The apparatus consists of a 1-meter-long quartz tube with a movable electrode, enabling systematic exploration of plasma behavior under varying pressure, voltage, and geometry. Using this platform, we characterized the Paschen breakdown relation and the voltage-current characteristics of the plasma. We then developed Langmuir probes to map spatial distributions of electron temperature and density, and used Boltzmann plot spectroscopy to measure excitation temperatures across different plasma regions. Finally, with custom Helmholtz coils, we demonstrated magnetic focusing of electrons. We performed Runge-Kutta simulations of particle trajectories and analyzed the electron drift velocity by comparing the focal lengths. Overall, this plasma chamber provides a versatile platform for investigating fundamental plasma phenomena and offers potential for future studies, including microwave-plasma interactions and other student-driven investigations.",
    "authors": [
      "You-Hsuan Chen",
      "Ting-An Wang",
      "Pisin Chen"
    ],
    "published": "2025-12-11T03:42:33Z",
    "updated": "2025-12-11T03:42:33Z",
    "categories": [
      "physics.plasm-ph",
      "physics.ed-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.03712v2",
    "url": "https://arxiv.org/abs/2506.03712v2",
    "pdf_url": "https://arxiv.org/pdf/2506.03712v2.pdf",
    "title": "Simulation of MAPS and a MAPS-based Inner Tracker for the Super Tau-Charm Facility",
    "abstract": "Monolithic Active Pixel Sensors (MAPS) are a promising detector candidate for the inner tracker of the Super Tau-Charm Facility (STCF). To evaluate the performance of MAPS and the MAPS-based inner tracker, a dedicated simulation workflow has been developed, offering essential insights for detector design and optimization.   The intrinsic characteristics of MAPS, designed using several fabrication processes and pixel geometries, were investigated through a combination of Technology Computer Aided Design (TCAD) and Monte Carlo simulations. Simulations were conducted with both minimum ionizing particles and $^{55}$Fe X-rays to assess critical parameters such as detection efficiency, cluster size, spatial resolution, and charge collection efficiency. Based on these evaluations, a MAPS sensor featuring a strip-like pixel and a high-resistivity epitaxial layer is selected as the baseline sensor design for the STCF inner tracker due to its excellent performance.   Using this optimized MAPS design, a three-layer MAPS-based inner tracker was modeled and simulated. The simulation demonstrated an average detection efficiency exceeding 99%, spatial resolutions of 44.8$\\rm{μm}$ in the $z$ direction and 8.2$\\rm{μm}$ in the $r-φ$ direction, and an intrinsic sensor time resolution of 5.9ns for 1GeV/c $μ^-$ particles originating from the interaction point. These promising results suggest that the MAPS-based inner tracker fulfills the performance requirements of the STCF experiment.",
    "authors": [
      "Ruiyang Zhang",
      "Dongwei Xuan",
      "Jiajun Qin",
      "Lei Zhao",
      "Le Xiao",
      "Xiangming Sun",
      "Lailin Xu",
      "Jianbei Liu"
    ],
    "published": "2025-06-04T08:44:56Z",
    "updated": "2025-12-11T02:55:16Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.04432v2",
    "url": "https://arxiv.org/abs/2512.04432v2",
    "pdf_url": "https://arxiv.org/pdf/2512.04432v2.pdf",
    "title": "Design and Performance Simulation of the Electromagnetic Calorimeter at EicC",
    "abstract": "The electromagnetic calorimeter (ECAL) is a key detector component for precise electron and photon measurements in electron-ion collision experiments. At the Electron-Ion Collider in China (EicC), high-performance calorimetry is essential for exploring the internal structure of nucleons and studying the dynamics of quarks and gluons within quantum chromodynamics (QCD). This paper presents the optimized design and performance simulation of the EicC ECAL system. The ECAL consists of three specialized sections tailored to distinct detection environments: (1) an electron-Endcap employing high-resolution pure Cesium Iodide (pCsI) crystals, (2) a central barrel, and (3) an ion-Endcap, both adopting a cost-effective Shashlik-style sampling calorimeter with improved light yield. Each segment's geometry and material composition have been systematically optimized through Geant4 simulations to achieve excellent energy and position resolutions as well as strong electron-pion discrimination. The simulated performance indicates that the ECAL can achieve energy resolutions of 2 percent divided by sqrt(E) for pCsI crystals and 5 percent divided by sqrt(E) for Shashlik modules, meeting the design goals of the EicC detector.",
    "authors": [
      "Ye Tian",
      "Souvik Maity",
      "Jingyu Li",
      "Yuancai Wu",
      "Shan Sha",
      "Yutie Liang",
      "Aiqiang Guo",
      "Yuxiang Zhao",
      "Dexu Lin"
    ],
    "published": "2025-12-04T03:55:34Z",
    "updated": "2025-12-11T01:41:45Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.10162v1",
    "url": "https://arxiv.org/abs/2512.10162v1",
    "pdf_url": "https://arxiv.org/pdf/2512.10162v1.pdf",
    "title": "Solid-state Laser Cooling",
    "abstract": "Since the first proof-of-concept demonstrations of photoluminescence-based optical refrigeration, solid-state laser cooling has developed into a credible competitor to conventional cryogenic technologies. Solid-state laser cooling continues to advance as new materials push cooling limits. These developments have created a need to consolidate progress made to date as well as standardize critical experimental considerations needed for reliable and verifiable cooling measurements. This primer therefore outlines essential concepts and requirements, which underpin solid-state laser cooling. The primer summarizes key milestones achieved with cooling-grade, rare-earth-doped glasses and crystals as well as with semiconductors. It additionally highlights emerging applications of solid-state optical refrigeration. To strengthen the consistency and reproducibility of cooling results going forward, two reporting checklists are introduced. They cover materials, cooling metrics, and thermometry. This primer is intended to serve as both a tutorial and a practical reference for incoming and existing researchers involved in solid-state laser-cooling.",
    "authors": [
      "Yang Ding",
      "Shenghao Zhang",
      "Alexander R. Albrecht",
      "Zhaojie Feng",
      "Lars Forberger",
      "Hiroki Tanaka",
      "Markus P. Hehlen",
      "Galina Nemova",
      "Peter J. Pauzauskie",
      "Denis V. Seletskiy",
      "Masaru Kuno"
    ],
    "published": "2025-12-10T23:41:01Z",
    "updated": "2025-12-10T23:41:01Z",
    "categories": [
      "physics.optics",
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2512.10137v1",
    "url": "https://arxiv.org/abs/2512.10137v1",
    "pdf_url": "https://arxiv.org/pdf/2512.10137v1.pdf",
    "title": "μRWELL-PICOSEC: Precision Timing with Resistive Micro-Well Detector",
    "abstract": "The PICOSEC detector concept uses a micro-pattern gaseous detector (MPGD) amplification structure combined with a Cerenkov radiator coated with a semi-transparent photocathode to provide below tens of picosecond-level precision timing capabilities with minimum ionizing particles. PICOSEC has triggered interest in the development of time-of-flight detectors for particle identification and timing detectors for track reconstruction in the high rate environment of future nuclear and high energy physics experiments. The PICOSEC Micromegas (or PICOSEC-MM) detector, developed by the CERN-based PICOSEC collaboration, use the Micromegas structure for gaseous amplification and achieve below 20 ps timing resolution. A new type of PICOSEC detector, the μRWELL-PICOSEC based on μRWELL amplification structure, is being investigated at Thomas Jefferson National Accelerator Facility (Jefferson Lab) alongside PICOSEC-MM R&D efforts in Europe. Preliminary results from the two 2024 beam test campaigns at CERN demonstrate a timing performance better than 24 ps is achievable with a single-channel μRWELL-PICOSEC prototype. A vigorous R&D effort is ongoing to improve the timing performance, robustness and operational stability of μRWELL-PICOSEC detectors. Development of a large size μRWELL-PICOSEC is also under consideration for applications in large scale experiments.",
    "authors": [
      "Kondo Gnanvo"
    ],
    "published": "2025-12-10T22:33:38Z",
    "updated": "2025-12-10T22:33:38Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.10119v1",
    "url": "https://arxiv.org/abs/2512.10119v1",
    "pdf_url": "https://arxiv.org/pdf/2512.10119v1.pdf",
    "title": "A Computational Procedure for Assessing I$_c$($\\varepsilon$) in Nb$_3$Sn/Bi-2212 Hybrid Magnets",
    "abstract": "The critical current of superconductors is commonly measured by testing unloaded wires under an external magnetic field. While stressed by intense Lorentz forces, the existing HTS/LTS superconductors are prone to a reduction in critical current before reaching their structural mechanical limit. In this work, the magnetic and mechanical analysis of the FNAL 4-layer Bi-2212/Nb$_3$Sn hybrid dipole magnet is reported, aimed at predicting the critical current degradation for both the superconductors during powering at 16 T. All the Rutherford cables in the coils of the hybrid magnet were modeled at the strand level in Ansys APDL with the heterogeneous cable model. Utilizing this detailed geometry, it was possible to evaluate the effects of strain on the critical current degradation for both the Nb$_3$Sn and Bi-2212 superconductors under the intense Lorentz forces. The analysis presented in this paper integrates strain-dependent critical current laws, with parameters derived from experimental data, to simulate the hybrid magnet's performance for all possible current-powering configurations. The proposed methodology enables a detailed assessment of conductor integrity and I$_C$($\\varepsilon$) reduction in existing hybrid magnet designs, providing a versatile and rigorous framework for optimizing future high-field hybrid magnets.",
    "authors": [
      "A. D'Agliano",
      "A. V. Zlobin",
      "I. Novitski",
      "G. Vallone",
      "P. Ferracin",
      "E. Barzi",
      "S. Donati",
      "V. Giusti"
    ],
    "published": "2025-12-10T22:12:06Z",
    "updated": "2025-12-10T22:12:06Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1109/TASC.2025.3624725"
  },
  {
    "arxiv_id": "2512.10097v1",
    "url": "https://arxiv.org/abs/2512.10097v1",
    "pdf_url": "https://arxiv.org/pdf/2512.10097v1.pdf",
    "title": "Enabling searches for long-lived particles at a future 10 TeV Muon Collider",
    "abstract": "Muon Colliders offer fantastic opportunities to explore new phenomena at the energy frontier. However, beam-induced-backgrounds from muon decays pose significant challenges for detector design, readout, and reconstruction. Previous detector studies have employed stringent hit-timing requirements to reduce occupancy to manageable levels with negligible efficiency loss for prompt Standard Model particles. In the spirit of maximizing discovery potential, we investigate the capability of detecting meta-stable charged long-lived particles at a 10 TeV Muon Collider. As a benchmark, we consider a Gauge Mediated Supersymmetry Breaking (GMSB) model in which the stau is long-lived and can be identified as a high momentum, slowly moving track. We find that nominal hit-timing selections are too restrictive, and investigate the impact of looser requirements. We demonstrate that it is possible to recover sensitivity to particles with masses close to $\\sqrt{s}/2$ by expanding time acceptance, and provide recommendations to further improve tracker design and track reconstruction.",
    "authors": [
      "Mira Littmann",
      "Mark Larson",
      "Benjamin Rosser",
      "Tate Flicker",
      "Kane Huang",
      "Leo Rozanov",
      "Karri Folan Di Petrillo"
    ],
    "published": "2025-12-10T21:39:20Z",
    "updated": "2025-12-10T21:39:20Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2512.08027v2",
    "url": "https://arxiv.org/abs/2512.08027v2",
    "pdf_url": "https://arxiv.org/pdf/2512.08027v2.pdf",
    "title": "Overview of the Helios Design: A Practical Planar Coil Stellarator Fusion Power Plant",
    "abstract": "Thea Energy, Inc. has developed the preconceptual design for \"Helios,\" a fusion power plant based on the planar coil stellarator architecture. In this overview paper, the design is summarized and the reader is referred to the other papers for more detail. The Helios design is based around a two-field-period quasi-axisymmetric (\"QA\") stellarator equilibrium with aspect ratio 4.5 and a novel tokamak-like X-point divertor. The natural stability, low recirculating power, and steady-state capability of the stellarator are leveraged. Stability and transport are calculated using state-of-the-art, high-fidelity codes and grounded in measured performance of existing experiments. The electromagnetic coil set is high-temperature superconducting (\"HTS\") and consists of 12 large, plasma-encircling coils like the toroidal field coils of a tokamak, and 324 smaller, field-shaping coils. All coils are planar and convex. A maximum of 20 T on-coil is enforced, a value which has been achieved in existing large-bore HTS coils. There is a minimum of 1.2 m between plasma and coils, leaving space for tritium breeding blanket and neutron shielding. Because of this thick shielding, all coils have a minimum 40-year operational lifetime, the same minimum lifetime of the power plant system. 1.1 GW of thermal power and 390 MW of net electric power are produced. The shaping coils are individually controllable, enabling a uniquely configurable magnetic field for relaxed manufacturing and assembly tolerances and plasma control. A practical maintenance architecture is a primary driver of the design; maintenance is performed on entire toroidal sectors that are removed from between the encircling coils. A biennial maintenance cycle is estimated to take approximately 84 days, resulting in an 88% capacity factor. Rigorous engineering constraints such as temperature and stress limits are enforced.",
    "authors": [
      "C. P. S. Swanson",
      "S. T. A. Kumar",
      "D. W. Dudt",
      "E. R. Flom",
      "W. B. Kalb",
      "T. G. Kruger",
      "M. F. Martin",
      "J. R. Olatunji",
      "S. Pasmann",
      "L. Z. Tang",
      "J. von der Linden",
      "J. Wasserman",
      "M. Avida",
      "A. S. Basurto",
      "M. Dickerson",
      "N. de Boer",
      "M. J. Donovan",
      "A. H. Doudna Cate",
      "D. Fort",
      "W. Harris",
      "U. Khera",
      "A. Koen",
      "J. A. Labbate",
      "N. Maitra",
      "A. Ottaviano",
      "R. K. Parmar",
      "E. J. Paul",
      "B. Reydel",
      "A. van Riel",
      "P. K. Romano",
      "M. Savastianov",
      "S. Saxena",
      "S. Seethalla",
      "S. Srinivasan",
      "R. H. Wu",
      "D. Nash",
      "J. Priebe",
      "M. Slepchenkov",
      "S. Walsh",
      "B. Berzin",
      "D. A. Gates",
      "the Thea Energy team"
    ],
    "published": "2025-12-08T20:38:49Z",
    "updated": "2025-12-10T21:24:21Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  }
]