{
  "arxiv_id": "2601.10807v1",
  "url": "https://arxiv.org/abs/2601.10807v1",
  "pdf_url": "https://arxiv.org/pdf/2601.10807v1.pdf",
  "title": "Charge-Carrier Mobility in Diamond: Review, Data Compilation, and Modelling for Detector Simulations",
  "abstract": "Reported electron and hole mobilities, and their saturation velocities, in diamond span orders of magnitude across the literature. We attribute this dispersion primarily to (i) the electric-field window probed in TCT measurements, (ii) the choice of mobility model, and (iii) the excitation source (alpha, laser, or electron). Using an aggregated literature dataset, we benchmark the Trofimenkoff and Caughey-Thomas parameterisations together with a new piecewise model for both conduction- and valence-band transport. For electrons, the piecewise model provides the best global description over a broad electric-field range and is shown to arise as the room-temperature limit of a more general superposition framework that explicitly incorporates intervalley repopulation in the conduction band. For holes, the Caughey-Thomas model remains the statistically preferred description, in line with the absence of a strong repopulation effect in the accessible data. Furthermore, we demonstrate a systematic source dependence (alpha versus laser) and quantify its impact on fitted mobility and saturation-velocity values. We provide temperature scalings over narrow intervals around room temperature and recommend parameter sets for implementation in device and detector simulation frameworks. Together, these results reconcile much of the apparent inconsistency in the literature and offer clear guidance for model selection, experimental design, and device-level simulation of charge transport in intrinsic diamond.",
  "authors": [
    "Faiz Rahman Ishaqzai",
    "Muhammed Deniz",
    "Kevin Kröninger",
    "Jens Weingarten"
  ],
  "published": "2026-01-15T19:16:04Z",
  "updated": "2026-01-15T19:16:04Z",
  "categories": [
    "physics.ins-det",
    "cond-mat.mtrl-sci",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}