{
  "arxiv_id": "2510.01060v3",
  "url": "https://arxiv.org/abs/2510.01060v3",
  "pdf_url": "https://arxiv.org/pdf/2510.01060v3.pdf",
  "title": "Do plasmoids induce fast magnetic reconnection in well-resolved current sheets in 2D MHD simulations?",
  "abstract": "We investigate the development of tearing-mode instability using the highest-resolution two-dimensional magnetohydrodynamic simulations of reconnecting current sheets performed on a uniform grid, for Lundquist numbers of $10^3 \\le S \\le 5 \\times 10^5$ , reaching up to $65,536^2$ grid cells. We demonstrate a Sweet--Parker scaling of the reconnection rate $V_{\\text{rec}} \\sim S^{-1/2}$ up to Lundquist numbers $S \\sim 10^4$. For larger values of Lundquist number, between $2\\times 10^4\\le S \\le 2 \\times 10^5$, plasmoid formation sets in, leading to a slight enhancement of the reconnection rate, $V_{\\text{rec}} \\sim S^{-1/3}$, consistent with the prediction from linear tearing mode induced reconnection, indicating that reconnection remains resistivity-dependent and therefore slow. In this range of $S$-values, the plasmoids do not undergo a merger cascade, as they are rapidly advected out of the reconnection layer. Only for $S > 2 \\times 10^5$, we observe the nonlinear development of the tearing-mode instability, with plasmoid coalescence and a saturation of the reconnection rate at $V_\\text{rec} / V_A \\sim 0.01$. At such high $S$, however, the corresponding Reynolds number is large, reaching $\\text{Re} > 2000$ even on scales comparable to the current-sheet thickness. We therefore conclude that, in astrophysical systems, it is essential to account for the dominant influence of turbulence and three-dimensional effects in the reconnection process.",
  "authors": [
    "G. H. Vicentin",
    "G. Kowal",
    "E. M. de Gouveia Dal Pino",
    "A. Lazarian"
  ],
  "published": "2025-10-01T16:00:23Z",
  "updated": "2026-02-02T16:07:50Z",
  "categories": [
    "physics.plasm-ph",
    "astro-ph.HE",
    "hep-th"
  ],
  "primary_category": "physics.plasm-ph"
}