{
  "arxiv_id": "2602.03458v1",
  "url": "https://arxiv.org/abs/2602.03458v1",
  "pdf_url": "https://arxiv.org/pdf/2602.03458v1.pdf",
  "title": "Hydrodynamic simulations of expanded warm dense foil heated by pulsed-power",
  "abstract": "Warm Dense Matter lies at the frontier between condensed matter and plasma, and plays a central role in various fields ranging from planetary science to inertial confinement fusion. Improving our understanding of this regime requires experimental data that can be directly compared with theoretical and numerical models over a broad range of conditions. In this work, a pulsed-power experiment is described in which thin metallic foils, confined within a sapphire cell, are Joule-heated to achieve the expanded warm dense matter regime. Designing such an experiment is challenging, as it requires simultaneously predicting the electrical response of the pulsed-power driver and the hydrodynamic evolution of the heated material. To tackle this challenge, a modeling framework has been developed that couples an electrical description of the pulsed-power system, including the driver, the switching stages and the load with a one-dimensional hydrodynamic code. This coupling allows the electrical energy deposition and the load thermodynamic evolution to be consistently linked through the material electrical conductivity. This approach takes advantage of the simplicity of a 1D geometry while retaining the essential physics and allowing to reproduce various measurements with good accuracy, such as expansion velocity, current and voltage. This numerical approach therefore constitutes a robust and efficient method for designing and optimizing future Warm Dense Matter experiments using pulsed-power facilities.",
  "authors": [
    "Luc Revello",
    "Laurent Videau",
    "Frédéric Zucchini",
    "Mathurin Lagrée",
    "Christophe Blancard",
    "Benjamin Jodar"
  ],
  "published": "2026-02-03T12:24:40Z",
  "updated": "2026-02-03T12:24:40Z",
  "categories": [
    "physics.plasm-ph",
    "hep-ex"
  ],
  "primary_category": "physics.plasm-ph"
}