{
  "arxiv_id": "2602.03375v1",
  "url": "https://arxiv.org/abs/2602.03375v1",
  "pdf_url": "https://arxiv.org/pdf/2602.03375v1.pdf",
  "title": "Effect of static magnetic island on ITG of ADITYA-U tokamak",
  "abstract": "Magnetic islands play a crucial role in regulating plasma confinement in tokamaks by interacting with micro-instabilities, such as the ion temperature gradient (ITG) mode. This work presents a detailed investigation of the effects of static magnetic islands on ITG instability, relevant to the ADITYA-U tokamak, using the Global Gyrokinetic Code in Cylindrical Coordinates (G2C3), a particle-in-cell (PIC) framework that employs a neural-network-assisted projection scheme. A two-phase simulation strategy is adopted. In the first phase, static magnetic islands with mode numbers (m, n) = (2, 1) and (3, 1) are introduced by perturbing the equilibrium magnetic flux functions. Particle dynamics within these modified topologies result in the flattening of plasma density profiles in the island regions, confirming island formation and its impact on the equilibrium profiles. In the second phase, the flattened profiles serve as new equilibria for linear electrostatic gyrokinetic simulations with adiabatic electrons, enabling the study of the modified ITG behavior. Magnetic islands significantly restructure the ITG mode, producing a spatial redistribution of potential fluctuations within and around the island region. Moreover, as the island width increases, the growth rates of different toroidal ITG modes converge, suggesting a universal stabilization trend. A comparison between the (2,1) and (3,1) islands indicates that higher-q islands lead to a more spatially extended ITG mode structure, reflecting the longer magnetic connection lengths and weaker curvature drive at outer flux surfaces. These results demonstrate the pivotal role of island-induced equilibrium modifications in determining ITG stability and mode structure in tokamak plasmas.",
  "authors": [
    "Vibhor Kumar Singh",
    "Amal R Biju",
    "Jaya Kumar Alageshan",
    "Kaushalender Singh",
    "Deepti Sharma",
    "Joydeep Ghosh",
    "Nishant Sirse",
    "Abhijit Sen",
    "Sarveshwar Sharma",
    "Manjunatha Valmiki",
    "Sandeep Agrawal",
    "Sanjay Wandhekar",
    "Animesh Kuley"
  ],
  "published": "2026-02-03T10:53:10Z",
  "updated": "2026-02-03T10:53:10Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}