{
  "arxiv_id": "2602.03631v1",
  "url": "https://arxiv.org/abs/2602.03631v1",
  "pdf_url": "https://arxiv.org/pdf/2602.03631v1.pdf",
  "title": "Fabrication and Characterization of p-type Inverted Coaxial Point Contact (ICPC) Detectors with a-Ge Dual-Blocking Contacts",
  "abstract": "We report the fabrication and characterization of two p-type inverted coaxial point contact (ICPC) high-purity germanium (HPGe) detectors, SAP16 and SAP17, produced from USD-grown crystals with net impurity concentrations of $\\sim 3\\times10^{10}\\,\\mathrm{cm^{-3}}$. Both devices employ \\emph{thin} amorphous-germanium (a-Ge) dual-blocking contacts, implemented here for the first time on ICPC detectors, to provide bipolar charge blocking while limiting dead-layer thickness. Electrical tests at 76~K demonstrate stable operation with picoampere-level leakage currents and sub-pF capacitance: SAP17 reached $\\sim 4.62$~pA at the maximum tested bias (500~V) and operated stably at 400~V with $C\\simeq 0.503$~pF. \\emph{Meanwhile,} SAP16 achieved superior spectroscopic performance, with energy resolutions of 2.42\\% at 59.5~keV and 0.36\\% at 662~keV. Gamma-ray spectroscopy with $^{241}$Am and $^{137}$Cs shows that modest geometric differences lead to measurable changes in depletion behavior and charge-collection uniformity, consistent with electrostatic modeling. Angular-response measurements further reveal pronounced directional sensitivity at 59.5~keV, whereas the 662~keV response is essentially isotropic over the measured range. These results validate thin a-Ge dual-blocking contacts for ICPC HPGe detectors and highlight geometry-driven trade-offs among leakage current, depletion, and energy resolution relevant to low-background and low-threshold applications.",
  "authors": [
    "S. A. Panamaldeniya",
    "K. M. Dong",
    "D. M. Mei"
  ],
  "published": "2026-02-03T15:19:14Z",
  "updated": "2026-02-03T15:19:14Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}