{
  "arxiv_id": "2409.06389v3",
  "url": "https://arxiv.org/abs/2409.06389v3",
  "pdf_url": "https://arxiv.org/pdf/2409.06389v3.pdf",
  "title": "Contemporaneous Appearances of Auroral Spiral and Transpolar Arc: Polar   UVI Observations and Global MHD Simulations",
  "abstract": "A local vortex-structured aurora and a large-scale transpolar arc (TPA) were contemporaneously observed by the Polar ultraviolet imager (UVI) when a substorm almost recovered, and the associated interplanetary magnetic field (IMF) BY and BZ polarities were negative and negative-to-positive. The TPA grew along the dawnside auroral oval from the nightside to the dayside, and an auroral spiral and several spots were located azimuthally near the poleward edge of the nightside auroral oval. Both auroras had tailward elongated source regions with scales of ~30 RE (spiral) and more than ~45 RE (TPA). To examine their magnetospheric/ionospheric field-aligned current (FAC) profiles, we performed global magnetohydrodynamic (MHD) simulations, using two different types of code: Block-Adaptive-Tree Solar-wind Roe Upwind Scheme (BATS-R-US) and improved REProduce Plasma Universe (REPPU). Both MHD simulations reproduced the tailward elongated TPA-associated FAC structures. The spiral-associated FAC intensity was, however, approximately three orders of magnitude weaker than the TPA-associated FAC intensity. Only improved REPPU simulation replicated faint but continuous poleward extending streak-like structures without evident FACs, instead of the auroral spiral. Geomagnetic field measurements showed that the spiral had upward (from the ionosphere to the magnetosphere) FACs, and its appearance might be accompanied by ultra-low-frequency Pc5 waves. Our results suggest that 1) a local-scale spiral might be formed with much weaker magnetotail FACs than global-scale TPA-associated FACs, although the spiral source region is elongated tailward, and 2) a solar wind-magnetosphere-ionosphere coupling system with minimal or no significant substorm effects is required to form the spiral with the weak magnetotail FACs.",
  "authors": [
    "Motoharu Nowada",
    "Yukinaga Miyashita",
    "Aoi Nakamizo",
    "Noora Partamies",
    "Quan-Qi Shi"
  ],
  "published": "2024-09-10T10:11:14Z",
  "updated": "2025-09-26T08:18:39Z",
  "categories": [
    "physics.space-ph",
    "astro-ph.SR",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.space-ph"
}