{
  "arxiv_id": "2509.22021v1",
  "url": "https://arxiv.org/abs/2509.22021v1",
  "pdf_url": "https://arxiv.org/pdf/2509.22021v1.pdf",
  "title": "Background stability and annual modulation test using PICOLON ultra-pure   NaI(Tl) detector",
  "abstract": "The dark matter observation claimed by the DAMA/LIBRA experiment has been a long-standing puzzle within the particle physics community. NaI(Tl) crystals with radiopurity comparable to DAMA/LIBRA's are essential for adequate verification. Existing experiments using NaI(Tl) target have been hampered by the high radioactivity concentration of NaI(Tl) crystals. PICOLON experiment conducts an independent search for Weakly Interacting Massive Particles using highest purity NaI(Tl) crystals. In 2020, the NaI(Tl) crystal (Ingot#85) reached the same purity level as DAMA/LIBRA crystals. The DAMA/LIBRA group has stressed that verifying their signal requires high-purity NaI(Tl) crystals with long-term stability. Based on a six-month measurement, we have confirmed the long-term stability of its radiopurity. This stability provides a significant advantage for future efforts to adequately verify the DAMA/LIBRA result using NaI(Tl) crystal. In this paper, we present the background stability of purity in the Ingot#94 NaI(Tl) detector, which was produced using the Ingot#85 purification method, along with the first annual modulation search conducted by the PICOLON experiment.",
  "authors": [
    "K. Kotera",
    "D. Chernyak",
    "H. Ejiri",
    ". K. Fushimi",
    "K. Hata",
    "R. Hazama",
    "T. Iida",
    "H. Ikeda",
    "K. Imagawa",
    "K. Inoue",
    "H. Ito",
    "T. Kishimoto",
    "M. Koga",
    "A. Kozlov",
    "K. Nakamura",
    "R. Orito",
    "T. Shima",
    "Y. Takemoto",
    "S. Umehara",
    "Y. Urano",
    "K. Yasuda",
    "S. Yoshida"
  ],
  "published": "2025-09-26T07:56:58Z",
  "updated": "2025-09-26T07:56:58Z",
  "categories": [
    "physics.ins-det",
    "astro-ph.IM"
  ],
  "primary_category": "physics.ins-det"
}