{
  "arxiv_id": "2509.21883v1",
  "url": "https://arxiv.org/abs/2509.21883v1",
  "pdf_url": "https://arxiv.org/pdf/2509.21883v1.pdf",
  "title": "Enhancing Particle Identification in Helium-Based Drift Chambers Using   Cluster Counting Insights from Beam Test Studies",
  "abstract": "Particle identification in gaseous detectors traditionally relies on energy loss measurements (dE/dx); however, uncertainties in total energy deposition limit its resolution. The cluster counting technique (dN/dx) offers an alternative approach by exploiting the Poisson-distributed nature of primary ionization, providing a statistically robust method for mass determination. Simulation studies with Garfield++ and Geant4 indicate that dN/dx can achieve twice the resolution of dE/dx in helium-based drift chambers. However, experimental implementation is challenging due to signal overlap in the time domain, complicating the identification of electron peaks and ionization clusters. This paper presents novel algorithms and modern computational techniques to address these challenges, facilitating accurate cluster recognition in experimental data. The effectiveness of these algorithms is validated through four beam tests conducted at CERN, utilizing various helium gas mixtures, gas gains, and wire orientations relative to ionizing tracks. The experiments employ a muon beam (1 GeV/c to 180 GeV/c) with drift tubes of different sizes and sense wire diameters. The analysis explores the Poisson nature of cluster formation, evaluates the performance of different clustering algorithms, and examines the dependence of counting efficiency on the beam particle impact parameter. Furthermore, a comparative study of the resolution achieved using dN/dx and dE/dx is presented.",
  "authors": [
    "W. Elmetenawee",
    "M. Abbrescia",
    "M. Anwar",
    "G. Chiarello",
    "A. Corvaglia",
    "F. Cuna",
    "N. De Filippis",
    "F. De Santis",
    "M. Dong",
    "E. Gorini",
    "F Grancagnolo",
    "F. G. Gravili",
    "K. Johnson",
    "S. Liu",
    "M. Louka",
    "A. Miccoli",
    "M. Panareo",
    "M. Primavera",
    "F. M. Procacci",
    "A. Taliercio",
    "G. Tassielli",
    "A. Ventura L. Wu",
    "G. Zhao"
  ],
  "published": "2025-09-26T05:15:47Z",
  "updated": "2025-09-26T05:15:47Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}