{
  "arxiv_id": "2509.21640v1",
  "url": "https://arxiv.org/abs/2509.21640v1",
  "pdf_url": "https://arxiv.org/pdf/2509.21640v1.pdf",
  "title": "A comprehensive equivalent circuit model for high overtone bulk acoustic   resonators (HBARs)",
  "abstract": "This paper presents a new and comprehensive equivalent circuit model for high overtone bulk acoustic resonators (HBARs). HBARs demonstrate several very sharp resonance modes distributed nearly periodically over a very wide frequency range. This spectrum response of HBARs offers unique advantages but poses significant modeling challenges. The proposed circuit incorporates and models the unique physical components of the HBAR: piezoelectric transducer, substrate (a perfectly periodic multimode cavity), piezoelectric coupling, and critically, the imperfectly matched transducer-substrate interface which imparts characteristic aperiodicity to the HBAR mode spectrum. By judicious use of fixed, periodic, or tightly constrained virtual lumped-element branches, and sets of branches, the model retains clear and intuitive links to the physical device, while reducing the complexity needed for fitting dense, broadband datasets. We demonstrate the validity and power of this model by simultaneously fitting measured data for 61 modes of a GaN/NbN/sapphire HBAR over a span of 1 GHz, and extracting modal parameters such as quality factors and coupling coefficients. We show that this new model is compact and yet scalable: by leveraging the inherent internal relationships in an HBAR, the model can be easily expanded to include multiple transducer overtones and envelopes, multiple distinct transducers, and spurious modes. In addition to fitting measured datasets, the new model can also be used to easily analyze various perturbations to the nominal state of the HBAR. We expect the new model to be useful for the design of classical HBAR-based oscillators, filters, and sensors, and for the integration of HBARs into quantum circuits.",
  "authors": [
    "Vikrant J. Gokhale",
    "Brian P. Downey"
  ],
  "published": "2025-09-25T21:58:51Z",
  "updated": "2025-09-25T21:58:51Z",
  "categories": [
    "cond-mat.mes-hall",
    "cond-mat.other",
    "cs.SY",
    "eess.SY",
    "physics.app-ph",
    "physics.ins-det"
  ],
  "primary_category": "cond-mat.mes-hall"
}