{
  "arxiv_id": "2512.20935v1",
  "url": "https://arxiv.org/abs/2512.20935v1",
  "pdf_url": "https://arxiv.org/pdf/2512.20935v1.pdf",
  "title": "Spectroscopy of VUV luminescence in dual-phase xenon detectors",
  "abstract": "We present spectroscopic measurements of xenon luminescence in a time projection chamber operated in a dual-phase (liquid-gas) configuration. Thorium-228 $α$ decays excited the liquid, resulting in the formation of singlet and triplet excimers that emit vacuum ultraviolet (VUV) scintillation. Ionisation electrons were drifted to the liquid surface and extracted into the vapour, where they produced VUV electroluminescence. A time-resolved photon-counting technique was used to obtain the scintillation spectrum in the liquid, which exhibited a peak wavelength of $177.1\\pm0.1_\\mathrm{stat} \\pm0.1_\\mathrm{sys}\\,\\textrm{nm}$ and a full-width at half maximum (FWHM) of $11.3\\pm0.2_\\mathrm{stat} \\pm0.0_\\mathrm{sys}\\,\\textrm{nm}$. The data were also used to obtain distinct singlet and triplet emission models, with the singlet emission peaking $1.8\\pm0.3_{\\mathrm{stat}}\\pm 0.3_{\\mathrm{sys}}\\,\\textrm{nm}$ shorter than the triplet. The gas electroluminescence spectrum was obtained simultaneously, while under conditions of thermal equilibrium. It remained consistent across vapour pressures of $1.3$-$2.2\\,\\textrm{bar}$, with a peak of $173.28\\pm0.02_\\mathrm{stat} {_{-0.1}^{+0.2}}{}_\\mathrm{sys}\\,\\textrm{nm}$, a FWHM of $10.59\\pm0.03_\\mathrm{stat} {_{-0.2}^{+0.0}}{}_\\mathrm{sys}\\,\\textrm{nm}$, and a small short-wavelength tail that constitutes $(0.6\\pm0.1)$% of the total spectrum. These are the only spectroscopic measurements of liquid scintillation and gas electroluminescence acquired simultaneously to date, and the first such measurements of singlet and triplet emission in the liquid phase. They are important for precisely characterising dual-phase xenon detectors used to search for dark matter particle interactions and other rare events.",
  "authors": [
    "K. C. Oliver-Mallory",
    "A. M. Baker",
    "E. Jacquet",
    "T. J. Sumner",
    "H. M. Araujo"
  ],
  "published": "2025-12-24T04:30:41Z",
  "updated": "2025-12-24T04:30:41Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}