{
  "arxiv_id": "2512.19290v1",
  "url": "https://arxiv.org/abs/2512.19290v1",
  "pdf_url": "https://arxiv.org/pdf/2512.19290v1.pdf",
  "title": "Optimal operating parameters for next-generation xenon gas time projection chambers",
  "abstract": "The next-generation of neutrinoless double beta decay ($0νββ$) searches are targeting half-life sensitivities towards 10$^{27}$--10$^{28}$ years. Gaseous xenon time projection chamber (GXeTPC) detectors are a technology that may be able to meet this challenge due to their excellent background rejection power, scalability, and energy resolution. This paper explores how the design choices of a next-generation GXeTPC time projection chamber can impact the overall performance of the experiment. We study the performance of systems using xenon enriched in the isotope $^{136}$Xe or natural xenon, focusing on scenarios that incorporate one tonne of source isotope. The detector size, copper shielding mass, energy resolution, pressure, and diffusion amount are surveyed to evaluate the overall performance dependencies on these parameters. A detector optimized for using enriched xenon is preferred, with a factor of 10 lower background rate, driven by the large intrinsic backgrounds introduced by the copper shielding used in the detector. The performance of three types of gas TPC technologies was also explored based on different gas additives used to reduce diffusion to different levels. For all TPC technologies, we find background rates of a fraction of a count per tonne year in the region of interest are achievable. These performances are contingent on suitable energy resolution and event position placement in the drift direction being achieved for the specific detector technology. When factoring in the considerations for the construction of the detector in addition to the selection performance, there is no clear optimum pressure, with advantages and disadvantages if a high or low pressure default configuration is chosen.",
  "authors": [
    "K. Mistry",
    "D. R. Nygren"
  ],
  "published": "2025-12-22T11:31:52Z",
  "updated": "2025-12-22T11:31:52Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}