{
  "arxiv_id": "2511.02724v1",
  "url": "https://arxiv.org/abs/2511.02724v1",
  "pdf_url": "https://arxiv.org/pdf/2511.02724v1.pdf",
  "title": "Adjustable Low-Cost Highly Sensitive Microwave Oscillator Sensor for   Liquid Level Detection",
  "abstract": "This paper explores the implementation of a low-cost high-precision microwave oscillator sensor with an adjustable input resistance to enhance its limit of detection (LoD). To achieve this, we introduce a \\textit{Z$_{2}$} branch in the input network, comprising a transmission line, a capacitor (\\textit{C$_{B}$}) and a resistor (\\textit{R$_{V}$}). The sensor is tested with eight different liquids with different dielectric constants, including water, IV fluid, milk, ethanol, acetone, petrol, olive oil, and Vaseline. By fine-tuning the \\textit{Z$_{2}$} branch, a clear relationship is found between $\\varepsilon_{r}$ of materials and R$_{V}$.Our experimental results demonstrate outstanding characteristics, including remarkable linearity (nonlinearity < 2.44\\%), high accuracy with an average sensitivity of 21 kHz/$\\mu$m, and an excellent limit of detection (LoD < 0.05 mm). The sensor also exhibits good stability across a range of liquid temperatures and shows robust and repeatable behavior. Considering the strong absorption of microwave energy in liquids with high dielectric constants, this oscillator sensor is a superior choice over capacitive sensors for such applications. We validate the performance of the oscillator sensor using water as a representative liquid. Additionally, we substantiate the sensor's improvement through both experimental results and theoretical analysis. Its advantages, including affordability, compatibility with CMOS and MEMS technologies, and ease of fabrication, make it an excellent choice for small-scale liquid detection applications.",
  "authors": [
    "Mojtaba Joodaki",
    "Mehrdad Jafarian"
  ],
  "published": "2025-11-04T16:50:12Z",
  "updated": "2025-11-04T16:50:12Z",
  "categories": [
    "physics.app-ph",
    "cs.SY",
    "eess.SY",
    "physics.ins-det"
  ],
  "primary_category": "physics.app-ph"
}