{
  "arxiv_id": "2511.03336v1",
  "url": "https://arxiv.org/abs/2511.03336v1",
  "pdf_url": "https://arxiv.org/pdf/2511.03336v1.pdf",
  "title": "First global gyrokinetic profile predictions of ITER burning plasma",
  "abstract": "In this work, we present the first global gyrokinetic simulations of the ITER baseline scenario operating at 15 MA using GENE-Tango electrostatic and electromagnetic simulations. The modeled radial region spans close to the magnetic axis up to rho_tor = 0.6. Our results show a pronounced density peaking, moderated by electromagnetic fluctuations. The predicted fusion gain for this scenario is Q = 12.2, aligning well with ITER's mission objectives. We further characterize the turbulence spectra and find that electromagnetic modes, such as microtearing modes, kinetic ballooning modes, and Alfvenic ion temperature gradient modes at low binormal wave numbers, play a critical role in the core transport of this ITER scenario, necessitating high numerical resolution for accurate modeling. Local flux-tube simulations qualitatively reproduce the key features observed in the global gyrokinetic simulations but exhibit a much higher sensitivity to profile gradients, reflecting increased stiffness, likely due to the linearization of the equilibrium profiles and safety factor. Our study also reveals that the imposed external toroidal rotation profiles have a negligible impact on turbulent transport, as their magnitudes are substantially lower than the dominant linear growth rates. Furthermore, we demonstrate that the safety factor profile is of paramount importance: scenarios featuring flat q profiles with near-zero magnetic shear lead to the destabilization of kinetic ballooning modes in the plasma core, significantly enhancing turbulent transport and potentially degrading confinement. Finally, although electron temperature gradient turbulence initially appears large, sometimes exceeding ion-scale transport levels, it is ultimately quenched over long timescales by secular evolution of zonal flows, which are weakly damped under the very low collisionality conditions expected in ITER.",
  "authors": [
    "A. Di Siena",
    "C. Bourdelle",
    "A. Bañón Navarro",
    "G. Merlo",
    "T. Görler",
    "E. Fransson",
    "A. Polevoi",
    "S. H. Kim",
    "F. Koechl",
    "A. Loarte",
    "E. Fable",
    "C. Angioni",
    "P. Mantica",
    "F. Jenko"
  ],
  "published": "2025-11-05T10:12:55Z",
  "updated": "2025-11-05T10:12:55Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}