{
  "arxiv_id": "2511.03069v1",
  "url": "https://arxiv.org/abs/2511.03069v1",
  "pdf_url": "https://arxiv.org/pdf/2511.03069v1.pdf",
  "title": "Relativistic multistage resonant and trailing-field acceleration induced   by large-amplitude Alfvén waves in a strong magnetic field",
  "abstract": "We propose a particle acceleration mechanism driven by large-amplitude Alfv\\'en waves in a strong magnetic field. The acceleration process proceeds through multiple stages triggered by counterpropagating wave-particle resonant acceleration (CWRA) via decay instability. Initially, parent and daughter Alfv\\'en waves resonantly accelerate particles perpendicular to the ambient magnetic field. The resultant modulational instability generates electrostatic fields within the wave packet, which are locally amplified by the ponderomotive force of the Alfv\\'en wave packet. These fields subsequently drive further acceleration within a few relativistic gyroperiods via gyroresonant surfing acceleration (GRSA). During this, the v*B force facilitates momentum transfer from the perpendicular to the parallel direction. In the later stage, particles become trapped by the parent wave and gain additional energy through single wave resonant acceleration (SWRA). Furthermore, the accumulation of accelerated particles induces electrostatic trailing fields behind and at the tail of the wave packet, which drive trailing-field acceleration (TFA) of other electrons. The combined effects of these mechanisms, CWRA followed by GRSA and SWRA, result in highly relativistic electron energy. The electron energy accelerated through the above process is higher than that accelerated through TFA. This multistage acceleration process provides insights into the generation of high energy cosmic rays in astrophysical environments.",
  "authors": [
    "S. Isayama",
    "S. Matsukiyo",
    "T. Sano",
    "S. H. Chen"
  ],
  "published": "2025-11-04T23:34:50Z",
  "updated": "2025-11-04T23:34:50Z",
  "categories": [
    "physics.plasm-ph",
    "astro-ph.HE"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": "10.1103/nccj-mw1y"
}