{
  "arxiv_id": "2507.20523v4",
  "url": "https://arxiv.org/abs/2507.20523v4",
  "pdf_url": "https://arxiv.org/pdf/2507.20523v4.pdf",
  "title": "Multi-Machine Scaling Laws for Fuel and Impurity Puffing Rates Sufficient for Detachment Access: a Systematic Review of Magnetic Confinement Fusion Devices",
  "abstract": "An open-source database of 457 experimental and numerical entries representing 32 machines$-$including tokamaks, stellarators, and linear plasma devices$-$is assembled. From this dataset, we derive multi-machine scaling laws that predict the fuel and impurity puffing rates sufficient to edge plasma detachment$-$the leading reactor-relevant solution to the challenge of plasma-wall interaction. Validation against up to 40 L- and H-mode plasmas shows agreement within a factor of 1.5 in about 50\\% of cases, and within a factor of 2 on average. Divertor volume alone is found to strongly correlate with the fuelling rate. Inclusion of plasma opaqueness leads to $Γ_{\\text{D}} \\propto [n_{\\text{sep}}\\, a\\, (S_{\\text{div}}/V_{\\text{div}})^{-1.5}]^{1.05}$, valid across all toroidal devices. Its H-mode simplification, $Γ_{\\text{D}}^{\\text{HDL}} \\propto 0.43\\, a^{1.58}\\, λ_q^{-0.89}$, avoids explicit dependence on $n_{\\text{sep}}$ and carries intrinsic physical meaning through the H/L density limit and the power fall-off length. The impurity seeding rate is captured by a general non-linear law, from which the Greenwald-Eich-Scarabosio simplification, $Γ_{\\text{Z}}^{\\text{GES}} \\propto a^{1.51}\\, λ_q^{-0.27}$, is obtained. Similar relationships are defined for stellarators, consistent with tokamak trends but still awaiting validation$-$an opportunity for further study. These results have immediate relevance for reactor fuel-cycle design and edge plasma modelling. More broadly, they demonstrate that physics-based 0D laws can reliably link detachment access to engineering actuators, offering practical tools for reactor design. Our laws represent macroscopic patterns across machines rather than microscopic variations within an individual device$-$providing the basis for our forthcoming studies aimed at extending this framework to machine-specific behaviour.",
  "authors": [
    "M. Moscheni",
    "A. Herrmann",
    "R. Kembleton",
    "M. Kryjak",
    "S. Lazerson",
    "F. Levi",
    "M. Siccinio",
    "P. Staniec",
    "T. Giegerich",
    "C. Tantos",
    "the Gauss Fusion GmbH Team"
  ],
  "published": "2025-07-28T05:11:10Z",
  "updated": "2025-11-14T10:06:41Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}