{
  "arxiv_id": "2510.20628v3",
  "url": "https://arxiv.org/abs/2510.20628v3",
  "pdf_url": "https://arxiv.org/pdf/2510.20628v3.pdf",
  "title": "Magnetic Field-Line Curvature and Its Role in Particle Acceleration by Magnetically Dominated Turbulence",
  "abstract": "We employ first-principles, fully kinetic particle-in-cell simulations to investigate magnetic field-line curvature in magnetically dominated turbulent plasmas and its role in particle acceleration through curvature-drift motion along the motional electric field. By varying the fluctuation-to-mean magnetic-field ratio $δB_0/B_0$, we examine curvature $κ$ statistics and their connection to particle acceleration. The curvature probability densities display broad power-law wings, scaling linearly in $κ$ below the peak and developing hard high-$κ$ tails for $δB_0/B_0 \\gtrsim 1$. As the mean field strengthens, the high-$κ$ tails steepen, and large-curvature events are suppressed when $δB_0/B_0 \\ll 1$. The probability density functions of magnetic field-line contraction, ${\\bf v}_E \\cdot {\\bf κ}$, with ${\\bf v}_E$ the field-line velocity, develop power-law tails well described by a symmetric Pareto distribution, characteristic of stochastic energy exchanges, with the tails becoming harder as $δB_0/B_0$ increases. Our guiding-center analysis shows that curvature-drift acceleration accounts for a substantial fraction of the energization via the motional electric field, and that it strengthens with increasing $δB_0/B_0$. For well-magnetized particles, curvature-drift acceleration typically exceeds ${\\bf\\nabla}B$ drift, polarization drift, and betatron contributions. These results identify curvature-drift acceleration as a principal pathway through which magnetized turbulence transfers energy to nonthermal particles in astrophysical plasmas.",
  "authors": [
    "Samuel Sebastian",
    "Luca Comisso"
  ],
  "published": "2025-10-23T15:02:34Z",
  "updated": "2025-11-12T22:42:45Z",
  "categories": [
    "astro-ph.HE",
    "astro-ph.SR",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.HE",
  "doi": "10.3847/2041-8213/ae1696"
}