{
  "arxiv_id": "2511.10956v1",
  "url": "https://arxiv.org/abs/2511.10956v1",
  "pdf_url": "https://arxiv.org/pdf/2511.10956v1.pdf",
  "title": "Studies of laser stimulated photodetachment from nanoparticles for particle charge measurements",
  "abstract": "Determining nanoparticle charge is more challenging than that for microparticles due to growth-induced size changes, substantial plasma property variations, and difficulties in visualizing individual particles, rendering conventional microparticle charge diagnostics ineffective in dusty plasma. In this work, we utilized laser-stimulated photodetachment (LSPD) to deduce the mean charge of nanoparticles. Nanoparticles were grown in an Ara and C2H2 mixture using a capacitively coupled RF discharge and the LSPD induced changes in the electron current monitored by a cylindrical Langmuir probe. LSPD signals were obtained and analyzed across different dust growth phases. The prolonged decay of electron current pulses was attributed to the presence of residual negative ions, caused by the effective electrostatic trapping of these ions and the potential post - LSPD re-formation of new ones. The charge per particle was estimated using known values of particle density obtained by laser-light extinction method. For particles with mean diameter Dp ~ 154.3 nm, the charge found to be of Qd~16 elementary charge units. The charge values appear to be lower than the values predicted by orbital motion limited (OML) theory. This deviation is commonly observed in nanodusty plasmas due to significant electron depletion. LSPD results in Ar and C2H2 nano-dusty plasma confirm the applicability of these method for estimating individual nanoparticle charges. However, it has also been demonstrated that electron detachment from residual background negative ions can influence the detachment current decay and must be carefully considered",
  "authors": [
    "Y. A. Ussenov",
    "M. N. Shneider",
    "S. Yatom",
    "Y. Raitses"
  ],
  "published": "2025-11-14T04:42:13Z",
  "updated": "2025-11-14T04:42:13Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}