[
  {
    "arxiv_id": "2511.12328v1",
    "url": "https://arxiv.org/abs/2511.12328v1",
    "pdf_url": "https://arxiv.org/pdf/2511.12328v1.pdf",
    "title": "Laboratory Measurement of the X-ARAPUCA's Absolute Photon Detection Efficiency for the Deep Underground Neutrino Experiment's Vertical Drift Far Detector",
    "abstract": "The Deep Underground Neutrino Experiment (DUNE) will probe fundamental questions in particle physics and cosmology. Its Far Detectors implement a Photon Detection System composed of light-sensitive devices called X-ARAPUCA (XA). These trap incoming VUV photons by total internal reflection in a Wavelength Shifter Light Guide to be collected onto wrapping Silicon Photomultiplier arrays, sensitive to visible light. In the baseline design, Dichroic Filters (DFs) are implemented to improve the collection efficiency of escaping photons. The configuration proposed for DUNE's Vertical Drift module has been characterised in Liquid Argon for the first time using dedicated cryogenic setups developed at CIEMAT and INFN Naples. Additionally, several alternative configurations, based on the design optimisation studies of an R&D campaign, have been evaluated. The results show an efficiency of up to 4.5 $\\pm$ 0.4% at 4.5 V overvoltage, representing a high improvement with respect to previous XA implementations. Most noticeably, configurations without DFs show an improvement of up to 18%, which has been attributed to transmittance deficits.",
    "authors": [
      "G. Botogoske",
      "F. Bruni",
      "E. Calvo",
      "R. Calabrese",
      "N. Canci",
      "A. Canto",
      "C. M. Cattadori",
      "A. Cervera Villanueva",
      "S. Coleman",
      "J. I. Crespo-Anadón",
      "C. Cuesta",
      "F. Di Capua",
      "N. Durand",
      "G. Fiorillo",
      "F. Galizzi",
      "I. Gil-Botella",
      "C. Gotti",
      "G. Grauso",
      "J. Jablonski",
      "A. A. Machado",
      "S. Manthey Corchado",
      "J. Martín-Albo",
      "G. Matteucci",
      "L. Meazza",
      "A. P. Mendoça",
      "A. Minotti",
      "D. Navas-Nicolás",
      "L. Pagliuso",
      "C. Palomares",
      "L. Pérez-Molina",
      "V. Pimentel",
      "I. López de Rego",
      "Z. Rautio",
      "J. Romeo-Araujo",
      "D. Rudik",
      "E. Segreto",
      "Y. Suvorov",
      "M. Sturdivant",
      "F. Terranova",
      "J. Ureña",
      "A. Verdugo de Osa",
      "D. Warner",
      "R. Wilson",
      "K. Zhu"
    ],
    "published": "2025-11-15T19:10:24Z",
    "updated": "2025-11-15T19:10:24Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.12314v1",
    "url": "https://arxiv.org/abs/2511.12314v1",
    "pdf_url": "https://arxiv.org/pdf/2511.12314v1.pdf",
    "title": "High frame rate RIXS spectroscopy using a JUNGFRAU detector with an iLGAD sensor",
    "abstract": "Resonant inelastic X-ray scattering (RIXS) is a powerful photon-in, photon-out spectroscopy technique for probing electronic, magnetic, and lattice excitations in matter. Time-resolved RIXS extends this capability through a stroboscopic optical pump-probe scheme to characterize the time evolution of the photoexcitation and subsequent relaxation dynamics of a sample. This technique is, however, extremely photon-hungry, requiring high-repetition-rate and intense X-ray facilities. The Heisenberg RIXS (hRIXS) spectrometer at the Spectroscopy and Coherent Scattering (SCS) instrument of the European X-ray Free-Electron Laser (EuXFEL) is designed to exploit high-repetition-rates, while maintaining optimal time and energy resolution. In this work, we demonstrate the successful deployment of a JUNGFRAU detector equipped with an inverse Low Gain Avalanche Diode (iLGAD) sensor for time-resolved RIXS studies in the soft X-ray range, using the hRIXS spectrometer. A spatial resolution of $19.71 \\pm 0.7~μ\\mathrm{m}$ and a resolving power exceeding 10,000 were achieved at an unprecedented frame rate of 47 kHz. Intra-train resolved data measured with a high FEL peak fluence of $1.8~\\mathrm{mJ/cm^{2}}$ for a 928.5 eV ph photon energy and 1.1 MHz repetition rate from cupric oxide (CuO) revealed a decrease in the emitted signal by ~10% over a time interval of $340~μ\\mathrm{s}$, indicating FEL-induced effects that require monitoring when conducting high-repetition-rate experiments. These results establish the JUNGFRAU-iLGAD as a promising detector to harvest the full potential of the hRIXS spectrometer, and validate its suitability for soft X-ray applications.",
    "authors": [
      "Nuno Duarte",
      "Loïc Le Guyader",
      "Viktoria Hinger",
      "Marco Ramilli",
      "Justine Schlappa",
      "Robert Carley",
      "Maria Carulla",
      "Yi-Ping Chang",
      "Devesh Chopra",
      "Natalia Gerasimova",
      "Michael Grimes",
      "Aldo Mozzanica",
      "Sergii Parchenko",
      "Le Phuong Hoang",
      "Urs Staub",
      "Jiaguo Zhang",
      "Anna Bergamaschi",
      "Andreas Scherz",
      "Bernd Schmitt",
      "Monica Turcato"
    ],
    "published": "2025-11-15T18:01:56Z",
    "updated": "2025-11-15T18:01:56Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.11401v1",
    "url": "https://arxiv.org/abs/2511.11401v1",
    "pdf_url": "https://arxiv.org/pdf/2511.11401v1.pdf",
    "title": "GRANITE: High-Resolution Imaging and Electrical Qualification of Large-Area TPC Electrodes",
    "abstract": "Next-generation dual-phase time projection chambers (TPCs) for rare event searches will require large-scale, high-precision electrodes. To meet the stringent requirements for high-voltage performance of such an experiment, we have developed a scanning setup for comprehensive electrode quality assurance. The system is built around the GRANITE (Granular Robotic Assay for Novel Integrated TPC Electrodes) facility: a gantry robot on top of a $2.5\\,\\text{m}\\times1.8\\,\\text{m}$ granite table, equipped with a suite of non-contact metrology devices.   We developed a coaxial wire scanning head to measure and correlate localized high-voltage discharge currents in air with high-resolution surface images. We find that the identified discharge 'hotspots' are transient and show no significant correlation with static visual features. Next, we established a quantitative relationship between artificially induced abrasive surface damage on the wires and a reduction in the discharge inception voltage. This work provides a novel non-invasive tool for qualifying wires dedicated for use in electrodes for future low-background experiments.",
    "authors": [
      "Shumit A. Mitra",
      "Alexander Deisting",
      "Jan Lommler",
      "Uwe Oberlack",
      "Fabian Piermaier",
      "Quirin Weitzel",
      "Daniel Wenz"
    ],
    "published": "2025-11-14T15:28:26Z",
    "updated": "2025-11-14T15:28:26Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.11400v1",
    "url": "https://arxiv.org/abs/2511.11400v1",
    "pdf_url": "https://arxiv.org/pdf/2511.11400v1.pdf",
    "title": "GRANITE: Mechanical Characterization and Optical Inspection of Large-Area TPC Electrodes",
    "abstract": "Next-generation dual-phase time projection chambers (TPCs) for rare event searches will require large-scale, high-precision electrodes. To meet the stringent requirements for mechanical stability and high-voltage performance of such an experiment, we have developed a scanning setup for electrode quality assurance called GRANITE: Granular Robotic Assay for Novel Integrated TPC Electrodes. GRANITE is built around a gantry robot on top of a $2.5\\,\\text{m}\\times1.8\\,\\text{m}$ granite table, equipped with a suite of non-contact metrology devices.   We demonstrate the setup's capabilities in two key areas: first, using laser scanners, we characterize wire tension, and in an independent measurement wire deflection due to gravity and electrostatic forces is determined. The setup achieves a precision of $20\\,μ\\text{m}$ for the relative measurement of only electrostatic displacement. Furthermore, GRANITE can measure gravitational sag down to $200\\,μ\\text{m}$ in an absolute measurement; this precision improves to $50\\,μ\\text{m}$ when applying model-based corrections for systematic effects. The performance achieved exceeds the needs for the characterisation of the electrode sagging in future experiments, which typically aims to ensure a maximal sag on the order of $500\\,μ\\text{m}$.   Second, we use GRANITE's high resolution camera to image all wires of XENON1T's cathode grid. Subsets of these images are then hand sorted and used to train an autoencoder, to reliably classify wire images as either pristine wires or images containing severe anomalous features. These anomalies appear e.g. as staining and may be potential defects. The interpretation of the classification results is complicated by the fact that most wire segments are not spotless, but show a varying amount of anomalous features. Follow-up studies are needed to identify the exact nature of such features on wires.",
    "authors": [
      "Alexander Deisting",
      "Jan Lommler",
      "Shumit A. Mitra",
      "Uwe Oberlack",
      "Fabian Piermaier",
      "Quirin Weitzel",
      "Daniel Wenz"
    ],
    "published": "2025-11-14T15:28:24Z",
    "updated": "2025-11-14T15:28:24Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.11395v1",
    "url": "https://arxiv.org/abs/2511.11395v1",
    "pdf_url": "https://arxiv.org/pdf/2511.11395v1.pdf",
    "title": "Investigation of Stimulated Brillouin Scattering Driven by Broadband Lasers in High-Z Plasmas",
    "abstract": "The evolution of stimulated Brillouin scattering (SBS) driven by broadband lasers in high-Z plasmas is investigated using one-dimensional collisional particle-in-cell simulations. The temporal incoherence of broadband lasers modulates the pump intensity, generating stochastic intensity pulses that intermittently drive SBS. The shortened coherence time weakens the three-wave coupling and continuously reduces the temporal growth rate, while the saturated reflectivity remains nearly unchanged until the bandwidth exceeds a critical threshold. Simulations with varying laser intensities and bandwidths reveal a consistent scaling behavior, indicating that effective suppression occurs only when the laser bandwidth exceeds the temporal growth rate of SBS by several tens of times. Comparative simulations in Au and AuB plasmas exhibit similar suppression trends, with AuB showing reduced SBS growth rate and reflectivity, and the onset of suppression occurring at a lower bandwidth. These findings elucidate the coupled dependence of SBS mitigation on bandwidth and laser intensity in high-Z plasmas, offering useful guidance for optimizing broadband laser designs in inertial confinement fusion.",
    "authors": [
      "Xiaoran Li",
      "Jie Qiu",
      "Liang Hao",
      "Shiyang Zou"
    ],
    "published": "2025-11-14T15:24:15Z",
    "updated": "2025-11-14T15:24:15Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.11345v1",
    "url": "https://arxiv.org/abs/2511.11345v1",
    "pdf_url": "https://arxiv.org/pdf/2511.11345v1.pdf",
    "title": "Millimeter-Wave Transmission-Line Reflectionless Filters",
    "abstract": "We report on the development of transmission-line reflectionless filters operating with passbands at 100 GHz and 230 GHz, and stopband absorption up to 500 GHz, the highest operating frequencies yet recorded for such filters. The designs are based on a previously reported mathematical solution to the reflectionless condition, now successfully implemented for the first time, using an advanced thin-film fabrication process on Alumina substrates. Sub-millimeter wave wafer probe measurements show good agreement with theory.",
    "authors": [
      "Matthew A. Morgan",
      "Matt Bauwens",
      "Seng Loo",
      "Miho Hunter",
      "Tod A. Boyd",
      "Robert M. Weikle"
    ],
    "published": "2025-11-14T14:32:49Z",
    "updated": "2025-11-14T14:32:49Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.11322v1",
    "url": "https://arxiv.org/abs/2511.11322v1",
    "pdf_url": "https://arxiv.org/pdf/2511.11322v1.pdf",
    "title": "Extending the Numerical Flow Iteration to the multi-species Vlasov-Maxwell system through Hamiltonian Splitting",
    "abstract": "The Numerical Flow Iteration (NuFI) method has recently been proposed as a memory-slim solution method for the Vlasov--Poisson system. It stores the temporal evolution of the electric field, instead of the distribution functions, and reconstructs the solution in each time step by following the characteristics backwards in time and reconstructing the solution from the initial distribution. NuFI has been shown to be more accurate than other state-of-the-art Vlasov solvers given the same amount of degrees of freedom as well as interpolation order, essentially making NuFI a high-fidelity but low-memory cost scheme. In this paper, we build on the Hamiltonian structure of the full Vlasov--Maxwell system to extend NuFI to handle electro-magnetic kinetic plasma dynamics. We show that the advanced structure-preserving properties of NuFI are preserved when extending to the electro-magnetic case.",
    "authors": [
      "Rostislav-Paul Wilhelm",
      "Fabio Bacchini",
      "Sebastian Schöps",
      "Manuel Torrilhon",
      "Melina Merkel",
      "Matthias Kirchhart"
    ],
    "published": "2025-11-14T13:59:12Z",
    "updated": "2025-11-14T13:59:12Z",
    "categories": [
      "physics.plasm-ph",
      "math.NA"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.09442v3",
    "url": "https://arxiv.org/abs/2511.09442v3",
    "pdf_url": "https://arxiv.org/pdf/2511.09442v3.pdf",
    "title": "An ultrafast plenoptic-camera system for high-resolution 3D particle tracking in unsegmented scintillators",
    "abstract": "Detectors deployed in high-resolution neutrino experiments, particle calorimetry, or dark matter candidate searches require dense and massive active materials and, in some cases, extremely fine segmentation. This is essential for achieving precise three-dimensional tracking of the interaction products and enabling accurate particle-flow reconstruction. Organic scintillator detectors, for example, in the form of scintillating fibres, offer sub-millimetre spatial and sub-nanosecond temporal resolution. However, such systems introduce significant challenges in construction and demand a large number of readout electronics channels, leading to extremely high costs that are difficult to mitigate. In this article, we propose a paradigm shift in the detection of elementary particles that leads to ultrafast three-dimensional high-resolution imaging in large volumes of unsegmented scintillator. The key enabling technologies are plenoptic systems and time-resolving single-photon avalanche diode (SPAD) array imaging sensors. Together, they allow us, for the first time ever with a plenoptic camera, the reconstruction of the origin of single photons in the scintillator, thereby facilitating an event-by-event analysis. A case study focused on neutrino detection demonstrates the unique potential of this approach, achieving full event reconstruction with a spatial resolution on the order of two hundred micrometres. This work paves the way for a new class of particle scintillator-based detectors, whose capabilities should be further enhanced through future developments and expanded to Cherenkov light detection and calorimetry at collider neutrino experiments, searches for neutrinoless double beta decay, as well as applications such as medical imaging and fast neutron detection.",
    "authors": [
      "Till Dieminger",
      "Saúl Alonso-Monsalve",
      "Christoph Alt",
      "Claudio Bruschini",
      "Noemi Bührer",
      "Edoardo Charbon",
      "Kodai Kaneyasu",
      "Matthew Franks",
      "Tim Weber",
      "Davide Sgalaberna"
    ],
    "published": "2025-11-12T15:56:55Z",
    "updated": "2025-11-14T13:23:08Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.11184v1",
    "url": "https://arxiv.org/abs/2511.11184v1",
    "pdf_url": "https://arxiv.org/pdf/2511.11184v1.pdf",
    "title": "Electrical thermography via centimetre-scale fiber-based distributed temperature sensing",
    "abstract": "We present a Raman-based Distributed Temperature Sensor (RDTS) with centimetre-scale resolution for thermographic analysis of electronic circuits. Temperature is measured along a single-mode fiber routed across a custom printed circuit board (PCB) with 1 cm$^2$ heating elements, using optical time-domain reflectometry of Raman signals detected by superconducting nanowire single-photon detectors (SNSPDs). This approach enables two-dimensional thermal mapping of the PCB under heating configurations with multiple hotspots. A spatial resolution of 3 cm and a temperature accuracy of 2 °C are achieved with an integration time of 5 minutes. Thermography can be performed down to 77 K, revealing that the PCB thermal resistance decreases by nearly an order of magnitude compared to room temperature, due to enhanced convective cooling in liquid nitrogen. These results establish centimetre-scale RDTS as a robust technique for real-time, spatially resolved thermography of electronic circuits, particularly in regimes where infrared imaging is ineffective, such as at low temperatures or within volumetric electronic architectures.",
    "authors": [
      "Victor Cochet",
      "Axel Faccio",
      "Georgios Stoikos",
      "Towsif Taher",
      "Rob Thew",
      "Jérôme Extermann",
      "Enrico Pomarico"
    ],
    "published": "2025-11-14T11:29:36Z",
    "updated": "2025-11-14T11:29:36Z",
    "categories": [
      "quant-ph",
      "physics.app-ph",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2511.11145v1",
    "url": "https://arxiv.org/abs/2511.11145v1",
    "pdf_url": "https://arxiv.org/pdf/2511.11145v1.pdf",
    "title": "Optimization of Argon Plasma Working Pressure through Parallel PIC Simulations for Enhancement of Material Surface Treatment",
    "abstract": "In this study, a novel method for simulating plasma dynamics using parallel programming has been developed. The equations based on Particle-in-Cell (PIC) method were utilized and adapted for this purpose. We utilized 35 processors from Sharif High Performance Computing (HPC) center and divided the plasma volume into 35 parts, with each part's PIC equation solved on a separate processor. Once the computations were completed, the results from all processors were combined to form a complete plasma volume. The simulations revealed that there is an optimal pressure for argon, at which the ion flux onto the electrode surface is maximized. Increasing the absolute value of the electrode potential also increases this flux. Therefore, for a given potential, selecting the optimal pressure is crucial for the most effective surface modification using argon plasma. In this work, for applied voltage of -500 V, the optimum pressure was 100 mTorr.",
    "authors": [
      "Hadi Barati",
      "Ali Torkaman",
      "Mehdi Fardmanesh"
    ],
    "published": "2025-11-14T10:22:25Z",
    "updated": "2025-11-14T10:22:25Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.20523v4",
    "url": "https://arxiv.org/abs/2507.20523v4",
    "pdf_url": "https://arxiv.org/pdf/2507.20523v4.pdf",
    "title": "Multi-Machine Scaling Laws for Fuel and Impurity Puffing Rates Sufficient for Detachment Access: a Systematic Review of Magnetic Confinement Fusion Devices",
    "abstract": "An open-source database of 457 experimental and numerical entries representing 32 machines$-$including tokamaks, stellarators, and linear plasma devices$-$is assembled. From this dataset, we derive multi-machine scaling laws that predict the fuel and impurity puffing rates sufficient to edge plasma detachment$-$the leading reactor-relevant solution to the challenge of plasma-wall interaction. Validation against up to 40 L- and H-mode plasmas shows agreement within a factor of 1.5 in about 50\\% of cases, and within a factor of 2 on average. Divertor volume alone is found to strongly correlate with the fuelling rate. Inclusion of plasma opaqueness leads to $Γ_{\\text{D}} \\propto [n_{\\text{sep}}\\, a\\, (S_{\\text{div}}/V_{\\text{div}})^{-1.5}]^{1.05}$, valid across all toroidal devices. Its H-mode simplification, $Γ_{\\text{D}}^{\\text{HDL}} \\propto 0.43\\, a^{1.58}\\, λ_q^{-0.89}$, avoids explicit dependence on $n_{\\text{sep}}$ and carries intrinsic physical meaning through the H/L density limit and the power fall-off length. The impurity seeding rate is captured by a general non-linear law, from which the Greenwald-Eich-Scarabosio simplification, $Γ_{\\text{Z}}^{\\text{GES}} \\propto a^{1.51}\\, λ_q^{-0.27}$, is obtained. Similar relationships are defined for stellarators, consistent with tokamak trends but still awaiting validation$-$an opportunity for further study. These results have immediate relevance for reactor fuel-cycle design and edge plasma modelling. More broadly, they demonstrate that physics-based 0D laws can reliably link detachment access to engineering actuators, offering practical tools for reactor design. Our laws represent macroscopic patterns across machines rather than microscopic variations within an individual device$-$providing the basis for our forthcoming studies aimed at extending this framework to machine-specific behaviour.",
    "authors": [
      "M. Moscheni",
      "A. Herrmann",
      "R. Kembleton",
      "M. Kryjak",
      "S. Lazerson",
      "F. Levi",
      "M. Siccinio",
      "P. Staniec",
      "T. Giegerich",
      "C. Tantos",
      "the Gauss Fusion GmbH Team"
    ],
    "published": "2025-07-28T05:11:10Z",
    "updated": "2025-11-14T10:06:41Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.11061v1",
    "url": "https://arxiv.org/abs/2511.11061v1",
    "pdf_url": "https://arxiv.org/pdf/2511.11061v1.pdf",
    "title": "Van-der-Waals exchange-correlation functionals and their high pressure and warm dense matter applications",
    "abstract": "We investigate basic hydrogen quantities like the molecular bond length, the molecular dissociation energy and the van-der-Waals interaction in idealized situations in an effort to discern a suitable exchange-correlation functional for the molecular to metal transition in warm dense hydrogen. The best reproduction of bond length and dissociation energy is given by the r2SCAN functional, several vdW functionals and also HSE06 fair qualitatively and quantitatively no better than PBE or worse. In addition we investigate quantities like the static and dynamic ion structure factor, and the electronic DOS to determine differences between exchange-correlation functionals with and without van-der-Waals corrections in the transition region from the molecular to the metallic regime of hydrogen.",
    "authors": [
      "Jan Vorberger",
      "Gabriel J. Smith",
      "William Z. Van Benschoten",
      "Hayley R. Petras",
      "Zhandos Moldabekov",
      "Tobias Dornheim",
      "James J. Shepherd"
    ],
    "published": "2025-11-14T08:22:34Z",
    "updated": "2025-11-14T08:22:34Z",
    "categories": [
      "physics.chem-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.chem-ph"
  },
  {
    "arxiv_id": "2511.11050v1",
    "url": "https://arxiv.org/abs/2511.11050v1",
    "pdf_url": "https://arxiv.org/pdf/2511.11050v1.pdf",
    "title": "Measurement of cosmic-ray muon flux at CJPL-II",
    "abstract": "In China Jinping Underground Laboratory (CJPL), the deepest and largest underground laboratory globally, the cosmic-ray muon flux is significantly reduced due to the substantial shielding provided by the overlying mountain. From 2016 to 2020, we measured the muon flux in the second phase of CJPL (CJPL-II) with a plastic scintillator muon telescope system, detecting 161 muon events over an effective live time of 1098 days. The detection efficiency was obtained by simulating the underground muon energy and angular distributions and the telescope system's response to underground muons. The cosmic-ray muon flux is determined to be (3.03 $\\pm$ 0.24 (stat) $\\pm$ 0.18 (sys)) $\\times$ 10$^{-10}$ cm$^{-2}$s$^{-1}$, which is the lowest among underground laboratories worldwide.",
    "authors": [
      "P. Zhang",
      "H. Ma",
      "W. Dai",
      "M. Jing",
      "L. Yang",
      "Q. Yue",
      "Z. Zeng",
      "J. Cheng"
    ],
    "published": "2025-11-14T08:03:53Z",
    "updated": "2025-11-14T08:03:53Z",
    "categories": [
      "astro-ph.HE",
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.HE",
    "doi": "10.1016/j.astropartphys.2025.103147"
  },
  {
    "arxiv_id": "2511.11044v1",
    "url": "https://arxiv.org/abs/2511.11044v1",
    "pdf_url": "https://arxiv.org/pdf/2511.11044v1.pdf",
    "title": "In-situ environmental radiation background measurement in the second phase of CJPL",
    "abstract": "China Jinping Underground Laboratory (CJPL), the deepest and largest underground laboratory worldwide, provides a low radiation background environment, which is necessary to frontier scientific research, such as the experimental studies of rare-event physics. Due to the almost filled space of CJPL-I and the requirement of future physics experiments, the construction of the second phase of CJPL (CJPL-II) was started in 2020 and all finished in 2024. In this work, we report the measured results of major environmental radiation in CJPL-II, including cosmic-ray muons, radon, gamma rays, and neutrons. Results indicate that the rock overburden and the radioactive background control effectively minimize the environmental radiation background. The scientific data presented also serve as an important basis to detector background modeling for the physics experiments in CJPL-II.",
    "authors": [
      "P. Zhang",
      "Z. Zeng",
      "J. Cheng",
      "H. Ma"
    ],
    "published": "2025-11-14T07:58:35Z",
    "updated": "2025-11-14T07:58:35Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "physics.data-an"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.22503v2",
    "url": "https://arxiv.org/abs/2509.22503v2",
    "pdf_url": "https://arxiv.org/pdf/2509.22503v2.pdf",
    "title": "A Quantum Algorithm for Nonlinear Electromagnetic Fluid Dynamics via Koopman-von Neumann Linearization",
    "abstract": "To simulate plasma phenomena, large-scale computational resources have been employed in developing high-precision and high-resolution plasma simulations. One of the main obstacles in plasma simulations is the requirement of computational resources that scale polynomially with the number of spatial grids, which poses a significant challenge for large-scale modeling. To address this issue, this study presents a quantum algorithm for simulating the nonlinear electromagnetic fluid dynamics that govern space plasmas. We map it, by applying Koopman-von Neumann linearization, to the Schrödinger equation and evolve the system using Hamiltonian simulation via quantum singular value transformation. Our algorithm scales $O \\left(s N_x \\, \\mathrm{polylog} \\left( N_x \\right) T \\right)$ in time complexity with $s$, $N_x$, and $T$ being the spatial dimension, the number of spatial grid points per dimension, and the evolution time, respectively. Comparing the scaling $O \\left( s N_x^s \\left(T^{5/4}+T N_x\\right) \\right)$ for the classical method with the finite volume scheme, this algorithm achieves polynomial speedup in $N_x$. The space complexity of this algorithm is exponentially reduced from $O\\left( s N_x^s \\right)$ to $O\\left( s \\, \\mathrm{polylog} \\left( N_x \\right) \\right)$. Numerical experiments validate that accurate solutions are attainable with smaller $m$ than theoretically anticipated and with practical values of $m$ and $R$, underscoring the feasibility of the approach. As a practical demonstration, the method accurately reproduces the Kelvin-Helmholtz instability, underscoring its capability to tackle more intricate nonlinear dynamics. These results suggest that quantum computing can offer a viable pathway to overcome the computational barriers of multiscale plasma modeling.",
    "authors": [
      "Hayato Higuchi",
      "Yuki Ito",
      "Kazuki Sakamoto",
      "Keisuke Fujii",
      "Akimasa Yoshikawa"
    ],
    "published": "2025-09-26T15:44:51Z",
    "updated": "2025-11-14T07:15:52Z",
    "categories": [
      "quant-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2511.10956v1",
    "url": "https://arxiv.org/abs/2511.10956v1",
    "pdf_url": "https://arxiv.org/pdf/2511.10956v1.pdf",
    "title": "Studies of laser stimulated photodetachment from nanoparticles for particle charge measurements",
    "abstract": "Determining nanoparticle charge is more challenging than that for microparticles due to growth-induced size changes, substantial plasma property variations, and difficulties in visualizing individual particles, rendering conventional microparticle charge diagnostics ineffective in dusty plasma. In this work, we utilized laser-stimulated photodetachment (LSPD) to deduce the mean charge of nanoparticles. Nanoparticles were grown in an Ara and C2H2 mixture using a capacitively coupled RF discharge and the LSPD induced changes in the electron current monitored by a cylindrical Langmuir probe. LSPD signals were obtained and analyzed across different dust growth phases. The prolonged decay of electron current pulses was attributed to the presence of residual negative ions, caused by the effective electrostatic trapping of these ions and the potential post - LSPD re-formation of new ones. The charge per particle was estimated using known values of particle density obtained by laser-light extinction method. For particles with mean diameter Dp ~ 154.3 nm, the charge found to be of Qd~16 elementary charge units. The charge values appear to be lower than the values predicted by orbital motion limited (OML) theory. This deviation is commonly observed in nanodusty plasmas due to significant electron depletion. LSPD results in Ar and C2H2 nano-dusty plasma confirm the applicability of these method for estimating individual nanoparticle charges. However, it has also been demonstrated that electron detachment from residual background negative ions can influence the detachment current decay and must be carefully considered",
    "authors": [
      "Y. A. Ussenov",
      "M. N. Shneider",
      "S. Yatom",
      "Y. Raitses"
    ],
    "published": "2025-11-14T04:42:13Z",
    "updated": "2025-11-14T04:42:13Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2502.16141v2",
    "url": "https://arxiv.org/abs/2502.16141v2",
    "pdf_url": "https://arxiv.org/pdf/2502.16141v2.pdf",
    "title": "A Hybrid Neural Architecture: Online Attosecond X-ray Characterization",
    "abstract": "The emergence of high-repetition-rate x-ray free-electron lasers, such as SLAC's LCLS-II, serve as our canonical example for autonomous controls that necessitate high-throughput diagnostics paired with streaming computational pipelines capable of single-shot analysis with extremely low latency. We present the Deterministic Characterization with an Integrated Parallelizable Hybrid Resolver architecture, a hybrid machine learning framework designed for fast, accurate analysis of XFEL diagnostics using angular streaking-based sinogram images. This architecture integrates convolutional neural networks and bidirectional long short-term memory models to denoise input, identify x-ray sub-spike features, and extract sub-spike relative delays with sub-30 attosecond temporal resolution. Deployed on low-latency hardware, it achieves over 10~kHz throughput with \\SI{168.3}{\\micro\\second} inference latency, indicating scalability to 14~kHz with FPGA integration. By transforming regression tasks into classification problems and leveraging optimized error encoding, we achieve high precision with low-latency performance that is critical for real-time streaming event selection and experimental control feedback signals. This represents a key development in real-time control pipelines for next-generation autonomous science, generally, and high repetition-rate x-ray experiments in particular.",
    "authors": [
      "Jack Hirschman",
      "Benjamin Mencer",
      "Razib Obaid",
      "Amanda Shackelford",
      "Ryan Coffee"
    ],
    "published": "2025-02-22T08:30:11Z",
    "updated": "2025-11-14T04:13:41Z",
    "categories": [
      "physics.app-ph",
      "physics.acc-ph",
      "physics.data-an"
    ],
    "primary_category": "physics.app-ph"
  },
  {
    "arxiv_id": "2503.21198v2",
    "url": "https://arxiv.org/abs/2503.21198v2",
    "pdf_url": "https://arxiv.org/pdf/2503.21198v2.pdf",
    "title": "Deep Learning Assisted Modeling for $χ^{(2)}$ Nonlinear Optics",
    "abstract": "Modeling second-order ($χ^{(2)}$) nonlinear optical processes remains computationally expensive due to the need to resolve fast field oscillations and simulate wave propagation using methods like the split-step Fourier method (SSFM). This can become a bottleneck in real-time applications, such as high-repetition-rate laser systems requiring rapid feedback and control. We present an LSTM-based surrogate model trained on SSFM simulations generated from a start-to-end model of the photocathode drive laser at SLAC National Accelerator Laboratory's Linac Coherent Light Source II. The model achieves over 250x speedup while maintaining high fidelity, enabling future real-time optimization and laying the foundation for data-integrated modeling frameworks and digital twins of laser systems.",
    "authors": [
      "Jack Hirschman",
      "Erfan Abedi",
      "Minyang Wang",
      "Hao Zhang",
      "Abhimanyu Borthakur",
      "Justin Baker",
      "Andrea L. Bertozzi",
      "Randy Lemons",
      "Sergio Carbajo"
    ],
    "published": "2025-03-27T06:27:23Z",
    "updated": "2025-11-14T04:12:39Z",
    "categories": [
      "physics.optics",
      "physics.acc-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2511.10937v1",
    "url": "https://arxiv.org/abs/2511.10937v1",
    "pdf_url": "https://arxiv.org/pdf/2511.10937v1.pdf",
    "title": "Decomposition of Methane Diluted with Inert Gas in an RF Discharge Cell",
    "abstract": "Decomposition of methane using non-thermal plasmas is an attractive route for producing hydrogen-rich gases and valuable carbon nanomaterials. Understanding how plasma discharge modes influence methane decomposition in optimizing plasma-assisted chemical conversion remains unexplored. This study explores the coupling between the discharge structure and product selectivity in RF capacitively coupled discharges operating in methane/inert gas mixtures in the pressure range of 2 to 3 torr. The discharge exhibits mode transitions from uniform to striated in Ar and Kr and from diffuse to contracted in Ar and Kr with 5 percent or less CH4. The discharges in He and Ne remained uniform under our operating conditions, and their mixtures with CH4 remained diffuse. A 0-D model for Ar/CH4 discharge established a threshold for contraction while also asserting the importance of Ar metastable in the dissociation and ionization processes. The highest degree of methane decomposition, 99.7% with the main products of acetylene and graphitized solid carbon was achieved in the contracted discharge mode for both Kr or Ar with 5% or less CH4. We demonstrate that contraction can play a crucial role in the effective decomposition of methane with value-added products and that both the electronic and thermal properties of plasma gas are responsible for this effect.",
    "authors": [
      "Sophia Gershman",
      "Mikhail N. Shneider",
      "Yevgeny Raitses"
    ],
    "published": "2025-11-14T03:54:27Z",
    "updated": "2025-11-14T03:54:27Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.10906v1",
    "url": "https://arxiv.org/abs/2511.10906v1",
    "pdf_url": "https://arxiv.org/pdf/2511.10906v1.pdf",
    "title": "In situ Evidence of 5-minute Oscillations from Parker Solar Probe",
    "abstract": "The Sun's surface vibrates in characteristic 5-minute oscillations, known as p-modes, generated by sound waves trapped within the convection zone. Although these oscillations have long been hypothesized to reach into the solar wind, direct in situ evidence has remained elusive, even during previous close encounters by Parker Solar Probe (PSP). Here, we present the first promising in situ detection of 5-minute oscillations in the upper solar corona, based on observations from PSP's three closest perihelia. In two events at 9.9 solar radii, we identify statistically significant ($\\sim$ 6 $σ$) 3.1-3.2 mHz peaks in the magnetic field power spectrum, each appearing as a large-amplitude, spherically polarized Alfvénic wave train lasting approximately 35 minutes. These results demonstrate that global solar oscillations can reach and potentially influence the solar wind.",
    "authors": [
      "Zesen Huang",
      "Marco Velli",
      "Olga Panasenco",
      "Richard J. Morton",
      "Chen Shi",
      "Yeimy J. Rivera",
      "Benjamin Chandran",
      "Samuel T. Badman",
      "Yuliang Ding",
      "Nour Raouafi",
      "Stuart D. Bale",
      "Michael Stevens",
      "Tamar Ervin",
      "Chuanpeng Hou",
      "Kristopher G. Klein",
      "Orlando Romeo",
      "Jia Huang",
      "Mingzhe Liu",
      "Davin E. Larson",
      "Marc Pulupa",
      "Roberto Livi",
      "Federico Fraschetti"
    ],
    "published": "2025-11-14T02:34:06Z",
    "updated": "2025-11-14T02:34:06Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2511.10885v1",
    "url": "https://arxiv.org/abs/2511.10885v1",
    "pdf_url": "https://arxiv.org/pdf/2511.10885v1.pdf",
    "title": "Bremsstrahlung constraints on proton-Boron 11 inertial fusion",
    "abstract": "Proton-Boron 11 (pB11) fusion is relatively safe and clean, but difficult to use for net power production, since bremsstrahlung radiation tends to radiate away power more quickly than it can be generated by fusion power, particularly once poisoning by alpha particles is taken into account. While in magnetic confinement fusion (MCF), this problem can be addressed by deconfining the alphas, in inertial confinement fusion (ICF) the alphas that heat the plasma linger for the duration of the reaction. Thus, it becomes essential to trap the bremsstrahlung radiation in the hotspot. Through burn simulations incorporating bremsstrahlung emission and reabsorption, we infer the necessary conditions to capture enough radiation to produce scientific breakeven in a pB11 ICF plasma. We find that breakeven requires a stagnation areal density roughly two orders of magnitude higher than the current state-of-the-art, at pressures three orders of magnitude higher.",
    "authors": [
      "I. E. Ochs",
      "E. J. Kolmes",
      "A. S. Glasser",
      "N. J. Fisch"
    ],
    "published": "2025-11-14T01:36:43Z",
    "updated": "2025-11-14T01:36:43Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2412.20623v3",
    "url": "https://arxiv.org/abs/2412.20623v3",
    "pdf_url": "https://arxiv.org/pdf/2412.20623v3.pdf",
    "title": "Demonstration that Differential Length Changes of Optical Cavities are a Sensitive Probe for Ultralight Dark Matter",
    "abstract": "Measurements of differential length oscillations of Fabry-Perot cavities provide a sensitive and promising approach to searching for scalar ultralight dark matter (ULDM). The initial demonstration sets direct lower bounds that are one to two orders of magnitude lower for two model ULDM distributions -- a standard galactic halo and a relaxion star bound to Earth -- ranging over a decade of ULDM mass and Compton frequency. The demonstration suggests how a much higher sensitivity to a much larger ULDM mass range can be obtained.",
    "authors": [
      "Tejas Deshpande",
      "Andra Ionescu",
      "Nicholas Miller",
      "Zhiyuan Wang",
      "Gerald Gabrielse",
      "Andrew A. Geraci",
      "Tim Kovachy"
    ],
    "published": "2024-12-30T00:03:39Z",
    "updated": "2025-11-13T23:25:06Z",
    "categories": [
      "hep-ex",
      "astro-ph.CO",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2507.04561v2",
    "url": "https://arxiv.org/abs/2507.04561v2",
    "pdf_url": "https://arxiv.org/pdf/2507.04561v2.pdf",
    "title": "Coherent synchrotron radiation by excitation of surface plasmon polariton on near-critical solid microtube surface",
    "abstract": "Coherent synchrotron radiation (CSR) is crucial for the development of powerful ultrashort light sources. We present a mechanism for generating CSR in the form of generalised superradiance, based on surface plasmon polaritons (SPPs), which are resonantly excited on a solid, near-critical-density inner surface of a microtube. A high-intensity, circularly polarised laser pulse, propagating along the microtube axis, efficiently couples the cylindrical SPP modes. This process creates azimuthally structured, rotating electromagnetic fields. These rotating fields subsequently confine, modulate, and directly accelerate surface electrons to emit CSR in the Vavilov-Cherenkov angle. We further demonstrate that by improving the azimuthal symmetry of these electrons, the helical modulation enables CSR emission across all azimuthal directions in the form of isolated harmonics, significantly enhancing radiation intensity even when full coherence is imperfect. Our full 3D Particle-in-Cell simulations indicate this scheme can generate X-rays with coherence enhanced by up to two orders of magnitude compared to incoherent emission. The challenges to experimentally realise this scheme are discussed, including the need for high-contrast lasers to prevent pre-plasma formation and the demanding tolerances for microtube fabrication and alignment, while these challenges are not beyond the scope of existing or near-future experimental capabilities.",
    "authors": [
      "Bifeng Lei",
      "Hao Zhang",
      "Daniel Seipt",
      "Alexandre Bonatto",
      "Bin Qiao",
      "Javier Resta-Lopez",
      "Guoxing Xia",
      "Carsten Welsch"
    ],
    "published": "2025-07-06T22:26:28Z",
    "updated": "2025-11-13T22:23:16Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph",
      "physics.class-ph",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1103/cnym-16hc"
  },
  {
    "arxiv_id": "2511.10540v1",
    "url": "https://arxiv.org/abs/2511.10540v1",
    "pdf_url": "https://arxiv.org/pdf/2511.10540v1.pdf",
    "title": "Edge Machine Learning for Cluster Counting in Next-Generation Drift Chambers",
    "abstract": "Drift chambers have long been central to collider tracking, but future machines like a Higgs factory motivate higher granularity and cluster counting for particle ID, posing new data processing challenges. Machine learning (ML) at the \"edge\", or in cell-level readout, can dramatically reduce the off-detector data rate for high-granularity drift chambers by performing cluster counting at-source. We present machine learning algorithms for cluster counting in real-time readout of future drift chambers. These algorithms outperform traditional derivative-based techniques based on achievable pion-kaon separation. When synthesized to FPGA resources, they can achieve latencies consistent with real-time operation in a future Higgs factory scenario, thus advancing both R&D for future collider detectors as well as hardware-based ML for edge applications in high energy physics.",
    "authors": [
      "Deniz Yilmaz",
      "Liangyu Wu",
      "Julia Gonski"
    ],
    "published": "2025-11-13T17:39:22Z",
    "updated": "2025-11-13T17:39:22Z",
    "categories": [
      "physics.ins-det",
      "cs.LG"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.13831v2",
    "url": "https://arxiv.org/abs/2509.13831v2",
    "pdf_url": "https://arxiv.org/pdf/2509.13831v2.pdf",
    "title": "Signal Processing and Machine Learning Algorithms for Precise Timing with PICOSEC Micromegas Detectors",
    "abstract": "High particle rates in current and future experiments make pile-up phenomena a critical issue for extracting useful information. In this context, timing can be important as the 4$^{\\mathrm{th}}$ dimension parameter for triggering or event reconstruction. The PICOSEC-Micromegas detector has been shown to offer precise timing of the order of tens of\\,ps. In this work, novel signal processing algorithms are being developed and evaluated to demonstrate the technology's ability for online precise timing. We propose, an algorithm based on Artificial Neural Networks (ANN). This algorithm uses a model to train the ANN. The performance of the different algorithms is evaluated using experimental data, resulting in a timing resolution of 18.3 $\\pm$ 0.6\\,ps, comparable to the standard analysis based on the Constant Fraction Discrimination technique. Additionally, an alternative algorithm using the charge of the pulse exceeding a threshold as a parameter to correct for systematic effects is reported.",
    "authors": [
      "A. Kallitsopoulou",
      "I. Maniatis",
      "I. Manthos",
      "T. Papaevangelou",
      "L. Sohl",
      "A. Tsiamis",
      "S. E. Tzamarias"
    ],
    "published": "2025-09-17T08:56:21Z",
    "updated": "2025-11-13T17:18:01Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.10476v1",
    "url": "https://arxiv.org/abs/2511.10476v1",
    "pdf_url": "https://arxiv.org/pdf/2511.10476v1.pdf",
    "title": "Collisional and magnetic effects on the polarization of the solar oxygen infrared triplet",
    "abstract": "Context: The scattering polarization of the infrared (IR) triplet of neutral oxygen (O\\,\\textsc{i}) near 777\\,nm provides a powerful diagnostic of solar atmospheric conditions. However, interpreting such polarization requires a rigorous treatment of isotropic depolarizing collisions between O\\,\\textsc{i} atoms and neutral hydrogen.   Aims: We aim to investigate the combined effects of collisional and magnetic depolarization in shaping the alignment of O\\,\\textsc{i} levels (and thus the polarization of the O\\,\\textsc{i} IR triplet).   Methods: We compute, for the first time, a comprehensive set of collisional depolarization and polarization transfer rates for the relevant O\\,\\textsc{i} energy levels. These rates are incorporated into a multi-level atomic model, and the statistical equilibrium equations (SEE) are solved to quantify the impact of collisions and magnetic fields on atomic alignment.   Results: Our calculations indicate that elastic collisions with neutral hydrogen, together with the Hanle effect of turbulent magnetic fields stronger than about 20 G, efficiently suppress the bulk of the atomic alignment in deep photospheric conditions where hydrogen densities exceed $n_{\\mathrm{H}} \\sim 10^{16}$ cm$^{-3}$. In the chromosphere, however, the lower hydrogen density weakens collisional depolarization, allowing polarization to persist.   Conclusions: Our results are consistent with a chromospheric origin for the linear polarization signals of the O I IR triplet. Future studies should combine accurate non-LTE radiative transfer with reliable collisional rates in order to achieve fully consistent modeling.",
    "authors": [
      "Moncef Derouich",
      "Saleh Qutub"
    ],
    "published": "2025-11-13T16:41:39Z",
    "updated": "2025-11-13T16:41:39Z",
    "categories": [
      "astro-ph.SR",
      "physics.atom-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2511.10438v1",
    "url": "https://arxiv.org/abs/2511.10438v1",
    "pdf_url": "https://arxiv.org/pdf/2511.10438v1.pdf",
    "title": "Self-organisation through layering of $β$-plane like turbulence in plasmas and geophysical fluids",
    "abstract": "Staircase formation and layering is studied in simplified, potential vorticity conserving models of plasmas and geophysical fluids, by investigating turbulent self-organisation and nonlinear saturation with different mechanisms of free energy production -- forcing or linear instability -- and with standard or modified zonal flow responses. To this end, staircase formation in both the standard and modified Charney-Hasegawa-Mima equations with stochastic forcing, along with two different simple instability driven models -- one from a plasma and from a geophysical context -- are studied and compared. In these studies, it is observed that $β$-plane turbulence that does not distinguish between zonal and non-zonal perturbations (i.e., standard zonal response) gradually forms large-scale, elliptic zonal structures that merge progressively, regardless of whether it is driven by forcing (though it should be slow enough to allow wave couplings) or by the baroclinic instability, using for example a two-layer model. Conversely, the plasma system, with its modified zonal response, can rapidly form straight, stationary jets of well-defined size, again regardless of the way it is driven: by stochastic forcing or by the dissipative drift instability. Furthermore, the instability-driven plasma system exhibits a phase transition between a zonal flow dominated state and an eddy dominated state. In both states, saturation is possible without large-scale friction.",
    "authors": [
      "P. L. Guillon",
      "G. Dif-Pradalier",
      "Y. Sarazin",
      "D. W. Hughes",
      "Ö. D. Gürcan"
    ],
    "published": "2025-11-13T16:00:45Z",
    "updated": "2025-11-13T16:00:45Z",
    "categories": [
      "physics.plasm-ph",
      "physics.flu-dyn"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.10377v1",
    "url": "https://arxiv.org/abs/2511.10377v1",
    "pdf_url": "https://arxiv.org/pdf/2511.10377v1.pdf",
    "title": "Development of the CEPC analog hadron calorimeter prototype",
    "abstract": "The Circular Electron Positron Collider (CEPC) is a next-generation electron$-$positron collider proposed for the precise measurement of the properties of the Higgs boson. To emphasize boson separation and jet reconstruction, the baseline design of the CEPC detector was guided by the particle flow algorithm (PFA) concept. As one of the calorimeter options, the analogue hadron calorimeter (AHCAL) was proposed. The CEPC AHCAL comprises a 40-layer sandwich structure using steel plates as absorbers and scintillator tiles coupled with silicon photomultipliers (SiPM) as sensitive units. To validate the feasibility of the AHCAL option, a series of studies were conducted to develop a prototype. This AHCAL prototype underwent an electronic test and a cosmic ray test to assess its performance and ensure it was ready for three beam tests performed in 2022 and 2023. The test beam data is currently under analysis, and the results are expected to deepen our understanding of hadron showers, validate the concept of Particle Flow Algorithm (PFA), and ultimately refine the design of the CEPC detector.",
    "authors": [
      "Yukun Shi",
      "Anshun Zhou",
      "Hao Liu",
      "Jiechen Jiang",
      "Yanyun Duan",
      "Yunlong Zhang",
      "Zhongtao Shen",
      "Jianbei Liu",
      "Boxiang Yu",
      "Shu Li",
      "Haijun Yang",
      "Yong Liu",
      "Liang Li",
      "Zhen Wang",
      "Siyuan Song",
      "Dejing Du",
      "Jiaxuan Wang",
      "Junsong Zhang",
      "Quan Ji"
    ],
    "published": "2025-11-13T14:51:34Z",
    "updated": "2025-11-13T14:51:34Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.10228v2",
    "url": "https://arxiv.org/abs/2510.10228v2",
    "pdf_url": "https://arxiv.org/pdf/2510.10228v2.pdf",
    "title": "Performance of heavy-flavour jet identification in Lorentz-boosted topologies in proton-proton collisions at $\\sqrt{s}$ = 13 TeV",
    "abstract": "Measurements in the highly Lorentz-boosted regime provoke increased interest in probing the Higgs boson properties and in searching for particles beyond the standard model at the LHC. In the CMS Collaboration, various boosted-object tagging algorithms, designed to identify hadronic jets originating from a massive particle decaying to $\\mathrm{b\\overline{b}}$ or $\\mathrm{c\\overline{c}}$, have been developed and deployed across a range of physics analyses. This paper highlights their performance on simulated events, and summarizes novel calibration techniques using proton-proton collision data collected at $\\sqrt{s}$ = 13 TeV during the 2016$-$2018 LHC data-taking period. Three dedicated methods are used for the calibration in multijet events, leveraging either machine learning techniques, the presence of muons within energetic boosted jets, or the reconstruction of hadronically decaying high-energy Z bosons. The calibration results, obtained through a combination of these approaches, are presented and discussed.",
    "authors": [
      "CMS Collaboration"
    ],
    "published": "2025-10-11T14:04:45Z",
    "updated": "2025-11-13T14:18:10Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/11/P11006"
  },
  {
    "arxiv_id": "2508.05853v2",
    "url": "https://arxiv.org/abs/2508.05853v2",
    "pdf_url": "https://arxiv.org/pdf/2508.05853v2.pdf",
    "title": "A flexible test facility for liquid xenon detector development",
    "abstract": "As liquid xenon time projection chambers scale to ever-larger sizes, so too do the engineering challenges they pose. We describe a large, flexible, multipurpose test facility capable of supporting the development of a number of key aspects of liquid xenon detector systems. Example applications of this facility include characterization of large-area light and charge sensor arrays, tests of xenon purification techniques and materials compatibility, and investigations into high-voltage phenomena. This facility uses an automated and remotely monitored cryo-cooling system based on immersion of the test chamber in a liquid bath rather than conductive coupling, leading to advantages in temperature and pressure stability, as well as increasing required response times in the case of cooling-power loss. Design advantages, operational procedures, and performance of the facility are described, as well as five examples of liquid xenon test chambers that use the facility.",
    "authors": [
      "Evan Angelico",
      "Jacopo Dalmasson",
      "Ralph DeVoe",
      "Giorgio Gratta",
      "Clarke A. Hardy",
      "Brian Lenardo",
      "Lin Si",
      "Marie Vidal",
      "Shuoxing Wu"
    ],
    "published": "2025-08-07T21:05:00Z",
    "updated": "2025-11-13T14:13:10Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/11/P11005"
  },
  {
    "arxiv_id": "2511.10311v1",
    "url": "https://arxiv.org/abs/2511.10311v1",
    "pdf_url": "https://arxiv.org/pdf/2511.10311v1.pdf",
    "title": "Time resolution of the ALICE Time-Of-Flight detector with the first Run 3 pp collisions at ${\\bf \\sqrt{\\textit{s}} = 13.6}$ TeV",
    "abstract": "Particle identification (PID) is a fundamental aspect of the ALICE detector system, central to its heavy-ion and proton-proton physics programs. Among the different PID strategies, ALICE uses the Time-Of-Flight (TOF) detector to identify particles at intermediate momenta ($0.5 < p_{\\rm T} < 4$ GeV/$c$). The ALICE TOF detector performed successfully during the first ten years of LHC operations. During the Long Shutdown 2, many ALICE sub-detectors, including TOF, were upgraded to fully leverage the targeted 50 kHz interaction rate of Pb-Pb collisions, which required the implementation of a continuous readout scheme. The TOF detector electronics were upgraded and refurbished, while processing algorithms for data quality control, reconstruction, calibration, and analysis were rewritten. This paper presents the upgraded TOF detector operation and calibration procedures and its performance in terms of timing resolution, a key factor for particle separation in ALICE analyses. Using 2022 pp collision data at $\\sqrt{s} = 13.6$ TeV from Run 3, the time resolution of the detector was estimated with two independent methods, both yielding consistent results, better than 80 ps. Despite the excellent performance already achieved, further improvements are expected after additional detector commissioning and refined calibration procedures, thus enhancing the ALICE PID capabilities for Run 3 and beyond.",
    "authors": [
      "ALICE Collaboration"
    ],
    "published": "2025-11-13T13:48:55Z",
    "updated": "2025-11-13T13:48:55Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.10275v1",
    "url": "https://arxiv.org/abs/2511.10275v1",
    "pdf_url": "https://arxiv.org/pdf/2511.10275v1.pdf",
    "title": "Electron Heat Flux and Whistler Instability in the Earth's Magnetosheath",
    "abstract": "Despite heat flux's role in regulating energy conversion in collisionless plasmas, its properties and evolution in the magnetosheath downstream of the Earth's bow shock are scarcely explored. We use MMS in situ measurements to quantify and characterize the electron heat flux in the magnetosheath. We find that the heat flux is shaped by the magnetosheath magnetic field as it drapes around the magnetosphere. While it is affected by solar wind upstream conditions and increases with magnetic field strength, it is not substantially changed by local magnetosheath processes. Also, the heat flux is limited by whistler instability thresholds.",
    "authors": [
      "Ida Svenningsson",
      "Emiliya Yordanova",
      "Yuri V. Khotyaintsev",
      "Mats André",
      "Giulia Cozzani",
      "Alexandros Chasapis",
      "Steven J. Schwartz"
    ],
    "published": "2025-11-13T13:01:41Z",
    "updated": "2025-11-13T13:01:41Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.EP",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2511.10174v1",
    "url": "https://arxiv.org/abs/2511.10174v1",
    "pdf_url": "https://arxiv.org/pdf/2511.10174v1.pdf",
    "title": "M3Scope a 3D multimode multiplane microscope for imaging nanoscale dynamics in soft matter",
    "abstract": "Fast, volumetric imaging that integrates multiple imaging modalities is essential for probing dynamic, heterogeneous soft and biological matter. Here, we present the M3Scope, a simple yet versatile multiplane microscope that extends widefield detection with a modular multimode cube to enable dual color fluorescence, polarization-resolved, and correlative brightfield fluorescence imaging while (i) preserving simultaneous 3D acquisition at high frame rates (100 fps) and (ii) requiring minimal realignment. We demonstrate its potential by investigating polymer dynamics across multiple spatial and temporal scales. In an acrylamide type polymerizing network, dual color tracking of 100 nm and 300 nm fluorescent probes revealed size dependent viscosities diverging from 15 mPa.s to 40 mPa.s after gelation. Polarization resolved rotational tracking of gold bipyramids yielded viscosities within 10 percent of theoretical values in 80 to 95 percent glycerol and remained accurate in the high-viscosity regime (bigger than 400 mPa.s) where translational motion is undetectable. Fluorescence brightfield imaging correlated structural changes during poly(isopropyl acrylamide) (pNIPAM) phase separation as well as variations in tracer diffusivity, linking morphology and dynamics in 3D. Taken together, these results show that the M3Scope delivers high speed volumetric imaging with flexible modality switching, providing a powerful platform for studying dynamic, heterogeneous systems across disciplines, from polymer physics to cell mechanobiology.",
    "authors": [
      "Steven Huysecom",
      "Francisco Bevilacqua",
      "Roger Bresoli Obach",
      "Sudipta Seth",
      "Luis M. Liz-Marzan",
      "Dagmar R. D hooge",
      "Johan Hofkens",
      "Susana Rocha",
      "Boris Louis"
    ],
    "published": "2025-11-13T10:38:42Z",
    "updated": "2025-11-13T10:38:42Z",
    "categories": [
      "physics.optics",
      "cond-mat.soft",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2511.10147v1",
    "url": "https://arxiv.org/abs/2511.10147v1",
    "pdf_url": "https://arxiv.org/pdf/2511.10147v1.pdf",
    "title": "Data-driven multi-species heat flux closures for two-stream-unstable plasmas with nonlinear sparse regression",
    "abstract": "The dual aims of accuracy and computational efficiency in computational plasma physics lend themselves well to the use of fluid models. The first of these goals, however, is only satisfied for such models insofar as the utilized closure can capture the neglected kinetic physics -- something which has proven challenging for multi-scale collisionless processes. In a recent article [E. R. Ingelsten et al. (2025) J. Plasma Phys. 91 E64], we used the data-driven method of sparse regression to discover a novel heat flux closure for electrostatic phenomena. Here, we generalize the six-term closure model found in that work from single- to multi-species modeling. Using data from OSIRIS particle-in-cell simulations over a range of initial conditions, we then demonstrate how the unknown coefficients in front of the three most important terms in the closure can be estimated from box-averaged fluid quantities. Both neural networks and a newly developed framework for nonlinear sparse regression are showcased. The resulting models predict the heat flux for each species with a typical accuracy of 80-90 % and regularly account for 85-95 % of the rate of change in the pressure. The models are also compared with results from multi-species linear collisionless theory.",
    "authors": [
      "Emil R. Ingelsten",
      "Madox C. McGrae-Menge",
      "E. Paulo Alves",
      "Istvan Pusztai"
    ],
    "published": "2025-11-13T10:03:00Z",
    "updated": "2025-11-13T10:03:00Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.10127v1",
    "url": "https://arxiv.org/abs/2511.10127v1",
    "pdf_url": "https://arxiv.org/pdf/2511.10127v1.pdf",
    "title": "Microscopy X-ray Imaging enriched with Small Angle X-ray Scattering for few nanometer resolution reveals shock waves and compression in intense short pulse laser irradiation of solids",
    "abstract": "Understanding how laser pulses compress solids into high-energy-density states requires diagnostics that simultaneously resolve macroscopic geometry and nanometer-scale structure. Here we present a combined X-ray imaging (XRM) and small-angle X-ray scattering (SAXS) approach that bridges this diagnostic gap. Using the Matter in Extreme Conditions end station at LCLS, we irradiated 25-micrometer copper wires with 45-fs, 0.9-J, 800-nm pulses at 3.5e19 W/cm2 while probing with 8.2-keV XFEL pulses. XRM visualizes the evolution of ablation, compression, and inward-propagating fronts with about 200-nm resolution, while SAXS quantifies their nanometer-scale sharpness through the time-resolved evolution of scattering streaks. The joint analysis reveals that an initially smooth compression steepens into a nanometer-sharp shock front after roughly 18 ps, consistent with an analytical steepening model and hydrodynamic simulations. The front reaches a velocity of about 25 km/s and a lateral width of several tens of micrometers, demonstrating for the first time the direct observation of shock formation and decay at solid density with few-nanometer precision. This integrated XRM-SAXS method establishes a quantitative, multiscale diagnostic of laser-driven shocks in dense plasmas relevant to inertial confinement fusion, warm dense matter, and planetary physics.",
    "authors": [
      "Thomas Kluge",
      "Arthur Hirsch-Passicos",
      "Jannis Schulz",
      "Mungo Frost",
      "Eric Galtier",
      "Maxence Gauthier",
      "Jörg Grenzer",
      "Christian Gutt",
      "Lingen Huang",
      "Uwe Hübner",
      "Megan Ikeya",
      "Hae Ja Lee",
      "Dimitri Khaghani",
      "Willow Moon Martin",
      "Brian Edward Marré",
      "Motoaki Nakatsutsumi",
      "Paweł Ordyna",
      "Franziska-Luise Paschke-Brühl",
      "Alexander Pelka",
      "Lisa Randolph",
      "Hans-Peter Schlenvoigt",
      "Christopher Schoenwaelder",
      "Michal Šmíd",
      "Long Yang",
      "Ulrich Schramm",
      "Thomas E. Cowan"
    ],
    "published": "2025-11-13T09:33:58Z",
    "updated": "2025-11-13T09:33:58Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.10096v1",
    "url": "https://arxiv.org/abs/2511.10096v1",
    "pdf_url": "https://arxiv.org/pdf/2511.10096v1.pdf",
    "title": "Tailored Three Dimensional Betatron Dynamics in UltraStable Hybrid Laser Plasma RF Accelerators",
    "abstract": "The detailed theoretical and numerical investigation of hybrid laser plasma RF accelerators, elucidating the mechanisms governing transverse beam dynamics, betatron polarization, and radiation reaction in ultra-relativistic electron bunches is presented. This framework combines analytical models of spatiotemporal plasma wakefield modulation, phase-dependent RF-driven oscillations, and quantum-corrected Landau Lifshitz radiation reaction with fully self-consistent 3D particle in cell simulations using EPOCH. The results demonstrate that RF amplitude, frequency, and phase enable precise control over transverse focusing strengths, betatron oscillation amplitudes, and polarization states. Resonant alignment between RF fields and natural betatron frequencies amplifies transverse excursions while damping parasitic oscillations through enhanced focusing gradients and radiation reaction, yielding reductions in emittance and mitigation of synchrotron-like energy losses. Stability maps and 3D force landscapes reveal strong phase sensitivity, where initial conditions and RF component ratios govern the temporal evolution of betatron amplitudes, and longitudinal field gradients modulate γ growth rates. These findings provide a comprehensive picture of nonlinear, resonant, and damping phenomena in hybrid laser plasma RF systems, highlighting the full spectrum of controllable transverse, longitudinal, and polarization dynamics in ultra relativistic electron beams.",
    "authors": [
      "A. A. Molavi Choobini",
      "M. Shahmansouri"
    ],
    "published": "2025-11-13T08:55:18Z",
    "updated": "2025-11-13T08:55:18Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2410.21611v2",
    "url": "https://arxiv.org/abs/2410.21611v2",
    "pdf_url": "https://arxiv.org/pdf/2410.21611v2.pdf",
    "title": "CaloChallenge 2022: A Community Challenge for Fast Calorimeter Simulation",
    "abstract": "We present the results of the \"Fast Calorimeter Simulation Challenge 2022\" - the CaloChallenge. We study state-of-the-art generative models on four calorimeter shower datasets of increasing dimensionality, ranging from a few hundred voxels to a few tens of thousand voxels. The 31 individual submissions span a wide range of current popular generative architectures, including Variational AutoEncoders (VAEs), Generative Adversarial Networks (GANs), Normalizing Flows, Diffusion models, and models based on Conditional Flow Matching. We compare all submissions in terms of quality of generated calorimeter showers, as well as shower generation time and model size. To assess the quality we use a broad range of different metrics including differences in 1-dimensional histograms of observables, KPD/FPD scores, AUCs of binary classifiers, and the log-posterior of a multiclass classifier. The results of the CaloChallenge provide the most complete and comprehensive survey of cutting-edge approaches to calorimeter fast simulation to date. In addition, our work provides a uniquely detailed perspective on the important problem of how to evaluate generative models. As such, the results presented here should be applicable for other domains that use generative AI and require fast and faithful generation of samples in a large phase space.",
    "authors": [
      "Claudius Krause",
      "Michele Faucci Giannelli",
      "Gregor Kasieczka",
      "Benjamin Nachman",
      "Dalila Salamani",
      "David Shih",
      "Anna Zaborowska",
      "Oz Amram",
      "Kerstin Borras",
      "Matthew R. Buckley",
      "Erik Buhmann",
      "Thorsten Buss",
      "Renato Paulo Da Costa Cardoso",
      "Anthony L. Caterini",
      "Nadezda Chernyavskaya",
      "Federico A. G. Corchia",
      "Jesse C. Cresswell",
      "Sascha Diefenbacher",
      "Etienne Dreyer",
      "Vijay Ekambaram",
      "Engin Eren",
      "Florian Ernst",
      "Luigi Favaro",
      "Matteo Franchini",
      "Frank Gaede",
      "Eilam Gross",
      "Shih-Chieh Hsu",
      "Kristina Jaruskova",
      "Benno Käch",
      "Jayant Kalagnanam",
      "Raghav Kansal",
      "Taewoo Kim",
      "Dmitrii Kobylianskii",
      "Anatolii Korol",
      "William Korcari",
      "Dirk Krücker",
      "Katja Krüger",
      "Marco Letizia",
      "Shu Li",
      "Qibin Liu",
      "Xiulong Liu",
      "Gabriel Loaiza-Ganem",
      "Thandikire Madula",
      "Peter McKeown",
      "Isabell-A. Melzer-Pellmann",
      "Vinicius Mikuni",
      "Nam Nguyen",
      "Ayodele Ore",
      "Sofia Palacios Schweitzer",
      "Ian Pang",
      "Kevin Pedro",
      "Tilman Plehn",
      "Witold Pokorski",
      "Huilin Qu",
      "Piyush Raikwar",
      "John A. Raine",
      "Humberto Reyes-Gonzalez",
      "Lorenzo Rinaldi",
      "Brendan Leigh Ross",
      "Moritz A. W. Scham",
      "Simon Schnake",
      "Chase Shimmin",
      "Eli Shlizerman",
      "Nathalie Soybelman",
      "Mudhakar Srivatsa",
      "Kalliopi Tsolaki",
      "Sofia Vallecorsa",
      "Kyongmin Yeo",
      "Rui Zhang"
    ],
    "published": "2024-10-28T23:28:07Z",
    "updated": "2025-11-13T08:43:36Z",
    "categories": [
      "physics.ins-det",
      "cs.LG",
      "hep-ex",
      "hep-ph"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1361-6633/ae1304"
  },
  {
    "arxiv_id": "2511.10041v1",
    "url": "https://arxiv.org/abs/2511.10041v1",
    "pdf_url": "https://arxiv.org/pdf/2511.10041v1.pdf",
    "title": "Temperature Dependence of the Time Resolution in a SiPM-Readout Plastic Scintillator for Cosmic-Ray Applications",
    "abstract": "Balloon- and space-borne cosmic-ray experiments employ plastic scintillators read out by silicon photomultipliers (SiPMs) to achieve picosecond-level time resolutions for triggering and particle identification. The performance of these systems can be affected by temperature variations encountered in flight. In this work, a time-of-flight (TOF) prototype consisting of a BC418 plastic scintillator bar coupled to Onsemi MICROFC-30050 SiPMs was constructed and tested under a controlled thermal environment between -20 and 20$^{\\circ}$C. Electrons from a $^{90}\\text{Sr}$ source were used as a beam, and a dedicated differential preamplifier and coincidence triggering were implemented to study the detector response. A minimum time resolution of 160ps was achieved at an overvoltage of 3V, remaining stable across the tested temperature range and uniform along the scintillator bar.",
    "authors": [
      "José Reyes Castillo",
      "Saúl Aguilar Salazar",
      "Diego Mauricio Gomez Coral"
    ],
    "published": "2025-11-13T07:36:27Z",
    "updated": "2025-11-13T07:36:27Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2504.02405v3",
    "url": "https://arxiv.org/abs/2504.02405v3",
    "pdf_url": "https://arxiv.org/pdf/2504.02405v3.pdf",
    "title": "Impact of helium ion irradiation on the thermal properties of superconducting nanowire single-photon detectors",
    "abstract": "SNSPDs are indispensable for applications ranging from quantum information processing to deep-space optical communications, owing to their high detection efficiency, low dark counts, and excellent timing resolution. However, further improving the intrinsic detection efficiency (IDE) remains crucial for optimizing SNSPD performance. Ion irradiation has recently emerged as a powerful post-fabrication method to enhance SNSPD characteristics. Here, we studied the effects of He-ion irradiation on the thermal properties of NbN SNSPDs. We systematically examine the evolution of thermal boundary conductance as a function of ion fluence (0-1.1E17 ions/cm2), observing a 57% decrease from 127 to 54 W/m^2K^4 with increasing fluence, followed by saturation at approximately 9E16 ions/cm2. At this fluence, the minimum hotspot relaxation time measurements indicate a 41% increase, rising from 17 to 24 ps,while the electron-phonon interaction time decreases, with the magnitude of change depending on temperature and sample batch.TEM reveals defect formation at the NbN/SiO2 interface (6-8 nm) and He-bubble formation within the SiO2 layer (30-260 nm), contributing to the extended thermal relaxation time. These irradiation-induced modifications play a key role in enhancing the IDE of the treated devices. We further demonstrate a post-irradiation SNSPD showing a saturated IDE plateau at 2000 nm from 2.7 K to 28 mK, enabled by thermal modifications and a weakly wavelength-dependent avalanche-assisted mechanism. Our findings highlight ion irradiation as a valuable tool for thermal tailoring in SNSPDs and advance the understanding of detection physics and defect engineering in superconducting optoelectronics.",
    "authors": [
      "Yi-Yu Hong",
      "Yu-Ze Wang",
      "Wei-Jun Zhang",
      "Jia-Hao Hu",
      "Jia-Min Xiong",
      "Dong-Wei Chu",
      "Xin Ou",
      "Wen-Tao Wu",
      "Xiao-Fu Zhang",
      "Hui-Qin Yu",
      "Pu-Sheng Yuan",
      "Hao Li",
      "Ling Wu",
      "Zhen Wang",
      "Li-Xing You"
    ],
    "published": "2025-04-03T08:54:30Z",
    "updated": "2025-11-13T06:23:48Z",
    "categories": [
      "physics.app-ph",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "physics.app-ph"
  },
  {
    "arxiv_id": "2511.09975v1",
    "url": "https://arxiv.org/abs/2511.09975v1",
    "pdf_url": "https://arxiv.org/pdf/2511.09975v1.pdf",
    "title": "Autonomous X-ray Fluorescence Mapping of Chemically Heterogeneous Systems via a Correlative Feature Detection Framework",
    "abstract": "We present X-AutoMap, a modular framework for autonomous X-ray fluorescence (XRF) mapping that enables chemically informed targeting of regions of interest through a correlative feature detection strategy. The system integrates classical computer vision and rule-based logic to identify features based on spatial relationships across multiple elemental maps, rather than relying solely on intensity or morphology. Tight integration with the Bluesky control infrastructure at the NSLS-II Hard X-ray Nanoprobe (HXN) beamline enables real-time, closed-loop scan orchestration. Applied to a chemically heterogeneous urban PM2.5 sample, X-AutoMap reduced high-resolution acquisition time from over 44 hours to approximately 10 hours by targeting compositionally significant features identified from coarse scans. High-resolution results revealed diverse particle types, including fully mixed, partially overlapping, and spatially distinct multi-element structures, demonstrating the ability of the framework to isolate chemically relevant features with minimal user intervention. The framework supports interactive and autonomous modes, operates within hardware constraints via grid-based scanning, and is robust across varying sample conditions. Future extensions will incorporate machine learning and probabilistic sampling to further improve detection sensitivity and scan efficiency. X-AutoMap is currently in active use at HXN and provides a flexible foundation for scalable, intelligent imaging workflows at synchrotron beamlines.",
    "authors": [
      "Carlos Deleon",
      "Dmitri Gavrilov",
      "Peggy ODay",
      "Ajith Pattammattel"
    ],
    "published": "2025-11-13T05:12:46Z",
    "updated": "2025-11-13T05:12:46Z",
    "categories": [
      "physics.ins-det",
      "cs.HC"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.09960v1",
    "url": "https://arxiv.org/abs/2511.09960v1",
    "pdf_url": "https://arxiv.org/pdf/2511.09960v1.pdf",
    "title": "High-throughput Parasitic-independent Probe Thermal Resistance Calibration for Robust Thermal Mapping with Scanning Thermal Micrsocopy",
    "abstract": "Nanostructured materials, critical for thermal management in semiconductor devices, exhibit a strong size dependence in thermal transport. Specifically, studying the variation of thermal resistance across grain boundaries is of critical importance in designing effective thermal interface materials for heterogeneous integration. Frequency-domain Thermoreflectance (FDTR)-based techniques can provide thermal resistance mapping at the micrometer length scale. Scanning Thermal Microscopy (SThM) has the potential for quantifying local thermal transport with orders of magnitude higher spatial resolution (<100 nm). However, challenges in accurately converting the raw signal to thermal conductivity and accounting for surface sensitivity limit its widespread adoption as a characterization standard for understanding nanoscale heat transport and defect-mediated modulation of thermal properties in nanostructured films. Here, we introduce a circuit-based probe thermal resistance (Rp) calibration technique that is independent of parasitic heat transport pathways; this calibration enables accurate measurement of the heat dissipated from the SThM probe and the resulting tip temperature change to extract the thermal resistance of the film (Rth). Following calibration, SThM achieved sub-100 nm spatial resolution in mapping thermal resistance across a 15 nm-thick Al film deposited by e-beam evaporation on a SiO2 substrate. Finally, the thermal resistance mapping is converted to thermal conductivity using a finite-element-modeling-based calibration approach, where the average of the pixel-level Rth values yields an effective thermal conductivity of 2.87 +/- 0.18 W m^-1 K^-1, in good agreement with published theoretical frameworks describing heat transport in ultrathin Al.",
    "authors": [
      "Ram Munde",
      "Heng-Ray Chuang",
      "Raisul Islam"
    ],
    "published": "2025-11-13T04:42:28Z",
    "updated": "2025-11-13T04:42:28Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.09950v1",
    "url": "https://arxiv.org/abs/2511.09950v1",
    "pdf_url": "https://arxiv.org/pdf/2511.09950v1.pdf",
    "title": "$π$-PIC: a framework for modular particle-in-cell developments and simulations",
    "abstract": "Recently proposed modifications of the standard particle-in-cell (PIC) method resolve long-standing limitations such as exact preservation of physically conserved quantities and unbiased ensemble down-sampling. Such advances pave the way for next-generation PIC codes capable of using lower resolution and fewer particles per cell, enabling interactive studies on personal computers and facilitating large-scale parameter scans on supercomputers. Here, we present a Python-controlled framework designed to stimulate the dissemination and adoption of novel PIC developments by providing unified interfaces for accommodation, cross-testing, and comparison of PIC solvers and extensions written in Python or low-level languages like C++ and Fortran. To demonstrate flexibility of proposed interfaces we present and test implementations of several PIC solvers, as well as of extensions that is capable of managing QED processes, moving-window, and tight focusing of laser pulses.",
    "authors": [
      "Frida Brogren",
      "Christoffer Olofsson",
      "Joel Magnusson",
      "Arkady Gonoskov"
    ],
    "published": "2025-11-13T04:29:26Z",
    "updated": "2025-11-13T04:29:26Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.22821v2",
    "url": "https://arxiv.org/abs/2507.22821v2",
    "pdf_url": "https://arxiv.org/pdf/2507.22821v2.pdf",
    "title": "Axisymmetric Gyrokinetic Simulation of ASDEX-Upgrade Scrape-off Layer Using a Conservative Implicit BGK Collision Operator",
    "abstract": "Collisions play an important role in turbulence and transport of fusion plasmas. For kinetic simulations, as the collisionality increases in the domain of interest, the size of the time step to resolve the collisional physics can become overly restrictive in an explicit time integration scheme, leading to high computational cost. With the aim of overcoming such restriction, we have implemented an implicit Bhatnagar-Gross-Krook (BGK) collision operator for use in the discontinuous Galerkin (DG) full-f gyrokinetic solver within the Gkeyll framework, which, when combined with Gkeyll's traditional explicit time integrator for collisionless advection, can significantly increase the time step in gyrokinetic simulations of highly collisional regimes. To ensure conservation of density, momentum, and energy, we utilize an iterative scheme to correct the discretized approximation to the equilibrium Maxwellian distribution to which the BGK collision operator relaxes. We have further generalized the BGK infrastructure, both the implicit scheme and the correction routine, to handle cross species collisions. This improved implicit and conservative BGK operator is benchmarked against the more accurate but more computationally expensive Lenard-Bernstein-Dougherty (LBD) operator which has been utilized in prior studies with Gkeyll. The implicit BGK operator enables 2D axisymmetric simulations of the ASDEX-Upgrade scrape-off layer to run 56 times faster to completion than the simulations with the LBD operator, because the BGK operator is more robust and converges at a lower resolution than is required by the LBD operator. Additionally, in this more collisional limit, we demonstrate that the results of our simulations utilizing the implicit BGK operator agreed well with simulations utilizing the more computationally expensive LBD operator.",
    "authors": [
      "D. Liu",
      "J. Juno",
      "G. W. Hammett",
      "A. Hakim",
      "A. Shukla",
      "M. Francisquez"
    ],
    "published": "2025-07-30T16:36:30Z",
    "updated": "2025-11-13T04:28:30Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.18893v2",
    "url": "https://arxiv.org/abs/2507.18893v2",
    "pdf_url": "https://arxiv.org/pdf/2507.18893v2.pdf",
    "title": "Development and performance evaluation of a water-based liquid scintillator tracking detector with wavelength-shifting fiber readout",
    "abstract": "We have developed a novel tracking detector utilizing a water-based liquid scintillator (WbLS) for the accurate characterization of neutrino interactions on a water target. In this detector, the WbLS is optically segmented into small cells by reflective separators, and the scintillation light is read out in three directions using wavelength-shifting fibers coupled to silicon photomultipliers. We developed and optimized WbLS samples for this application and measured their light yield using cosmic-ray muons. Subsequently, we constructed a prototype of the WbLS tracking detector and evaluated its performance with a positron beam. The beam test demonstrated good tracking performance, although the light yield was lower than required. The result prompted a review of the surfactant used in the WbLS and the material of the optical separators, leading to a significant improvement in light yield. In this paper, we report on a design of the WbLS tracking detector, the development of the WbLS, the results of the beam test, and subsequent improvements to the WbLS and optical separators.",
    "authors": [
      "Naoto Onda",
      "Yuka Asano",
      "Takashi Iida",
      "Tatsuya Kikawa",
      "Tsuyoshi Nakaya",
      "Atsushi Tokiyasu",
      "Daiki Wakabayashi"
    ],
    "published": "2025-07-25T02:25:47Z",
    "updated": "2025-11-13T02:22:21Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.09863v1",
    "url": "https://arxiv.org/abs/2511.09863v1",
    "pdf_url": "https://arxiv.org/pdf/2511.09863v1.pdf",
    "title": "Topmetal-L: A Low Noise Charge-Sensitive Pixel Sensor for POLAR2/LPD",
    "abstract": "POLAR-2 is a next-generation space astronomy platform led by China, with its core scientific objective focused on high-precision polarization measurements of gamma-ray bursts. As one of its key payloads, the Low-energy Polarization Detector (LPD) is designed to perform wide-field surveys to capture X-ray polarization information from gamma-ray bursts in the 2-10 keV energy range. This paper presents Topmetal-L, a dedicated charge-sensitive pixel sensor developed for the LPD prototype upgrade. Fabricated in a 130 nm CMOS process in 2024, the chip integrates a 356 $\\times$ 512 pixel array with a pixel pitch of 45 $μ$m. Each pixel incorporates a 26 $\\times$ 26 $μ$m^2 charge-collecting electrode window and is capable of simultaneously outputting both energy and position information of deposited charges. Topmetal-L has been systematically optimized for power consumption, noise performance, and readout efficiency. It exhibits an input dynamic range of 0-4 ke-, a typical charge-to-voltage conversion gain of 76.04 $μ$V/e-, an average equivalent noise charge of approximately 22.8 e-, a sensitive area exceeding 3.6 cm^2, and a total power consumption of 720 mW per chip. To meet the requirements of large-area, high-frame-rate readout for gas-based polarization detectors, a sentinel-scanning readout scheme is proposed, reducing the full-frame readout time to 730 $μ$s. A prototype Topmetal-L-based gas polarization detection system was evaluated across key energies: it exhibited a residual modulation of 0.26% $\\pm$ 0.45% at 5.90 keV, a modulation factor of 66.67% $\\pm$ 0.45% for a linearly polarized 8.0 keV source, and a counting rate saturated at 15 k counts/(cm^2$\\cdot$s) when tested at 5.4 keV.",
    "authors": [
      "Li-rong Xie",
      "Shi-Qiang Zhou",
      "Di-Fan Yi",
      "Huan-Bo Feng",
      "Zhu-Ke Feng",
      "Dong Wang",
      "Chao-song Gao",
      "En-Wei Liang",
      "Xiang-Ming Sun",
      "Hong-Bang Liu"
    ],
    "published": "2025-11-13T01:43:37Z",
    "updated": "2025-11-13T01:43:37Z",
    "categories": [
      "astro-ph.IM",
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2504.06995v2",
    "url": "https://arxiv.org/abs/2504.06995v2",
    "pdf_url": "https://arxiv.org/pdf/2504.06995v2.pdf",
    "title": "Broadband Optical Modulation and Control at Millikelvin Temperatures",
    "abstract": "A universal experimental challenge when studying radiation effects on cryogenic devices is to precisely and accurately characterize the position-dependent device response very near the energy detection threshold. We have developed a compact cryogenic optical beam steering system that can be used to generate O(μs) pulses of small numbers of photons over the energy range of 1.2 - 4.5eV at room temperature, and deliver those photons via fiber optic to any specified location on the surface of a detector operating at cryogenic temperatures. This new system will allow for robust calibration of any photon-sensitive detector, including supercondcting devices. The system can be used efficiently to explore the physics of target materials, quantify the position sensitivity of different sensor designs, measure phonon transport, and study the effects of quasiparticle poisoning on detector operation. We describe the design of this pulsed calibration method and present first results obtained with a second-generation system operated at room temperature and sub-Kelvin temperatures.",
    "authors": [
      "N. Tabassum",
      "T. Aralis",
      "J. Anczarski",
      "D. Baxter",
      "B. Cabrera",
      "R. Chapla",
      "N. Entin",
      "L. Hsu",
      "H. W. Magoon",
      "A. Nunez",
      "J. L. Ryan",
      "M. Salatino",
      "A. Simchony",
      "Z. J. Smith",
      "S. Stevens",
      "G. Pérez",
      "H. Stueber",
      "B. A. Young",
      "N. A. Kurinsky",
      "K. Stifter"
    ],
    "published": "2025-04-09T16:08:39Z",
    "updated": "2025-11-12T23:36:50Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "hep-ex",
      "nucl-ex",
      "physics.app-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.20628v3",
    "url": "https://arxiv.org/abs/2510.20628v3",
    "pdf_url": "https://arxiv.org/pdf/2510.20628v3.pdf",
    "title": "Magnetic Field-Line Curvature and Its Role in Particle Acceleration by Magnetically Dominated Turbulence",
    "abstract": "We employ first-principles, fully kinetic particle-in-cell simulations to investigate magnetic field-line curvature in magnetically dominated turbulent plasmas and its role in particle acceleration through curvature-drift motion along the motional electric field. By varying the fluctuation-to-mean magnetic-field ratio $δB_0/B_0$, we examine curvature $κ$ statistics and their connection to particle acceleration. The curvature probability densities display broad power-law wings, scaling linearly in $κ$ below the peak and developing hard high-$κ$ tails for $δB_0/B_0 \\gtrsim 1$. As the mean field strengthens, the high-$κ$ tails steepen, and large-curvature events are suppressed when $δB_0/B_0 \\ll 1$. The probability density functions of magnetic field-line contraction, ${\\bf v}_E \\cdot {\\bf κ}$, with ${\\bf v}_E$ the field-line velocity, develop power-law tails well described by a symmetric Pareto distribution, characteristic of stochastic energy exchanges, with the tails becoming harder as $δB_0/B_0$ increases. Our guiding-center analysis shows that curvature-drift acceleration accounts for a substantial fraction of the energization via the motional electric field, and that it strengthens with increasing $δB_0/B_0$. For well-magnetized particles, curvature-drift acceleration typically exceeds ${\\bf\\nabla}B$ drift, polarization drift, and betatron contributions. These results identify curvature-drift acceleration as a principal pathway through which magnetized turbulence transfers energy to nonthermal particles in astrophysical plasmas.",
    "authors": [
      "Samuel Sebastian",
      "Luca Comisso"
    ],
    "published": "2025-10-23T15:02:34Z",
    "updated": "2025-11-12T22:42:45Z",
    "categories": [
      "astro-ph.HE",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE",
    "doi": "10.3847/2041-8213/ae1696"
  },
  {
    "arxiv_id": "2511.09787v1",
    "url": "https://arxiv.org/abs/2511.09787v1",
    "pdf_url": "https://arxiv.org/pdf/2511.09787v1.pdf",
    "title": "Molecular Dynamics Simulation of Hydrodynamic Transport Coefficients in Plasmas",
    "abstract": "Molecular dynamics (MD) simulations are used to calculate transport coefficients in a two-component plasma interacting through a repulsive Coulomb potential. The thermal conductivity, electrical conductivity, electrothermal coefficient, thermoelectric coefficient, and shear viscosity are computed using the Green-Kubo formalism over a broad range of Coulomb coupling strength, $0.01 \\leq Γ\\leq 140$. Emphasis is placed on testing standard results of the Chapman-Enskog solution in the weakly coupled regime ($Γ\\ll 1$) using these first-principles simulations. As expected, the results show good agreement for $Γ\\lesssim 0.1$. However, this agreement is only possible if careful attention is paid to the definitions of linear constitutive relations in each of the theoretical models, a point that is often overlooked. For example, the standard Green-Kubo expression for thermal conductivity is a linear combination of thermal conductivity, electrothermal and thermoelectric coefficients computed in the Chapman-Enskog formalism. Meaningful results for electrical conductivity are obtained over the full range of coupling strengths explored, but it is shown that potential and virial components of the other transport coefficients diverge in the strongly coupled regime ($Γ\\gg 1$). In this regime, only the kinetic components of the transport coefficients are meaningful for a classical plasma.",
    "authors": [
      "Briggs Damman",
      "Jarett LeVan",
      "Scott Baalrud"
    ],
    "published": "2025-11-12T22:37:53Z",
    "updated": "2025-11-12T22:37:53Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.09786v1",
    "url": "https://arxiv.org/abs/2511.09786v1",
    "pdf_url": "https://arxiv.org/pdf/2511.09786v1.pdf",
    "title": "Plasma hydrodynamics from mean force kinetic theory",
    "abstract": "Mean force kinetic theory is used to evaluate the electrical conductivity, thermal conductivity, electrothermal coefficient, thermoelectric coefficient, and shear viscosity of a two-component (ion-electron) plasma. Results are compared with molecular dynamics simulations. These simulations are made possible by assuming a repulsive Coulomb force for all interactions. Good agreement is found for all coefficients up to a Coulomb coupling strength of $Γ\\approx 20$. This is over 100-times larger than the coupling strength at which traditional theories break down. It is concluded that mean force kinetic theory provides a means to extend hydrodynamics to dense plasmas.",
    "authors": [
      "Jarett LeVan",
      "Scott D. Baalrud"
    ],
    "published": "2025-11-12T22:37:09Z",
    "updated": "2025-11-12T22:37:09Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2505.08987v2",
    "url": "https://arxiv.org/abs/2505.08987v2",
    "pdf_url": "https://arxiv.org/pdf/2505.08987v2.pdf",
    "title": "A Formalism for the Transport and Matching of Coupled Beams in Accelerators",
    "abstract": "Understanding transverse coupling dynamics is crucial for beam physics, accelerator design, and operations. Currently, most accelerators are designed for uncoupled beams, and coupling is treated as an error or perturbation. Many transverse ($x$-$y$) coupling parametrizations exist: Edward-Teng, Mais-Ripken, Levedev-Bogacz, and others. Here, we present an explicit and complete formalism for transporting coupled beam optics functions based on Mais-Ripken and Lebedev-Bogacz parametrizations. The formalism allows for matching generally coupled beam optics functions but applies to uncoupled optics as well. A complete transformation method for coupled optics provides easy matching routines that can be added to known beam optics codes that lack this feature. For fully coupled lattices, we present methods for extracting eigenmode emittances and other beam parameters from observables that can be measured, which is essential to diagnose and characterize the beam in a real machine. We express the linear difference resonance in terms of coupled optics functions and relate it to the coupling strength parameter with explicit emittance exchange formalism realized from the generating functions discussed here.",
    "authors": [
      "Onur Gilanliogullari",
      "Brahim Mustapha",
      "Pavel Snopok"
    ],
    "published": "2025-05-13T21:57:59Z",
    "updated": "2025-11-12T20:51:55Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  }
]