{
  "arxiv_id": "2503.24168v2",
  "url": "https://arxiv.org/abs/2503.24168v2",
  "pdf_url": "https://arxiv.org/pdf/2503.24168v2.pdf",
  "title": "The Compact Linear e$^+$e$^-$ Collider (CLIC)",
  "abstract": "The Compact Linear Collider (CLIC) is a TeV-scale high-luminosity linear e$^+$e$^-$ collider studied by the international CLIC and CLICdp collaborations. CLIC uses a two-beam acceleration scheme, in which normal-conducting high-gradient 12 GHz accelerating structures are powered via a high-current drive beam. CLIC is foreseen to be built and operated in stages. The initial 380 GeV stage, with a site length of 11 km, optimally combines the exploration of Higgs and top-quark physics, including a top threshold scan near 350 GeV. A higher-energy stage, still using the initial single drive-beam complex, can be optimised for any energy up to 2 TeV. Parameters are presented in detail for a 1.5 TeV stage, with a site length of 29 km. Since the 2018 ESPPU reporting, significant effort was invested in CLIC accelerator optimisation, technology developments and system tests, including collaboration with new-generation light sources and free-electron lasers. CLIC implementation aspects at CERN have covered detailed studies of civil engineering, electrical networks, cooling and ventilation, scheduling, and costing. The CLIC baseline at 380 GeV is now 100 Hz operation, with a luminosity of 4.5$\\times 10^{34}$ cm$^{-2}$s$^{-1}$ and a power consumption of 166 MW. Compared to the 2018 design, this gives three times higher luminosity-per-power. The new baseline has two beam-delivery systems, allowing for two detectors operating in parallel. The cost estimate of the 380 GeV baseline is approximately 7.2 billion CHF. The construction of the first CLIC energy stage could start as early as ~2034/35 with first beams following a decade later. This report summarises the CLIC project, its implementation and running scenarios, with emphasis on new developments and recent progress. It concludes with an update on the CLIC detector studies and on the physics potential in light of the improved accelerator performance.",
  "authors": [
    "Erik Adli",
    "Gerardo D'Auria",
    "Nuria Catalan Lasheras",
    "Vera Cilento",
    "Roberto Corsini",
    "Dominik Dannheim",
    "Steffen Doebert",
    "Mick Draper",
    "Angeles Faus-Golfe",
    "Edward Fraser Mactavish",
    "Alexej Grudiev",
    "Andrea Latina",
    "Lucie Linssen",
    "John Andrew Osborne",
    "Yannis Papaphilippou",
    "Philipp Roloff",
    "Aidan Robson",
    "Carlo Rossi",
    "Andre Sailer",
    "Daniel Schulte",
    "Eva Sicking",
    "Steinar Stapnes",
    "Igor Syratchev",
    "Rogelio Tomas Garcia",
    "Walter Wuensch"
  ],
  "published": "2025-03-31T14:48:58Z",
  "updated": "2025-09-03T15:14:02Z",
  "categories": [
    "physics.acc-ph"
  ],
  "primary_category": "physics.acc-ph"
}