{
  "arxiv_id": "2504.05001v2",
  "url": "https://arxiv.org/abs/2504.05001v2",
  "pdf_url": "https://arxiv.org/pdf/2504.05001v2.pdf",
  "title": "SILVIA: Ultra-precision formation flying demonstration for space-based   interferometry",
  "abstract": "We propose SILVIA (Space Interferometer Laboratory Voyaging towards Innovative Applications), a mission concept designed to demonstrate ultra-precision formation flying between three spacecraft separated by 100 m. SILVIA aims to achieve sub-micrometer precision in relative distance control by integrating spacecraft sensors, laser interferometry, low-thrust and low-noise micro-propulsion for real-time measurement and control of distances and relative orientations between spacecraft. A 100-meter-scale mission in a near-circular low Earth orbit has been identified as an ideal, cost-effective setting for demonstrating SILVIA, as this configuration maintains a good balance between small relative perturbations and low risk for collision. This mission will fill the current technology gap towards future missions, including gravitational wave observatories such as DECIGO (DECihertz Interferometer Gravitational wave Observatory), designed to detect the primordial gravitational wave background, and high-contrast nulling infrared interferometers like LIFE (Large Interferometer for Exoplanets), designed for direct imaging of thermal emissions from nearby terrestrial planet candidates. The mission concept and its key technologies are outlined, paving the way for the next generation of high-precision space-based observatories.",
  "authors": [
    "Takahiro Ito",
    "Kiwamu Izumi",
    "Isao Kawano",
    "Ikkoh Funaki",
    "Shuichi Sato",
    "Tomotada Akutsu",
    "Kentaro Komori",
    "Mitsuru Musha",
    "Yuta Michimura",
    "Satoshi Satoh",
    "Takuya Iwaki",
    "Kentaro Yokota",
    "Kenta Goto",
    "Katsumi Furukawa",
    "Taro Matsuo",
    "Toshihiro Tsuzuki",
    "Katsuhiko Yamada",
    "Takahiro Sasaki",
    "Taisei Nishishita",
    "Yuki Matsumoto",
    "Chikako Hirose",
    "Wataru Torii",
    "Satoshi Ikari",
    "Koji Nagano",
    "Masaki Ando",
    "Seiji Kawamura",
    "Hidehiro Kaneda",
    "Shinsuke Takeuchi",
    "Shinichiro Sakai"
  ],
  "published": "2025-04-07T12:27:46Z",
  "updated": "2025-09-04T00:01:21Z",
  "categories": [
    "astro-ph.IM",
    "cs.SY",
    "eess.SY",
    "gr-qc",
    "physics.ins-det"
  ],
  "primary_category": "astro-ph.IM",
  "doi": "10.1093/pasj/psaf086"
}