{
  "arxiv_id": "2509.04730v1",
  "url": "https://arxiv.org/abs/2509.04730v1",
  "pdf_url": "https://arxiv.org/pdf/2509.04730v1.pdf",
  "title": "GEMINI: The First Underground Testbed for Seismic Isolation and   Interplatform Control in Next-Generation Gravitational-Wave Detectors",
  "abstract": "GEMINI is an underground research and development facility dedicated to advancing seismic isolation and control technologies for future gravitational-wave observatories, including the Einstein Telescope (ET) and the Lunar Gravitational-Wave Antenna (LGWA). This paper presents the technical design and theoretical framework of GEMINI's active seismic isolation platforms, including detailed noise budget analyses, performance predictions, and residual platform motion evaluations. The GEMINI platforms are designed to achieve unprecedented vibration isolation, targeting motion suppression across the 10 mHz to 10 Hz frequency band, and with the goal to make them the quietest platforms of their kind. In the context of ET, GEMINI will enable the development and validation of inter-platform control strategies essential for the stabilization of auxiliary degrees of freedom of its interferometers. GEMINI will also support the testing of cryogenic payloads and ultra-sensitive inertial sensors required for LGWA. By integrating advanced cryogenic systems, precision inertial sensors, and state-of-the-art vibration isolation technologies, GEMINI will serve as a versatile testbed for next-generation ground-based gravitational-wave detectors and lunar seismometry missions.",
  "authors": [
    "Tomislav Andric",
    "Jan Harms",
    "Ilaria Caravella",
    "Michele Angiolilli",
    "Daniele Cortis",
    "Nicola D'Ambrosio",
    "Massimiliano De Deo",
    "Marco D'Incecco",
    "Antonio Di Ludovico",
    "Oliver Gerberding",
    "Alessandro Lalli",
    "Brian Lantz",
    "Laura Leonzi",
    "Carla Macolino",
    "Richard Mittleman",
    "Conor Mow-Lowry",
    "Donato Orlandi",
    "Stefano Pirro",
    "Marco Ricci",
    "Jamie Rollins",
    "Jim Warner"
  ],
  "published": "2025-09-05T01:03:25Z",
  "updated": "2025-09-05T01:03:25Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}