[
  {
    "arxiv_id": "2509.04279v2",
    "url": "https://arxiv.org/abs/2509.04279v2",
    "pdf_url": "https://arxiv.org/pdf/2509.04279v2.pdf",
    "title": "Energy Confinement Time Scaling Law Derived from Paz-Soldan NF 2024",
    "abstract": "Results from C. Paz-Soldan et al 2024 Nucl. Fusion 64 094002 demonstrate encouraging energy confinement properties for the negative triangularity scenario, similar to or exceeding the scaling of the IPB98(y,2) law. This work describes the procedure with which a new scaling law was regressed specifically from the data from the aforementioned article. Given the relatively small size of the single-machine dataset, kernel density estimation was employed to minimize sampling bias and bootstrapping was used to give a realistic estimate of the large uncertainties from the regression. The resulting power law shows a robustly stronger dependence on plasma current and more severe power degradation as compared to the H-mode scaling law.",
    "authors": [
      "P. Lunia",
      "A. O. Nelson",
      "C. Paz-Soldan"
    ],
    "published": "2025-09-04T14:55:46Z",
    "updated": "2025-09-08T14:12:09Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.05228v1",
    "url": "https://arxiv.org/abs/2509.05228v1",
    "pdf_url": "https://arxiv.org/pdf/2509.05228v1.pdf",
    "title": "Design of a High-Average-Power Ferroelectric Phase Shifter",
    "abstract": "This paper describes performance of a voltage controlled phase shifter designed for a high average power and a high figure of merit. The device is a reflection-type, resonant phase shifter that utilizes ferroelectric capacitors and impedance matching to the port impedance. With state-of-the-art ferroelectric materials, the device achieves a high Figure of Merit of nearly a thousand degrees phase shift per dB insertion loss at 800 MHz, along with sub-microsecond response. This phase shifter is capable of handling average power up to a megawatt. Its application is expected to enhance the electrical efficiency of particle accelerators, reducing both capital and operating costs.",
    "authors": [
      "Ilan Ben-Zvi",
      "Alick Macpherson",
      "Samuel Smith"
    ],
    "published": "2025-09-05T16:45:20Z",
    "updated": "2025-09-05T16:45:20Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.05108v1",
    "url": "https://arxiv.org/abs/2509.05108v1",
    "pdf_url": "https://arxiv.org/pdf/2509.05108v1.pdf",
    "title": "LEMURS dataset: Large-scale multi-detector ElectroMagnetic Universal   Representation of Showers",
    "abstract": "We present LEMURS: an extensive dataset of simulated calorimeter showers designed to support the development and benchmarking of fast simulation methods in high-energy physics, most notably providing a step towards the development of foundation models. This new dataset is more robust than the well-established CaloChallenge dataset 2, featuring substantially greater statistics, a wider range of incident angles in the detector, and most crucially multiple detector geometries (including more realistic calorimeters). The dataset is provided in HDF5 format, with a file structure inspired by the CaloChallenge shower representation while also including more variables. LEMURS scale and diversity make it particularly suitable for development of foundation models and has been used in the CaloDiT-2 model, a pre-trained model released in the community standard simulation toolkit Geant4 (version 11.4.beta). All data and code for generation and analysis are openly accessible, facilitating reproducibility and reuse across the community.",
    "authors": [
      "Peter McKeown",
      "Piyush Raikwar",
      "Anna Zaborowska"
    ],
    "published": "2025-09-05T13:47:39Z",
    "updated": "2025-09-05T13:47:39Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "physics.comp-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2503.06128v3",
    "url": "https://arxiv.org/abs/2503.06128v3",
    "pdf_url": "https://arxiv.org/pdf/2503.06128v3.pdf",
    "title": "R&D of KLM Upgrade for Direct Measurement of Neutral Hadron Momentum via   Time-of-Flight in Belle II",
    "abstract": "Accurate momentum determination of a neutral hadron, such as a KL meson or a neutron, remains a significant challenge in particle physics and nuclear physics experiments. The Belle II experiment presents an opportunity to address this challenge through an upgrade incorporating Time-of-Flight (TOF) capability for its large KL and Muon Detector (KLM). We investigate the feasibility of momentum determination via TOF measurement. To achieve high time resolution for the KLM upgrade, we conduct research and development of cost-effective plastic scintillators in collaboration with GaoNengKeDi Company, and technology utilizing silicon photomultipliers(SiPMs) arrays. A bulk attenuation length of 120 \\pm 7 cm has been achieved with a 135 cm-long sample, along with a time resolution of 70 \\pm 7 ps at its midpoint. A 50 cm-long scintillator demonstrates an exceptional time resolution of 47 \\pm 2 ps. These results highlight the potential of the proposed technology for improving neutral hadron momentum measurements in an upgraded Belle II KLM detector.",
    "authors": [
      "Xiyang Wang",
      "Hongyu Zhang",
      "Shiming Zou",
      "Zibing Bai",
      "Deqing Fang",
      "Kairui Huang",
      "Ziyu Liu",
      "Yugang Ma",
      "Weiqi Meng",
      "Ting Wang",
      "Xiaolong Wang",
      "Shiqing Xie",
      "Mingjie Yang",
      "Junhao Yin",
      "Mingkuan Yuan",
      "Wanyi Zhuang"
    ],
    "published": "2025-03-08T08:45:37Z",
    "updated": "2025-09-05T13:38:53Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.03641v2",
    "url": "https://arxiv.org/abs/2509.03641v2",
    "pdf_url": "https://arxiv.org/pdf/2509.03641v2.pdf",
    "title": "Is There an Exact Magnetic-Moment for Charged Particle Motion in a   Homogeneous, Time-Dependent Magnetic Field?",
    "abstract": "The nonperturbative guiding-center model provides an exact alternative to full-orbit simulations of charged particle dynamics in situations where traditional guiding-center theory may fail. We demonstrate that the charged particle motion in a homogeneous, time-varying magnetic field is a solvable example of the nonperturbative guiding-center model. This entails showing that the exact magnetic moment of Qin and Davidson can be constructed to be asymptotic to the adiabatic invariant series of Kruskal. In contrast to the perturbative invariant, the exact invariant contains information about parametric resonances. These resonances destroy the conservation of the usual magnetic moment over very long times. This refutes some previous claims about the all-time invariance of the magnetic moment.",
    "authors": [
      "Michael Updike",
      "Joshua Burby"
    ],
    "published": "2025-09-03T18:48:10Z",
    "updated": "2025-09-05T11:36:28Z",
    "categories": [
      "physics.plasm-ph",
      "math-ph",
      "math.MP"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.04829v1",
    "url": "https://arxiv.org/abs/2509.04829v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04829v1.pdf",
    "title": "Preparation and measurement of an $\\rm ^{37}$Ar source for liquid xenon   detector calibration",
    "abstract": "We present the preparation and measurement of the radioactive isotope $\\rm ^{37}Ar$, which was produced using thermal neutrons from a reactor, as a calibration source for liquid xenon time projection chambers. $\\rm ^{37}Ar$ is a low-energy calibration source with a half-life of 35.01 days, making it suitable for calibration in the low-energy region of liquid xenon dark-matter experiments. Radioactive isotope $\\rm ^{37}Ar$ was produced by irradiating $\\rm ^{36}Ar$ with thermal neutrons. It was subsequently measured in a gaseous xenon time projection chamber (GXe TPC) to validate its radioactivity. Our results demonstrate that $\\rm ^{37}Ar$ is an effective and viable calibration source that offers precise calibration capabilities in the low-energy domain of xenon-based detectors.",
    "authors": [
      "Xu-Nan Guo",
      "Chang Cai",
      "Fei Gao",
      "Yang Lei",
      "Kai-Hang Li",
      "Chun-Lei Su",
      "Ze-Peng Wu",
      "Xiang Xiao",
      "Ling-Feng Xie",
      "Yi-Fei Zhao",
      "Xiao-Peng Zhou"
    ],
    "published": "2025-09-05T06:01:18Z",
    "updated": "2025-09-05T06:01:18Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2503.17557v2",
    "url": "https://arxiv.org/abs/2503.17557v2",
    "pdf_url": "https://arxiv.org/pdf/2503.17557v2.pdf",
    "title": "Aligning Thermal and Current Quenches with a High Density Low-Z   Injection",
    "abstract": "The conventional approach for thermal quench mitigation in a tokamak disruption is through a high-Z impurity injection that radiates away the plasma's thermal energy before it reaches the wall. The downside is a robust Ohmic-to-runaway current conversion due to the radiatively clamped low post-thermal-quench electron temperature. An alternative approach is to deploy a low-Z (either deuterium or hydrogen) injection that aims to slow down the thermal quench, and ideally aligns it with the current quench. This approach has been investigated here via 3D MHD simulations using the PIXIE3D code. By boosting the hydrogen density, a fusion-grade plasma is dilutionally cooled at approximately the original pressure. Energy loss to the wall is controlled by a Bohm outflow condition at the boundary where the magnetic field intercepts a thin plasma sheath at the wall, in addition to Bremsstrahlung bulk losses. Robust MHD instabilities proceed as usual, while the collisionality of the plasma has been greatly increased and parallel transport is now in the Braginskii regime. The main conclusion of this study is that the decreased transport loss along open field lines due to a sufficient low-Z injection slows down the thermal quench rate to the order of 20 ms, aligned with the current quench timescale for a 15 MA ITER plasma.",
    "authors": [
      "Jason Hamilton",
      "Luis Chacon",
      "Giannis Keramidas",
      "Xianzhu Tang"
    ],
    "published": "2025-03-21T22:15:33Z",
    "updated": "2025-09-05T05:48:58Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.00164v4",
    "url": "https://arxiv.org/abs/2509.00164v4",
    "pdf_url": "https://arxiv.org/pdf/2509.00164v4.pdf",
    "title": "The potential applications of muography to revealing sea shipwrecks",
    "abstract": "Muon imaging, a non-invasive technique leveraging naturally occurring cosmic muons, has emerged as a promising tool for exploring underwater objects, including shipwrecks. This article examines the potential of muon imaging to investigate the contents of wrecked ships in the Baltic Sea and other marine environments. By analyzing the principles of muon tomography, its applications in underwater archaeology, and its advantages over traditional methods, we highlight its potential to reveal hidden details within shipwrecks while addressing challenges posed by the marine environment. These wrecks pose significant environmental risks due to their hazardous contents, such as explosives and crude oil products, making their detection and monitoring a matter of environmental and safety concern. Accurate modeling and imaging of such wrecks are therefore crucial for assessing potential dangers and mitigating environmental impacts. In this work, we adopted an approach similar to that used in underground muon experiments. Muon propagation through 50 meters of seawater was simulated using GEANT4, with muons transported to a depth of 35 meters and recorded in a virtual detector. The saved distributions of particle type, kinetic energy, interaction position, and angular directions were then used as tabulated input to the PrimaryGeneratorAction module. This approach enabled the generation of a realistic underwater muon flux over a 20 m x 20 m surface at 35 meters depth, which was subsequently employed to simulate different shipwreck filling scenarios. Assuming an exposure time of one week for a wreck located at a depth of 50 meters, our simulations demonstrate that muon imaging can resolve density contrasts sufficiently to distinguish between water, oil, and high-density materials, underscoring its feasibility as a practical tool for underwater hazard assessment.",
    "authors": [
      "Anzori Sh. Georgadze"
    ],
    "published": "2025-08-29T18:05:45Z",
    "updated": "2025-09-05T05:40:11Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.04730v1",
    "url": "https://arxiv.org/abs/2509.04730v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04730v1.pdf",
    "title": "GEMINI: The First Underground Testbed for Seismic Isolation and   Interplatform Control in Next-Generation Gravitational-Wave Detectors",
    "abstract": "GEMINI is an underground research and development facility dedicated to advancing seismic isolation and control technologies for future gravitational-wave observatories, including the Einstein Telescope (ET) and the Lunar Gravitational-Wave Antenna (LGWA). This paper presents the technical design and theoretical framework of GEMINI's active seismic isolation platforms, including detailed noise budget analyses, performance predictions, and residual platform motion evaluations. The GEMINI platforms are designed to achieve unprecedented vibration isolation, targeting motion suppression across the 10 mHz to 10 Hz frequency band, and with the goal to make them the quietest platforms of their kind. In the context of ET, GEMINI will enable the development and validation of inter-platform control strategies essential for the stabilization of auxiliary degrees of freedom of its interferometers. GEMINI will also support the testing of cryogenic payloads and ultra-sensitive inertial sensors required for LGWA. By integrating advanced cryogenic systems, precision inertial sensors, and state-of-the-art vibration isolation technologies, GEMINI will serve as a versatile testbed for next-generation ground-based gravitational-wave detectors and lunar seismometry missions.",
    "authors": [
      "Tomislav Andric",
      "Jan Harms",
      "Ilaria Caravella",
      "Michele Angiolilli",
      "Daniele Cortis",
      "Nicola D'Ambrosio",
      "Massimiliano De Deo",
      "Marco D'Incecco",
      "Antonio Di Ludovico",
      "Oliver Gerberding",
      "Alessandro Lalli",
      "Brian Lantz",
      "Laura Leonzi",
      "Carla Macolino",
      "Richard Mittleman",
      "Conor Mow-Lowry",
      "Donato Orlandi",
      "Stefano Pirro",
      "Marco Ricci",
      "Jamie Rollins",
      "Jim Warner"
    ],
    "published": "2025-09-05T01:03:25Z",
    "updated": "2025-09-05T01:03:25Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.04728v1",
    "url": "https://arxiv.org/abs/2509.04728v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04728v1.pdf",
    "title": "Discharge structure hierarchy of highly electronegative plasma at low   pressure and quasi-cold ion approximation",
    "abstract": "In this paper, the discharge structure of an Ar and SF inductively coupled plasma at the low pressure is investigated by mean of a fluid simulation at the quasi cold ion approximation with the room temperature magnitude.",
    "authors": [
      "Rui-Ji Tang",
      "Shu-Xia Zhao",
      "Yu Tian"
    ],
    "published": "2025-09-05T01:00:56Z",
    "updated": "2025-09-05T01:00:56Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.04689v1",
    "url": "https://arxiv.org/abs/2509.04689v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04689v1.pdf",
    "title": "First demonstration of coherent radiation imaging for bunch-by-bunch   longitudinal compression monitoring",
    "abstract": "Longitudinal bunch profile monitoring is a crucial diagnostic requirement in most accelerator facilities. This is particularly true in modern free-electron lasers and novel acceleration schemes, where bunch lengths are often <100 fs and standard instrumentation is invasive or lacks the required resolution. This paper proposes a new monitoring method in this challenging parameter space. Initial proof of principle results for relative compression monitoring via broadband imaging of coherent THz radiation are presented. The technique can utilize more conventional intensity monitoring or novel spatial distribution variation. Both techniques have been demonstrated using both invasive and non-invasive coherent radiation sources. These results pave the way for a future non-invasive longitudinal bunch profile monitor.",
    "authors": [
      "Joseph Wolfenden",
      "Ana Guisao-Betancur",
      "Carsten Welsch",
      "Billy Kyle",
      "Thomas Pacey",
      "Erik Mansten",
      "Sara Thorin",
      "Mathias Brandin"
    ],
    "published": "2025-09-04T22:37:47Z",
    "updated": "2025-09-04T22:37:47Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.04675v1",
    "url": "https://arxiv.org/abs/2509.04675v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04675v1.pdf",
    "title": "Detecting and Correcting Gain Jumps in TES Microcalorimeters",
    "abstract": "Arrays of microcalorimeters based on transition-edge sensors (TESs) are being actively deployed to laboratories all over the world. A TES microcalorimeter array produces very large quantities of data and users of these devices have varying levels of experience, so it is important to provide robust software for data acquisition and analysis that can function with minimal user supervision. This software should be capable of addressing common phenomena that can adversely affect spectrum quality. Gain jumping is one such phenomenon that is characterized by abrupt changes in the gain of a device. Left unaddressed, gain jumps can degrade spectra by introducing false peaks. We are not aware of any previously published methods for resetting gain jumps during data acquisition or existing algorithms for correcting data that is degraded by gain jumps. We have developed automated methods for detecting and correcting gain jumps in gamma-ray TES microcalorimeters. We present a procedure for resetting gain jumps during a live data acquisition that involves briefly driving the TES into its normal state using the bias current. We also describe an algorithm for locating gain jumps and identifying unique gain states within existing microcalorimeter data. Finally, we provide a possible approach for correcting gain jumps after they have been identified.",
    "authors": [
      "Thomas A. Baker",
      "Daniel T. Becker",
      "Joseph W. Fowler",
      "Mark W. Keller",
      "Daniel S. Swetz",
      "Joel N. Ullom"
    ],
    "published": "2025-09-04T21:39:17Z",
    "updated": "2025-09-04T21:39:17Z",
    "categories": [
      "physics.ins-det",
      "physics.data-an"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1109/TASC.2024.3517565"
  },
  {
    "arxiv_id": "2507.05151v2",
    "url": "https://arxiv.org/abs/2507.05151v2",
    "pdf_url": "https://arxiv.org/pdf/2507.05151v2.pdf",
    "title": "Quantum Inspiration, Classical Advantage: Dequantized particle algorithm   for the nonlinear Vlasov-Poisson system",
    "abstract": "We present a dequantization algorithm for the Vlasov--Poisson (VP) system, termed the dequantized particle algorithm, by systematically dequantizing the underlying many-body quantum theory. Starting from the second-quantized Hamiltonian description, we derive a finite-dimensional dequantized system and show that it furnishes a structure-preserving discretization of the Schr\\\"odinger--Poisson (SP) equations. Through the Wigner or Husimi transformations, this discretization provides an efficient approximation of the VP system when quantum effects are negligible. Unlike conventional structure-preserving algorithms formulated in 6D phase space, this dequantized particle algorithm operates in 3D configuration space, potentially offering more compact and efficient representations of physical information under appropriate conditions. A numerical example of the classical nonlinear two-stream instability, simulated using merely 97 dequantized particles, demonstrates the efficiency, accuracy, and conservation properties of the algorithm and confirms its potential as a foundation for developing quantum and quantum-inspired classical algorithms for kinetic plasma dynamics.",
    "authors": [
      "Hong Qin",
      "Michael Q. May",
      "Jacob Molina"
    ],
    "published": "2025-07-07T16:01:37Z",
    "updated": "2025-09-04T20:12:33Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph",
      "quant-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2502.00188v2",
    "url": "https://arxiv.org/abs/2502.00188v2",
    "pdf_url": "https://arxiv.org/pdf/2502.00188v2.pdf",
    "title": "Dynamics of Magnetic Evaporative Beamline Cooling for Preparation of   Cold Atomic Beams",
    "abstract": "The most sensitive direct neutrino mass searches today are based on measurement of the endpoint of the beta spectrum of tritium to infer limits on the mass of the unobserved neutrino. To avoid the smearing associated with the distribution of molecular final states in the T-He molecule, the next generation of these experiments will need to employ atomic (T) rather than molecular (T$_{2}$) tritium sources, at currents of at least 10$^{15}$ atoms per second. Following production, atomic T can be trapped in gravitational and/or magnetic bottles for beta spectrum experiments, if and only if it can first be cooled to millikelvin temperatures. Accomplishing this cooling presents substantial technological challenges. The Project 8 collaboration is developing a technique based on magnetic evaporative cooling along a beamline (MECB) for the purpose of cooling T to feed a magneto-gravitational trap that also serves as a cyclotron radiation emission spectroscope. Initial tests of the approach are planned in a pathfinder apparatus using atomic Li. This paper presents a method for analyzing the dynamics of the MECB technique, and applies these calculations to the design of systems for cooling and slowing of atomic Li and T. A scheme is outlined that could provide a current of T at the millikelvin temperatures required for the Project 8 neutrino mass search.",
    "authors": [
      "A. Ashtari Esfahani",
      "S. Bhagvati",
      "S. Böser",
      "M. J. Brandsema",
      "R. Cabral",
      "V. A. Chirayath",
      "C. Claessens",
      "N. Coward",
      "L. de Viveiros",
      "P. J. Doe",
      "M. G. Elliott",
      "S. Enomoto",
      "M. Fertl",
      "J. A. Formaggio",
      "B. T. Foust",
      "J. K. Gaison",
      "P. Harmston",
      "K. M. Heeger",
      "B. J. P. Jones",
      "E. Karim",
      "K. Kazkaz",
      "P. T. Kolbeck",
      "M. Li",
      "A. Lindman",
      "C. Y. Liu",
      "C. Matthé",
      "R. Mohiuddin",
      "B. Monreal",
      "B. Mucogllava",
      "R. Mueller",
      "A. Negi",
      "J. A. Nikkel",
      "E. Novitski",
      "N. S. Oblath",
      "M. Oueslati",
      "J. I. Peña",
      "W. Pettus",
      "V. S. Ranatunga",
      "R. Reimann",
      "A. L. Reine",
      "R. G. H. Robertson",
      "L. Saldaña",
      "P. L. Slocum",
      "F. Spanier",
      "J. Stachurska",
      "K. Stogsdill",
      "Y. H. Sun",
      "P. T. Surukuchi",
      "L. Taylor",
      "A. B. Telles",
      "F. Thomas",
      "L. A. Thorne",
      "T. Thümmler",
      "W. Van De Pontseele",
      "B. A. VanDevender",
      "T. E. Weiss",
      "M. Wynne",
      "A. Ziegler"
    ],
    "published": "2025-01-31T22:06:08Z",
    "updated": "2025-09-04T20:00:35Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex",
      "physics.atom-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.04638v1",
    "url": "https://arxiv.org/abs/2509.04638v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04638v1.pdf",
    "title": "Time Resolution Characterization of 4H-SiC LGADs with a ${}^{90}$Sr   Source",
    "abstract": "This work presents timing measurements of 4H-SiC Low Gain Avalanche Detectors (4H-SiC LGADs) using beta particles from a ${}^{90}$Sr source. The 4H-SiC LGADs exhibit fast signal responses, and a time resolution of 61~ps was achieved, comparable to that of standard Si LGADs. The present limitation in the time resolution of 4H-SiC LGADs appears to stem from limited charge generation. Nevertheless, their higher voltage tolerance and faster carrier drift suggest that, with increased charge collection, their timing performance could approach or even surpass that of Si LGADs. These results demonstrate the strong potential of 4H-SiC LGADs as a robust platform for precision timing in future 4D tracking detectors, while also highlighting that signal charge is the dominant factor currently limiting their performance, indicating that further optimization of gain and drift structures will be essential for future development.",
    "authors": [
      "Tao Yang",
      "Yashas Satapathy",
      "Ben J. Sekely",
      "Abraham Tishelman-Charny",
      "Greg Allion",
      "Gil Atar",
      "Philip Barletta",
      "Carl Haber",
      "Steve Holland",
      "John F. Muth",
      "Spyridon Pavlidis",
      "Stefania Stucci"
    ],
    "published": "2025-09-04T19:56:13Z",
    "updated": "2025-09-04T19:56:13Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2503.12702v2",
    "url": "https://arxiv.org/abs/2503.12702v2",
    "pdf_url": "https://arxiv.org/pdf/2503.12702v2.pdf",
    "title": "Unveiling a New $β$-Scaling of the Tearing Instability in Weakly   Collisional Plasmas",
    "abstract": "We investigate the linear tearing instability in weakly collisional plasmas using a non-ideal gyrotropic-MHD framework, uncovering a previously unknown scaling relation for the instability growth rate in high-$\\beta$ environments. Even starting from an isotropic equilibrium, our analysis reveals a $\\beta$-dependence, with the maximum growth rate scaling as $\\sigma_\\mathrm{max} \\tau_a \\propto \\beta^{-1/4}$, challenging the long-held assumption of $\\beta$-independence inherent in classical MHD formulations. This novel scaling emerges due to self-consistent fluctuations in pressure anisotropy, dynamically induced by perturbations in velocity and magnetic fields. Increasing plasma-$\\beta$ always suppresses the instability, whereas a background pressure anisotropy can either enhance or further suppress it, depending on its sign: for $p_{\\parallel,0} < p_{\\perp,0}$ the instability is strengthened, while for $p_{\\parallel,0} > p_{\\perp,0}$ it is weakened. Importantly, this effect is not limited to low-collisionality plasmas at high $\\beta$; it can also manifest in more collisional environments once the strict assumption of pressure isotropy is relaxed. This finding has profound implications for various astrophysical contexts characterized by high $\\beta$ and varying degrees of collisionality, including the solar corona and heliospheric current sheets, planetary magnetospheres, as probed by space missions, and the intracluster medium, where magnetic reconnection critically impacts magnetic field evolution and cosmic ray transport. Our results therefore question the universality of the widely-accepted plasmoid-mediated fast reconnection paradigm and underscore the necessity of incorporating pressure anisotropy effects into reconnection models for accurate representation of astrophysical plasmas.",
    "authors": [
      "Gabriel L. Ferreira-Santos",
      "Grzegorz Kowal",
      "Diego A. Falceta-Gonçalves"
    ],
    "published": "2025-03-16T23:59:32Z",
    "updated": "2025-09-04T19:26:51Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE",
      "astro-ph.SR"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.04621v1",
    "url": "https://arxiv.org/abs/2509.04621v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04621v1.pdf",
    "title": "Shallow Angle Inverse Compton Scattering",
    "abstract": "Inverse Compton Scattering at shallow angles can be used to tune the spectrum and increase the brightness of the emitted radiation. Here, we report on the demonstration of emission of visible light by a 4.7 MeV $e$-beam crossing a 780 nm laser at 5.8$^{\\rm o}$ angle. Angular and spectral measurements of the radiation are in agreement with analytical and numerical predictions. We observe a characteristic dependence on the incoming polarization, not present in conventional head-on scattering, with suppression of the emission for $p$-polarization at condition equivalent to relativistic Brewster reflection.",
    "authors": [
      "B. H. Schaap",
      "M. Lenz",
      "P. Musumeci"
    ],
    "published": "2025-09-04T19:08:51Z",
    "updated": "2025-09-04T19:08:51Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.04566v1",
    "url": "https://arxiv.org/abs/2509.04566v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04566v1.pdf",
    "title": "Measuring the properties of homogeneous turbulence in curved spacetimes",
    "abstract": "Turbulence in curved spacetimes in general, and in the vicinity of black holes (BHs) in particular, represents a poorly understood phenomenon that is often analysed employing techniques developed for flat spacetimes. We here propose a novel approach to study turbulence in strong gravitational fields that is based on the computation of structure functions on generic manifolds and is thus applicable to arbitrary curved spacetimes. In particular, we introduce, for the first time, a formalism to compute the characteristic properties of turbulence, such as the second-order structure function or the power spectral density, in terms of proper lengths and volumes and not in terms of coordinate lengths and volumes, as customarily done. By applying the new approach to the turbulent rest-mass density field from simulations of magnetised disc accretion onto a Kerr BH, we inspect in a rigorous way turbulence in regions close to the event horizon, but also in the disc, the wind, and in the jet. We demonstrate that the new approach can capture the typical behavior of an inertial-range cascade and that differences up to $40-80\\%$ emerge in the vicinity of the event horizon with respect to the standard flat-spacetime approach. While these differences become smaller at larger distances, our study highlights that special care needs to be paid when analysing turbulence in strongly curved spacetimes.",
    "authors": [
      "Rita Megale",
      "Alejandro Cruz-Osorio",
      "Giuseppe Ficarra",
      "Mario Imbrogno",
      "Claudio Meringolo",
      "Leonardo Primavera",
      "Luciano Rezzolla",
      "Sergio Servidio"
    ],
    "published": "2025-09-04T18:00:02Z",
    "updated": "2025-09-04T18:00:02Z",
    "categories": [
      "gr-qc",
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "gr-qc"
  },
  {
    "arxiv_id": "2509.04374v1",
    "url": "https://arxiv.org/abs/2509.04374v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04374v1.pdf",
    "title": "Estimation of Effective Viscosity to Quantify Collisional Behavior in   Collisionless Plasma",
    "abstract": "While dissipation in collisional plasma is defined in terms of viscosity and resistivity, the exact functional form of dissipation i.e., the so-called dissipation function in nearly collisionless plasma is unknown. Nevertheless, previous studies have suggested that there exists viscous-like energy conversion in collisionless plasma with scaling characteristics analogous to collisional plasma, and in particular that the average dissipation is proportional to the square of the rate of strain as in hydrodynamics. In this study, using 2.5D kinetic particle-in-cell (PIC) simulation of collisionless plasma turbulence, we provide an estimate of effective viscosity at each scale, obtained via a scale-filtering approach. We then compare the turbulent dynamics of the PIC simulation with that from MHD and two-fluid simulations in which with the viscosity is equal to the effective viscosity estimate obtained from the PIC simulation. We find that the global behavior in these MHD and two-fluid simulations has a striking similarity with that in its kinetic/PIC counterpart. In addition, we explore the scale dependence of the effective viscosity, and discuss implications of this approach for space plasmas.",
    "authors": [
      "Subash Adhikari",
      "Carlos Gonzalez",
      "Yan Yang",
      "Sean Oughton",
      "Francesco Pecora",
      "Riddhi Bandyopadhyay",
      "William H. Matthaeus"
    ],
    "published": "2025-09-04T16:32:28Z",
    "updated": "2025-09-04T16:32:28Z",
    "categories": [
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.04367v1",
    "url": "https://arxiv.org/abs/2509.04367v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04367v1.pdf",
    "title": "A compact, low-power epithermal neutron counter for lunar water   detection",
    "abstract": "The detection and characterization of lunar water are critical for enabling sustainable human and robotic exploration of the Moon. Orbital neutron spectrometers, such as instruments on Lunar Prospector and the Lunar Reconnaissance Orbiter, have revealed hydrogen-rich regions near the poles but are limited by coarse spatial resolution and low counting efficiency. We present a compact, lightweight, and low-power epithermal neutron detector based on boron-coated silicon imagers, designed to probe subsurface hydrogen at decimeter scales from mobile platforms such as lunar rovers. This instrument leverages the high neutron capture cross-section of $^{10}$B to convert epithermal neutrons into detectable $\\alpha$ and $^{7}$Li ions in a fully-depleted silicon imager, providing a unique event topology to identify neutrons while suppressing backgrounds. Monte Carlo simulations demonstrate that a 3 $\\mu$m boron layer achieves optimal neutron detection efficiency, further enhanced with polyethylene moderation to improve sensitivity to the 0.4 eV-500 keV epithermal energy range. For a 10 cm$^2$ active area, the detector achieves sensitivity to H$_2$O weight fractions as low as 0.01 wt % in a 15 minute measurement. This scalable, portable, low-mass design is well-suited for integration into upcoming Artemis and commercial lunar rovers, providing a transformative capability for in-situ resource prospecting and ground-truth validation of orbital measurements.",
    "authors": [
      "Julian Cuevas-Zepeda",
      "Phoenix Alpine",
      "Brenda A. Cervantes-Vergara",
      "Claudio Chavez",
      "Juan Estrada",
      "Erez Etzion",
      "Guillermo Fernandez-Moroni",
      "Nathan Saffold",
      "Miguel Sofo-Haro",
      "Javier Tiffenberg"
    ],
    "published": "2025-09-04T16:26:13Z",
    "updated": "2025-09-04T16:26:13Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.04360v1",
    "url": "https://arxiv.org/abs/2509.04360v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04360v1.pdf",
    "title": "Sensitivities of time-dependent temperature profile predictions for NSTX   with the Multi-Mode Model",
    "abstract": "The Multi-Mode Model (MMM) for turbulent transport was applied to a large set of well-analyzed discharges from the National Spherical Torus Experiment (NSTX) in order to evaluate its sensitivities to a wide range of plasma conditions. MMM calculations were performed for hundreds of milliseconds in each discharge by performing time-dependent predictive simulations with the 1.5D tokamak integrated modeling code TRANSP. A closely related study concluded that MMM predicted electron ($T_e$) and ion ($T_i$) temperature profiles that were in reasonable agreement with NSTX observations, generally outperforming a different reduced transport model, TGLF, motivating a more thorough investigation of the characteristics of the MMM predictions. The simulations with MMM have electron energy transport dominated by electron temperature gradient modes for relatively low plasma $\\beta$ and high collisionality, transitioning to a mixture of different modes for higher $\\beta$ and lower collisionality. The thermal ion diffusivity predicted by MMM is much smaller than the neoclassical contribution, in line with previous experimental analysis of NSTX. Nonetheless, the $T_e$ and $T_i$ profiles are coupled via collisional energy exchange and thus sensitive to which transport channels are predicted. The simulations with MMM are robust to the simulation start time, converging to remarkably similar temperatures later during the discharge. MMM typically overpredicts confinement relative to NSTX observations, leading to the prediction of overly steep profiles. Plasmas with spatially broader $T_e$ profiles, higher $\\beta$, and longer energy confinement times tend to be predicted by MMM with better agreement with the experiment. These findings provide useful context for understanding the regime-dependent tendencies of MMM in anticipation of self-consistent, time-dependent predictive simulations of NSTX-U discharges.",
    "authors": [
      "J. B. Lestz",
      "G. Avdeeva",
      "S. M. Kaye",
      "M. V. Gorelenkova",
      "F. D. Halpern",
      "J. McClenaghan",
      "A. Y. Pankin",
      "K. E. Thome"
    ],
    "published": "2025-09-04T16:21:24Z",
    "updated": "2025-09-04T16:21:24Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.04359v1",
    "url": "https://arxiv.org/abs/2509.04359v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04359v1.pdf",
    "title": "Assessing time-dependent temperature profile predictions using reduced   transport models for high performing NSTX plasmas",
    "abstract": "Time-dependent, predictive simulations were performed with the 1.5D tokamak integrated modeling code TRANSP on a large set of well-analyzed, high performing discharges from the National Spherical Torus Experiment (NSTX) in order to evaluate how well modern reduced transport models can reproduce experimentally observed temperature profiles in spherical tokamaks. Overall, it is found that simulations using the Multi-Mode Model (MMM) more consistently agree with the NSTX observations than those using the Trapped Gyro-Landau Fluid (TGLF) model, despite TGLF requiring orders of magnitude greater computational cost. When considering all examined discharges, MMM has median overpredictions of electron temperature ($T_e$) and ion temperature ($T_i$) profiles of 28% and 27%, respectively, relative to the experiment. TGLF overpredicts $T_e$ by 46%, with much larger variance than MMM, and underpredicts $T_i$ by 25%. As $\\beta$ is increased across NSTX discharges, TGLF predicts lower $T_e$ and significant flattening of the $T_i$ profile, conflicting with NSTX observations. When using an electrostatic version of TGLF, both $T_e$ and $T_i$ are substantially overpredicted, underscoring the importance of electromagnetic turbulence in the high $\\beta$ spherical tokamak regime. Additionally, calculations with neural net surrogate models for TGLF were performed outside of TRANSP with a time slice flux matching transport solver, finding better agreement with experiment than the TRANSP simulations, highlighting the impact of different transport solvers and simulation techniques. Altogether, the reasonable agreement with experiment of temperature profiles predicted by MMM motivates a more detailed examination of the sensitivities of the TRANSP simulations with MMM to different NSTX plasma regimes in a companion paper, in preparation for self-consistent, time-dependent predictive modeling of NSTX-U scenarios.",
    "authors": [
      "J. B. Lestz",
      "G. Avdeeva",
      "T. F. Neiser",
      "M. V. Gorelenkova",
      "F. D. Halpern",
      "S. M. Kaye",
      "J. McClenaghan",
      "A. Y. Pankin",
      "K. E. Thome"
    ],
    "published": "2025-09-04T16:19:52Z",
    "updated": "2025-09-04T16:19:52Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.04332v1",
    "url": "https://arxiv.org/abs/2509.04332v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04332v1.pdf",
    "title": "Detection of ultracold neutrons with powdered scintillator screens",
    "abstract": "Zinc sulfide (ZnS:Ag) scintillators are widely used for ultracold neutron (UCN) detection, but their application is limited by long decay times and pronounced phosphorescence. We tested two possible replacement scintillators: yttrium aluminum perovskite (YAP:Ce) and lutetium yttrium orthosilicate (LYSO:Ce). Both have decay times on the order of 30-40 ns, which can help reduce dead time in high count rate experiments. YAP:Ce showed a 60% lower phosphorescence when compared to ZnS:Ag after 2 days and outperformed ZnS:Ag in counting UCN by about 20%. On the other hand, LYSO:Ce exhibited more phosphorescence and produced fewer UCN counts compared to both ZnS:Ag and YAP:Ce. Both of these scintillators are viable UCN detectors for high count rate experiments, but YAP:Ce outperformed LYSO:Ce by every tested metric.",
    "authors": [
      "M. Krivos",
      "N. C. Floyd",
      "C. L. Morris",
      "Z. Tang",
      "M. Blatnik",
      "S. M. Clayton",
      "C. B. Cude-Woods",
      "A. Fratangelo",
      "A. T. Holley",
      "D. E. Hooks",
      "T. M. Ito",
      "C. -Y. Liu",
      "M. Makela",
      "M. R. Martinez",
      "A. S. C. Navazo",
      "C.",
      "M. O'Shaughnessy",
      "R. W. Pattie",
      "E. L. Renner",
      "T. A. Sandborn",
      "T. J. Schaub",
      "M. Singh",
      "I. L. Smythe",
      "F. W. Uhrich",
      "N. K. Washecheck",
      "Z. Wang",
      "A. R. Young"
    ],
    "published": "2025-09-04T15:51:09Z",
    "updated": "2025-09-04T15:51:09Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.04205v1",
    "url": "https://arxiv.org/abs/2509.04205v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04205v1.pdf",
    "title": "Toward precision physics tests with future COHERENT detectors",
    "abstract": "We present a comprehensive sensitivity study of future CE$\\nu$NS detectors, focusing on a cryogenic cesium iodide detector and a tonne-scale liquid argon one, currently being developed by the COHERENT Collaboration. These setups will enable precision measurements of the weak mixing angle at low energies and allow accurate extraction of the neutron nuclear distribution radius. We also demonstrate that next-generation detectors will place constraints on the neutrino charge radius comparable to or better than current global fits. In addition, we explore the sensitivity to non standard neutrino electromagnetic properties, such as magnetic moments and millicharges, as well as new mediators. These findings reinforce the role of CE$\\nu$NS experiments in the upcoming precision era, with future detectors playing a key role in advancing our understanding of neutrino interactions and electroweak physics at low energies.",
    "authors": [
      "M. Atzori Corona",
      "M. Cadeddu",
      "N. Cargioli",
      "F. Dordei",
      "C. Giunti",
      "R. Pavarani"
    ],
    "published": "2025-09-04T13:31:19Z",
    "updated": "2025-09-04T13:31:19Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "hep-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.16960v2",
    "url": "https://arxiv.org/abs/2507.16960v2",
    "pdf_url": "https://arxiv.org/pdf/2507.16960v2.pdf",
    "title": "Surrogate Modeling of Landau Damping with Deep Operator Networks",
    "abstract": "Kinetic simulations excel at capturing microscale plasma physics phenomena with high accuracy, but their computational demands make them impractical for modeling large-scale space and astrophysical systems. In this context, we build a surrogate model, using Deep Operator Networks (DeepONets), based upon the Vlasov-Poisson simulation data to model the dynamical evolution of plasmas, focusing on the Landau damping process - a fundamental kinetic phenomenon in space and astrophysical plasmas. The trained DeepONets are able to capture the evolution of electric field energy in both linear and nonlinear regimes under various conditions. Extensive validation highlights DeepONets' robust performance in reproducing complex plasma behaviors with high accuracy, paving the way for large-scale modeling of space and astrophysical plasmas.",
    "authors": [
      "Simin Shekarpaz",
      "Chuanfei Dong",
      "Ziyu Huang"
    ],
    "published": "2025-07-22T19:05:24Z",
    "updated": "2025-09-04T12:03:27Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE",
      "astro-ph.IM",
      "astro-ph.SR",
      "physics.comp-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.3847/1538-4357/adf3ac"
  },
  {
    "arxiv_id": "2509.04132v1",
    "url": "https://arxiv.org/abs/2509.04132v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04132v1.pdf",
    "title": "Lagrangian features of turbulent transport in tokamak plasmas",
    "abstract": "This study investigates the Lagrangian properties of ion turbulent transport driven by drift-type turbulence in tokamak plasmas. Despite the compressible and inhomogeneous nature of Eulerian gyrocenter drifts, numerical simulations with the T3ST code reveal approximate ergodicity, stationarity, and time-symmetry. These characteristics are attributed to broad initial phase-space distributions that support ergodic mixing. Moreover, relatively minor constraints on the initial distributions are found to have negligible effects on transport levels.",
    "authors": [
      "D. I. Palade"
    ],
    "published": "2025-09-04T11:55:53Z",
    "updated": "2025-09-04T11:55:53Z",
    "categories": [
      "physics.plasm-ph",
      "nlin.CD",
      "physics.data-an"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.19653v2",
    "url": "https://arxiv.org/abs/2508.19653v2",
    "pdf_url": "https://arxiv.org/pdf/2508.19653v2.pdf",
    "title": "Charting the Luminosity Capabilities of the CERN Large Hadron Collider   with Various Nuclear Species",
    "abstract": "The Large Hadron Collider (LHC) at CERN has been instrumental in recent advances in experimental high energy physics by colliding beams of protons and heavier nuclei at unprecedented energies. The present heavy-ion programme is based mainly on colliding lead nuclei. For future ion runs, there is strong interest to achieve a significantly higher integrated nucleon-nucleon luminosity, which might be achieved through collisions of species other than Pb. In this paper, we explore the nucleon-nucleon luminosity projections in the LHC for a selection of ion species ranging from He to Xe, and including Pb as reference. Alternative beam production schemes are investigated as a way to mitigate effects such as space charge that degrade the beam quality in the LHC injectors. In the most optimistic scenarios, we find up to about a factor~4 improvement in integrated nucleon-nucleon luminosity for a typical future one-month run, with respect to the present Pb programme. We also outline a future study programme and experiments to test the assumptions and refine the simulated projections put forward in this article.",
    "authors": [
      "E. Waagaard",
      "R. Bruce",
      "R. Alemany Fernandez",
      "H. Bartosik",
      "J. M. Jowett",
      "N. Triantafyllou"
    ],
    "published": "2025-08-27T08:01:30Z",
    "updated": "2025-09-04T07:42:46Z",
    "categories": [
      "physics.acc-ph",
      "nucl-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.03955v1",
    "url": "https://arxiv.org/abs/2509.03955v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03955v1.pdf",
    "title": "Beamstrahlung monitoring at SuperKEKB upgrade 2023",
    "abstract": "Beam monitoring is crucial for particle accelerators to achieve high luminosity. We describe an upgrade of the LABM, a beam monitoring device utilizing observation of the beamstrahlung, radiation emitted by a beam of charged particles when it accelerates in the electromagnetic field of another beam of charged particles.",
    "authors": [
      "Dmitri Liventsev",
      "Giovanni Bonvicini",
      "Daniel Ricalde Herrmann",
      "Pedro L. M. Podesta-Lerma",
      "Makoto Tobiyama"
    ],
    "published": "2025-09-04T07:32:11Z",
    "updated": "2025-09-04T07:32:11Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.20523v2",
    "url": "https://arxiv.org/abs/2507.20523v2",
    "pdf_url": "https://arxiv.org/pdf/2507.20523v2.pdf",
    "title": "Multi-Machine Scaling Laws for Fuel and Impurity Puffing Rates   Sufficient for Detachment Access: a Systematic Review of Magnetic Confinement   Fusion Devices",
    "abstract": "From a database of 457 experimental and numerical data from 32 machines among solid-walled tokamaks, stellarators and linear plasma devices, we derive physics-informed multi-machine scaling laws predictive of fuel and impurity puffing rates sufficient to access plasma detachment -- leading candidate for a reactor-relevant solution to the open issue of plasma-wall interaction. Validation of our laws in up to 40 plasmas in low- and high-confinement mode also featuring advanced configurations demonstrates accuracy within a factor 1.5 in up to 50% of the instances, and within a factor 2 on average. Divertor volume alone is found to correlate to fuelling. The addition of plasma opaqueness leads to the empirically-calibrated law $\\Gamma_{\\text{D}}\\propto [n_{\\text{sep}}\\times a\\times(S_{\\text{div}}/V_{\\text{div}})^{-1.5}]^{1.05}$ valid across all toroidal devices. Its simplification to $\\Gamma_{\\text{D}}^{\\text{HDL}}\\propto 0.43\\times a^{1.58}\\times\\lambda_q^{-0.89}$ avoids a dependence on $n_{\\text{sep}}$ and bears intrinsic significance provided by the H/L density limit and the power fall-off length. Non-linearities of the impurity dynamics manifest in the seeding rate -- which the present work identifies both a generalised formula for, and the Greenwald-Eich-Scarabosio simplification $\\Gamma_{\\text{Z}}^{\\text{GES}}\\propto a^{1.51}\\times\\lambda_q^{-0.27}$. Similar relationships are defined for stellarators, closely following the mainstream but without providing data for validation -- which should stimulate further investigations. In the era of nuclear fusion reactor design, these results find immediate applicability in informing reactor fuel cycle design and edge plasma modelling. More generally, this study demonstrates that physics-based 0D laws able to relate detachment to the engineering actuators exist.",
    "authors": [
      "M. Moscheni",
      "A. Herrmann",
      "R. Kembleton",
      "M. Kryjak",
      "S. Lazerson",
      "F. Levi",
      "M. Siccinio",
      "P. Staniec",
      "T. Giegerich",
      "C. Tantos",
      "the Gauss Fusion GmbH Team"
    ],
    "published": "2025-07-28T05:11:10Z",
    "updated": "2025-09-04T05:49:10Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.03880v1",
    "url": "https://arxiv.org/abs/2509.03880v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03880v1.pdf",
    "title": "Plasma wakefield: from accelerators to black holes",
    "abstract": "Commemorating the 2024 S. Chandrasekhar Prize, this review provides a retrospective on the genesis and evolution of plasma wakefield acceleration. It traces the journey from prehistory and the invention of the Plasma Wakefield Accelerator (PWFA), the establishment of its theoretical cornerstones, to its profound reverberations across fundamental physics, including astrophysics and analog gravity. The narrative emphasizes conceptual evolution, key theoretical breakthroughs, and future outlook, culminating in a vision for hybrid schemes and next-generation colliders. In addition to application to particle accelerators and high energy collider physics, it is found that plasma wakefield, with its ultra-intense acceleration, can also be applied to investigate gravity effects in the laboratory based on Einstein's equivalence principle. A specific example is accelerating flying relativistic plasma mirrors to investigate the celebrated black hole Hawking evaporation and the associated information loss paradox. We describe an ongoing experiment, AnaBHEL (Analog Black Hole Evaporation via Lasers), which aims at shedding some lights on the black hole information loss paradox.",
    "authors": [
      "Pisin Chen",
      "Yung-Kun Liu"
    ],
    "published": "2025-09-04T04:34:40Z",
    "updated": "2025-09-04T04:34:40Z",
    "categories": [
      "physics.plasm-ph",
      "gr-qc",
      "hep-ex"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2504.05001v2",
    "url": "https://arxiv.org/abs/2504.05001v2",
    "pdf_url": "https://arxiv.org/pdf/2504.05001v2.pdf",
    "title": "SILVIA: Ultra-precision formation flying demonstration for space-based   interferometry",
    "abstract": "We propose SILVIA (Space Interferometer Laboratory Voyaging towards Innovative Applications), a mission concept designed to demonstrate ultra-precision formation flying between three spacecraft separated by 100 m. SILVIA aims to achieve sub-micrometer precision in relative distance control by integrating spacecraft sensors, laser interferometry, low-thrust and low-noise micro-propulsion for real-time measurement and control of distances and relative orientations between spacecraft. A 100-meter-scale mission in a near-circular low Earth orbit has been identified as an ideal, cost-effective setting for demonstrating SILVIA, as this configuration maintains a good balance between small relative perturbations and low risk for collision. This mission will fill the current technology gap towards future missions, including gravitational wave observatories such as DECIGO (DECihertz Interferometer Gravitational wave Observatory), designed to detect the primordial gravitational wave background, and high-contrast nulling infrared interferometers like LIFE (Large Interferometer for Exoplanets), designed for direct imaging of thermal emissions from nearby terrestrial planet candidates. The mission concept and its key technologies are outlined, paving the way for the next generation of high-precision space-based observatories.",
    "authors": [
      "Takahiro Ito",
      "Kiwamu Izumi",
      "Isao Kawano",
      "Ikkoh Funaki",
      "Shuichi Sato",
      "Tomotada Akutsu",
      "Kentaro Komori",
      "Mitsuru Musha",
      "Yuta Michimura",
      "Satoshi Satoh",
      "Takuya Iwaki",
      "Kentaro Yokota",
      "Kenta Goto",
      "Katsumi Furukawa",
      "Taro Matsuo",
      "Toshihiro Tsuzuki",
      "Katsuhiko Yamada",
      "Takahiro Sasaki",
      "Taisei Nishishita",
      "Yuki Matsumoto",
      "Chikako Hirose",
      "Wataru Torii",
      "Satoshi Ikari",
      "Koji Nagano",
      "Masaki Ando",
      "Seiji Kawamura",
      "Hidehiro Kaneda",
      "Shinsuke Takeuchi",
      "Shinichiro Sakai"
    ],
    "published": "2025-04-07T12:27:46Z",
    "updated": "2025-09-04T00:01:21Z",
    "categories": [
      "astro-ph.IM",
      "cs.SY",
      "eess.SY",
      "gr-qc",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM",
    "doi": "10.1093/pasj/psaf086"
  },
  {
    "arxiv_id": "2501.17382v3",
    "url": "https://arxiv.org/abs/2501.17382v3",
    "pdf_url": "https://arxiv.org/pdf/2501.17382v3.pdf",
    "title": "The nonmodal kinetic theory of the macroscale convective flows of   magnetized plasma, generated by the inhomogeneous microturbulenc",
    "abstract": "In this paper, we present the nonmodal kinetic theory of the macroscale two-dimensional compressed-sheared non-diffusive convective flows of a magnetized plasma generated by the inhomogeneous microturbulence. This theory bases on the two-scales approach to the solution of the Vlasov-Poisson system of equations for magnetized plasma, in which the self-consistent evolution of the plasma and of the electrostatic field on the microscales, commensurable with the wavelength of the microscale instabilities and of the ion gyroradius, as well as on the macroscales of a bulk of plasma, is accounted for. It includes the theory of the formation of the macroscale spatially inhomogeneous compressed-sheared convective flows by the inhomogeneous microturbulence, the theory of the back reaction of the macroscale convected flows on the microturbulence, and of the slow macroscale responce of a bulk of plasma on the development of the compressed-sheared convective flows.",
    "authors": [
      "V. V. Mikhailenko",
      "V. S. Mikhailenko",
      "Hae June Lee"
    ],
    "published": "2025-01-29T02:29:31Z",
    "updated": "2025-09-03T19:52:08Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.04528v1",
    "url": "https://arxiv.org/abs/2509.04528v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04528v1.pdf",
    "title": "HEEPidermis: a versatile SoC for BioZ recording",
    "abstract": "Biological impedance (BioZ) is an information-packed modality that allows for non-invasive monitoring of health and emotional state. Currently, most research involving tissue impedance is based on bulky or fixed-purpose hardware, which limits the scope of research and the possibilities of experiments. In this work, we present HEEPidermis: a System-on-Chip (SoC) which integrates all the blocks needed for tissue impedance measurement, including two 8-bit, arbitrary-signal current DACs, two VCO-based ADCs, and a RISC-V CPU to enable on-chip feature extraction for closed-loop operation. An event-based sub-sampler improves storage and energy efficiency for long-term recording. In addition to the versatile SoC, the digital back-end and behavioral models of the analog front-end are open-source, allowing fast system-level simulations or repurposing. The SoC was taped out on TSMC 65 nm LP process.",
    "authors": [
      "Juan Sapriza",
      "Beatrice Grassano",
      "Alessio Naclerio",
      "Filippo Quadri",
      "Tommaso Terzano",
      "David Mallasén",
      "Davide Schiavone",
      "Robin Leplae",
      "Jérémie Moullet",
      "Alexandre Levisse",
      "Christoph Müller",
      "Mariagrazia Graziano",
      "Matías Miguez",
      "David Atienza"
    ],
    "published": "2025-09-03T19:34:37Z",
    "updated": "2025-09-03T19:34:37Z",
    "categories": [
      "physics.ins-det",
      "cs.AR",
      "physics.med-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.03664v1",
    "url": "https://arxiv.org/abs/2509.03664v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03664v1.pdf",
    "title": "Pressure dependence of magnetron sputtering: 2D-RZ particle-in-cell and   1D fluid modeling",
    "abstract": "We reproduce the consistently-seen experimental voltage versus pressure (V-P) dependence of DC magnetron sputtering (DCMS) with 2D-RZ particle-in-cell (PIC) simulation. Informed by PIC simulation, we develop a steady-state, 1D-axial fluid model of the sheath and presheath that also reproduces this V-P dependence. The V-P dependence is the relationship between the steady-state voltage needed to maintain a constant discharge current and the neutral gas pressure. V-P dependence is fundamental to device performance, but has not previously been reproduced with simulation or satisfactorily explained. In this work, we compare the V-P curve of our simulated device and fluid model with past experiments and then present a theoretical explanation for this V-P dependence. We find that the decrease in voltage with increasing pressure is not due to electron recapture at the cathode. Rather, the constant current dictates a constant global ionization rate, so the voltage decrease compensates for the increase in neutral gas density by lowering the energy of the plasma electrons, which decreases their ionization probability. The PIC simulations also reveal that the presheath and bulk plasma are unaffected by the electron reflection coefficient at the cathode; the only effect of increasing reflection is a reduction in the sheath voltage and width. In addition to the potential structure, we explore how pressure affects the plasma density, particle drifts, and particle energy distributions.",
    "authors": [
      "Joseph G. Theis",
      "Gregory R. Werner",
      "Thomas G. Jenkins",
      "Daniel Main",
      "John R. Cary"
    ],
    "published": "2025-09-03T19:28:35Z",
    "updated": "2025-09-03T19:28:35Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.03608v1",
    "url": "https://arxiv.org/abs/2509.03608v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03608v1.pdf",
    "title": "Search for low-mass electron-recoil dark matter using a single-charge   sensitive SuperCDMS-HVeV Detector",
    "abstract": "We present constraints on low mass dark matter-electron scattering and absorption interactions using a SuperCDMS high-voltage eV-resolution (HVeV) detector. Data were taken underground in the NEXUS facility located at Fermilab with an overburden of 225 meters of water equivalent. The experiment benefits from the minimizing of luminescence from the printed circuit boards in the detector holder used in all previous HVeV studies. A blind analysis of $6.1\\,\\mathrm{g\\cdot days}$ of exposure produces exclusion limits for dark matter-electron scattering cross-sections for masses as low as $1\\,\\mathrm{MeV}/c^2$, as well as on the photon-dark photon mixing parameter and the coupling constant between axion-like particles and electrons for particles with masses $>1.2\\,\\mathrm{eV}/c^2$ probed via absorption processes.",
    "authors": [
      "SuperCDMS Collaboration",
      "M. F. Albakry",
      "I. Alkhatib",
      "D. Alonso-González",
      "J. Anczarski",
      "T. Aralis",
      "T. Aramaki",
      "I. Ataee Langroudy",
      "C. Bathurst",
      "R. Bhattacharyya",
      "A. J. Biffl",
      "P. L. Brink",
      "M. Buchanan",
      "R. Bunker",
      "B. Cabrera",
      "R. Calkins",
      "R. A. Cameron",
      "C. Cartaro",
      "D. G. Cerdeño",
      "Y. -Y. Chang",
      "M. Chaudhuri",
      "J. -H. Chen",
      "R. Chen",
      "N. Chott",
      "J. Cooley",
      "H. Coombes",
      "P. Cushman",
      "R. Cyna",
      "S. Das",
      "S. Dharani",
      "M. L. di Vacri",
      "M. D. Diamond",
      "M. Elwan",
      "S. Fallows",
      "E. Fascione",
      "E. Figueroa-Feliciano",
      "S. L. Franzen",
      "A. Gevorgian",
      "M. Ghaith",
      "G. Godden",
      "J. Golatkar",
      "S. R. Golwala",
      "R. Gualtieri",
      "J. Hall",
      "S. A. S. Harms",
      "C. Hays",
      "B. A. Hines",
      "Z. Hong",
      "L. Hsu",
      "M. E. Huber",
      "V. Iyer",
      "V. K. S. Kashyap",
      "S. T. D. Keller",
      "M. H. Kelsey",
      "K. T. Kennard",
      "Z. Kromer",
      "A. Kubik",
      "N. A. Kurinsky",
      "M. Lee",
      "J. Leyva",
      "B. Lichtenberg",
      "J. Liu",
      "Y. Liu",
      "E. Lopez Asamar",
      "P. Lukens",
      "R. López Noé",
      "D. B. MacFarlane",
      "R. Mahapatra",
      "J. S. Mammo",
      "N. Mast",
      "A. J. Mayer",
      "P. C. McNamara",
      "H. Meyer zu Theenhausen",
      "É. Michaud",
      "E. Michielin",
      "K. Mickelson",
      "N. Mirabolfathi",
      "M. Mirzakhani",
      "B. Mohanty",
      "D. Mondal",
      "D. Monteiro",
      "J. Nelson",
      "H. Neog",
      "V. Novati",
      "J. L. Orrell",
      "M. D. Osborne",
      "S. M. Oser",
      "L. Pandey",
      "S. Pandey",
      "R. Partridge",
      "P. K. Patel",
      "D. S. Pedreros",
      "W. Peng",
      "W. L. Perry",
      "R. Podviianiuk",
      "M. Potts",
      "S. S. Poudel",
      "A. Pradeep",
      "M. Pyle",
      "W. Rau",
      "R. Ren",
      "T. Reynolds",
      "M. Rios",
      "A. Roberts",
      "A. E. Robinson",
      "L. Rosado Del Rio",
      "J. L. Ryan",
      "T. Saab",
      "D. Sadek",
      "B. Sadoulet",
      "S. P. Sahoo",
      "I. Saikia",
      "S. Salehi",
      "J. Sander",
      "B. Sandoval",
      "A. Sattari",
      "B. Schmidt",
      "R. W. Schnee",
      "B. Serfass",
      "A. E. Sharbaugh",
      "R. S. Shenoy",
      "A. Simchony",
      "P. Sinervo",
      "Z. J. Smith",
      "R. Soni",
      "K. Stifter",
      "J. Street",
      "M. Stukel",
      "H. Sun",
      "E. Tanner",
      "N. Tenpas",
      "D. Toback",
      "A. N. Villano",
      "J. Viol",
      "B. von Krosigk",
      "Y. Wang",
      "O. Wen",
      "Z. Williams",
      "M. J. Wilson",
      "J. Winchell",
      "S. Yellin",
      "B. A. Young",
      "B. Zatschler",
      "S. Zatschler",
      "A. Zaytsev",
      "E. Zhang",
      "L. Zheng",
      "A. Zuniga",
      "M. J. Zurowski"
    ],
    "published": "2025-09-03T18:04:08Z",
    "updated": "2025-09-03T18:04:08Z",
    "categories": [
      "hep-ex",
      "astro-ph.CO",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2509.03429v1",
    "url": "https://arxiv.org/abs/2509.03429v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03429v1.pdf",
    "title": "The properties of resistive MHD modes and unstable spectra in advanced   tokamak regimes",
    "abstract": "Advanced tokamak regimes, featuring extended regions of low magnetic shear, are promising candidates for future fusion reactors but are also more prone to specific kinds of MHD instabilities. The proximity to a rational surface in a very low shear region weakens field line bending stabilisation and amplifies the effects of toroidal coupling between modes, leading to the emergence of long-wavelength resistive infernal modes. These modes can grow collectively as a discrete spectrum, leading to a cascade of different perturbations for single mode numbers $(m, n)$, with subdominant modes showing increasingly oscillatory radial structures. These spectra of fast-growing modes are significant for developing stable scenarios in future reactors, and for the understanding of global reconnection events like sawteeth, motivating a deeper investigation into their fundamental physics. Deriving new analytic solutions, including a generalisation of the ideal interchange dispersion relation to non monotonic $q$ profiles, and extending a modular linear resistive MHD solver, we investigate how resistivity, compressibility, toroidal effects, and shaping influence stability, especially in reversed shear $q$ profiles. It is also shown that common assumptions in numerical calculations prevent the observation of the full variety of modes present in these advanced scenarios.",
    "authors": [
      "M. Coste-Sarguet",
      "J. P. Graves"
    ],
    "published": "2025-09-03T15:59:24Z",
    "updated": "2025-09-03T15:59:24Z",
    "categories": [
      "physics.plasm-ph",
      "math-ph",
      "math.MP"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2503.24168v2",
    "url": "https://arxiv.org/abs/2503.24168v2",
    "pdf_url": "https://arxiv.org/pdf/2503.24168v2.pdf",
    "title": "The Compact Linear e$^+$e$^-$ Collider (CLIC)",
    "abstract": "The Compact Linear Collider (CLIC) is a TeV-scale high-luminosity linear e$^+$e$^-$ collider studied by the international CLIC and CLICdp collaborations. CLIC uses a two-beam acceleration scheme, in which normal-conducting high-gradient 12 GHz accelerating structures are powered via a high-current drive beam. CLIC is foreseen to be built and operated in stages. The initial 380 GeV stage, with a site length of 11 km, optimally combines the exploration of Higgs and top-quark physics, including a top threshold scan near 350 GeV. A higher-energy stage, still using the initial single drive-beam complex, can be optimised for any energy up to 2 TeV. Parameters are presented in detail for a 1.5 TeV stage, with a site length of 29 km. Since the 2018 ESPPU reporting, significant effort was invested in CLIC accelerator optimisation, technology developments and system tests, including collaboration with new-generation light sources and free-electron lasers. CLIC implementation aspects at CERN have covered detailed studies of civil engineering, electrical networks, cooling and ventilation, scheduling, and costing. The CLIC baseline at 380 GeV is now 100 Hz operation, with a luminosity of 4.5$\\times 10^{34}$ cm$^{-2}$s$^{-1}$ and a power consumption of 166 MW. Compared to the 2018 design, this gives three times higher luminosity-per-power. The new baseline has two beam-delivery systems, allowing for two detectors operating in parallel. The cost estimate of the 380 GeV baseline is approximately 7.2 billion CHF. The construction of the first CLIC energy stage could start as early as ~2034/35 with first beams following a decade later. This report summarises the CLIC project, its implementation and running scenarios, with emphasis on new developments and recent progress. It concludes with an update on the CLIC detector studies and on the physics potential in light of the improved accelerator performance.",
    "authors": [
      "Erik Adli",
      "Gerardo D'Auria",
      "Nuria Catalan Lasheras",
      "Vera Cilento",
      "Roberto Corsini",
      "Dominik Dannheim",
      "Steffen Doebert",
      "Mick Draper",
      "Angeles Faus-Golfe",
      "Edward Fraser Mactavish",
      "Alexej Grudiev",
      "Andrea Latina",
      "Lucie Linssen",
      "John Andrew Osborne",
      "Yannis Papaphilippou",
      "Philipp Roloff",
      "Aidan Robson",
      "Carlo Rossi",
      "Andre Sailer",
      "Daniel Schulte",
      "Eva Sicking",
      "Steinar Stapnes",
      "Igor Syratchev",
      "Rogelio Tomas Garcia",
      "Walter Wuensch"
    ],
    "published": "2025-03-31T14:48:58Z",
    "updated": "2025-09-03T15:14:02Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.03349v1",
    "url": "https://arxiv.org/abs/2509.03349v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03349v1.pdf",
    "title": "Low-coherence interferometry with undetected mid-infrared photons in the   high-gain regime",
    "abstract": "We develop a high-parametric-gain SU(1,1) interferometer based on an aperiodically poled Potassium Titanyl Phosphate (apKTP) crystal, enabling frequency-domain low-coherence interferometry with undetected mid-infrared photons. The system achieves a signal-to-noise ratio as high as 40 dB and axial resolution of 30 $\\mu$m, with a 3 $\\mu$m-centered idler beam. By increasing the poling-period range, we also improve the axial resolution to 17 $\\mu$m, demonstrating a straightforward route to enhance the performance by working on the crystal design",
    "authors": [
      "Giovanni Zotti",
      "Dmitri B. Horoshko",
      "Mikhail I. Kolobov",
      "Yoad Michael",
      "Ziv Gefen",
      "Maria V. Chekhova",
      "Kazuki Hashimoto"
    ],
    "published": "2025-09-03T14:34:59Z",
    "updated": "2025-09-03T14:34:59Z",
    "categories": [
      "physics.optics",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2509.03326v1",
    "url": "https://arxiv.org/abs/2509.03326v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03326v1.pdf",
    "title": "Numerical Modeling of Galactic Cosmic Ray Modulation in the Heliosphere",
    "abstract": "Numerical modeling of galactic cosmic rays (GCRs) penetration through the heliosphere to the vicinity of the Sun is considered. Galactic cosmic rays are charged particles with energies exceeding 10 MeV/nucl., originating from far beyond the boundaries of our Solar System. As they penetrate through the heliosphere - the region of space filled by the solar wind - they interact strongly with the interplanetary magnetic field. In this paper, we present numerical approaches to solving the so-called Parker transport equation for the isotropic velocity distribution function of GCRs. This equation includes a convective term, anisotropic diffusion, adiabatic cooling, and drifts. Additionally, the diffusion coefficient is spatially and energy-dependent, varying by several orders of magnitude. Our numerical approaches are based on the finite-difference method (Crank-Nicolson scheme) and the stochastic differential equations (SDE) method. The numerical methods were validated against a known analytical solution under simplified conditions. For the general problem formulation, which involves anisotropic diffusion and the Parker spiral interplanetary magnetic field configuration, we used the most efficient and flexible SDE method and compared the numerical results with the data from the works of Kota & Jokipii (1983) and Burger (2012). Special attention was devoted to incorporating drift along the heliospheric current sheet in the model.",
    "authors": [
      "D. A. Shestakov",
      "V. V. Izmodenov"
    ],
    "published": "2025-09-03T14:02:09Z",
    "updated": "2025-09-03T14:02:09Z",
    "categories": [
      "astro-ph.HE",
      "astro-ph.IM",
      "astro-ph.SR",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2504.16177v3",
    "url": "https://arxiv.org/abs/2504.16177v3",
    "pdf_url": "https://arxiv.org/pdf/2504.16177v3.pdf",
    "title": "Turbulent heating in collisionless low-beta plasmas: imbalance, Landau   damping, and electron-ion energy partition",
    "abstract": "An understanding of how turbulent energy is partitioned between ions and electrons in weakly collisional plasmas is crucial for modelling many astrophysical systems. Using theory and simulations of a four-dimensional reduced model of low-beta gyrokinetics (the `Kinetic Reduced Electron Heating Model'), we investigate the dependence of collisionless heating processes on plasma beta and imbalance (normalised cross-helicity). These parameters are important because they control the helicity barrier, the formation of which divides the parameter space into two distinct regimes with remarkably different properties. In the first, at lower beta and/or imbalance, the absence of a helicity barrier allows the cascade of injected power to proceed to small (perpendicular) scales, but its slow cascade rate makes it susceptible to significant electron Landau damping, in some cases leading to a marked steepening of the magnetic spectra on scales above the ion Larmor radius. In the second, at higher beta and/or imbalance, the helicity barrier halts the cascade, confining electron Landau damping to scales above the steep `transition-range' spectral break, resulting in dominant ion heating. We formulate quantitative models of these processes that compare well to simulations in each regime, and combine them with results of previous studies to construct a simple formula for the electron-ion heating ratio as a function of beta and imbalance. This model predicts a `winner takes all' picture of low-beta plasma heating, where a small change in the fluctuations' properties at large scales (the imbalance) can cause a sudden switch between electron and ion heating.",
    "authors": [
      "T. Adkins",
      "R. Meyrand",
      "J. Squire"
    ],
    "published": "2025-04-22T18:06:20Z",
    "updated": "2025-09-03T13:12:58Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.3847/1538-4357/ade9b0"
  },
  {
    "arxiv_id": "2509.04521v1",
    "url": "https://arxiv.org/abs/2509.04521v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04521v1.pdf",
    "title": "Self-heating in SIS Mixers: Experimental Evidence and Theoretical   Modeling",
    "abstract": "This work investigates the relationship between self-heating and the characteristic features observed in the current-voltage characteristics (IVCs) of superconductor-insulator-superconductor (SIS) junctions. Finite-element analysis is employed to evaluate the steady-state temperature distribution around SIS junctions, explicitly accounting for the temperature dependence of the thermal conductivities of the constituent materials. This approach enables flexible estimation of self-heating under various practical conditions, such as different substrate materials, interfacial thermal resistances, and geometric layouts. A heating coefficient is extracted from the simulations and used as an input parameter for IVC modeling. Incorporating self-heating through temperature-dependent gap energy and quasiparticle broadening, the simulated IVCs reproduce bending features near the energy gap that agree with measured characteristics. Furthermore, when a weak link is present near an SIS junction, its critical current can be significantly reduced by junction heating, producing unexpected bends at the linear branch of measured IVCs. Conversely, such bends may serve as indicators that the junction temperature approaches the superconducting transition temperature.",
    "authors": [
      "Wenlei Shan",
      "Shohei Ezaki"
    ],
    "published": "2025-09-03T12:30:31Z",
    "updated": "2025-09-03T12:30:31Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.supr-con"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.03264v1",
    "url": "https://arxiv.org/abs/2509.03264v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03264v1.pdf",
    "title": "Universal Analytic Solution for the Quantum Transport of Structured   Matter-Waves in Magnetic Optics",
    "abstract": "We present a closed-form analytic solution for the propagation of an arbitrary charged scalar state in a non-uniform magnetic field. The dynamics are governed by classical beam optics parameters (Courant-Snyder parameters), the Twiss functions, and phase advance, revealing a direct map between quantum evolution and its classical counterpart. The solution decomposes into three components, exhibiting a complex rotation dependent on the sign of the orbital angular momentum (OAM) projection, alongside an intrinsic distortion from interference governed by a generalized Gouy phase. For a relevant Glaser-type magnetic field and a half-blocked twisted electron, we demonstrate that asymmetry triggers rich dynamics incompatible with a simple Bohmian trajectory interpretation. Our fully relativistic framework provides a powerful tool for predicting beam behavior in particle accelerators and electron microscopes, critical for designing next-generation OAM-based experiments.",
    "authors": [
      "N. V. Filina",
      "S. S. Baturin"
    ],
    "published": "2025-09-03T12:29:08Z",
    "updated": "2025-09-03T12:29:08Z",
    "categories": [
      "quant-ph",
      "physics.acc-ph"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2509.03229v1",
    "url": "https://arxiv.org/abs/2509.03229v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03229v1.pdf",
    "title": "Wakefield acceleration of self-injected bunch in a conical plasma   channels",
    "abstract": "Laser wakefield acceleration is a widely studied method for accelerating charged particle bunches, with selfinjection being a key feature. However, as the bunch accelerates beyond the driver velocity, it shifts out of the maximal accelerating wakefield phase. This work proposes using a tapering cone channel to address this issue. The gradual narrowing synchronizes the bunch with the wake phase by reducing the bubble size, keeping the bunch in the accelerating phase. The obtained dependencies of the bunch length, field Ez, and mean longitudinal momentum pz on the channel radius are useful for further researches.",
    "authors": [
      "D. S. Bondar",
      "W. Leemans",
      "V. I. Maslov",
      "I. N. Onishchenko"
    ],
    "published": "2025-09-03T11:40:10Z",
    "updated": "2025-09-03T11:40:10Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph",
      "65Z05",
      "F.2.1"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.03225v1",
    "url": "https://arxiv.org/abs/2509.03225v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03225v1.pdf",
    "title": "Plasma lens for the focusing of positron bunches",
    "abstract": "The development of effective focusing schemes for positron bunches in plasma accelerators remains a significant challenge, as nonlinear regimes fail to create stable focusing channels for positrons. This work presents a method for focusing and improving the quality of positron bunches using a plasma lens operating in the linear regime. Through numerical simulations, we investigate two distinct focused positron bunch profiles: a purely Gaussian bunch and an elongated, flat-top bunch with Gaussian rising and falling edges. For both configurations, the results demonstrate the capability to achieve high-quality transverse focusing. Furthermore, beyond focusing, the proposed system enables potential possibility to reduce energy spread of positron bunches of the sequence after precursor.",
    "authors": [
      "D. S. Bondar",
      "C. A. Lindstrøm",
      "V. I. Maslov",
      "I. N. Onishchenko"
    ],
    "published": "2025-09-03T11:28:01Z",
    "updated": "2025-09-03T11:28:01Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph",
      "65Z05",
      "F.2.1"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2502.07338v2",
    "url": "https://arxiv.org/abs/2502.07338v2",
    "pdf_url": "https://arxiv.org/pdf/2502.07338v2.pdf",
    "title": "Ultrafast 4D scanning transmission electron microscopy for imaging of   localized optical fields",
    "abstract": "Ultrafast electron microscopy aims for imaging transient phenomena occurring on nanoscale. One of its goals is to visualize localized optical and plasmonic modes generated by coherent excitation in the vicinity of various types of nanostructures. Such imaging capability was enabled by photoninduced near-field optical microscopy, which is based on spectral filtering of electrons inelastically scattered due to the stimulated interaction with the nearfield. Here, we report on the development of ultrafast four-dimensional (4D) scanning transmission electron microscopy, which allows us to image the transverse components of the optical near-field while avoiding the need of electron spectral filtering. We demonstrate that this method is capable of imaging the integrated Lorentz force generated by optical near-fields of a tungsten nanotip and the ponderomotive potential of an optical standing wave with a spatial resolution of 21 nm.",
    "authors": [
      "Petr Koutenský",
      "Neli Laštovičková Streshkova",
      "Kamila Moriová",
      "Marius Constantin Chirita Mihaila",
      "Alexandr Knápek",
      "Daniel Burda",
      "Martin Kozák"
    ],
    "published": "2025-02-11T08:01:02Z",
    "updated": "2025-09-03T10:47:15Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics",
    "doi": "10.1021/acsphotonics.5c00864"
  },
  {
    "arxiv_id": "2509.03559v1",
    "url": "https://arxiv.org/abs/2509.03559v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03559v1.pdf",
    "title": "Particle background characterization and prediction for the NUCLEUS   reactor CE$ν$NS experiment",
    "abstract": "NUCLEUS is a cryogenic detection experiment which aims to measure Coherent Elastic Neutrino-Nucleus Scattering (CE$\\nu$NS) and to search for new physics at the Chooz nuclear power plant in France. This article reports on the prediction of particle-induced backgrounds, especially focusing on the sub-keV energy range, which is a poorly known region where most of the CE$\\nu$NS signal from reactor antineutrinos is expected. Together with measurements of the environmental background radiations at the experimental site, extensive Monte Carlo simulations based on the Geant4 package were run both to optimize the experimental setup for background reduction and to estimate the residual rates arising from different contributions such as cosmic ray-induced radiations, environmental gammas and material radioactivity. The NUCLEUS experimental setup is predicted to achieve a total rejection power of more than two orders of magnitude, leaving a residual background component which is strongly dominated by cosmic ray-induced neutrons. In the CE$\\nu$NS signal region of interest between 10 and 100 eV, a total particle background rate of $\\sim$ 250 d$^{-1}$kg$^{-1}$keV$^{-1}$ is expected in the CaWO$_4$ target detectors. This corresponds to a signal-to-background ratio $\\gtrsim$ 1, and therefore meets the required specifications in terms of particle background rejection for the detection of reactor antineutrinos through CE$\\nu$NS.",
    "authors": [
      "H. Abele",
      "G. Anglogher",
      "B. Arnold",
      "M. Atzori Corona",
      "A. Bento",
      "E. Bossio",
      "F. Buchsteiner",
      "J. Burkhart",
      "F. Cappella",
      "M. Cappelli",
      "N. Casali",
      "R. Cerulli",
      "A. Cruciani",
      "G. Del Castello",
      "M. del Gallo Roccagiovine",
      "S. Dorer",
      "A. Erhart",
      "M. Friedl",
      "S. Fichtinger",
      "V. M. Ghete",
      "M. Giammei",
      "C. Goupy",
      "D. Hauff",
      "F. Jeanneau",
      "E. Jericha",
      "M. Kaznacheeva",
      "H. Kluck",
      "A. Langenkämper",
      "T. Lasserre",
      "D. Lhuillier",
      "M. Mancuso",
      "R. Martin",
      "B. Mauri",
      "A. Mazzolari",
      "L. McCallin",
      "H. Neyrial",
      "C. Nones",
      "L. Oberauer",
      "T. Ortmann",
      "L. Peters",
      "F. Petricca",
      "W. Potzel",
      "F. Pröbst",
      "F. Pucci",
      "F. Reindl",
      "M. Romagnoni",
      "J. Rothe",
      "N. Schermer",
      "J. Schieck",
      "S. Schönert",
      "C. Schwertner",
      "L. Scola",
      "G. Soum-Sidikov",
      "L. Stodolsky",
      "R. Strauss",
      "R. Thalmeier",
      "C. Tomei",
      "M. Vignati",
      "M. Vivier",
      "A. Wex"
    ],
    "published": "2025-09-03T09:49:17Z",
    "updated": "2025-09-03T09:49:17Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.03149v1",
    "url": "https://arxiv.org/abs/2509.03149v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03149v1.pdf",
    "title": "Extended temporal coarse-graining in a stratified and confined plasma   under thermal fluctuations",
    "abstract": "We present an extended investigation of a recently introduced model of gravitationally confined, collisionless plasma (Barbieri et al. 2024a), which showed that rapid temperature fluctuations at the base of the plasma, occurring on timescales much shorter than the electron crossing time, can drive the system into a non-thermal state characterized by anti-correlated temperature and density profiles, commonly referred to as temperature inversion. To describe this phenomenon, a temporal coarse-graining formalism was developed (Barbieri et al. 2024b). In this work, we generalize that approach to cover regimes where the timescales of temperature fluctuations are comparable to or exceed the electron crossing time. We derive a set of kinetic equations that incorporate an additional term arising from the coarse-graining procedure, which was not present in the earlier formulation. Through numerical simulations, we analyze the plasma dynamics under these broader conditions, showing that the electric field influences the system when fluctuation timescales approach the electron crossing time. However, for timescales much larger than the proton crossing time, the electric field becomes negligible. The observed behaviours are interpreted within the framework of the extended temporal coarse-graining theory, and we identify the regimes and conditions in which temperature inversion persists.",
    "authors": [
      "Luca Barbieri",
      "Simone Landi",
      "Lapo Casetti",
      "Andrea Verdini"
    ],
    "published": "2025-09-03T09:02:33Z",
    "updated": "2025-09-03T09:02:33Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.03142v1",
    "url": "https://arxiv.org/abs/2509.03142v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03142v1.pdf",
    "title": "Self-consistent generation of the ambipolar electric field in   collisionless plasmas via multi-mode electrostatics",
    "abstract": "In this work, we investigate the generation of the ambipolar electric field in a gravitationally stratified, collisionless plasma atmosphere. In such environments, gravity tends to separate charged species. To prevent separation an electric field, classically described by the Pannekoek-Rosseland expression, is usually imposed externally. Here, we propose a self-consistent method to recover this field based on a multi-mode Fourier expansion of the electrostatic interaction. We show that, under suitable conditions, this approach naturally leads to the ambipolar electric field and restores charge neutrality. The method is tested in both isothermal and multi-temperature plasma configurations. This framework provides a foundation for future developments that may include collisions, ionization, and asymmetric boundary conditions to model more realistic stellar atmospheres.",
    "authors": [
      "Luca Barbieri"
    ],
    "published": "2025-09-03T08:52:48Z",
    "updated": "2025-09-03T08:52:48Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.03137v1",
    "url": "https://arxiv.org/abs/2509.03137v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03137v1.pdf",
    "title": "A Neural Network Approach to Multi-radionuclide TDCR Beta Spectroscopy",
    "abstract": "Liquid scintillation triple-to-doubly coincident ratio (TDCR) spectroscopy is widely adopted as a standard method for radionuclide quantification because of its inherent advantages such as high precision, self-calibrating capability, and independence from radioactive reference sources. However, multiradionuclide analysis via TDCR faces the challenges of limited automation and reliance on mixture-specific standards, which may not be easily available. Here, we present an Artificial Intelligence (AI) framework that combines numerical spectral simulation and deep learning for standard-free automated analysis. $\\beta$ spectra for model training were generated using Geant4 simulations coupled with statistically modeled detector response sampling. A tailored neural network architecture, trained on this dataset covering various nuclei mix ratio and quenching scenarios, enables autonomous resolution of individual radionuclide activities and detecting efficiency through end-to-end learning paradigms. The model delivers consistent high accuracy across tasks: activity proportions (mean absolute error = 0.009), detection efficiencies (mean absolute error = 0.002), and spectral reconstruction (Structural Similarity Index = 0.9998), validating its physical plausibility for quenched $\\beta$ spectroscopy. This AI-driven methodology exhibits significant potential for automated safety-compliant multiradionuclide analysis with robust generalization, real-time processing capabilities, and engineering feasibility, particularly in scenarios where reference materials are unavailable or rapid field analysis is required.",
    "authors": [
      "Li Yi",
      "Qian Yang"
    ],
    "published": "2025-09-03T08:40:02Z",
    "updated": "2025-09-03T08:40:02Z",
    "categories": [
      "cs.LG",
      "cs.AI",
      "nucl-ex",
      "physics.comp-ph",
      "physics.ins-det"
    ],
    "primary_category": "cs.LG"
  },
  {
    "arxiv_id": "2509.03097v1",
    "url": "https://arxiv.org/abs/2509.03097v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03097v1.pdf",
    "title": "Steels and Stainless Steels",
    "abstract": "Steels, and in particular stainless steels, play a crucial role in the construction of large particle accelerators and high-energy physics experiments, of fusion reactors and their superconducting magnet structures. Such projects face severe material challenges, as they require a wide application of tightly specified steel products and grades, featuring a controlled microstructure and adequate mechanical, physical, magnetic and vacuum properties over a wide temperature range. A broad spectrum of relevant examples is presented, issued from the experience maturated within decades of building of large vacuum, cryogenic and associated structural systems that must guarantee a reliable, long-lasting service with limited interventions. The requirements, and in turn the metallurgical processes applied to achieve the final stringent properties are discussed - dictated by mechanical, magnetic or vacuum compatibility constraints and often by a combination of them. Case studies are developed. The study of a few major failure analysis cases and their root causes is also addressed.",
    "authors": [
      "Stefano Sgobba"
    ],
    "published": "2025-09-03T07:53:49Z",
    "updated": "2025-09-03T07:53:49Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  }
]