{
  "arxiv_id": "2507.17425v2",
  "url": "https://arxiv.org/abs/2507.17425v2",
  "pdf_url": "https://arxiv.org/pdf/2507.17425v2.pdf",
  "title": "Readout electronics for low occupancy High-Pressure Gas TPCs",
  "abstract": "HPgTPCs have benefits such as low energy threshold, magnetisability, and 4$\\pi$ acceptance, making them ideal for neutrino experiments such as DUNE. We present the design of an FPGA-based solution optimised for ND-GAr, which is part of the Phase-II more capable near detector for DUNE. These electronics reduce the cost significantly compared to using collider readout electronics which are typically designed for much higher occupancy and therefore, for example, need much larger numbers of FPGAs and power per channel. We demonstrate the performance of our electronics with the TOAD at Fermilab in the US at a range of pressures and gas mixtures up to 4.5barA, reading out ~10000 channels from a multi-wire proportional chamber. The operation took place between April and July of 2024. We measure the noise characteristics of the system to be sufficiently low and we identify sources of noise that can be further mitigated in the next iteration. We also note that the cooling scheme used in the test requires improvement before full-scale deployment. Despite these necessary improvements, we show that the system can fulfil the needs of a HPgTPC for a fraction of the price of collider readout electronics.",
  "authors": [
    "N. Khan",
    "Y. Hua",
    "I. Xiotidis",
    "T. Alves",
    "E. Atkin",
    "G. Barker",
    "D. Barrow",
    "A. Booth",
    "J. Borg",
    "A. Bross",
    "M. F. Cicala",
    "L. Cremonesi",
    "A. Deisting",
    "K. Duffy",
    "R. Gran",
    "P. Green",
    "A. Habig",
    "M. Judah",
    "T. Junk",
    "A. Kaboth",
    "A. Klustová",
    "H. LeMoine",
    "A. D. Marino",
    "F. Martínez López",
    "T. Mohayai",
    "D. Naples",
    "R. Nichol",
    "D. Parker",
    "M. Pfaff",
    "J. Raaf",
    "P. Rubinov",
    "P. Singh",
    "A. Srivastava",
    "A. Waldron",
    "L. Warsame",
    "M. Wascko",
    "A. Wilkinson",
    "A. Ritchie-Yates",
    "P. Dunne"
  ],
  "published": "2025-07-23T11:32:28Z",
  "updated": "2025-10-21T12:25:26Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}