{
  "arxiv_id": "2508.13844v2",
  "url": "https://arxiv.org/abs/2508.13844v2",
  "pdf_url": "https://arxiv.org/pdf/2508.13844v2.pdf",
  "title": "Low-temperature Performance of $\\mathrm{Gd_3(Ga, Al)_5O_{12}}$:Ce   Scintillators",
  "abstract": "The last years have seen the first cryogenic detectors to be proposed for usage on balloon-borne missions. In such missions, the instrument will be exposed to the high radiation environment of the upper atmosphere. This radiation can induce a significant background to the measurements, something which can be mitigated through the use of an anti-coincidence shield. For hard X-ray and gamma-ray detectors such a shield typically consists photomultiplier tubes or, more recently, silicon photomultipliers coupled to scintillators placed around the detector. When using cryogenic detectors, the shield can be placed around the entire cryostat which will make it large, heavy and expensive. For the ASCENT (A SuperConducting ENergetic x-ray Telescope) mission, which uses Transition Edge Detectors, it was therefore considered to instead place the shield inside. This comes with the challenge of operating it at cryogenic temperatures. For this purpose, we tested the performance of 2 different types of GAGG:Ce scintillators down to 15 mK for the first time. Although significant variations of both the decay time and the light yield were found when varying the temperature, at 4 K its performance was found to be similar to that at room temperature. Furthermore, unexpected behavior around 2 K was found for both types of GAGG:Ce, leading to more in depth studies around these temperatures. Overall, the studies show that the combination of materials will allow to produce a functional anti-coincidence shield at several Kelvin.",
  "authors": [
    "Merlin Kole",
    "Kasun Wimalasena",
    "Richard Gorby",
    "Torsten Diesel",
    "Zachary Greenberg",
    "Fabian Kislat"
  ],
  "published": "2025-08-19T14:07:03Z",
  "updated": "2025-10-22T08:32:37Z",
  "categories": [
    "physics.ins-det",
    "astro-ph.IM"
  ],
  "primary_category": "physics.ins-det"
}