{
  "arxiv_id": "2509.09487v2",
  "url": "https://arxiv.org/abs/2509.09487v2",
  "pdf_url": "https://arxiv.org/pdf/2509.09487v2.pdf",
  "title": "Vorticity Packing Effects on Long Time Turbulent Transport in Decaying   Two-Dimensional Incompressible Navier-Stokes Fluids",
  "abstract": "Recent high-resolution, high-Reynolds-number simulations have shown that the initial total circulation, quantified by the vorticity packing fraction (VPF), strongly influences the late-time Eulerian statistical equilibria of decaying incom- pressible two-dimensional Navier-Stokes turbulence (Biswas et al., 2022, Physics of Fluids 34, 065101), revealing a transition from point-vortex--dominated to finite-size (patch-vortex) equilibria with increasing vortex packing, and emphasizing the role of of the classical exclusion principle (i.e., incompressibility) and total circulation in determining the final statistical states. The present study examines how the associated Lagrangian tracer transport evolves with VPF across the early (linear-nonlinear turbulence onset), intermediate (turbulence development), and late (coherent dipole evolution) stages, and how it correlates with the corresponding Eulerian states. Turbulence, triggered by the Kelvin-Helmholtz instability and sustained by inverse energy cascades, forms large-scale coherent vortices that govern long-time transport. Tracer dynamics, analyzed via mean-square displacement and position-velocity probability distri- bution functions (PDFs), reveal that increasing VPF accelerates turbulence onset, drives a transition from sub- to super- diffusive transport with decreasing anisotropy in the intermediate stage, and determines late-time behavior dominated by either orbital coherent vortex trapping (sub-diffusive) or linear translational dipole motion (super-diffusive). These dis- tinct long-time transport characteristics, evolving from sub- to super-diffusive behavior with increasing vorticity pack- ing, demonstrate a strong correspondence between the transition from point-vortex- to finite-size-vortex-dominated Eulerian equilibria and the underlying Lagrangian transport in decaying incompressible 2D Navier-Stokes turbulence.",
  "authors": [
    "Snehanshu Maiti",
    "Shishir Biswas",
    "Rajaraman Ganesh"
  ],
  "published": "2025-09-11T14:21:41Z",
  "updated": "2025-11-07T16:23:21Z",
  "categories": [
    "physics.flu-dyn",
    "nlin.CD",
    "physics.comp-ph",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.flu-dyn"
}