{
  "arxiv_id": "2509.05948v2",
  "url": "https://arxiv.org/abs/2509.05948v2",
  "pdf_url": "https://arxiv.org/pdf/2509.05948v2.pdf",
  "title": "Upgrades of the ATLAS Zero Degree Calorimeter System for Run 3 at the   Large Hadron Collider",
  "abstract": "Experimental studies of ultra-relativistic heavy ion collisions at the Large Hadron Collider (LHC) depend crucially on Zero Degree Calorimeters (ZDCs) that measure neutrons produced at near-beam rapidity in nucleus-nucleus collisions. In hadronic nuclear collisions these neutrons are mainly spectator neutrons, those that do not scatter from opposing nucleons during the collision. As a result, the ZDCs provide a vital probe of heavy ion collision geometry. The ZDCs are also essential in the study of ultra-peripheral collisions that are initiated by photons associated with the electric fields of one or both nuclei. Coherent photon emission typically leaves the photon emitter intact, making the observation of no ZDC signal, on one or both sides, a tag of such processes. The ATLAS ZDCs, built prior to Run 1 were substantially upgraded for LHC Run 3. The primary upgrades included replacement of the quartz Cherenkov radiator with $\\text{H}_2$-doped fused silica rods; installation of fast air-core signal cables between the ZDC and the ATLAS USA15 cavern; new LED-based calibration system; and new electronics implemented for readout and fully-digital triggering. The ZDCs were also augmented with new \"Reaction Plane Detectors\" (RPDs) designed to measure the transverse centroid of multi-neutron showers to allow event-by-event reconstruction of the directed-flow plane in nuclear collisions. The Run~3 ZDC detectors, including the RPDs, are described in detail with emphasis on aspects that are new for Run~3.",
  "authors": [
    "Giulio Avoni",
    "Marco Bruschi",
    "Gianluca Canale",
    "Zvi Citron",
    "Brian Cole",
    "Eitan Dahle",
    "Bartosz Dziedzic",
    "Bar Glik",
    "Matthias Grosse-Perdekamp",
    "Yhan Guo",
    "Krzysztof Korcy",
    "Matthew Hoppesch",
    "Mason Housenga",
    "Chad Lantz",
    "Yi Liu",
    "Riccardo Longo",
    "Samantha Lund",
    "Daniel MacLean",
    "Stefano Meneghini",
    "Marco Milovanovic",
    "Goran Mladenovic",
    "Soumya Mohapatra",
    "Farah Mohammed Rafee",
    "Yftach Moyal",
    "Carla Sbarra",
    "Antonio Sbrizzi",
    "Blair Seidlitz",
    "Shir Shenkar",
    "Peter Steinberg",
    "Lion Sudit",
    "Daniel Valuch",
    "Kristopher Young"
  ],
  "published": "2025-09-07T06:59:03Z",
  "updated": "2025-11-06T08:20:55Z",
  "categories": [
    "physics.ins-det",
    "hep-ex",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det"
}