{
  "arxiv_id": "2510.01834v2",
  "url": "https://arxiv.org/abs/2510.01834v2",
  "pdf_url": "https://arxiv.org/pdf/2510.01834v2.pdf",
  "title": "BabyMOSS stitched sensors: results of characterisation tests for ALICE   ITS3 upgrade",
  "abstract": "During the Long Shutdown 3 (LS3, scheduled 2026-2030), the innermost 3 layers (Inner Barrel, or IB) of the present ALICE ITS2 will be replaced with large-area, flexible, stitched CMOS 65 nm sensors, arranged in 2 half-barrels of 3 half-layers each, in the framework of the ITS3 upgrade project. For the first time in a High Energy Physics experiment, such large-scale sensors will be bent into truly half-cylindrical shaped half-layers, requiring little mechanical support. This will also help lower the material budget: a reduction down to an average of 0.09% X$_{0}$ per layer is expected, benefitting ITS tracking and vertexing capabilities especially at low momenta.   In the wafer yield and stitching assessment stage for ITS3 R&D, test devices from the Engineering Run 1 (ER1) submission were developed, including the MOnolithic Stiched Sensors (MOSS) and smaller variants of them (babyMOSS). In particular, babyMOSS is a single Repeated Sensor Unit (RSU) of a MOSS device: the chip is $\\sim14\\times30$ mm$^{2}$ in size, and consists of 8 digitally read out pixel matrices (regions) arranged in 2 rows, i.e. half-units (HUs).   BabyMOSS chip characterisation tests have been performed in laboratory and test beam environments. Laboratory tests include systematic functional scans to study the behaviour of front-end electronics over a range of different settings, whereas test beam measurements, under high-energy charged particle beams, were used to investigate the detection efficiency and spatial resolution.   In this contribution, we will present the babyMOSS chip characterisation campaign, with a focus on recent test beam results. So far, babyMOSS test beam results have been consistent with full MOSS, and confirmed that babyMOSS devices meet the ITS3 requirements: a detection efficiency $>99\\%$, fake hit rate $<10^{-6}$ hits per pixel and event, and a spatial resolution $<6$ $\\mu$m.",
  "authors": [
    "Alessandro Sturniolo"
  ],
  "published": "2025-10-02T09:30:11Z",
  "updated": "2025-11-06T20:31:44Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}