{
  "arxiv_id": "2511.05453v1",
  "url": "https://arxiv.org/abs/2511.05453v1",
  "pdf_url": "https://arxiv.org/pdf/2511.05453v1.pdf",
  "title": "Development and Characterization of MPGD-based Transition Radiation   Detectors",
  "abstract": "Transition Radiation Detectors (TRDs) are useful for electron identification and hadron suppression in high energy nuclear and particle physics experiments. Conventional wire-chamber TRDs face operational limitations due to space charge effects, motivating the replacement of the amplification stage with MicroPattern Gaseous Detectors (MPGDs). In this work, we explore different MPGD technologies - Gas Electron Multiplier (GEM), Micro-Mesh Gaseous Structure (Micromegas), and Resistive Micro-Well (microRWELL) - as alternative TRD amplification stages. We report on the design, construction, and in-beam characterization of three MPGD-based TRD prototypes exposed to 3-20 GeV mixed electron-hadron beams at the Fermilab Test Beam Facility (FTBF) and at the CERN SPS H8 beamline. Each detector consisted of a multi-layered radiator, an approximately 2 cm deep drift region, an MPGD amplification stage optimized for X-ray transition radiation detection in a 90%10% ratio of Xenon and CO2, and a two-dimensional readout. The GEM-based TRD prototype achieved a pion suppression factor of about 8 at 90% electron efficiency at FTBF, while the Micromegas-based prototype - with an added GEM preamplification layer - demonstrated improved gain stability and clear TR photon discrimination at CERN. The microRWELL prototype achieved stable operation but limited gain. Geant4-based studies confirmed the observed trends and highlighted the sensitivity of the TR yield to cathode material and radiator configuration. These studies represent the first in-beam measurements of Micromegas- and microRWELL-based TRDs, along with discussion of the performance capabilities of a triple-GEM-TRD. The results demonstrate the feasibility of MPGDs as scalable, high-rate amplification structures for next-generation TRD applications.",
  "authors": [
    "Lauren Kasper",
    "Alexander Austregesilo",
    "Fernando Barbosa",
    "Cody Dickover",
    "Sergey Furletov",
    "Yulia Furletova",
    "Kondo Gnanvo",
    "Senta Vicki Greene",
    "Lubomir Pentchev",
    "Sourav Tarafdar",
    "Julia Velkovska"
  ],
  "published": "2025-11-07T17:53:45Z",
  "updated": "2025-11-07T17:53:45Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}