{
  "arxiv_id": "2511.04924v1",
  "url": "https://arxiv.org/abs/2511.04924v1",
  "pdf_url": "https://arxiv.org/pdf/2511.04924v1.pdf",
  "title": "Nuclear Ptychoscopy: A Ptychographic Framework for Nuclear Spectroscopy",
  "abstract": "Accessing both amplitude and phase of nuclear response functions is central to fully characterizing light-matter interactions in the X-ray-nuclear regime. Recent work has demonstrated phase retrieval in two-dimensional time- and energy-resolved spectra, establishing the feasibility of phase-sensitive nuclear spectroscopy. Here, we introduce Nuclear Ptychoscopy, a ptychographic framework that adapts algorithms from coherent diffractive imaging to nuclear spectroscopy, enabling reconstruction of the complex response function by exploiting redundancy in two-dimensional spectra. We develop three complementary reconstruction schemes tailored to distinct experimental scenarios: reconstruction with a known analyzer response, blind reconstruction, and reconstruction incorporating partial prior information. In parallel, we develop geometric analysis techniques that elucidate algorithmic behavior and contribute new tools to ptychography. The framework is validated through experimental data and simulations, demonstrating its versatility across diverse nuclear spectroscopy scenarios and bridging nuclear spectroscopy with ptychography. Beyond advancing quantitative nuclear spectroscopy, our framework opens new opportunities for metrology, coherent control, and quantum applications in the X-ray-nuclear regime.",
  "authors": [
    "Ziyang Yuan",
    "Yifei Zhang",
    "Yonggong Teng",
    "Hongxia Wang",
    "Fengjiao Gan",
    "Hao Wu",
    "Xinchao Huang",
    "Tianjun Li",
    "Ziru Ma",
    "Linfan Zhu",
    "Zhiwei Li",
    "Wei Xu",
    "Yujun Zhang",
    "Ryo Masuda",
    "Nobumoto Nagasawa",
    "Yoshitaka Yoda",
    "Jianmin Yuan",
    "Xiangjin Kong",
    "Yu-Gang Ma"
  ],
  "published": "2025-11-07T01:57:55Z",
  "updated": "2025-11-07T01:57:55Z",
  "categories": [
    "physics.ins-det",
    "physics.optics"
  ],
  "primary_category": "physics.ins-det"
}