{
  "arxiv_id": "2511.04801v1",
  "url": "https://arxiv.org/abs/2511.04801v1",
  "pdf_url": "https://arxiv.org/pdf/2511.04801v1.pdf",
  "title": "Impact of the lead factor of neutron irradiation on the magnetic   properties of RPV steels",
  "abstract": "Materials used in nuclear reactors are constantly exposed to the effects of neutron irradiation, which leads to changes in their mechanical properties. In particular, the steels employed in reactor pressure vessels experience a reduction in the ductile-to brittle transition temperature. Given that the pressure vessel is a non-redundant component, understanding this phenomenon is of significant interest. In this work, we focus on studying the effects of accelerated irradiation by maintaining constant neutron fluence while varying neutron flux, which results in different lead factors. This approach enables the extrapolation of accelerated test results to real operational conditions of the reactor pressure vessels. In our study, we analyzed irradiated steels using three magnetic techniques. Each technique responds differently to the microstructural changes induced by irradiation, allowing for a better characterization of its effects on the material. Through DC magnetometry, the analysis of minor loops shows that the remanence, coercivity, and saturation of the steel depend not only on the fluence with which the material was irradiated but also on the irradiation rate, which means, more specifically, on the lead factor. The AC susceptibility technique shows that the response of the irradiated steel to the applied magnetic field increases with fluence but also with the lead factor. For the real part of XAC, there is an increase with the lead factor, while the imaginary component of XAC grows with the size of the nanoprecipitates. Finally, Barkhausen noise measurements show a clear increase in the RMS of the signal with the lead factor.",
  "authors": [
    "Sebastián Passanante",
    "Dafne Goijman",
    "M. R. Neyra Astudillo",
    "Carlos D. Anello",
    "Rodolfo Kempf",
    "Julián Milano",
    "Martín Gómez",
    "Joaquín Sacanell"
  ],
  "published": "2025-11-06T20:42:47Z",
  "updated": "2025-11-06T20:42:47Z",
  "categories": [
    "physics.ins-det",
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "physics.ins-det"
}