{
  "arxiv_id": "2511.04764v1",
  "url": "https://arxiv.org/abs/2511.04764v1",
  "pdf_url": "https://arxiv.org/pdf/2511.04764v1.pdf",
  "title": "Secondary small-scale dynamics of a Rayleigh-Taylor unstable solar   prominence",
  "abstract": "Quiescent solar prominences show distinct small-scale dynamics in observations. Their internal density contrasts with the surrounding corona make them susceptible to Rayleigh-Taylor (RT) instabilities, leading to vertically structured prominence morphologies when observed at the solar limb. As a result, prominences develop bubbles and plumes, along with secondary Kelvin-Helmholtz (KH) roll-ups along their edges. Recent observations also suggest magnetic reconnection events within the RT-driven turbulent flows. We perform high-resolution 2.5D resistive magnetohydrodynamic simulations using the open-source MPI-AMRVAC code, reaching a spatial resolution of $\\sim 11.7$ km in a 2D domain of size 30 Mm$\\times$30 Mm and evolving the system for approximately 10 minutes of solar time. A dense, magnetic pressure supported prominence serves as the initial state, which becomes unstable at the prominence-corona interface. The resulting interaction between RT and KH instabilities leads to the formation of current sheets and localized reconnection events. The reconnection-driven outflows form energetic jets that enhance energy transport and dissipation across the prominence. We analyze our high-resolution prominence simulation using synthetic images of the broadband SDO/AIA 094, 171, and 193 \\r{A} and narrowband H$\\alpha$ filters, to compare the developing fine-scale structures with their observational counterparts. Most secondary instabilities emerge in the hotter coronal regions surrounding the cooler prominence core. While our simulated features match observed scales, speeds, and duration, the simulated activity remains concentrated in hot, surrounding coronal plasma rather then the cool prominence material, implying that key physical ingredients may be missing. Future 3D studies in more realistic magnetic configurations are required to address these limitations.",
  "authors": [
    "Madhurjya Changmai",
    "Jack M. Jenkins",
    "Rony Keppens"
  ],
  "published": "2025-11-06T19:33:07Z",
  "updated": "2025-11-06T19:33:07Z",
  "categories": [
    "astro-ph.SR",
    "physics.flu-dyn",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.SR"
}