{
  "arxiv_id": "2511.05336v1",
  "url": "https://arxiv.org/abs/2511.05336v1",
  "pdf_url": "https://arxiv.org/pdf/2511.05336v1.pdf",
  "title": "$^{42}$Ar Production and Injection to a Liquid Argon Environment for   Background Mitigation Studies",
  "abstract": "Atmosphere-sourced argon contains traces of $^{42}$Ar, whose $\\beta^-$-decaying progeny $^{42}$K represents a significant intrinsic background for rare-event experiments using liquid argon (LAr) as detector or shielding medium. Understanding and mitigating this background is crucial for current and future large-scale detectors in neutrino and dark-matter physics. To enable controlled studies of $^{42}$K behavior and suppression techniques, $^{42}$Ar was produced by irradiating natural argon with 34 MeV $^{7}$Li$^{3+}$ ions at the Maier-Leibnitz-Laboratorium tandem accelerator, using beam currents of $101 \\pm 5$ nA and $140 \\pm 5$ nA, yielding $476 \\pm 9$ Bq within two weeks, corresponding to a production rate of $\\sim 1 \\times 10^{6}$ atoms$\\,$s$^{-1}$. The activated argon was injected into the one-ton SCARF cryostat, where two HPGe detectors monitored the subsequent $^{42}$K activity build-up. A time-dependent model describing $^{42}$Ar mixing and $^{42}$K equilibration in LAr yielded characteristic mixing time constants between one and two days. The established production and injection capability provides a reproducible platform for high-statistics $^{42}$K background studies, essential for developing and validating suppression strategies for next-generation LAr-based rare-event experiments such as LEGEND-1000.",
  "authors": [
    "Mario Schwarz",
    "Christoph Vogl",
    "Niko N. P. N. Lay",
    "Tommaso Comellato",
    "Gunther Korschinek",
    "Moritz Neuberger",
    "Oskar Moras",
    "Patrick Krause",
    "Stefan Schönert"
  ],
  "published": "2025-11-07T15:32:08Z",
  "updated": "2025-11-07T15:32:08Z",
  "categories": [
    "physics.ins-det",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det"
}