{
  "arxiv_id": "2511.05276v1",
  "url": "https://arxiv.org/abs/2511.05276v1",
  "pdf_url": "https://arxiv.org/pdf/2511.05276v1.pdf",
  "title": "Gigagauss magnetic fields generated via theta-pinching driven by   multiple petawatt-class lasers",
  "abstract": "Extremely high axial magnetic fields above the gigagauss (GG) level are supposed to exist in neutron stars, which may be a one of the critical parameters for their internal structures and be responsible for the X and gamma-ray emission from these stars. Here we show that such ultrahigh magnetic fields can be produced by multiple petawatt-class lasers interacting with a cuboid solid target with a cylindrical microtube in the middle. It is found that the obliquely incident intense lasers at the target surfaces enable the produced hot electrons to form an azimuthal current and subsequently induce a seed magnetic field along the cylindrical axis inside the microtube as the hot electrons transport into it. This current-field configuration is similar to a theta-pinch device. When the hot electrons and energetic ions produced via target normal sheath acceleration converge towards the microtube axis, the seed magnetic field is dramatically amplified. This process continues until the magnetic pressure near the axis becomes comparable to the thermal pressure contributed both by hot electrons and energetic ions. Later on, as the plasma in the center start to be expelled outward by the magnetic pressure, an electron current ring with extremely high densities is formed, leading to a further boost of the magnetic fields to well above the GG-level. A scaling of the magnetic field strength with laser intensities, pulse durations, incident angles, and target sizes is presented and verified by numerical simulations, which demonstrates the robustness of our scheme. Our scheme is well suited for experimental realization on 100 terawatt-class to petawatt-class femtosecond or picosecond laser facilities with multiple linearly polarized laser beams.",
  "authors": [
    "Huanyu Song",
    "Zhengming Sheng",
    "Linzheng Wang",
    "Min Chen",
    "Suming Weng",
    "Masakatsu Murakami",
    "Jie Zhang"
  ],
  "published": "2025-11-07T14:38:16Z",
  "updated": "2025-11-07T14:38:16Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}