{
  "arxiv_id": "2501.11698v2",
  "url": "https://arxiv.org/abs/2501.11698v2",
  "pdf_url": "https://arxiv.org/pdf/2501.11698v2.pdf",
  "title": "AstroPix: A Pixelated HVCMOS Sensor for Space-Based Gamma-Ray   Measurement",
  "abstract": "A next-generation medium-energy gamma-ray telescope targeting the MeV range would address open questions in astrophysics regarding how extreme conditions accelerate cosmic-ray particles, produce relativistic jet outflows, and more. One concept, AMEGO-X, relies upon the mission-enabling CMOS Monolithic Active Pixel Sensor silicon chip AstroPix. AstroPix is designed for space-based use, featuring low noise, low power consumption, and high scalability. Desired performance of the device include an energy resolution of 5 keV (or 10% FWHM) at 122 keV and a dynamic range per-pixel of 25-700 keV, enabled by the addition of a high-voltage bias to each pixel which supports a depletion depth of 500 um. This work reports on the status of the AstroPix development process with emphasis on the current version under test, version three (v3), and highlights of version two (v2). Version 3 achieves energy resolution of 10.4 +/- 3.2% at 59.5 keV and 94 +/- 6 um depletion in a low-resistivity test silicon substrate.",
  "authors": [
    "Amanda L. Steinhebel",
    "Regina Caputo",
    "Daniel P. Violette",
    "Anthony Affolder",
    "Autumn Bauman",
    "Carolyn Chinatti",
    "Aware Deshmukh",
    "Vitaliy Fadayev",
    "Yasushi Fukazawa",
    "Manoj Jadhav",
    "Carolyn Kierans",
    "Bobae Kim",
    "Jihee Kim",
    "Henry Klest",
    "Olivia Kroger",
    "Kavic Kumar",
    "Shin Kushima",
    "Jean-Marie Lauenstein",
    "Richard Leys",
    "Forest Martinez-Mckinney",
    "Jessica Metcalfe",
    "Zachary Metzler",
    "John W. Mitchell",
    "Norito Nakano",
    "Jennifer Ott",
    "Ivan Peric",
    "Jeremy S. Perkins",
    "Max R. Rudin",
    "Taylor",
    "Shin",
    "Grant Sommer",
    "Nicolas Striebig",
    "Yusuke Suda",
    "Hiroyasu Tajima",
    "Janeth Valverde",
    "Maria Zurek"
  ],
  "published": "2025-01-20T19:23:56Z",
  "updated": "2025-10-28T16:41:13Z",
  "categories": [
    "astro-ph.IM",
    "physics.ins-det"
  ],
  "primary_category": "astro-ph.IM"
}