{
  "arxiv_id": "2510.25972v1",
  "url": "https://arxiv.org/abs/2510.25972v1",
  "pdf_url": "https://arxiv.org/pdf/2510.25972v1.pdf",
  "title": "A Self-Consistent Model of Kinetic Alfven Solitons in Pulsar Wind   Plasma: Linking Soliton Characteristics to Pulsar Observables",
  "abstract": "We present a self-consistent model for the formation and propagation of kinetic Alfven (KA) solitons in the pulsar wind zone, where a relativistic, magnetized electron positron ion plasma flows along open magnetic field lines beyond the light cylinder. Using a reductive perturbation approach, we derive a Korteweg de Vries (KdV) equation that governs the nonlinear evolution of KA solitons in this environment. The soliton amplitude and width are shown to depend sensitively on key pulsar observables, including spin period, spin-down rate, and pair multiplicity as well as plasma composition and suprathermal particle distributions. Our analysis reveals that soliton structures are strongly influenced by the presence of heavy ions, kappa-distributed pairs, and oblique propagation angles. Heavier ion species such as Fe26+ produce significantly broader solitons due to enhanced inertia and dispersion, while increasing pair multiplicity leads to smaller solitons through stronger screening. Oblique propagation (larger theta) results in wider but lower-amplitude solitons, and more thermalized pair plasmas (higher kappa) support taller and broader structures. A population-level analysis of 1174 pulsars shows a clear positive correlation between soliton width and spin period, with millisecond pulsars hosting the narrowest solitons. By linking soliton dynamics to measurable pulsar parameters, this work provides a framework for interpreting magnetospheric microphysics and its role in shaping pulsar emission signatures.",
  "authors": [
    "Manpreet Singh",
    "Geetika Slathia",
    "N. S. Saini",
    "Siming Liu"
  ],
  "published": "2025-10-29T21:15:53Z",
  "updated": "2025-10-29T21:15:53Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}