{
  "arxiv_id": "2510.06703v4",
  "url": "https://arxiv.org/abs/2510.06703v4",
  "pdf_url": "https://arxiv.org/pdf/2510.06703v4.pdf",
  "title": "Developing a Cost-Effective Spectrometer: A Practical Approach",
  "abstract": "The paper demonstrates the design and execution of a low-cost optical spectrometer that employs a webcam, diffraction grating & Python (a free, open-source programming language). The device's design prioritized economy and usability, with a black box casing to reduce stray light and increase measurement accuracy. A diffraction grating made from a DVD was used to split light into its constituent wavelengths, which were then collected by the camera. The calibration procedure used a RED TIDE USB650 Fiber Optic Spectrometer to set calibration values for various wavelength ranges, which ensured that the spectrometer's results closely matched those derived from the former, a high-cost industry-standard model. Spectrums of several light sources, such as red, green, blue, yellow, white, magenta, orange, and UV LEDs, as well as a green laser, were studied and compared. The results showed a high level of precision, with minimal divergence from industry-standard spectrometer measurements. This comparison was carried out utilizing Origin software, which allowed for extensive analysis and display of the spectrum data. In addition, the spectrometer captured data in real time, allowing users to watch live spectrum changes and ensure instant accessibility of results. Despite its simplicity and low cost, the spectrometer provides significant value for instructional and practical applications, making it a valuable tool in cost-constrained situations.",
  "authors": [
    "Zafrin Jahan Nikita",
    "Mohammad Tahsin Alam",
    "Yasir Mahmud",
    "Rafichha Yasmin",
    "Fairuz Darimi Bushra",
    "Sheikh Hasib Cheragee",
    "Redwanul Talukder Zeem"
  ],
  "published": "2025-10-08T06:58:18Z",
  "updated": "2025-10-30T09:24:25Z",
  "categories": [
    "physics.optics",
    "physics.ins-det"
  ],
  "primary_category": "physics.optics"
}