{
  "arxiv_id": "2510.26665v1",
  "url": "https://arxiv.org/abs/2510.26665v1",
  "pdf_url": "https://arxiv.org/pdf/2510.26665v1.pdf",
  "title": "Quantifying Resolution in Pink Beam Dark Field X-ray Microscopy:   Experiments and Simulations",
  "abstract": "Pink-beam Dark-Field X-ray Microscopy (pDFXM) is a powerful emerging technique for time-resolved studies of microstructure and strain evolution in bulk crystalline materials. In this work, we systematically assess the performance of pDFXM relative to monochromatic DFXM when using a compound refractive lens (CRL) as the objective. Analytical expressions for the spatial and angular resolution are derived and compared with numerical simulations based on geometrical optics and experimental data. The pink-beam configuration provides an increased diffraction intensity depending on the deformation state of the sample, accompanied by a general tenfold degradation in angular resolution along the rocking and longitudinal directions. This trade-off is disadvantageous for axial strain mapping, but can be advantageous in cases where integrated intensities are needed. For a perfect crystal under parallel illumination with a pink beam, our results show that chromatic aberration is absent, whereas under condensed illumination it becomes significant. The aberration is shown to depend strongly on the local distortion of the crystal. Weak-beam imaging conditions, such as those required for resolving dislocations, are shown to remain feasible under pink-beam operation and may even provide an improved signal-to-noise ratio. The higher incident flux, enhanced by nearly two orders of magnitude, is quantified in terms of beam heating effects, and implications for optimized scanning protocols are discussed.",
  "authors": [
    "Michela La Bella",
    "Henning Friis Poulsen",
    "Steffen Staeck",
    "Nils Axel Henningsson",
    "Merve Pinar Kabukcuoglu",
    "Carsten Detlefs",
    "Can Yildirim"
  ],
  "published": "2025-10-30T16:34:59Z",
  "updated": "2025-10-30T16:34:59Z",
  "categories": [
    "physics.optics",
    "physics.ins-det"
  ],
  "primary_category": "physics.optics"
}