{
  "arxiv_id": "2510.24196v2",
  "url": "https://arxiv.org/abs/2510.24196v2",
  "pdf_url": "https://arxiv.org/pdf/2510.24196v2.pdf",
  "title": "Design and characterization of a photosensor system for the RELICS   experiment",
  "abstract": "In this paper, we present the design and characterization of a photosensor system developed for the RELICS experiment. A set of dynamic readout bases was designed to mitigate photomultiplier tube (PMT) saturation caused by intense cosmic muon backgrounds in the surface-level RELICS detector. The system employs dual readout from the anode and the seventh dynode to extend the PMT's linear response range. In particular, our characterization and measurements of Hamamatsu R8520-406 PMTs confirm stable operation under positive high-voltage bias, extending the linear response range by more than an order of magnitude. Furthermore, a model of PMT saturation and recovery was developed to evaluate the influence of cosmic muon signals in the RELICS detector. The results demonstrate the system's capability to detect coherent elastic neutrino-nucleus scattering (CE$\\nu$NS) signals under surface-level cosmic backgrounds, and suggest the potential to extend the scientific reach of RELICS to MeV-scale interactions.",
  "authors": [
    "Jijun Yang",
    "Ruize Li",
    "Chang Cai",
    "Guocai Chen",
    "Jiangyu Chen",
    "Huayu Dai",
    "Rundong Fang",
    "Fei Gao",
    "Jingfan Gu",
    "Xiaoran Guo",
    "Jiheng Guo",
    "Gaojun Jin",
    "Gaojun Ju",
    "Yanzhou Hao",
    "Yang Lei",
    "Kaihang Li",
    "Meng Li",
    "Minhua Li",
    "Shengchao Li",
    "Siyin Li",
    "Tao Li",
    "Qing Lin",
    "Jiajun Liu",
    "Sheng Lv",
    "Guang Luo",
    "Kangwei Ni",
    "Chuanping Shen",
    "Mingzhuo Song",
    "Lijun Tong",
    "Jun Wang",
    "Xiaoyu Wang",
    "Wei Wang",
    "Xiaoping Wang",
    "Zihu Wang",
    "Yuehuan Wei",
    "Liming Weng",
    "Xiang Xiao",
    "Lingfeng Xie",
    "Litao Yang",
    "Long Yang",
    "Jingqiang Ye",
    "Jiachen Yu",
    "Qian Yue",
    "Yuyong Yue",
    "Bingwei Zhang",
    "Yuming Zhang",
    "Yifei Zhao",
    "Chenhui Zhu"
  ],
  "published": "2025-10-28T09:03:00Z",
  "updated": "2025-10-29T13:00:24Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}