[
  {
    "arxiv_id": "2510.26747v1",
    "url": "https://arxiv.org/abs/2510.26747v1",
    "pdf_url": "https://arxiv.org/pdf/2510.26747v1.pdf",
    "title": "Spectral Deconvolution without the Deconvolution: Extracting Temperature   from X-ray Thomson Scattering Spectra without the Source-and-Instrument   Function",
    "abstract": "X-ray Thomson scattering (XRTS) probes the dynamic structure factor of the system, but the measured spectrum is broadened by the combined source-and-instrument function (SIF) of the setup. In order to extract properties such as temperature from an XRTS spectrum, the broadening by the SIF needs to be removed. Recent work [Dornheim et al. Nature Commun. 13, 7911 (2022)] has suggested that the SIF may be deconvolved using the two-sided Laplace transform. However, the extracted information can depend strongly on the shape of the input SIF, and the SIF is in practice challenging to measure accurately. Here, we propose an alternative approach: we demonstrate that considering ratios of Laplace-transformed XRTS spectra collected at different scattering angles is equivalent to performing the deconvolution, but without the need for explicit knowledge of the SIF. From these ratios, it is possible to directly extract the temperature from the scattering spectra, when the system is in thermal equilibrium. We find the method to be generally robust to spectral noise and physical differences between the spectrometers, and we explore situations in which the method breaks down. Furthermore, the fact that consistent temperatures can be extracted for systems in thermal equilibrium indicates that non-equilibrium effects could be identified by inconsistent temperatures of a few eV between the ratios of three or more scattering angles.",
    "authors": [
      "Thomas Gawne",
      "Alina Kononov",
      "Andrew Baczewski",
      "Hannah Bellenbaum",
      "Maximilian P Böhme",
      "Zhandos Moldabekov",
      "Thomas R Preston",
      "Sebastian Schwalbe",
      "Jan Vorberger",
      "Tobias Dornheim"
    ],
    "published": "2025-10-30T17:40:50Z",
    "updated": "2025-10-30T17:40:50Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.26741v1",
    "url": "https://arxiv.org/abs/2510.26741v1",
    "pdf_url": "https://arxiv.org/pdf/2510.26741v1.pdf",
    "title": "Characterization of the H2M Monolithic CMOS Sensor",
    "abstract": "The H2M (Hybrid-to-Monolithic) is a monolithic pixel sensor manufactured in a modified \\SI{65}{\\nano\\meter}~CMOS imaging process with a small collection electrode. Its design addresses the challenges of porting an existing hybrid pixel detector architecture into a monolithic chip, using a digital-on-top design methodology, and developing a compact digital cell library. Each square pixel integrates an analog front-end and digital pulse processing with an 8-bit counter within a \\SI{35}{\\micro\\meter}~pitch.   This contribution presents the performance of H2M based on laboratory and test beam measurements, including a comparison with analog front-end simulations in terms of gain and noise. A particular emphasis is placed on backside thinning in order to reduce material budget, down to a total chip thickness of \\SI{21}{\\micro\\meter} for which no degradation in MIP detection performance is observed. For all investigated samples, a MIP detection efficiency above \\SI{99}{\\%} is achieved below a threshold of approximately 205 electrons. At this threshold, the fake-hit rate corresponds to a matrix occupancy of fewer than one pixel per the \\SI{500}{\\nano\\second}~frame.   Measurements reveal a non-uniform in-pixel response, attributed to the formation of local potential wells in regions with low electric field. A simulation flow combining technology computer-aided design, Monte Carlo, and circuit simulations is used to investigate and describe this behavior, and is applied to develop mitigation strategies for future chip submissions with similar features.",
    "authors": [
      "Rafael Ballabriga",
      "Eric Buschmann",
      "Michael Campbell",
      "Raimon Casanova Mohr",
      "Dominik Dannheim",
      "Jona Dilg",
      "Ana Dorda",
      "Ono Feyens",
      "Finn King",
      "Philipp Gadow",
      "Ingrid-Maria Gregor",
      "Karsten Hansen",
      "Yajun He",
      "Lennart Huth",
      "Iraklis Kremastiotis",
      "Stephan Lachnit",
      "Corentin Lemoine",
      "Stefano Maffessanti",
      "Larissa Mendes",
      "Younes Otarid",
      "Christian Reckleben",
      "Sébastien Rettie",
      "Manuel Alejandro del Rio Viera",
      "Sara Ruiz Daza",
      "Judith Schlaadt",
      "Adriana Simancas",
      "Walter Snoeys",
      "Simon Spannagel",
      "Tomas Vanat",
      "Anastasiia Velyka",
      "Gianpiero Vignola",
      "Håkan Wennlöf"
    ],
    "published": "2025-10-30T17:38:03Z",
    "updated": "2025-10-30T17:38:03Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.26665v1",
    "url": "https://arxiv.org/abs/2510.26665v1",
    "pdf_url": "https://arxiv.org/pdf/2510.26665v1.pdf",
    "title": "Quantifying Resolution in Pink Beam Dark Field X-ray Microscopy:   Experiments and Simulations",
    "abstract": "Pink-beam Dark-Field X-ray Microscopy (pDFXM) is a powerful emerging technique for time-resolved studies of microstructure and strain evolution in bulk crystalline materials. In this work, we systematically assess the performance of pDFXM relative to monochromatic DFXM when using a compound refractive lens (CRL) as the objective. Analytical expressions for the spatial and angular resolution are derived and compared with numerical simulations based on geometrical optics and experimental data. The pink-beam configuration provides an increased diffraction intensity depending on the deformation state of the sample, accompanied by a general tenfold degradation in angular resolution along the rocking and longitudinal directions. This trade-off is disadvantageous for axial strain mapping, but can be advantageous in cases where integrated intensities are needed. For a perfect crystal under parallel illumination with a pink beam, our results show that chromatic aberration is absent, whereas under condensed illumination it becomes significant. The aberration is shown to depend strongly on the local distortion of the crystal. Weak-beam imaging conditions, such as those required for resolving dislocations, are shown to remain feasible under pink-beam operation and may even provide an improved signal-to-noise ratio. The higher incident flux, enhanced by nearly two orders of magnitude, is quantified in terms of beam heating effects, and implications for optimized scanning protocols are discussed.",
    "authors": [
      "Michela La Bella",
      "Henning Friis Poulsen",
      "Steffen Staeck",
      "Nils Axel Henningsson",
      "Merve Pinar Kabukcuoglu",
      "Carsten Detlefs",
      "Can Yildirim"
    ],
    "published": "2025-10-30T16:34:59Z",
    "updated": "2025-10-30T16:34:59Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2507.15398v2",
    "url": "https://arxiv.org/abs/2507.15398v2",
    "pdf_url": "https://arxiv.org/pdf/2507.15398v2.pdf",
    "title": "Multi-scale optimal control for Einstein Telescope active seismic   isolation",
    "abstract": "We present a multi-scale optimal control framework for active seismic isolation in the Einstein Telescope, a third-generation gravitational-wave observatory. Our approach jointly optimizes feedback and blending filters in a cross-coupled opto-mechanical system using a unified cost function based on the \"acausal optimum,\" which quantifies sensor signal-to-noise ratios across frequencies. This method enables efficient re-optimization under varying sensor configurations and environmental conditions. We apply the framework to two candidate sensing systems using their modeled sensitivity: OmniSens-a six-degree-of-freedom inertial isolation system-and BRS-T360, which combines Beam Rotation Sensor (BRS) as an inertial tilt sensor with T360 as a horizontal seismometer. We demonstrate superior low-frequency isolation with OmniSens, reducing platform motion by up to two orders of magnitude near the microseism. The framework allows for ready optimization and projection of sensor noise to metrics relevant to the performance of the instrument, aiding the design of the Einstein Telescope.",
    "authors": [
      "Pooya Saffarieh",
      "Nathan A. Holland",
      "Michele Valentini",
      "Jesse van Dongen",
      "Alexandra Mitchell",
      "Sander Sijtsma",
      "Armin Numic",
      "Wouter Hakvoort",
      "Conor Mow-Lowry"
    ],
    "published": "2025-07-21T09:00:12Z",
    "updated": "2025-10-30T16:16:24Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.21883v3",
    "url": "https://arxiv.org/abs/2509.21883v3",
    "pdf_url": "https://arxiv.org/pdf/2509.21883v3.pdf",
    "title": "Enhancing Particle Identification in Helium-Based Drift Chambers Using   Cluster Counting Insights from Beam Test Studies",
    "abstract": "Particle identification in gaseous detectors traditionally relies on energy loss measurements (dE/dx); however, uncertainties in total energy deposition limit its resolution. The cluster counting technique (dN/dx) offers an alternative approach by exploiting the Poisson-distributed nature of primary ionization, providing a statistically robust method for mass determination. Simulation studies with Garfield++ and Geant4 indicate that dN/dx can achieve twice the resolution of dE/dx in helium-based drift chambers. However, experimental implementation is challenging due to signal overlap in the time domain, complicating the identification of electron peaks and ionization clusters. This paper presents novel algorithms and modern computational techniques to address these challenges, facilitating accurate cluster recognition in experimental data. The effectiveness of these algorithms is validated through four beam tests conducted at CERN, utilizing various helium gas mixtures, gas gains, and wire orientations relative to ionizing tracks. The experiments employ a muon beam (1 GeV/c to 180 GeV/c) with drift tubes of different sizes and sense wire diameters. The analysis explores the Poisson nature of cluster formation, evaluates the performance of different clustering algorithms, and examines the dependence of counting efficiency on the beam particle impact parameter. Furthermore, a comparative study of the resolution achieved using dN/dx and dE/dx is presented.",
    "authors": [
      "W. Elmetenawee",
      "M. Abbrescia",
      "M. Anwar",
      "G. Chiarello",
      "A. Corvaglia",
      "F. Cuna",
      "B. D'Anzi",
      "N. De Filippis",
      "F. De Santis",
      "M. Dong",
      "E. Gorini",
      "F Grancagnolo",
      "F. G. Gravili",
      "K. Johnson",
      "S. Liu",
      "M. Louka",
      "A. Miccoli",
      "M. Panareo",
      "M. Primavera",
      "F. M. Procacci",
      "A. Taliercio",
      "G. Tassielli",
      "A. Ventura L. Wu",
      "G. Zhao"
    ],
    "published": "2025-09-26T05:15:47Z",
    "updated": "2025-10-30T16:15:24Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.26640v1",
    "url": "https://arxiv.org/abs/2510.26640v1",
    "pdf_url": "https://arxiv.org/pdf/2510.26640v1.pdf",
    "title": "Nonlocal Model for Electron Heat Flux and Self-generated Magnetic Field",
    "abstract": "Coupling of electron heat conduction and magnetic field takes significant effects in inertial confinement fusion (ICF). As the nonlocal models for electron heat conduction have been developed for modeling kinetic effects on heat flux in hydrodynamic scale, modeling kinetic effects on magnetic field are still restricted to flux limiters instead of nonlocal corrections. We propose a new nonlocal model which can recover the kinetic effects for heat conduction and magnetic field in hydrodynamic scale simultaneously. We clarify the necessity of self-consistently considering the electric field corrections in nonlocal models to get reasonable physical quantities. Using the new nonlocal model, the nonlocal corrections of transport coefficients in magnetized plasma and the magnetic field generation without density gradients are systematically studied. We find nonlocal effects significantly change the magnetic field distribution in laser ablation, which potentially influences the hydrodynamic instabilities in ICF.",
    "authors": [
      "Xinyu Zhu",
      "Wenqiang Yuan",
      "Yusen Wang",
      "Zhipeng Zhang",
      "Xianxu Jin",
      "Zhonghai Zhao",
      "Bin Qiao"
    ],
    "published": "2025-10-30T16:08:13Z",
    "updated": "2025-10-30T16:08:13Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2505.10456v2",
    "url": "https://arxiv.org/abs/2505.10456v2",
    "pdf_url": "https://arxiv.org/pdf/2505.10456v2.pdf",
    "title": "Comparison of high-order moment models for the ion dynamics in a bounded   low-temperature plasma",
    "abstract": "Low-temperature plasmas often present non-equilibrium ion distribution functions due to the collisions with the background gas and the presence of strong electric fields. This non-equilibrium is beyond classical fluid models, often requiring computationally-intensive kinetic simulations. In our work, we study high-order moment models in order to capture the non-equilibrium state with a macroscopic set of equations, which is more computationally efficient than kinetic simulations. We compare numerical simulations of different moment closures: Grad's closure, the hyperbolic quadrature method of moments (HyQMOM), the extended quadrature method of moments, and a method based on entropy maximization. We assess the different closures for plasma applications and propose efficient numerical discretizations. The numerical solution of the high-order moment models is compared to kinetic simulations of an argon plasma between two floating walls at different pressure regimes, from nearly collisionless to collisionally-dominated. In general, all the high-order moment closures capture the ion transport with high fidelity as compared to the kinetic simulations, providing an improvement as compared to classical fluid models. Classical fluid closures such as the Fourier law for the heat flux is shown to be not suitable to capture the sheath or the low pressure regime. In addition, the ability of each moment method to reconstruct the velocity distribution function from the moments is assessed. The high-order moment models are able to capture the non-equilibrium distributions in the bulk and sheath with remarkable fidelity, dramatically improving classical fluid models while having comparable computational cost. In particular, the HyQMOM shows to be a robust method that provides an excellent comparison with the kinetic simulations of both the moments and the distribution function in the bulk and the sheath.",
    "authors": [
      "Anatole Berger",
      "Thierry Magin",
      "Anne Bourdon",
      "Alejandro Alvarez Laguna"
    ],
    "published": "2025-05-15T16:12:50Z",
    "updated": "2025-10-30T10:18:23Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1063/5.0281989"
  },
  {
    "arxiv_id": "2510.06703v4",
    "url": "https://arxiv.org/abs/2510.06703v4",
    "pdf_url": "https://arxiv.org/pdf/2510.06703v4.pdf",
    "title": "Developing a Cost-Effective Spectrometer: A Practical Approach",
    "abstract": "The paper demonstrates the design and execution of a low-cost optical spectrometer that employs a webcam, diffraction grating & Python (a free, open-source programming language). The device's design prioritized economy and usability, with a black box casing to reduce stray light and increase measurement accuracy. A diffraction grating made from a DVD was used to split light into its constituent wavelengths, which were then collected by the camera. The calibration procedure used a RED TIDE USB650 Fiber Optic Spectrometer to set calibration values for various wavelength ranges, which ensured that the spectrometer's results closely matched those derived from the former, a high-cost industry-standard model. Spectrums of several light sources, such as red, green, blue, yellow, white, magenta, orange, and UV LEDs, as well as a green laser, were studied and compared. The results showed a high level of precision, with minimal divergence from industry-standard spectrometer measurements. This comparison was carried out utilizing Origin software, which allowed for extensive analysis and display of the spectrum data. In addition, the spectrometer captured data in real time, allowing users to watch live spectrum changes and ensure instant accessibility of results. Despite its simplicity and low cost, the spectrometer provides significant value for instructional and practical applications, making it a valuable tool in cost-constrained situations.",
    "authors": [
      "Zafrin Jahan Nikita",
      "Mohammad Tahsin Alam",
      "Yasir Mahmud",
      "Rafichha Yasmin",
      "Fairuz Darimi Bushra",
      "Sheikh Hasib Cheragee",
      "Redwanul Talukder Zeem"
    ],
    "published": "2025-10-08T06:58:18Z",
    "updated": "2025-10-30T09:24:25Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2410.07965v2",
    "url": "https://arxiv.org/abs/2410.07965v2",
    "pdf_url": "https://arxiv.org/pdf/2410.07965v2.pdf",
    "title": "Field enhancement of intense laser pulses in a subwavelength plasma   aperture",
    "abstract": "The interaction of intense, ultra-short laser pulses with nanostructures offers promising avenues for spatiotemporal light control. While enhanced optical transmission through subwavelength apertures has been extensively studied in the linear regime, its extension to ultrashort, high-intensity pulses remains largely unexplored. Here we demonstrate, through three-dimensional particle-in-cell simulations, significant field enhancement of intense laser pulses in subwavelength plasma apertures. The enhancement exhibits a non-resonant character, remaining robust across a wide range of plasma densities and saturating above approximately $20n_c$, while showing minimal dependence on wall thickness. Analysis of the Poynting vector reveals that energy concentration arises from interference between the incident field and back-scattered longitudinal field components. This size-dependent enhanced transmission in plasma apertures enables potential applications such as plasma-based dichroic filters operating at extreme intensities.",
    "authors": [
      "Xiaohui Gao"
    ],
    "published": "2024-10-10T14:26:42Z",
    "updated": "2025-10-30T07:16:08Z",
    "categories": [
      "physics.optics",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2510.26195v1",
    "url": "https://arxiv.org/abs/2510.26195v1",
    "pdf_url": "https://arxiv.org/pdf/2510.26195v1.pdf",
    "title": "The IDEA detector concept for FCC-ee",
    "abstract": "The electron-positron stage of the Future Circular Collider (FCC-ee) provides exciting opportunities that are enabled by next generation particle physics detectors. This contribution presents IDEA, a detector concept optimised for FCC-ee and composed of a vertex detector based on MAPS, a very light drift chamber, a silicon wrapper, a high resolution dual-readout crystal electromagnetic calorimeter, an HTS based superconducting solenoid, a dual-readout fibre calorimeter, and three layers of muon chambers embedded in the magnet flux return yoke. In particular, the physics requirements and the technical solutions chosen in the various sub-systems to address them are discussed. This is followed by a description of the detector R&D currently in progress, test-beam results, and the expected performance on some key physics benchmarks.",
    "authors": [
      "Armin Ilg"
    ],
    "published": "2025-10-30T07:11:51Z",
    "updated": "2025-10-30T07:11:51Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.26175v1",
    "url": "https://arxiv.org/abs/2510.26175v1",
    "pdf_url": "https://arxiv.org/pdf/2510.26175v1.pdf",
    "title": "High-order Mie resonance and transient field enhancement in laser-driven   plasma nanoshells",
    "abstract": "We demonstrate substantial field enhancement in plasma nanoshells through high-order Mie resonances using combined Mie theory and particle-in-cell simulations. Optimal shell geometries yield approximately threefold electric field enhancement for 800 nm irradiation, with transient buildup times of tens of femtoseconds before plasma expansion disrupts resonance. Few-cycle pulses produce reduced enhancement due to insufficient resonance establishment. These findings enable optimized laser-plasma interactions for applications including diagnostics of laser-cluster interaction and energetic ion production from engineered core-shell targets, highlighting the critical role of temporal dynamics in nanoplasma resonances.",
    "authors": [
      "Xiaohui Gao"
    ],
    "published": "2025-10-30T06:32:29Z",
    "updated": "2025-10-30T06:32:29Z",
    "categories": [
      "physics.plasm-ph",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.26162v1",
    "url": "https://arxiv.org/abs/2510.26162v1",
    "pdf_url": "https://arxiv.org/pdf/2510.26162v1.pdf",
    "title": "Design and Implementation of a Fast-Sweeping Langmuir Probe Diagnostic   for DC Arc Jet Environments",
    "abstract": "Langmuir probe diagnostics are a cornerstone of plasma characterization, providing critical measurements of electron temperature, electron density, and plasma potential. However, conventional swept Langmuir probes and other traditional electrostatic probes often lack the temporal resolution necessary to capture transient plasma behavior in dynamic environments. This paper presents the design and implementation of a fast-sweeping Langmuir probe system that is open-source, low-cost, and adaptable for a wide range of plasma applications. The probe system incorporates voltage sweeping to resolve rapid fluctuations in plasma parameters at a temporal resolution of up to 200 kHz. To validate its performance, the system was implemented in the 30 kW miniature Arc jet Research Chamber (mARC II), a high-enthalpy DC arc jet facility designed for prototype testing and development. Experimental results demonstrate the probe's capability to operate in extreme aerothermal conditions, providing time-resolved electron temperature and density along the flow's radial profile. This work establishes a robust and accessible Langmuir diagnostic solution for researchers studying transient plasma behavior in high-enthalpy environments.",
    "authors": [
      "Sebastian V. Colom",
      "Magnus A. Haw",
      "Jocelino Rodrigues"
    ],
    "published": "2025-10-30T05:57:06Z",
    "updated": "2025-10-30T05:57:06Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.26155v1",
    "url": "https://arxiv.org/abs/2510.26155v1",
    "pdf_url": "https://arxiv.org/pdf/2510.26155v1.pdf",
    "title": "Optimization of the Compact Stellarator with Simple Coils at finite-beta",
    "abstract": "An optimized stellarator at finite plasma beta is realized by single-stage optimization of simply modifying the coil currents of the Compact Stellarator with Simple Coils (CSSC)[Yu et al., J. Plasma Physics 88,905880306 (2022)]. The CSSC is an optimized stellarator obtained by direct optimization via coil shapes, with its coil topology similar to that of the Columbia Non-neutral Torus (CNT) [Pederson et al., Phys. Rev. Lett. 88, 205002 (2002)]. Due to its vacuum-based optimization, the CSSC exhibits detrimental finite beta effects on neoclassical confinement. The results of optimization show that the finite beta effects can be largely mitigated by reducing the coil currents of CSSC.",
    "authors": [
      "Haorong Qiu",
      "Guodong Yu",
      "Peiyou Jiang",
      "Guoyong Fu"
    ],
    "published": "2025-10-30T05:33:52Z",
    "updated": "2025-10-30T05:33:52Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.08384v2",
    "url": "https://arxiv.org/abs/2506.08384v2",
    "pdf_url": "https://arxiv.org/pdf/2506.08384v2.pdf",
    "title": "Planar Collisionless Shock Simulations with Semi-Implicit   Particle-in-Cell Model FLEKS",
    "abstract": "This study investigates the applicability of the semi-implicit particle-in-cell code FLEKS to heliospheric shock simulations. We examine one- and two-dimensional local planar shock simulations, initialized using MHD states with upstream conditions representative of plasmas in the hypersonic, $\\beta\\sim 1$ regime, for both quasi-perpendicular and quasi-parallel configurations. The refined algorithm in FLEKS proves robust, enabling accurate shock simulations with a grid resolution on the order of the electron inertial length $d_e$. Our simulations successfully capture key shock features, including shock structures (foot, ramp, overshoot, and undershoot), upstream and downstream waves (fast magnetosonic, whistler, Alfv\\'en ion-cyclotron, and mirror modes), and non-Maxwellian particle distributions. Crucially, we find that at least two spatial dimensions are critical for accurately reproducing downstream wave physics in quasi-perpendicular shocks and capturing the complex dynamics of quasi-parallel shocks, including surface rippling, shocklets, SLAMS, magnetic reconnection and jets. Furthermore, our parameter studies demonstrate the impact of mass ratio and grid resolution on shock physics. This work provides valuable guidance for selecting appropriate physical and numerical parameters for shock simulations using a semi-implicit PIC method, paving the way for incorporating kinetic shock processes into large-scale collisionless plasma simulations with the MHD-AEPIC model.",
    "authors": [
      "Hongyang Zhou",
      "Yuxi Chen",
      "Chuanfei Dong",
      "Liang Wang",
      "Ying Zou",
      "Brian Walsh",
      "Gábor Tóth"
    ],
    "published": "2025-06-10T02:50:06Z",
    "updated": "2025-10-30T02:19:19Z",
    "categories": [
      "physics.space-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2510.25980v1",
    "url": "https://arxiv.org/abs/2510.25980v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25980v1.pdf",
    "title": "MKS 390 Micro-Ion Gauge Performance After Exposure to High Pressures",
    "abstract": "In certain applications, pressure transducers may be exposed to high pressures either deliberately or accidentally, raising concerns about their functionality afterwards. We compared the performance of two MKS Granville-Phillips 390 Micro-Ion Gauges against each other, one that had been exposed to 10,000 Torr and the other had never been exposed to pressures above 1000 Torr. Our results show that the differences in the readings between the gauges were within the range of uncertainty specified by the manufacturer indicating negligible impact due to the exposure to high pressure. Additionally, the high pressure exposure did not compromise the leak integrity of the gauge.",
    "authors": [
      "Brandon Massett",
      "Walter Shmayda"
    ],
    "published": "2025-10-29T21:27:54Z",
    "updated": "2025-10-29T21:27:54Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.25972v1",
    "url": "https://arxiv.org/abs/2510.25972v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25972v1.pdf",
    "title": "A Self-Consistent Model of Kinetic Alfven Solitons in Pulsar Wind   Plasma: Linking Soliton Characteristics to Pulsar Observables",
    "abstract": "We present a self-consistent model for the formation and propagation of kinetic Alfven (KA) solitons in the pulsar wind zone, where a relativistic, magnetized electron positron ion plasma flows along open magnetic field lines beyond the light cylinder. Using a reductive perturbation approach, we derive a Korteweg de Vries (KdV) equation that governs the nonlinear evolution of KA solitons in this environment. The soliton amplitude and width are shown to depend sensitively on key pulsar observables, including spin period, spin-down rate, and pair multiplicity as well as plasma composition and suprathermal particle distributions. Our analysis reveals that soliton structures are strongly influenced by the presence of heavy ions, kappa-distributed pairs, and oblique propagation angles. Heavier ion species such as Fe26+ produce significantly broader solitons due to enhanced inertia and dispersion, while increasing pair multiplicity leads to smaller solitons through stronger screening. Oblique propagation (larger theta) results in wider but lower-amplitude solitons, and more thermalized pair plasmas (higher kappa) support taller and broader structures. A population-level analysis of 1174 pulsars shows a clear positive correlation between soliton width and spin period, with millisecond pulsars hosting the narrowest solitons. By linking soliton dynamics to measurable pulsar parameters, this work provides a framework for interpreting magnetospheric microphysics and its role in shaping pulsar emission signatures.",
    "authors": [
      "Manpreet Singh",
      "Geetika Slathia",
      "N. S. Saini",
      "Siming Liu"
    ],
    "published": "2025-10-29T21:15:53Z",
    "updated": "2025-10-29T21:15:53Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.06665v3",
    "url": "https://arxiv.org/abs/2510.06665v3",
    "pdf_url": "https://arxiv.org/pdf/2510.06665v3.pdf",
    "title": "Doping of a Borexino-like Liquid Scintillator with Tellurium-Diols",
    "abstract": "One of the most promising approaches for future neutrinoless double beta decay searches is to incorporate a candidate isotope into the liquid scintillator of a next-generation neutrino detector. In this study, a sample of the high-performance 1,2,4-Trimethylbenzene-based liquid scintillator from the Borexino detector was loaded with different concentrations of Te-diols. Therefore,a novel and completely water-free synthesis in a non-acidic organic environment at room temperature was used. Key parameters of the loaded samples were analyzed and compared with those of the pure Borexino liquid. Both the emission spectrum and transmission remained nearly unchanged,even at high doping levels. The reduction in light yield was moderate, with approximately 8,400 photons emitted for a 1 MeV energy deposition by an electron at 1$\\%$ tellurium loading. The time profile of the light emission induced by alpha particles was also investigated, revealing that the scintillation response becomes significantly faster with increasing tellurium concentration.",
    "authors": [
      "Hans Th. J. Steiger",
      "Marco Beretta",
      "Manuel Böhles",
      "Alberto Garfagnini",
      "Arsenii Gavrikov",
      "Paolo Lombardi",
      "Kai Loo",
      "Elena Pasini",
      "Benedetta Rasera",
      "Andrea Serafini",
      "Michael Wurm"
    ],
    "published": "2025-10-08T05:32:35Z",
    "updated": "2025-10-29T21:10:33Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.25946v1",
    "url": "https://arxiv.org/abs/2510.25946v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25946v1.pdf",
    "title": "Heavy Water Displacement in Molecular Sieve Drying Beds at Various   Humidities",
    "abstract": "Tritium plays a critical role in nuclear fusion power plant designs and dryer beds are an essential tool for managing tritiated water vapor. A series of tests were performed to investigate the ability of a saturated dryer to preferentially adsorb heavy water vapor. The design of passive tritiated control systems is feasible by utilizing a dryer's ability to preferentially trap heavier isotopologues of water. This work investigates this displacement phenomenon and the effect of the heavy water humidity on the dryers performance. Significant displacement was observed when a humid stream of heavy water was diverted through a dryer pre-saturated with light water, as indicated by changes in the partial pressures of $D_2O$ and $H_2O$. After the capture of heavy water in the bed, the subsequent rise in $D_2O$ partial pressure depended on the humidity of heavy water in the gas stream. Higher humidity values lead to faster and steeper mass transfer profiles in the dryer, which could be empirically fit with sigmoid curves.",
    "authors": [
      "Brandon Massett",
      "Walter Shmayda"
    ],
    "published": "2025-10-29T20:44:54Z",
    "updated": "2025-10-29T20:44:54Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.08061v2",
    "url": "https://arxiv.org/abs/2509.08061v2",
    "pdf_url": "https://arxiv.org/pdf/2509.08061v2.pdf",
    "title": "Acceleration of Heavy Ions at Non-Relativistic Collisionless Shocks",
    "abstract": "We investigate the process of Diffusive Shock Acceleration (DSA) of particles with mass number to charge number ratios $A/Q > 1$, e.g., partially-ionized heavy ions. To this end, we introduce helium- and carbon-like ions at solar abundances into two-dimensional hybrid (kinetic ions-fluid electrons) simulations of non-relativistic collisionless shocks. This study yields three main results: 1) Heavy ions are preferentially accelerated compared to hydrogen. For typical solar abundances, the energy transferred to accelerated helium ions is comparable to, or even exceeds, that of hydrogen, thereby enhancing the overall shock acceleration efficiency. 2) Accelerated helium ions contribute to magnetic field amplification, which increases the maximum attainable particle energy and steepen the spectra of accelerated particles. 3) The efficient acceleration of helium significantly enhances the production of hadronic gamma rays and neutrinos, likely dominating the one due to hydrogen. These effects should be taken into account, especially when modeling strong space and astrophysical shocks.",
    "authors": [
      "Damiano Caprioli",
      "Luca Orusa",
      "Miha Cernetic",
      "Colby C. Haggerty",
      "Bricker Ostler"
    ],
    "published": "2025-09-09T18:02:22Z",
    "updated": "2025-10-29T19:38:48Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE",
    "doi": "10.3847/2041-8213/ae109b"
  },
  {
    "arxiv_id": "2504.12906v2",
    "url": "https://arxiv.org/abs/2504.12906v2",
    "pdf_url": "https://arxiv.org/pdf/2504.12906v2.pdf",
    "title": "Water activation using $\\rm{Ar-H_2}$ atmospheric pressure plasma jets",
    "abstract": "Whether for materials processing or medical applications, the use of atmospheric pressure plasma jets (APPJs) has emerged as a relevant alternative to conventional methods. Within the APPJs research field, the search for innovation aims not only to solve existing problems but also to explore novel options for generating plasma jets and find new possible applications. In this work, the properties of $\\rm{Ar-H_2}$ APPJs generated using two plasma sources that differ in the frequency, amplitude, and waveform of the generated voltage signal were studied through electrical, thermal, and optical characterization. The discharge parameters were analyzed as a function of the $\\rm{H_2}$ content in the gas mixture, with this parameter varying from 0\\% to 3.5\\%. Optical emission spectroscopy revealed that the same reactive species were produced for both plasma sources, except nitric oxide ($\\rm{NO}$), which was observed only for the source operated at a higher frequency (PS \\#1). Applications for water activation were performed without $\\rm{H_2}$ and with 3.5\\% $\\rm{H_2}$ in the gas mixture. The results of water treatment revealed that ammonia is also produced when $\\rm{H_2}$ is added to the working gas. This finding suggests that the water treated by a $\\rm{Ar-H_2}$ plasma jet can be an attractive option for use in agriculture.",
    "authors": [
      "Fellype do Nascimento",
      "Ananias Alves Barbosa",
      "Konstantin Georgiev Kostov"
    ],
    "published": "2025-04-17T12:52:45Z",
    "updated": "2025-10-29T18:58:45Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.25847v1",
    "url": "https://arxiv.org/abs/2510.25847v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25847v1.pdf",
    "title": "Cosmological Simulations of Weakly Collisional Plasmas with Braginskii   Viscosity in Galaxy Clusters",
    "abstract": "We present the implementation of an anisotropic viscosity solver within the magnetohydrodynamics (MHD) framework of the TreeSPH code OpenGadget3. The solver models anisotropic viscous transport along magnetic field lines following the Braginskii formulation and includes physically motivated limiters based on the mirror and firehose instability thresholds, which constrain the viscous stress in weakly collisional plasmas. To validate the implementation, we performed a suite of standard test problems -- including two variants of the sound-wave test, circularly and linearly polarized Alfven waves, fast magnetosonic wave, and the Kelvin-Helmholtz instability -- both with and without the plasma-instability limiters. The results show excellent agreement with the AREPO implementation of a similar anisotropic viscosity model (Berlok et al. 2019), confirming the accuracy and robustness of our method. Our formulation integrates seamlessly within the individual adaptive timestepping framework of OpenGadget3, avoiding the need for subcycling. This provides efficient and stable time integration while maintaining physical consistency. Finally, we applied the new solver to a cosmological zoom-in simulation of a galaxy cluster, demonstrating its capability to model anisotropic transport and plasma microphysics in realistic large-scale environments. Our implementation offers a versatile and computationally efficient tool for studying anisotropic viscosity in magnetized astrophysical systems.",
    "authors": [
      "Tirso Marin-Gilabert",
      "Ulrich P. Steinwandel",
      "Milena Valentini",
      "John A. ZuHone",
      "Klaus Dolag"
    ],
    "published": "2025-10-29T18:00:08Z",
    "updated": "2025-10-29T18:00:08Z",
    "categories": [
      "astro-ph.IM",
      "astro-ph.CO",
      "astro-ph.GA",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2510.25722v1",
    "url": "https://arxiv.org/abs/2510.25722v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25722v1.pdf",
    "title": "Intrinsic emittance properties of an Fe-doped Beta-Ga2O3(010)   photocathode: Ultracold electron emission at 300K and the polaron self-energy",
    "abstract": "Measurements of the spectral emission properties of an iron-doped Beta-Ga2O3(010) photocathode at 300K reveal the presence of ultracold electron emission with a 6meV mean transverse energy (MTE) in the 3.5-4.4eV photon energy range (282-354nm). This extreme sub-thermal photoemission signal is consistent with direct emission of electrons photoexcited from the Fe dopant states into the low effective mass and positive electron affinity primary conduction band, and it is superimposed on a stronger signal with a larger MTE associated with an (optical)phonon-mediated momentum resonant Franck-Condon (FC) emission process from a thermally populated and negative electron affinity upper conduction band. For photon energies above 4.5eV, a transition from a long to a short transport regime is forced by an absorption depth reduction to below 100nm and both MTE signals exhibit spectral trends consistent with phonon-mediated FC emission if the polaron formation self-energy is included in the initial photoexcited electron thermalization.",
    "authors": [
      "Louis A. Angeloni",
      "Ir-Jene Shan",
      "J. H. Leach",
      "W. Andreas Schroeder"
    ],
    "published": "2025-10-29T17:29:19Z",
    "updated": "2025-10-29T17:29:19Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.acc-ph",
      "physics.app-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2303.03411v3",
    "url": "https://arxiv.org/abs/2303.03411v3",
    "pdf_url": "https://arxiv.org/pdf/2303.03411v3.pdf",
    "title": "Electromagnetic radiation reaction and energy extraction from black   holes: The tail term cannot be ignored",
    "abstract": "We study electromagnetic radiation reaction in curved space and the dynamics of radiating charged particles. The equation of motion for such particles is the DeWitt-Brehme equation, and it contains a particularly complicated, non-local, tail term. It has been claimed that the tail term can be neglected in certain magnetized black hole spacetimes, and that radiation reaction may then lead to energy extraction (\"orbital widening\") in the absence of an ergoregion. We show that such claims are incorrect, at least in the Newtonian limit: the tail term can never be neglected consistently in the relevant scenarios, and when it is included the reported energy extraction no longer occurs. Thus, previous results are called into question by our work.",
    "authors": [
      "João S. Santos",
      "Vitor Cardoso",
      "José Natário"
    ],
    "published": "2023-03-06T19:00:02Z",
    "updated": "2025-10-29T17:00:05Z",
    "categories": [
      "gr-qc",
      "astro-ph.HE",
      "hep-th",
      "physics.acc-ph"
    ],
    "primary_category": "gr-qc",
    "doi": "10.1103/PhysRevD.107.064046"
  },
  {
    "arxiv_id": "2510.25673v1",
    "url": "https://arxiv.org/abs/2510.25673v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25673v1.pdf",
    "title": "Spatiotemporal control of laser intensity using differentiable   programming",
    "abstract": "Optical techniques for spatiotemporal control can produce laser pulses with custom amplitude, phase, or polarization structure. In nonlinear optics and plasma physics, the use of structured pulses typically follows a forward design approach, in which the efficacy of a known structure is analyzed for a particular application. Inverse approaches, in contrast, enable the discovery of new structures with the potential for superior performance. Here, an implementation of the unidirectional pulse propagation equation that supports automatic differentiation is combined with gradient-based optimization to design structured pulses with features that are advantageous for a range of nonlinear optical and plasma-based applications: (1) a longitudinally uniform intensity over an extended region, (2) a superluminal intensity peak that travels many Rayleigh ranges with constant duration, spot size, and amplitude, and (3) a laser pulse that ionizes a gas to form a uniform column of plasma. In the final case, optimizing the full spatiotemporal structure improves the performance by a factor of 15 compared to optimizing only spatial or only temporal structure, highlighting the advantage of spatiotemporal control.",
    "authors": [
      "Kyle G Miller",
      "Tomas E Gutierrez",
      "Archis S Joglekar",
      "Amanda Elliott",
      "Dustin H Froula",
      "John P Palastro"
    ],
    "published": "2025-10-29T16:42:00Z",
    "updated": "2025-10-29T16:42:00Z",
    "categories": [
      "physics.optics",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2510.25636v1",
    "url": "https://arxiv.org/abs/2510.25636v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25636v1.pdf",
    "title": "Observations of the Relationship between Magnetic Anisotropy and Mode   Composition in Low-$β$ Solar Wind Turbulence",
    "abstract": "Turbulence is a ubiquitous process that transfers energy across many spatial and temporal scales, thereby influencing particle transport and heating. Recent progress has improved our understanding of the anisotropy of turbulence with respect to the mean magnetic field; however, its exact form and implications for magnetic topology and energy transfer remain unclear. In this Letter, we investigate the nature of magnetic anisotropy in compressible magnetohydrodynamic (MHD) turbulence within low-$\\beta$ solar wind using Cluster spacecraft measurements. By decomposing small-amplitude fluctuations into Alfv\\'en and compressible modes, we reveal that the anisotropy is strongly mode dependent: quasi-parallel (`slab') energy contains both Alfv\\'en and compressible modes, whereas quasi-perpendicular (`two-dimensional'; 2D) energy is almost purely Alfv\\'enic, a feature closely linked to collisionless damping of compressible modes. These findings elucidate the physical origin of the long-standing `slab+2D' empirical model and offer a new perspective on the turbulence cascade across the full three-dimensional wavevector space.",
    "authors": [
      "Siqi Zhao",
      "Huirong Yan",
      "Terry Z. Liu",
      "Chuanpeng Hou"
    ],
    "published": "2025-10-29T15:49:52Z",
    "updated": "2025-10-29T15:49:52Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2405.02172v4",
    "url": "https://arxiv.org/abs/2405.02172v4",
    "pdf_url": "https://arxiv.org/pdf/2405.02172v4.pdf",
    "title": "All-fiber microendoscopic polarization sensing at single-photon level   aided by deep-learning",
    "abstract": "The polarization of light conveys crucial information about the spatial ordering and optical properties of a specimen. However, precise polarization measurement in challenging conditions, including constrained spaces, low light levels, and high-speed scenarios, remains a severe challenge. Addressing this problem, we introduce a real-time polarization measurement method that is accurate down to a single-photon level and provides complete information about the polarization state. Free of moving components, the polarization sensor utilizes a short rigid piece of few-mode fiber followed by a fiber array and a detector array. The calibration of the sensor relies on a neural network yielding unprecedented accuracy across all polarization states, including partially polarized light. We validate the approach by visualizing the polarization structure of biological specimens and the liquid crystal polymer sample (birefringent USAF test). Our method offers an efficient and reliable solution for real-time polarization sensing and microendoscopy under low-light conditions.",
    "authors": [
      "Martin Bielak",
      "Dominik Vašinka",
      "Miroslav Ježek"
    ],
    "published": "2024-05-03T15:22:04Z",
    "updated": "2025-10-29T15:45:22Z",
    "categories": [
      "physics.optics",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "physics.optics",
    "doi": "10.1002/lpor.202501775"
  },
  {
    "arxiv_id": "2507.21612v2",
    "url": "https://arxiv.org/abs/2507.21612v2",
    "pdf_url": "https://arxiv.org/pdf/2507.21612v2.pdf",
    "title": "First use of large area SiPM matrices coupled with NaI(Tl) scintillating   crystal for low energy dark matter search",
    "abstract": "The long-standing claim of dark matter detection by the DAMA experiment remains a crucial open question in astroparticle physics. A key step towards its independent verification is the development of NaI(Tl)-based detectors with improved sensitivity at low energies. The majority of NaI(Tl)-based experiments rely on conventional photomultiplier tubes (PMTs) as single photon detectors, which present technological limitations in terms of light collection, intrinsic radioactivity and a high noise contribution at keV energies. ASTAROTH is an R&D project developing a NaI(Tl)-based detector where the scintillation light is read out by silicon photomultipliers (SiPM) matrices. SiPMs exhibit high photon detection efficiency, negligible radioactivity, and, most importantly, a dark noise nearly two orders of magnitude lower than PMTs, when operated at cryogenic temperature. To this end, ASTAROTH features a custom-designed cryostat based on a bath of cryogenic fluid, able to safely operate the detector and the read-out electronics down to about 80K. We report the first experimental characterization of 360 g NaI(Tl) detector read out by a large area (5 cm x 5 cm) SiPM matrix. The photoelectron yield obtained with a preliminary configuration is 7.2 photoelectrons/keV, which is rather promising, also in light of several planned developments. The signal-to-noise ratio and the energy threshold attainable with SiPMs is expected to improve the sensitivity for dark matter searches beyond the reach of current-generation PMT-based detectors. This result is the first proof of the viability of this technology and sets a milestone toward the design of future large-scale experiments.",
    "authors": [
      "Edoardo Martinenghi",
      "Valerio Toso",
      "Fabrizio Bruno Armani",
      "Andrea Castoldi",
      "Giuseppe di Carlo",
      "Luca Frontini",
      "Niccolò Gallice",
      "Chiara Guazzoni",
      "Valentino Liberali",
      "Alberto Stabile",
      "Valeria Trabattoni",
      "Andrea Zani",
      "Davide D'Angelo"
    ],
    "published": "2025-07-29T09:10:39Z",
    "updated": "2025-10-29T15:44:57Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2506.14637v2",
    "url": "https://arxiv.org/abs/2506.14637v2",
    "pdf_url": "https://arxiv.org/pdf/2506.14637v2.pdf",
    "title": "A New cw-NMR Q-meter for Dynamically Polarized Targets for Particle   Physics",
    "abstract": "Polarized solid targets produced via Dynamic Nuclear Polarization rely on Continuous-Wave Nuclear Magnetism Resonance measurements to accurately determine the degree of polarization of bulk samples polarized to nearly 100%. Since the late 1970's phase sensitive detection methods have been utilized to observe the magnetization of a sample as a small change in inductance under RF excitation near the Larmor frequency of the nuclear species of interest, using a device known as a Q-meter. Liverpool Q-meters, produced in the UK in the 80's and 90's, have been the workhorse devices for these targets for decades, however their age and scarcity has meant new systems are needed. We describe a Q-meter system designed and built at Jefferson Lab in the Liverpool style to have comparable electronic performance with several improvements to update and adapt the devices for modern use.",
    "authors": [
      "J. D. Maxwell",
      "J. Brock",
      "C. Cuevas",
      "H. Dong",
      "C. D. Keith",
      "J. J. Pierce"
    ],
    "published": "2025-06-17T15:31:04Z",
    "updated": "2025-10-29T14:22:58Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.25532v1",
    "url": "https://arxiv.org/abs/2510.25532v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25532v1.pdf",
    "title": "Global Non-Axisymmetric Hall Instabilities in a Rotating Plasma",
    "abstract": "Non-axisymmetric, flow-driven instabilities in the incompressible Hall-MHD model are studied in a differentially rotating cylindrical plasma. It is found that in the Hall-MHD regime, both whistler waves and ion-cyclotron waves can extract energy from the flow shear, resulting in two distinct branches of global instability. The non-axisymmetric whistler modes grow significantly faster than non-axisymmetric, ideal MHD modes. A discussion of the whistler instability mechanism is presented in the large-ion-skin-depth, `electron-MHD' limit. It is observed that the effect of the Hall term on the non-axisymmetric modes can be appreciable when $d_i$ is on the order of a few % of the width of the cylindrical annulus. Distinct global modes emerge in the Hall-MHD regime at significantly stronger magnetic fields than those required for unstable global MHD modes.",
    "authors": [
      "Alexandre Sainterme",
      "Fatima Ebrahimi"
    ],
    "published": "2025-10-29T13:57:40Z",
    "updated": "2025-10-29T13:57:40Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2505.00042v2",
    "url": "https://arxiv.org/abs/2505.00042v2",
    "pdf_url": "https://arxiv.org/pdf/2505.00042v2.pdf",
    "title": "Characterisation of the neutron beam in the n_TOF-EAR2 experimental area   at CERN following the spallation target upgrade",
    "abstract": "The n_TOF facility at CERN has undergone a major upgrade after the installation of a new spallation target, designed to improve the features of both neutron beamlines at the experimental areas 1 and 2 (EAR1 and EAR2) and the commissioning of a new experimental area (NEAR). Due to improved coupling of the spallation target with the EAR2 beamline, the upgrade resulted in a significantly increased neutron flux and improved neutron energy resolution. This paper presents the results of the commissioning phase that followed to characterise the EAR2 neutron beamline and validate the FLUKA Monte Carlo simulations of the facility. The main features of the neutron beam, namely the neutron flux, spatial profile and energy resolution, are evaluated and compared to the previous target. The neutron flux presents a general increase of 20% below 1 eV, 40% between 1 eV and 100 keV and 50% between 100 keV and 10 MeV. The measured width of the beam profile was 3 cm (FWHM) at the reference position for neutron capture measurements. The energy resolution with the new spallation target shows a significant improvement compared to the previous one. Moreover, FLUKA Monte Carlo simulations present a good agreement with the measured neutron flux and profile within uncertainties, and a remarkable reproduction of the energy resolution.",
    "authors": [
      "J. A. Pavon-Rodriguez",
      "J. Lerendegui-Marco",
      "A. Manna",
      "S. Amaducci",
      "M. Sabate-Gilarte",
      "E. Musacchio-Gonzalez",
      "M. Bacak",
      "V. Alcayne",
      "M. A.",
      "Cortes-Giraldo",
      "V. Vlachoudis",
      "R. Zarrella",
      "F. Garcia-Infantes",
      "E. Stamati",
      "A. Casanovas",
      "N. Patronis",
      "L. Tassan-Got",
      "J. M. Quesada",
      "the n_TOF Collaboration"
    ],
    "published": "2025-04-29T21:19:07Z",
    "updated": "2025-10-29T13:45:45Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.24196v2",
    "url": "https://arxiv.org/abs/2510.24196v2",
    "pdf_url": "https://arxiv.org/pdf/2510.24196v2.pdf",
    "title": "Design and characterization of a photosensor system for the RELICS   experiment",
    "abstract": "In this paper, we present the design and characterization of a photosensor system developed for the RELICS experiment. A set of dynamic readout bases was designed to mitigate photomultiplier tube (PMT) saturation caused by intense cosmic muon backgrounds in the surface-level RELICS detector. The system employs dual readout from the anode and the seventh dynode to extend the PMT's linear response range. In particular, our characterization and measurements of Hamamatsu R8520-406 PMTs confirm stable operation under positive high-voltage bias, extending the linear response range by more than an order of magnitude. Furthermore, a model of PMT saturation and recovery was developed to evaluate the influence of cosmic muon signals in the RELICS detector. The results demonstrate the system's capability to detect coherent elastic neutrino-nucleus scattering (CE$\\nu$NS) signals under surface-level cosmic backgrounds, and suggest the potential to extend the scientific reach of RELICS to MeV-scale interactions.",
    "authors": [
      "Jijun Yang",
      "Ruize Li",
      "Chang Cai",
      "Guocai Chen",
      "Jiangyu Chen",
      "Huayu Dai",
      "Rundong Fang",
      "Fei Gao",
      "Jingfan Gu",
      "Xiaoran Guo",
      "Jiheng Guo",
      "Gaojun Jin",
      "Gaojun Ju",
      "Yanzhou Hao",
      "Yang Lei",
      "Kaihang Li",
      "Meng Li",
      "Minhua Li",
      "Shengchao Li",
      "Siyin Li",
      "Tao Li",
      "Qing Lin",
      "Jiajun Liu",
      "Sheng Lv",
      "Guang Luo",
      "Kangwei Ni",
      "Chuanping Shen",
      "Mingzhuo Song",
      "Lijun Tong",
      "Jun Wang",
      "Xiaoyu Wang",
      "Wei Wang",
      "Xiaoping Wang",
      "Zihu Wang",
      "Yuehuan Wei",
      "Liming Weng",
      "Xiang Xiao",
      "Lingfeng Xie",
      "Litao Yang",
      "Long Yang",
      "Jingqiang Ye",
      "Jiachen Yu",
      "Qian Yue",
      "Yuyong Yue",
      "Bingwei Zhang",
      "Yuming Zhang",
      "Yifei Zhao",
      "Chenhui Zhu"
    ],
    "published": "2025-10-28T09:03:00Z",
    "updated": "2025-10-29T13:00:24Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.25438v1",
    "url": "https://arxiv.org/abs/2510.25438v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25438v1.pdf",
    "title": "On Improving Nuclear Fuel Imaging Using Position Sensitive Detectors",
    "abstract": "Spent nuclear fuel imaging before disposal is of utmost importance before long term disposal in dedicated storage facilities. Passive Gamma Emission Tomography (PGET) is an approved method by the International Atomic Energy Agency. The present detection system is based on small CZT detectors behind a tungsten-based collimator consisting of a linear array of slits. Small scale CZT crystals limit the detection efficiency of high energetic gamma rays from the fuel rods, mainly the 662 keV emissions from Cs-137. In our study based on full Monte-Carlo simulations as well as on experiments, we explore the capabilities of large pixelated CZT detectors to be used for PGET. We will discuss the theoretical advantages and practical challenges of the larger crystals. We demonstrate that the larger crystals, depending on their orientation, will increase the detection efficiency by a factor of 7 to 13. Due to the pixelated sensor signal readout we also explore the possibility to employ Compton imaging to improve the information on the location of origin of gamma rays. In addition we explore the usefulness of commercial gamma-ray imagers for waste characterisation and decommissioning. In particular we report on the performance of the GeGI imager from PHDS Co and the H420 imager from H3D Inc in measuring nuclear waste drums at Svafo, Sweden.",
    "authors": [
      "Erik Brücken",
      "Peter Andersson",
      "Mihaela Bezak",
      "Peter Dendooven",
      "Sofia Godø",
      "Stefan Holm",
      "Matti Kalliokoski",
      "Aage Kalsæg",
      "Gustav Pettersson",
      "Anders Puranen",
      "Vikram Rathore",
      "Santeri Saariokari"
    ],
    "published": "2025-10-29T12:06:22Z",
    "updated": "2025-10-29T12:06:22Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2104.12730v2",
    "url": "https://arxiv.org/abs/2104.12730v2",
    "pdf_url": "https://arxiv.org/pdf/2104.12730v2.pdf",
    "title": "An efficient high-current circuit for fast radio-frequency spectroscopy   in cold atomic gases",
    "abstract": "We design and implement a low-impedance, high-current radio-frequency (RF) circuit, enabling fast coherent coupling between magnetic levels in cold alkali atomic samples. It is based on a compact shape-optimized coil that maximizes the RF field coupling with the atomic magnetic dipole, and on coaxial transmission-line transformers that step up the field-generating current flowing in the coil by a factor $\\sim\\,4$ to about $7.5\\,$A for $100\\,$W of RF driving. This allows to obtain a RF coupling field of about $0.035\\,\\text{G}/\\sqrt{\\text{W}}$ at the atomic sample location. The system is robust and versatile, as it generates a large RF field without compromising on the available optical access, and its central resonant frequency can be adjusted in situ. Our approach provides a cost-effective, reliable solution, featuring a negligible level of interference with surrounding electronic equipment thanks to its symmetric layout. We test the circuit performance using a maximum RF power of $80\\,$W at a frequency around $82\\,$MHz, which corresponds to a measured Rabi frequency $\\Omega_R/2\\pi \\simeq 18.5\\,$kHz, i.e. a $\\pi$-pulse duration of about $27\\,\\mu$s, between two of the lowest states of ${}^6$Li at an offset magnetic field of $770\\,$G. Our solution can be readily adapted to other atomic species and vacuum chamber designs, in view of an increasing modularity of cold atom experiments.",
    "authors": [
      "F. Scazza",
      "G. Del Pace",
      "L. Pieri",
      "R. Concas",
      "W. J. Kwon",
      "G. Roati"
    ],
    "published": "2021-04-26T17:21:53Z",
    "updated": "2025-10-29T11:08:32Z",
    "categories": [
      "physics.atom-ph",
      "cond-mat.quant-gas",
      "physics.ins-det"
    ],
    "primary_category": "physics.atom-ph",
    "doi": "10.1063/5.0276530"
  },
  {
    "arxiv_id": "2510.25376v1",
    "url": "https://arxiv.org/abs/2510.25376v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25376v1.pdf",
    "title": "Robust direct laser acceleration of electrons with flying-focus laser   pulses",
    "abstract": "Direct laser acceleration (DLA) offers a compact source of high-charge, energetic electrons for generating secondary radiation or neutrons. While DLA in high-density plasma optimizes the energy transfer from a laser pulse to electrons, it exacerbates nonlinear propagation effects, such as filamentation, that can disrupt the acceleration process. Here, we show that superluminal flying-focus pulses (FFPs) mitigate nonlinear propagation, thereby enhancing the number of high-energy electrons and resulting x-ray yield. Three-dimensional particle-in-cell simulations show that, compared to a Gaussian pulse of equal energy (1 J) and intensity (2x10^20 W/cm^2), an FFP produces 80x more electrons above 100 MeV, increases the electron cutoff energy by 20%, triples the high-energy x-ray yield, and improves x-ray collimation. These results illustrate the ability of spatiotemporally structured laser pulses to provide additional control in the highly nonlinear, relativistic regime of laser-plasma interactions.",
    "authors": [
      "Talia Meir",
      "Kale Weichman",
      "Alexey Arefiev",
      "John P. Palastro",
      "Ishay Pomerantz"
    ],
    "published": "2025-10-29T10:49:19Z",
    "updated": "2025-10-29T10:49:19Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.02488v2",
    "url": "https://arxiv.org/abs/2508.02488v2",
    "pdf_url": "https://arxiv.org/pdf/2508.02488v2.pdf",
    "title": "Commissioning of the NUCLEUS Experiment at the Technical University of   Munich",
    "abstract": "The NUCLEUS experiment aims to detect coherent elastic neutrino-nucleus scattering of reactor antineutrinos on CaWO$_4$ targets in the fully coherent regime, using gram-scale cryogenic calorimeters. The experimental apparatus will be installed at the Chooz nuclear power plant in France, in the vicinity of two 4.25 GW$_{\\text{th}}$ reactor cores. This work presents results from the commissioning of an essential version of the experiment at the shallow Underground Laboratory of the Technical University of Munich. For the first time, two cryogenic target detectors were tested alongside active and passive shielding systems. Over a period of two months all detector subsystems were operated with stable performance. Background measurements were conducted, providing important benchmarks for the modeling of background sources at the reactor site. Finally, we present ongoing efforts to upgrade the detector systems in preparation for a technical run at Chooz in 2026, and highlight the remaining challenges to achieving neutrino detection.",
    "authors": [
      "H. Abele",
      "G. Angloher",
      "B. Arnold",
      "M. Atzori Corona",
      "A. Bento",
      "E. Bossio",
      "F. Buchsteiner",
      "J. Burkhart",
      "F. Cappella",
      "M. Cappelli",
      "N. Casali",
      "R. Cerulli",
      "A. Cruciani",
      "G. Del Castello",
      "M. del Gallo Roccagiovine",
      "S. Dorer",
      "A. Erhart",
      "M. Friedl",
      "S. Fichtinger",
      "V. M. Ghete",
      "M. Giammei",
      "C. Goupy",
      "D. Hauff",
      "F. Jeanneau",
      "E. Jericha",
      "M. Kaznacheeva",
      "H. Kluck",
      "A. Langenkämper",
      "T. Lasserre",
      "D. Lhuillier",
      "M. Mancuso",
      "R. Martin",
      "B. Mauri",
      "A. Mazzolari",
      "L. McCallin",
      "H. Neyrial",
      "C. Nones",
      "L. Oberauer",
      "T. Ortmann",
      "L. Peters",
      "F. Petricca",
      "W. Potzel",
      "F. Pröbst",
      "F. Pucci",
      "F. Reindl",
      "M. Romagnoni",
      "J. Rothe",
      "N. Schermer",
      "J. Schieck",
      "S. Schönert",
      "C. Schwertner",
      "L. Scola",
      "G. Soum-Sidikov",
      "L. Stodolsky",
      "R. Strauss",
      "R. Thalmeier",
      "C. Tomei",
      "M. Vignati",
      "M. Vivier",
      "A. Wex"
    ],
    "published": "2025-08-04T14:58:53Z",
    "updated": "2025-10-29T09:06:46Z",
    "categories": [
      "hep-ex",
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1103/c95p-8kh2"
  },
  {
    "arxiv_id": "2510.25286v1",
    "url": "https://arxiv.org/abs/2510.25286v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25286v1.pdf",
    "title": "Advanced structural characterization of single-walled carbon nanotubes   with 4D-STEM",
    "abstract": "Single wall carbon nanotubes (SWCNT) exhibit remarkable optical and electrical properties making them one of the most promising materials for next generation electronic and optoelectronic devices. Their electronic properties strongly depend on their chirality, i.e., their structural configuration, as well as on the presence and nature of atomic defects. Currently, the lack of versatile and efficient structural characterization techniques limits SWCNT applications. Here, we report how four-dimensional scanning transmission electron microscopy (4D-STEM) can address critical challenges in SWCNT structural analysis. Using modern fast pixelated electron detectors, we were able to acquire rapidly a large number of low noise electron diffraction patterns of SWCNTs. The resulting 4D-STEM data allow to precisely determine the local chirality of multiple nanotubes at once, with limited electron dose (down to 1750 e-/{\\AA}^2) and nanometric spatial resolution (down to 3.1 nm). We also show how this approach enables to track the chirality along a single nanotube, while giving access to the strain distribution. Then, we report how 4D-STEM data enable to reconstruct high-resolution images with electron ptychography. With this second approach, structural information can be obtained with atomic scale spatial resolution allowing atomic defect imaging. Finally, we investigate how multi-slice electron ptychography could provide even further insight on nanotube defect structures thanks to its close to 3D imaging capabilities at atomic resolution.",
    "authors": [
      "Antonin Louiset",
      "Daniel Förster",
      "Vincent Jourdain",
      "Saïd Tahir",
      "Nicola Vigano",
      "Jean-Luc Rouvière",
      "Christophe Bichara",
      "Hanako Okuno"
    ],
    "published": "2025-10-29T08:42:34Z",
    "updated": "2025-10-29T08:42:34Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2510.25272v1",
    "url": "https://arxiv.org/abs/2510.25272v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25272v1.pdf",
    "title": "Characterization of the Li$_2$WO$_4$ crystal as a cryogenic   scintillating calorimeter",
    "abstract": "A wide range of scintillating bolometers is under investigation for applications in the search for rare events and processes beyond the Standard Model. In this work, we report the first measurement of a natural, non-molybdenum-doped, lithium tungstate (LWO) crystal operated underground as a scintillating cryogenic calorimeter. The detector achieved a baseline energy resolution of 0.5 keV RMS with a low-energy threshold of about 1.5 keV. The simultaneous readout of heat and light enabled particle identification, revealing a clear separation between $\\beta/\\gamma$, $\\alpha$, and nuclear recoil populations above 300 keV, with a light-yield-based particle discrimination better than $6\\sigma$. These results, fully comparable with those achieved with other compounds in the field, demonstrate that LWO is a promising candidate for rare-event searches. In particular, the combination of excellent radio-purity (with U/Th levels below 0.5 mBq/kg) and sensitivity to neutron interactions via the $^6$Li(n,$\\alpha$)$^3$H reaction makes this material an attractive option for next-generation experiments on dark matter, coherent elastic neutrino-nucleus scattering, and spin-dependent interactions.",
    "authors": [
      "D. L. Helis",
      "A. Melchiorre",
      "S. Nagorny",
      "M. Noia",
      "L. Pagnanini",
      "S. Pirro",
      "A. Puiu",
      "G. Benato",
      "P. Carniti",
      "R. Elleboro",
      "P. Gambacorta",
      "C. Gotti",
      "V. D. Grigorieva",
      "S. Nisi",
      "E. Olivieri",
      "G. Pessina",
      "S. Piacentini",
      "M. Shafiee",
      "V. N. Shlegel"
    ],
    "published": "2025-10-29T08:30:33Z",
    "updated": "2025-10-29T08:30:33Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.25264v1",
    "url": "https://arxiv.org/abs/2510.25264v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25264v1.pdf",
    "title": "Development of a new phase-retrieval algorithm from a single-shot image   for X-ray schlieren microscopy",
    "abstract": "In this paper, a new phase-retrieval algorithm from an X-ray schlieren image is proposed. The schlieren method allows phase-contrast imaging with an objective lens and a knife-edge filter placed at the back focal plane of the objective. This method finds a wide range of applications in the visible-light region for transparent specimen visualization. The schlieren contrast does not directly correspond to the phase shift. However, the phase map can be reconstructed from a single-shot schlieren image of a transparent and weak-phase object using the filtered Fourier transform method. A proof-of-principle experiment was performed in the hard-X-ray region at the AR-NE1A beamline of the Photon Factory facility at the High Energy Accelerator Research Organization (KEK).",
    "authors": [
      "Ryutaro Nishimura",
      "Yoshio Suzuki",
      "Hiroshi Sugiyama",
      "Daisuke Wakabayashi",
      "Yuki Shibazaki",
      "Keiichi Hirano",
      "Noriyuki Igarashi",
      "Nobumasa Funamori"
    ],
    "published": "2025-10-29T08:22:01Z",
    "updated": "2025-10-29T08:22:01Z",
    "categories": [
      "physics.ins-det",
      "physics.data-an",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1016/j.optcom.2025.132283"
  },
  {
    "arxiv_id": "2504.06409v2",
    "url": "https://arxiv.org/abs/2504.06409v2",
    "pdf_url": "https://arxiv.org/pdf/2504.06409v2.pdf",
    "title": "High-Precision Lunar Corner-Cube Retroreflectors: A Wave-Optics   Perspective",
    "abstract": "High-precision corner-cube retroreflectors (CCRs) are critical for advanced lunar laser ranging (LLR) because they enable sub-millimeter-scale measurements of the Earth-Moon distance -- a level of precision essential for rigorous tests of relativistic gravitation and for advancing our understanding of lunar geophysics. In this work, we develop a comprehensive two-dimensional Fourier-optics model for single CCRs with apertures ranging from 80-110 mm. Our model incorporates realistic thermal-mechanical wavefront errors, detailed diffraction effects, and velocity aberration offsets. Our analysis reveals a strong coupling between aperture size and aberration angular offset: while larger CCRs deliver high on-axis flux under near-ideal conditions, their narrow diffraction lobes suffer significant flux loss at moderate aberration offsets, thereby favoring smaller apertures with broader main lobes. Furthermore, comparisons between solid fused-silica and hollow silicon-carbide (SiC) CCRs show that hollow designs not only achieve competitive or superior photon return -- particularly at 1064 nm, where phase errors are relatively reduced -- but also offer nearly an order-of-magnitude mass reduction for the same aperture sizes. These results establish a robust quantitative framework for optimizing CCR designs to perform at the sub-millimeter level under realistic lunar conditions and underscore the advantages of precision hollow SiC CCRs for next-generation LLR operations.",
    "authors": [
      "Slava G. Turyshev"
    ],
    "published": "2025-04-08T20:07:54Z",
    "updated": "2025-10-29T06:23:45Z",
    "categories": [
      "physics.optics",
      "astro-ph.IM",
      "gr-qc",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2510.25196v1",
    "url": "https://arxiv.org/abs/2510.25196v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25196v1.pdf",
    "title": "Fast chaos indicator from auto-differentiation for dynamic aperture   optimization",
    "abstract": "Automatic differentiation provides an efficient means of computing derivatives of complex functions with machine precision, thereby enabling differentiable simulation. In this work, we propose the use of the norm of the tangent map, obtained from differentiable tracking of particle trajectories, as a computationally efficient indicator of chaotic behavior in phase space. In many cases, a one-turn or few-turn tangent map is sufficient for this purpose, significantly reducing the computational cost associated with dynamic aperture optimization. As an illustrative application, the proposed indicator is employed in the dynamic aperture optimization of an ALS-U lattice design.",
    "authors": [
      "Ji Qiang",
      "Jinyu Wan",
      "Allen Qiang",
      "Yue Hao"
    ],
    "published": "2025-10-29T06:03:48Z",
    "updated": "2025-10-29T06:03:48Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.24121v2",
    "url": "https://arxiv.org/abs/2510.24121v2",
    "pdf_url": "https://arxiv.org/pdf/2510.24121v2.pdf",
    "title": "Effect of flow-aligned external magnetic fields on mushroom instability",
    "abstract": "Mushroom instability (MI) is a shear instability considered responsible for generating and amplifying magnetic fields in relativistic jets. While astrophysical jets are usually magnetized, how MI acts in magnetized jets remains poorly understood. In this paper, we investigate the effect of a flow-aligned external magnetic field on MI, with both theoretical analyses and particle-in-cell (PIC) simulations. In the limit of a cold and collisionless plasma, we derive a generalized dispersion relation for linear growth rates of the magnetized MIs. Numerical solutions of the dispersion relation reveal that the external magnetic field always suppresses the growth of MI, though MIs are much more robust against the external magnetic field than electron-scale Kelvin-Helmholtz instabilities (ESKHIs). Analyses are also extended to instabilities with an arbitrary wavevector in the shear interface plane, where coupling effect is observed for sub-relativistic scenarios. Two-dimensional PIC simulations of single-mode MIs reach a good agreement with our analytical predictions, and we observe formation of a quasi-steady saturation structure in magnetized runs. In simulations with finite temperatures, we observe the competition and cooperation between MIs and a diffusion-induced DC magnetic field.",
    "authors": [
      "Y. Guo",
      "D. Wu",
      "J. Zhang"
    ],
    "published": "2025-10-28T06:47:49Z",
    "updated": "2025-10-29T04:19:44Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.25125v1",
    "url": "https://arxiv.org/abs/2510.25125v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25125v1.pdf",
    "title": "Automated Supervised Identification of Thunderstorm Ground Enhancements   (TGEs)",
    "abstract": "Thunderstorm Ground Enhancements (TGEs) are bursts of high-energy particle fluxes detected at Earth's surface, linked to the Relativistic Runaway Electron Avalanche (RREA) mechanism within thunderclouds. Accurate detection of TGEs is vital for advancing atmospheric physics and radiation safety, but event selection methods heavily rely on expert-defined thresholds. In this study, we use an automated supervised classification approach on a newly curated dataset of 2024 events from the Aragats Space Environment Center (ASEC). By combining a Tabular Prior-data Fitted Network (TabPFN) with SHAP-based interpretability, we attain 94.79% classification accuracy with 96% precision for TGEs. The analysis reveals data-driven thresholds for particle flux increases and environmental parameters that closely match the empirically established criteria used over the last 15 years. Our results demonstrate that modest but concurrent increases across multiple particle detectors, along with strong near-surface electric fields, are reliable indicators of TGEs. The framework we propose offers a scalable method for automated, interpretable TGE detection, with potential uses in real-time radiation hazard monitoring and multi-site atmospheric research.",
    "authors": [
      "Davit Aslanyan"
    ],
    "published": "2025-10-29T03:03:55Z",
    "updated": "2025-10-29T03:03:55Z",
    "categories": [
      "physics.ins-det",
      "physics.ao-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.25047v1",
    "url": "https://arxiv.org/abs/2510.25047v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25047v1.pdf",
    "title": "Magnetic Field Line Chaos, Cantori, and Turnstiles in Toroidal Plasmas",
    "abstract": "Although magnetic field line chaos, cantori, and turnstiles underlie the physics of tokamak disruptions, runaway electron damage, stellarator non-resonant divertors, and the most important electromagnetic correction to what are called electrostatic micro-instabilities, these concepts are not well known. These concepts will be defined and applications that illustrate their importance will be discussed.",
    "authors": [
      "Allen H Boozer"
    ],
    "published": "2025-10-29T00:16:43Z",
    "updated": "2025-10-29T00:16:43Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.24861v1",
    "url": "https://arxiv.org/abs/2510.24861v1",
    "pdf_url": "https://arxiv.org/pdf/2510.24861v1.pdf",
    "title": "A Semi-Lagrangian Adaptive Rank (SLAR) Method for High-Dimensional   Vlasov Dynamics",
    "abstract": "We extend our previous work on a semi-Lagrangian adaptive rank (SLAR) integrator, in the finite difference framework for nonlinear Vlasov-Poisson systems, to the general high-order tensor setting. The proposed scheme retains the high-order accuracy of semi-Lagrangian methods, ensuring stability for large time steps and avoiding dimensional splitting errors. The primary contribution of this paper is the novel extension of the algorithm from the matrix to the high-dimensional tensor setting, which enables the simulation of Vlasov models in up to six dimensions. The key technical components include (1) a third-order high-dimensional polynomial reconstruction that scales as $O(d^2)$, providing a point-wise approximation of the solution at the foot of characteristics in a semi-Lagrangian scheme; (2) a recursive hierarchical adaptive cross approximation of high-order tensors in a hierarchical Tucker format, characterized by a tensor tree; (3) a low-complexity Poisson solver in the hierarchical Tucker format that leverages the FFT for efficiency. The computed adaptive rank kinetic solutions exhibit low-rank structures within branches of the tensor tree resulting in substantial computational savings in both storage and time. The resulting algorithm achieves a computational complexity of $O(d^4 N r^{3+\\lceil\\log_2d\\rceil})$, where $N$ is the number of grid points per dimension, $d$ is the problem dimension, and $r$ is the maximum rank in the tensor tree, overcoming the curse of dimensionality. Through extensive numerical tests, we demonstrate the efficiency of the proposed algorithm and highlight its ability to capture complex solution structures while maintaining a computational complexity that scales linearly with $N$.",
    "authors": [
      "Nanyi Zheng",
      "William A. Sands",
      "Daniel Hayes",
      "Andrew J. Christlieb",
      "Jing-Mei Qiu"
    ],
    "published": "2025-10-28T18:07:18Z",
    "updated": "2025-10-28T18:07:18Z",
    "categories": [
      "math.NA",
      "cs.NA",
      "physics.comp-ph",
      "physics.plasm-ph",
      "65M70, 65F30, 35Q83, 65Y20, 82D10"
    ],
    "primary_category": "math.NA"
  },
  {
    "arxiv_id": "2510.24618v1",
    "url": "https://arxiv.org/abs/2510.24618v1",
    "pdf_url": "https://arxiv.org/pdf/2510.24618v1.pdf",
    "title": "Distributed Inter-Strand Coupling Current Model for Finite Element   Simulations of Rutherford Cables",
    "abstract": "In this paper, we present the Distributed Inter-Strand Coupling Current (DISCC) model. It is a finite element (FE) model based on a homogenization approach enabling efficient and accurate simulation of the transient magnetic response of superconducting Rutherford cables without explicitly representing individual strands. The DISCC model reproduces the inter-strand coupling current dynamics via a novel mixed FE formulation, and can be combined with the Reduced Order Hysteretic Magnetization (ROHM) and Flux (ROHF) models applied at the strand level in order to reproduce the internal strand dynamics: hysteresis, eddy, and inter-filament coupling currents, as well as ohmic effects. We first analyze the performance of the DISCC model alone, as a linear problem. We then extend the analysis to include the internal strand dynamics that make the problem nonlinear. In all cases, the DISCC model offers a massive reduction of the computational time compared to conventional fully detailed FE models while still accounting for all types of loss, magnetization and inductance contributions. Rutherford cables homogenized with the DISCC model can be directly included in FE models of magnet cross-sections for efficient electro-magneto-thermal simulations of their transient response. We present two possible FE formulations for the implementation of the DISCC model, a first one based on the h-phi-formulation, and a second one based on the h-phi-a-formulation, which is well suited for an efficient treatment of the ferromagnetic regions in magnet cross-sections.",
    "authors": [
      "Julien Dular",
      "Alexander Glock",
      "Arjan Verweij",
      "Mariusz Wozniak"
    ],
    "published": "2025-10-28T16:45:23Z",
    "updated": "2025-10-28T16:45:23Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2501.11698v2",
    "url": "https://arxiv.org/abs/2501.11698v2",
    "pdf_url": "https://arxiv.org/pdf/2501.11698v2.pdf",
    "title": "AstroPix: A Pixelated HVCMOS Sensor for Space-Based Gamma-Ray   Measurement",
    "abstract": "A next-generation medium-energy gamma-ray telescope targeting the MeV range would address open questions in astrophysics regarding how extreme conditions accelerate cosmic-ray particles, produce relativistic jet outflows, and more. One concept, AMEGO-X, relies upon the mission-enabling CMOS Monolithic Active Pixel Sensor silicon chip AstroPix. AstroPix is designed for space-based use, featuring low noise, low power consumption, and high scalability. Desired performance of the device include an energy resolution of 5 keV (or 10% FWHM) at 122 keV and a dynamic range per-pixel of 25-700 keV, enabled by the addition of a high-voltage bias to each pixel which supports a depletion depth of 500 um. This work reports on the status of the AstroPix development process with emphasis on the current version under test, version three (v3), and highlights of version two (v2). Version 3 achieves energy resolution of 10.4 +/- 3.2% at 59.5 keV and 94 +/- 6 um depletion in a low-resistivity test silicon substrate.",
    "authors": [
      "Amanda L. Steinhebel",
      "Regina Caputo",
      "Daniel P. Violette",
      "Anthony Affolder",
      "Autumn Bauman",
      "Carolyn Chinatti",
      "Aware Deshmukh",
      "Vitaliy Fadayev",
      "Yasushi Fukazawa",
      "Manoj Jadhav",
      "Carolyn Kierans",
      "Bobae Kim",
      "Jihee Kim",
      "Henry Klest",
      "Olivia Kroger",
      "Kavic Kumar",
      "Shin Kushima",
      "Jean-Marie Lauenstein",
      "Richard Leys",
      "Forest Martinez-Mckinney",
      "Jessica Metcalfe",
      "Zachary Metzler",
      "John W. Mitchell",
      "Norito Nakano",
      "Jennifer Ott",
      "Ivan Peric",
      "Jeremy S. Perkins",
      "Max R. Rudin",
      "Taylor",
      "Shin",
      "Grant Sommer",
      "Nicolas Striebig",
      "Yusuke Suda",
      "Hiroyasu Tajima",
      "Janeth Valverde",
      "Maria Zurek"
    ],
    "published": "2025-01-20T19:23:56Z",
    "updated": "2025-10-28T16:41:13Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2510.24567v1",
    "url": "https://arxiv.org/abs/2510.24567v1",
    "pdf_url": "https://arxiv.org/pdf/2510.24567v1.pdf",
    "title": "Phase-Space Shaping in Wakefield Accelerators due to Betatron Cooling",
    "abstract": "Plasma-based accelerators are beginning to employ relativistic beams with unprecedented charge and ultrashort durations. These dense driver beams can drive wakes even in high-density plasmas ($\\gtrsim10^{19}$ cm$^{-3}$), where betatron radiation becomes increasingly important and begins to affect the dynamics of the accelerated beam. In this Letter, we show that betatron cooling leads to a strong, structuring of the phase space of the beam. This gives rise to bunched, ring-like structures with positive radial position and momentum gradients, \\emph{i.e.}, population inversion of the amplitude of oscillation. We derive the characteristic timescales for this process analytically and confirm our predictions with multi-dimensional Particle-in-Cell simulations. The radiation-dominated regime of beam dynamics fundamentally alters the acceleration process and produces self-structured beams capable of triggering coherent betatron emission in ion channels.",
    "authors": [
      "Pablo J. Bilbao",
      "Thales Silva",
      "Luis O. Silva"
    ],
    "published": "2025-10-28T15:58:10Z",
    "updated": "2025-10-28T15:58:10Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.24445v1",
    "url": "https://arxiv.org/abs/2510.24445v1",
    "pdf_url": "https://arxiv.org/pdf/2510.24445v1.pdf",
    "title": "Noise Estimation and Suppression in Quantitative EMCD Measurements",
    "abstract": "Quantitative electron magnetic circular dichroism (EMCD) in transmission electron microscopy (TEM) enables the measurement of magnetic moments with elemental and atomic site sensitivity, but its practical application is fundamentally limited by noise. This study presents a comprehensive methodology for noise estimation and suppression in EMCD measurements, demonstrated on Ti-doped barium hexaferrite lamellae. By employing a classical three-beam geometry and long-term acquisition of electron energy-loss spectra, we systematically analyze the signal-to-noise ratio (SNR) across individual energy channels using bootstrap statistics. A robust energy alignment procedure based on the neighboring Ba-M4,5 edges with an adequate energy upsampling is introduced to minimize systematic errors from energy misalignment. The impact of detector noise, particularly from CMOS-based EELS cameras, is evaluated through variance-to-mean analysis and described by the noise amplification coefficients, revealing that detector-amplified shot noise is the dominant noise source. We recommend a stricter SNR threshold for reliable EMCD detection and quantification, ensuring that critical spectral features such as the Fe-L2,3 peaks meet the requirements for quantitative analysis. The approach also provides a framework for determining the minimum electron dose necessary for valid measurements and can be generalized to scintillator-based or direct electron detectors. This work advances the reliability of EMCD as a quantitative tool for magnetic characterization at the nanoscale with unknown magnetic structures. The proposed procedures lay the groundwork for improved error handling and SNR optimization in future EMCD studies.",
    "authors": [
      "Hitoshi Makino",
      "Bernd Rellinghaus",
      "Sebastian Schneider",
      "Axel Lubk",
      "Darius Pohl"
    ],
    "published": "2025-10-28T14:08:57Z",
    "updated": "2025-10-28T14:08:57Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2402.19372v4",
    "url": "https://arxiv.org/abs/2402.19372v4",
    "pdf_url": "https://arxiv.org/pdf/2402.19372v4.pdf",
    "title": "Miniaturized magnetic-field sensor based on nitrogen-vacancy centers",
    "abstract": "The nitrogen-vacancy (NV) center in diamond is a prime candidate for quantum sensing technologies. Here, we present a fully integrated and mechanically robust fiber-based endoscopic sensor with a tip diameter of $1.25 \\mathrm{mm}$. On its tip, a direct laser writing process is used to fixate a diamond containing NV centers above the fiber's core inside a polymer structure. Additionally, a metallic direct laser-written antenna structure next to the fiber facet allows efficient microwave manipulation of NV center spins. The sensor achieves a shot-noise-limited magnetic-field sensitivity of $5.9 \\mathrm{nT}/\\sqrt{\\mathrm{Hz}}$ using a $15 \\mathrm{\\mu m}$-sized microdiamond at a microwave power of $50 \\mathrm{mW}$ and optical power of $2.15 \\mathrm{mW}$. Using lock-in techniques, we measure a sensitivity of $51.8 \\mathrm{nT}/\\sqrt{\\mathrm{Hz}}$. Furthermore, we introduce a dual-fiber concept that enables, in combination with a direct laser-written structure, independent guiding of excitation and fluorescence light and thus reduces background autofluorescence. Moreover, controlled guiding of excitation light to the diamond while avoiding sample illumination may enable operation in light-sensitive environments such as biological tissue. While the demonstrated sensitivity is achieved using a single-fiber configuration, the dual-fiber approach provides a path towards integrating smaller diamonds, where autofluorescence would otherwise limit performance. We demonstrate the capability of vector magnetic field measurements in a magnetic field as used in state-of-the-art ultracold quantum gas experiments, opening a potential field in which high resolution and high sensitivity are necessary.",
    "authors": [
      "Stefan Johansson",
      "Dennis Lönard",
      "Isabel Cardoso Barbosa",
      "Jonas Gutsche",
      "Jonas Witzenrath",
      "Artur Widera"
    ],
    "published": "2024-02-29T17:20:13Z",
    "updated": "2025-10-28T13:44:22Z",
    "categories": [
      "physics.app-ph",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "physics.app-ph"
  },
  {
    "arxiv_id": "2510.24418v1",
    "url": "https://arxiv.org/abs/2510.24418v1",
    "pdf_url": "https://arxiv.org/pdf/2510.24418v1.pdf",
    "title": "ASTAROTH: A Novel Detector for Dark Matter Direct Detection Using   Cryogenic SiPMs",
    "abstract": "The DAMA experiment's long-standing claim of dark matter detection remains a key open issue in astroparticle physics. Independent verification requires NaI(Tl)-based detectors with enhanced low-energy sensitivity. Current detectors rely on photomultiplier tubes (PMTs) which features limited detection efficiency, intrinsic radioactivity, and high noise at keV energies. ASTAROTH is an R&D project that developed a proof of concept NaI(Tl) detector where siliconphotomultipliers (SiPMs) have been used instead of PMTs, offering higher photon detection efficiency, negligible radioactivity, and, most of all, a reduction of two orders of magnitude in the dark noise. The setup includes a custom cryostat operating at approximately 80 K. We report the first characterization of an approximately 360 g NaI(Tl) crystal coupled to a 5 x 5 cm SiPM matrix, yielding 4.5 photoelectrons\\keV after crosstalk correction. This promising result demonstrates the feasibility of SiPM-based readout for NaI(Tl) and paves the way for future large-scale dark matter experiments.",
    "authors": [
      "Edoardo Martinenghi",
      "Valerio Toso",
      "Fabrizio Bruno Armani",
      "Andrea Castoldi",
      "Giuseppe Di Carlo",
      "Luca Frontini",
      "Niccolò Gallice",
      "Chiara Guazzoni",
      "Valentino Liberali",
      "Lorenzo Rutigliani",
      "Alberto Stabile",
      "Krzysztof Szczepaniec",
      "Valeria Trabattoni",
      "Andrea Zani",
      "Davide D'Angelo"
    ],
    "published": "2025-10-28T13:35:01Z",
    "updated": "2025-10-28T13:35:01Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  }
]