{
  "arxiv_id": "2601.18649v1",
  "url": "https://arxiv.org/abs/2601.18649v1",
  "pdf_url": "https://arxiv.org/pdf/2601.18649v1.pdf",
  "title": "Closure models for the feedback of energetic particles on plasma turbulence",
  "abstract": "Energetic particles interact with the plasma surrounding them, resonating with certain plasma waves to stabilize them while destabilizing others, and changing the character of the background turbulence in ways that have not been fully quantified or understood. Interaction with the turbulent background plasma is key to the acceleration of many types of energetic particles including high-energy cosmic rays, solar energetic particles, and pick-up ions. This is a process that would ideally be described by a kinetic model, a type of model that follows a probability distribution function (PDF) for all particles in 7-dimensional space. Because of the high dimensionality of a kinetic model, such simulations use the largest computational resources available, and are yet unable to simulate a realistic number of particles, reach the large scales necessary for astrophysical problems, or use high-precision numerical methods. Two available alternatives to kinetic plasma models have been explored: a multi-fluid model, and a hybrid fluid/Fokker-Planck model. These methods are hampered by the physical modeling of the coupling. We develop a new model, which follows the PDF for all particles; this can be viewed as a step toward physical realism above a multi-fluid MHD model, while also being more computationally efficient than a kinetic model. The equations we develop model both the background plasma and the energetic particles self-consistently. Over the last decade, similar PDF methods have been developed to a high level of sophistication to model reactive flows and turbulent combustion for engineering applications. For treatment of the feedback of the energetic particles on a background plasma, a PDF closure approach should evaluate the mean characteristics, including the density, with better statistical quality than will particle-sampling procedures.",
  "authors": [
    "J. Pratt"
  ],
  "published": "2026-01-26T16:20:21Z",
  "updated": "2026-01-26T16:20:21Z",
  "categories": [
    "astro-ph.HE",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.HE"
}