{
  "arxiv_id": "2601.20907v1",
  "url": "https://arxiv.org/abs/2601.20907v1",
  "pdf_url": "https://arxiv.org/pdf/2601.20907v1.pdf",
  "title": "Performance of the Particle-Identification Silicon-Telescope Array Coupled with the VAMOS++ Magnetic Spectrometer",
  "abstract": "The Particle-Identification Silicon-Telescope Array (PISTA) is a new detection system designed for high-resolution studies of the fission process induced by multi-nucleon transfer in inverse kinematics. It is specifically optimized for experiments with the VAMOS++ magnetic spectrometer at GANIL (Grand Accélérateur National d'Ions Lourds). The array comprises eight trapezoidal $Δ$E-E silicon telescopes arranged in a corolla configuration. Each telescope integrates two single-sided stripped silicon detectors, enabling target-like recoil identification, energy loss measurements, and trajectory reconstruction. Positioned in close proximity to the target, PISTA's compact geometry achieves high-efficiency tracking of target-like recoils produced in multi-nucleon transfer reactions at Coulomb barrier energies. The spatial segmentation of the array allows precise determination of the mass and charge of the target-like nucleus, and excitation energy of fissioning systems. This work presents the particle identification and excitation energy reconstruction performances for the interactions of $^{238}$U beam with $^{12}$C target. An excitation energy resolution of 870 keV (FWHM) was determined together with mass resolution of 1.1\\% (FWHM). The combination of PISTA and VAMOS++ magnetic spectrometer enables unprecedented investigations of the fission process as a function of the excitation energy of the fissioning nucleus, particularly for exotic systems produced in transfer-induced reactions.",
  "authors": [
    "L. Bégué-Guillou",
    "A. Lemasson",
    "P. Morfouace",
    "D. Ramos",
    "J. Taieb",
    "J. D. Frankland",
    "M. Rejmund",
    "G. Fremont",
    "P. Gangnant",
    "A. Cobo-Zarzuelo",
    "N. Kumar",
    "T. Efremov",
    "A. Chatillon",
    "E. Clément",
    "G. De France",
    "A. Francheteau",
    "I. Jangid",
    "C. Lenain",
    "D. Mauss",
    "T. Tanaka",
    "L. Audoin",
    "M. Caamano",
    "B. Errandonea",
    "M. Godio",
    "D. Gruyer",
    "B. Jacquot",
    "M. Lalande",
    "R. C. Malone",
    "A. Munoz",
    "A. P. D. Ramirez",
    "J. L. Rodríguez-Sánchez",
    "C. Schmitt",
    "O. Syrett",
    "C. Surrault",
    "A. P. Tonchev"
  ],
  "published": "2026-01-28T15:49:44Z",
  "updated": "2026-01-28T15:49:44Z",
  "categories": [
    "physics.ins-det",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det"
}