{
  "arxiv_id": "2312.03984v4",
  "url": "https://arxiv.org/abs/2312.03984v4",
  "pdf_url": "https://arxiv.org/pdf/2312.03984v4.pdf",
  "title": "Taking control of compressible modes: bulk viscosity and the turbulent   dynamo",
  "abstract": "Many polyatomic astrophysical plasmas are compressible and out of chemical and thermal equilibrium, introducing a bulk viscosity into the plasma via the internal degrees of freedom of the molecular composition, directly impacting the decay of compressible modes, $\\mathbf{v}_{\\parallel}(\\mathbf{k})$. This is especially important for small-scale, turbulent dynamo processes in the interstellar medium, which are known to be sensitive to the effects of compression. To control the viscous properties of $\\mathbf{v}_{\\parallel}(\\mathbf{k})$, we perform trans-sonic, visco-resistive dynamo simulations with additional bulk viscosity $\\nu_{\\rm bulk}$, deriving a new $\\nu_{\\rm bulk}$ Reynolds number $\\rm{Re}_{\\rm bulk}$, and viscous Prandtl number $\\rm{P}\\nu \\equiv \\rm{Re}_{\\rm bulk} / \\rm{Re}_{\\rm shear}$, where $\\rm{Re}_{\\rm shear}$ is the shear viscosity Reynolds number. We derive a framework for decomposing $E_{\\rm mag}$ growth rates into incompressible and compressible terms via orthogonal tensor decompositions of $\\nabla\\otimes\\mathbf{v}$, where $\\mathbf{v}$ is the fluid velocity. We find that $\\mathbf{v}_{\\parallel}(\\mathbf{k})$ play a dual role, growing and decaying $E_{\\rm mag}$, and that field-line stretching is the main driver of growth, even in compressible dynamos. In the absence of $\\nu_{\\rm bulk}$ ($\\rm{P}\\nu \\to \\infty$), $\\mathbf{v}_{\\parallel}(\\mathbf{k})$ pile up on small-scales, creating a spectral bottleneck, which disappears for $\\rm{P}\\nu \\approx 1$. (abridged). We emphasize the importance of further understanding the role of $\\nu_{\\rm bulk}$ in compressible astrophysical plasmas, which we estimate could be as strong as the shear viscosity in the cold ISM, and highlight that compressible direct numerical simulations without bulk viscosity have unresolved compressible mode dissipation scales.",
  "authors": [
    "James R. Beattie",
    "Christoph Federrath",
    "Neco Kriel",
    "Justin Kin Jun Hew",
    "Amitava Bhattacharjee"
  ],
  "published": "2023-12-07T02:03:51Z",
  "updated": "2025-08-05T17:20:38Z",
  "categories": [
    "astro-ph.GA",
    "astro-ph.HE",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.GA"
}