{
  "arxiv_id": "2507.20756v2",
  "url": "https://arxiv.org/abs/2507.20756v2",
  "pdf_url": "https://arxiv.org/pdf/2507.20756v2.pdf",
  "title": "Measurements of enriched 155 Gd and 157Gd converters with the NMX detector on the nTOF EAR2 beam line at CERN",
  "abstract": "The detectors for the NMX instrument at the European Spallation Source (ESS) in Lund use natural Gd as the neutron converter. In 2024, beam time was obtained at the neutron time-of flight experiment (nTOF) at CERN to study the feasibility of an upgrade to enriched Gd. A 10 x 10 cm^2 prototype of the NMX detector was equipped with two enriched Gd samples (157Gd and 155Gd) that were attached with copper tape to the natural Gd cathode of the detector. Three sets of measurements were taken, with the beam focused on either the natural Gd, the 157Gd, or the 155Gd samples. Using the time-of-flight technique with the subsequent conversion of time-of-flight into energy, the resonant region between 1 eV and 200 eV of the 157Gd and 155Gd cross sections was studied. The peaks in the resonant region were clearly visible, having higher ADC values in the ADC spectrum. Additionally, the resonant peaks had a larger number of counts per energy bin. In the thermal neutron energy range, the count rate at the center of the beam was measured for natural Gd, 157Gd, and 155Gd. Enriched 157Gd showed an efficiency that was between 60 - 180% higher, compared to natural Gd, for neutron wavelengths between 0.8 A and 1.8 A. The measured 60 % increase in efficiency at 1.8 A is lower than expected from simulations (100 %) and previous measurements with solid state detectors (80 %). Gamma background detection, bad focusing, and saturation effects most likely explain this deviation. An upgrade of the natural Gd converter to enriched 157Gd would thus lead to an efficiency increase of at least 60 %. The measurements presented in this paper are the first successful time-of-flight measurements with the NMX detector prototype and the ESS VMM readout.",
  "authors": [
    "D. Pfeiffer",
    "F. M. Brunbauer",
    "I. R. Fehse",
    "A. D. Finke",
    "K. Fissum",
    "K. J. Floethner",
    "D. Janssens",
    "M. Lisowska",
    "H. Muller",
    "E. Oksanen",
    "E. Oliveri",
    "L. Ropelewski",
    "A. Rusu",
    "J. Samarati",
    "L. Scharenberg",
    "M. van Stenis",
    "R. Veenhof",
    "N. Zavaritskaya"
  ],
  "published": "2025-07-28T12:10:42Z",
  "updated": "2026-01-06T20:03:00Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}