{
  "arxiv_id": "2512.04816v2",
  "url": "https://arxiv.org/abs/2512.04816v2",
  "pdf_url": "https://arxiv.org/pdf/2512.04816v2.pdf",
  "title": "Spaceflight KID Readout Electronics for PRIMA",
  "abstract": "We present the design and testing of a prototype multiplexing kinetic inductance detector (KID) readout electronics for the PRobe far-Infrared Mission for Astrophysics (PRIMA) space mission. PRIMA is a Probe-class astrophysics mission concept that will answer fundamental questions about the formation of planetary systems, the co-evolution of stars and supermassive black holes in galaxies, and the rise of heavy elements and dust over cosmic time. The readout electronics for PRIMA must be compatible with operation at Earth-Sun L2 and capable of multiplexing more than 1000 detectors over 2.5 GHz bandwidth while consuming around 30 W per readout chain. The electronics must also be capable of switching between the two instruments, which have different readout bands: the hyperspectral imager (PRIMAger, 2.6-4.9 GHz) and the spectrometer (FIRESS, 0.4-2.4 GHz). The PRIMA readout electronics use high-heritage SpaceCube digital electronics with a build-to-print SpaceCube Mini v3.0 board using a radiation-tolerant Kintex KU060 field programmable gate array (FPGA) and a custom high-speed digitizer board, along with RF electronics that provide filtering and power conditioning. We present the driving requirements for the system, as well as the hardware, firmware, software, and system-level design that meets those requirements.",
  "authors": [
    "Thomas Essinger-Hileman",
    "C. Matt Bradford",
    "Patrick Brown",
    "Sean Bryan",
    "Jesse Coldsmith",
    "Jennifer Corekin",
    "Sumit Dahal",
    "Thomas Devlin",
    "Marc Foote",
    "Draisy Friedman",
    "Alessandro Geist",
    "Jason Glenn",
    "Christopher Green",
    "Tracee Jamison-Hooks",
    "Kevin Horgan",
    "Jared Lucey",
    "Philip Mauskopf",
    "Lynn Miles",
    "Sanetra Bailey Newman",
    "Gerard Quilligan",
    "Cody Roberson",
    "Adrian Sinclair",
    "Salman Sheikh",
    "Eric Weeks",
    "Christopher Wilson",
    "Travis Wise"
  ],
  "published": "2025-12-04T14:05:16Z",
  "updated": "2026-01-06T16:44:18Z",
  "categories": [
    "astro-ph.IM",
    "physics.ins-det"
  ],
  "primary_category": "astro-ph.IM"
}