{
  "arxiv_id": "2601.03354v1",
  "url": "https://arxiv.org/abs/2601.03354v1",
  "pdf_url": "https://arxiv.org/pdf/2601.03354v1.pdf",
  "title": "Extreme-ultraviolet synthesis of nanojet-like ejections due to coalescing flux ropes",
  "abstract": "Detection and characterization of small-scale energetic events such as nanoflares and nanojets remain challenging owing to their short lifetimes, small spatial extent, and relatively low energy release, despite their potential role in coronal heating. Recent observations have identified nanojets as small-scale (length $\\lesssim 6.6$~Mm, width $\\lesssim 1$~Mm), fast ($\\sim$~few 100 km s$^{-1}$), and short-lived ($\\lesssim 30$~s) ejections associated with nanoflare-scale energies, providing evidence of magnetic reconnection at small spatial scales. However, the lack of synthetic diagnostics has limited the connection between magnetohydrodynamic (MHD) models and observations. In this Letter, we present synthetic observations of the coalescence of two flux ropes, leading to nanojet-like signatures from a numerical model obtained with the \\texttt{MPI-AMRVAC} code. We report synthetic observables in Extreme-ultraviolet lines compatible with existing instruments such as SDO/AIA, and upcoming MUSE mission, and compare the synthetic observables with an existing observation of nanojets. The synthetic diagnostics of the emissivity maps, Doppler velocity, thermal, and non-thermal line broadening produce key observational properties, suggesting a plausible 3D scenario for nanojet generation where tiny flux ropes reconnect within loops. Our results provide predictions for the detectability of nanojets with current and future spectroscopic facilities, and establish a bridge between MHD modeling and observations.",
  "authors": [
    "Samrat Sen",
    "A. Ramada C. Sukarmadji",
    "D. Nóbrega-Siverio",
    "F. Moreno-Insertis",
    "J. Martínez-Sykora",
    "Patrick Antolin"
  ],
  "published": "2026-01-06T19:00:21Z",
  "updated": "2026-01-06T19:00:21Z",
  "categories": [
    "astro-ph.SR",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.SR"
}