{
  "arxiv_id": "2601.04967v1",
  "url": "https://arxiv.org/abs/2601.04967v1",
  "pdf_url": "https://arxiv.org/pdf/2601.04967v1.pdf",
  "title": "A Comprehensive multi-species comparison of rotational temperature probes in a DC Ar/N$_2$ micro-hollow cathode discharge",
  "abstract": "Accurate gas temperature ($T_{\\rm Gas}$) determination in microplasmas is critical for optimizing their applications, yet isolated diagnostic approaches may yield misleading results, especially under strong non-equilibrium conditions. Here, high resolution rotational spectra of N$_2$(C), OH(A), NH(A) and NO(A), generated in the plasma jet of a DC Ar/N$_2$ microhollow cathode discharge (MHCD), are recorded and their associated rotational temperatures ($T_{\\rm rot}$) are cross compared. A detailed experimental analysis and robust fitting of the rotational spectra are performed, achieving a reliable estimation of $T_{\\rm Gas}$. The dominant formation mechanisms of these species and their corresponding impact on rotational population distributions are also interrogated. Particularly, our findings indicate that the $T_{\\rm rot}$of N$_2$(C) is significantly influenced by energy transfers from argon metastables (Ar$^m$) and spectral interference from NH(A). This makes it unreliable as a thermometric probe in Ar-rich MHCD, unless complex analyses are employed. In contrast, OH(A) rotational population distribution appears to be less sensitive to Ar-induced perturbations across various discharge currents and pressures, providing more straightforward results. For all molecules considered, this study reveals the conditions under which all the measured $T_{\\rm rot}$ can be reliably considered to be in equilibrium with $T_{\\rm Gas}$. This highlights the importance of crossvalidating multiple thermometric probes and investigating relevant excitation kinetics when measuring $T_{\\rm rot}$ in reactive microplasmas.",
  "authors": [
    "Dimitrios Stefas",
    "Belkacem Menacer",
    "Alice Remigy",
    "Nikolaos Chazapis",
    "Guillaume Lombardi",
    "Claudia Lazzaroni",
    "Kristaq Gazeli"
  ],
  "published": "2026-01-08T14:15:13Z",
  "updated": "2026-01-08T14:15:13Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}