{
  "arxiv_id": "2601.04165v1",
  "url": "https://arxiv.org/abs/2601.04165v1",
  "pdf_url": "https://arxiv.org/pdf/2601.04165v1.pdf",
  "title": "Properties of Magnetic Switchbacks in the Near-Sun Solar Wind",
  "abstract": "Magnetic switchbacks are fluctuations in the solar wind in which the interplanetary magnetic field sharply deflects away from its background direction so as to create folds in magnetic field lines while remaining of roughly constant magnitude. The magnetic field and velocity fluctuations are extremely well correlated in a way corresponding to Alfvénic fluctuations propagating away from the Sun. For a background field which is nearly radial this causes an outwardly propagating jet to form. Switchbacks and their characteristic velocity jets have recently been observed to be nearly ubiquitous by Parker Solar Probe with in situ measurements in the inner heliosphere within 0.3 AU. Their prevalence, substantial energy content, and potentially fundamental role in the dynamics of the outer corona and solar wind motivate the significant research efforts into their understanding. Here we review the in situ measurements of these structures (primarily by Parker Solar Probe). We discuss how they are identified and measured, and present an overview of the primary observational properties of these structures, both in terms of individual switchbacks and their collective arrangement into ``patches''. We identify both properties for which there is a strong consensus and those that have limited or qualified support and require further investigation. We identify and collate several open questions and recommendations for future studies.",
  "authors": [
    "Samuel T. Badman",
    "Naïs Fargette",
    "Lorenzo Matteini",
    "Oleksiy V. Agapitov",
    "Mojtaba Akhavan-Tafti",
    "Stuart D. Bale",
    "Srijan Bharati Das",
    "Nina Bizien",
    "Trevor A. Bowen",
    "Thierry Dudok de Wit",
    "Clara Froment",
    "Timothy Horbury",
    "Jia Huang",
    "Vamsee Krishna Jagarlamudi",
    "Andrea Larosa",
    "Maria S. Madjarska",
    "Olga Panasenco",
    "Etienne Pariat",
    "Nour E. Raouafi",
    "Alexis P. Rouillard",
    "David Ruffolo",
    "Nikos Sioulas",
    "Shirsh Lata Soni",
    "Luca Sorriso-Valvo",
    "Gabriel Ho Hin Suen",
    "Marco Velli",
    "Jaye Verniero"
  ],
  "published": "2026-01-07T18:26:35Z",
  "updated": "2026-01-07T18:26:35Z",
  "categories": [
    "physics.space-ph",
    "astro-ph.SR",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.space-ph"
}