{
  "arxiv_id": "2508.20678v1",
  "url": "https://arxiv.org/abs/2508.20678v1",
  "pdf_url": "https://arxiv.org/pdf/2508.20678v1.pdf",
  "title": "Start-to-end modelling of laser-plasma acceleration, beam transport and   dose deposition of very high-energy electrons for radiotherapy",
  "abstract": "Radiotherapy using very high-energy electron (VHEE) beams generated by a laser-plasma accelerator has garnered significant interest due to its dose distribution capabilities and potential to address limitations of traditional photon-based radiotherapy. To explore the feasibility of such approach, the presented study uses the parameters of OONA, the commercial <1.3\\,J, <25\\,fs pulse duration laser recently installed at the Weizmann Institute of Science. Through particle-in-cell simulations of laser-plasma interaction, realistic electron beams were obtained. After filtering and collimation with a beamline and arranging them into an array of pencil beams, their radiotherapeutic potential was investigated. GEANT4 simulations were used to calculate the dose deposition in water phantoms and heterogeneous phantoms with bone inserts, considering realistic beam parameters for laser-plasma accelerators. Multifield irradiation setup and the dose distribution at the isocenter through different incidence angles were studied, simulating an intensity-modulated delivery. Our findings demonstrate that polychromatic VHEE beams generated from laser-plasma accelerators, when collimated using a compact beamline of quadrupoles and dipoles, can deliver an on-axis dose with enhanced precision and uniformity. This study highlights the transformative potential of laser-plasma accelerators in advancing radiotherapy modalities, paving the way for further research and clinical implementation.",
  "authors": [
    "Rajakrishna Kalvala",
    "Anton Golovanov",
    "Arnaud Courvoisier",
    "Tomer Friling",
    "Eyal Kroupp",
    "Lidan Grishko",
    "Victor Malka"
  ],
  "published": "2025-08-28T11:39:39Z",
  "updated": "2025-08-28T11:39:39Z",
  "categories": [
    "physics.med-ph",
    "physics.acc-ph",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.med-ph"
}