{
  "arxiv_id": "2508.20685v1",
  "url": "https://arxiv.org/abs/2508.20685v1",
  "pdf_url": "https://arxiv.org/pdf/2508.20685v1.pdf",
  "title": "Terahertz control of relativistic electron beams for femtosecond   bunching and laser-synchronized temporal locking",
  "abstract": "Femtosecond relativistic electron bunches and micro-bunch trains synchronised with femtosecond precision to external laser sources are widely sought for next-generation accelerator and photonic technologies, from extreme UV and X-ray light sources for materials science, to ultrafast electron diffraction and future high-energy physics colliders. While few-femtosecond bunches have been demonstrated, achieving the control, stability and femtosecond-level laser synchronisation remains critically out of reach. Here we demonstrate a concept for laser-driven compression of high-energy (35.5 MeV) electron bunches with temporal synchronisation to a high-power (few-TW) laser system. Laser-generated multi-cycle terahertz (THz) pulses drive periodic electron energy modulation, enabling subsequent magnetic compression capable of generating tuneable picosecond-spaced bunch trains with 30 pC total charge and 50 A peak currents, or to compress a single bunch by a factor of 27 down to 15 fs duration. The THz-driven compression simultaneously drives temporal-locking of the bunch to the THz drive laser, providing a route to femtosecond-level synchronisation, overcoming the timing jitter inherent to radio-frequency accelerators and high-power laser systems. This THz technique offers compact and flexible bunch control with unprecedented temporal synchronisation, opening a pathway to unlock new capabilities for free electron lasers, ultrafast electron diffraction and novel plasma accelerators.",
  "authors": [
    "Morgan T. Hibberd",
    "Christopher T. Shaw",
    "Joseph T. Bradbury",
    "Daniel S. Lake",
    "Connor D. W. Mosley",
    "Sergey S. Siaber",
    "Laurence J. R. Nix",
    "Beatriz Higuera-González",
    "Thomas H. Pacey",
    "James K. Jones",
    "David A. Walsh",
    "Robert B. Appleby",
    "Graeme Burt",
    "Darren M. Graham",
    "Steven P. Jamison"
  ],
  "published": "2025-08-28T11:44:14Z",
  "updated": "2025-08-28T11:44:14Z",
  "categories": [
    "physics.acc-ph",
    "physics.app-ph",
    "physics.optics"
  ],
  "primary_category": "physics.acc-ph"
}