{
  "arxiv_id": "2508.18577v1",
  "url": "https://arxiv.org/abs/2508.18577v1",
  "pdf_url": "https://arxiv.org/pdf/2508.18577v1.pdf",
  "title": "Ice-assisted soft-landing deposition for van der Waals integration",
  "abstract": "Van der Waals integration enables the creation of electronic and optoelectronic devices with unprecedented performance and novel functionalities beyond the existing material limitations. However, it is typically realized using a physical pick-up-and-place process to minimize interfacial damages and is hardly integrated into conventional lithography and metallization procedures. Here we demonstrate a simple in situ transfer strategy for van der Waals integration, in which a thin film of amorphous water ice acts as a buffer layer to shield against the bombardment of energetic clusters during metallization. After ice sublimation, the deposited metal film can be gently and in situ placed onto underlying substrates, to form an atomically clean and damage-free metal-semiconductor interface. This strategy allows ultra-clean and non-destructive fabrication of high-quality contacts on monolayer MoS2, which is extremely beneficial to produce a high-performance 2D field-effect transistor with an ultra-high on/off ratio of 1010, mobility of 80 (cm2 V-1s-1), and also with reduced Fermi level pinning effect. We also demonstrate the batch production of CVD-grown MoS2 transistor arrays with uniform electrical characteristics. Such a gentle and ultra-clean fabrication approach has been further extended to materials with high reactivity, such as halide perovskites. Our method can be easily integrated with mature semiconductor manufacturing technology and may become a generic strategy for fabricating van der Waals contacted devices.",
  "authors": [
    "Xinyu Sun",
    "Xiang Xu",
    "BinBin Jin",
    "Yihan Lu",
    "Jichuang Shen",
    "Wei Kong",
    "Ding Zhao",
    "Min Qiu"
  ],
  "published": "2025-08-26T01:07:25Z",
  "updated": "2025-08-26T01:07:25Z",
  "categories": [
    "cond-mat.mtrl-sci",
    "physics.ins-det"
  ],
  "primary_category": "cond-mat.mtrl-sci"
}