{
  "arxiv_id": "2508.20303v1",
  "url": "https://arxiv.org/abs/2508.20303v1",
  "pdf_url": "https://arxiv.org/pdf/2508.20303v1.pdf",
  "title": "Efficient ion re-acceleration in laboratory-produced interpenetrating   collisionless shocks",
  "abstract": "Although the origin of cosmic rays (CRs) remains an open question, collisionless magnetized shock waves are widely regarded as key sites for particle acceleration. Recent theories further suggest that shock-shock collisions in stellar clusters could provide the additional acceleration needed to explain the observed high-energy CR spectrum. Here, we investigate this hypothesis through a laser-based experiment that creates magnetized plasma conditions similar to astrophysical environments. Our results demonstrate that interpenetrating collisionless shocks can significantly boost the energy of ambient protons previously energized by the individual shocks, while also improving the overall acceleration efficiency. Numerical kinetic simulations corroborate these findings, revealing that protons are reaccelerated via their bouncing motion in the convective electric fields of the colliding magnetized flows. By allowing to highly energize ambient protons, our novel colliding-shock platform opens the prospect to test the long-discussed mechanism of diffusive shock acceleration in a controlled laboratory setting.",
  "authors": [
    "W. Yao",
    "I. Cohen",
    "P. Suarez Gerona",
    "H. Ahmed",
    "A. F. A. Bott",
    "S. N. Chen",
    "M. Cook",
    "R. Lelièvre",
    "P. Martin",
    "T. Waltenspiel",
    "P. Antici",
    "J. Béard",
    "M. Borghesi",
    "D. Caprioli",
    "A. Ciardi",
    "E. d'Humières",
    "M. François",
    "L. Gremillet",
    "A. Marcowith",
    "M. Miceli",
    "T. Seebaruth",
    "S. Orlando",
    "J. Fuchs"
  ],
  "published": "2025-08-27T22:34:23Z",
  "updated": "2025-08-27T22:34:23Z",
  "categories": [
    "physics.plasm-ph",
    "astro-ph.HE"
  ],
  "primary_category": "physics.plasm-ph"
}