{
  "arxiv_id": "2508.12077v1",
  "url": "https://arxiv.org/abs/2508.12077v1",
  "pdf_url": "https://arxiv.org/pdf/2508.12077v1.pdf",
  "title": "Reconfigurable miniaturized computational spectrometer enabled by   photoelastic effect",
  "abstract": "Miniatured computational spectrometers, distinguished by their compact size and lightweight, have shown great promise for on-chip and portable applications in the fields of healthcare, environmental monitoring, food safety, and industrial process monitoring. However, the common miniaturization strategies predominantly rely on advanced micro-nano fabrication and complex material engineering, limiting their scalability and affordability. Here, we present a broadband miniaturized computational spectrometer (ElastoSpec) by leveraging the photoelastic effect for easy-to-prepare and reconfigurable implementations. A single computational photoelastic spectral filter, with only two polarizers and a plastic sheet, is designed to be integrated onto the top of a CMOS sensor for snapshot spectral acquisition. The different spectral modulation units are directly generated from different spatial locations of the filter, due to the photoelastic-induced chromatic polarization effect of the plastic sheet. We experimentally demonstrate that ElastoSpec offers excellent reconstruction accuracy for the measurement of both simple narrowband and complex spectra. It achieves a full width at half maximum (FWHM) error of approximately 0.2 nm for monochromatic inputs, and maintains a mean squared error (MSE) value on the order of 10^-3 with only 10 spectral modulation units. Furthermore, we develop a reconfigurable strategy for enhanced spectra sensing performance through the flexibility in optimizing the modulation effectiveness and the number of spectral modulation units. This work avoids the need for complex micro-nano fabrication and specialized materials for the design of computational spectrometers, thus paving the way for the development of simple, cost-effective, and scalable solutions for on-chip and portable spectral sensing devices.",
  "authors": [
    "Linjun Zhai",
    "Baolei Liu",
    "Muchen Zhu",
    "Yao Wang",
    "Chaohao Chen",
    "Zhaohua Yang",
    "Lan Fu",
    "Fan Wang"
  ],
  "published": "2025-08-16T15:25:08Z",
  "updated": "2025-08-16T15:25:08Z",
  "categories": [
    "physics.optics",
    "physics.ins-det"
  ],
  "primary_category": "physics.optics"
}