{
  "arxiv_id": "2508.13112v1",
  "url": "https://arxiv.org/abs/2508.13112v1",
  "pdf_url": "https://arxiv.org/pdf/2508.13112v1.pdf",
  "title": "Quantum sensing of electron beams using solid-state spins",
  "abstract": "Scattering experiments with energetic particles, such as free electrons, have been historically used to reveal the quantum structure of matter. However, realizing coherent interactions between free-electron beams and solid-state quantum systems has remained out of reach, owing to their intrinsically weak coupling. Realizing such coherent control would open up opportunities for hybrid quantum platforms combining free electrons and solid-state qubits for coincident quantum information processing and nanoscale sensing. Here, we present a framework that employs negatively charged nitrogen-vacancy centers (NV-) in diamond as quantum sensors of a bunched electron beam. We develop a Lindblad master equation description of the magnetic free-electron--qubit interactions and identify spin relaxometry as a sensitive probe of the interaction. Experimentally, we integrate a confocal fluorescence microscopy setup into a microwave-bunched electron beam line. We monitor charge-state dynamics and assess their impact on key sensing performance metrics (such as spin readout contrast), defining safe operating parameters for quantum sensing experiments. By performing $T_1$ relaxometry under controlled electron beam exposure, we establish an upper bound on the free-electron--spin coupling strength. Our results establish NV- centers as quantitative probes of free electrons, providing a metrological benchmark for free-electron--qubit coupling under realistic conditions, and chart a route toward solid-state quantum control with electron beams.",
  "authors": [
    "Jakob M. Grzesik",
    "Dominic Catanzaro",
    "Charles Roques-Carmes",
    "Eric I. Rosenthal",
    "Guido L. van de Stolpe",
    "Aviv Karnieli",
    "Giovanni Scuri",
    "Souvik Biswas",
    "Kenneth J. Leedle",
    "Dylan S. Black",
    "Robert L. Byer",
    "Ido Kaminer",
    "R. Joel England",
    "Shanhui Fan",
    "Olav Solgaard",
    "Jelena Vučković"
  ],
  "published": "2025-08-18T17:19:12Z",
  "updated": "2025-08-18T17:19:12Z",
  "categories": [
    "quant-ph",
    "physics.acc-ph",
    "physics.optics"
  ],
  "primary_category": "quant-ph"
}