{
  "arxiv_id": "2508.13193v1",
  "url": "https://arxiv.org/abs/2508.13193v1",
  "pdf_url": "https://arxiv.org/pdf/2508.13193v1.pdf",
  "title": "Quantum biosensing on a multiplexed functionalized diamond microarray",
  "abstract": "Quantum sensing with nitrogen-vacancy (NV) centers in diamond promises to revolutionize biological research and medical diagnostics. Thanks to their high sensitivity, NV sensors could, in principle, detect specific binding events with metabolites and proteins in a massively parallel and label-free way, avoiding the complexity of mass spectrometry. Realizing this vision has been hindered by the lack of quantum sensor arrays that unite high-density spatial multiplexing with uncompromising biochemical specificity. Here, we introduce a scalable quantum biosensing platform that overcomes these barriers by integrating the first multiplexed DNA microarray directly onto a subnanometer antifouling diamond surface. The 7x7 DNA array, patterned onto a diamond chip, enables simultaneous detection of 49 distinct biomolecular features with high spatial resolution and reproducibility, as verified by fluorescence microscopy. Molecular recognition is converted into a quantum signal via a target-induced displacement mechanism in which hybridization removes a Gd$^{3+}$-tagged DNA strand, restoring NV center spin relaxation times (T$_1$) and producing a binary quantum readout. This platform establishes a new paradigm for high-throughput, multiplexed quantum biosensing and opens the door to advanced molecular diagnostics and large-scale quantum sensor networks operable in complex biological environments.",
  "authors": [
    "Ignacio Chi-Durán",
    "Evan J. Villafranca",
    "David Dang",
    "Rachelle Rosiles",
    "Chun Tung Cheung",
    "Zhiran Zhang",
    "Jason P. Cleveland",
    "Peter C. Maurer"
  ],
  "published": "2025-08-15T18:00:00Z",
  "updated": "2025-08-15T18:00:00Z",
  "categories": [
    "physics.ins-det",
    "physics.bio-ph",
    "physics.chem-ph",
    "quant-ph"
  ],
  "primary_category": "physics.ins-det"
}