{
  "arxiv_id": "2509.16401v2",
  "url": "https://arxiv.org/abs/2509.16401v2",
  "pdf_url": "https://arxiv.org/pdf/2509.16401v2.pdf",
  "title": "Quantifying the Effects of Parameters in Widespread SEP Events with   EPREM",
  "abstract": "The Energetic Particle Radiation Environment Model (EPREM) solves the focused transport equation (FTE) on a Lagrangian grid in a frame co-moving with the solar wind plasma and simulates the acceleration and transport of solar energetic particles (SEP) in the heliosphere. When not coupled to an external magnetohydrodynamic model, EPREM functions in an uncoupled mode where an ideal cone-shock is injected into a homogeneous background solar wind. We carried out an analysis of the effects of multiple physical parameters in producing widespread SEP events simulated by the uncoupled EPREM using a relatively simple model of a strong magnetized shock propagating radially outward through the inner heliosphere to produce the requisite MHD quantities for EPREM's sophisticated model of proton acceleration and transport. We compared a baseline simulation with seven variations in which the value of a single parameter differed from its baseline value. All simulations exhibit complex profiles of SEP flux as a function of time and energy, with clear dependence on parameters related to diffusion, mean free path, and shock profile. Moreover, while all simulations exhibit significant longitudinal spread in SEP flux, for certain parameter values there exists a decrease or absence in SEP flux at observers located $\\geq 90^\\circ$ from the shock origin. Relating the differences in SEP flux to the specific values of each parameter in the simulations provides insight into the morphology of observed SEP events and the state of the solar wind through which the driving CME propagates.",
  "authors": [
    "Matthew A. Young",
    "Bala Poduval"
  ],
  "published": "2025-09-19T20:23:20Z",
  "updated": "2025-10-15T22:09:22Z",
  "categories": [
    "astro-ph.SR",
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.SR"
}