{
  "arxiv_id": "2510.14324v1",
  "url": "https://arxiv.org/abs/2510.14324v1",
  "pdf_url": "https://arxiv.org/pdf/2510.14324v1.pdf",
  "title": "Dust-ion-acoustic solitons in an ion-beam-driven dusty magnetoplasma   with adiabatic and nonadiabatic dust charge variations",
  "abstract": "We study the characteristics of small-amplitude nonlinear dust-ion-acoustic (DIA) solitary waves in active magnetized positive-ion-beam-driven dusty plasmas with the effects of nonadiabatic and adiabatic dust charge variations. In the model, we consider the ion-neutral collision and thereby consider the collision enhanced ion current to the dust-charging process and dust charge fluctuations. We show that the streaming of the positive-ion beam significantly affects the dust-charging process in which the dust charge number decreases (increases) with an increased beam velocity (number density). Using the standard reductive perturbation technique, we derive the evolution equations in the form of Korteweg-de Vries (KdV) equations for DIA solitary waves for two different cases: nonadiabatic and adiabatic dust charge variations. We study the effect of positive ion beam, dust charge variation, magnetic field, ion creation, and ion-neutral collision enhanced current on the wave characteristics. We find that the soliton energy decays with time and is affected by the beam velocity. Also, the solitary waves get damped by the effects of ion creation, ion loss, ion-neutral collision enhanced current, and dust charge variation. Although the ion beam does not change the polarity of solitary waves in the case of adiabatic dust charge variation, a transition from rarefactive to compressive solitary waves occurs in the presence of an ion beam with nonadiabatic dust charge variation.",
  "authors": [
    "N. P. Acharya",
    "S. Basnet",
    "A. P. Misra",
    "R. Khanal"
  ],
  "published": "2025-10-16T05:45:23Z",
  "updated": "2025-10-16T05:45:23Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": "10.1109/TPS.2025.3615612"
}