{
  "arxiv_id": "2510.13505v1",
  "url": "https://arxiv.org/abs/2510.13505v1",
  "pdf_url": "https://arxiv.org/pdf/2510.13505v1.pdf",
  "title": "Attosecond Waveform Synthesis through Echo-enabled Harmonic Generation   Free-electron Lasers",
  "abstract": "Attosecond pulse trains (APTs) are indispensable for probing electron dynamics at their intrinsic timescales. High harmonic generation (HHG) has long been a successful and widely used technique in producing extreme ultraviolet APTs. While in the soft X-ray regime, HHG suffers from low conversion efficiency and lacking flexibility in the waveform and spectrum control. Here in this study, based on the waveform synthesis of the echo-enabled harmonic generation (EEHG) free-electron laser (FEL), we propose a novel method that can generate soft X-ray APTs with high temporal and spectral tunability. EEHG scheme is well-known in forming phase-locked high harmonic bunching combs down to the soft X-ray regime. And We can facilitate successive FEL lasing in several different harmonic numbers and then perform the coherent waveform synthesis to generate soft X-ray APTs. Three-dimensional simulation results indicate that reproducible generation of coherent APTs in the soft X-ray regime with peak power of 3.5 GW and micropulse duration of 160 as can be achieved by five-harmonic synthesis. And the micropulse duration together with the spectral components of the APTs can be adjusted easily according to the programmable high harmonic bunching combs in the EEHG scheme. This method has the potential to establish a robust platform for attosecond sciences in the soft X-ray regime, which can enable unprecedented studies of electron dynamics in physical and chemical reactions, biological systems and quantum materials.",
  "authors": [
    "Lanpeng Ni",
    "Junhao Liu",
    "Zheng Qi",
    "Chao Feng"
  ],
  "published": "2025-10-15T12:55:32Z",
  "updated": "2025-10-15T12:55:32Z",
  "categories": [
    "physics.acc-ph"
  ],
  "primary_category": "physics.acc-ph"
}