{
  "arxiv_id": "2510.14258v1",
  "url": "https://arxiv.org/abs/2510.14258v1",
  "pdf_url": "https://arxiv.org/pdf/2510.14258v1.pdf",
  "title": "Kinetic Scale Energy Budget in Turbulent Plasmas: Role of Electron to   Ion Temperature Ratio",
  "abstract": "The dissipation mechanisms in weakly collisional plasmas have been a longstanding topic of investigation, where significant progress has been made in recent years. A recent promising development is the use of the \"scale-filtered\" Vlasov-Maxwell equations to fully quantify the scale-by-scale energy balance, a feature that was absent when using fluid models in kinetic plasmas. In particular, this method reveals that the energy transfer in kinetic scales is fully accounted for by the scale-filtered pressure-strain interaction. Despite this progress, the influence of ion-electron thermal disequilibrium on the kinetic-scale energy budget remains poorly understood. Using two-dimensional fully kinetic particle-in-cell simulations of decaying plasma turbulence, we systematically investigate the pressure-strain interaction and its components at sub-ion scales by varying electron-to-ion temperature ratios. Our analysis focuses on three key ingredients of the pressure-strain interaction: the normal and shear components of Pi-D and pressure dilatation. Our results demonstrate that the scale-filtered pressure-strain interaction is dominated by scale-filtered Pi-D across the kinetic range, with the shear component consistently providing the dominant contribution. We find that the scale-filtered normal and shear contributions of Pi-D exhibit persistent anticorrelation and opposite signs across all kinetic scales. We also discover that the amplitude of both anisotropic components for each species scales directly with their temperature and inversely with the temperature of the other species, while the scale-filtered pressure dilatation remains negligible compared to the Pi-D terms but shows enhanced compressibility effects as plasma temperatures decrease. We discuss the implications of these findings in thermally non-equilibrated plasmas, such as in the turbulent magnetosheath and solar wind.",
  "authors": [
    "Subash Adhikari",
    "M. Hasan Barbhuiya"
  ],
  "published": "2025-10-16T03:16:31Z",
  "updated": "2025-10-16T03:16:31Z",
  "categories": [
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "physics.plasm-ph"
}