{
  "arxiv_id": "2512.24760v1",
  "url": "https://arxiv.org/abs/2512.24760v1",
  "pdf_url": "https://arxiv.org/pdf/2512.24760v1.pdf",
  "title": "Runaway electron avalanche and macroscopic beam formation: simulations of the DTT full power scenario",
  "abstract": "The transition of the Divertor Tokamak Test (DTT) facility from its initial commissioning phase (Day-0, plasma current $I_{p}=2$ MA) to the full power scenario ($I_{p}=5.5$ MA) introduces a critical shift in the dynamics of runaway electrons (REs) generation. While previous predictive studies of the low-current scenario indicated a robust safety margin against RE beam formation, this work reveals that the exponential scaling of the RE avalanche gain with plasma current severely narrows the safe operational window in the full power scenario. Using the non-linear magnetohydrodynamic code JOREK, we perform comprehensive 2D simulations of the current quench (CQ) phase of several disruption scenarios, systematically scanning initial RE seed currents and injected impurity levels. The results demonstrate that in the full power scenario, the avalanche multiplication factor is sufficiently high ($G_\\text{av} \\approx 1.3 \\cdot 10^5$) to convert a mere 5.5 A seed current into macroscopic RE beams of $\\approx 0.7$ MA when large amounts of impurities are present. For even higher RE seeds, the RE current can peak at $ \\approx 3.2$ MA, constituting up to $\\approx$ 80% of the total plasma current during the CQ. These findings suggest that, unlike the Day-0 phase, the disruption mitigation strategy for the full power scenario involves a careful balance between thermal load mitigation and RE avoidance, necessitating a well-chosen quantity of injected impurities. This work provides the baseline needed for future estimations of RE loads on the plasma-facing components of DTT, which will be essential for designing and positioning mitigation components like sacrificial limiters.",
  "authors": [
    "E. Emanuelli",
    "F. Vannini",
    "M. Hoelzl",
    "E. Nardon",
    "V. Bandaru",
    "N. Schwarz",
    "D. Bonfiglio",
    "G. Ramogida",
    "F. Subba",
    "JOREK Team"
  ],
  "published": "2025-12-31T10:09:27Z",
  "updated": "2025-12-31T10:09:27Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}