{
  "arxiv_id": "2512.23433v1",
  "url": "https://arxiv.org/abs/2512.23433v1",
  "pdf_url": "https://arxiv.org/pdf/2512.23433v1.pdf",
  "title": "Ab initio recombination in the expanding ultracold plasmas",
  "abstract": "The efficiency of recombination is of crucial importance for the existence of ultracold plasmas, particularly, the ones formed in the magneto-optical traps. Unfortunately, a straightforward simulation of the recombination encounters the problem of huge difference in the spatial and temporal scales for free and bound motion of the electrons. As a result, only the \"virtual\" electron-ion pairs are usually reproduced in such simulations, and it is necessary to employ some additional criteria to identify them with the recombined atoms (this might be a minimal number of revolutions of the electron about the nearest ion or a maximal distance between them). It is the aim of this paper to present the first successful ab initio simulation of the recombination without any auxiliary assumptions. We employed a special algorithm, which was based on: (i) using the \"scalable\" reference frame, co-moving with the expanding plasma, (ii) dynamical choice of the number of \"mirror\" cells, taking into account in calculation of the Coulomb sums, and (iii) accurate treatment of the singular interparticle interactions, without any truncation or \"softening\" of the Coulomb forces. Then, the recombination events are identified by a series of sharp equidistant peaks in the kinetic and/or potential energies for a sample of particles, which are caused by the captured electrons passing near the pericenters of their orbits; and this is confirmed by a detailed inspection of the particle trajectories. Thereby, we were able to trace formation of the real - rather than \"virtual\" - electron-ion pairs. The total efficiency of recombination for the realistic experimental conditions was found to be about 20%, which is in perfect agreement both with the laboratory measurements and with the earlier semi-empirical simulations.",
  "authors": [
    "Yurii V. Dumin",
    "Ludmila M. Svirskaya"
  ],
  "published": "2025-12-29T12:51:53Z",
  "updated": "2025-12-29T12:51:53Z",
  "categories": [
    "physics.plasm-ph",
    "physics.comp-ph"
  ],
  "primary_category": "physics.plasm-ph"
}