{
  "arxiv_id": "2512.23885v1",
  "url": "https://arxiv.org/abs/2512.23885v1",
  "pdf_url": "https://arxiv.org/pdf/2512.23885v1.pdf",
  "title": "Control and read-out of the HEPD-02 tracking system onboard CSES-02 satellite",
  "abstract": "The High Energy Particle Detector (HEPD-02) is a payload of the second China Seismo-Electromagnetic Satellite (CSES-02), designed and built by the Italian Limadou collaboration. Its purpose is to detect cosmic rays and trapped particles of radiation belts, in the kinetic energy range 3-100 MeV for electrons, 30-200 MeV for protons. HEPD-02 is the first space detector to use a tracking detector based on Monolithic Active Pixel Sensors (MAPS). The MAPS provides high spatial resolution, low noise, increased robustness, and low production costs. Operating MAPS in space presents a significant challenge due to strict power consumption requirements. To meet such constraints, a custom Tracker Data Acquisition (TDAQ) board and firmware have been designed and implemented, by using a commercial low-power Field Programmable Gate Array (FPGA). This paper addresses the design features of the TDAQ unit, enabling the tracking detector to be operated efficiently, with particular focus on the power consumption performance.",
  "authors": [
    "S. Bartocci",
    "R. Battiston",
    "S. Beolè",
    "F. Benotto",
    "P. Cipollone",
    "S. Coli",
    "A. Contin",
    "M. Cristoforetti",
    "C. De Donato",
    "C. De Santis",
    "A. Di Luca",
    "F. Dumitrache",
    "F. M. Follega",
    "S. Garrafa Botta",
    "G. Gebbia",
    "R. Iuppa",
    "A. Lega",
    "M. Lolli",
    "G. Masciantonio",
    "M. Mergè",
    "M. Mese",
    "R. Nicolaidis",
    "F. Nozzoli",
    "A. Oliva",
    "G. Osteria",
    "F. Palma",
    "F. Palmonari",
    "B. Panico",
    "S. Perciballi",
    "F. Perfetto",
    "P. Picozza",
    "M. Pozzato",
    "E. Ricci",
    "M. Ricci",
    "S. B. Ricciarini",
    "Z. Sahnoun",
    "U. Savino",
    "V. Scotti",
    "E. Serra",
    "A. Sotgiu",
    "R. Sparvoli",
    "P. Ubertini",
    "V. Vilona",
    "S. Zoffoli",
    "P. Zuccon"
  ],
  "published": "2025-12-29T22:22:39Z",
  "updated": "2025-12-29T22:22:39Z",
  "categories": [
    "physics.ins-det",
    "astro-ph.IM"
  ],
  "primary_category": "physics.ins-det"
}