{
  "arxiv_id": "2412.16824v2",
  "url": "https://arxiv.org/abs/2412.16824v2",
  "pdf_url": "https://arxiv.org/pdf/2412.16824v2.pdf",
  "title": "Ion-Scale Solitary Structures in the Solar Wind Observed by Solar Orbiter and Parker Solar Probe",
  "abstract": "We investigate a class of ion-scale magnetic solitary structures in the solar wind, characterized by distinct magnetic field enhancements and bipolar rotations over spatial scales of several proton inertial lengths. These structures are revisited using high-resolution data from the Solar Orbiter and Parker Solar Probe missions. Using a machine learning-based method, we identified nearly a thousand such structures, providing new insights into their evolution and physical properties. Statistical analysis shows that these structures are more abundant closer to the Sun, with occurrence rates peaking around (30 - 40, R_sun) and decreasing farther out. High-cadence measurements reveal that these structures are predominantly found in low-beta (beta <= 1) environments, with consistent fluctuations in density, velocity, and magnetic field. Magnetic field enhancements are often accompanied by plasma density drops, which, under near pressure balance, limit field increases. This leads to small fractional field enhancements near the Sun (approximately 0.01 at 20 R_sun), making detection challenging. Magnetic field variance analysis indicates that these structures are primarily oblique to the local magnetic field. Alfvénic velocity-magnetic field correlations suggest that most of these structures, unlike most near-Sun solar wind fluctuations, exhibit sunward-directed Alfvénic polarization in the plasma frame. We compare these findings with previous studies, discussing possible generation mechanisms and their implications for the turbulent cascade in the near-Sun Alfvénic solar wind. While these structures might be Alfvénic solitons, vortices, or flux ropes, we refrain from a definitive classification pending further evidence. Further high-resolution observations and simulations are needed to fully understand their origins and impacts.",
  "authors": [
    "Yufei Yang",
    "Timothy S. Horbury",
    "Domenico Trotta",
    "Lorenzo Matteini",
    "Joseph H. Wang",
    "Andrey Fedorov",
    "Philippe Louarn",
    "Stuart Bale",
    "Marc Pulupa",
    "Davin E. Larson",
    "Roberto Livi",
    "Michael Stevens",
    "Milan Maksimovic",
    "Yuri Khotyaintsev",
    "Andrea Larosa"
  ],
  "published": "2024-12-22T02:06:22Z",
  "updated": "2025-11-21T12:26:16Z",
  "categories": [
    "physics.space-ph",
    "astro-ph.SR",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.space-ph",
  "doi": "10.3847/2041-8213/ae173a"
}