{
  "arxiv_id": "2509.11749v2",
  "url": "https://arxiv.org/abs/2509.11749v2",
  "pdf_url": "https://arxiv.org/pdf/2509.11749v2.pdf",
  "title": "Helical Core Formation and MHD Stability in ITER-Scale Plasmas with Fusion-born Alpha Particles",
  "abstract": "The effect of fusion-born alpha particles on the helical core (HC), a long-lived ideal saturation state of the $m/n=1/1$ kink/quasi-interchange mode, is studied in the ITER-scale hybrid scenario where a core plasma has a low magnetic shear $q\\gtrsim1$. The HC state is determined by 3-D MHD force balance and all factors that contribute to it, such as plasma shaping, the safety factor profile, and the pressure profiles of all particle species. An incomplete but useful measure of the HC is the displacement of the magnetic axis, $δ_\\mathrm{HC}$. Using MHD-PIC simulations, we find that $δ_\\mathrm{HC}$ is enhanced by increasing alpha particle pressure $β_\\mathrmα$. Within the ITER operating alpha pressure $β_\\mathrmα(0) \\lesssim 1\\%$, $β_\\mathrmα$ can be approximately treated as part of the total MHD pressure. In this regime, there is no notable flattening of the pressure profile, indicating that the HC preserves the omnigenity of the plasma. If one increases $β_\\mathrmα(0)$ beyond $1\\%$, $δ_\\mathrm{HC}$ continues to increase with $β_\\mathrmα$ until it reaches an upper limit at $β_\\mathrmα(0)=3\\%$ for our reference case. At this limit, both the bulk and alpha pressure profiles are partially flattened, indicating a reduction in omnigenity. After HC formation, a resistive pressure-driven MHD mode can become unstable, which is localized along the compressed magnetic flux region of the HC. This secondary mode consists of a broad spectrum of short-wavelength Fourier components that grow at same rates and are thus part of a single coherent entity. Our present simulation model is insufficient to adequately represent such a secondary mode; however, preliminary results suggest that it can facilitate magnetic chaos, which affects plasma confinement.",
  "authors": [
    "P. Adulsiriswad",
    "A. Bierwage",
    "M. Yagi"
  ],
  "published": "2025-09-15T10:00:33Z",
  "updated": "2025-11-21T13:59:04Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}