{
  "arxiv_id": "2511.17324v1",
  "url": "https://arxiv.org/abs/2511.17324v1",
  "pdf_url": "https://arxiv.org/pdf/2511.17324v1.pdf",
  "title": "First operation of poly(ethylene naphthalate) enclosures for high-purity germanium detectors in liquid argon for $^{42}$K/$^{42}$Ar mitigation",
  "abstract": "Commercial argon contains cosmogenic $^{42}$Ar whose progeny $^{42}$K is a critical background component for the Large Enriched Germanium Experiment for Neutrinoless $ββ$ Decay (LEGEND). LEGEND operates High-Purity Germanium (HPGe) detectors bare in liquid argon. $^{42}$K is attracted by the HPGe detectors' electric fields, and drifts toward the germanium surface, where it undergoes beta decay. LEGEND-1000 will mitigate $^{42}$K-induced background by using underground-sourced argon, depleted in cosmogenic isotopes. If underground argon is not available, mitigation techniques must be employed. Poly(ethylene naphthalate) (PEN) enclosures were proposed to hinder the ion drift, decrease the beta-particle's energy, and produce scintillation light. In this paper, we report on operating two HPGe detectors, both bare and PEN-enclosed, in $^{42}$Ar-enriched liquid argon, and find no evidence for deterioration of energy stability or resolution due to the enclosures. We monitor the beta and gamma rates of $^{42}$K, find complex time-dependencies extending to roughly 30 days after applying the HPGe detectors' high-voltage, and qualitatively demonstrate the $^{42}$K suppression capabilities of enclosures.",
  "authors": [
    "Christoph Vogl",
    "Tommaso Comellato",
    "Konstantin Gusev",
    "Brennan Hackett",
    "Patrick Krause",
    "Andreas Leonhardt",
    "Bela Majorovits",
    "Niko N. P. N. Lay",
    "Moritz Neuberger",
    "Nadezda Rumyantseva",
    "Mario Schwarz",
    "Michael Willers",
    "Stefan Schönert"
  ],
  "published": "2025-11-21T15:43:52Z",
  "updated": "2025-11-21T15:43:52Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}