{
  "arxiv_id": "2511.18308v1",
  "url": "https://arxiv.org/abs/2511.18308v1",
  "pdf_url": "https://arxiv.org/pdf/2511.18308v1.pdf",
  "title": "Radiation tolerance test and damage of single-crystal CVD Diamond sensor under high fluence particles",
  "abstract": "Single-crystal chemical vapor deposition (CVD) diamond is a promising material for radiation detectors operating in extreme environments, owing to its outstanding radiation hardness. As nuclear and high-energy physics applications demand particle detectors that withstand higher radiation fluences, understanding the damage thresholds and degradation mechanisms of diamond-based detectors is essential. In this study, single-crystal CVD diamond sensors were exposed to fast neutron irradiation at fluences up to $3.3\\times10^{17}$ ${n/cm^2}$. Modules exhibited stable output confirming potential for application in future high-dose radiation environments. The dominant defects were identified as point defects including <100> self interstitials, vacancies, and lattice disorder. Macroscopic defects including nanocavities and cracks were observed with areal densities approaching $10^7$ $cm^{-2}$. The impact of 100 MeV proton irradiation on diamond detector response was quantified by extracting a damage constant of $k^{100 MeV}_{proton}=(1.452\\pm0.006)\\times10^{-18}cm^2/(p\\cdotμm)$ from a linear carrier drift degradation model. The mean free path of carriers was found to exhibit saturation behavior beyond a fluence of $4\\times10^{16}$ ${p/cm^2}$ under 100 MeV proton irradiation. Monte Carlo together with molecular dynamics simulations were performed to assess irradiation induced defect and its influence on carrier transport. By considering saturation effects and defect-interaction corrections, we develop an enhanced carrier-drift degradation model that accurately captures detector response under high-dose irradiation. Furthermore, the simulation framework was applied to evaluate damage induced by protons and pions on diamond at various energies, yielding results that show better agreement with experimental data than conventional NIEL based estimates.",
  "authors": [
    "Jialiang Zhang",
    "Shuo Li",
    "Yilun Wang",
    "Shuxian Liu",
    "Guojun Yu",
    "Zifeng Xu",
    "Lifu Hei",
    "Fanxiu Lv",
    "Lei Zhang",
    "Ming Qi"
  ],
  "published": "2025-11-23T06:41:18Z",
  "updated": "2025-11-23T06:41:18Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}