{
  "arxiv_id": "2511.17287v1",
  "url": "https://arxiv.org/abs/2511.17287v1",
  "pdf_url": "https://arxiv.org/pdf/2511.17287v1.pdf",
  "title": "The impact of ionising collisions on channeling and radiation emission for high-energy electrons and positrons",
  "abstract": "This paper presents a quantitative analysis of the impact of inelastic collisions with atoms in a crystalline environment on the channeling efficiency and intensity of the channeling radiation for high-energy electrons and positrons passing through oriented crystalline targets. This analysis is based on numerical simulations of the channeling process, which were performed using the MBN Explorer software package. Ionising collisions are considered random, fast and local events, and are incorporated into the classical relativistic molecular dynamics framework according to the previously described algorithm. The case studies presented refer to 10 GeV electrons and positrons incident on single crystals of diamond and silicon, oriented along the (110) and (111) planes, with thicknesses of up to 1 mm for electrons and 6 mm for positrons. To elucidate the role of ionising collisions, simulations were performed with and without accounting for them. It is shown that, for electrons, both approaches lead to similar results with regard to both the channelling efficiency and the radiation intensity. In practical terms, this means that numerical simulations can be carried out without accounting for ionising collisions, which are much faster yet produce similar results. For positrons, the ionising collisions reduce significantly the channeling efficiency. However, their impact on the radiation intensity strongly depends on the opening angle of the cone within which the radiation emission is collected. A quantitative analysis of this feature is presented in the paper.",
  "authors": [
    "Andrei V. Korol",
    "Andrey V. Solov'yov"
  ],
  "published": "2025-11-21T14:52:56Z",
  "updated": "2025-11-21T14:52:56Z",
  "categories": [
    "physics.acc-ph",
    "physics.atom-ph",
    "physics.comp-ph"
  ],
  "primary_category": "physics.acc-ph"
}