[
  {
    "arxiv_id": "2511.18308v1",
    "url": "https://arxiv.org/abs/2511.18308v1",
    "pdf_url": "https://arxiv.org/pdf/2511.18308v1.pdf",
    "title": "Radiation tolerance test and damage of single-crystal CVD Diamond sensor under high fluence particles",
    "abstract": "Single-crystal chemical vapor deposition (CVD) diamond is a promising material for radiation detectors operating in extreme environments, owing to its outstanding radiation hardness. As nuclear and high-energy physics applications demand particle detectors that withstand higher radiation fluences, understanding the damage thresholds and degradation mechanisms of diamond-based detectors is essential. In this study, single-crystal CVD diamond sensors were exposed to fast neutron irradiation at fluences up to $3.3\\times10^{17}$ ${n/cm^2}$. Modules exhibited stable output confirming potential for application in future high-dose radiation environments. The dominant defects were identified as point defects including <100> self interstitials, vacancies, and lattice disorder. Macroscopic defects including nanocavities and cracks were observed with areal densities approaching $10^7$ $cm^{-2}$. The impact of 100 MeV proton irradiation on diamond detector response was quantified by extracting a damage constant of $k^{100 MeV}_{proton}=(1.452\\pm0.006)\\times10^{-18}cm^2/(p\\cdotμm)$ from a linear carrier drift degradation model. The mean free path of carriers was found to exhibit saturation behavior beyond a fluence of $4\\times10^{16}$ ${p/cm^2}$ under 100 MeV proton irradiation. Monte Carlo together with molecular dynamics simulations were performed to assess irradiation induced defect and its influence on carrier transport. By considering saturation effects and defect-interaction corrections, we develop an enhanced carrier-drift degradation model that accurately captures detector response under high-dose irradiation. Furthermore, the simulation framework was applied to evaluate damage induced by protons and pions on diamond at various energies, yielding results that show better agreement with experimental data than conventional NIEL based estimates.",
    "authors": [
      "Jialiang Zhang",
      "Shuo Li",
      "Yilun Wang",
      "Shuxian Liu",
      "Guojun Yu",
      "Zifeng Xu",
      "Lifu Hei",
      "Fanxiu Lv",
      "Lei Zhang",
      "Ming Qi"
    ],
    "published": "2025-11-23T06:41:18Z",
    "updated": "2025-11-23T06:41:18Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.16185v2",
    "url": "https://arxiv.org/abs/2511.16185v2",
    "pdf_url": "https://arxiv.org/pdf/2511.16185v2.pdf",
    "title": "Multiplexed SiPM Readout of Plastic Scintillating Fiber Detector for Muon Tomography",
    "abstract": "Muon tomography is a non-destructive imaging technique that uses cosmic-ray muons to probe dense materials. A plastic Scintillating Fiber (SciFi) detector with a one-dimensional SiPM array offers a compact and high-resolution solution. However, constructing a large-area SciFi detector demands reducing the number of readout channels while maintaining detector performance. To address this challenge, we present a multiplexing scheme based on a diode-based symmetric charge division circuit combined with a position-encoding algorithm, enabling up to $N_{\\textrm{SiPM}}^{\\textrm{max}}=C^{2}_{N_{\\textrm{ele}}}$ SiPM channels to be read out using only ${N_{\\textrm{ele}}}$ electronic channels. Circuit simulations confirm the feasibility of the multiplexing design and guide the choice of appropriate diodes to preserve SiPM signal integrity. A multiplexed SciFi detector module comprising 21 SiPM channels read out through 7 electronic channels are constructed. Electronic tests show that this module exhibits low crosstalk between electronic channels, and preserves linearity over a dynamic range from $\\sim$10 to 122 photoelectrons. Cosmic-ray measurements further show that the multiplexed SciFi detector achieves a detection efficiency above 95\\% and a spatial resolution of about 0.65~mm, with only minor degradation compared to the direct (per SiPM channel) readout. These results verify that the proposed method provides a scalable and cost-effective readout solution for large-area muon tomography systems.",
    "authors": [
      "Chenghan Lv",
      "Kun Hu",
      "Huiling Li",
      "Hui Liang",
      "Cong Liu",
      "Hongbo Wang",
      "Zibing Wu",
      "Weiwei Xu"
    ],
    "published": "2025-11-20T09:50:13Z",
    "updated": "2025-11-23T02:09:26Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.18044v1",
    "url": "https://arxiv.org/abs/2511.18044v1",
    "pdf_url": "https://arxiv.org/pdf/2511.18044v1.pdf",
    "title": "Space-Charge Effects During Half-Integer Resonance Crossing in the CERN PSB",
    "abstract": "The survival of charged particles in synchrotrons requires avoiding setting the beam on machine resonances, the most dangerous of which are the integer and half-integer. Nevertheless, operationally, the transverse tunes may change dynamically, crossing these resonances, and resulting in unwanted beam quality degradation and beam loss. For high intensity beams the process of resonance crossing is even more critical as space charge, in addition to the incoherent effects, may generate also coherent effects on the beam envelope dynamics. The interplay of the speed of resonance crossing, the space charge incoherent tune spread, and half-integer resonance width are fundamental for the beam behavior. In this paper we study the crossing of the half-integer resonance $2Q_y=9$ in the CERN Proton Synchrotron Booster~(PSB) for a range of parameters using a coasting beam. We take advantage of the newly commissioned PSB to investigate the beam response experimentally. The experimental findings are also discussed with the support of simulations.",
    "authors": [
      "Tirsi Prebibaj",
      "Fanouria Antoniou",
      "Foteini Asvesta",
      "Hannes Bartosik",
      "Giuliano Franchetti"
    ],
    "published": "2025-11-22T12:48:26Z",
    "updated": "2025-11-22T12:48:26Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.02939v2",
    "url": "https://arxiv.org/abs/2511.02939v2",
    "pdf_url": "https://arxiv.org/pdf/2511.02939v2.pdf",
    "title": "Characterization of the first full-size production for ePIC TOF layers",
    "abstract": "Low-Gain Avalanche Detectors (LGADs) are characterized by a fast rise time (500 ps) and extremely good time resolution (down to 17 ps). The intrinsic low granularity of LGADs and the large power consumption of readout chips for precise timing are problematic in near-future experiments such as e+e- Higgs factories (FCC-ee) and the ePIC detector at the Electron-Ion Collider. AC-coupled LGADs, where the readout metal is AC-coupled through an insulating oxide layer, could solve both issues at the same time thanks to the 100% fill factor and charge-sharing capabilities. Charge sharing between electrodes allows a hit position resolution well below the pitch/$\\sqrt12$ of standard segmented detectors. At the same time, it relaxes the channel density and power consumption requirements of readout chips. Extensive laboratory characterization of AC-LGAD devices from the first full-size (up to 3x4 cm) production from HPK for ePIC will be shown in this contribution. Both pixel and strip geometry was produced and tested. This study was conducted within the scope of the ePIC detector time of flight (TOF) layer R&D program at the EIC.",
    "authors": [
      "M. Davis",
      "G. Stage",
      "A. Borjigin",
      "S. Beringer",
      "N. Lynch",
      "S. Nakarmi",
      "C. Galmes Altafulla",
      "A. Drumm",
      "A. Molnar",
      "A. Tiernan",
      "S. M. Mazza",
      "H. Sadrozinski",
      "B. A. Schumm",
      "A. Seiden",
      "F. MartinezMckinney",
      "T. Shin"
    ],
    "published": "2025-11-04T19:40:16Z",
    "updated": "2025-11-22T10:28:57Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.17850v1",
    "url": "https://arxiv.org/abs/2511.17850v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17850v1.pdf",
    "title": "Efficient Dynamic and Momentum Aperture Optimization for Lattice Design Using Multipoint Bayesian Algorithm Execution",
    "abstract": "We demonstrate that multipoint Bayesian algorithm execution can overcome fundamental computational challenges in storage ring design optimization. Dynamic (DA) and momentum (MA) optimization is a multipoint, multiobjective design task for storage rings, ultimately informing the flux of x-ray sources and luminosity of colliders. Current state-of-art black-box optimization methods require extensive particle-tracking simulations for each trial configuration; the high computational cost restricts the extent of the search to $\\sim 10^3$ configurations, and therefore limits the quality of the final design. We remove this bottleneck using multipointBAX, which selects, simulates, and models each trial configuration at the single particle level. We demonstrate our approach on a novel design for a fourth-generation light source, with neural-network powered multipointBAX achieving equivalent Pareto front results using more than two orders of magnitude fewer tracking computations compared to genetic algorithms. The significant reduction in cost positions multipointBAX as a promising alternative to black-box optimization, and we anticipate multipointBAX will be instrumental in the design of future light sources, colliders, and large-scale scientific facilities.",
    "authors": [
      "Z. Zhang",
      "I. Agapov",
      "S. Gasiorowski",
      "T. Hellert",
      "W. Neiswanger",
      "X. Huang",
      "D. Ratner"
    ],
    "published": "2025-11-22T00:32:44Z",
    "updated": "2025-11-22T00:32:44Z",
    "categories": [
      "physics.acc-ph",
      "cs.LG"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.17788v1",
    "url": "https://arxiv.org/abs/2511.17788v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17788v1.pdf",
    "title": "WavePID: Studies of DOM-level waveform timing for track vs. cascade discrimination in IceCube at 5-100 GeV",
    "abstract": "The IceCube Neutrino Observatory is a cubic-kilometer Cherenkov detector embedded in the Antarctic ice at the South Pole. Its densely instrumented sub-array and dedicated low-energy analyses provide sensitivity to neutrinos in the 5-100 GeV range, enabling precision studies of neutrino oscillations and searches for new physics. This work focuses specifically on this low-energy regime, where sparse hit patterns limit the performance of topology-based reconstruction and classification methods. We introduce Waveform-based Particle Identification (WavePID), a statistically rigorous and interpretable likelihood-ratio discriminator for track-cascade separation, built from Monte Carlo templates in timing-aware, physics-motivated observables and validated through dedicated simulations. Applied to both Monte Carlo and 11.1 years of IceCube data, WavePID suggests improved cascade purity by about 5 percentage points at a fixed 20% down-selection rate relative to the current leading cascade selection, while maintaining Data-MC agreement within detector systematics. The approach is compact and robust to sparse observations, demonstrating the value of waveform-level timing for low-energy reconstruction.",
    "authors": [
      "Steven Young Eulig"
    ],
    "published": "2025-11-21T21:25:22Z",
    "updated": "2025-11-21T21:25:22Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.HE",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.17771v1",
    "url": "https://arxiv.org/abs/2511.17771v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17771v1.pdf",
    "title": "Upgrade to Fixed and Translating Scintillation-based Loss Detector System in the Fermilab Drift Tube Linac",
    "abstract": "The closed-off structure of the Fermilab Drift Tube Linac precludes a robust array of instrumentation from directly monitoring the H- beam that is accelerated from 750 keV to 116 MeV. To improve beam tuning and operational assessment of Drift Tube Linac performance, scintillator-based loss monitors were previously installed along the exterior of the first two accelerating cavities to assess low energy beam losses. Here we present a recent upgrade to the loss monitor system, including significant improvements in analog signal processing to address baseline-interfering noise; digitization of the signals to enable regular operational use and tuning; and a new remote operation upgrade of the translating loss monitor with precise positioning of the loss monitor along its nine-foot track. Data from the fixed and translating detectors collected under varying beam conditions validate the utility of the upgrade.",
    "authors": [
      "E. V. Chen",
      "A. L. Saewert",
      "R. V. Sharankova"
    ],
    "published": "2025-11-21T20:36:21Z",
    "updated": "2025-11-21T20:36:21Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.18429/JACoW-NAPAC2025-MOP096"
  },
  {
    "arxiv_id": "2511.17395v1",
    "url": "https://arxiv.org/abs/2511.17395v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17395v1.pdf",
    "title": "Investigating the growth cycles of titania and carbonaceous nano dusty plasmas",
    "abstract": "Solid nanoparticles which range in size from 1 to 500 nm can spontaneously grow from reactive gaseous precursors in nonthermal plasmas. This dissertation studies the particle size, and growth time with and without a background magnetic field in the plasma. Traditionally, studies have focused on the growth of either carbonaceous or silicate dust from either acetylene or silane, respectively. However, recently, there have been a shift towards studying new kinds of dust. For example, recent studies have grown polymers and metallic dust. This dissertation first introduces and studies the growth of titanium dioxide dust from the metal-organic vapor precursor of titanium tetraisopropoxide. The as-grown materials are amorphous but high temperature annealing crystallizes the samples into anatase and subsequently rutile. Then, the growth of titania dusty plasma is and compared to the growth of carbonaceous dust from acetylene, in argon plasma. They are grown during the presence and absence of weak magnetic fields of 500 Gauss. Both kinds of dust growth exhibit a growth cycle, which had already been shown for various nano dusty plasma. This occurs because once the dust accumulates a critical radius and mass, they move away from the central region of the plasma, allowing a new generation of growth begins. Ultimately, the new generation of growth also moves away leading to a continuous cycle of particle formation and transport as long as the plasma is on. However, with the presence of the magnetic field, the cycle time decreases, and the spatial distribution of the dust cloud appears differently. Finally, we focus on the growth cycle time of carbonaceous dust and how it decreases with a gradual increase in magnetic field, varying from 20 - 1000 Gauss. We particularly noticed a minimum at 330 Gauss, which coincides with electron magnetization.",
    "authors": [
      "Bhavesh Ramkorun"
    ],
    "published": "2025-11-21T16:54:26Z",
    "updated": "2025-11-21T16:54:26Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.17324v1",
    "url": "https://arxiv.org/abs/2511.17324v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17324v1.pdf",
    "title": "First operation of poly(ethylene naphthalate) enclosures for high-purity germanium detectors in liquid argon for $^{42}$K/$^{42}$Ar mitigation",
    "abstract": "Commercial argon contains cosmogenic $^{42}$Ar whose progeny $^{42}$K is a critical background component for the Large Enriched Germanium Experiment for Neutrinoless $ββ$ Decay (LEGEND). LEGEND operates High-Purity Germanium (HPGe) detectors bare in liquid argon. $^{42}$K is attracted by the HPGe detectors' electric fields, and drifts toward the germanium surface, where it undergoes beta decay. LEGEND-1000 will mitigate $^{42}$K-induced background by using underground-sourced argon, depleted in cosmogenic isotopes. If underground argon is not available, mitigation techniques must be employed. Poly(ethylene naphthalate) (PEN) enclosures were proposed to hinder the ion drift, decrease the beta-particle's energy, and produce scintillation light. In this paper, we report on operating two HPGe detectors, both bare and PEN-enclosed, in $^{42}$Ar-enriched liquid argon, and find no evidence for deterioration of energy stability or resolution due to the enclosures. We monitor the beta and gamma rates of $^{42}$K, find complex time-dependencies extending to roughly 30 days after applying the HPGe detectors' high-voltage, and qualitatively demonstrate the $^{42}$K suppression capabilities of enclosures.",
    "authors": [
      "Christoph Vogl",
      "Tommaso Comellato",
      "Konstantin Gusev",
      "Brennan Hackett",
      "Patrick Krause",
      "Andreas Leonhardt",
      "Bela Majorovits",
      "Niko N. P. N. Lay",
      "Moritz Neuberger",
      "Nadezda Rumyantseva",
      "Mario Schwarz",
      "Michael Willers",
      "Stefan Schönert"
    ],
    "published": "2025-11-21T15:43:52Z",
    "updated": "2025-11-21T15:43:52Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.11255v3",
    "url": "https://arxiv.org/abs/2509.11255v3",
    "pdf_url": "https://arxiv.org/pdf/2509.11255v3.pdf",
    "title": "A Geometrically Consistent Matching Framework for Side-Scan Sonar Mapping",
    "abstract": "Robust matching of side-scan sonar imagery remains a fundamental challenge in seafloor mapping due to view-dependent backscatter, shadows, and geometric distortion. This paper proposes a novel matching framework that combines physical decoupling and geometric consistency to enhance correspondence accuracy and consistency across viewpoints. A multi-branch network, derived from the Lambertian reflection model, decomposes raw sonar images into seabed reflectivity, terrain elevation, and acoustic path loss. The reflectivity map, serving as a stable matching domain, is used in conjunction with a training-free matching pipeline combining SuperPoint and MINIMA-LightGlue. Geometry-aware outlier rejection leverages both terrain elevation and its physically derived shadow map to further remove mismatches in acoustically occluded and topographically inconsistent regions, thereby improving registration accuracy. Quantitative and visual evaluations against traditional, CNN-, and Transformer-based state-of-the-art methods demonstrate that our method achieves lower matching error, higher geometric consistency, and greater robustness to viewpoint variations. The proposed approach provides a data-efficient, physically interpretable solution for high-precision side-scan sonar image matching in complex seafloor environments.",
    "authors": [
      "Can Lei",
      "Hayat Rajani",
      "Nuno Gracias",
      "Rafael Garcia",
      "Huigang Wang"
    ],
    "published": "2025-09-14T12:54:42Z",
    "updated": "2025-11-21T15:36:51Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.17314v1",
    "url": "https://arxiv.org/abs/2511.17314v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17314v1.pdf",
    "title": "Characterisation and mitigation of RF knockout during beam stacking",
    "abstract": "Beam stacking allows a Fixed Field alternating gradient Accelerator (FFA) to increase the extracted beam current whilst also allowing for a flexible time structure making FFAs a promising candidate for future spallation neutron sources and high beam intensity applications. For successful beam stacking, beam loss caused by RF knockout must be avoided. RF knockout can occur during beam stacking because of the finite dispersion function at the RF cavity location, which is unavoidable in a scaling FFA. In this work, the RF knockout resonance is characterised and through a series of experiments at the ISIS Neutron and Muon Source, we show that it is possible to suppress the loss from RF knockout.",
    "authors": [
      "Carl Jolly",
      "David Kelliher",
      "Jean-Baptiste Lagrange",
      "Alan Letchford",
      "Shinji Machida",
      "David Posthuma de Boer",
      "Chris Rogers",
      "Andrew Seville"
    ],
    "published": "2025-11-21T15:32:10Z",
    "updated": "2025-11-21T15:32:10Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.17305v1",
    "url": "https://arxiv.org/abs/2511.17305v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17305v1.pdf",
    "title": "Efficient calculation of magnetic fields from ferromagnetic materials near strong electromagnets, and application to stellarator coil optimization",
    "abstract": "In fusion reactor design, steels under consideration for the blanket are ferromagnetic, so the steel's effect on the plasma physics must be examined. For efficient calculation of these fields, we can exploit the fact that the magnetic material gives a small perturbation relative to the fields from the electromagnetic coils and plasma. Moreover the magnetization is saturated due to the strong fields in typical fusion systems. These approximations significantly reduce the nonlinearity of the problem, so the magnetic materials can be described by an array of point dipoles of known magnitude, oriented in the direction of the coil and plasma field. The approach is verified by comparison to finite-element calculations with commercial software and shown to be accurate. As no linear or nonlinear solve is required, only evaluation of Biot-Savart-type integrals, the method here is significantly simpler to implement than other methods, and extremely fast. The method is compatible with arbitrary CAD geometry, and also allows rapid computation of the magnetic forces. We demonstrate adding the ferromagnetic effects to free-boundary MHD equilibrium calculations, assessing the effect on plasma properties such as confinement and stability. Moreover, it is straightforward to differentiate through the model to get the derivative of the field with respect to the electromagnet parameters. We thereby demonstrate gradient-based coil optimization for a quasi-isodynamic stellarator in which the field contribution from a ferromagnetic blanket is included. Even a significant steel volume is found to have little impact on the plasma physics properties, with the main effects being a slight destabilization of ballooning modes and a radial shift of the edge islands due to decrease in rotational transform. Both issues are corrected by minor reoptimization of the coil shapes to account for the field from the steel.",
    "authors": [
      "Matt Landreman",
      "Humberto Torreblanca",
      "Antoine Cerfon"
    ],
    "published": "2025-11-21T15:19:49Z",
    "updated": "2025-11-21T15:19:49Z",
    "categories": [
      "physics.plasm-ph",
      "physics.app-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.17287v1",
    "url": "https://arxiv.org/abs/2511.17287v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17287v1.pdf",
    "title": "The impact of ionising collisions on channeling and radiation emission for high-energy electrons and positrons",
    "abstract": "This paper presents a quantitative analysis of the impact of inelastic collisions with atoms in a crystalline environment on the channeling efficiency and intensity of the channeling radiation for high-energy electrons and positrons passing through oriented crystalline targets. This analysis is based on numerical simulations of the channeling process, which were performed using the MBN Explorer software package. Ionising collisions are considered random, fast and local events, and are incorporated into the classical relativistic molecular dynamics framework according to the previously described algorithm. The case studies presented refer to 10 GeV electrons and positrons incident on single crystals of diamond and silicon, oriented along the (110) and (111) planes, with thicknesses of up to 1 mm for electrons and 6 mm for positrons. To elucidate the role of ionising collisions, simulations were performed with and without accounting for them. It is shown that, for electrons, both approaches lead to similar results with regard to both the channelling efficiency and the radiation intensity. In practical terms, this means that numerical simulations can be carried out without accounting for ionising collisions, which are much faster yet produce similar results. For positrons, the ionising collisions reduce significantly the channeling efficiency. However, their impact on the radiation intensity strongly depends on the opening angle of the cone within which the radiation emission is collected. A quantitative analysis of this feature is presented in the paper.",
    "authors": [
      "Andrei V. Korol",
      "Andrey V. Solov'yov"
    ],
    "published": "2025-11-21T14:52:56Z",
    "updated": "2025-11-21T14:52:56Z",
    "categories": [
      "physics.acc-ph",
      "physics.atom-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.17286v1",
    "url": "https://arxiv.org/abs/2511.17286v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17286v1.pdf",
    "title": "A DSMC method for the space homogeneous multispecies Landau equation",
    "abstract": "We present a Direct Simulation Monte Carlo (DSMC) method for the spatially homogeneous multispecies Landau-Fokker-Planck equation. The scheme is derived from a first-order approximation of the multispecies Boltzmann operator in the grazing collision limit and employs a regularized, easy-to-sample scattering kernel that removes the need for iterative solvers while preserving the fundamental invariants of the Landau dynamics. The method is fully mesh-free -- being a Monte Carlo particle algorithm -- which makes it naturally scalable to high-dimensional velocity spaces and straightforward to couple with particle-in-cell (PIC) solvers via operator splitting. A notable feature of our approach is its ability to treat realistic mass ratios: we show accurate simulations up to the physical proton-electron ($p$-$e$) mass ratio $m_p/m_e \\approx 1836$. We validate the method against the multispecies BKW benchmark for Maxwellian interactions and study collisional relaxation for Coulomb interactions, showing conservation of mass, momentum, and energy, and the expected trend towards Maxwellian equilibria.",
    "authors": [
      "Andrea Medaglia"
    ],
    "published": "2025-11-21T14:50:24Z",
    "updated": "2025-11-21T14:50:24Z",
    "categories": [
      "physics.comp-ph",
      "math.NA",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.comp-ph"
  },
  {
    "arxiv_id": "2510.11463v2",
    "url": "https://arxiv.org/abs/2510.11463v2",
    "pdf_url": "https://arxiv.org/pdf/2510.11463v2.pdf",
    "title": "Characterisation of the first wafer-scale prototype for the ALICE ITS3 upgrade: the monolithic stitched sensor (MOSS)",
    "abstract": "This paper presents the characterisation and testing of the first wafer-scale monolithic stitched sensor (MOSS) prototype developed for the ALICE ITS3 upgrade that is to be installed during the LHC Long Shutdown 3 (2026-2030). The MOSS chip design is driven by the truly cylindrical detector geometry that imposes that each layer is built out of two wafer-sized, bent silicon chips. The stitching technique is employed to fabricate sensors with dimensions of 1.4 $\\times$ 25.9 cm, thinned to 50 $μ$m. The chip architecture, in-pixel front-end, laboratory and in-beam characterisation, susceptibility to single-event effects, and series testing are discussed. The testing campaign validates the design of a wafer-scale stitched sensor and the performance of the pixel matrix to be within the ITS3 requirements. The MOSS chip demonstrates the feasibility of the ITS3 detector concept and provides insights for further optimisation and development.",
    "authors": [
      "Omar Abdelrahman",
      "Gianluca Aglieri Rinella",
      "Luca Aglietta",
      "Giacomo Alocco",
      "Matias Antonelli",
      "Roberto Baccomi",
      "Francesco Barile",
      "Pascal Becht",
      "Franco Benotto",
      "Stefania Maria Beolè",
      "Marcello Borri",
      "Daniela Bortoletto",
      "Naseem Bouchhar",
      "Giuseppe Eugenio Bruno",
      "Matthew Daniel Buckland",
      "Szymon Bugiel",
      "Paolo Camerini",
      "Francesca Carnesecchi",
      "Marielle Chartier",
      "Domenico Colella",
      "Angelo Colelli",
      "Giacomo Contin",
      "Giuseppe De Robertis",
      "Wenjing Deng",
      "Antonello Di Mauro",
      "Vittorio Di Trapani",
      "Maurice Donner",
      "Ana Dorda Martin",
      "Piotr Dorosz",
      "Floarea Dumitrache",
      "Lars Döpper",
      "Gregor Hieronymus Eberwein",
      "Domenico Elia",
      "Simone Emiliani",
      "Laura Fabbietti",
      "Tommaso Fagotto",
      "Xiaochao Fang",
      "Henrik Fribert",
      "Roman Gernhäuser",
      "Piero Giubilato",
      "Laura Gonella",
      "Karl Gran Grodaas",
      "Ola Slettevoll Groettvik",
      "Vladimir Gromov",
      "Malte Grönbeck",
      "Philip Hauer",
      "Hartmut Hillemanns",
      "Guen Hee Hong",
      "Yu Hu",
      "Minyoung Chris Hwang",
      "Marc Alain Imhoff",
      "Barbara Jacak",
      "Daniel Matthew Jones",
      "Antoine Junique",
      "Filip Křížek",
      "Jetnipit Kaewjai",
      "Anouk Kaiser",
      "Jesper Karlsson Gumprecht",
      "Markus Keil",
      "Bernhard Ketzer",
      "Jiyoung Kim",
      "Lena Kirchner",
      "Kritsada Kittimanapun",
      "Alex Kluge",
      "Chinorat Kobdaj",
      "Artem Kotliarov",
      "Thanushan Kugathasan",
      "Marc König",
      "Paola La Rocca",
      "Natthawut Laojamnongwong",
      "Lukas Lautner",
      "Corentin Lemoine",
      "Long Li",
      "Beatrice Eva Liang-Gilman",
      "Francesco Licciulli",
      "Sanghoon Lim",
      "Bong-Hwi Lim",
      "Jian Liu",
      "Flavio Loddo",
      "Matteo Lupi",
      "Magnus Mager",
      "Philipp Mann",
      "Georgios Mantzaridis",
      "Davide Marras",
      "Paolo Martinengo",
      "Silvia Masciocchi",
      "Annalisa Mastroserio",
      "Soniya Mathew",
      "Serena Mattiazzo",
      "Marius Wilm Menzel",
      "Nicola Minafra",
      "Frederic Morel",
      "Alice Mulliri",
      "Anjali Ila Nambrath",
      "Rajendra Nath Patra",
      "Iaroslav Panasenko",
      "Styliani Paniskaki",
      "Caterina Pantouvakis",
      "Cosimo Pastore",
      "Stefania Perciballi",
      "Francesco Piro",
      "Adithya Pulli",
      "Alexander Rachev",
      "Alexander Rachevski",
      "Ivan Ravasenga",
      "Felix Reidt",
      "Michele Rignanese",
      "Giacomo Ripamonti",
      "Isabella Sanna",
      "Valerio Sarritzu",
      "Umberto Savino",
      "Iain Sedgwick",
      "Serhiy Senyukov",
      "Danush Shekar",
      "Sabyasachi Siddhanta",
      "David Silvermyr",
      "Walter Snoeys",
      "Joey Staa",
      "Alessandro Sturniolo",
      "Miljenko Šuljić",
      "Timea Szollosova",
      "Daniel Tapia Takaki",
      "Livia Terlizzi",
      "Nicolas Tiltmann",
      "Antonio Trifirò",
      "Christina Tsolanta",
      "Rosario Turrisi",
      "Berkin Ulukutlu",
      "Gianluca Usai",
      "Isabelle Valin",
      "Giovanni Vecil",
      "Pedro Vicente Leitao",
      "Anna Villani",
      "Chunzheng Wang",
      "Zhenyu Ye",
      "Emma Rose Yeats",
      "Asli Yelkenci",
      "Zijun Zhao",
      "Alessandra Zingaretti"
    ],
    "published": "2025-10-13T14:35:53Z",
    "updated": "2025-11-21T14:42:05Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.17261v1",
    "url": "https://arxiv.org/abs/2511.17261v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17261v1.pdf",
    "title": "Performance of the front-end electronics of the CMS electromagnetic calorimeter barrel for the High-Luminosity LHC",
    "abstract": "The performance of the CMS electromagnetic calorimeter upgraded readout electronics, developed for the High-Luminosity phase of the LHC, is discussed. Data collected in two beam test campaigns conducted in 2018 and 2021 at the H4 and H2 beam lines of the CERN SPS are analyzed. Time and energy resolutions are measured on a $5\\times 5$ matrix of lead tungstate crystals equipped with prototypes of the new front end readout electronics, using electron and pion beams of energies spanning from 25 to 250 GeV. In both campaigns the constant term of the energy resolution is measured to be better than 0.6% and the time resolution for electrons with energies above 50 GeV is measured to be better than 30 ps, fulfilling the design requirements.",
    "authors": [
      "The CMS Electromagnetic Calorimeter Group"
    ],
    "published": "2025-11-21T14:06:54Z",
    "updated": "2025-11-21T14:06:54Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.11749v2",
    "url": "https://arxiv.org/abs/2509.11749v2",
    "pdf_url": "https://arxiv.org/pdf/2509.11749v2.pdf",
    "title": "Helical Core Formation and MHD Stability in ITER-Scale Plasmas with Fusion-born Alpha Particles",
    "abstract": "The effect of fusion-born alpha particles on the helical core (HC), a long-lived ideal saturation state of the $m/n=1/1$ kink/quasi-interchange mode, is studied in the ITER-scale hybrid scenario where a core plasma has a low magnetic shear $q\\gtrsim1$. The HC state is determined by 3-D MHD force balance and all factors that contribute to it, such as plasma shaping, the safety factor profile, and the pressure profiles of all particle species. An incomplete but useful measure of the HC is the displacement of the magnetic axis, $δ_\\mathrm{HC}$. Using MHD-PIC simulations, we find that $δ_\\mathrm{HC}$ is enhanced by increasing alpha particle pressure $β_\\mathrmα$. Within the ITER operating alpha pressure $β_\\mathrmα(0) \\lesssim 1\\%$, $β_\\mathrmα$ can be approximately treated as part of the total MHD pressure. In this regime, there is no notable flattening of the pressure profile, indicating that the HC preserves the omnigenity of the plasma. If one increases $β_\\mathrmα(0)$ beyond $1\\%$, $δ_\\mathrm{HC}$ continues to increase with $β_\\mathrmα$ until it reaches an upper limit at $β_\\mathrmα(0)=3\\%$ for our reference case. At this limit, both the bulk and alpha pressure profiles are partially flattened, indicating a reduction in omnigenity. After HC formation, a resistive pressure-driven MHD mode can become unstable, which is localized along the compressed magnetic flux region of the HC. This secondary mode consists of a broad spectrum of short-wavelength Fourier components that grow at same rates and are thus part of a single coherent entity. Our present simulation model is insufficient to adequately represent such a secondary mode; however, preliminary results suggest that it can facilitate magnetic chaos, which affects plasma confinement.",
    "authors": [
      "P. Adulsiriswad",
      "A. Bierwage",
      "M. Yagi"
    ],
    "published": "2025-09-15T10:00:33Z",
    "updated": "2025-11-21T13:59:04Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.17222v1",
    "url": "https://arxiv.org/abs/2511.17222v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17222v1.pdf",
    "title": "A Short Introduction to Metal Forming",
    "abstract": "The present paper is a short introduction to metal forming. The paper highlights the different disciplines that should be considered when analyzing metal forming. Hence, mechanical flow, heat flow, mechanical and thermal contact, and microstructure evolution are presented within the perspective of metal forming. For every aspect, well-established knowledge is presented in addition to scientific open questions on which active research is still done.",
    "authors": [
      "Charbel Moussa",
      "Pierre Montmitonnet"
    ],
    "published": "2025-11-21T13:09:00Z",
    "updated": "2025-11-21T13:09:00Z",
    "categories": [
      "physics.acc-ph",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2412.16824v2",
    "url": "https://arxiv.org/abs/2412.16824v2",
    "pdf_url": "https://arxiv.org/pdf/2412.16824v2.pdf",
    "title": "Ion-Scale Solitary Structures in the Solar Wind Observed by Solar Orbiter and Parker Solar Probe",
    "abstract": "We investigate a class of ion-scale magnetic solitary structures in the solar wind, characterized by distinct magnetic field enhancements and bipolar rotations over spatial scales of several proton inertial lengths. These structures are revisited using high-resolution data from the Solar Orbiter and Parker Solar Probe missions. Using a machine learning-based method, we identified nearly a thousand such structures, providing new insights into their evolution and physical properties. Statistical analysis shows that these structures are more abundant closer to the Sun, with occurrence rates peaking around (30 - 40, R_sun) and decreasing farther out. High-cadence measurements reveal that these structures are predominantly found in low-beta (beta <= 1) environments, with consistent fluctuations in density, velocity, and magnetic field. Magnetic field enhancements are often accompanied by plasma density drops, which, under near pressure balance, limit field increases. This leads to small fractional field enhancements near the Sun (approximately 0.01 at 20 R_sun), making detection challenging. Magnetic field variance analysis indicates that these structures are primarily oblique to the local magnetic field. Alfvénic velocity-magnetic field correlations suggest that most of these structures, unlike most near-Sun solar wind fluctuations, exhibit sunward-directed Alfvénic polarization in the plasma frame. We compare these findings with previous studies, discussing possible generation mechanisms and their implications for the turbulent cascade in the near-Sun Alfvénic solar wind. While these structures might be Alfvénic solitons, vortices, or flux ropes, we refrain from a definitive classification pending further evidence. Further high-resolution observations and simulations are needed to fully understand their origins and impacts.",
    "authors": [
      "Yufei Yang",
      "Timothy S. Horbury",
      "Domenico Trotta",
      "Lorenzo Matteini",
      "Joseph H. Wang",
      "Andrey Fedorov",
      "Philippe Louarn",
      "Stuart Bale",
      "Marc Pulupa",
      "Davin E. Larson",
      "Roberto Livi",
      "Michael Stevens",
      "Milan Maksimovic",
      "Yuri Khotyaintsev",
      "Andrea Larosa"
    ],
    "published": "2024-12-22T02:06:22Z",
    "updated": "2025-11-21T12:26:16Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph",
    "doi": "10.3847/2041-8213/ae173a"
  },
  {
    "arxiv_id": "2508.20627v2",
    "url": "https://arxiv.org/abs/2508.20627v2",
    "pdf_url": "https://arxiv.org/pdf/2508.20627v2.pdf",
    "title": "Monte Carlo simulation method for incoherent Thomson scattering spectra from arbitrary electron distribution functions",
    "abstract": "We developed a Monte Carlo simulation method to calculate incoherent Thomson scattering spectra in high temperature plasmas. The basic idea is to treat the entire scattering process as the superposition of individual photon-electron interactions. We introduce macro-particles, referred from particle-in-cell simulations, to reduce the computational cost, and obtain scattered spectra within a reasonable computational time. Since the velocity of the interacting electron is randomly sampled from an electron distribution function, the method can be applied to arbitrary electron distribution functions provided an appropriate sampling scheme is available. We present simulation results for relativistic Maxwellian and kappa distribution functions, and compare them with both analytical and numerical spectra for validation. The simulated spectra show good agreement with both analytical and numerical results, demonstrating that the Monte Carlo simulation method can reliably reproduce incoherent Thomson scattering spectra.",
    "authors": [
      "Kentaro Sakai",
      "Kentaro Tomita",
      "Takeo Hoshi",
      "Ryo Yasuhara"
    ],
    "published": "2025-08-28T10:20:13Z",
    "updated": "2025-11-21T11:35:23Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.17141v1",
    "url": "https://arxiv.org/abs/2511.17141v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17141v1.pdf",
    "title": "Distributed Acoustic Fiber Sensing for Research Campuses and Large Scientific Infrastructures -- The Hamburg WAVE proto-network",
    "abstract": "Here, we demonstrate and investigate how Distributed Acoustic Sensing (DAS) can be utilized on research campuses and in large scientific infrastructures to study environmental vibrations and reduce their impact on high-precision experiments. We first discuss the potential of DAS in the context of particle accelerators, gravitational wave detection experiments and research campuses. Next, we present the results of our seismic measurement campaign conducted with our proto-network, which involved the probing of over 12 km of fiber, in May 2021. This campaign was conducted by the Hamburg WAVE initiative in Science City Hamburg Bahrenfeld and included DESY, the European XFEL, PETRA III and the University of Hamburg. Our proto-network confirms the ability to observe natural, anthropogenic, and infrastructural vibrations and how and where these couple into different parts of the heterogeneously set up fiber network. We also present results on a study of noise and motion coupling aspects of DAS probing double-redundant fiber loops in a unique environment, the European XFEL. Our results show that DAS greatly benefits research campuses and large scientific infrastructures and they highlight the opportunities and challenges of implementing and operating such seismic networks.",
    "authors": [
      "Oliver Bölt",
      "Luigia Cristiano",
      "Sandy Croatto",
      "Dirk Gajewski",
      "Erik Genthe",
      "Oliver Gerberding",
      "Céline Hadziioannou",
      "Conny Hammer",
      "Markus Hoffmann",
      "Katharina-Sophie Isleif",
      "Antonia Kiel",
      "Charlotte M. Krawczyk",
      "Regina Maass",
      "Ingra Barbosa",
      "Norbert Meyners",
      "Reinhardt Rading",
      "Holger Schlarb",
      "Roman Schnabel",
      "Wanda Vossius",
      "Christopher Wollin"
    ],
    "published": "2025-11-21T11:04:48Z",
    "updated": "2025-11-21T11:04:48Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "physics.acc-ph",
      "physics.geo-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2410.18817v2",
    "url": "https://arxiv.org/abs/2410.18817v2",
    "pdf_url": "https://arxiv.org/pdf/2410.18817v2.pdf",
    "title": "Conceptual Design of the Muonium-to-Antimuonium Conversion Experiment (MACE)",
    "abstract": "The spontaneous conversion of muonium to antimuonium is one of the interesting charged lepton flavor violation phenomena offering a sensitive probe of potential new physics and serving as a tool to constrain the parameter space beyond the Standard Model. The Muonium-to-Antimuonium Conversion Experiment (MACE) is designed to utilize a high-intensity muon beam, a Michel electron magnetic spectrometer, a positron transport system, and a positron detection system, to either discover or constrain this rare process with a conversion probability of $\\mathcal{O}(10^{-13})$. This article presents an overview of the theoretical framework as well as a detailed description of the experimental design for the search for muonium-to-antimuonium conversion.",
    "authors": [
      "Ai-Yu Bai",
      "Hanjie Cai",
      "Chang-Lin Chen",
      "Siyuan Chen",
      "Xurong Chen",
      "Yu Chen",
      "Weibin Cheng",
      "Ling-Yun Dai",
      "Rui-Rui Fan",
      "Li Gong",
      "Zihao Guo",
      "Yuan He",
      "Zhilong Hou",
      "Yinyuan Huang",
      "Huan Jia",
      "Hao Jiang",
      "Han-Tao Jing",
      "Xiaoshen Kang",
      "Hai-Bo Li",
      "Jincheng Li",
      "Yang Li",
      "Daming Liu",
      "Shulin Liu",
      "Guihao Lu",
      "Han Miao",
      "Yunsong Ning",
      "Jianwei Niu",
      "Huaxing Peng",
      "Alexey A. Petrov",
      "Yuanshuai Qin",
      "Mingchen Sun",
      "Jian Tang",
      "Jing-Yu Tang",
      "Ye Tian",
      "Rong Wang",
      "Xiaodong Wang",
      "Yi Wang",
      "Zhichao Wang",
      "Chen Wu",
      "Tian-Yu Xing",
      "Weizhi Xiong",
      "Yu Xu",
      "Baojun Yan",
      "De-Liang Yao",
      "Tao Yu",
      "Ye Yuan",
      "Yi Yuan",
      "Yao Zhang",
      "Yongchao Zhang",
      "Zhilv Zhang",
      "Guang Zhao",
      "Shihan Zhao"
    ],
    "published": "2024-10-24T15:04:04Z",
    "updated": "2025-11-21T10:56:43Z",
    "categories": [
      "hep-ex",
      "hep-ph",
      "physics.acc-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2511.17018v1",
    "url": "https://arxiv.org/abs/2511.17018v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17018v1.pdf",
    "title": "Improvements of the GPU Processing Framework for ALICE",
    "abstract": "ALICE is the dedicated heavy ion experiment at the LHC at CERN and records lead-lead collisions at a rate of up to 50 kHz. The detector with the highest data rate of up to 3.4 TB/s is the TPC. ALICE performs the full online TPC processing corresponding to more than 95\\% of the total workload on GPUs, and when there is no beam in the LHC, the online computing farm's GPUs are used to speed up the offline processing. After the deployment of the first version of the online TPC processing needed for data taking, ALICE has implemented many improvements to its GPU processing framework. These include a run time compilation mode applying on the fly optimizations, improvements to parallelize / speed up the GPU compilation, debugging modes to guarantee reproducible and deterministic results in concurrent reconstruction, and framework features to leverage common components in the code of different detectors. The proceedings give an overview of the ALICE experience with GPUs in online and offline processing and present the latest GPU processing framework features.",
    "authors": [
      "David Rohr"
    ],
    "published": "2025-11-21T07:45:52Z",
    "updated": "2025-11-21T07:45:52Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1051/epjconf/202533701362"
  },
  {
    "arxiv_id": "2506.05727v3",
    "url": "https://arxiv.org/abs/2506.05727v3",
    "pdf_url": "https://arxiv.org/pdf/2506.05727v3.pdf",
    "title": "Bennett Vorticity: A family of nonlinear Shear-Flow Stabilized Z-pinch equilibria",
    "abstract": "The Bennett profile is a classic form for the plasma number density of an equilibrium Z-pinch that has been studied for almost a century by plasma physicists interested in nonlinear plasma pinch science, and fusion energy. By transferring the nonlinearity entirely from the number density to the plasma flow velocity the current density of the resulting flowing Z-pinch equilibrium remains unchanged whilst now being defined by a vortical flow which previously did not exist in the classic case. Due to the positive-definite structure of the nonlinearity's first derivative, in the ideal limit this equilibrium conforms globally to the validity criterion for a shear-flow stabilized Z-pinch when the form of the temperature profile satisfies certain constraints.",
    "authors": [
      "Matt Russell"
    ],
    "published": "2025-06-06T04:20:38Z",
    "updated": "2025-11-20T21:37:51Z",
    "categories": [
      "physics.plasm-ph",
      "nlin.SI"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.15270v2",
    "url": "https://arxiv.org/abs/2510.15270v2",
    "pdf_url": "https://arxiv.org/pdf/2510.15270v2.pdf",
    "title": "In-Situ Performance of FBK VUV-HD3 and HPK VUV4 SiPMs in the LoLX Liquid Xenon Detector",
    "abstract": "Silicon Photomultipliers (SiPMs) are a critical technology for the next generation of rare-event search experiments using liquid xenon (LXe). While two VUV-sensitive SiPMs are available, comprehensive in-situ studies are needed to inform detector design and compare device response. This work presents a direct comparison of Fondazione Bruno Kessler (FBK) VUV-HD3 and Hamamatsu (HPK) VUV4 SiPMs operated simultaneously within the Light-only Liquid Xenon (LoLX) detector. Using data collected with gamma sources placed outside the detector, we characterized the relative performance of these photosensors. Our analysis reveals that under these operating conditions, the HPK SiPMs are 33-38% less efficient than the FBK devices, a larger difference than predicted by standard PDE models in vacuum measurement. We show that this discrepancy is resolved by our angular and wavelength dependent PDE model incorporating surface shadowing effects into our optical simulation, which then accurately reproduces the experimental data. This finding has significant implications for the selection and implementation of photosensors in future large-scale LXe detectors.",
    "authors": [
      "Xiang Li",
      "David Gallacher",
      "Stephanie Bron",
      "Thomas Brunner",
      "Austin de St Croix",
      "Frédéric Girard",
      "Colin Hempel",
      "Mouftahou Bakary Latif",
      "Simon Lavoie",
      "Chloé Malbrunot",
      "Fabrice Retière",
      "Marc-André Tétrault",
      "Lei Wang"
    ],
    "published": "2025-10-17T03:19:23Z",
    "updated": "2025-11-20T20:41:06Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.16491v1",
    "url": "https://arxiv.org/abs/2511.16491v1",
    "pdf_url": "https://arxiv.org/pdf/2511.16491v1.pdf",
    "title": "Efficient and affordable thermoelectric measurement setup using Arduino and LabVIEW for education and research",
    "abstract": "Thermoelectric materials can convert thermal energy into electricity, making them promising candidates for harvesting waste heat, an increasingly important challenge in the energy-intensive modern world. The search for improved thermoelectric materials is therefore an active area of research in materials physics. Despite their fundamental and practical significance, thermoelectric properties - such as the Seebeck coefficient and power factor - are rarely explored in student labs due to the complexity in measurement schemes and requirement for sophisticated equipment. In this work, we present a user-friendly, low-cost and efficient thermoelectric measurement system built with Arduino and LabVIEW, which can simultaneously measure Seebeck coefficients and power factors as a function of temperature. This was made possible by improving the resolution of Arduino over ~1000 times with amplifiers and noise reduction schemes. With a total cost of only ~$100 and simple measurement protocols, this setup is well suited not only for student labs but also for efficient thermoelectric research.",
    "authors": [
      "Alex J. Oh",
      "Colby J. Stoddard",
      "Craig Queenan",
      "Seongshik Oh"
    ],
    "published": "2025-11-20T16:06:14Z",
    "updated": "2025-11-20T16:06:14Z",
    "categories": [
      "physics.ed-ph",
      "cond-mat.mtrl-sci",
      "physics.ins-det"
    ],
    "primary_category": "physics.ed-ph",
    "doi": "10.1119/5.0289649"
  },
  {
    "arxiv_id": "2511.16412v1",
    "url": "https://arxiv.org/abs/2511.16412v1",
    "pdf_url": "https://arxiv.org/pdf/2511.16412v1.pdf",
    "title": "Algorithms and optimizations for global non-linear hybrid fluid-kinetic finite element stellarator simulations",
    "abstract": "Predictive modeling of stellarator plasmas is crucial for advancing nuclear fusion energy, yet it faces unique computational difficulties. One of the main challenges is accurately simulating the dynamics of specific particle species that are not well captured by fluid models, which necessitates the use of hybrid fluid-kinetic models. The non-axisymmetric geometry of stellarators fundamentally couples the toroidal Fourier modes, in contrast to what happens in tokamaks, requiring different numerical and computational treatment.   This work presents a novel, globally coupled projection scheme inside the JOREK finite element framework. The approach ensures a self-consistent and physically accurate transfer of kinetic markers to the fluid grid, effectively handling the complex 3D mesh by constructing and solving a unified linear system that encompasses all toroidal harmonics simultaneously. To manage the computational complexity of this coupling, the construction of the system's matrix is significantly accelerated using the Fast Fourier Transform (FFT). The efficient localization of millions of particles is made possible by implementing a 3D R-Tree spatial index, which supports this projection and ensures computational tractability at scale.   On realistic Wendelstein 7-X stellarator geometries, the fidelity of the framework is rigorously shown. In sharp contrast to the uncoupled approaches' poor performance, quantitative convergence tests verify that the coupled scheme attains the theoretically anticipated spectral convergence.   This study offers a crucial capability for the predictive analysis and optimization of next-generation stellarator designs by developing a validated, high-fidelity computational tool.",
    "authors": [
      "Luca Venerando Greco"
    ],
    "published": "2025-11-20T14:35:04Z",
    "updated": "2025-11-20T14:35:04Z",
    "categories": [
      "physics.plasm-ph",
      "cs.CE",
      "cs.PF",
      "math-ph",
      "math.NA"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.16408v1",
    "url": "https://arxiv.org/abs/2511.16408v1",
    "pdf_url": "https://arxiv.org/pdf/2511.16408v1.pdf",
    "title": "Development & Characterization of Electrodes for large-scale Xenon Time Projection Chambers",
    "abstract": "Dual-phase liquid xenon time projection chambers are the core detector elements of many experiments that conduct searches for Dark Matter and rare events, as well as in neutrino and high-energy physics. As part of this detector technology, high-voltage electrodes are instrumental for the generation of observable signals and their physical interpretation. Thus, electrode design and manufacturing has to fulfill stringent requirements, and their production is associated with significant engineering challenges. In this work we describe the successful development of electrodes on the 1.5 m-scale, from their design and simulation to subsequent assembly and high-voltage testing in a gaseous argon environment. The produced electrodes were recently installed as an anode and a cathode during an upgrade to the XENONnT experiment.",
    "authors": [
      "A. Elykov",
      "S. Vetter",
      "V. H. S. Wu",
      "A. Deisting",
      "K. Eitel",
      "R. Gumbsheimer",
      "M. Kara",
      "S. Lichter",
      "S. Lindemann",
      "T. Luce",
      "J. Müller",
      "K. Müller",
      "U. Oberlack",
      "M. Schumann",
      "K. Valerius"
    ],
    "published": "2025-11-20T14:29:16Z",
    "updated": "2025-11-20T14:29:16Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.04727v2",
    "url": "https://arxiv.org/abs/2507.04727v2",
    "pdf_url": "https://arxiv.org/pdf/2507.04727v2.pdf",
    "title": "On the interpretation of XRISM X-ray measurements of turbulence in the intracluster medium: a comparison with cosmological simulations",
    "abstract": "We investigate whether the properties of turbulent gas motions recently measured via X-ray spectroscopy in the Coma cluster of galaxies by XRISM are in tension with the turbulent picture established by current numerical cosmological simulations. We use a high-resolution simulation of a Coma-like cluster and show that the simulation yields velocity structure functions and X-ray line-widths that are compatible with those measured by the XRISM observations of Coma. In particular, it has been previously suggested that a much steeper turbulence spectrum than the Kolmogorov would be needed to explain the XRISM observations under a homogeneous, cluster volume-filling turbulence model. Our results show that this tension is overcome thanks to the more complicated turbulent picture in cosmological simulations, that indeed shows a patchy distribution of turbulent regions in galaxy clusters, with a spectrum that is generally consistent with a Kolmogorov power-law over a fairly wide range of scales. More generally, our study highlights the fact that the interpretation of XRISM data of galaxy clusters depends on the turbulence model used and the importance of combining data and advanced simulations in the future steps.",
    "authors": [
      "F. Vazza",
      "G. Brunetti"
    ],
    "published": "2025-07-07T07:45:15Z",
    "updated": "2025-11-20T14:23:57Z",
    "categories": [
      "astro-ph.CO",
      "astro-ph.GA",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.CO"
  },
  {
    "arxiv_id": "2503.13088v3",
    "url": "https://arxiv.org/abs/2503.13088v3",
    "pdf_url": "https://arxiv.org/pdf/2503.13088v3.pdf",
    "title": "Orbit-Controlled Generation of Two-color Attosecond Mode-locked Free-electron Lasers",
    "abstract": "The generation of attosecond X-ray pulses has garnered significant attention within the X-ray free-electron laser (FEL) community due to their potential for ultrafast time-resolved studies. Such pulses enable the investigation of electron dynamics with unprecedented temporal resolution, opening new avenues in fields such as quantum control and ultrafast spectroscopy. In an FEL, the mode-locking technique synthesizes a comb of longitudinal modes by applying spatiotemporal shifts between the co-propagating radiation and the electron bunch. Here, we propose a novel scheme for generating two-color attosecond mode-locked FEL pulses via orbit control in two-stage mode-locked undulators. Specifically, a chicane with a wiggler inserted in the middle generates periodic temporal-transverse modulation in the electron beam. In this configuration, the low-energy and high-energy components of the beam lase in separate undulator sections, with each producing attosecond mode-locked FEL pulses. Three-dimensional simulations with realistic parameters confirm that trains of 250-attosecond soft X-ray pulses at the gigawatt level can be independently generated in each undulator section. Furthermore, time delay between the two pulse trains can be adjusted over a range of several hundred femtoseconds.",
    "authors": [
      "Tu Lingjun",
      "Sun Hao",
      "Yi Huaiqian",
      "Zeng Li",
      "Liang Yifan",
      "Yu Yong",
      "Wang Xiaofan",
      "Zhang Weiqing"
    ],
    "published": "2025-03-17T11:50:26Z",
    "updated": "2025-11-20T09:56:18Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.10964v2",
    "url": "https://arxiv.org/abs/2508.10964v2",
    "pdf_url": "https://arxiv.org/pdf/2508.10964v2.pdf",
    "title": "The SND@LHC neutron shielding",
    "abstract": "The design and construction of a neutron shielding for the SND@LHC detector, which utilizes a combination of plexiglass and borated polyethylene, is presented. FLUKA simulations were employed to optimize the shielding configuration and assess its efficiency. Results indicate a significant reduction in neutron flux, ensuring the long-term stability of the emulsion films used in the target of the SND@LHC detector.",
    "authors": [
      "The SND@LHC Collaboration"
    ],
    "published": "2025-08-14T14:16:48Z",
    "updated": "2025-11-20T09:35:04Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.24371v2",
    "url": "https://arxiv.org/abs/2509.24371v2",
    "pdf_url": "https://arxiv.org/pdf/2509.24371v2.pdf",
    "title": "Advancing the CMS Level-1 Trigger: Jet Tagging with DeepSets at the HL-LHC",
    "abstract": "At the High Luminosity LHC, selecting important physics processes such as (di-) Higgs production will be a high priority. The Phase-2 Upgrade of the CMS Level-1 Trigger will reconstruct particle candidates and use pileup mitigation for the 200 simultaneous proton-proton interactions. A fast cone algorithm will reconstruct jets from these particles, providing access to jet constituents for the first time. We introduce a new multi-class jet tagger with a small, quantized DeepSets neural network. The tagger, trained on a mix of simulated CMS events, predicts various hadronic and leptonic classes. We present the tagger, its performance, and its improvements for triggering on (di-) Higgs events.",
    "authors": [
      "Stella Schaefer",
      "Christopher Brown",
      "Duc Hoang",
      "Sioni Summers",
      "Sebastian Wuchterl"
    ],
    "published": "2025-09-29T07:17:12Z",
    "updated": "2025-11-20T08:55:59Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.16125v1",
    "url": "https://arxiv.org/abs/2511.16125v1",
    "pdf_url": "https://arxiv.org/pdf/2511.16125v1.pdf",
    "title": "Characteristics of electromagnetic radiation and the interference protection on a small-sized direct-acting electron accelerator with a plasma opening switch",
    "abstract": "An experimental study of the parameters of electromagnetic and X-ray radiation was carried out on a small-sized direct-acting electron accelerator with inductive storage and a plasma opening switch. Frequency spectra have been determined, and the diagnostics of the power of the microwave component of the spectrum has been tested. An analytical comparison of radiation signals and power signals has been carried out. A method for determining the directivity pattern using a broadband power sensor has been proposed. An anechoic chamber and a reflective screen were used to suppress interference.",
    "authors": [
      "D. V. Vinnikov",
      "O. M. Ozerov",
      "V. V. Katrechko",
      "V. I. Tkachov",
      "S. V. Marchenko",
      "V. V. Ehorenkov",
      "S. A. Petrenko",
      "B. O. Brovkin",
      "O. V. Manuilenko",
      "I. N. Onishchenko"
    ],
    "published": "2025-11-20T07:56:13Z",
    "updated": "2025-11-20T07:56:13Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.15988v1",
    "url": "https://arxiv.org/abs/2511.15988v1",
    "pdf_url": "https://arxiv.org/pdf/2511.15988v1.pdf",
    "title": "Effects of Multi-scale Coupling on Particle Acceleration and Energy Partition in Magnetic Reconnection",
    "abstract": "The interplay between kinetic and macroscopic scales during magnetic reconnection is investigated using particle-in-cell simulations of magnetic island coalescence in the strongly-magnetized, relativistic pair plasma regime. For large system sizes, secondary current sheet formation and downstream turbulence driven by the reconnection outflows dominate the global energy dissipation so that it is causally connected, but spatially and temporally de-coupled from the primary reconnecting current sheet. When compared to simulations of an isolated, force-free current sheet, these dynamics activate additional particle acceleration channels which are responsible for a significant population of the non-thermal particles, modifying the particle energy spectra.",
    "authors": [
      "Alexander Velberg",
      "Adam Stanier",
      "Xiaocan Li",
      "Fan Guo",
      "William Daughton",
      "Nuno F. Loureiro"
    ],
    "published": "2025-11-20T02:39:56Z",
    "updated": "2025-11-20T02:39:56Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.15937v1",
    "url": "https://arxiv.org/abs/2511.15937v1",
    "pdf_url": "https://arxiv.org/pdf/2511.15937v1.pdf",
    "title": "Asymptotic-preserving semi-implicit finite volume scheme for Extended Magnetohydrodynamics",
    "abstract": "A Finite Volume (FV) scheme is developed for solving the extended magnetohydrodynamic (XMHD) equations, yielding accurate results in the ideal, resistive, and Hall MHD limits. This is accomplished by first re-writing the XMHD equations such that it allows the algorithm to retain the use of ideal MHD Riemann solvers and the constrained transport method to preserve divergence-free magnetic fields. Incorporation of electron inertia and displacement current introduces additional numerical stiffness which motivates a semi-implicit FV scheme that re-formulates the XMHD model as a relaxation system. The equations are then advanced in time using an explicit 2nd-order Runge-Kutta scheme with operator splitting applied to the implicit source term updates at each sub-stage. For additional numerical stability, density-dependent slope limiter is implemented to increase flux diffusivity at low density where non-ideal effects become significant. The algorithm is subsequently implemented on Artemis, a multifluid radiation hydrodynamics code built on Parthenon framework for high-performance computing (HPC) and adaptive mesh refinement (AMR) support. As the new algorithm retains many aspects of the ideal MHD formulations, it asymptotes naturally to the ideal MHD limit. Moreover, it shows promising results at the resistive and Hall MHD limits. This is verified against published test problems for ideal, resistive and Hall MHD.",
    "authors": [
      "Yi Han Toh",
      "Joshua Dolence",
      "Karthik Duraisamy"
    ],
    "published": "2025-11-20T00:02:46Z",
    "updated": "2025-11-20T00:02:46Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.15912v1",
    "url": "https://arxiv.org/abs/2511.15912v1",
    "pdf_url": "https://arxiv.org/pdf/2511.15912v1.pdf",
    "title": "Characterization of Low-energy Ionization Signals in Silicon Detectors for the Nab Experiment",
    "abstract": "The Nab (Neutron a b) experiment is designed to measure the beta-antineutrino angular correlation in free neutron $β$ decay with an ultimate precision goal of 0.1%, providing input for tests of Cabibbo-Kobayashi-Maskawa (CKM) matrix unitarity. This measurement is performed via detection of electrons and protons in delayed coincidence using custom large-area segmented silicon drift detectors. We present the characterization of one such detector system to establish the proton energy and timing response, using a dedicated proton accelerator. The detected proton peak was studied for 25 keV, 30 keV, and 35 keV incident protons on a set of detector segments and multiple cooling cycles over a one year period. Ionization losses were consistent with models of the detector dead layer with thicknesses less than 100nm. The detected proton peak was stable within the uncertainty from energy calibration (0.2 keV). The rise times of detector pulses from $^{109}$Cd and $^{113}$Sn conversion electron sources were used to extract the impurity density profile and establish a precise model for the detector timing response. The observed impurity density profile varied from $(2 \\pm 2) \\times 10^9$ cm$^{-3}$ at the center to $(26 \\pm 2) \\times 10^9$ cm$^{-3}$ at the edge. This impurity density profile was then used to characterize systematic effects in proton time-of-flight measurements due to detector pulse-shape effects; the resultant proton timing systematic uncertainties were below 0.3 ns, which is sufficient for the Nab experiment.",
    "authors": [
      "R. J. Taylor",
      "August Mendelsohn",
      "Arlee Shelby",
      "W. C. McCray",
      "Jin Ha Choi",
      "Nicholas Macsai",
      "Grant Riley",
      "Erick Smith",
      "Stefan Baeßler",
      "Leah J. Broussard",
      "Christopher B. Crawford",
      "Michael Gericke",
      "Francisco M. Gonzalez",
      "David Harrison",
      "Leendert Hayen",
      "Mark Makela",
      "R. R. Mammei",
      "D. G. Mathews",
      "D. D. Počanić",
      "Glenn Randall",
      "Americo Salas-Bacci",
      "W. S. Wilburn",
      "A. R. Young"
    ],
    "published": "2025-11-19T22:34:10Z",
    "updated": "2025-11-19T22:34:10Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.15844v1",
    "url": "https://arxiv.org/abs/2511.15844v1",
    "pdf_url": "https://arxiv.org/pdf/2511.15844v1.pdf",
    "title": "Geant4 based library SCoRe4 for Surface Contamination and Roughness Effects simulations in rare event search experiments",
    "abstract": "Surface simulations are important for accurately modeling particle interactions in experiments where background contributions from surface contaminants can significantly affect detector performance. In rare event searches, such as dark matter or neutrinoless double beta decay experiments, standard Geant4 simulations typically assume perfectly smooth surfaces, neglecting the microscopic roughness that exists in real materials. This simplification can lead to inaccurate predictions of energy deposition. To address this limitation, I developed SCoRe4, a Geant4-based library designed to simulate more realistic surface roughness based on experimentally measurable parameters. The code allows users to generate patches of simplified rough surface geometries across a wide range of scales - from square millimeters to square meters - while maintaining computational efficiency. SCoRe4 is open source and can be easily integrated into existing Geant4 setups. This work presents the structure, implementation, and example application of SCoRe4,as well as its potential use in improving the accuracy of background modeling in rare event physics.",
    "authors": [
      "Christoph Grüner"
    ],
    "published": "2025-11-19T20:09:24Z",
    "updated": "2025-11-19T20:09:24Z",
    "categories": [
      "physics.ins-det",
      "physics.comp-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2505.03660v2",
    "url": "https://arxiv.org/abs/2505.03660v2",
    "pdf_url": "https://arxiv.org/pdf/2505.03660v2.pdf",
    "title": "Understanding large-scale dynamos in unstratified rotating shear flows",
    "abstract": "We combine simulations with new analyses that overcome previous pitfalls to explicate how nonhelical mean-field dynamos grow and saturate in unstratified, magnetorotationally driven turbulence. Shear of the mean radial magnetic field amplifies the azimuthal component. Radial fields are regenerated by velocity fluctuations that induce shear of radial magnetic fluctuations, followed by Lorentz and Coriolis forces that source a negative off-diagonal component in the turbulent diffusivity tensor. We present a simple schematic to illustrate this dynamo growth. A different part of the Lorentz force forms a third-order correlator in the mean electromotive force that saturates the dynamo.",
    "authors": [
      "Tushar Mondal",
      "Pallavi Bhat",
      "Fatima Ebrahimi",
      "Eric G. Blackman"
    ],
    "published": "2025-05-06T16:05:05Z",
    "updated": "2025-11-19T18:19:30Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.GA",
      "astro-ph.HE",
      "astro-ph.SR",
      "physics.flu-dyn"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.15651v1",
    "url": "https://arxiv.org/abs/2511.15651v1",
    "pdf_url": "https://arxiv.org/pdf/2511.15651v1.pdf",
    "title": "Material processing by laser-plasma-filament-guided high voltage discharges",
    "abstract": "We investigate ablation experiments performed by laser-plasma-filament guided electrical discharges at high-voltages of up to 145 kV. The guiding was accomplished via fs-laser-generated plasma filaments across a gap of 201 mm of air onto steel 1.3343 samples. This method combines remote material processing and enables the steering and deflection of high voltage discharges with the ease-of-use of remote laser processing technology. We observe an increase of the per-pulse-(and-discharge)-ablated volume by a factor of 1.67 over an ablation regime when the discharges are not present and up to a factor of 12.5 over the case when neither discharges nor plasma filaments, only a loosely focused laser beam, are present.",
    "authors": [
      "Kristian Cvecek",
      "Markus Döring",
      "Alexander Romboy",
      "Johannes Heberle",
      "Michael Schmidt"
    ],
    "published": "2025-11-19T17:39:12Z",
    "updated": "2025-11-19T17:39:12Z",
    "categories": [
      "physics.plasm-ph",
      "physics.app-ph",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.15641v1",
    "url": "https://arxiv.org/abs/2511.15641v1",
    "pdf_url": "https://arxiv.org/pdf/2511.15641v1.pdf",
    "title": "Characterisation of X- and O-points in Wendelstein 7-X with respect to coil currents",
    "abstract": "This work analyses vacuum magnetic field topology in Wendelstein 7-X (W7-X) with respect to changes in the current in the superconducting coils. We develop a fast automated scheme to locate fixed points (such as X- and O-points) and calculate the trace of the Jacobian of the field line map for them (Tr(M)), which represents several important properties of the fixed point. We perform two sets of coil current scans: (1) scans where each coil current is varied individually, using the \"standard\", \"high iota\" and \"low iota\" configurations as starting points; (2) a scan of over 200,000 magnetic configurations in which the coil currents are randomly sampled. In both cases we constrain the coil currents to the normal range of W7-X. We verify the principal roles of the non-planar, planar and control coils: the non-planar coils establish island chains with a certain phase; the planar coils modify the location of the island chain by both controlling the iota profile and shifting the configuration \"inward\" and \"outward\"; the control coil affects the island size and phase. We also find that |Tr(M)-2| (a quantity closely related to the magnitude of the Greene's residue) tends to increase with the minor radius of the fixed points, and that Tr(M) for X- and O-points can be very differently affected by the control coil current. Finally, we show that |Tr(M)-2| serves as a proxy for island size for internal island chains, which may help identification of suitable experimental candidates.",
    "authors": [
      "Robert Davies",
      "Christopher B. Smiet",
      "Charlotte Batzdorf",
      "J. Geiger",
      "J. Loizu",
      "S. A. Henneberg"
    ],
    "published": "2025-11-19T17:23:05Z",
    "updated": "2025-11-19T17:23:05Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.15579v1",
    "url": "https://arxiv.org/abs/2511.15579v1",
    "pdf_url": "https://arxiv.org/pdf/2511.15579v1.pdf",
    "title": "Turbulence in the terrestrial magnetosheath: space-time correlation using the Magnetospheric Multiscale mission",
    "abstract": "Spatiotemporal correlation of magnetic field fluctuations is investigated using the Magnetospheric Multiscale mission in the terrestrial magnetosheath. The first observation of the turbulence propagator in space emerges through analysis of more than a thousand intervals. Results show clear features of spatial and spectral anisotropy, leading to a distinct behavior of relaxation times in the directions parallel and perpendicular to the mean magnetic field. Full space-time investigation of the Taylor hypothesis reveals a scale-dependent anisotropy of magnetosheath fluctuations that can be compared to the effect of flow propagation on spacecraft frame time decorrelation rates as well as with Eulerian estimates. The turbulence propagator reveals that the amplitudes of the perpendicular modes decorrelate according to sweeping or Alfvénic propagation mechanisms. The decorrelation time of parallel modes instead does not depend on the parallel wavenumber, which could be due to resonant interactions. Through direct observation, this study provides unprecedented insight into the space-time structure of turbulent space plasmas, while giving critical constraints for theoretical and numerical models.",
    "authors": [
      "Francesco Pecora",
      "William H. Matthaeus",
      "Antonella Greco",
      "Pablo Dmitruk",
      "Yan Yang",
      "Vincenzo Carbone",
      "Sergio Servidio"
    ],
    "published": "2025-11-19T16:10:16Z",
    "updated": "2025-11-19T16:10:16Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2511.15562v1",
    "url": "https://arxiv.org/abs/2511.15562v1",
    "pdf_url": "https://arxiv.org/pdf/2511.15562v1.pdf",
    "title": "High Density Hybridisation Using ENIG Bumping and Anisotropic Conductive Films",
    "abstract": "Fine-pitch hybridisation processes are essential for next-generation pixel detectors and high-density microelectronic assemblies. Conventional bump-bonding techniques, although reliable, remain costly and difficult to implement for single-die applications.   In this work, we present flip-chip hybridisation results combining Electroless Nickel Immersion Gold (ENIG) bumping with Anisotropic Conductive Film (ACF) bonding, both developed in-house. This method enables fine-pitch interconnections without requiring wafer-level processing.   The feasibility of the ENIG-ACF process for functional devices was demonstrated by hybridising functional Timepix3 ASIC and Ti-LGAD (Trench Isolated Low-Gain Avalanche Detector) sensors with 55 um pitch. The approach was then extended to test structures with 25 um pitch, using aligned-particle ACFs. The analysis revealed that the main limitation originated from the mismatch between ACF thickness and bump height, underlining the importance of interface geometry optimisation. To address this, a dedicated simulation program was developed to model the isotropic growth of ENIG bumps and to determine the optimum bump height as a function of ACF thickness and pixel-matrix geometry.   The results provide valuable guidelines for future high connection density assemblies and demonstrate the potential of the ENIG-ACF process as a scalable, low-cost alternative to conventional bump-bonding techniques.",
    "authors": [
      "Haripriya Bangaru",
      "Giovanni Calderini",
      "Dominik Dannheim",
      "Rui De Oliveira",
      "Ahmet Lale",
      "Moritz Lauser",
      "Mateus Vicente Barreto Pinto",
      "Peter Svihra"
    ],
    "published": "2025-11-19T15:56:03Z",
    "updated": "2025-11-19T15:56:03Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.05340v2",
    "url": "https://arxiv.org/abs/2511.05340v2",
    "pdf_url": "https://arxiv.org/pdf/2511.05340v2.pdf",
    "title": "Modelling the Performance of Tritium Process Monitors from First Principles",
    "abstract": "Ionization chamber-based, in-line tritium process monitors play an important part in determining the behavior of a tritium system. The one-liter detection volume monitor has been characterized well through experiment and to respond linearly to tritium concentrations for the range of $1 μCi/m^3$ to $1 Ci/m^3$. Additionally, it has been shown to behave nonlinearly for low voltage on the central anode and low pressure of the carrier gas. A computational model was developed from first principles that successfully describes the behavior of the one-liter monitor for each of these regimes. Predictions from the model are compared to previously-collected experimental data in order to determine validity and tune the model. The model will be expanded to incorporate additional detector geometries and designs in the future.",
    "authors": [
      "Nicolas J. Sovare",
      "Walter T. Shmayda"
    ],
    "published": "2025-11-07T15:36:29Z",
    "updated": "2025-11-19T14:49:12Z",
    "categories": [
      "physics.ins-det",
      "physics.comp-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2504.04172v2",
    "url": "https://arxiv.org/abs/2504.04172v2",
    "pdf_url": "https://arxiv.org/pdf/2504.04172v2.pdf",
    "title": "Scaling of energy delivered through an electrostatic discharge to a small series load",
    "abstract": "We study the energy delivered through a small-resistance series ``victim'' load during electrostatic discharge events in air. For gap lengths over 1~mm, the fraction of the stored energy delivered is mostly gap-length independent, with a slight decrease at larger gaps due to electrode geometry. The energy to the victim scales linearly with circuit capacitance and victim load resistance but is not strongly dependent on circuit inductance. This scaling leads to a simple approach to predicting the maximum energy that will be delivered to a series resistance for the case where the victim load resistance is lower than the spark resistance.",
    "authors": [
      "Claudia A. M. Schrama",
      "Calvin Bavor",
      "John W. Rose",
      "P. David Flammer",
      "Charles G. Durfee"
    ],
    "published": "2025-04-05T13:27:35Z",
    "updated": "2025-11-19T14:12:17Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1016/j.elstat.2025.104205"
  },
  {
    "arxiv_id": "2511.06466v2",
    "url": "https://arxiv.org/abs/2511.06466v2",
    "pdf_url": "https://arxiv.org/pdf/2511.06466v2.pdf",
    "title": "Kerr Black Hole Shadows in Dispersive Plasma: Frequency-Dependent Geodesics and Shadow Distortions",
    "abstract": "The black hole shadow, a direct probe of the event horizon's gravitational influence, has been observationally confirmed by the Event Horizon Telescope (EHT). While theoretical models of shadows in vacuum are mature, real astrophysical black holes like M87* and Sgr A* are enveloped in plasma, which can alter photon trajectories through dispersion. Current understanding, based on foundational work, indicates that only specific plasma distributions allow for an analytical treatment via the separation of the Hamilton-Jacobi equation. In this work, we build upon this framework to systematically investigate the propagation of light rays in Kerr spacetime surrounded by a pressureless, non-magnetized cold plasma. We explicitly derive the separability condition, identifying the exact class of plasma densities that permit a generalized Carter constant. For these models, we compute the photon regions and shadow boundaries, characterizing how the shadow's size and shape deviate from the vacuum case in a frequency-dependent manner. Our results provide analytical benchmarks for the distortion of shadows in dispersive media and determine the critical plasma frequency beyond which the shadow is erased, offering a direct link between observable shadow features and the properties of the ambient plasma environment and providing a foundation for studying more dynamic, non-separable plasma distributions.",
    "authors": [
      "Sai Karan Mukthapuram",
      "Sandeep Kumar Kataria"
    ],
    "published": "2025-11-09T17:25:14Z",
    "updated": "2025-11-19T13:27:36Z",
    "categories": [
      "astro-ph.HE",
      "gr-qc",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2507.00548v3",
    "url": "https://arxiv.org/abs/2507.00548v3",
    "pdf_url": "https://arxiv.org/pdf/2507.00548v3.pdf",
    "title": "A waveform and time digitization mainboard prototype for the hybrid digital optical module of TRIDENT neutrino experiment",
    "abstract": "The TRIDENT (Tropical Deep-sea Neutrino Telescope) experiment is a next-generation underwater neutrino observatory planned for deployment in the West Pacific Ocean, designed to detect astrophysical neutrinos through Cherenkov radiation. The full-scale detector will consist of approximately 1000 vertical strings, each equipped with 20 hybrid digital optical modules (hDOMs) containing both photomultiplier tubes (PMTs) and silicon photomultipliers (SiPMs) for comprehensive light detection. This paper presents a custom-designed digitization mainboard prototype for the hDOM, featuring simultaneous 32-channel PMT waveform digitization at 125 MS/s using commercial analog-to-digital converters and 56-channel high-precision time measurement through field-programmable gate array -implemented time-to-digital converters. The system demonstrates excellent performance in single photoelectron (PE) detection with clear pedestal separation, maintains linear response up to 240 PEs, and achieves sub-nanosecond timing resolution for PMT or SiPM pulse edges.",
    "authors": [
      "Guangping Zhang",
      "Yong Yang",
      "Donglian Xu"
    ],
    "published": "2025-07-01T08:13:00Z",
    "updated": "2025-11-19T11:07:34Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.HE",
      "astro-ph.IM",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1007/s41605-025-00619-4"
  },
  {
    "arxiv_id": "2508.00503v2",
    "url": "https://arxiv.org/abs/2508.00503v2",
    "pdf_url": "https://arxiv.org/pdf/2508.00503v2.pdf",
    "title": "Using tunable coherence for reaching micrometer coherence lengths and suppressing stray light in a power-recycled Michelson interferometer",
    "abstract": "By reentering into laser interferometers, scattered or stray light introduces non-linear noise. This is a major limitation of precision interferometers as preventing such parasitic light is nearly impossible. Thus, substantial effort is put into mitigating the reentering of these fields in various ways. Ground-based laser interferometric gravitational wave detectors employ such mitigation techniques to reduce otherwise restrictive stray light noise. However, they are now reaching sensitivities where conventional mitigation techniques reach limitations. Further improvements planed for future observatories are placing even more demanding constraints on tolerable stray light power. We previously presented tunable coherence as a possible technique to ease these constraints and suppress unwanted coherent interference. For these promising demonstrations, the remaining coherence length and achievable suppression in length-constrained layouts was limited, among other things, by the used pseudo-random-noise phase modulation frequency. In this work, we demonstrate stray light suppression and cavity performance at modulation frequencies up to 10 GHz. This reduces the remaining coherence to a few centimeter in an interferometer, and even to the scale of the laser wavelength in a cavity. We further present a first demonstration of tunable coherence in a power-recycled Michelson interferometer, successfully suppressing stray light in a more complex topology.",
    "authors": [
      "Daniel Voigt",
      "Oliver Gerberding"
    ],
    "published": "2025-08-01T10:31:09Z",
    "updated": "2025-11-19T08:58:06Z",
    "categories": [
      "physics.optics",
      "astro-ph.IM",
      "gr-qc",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2511.13367v2",
    "url": "https://arxiv.org/abs/2511.13367v2",
    "pdf_url": "https://arxiv.org/pdf/2511.13367v2.pdf",
    "title": "Charge carrier generation in RNDR-DEPFET Detectors",
    "abstract": "Depleted p-channel field effect transistor detectors with repetitive-non-destructive readout (RNDR-DEPFETs) achieve a deep sub-electron noise by averaging several independent measurements of one single event. During the repetitive readout collected electrons are transferred between two readout nodes within each pixel to enable electron number-resolved measurements. The pixels serve as a unit cell of an active pixel sensor to achieve a high level of parallelization and fast readout. These properties are exploited in the DANAE experiment, which aims for the direct detection of light dark matter based with the event signature of electron recoils. We present the experimental characterization of an $64\\times64$ RNDR-DEPFET pixel detector with a focus on the charge carrier generation rate. This technology achieves a high time resolution, which increases its sensitivity on rare events with a signal of two or more electrons due to the Poisson distribution of thermal generated electrons.",
    "authors": [
      "Niels Wernicke",
      "Alexander Bähr",
      "Hannah Danhel",
      "Florian Heinrich",
      "Holger Kluck",
      "Jelena Ninkovic",
      "Jochen Schieck",
      "Wolfgang Treberspurg",
      "Johannes Treis"
    ],
    "published": "2025-11-17T13:41:30Z",
    "updated": "2025-11-19T08:51:20Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.13111v2",
    "url": "https://arxiv.org/abs/2511.13111v2",
    "pdf_url": "https://arxiv.org/pdf/2511.13111v2.pdf",
    "title": "NuBench: An Open Benchmark for Deep Learning-Based Event Reconstruction in Neutrino Telescopes",
    "abstract": "Neutrino telescopes are large-scale detectors designed to observe Cherenkov radiation produced from neutrino interactions in water or ice. They exist to identify extraterrestrial neutrino sources and to probe fundamental questions pertaining to the elusive neutrino itself. A central challenge common across neutrino telescopes is to solve a series of inverse problems known as event reconstruction, which seeks to resolve properties of the incident neutrino, based on the detected Cherenkov light. In recent times, significant efforts have been made in adapting advances from deep learning research to event reconstruction, as such techniques provide several benefits over traditional methods. While a large degree of similarity in reconstruction needs and low-level data exists, cross-experimental collaboration has been hindered by a lack of diverse open-source datasets for comparing methods.   We present NuBench, an open benchmark for deep learning-based event reconstruction in neutrino telescopes. NuBench comprises seven large-scale simulated datasets containing nearly 130 million charged- and neutral-current muon-neutrino interactions spanning 10 GeV to 100 TeV, generated across six detector geometries inspired by existing and proposed experiments. These datasets provide pulse- and event-level information suitable for developing and comparing machine-learning reconstruction methods in both water and ice environments. Using NuBench, we evaluate four reconstruction algorithms - ParticleNeT and DynEdge, both actively used within the KM3NeT and IceCube collaborations, respectively, along with GRIT and DeepIce - on up to five core tasks: energy and direction reconstruction, topology classification, interaction vertex prediction, and inelasticity estimation.",
    "authors": [
      "Rasmus F. Orsoe",
      "Stephan Meighen-Berger",
      "Jeffrey Lazar",
      "Jorge Prado",
      "Ivan Mozun-Mateo",
      "Aske Rosted",
      "Philip Weigel",
      "Arturo Llorente Anaya"
    ],
    "published": "2025-11-17T08:08:01Z",
    "updated": "2025-11-19T08:23:15Z",
    "categories": [
      "hep-ex",
      "cs.AI",
      "cs.LG",
      "physics.data-an",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2511.15209v1",
    "url": "https://arxiv.org/abs/2511.15209v1",
    "pdf_url": "https://arxiv.org/pdf/2511.15209v1.pdf",
    "title": "Magnetic signal scan imaging system based on giant magnetoimpedance (GMI) differential sensor",
    "abstract": "This paper presents the design and implementation of a magnetic signal scanning and imaging system based on the giant magnetoimpedance (GMI) effect. The system employs a pair of performance-matched GMI sensing elements configured as a differential probe structure. Through co-optimized low-noise electronic and probe design, the system effectively suppresses both intrinsic sensor common-mode drift and external environmental magnetic noise, enabling high signal-to-noise ratio detection of nono-tesla to micro-tesla-level magnetic signals without magnetic shielding. Experimental results demonstrate that the differential system achieves significantly lower noise spectral density in unshielded environments compared to conventional GMI sensors (\\SI{46}{pT}/$\\sqrt{\\text{Hz}}$ versus \\SI{286}{pT}/$\\sqrt{\\text{Hz}}$ at \\SI{1}{Hz}), with a sensitivity of 186,790 V/T and spatial resolution better than 200 micrometers. The system's excellent performance in weak magnetic field detection and spatial resolution was verified through scanning experiments of magnetic ink on US banknotes and magnetic reference samples. Compared to SQUID scanning systems, which requiring liquid helium cooling, this system based on the GMI effect offers advantages of room-temperature operation, compact structure, and low cost. Relative to conventional single-element GMI microscopes, it achieves significant improvements in signal-to-noise ratio and environmental adaptability. This research provides a practical solution for high-resolution magnetic field imaging at room temperature with broad application potential in materials magnetism, biomagnetic imaging, and nanomagnetic detection.",
    "authors": [
      "Tao Yang",
      "Zhoulu Yu",
      "Xuekui Xi",
      "Changjun Jiang",
      "Guozhi Chai"
    ],
    "published": "2025-11-19T08:00:05Z",
    "updated": "2025-11-19T08:00:05Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  }
]