{
  "arxiv_id": "2511.20417v1",
  "url": "https://arxiv.org/abs/2511.20417v1",
  "pdf_url": "https://arxiv.org/pdf/2511.20417v1.pdf",
  "title": "Future Colliders Comparative Evaluation -- Working Group Report",
  "abstract": "In anticipation of the completion of the High-Luminosity Large Hadron Collider (HL-LHC) programme by the end of 2041, CERN is preparing to launch a new major facility in the mid-2040s. According to the 2020 European Strategy for Particle Physics (ESPP), the highest-priority next collider is an electron-positron Higgs factory, followed in the longer term by a hadron-hadron collider at the highest achievable energy. The CERN directorate established a Future Colliders Comparative Evaluation working group in June 2023. This group brings together project leaders and domain experts to conduct a consistent evaluation of the Future Circular Collider (FCC) and alternative scenarios based on shared assumptions and standardized criteria. This report presents a comparative evaluation of proposed future collider projects submitted as input for the Update of the European Strategy for Particle Physics. These proposals are compared considering main performance parameters, environmental impact and sustainability, technical maturity, cost of construction and operation, required human resources, and realistic implementation timelines. An overview of the international collider projects within a similar timeframe, notably the CEPC in China and the ILC in Japan is also presented, as well as a short review of the status and prospects of new accelerator techniques.",
  "authors": [
    "G. Arduini",
    "M. Benedikt",
    "F. Gianotti",
    "K. Jakobs",
    "M. Lamont",
    "R. Losito",
    "M. Meddahi",
    "J. Mnich",
    "N. Mounet",
    "D. Schulte",
    "F. Sonnemann",
    "S. Stapnes",
    "F. Zimmermann"
  ],
  "published": "2025-11-25T15:41:09Z",
  "updated": "2025-11-25T15:41:09Z",
  "categories": [
    "physics.acc-ph",
    "hep-ex"
  ],
  "primary_category": "physics.acc-ph"
}