[
  {
    "arxiv_id": "2510.14948v1",
    "url": "https://arxiv.org/abs/2510.14948v1",
    "pdf_url": "https://arxiv.org/pdf/2510.14948v1.pdf",
    "title": "FAIR Commissioning - Towards First Science",
    "abstract": "The international Facility for Antiproton and Ion Research (FAIR) is under construction at the GSI Helmholtz Centre in Darmstadt. The first project stage includes the superconducting 100 Tm heavy-ion synchrotron SIS100, the Super Fragment Separator, and associated beam transport lines. Part of GSI's existing accelerator chain, comprising UNILAC and SIS18, will serve as injector. Installation work in the FAIR accelerator tunnels and supply buildings has been ongoing since early 2024. As progress continues, special attention is now on the start of commissioning, beginning in 2025 with the cryogenic plant. Commissioning of the transport line will follow at the end of 2025, and beam commissioning is scheduled for the second half of 2027. This paper outlines the current status of the project, commissioning strategy and timeline.",
    "authors": [
      "S. Reimann",
      "H. Albers",
      "R. W. Assmann",
      "P. Gasik",
      "O. Geithner",
      "F. Hagenbuck",
      "A. Herlert",
      "P. Hofmann",
      "V. Kamerdzhiev",
      "M. Kauschke",
      "H. Kollmus",
      "S. Pietri",
      "N. Pyka",
      "T. Radon",
      "C. Schroeder",
      "S. Schwarz",
      "H. Simon",
      "P. Spiller",
      "K. Vogt"
    ],
    "published": "2025-10-16T17:56:27Z",
    "updated": "2025-10-16T17:56:27Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.18429/JACoW-IPAC25-THBN2"
  },
  {
    "arxiv_id": "2510.14835v1",
    "url": "https://arxiv.org/abs/2510.14835v1",
    "pdf_url": "https://arxiv.org/pdf/2510.14835v1.pdf",
    "title": "Obvious and non-obvious aspects of digital Self-Excited-Loops for SRF   cavity control",
    "abstract": "In 1978, Delayen showed how Self-Excited Loops (SEL) can be used to great advantage for controlling narrow-band SRF cavities. Its key capability is establishing closed-loop amplitude control early in the setup process, stabilizing Lorentz forces to allow cavity tuning and phase loop setup in a stable environment. As people around the world implement this basic idea with modern FPGA DSP technology, multiple variations and operational scenarios creep in that have both obvious and non-obvious ramifications for latency, feedback stability, and resiliency. This paper will review the key properties of a Delayen-style SEL when set up for open-loop, amplitude stabilized, and phase-stabilized modes. Then the original analog circuit will be compared and contrasted with the known variations of digital CORDIC-based implementations.",
    "authors": [
      "Larry Doolittle",
      "Shreeharshini Murthy",
      "Matei Guran",
      "Lennon Reyes",
      "Shrividhyaa Sankar Raman",
      "Philip Varghese"
    ],
    "published": "2025-10-16T16:11:00Z",
    "updated": "2025-10-16T16:11:00Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.14758v1",
    "url": "https://arxiv.org/abs/2510.14758v1",
    "pdf_url": "https://arxiv.org/pdf/2510.14758v1.pdf",
    "title": "Design optimization of silicon nitride nanomechanical resonators for   thermal infrared detectors: a guide through key figures of merit",
    "abstract": "Thermomechanical infrared (IR) detectors have emerged as promising alternatives to traditional photon and thermoelectric sensors, offering broadband sensitivity and low noise without the need for cryogenic cooling. Despite recent advances, the field still lacks a unified framework to guide the design of these nanomechanical systems. This work addresses that gap by providing a comprehensive design guide for IR thermal detectors based on silicon nitride drumhead and trampolines. Leveraging a validated analytical model, we systematically explore how geometry, tensile stress, and optical properties influence key performance metrics such as thermal time constant, noise-equivalent power, and specific detectivity. The analysis encompasses both bare silicon nitride and structures with broadband absorber layers, revealing how different parameter regimes affect the trade-off between sensitivity and response speed. Rather than focusing on a single device architecture, this study maps out a broad design space, enabling performance prediction and optimisation for a variety of application requirements. As such, it serves not only as a reference for benchmarking existing devices but also as a practical tool for engineering next-generation IR sensors that can operate close to the fundamental detection limit. This work is intended as a foundational resource for researchers and designers aiming to tailor IR detectors to specific use cases.",
    "authors": [
      "Paolo Martini",
      "Kostas Kanellopulos",
      "Silvan Schmid"
    ],
    "published": "2025-10-16T14:57:44Z",
    "updated": "2025-10-16T14:57:44Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.26416v3",
    "url": "https://arxiv.org/abs/2509.26416v3",
    "pdf_url": "https://arxiv.org/pdf/2509.26416v3.pdf",
    "title": "Scintillating properties of Cs${_2}$ZrCl${_6}$ crystals in the   temperature range of 5-300 K",
    "abstract": "A new comprehensive study on the Cs${_2}$ZrCl${_6}$ (CZC) crystal scintillating properties under different types of irradiation was performed over a wide temperature range from 5 to 300 K. The light yield (LY) at room temperature (RT), measured under irradiation by 662 keV $\\gamma$ quanta of $^{137}$Cs, was evaluated to be 53,300 $\\pm$ 4,700 photons/MeV corresponding to approximately 71% of its estimated absolute value. The maximum light emission was observed in the temperature interval 135-165 K, where the LY reached 56,900 photons/MeV and 19,700 photons/MeV for $\\gamma$ quanta and $\\alpha$ particles, respectively. The quenching factor (QF) for $\\alpha$ particles increases smoothly from QF = 0.30 at RT to QF = 0.36 at 135 K. The shape of scintillation pulses induced by $\\alpha$ particles is characterized by three time-constants (0.3, 2.5 and 11.8 $\\mu$s at RT), whereas the average pulse of $\\gamma$ induced events is characterized by two time-constants (1.3 and 11.5 $\\mu$s at RT). At the same time, scintillating properties and pulse-shape discrimination capability of the CZC exhibit an acute deterioration at temperatures below 135 K. The optimal operating conditions to maximize the scintillating performance of undoped CZC crystals are discussed.",
    "authors": [
      "F. Cappella",
      "P. C. F. Di Stefano",
      "E. Ellingwood",
      "J. Hucker",
      "T. Leroy",
      "S. S. Nagorny",
      "V. V. Nahorna",
      "L. Pagnanini",
      "P. Skensved",
      "N. Swidinsky",
      "P. Wang"
    ],
    "published": "2025-09-30T15:40:17Z",
    "updated": "2025-10-16T13:24:26Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.14575v1",
    "url": "https://arxiv.org/abs/2510.14575v1",
    "pdf_url": "https://arxiv.org/pdf/2510.14575v1.pdf",
    "title": "Linear damping of magneto-acoustic waves in two-fluid partially ionized   plasmas",
    "abstract": "Magneto-acoustic waves in partially ionized plasmas are damped due to elastic collisions between charged and neutral particles. Here, we use a linearized two-fluid model to describe the influence of this collisional interaction on the properties of small-amplitude waves propagating in a uniform and static background. Mainly focusing on the case of waves generated by a periodic driver, we perform a detailed study of the dependence of the wavenumbers and damping rates on the ionization degree of the plasma, the strength of the collisional coupling, and the angle of propagation. We describe how the different wave modes (fast, slow, acoustic) are related to the individual properties of each fluid in a wide range of physical conditions. In addition, we derive analytical approximations for the damping rates due to charge-neutral collisions in the limits of weak and strong coupling and check their range of validity in comparison with the exact numerical results. These approximations can be generally applied to a large variety of astrophysical and laboratory partially ionized plasmas, but here we also discuss the particular application to plasmas only composed of hydrogen.",
    "authors": [
      "David Martínez-Gómez"
    ],
    "published": "2025-10-16T11:33:02Z",
    "updated": "2025-10-16T11:33:02Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.14531v1",
    "url": "https://arxiv.org/abs/2510.14531v1",
    "pdf_url": "https://arxiv.org/pdf/2510.14531v1.pdf",
    "title": "Design and simulation of a 4H-SiC low gain avalanche diode with   trench-isolation",
    "abstract": "We present the design and simulation of a 30 $\\mathrm{\\mu m}$ thick 4H-SiC Low Gain Avalanche Diode (LGAD) optimized for high-voltage operation. A 2.4 $\\mathrm{\\mu m}$ thick epitaxially grown gain layer enables controlled internal amplification up to 1 kV reverse bias, while maintaining full depletion below 500 V. Electrical characteristics, including I-V, C-V, and gain behavior, were simulated in Synopsys Sentaurus Technology Computer-Aided Design (TCAD) using a quasi-1D geometry and verified across process-related variations in gain layer parameters. To ensure high-voltage stability and proper edge termination, a guard structure combining deep etched trenches and deep $p^+$ junction termination extension (JTE) implants was designed. TCAD simulations varying the guard structure dimensions yielded an optimized design with a breakdown voltage above 2.4 kV. A corresponding wafer run is currently processed at IMB-CNM, Barcelona.",
    "authors": [
      "Sebastian Onder",
      "Philipp Gaggl",
      "Jürgen Burin",
      "Andreas Gsponer",
      "Matthias Knopf",
      "Simon Waid",
      "Neil Moffat",
      "Giulio Pellegrini",
      "Thomas Bergauer"
    ],
    "published": "2025-10-16T10:21:35Z",
    "updated": "2025-10-16T10:21:35Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1016/j.nima.2025.170740"
  },
  {
    "arxiv_id": "2510.14521v1",
    "url": "https://arxiv.org/abs/2510.14521v1",
    "pdf_url": "https://arxiv.org/pdf/2510.14521v1.pdf",
    "title": "Influence of kinetic effects in large-scale magnetic reconnection with   multi-hierarchy simulation code KAMMUY",
    "abstract": "Magnetic reconnection is a multiscale phenomenon where fluid- and particle-scale processes interact. The particle-in-cell (PIC) method, capable of resolving kinetic (particle-scale) physics, is extensively used to study the kinetic effects in magnetic reconnection. Meanwhile, because of the high computational cost, PIC simulations cannot capture the interaction between kinetic and fluid dynamics, which poses a major obstacle to understanding magnetic reconnection in large-scale phenomena such as solar flares. A multi-hierarchy simulation that combines Magnetohydrodynamics (MHD) and PIC provides a promising means to overcome these spatial and temporal scale gaps. We developed a multi-hierarchy simulation code KAMMUY (Kinetic And Magnetohydrodynamic MUlti-hierarchY simulation code), in which an ideal MHD simulation for a large domain and a PIC simulation for a smaller domain are solved in parallel with mutual information exchange. To validate the code, we conducted test simulations of MHD wave propagation and the shock tube problem. The results demonstrate that short-wavelength, high-frequency waves generated in the PIC region do not propagate into the MHD region, whereas MHD-scale structures propagate smoothly into the PIC region, highlighting the capability of our code for numerical studies of magnetic reconnection. By applying the KAMMUY code to magnetic reconnection while varying the PIC domain size, we find that the reconnection rate remains unchanged, regardless of the extent of the PIC region where the Hall magnetic field is present. It suggests that the spatial extension of the Hall magnetic field on the scale of $10 \\sim 100 \\lambda_i$ does not influence the reconnection rate.",
    "authors": [
      "Keita Akutagawa",
      "Shinsuke Imada",
      "Munehito Shoda"
    ],
    "published": "2025-10-16T10:09:39Z",
    "updated": "2025-10-16T10:09:39Z",
    "categories": [
      "astro-ph.SR",
      "astro-ph.EP",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2510.14485v1",
    "url": "https://arxiv.org/abs/2510.14485v1",
    "pdf_url": "https://arxiv.org/pdf/2510.14485v1.pdf",
    "title": "Coherent radiation produced by microtron electron bunches",
    "abstract": "The theory of coherent transition radiation produced by a relativistic electron beam during its extraction from a microtron is established. Expressions for the beam form factor, spectral-angular and angular distribution of coherent transition radiation are obtained in explicit form. Estimates of microwave noise caused by coherent transition radiation are given.",
    "authors": [
      "S. V. Anishchenko",
      "P. V. Molchanov"
    ],
    "published": "2025-10-16T09:29:51Z",
    "updated": "2025-10-16T09:29:51Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.14442v1",
    "url": "https://arxiv.org/abs/2510.14442v1",
    "pdf_url": "https://arxiv.org/pdf/2510.14442v1.pdf",
    "title": "A further study on the high-precision optics for HIAF-BRing",
    "abstract": "All equipment for the High Intensity heavy ion Accelerator Facility (HIAF) has been installed and beam commissioning is currently underway. This paper presents a further study on the high-precision optics, namely slice optics, of the Booster Ring (BRing) at HIAF based on measured magnetic fields, focusing on two aspects: closed-orbit distortion and optical parameter variations caused by errors, and dynamic aperture. A detailed study is conducted on the closed-orbit distortion and changes in optical parameters caused by magnet alignment errors and dipole magnet field errors. Meanwhile, A detailed study is also conducted on the dynamic aperture of BRing. The results show that the sliced optics and the original optics are comparable in terms of the impact of these errors on the closed-orbit and optical parameters. Without chromaticity correction, the dynamic aperture of the sliced optics is superior to that of the original optics; after chromaticity correction, the sliced optics is also comparable to the original optics. This study provides valuable insights for accelerator tuning and optimization.",
    "authors": [
      "Ke Wang",
      "Li-Na Sheng",
      "Tao Li",
      "Geng Wang",
      "Wei-Ping Chai",
      "You-Jin Yuan",
      "Jian-Cheng Yang",
      "Guo-Dong Shen",
      "Liang Lu"
    ],
    "published": "2025-10-16T08:41:22Z",
    "updated": "2025-10-16T08:41:22Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.14440v1",
    "url": "https://arxiv.org/abs/2510.14440v1",
    "pdf_url": "https://arxiv.org/pdf/2510.14440v1.pdf",
    "title": "Beam Energy Measurement using a Bayesian Approach with the Stacked Foil   Method",
    "abstract": "We present a practical method to measure the energy of proton beams at a medical cyclotron using the stacked foil technique in combination with a Bayesian inference method. By measuring the $^{48}$V activity induced in a stack of irradiated titanium foils, the proton energy can be inferred without relying on direct current or charge measurements, making the method suitable even for low-vacuum environments or air-exposed setups. This technique is further extended to configurations where the beam energy is degraded to levels around 8 MeV. A Bayesian fit of the measured activity profile allows not only for a robust energy estimation but also for a consistent treatment of uncertainties and nuisance parameters. Monte Carlo simulations are employed to validate the underlying assumptions, including the impact of energy dispersion or cross-section uncertainties. Our results demonstrate that this method provides accurate beam energy measurements across several typical experimental setups used at the Bern Medical Cyclotron. Additionally, we evaluate the sensitivity of the method to the choice of nuclear cross-section data and assess how the number of foils in the stack affects the uncertainty in the inferred beam energy.",
    "authors": [
      "Alexander Gottstein",
      "Lorenzo Mercolli",
      "Eva Kasanda",
      "Isidre Mateu",
      "Lars Eggimann",
      "Elnaz Zyaee",
      "Gaia Dellepiane",
      "Pierluigi Casolaro",
      "Paola Scampoli",
      "Saverio Braccini"
    ],
    "published": "2025-10-16T08:40:51Z",
    "updated": "2025-10-16T08:40:51Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex",
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.14437v1",
    "url": "https://arxiv.org/abs/2510.14437v1",
    "pdf_url": "https://arxiv.org/pdf/2510.14437v1.pdf",
    "title": "Evaluating plastic scintillator performance as a substitute of LYSO in   SiPM based animal PET scanners: A GEANT4 simulation analysis",
    "abstract": "A systematic study is conducted to understand the coincident resolving time (CRT) for a pair of Lutetium-yttrium oxyorthosilicate (LYSO) and the plastic scintillation detector bars under the Geant4 framework. Crystals are coupled to a silicon photomultiplier single pad wafer with an appropriate optical coupling for signal readout. Pad reads the light photons undergoing optoelectronic conversion at the wafer site and generates electrical pulses with a bi-exponential shape. These signals are used to determine the trigger time stamp of back-to-back gamma-rays emitted from a point source, enabling the evaluation of CRT performance at different plastic scintillator lengths. For the LYSO detector, the simulation yields the CRT response of 174 ps, which aligns to the literature reported value for the dimensions 2 mm x 2 mm x 10 mm. To identify the plastic scintillator dimensions with an integrated gamma-ray detection efficiency comparable to LYSO's photopeak efficiency at 511 keV gamma photons, various bar lengths of commercial plastic BC404 and TIFR Ooty's in-house developed plastic material are attempted in Geant4. Consequently, for both the plastic scintillators, the equivalent length (for the same cross-sectional area) was found to be 4 times that of LYSO crystal length at a threshold of 25 keV. CRT value determined for this dimension is found to be $\\approx$ 300 ps for both the plastic medium. It suggests that, if an animal preclinical PET scanner is developed with plastic bars, the minimum achievable image resolution (FWHM) of $\\approx$ 4.5 cm can be expected for a pair of detection elements.",
    "authors": [
      "Davinder Siwal",
      "P. K. Mohanty",
      "D. Bose",
      "A. Jain"
    ],
    "published": "2025-10-16T08:37:30Z",
    "updated": "2025-10-16T08:37:30Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.14422v1",
    "url": "https://arxiv.org/abs/2510.14422v1",
    "pdf_url": "https://arxiv.org/pdf/2510.14422v1.pdf",
    "title": "Nanodiamond photocathodes for MPGD-based single photon detectors",
    "abstract": "This study investigates the suitability of Hydrogenated NanoDiamond (HND) materials as an alternative for CsI in MPGD-based photon detectors. The research focuses on characterizing HND photocathodes coupled with THGEM + Micromegas-based detectors. The HND grains were prepared via hydrogenation and stored in water for more than two years. They were then coated on PCB discs or THGEMs using a pulsed spray technique. The resulting quantum efficiency (QE) values (~4% at 122 nm) were found to be within a factor of 10 of the best freshly hydrogenated samples reported in the literature ( ~40% at 120 nm). The robustness of reflective HND photocathodes against ion bombardment was measured to be about 10 times larger than the corresponding CsI one after the same charge accumulation. Furthermore, THGEM characterization indicates minimal alteration in response after HND coatings. These results suggest that HND holds potential as a more robust photocathode for gaseous detectors, offering improved performance in single-photon detection applications.",
    "authors": [
      "F. M. Brunbauer",
      "C. Chatterjee",
      "G. Cicala",
      "D. D'Ago",
      "S. Dalla Torre",
      "M. S. Leone",
      "S. Levorato",
      "T. Ligonzo",
      "M. Lisowska",
      "R. Rai",
      "F. Tessarotto",
      "Triloki",
      "A. Valentini",
      "L. Velardi"
    ],
    "published": "2025-10-16T08:25:14Z",
    "updated": "2025-10-16T08:25:14Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1016/j.nima.2025.171055"
  },
  {
    "arxiv_id": "2510.14360v1",
    "url": "https://arxiv.org/abs/2510.14360v1",
    "pdf_url": "https://arxiv.org/pdf/2510.14360v1.pdf",
    "title": "High-brightness Graphite Photocathodes",
    "abstract": "A robust and infrared laser-excited photocathode with high quantum efficiency, high brightness, and low cost, operating under a moderate vacuum, has long been sought by the accelerator and microscopy communities. This study investigates various types of graphite photocathodes, including bulk, sheet, and flake graphite, in the regime of thermionically assisted photoemission by an irradiating infrared laser. Our experiment reveals that, under space-charge-limited photoemission, the flake-graphite photocathode with a dense population of nano-graphene fins on its surface exhibits the highest quantum efficiency, which is 770 times greater than that of a copper photocathode irradiated by the same infrared laser at 1064 nm. With our theory considering both thermionic and multiphoton emissions, we determine that the flake graphite photocathode is 200 times brighter than a copper photocathode irradiated by an infrared laser and is as bright as a LaB6 field emitter.",
    "authors": [
      "Po-Hsun Wu",
      "Yu-Chieh Lo",
      "Yen-Chieh Huang"
    ],
    "published": "2025-10-16T06:56:58Z",
    "updated": "2025-10-16T06:56:58Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.14343v1",
    "url": "https://arxiv.org/abs/2510.14343v1",
    "pdf_url": "https://arxiv.org/pdf/2510.14343v1.pdf",
    "title": "Beam-commissioning-oriented optics study of HFRS Phase-I based on   measured magnetic field data",
    "abstract": "The construction of the first phase of the High energy FRagment Separator (HFRS Phase-I) has already been completed and it is anticipated to start beam commissioning in autumn 2025. This paper presents the first order and higher order beam optics calculations for the HFRS Phase-I, using measured magnet data, and evaluates its experimental performance in preparation for beam commissioning. The first order optics of HFRS is calculated based on the sliced magnetic fields and the higher order aberrations are corrected using a self-compiled program. Monte Carlo particle tracking is employed to analyze the beam phase spaces on the focal planes. The experimental performance of the machine is evaluated through Monte Carlo simulations. The beam phase spaces on the focal planes are thoroughly examined, demonstrating that the higher order aberrations have been well corrected. Moreover, the experimental performance of HFRS is evaluated based on the corrected higher order optics, yielding satisfactory results: the secondary beams of interest can be well separated and exhibit high transmission efficiency. This work provides valuable insights for the upcoming beam commissioning of HFRS Phase-I. The effective correction of higher order aberrations and optimized magnet settings lay a solid foundation for future experiments.",
    "authors": [
      "Ke Wang",
      "Li-Na Sheng",
      "Xue-Heng Zhang",
      "Bei-Min Wu",
      "Ming-Bang Lü",
      "Dong-Sheng Ni",
      "Jing Yang",
      "Xiang Zhang",
      "Fu-Qiang Liu",
      "Qing-Gao Yao",
      "Xiao-Wei Xu",
      "Ya-Jun Zheng",
      "Guo-Dong Shen",
      "Geng Wang",
      "You-Jin Yuan",
      "Jian-Cheng Yang",
      "Liang Lu"
    ],
    "published": "2025-10-16T06:28:42Z",
    "updated": "2025-10-16T06:28:42Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.14324v1",
    "url": "https://arxiv.org/abs/2510.14324v1",
    "pdf_url": "https://arxiv.org/pdf/2510.14324v1.pdf",
    "title": "Dust-ion-acoustic solitons in an ion-beam-driven dusty magnetoplasma   with adiabatic and nonadiabatic dust charge variations",
    "abstract": "We study the characteristics of small-amplitude nonlinear dust-ion-acoustic (DIA) solitary waves in active magnetized positive-ion-beam-driven dusty plasmas with the effects of nonadiabatic and adiabatic dust charge variations. In the model, we consider the ion-neutral collision and thereby consider the collision enhanced ion current to the dust-charging process and dust charge fluctuations. We show that the streaming of the positive-ion beam significantly affects the dust-charging process in which the dust charge number decreases (increases) with an increased beam velocity (number density). Using the standard reductive perturbation technique, we derive the evolution equations in the form of Korteweg-de Vries (KdV) equations for DIA solitary waves for two different cases: nonadiabatic and adiabatic dust charge variations. We study the effect of positive ion beam, dust charge variation, magnetic field, ion creation, and ion-neutral collision enhanced current on the wave characteristics. We find that the soliton energy decays with time and is affected by the beam velocity. Also, the solitary waves get damped by the effects of ion creation, ion loss, ion-neutral collision enhanced current, and dust charge variation. Although the ion beam does not change the polarity of solitary waves in the case of adiabatic dust charge variation, a transition from rarefactive to compressive solitary waves occurs in the presence of an ion beam with nonadiabatic dust charge variation.",
    "authors": [
      "N. P. Acharya",
      "S. Basnet",
      "A. P. Misra",
      "R. Khanal"
    ],
    "published": "2025-10-16T05:45:23Z",
    "updated": "2025-10-16T05:45:23Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1109/TPS.2025.3615612"
  },
  {
    "arxiv_id": "2510.14280v1",
    "url": "https://arxiv.org/abs/2510.14280v1",
    "pdf_url": "https://arxiv.org/pdf/2510.14280v1.pdf",
    "title": "Flux Jamming, Phase Transitions and Layering in Turbulent Magnetized   Plasma",
    "abstract": "This paper discusses transport barrier formation and layering as consequences of jam formation. Extensive use is made of analogies with the theory of traffic flow in one dimension. The relation of flux jamming to motility induced phase separation (MIPS) is explained. Two routes to heat flux jamming are identified. The first is due to a rollover in the heat flux-pulse size relation, i.e. $dQ_T(\\delta T)/d\\delta T<0$, and is similar to the condition of flux-gradient bistability. The second occurs when the delay time between pulse and heat flux exceeds a critical value. This does not require bistability and tends to occur near marginality. This analysis yields an estimate of the answer to the eternal question of 'how near is \"near\"?'. Staircase development is shown to follow jamiton train formation. The relation of jamming of avalanches to phase transitions in drift wave-zonal flow turbulence is elucidated. The formation of outward propagating blob trains and inward propagating void trains is demonstrated. The important role of turbulence spreading is identified.",
    "authors": [
      "P. H. Diamond",
      "Y. Kosuga",
      "P. L. Guillon",
      "Ö. D. Gürcan"
    ],
    "published": "2025-10-16T04:05:26Z",
    "updated": "2025-10-16T04:05:26Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.14258v1",
    "url": "https://arxiv.org/abs/2510.14258v1",
    "pdf_url": "https://arxiv.org/pdf/2510.14258v1.pdf",
    "title": "Kinetic Scale Energy Budget in Turbulent Plasmas: Role of Electron to   Ion Temperature Ratio",
    "abstract": "The dissipation mechanisms in weakly collisional plasmas have been a longstanding topic of investigation, where significant progress has been made in recent years. A recent promising development is the use of the \"scale-filtered\" Vlasov-Maxwell equations to fully quantify the scale-by-scale energy balance, a feature that was absent when using fluid models in kinetic plasmas. In particular, this method reveals that the energy transfer in kinetic scales is fully accounted for by the scale-filtered pressure-strain interaction. Despite this progress, the influence of ion-electron thermal disequilibrium on the kinetic-scale energy budget remains poorly understood. Using two-dimensional fully kinetic particle-in-cell simulations of decaying plasma turbulence, we systematically investigate the pressure-strain interaction and its components at sub-ion scales by varying electron-to-ion temperature ratios. Our analysis focuses on three key ingredients of the pressure-strain interaction: the normal and shear components of Pi-D and pressure dilatation. Our results demonstrate that the scale-filtered pressure-strain interaction is dominated by scale-filtered Pi-D across the kinetic range, with the shear component consistently providing the dominant contribution. We find that the scale-filtered normal and shear contributions of Pi-D exhibit persistent anticorrelation and opposite signs across all kinetic scales. We also discover that the amplitude of both anisotropic components for each species scales directly with their temperature and inversely with the temperature of the other species, while the scale-filtered pressure dilatation remains negligible compared to the Pi-D terms but shows enhanced compressibility effects as plasma temperatures decrease. We discuss the implications of these findings in thermally non-equilibrated plasmas, such as in the turbulent magnetosheath and solar wind.",
    "authors": [
      "Subash Adhikari",
      "M. Hasan Barbhuiya"
    ],
    "published": "2025-10-16T03:16:31Z",
    "updated": "2025-10-16T03:16:31Z",
    "categories": [
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.14212v1",
    "url": "https://arxiv.org/abs/2510.14212v1",
    "pdf_url": "https://arxiv.org/pdf/2510.14212v1.pdf",
    "title": "Three-dimensional unmagnetized Mach probe analysis and initial flow   measurements in reversed-field pinch experiments",
    "abstract": "A novel matrix method of analyzing ion saturation current data from a general three-dimensional (3D) array of unmagnetized Mach probe tips is developed and used with data sets from two 3D Mach probes to make initial measurements of local plasma flow velocity in reversed-field pinch (RFP) experiments in the Madison Symmetric Torus (MST). The two 3D Mach probes are composed of regular polyhedral arrays of six and four tips, respectively, with the six-tip array composed of three orthogonal pairs of mutually opposite tips at the vertices of a regular octahedron and the four-tip array composed of non-opposite tips at the vertices of a regular tetrahedron, the analysis of which is specifically facilitated by the matrix method. Velocity measurement uncertainties for the Mach probes are derived based on uncertainties in probe machining and ion saturation current measurements, and typical relative uncertainties for the probes are estimated to be of order several percent, likely smaller than systematic uncertainties related to the Mach probe calibration constant and experimental uncertainties related to plasma and probe conditioning. Initial results for the octahedral probe show flow speeds of roughly the expected magnitudes based on previous MST measurements but with somes differences in flow direction, while those for the tetrahedron probe show similar flow directions to some previous measurements but also some larger than expected speeds. We consider possible causes for the unexpected results of these initial tests, with a focus on probe conditioning and fast electron issues.",
    "authors": [
      "K. J. McCollam",
      "R. Reksoatmodjo",
      "J. von der Linden",
      "J. Sears",
      "S. You",
      "H. Himura",
      "A. F. Almagri",
      "M. Reyfman",
      "C. C. Rouda",
      "J. S. Sarff",
      "A. M. Sellner"
    ],
    "published": "2025-10-16T01:39:12Z",
    "updated": "2025-10-16T01:39:12Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.14195v1",
    "url": "https://arxiv.org/abs/2510.14195v1",
    "pdf_url": "https://arxiv.org/pdf/2510.14195v1.pdf",
    "title": "A Flying Focus with Arbitrary Directionality",
    "abstract": "Flying focus techniques produce laser pulses whose focal points travel at arbitrary, controllable velocities. While this flexibility can enhance a broad range of laser-based applications, existing techniques constrain the motion of the focal point to the propagation direction of the pulse. Here, we introduce a flying focus configuration that decouples the motion of the focus from the propagation direction. A chirped laser pulse focused and diffracted by a diffractive lens and grating creates a focal point that can move both along and transverse to the propagation direction. The focal length of the lens, grating period, and chirp can be tuned to control the direction and velocity of the focus. Simulations demonstrate this control for a holographic configuration suited to high-power pulses, in which two off-axis pump beams with different focal lengths encode the equivalent phase of a chromatic lens and grating in a gas or plasma. For low-power pulses, conventional solid-state or adaptive optics can be used instead. Multi-dimensional control over the focal trajectory enables new configurations for applications, including laser wakefield acceleration of ions, steering of broadband THz radiation, and surface harmonic generation.",
    "authors": [
      "Sida Cao",
      "Devdigvijay Singh",
      "Lavonne S. Mack",
      "John P. Palastro",
      "Matthew R. Edwards"
    ],
    "published": "2025-10-16T01:03:37Z",
    "updated": "2025-10-16T01:03:37Z",
    "categories": [
      "physics.optics",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2509.16401v2",
    "url": "https://arxiv.org/abs/2509.16401v2",
    "pdf_url": "https://arxiv.org/pdf/2509.16401v2.pdf",
    "title": "Quantifying the Effects of Parameters in Widespread SEP Events with   EPREM",
    "abstract": "The Energetic Particle Radiation Environment Model (EPREM) solves the focused transport equation (FTE) on a Lagrangian grid in a frame co-moving with the solar wind plasma and simulates the acceleration and transport of solar energetic particles (SEP) in the heliosphere. When not coupled to an external magnetohydrodynamic model, EPREM functions in an uncoupled mode where an ideal cone-shock is injected into a homogeneous background solar wind. We carried out an analysis of the effects of multiple physical parameters in producing widespread SEP events simulated by the uncoupled EPREM using a relatively simple model of a strong magnetized shock propagating radially outward through the inner heliosphere to produce the requisite MHD quantities for EPREM's sophisticated model of proton acceleration and transport. We compared a baseline simulation with seven variations in which the value of a single parameter differed from its baseline value. All simulations exhibit complex profiles of SEP flux as a function of time and energy, with clear dependence on parameters related to diffusion, mean free path, and shock profile. Moreover, while all simulations exhibit significant longitudinal spread in SEP flux, for certain parameter values there exists a decrease or absence in SEP flux at observers located $\\geq 90^\\circ$ from the shock origin. Relating the differences in SEP flux to the specific values of each parameter in the simulations provides insight into the morphology of observed SEP events and the state of the solar wind through which the driving CME propagates.",
    "authors": [
      "Matthew A. Young",
      "Bala Poduval"
    ],
    "published": "2025-09-19T20:23:20Z",
    "updated": "2025-10-15T22:09:22Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2510.14078v1",
    "url": "https://arxiv.org/abs/2510.14078v1",
    "pdf_url": "https://arxiv.org/pdf/2510.14078v1.pdf",
    "title": "Plasma Confinement State Classification via FPP Relevant Microwave   Diagnostics",
    "abstract": "We present a parsimonious and robust machine learning approach for identifying plasma confinement states in fusion power plants (FPPs) where reliable identification of the low-confinement (L-mode) and high-confinement (H-mode) regimes is critical for safe and efficient operation. Unlike research-oriented devices, FPPs must operate with a severely constrained set of diagnostics. To address this challenge, we demonstrate that a minimalist model, using only electron cyclotron emission (ECE) signals, can deliver accurate and reliable state classification. ECE provides electron temperature profiles without the engineering or survivability issues of in-vessel probes, making it a primary candidate for FPP-relevant diagnostics. Our framework employs ECE as input, extracts features with radial basis functions, and applies a gradient boosting classifier, achieving high accuracy with test accuracy averaging 96\\% correct predictions. Robustness analysis and feature importance study confirm the reliability of the approach. These results demonstrate that state-of-the-art performance is attainable from a restricted diagnostic set, paving the way for minimalist yet resilient plasma control architectures for FPPs.",
    "authors": [
      "Randall Clark",
      "Vacslav Glukhov",
      "Georgy Subbotin",
      "Maxim Nurgaliev",
      "Aleksandr Kachkin",
      "Max Austin",
      "Dmitri M. Orlov"
    ],
    "published": "2025-10-15T20:36:21Z",
    "updated": "2025-10-15T20:36:21Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.14076v1",
    "url": "https://arxiv.org/abs/2510.14076v1",
    "pdf_url": "https://arxiv.org/pdf/2510.14076v1.pdf",
    "title": "Structure of self-generated magnetic fields in laser-solid interaction   from proton tomography",
    "abstract": "Strong magnetic fields are naturally self-generated in high-power, laser-solid interactions through the Biermann-battery mechanism. This work experimentally characterizes the 3D location and strength of these fields, rather than path-integrated quantities, through multi-view proton radiography and tomographic inversion on the OMEGA laser. We infer magnetic fields that extend several millimeters off the target surface into the hot, rarefied corona and are sufficient to strongly magnetize the plasma ($\\Omega_{e}\\tau_e \\gg 1$). The data is used to validate MHD simulations incorporating recent improvements in magnetic transport modeling; we achieve reasonable agreement only with models with re-localization of transport by magnetic fields. This work provides a key demonstration of tomographic inversion in proton radiography, offering a valuable tool for investigating magnetic fields in laser-produced plasmas.",
    "authors": [
      "Jesse Griff-McMahon",
      "Christopher A. Walsh",
      "Vicente Valenzuela-Villaseca",
      "Sophia Malko",
      "Brendan McCluskey",
      "Kirill Lezhnin",
      "Huws Landsberger",
      "Laura Berzak Hopkins",
      "Gennady Fiksel",
      "Michael J. Rosenberg",
      "Derek B. Schaeffer",
      "William Fox"
    ],
    "published": "2025-10-15T20:32:51Z",
    "updated": "2025-10-15T20:32:51Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.11504v3",
    "url": "https://arxiv.org/abs/2510.11504v3",
    "pdf_url": "https://arxiv.org/pdf/2510.11504v3.pdf",
    "title": "Towards polarization-enhanced PET: Study of random background in   polarization-correlated Compton events",
    "abstract": "Positron Emission Tomography (PET) is a medical imaging modality that utilizes positron-emitting isotopes, such as Ga-68 and F-18, for many diagnostic purposes. The positron annihilates with an electron from the surrounding area, creating two photons of 511 keV energy and opposite momenta, entangled in their orthogonal polarizations. When each photon undergoes a Compton scattering process, the difference of their azimuthal scattering angles reflects the initial orthogonality of their polarizations, peaking at $\\pm$90$^{\\circ}$. This type of correlation is not yet utilized in conventional PET scanners, but could potentially offer an energy-independent method for background reduction. Measurements of these kinds of correlations can be achieved using Compton polarimeters, built from a single layer of segmented scintillating crystals such as Gadolinium Aluminium Gallium Garnet doped with Cerium (GAGG:Ce), read out by silicon photomultipliers (SiPMs). In this paper, we study the signal-to-random background ratios in measurements of these correlated annihilation photons from coincidence time spectra across clinically relevant source activities, from $\\sim$200 MBq to $\\sim$378 MBq. These are then compared to the standard single-pixel (photoelectric) measurements. We find that the signal-to-random background ratios (SBRs) obtained from the polarization-correlated events for Compton scattering angles $\\theta_{1,2}\\in[72^{\\circ}, 90^{\\circ}]$ and azimuthal angle difference $\\Delta\\phi=90^{\\circ}\\pm20^{\\circ}$ are consistently higher than those from single-pixel events, with the ratio of their SBR values of 1.23. The SBR of the selected events also increases with the polarimetric modulation factor $\\mu$, gaining $\\sim$50\\% in value during the experiment.",
    "authors": [
      "Ana Marija Kožuljević",
      "Tomislav Bokulić",
      "Darko Grošev",
      "Siddharth Parashari",
      "Luka Pavelić",
      "Marinko Rade",
      "Marijan Žuvić",
      "Mihael Makek"
    ],
    "published": "2025-10-13T15:14:06Z",
    "updated": "2025-10-15T20:10:46Z",
    "categories": [
      "physics.ins-det",
      "physics.med-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.14061v1",
    "url": "https://arxiv.org/abs/2510.14061v1",
    "pdf_url": "https://arxiv.org/pdf/2510.14061v1.pdf",
    "title": "Three-Dimensional Simulation of the University of Hawai`i FEL   Oscillator: Superradiant Emission and Cavity Desynchronization",
    "abstract": "In this paper, we investigate superradiant emission in a free-electron laser (FEL) oscillator using a comprehensive three-dimensional time-dependent simulation tool. Using beam parameters from the University of Hawai`i (UH) at M\\=anoa FEL facility, our study shows that at nominal bunch length, the FEL radiation exhibits superradiant scaling in saturation. We then explore how cavity desynchronization enhances this regime by mitigating the laser lethargy effect in oscillators and improving overlap between the electron bunch and the radiation pulse, with peak power increased by more than a factor of five. Finally, we simulate a short-bunch operational mode with bunch length comparable to the slippage length, which accelerates saturation and further amplifies the FEL power. These findings highlight that the UH M\\=anoa FEL oscillator has the potential to achieve superradiant emission at its nominal operating mode, and that short-bunch operation offers further enhancement while requiring additional optimization.",
    "authors": [
      "Amir Weinberg",
      "Levi Fisher",
      "Siqi Li"
    ],
    "published": "2025-10-15T20:02:29Z",
    "updated": "2025-10-15T20:02:29Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.14056v1",
    "url": "https://arxiv.org/abs/2510.14056v1",
    "pdf_url": "https://arxiv.org/pdf/2510.14056v1.pdf",
    "title": "Beam-beam",
    "abstract": "The interaction of the two beams in a collider leads to a variety of effects that may limit the performance of the machine. This lecture introduces the basic aspects necessary to understand the design of modern colliders.",
    "authors": [
      "Xavier Buffat"
    ],
    "published": "2025-10-15T19:51:01Z",
    "updated": "2025-10-15T19:51:01Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.13956v1",
    "url": "https://arxiv.org/abs/2510.13956v1",
    "pdf_url": "https://arxiv.org/pdf/2510.13956v1.pdf",
    "title": "No cosmological constraints on dark photon dark matter from resonant   conversion: Impact of nonlinear plasma dynamics",
    "abstract": "We revisit and invalidate all dark photon dark matter constraints from resonant conversion of dark photons into photons (plasmons) in the early universe. These constraints rely on the resonant transfer of a substantial portion of the dark photon energy density into the SM plasma, heating the plasma in the process. We demonstrate that this resonant transfer saturates because of plasma nonlinearities. Dark photon dark matter resonantly converts into $k \\simeq 0$ Langmuir waves in the early universe electron-ion plasma. Once the Langmuir-wave energy approaches the thermal energy of the plasma, nonlinear effects driven by the ponderomotive force become significant. In particular, we show using dedicated Particle-in-Cell simulations that large-amplitude $k = 0$ Langmuir waves excite higher-k Langmuir and ion acoustic waves, producing strong spatial variations in density and plasma frequency. These inhomogeneities suppress further resonant conversion, limiting the deposited energy to about the thermal energy of the electrons at the time of conversion, orders of magnitude below observable cosmological thresholds. Consequently, the dark photon dark matter constraints are weaker by factors of $3000$ to $10^7$ across ten orders of magnitude in dark photon mass.",
    "authors": [
      "Anson Hook",
      "Junwu Huang",
      "Mohamad Shalaby"
    ],
    "published": "2025-10-15T18:00:03Z",
    "updated": "2025-10-15T18:00:03Z",
    "categories": [
      "hep-ph",
      "astro-ph.CO",
      "physics.plasm-ph"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2510.13946v1",
    "url": "https://arxiv.org/abs/2510.13946v1",
    "pdf_url": "https://arxiv.org/pdf/2510.13946v1.pdf",
    "title": "Bell Instability and Cosmic-Ray Acceleration in AGN Ultrafast Outflow   Shocks",
    "abstract": "We investigate magnetic-field amplification driven by the nonresonant hybrid (NRH or Bell) instability and its impact on cosmic-ray (CR) acceleration at reverse shocks of ultrafast outflows (UFOs) from active galactic nuclei (AGN). Previous kinetic studies by particle-in-cell simulations have demonstrated that when maximum CR energy is near the injection scale, NRH instability efficiently amplifies magnetic field up to the saturation level. However, the efficiency of NRH instability goes down as maximum energy increase since CR current is carried by escaping CRs near the maximum energy. We employ a one-dimensional MHD--CR framework solving telegraph-type diffusion--convection equations to trace the coupled evolution of CRs, magnetic fields, and shock dynamics under realistic parameters. We find a distinct transition with magnetic field strength: for weak background fields ($B_{0}\\!\\lesssim\\!10^{-4}\\,\\mathrm{G}$), NRH instability efficiently amplifies upstream turbulence, driving a self-regulated state where $E_{\\max}$ becomes independent of initial strength of magnetic turbulence. In contrast, for stronger background fields ($B_{0}\\!\\gtrsim\\!10^{-3}\\,\\mathrm{G}$), the escaping CR current is too weak to drive NRH instability, and magnetic turbulence further decays through parametric instabilities, potentially reducing the acceleration efficiency. We give the physical interpretation for the transition and discuss conditions for PeV--EeV acceleration at UFO reverse shocks.",
    "authors": [
      "Rei Nishiura",
      "Tsuyoshi Inoue"
    ],
    "published": "2025-10-15T18:00:00Z",
    "updated": "2025-10-15T18:00:00Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2506.23718v2",
    "url": "https://arxiv.org/abs/2506.23718v2",
    "pdf_url": "https://arxiv.org/pdf/2506.23718v2.pdf",
    "title": "High brightness multi-MeV photon source driven by a petawatt-scale laser   wakefield accelerator",
    "abstract": "We present an experimental demonstration of a bright multi-MeV gamma source driven by a petawatt laser. The source generates on average $(1.2\\pm0.6)\\times10^9$ photons above 1 MeV per pulse, exceeding those of previous all-optical sources by a hundred times, and reached a peak spectral brightness of $(3.9 \\pm 1.5)\\times 10^{22}$ photons/mm$^2$/mrad$^2$/s/0.1%BW at $\\epsilon_\\gamma\\approx11$ MeV. The source was produced by inverse Compton scattering of a laser wakefield accelerated GeV electron beam and its back-reflected driving laser pulse. Its performance is well described by a simple model of the laser and electron properties at the collision point that allows quantitative predictions and identifies clear strategies to further enhance radiation efficiency. Our results highlight the promise of this source for fundamental physics studies, as well as for applications of nuclear resonance fluorescence and nuclear transmutation.",
    "authors": [
      "E. Gerstmayr",
      "B. Kettle",
      "M. J. V. Streeter",
      "L. Tudor",
      "O. J. Finlay",
      "L. E. Bradley",
      "R. Fitzgarrald",
      "T. Foster",
      "P. Gellersen",
      "A. E. Gunn",
      "O. Lawrence",
      "P. P. Rajeev",
      "B. K. Russell",
      "D. R. Symes",
      "C. D. Murphy",
      "A. G. R. Thomas",
      "C. P. Ridgers",
      "G. Sarri",
      "S. P. D. Mangles"
    ],
    "published": "2025-06-30T10:46:45Z",
    "updated": "2025-10-15T17:10:43Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2503.20904v3",
    "url": "https://arxiv.org/abs/2503.20904v3",
    "pdf_url": "https://arxiv.org/pdf/2503.20904v3.pdf",
    "title": "Experimental evidence of production of directional muons from a   laser-wakefield accelerator",
    "abstract": "We report on experimental evidence of the generation of directional muons from a laser-wakefield accelerator driven by a PW-class laser. The muons were generated following the interaction of a GeV-scale high-charge electron beam with a 2cm-thick Pb target and were detected using a Timepix3 detector placed behind a suitable shielding configuration. Data analysis indicates a $(99.1\\pm0.5)$% confidence of muon detection over noise, in excellent agreement with numerical modelling. Extrapolation of the experimental setup to higher electron energies and charges suggests the potential to guide and separate from noise approximately $10^4$ muons/s onto cm$^2$-scale areas for applications using a 10 Hz PW laser. These results demonstrate the possibility of generating and transporting directional muon beams using high-power lasers and establish a foundation for the systematic application of laser-driven high-energy muon beams.",
    "authors": [
      "L. Calvin",
      "E. Gerstmayr",
      "C. Arran",
      "L. Tudor",
      "T. Foster",
      "K. Fleck",
      "B. Bergmann",
      "D. Doria",
      "B. Kettle",
      "H. Maguire",
      "V. Malka",
      "P. Manek",
      "S. P. D. Mangles",
      "P. McKenna",
      "R. E. Mihai",
      "C. Ridgers",
      "J. Sarma",
      "P. Smolyanskiy",
      "R. Wilson",
      "R. M. Deas",
      "G. Sarri"
    ],
    "published": "2025-03-26T18:19:07Z",
    "updated": "2025-10-15T16:52:10Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2501.04886v3",
    "url": "https://arxiv.org/abs/2501.04886v3",
    "pdf_url": "https://arxiv.org/pdf/2501.04886v3.pdf",
    "title": "Distributed network of smartphone sensors: a new tool for scientific   field measurements",
    "abstract": "Smartphones sensors are now commonly used by a worldwide audience thanks to their availability, high connectivity, and versatility. Here, we present a methodology to use a collection of smartphones, namely a fleet, as a distributed network of time-synchronized mechanical sensors. We first present the mechanical tests we develop to evaluate the smartphone sensor accuracy. We then describe how to use efficiently a distributed network of smartphones as autonomous sensors. We use a combination of an Android application hosted on each phone (Gobannos), and a server application (Phonefleet) on a controlling host to perform the tasks in parallel remotely. We detail the time synchronisation protocol we implemented, based on UDP communication. We achieved an accuracy of the time synchronisation of 60 microseconds, more than enough for all mechanical applications. Eventually, we present two test cases in which we use a smartphone fleet for mechanical wave measurements in field conditions.",
    "authors": [
      "J. Zhang",
      "N. Mokus",
      "J. Casoli",
      "A. Eddi",
      "S. Perrard"
    ],
    "published": "2025-01-08T23:53:22Z",
    "updated": "2025-10-15T16:22:14Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.13711v1",
    "url": "https://arxiv.org/abs/2510.13711v1",
    "pdf_url": "https://arxiv.org/pdf/2510.13711v1.pdf",
    "title": "Comparative Evaluation of Xilinx RFSoC Platform for Low-Level RF Systems",
    "abstract": "The rapid advancement of Radio Frequency System-onChip (RFSoC) technology from Xilinx (AMD) has enabled the integration of high-speed data converters and programmable logic within a single package. RFSoC platforms are already widely adopted in telecommunications, radar, and satellite communications, where they promise reductions in system footprint and power consumption. However, their suitability for Low-Level RF (LLRF) control systems in accelerator environments - where stability requirements are critical - has not been quantitatively evaluated. This paper presents a comparative measurement-based assessment of RFSoC-based and conventional LLRF designs, focusing on signal fidelity, phase noise, latency, system complexity, and integration challenges. The advantages and challenges of adopting RFSoC-based direct conversion architectures are discussed, providing guidance for future LLRF system implementations.",
    "authors": [
      "Shreeharshini Dharanesh Murthy",
      "Victoria Moore",
      "Qiang Du",
      "Angel Jurado",
      "Michael Chin",
      "Keith Penney",
      "David Nett",
      "Benjamin Flugstad"
    ],
    "published": "2025-10-15T16:11:18Z",
    "updated": "2025-10-15T16:11:18Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.13521v1",
    "url": "https://arxiv.org/abs/2510.13521v1",
    "pdf_url": "https://arxiv.org/pdf/2510.13521v1.pdf",
    "title": "Narrow Operator Models of Stellarator Equilibria in Fourier Zernike   Basis",
    "abstract": "Numerical computation of the ideal Magnetohydrodynamic (MHD) equilibrium magnetic field is at the base of stellarator optimisation and provides the starting point for solving more sophisticated Partial Differential Equations (PDEs) like transport or turbulence models. Conventional approaches solve for a single stationary point of the ideal MHD equations, which is fully defined by three invariants and the numerical scheme employed by the solver. We present the first numerical approach that can solve for a continuous distribution of equilibria with fixed boundary and rotational transform, varying only the pressure invariant. This approach minimises the force residual by optimising parameters of multilayer perceptrons (MLP) that map from a scalar pressure multiplier to the Fourier Zernike basis as implemented in the modern stellarator equilibrium solver DESC.",
    "authors": [
      "Timo Thun",
      "Rory Conlin",
      "Dario Panici",
      "Daniel Böckenhoff"
    ],
    "published": "2025-10-15T13:13:42Z",
    "updated": "2025-10-15T13:13:42Z",
    "categories": [
      "physics.plasm-ph",
      "cs.AI",
      "cs.LG"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.13505v1",
    "url": "https://arxiv.org/abs/2510.13505v1",
    "pdf_url": "https://arxiv.org/pdf/2510.13505v1.pdf",
    "title": "Attosecond Waveform Synthesis through Echo-enabled Harmonic Generation   Free-electron Lasers",
    "abstract": "Attosecond pulse trains (APTs) are indispensable for probing electron dynamics at their intrinsic timescales. High harmonic generation (HHG) has long been a successful and widely used technique in producing extreme ultraviolet APTs. While in the soft X-ray regime, HHG suffers from low conversion efficiency and lacking flexibility in the waveform and spectrum control. Here in this study, based on the waveform synthesis of the echo-enabled harmonic generation (EEHG) free-electron laser (FEL), we propose a novel method that can generate soft X-ray APTs with high temporal and spectral tunability. EEHG scheme is well-known in forming phase-locked high harmonic bunching combs down to the soft X-ray regime. And We can facilitate successive FEL lasing in several different harmonic numbers and then perform the coherent waveform synthesis to generate soft X-ray APTs. Three-dimensional simulation results indicate that reproducible generation of coherent APTs in the soft X-ray regime with peak power of 3.5 GW and micropulse duration of 160 as can be achieved by five-harmonic synthesis. And the micropulse duration together with the spectral components of the APTs can be adjusted easily according to the programmable high harmonic bunching combs in the EEHG scheme. This method has the potential to establish a robust platform for attosecond sciences in the soft X-ray regime, which can enable unprecedented studies of electron dynamics in physical and chemical reactions, biological systems and quantum materials.",
    "authors": [
      "Lanpeng Ni",
      "Junhao Liu",
      "Zheng Qi",
      "Chao Feng"
    ],
    "published": "2025-10-15T12:55:32Z",
    "updated": "2025-10-15T12:55:32Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.13502v1",
    "url": "https://arxiv.org/abs/2510.13502v1",
    "pdf_url": "https://arxiv.org/pdf/2510.13502v1.pdf",
    "title": "A New Method for Aperture Masking Interferometric Imaging: Demonstration   with the JWST",
    "abstract": "We present a new method for aperture masking interferometric (AMI) imaging at near-IR wavelengths using radio astronomical techniques. The method starts with derivation of interferometric visibilities from a Fourier transform of the interferograms. An iterative joint optimization process is then employed, using self-calibration of the interferometric element-based complex voltage gains (i.e. electric fields), and CLEAN deconvolution to obtain the source structure. We demonstrate the efficacy of the method using the NIRISS aperture masking interferometer on the James Webb Space Telescope (JWST) at 4.8~$\\mu$m and 3.8~$\\mu$m. Due to a number of effects (the large pixel size, charge migration, near-field optics), the method also requires an initial visibility-based amplitude normalization using observations of a well know point-source calibration star. We employ early science observations of the dusty binary Wolf-Rayet star WR137. Images with a dynamic range (peak/rms) of $\\sim 240$ on the target, and $\\sim 1000$ on the calibrator, are synthesized from a short integration. The self-calibration process determines the photon path-lengths through the optical system to each aperture using data on the target source itself, thereby representing an essentially 'real-time', precise wavefront error sensor. Four independent measures of the JWST mirror segment pistons (two wavelengths for two sources), agree to within 10~nm to 15~nm, comparable to the expected errors based on an analysis of closure phases on the calibrator star. Including a baseline-based phase correction improves the dynamic range of the final images by about 23\\%.",
    "authors": [
      "Christopher Carilli",
      "Bojan Nikolic",
      "Laura Torino",
      "N. Thyagarajan",
      "Ubaldo Iriso"
    ],
    "published": "2025-10-15T12:51:57Z",
    "updated": "2025-10-15T12:51:57Z",
    "categories": [
      "astro-ph.IM",
      "physics.acc-ph",
      "physics.optics"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2510.13482v1",
    "url": "https://arxiv.org/abs/2510.13482v1",
    "pdf_url": "https://arxiv.org/pdf/2510.13482v1.pdf",
    "title": "Low-impedance stripline kicker for the transverse instability   suppression system of the synchrotron radiation facility \"SKIF\" light source",
    "abstract": "Construction of the new fourth generation synchrotron radiation facility (SRF) \"SKIF\" near Novosibirsk is nearing completion. \"SKIF\" uniqueness is ultra-low 75 pm natural emittance at 400 mA beam current and 3 GeV beam energy.   Collective effects (beam interaction with the vacuum chamber) are the main obstacles of achieving such emittance and beam current. To suppress these effects the storage ring will be equipped with a bunch-by-bunch feedback system. Important components of the feedback system are a stripline (fast) kicker and a beam position monitor.   The paper describes design of the low-impedance stripline kicker for SRF \"SKIF\" storage ring, optimized for the manufacturing and for the uniformity of the imparted transverse kick. The kicker qualities such as S-parameters, imparted transverse momentum, transfer and beam impedances are presented. The chosen length of the stripline kicker allows its use as a beam position monitor.",
    "authors": [
      "M. A. Baistrukov",
      "E. A. Bekhtenev",
      "A. A. Krasnov",
      "D. A. Nikiforov",
      "P. A. Piminov"
    ],
    "published": "2025-10-15T12:32:30Z",
    "updated": "2025-10-15T12:32:30Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2503.20475v2",
    "url": "https://arxiv.org/abs/2503.20475v2",
    "pdf_url": "https://arxiv.org/pdf/2503.20475v2.pdf",
    "title": "An electron-hadron collider at the high-luminosity LHC",
    "abstract": "We discuss a concept of a lower-energy version of the Large Hadron-electron Collider (LHeC), delivering electron-hadron collisions concurrently to the hadron-hadron collisions at the high-luminosity LHC at CERN. Assuming the use of a 20 GeV electron Energy Recovery Linac (ERL), we report the results on the optimised beam dynamics, accelerator technologies, and detector constraints required for such a \"phase-one\" LHeC. Finally, we also discuss the ERL configurations and the possibility of delivering electron-hadron collisions during the planned {Run5} of the LHC, which opens excellent research capabilities - the unique scientific potential of the proposed facility is outlined.",
    "authors": [
      "Kevin David J André",
      "Laurent Forthomme",
      "Bernhard Holzer",
      "Krzysztof Piotrzkowski"
    ],
    "published": "2025-03-26T11:59:29Z",
    "updated": "2025-10-15T12:31:19Z",
    "categories": [
      "hep-ex",
      "physics.acc-ph"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2510.09437v3",
    "url": "https://arxiv.org/abs/2510.09437v3",
    "pdf_url": "https://arxiv.org/pdf/2510.09437v3.pdf",
    "title": "Long Living Hot and Dense Plasma from Relativistic Laser-Nanowire Array   Interaction",
    "abstract": "Long-living, hot and dense plasmas generated by ultra-intense laser beams are of critical importance for laser-driven nuclear physics, bright hard X-ray sources, and laboratory astrophysics. We report the experimental observation of plasmas with nanosecond-scale lifetimes, near-solid density, and keV-level temperatures, produced by irradiating periodic arrays of composite nanowires with ultra-high contrast, relativistically intense femtosecond laser pulses. Jet-like plasma structures extending up to 1~mm from the nanowire surface were observed, emitting K-shell radiation from He-like Ti$^{20+}$ ions. High-resolution X-ray spectra were analyzed using 3D Particle-in-Cell (PIC) simulations of the laser-plasma interaction combined with collisional--radiative modeling (FLYCHK). The results indicate that the jets consist of plasma with densities of $10^{20}$-$10^{22}$ cm$^{-3}$ and keV-scale temperatures, persisting for several nanoseconds. We attribute the formation of these jets to the generation of kiloTesla-scale global magnetic fields during the laser interaction, as predicted by PIC simulations. These fields may drive long-timescale current instabilities that sustain magnetic fields of several hundred tesla, sufficient to confine hot, dense plasma over nanosecond durations.",
    "authors": [
      "Ehsan Eftekhari-Zadeh",
      "Mikhail Gyrdymov",
      "Parysatis Tavana",
      "Robert Loetzsch",
      "Ingo Uschmann",
      "Thomas Siefke",
      "Thomas Käsebier",
      "Uwe Zeitner",
      "Adriana Szeghalmi",
      "Alexander Pukhov",
      "Dmitri Serebryakov",
      "Evgeni Nerush",
      "Igor Kostyukov",
      "Olga Rosmej",
      "Christian Spielmann",
      "Daniil Kartashov"
    ],
    "published": "2025-10-10T14:47:58Z",
    "updated": "2025-10-15T12:22:42Z",
    "categories": [
      "physics.plasm-ph",
      "hep-ex",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.09491v2",
    "url": "https://arxiv.org/abs/2510.09491v2",
    "pdf_url": "https://arxiv.org/pdf/2510.09491v2.pdf",
    "title": "Investigating Solid-Fluid Phase Coexistence in DC Plasma Bilayer   Crystals: The Role of Particle Pairing and Mode Coupling",
    "abstract": "This article presents a detailed investigation of solid-fluid phase coexistence in a bilayer dusty plasma crystal subjected to varying confinement ring bias voltages in a DC glow discharge argon plasma. Melamine formaldehyde particles were employed to form a stable, hexagonally ordered bilayer crystal within a confinement ring electrically isolated from the grounded cathode. By systematically adjusting the confinement ring bias, a distinct phase coexistence emerged: it is characterized by a fluid-like melted core surrounded by a solid crystalline periphery. Crucially, analysis of the phonon spectra revealed frequency shifts that deviate significantly from the predictions of classical monolayer Mode-Coupling Instability (MCI) theory. Stability analysis further demonstrated that dynamic interlayer particle pairing and non-reciprocal interactions play a pivotal role in destabilizing the bilayer structure. These findings highlight previously underappreciated mechanisms driving the melting transition in bilayer dusty plasmas, offering a more comprehensive understanding of phase behavior in complex plasma systems. The results underscore the importance of interlayer coupling and confinement effects in tuning structural transitions.",
    "authors": [
      "Siddhartha Mangamuri",
      "Surabhi Jaiswal",
      "Lénaïc Couëdel"
    ],
    "published": "2025-10-10T15:52:47Z",
    "updated": "2025-10-15T11:59:54Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.13421v1",
    "url": "https://arxiv.org/abs/2510.13421v1",
    "pdf_url": "https://arxiv.org/pdf/2510.13421v1.pdf",
    "title": "Development of fault identification pipeline for SPIRAL2 LLRF data",
    "abstract": "SPIRAL2 is a state-of-the-art superconducting linear accelerator for heavy ions. The radiofrequency operation of the linac can be disrupted by anomalies that affect its reliability. This work leverages fast, multivariate time series post-mortem data from the Low-Level Radio Frequency (LLRF) systems to differentiate anomaly groups. However, interpreting these anomalies traditionally relies on expert analysis, with certain behaviours remaining obscure even to experienced observers. By adopting the Time2Feat pipeline, this study explores the interpretability of anomalies through feature selection, paving the way for real-time state observers. Clustering dashboards are presented, allowing the use of multiple clustering algorithms easily configurable and tools to help for visualizing results. A case study on distinguishing electronic quenches and false quench alarms in postmortem data is highlighted. Thereby, a fast and reliable K-Nearest Neighbours (KNN) classifier is proposed.",
    "authors": [
      "Charly Lassalle",
      "Patrick Bonnay",
      "Frédéric Bouly",
      "Marco Di Giacomo",
      "Adnan Ghribi"
    ],
    "published": "2025-10-15T11:21:32Z",
    "updated": "2025-10-15T11:21:32Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2405.16972v4",
    "url": "https://arxiv.org/abs/2405.16972v4",
    "pdf_url": "https://arxiv.org/pdf/2405.16972v4.pdf",
    "title": "Chip-Scale Point-Source Sagnac Interferometer by Phase-Space Squeezing",
    "abstract": "Matter-wave interferometry plays a significant role in scientific research and technological applications. While position-momentum phase-space squeezing has been demonstrated to increase the coherence of atom sources by reducing momentum spread, we theoretically investigate the potential advantages of the opposite squeezing. As a case study, we analytically and numerically examine its effect on point source atom interferometry (PSI) for rotation sensing. Our analysis reveals that this squeezed PSI (SPSI) approach can significantly improve sensitivity and dynamic range while enabling shorter cycle times and higher repetition rates. Through simulations, we identify parameter spaces where sensitivity and dynamic range are enhanced by orders of magnitude. Under a specific definition of compactness, our calculations show that SPSI outperforms standard PSI by over four orders of magnitude. These theoretical findings suggest that SPSI could either enhance performance in standard-sized devices or maintain performance in miniaturized chip-scale devices, potentially paving the way for new practical applications.",
    "authors": [
      "Yiftach Halevy",
      "Yali Cina",
      "Omer Feldman",
      "David Groswasser",
      "Yonathan Japha",
      "Ron Folman"
    ],
    "published": "2024-05-27T09:08:16Z",
    "updated": "2025-10-15T10:59:38Z",
    "categories": [
      "physics.atom-ph",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2510.13346v1",
    "url": "https://arxiv.org/abs/2510.13346v1",
    "pdf_url": "https://arxiv.org/pdf/2510.13346v1.pdf",
    "title": "Introduction to Optics Design",
    "abstract": "This lecture provides an overview of the principles and methodologies involved in linear optics design. It aims to introduce key concepts such as the matrix formalism, the symplecticity, the quantities that are preserved in the single particle evolution, e.g., the Courant-Snyder invariant. It also covers the concept of beam emittance and matching conditions for an ensemble of particles. The goal is to equip readers with the foundational tools needed for both theoretical understanding and practical application in linear optics and accelerator design.",
    "authors": [
      "Guido Sterbini"
    ],
    "published": "2025-10-15T09:32:23Z",
    "updated": "2025-10-15T09:32:23Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.13304v1",
    "url": "https://arxiv.org/abs/2510.13304v1",
    "pdf_url": "https://arxiv.org/pdf/2510.13304v1.pdf",
    "title": "Evaluation of 3D pixel silicon sensors for the CMS Phase-2 Inner Tracker",
    "abstract": "The high-luminosity upgrade of the CERN LHC requires the replacement of the CMS tracking detector to cope with the increased radiation fluence while maintaining its excellent performance. An extensive R\\&D program, aiming at using 3D pixel silicon sensors in the innermost barrel layer of the detector, has been carried out by CMS in collaboration with the FBK (Trento, Italy) and CNM (Barcelona, Spain) foundries. The sensors will feature a pixel cell size of \\mbox{$25\\times100~\\mu m^2$}, with a centrally located electrode connected to the readout chip. The sensors are read out by the RD53A and CROCv1 chips, developed in 65~nm CMOS technology by the RD53 Collaboration, a joint effort between the ATLAS and CMS groups. This paper reports the results achieved in beam test experiments before and after irradiation, up to a fluence of approximately \\mbox{\\SI{2.6e16}{n_{eq}/\\cm^{2}}}. Measurements of assemblies irradiated to a fluence of \\mbox{\\SI{1e16}{n_{eq}/\\cm^{2}}} show a hit detection efficiency higher than 96\\% at normal incidence, with fewer than 2\\% of channels masked, across a bias voltage range greater than \\SI{50}{V}. Even after irradiation to a higher fluence of \\mbox{\\SI{1.6e16}{n_{eq}/\\cm^{2}}}, similar performance is maintained over a bias voltage range of \\SI{30}{V}, remaining well within CMS requirements.",
    "authors": [
      "The Tracker Group of the CMS Collaboration"
    ],
    "published": "2025-10-15T08:51:54Z",
    "updated": "2025-10-15T08:51:54Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.13192v1",
    "url": "https://arxiv.org/abs/2510.13192v1",
    "pdf_url": "https://arxiv.org/pdf/2510.13192v1.pdf",
    "title": "RFSoC Based LLRF System Design at ALS",
    "abstract": "The Advanced Light Source (ALS) at LBNL is upgrading several LLRF systems for its Linac and Sub-Harmonic Bunchers, where it is desired to have a unified LLRF system design to support various RF frequencies (at 125MHz, 500MHz and 3GHz) and configurations. This paper demonstrates an open-source, direct sampling RFSoC based LLRF system design, featuring: sample-to-sample Multi-Tile Synchronization, deterministic latency, digital up/down conversion, arbitrary waveform generation and acquisition, in-pulse closed loop control, timing and EPICS integration, modular RF frontend and hardware designs. Measured RF characteristics show that the RFSoC based LLRF system is able to meet the system requirements.",
    "authors": [
      "Qiang Du",
      "Shreeharshini Murthy",
      "Victoria Moore",
      "Angel Jurado Lopez",
      "Keith Penney",
      "Michael Chin",
      "Shree Subhasish Basak",
      "David Nett",
      "Benjamin Flugstad"
    ],
    "published": "2025-10-15T06:29:08Z",
    "updated": "2025-10-15T06:29:08Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.13173v1",
    "url": "https://arxiv.org/abs/2510.13173v1",
    "pdf_url": "https://arxiv.org/pdf/2510.13173v1.pdf",
    "title": "The BUTTON-30 detector at Boulby",
    "abstract": "The BUTTON-30 detector is a 30-tonne technology demonstrator designed to evaluate the potential of hybrid event detection, simultaneously exploiting both Cherenkov and scintillation light to detect particle produced in neutrino interactions. The detector is installed at a depth of 1.1 km in the Boulby Underground Laboratory allowing to test the performance of this new technology underground in a low background environment. This paper describes the design and construction of the experiment.",
    "authors": [
      "J. Bae",
      "M. Bergevin",
      "E. P. Bernard",
      "D. S. Bhattacharya",
      "J. Boissevain",
      "S. Boyd",
      "K. Bridges",
      "L. Capponi",
      "J. Coleman",
      "D. Costanzo",
      "T. Cunniffe",
      "S. A. Dazeley",
      "M. V. Diwan",
      "S. R. Durham",
      "E. Ellingwood",
      "A. Enqvist",
      "T. Gamble",
      "S. Gokhale",
      "J. Gooding",
      "C. Graham",
      "E. Gunger",
      "J. J. Hecla",
      "W. Hopkins",
      "I. Jovanovic",
      "T. Kaptanoglu",
      "E. Kneale",
      "L. Lebanowski",
      "K. Lester",
      "V. A. Li",
      "M. Malek",
      "C. Mauger",
      "N. McCauley",
      "C. Metelko",
      "R. Mills",
      "A. Morgan",
      "F. Muheim",
      "A. Murphy",
      "M. Needham",
      "K. Ogren",
      "G. D. Orebi Gann",
      "S. M. Paling",
      "A. F. Papatyi",
      "G. Pinkney",
      "J. Puputti",
      "S. Quillin",
      "B. Richards",
      "R. Rosero",
      "A. Scarff",
      "Y. Schnellbach",
      "P. R. Scovell",
      "B. Seitz",
      "L. Sexton",
      "O. Shea",
      "G. D. Smith",
      "R. Svoboda",
      "D. Swinnock",
      "A. Tarrant",
      "F. Thomson",
      "J. N. Tinsley",
      "C. Toth",
      "M. Vagins",
      "G. Yang",
      "M. Yeh",
      "E. Zhemchugov"
    ],
    "published": "2025-10-15T05:57:48Z",
    "updated": "2025-10-15T05:57:48Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2506.16512v2",
    "url": "https://arxiv.org/abs/2506.16512v2",
    "pdf_url": "https://arxiv.org/pdf/2506.16512v2.pdf",
    "title": "Galactic echoes",
    "abstract": "Gaia has revealed a variety of substructures in the phase space of stars in the Solar neighborhood, including the vertical `Snail' in $(z,v_z)$ space. Such substructures are often interpreted as the incompletely phase-mixed response of the disc stars to a single perturbation, such as an impulsive encounter with a satellite galaxy. In this paper we consider the possibility that such structures contain manifestations of phase space echoes. First established in plasma physics in the 1960s, echoes arise when a collisionless system is perturbed twice: the macroscopic responses to both perturbations mix to small scales in phase space, whereupon they couple nonlinearly, producing a third macroscopic `echo' response without the need for a third perturbation. We derive the galactic analogue of the plasma echo theory using angle-action variables and apply it to a one-dimensional model of vertical motion in the Milky Way. We verify the predicted echo behavior using idealized test particle simulations, both with and without the inclusion of diffusion through orbital scattering off molecular clouds. While we conclude that the Gaia Snail itself is unlikely a (pure) echo effect, the basic physics we uncover is sufficiently generic that we expect phase-space echoes to be common in disc galaxies.",
    "authors": [
      "Rimpei Chiba",
      "Jupiter Ding",
      "Chris Hamilton",
      "Matthew W. Kunz",
      "Scott Tremaine"
    ],
    "published": "2025-06-19T18:00:01Z",
    "updated": "2025-10-15T03:10:04Z",
    "categories": [
      "astro-ph.GA",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.GA",
    "doi": "10.1093/mnras/staf1463"
  },
  {
    "arxiv_id": "2504.13313v2",
    "url": "https://arxiv.org/abs/2504.13313v2",
    "pdf_url": "https://arxiv.org/pdf/2504.13313v2.pdf",
    "title": "Machine-learning Closure for Vlasov-Poisson Dynamics in Fourier-Hermite   Space",
    "abstract": "Accurate reduced models of turbulence are desirable to facilitate the optimization of magnetic-confinement fusion reactor designs. As a first step toward higher-dimensional turbulence applications, we use reservoir computing, a machine-learning (ML) architecture, to develop a closure model for a limiting case of electrostatic gyrokinetics. We implement a pseudo-spectral Eulerian code to solve the one-dimensional Vlasov-Poisson system on a basis of Fourier modes in configuration space and Hermite polynomials in velocity space. When cast onto the Hermite basis, the Vlasov equation becomes an infinitely coupled hierarchy of fluid moments, presenting a closure problem. We exploit the locality of interactions in the Hermite representation to introduce an ML closure model of the small-scale dynamics in velocity space. In the linear limit, when the kinetic Fourier-Hermite solver is augmented with the reservoir closure, the closure permits a reduction of the velocity resolution, with a relative error within two percent for the Hermite moment where the reservoir closes the hierarchy. In the strongly-nonlinear regime, the ML closure model more accurately resolves the low-order Fourier and Hermite spectra when compared to a na\\\"{i}ve closure by truncation and reduces the required velocity resolution by a factor of sixteen.",
    "authors": [
      "Nathaniel Barbour",
      "William Dorland",
      "Ian G. Abel",
      "Matt Landreman"
    ],
    "published": "2025-04-17T19:53:51Z",
    "updated": "2025-10-14T22:54:37Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.12960v1",
    "url": "https://arxiv.org/abs/2510.12960v1",
    "pdf_url": "https://arxiv.org/pdf/2510.12960v1.pdf",
    "title": "Master Oscillator and Phase Reference Line Design for the PIP-II Linac",
    "abstract": "The phase averaging reference line system provides the RF phase reference, LO and clock signals to the LLRF and other accelerator sub-systems. The PIP-II linac has RF systems at three frequencies - 162.5 MHz, 325 MHz and 650 MHz. A temperature-stabilized, low-phase-noise oscillator is used as the master oscillator. Phase reference signals at 162.5 MHz, 325 MHz, and 650 MHz, along with LO signals at 182.5 MHz, 345 MHz, 670 MHz and LLRF clocks at 1320 MHz and 1300 MHz, are generated in temperature-controlled RF modules at each frequency section. A phase reference from each module travels to the next section, where it is doubled to produce required frequencies. The reference also travels alongside the accelerating cavities in the tunnel, allowing cavity probe and reference cables to temperature track and reduce measurement errors from temperature changes or phase drift.",
    "authors": [
      "A. Syed",
      "B. Vaughn",
      "P. Varghese",
      "E. Cullerton",
      "S. Stevenson",
      "D. Pieper",
      "D. Peterson",
      "J. Holzbauer",
      "R. Madrak",
      "A. Mosher",
      "D. Klepec"
    ],
    "published": "2025-10-14T20:11:32Z",
    "updated": "2025-10-14T20:11:32Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.04768v3",
    "url": "https://arxiv.org/abs/2510.04768v3",
    "pdf_url": "https://arxiv.org/pdf/2510.04768v3.pdf",
    "title": "Experimental Reconstruction of Source 4D Phase Space Without Prior   Knowledge of Transfer Matrix",
    "abstract": "We experimentally demonstrate a method for reconstructing the transverse 4D phase space of an electron beam at the time of emission from downstream diagnostics of the 4D phase space. This method does not rely on detailed knowledge of the beamline transport, besides assuming that linearity and symplecticity are satisfied. We apply this method to measure the transverse position and momentum phase space of electrons emitted from a spatially-structured alkali-antimonide cathode. This method can uncover local correlations between emission location and momentum spread. We formulate this method analytically and investigate resolution limits.",
    "authors": [
      "Charles Zhang",
      "Elena Echeverria",
      "Abigail Flint",
      "William H Li",
      "Christopher M. Pierce",
      "Alice Galdi",
      "Chad Pennington",
      "Adam Bartnik",
      "Ivan Bazarov",
      "Jared Maxson"
    ],
    "published": "2025-10-06T12:42:12Z",
    "updated": "2025-10-14T19:39:25Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2406.06233v3",
    "url": "https://arxiv.org/abs/2406.06233v3",
    "pdf_url": "https://arxiv.org/pdf/2406.06233v3.pdf",
    "title": "Plasma screening in mid-charged ions observed by K-shell line emission",
    "abstract": "Dense plasma environment affects the electronic structure of ions via variations of the microscopic electrical fields, also known as plasma screening. This effect can be either estimated by simplified analytical models, or by computationally expensive and to date unverified numerical calculations. We have experimentally quantified plasma screening from the energy shifts of the bound-bound transitions in matter driven by the x-ray free electron laser (XFEL). This was enabled by identification of detailed electronic configurations of the observed K{\\alpha}, K\\b{eta} and K{\\gamma} lines. This work paves the way for improving plasma screening models including connected effects like ionization potential depression and continuum lowering, which will advance the understanding of atomic physics in Warm Dense Matter regime.",
    "authors": [
      "M. Šmıd",
      "O. Humphries",
      "C. Baehtz",
      "V. Bouffetier",
      "E. Brambrink",
      "T. Burian",
      "V. Cerantola",
      "M. S. Cho",
      "T. E. Cowan",
      "L. Gaus",
      "M. F. Gu",
      "V. Hájková",
      "L. Juha",
      "J. Kaa",
      "Z. Konopkova",
      "H. P. Le",
      "M. Makita",
      "X. Pan",
      "T. Preston",
      "A. Schropp",
      "J. P. Schwinkendorf",
      "H. A. Scott",
      "R. Štefanıková",
      "J. Vorberger",
      "W. Wang",
      "U. Zastrau",
      "K. Falk"
    ],
    "published": "2024-06-10T13:04:03Z",
    "updated": "2025-10-14T19:31:51Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.10657v2",
    "url": "https://arxiv.org/abs/2510.10657v2",
    "pdf_url": "https://arxiv.org/pdf/2510.10657v2.pdf",
    "title": "Unlocking New Frontiers: The Versatile Potential of the Brazilian   Multipurpose Reactor",
    "abstract": "The multipurpose nature of nuclear research reactors has been investigated. This class of reactors has gained momentum within the international community, given the multiple benefits of nuclear technology in medicine, agriculture, industry, and the development of new materials, being characterized by the simultaneous use of several applications. In this context, Brazil has recently joined the group of countries with multipurpose reactor projects. The Brazilian Multipurpose Reactor (RMB) will be Brazil's new neutron source, with a thermal power of $30$ $MW$, with a core flux on the order of $\\phi=4\\times 10^{14}$ $n/cm^{2}s$ and a power density of $312.5$ $W/cm^3$, ensuring the production of radioisotopes, material and fuel irradiation testing, and neutron beam applications. In this work, the demand for neutron fluxes in different irradiation targets is investigated by Monte Carlo simulations under a perturbation caused by a highly neutron-absorbing material, the Gadolinium-157 (Gd-157) isotope. The results show that Molybdenum-99 (Mo-99) production is not affected by the Gd-157 target, and the minimum proposed thermal neutron flux for the reactor's activity ($\\phi_{min}=5.1\\times 10^{12}$ $n/cm^{2}s$) is guaranteed even at maximum operational capacity. The potential production of Terbium (Tb) isotopes for nuclear medicine applications in the RMB is briefly discussed.",
    "authors": [
      "Luiz P. de Oliveira",
      "Alexandre P. S. Souza",
      "Carlos G. S. Santos",
      "Iberê R. S. Júnior",
      "Barbara P. G. Silva",
      "Marco A. S. Pereira",
      "Frederico A. Genezini",
      "José A. Perrotta"
    ],
    "published": "2025-10-12T15:25:24Z",
    "updated": "2025-10-14T19:31:43Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  }
]