{
  "arxiv_id": "2512.01656v2",
  "url": "https://arxiv.org/abs/2512.01656v2",
  "pdf_url": "https://arxiv.org/pdf/2512.01656v2.pdf",
  "title": "Impact of local bunching factors in single-pass THz free electron lasers",
  "abstract": "In simulations for modern free-electron lasers (FEL), shot noise plays a crucial role. While it is inversely proportional to the number of electrons, shot noise is typically modeled using macroparticles, with their bunching factors corresponding to the bunching factors of the much larger number of electrons. For short-wavelength FELs, the macroparticles are assumed to be uniformly distributed on the scale of the resonant wavelength, since shot noise dominates the initial radiation - for instance, in the self-amplified spontaneous emission (SASE) regime. In this paper, we show that this assumption does not hold at longer wavelengths, particularly in the THz range, where the bunch current profile is not uniform even within the length of the resonant wavelength. Instead, the current profile dominates the initial bunching factors, which can be several orders of magnitude higher than shot noise. The slice-based bunching factors and bunching phases are derived for Gaussian distributions and compared with shot noise under the assumption that the current within each slice remains constant. Using the THz FEL at the photoinjector test facility at DESY in Zeuthen (PITZ) as a case study, the influence of the current profile has been benchmarked through simulations under very low bunch charge, where the full number of electrons can be modeled using the Genesis1.3 code. Additional simulations with the nominal working parameters of PITZ THz FEL have been compared with experimental data, indicating better agreement when the actual current profile is taken into account.",
  "authors": [
    "Xiangkun Li",
    "Mikhail Krasilnikov"
  ],
  "published": "2025-12-01T13:29:53Z",
  "updated": "2025-12-04T11:22:47Z",
  "categories": [
    "physics.acc-ph"
  ],
  "primary_category": "physics.acc-ph"
}