{
  "arxiv_id": "2512.03780v1",
  "url": "https://arxiv.org/abs/2512.03780v1",
  "pdf_url": "https://arxiv.org/pdf/2512.03780v1.pdf",
  "title": "Poly- and single-crystalline diamond nitrogen-induced TLS losses estimation with superconducting lumped elements micro-resonators",
  "abstract": "Research on diamond has intensified due to its exceptional thermal, optical, and mechanical properties, making it a key material in quantum technologies and high-power applications. Diamonds with engineered nitrogen-vacancy (NV) centers represent a very sensitive platform for quantum sensing, while high-optical quality diamond windows represent a fundamental safety component inside Electron Cyclotron Resonance Heating (ECRH) systems in nuclear fusion reactors. A major challenge is the development of ultra-low-loss, high-optical-quality single-crystal diamond substrates to meet growing demands for quantum coherence and power handling. Traditionally, dielectric losses ($\\tan δ$) in diamonds are evaluated using Fabry-Perot microwave resonators, in which the resonance quality factors Q of the cavity with and without the sample are compared. These devices are limited to resolutions around 10$^{-5}$ by the need to keep the resonator dimensions within a reasonable range. In contrast, superconducting thin-film micro-strip resonators, with Q factors exceeding 10$^6$, are stated to provide higher sensitivity for assessing ultra-low-loss materials. This study examines four diamond samples grown through different processes, analyzing their dielectric losses at extreme low temperatures (sub-Kelvin) within the Two-Level System (TLS) framework. Complementary Raman spectroscopy measurements allowed us not only to associate higher nitrogen content with increased losses, but also to investigate how the different growth process influence the way these defects are incorporated in the crystal lattice.",
  "authors": [
    "Francesco Mazzocchi",
    "Martin Neidig",
    "Hideaki Yamada",
    "Sebastian Kempf",
    "Dirk Strauss",
    "Theo Scherer"
  ],
  "published": "2025-12-03T13:32:35Z",
  "updated": "2025-12-03T13:32:35Z",
  "categories": [
    "cond-mat.mtrl-sci",
    "physics.ins-det"
  ],
  "primary_category": "cond-mat.mtrl-sci"
}