{
  "arxiv_id": "2512.03472v1",
  "url": "https://arxiv.org/abs/2512.03472v1",
  "pdf_url": "https://arxiv.org/pdf/2512.03472v1.pdf",
  "title": "Quasi-linear theory of perpendicular ion heating by critically balanced turbulence",
  "abstract": "In collisionless astrophysical plasmas, turbulence mediates the partitioning of free energy among cascade channels and its dissipation into ion and electron heat. The resulting ion heating is often anisotropic, with ions observed to be preferentially heated perpendicular to the local magnetic field; understanding the mechanisms responsible for this heating is a key step in understanding the evolution of such plasmas. In this paper, we use the framework of quasi-linear theory to compute analytically the heating rates of ions interacting with turbulent, large-scale Alfvénic fluctuations. We show how the imbalance of the turbulence (the difference in energies between Alfvénic fluctuations travelling parallel and antiparallel to the magnetic field) modifies the spatiotemporal spectrum of these fluctuations, allowing the heating mechanism to transition between two commonly-studied mechanisms: stochastic heating in balanced turbulence to resonant-cyclotron heating in imbalanced turbulence. The resultant heating rate is found to have a general form regardless of the level of imbalance, exhibiting a suppression related to the conservation of the ions' magnetic moment at small turbulent amplitudes and recovering previous empirical results in a formal calculation. The results of this work help to consolidate our qualitative understanding of ion heating within astrophysical plasmas, as well as yielding specific quantitative predictions to analyse simulations and observations.",
  "authors": [
    "Zade Johnston",
    "Jonathan Squire"
  ],
  "published": "2025-12-03T05:53:28Z",
  "updated": "2025-12-03T05:53:28Z",
  "categories": [
    "astro-ph.SR",
    "astro-ph.HE",
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.SR"
}