{
  "arxiv_id": "2512.03269v1",
  "url": "https://arxiv.org/abs/2512.03269v1",
  "pdf_url": "https://arxiv.org/pdf/2512.03269v1.pdf",
  "title": "Understanding cold electron impact on parallel-propagating whistler chorus waves via moment-based quasilinear theory",
  "abstract": "Earth's magnetosphere hosts a wide range of collisionless particle populations that interact through various wave-particle processes. Among these, cold electrons, with energies below 100eV, often dominate the plasma density but remain poorly characterized due to measurement challenges such as spacecraft charging and photoelectron contamination. Understanding the contribution of these cold populations to wave-particle interaction is of significant interest. Recent kinetic simulations identified a secondary drift-driven instability in which parallel-propagating whistler-mode chorus waves excite oblique electrostatic whistler waves near the resonance cone and Bernstein-mode turbulence. These secondary modes enable a new channel of energy transfer from the parallel-propagating whistler wave to the cold electrons. In this work, we develop a moment-based quasilinear theory of the secondary instabilities to quantify such energy exchange. Our results show that these secondary instabilities persist for a wide range of parameters and, in many cases, lead to nearly complete damping of the primary wave. Such secondary instability might limit the amplitude of parallel-propagating whistler waves in Earth's magnetosphere and might explain why high-amplitude oblique whistler or electron Bernstein waves are rarely observed simultaneously with high-amplitude field-aligned whistler waves in the inner magnetosphere.",
  "authors": [
    "Opal Issan",
    "Vadim Roytershteyn",
    "Gian Luca Delzanno",
    "Salomon Janhunen"
  ],
  "published": "2025-12-02T22:21:41Z",
  "updated": "2025-12-02T22:21:41Z",
  "categories": [
    "physics.plasm-ph",
    "physics.comp-ph",
    "physics.space-ph"
  ],
  "primary_category": "physics.plasm-ph"
}