{
  "arxiv_id": "2511.19817v2",
  "url": "https://arxiv.org/abs/2511.19817v2",
  "pdf_url": "https://arxiv.org/pdf/2511.19817v2.pdf",
  "title": "Calibration Plan for the SBC 10-kg Liquid Argon Detector with 100 eV Target Threshold",
  "abstract": "The Scintillating Bubble Chamber (SBC) Collaboration is designing a new generation of low background, noble liquid bubble chamber experiments with sub-keV nuclear recoil threshold. These experiments combine the electronic recoil blindness of a bubble chamber with the energy resolution of noble liquid scintillation, and maintain electron recoil discrimination at higher degrees of superheat (lower nuclear recoil thresholds) than Freon-based bubble chambers. A 10-kg liquid argon bubble chamber has the potential to set world leading limits on the dark matter nucleon cross-section for $O(\\mathrm{GeV}/c^{2})$ masses, and to perform a high statistics coherent elastic neutrino nuclear scattering measurement with reactor neutrinos. This work presents a detailed calibration plan to measure the detector response of these experiments, combining photoneutron scattering with two new techniques to induce sub-keV nuclear recoils: nuclear Thomson scattering and thermal neutron capture.",
  "authors": [
    "E. Alfonso-Pita",
    "D. Baxter",
    "E. Behnke",
    "J. Corbett",
    "M. Crisler",
    "C. E. Dahl",
    "K. Dering",
    "A. de St. Croix",
    "D. Durnford",
    "P. Giampa",
    "J. Hall",
    "O. Harris",
    "H. Hawley-Herrera",
    "L. Joseph",
    "A. Kucich",
    "N. Lamb",
    "M. Laurin",
    "I. Levine",
    "W. H. Lippincott",
    "B. Mitra",
    "R. Neilson",
    "O. Nicholson",
    "M. -C. Piro",
    "G. Putnam",
    "D. Pyda",
    "Z. Sheng",
    "G. Sweeney",
    "O. Valdés-Martínez",
    "E. Vázquez-Jáuregui",
    "S. Westerdale",
    "T. J. Whitis",
    "S. Windle",
    "A. Wright",
    "E. Wyman",
    "R. Zhang"
  ],
  "published": "2025-11-25T01:14:36Z",
  "updated": "2025-12-05T19:59:50Z",
  "categories": [
    "physics.ins-det",
    "hep-ex",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det"
}