{
  "arxiv_id": "2512.06528v1",
  "url": "https://arxiv.org/abs/2512.06528v1",
  "pdf_url": "https://arxiv.org/pdf/2512.06528v1.pdf",
  "title": "Laser-written reconfigurable photonic integrated circuit directly coupled to a single-photon avalanche diode array",
  "abstract": "To date, most integrated quantum photonics experiments rely on single-photon detectors operating at cryogenic temperatures coupled to photonic integrated circuits (PICs) through single-mode optical fibers. This approach presents significant challenges due to the detection complexity, as cryogenic conditions hinder the development of scalable systems. In addition, going towards fully-integrated devices or, at least, removing the optical fibers would be also advantageous to develop compact and cost-efficient solutions featuring a high number of optical modes. This work reports on the direct coupling of a PIC, fabricated by femtosecond laser writing (FLW), and a silicon single-photon avalanche diode (SPAD) array, fabricated in a custom planar technology and compatible with the operation at room temperature. The effectiveness of this solution is shown by achieving perfect coupling and a system detection efficiency as high as 41.0% at a wavelength of 561 nm, which is the highest value reported to date among both heterogeneous/hybrid integrated and directly coupled systems. We also show the robustness of the coupling to misalignments, demonstrating that costly alignment procedures are not needed. Finally, we exploit the SPAD array to characterize a reconfigurable Mach-Zehnder interferometer, i.e., the basic building block of multimode reconfigurable PICs. This solution provides a new avenue to the design and implementation of quantum photonics experiments, especially effective when compact and cost-efficient systems are needed.",
  "authors": [
    "Giulio Gualandi",
    "Simone Atzeni",
    "Marco Gardina",
    "Antonino Caime",
    "Giacomo Corrielli",
    "Ivan Labanca",
    "Angelo Gulinatti",
    "Ivan Rech",
    "Roberto Osellame",
    "Giulia Acconcia",
    "Francesco Ceccarelli"
  ],
  "published": "2025-12-06T18:34:09Z",
  "updated": "2025-12-06T18:34:09Z",
  "categories": [
    "physics.optics",
    "physics.ins-det",
    "quant-ph"
  ],
  "primary_category": "physics.optics",
  "doi": "10.1038/s41377-025-01854-6"
}