{
  "arxiv_id": "2512.06291v1",
  "url": "https://arxiv.org/abs/2512.06291v1",
  "pdf_url": "https://arxiv.org/pdf/2512.06291v1.pdf",
  "title": "Solitons in Quasi-Neutral non-Equilibrated Plasmas",
  "abstract": "In an experiment performed in November 2022 at the one-petawatt (PW) laser facility Vega III in Salamanca, Spain, we studied the production of several radioisotopes using the Target Normal Sheath Acceleration (TNSA) method (M. Rodrigues et al. [1], K. Batani et al. [12]). Using the experimental proton energy distribution recorded on a shot-by-shot basis and confirmed on average in a follow-up experiment, we derive the number of nuclear reactions on different targets for a single shot. From this single-shot analysis, we obtain an effective plasma temperature per shot from the yield ratio 11C/7Be. This gives strong limits to the yields of the reaction p + 11B -> 3 alpha, which may reach (1.6 +/- 0.5) x 10^9 as in 2pi. From the fluctuations of the proton spectra and the fusion yields, we derive the TNSA Equation of State (EOS). The deviation of this EOS from the classical ideal gas limit indicates that the plasma is non-neutral and well described by the Korteweg-de Vries equation. Solitons drive the system toward charge neutrality. We derive an effective soliton mass of ms = (26 +/- 1) meV and a soliton speed on the order of vs/c ~ 0.06. Understanding the soliton dynamics is crucial for applications and basic science.",
  "authors": [
    "Zhe Zhu",
    "A. Bonasera",
    "M. R. D. Rodrigues",
    "J. A. Pérez-Hernández",
    "M. Ehret",
    "E. Filippov",
    "H. Larreur",
    "D. Molloy",
    "G. G. Rapisarda",
    "D. Lattuada",
    "G. L. Guardo",
    "C. Verona",
    "Fe. Consoli",
    "G. Petringa",
    "A. McNamee",
    "M. La Cognata",
    "S. Palmerini",
    "R. De Angelis",
    "G. A. P. Cirrone",
    "V. Istokskaia",
    "D. Batani",
    "K. Batani",
    "R. Lera",
    "L. Volpe",
    "D. Giulietti",
    "S. Agarwal",
    "M. Krupka",
    "S. Singh",
    "Jun Xu"
  ],
  "published": "2025-12-06T04:41:11Z",
  "updated": "2025-12-06T04:41:11Z",
  "categories": [
    "physics.plasm-ph",
    "nlin.PS",
    "nucl-ex"
  ],
  "primary_category": "physics.plasm-ph"
}