{
  "arxiv_id": "2512.08788v1",
  "url": "https://arxiv.org/abs/2512.08788v1",
  "pdf_url": "https://arxiv.org/pdf/2512.08788v1.pdf",
  "title": "Commissioning of an experiment for thermodynamic and spectroscopic studies of hydrogen isotopologues at cryogenic conditions",
  "abstract": "To study thermodynamic properties and dynamic phase space behavior of hydrogen isotopologues (Q$_2$) at cryogenic temperatures and at high density, the Tritium Absorption InfraRed Spectroscopy 2 (T$_2$ApIR) experiment has been set up and commissioned at Tritium Laboratory Karlsruhe (TLK). In the frame of the experiment, Q$_2$ behavior in different phases, ortho/para states, temperatures (10 K - 300 K) and pressures (up to 2.5 bar a) will be investigated with optical methods, infrared and Raman spectroscopy. The facility consists of a fully tritium compatible cryostat, which includes an optical cell, ortho/para converter and windows for optical and spectroscopic studies. The cryostat can be cooled below the H$_2$ triple point by a two-stage cryocooler and contains openings in the cryogenic shielding for the optical access. The challenge of combining these scientific requirements in a design with high amounts of tritium (14 g), in a limited space, all while maintaining the TLK safety philosophy was solved by the presented design. The experiment is ready to be fully integrated into the TLK closed loop tritium infrastructure. This contribution reports a comprehensive overview of the commissioning phase of the experimental facility and the results of the first commissioning experiments, including cryogenic performance tests, commissioning experiments with non-radioactive gases, and tests of the analytical instruments.",
  "authors": [
    "Joshua Kohpeiß",
    "Dominic Batzler",
    "Beate Bornschein",
    "Lutz Bornschein",
    "Robin Größle",
    "Daniel Kurz",
    "Ralph Lietzow",
    "Alexander Marsteller",
    "Michael Sturm",
    "Stefan Welte"
  ],
  "published": "2025-12-09T16:40:06Z",
  "updated": "2025-12-09T16:40:06Z",
  "categories": [
    "cond-mat.stat-mech",
    "physics.atm-clus",
    "physics.chem-ph",
    "physics.ins-det"
  ],
  "primary_category": "cond-mat.stat-mech"
}