{
  "arxiv_id": "2512.08748v1",
  "url": "https://arxiv.org/abs/2512.08748v1",
  "pdf_url": "https://arxiv.org/pdf/2512.08748v1.pdf",
  "title": "The new truly cylindrical tracker for the ALICE ITS3",
  "abstract": "The ALICE collaboration is preparing an upgrade of the three innermost layers of the current Inner Tracking System (ITS) during the next LHC long shutdown (LS3). The new ITS detector will use wafer-scale (up to \\SI{27}{cm} in length) Monolithic Active Pixel Sensors with a \\SI{65}{nm} CMOS Image Sensor process, thinned to \\SI{50}{\\micro m} and bent around the beam pipe. The planned upgrade will allow the use of only two sensors per tracker layer, kept in place by just two mechanical supports at the edges and two thin carbon fibre supports at the sensor border. The substitution of water cooling with air cooling will lead to an expected reduction of the material budget per-layer from $\\sim$0.36\\% $X_0$ of the current detector to 0.09\\% $X_0$. The R\\&D process also led to the development of a new sensor variant with an additional low dose n-type implant to the previous detector. This improves charge collection speed, confirms a spatial resolution of about \\SI{5}{\\micro m}, a detection efficiency greater than 99\\% and an excellent radiation tolerance. Large area prototypes proved the possibility to have an active area greater than 90\\%, and a fake hit rate lower than \\SI{e-6}{hits/pixel/event} without loosing detection efficiency. This proceeding will show the above innovations, with particular attention to a small area analogue test structure featuring a front-end which can be monitored via an on-chip Operational Amplifier buffer that preserves the steep signal edge (few hundreds of ps) in order to study the sensor timing performance. The characterization proved a time resolution of \\SI{63}{ps} on average and \\SI{50}{ps} for signal passing right under the electrode with a detection efficiency above 99\\%.",
  "authors": [
    "Stefania Perciballi"
  ],
  "published": "2025-12-09T16:00:10Z",
  "updated": "2025-12-09T16:00:10Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}