{
  "arxiv_id": "2512.08128v1",
  "url": "https://arxiv.org/abs/2512.08128v1",
  "pdf_url": "https://arxiv.org/pdf/2512.08128v1.pdf",
  "title": "Single-step laser patterning and thinning of biocompatible MEMS flow sensor",
  "abstract": "Micro-electro mechanical systems (MEMS) thermal flow sensors are increasingly used for compact, low-power flow monitoring in biomedical applications. However, silicon-based method for sensor fabrication is limited by high cost, rigidity, and multi-step cleanroom processes. This study presents a single-step fiber laser micromachining method for fabricating biocompatible, free-standing MEMS thermal flow sensors from ultrathin titanium foil. The process combines patterning and localized thinning in single-step process, with titanium serving as resistive sensing element. A dual-matrix optimization approach consisting of a Threshold Mapping Matrix (TMM) and Energy Density Matrix (EDM) was used to determine optimized parameters without repeated trial-and-error. For localized thinning, sequential R-T scans with cooling intervals reduced redeposition from the Gaussian beam profile and produced uniform thickness reduction from 50 μm to 20--30 μm. The fabricated sensors were evaluated through thermal coefficient resistance (TCR) measurement, Infrared (IR) thermography, and airflow tests under steady and cyclic conditions controlled by artificial ventilation system. The fabricated devices showed a stable TCR of 3278 ppm °C$^{-1}$, a linear relationship calibration curve between velocity and resistance with $R^2$=0.986 and a 54% improvement in thermal response was achieved with the free-standing structure design compared to substrate-fixed designs. This fabrication approach removes the need for photolithography, wet/dry etching, and wafer bonding, enabling faster and lower-cost production of flexible, biocompatible flow sensors. The method can be applied to other MEMS devices that require compact size, flexibility, localized thinning and free-standing structures.",
  "authors": [
    "Mohammad Nizar Mohamed Zukri",
    "Muhammad Salman Al Farisi",
    "Yoshihiro Hasegawa",
    "Mitsuhiro Shikida"
  ],
  "published": "2025-12-09T00:13:09Z",
  "updated": "2025-12-09T00:13:09Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}