{
  "arxiv_id": "2512.07521v1",
  "url": "https://arxiv.org/abs/2512.07521v1",
  "pdf_url": "https://arxiv.org/pdf/2512.07521v1.pdf",
  "title": "Self-Error Correcting Method for Magnetic-Array-Type Current Sensors in Multi-Core Cable Applications",
  "abstract": "Data-driven methods enable online assessment of error states in magnetic-array-type current sensors, and long-term measurement stability can be enhanced through further self-error correction. However, when the magnetic-array-type current sensors are applied to multi-conductor systems such as multi-core cables, the time-varying correlations among conductor currents may degrade the performance of multi-latent-variable data-driven models for error evaluation. To address this issue, this paper proposes a robust self-error correcting method for magnetic-array-type current sensors even under significant variations in phase current correlations (e.g., large fluctuations in three-phase current imbalance). By incorporating phase current decoupling and principal component analysis (PCA), the correlation analysis of multi-latent variables (i.e., multi-conductor currents) is transformed into a single-latent-variable (corresponding to single phase current) modeling problem. Experimental results demonstrate that the proposed method effectively detects error drifts of magnetic field sensors as low as $2\\times10^{-3}$ in relative error and $2\\times10^{-3}$ rad in phase error. Accurate evaluation and correction of each magnetic field sensor's error drifts substantially eliminates the overall error drift in the magnetic-array-type current sensor, validating the feasibility and effectiveness of the proposed self-error correcting method.",
  "authors": [
    "Xiaohu Liu",
    "Keyu Hou",
    "Kang Ma",
    "Jian Liu",
    "Angang Zheng",
    "Zhengwei Qu",
    "Wei Zhao",
    "Lisha Peng",
    "Songling Huang",
    "Shisong Li"
  ],
  "published": "2025-12-08T12:59:18Z",
  "updated": "2025-12-08T12:59:18Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}