{
  "arxiv_id": "2512.08501v1",
  "url": "https://arxiv.org/abs/2512.08501v1",
  "pdf_url": "https://arxiv.org/pdf/2512.08501v1.pdf",
  "title": "Angular emission of scintillators for nuclear fusion diagnostics",
  "abstract": "Accurate characterization of fast-ion behavior is essential for the safe and efficient operation of nuclear fusion plasmas, as energetic particle losses can degrade plasma performance and damage reactor components. Scintillator-based detectors are widely employed to monitor fast ions; however, existing studies often assume isotropic light emission, neglecting potential angular dependencies that can compromise the determination of ion fluxes. In this work, we investigate the angular emission properties of two commercial scintillators, TG-Green and b-SiAlON, under irradiation with 3.5 MeV He++ and 1 MeV D+ beams, representative of conditions in future fusion devices such as ITER. A novel experimental setup, combining precise optical alignment, angular scanning, and rigorous calibration, was developed to measure the detection efficiency as a function of observation angle. Prior to the characterization, stability tests demonstrated negligible radiation-induced degradation under the applied fluences, and transmission losses due to optical fiber bending were found to be below 1.5%. The results reveal a pronounced angular anisotropy in scintillation emission for both materials, with intensity decreasing as the detection angle increases, well described by an empirical cosine-based model. Additionally, the normalized response shows minimal dependence on ion species or energy. These findings improve scintillator-based diagnostics, allowing more accurate measurement of fast-ion fluxes in fusion plasmas.",
  "authors": [
    "M. Rodríguez-Ramos",
    "J. García-Lópeza",
    "M. Videla-Trevina",
    "J. González-Martinc",
    "P. Alvarez-Fraub",
    "M. Kocan"
  ],
  "published": "2025-12-09T11:34:37Z",
  "updated": "2025-12-09T11:34:37Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}