{
  "arxiv_id": "2509.06437v2",
  "url": "https://arxiv.org/abs/2509.06437v2",
  "pdf_url": "https://arxiv.org/pdf/2509.06437v2.pdf",
  "title": "Particle acceleration up to the synchrotron burn-off limit in relativistic magnetized turbulence",
  "abstract": "In high-energy astrophysics, interpreting observed spectra hinges on understanding the competition between energy gains and radiative losses. To progress along these lines, we report on particle-in-cell simulations of particle acceleration in relativistic, magnetized turbulent pair plasmas including synchrotron radiative losses. Our key finding is that the particle energy spectrum does not terminate at this maximal energy but extends beyond with a steepened spectrum, up to the synchrotron burn-off limit where particles cool within a gyrotime. For our adopted parameters (magnetization $σ\\approx 1 $ and amplitude $δB/B_0\\simeq 1$), the particle distribution follows ${\\rm d}n/{\\rm d}γ\\propto γ^{-s}$ with $s\\simeq 3$ below the predicted maximal energy, then steepens to $s\\simeq 4$ above. The particle distribution and the radiated synchrotron spectra display strong variability near the cutoff energy down to timescales well below the largest eddy turn-around time. We substantiate our results by demonstrating that the acceleration rate itself displays a broken powerlaw-like distribution whose maximal value is the gyrofrequency. The highest energy particles are accelerated by a generalized Fermi process in ideal electric fields, driven by a gradient of the $4$--velocity field $u_E$ of the magnetic field lines of relativistic amplitude, $δu_E \\gtrsim c$, ordered on a scale comparable to the particle gyroradius. We contend that this is a generic feature of relativistic, large-amplitude turbulence. Lastly, we apply our results to the Crab nebula, which exhibits a hierarchy of characteristic Lorentz factors similar to that studied here. We conclude that stochastic acceleration in this environment is a promising mechanism for explaining the highest-energy part of the synchrotron spectral energy distribution, and its variability. [Abridged]",
  "authors": [
    "M. Lemoine",
    "V. Bresci",
    "L. Gremillet"
  ],
  "published": "2025-09-08T08:34:10Z",
  "updated": "2025-12-16T09:44:46Z",
  "categories": [
    "astro-ph.HE",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.HE"
}