{
  "arxiv_id": "2512.14484v1",
  "url": "https://arxiv.org/abs/2512.14484v1",
  "pdf_url": "https://arxiv.org/pdf/2512.14484v1.pdf",
  "title": "Demonstrating sub-picometer non-reciprocity levels in the Three-Backlink Experiment for LISA",
  "abstract": "The current planned space-based gravitational-wave detectors require a bidirectional optical connection, referred to as Backlink, between two adjacent optical benches to provide a mutual phase reference for the local interferometric measurements. However, if the Backlink shows asymmetry between the two propagation directions, the effective optical pathlengths of the counter-propagating beams can introduce a differential phase noise, called non-reciprocity, into the main interferometric measurement that will limit the achievable accuracy in time-delay interferometry (TDI) post-processing. Hence, it is important to understand the properties of the Backlink to ensure that it will not compromise the interferometric detection. The Three-Backlink Experiment (3BL), which consists of an optical test facility with two rotatable benches, was designed under the Laser Interferometer Space Antenna (LISA) framework to study the performance of three Backlink configurations: two fiber-based and one free-beam scheme. In this paper, we report recent experimental results from the 3BL. We describe the commissioning and the subsequent noise mitigation. We achieve a setup noise floor below $1\\text{ pm}\\sqrt{\\text{Hz}}$ across most of the LISA measurement band, and provide an understanding of the current technical limitations. With this low-noise baseline, we measured the performance of the three Backlink implementations under non-rotational conditions. We show that all three Backlinks reach sub-picometer non-reciprocity levels across most of the frequency band, with the remaining part dominated by the mentioned testbed noise. This enabled us to conduct a preliminary study of the Backlink inherent noise, where we emphasized on the backscatter noise intrinsic to a straightforward fiber-based Backlink, as this is the current baseline for LISA.",
  "authors": [
    "Jiang Ji Ho-Zhang",
    "Melanie Ast",
    "Lea Bischof",
    "Michael Born",
    "Daniel Jestrabek",
    "Stefan Ast",
    "Katharina-Sophie Isleif",
    "Oliver Gerberding",
    "Thomas S. Schwarze",
    "Jens Reiche",
    "Gerhard Heinzel",
    "Karsten Danzmann"
  ],
  "published": "2025-12-16T15:16:21Z",
  "updated": "2025-12-16T15:16:21Z",
  "categories": [
    "physics.optics",
    "astro-ph.IM",
    "gr-qc",
    "physics.ins-det"
  ],
  "primary_category": "physics.optics"
}