{
  "arxiv_id": "2512.13958v1",
  "url": "https://arxiv.org/abs/2512.13958v1",
  "pdf_url": "https://arxiv.org/pdf/2512.13958v1.pdf",
  "title": "Radiative Spin Polarization in High Energy Storage Rings",
  "abstract": "The usual theoretical model for synchrotron radiation in circular accelerators (synchrotrons and storage rings) is to treat a single electron moving in a horizontal circle in a uniform vertical magnetic field, but the true situation in real storage rings is more complicated and exhibits much richer physics. The magnetic fields are inhomogeneous, and there is a bunch of many particles and they traverse a distribution of orbits (hence they encounter different magnetic fields). This results in so-called ``depolarizing spin resonances'' (which do not appear in a simple model of a uniform vertical magnetic field). The calculation of the equilibrium electron spin polarization requires a much more careful analysis. For example, a key insight is that, for motion in inhomogeneous magnetic fields, ``spin flip'' is in general \\emph{not} a $180^\\circ$ reversal of the spin orientation. The physics of radiative spin polarization involves a mix of many disciplines, and provides a good example of cross-disciplinary thinking. We shall also briefly note the connection to astrophysics. The astrophysics literature mainly treats electron motion in very strong magnetic fields, stronger than the Schwinger critical field (for example a neutron star). It is a problem of ongoing interest in astrophysics to study the radiation by electrons circulating in such strong magnetic fields. This article aims to provide the reader with a survey of the basic physics principles of radiative spin polarization, omitting low-level mathematical algebra as much as possible. Such details can be found in the literature, and are not relevant here.",
  "authors": [
    "S. R. Mane"
  ],
  "published": "2025-12-15T23:30:41Z",
  "updated": "2025-12-15T23:30:41Z",
  "categories": [
    "physics.acc-ph"
  ],
  "primary_category": "physics.acc-ph"
}