{
  "arxiv_id": "2512.13179v1",
  "url": "https://arxiv.org/abs/2512.13179v1",
  "pdf_url": "https://arxiv.org/pdf/2512.13179v1.pdf",
  "title": "A nanopore-gated sub-attoliter silicon nanocavity for single-molecule trapping and analysis",
  "abstract": "Biomolecules exhibit dynamic conformations critical to their functions, yet observing these processes at the single-molecule level under native conditions remains a formidable challenge. While surface immobilization has been widely used to extend observation times, it could disrupt molecular dynamics and impede biological function. Moreover, the study of weak molecular interactions requires high local concentrations, often leading to problems with signal saturation in fluorescence-based approaches. Recent advancements in single-molecule trapping techniques have addressed some limitations, but achieving precise, controllable, long-term trapping in a molecularly crowded environment without external forces remains difficult. Here, we introduce a nanopore-gated sub-attoliter silicon nanocavity that enables precise, non-perturbative trapping of individual biomolecules for extended observation times, eliminating the need for external forces. Using nucleosomes as model systems, we demonstrate single-molecule Förster resonance energy transfer (smFRET) to monitor relative distances. Our data also show that an applied electric field can modulate the conformational properties of macromolecules, emphasizing a key advantage of our device: it does not require an electric field to retain trapped molecules. We envision this nanocavity platform as a powerful tool for interrogating molecular dynamics in physiologically relevant environments, offering unperturbed access to weak and transient interactions that are central to biological regulation.",
  "authors": [
    "Funing Liu",
    "Qitao Hu",
    "Anton Sabantsev",
    "Giovanni Di Muccio",
    "Shuangshuang Zeng",
    "Mauro Chinappi",
    "Sebastian Deindl",
    "Zhen Zhang"
  ],
  "published": "2025-12-15T10:38:33Z",
  "updated": "2025-12-15T10:38:33Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}