{
  "arxiv_id": "2512.15642v1",
  "url": "https://arxiv.org/abs/2512.15642v1",
  "pdf_url": "https://arxiv.org/pdf/2512.15642v1.pdf",
  "title": "A High-Flux and High-Efficiency Setup for Magneto-Infrared Spectroscopy",
  "abstract": "We report the design and implementation of a high-flux, high-efficiency magneto-infrared spectroscopy system optimized for broadband measurements in high magnetic fields. The setup integrates a Fourier transform infrared spectrometer, a 12 T cryogen-free superconducting magnet, precision-polished and gold-plated light tubes, custom-designed reflective focusing modules for Faraday and Voigt geometries, and an external multi-detector chamber with motorized selection. Optical throughput is maximized by reducing light tube loss from 65.5%/m to 22.0%/m via abrasive flow and mechanical polishing followed by gold electroplating, and by adopting a single-on-axis parabolic-mirror Faraday module that increases the effective numerical aperture from 0.14 to 0.36, enhancing collection efficiency by nearly an order of magnitude. An eight-position motorized sample stage and fully automated control over magnetic field, temperature, optical path, and detector choice enable high-throughput measurements without repeated warm-ups. The optimized configuration achieves a root-mean-square noise level of 0.0061% in a 2-minute integration for a 40% reflectivity sample, corresponding to a signal-to-noise ratio exceeding 16000. System capabilities are demonstrated by resolving weak replica bands in EuCd2As2 and faint Landau level transitions in LaAlSi.",
  "authors": [
    "Zeping Shi",
    "Wenbin Wu",
    "Zhiwei Zhang",
    "Yuhan Du",
    "Chenyao Xu",
    "Guangyi Wang",
    "Mingsen Zhou",
    "Congming Hao",
    "Xianghao Meng",
    "Xiangyu Jiang",
    "Chunhui Pan",
    "Wei Lu",
    "Hao Shen",
    "Haifeng Pan",
    "Zhenrong Sun",
    "Junhao Chu",
    "Xiang Yuan"
  ],
  "published": "2025-12-16T10:30:13Z",
  "updated": "2025-12-16T10:30:13Z",
  "categories": [
    "cond-mat.mtrl-sci",
    "cond-mat.str-el",
    "physics.ins-det"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1063/5.0296925"
}