{
  "arxiv_id": "2512.14667v1",
  "url": "https://arxiv.org/abs/2512.14667v1",
  "pdf_url": "https://arxiv.org/pdf/2512.14667v1.pdf",
  "title": "Configurable γ Photon Spectrometer to Enable Precision Radioguided Tumor Resection",
  "abstract": "Surgical tumor resection aims to remove all cancer cells in the tumor margin and at centimeter-scale depths below the tissue surface. During surgery, microscopic clusters of disease are intraoperatively difficult to visualize and are often left behind, significantly increasing the risk of cancer recurrence. Radioguided surgery (RGS) has shown the ability to selectively tag cancer cells with gamma (γ) photon emitting radioisotopes to identify them, but require a mm-scale γ photon spectrometer to localize the position of these cells in the tissue margin (i.e., a function of incident γ photon energy) with high specificity. Here we present a 9.9 mm2 integrated circuit (IC)-based γ spectrometer implemented in 180 nm CMOS, to enable the measurement of single γ photons and their incident energy with sub-keV energy resolution. We use small 2 2 um reverse-biased diodes that have low depletion region capacitance, and therefore produce millivolt-scale voltage signals in response to the small charge generated by incident γ photons. A low-power energy spectrometry method is implemented by measuring the decay time it takes for the generated voltage signal to settle back to DC after a γ detection event, instead of measuring the voltage drop directly. This spectrometry method is implemented in three different pixel architectures that allow for configurable pixel sensitivity, energy-resolution, and energy dynamic range based on the widely heterogenous surgical and patient presentation in RGS. The spectrometer was tested with three common γ-emitting radioisotopes (64Cu, 133Ba, 177Lu), and is able to resolve activities down to 1 uCi with sub-keV energy resolution and 1.315 MeV energy dynamic range, using 5-minute acquisitions.",
  "authors": [
    "Rahul Lall",
    "Youngho Seo",
    "Ali M. Niknejad",
    "Mekhail Anwar"
  ],
  "published": "2025-12-16T18:26:47Z",
  "updated": "2025-12-16T18:26:47Z",
  "categories": [
    "eess.IV",
    "eess.SP",
    "physics.ins-det"
  ],
  "primary_category": "eess.IV",
  "doi": "10.1109/TBCAS.2025.3625580"
}