[
  {
    "arxiv_id": "2501.00091v3",
    "url": "https://arxiv.org/abs/2501.00091v3",
    "pdf_url": "https://arxiv.org/pdf/2501.00091v3.pdf",
    "title": "Deep learning optimal molecular scintillators for dark matter direct detection",
    "abstract": "Direct searches for sub-GeV dark matter are limited by the intrinsic quantum properties of the target material. In this proof-of-concept study, we argue that this problem is particularly well suited for machine learning. We demonstrate that a simple neural architecture consisting of a variational autoencoder and a multi-layer perceptron can efficiently generate unique molecules with desired properties. In specific, the energy threshold and signal (quantum) efficiency determine the minimum mass and cross section to which a detector can be sensitive. Organic molecules present a particularly interesting class of materials with intrinsically anisotropic electronic responses and $\\mathcal{O}$(few) eV excitation energies. However, the space of possible organic compounds is intractably large, which makes traditional database screening challenging. We adopt excitation energies and proxy transition matrix elements as target properties learned by our network. Our model is able to generate molecules that are not in even the most expansive quantum chemistry databases and predict their relevant properties for high-throughput and efficient screening. Following a massive generation of novel molecules, we use clustering analysis to identify some of the most promising molecular structures that optimise the desired molecular properties for dark matter detection.",
    "authors": [
      "Cameron Cook",
      "Carlos Blanco",
      "Juri Smirnov"
    ],
    "published": "2024-12-30T19:00:00Z",
    "updated": "2025-12-17T17:23:29Z",
    "categories": [
      "hep-ph",
      "cond-mat.mtrl-sci",
      "hep-ex",
      "hep-th",
      "physics.ins-det"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2504.03862v2",
    "url": "https://arxiv.org/abs/2504.03862v2",
    "pdf_url": "https://arxiv.org/pdf/2504.03862v2.pdf",
    "title": "Probing the Firn Refractive Index Profile Using Antenna Response",
    "abstract": "The Radio Neutrino Observatory-Greenland (RNO-G, at Summit Station) experiment comprises an extensive fat-dipole antenna array deployed into ice boreholes over an eventual area of approximately 35 ${\\rm km}^2$. Since the RNO-G experimental sensitivity depends on the radio-frequency properties of the firn, which are known to vary laterally on sub-km distance scales and vertically on sub-meter distance scales, a technique for quickly extracting information on firn ice properties with depth ($n(z)$) during drilling and deployment is desirable. Given that a dipole's resonant wavelength is fixed by geometry, the resonant frequency $f_{res}$ (measured as an S-parameter reflection coefficient [`$S_{11}$'] minimum) scales inversely with the local refractive index, allowing a translation of a depth-dependent $S_{11}$(z) profile into $n(z)$. $S_{11}$(z) data were initially taken in August, 2024 using a dipole lowered into a newly-drilled $98\\pm 1$-mm diameter, 350-m deep borehole at Summit Station, Greenland, approximately 1 km from the site of the original GISP-2 core; improved measurements were subsequently made in May, 2025. We conclude that $S_{11}$(z) data can be used to estimate \\RIP, on 50 cm vertical scales, at the per-cent level of accuracy required by experiments such as RN0-G.",
    "authors": [
      "S. Agarwal",
      "J. A. Aguilar",
      "N. Alden",
      "S. Ali",
      "P. Allison",
      "M. Betts",
      "D. Besson",
      "A. Bishop",
      "O. Botner",
      "S. Bouma",
      "S. Buitink",
      "R. Camphyn",
      "S. Chiche",
      "B. A. Clark",
      "A. Coleman",
      "K. Couberly",
      "S. de Kockere",
      "K. D. de Vries",
      "C. Deaconu",
      "P. Giri",
      "C. Glaser",
      "T. Glusenkamp",
      "A. Hallgren",
      "S. Hallmann",
      "J. C. Hanson",
      "B. Hendricks",
      "J. Henrichs",
      "N. Heyer",
      "C. Hornhuber",
      "E. Huesca Santiago",
      "K. Hughes",
      "T. Karg",
      "A. Karle",
      "J. L. Kelley",
      "M. Korntheuer",
      "M. Kowalski",
      "I. Kravchenko",
      "R. Krebs",
      "R. Lahmann",
      "C. H. Liu",
      "M. J. Marsee",
      "C. McLennan",
      "M. Mikhailova",
      "K. Mulrey",
      "M. Muzio",
      "A. Nelles",
      "A. Novikov",
      "A. Nozdrina",
      "E. Oberla",
      "B. Oeyen",
      "N. Punsuebsay",
      "L. Pyras",
      "M. Ravn",
      "D. Ryckbosch",
      "F. Schluter",
      "O. Scholten",
      "D. Seckel",
      "M. F. H. Seikh",
      "J. Stachurska",
      "J. Stoffels",
      "S. Toscano",
      "D. Tosi",
      "J. Tutt",
      "D. J. Van Den Broeck",
      "N. van Eijndhoven",
      "A. G. Vieregg",
      "A. Vijai",
      "C. Welling",
      "D. R. Williams",
      "P. Windischhofer",
      "S. Wissel",
      "R. Young",
      "A. Zink"
    ],
    "published": "2025-04-04T18:38:26Z",
    "updated": "2025-12-17T17:07:42Z",
    "categories": [
      "astro-ph.IM",
      "astro-ph.HE",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2512.15585v1",
    "url": "https://arxiv.org/abs/2512.15585v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15585v1.pdf",
    "title": "Study of a triple-discriminating plastic scintillator detector for fast neutrons, thermal neutrons, and gamma rays",
    "abstract": "Detecting fast and thermal neutrons plays a crucial role in neutrino experiments and reactor physics. In this study, we propose a plastic scintillator detector which demonstrates the ability to clearly distinguish fast neutrons, thermal neutrons, and gamma rays within mixed radiation fields, offering a practical approach for multi-radiation detection. Two plastic scintillator assemblies: EJ200+EJ426 and EJ276+EJ426 were setup, and the system energy response was calibrated using three gamma sources(137Cs, 22Na and 60Co). An Am-Be neutron source was employed, and pulse shape discrimination(PSD) was used to separate fast neutrons, thermal neutrons and gamma rays. Using a three-sigma discrimination criterion, the EJ200+EJ426 configuration was found to reliably distinguish thermal neutrons from gamma rays, while the EJ276+EJ426 configuration can effectively discriminate fast neutrons, thermal neutrons and gamma rays at gamma-equivalent energies above 1 MeV.",
    "authors": [
      "Y. H. Liu",
      "X. S. Zhang",
      "D. X. Lu",
      "W. Wang",
      "G. Luo",
      "F. P. An"
    ],
    "published": "2025-12-17T16:45:13Z",
    "updated": "2025-12-17T16:45:13Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.14440v2",
    "url": "https://arxiv.org/abs/2510.14440v2",
    "pdf_url": "https://arxiv.org/pdf/2510.14440v2.pdf",
    "title": "Beam Energy Measurement using a Bayesian Approach with the Stacked Foil Method",
    "abstract": "We present a practical method to measure the energy of proton beams at a medical cyclotron using the stacked foil technique in combination with a Bayesian inference method. By measuring the $^{48}$V activity induced in a stack of irradiated titanium foils, the proton energy can be inferred without relying on direct current or charge measurements, making the method suitable even for low-vacuum environments or air-exposed setups. This technique is further extended to configurations where the beam energy is degraded to levels around 8 MeV. A Bayesian fit of the measured activity profile allows not only for a robust energy estimation but also for a consistent treatment of uncertainties and nuisance parameters. Monte Carlo simulations are employed to validate the underlying assumptions, including the impact of energy dispersion or cross-section uncertainties. Our results demonstrate that this method provides accurate beam energy measurements across several typical experimental setups used at the Bern Medical Cyclotron. Additionally, we evaluate the sensitivity of the method to the choice of nuclear cross-section data and assess how the number of foils in the stack affects the uncertainty in the inferred beam energy.",
    "authors": [
      "Alexander Gottstein",
      "Lorenzo Mercolli",
      "Eva Kasanda",
      "Isidre Mateu",
      "Lars Eggimann",
      "Elnaz Zyaee",
      "Gaia Dellepiane",
      "Pierluigi Casolaro",
      "Paola Scampoli",
      "Saverio Braccini"
    ],
    "published": "2025-10-16T08:40:51Z",
    "updated": "2025-12-17T16:00:57Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex",
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.24418v2",
    "url": "https://arxiv.org/abs/2510.24418v2",
    "pdf_url": "https://arxiv.org/pdf/2510.24418v2.pdf",
    "title": "ASTAROTH: A Novel Detector for Dark Matter Direct Detection Using Cryogenic SiPMs",
    "abstract": "The DAMA experiment's long-standing claim of dark matter detection remains a key open issue in astroparticle physics. Independent verification requires NaI(Tl)-based detectors with enhanced low-energy sensitivity. Current detectors rely on photomultiplier tubes (PMTs) which features limited detection efficiency, intrinsic radioactivity, and high noise at keV energies. ASTAROTH is an R&D project that developed a proof of concept NaI(Tl) detector where siliconphotomultipliers (SiPMs) have been used instead of PMTs, offering higher photon detection efficiency, negligible radioactivity, and, most of all, a reduction of two orders of magnitude in the dark noise. The setup includes a custom cryostat operating at approximately 80 K. We report the first characterization of an approximately 360 g NaI(Tl) crystal coupled to a 5 x 5 cm SiPM matrix, yielding 4.5 photoelectrons\\keV after crosstalk correction. This promising result demonstrates the feasibility of SiPM-based readout for NaI(Tl) and paves the way for future large-scale dark matter experiments.",
    "authors": [
      "Edoardo Martinenghi",
      "Valerio Toso",
      "Fabrizio Bruno Armani",
      "Andrea Castoldi",
      "Giuseppe Di Carlo",
      "Luca Frontini",
      "Niccolò Gallice",
      "Chiara Guazzoni",
      "Valentino Liberali",
      "Lorenzo Rutigliani",
      "Alberto Stabile",
      "Krzysztof Szczepaniec",
      "Valeria Trabattoni",
      "Andrea Zani",
      "Davide D'Angelo"
    ],
    "published": "2025-10-28T13:35:01Z",
    "updated": "2025-12-17T15:48:40Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/12/C12019"
  },
  {
    "arxiv_id": "2512.15521v1",
    "url": "https://arxiv.org/abs/2512.15521v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15521v1.pdf",
    "title": "Autonomous Pressure Control in MuVacAS via Deep Reinforcement Learning and Deep Learning Surrogate Models",
    "abstract": "The development of nuclear fusion requires materials that can withstand extreme conditions. The IFMIF-DONES facility, a high-power particle accelerator, is being designed to qualify these materials. A critical testbed for its development is the MuVacAS prototype, which replicates the final segment of the accelerator beamline. Precise regulation of argon gas pressure within its ultra-high vacuum chamber is vital for this task. This work presents a fully data-driven approach for autonomous pressure control. A Deep Learning Surrogate Model, trained on real operational data, emulates the dynamics of the argon injection system. This high-fidelity digital twin then serves as a fast-simulation environment to train a Deep Reinforcement Learning agent. The results demonstrate that the agent successfully learns a control policy that maintains gas pressure within strict operational limits despite dynamic disturbances. This approach marks a significant step toward the intelligent, autonomous control systems required for the demanding next-generation particle accelerator facilities.",
    "authors": [
      "Guillermo Rodriguez-Llorente",
      "Galo Gallardo",
      "Rodrigo Morant Navascués",
      "Nikita Khvatkin Petrovsky",
      "Anderson Sabogal",
      "Roberto Gómez-Espinosa Martín"
    ],
    "published": "2025-12-17T15:19:55Z",
    "updated": "2025-12-17T15:19:55Z",
    "categories": [
      "physics.acc-ph",
      "cs.LG"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.15444v1",
    "url": "https://arxiv.org/abs/2512.15444v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15444v1.pdf",
    "title": "A muon scattering tomography system based on high spatial resolution scintillating detector",
    "abstract": "Cosmic ray muon scattering tomography (MST) is an imaging technique that utilizes muon scattering in matter to inspect high-Z materials non-destructively, without requiring an artificial radiation source. This method offers significant potential for applications in border security and long-term monitoring of nuclear materials. In this study, we developed a high-precision plastic-scintillator-based position-sensitive detector with a spatial resolution of 0.09 times the strip pitch. A fully functional, full-scale imaging system was then constructed using four layers of such XY position-sensitive detectors, each with an effective area of 53 cm x 53 cm. This paper details the following key contributions: the Geant4-simulated design and optimization of the imaging system, the fabrication, assembly, and testing of the detectors, and an evaluation of the imaging performance of the completed system.",
    "authors": [
      "Zheng Liang",
      "Zebo Tang",
      "Xin Li",
      "Baiyu Liu",
      "Cheng Li",
      "Jiacheng He",
      "Kun Jiang",
      "Yonggang Wang",
      "Ye Tian",
      "Yishuang Zhang",
      "Zeyu Wang"
    ],
    "published": "2025-12-17T13:41:16Z",
    "updated": "2025-12-17T13:41:16Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.08389v2",
    "url": "https://arxiv.org/abs/2512.08389v2",
    "pdf_url": "https://arxiv.org/pdf/2512.08389v2.pdf",
    "title": "Development & first Performance evaluation of multi-element monolithic HPGe detector for X-ray spectroscopy",
    "abstract": "The first operational prototype of a high-purity Germanium (HPGe) detector developed within the European LEAPS-INNOV project is presented in this work. This prototype features a monolithic, multi-element sensor optimized for high-resolution X-ray spectroscopy in the hard X-ray regime, capable of handling high count rates (20-250 kcps/mm2) across a broad energy range (5-100 keV). We discuss here a complete laboratory-based characterization of the detector's performance, as well as an on-beam evaluation at the BM05 beamline of the ESRF synchrotron facility, using monochromatic X-rays in the 20-50 keV energy range. We provide a detailed performance assessment that also includes a phenomenological defect-depth estimation model.",
    "authors": [
      "N. Goyal",
      "F. J. Iguaz",
      "S. Aplin",
      "A. Balerna",
      "P. Bell",
      "J. Casas",
      "M. Cascella",
      "S. Chatterji",
      "C. Cohen",
      "E. Collet",
      "E. N. Gimenez",
      "H. Graafsma",
      "H. Hirsemann",
      "K. Klementiev",
      "T. Kolodziej",
      "T. Martin",
      "R. H. Menk",
      "C. Menneglier",
      "C. Meraihia",
      "J. R. Murias",
      "M. Porro",
      "M. Quispe",
      "B. Schmitt",
      "S. Scully",
      "M. Turcato",
      "C. Ward",
      "E. Welter"
    ],
    "published": "2025-12-09T09:18:54Z",
    "updated": "2025-12-17T12:52:09Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.15289v1",
    "url": "https://arxiv.org/abs/2512.15289v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15289v1.pdf",
    "title": "Pixel response characterization of the ARCADIA Fully Depleted MAPS",
    "abstract": "Monolithic Active Pixel Sensors (MAPS) achieved widespread use in several scientific applications, thanks to their properties, such as low material budget and high granularity. The ARCADIA INFN project developed a Fully-Depleted MAPS (FD-MAPS), using a modified LFoundry 110 nm CIS process. This work presents the first laboratory characterization of the ARCADIA MD3 prototype. Measurements include threshold uniformity studies using both test-pulse injection and a $^{55}$Fe source, as well as threshold and noise calibration achieved thanks to monochromatic X-ray sources. Ultimately, charge-collection efficiency is evaluated using an infrared laser setup.",
    "authors": [
      "C. Pantouvakis",
      "M. Rignanese",
      "T. Zenger",
      "S. Ciarlantini",
      "A. Zingaretti",
      "P. Azzi",
      "C. Bonini",
      "D. Chiappara",
      "S. Mattiazzo",
      "D. Pantano",
      "J. Wyss",
      "A. Apresyan",
      "N. Bacchetta",
      "L. Bolla",
      "A. Hayrapetyan",
      "C. Pena",
      "N. Salvador",
      "S. Xie",
      "I. Zoi",
      "D. Falchieri",
      "S. Garbolino",
      "L. Pancheri",
      "A. Paternò",
      "A. Rivetti",
      "M. Rolo",
      "R. Santoro",
      "P. Giubilato"
    ],
    "published": "2025-12-17T10:41:33Z",
    "updated": "2025-12-17T10:41:33Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.15264v1",
    "url": "https://arxiv.org/abs/2512.15264v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15264v1.pdf",
    "title": "Channel-Level Calibration Methods of Silicon Photomultiplier for JUNO-TAO Central Detector",
    "abstract": "The Taishan Antineutrino Observatory (TAO or JUNO-TAO) is a satellite observatory for the Jiangmen Underground Neutrino Observatory (JUNO), located 44 meters away from the No.1 reactor of the Taishan Nuclear Power Plant. TAO can measure the reactor antineutrino energy spectrum with excellent energy resolution (better than 2\\% at 1 MeV) using state-of-the-art Silicon Photomultipliers (SiPMs) operated at low temperature. To achieve this goal, the SiPMs (together with their readout electronics) must be well calibrated. This paper presents the channel-level calibration methods for the dark count rate (DCR), relative photon detection efficiency (PDE), time offset, gain, and internal optical crosstalk (IOCT) of the SiPMs based on charge and time information of the collected events. For the calibration of the external optical crosstalk (EOCT), in terms of its rate and emission angle distribution, a novel method is proposed by switching on and off different groups of SiPMs with an LED placed in the detector. Using one million simulated events, the expected calibration biases are evaluated for all the aforementioned parameters: relative PDE (2.1\\%), IOCT (1.4\\%), DCR (0.4\\%), EOCT Rate ($<0.1\\%$), gain ($<0.1\\%$), time offset (0.027 ns). The emission angle distribution of the EOCT photons could be measured with a bias of less than 4\\% in main angular range.",
    "authors": [
      "Jiayang Xu",
      "Yichen Li",
      "Zhan Liang",
      "Guofu Cao",
      "Zelin Chen"
    ],
    "published": "2025-12-17T10:13:18Z",
    "updated": "2025-12-17T10:13:18Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.15230v1",
    "url": "https://arxiv.org/abs/2512.15230v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15230v1.pdf",
    "title": "ColliderML: The First Release of an OpenDataDetector High-Luminosity Physics Benchmark Dataset",
    "abstract": "We introduce ColliderML - a large, open, experiment-agnostic dataset of fully simulated and digitised proton-proton collisions in High-Luminosity Large Hadron Collider conditions ($\\sqrt{s}=14$ TeV, mean pile-up $μ= 200$). ColliderML provides one million events across ten Standard Model and Beyond Standard Model processes, plus extensive single-particle samples, all produced with modern next-to-leading order matrix element calculation and showering, realistic per-event pile-up overlay, a validated OpenDataDetector geometry, and standard reconstructions. The release fills a major gap for machine learning (ML) research on detector-level data, provided on the ML-friendly Hugging Face platform. We present physics coverage and the generation, simulation, digitisation and reconstruction pipeline, describe format and access, and initial collider physics benchmarks.",
    "authors": [
      "Doğa Elitez",
      "Paul Gessinger",
      "Daniel Murnane",
      "Marcus Selchou Raaholt",
      "Andreas Salzburger",
      "Stine Kofoed Skov",
      "Andreas Stefl",
      "Anna Zaborowska"
    ],
    "published": "2025-12-17T09:30:44Z",
    "updated": "2025-12-17T09:30:44Z",
    "categories": [
      "hep-ex",
      "cs.LG",
      "physics.data-an",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2512.09777v2",
    "url": "https://arxiv.org/abs/2512.09777v2",
    "pdf_url": "https://arxiv.org/pdf/2512.09777v2.pdf",
    "title": "Machine Learning Optimization of BEGe Detector Event Selection in the VIP Experiment",
    "abstract": "The VIP collaboration operates a Broad Energy Germanium detector at the Gran Sasso National Laboratory to measure radiation in the few keV to 100 keV range, aiming to search for spontaneous collapse induced radiation and atomic transitions that violate the Pauli Exclusion Principle. Here we present a machine learning based upgrade for the BEGe detector using an event selection strategy aimed at improving the efficiency in detecting low energy events down to 10 keV. The method employs a denoising autoencoder to suppress electronic and microphonic noises and to reconstruct pulse shapes, followed by a convolutional neural network that classifies waveforms as normal single site or events with anomalies. The workflow was validated on a dataset comprising more than 20000 waveforms recorded in 2021. The classifier achieves a receiver operating characteristic curve with an area under the curve of 0.99 and an accuracy of 95 percent. Applying this procedure lowers the minimum detectable energy of the final spectrum to approximately 10 keV. It also yields a measurable enhancement in spectral quality, including an improvement of about 14 percent in the signal to background ratio and a reduction of the energy resolution for the characteristic Pb and Bi gamma lines. These developments enhance the sensitivity of the BEGe detector to rare low energy signals and provide a scalable framework for future precision tests of quantum foundations in low background environments.",
    "authors": [
      "Simone Manti",
      "Jason Yip",
      "Massimiliano Bazzi",
      "Nicola Bortolotti",
      "Mario Bragadireanu",
      "Ivan Carnevali",
      "Alberto Clozza",
      "Luca De Paolis",
      "Raffaele Del Grande",
      "Carlo Guaraldo",
      "Mihai Antoniu Iliescu",
      "Matthias Laubenstein",
      "Johan Marton",
      "Fabrizio Napolitano",
      "Federico Nola",
      "Kristian Pischicchia",
      "Alessio Porcelli",
      "Alessandro Scordo",
      "Francesco Sgaramella",
      "Diana Sirghi",
      "Florin Sirghi",
      "Johann Zmeskal",
      "Catalina Curceanu"
    ],
    "published": "2025-12-10T15:56:35Z",
    "updated": "2025-12-17T09:05:04Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.14033v2",
    "url": "https://arxiv.org/abs/2512.14033v2",
    "pdf_url": "https://arxiv.org/pdf/2512.14033v2.pdf",
    "title": "Liquid Handling of the JUNO Experiment",
    "abstract": "The Filling, Overflow, and Circulation (FOC) system is a critical subsystem of the Jiangmen Underground Neutrino Observatory (JUNO), responsible for the safe handling of the Liquid Scintillator (LS) and water throughout the detector's commissioning and operational lifetime. This paper details the design and operation of the FOC system, which accomplished the filling of the world's largest LS detector--taking 45 days for water (6.4*10^4 m^3) and 200 days for LS (2.3*10^4 m^3). Throughout water filling, the liquid level difference between the Central Detector and Water Pool was rigorously maintained within safety limits. During LS filling, level control achieved +/-2 cm precision with flow regulation within +/-0.5% of setpoints. An automated control system based on Programmable Logic Controllers and the Experimental Physics and Industrial Control System framework ensured reliable operation. The system preserved LS radiopurity, maintaining 222Rn below 1 mBq/m^3 during filling and achieving 238U/232Th concentrations below 10^-16 g/g. The successful commissioning and operation of the FOC system have established it as an indispensable foundation for the stable long-term operation of the JUNO detector.",
    "authors": [
      "Jiajun Li",
      "Yuekun Heng",
      "Jiajie Ling",
      "Zhi Wu",
      "Xiao Tang",
      "Cong Guo",
      "Jinchang Liu",
      "Xiaolan Luo",
      "Xiao Cai",
      "Chengfeng Yang",
      "Xiaoyan Ma",
      "Xiaohui Qian",
      "Tao Huang",
      "Bi Wu",
      "Pengfei Yang",
      "Shiqi Zhang",
      "Baobiao Yue",
      "Shuaijie Li",
      "Lei Yang",
      "Mei Ye",
      "Shenghui Liu"
    ],
    "published": "2025-12-16T02:57:17Z",
    "updated": "2025-12-17T07:35:23Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.15022v1",
    "url": "https://arxiv.org/abs/2512.15022v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15022v1.pdf",
    "title": "Machine learning-based prediction of magnet errors in storage ring light sources",
    "abstract": "Magnet errors in storage rings significantly degrade beam performance, impacting the brightness and stability of the light source. Therefore, beam-based correction is crucial for the safe operation of machines and the stability of radiated photons. Unlike traditional correction methods such as linear optics from closed orbit, this paper proposes a machine learning (ML) framework to directly predict quadrupole/sextupole gradient errors and misalignment from beam position monitor-measured optics functions and closed-orbit distortion data. Based on a four-bend achromat storage ring lattice, we generate training datasets through ELEGANT numerical simulations and compare regression performance of Linear Regression, Support Vector Machine, Radial Basis Function Neural Network and Densely Connected Convolutional Network. Results demonstrate that ML models can effectively predict magnet errors and reconstruct ideal optics. This approach offers a novel strategy for accelerating storage ring commissioning and optimization, online diagnostics, and dynamic compensation for next-generation diffraction-limited rings.",
    "authors": [
      "Jianhao Xu"
    ],
    "published": "2025-12-17T02:21:45Z",
    "updated": "2025-12-17T02:21:45Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.15014v1",
    "url": "https://arxiv.org/abs/2512.15014v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15014v1.pdf",
    "title": "X-ray detected ferromagnetic resonance spectrometer with an out-of-vacuum photodetector",
    "abstract": "X-ray detected ferromagnetic resonance (XFMR) spectroscopy is an experimental technique for element-specific spin dynamics in the GHz regime and has been utilized to study spintronic materials. The XFMR signal is usually obtained by detecting X-ray excited optical luminescence (XEOL) emitted from a sample substrate. Here, we report the development of an XFMR spectrometer that is designed to place a photodetector for XEOL detection outside an ultra-high-vacuum chamber. This configuration allows for the easy replacement of detectors, such as photodiodes, CCD cameras, and spectrometers, depending on the experimental requirements. We demonstrated the measurement of XEOL spectra from MgO using a visible light spectrometer as well as the detection of XFMR signals originating from the spin precession of a permalloy (Ni80Fe20) thin film using a photodiode detector. The XFMR spectrometer with an out-of-vacuum photodetector expands possibilities for advanced measurements such as XFMR microscopy.",
    "authors": [
      "Tetsuro Ueno",
      "Yasuo Takeichi",
      "Masaki Mizuguchi",
      "Hideaki Iwasawa",
      "Yoshiyuki Ohtsubo",
      "Kanta Ono",
      "Hiroyuki Okazaki",
      "Songtian Li",
      "Seiji Sakai",
      "Tetsuya Yamaki",
      "Tetsu Watanuki",
      "Yoshinori Katayama",
      "Chiharu Mitsumata"
    ],
    "published": "2025-12-17T02:09:52Z",
    "updated": "2025-12-17T02:09:52Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2512.14975v1",
    "url": "https://arxiv.org/abs/2512.14975v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14975v1.pdf",
    "title": "High voltage and electrode system for a cryogenic experiment to search for the neutron electric dipole moment",
    "abstract": "The cryogenic approach to the search for the neutron electric dipole moment--performing the experiment in superfluid liquid helium--holds promise for a substantial increase in sensitivity, potentially enabling a sensitivity level of $10^{-28}$ e-cm. A crucial component in realizing such an experiment is the high voltage and electrode system capable of providing an electric field of 75 kV/cm. This, in turn, requires an electric potential of 635 kV to be applied to the high voltage electrode, while simultaneously satisfying other experimental constraints, such as those on heat load and magnetic noise requirements. This paper describes the outcome of a comprehensive development program addressing these challenges. It outlines the system requirements, discusses new insights into relevant physical phenomena, and details selected technical solutions with their corresponding experimental demonstrations and expected performance. The results collectively demonstrate the successful development of the necessary technology for the high-voltage and electrode system for this approach.",
    "authors": [
      "M. A. Blatnik",
      "S. M. Clayton",
      "S. A. Currie",
      "B. W. Filippone",
      "M. Makela",
      "C. M. O'Shaughnessy",
      "N. S. Phan",
      "J. C. Ramsey",
      "G. V. Riley",
      "A. Roberts",
      "T. Sandborn",
      "T. J Schaub",
      "G. M. Seidel",
      "E. Smith",
      "I. L. Smythe",
      "J. Surbrook",
      "W. Wei",
      "W. Yao",
      "T. M. Ito"
    ],
    "published": "2025-12-17T00:04:30Z",
    "updated": "2025-12-17T00:04:30Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.14962v1",
    "url": "https://arxiv.org/abs/2512.14962v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14962v1.pdf",
    "title": "Adding Radio Frequency Capabilities to a millikelvin Scanning Tunneling Microscope",
    "abstract": "We present a simple home made solution enabling in-situ RF reflectometry measurements with a millikelvin scanning tunneling microscope (mk-STM). The additions described below were made using RF best practices following similar detection schemes commonly employed in the quantum information science (QIS) community. Using a Niobium STM tip to form a superconductor-insulator-normal metal (SIN) tunnel junction, the evolution of coherence peaks at the SC-gap edge are carefully measured to characterize the RF losses and electron temperature. We further identify impedance matching as a crucial factor to achieve high sensitivity in the reflectometry by tuning the tip-sample capacitance as a function of approach distance. As a demonstration of this capability, we measure a 50x50 nm$^2$ area of island features that have been condensed onto the surface of a gold single crystal. Position dependent reflectometry losses allow us to image island sizes down to a total surface area of 5 nm$^2$ given our current sensitivity.",
    "authors": [
      "Jonathan Marbey",
      "Michael Dreyer",
      "R. E. Butera"
    ],
    "published": "2025-12-16T23:03:49Z",
    "updated": "2025-12-16T23:03:49Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.14960v1",
    "url": "https://arxiv.org/abs/2512.14960v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14960v1.pdf",
    "title": "The PANDA Barrel DIRC: From design to assembly",
    "abstract": "The Barrel DIRC counter will serve as the primary particle identification detector in the PANDA experiment, enabling high-precision hadron physics studies through antiproton-proton annihilations across a momentum range of 1.5 GeV/c to 15 GeV/c. It is designed to distinguish charged pions from kaons with a separation of at least 3 standard deviations up to 3.5 GeV/c within polar angles of 22 degrees to 140 degrees. A lens focusing is used the first time in a DIRC detector. After a successful evaluation in particle beams, the key components, i.e. radiator bars and photon sensors, were purchased and tested.",
    "authors": [
      "G. Schepers",
      "A. Belias",
      "R. Dzhygadlo",
      "A. Gerhardt",
      "D. Lehmann",
      "K. Peters",
      "C. Schwarz",
      "J. Schwiening",
      "M. Traxler",
      "Y. Wolf",
      "L. Schmitt",
      "M. Böhm",
      "K. Gumbert",
      "S. Krauss",
      "A. Lehmann",
      "D. Miehling",
      "M. Schmidt",
      "C. Sfienti",
      "A. Ali"
    ],
    "published": "2025-12-16T22:56:25Z",
    "updated": "2025-12-16T22:56:25Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1016/j.nima.2025.171028"
  },
  {
    "arxiv_id": "2512.14923v1",
    "url": "https://arxiv.org/abs/2512.14923v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14923v1.pdf",
    "title": "3D Printing as a Rapid Prototyping Approach for Novel RF Cavity Designs",
    "abstract": "3D-printing of radiofrequency (RF) cavity resonators could provide a cost-effective solution that enables rapid prototyping and design flexibility compared to traditional fabrication of full-metal cavities. In this work, the feasibility of fabrication of a useful multi-mode GHz cavity is explored. Two kinds of plastics, two slicing approaches and two metal coating techniques were used to build a series of clamped cavities with thin inner copper surface on otherwise 3D printed plastic surface. The cavities were then bench-tested to identify spatial field distributions, operating frequencies and quality factors (Q-factor). Pros and cons of the used fabrication approaches were identified and understood, and the performance of longitudinally sliced painted cavity design demonstrated considerable practicality of 3D-printing approach in designing rf systems.",
    "authors": [
      "David Sims",
      "Benjamin Sims",
      "Brian Wright",
      "John W. Lewellen",
      "Sergey V. Baryshev"
    ],
    "published": "2025-12-16T21:21:03Z",
    "updated": "2025-12-16T21:21:03Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2502.18005v2",
    "url": "https://arxiv.org/abs/2502.18005v2",
    "pdf_url": "https://arxiv.org/pdf/2502.18005v2.pdf",
    "title": "WIMP Dark Matter Search using a 3.1 Tonne-Year Exposure of the XENONnT Experiment",
    "abstract": "We report on a search for weakly interacting massive particle (WIMP) dark matter (DM) via elastic DM-xenon-nucleus interactions in the XENONnT experiment. We combine datasets from the first and second science campaigns resulting in a total exposure of 3.1 tonne-years. In a blind analysis of nuclear recoil events with energies above $3.8\\,\\mathrm{keV_{NR}}$, we find no significant excess above background. We set new upper limits on the spin-independent WIMP-nucleon scattering cross section for WIMP masses above $10\\,\\mathrm{GeV}/c^2$ with a minimum of $1.7\\,\\times\\,10^{-47}\\,\\mathrm{cm^2}$ at $90\\,\\%$ confidence level for a WIMP mass of $30\\,\\mathrm{GeV}/c^2$. We achieve a best median sensitivity of $1.4\\,\\times\\,10^{-47}\\,\\mathrm{cm^2}$ for a $41\\,\\mathrm{GeV}/c^2$ WIMP. Compared to the result from the first XENONnT science dataset, we improve our sensitivity by a factor of up to 1.8.",
    "authors": [
      "E. Aprile",
      "J. Aalbers",
      "K. Abe",
      "S. Ahmed Maouloud",
      "L. Althueser",
      "B. Andrieu",
      "E. Angelino",
      "D. Antón Martin",
      "S. R. Armbruster",
      "F. Arneodo",
      "L. Baudis",
      "M. Bazyk",
      "L. Bellagamba",
      "R. Biondi",
      "A. Bismark",
      "K. Boese",
      "A. Brown",
      "G. Bruno",
      "R. Budnik",
      "C. Cai",
      "C. Capelli",
      "J. M. R. Cardoso",
      "A. P. Cimental Chávez",
      "A. P. Colijn",
      "J. Conrad",
      "J. J. Cuenca-García",
      "V. D'Andrea",
      "L. C. Daniel Garcia",
      "M. P. Decowski",
      "A. Deisting",
      "C. Di Donato",
      "P. Di Gangi",
      "S. Diglio",
      "K. Eitel",
      "S. el Morabit",
      "A. Elykov",
      "A. D. Ferella",
      "C. Ferrari",
      "H. Fischer",
      "T. Flehmke",
      "M. Flierman",
      "D. Fuchs",
      "W. Fulgione",
      "C. Fuselli",
      "P. Gaemers",
      "R. Gaior",
      "F. Gao",
      "S. Ghosh",
      "R. Giacomobono",
      "F. Girard",
      "R. Glade-Beucke",
      "L. Grandi",
      "J. Grigat",
      "H. Guan",
      "M. Guida",
      "P. Gyorgy",
      "R. Hammann",
      "A. Higuera",
      "C. Hils",
      "L. Hoetzsch",
      "N. F. Hood",
      "M. Iacovacci",
      "Y. Itow",
      "J. Jakob",
      "F. Joerg",
      "Y. Kaminaga",
      "M. Kara",
      "P. Kavrigin",
      "S. Kazama",
      "P. Kharbanda",
      "M. Kobayashi",
      "D. Koke",
      "K. Kooshkjalali",
      "A. Kopec",
      "H. Landsman",
      "R. F. Lang",
      "L. Levinson",
      "I. Li",
      "S. Li",
      "S. Liang",
      "Z. Liang",
      "Y. -T. Lin",
      "S. Lindemann",
      "M. Lindner",
      "K. Liu",
      "M. Liu",
      "J. Loizeau",
      "F. Lombardi",
      "J. Long",
      "J. A. M. Lopes",
      "G. M. Lucchetti",
      "T. Luce",
      "Y. Ma",
      "C. Macolino",
      "J. Mahlstedt",
      "A. Mancuso",
      "L. Manenti",
      "F. Marignetti",
      "T. Marrodán Undagoitia",
      "K. Martens",
      "J. Masbou",
      "S. Mastroianni",
      "A. Melchiorre",
      "J. Merz",
      "M. Messina",
      "A. Michael",
      "K. Miuchi",
      "A. Molinario",
      "S. Moriyama",
      "K. Morå",
      "Y. Mosbacher",
      "M. Murra",
      "J. Müller",
      "K. Ni",
      "U. Oberlack",
      "B. Paetsch",
      "Y. Pan",
      "Q. Pellegrini",
      "R. Peres",
      "C. Peters",
      "J. Pienaar",
      "M. Pierre",
      "G. Plante",
      "T. R. Pollmann",
      "L. Principe",
      "J. Qi",
      "J. Qin",
      "D. Ramírez García",
      "M. Rajado",
      "A. Ravindran",
      "A. Razeto",
      "R. Singh",
      "L. Sanchez",
      "J. M. F. dos Santos",
      "I. Sarnoff",
      "G. Sartorelli",
      "J. Schreiner",
      "P. Schulte",
      "H. Schulze Eißing",
      "M. Schumann",
      "L. Scotto Lavina",
      "M. Selvi",
      "F. Semeria",
      "P. Shagin",
      "S. Shi",
      "J. Shi",
      "M. Silva",
      "H. Simgen",
      "A. Stevens",
      "C. Szyszka",
      "A. Takeda",
      "Y. Takeuchi",
      "P. -L. Tan",
      "D. Thers",
      "G. Trinchero",
      "C. D. Tunnell",
      "F. Tönnies",
      "K. Valerius",
      "S. Vecchi",
      "S. Vetter",
      "F. I. Villazon Solar",
      "G. Volta",
      "C. Weinheimer",
      "M. Weiss",
      "D. Wenz",
      "C. Wittweg",
      "V. H. S. Wu",
      "Y. Xing",
      "D. Xu",
      "Z. Xu",
      "M. Yamashita",
      "J. Yang",
      "L. Yang",
      "J. Ye",
      "L. Yuan",
      "G. Zavattini",
      "Y. Zhao",
      "M. Zhong"
    ],
    "published": "2025-02-25T09:10:47Z",
    "updated": "2025-12-16T20:11:46Z",
    "categories": [
      "hep-ex",
      "astro-ph.CO",
      "astro-ph.IM",
      "hep-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1103/msw4-t342"
  },
  {
    "arxiv_id": "2512.14872v1",
    "url": "https://arxiv.org/abs/2512.14872v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14872v1.pdf",
    "title": "Bridging the Gap Between Modern UX Design and Particle Accelerator Control Room Interfaces",
    "abstract": "Accelerator control systems often represent relatively complex and safety-sensitive human-machine interfaces within process control industries. These systems are technically robust and reflect the cumulative integration of solutions built and adapted across decades. One of the regular, unfortunate casualties of provisional accelerator control system updates is their human-system interfaces (HSIs) which often lag behind modern usability and design standards. An additional challenge is that although there is a multitude of established human factors (HF), and user experience (UX) principles for everyday digital applications, there are very few (if any) established principles for complex and safety-critical applications for an accelerator. This paper argues for the importance of established HF and UX principles (herein referred to as human-centered design principles) into the development of accelerator HSIs, emphasizing the need for clarity, consistency, responsiveness, and cognitive accessibility. Drawing from HF/UX best practices and human-centered design, this paper discusses how these approaches can enhance operator performance, reduce human error, and improve accelerator personnel collaboration. Case studies from Accelerator Control Operations Research Network (ACORN) at Fermilab are explored to demonstrate how interfaces built with human-centered design principles can scale with system complexity while remaining intuitive and efficient for diverse user roles including operators, machine experts, and engineers. By bridging the gap between traditional control system design and modern human-centered design methods, this paper provides a roadmap for evolving accelerator HSIs into more usable, maintainable, and effective tools.",
    "authors": [
      "Rachael Hill",
      "Casey Kovesdi",
      "Torrey Mortenson",
      "Madelyn Polzin",
      "Zachary Spielman",
      "Katya Le Blanc"
    ],
    "published": "2025-12-16T19:35:36Z",
    "updated": "2025-12-16T19:35:36Z",
    "categories": [
      "physics.acc-ph",
      "cs.SE"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.12163v2",
    "url": "https://arxiv.org/abs/2512.12163v2",
    "pdf_url": "https://arxiv.org/pdf/2512.12163v2.pdf",
    "title": "Large Errors in Kinetic Temperature Measurements Using Particle Tracking Velocimetry",
    "abstract": "We report on random errors in kinetic temperature measurements due to finite spatial resolution in particle tracking velocimetry. Using simulated data, we isolate the error caused by finite spatial resolution from other sources of uncertainty, such as particle acceleration and particle mismatch. A sample of particle velocities is generated from a Maxwellian distribution at a prescribed kinetic temperature. Particle positions are assigned randomly and discretized to match a prescribed spatial resolution. Velocities are reconstructed using the two-frame tracking method, and the resulting kinetic temperature is calculated and compared to the true kinetic temperature. Results show that under typical experimental conditions, the uncertainty in particle positions propagates into large errors in the velocity distribution and the measured kinetic temperature. We find that this might introduce errors ranging from tens of percent at high kinetic temperatures ($\\sim 10$~eV) to thousands of percent at low temperatures ($\\sim 0.1$~eV).",
    "authors": [
      "Anton Kananovich",
      "Parth Mehrotra",
      "Surabhi Jaiswal"
    ],
    "published": "2025-12-13T04:03:18Z",
    "updated": "2025-12-16T19:20:33Z",
    "categories": [
      "physics.plasm-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.14667v1",
    "url": "https://arxiv.org/abs/2512.14667v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14667v1.pdf",
    "title": "Configurable γ Photon Spectrometer to Enable Precision Radioguided Tumor Resection",
    "abstract": "Surgical tumor resection aims to remove all cancer cells in the tumor margin and at centimeter-scale depths below the tissue surface. During surgery, microscopic clusters of disease are intraoperatively difficult to visualize and are often left behind, significantly increasing the risk of cancer recurrence. Radioguided surgery (RGS) has shown the ability to selectively tag cancer cells with gamma (γ) photon emitting radioisotopes to identify them, but require a mm-scale γ photon spectrometer to localize the position of these cells in the tissue margin (i.e., a function of incident γ photon energy) with high specificity. Here we present a 9.9 mm2 integrated circuit (IC)-based γ spectrometer implemented in 180 nm CMOS, to enable the measurement of single γ photons and their incident energy with sub-keV energy resolution. We use small 2 2 um reverse-biased diodes that have low depletion region capacitance, and therefore produce millivolt-scale voltage signals in response to the small charge generated by incident γ photons. A low-power energy spectrometry method is implemented by measuring the decay time it takes for the generated voltage signal to settle back to DC after a γ detection event, instead of measuring the voltage drop directly. This spectrometry method is implemented in three different pixel architectures that allow for configurable pixel sensitivity, energy-resolution, and energy dynamic range based on the widely heterogenous surgical and patient presentation in RGS. The spectrometer was tested with three common γ-emitting radioisotopes (64Cu, 133Ba, 177Lu), and is able to resolve activities down to 1 uCi with sub-keV energy resolution and 1.315 MeV energy dynamic range, using 5-minute acquisitions.",
    "authors": [
      "Rahul Lall",
      "Youngho Seo",
      "Ali M. Niknejad",
      "Mekhail Anwar"
    ],
    "published": "2025-12-16T18:26:47Z",
    "updated": "2025-12-16T18:26:47Z",
    "categories": [
      "eess.IV",
      "eess.SP",
      "physics.ins-det"
    ],
    "primary_category": "eess.IV",
    "doi": "10.1109/TBCAS.2025.3625580"
  },
  {
    "arxiv_id": "2512.14598v1",
    "url": "https://arxiv.org/abs/2512.14598v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14598v1.pdf",
    "title": "Hybrid Machine-Learning Particle Identification for the ePIC Proximity-Focusing RICH",
    "abstract": "We present a machine-learning-based particle-identification study for the proximity-focusing Ring Imaging Cherenkov (pfRICH) detector of the ePIC experiment at the Electron-Ion Collider. Operating in the backward region ($-3.5 \\lesssim η\\lesssim -1.5$), the pfRICH is designed to achieve at least $3σ$ separation among pions, kaons, and protons up to $7,\\mathrm{GeV}/c$ for Semi-Inclusive Deep Inelastic Scattering measurements. Using a standalone Geant4 simulation of the pfRICH, we develop a hybrid machine-learning approach that combines convolutional neural-network-based feature extraction with gradient-boosted decision-tree classifiers. This method significantly enhances Cherenkov-ring pattern recognition and improves particle-separation performance, demonstrating the effectiveness of hybrid machine-learning techniques for next-generation Cherenkov detectors at the EIC.",
    "authors": [
      "D. H. Dongwi",
      "C. -J. Naïm",
      "L. Rhode",
      "A. Deshpande"
    ],
    "published": "2025-12-16T17:07:56Z",
    "updated": "2025-12-16T17:07:56Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.14485v1",
    "url": "https://arxiv.org/abs/2512.14485v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14485v1.pdf",
    "title": "Construction techniques and commissioning of the Three-Backlink Experiment for the LISA mission",
    "abstract": "Designed to detect gravitational waves in the lower-frequency band, the space mission LISA will open a new window to astronomy after its launch in the 2030s. Each LISA spacecraft houses two optical benches that require the exchange of a phase reference between them via an optical connection, called a Backlink. Here we present the construction and commissioning of an ultra-stable quasi-monolithic optical testbed to investigate different Backlink implementations: a direct fiber, a frequency-separated fiber, and a free-beam link, compared in the Three-Backlink Experiment. Dedicated alignment techniques crucial for the construction of these optical benches are presented together with the development of a high-precision beam alignment and measurement tool - a Calibrated Quadrant Photodiode Singleton. An upper limit for the performance of all three investigated Backlink schemes, as determined by initial experiments, can be set at a $15\\text{pm}/\\sqrt{\\text{Hz}}$-equivalent level within the LISA band, spanning 0.1mHz to 1Hz. Our measurements were able to verify the successful construction and commissioning of this very complex interferometer as an interferometric laboratory testbed for LISA. We find no limitations due to the construction on the here reported performance levels. Our results can support the construction of high-precision metrology testbeds for space-based laser interferometry for future gravitational wave or geodesy missions.",
    "authors": [
      "Lea Bischof",
      "Melanie Ast",
      "Jiang Ji Ho-Zhang",
      "Nicole Knust",
      "Daniel Penkert",
      "Daniel Jestrabek",
      "Jens Reiche",
      "Thomas S. Schwarze",
      "Katharina-Sophie Isleif",
      "Oliver Gerberding",
      "Gerhard Heinzel",
      "Stefan Ast",
      "Karsten Danzmann"
    ],
    "published": "2025-12-16T15:16:22Z",
    "updated": "2025-12-16T15:16:22Z",
    "categories": [
      "physics.optics",
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2512.14484v1",
    "url": "https://arxiv.org/abs/2512.14484v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14484v1.pdf",
    "title": "Demonstrating sub-picometer non-reciprocity levels in the Three-Backlink Experiment for LISA",
    "abstract": "The current planned space-based gravitational-wave detectors require a bidirectional optical connection, referred to as Backlink, between two adjacent optical benches to provide a mutual phase reference for the local interferometric measurements. However, if the Backlink shows asymmetry between the two propagation directions, the effective optical pathlengths of the counter-propagating beams can introduce a differential phase noise, called non-reciprocity, into the main interferometric measurement that will limit the achievable accuracy in time-delay interferometry (TDI) post-processing. Hence, it is important to understand the properties of the Backlink to ensure that it will not compromise the interferometric detection. The Three-Backlink Experiment (3BL), which consists of an optical test facility with two rotatable benches, was designed under the Laser Interferometer Space Antenna (LISA) framework to study the performance of three Backlink configurations: two fiber-based and one free-beam scheme. In this paper, we report recent experimental results from the 3BL. We describe the commissioning and the subsequent noise mitigation. We achieve a setup noise floor below $1\\text{ pm}\\sqrt{\\text{Hz}}$ across most of the LISA measurement band, and provide an understanding of the current technical limitations. With this low-noise baseline, we measured the performance of the three Backlink implementations under non-rotational conditions. We show that all three Backlinks reach sub-picometer non-reciprocity levels across most of the frequency band, with the remaining part dominated by the mentioned testbed noise. This enabled us to conduct a preliminary study of the Backlink inherent noise, where we emphasized on the backscatter noise intrinsic to a straightforward fiber-based Backlink, as this is the current baseline for LISA.",
    "authors": [
      "Jiang Ji Ho-Zhang",
      "Melanie Ast",
      "Lea Bischof",
      "Michael Born",
      "Daniel Jestrabek",
      "Stefan Ast",
      "Katharina-Sophie Isleif",
      "Oliver Gerberding",
      "Thomas S. Schwarze",
      "Jens Reiche",
      "Gerhard Heinzel",
      "Karsten Danzmann"
    ],
    "published": "2025-12-16T15:16:21Z",
    "updated": "2025-12-16T15:16:21Z",
    "categories": [
      "physics.optics",
      "astro-ph.IM",
      "gr-qc",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2512.14476v1",
    "url": "https://arxiv.org/abs/2512.14476v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14476v1.pdf",
    "title": "Influence of ion motion in a resonantly driven wakefield accelerator",
    "abstract": "Several different schemes for plasma wakefield acceleration using a train of drivers have been pursued, based on the resonant excitation of a plasma wave. Since these schemes rely on the plasma electron wave surviving for many periods, the motion of the plasma ions can have a significant impact on the beam--plasma interaction. In this work, simulations are used to study the impact of this ion motion on the development of the self-modulation of a long beam, directly applicable to recent experiments. It is shown that two related but distinct effects contribute to the suppression of the wakefield excitation: the loss of resonance between the drive beam and the plasma wave it excites, and phase mixing due to transverse wavebreaking. Although only the latter has previously been investigated, we show that the two effects follow the same scaling with ion mass.",
    "authors": [
      "Erwin Walter",
      "John P. Farmer",
      "Marlene Turner",
      "Frank Jenko"
    ],
    "published": "2025-12-16T15:09:30Z",
    "updated": "2025-12-16T15:09:30Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.15642v1",
    "url": "https://arxiv.org/abs/2512.15642v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15642v1.pdf",
    "title": "A High-Flux and High-Efficiency Setup for Magneto-Infrared Spectroscopy",
    "abstract": "We report the design and implementation of a high-flux, high-efficiency magneto-infrared spectroscopy system optimized for broadband measurements in high magnetic fields. The setup integrates a Fourier transform infrared spectrometer, a 12 T cryogen-free superconducting magnet, precision-polished and gold-plated light tubes, custom-designed reflective focusing modules for Faraday and Voigt geometries, and an external multi-detector chamber with motorized selection. Optical throughput is maximized by reducing light tube loss from 65.5%/m to 22.0%/m via abrasive flow and mechanical polishing followed by gold electroplating, and by adopting a single-on-axis parabolic-mirror Faraday module that increases the effective numerical aperture from 0.14 to 0.36, enhancing collection efficiency by nearly an order of magnitude. An eight-position motorized sample stage and fully automated control over magnetic field, temperature, optical path, and detector choice enable high-throughput measurements without repeated warm-ups. The optimized configuration achieves a root-mean-square noise level of 0.0061% in a 2-minute integration for a 40% reflectivity sample, corresponding to a signal-to-noise ratio exceeding 16000. System capabilities are demonstrated by resolving weak replica bands in EuCd2As2 and faint Landau level transitions in LaAlSi.",
    "authors": [
      "Zeping Shi",
      "Wenbin Wu",
      "Zhiwei Zhang",
      "Yuhan Du",
      "Chenyao Xu",
      "Guangyi Wang",
      "Mingsen Zhou",
      "Congming Hao",
      "Xianghao Meng",
      "Xiangyu Jiang",
      "Chunhui Pan",
      "Wei Lu",
      "Hao Shen",
      "Haifeng Pan",
      "Zhenrong Sun",
      "Junhao Chu",
      "Xiang Yuan"
    ],
    "published": "2025-12-16T10:30:13Z",
    "updated": "2025-12-16T10:30:13Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "cond-mat.str-el",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "doi": "10.1063/5.0296925"
  },
  {
    "arxiv_id": "2512.14261v1",
    "url": "https://arxiv.org/abs/2512.14261v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14261v1.pdf",
    "title": "An LNGS Mobile Neutron Detector (ALMOND): Mapping Ambient Neutron Background of Gran Sasso National Laboratory",
    "abstract": "In deep underground laboratories, environmental neutrons, which are produced at the cavern walls, introduce a source of background to rare event searches. The flux and spectrum of the ambient neutrons vary considerably with time and location. Precise knowledge of this background is necessary to devise shielding and veto mechanisms, thereby improving the sensitivity of the neutron-susceptible underground experiments. ALMOND, currently in operation, is a low-flux mobile neutron spectrometer developed for the LNGS underground laboratory to measure the ambient neutron background of the entire facility. In this paper, an overview of the design, construction and calibration of ALMOND is given. Furthermore, the result of the first underground neutron measurement is shown along with an outlook for future measurements and analyses.",
    "authors": [
      "Melih Solmaz",
      "Klaus Eitel",
      "Alfredo Davide Ferella",
      "Felix Kratzmeier",
      "Francesco Pompa",
      "Kathrin Valerius"
    ],
    "published": "2025-12-16T10:13:43Z",
    "updated": "2025-12-16T10:13:43Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.06437v2",
    "url": "https://arxiv.org/abs/2509.06437v2",
    "pdf_url": "https://arxiv.org/pdf/2509.06437v2.pdf",
    "title": "Particle acceleration up to the synchrotron burn-off limit in relativistic magnetized turbulence",
    "abstract": "In high-energy astrophysics, interpreting observed spectra hinges on understanding the competition between energy gains and radiative losses. To progress along these lines, we report on particle-in-cell simulations of particle acceleration in relativistic, magnetized turbulent pair plasmas including synchrotron radiative losses. Our key finding is that the particle energy spectrum does not terminate at this maximal energy but extends beyond with a steepened spectrum, up to the synchrotron burn-off limit where particles cool within a gyrotime. For our adopted parameters (magnetization $σ\\approx 1 $ and amplitude $δB/B_0\\simeq 1$), the particle distribution follows ${\\rm d}n/{\\rm d}γ\\propto γ^{-s}$ with $s\\simeq 3$ below the predicted maximal energy, then steepens to $s\\simeq 4$ above. The particle distribution and the radiated synchrotron spectra display strong variability near the cutoff energy down to timescales well below the largest eddy turn-around time. We substantiate our results by demonstrating that the acceleration rate itself displays a broken powerlaw-like distribution whose maximal value is the gyrofrequency. The highest energy particles are accelerated by a generalized Fermi process in ideal electric fields, driven by a gradient of the $4$--velocity field $u_E$ of the magnetic field lines of relativistic amplitude, $δu_E \\gtrsim c$, ordered on a scale comparable to the particle gyroradius. We contend that this is a generic feature of relativistic, large-amplitude turbulence. Lastly, we apply our results to the Crab nebula, which exhibits a hierarchy of characteristic Lorentz factors similar to that studied here. We conclude that stochastic acceleration in this environment is a promising mechanism for explaining the highest-energy part of the synchrotron spectral energy distribution, and its variability. [Abridged]",
    "authors": [
      "M. Lemoine",
      "V. Bresci",
      "L. Gremillet"
    ],
    "published": "2025-09-08T08:34:10Z",
    "updated": "2025-12-16T09:44:46Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2508.09086v3",
    "url": "https://arxiv.org/abs/2508.09086v3",
    "pdf_url": "https://arxiv.org/pdf/2508.09086v3.pdf",
    "title": "Direct Measurement of Electron Heating in Electron-Only Reconnection in a Laboratory Mini-Magnetosphere",
    "abstract": "We report on the experimental observation of electron heating in electron-only magnetic reconnection in laser-driven laboratory mini-magnetospheres on the Large Plasma Device (LAPD) at the University of California, Los Angeles. In this experiment, a fast-flowing plasma impacts a pulsed magnetic dipole embedded within LAPD's magnetized ambient plasma, creating an ion-scale magnetosphere and driving electron-only magnetic reconnection between the background and dipole field lines. The electron velocity distribution is measured across the reconnection region using non-collective Thomson scattering, enabling determination of electron temperature and density. Significant electron heating is observed in the electron diffusion region, increasing from an initial temperature of 1.8 eV to 9.5 eV, corresponding to a 40\\% conversion of Poynting flux into electron enthalpy flux. Particle-in-cell simulations that provide insights into the heating mechanisms are also presented.",
    "authors": [
      "Lucas Rovige",
      "Filipe D. Cruz",
      "Timothy Van Hoomissen",
      "Robert S. Dorst",
      "Carmen G. Constantin",
      "Stephen Vincena",
      "Luis O. Silva",
      "Christoph Niemann",
      "Derek B. Schaeffer"
    ],
    "published": "2025-08-12T17:07:43Z",
    "updated": "2025-12-16T09:12:40Z",
    "categories": [
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "1512.08282v2",
    "url": "https://arxiv.org/abs/1512.08282v2",
    "pdf_url": "https://arxiv.org/pdf/1512.08282v2.pdf",
    "title": "Positron Bunch Radiation in the System of Tightly Packed Nanotube",
    "abstract": "Radiation emitted by a bunch of positrons channeled in nanotubes at zero emission angle is studied taking into account medium polarization. The formation of radiation is characterized by an energy threshold that depends on the oscillation amplitude of each positron. When the bunch energy reaches the maximum value of the threshold energy, radiation is produced by all positrons in the bunch. The nanotube potential barrier is described using a harmonic model. The spectral line shape of the radiation from the positron bunch, the fundamental radiation frequency, and the number of emitted photons are determined. It is shown that a system of tightly packed carbon nanotubes can generate an intense, quasi-monochromatic, and directed beam of circularly polarized soft X-ray photons with an energy of about $3$~\\SI{}{\\kilo\\electronvolt} (wavelength $4.1$~\\SI{}{\\angstrom}).",
    "authors": [
      "Hayk L. Gevorgyana",
      "Koryun L. Gevorgyan",
      "Lekdar A. Gevorgian"
    ],
    "published": "2015-12-27T21:54:18Z",
    "updated": "2025-12-16T06:38:14Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2501.03334v2",
    "url": "https://arxiv.org/abs/2501.03334v2",
    "pdf_url": "https://arxiv.org/pdf/2501.03334v2.pdf",
    "title": "FEL Gain Enhancement in an Optical Klystron",
    "abstract": "A system comprising two identical helical or planar undulators separated by a gap -- viz., an optical klystron (OK) -- is investigated. A formula for the frequency distribution of spontaneous radiation at zero angle is derived. It is shown that the spontaneous radiation line shape gradually narrows with increasing distance (up to an optimal value) between the undulators due to the constructive interference of the radiation fields formed in each of them, while the number of radiated photons decreases. The free-electron laser (FEL) gain coefficient also gradually increases, since it is proportional to the derivative of the spontaneous radiation line shape. Using the undulator parameters of the SASE XFEL and the bunch parameters of the LCLS, the total gain coefficient in the X-ray range is on the order of 2.5 and, for a different electron energy, reaches approximately 90 in the water window frequency range.",
    "authors": [
      "Anahit H. Shamamian",
      "Hayk L. Gevorgyan",
      "Lekdar A. Gevorgian"
    ],
    "published": "2025-01-06T19:01:45Z",
    "updated": "2025-12-16T06:25:06Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex",
      "physics.app-ph",
      "physics.optics"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.03379v2",
    "url": "https://arxiv.org/abs/2512.03379v2",
    "pdf_url": "https://arxiv.org/pdf/2512.03379v2.pdf",
    "title": "Microbubble implosions in finite hollow spheres",
    "abstract": "Microbubble implosion (MBI) is a recently proposed novel mechanism with many interesting and exciting potential applications. MBI predicts that the inner layers of a spherical target with a hollow cavity can be compressed into a core with a density 105 times that of the solid density. Furthermore, this ultra-compressed core mostly consists of ions. This leads to the generation of ultra-high electric fields, which may be applicable to gamma-ray lensing or pair creation. However, MBI has yet to be studied for finite hollow spheres whose electrons are free to redistribute themselves after being given an initial temperature. This paper studies MBI under finite sphere conditions. Using an electron distribution model, the electron distribution after receiving an initial temperature is studied. Then, the optimal parameters required to fill a hollow cavity with electrons are calculated. The dynamics of MBI is simulated using a hybrid one-dimensional code. The simulation demonstrates that MBI occurs even for finite spheres, and high-density compression is still achievable with this setup. It also shows the optimal target structure, which maximizes ion flashing.",
    "authors": [
      "M. A. H. Zosa",
      "M. Murakami"
    ],
    "published": "2025-12-03T02:27:57Z",
    "updated": "2025-12-16T03:32:46Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1063/5.0068815"
  },
  {
    "arxiv_id": "2507.11755v3",
    "url": "https://arxiv.org/abs/2507.11755v3",
    "pdf_url": "https://arxiv.org/pdf/2507.11755v3.pdf",
    "title": "Direct Forcing of the Collisional Auroral Ionosphere by Kinetic Alfvén Turbulence",
    "abstract": "The structure of the auroral ionosphere is ascribed to local plasma instabilities. However, we report turbulence extending below 90 km altitude, where particle collisions act to stabilize the plasma. Using a composite radar-GPS spectrum, we resolve a scale-invariant cascade in the 80 km-120 km altitude layer. We identify a characteristic kinetic Alfvénic k^{-8/3} scaling, spanning four orders of magnitude in k, that tracks precipitating energy flux. This reveals a chemical and electric imprint of magnetohydrodynamic turbulence, seeding and driving local instability processes.",
    "authors": [
      "Magnus F Ivarsen",
      "Kaili Song",
      "Luca Spogli",
      "Jean-Pierre St-Maurice",
      "Brian Pitzel",
      "Saif Marei",
      "Devin R Huyghebaert",
      "Satoshi Kasahara",
      "Kunihiro Keika",
      "Yoshizumi Miyoshi",
      "Tomo Hori",
      "David R Themens",
      "Yoichi Kazama",
      "Shiang-Yu Wang",
      "Ayako Matsuoka",
      "Iku Shinohara",
      "Takefumi Mitani",
      "Shoichiro Yokota",
      "P. T. Jayachandran",
      "Glenn C Hussey"
    ],
    "published": "2025-07-15T21:33:42Z",
    "updated": "2025-12-16T02:06:55Z",
    "categories": [
      "physics.space-ph",
      "nlin.AO",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2512.13958v1",
    "url": "https://arxiv.org/abs/2512.13958v1",
    "pdf_url": "https://arxiv.org/pdf/2512.13958v1.pdf",
    "title": "Radiative Spin Polarization in High Energy Storage Rings",
    "abstract": "The usual theoretical model for synchrotron radiation in circular accelerators (synchrotrons and storage rings) is to treat a single electron moving in a horizontal circle in a uniform vertical magnetic field, but the true situation in real storage rings is more complicated and exhibits much richer physics. The magnetic fields are inhomogeneous, and there is a bunch of many particles and they traverse a distribution of orbits (hence they encounter different magnetic fields). This results in so-called ``depolarizing spin resonances'' (which do not appear in a simple model of a uniform vertical magnetic field). The calculation of the equilibrium electron spin polarization requires a much more careful analysis. For example, a key insight is that, for motion in inhomogeneous magnetic fields, ``spin flip'' is in general \\emph{not} a $180^\\circ$ reversal of the spin orientation. The physics of radiative spin polarization involves a mix of many disciplines, and provides a good example of cross-disciplinary thinking. We shall also briefly note the connection to astrophysics. The astrophysics literature mainly treats electron motion in very strong magnetic fields, stronger than the Schwinger critical field (for example a neutron star). It is a problem of ongoing interest in astrophysics to study the radiation by electrons circulating in such strong magnetic fields. This article aims to provide the reader with a survey of the basic physics principles of radiative spin polarization, omitting low-level mathematical algebra as much as possible. Such details can be found in the literature, and are not relevant here.",
    "authors": [
      "S. R. Mane"
    ],
    "published": "2025-12-15T23:30:41Z",
    "updated": "2025-12-15T23:30:41Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.13951v1",
    "url": "https://arxiv.org/abs/2512.13951v1",
    "pdf_url": "https://arxiv.org/pdf/2512.13951v1.pdf",
    "title": "Diagnosing symplecticity in simulations of high-dimensional Hamiltonian systems",
    "abstract": "Integrals of the Liouville $1$-form, known as the first Poincaré integral invariant, provide a computable figure of merit for monitoring the conservation of symplecticity in the numerical integration of Hamiltonian systems. These integrals may be approximated with spectral convergence in the number of sample points, limited only by the regularity of the Hamiltonian. We devise a numerical integral invariant diagnostic for checking preservation of symplecticity in particle-in-cell (PIC) kinetic plasma simulation codes. As a first application of this diagnostic tool, we check the preservation of symplecticity in symplectic electrostatic particle-in-cell (PIC) methods. Surprisingly, such PIC methods fail to have symplectic time-advance maps if the charge is interpolated to the grid using linear shape functions, as is commonly done in practice. It is found that at least quadratic interpolation is needed for a structure-preserving PIC method to truly be symplectic.",
    "authors": [
      "William Barham",
      "J. W. Burby"
    ],
    "published": "2025-12-15T23:09:18Z",
    "updated": "2025-12-15T23:09:18Z",
    "categories": [
      "physics.plasm-ph",
      "math.NA"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.13885v1",
    "url": "https://arxiv.org/abs/2512.13885v1",
    "pdf_url": "https://arxiv.org/pdf/2512.13885v1.pdf",
    "title": "Performance Reconstruction of Eco-Friendly Gas Mixtures for Improved Resistive Plate Chambers at GIF++ Using Geant4",
    "abstract": "A macroscopic reconstruction is developed to infer iRPC performance using Geant4 observables and one experimental anchor. The Geant4 energy deposition is used to estimate the primary ionization yield, while the efficiency turn-on is modeled through an induced-charge description encoded in an effective gain G(E). The absolute scale is fixed by calibrating the standard CMS mixture to its GIF++ efficiency curve and extracting macroscopic Townsend parameters (A,B). The same procedure is propagated to four alternative mixtures, including two HFO and CO2 eco-friendly blends, to reconstruct efficiency curves and working points, enabling detector mixture screening without microscopic transport inputs.",
    "authors": [
      "V. O. Ramirez-Beltran",
      "Cecilia Uribe Estrada",
      "Mauricio Flores Geronimo",
      "François Lagarde"
    ],
    "published": "2025-12-15T20:38:15Z",
    "updated": "2025-12-15T20:38:15Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.13824v1",
    "url": "https://arxiv.org/abs/2512.13824v1",
    "pdf_url": "https://arxiv.org/pdf/2512.13824v1.pdf",
    "title": "Generalized relativistic second order magnetohydrodynamics: A correlation function approach using Zubarev's nonequilibrium statistical operator",
    "abstract": "We use total energy-momentum conservation and the Bianchi identity (magnetic-flux conservation) to construct second-order relativistic magnetohydrodynamics in a Zubarev's non-equilibrium statistical operator (NESO) framework. We obtain all dissipative tensors in the medium by focusing on a relativistic magnetized plasma that preserves parity and is symmetric to charge-conjugation. We also provide Kubo formulas for all transport coefficients that arise at second order. Moreover, we extend the NESO formalism to systematically take into account for nonlocal contributions.",
    "authors": [
      "Abhishek Tiwari",
      "Binoy Krishna Patra"
    ],
    "published": "2025-12-15T19:06:43Z",
    "updated": "2025-12-15T19:06:43Z",
    "categories": [
      "physics.flu-dyn",
      "hep-ph",
      "hep-th",
      "nucl-th",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.flu-dyn"
  },
  {
    "arxiv_id": "2510.22806v2",
    "url": "https://arxiv.org/abs/2510.22806v2",
    "pdf_url": "https://arxiv.org/pdf/2510.22806v2.pdf",
    "title": "Photon-starved imaging through turbulence at the diffraction limit",
    "abstract": "Ground-based imaging systems struggle to achieve diffraction-limited resolution when atmospheric turbulence and photon scarcity act simultaneously. In this regime, conventional adaptive optics, speckle imaging, and blind deconvolution lack sufficient information diversity to reliably estimate either the scene or the turbulence. We present Turbulence Aware Poisson Blind Deconvolution (TAP-BD), a framework designed for robust image recovery in these extreme conditions. TAP-BD extracts more information from coded-detection through phase diversity and decodes it with a physics-informed optimization that incorporates low photon Poisson statistics. Experiments show that TAP-BD provides reliable reconstructions of both scene and turbulence using only a few tens of measurements, even under strong aberrations and photon-starved conditions where existing methods fail. This capability enables photon-efficient, turbulence resilient imaging for applications such as space situational awareness and long-range remote sensing.",
    "authors": [
      "Seungman Choi",
      "Peter Menart",
      "Andrew Schramka",
      "Shubhankar Jape",
      "Leif Bauer",
      "In-Yong Park",
      "Zubin Jacob"
    ],
    "published": "2025-10-26T19:36:28Z",
    "updated": "2025-12-15T18:30:55Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2512.13432v1",
    "url": "https://arxiv.org/abs/2512.13432v1",
    "pdf_url": "https://arxiv.org/pdf/2512.13432v1.pdf",
    "title": "Fast label-free point-scanning super-resolution imaging for endoscopy",
    "abstract": "Optical endoscopy plays a crucial role in minimally invasive medical diagnostics and therapeutic procedures. Nonetheless, state-of-the-art endoscopic zoom objectives are bulky, requiring multi-element lens actuation, which can limit continued miniaturization. Point-scanning super-resolution approaches improve spatial resolution by illuminating the scene with a reduced-width focused spot, yet mechanical scanning requirements limit applicability in clinical settings. Here, we experimentally demonstrate a Fast label-free point-scanning super-resolution (Flaps) microscopy system, which exploits a multi-level phase-only diffractive optical element (DOE) to generate super-resolution spot(s) and uses a high-speed digital micromirror device (DMD) to deliver the illumination without mechanical scanning. Two imaging architectures are explored: a single super-resolution spot (0.47 Airy spot) or a 5 times 5 super-resolution spot array (0.52 Airy spot) in the far-field; the DMD scans the spot or spot array in the object plane at kHz rates. To demonstrate super-resolution imaging with high-speed acquisition using optical elements suitable for future deployment in endoscopy, we image a label-free resolution test target and fluorescently labelled cells.",
    "authors": [
      "Ning Xu",
      "Calum Williams",
      "Graham Spicer",
      "Qixia Wang",
      "Qiaofeng Tan",
      "Sarah E. Bohndiek"
    ],
    "published": "2025-12-15T15:20:14Z",
    "updated": "2025-12-15T15:20:14Z",
    "categories": [
      "physics.optics",
      "physics.ins-det",
      "physics.med-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2512.13394v1",
    "url": "https://arxiv.org/abs/2512.13394v1",
    "pdf_url": "https://arxiv.org/pdf/2512.13394v1.pdf",
    "title": "The Maximum Particle Energy Gain During Magnetic Reconnection",
    "abstract": "The factors that control the maximum energy attained by protons and electrons during magnetic reconnection are investigated analytically and using large-scale simulations with the \\textit{kglobal} model. Previous work revealed that a strong ambient guide field strongly impacts particle energy gain during reconnection, suppressing energy gain from Fermi reflection by increasing the radius of curvature of reconnected field lines. However, previous simulations have also shown that the maximum energy gain increases with the system size. The physical basis for this result has not been explored. We perform simulations that vary the effective system size over a large range to isolate the processes determining the maximum energy gain. The maximum energy $W_{max}$ is regulated by the number of magnetic-island mergers that occur, as multiple flux ropes that form at early time repeatedly merge until the largest approaches the system scale. Fermi reflection in these repeated mergers dominates particle energy gain. The number of mergers is linked to the effective system size -- larger systems produce a larger number of flux ropes and more mergers. That $W_{max}$ is linked to the number of flux rope mergers has implications for understanding why particle-in-cell simulations only produce powerlaw distributions of energetic particles with a limited range in energy.",
    "authors": [
      "Zhiyu Yin",
      "Harry Arnold",
      "James F Drake",
      "Marc Swisdak"
    ],
    "published": "2025-12-15T14:48:17Z",
    "updated": "2025-12-15T14:48:17Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2410.21065v2",
    "url": "https://arxiv.org/abs/2410.21065v2",
    "pdf_url": "https://arxiv.org/pdf/2410.21065v2.pdf",
    "title": "Hollow Beam Optical Ponderomotive Trap for Ultracold Neutral Plasma",
    "abstract": "Rapidly oscillating, inhomogeneous electromagnetic field from laser exert a force that repels charged particles from regions of high light intensity. We propose and analyze a flat-bottomed hollow-beam ponderomotive optical trap for an ultracold neutral plasma (UNP), driven by a high-power CO$_2$ laser. Molecular dynamics simulations show that the plasma and Rydberg atoms are effectively trapped within a nearly uniform dark region bounded by repulsive light walls. In contrast to RF traps, flat-bottomed traps yield a small density-weighted mean ponderomotive energy per electron, while the UNP collision frequency is far below the laser frequency, thereby making collisional absorption negligible and does not limit the lifetime of the trap. This approach could enhance antimatter production and storage.",
    "authors": [
      "S. A. Saakyan"
    ],
    "published": "2024-10-28T14:26:05Z",
    "updated": "2025-12-15T14:47:47Z",
    "categories": [
      "physics.plasm-ph",
      "physics.atom-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.00022v2",
    "url": "https://arxiv.org/abs/2508.00022v2",
    "pdf_url": "https://arxiv.org/pdf/2508.00022v2.pdf",
    "title": "A pair polarimeter for multi-GeV $γ$-rays",
    "abstract": "Accessing the polarization of photon allows to understand the mechanisms behind its emission or scattering, revealing much about a peculiar environment or a probed object. For energy above $\\sim$10~MeV, the pair production dominates the photon-matter interaction and the photon polarization is accessible via the azimuthal angle of the conversion. Unfortunately pair polarimeters have a low figure-of-merit for multi-GeV photons and are mostly used for beam characterization. In this paper, we report a new concept of a compact pair polarimeter associating monolithic active pixel sensors to low-density extended solid converters to reach simultaneously a high efficiency of $\\sim$7\\% and intrinsic analyzing power ranging from 0.2 to 0.5. This new concept will add a new obersvable to the multi-messenger physics, isolate the intrinsic strong force in nucleons and possibly reveal violations of Lorentz invariance.",
    "authors": [
      "Maxime Defurne",
      "Arthur Muhulet"
    ],
    "published": "2025-07-28T19:16:01Z",
    "updated": "2025-12-15T14:22:35Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.13339v1",
    "url": "https://arxiv.org/abs/2512.13339v1",
    "pdf_url": "https://arxiv.org/pdf/2512.13339v1.pdf",
    "title": "Influence of Radiation and AC Coupling on Time Performance of Analog Pixels Test Structures in 65 nm CMOS technology",
    "abstract": "Monolithic Active Pixel Sensors (MAPS) in advanced CMOS imaging technologies are key to next-generation tracking systems for high-energy physics, where radiation hardness and precise vertex reconstruction are essential. As part of the ALICE ITS3 R&D program in synergy with the CERN R&D, we evaluated the performance of the Analog Pixel Test Structures (APTS) fabricated in the TPSCo 65 nm CMOS imaging process. The prototypes employ 10 um pitch pixels with a fast operational amplifier-based buffering stage at the output, enabling direct characterization of intrinsic sensor response. Beam tests with minimum ionizing particles assessed the timing and charge collection of DC- and AC-coupled designs, including devices exposed to 10^14 NIEL and 10^15 NIEL non ioninsing energy loss. DC-coupled sensors demonstrated stable performance, maintaining time resolution lower than 70 ps and >99% detection efficiency up to 10^15 NIEL.   AC-coupled sensors demonstrated a wide operational margin, with efficiencies above 99% for clusterization thresholds below 150 electrons. Even though the AC coupling allows higher reverse bias than DC-coupled sensors, the reduced signal amplitude lowers the signal-to-noise ratio, increasing the jitter contribution. At high reverse bias, the AC-coupled sensors achieve time resolutions comparable to the DC-coupled version, demonstrating the viability of both approaches. These results also suggest that combining the low capacitance of DC-coupled designs with the high-bias capability of AC coupling could further enhance time resolution.   These results confirm the suitability of 65 nm MAPS for future collider detectors requiring high radiation tolerance, efficiency, and timing precision.",
    "authors": [
      "Gianluca Aglieri Rinella",
      "Luca Aglietta",
      "Matias Antonelli",
      "Francesco Barile",
      "Franco Benotto",
      "Stefania Maria Beole",
      "Elena Botta",
      "Giuseppe Eugenio Bruno",
      "Domenico Colella",
      "Angelo Colelli",
      "Giacomo Contin",
      "Giuseppe De Robertis",
      "Floarea Dumitrache",
      "Domenico Elia",
      "Chiara Ferrero",
      "Martin Fransen",
      "Alessandro Grelli",
      "Hartmut Hillemanns",
      "Isis Hobus",
      "Alex Kluge",
      "Shyam Kumar",
      "Corentin Lemoine",
      "Francesco Licciulli",
      "Bong-Hwi Lim",
      "Flavio Loddo",
      "Esther Mwetaminwa M Bilo",
      "Magnus Mager",
      "Davide Marras",
      "Paolo Martinengo",
      "Cosimo Pastore",
      "Rajendra Nath Patra",
      "Stefania Perciballi",
      "Francesco Piro",
      "Francesco Prino",
      "Luciano Ramello",
      "Felix Reidt",
      "Roberto Russo",
      "Valerio Sarritzu",
      "Umberto Savino",
      "Serhiy Senyukov",
      "Mario Sitta",
      "Walter Snoeys",
      "Jory Sonneveld",
      "Miljenko Suljic",
      "Triloki Triloki",
      "Haakan Wennlof"
    ],
    "published": "2025-12-15T13:54:30Z",
    "updated": "2025-12-15T13:54:30Z",
    "categories": [
      "physics.ins-det",
      "physics.app-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.11954v2",
    "url": "https://arxiv.org/abs/2509.11954v2",
    "pdf_url": "https://arxiv.org/pdf/2509.11954v2.pdf",
    "title": "Exploring the performance of SiPM at cryogenic temperature for the sub-meV threshold detector",
    "abstract": "We propose a novel particle detector concept that exploits the breaking of superconducting Cooper pairs, offering a theoretical energy threshold at the sub-meV level. A major challenge for such detectors is the readout of quasiparticles at mK temperatures, where the Cooper pair binding energy is at the sub-meV level, making conventional electronic devices ineffective. Here we demonstrate that silicon photomultipliers (SiPMs) retain full avalanche multiplication capability at environmental temperatures as low as 10 mK. Compared to room temperature operation, the dark count rate decreases by seven orders of magnitude while the gain is reduced by only a factor of 4.44. we present a characterization of several important performance parameters of the SiPM at 10~mK, including breakdown voltage, second divergence voltage, operating voltage range, output waveform characteristics, gain, single-photoelectron resolution, dark count rate, and the correlated noise probability. These results show that SiPMs operating at 10 mK provide sufficient gain and extremely low noise suitable for quasiparticle detection. Based on this finding, we propose a conceptual readout scheme for sub-meV threshold superconducting detectors using PN junction electron multiplication, which holds promise for advancing new searches for neutrino, dark matter, and other rare low-energy processes.",
    "authors": [
      "Aiqin Gao",
      "Hengyu Wang",
      "Xuegang Li",
      "Junhua Wang",
      "Junguang Lv",
      "Guopu Qu",
      "Lei Cao",
      "Xilei Sun",
      "Yiming Guo"
    ],
    "published": "2025-09-15T14:11:54Z",
    "updated": "2025-12-15T12:18:21Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.13184v1",
    "url": "https://arxiv.org/abs/2512.13184v1",
    "pdf_url": "https://arxiv.org/pdf/2512.13184v1.pdf",
    "title": "Charged particle energization by low-amplitude electrostatic waves at cyclotron harmonics",
    "abstract": "The system made by a charged particle interacting with a single electrostatic wave which propagates perpendicularly to the magnetic field, at a frequency larger than the cyclotron one, has been extensively studied in literature due to its implications with ion heating in magnetized plasmas. It is known that a threshold in the electrostatic potential must be exceeded in order for stochastic particle motion and heating to occur. Regardless its amplitude, however, the electrostatic wave induces a periodic oscillation in the particle motion. We show, by analytical and numerical arguments, that this dynamics is non-adiabatic, meaning that the particle does not land back to its initial state when the wave is slowly turned off. This way, particle energization (although, not rigorously heating) occurs even under sub-threshold conditions.",
    "authors": [
      "F. Sattin. L. Martinelli"
    ],
    "published": "2025-12-15T10:49:34Z",
    "updated": "2025-12-15T10:49:34Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.13179v1",
    "url": "https://arxiv.org/abs/2512.13179v1",
    "pdf_url": "https://arxiv.org/pdf/2512.13179v1.pdf",
    "title": "A nanopore-gated sub-attoliter silicon nanocavity for single-molecule trapping and analysis",
    "abstract": "Biomolecules exhibit dynamic conformations critical to their functions, yet observing these processes at the single-molecule level under native conditions remains a formidable challenge. While surface immobilization has been widely used to extend observation times, it could disrupt molecular dynamics and impede biological function. Moreover, the study of weak molecular interactions requires high local concentrations, often leading to problems with signal saturation in fluorescence-based approaches. Recent advancements in single-molecule trapping techniques have addressed some limitations, but achieving precise, controllable, long-term trapping in a molecularly crowded environment without external forces remains difficult. Here, we introduce a nanopore-gated sub-attoliter silicon nanocavity that enables precise, non-perturbative trapping of individual biomolecules for extended observation times, eliminating the need for external forces. Using nucleosomes as model systems, we demonstrate single-molecule Förster resonance energy transfer (smFRET) to monitor relative distances. Our data also show that an applied electric field can modulate the conformational properties of macromolecules, emphasizing a key advantage of our device: it does not require an electric field to retain trapped molecules. We envision this nanocavity platform as a powerful tool for interrogating molecular dynamics in physiologically relevant environments, offering unperturbed access to weak and transient interactions that are central to biological regulation.",
    "authors": [
      "Funing Liu",
      "Qitao Hu",
      "Anton Sabantsev",
      "Giovanni Di Muccio",
      "Shuangshuang Zeng",
      "Mauro Chinappi",
      "Sebastian Deindl",
      "Zhen Zhang"
    ],
    "published": "2025-12-15T10:38:33Z",
    "updated": "2025-12-15T10:38:33Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.15377v2",
    "url": "https://arxiv.org/abs/2509.15377v2",
    "pdf_url": "https://arxiv.org/pdf/2509.15377v2.pdf",
    "title": "Accelerating Garfield++ with CUDA",
    "abstract": "Garfield++ is extensively used within the gaseous detector community for comprehensive detector simulations, supporting the full experimental life cycle from design to operation and calibration. The emergence of micro-pattern gaseous detectors has necessitated computationally intensive microscopic avalanche simulations. The acceleration of one of Garfield++'s most demanding algorithms, AvalancheMicroscopic, by porting it to graphics processing units using NVIDIA's CUDA framework is described. The modifications are integrated into the Garfield++ codebase and are accessible to end users with only minor adjustments to their existing code. Benchmark results demonstrate substantial speed-up, especially for high-gain avalanches involving thousands of electrons, thereby enabling more efficient and detailed detector simulations.",
    "authors": [
      "T. Neep",
      "K. Nikolopoulos",
      "M. Slater"
    ],
    "published": "2025-09-18T19:29:31Z",
    "updated": "2025-12-15T10:31:14Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/12/P12019"
  },
  {
    "arxiv_id": "2512.13152v1",
    "url": "https://arxiv.org/abs/2512.13152v1",
    "pdf_url": "https://arxiv.org/pdf/2512.13152v1.pdf",
    "title": "Performance of USTC first batch resistive AC-LGAD sensor",
    "abstract": "In this paper, the design and characterization of AC-LGAD sensors at the University of Science and Technology of China is introduced. The sensors are characterized with an infrared laser Transient Current Technique (TCT) system for evaluating signal response characteristics and spatial resolution. The temporal resolution was quantified with electrons emitted by a Sr-90 radioactive source. The spatial resolution can reach 4 μm and a temporal resolution of 48 ps is achieved",
    "authors": [
      "Han Li",
      "Xiao Yang",
      "Kuo Ma",
      "Hang Yang",
      "Aonan Wang",
      "De Zhang",
      "Tianao Wang",
      "Xiangxuan Zheng",
      "Jiajin Ge",
      "Yusheng Wu",
      "Hao Liang",
      "Yanwen Liu"
    ],
    "published": "2025-12-15T10:02:14Z",
    "updated": "2025-12-15T10:02:14Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  }
]