{
  "arxiv_id": "2510.27406v1",
  "url": "https://arxiv.org/abs/2510.27406v1",
  "pdf_url": "https://arxiv.org/pdf/2510.27406v1.pdf",
  "title": "Muon veto system for the CROSS double-beta decay search experiment",
  "abstract": "In preparation to the CROSS experiment at the Canfranc underground laboratory (Spain) $-$ aiming to search for neutrinoless double-beta ($0\\nu\\beta\\beta$) decay of $^{100}$Mo using low-temperature detectors with heat-scintillation readout $-$ we report on development of a dedicated muon veto system. The need for the muon veto in CROSS is caused by a comparatively high residual cosmic muon flux at the experimental site ($\\sim$20 $\\mu$/m$^2$/h), being a dominant background in the region of interest (ROI) at $\\sim$3 MeV. Thus, we installed the muon veto system around the CROSS low-background setup, forming four lateral, one top, and four bottom sectors. In this paper we describe the design, construction and operation of the CROSS muon veto system, as well as its optimization and validation by comparing dedicated Monte Carlo (MC) simulations of muons with low-temperature measurements in the setup. We demonstrate a stable operation of the veto system with the average trigger rates compatible with MC simulations. Also, we investigated two muon trigger logics based on coincidences with either 2 sectors or a single sector of the veto. The MC study shows that, in combination with the multiplicity cut of thermal detectors, these trigger logics allow to reject 99.2\\% and 99.7\\% of muon-induced events in the ROI, respectively. Despite a comparatively high dead time ($\\sim$18\\%) introduced by coincidences with any of nine sectors of the veto $-$ the adopted strategy $-$ the muon-induced background in the ROI of the CROSS experiment can be reduced down to $\\sim$2 $\\times 10^{-3}$ cnts/keV/kg/yr, i.e., an acceptable level compatible with a high-sensitivity $0\\nu\\beta\\beta$ decay search foreseen in CROSS.",
  "authors": [
    "A. S. Barabash",
    "L. Bergé",
    "M. Buchynska",
    "J. M. Calvo-Mozota",
    "A. Candela",
    "P. Carniti",
    "M. Chapellier",
    "D. Cintas",
    "A. Corsi",
    "I. Dafinei",
    "F. A. Danevich",
    "M. De Deo",
    "L. Dumoulin",
    "F. Ferri",
    "A. Giuliani",
    "C. Gotti",
    "P. Gras",
    "A. Ianni",
    "V. V. Kobychev",
    "S. I. Konovalov",
    "P. Loaiza",
    "P. de Marcillac",
    "S. Marnieros",
    "C. A. Marrache-Kikuchi",
    "M. Martinez",
    "C. Nones",
    "E. Olivieri",
    "A. Ortiz de Solórzano",
    "V. Perez",
    "G. Pessina",
    "D. V. Poda",
    "B. Romualdi",
    "Ph. Rosier",
    "R. Serino",
    "V. I. Tretyak",
    "V. I. Umatov",
    "G. Ursini",
    "M. M. Zarytskyy",
    "A. Zolotarova"
  ],
  "published": "2025-10-31T11:47:56Z",
  "updated": "2025-10-31T11:47:56Z",
  "categories": [
    "physics.ins-det",
    "hep-ex",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det"
}