{
  "arxiv_id": "2510.27053v1",
  "url": "https://arxiv.org/abs/2510.27053v1",
  "pdf_url": "https://arxiv.org/pdf/2510.27053v1.pdf",
  "title": "Comparing the magnetic Rayleigh-Taylor instability dynamics in two- and   three-dimensions",
  "abstract": "The magnetic Rayleigh-Taylor instability (MRTI) governs plasma mixing and transport in a wide range of astrophysical and laboratory systems. Owing to computational constraints, MRTI is often studied using two-dimensional (2D) simulations, but the extent to which 2D captures the true three-dimensional (3D) dynamics remains unclear. In this work, we perform direct numerical simulations of non-ideal, incompressible MRTI in both 2D and 3D, systematically varying the magnetic field strength from weakly to strongly magnetized regimes. We find that the 3D system exhibits richer mode interactions due to the coexistence of interchange, undular, and mixed modes structures that are inherently absent in 2D. The mixing layer in 3D has enhanced small-scale mixing and reduced fluid dispersion compared to 2D, which is characterized by large-scale plumes. Energy diagnostics reveal that the gravitational potential energy released is higher in 2D, primarily because of inefficient mixing and significant fluid dispersion. In contrast, 3D systems display greater energy dissipation and anisotropy, driven by small-scale vortical motions. The non-linear growth of the instability increases monotonically with magnetic field strength in 3D but shows a non-monotonic trend in 2D. Despite these broad differences, the rate of magnetic-to-kinetic energy conversion remains remarkably similar across dimensions, indicating that 2D simulations can meaningfully capture reconnection-driven processes but not the full turbulent evolution. Overall, our results demonstrate that 2D MRTI simulations cannot reliably represent 3D mixing, energy dynamics, or nonlinear growth, highlighting the fundamental importance of three-dimensionality in magnetized plasma instabilities.",
  "authors": [
    "Manohar Teja Kalluri",
    "Andrew Hillier"
  ],
  "published": "2025-10-30T23:47:24Z",
  "updated": "2025-10-30T23:47:24Z",
  "categories": [
    "physics.flu-dyn",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.flu-dyn"
}