{
  "arxiv_id": "2510.27000v1",
  "url": "https://arxiv.org/abs/2510.27000v1",
  "pdf_url": "https://arxiv.org/pdf/2510.27000v1.pdf",
  "title": "Non-uniform Birefringence in Highly-reflective Substrate-Transferred   GaAs/Al$_{0.92}$Ga$_{0.08}$As Coatings at 1064 nm",
  "abstract": "Using a custom-built scanning system, we generated maps of birefringence on reflection at $\\lambda=1064$~nm from single-crystal GaAs/Al$_{0.92}$Ga$_{0.08}$As Bragg reflectors (henceforth ``AlGaAs coatings''). Ten coatings were bonded to fused silica substrates and one remained on the epitaxial growth wafer. The average phase difference on reflection between beams polarized along the fast and slow axes of the coating was found to be $\\psi = 1.09 \\pm 0.18$~mrad, consistent with values observed in high-finesse optical reference cavities using similar AlGaAs coatings. Scans of substrate-transferred coatings with diameters between 18 and 194 millimeters showed birefringence non-uniformity at a median level of $0.1$~mrad. A similar epitaxial multilayer that was not substrate transferred, but remained on the growth wafer, had by far the least birefringence non-uniformity of all mirrors tested at $0.02$~mrad. On the other hand, the average birefringence of the epi-on-wafer coating and substrate-transferred coatings was indistinguishable. Excluding non-uniformity found at the location of crystal and bonding defects, we conclude that the observed non-uniformity was imparted during the substrate transfer process, likely during bonding. Quantifying the impact on the scatter loss in a LIGO-like interferometer, we find that birefringence non-uniformity at the levels seen here is unlikely to have a significant impact on performance. Nonetheless, future efforts will focus on improved process control to minimize and ultimately eliminate the observed non-uniformity.",
  "authors": [
    "Andri M. Gretarsson",
    "Ambroise L. M. Juston",
    "Benjamin Nicolai",
    "Naomi Borg",
    "Breck N. Meagher",
    "Garrett D. Cole",
    "GariLynn Billingsley",
    "Camille N. Makarem",
    "Elizabeth M. Gretarsson",
    "Gregory M. Harry",
    "Steven D. Penn"
  ],
  "published": "2025-10-30T21:01:03Z",
  "updated": "2025-10-30T21:01:03Z",
  "categories": [
    "physics.optics",
    "astro-ph.IM",
    "gr-qc",
    "physics.ins-det"
  ],
  "primary_category": "physics.optics"
}