{
  "arxiv_id": "2303.09502v2",
  "url": "https://arxiv.org/abs/2303.09502v2",
  "pdf_url": "https://arxiv.org/pdf/2303.09502v2.pdf",
  "title": "M5 -- Mars Magnetospheric Multipoint Measurement Mission: A   multi-spacecraft plasma physics mission to Mars",
  "abstract": "Mars, lacking an intrinsic dynamo, is an ideal laboratory to comparatively study induced magnetospheres, which can be found in other terrestrial bodies as well as comets. Additionally, Mars is of particular interest to further exploration due to its loss of habitability by atmospheric escape and possible future human exploration. In this context, we propose the Mars Magnetospheric Multipoint Measurement Mission (M$^5$), a multi-spacecraft mission to study the dynamics and energy transport of the Martian induced magnetosphere comprehensively. Particular focus is dedicated to the largely unexplored magnetotail region, where signatures of magnetic reconnection have been found. Furthermore, a reliable knowledge of the upstream solar wind conditions is needed to study the dynamics of the Martian magnetosphere, especially the different dayside boundary regions but also for energy transport phenomena like the current system and plasma waves. This will aid the study of atmospheric escape processes of planets with induced magnetospheres. In order to resolve the three-dimensional structures varying both in time and space, multi-point measurements are required. Thus, M$^5$ is a five spacecraft mission, with one solar wind monitor orbiting Mars in a circular orbit at 5 Martian radii, and four smaller spacecraft in a tetrahedral configuration orbiting Mars in an elliptical orbit, spanning the far magnetotail up to 6 Mars radii with a periapsis within the Martian magnetosphere of 1.8 Mars radii. We not only present a detailed assessment of the scientific need for such a mission but also show the resulting mission and spacecraft design taking into account all aspects of the mission requirements and constraints such as mass, power, and link budgets. This mission concept was developed during the Alpbach Summer School 2022.",
  "authors": [
    "Cormac J. K. Larkin",
    "Ville Lundén",
    "Leonard Schulz",
    "Markus Baumgartner-Steinleitner",
    "Marianne Brekkum",
    "Adam Cegla",
    "Pietro Dazzi",
    "Alessia De Iuliis",
    "Jonas Gesch",
    "Sofia Lennerstrand",
    "Sara Nesbit-Östmann",
    "Vasco D. C. Pires",
    "Inés Terraza Palanca",
    "Daniel Teubenbacher",
    "Florine Enengl",
    "Marcus Hallmann"
  ],
  "published": "2023-03-16T17:21:30Z",
  "updated": "2025-10-08T07:59:57Z",
  "categories": [
    "physics.space-ph",
    "astro-ph.EP",
    "astro-ph.IM",
    "physics.geo-ph",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.space-ph",
  "doi": "10.1016/j.asr.2023.11.032"
}