{
  "arxiv_id": "2503.12702v3",
  "url": "https://arxiv.org/abs/2503.12702v3",
  "pdf_url": "https://arxiv.org/pdf/2503.12702v3.pdf",
  "title": "Unveiling a New $β$-Scaling of the Tearing Instability in Weakly   Collisional Plasmas",
  "abstract": "We investigate the linear tearing instability in weakly collisional plasmas using a non-ideal gyrotropic-MHD framework, uncovering a previously unknown scaling relation for the instability growth rate in high-$\\beta$ environments. Even starting from an isotropic equilibrium, our analysis reveals a $\\beta$-dependence, with the maximum growth rate scaling as $\\sigma_\\mathrm{max} \\tau_a \\propto \\beta^{-1/4}$, challenging the long-held assumption of $\\beta$-independence inherent in classical MHD formulations. This novel scaling emerges due to self-consistent fluctuations in pressure anisotropy, dynamically induced by perturbations in velocity and magnetic fields. Increasing plasma-$\\beta$ always suppresses the instability, whereas a background pressure anisotropy can either enhance or further suppress it, depending on its sign: for $p_{\\parallel,0} < p_{\\perp,0}$ the instability is strengthened, while for $p_{\\parallel,0} > p_{\\perp,0}$ it is weakened. Importantly, this effect is not limited to low-collisionality plasmas at high $\\beta$; it can also manifest in more collisional environments once the strict assumption of pressure isotropy is relaxed. This finding has profound implications for various astrophysical contexts characterized by high $\\beta$ and varying degrees of collisionality, including the solar corona and heliospheric current sheets, planetary magnetospheres, as probed by space missions, and the intracluster medium, where magnetic reconnection critically impacts magnetic field evolution and cosmic ray transport. Our results therefore question the universality of the widely-accepted plasmoid-mediated fast reconnection paradigm and underscore the necessity of incorporating pressure anisotropy effects into reconnection models for accurate representation of astrophysical plasmas.",
  "authors": [
    "Gabriel L. Ferreira-Santos",
    "Grzegorz Kowal",
    "Diego A. Falceta-Gonçalves"
  ],
  "published": "2025-03-16T23:59:32Z",
  "updated": "2025-10-08T15:16:25Z",
  "categories": [
    "physics.plasm-ph",
    "astro-ph.HE",
    "astro-ph.SR"
  ],
  "primary_category": "physics.plasm-ph"
}