{
  "arxiv_id": "2509.12608v2",
  "url": "https://arxiv.org/abs/2509.12608v2",
  "pdf_url": "https://arxiv.org/pdf/2509.12608v2.pdf",
  "title": "The impact of Alfvenic shear flow on magnetic reconnection and   turbulence",
  "abstract": "Magnetic reconnection is a fundamental and omnipresent energy conversion process in plasma physics. Novel observations of fields and particles from Parker Solar Probe (PSP) have shown the absence of reconnection in a large number of current sheets in the near-Sun solar wind. Using near-Sun observations from PSP Encounters 4 to 11 (Jan 2020 to March 2022), we investigate whether reconnection onset might be suppressed by velocity shear. We compare estimates of the tearing mode growth rate in the presence of shear flow for time periods identified as containing reconnecting current sheets versus non-reconnecting times, finding systematically larger growth rates for reconnection periods. Upon examination of the parameters associated with reconnection onset, we find that 85% of the reconnection events are embedded in slow, non-Alfvenic wind streams. We compare with fast, slow non-Alfvenic, and slow Alfvenic streams, finding that the growth rate is suppressed in highly Alfvenic fast and slow wind and reconnection is not seen in these wind types, as would be expected from our theoretical expressions. These wind streams have strong Alfvenic flow shear, consistent with the idea of reconnection suppression by such flows. This could help explain the frequent absence of reconnection events in the highly Alfvenic, near-Sun solar wind observed by PSP. Finally, we find a steepening of both the trace and magnitude magnetic field spectra within reconnection periods in comparison to ambient wind. We tie this to the dynamics of relatively balanced turbulence within these reconnection periods and the potential generation of compressible fluctuations.",
  "authors": [
    "Tamar Ervin",
    "Alfred Mallet",
    "Stefan Eriksson",
    "M. Swisdak",
    "James Juno",
    "Orlando M. Romeo",
    "Tai Phan",
    "Trevor A. Bowen",
    "Roberto Livi",
    "Phyllis L. Whittlesey",
    "Davin E. Larson",
    "Stuart D. Bale"
  ],
  "published": "2025-09-16T03:11:53Z",
  "updated": "2025-10-07T23:12:50Z",
  "categories": [
    "physics.space-ph",
    "astro-ph.SR",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.space-ph",
  "doi": "10.3847/2041-8213/ae0b56 10.3847/2041-8213/ae0b56 10.3847/2041-8213/ae0b56"
}