{
  "arxiv_id": "2510.05656v1",
  "url": "https://arxiv.org/abs/2510.05656v1",
  "pdf_url": "https://arxiv.org/pdf/2510.05656v1.pdf",
  "title": "Deposition rate and energy to substrate in chopped and standard HiPIMS:   identifying optimal pulse parameters",
  "abstract": "High-Power Impulse Magnetron Sputtering (HiPIMS) offers higher ionized flux fractions at the cost of lower deposition rates compared to conventional DCMS. A fine optimization of the deposition conditions is crucial for specific applications. Chopped or multi-pulse HiPIMS (segmenting pulses into shorter micropulses) has been proposed to mitigate ion back-attraction and promote working gas recovery. This study investigates how micropulse length, delay time between segments, and magnetic field strength influence energy flux, deposition rate, and ionized flux fraction in chopped and standard HiPIMS. These quantities are evaluated by passive thermal probe, biasable QCM and mass spectrometer measurements at the substrate position. Deposition-averaged and pulse-averaged power is kept constant for all conditions to facilitate meaningful comparison. Results indicate that chopping the HiPIMS pulse consistently leads to higher energy flux and total deposition rate compared to standard HiPIMS at the same total pulse length, primarily due to increased ion flux. A weaker unbalanced magnetic field configuration enhances deposition rates and ion transport. In chopped HiPIMS, increasing micropulse length decreased energy flux and deposition rates, whereas increasing the delay time between micropulses substantially improved these parameters. Importantly, standard HiPIMS, which operated at higher frequencies and short pulse lengths, demonstrated superior performance (with higher total energy and particle fluxes) than chopped HiPIMS when compared at similar short pulse durations. This suggests that consistent short pulse durations and sufficient off-times for complete gas refill are paramount for maximizing ion fluxes and deposition rates.",
  "authors": [
    "Mina Farahani",
    "Jiří Čapek",
    "Tomáš Kozák"
  ],
  "published": "2025-10-07T08:06:15Z",
  "updated": "2025-10-07T08:06:15Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}