{
  "arxiv_id": "2510.05873v1",
  "url": "https://arxiv.org/abs/2510.05873v1",
  "pdf_url": "https://arxiv.org/pdf/2510.05873v1.pdf",
  "title": "Exploring Complexity Measures for Analysis of Solar Wind Structures and   Streams",
  "abstract": "In this paper we use statistical complexity and information theory metrics to study structure within solar wind time series. We explore this using entropy-complexity and information planes, where the measure for entropy is formed using either permutation entropy or the degree distribution of a horizontal visibility graph (HVG). The entropy is then compared to the Jensen complexity (Jensen-Shannon complexity plane) and Fisher information measure (Fisher-Shannon information plane), formed both from permutations and the HVG approach. Additionally we characterise the solar wind time series by studying the properties of the HVG degree distribution. Four types of solar wind intervals have been analysed, namely fast streams, slow streams, magnetic clouds and sheath regions, all of which have distinct origins and interplanetary characteristics. Our results show that, overall, different metrics give similar results but Fisher-Shannon, which gives a more local measure of complexity, leads to a larger spread of values in the entropy-complexity plane. Magnetic cloud intervals stood out in all approaches, in particular when analysing the magnetic field magnitude. Differences between solar wind types (except for magnetic clouds) were typically more distinct for larger time lags, suggesting universality in fluctuations for small scales. The fluctuations within the solar wind time series were generally found to be stochastic, in agreement with previous studies. The use of information theory tools in the analysis of solar wind time series can help to identify structures and provide insight into their origin and formation.",
  "authors": [
    "Venla Koikkalainen",
    "Emilia Kilpua",
    "Simon Good",
    "Adnane Osmane"
  ],
  "published": "2025-10-07T12:40:54Z",
  "updated": "2025-10-07T12:40:54Z",
  "categories": [
    "astro-ph.SR",
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.SR",
  "doi": "10.5194/npg-32-309-2025"
}