{
  "arxiv_id": "2511.14373v1",
  "url": "https://arxiv.org/abs/2511.14373v1",
  "pdf_url": "https://arxiv.org/pdf/2511.14373v1.pdf",
  "title": "Determination of the total dose of bremsstrahlung X-RAY reminiscence on the high-current pulsed radiation-beam complex TEMP-B",
  "abstract": "The paper reports the results of measuring the total dose of X-ray bremsstrahlung from a powerful X-ray source based on the high-current pulsed direct-action electron accelerator Temp-B. The parameters of the high-current, tubular relativistic electron beam from the accelerator were as follows: energy 600 keV, current 13.5 kA, and pulse duration 1.0 mks. Using the pulsed magnetic field of a solenoid, the electron beam generated in a magnetically isolated diode was transported over a 55 cm distance toward the molybdenum converter. An auxiliary coil, connected in series with the solenoid, was placed adjacent to it to provide the desired magnetic field in the converter region and avoid beam losses. The methodology for determining the total dose of the produced X-ray bremsstrahlung is described. Polycrystalline detectors were used for measuring the X-ray bremsstrahlung dose. They were located 80 mm behind the converter in the polar plane, with a 20 deg separation. Measurements of the dose distribution over the polar angle showed symmetrical distributions of the radiation at both polar and azimuthal angles relative to the axis. Taking into account such symmetry and the fact that the electron beam radiates solely into the forward hemisphere, the integration over the entire sphere can be reduced to integration over just a fraction of 1/8 of the spherical surface, thereby reducing the required number of sensors. The experimentally obtained value of the total dose of the X-ray bremsstrahlung is 388.5 Gy per single pulse of the accelerator current, which is concentrated in a 120 deg cone in the direction of the beam movement.",
  "authors": [
    "A. B. Batrakov",
    "S. I. Fedotov",
    "I. N. Onishchenko",
    "E. G. Glushko",
    "A. M. Gorban",
    "O. L. Rak",
    "O. V. Nevara",
    "Yu. N. Volkov"
  ],
  "published": "2025-11-18T11:31:54Z",
  "updated": "2025-11-18T11:31:54Z",
  "categories": [
    "physics.acc-ph"
  ],
  "primary_category": "physics.acc-ph"
}