{
  "arxiv_id": "2511.14561v1",
  "url": "https://arxiv.org/abs/2511.14561v1",
  "pdf_url": "https://arxiv.org/pdf/2511.14561v1.pdf",
  "title": "Direct Neutron Detectors based on Carborane Containing Conjugated Polymers",
  "abstract": "Thermal neutron detectors are crucial to a wide range of applications, including nuclear safety and security, cancer treatment, space research, non-destructive testing, and more. However, neutrons are notoriously difficult to capture due to their absence of charge, and only a handful of isotopes have a sufficient neutron cross-section. Meanwhile, commercially available $^3$He gas filled proportional counters suffer from depleting $^3$He feedstocks and complex device structures. In this work, we explore the potential of a carborane containing conjugated polymer ($o$CbT$_2$-NDI) as a thermal neutron detector. The natural abundance of $^{10}$B in such a polymer enables intrinsic thermal neutron capture of the material, making it the first demonstration of an organic semiconductor with such capabilities. In addition, we show that thermal neutron detection can be achieved also by adding a $^{10}$B$_4$C sensitiser additive to the analogous carborane-free polymer PNDI(2OD)2T, whereas unsensitised PNDI(2OD)2T control devices only respond to the fast neutron component of the radiation field. This approach allows us to disentangle the fast and thermal neutron responses of the devices tested and compare the relative performance of the two approaches to thermal neutron detection. Both the carborane containing and the $^{10}$B$_4$C sensitised devices displayed enhancement due to thermal neutrons, above that of the unsensitised polymer. The detector response is found to be linear with flux up to $1.796\\,\\times\\,10^7\\,$cm$^{-2}$s$^{-1}$ n$_{th}\\bar{v}$ and saturates at high drive biases. This study demonstrates the viability of carboranyl polymers as neutron detectors, highlights the inherent chemical tuneability of organic semiconductors, and opens the possibility of their application to a number of different low-cost, scalable, and easily processable detector technologies.",
  "authors": [
    "Aled Horner",
    "Fani E. Taifakou",
    "Choudhry Z. Amjad",
    "Filip Aniés",
    "Elizabeth George",
    "Chris Allwork",
    "Adrian J. Bevan",
    "Martin Heeney",
    "Theo Kreouzis"
  ],
  "published": "2025-11-18T15:02:41Z",
  "updated": "2025-11-18T15:02:41Z",
  "categories": [
    "physics.ins-det",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det"
}