{
  "arxiv_id": "2601.17955v1",
  "url": "https://arxiv.org/abs/2601.17955v1",
  "pdf_url": "https://arxiv.org/pdf/2601.17955v1.pdf",
  "title": "Spectral Evolution and Current Sheet Analysis as Probes of Reconnection-Mediated Decay in Magnetically Dominated Turbulence",
  "abstract": "The decay of magnetically dominated turbulence exhibits robust inverse transfer of magnetic energy even in the absence of net magnetic helicity, challenging traditional cascade-based phenomenology. While recent studies suggest that magnetic reconnection governs the evolution of such systems, a comprehensive understanding has been lacking. Here we test a reconnection-mediated model for decaying magnetic turbulence in two-dimensional (strict-2D), 2.5D, and three-dimensional (3D) systems with both helical and nonhelical initial conditions. We show that the magnetic-energy decay timescale scales with the Lundquist number in a manner consistent with Sweet-Parker-type reconnection rather than Alfvenic or purely resistive timescales. We develop a broken power-law model for the magnetic energy spectra and provide analytic predictions for the temporal evolution of energy across both sub-inertial and inertial ranges, which are confirmed by high-resolution simulations. In nonhelical turbulence, these results favor anastrophy as the dominant constraint over helicity fluctuations. Using Minkowski functionals to analyze reconnecting current sheets in real space, we find that the structures controlling the decay are substantially smaller than the global magnetic correlation scale, implying local Lundquist numbers well below the system-scale value. This explains the weak sensitivity of global decay laws to current-sheet resolution and that the current-sheet aspect ratios converge toward Sweet-Parker predictions only at sufficiently high resolution. Together, these results establish magnetic reconnection as the organizing principle underlying inverse transfer, spectral evolution, and decay in magnetically dominated turbulence, providing a unified picture applicable across dimensionality and helicity regimes with direct implications for astrophysical plasmas.",
  "authors": [
    "Chandranathan Anandavijayan",
    "Pallavi Bhat"
  ],
  "published": "2026-01-25T19:09:28Z",
  "updated": "2026-01-25T19:09:28Z",
  "categories": [
    "astro-ph.HE",
    "physics.flu-dyn",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.HE"
}