{
  "arxiv_id": "2601.18131v1",
  "url": "https://arxiv.org/abs/2601.18131v1",
  "pdf_url": "https://arxiv.org/pdf/2601.18131v1.pdf",
  "title": "Sub-ion scale current sheets in kinetic Alfvén wave turbulence",
  "abstract": "3D kinetic particle-in-cell (PIC) simulations are performed using the kinetic Alfvén wave (KAW) eigenvector relations from a two-fluid model as initial conditions, in order to study turbulent fluctuations and intermittent structures at sub-ion and electron scales. Simulations with different ion-to-electron mass ratios are set up to investigate the role of electron scales in the formation of intermittent structures. We analyze the current sheet structures that develop in these simulations. Two algorithms, namely Breadth-First Search (BFS) and Density-Based Spatial Clustering of Applications with Noise (DBSCAN), are employed to determine the thickness, length, and width of the current sheets, and both methods are found to yield consistent results. The average current sheet thickness scales inversely with the square root of the ion-to-electron mass ratio, with values close to the electron skin depth ($d_e$), indicating the presence of electron-scale current sheets in the simulations. The widths and lengths of the current sheets show a weaker scaling with the mass ratio. The scale-dependent kurtosis reveals enhanced intermittency at electron scales, consistent with magnetosheath observations. Distributions of scale-dependent properties of the current sheets also align with the electron skin depth of the different simulations and they lie within ranges observed in kinetic scale solar wind turbulence. This study reveals the nature of sub-ion-scale current sheets in KAW turbulence and their role in dissipation.",
  "authors": [
    "Johan Sharma",
    "Ch Akshath Kumar",
    "Kirit D. Makwana",
    "Tulasi N Parashar",
    "Sruti Satyasmita"
  ],
  "published": "2026-01-26T04:26:02Z",
  "updated": "2026-01-26T04:26:02Z",
  "categories": [
    "physics.plasm-ph",
    "astro-ph.SR",
    "physics.comp-ph",
    "physics.space-ph"
  ],
  "primary_category": "physics.plasm-ph"
}