{
  "arxiv_id": "2510.19076v1",
  "url": "https://arxiv.org/abs/2510.19076v1",
  "pdf_url": "https://arxiv.org/pdf/2510.19076v1.pdf",
  "title": "Improved high-gradient performance for medium-velocity superconducting   half-wave resonators: Surface preparation and trapped flux mitigation",
  "abstract": "A development effort to improve the performance of superconducting radio-frequency half-wave resonators (SRF HWRs) is underway at the Facility for Rare Isotope Beams (FRIB), where 220 such resonators are in operation. Our goal was to achieve an intrinsic quality factor (Q0) of >= 2E10 at an accelerating gradient (Ea) of 12 MV/m. FRIB production resonators were prepared with buffered chemical polishing (BCP). First trials on electropolishing (EP) and post-EP low temperature baking (LTB) of FRIB HWRs allowed us to reach higher gradient (15 MV/m, limited by quench) with a higher quality factor at high gradient, but Q0 was still below our goal. Trapped magnetic flux during the Dewar test was found to be a source of Q0 reduction. Three strategies were used to reduce the trapped flux: (i) adding a local magnetic shield (LMGS) to supplement the ``global'' magnetic shield around the Dewar for reduction of the ambient magnetic field; (ii) performing a ``uniform cool-down'' (UC) to reduce the thermoelectric currents; and (iii) using a compensation coil to further reduce the ambient field with active field cancellation (AFC). The LMGS improved the Q0, but not enough to reach our goal. With UC and AFC, we exceeded our goal, reaching Q0 = 2.8E10 at Ea = 12 MV/m.",
  "authors": [
    "Yuting Wu",
    "Kenji Saito",
    "Alex Taylor",
    "Andrei Ganshyn",
    "Chris Compton",
    "Ethan Metzgar",
    "Kyle Elliott",
    "Laura Popielarski",
    "Sam Miller",
    "Sang-hoon Kim",
    "Spencer Combs",
    "Taro Konomi",
    "Ting Xu",
    "Walter Hartung",
    "Wei Chang",
    "Yoo-Lim Cheon"
  ],
  "published": "2025-10-21T21:04:10Z",
  "updated": "2025-10-21T21:04:10Z",
  "categories": [
    "physics.acc-ph"
  ],
  "primary_category": "physics.acc-ph"
}