{
  "arxiv_id": "2510.10657v3",
  "url": "https://arxiv.org/abs/2510.10657v3",
  "pdf_url": "https://arxiv.org/pdf/2510.10657v3.pdf",
  "title": "Unlocking New Frontiers: The Versatile Potential of the Brazilian   Multipurpose Reactor",
  "abstract": "The multipurpose nature of nuclear research reactors has been investigated. This class of reactors has gained momentum within the international community, given the multiple benefits of nuclear technology in medicine, agriculture, industry, and the development of new materials, being characterized by the simultaneous use of several applications. In this context, Brazil has recently joined the group of countries with multipurpose reactor projects. The Brazilian Multipurpose Reactor (RMB) will be Brazil's new neutron source, with a thermal power of $30$ $MW$, with a core flux on the order of $\\phi=4\\times 10^{14}$ $n/cm^{2}s$ and a power density of $312.5$ $W/cm^3$, ensuring the production of radioisotopes, material and fuel irradiation testing, and neutron beam applications. In this work, the demand for neutron fluxes in different irradiation targets is investigated by Monte Carlo simulations under a perturbation caused by a highly neutron-absorbing material, the Gadolinium-157 (Gd-157) isotope. The results show that Molybdenum-99 (Mo-99) production is not affected by the Gd-157 target, and the minimum proposed thermal neutron flux for the reactor's activity ($\\phi_{min}=5.1\\times 10^{12}$ $n/cm^{2}s$) is guaranteed even at maximum operational capacity. The potential production of Terbium (Tb) isotopes for nuclear medicine applications in the RMB is briefly discussed.",
  "authors": [
    "Luiz P. de Oliveira",
    "Alexandre P. S. Souza",
    "Carlos G. S. Santos",
    "Iberê R. S. Júnior",
    "Barbara P. G. Silva",
    "Marco A. S. Pereira",
    "Frederico A. Genezini",
    "José A. Perrotta"
  ],
  "published": "2025-10-12T15:25:24Z",
  "updated": "2025-10-21T13:42:11Z",
  "categories": [
    "physics.ins-det",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det"
}