{
  "arxiv_id": "2509.14892v1",
  "url": "https://arxiv.org/abs/2509.14892v1",
  "pdf_url": "https://arxiv.org/pdf/2509.14892v1.pdf",
  "title": "Supersonic gas curtain based real-time ionization profile monitor for   hadron therapy",
  "abstract": "Accurate control and monitoring of the beam is essential for precise dose delivery to tumor tissues during radiotherapy. Real-time monitoring of ion beam profiles and positions improves beam control, patient safety, and treatment reliability by providing immediate feedback. This becomes even more critical in FLASH therapy, where the short corrective window during high-dose delivery demands precise beam control. Existing devices are often limited to in vitro calibration or focus on monitoring a single parameter during treatment. This study aims to develop a device that can simultaneously monitor beam position, profile, current, and energy in real-time, without perturbing the beam, using a supersonic gas curtain system. A supersonic gas curtain beam profile monitor was developed at the Cockcroft Institute to assess its performance and suitability for applications in hadron-beam therapy. The system was integrated with one of the beamlines of the Pelletron accelerator at the Dalton Cumbrian Facility, UK and 2D profile measurements of carbon beams were conducted. The monitor successfully measured the beam profiles within 100ms to 1s across various beam currents (1 - 100 nA), energies (12 - 24 MeV), and charge states (2-5) of carbon. Recorded data was used to estimate detector performance by introducing a parameter called detection limit to quantify sensitivity of the monitor, identifying the threshold number of ions required for detection onset. A method to quantify sensitivity under different beam conditions is then discussed in detail, illustrated with an example case of FLASH beam parameters. This proof-of-concept study demonstrates the performance of the gas curtain-based ionization profile monitor for 2D transverse beam profile measurement of carbon ions. The sensitivity is quantified and evaluated against an example case for FLASH conditions.",
  "authors": [
    "Narender Kumar",
    "Milaan Patel",
    "William Butcher",
    "Hao Zhang",
    "Oliver Stringer",
    "Joseph Wolfenden",
    "Carsten P Welsch"
  ],
  "published": "2025-09-18T12:15:31Z",
  "updated": "2025-09-18T12:15:31Z",
  "categories": [
    "physics.acc-ph"
  ],
  "primary_category": "physics.acc-ph"
}