{
  "arxiv_id": "2402.17989v2",
  "url": "https://arxiv.org/abs/2402.17989v2",
  "pdf_url": "https://arxiv.org/pdf/2402.17989v2.pdf",
  "title": "Hydrogen bonding in water under extreme confinement",
  "abstract": "Fluids under extreme confinement exhibit unique structures and intermolecular bonding, distinct from their bulk analogs, driving innovative applications at the water-energy nexus. Probing confined water experimentally at the length scale of intermolecular and surface forces has, however, remained a challenge. Here, we report direct molecular-level observations of hydrogen bonding in water confined inside individual carbon nanotubes, enabled by in-situ vibrational electron energy-loss spectroscopy with nanoscale resolution. Hydrogen bonding is probed via the intramolecular O-H stretching frequency, which serves as a sensitive spectral signature of the local intermolecular bonding environment. Water in larger carbon nanotubes exhibit the bonded O-H vibrations of bulk water, but at smaller diameters, the frequency blueshifts to near the free O-H stretch found in water vapor and hydrophobic surfaces, indicating a highly dispersed, non-H-bonded environment. Theoretical analysis based on quantum vibrational oscillators indicates that enhanced damping rates, corresponding to rapid hydrogen-bond fluctuations, leads the bimodal spectral peaks to merge into a single broad feature, matching the experimental observation. Furthermore, cryogenic experiments provide insights into complex structural phase transitions of confined water. This research reveals the quantum and dynamic nature of hydrogen bonds under confinement and the potential impact of unveiling molecular-level structure and bonding in confined fluids.",
  "authors": [
    "Xintong Xu",
    "Matthias Kuehne",
    "Harrison A. Walker",
    "De-Liang Bao",
    "Xin Jin",
    "Yu-Ming Tu",
    "Cody L. Ritt",
    "Joel Martis",
    "Juan Carlos Idrobo",
    "Sokrates T. Pantelides",
    "Michael S. Strano",
    "Jordan A. Hachtel",
    "Arun Majumdar"
  ],
  "published": "2024-02-28T02:13:12Z",
  "updated": "2025-12-22T19:02:54Z",
  "categories": [
    "physics.chem-ph",
    "physics.ins-det"
  ],
  "primary_category": "physics.chem-ph"
}