{
  "arxiv_id": "2512.21082v1",
  "url": "https://arxiv.org/abs/2512.21082v1",
  "pdf_url": "https://arxiv.org/pdf/2512.21082v1.pdf",
  "title": "Electron spectral shape of the third-forbidden $β$-decay of $^{87}$Rb measured using a Rb$_2$ZrCl$_6$ crystal scintillator",
  "abstract": "In recent years, interest in experimental studies of $β$-decay electron spectra -- often referred to as $β$ spectra -- has been growing. This is particularly true for $β$ transitions where the electron spectra are sensitive to the effective value of the weak axial coupling, $g_{\\rm A}$. Such measurements serve as important benchmarks for nuclear physics calculations and can also be used to characterize background in astroparticle physics experiments. In this work, a dedicated experiment has been carried out to investigate the spectral shape of the third-forbidden $^{87}$Rb $β$-decays, with the goal of estimating the effective $g_{\\rm A}$ value for this transition and of deriving the T$_{1/2}$ value. This was done by comparing the experimental spectral shape with the estimates from various phenomenological models. The $^{87}$Rb source was embedded directly within the detector material of a new Rb$_2$ZrCl$_6$ crystal scintillator; the data taking was performed deep underground at Gran Sasso National Laboratory. The obtained experimental half-life value for the studied process is T$_{1/2} = 5.08(13) \\times$ 10$^{10}$ yr; while a $g_{\\rm A}$ value in the range 0.4 to 0.6 is obtained when accounting for uncertainties and depending on the model adopted as discussed in detail in the text.",
  "authors": [
    "P. Belli",
    "R. Bernabei",
    "F. Cappella",
    "V. Caracciolo",
    "R. Cerulli",
    "A. Incicchitti",
    "A. Leoncini",
    "V. Merlo",
    "S. S. Nagorny",
    "V. V. Nahorna",
    "S. Nisi",
    "P. Wang",
    "J. Suhonen",
    "M. Ramalho",
    "J. Kostensalo"
  ],
  "published": "2025-12-24T09:57:42Z",
  "updated": "2025-12-24T09:57:42Z",
  "categories": [
    "nucl-ex",
    "hep-ex",
    "nucl-th",
    "physics.ins-det"
  ],
  "primary_category": "nucl-ex"
}