{
  "arxiv_id": "2504.16190v3",
  "url": "https://arxiv.org/abs/2504.16190v3",
  "pdf_url": "https://arxiv.org/pdf/2504.16190v3.pdf",
  "title": "Simulating X-point radiator turbulence",
  "abstract": "Coupling a high-performance burning plasma core to a detached boundary solution is critical for realizing magnetic confinement fusion power. Predictive simulations of the edge and scrape-off layer are therefore essential and must self-consistently account for turbulence and the interplay between the plasma, neutral gas, and impurities. We present results on controlled full detachment in ASDEX Upgrade with an X-point radiator (XPR), obtained with the edge turbulence code GRILLIX. Assuming a fixed nitrogen concentration (in terms of the electron density) in coronal equilibrium, two simulations are discussed: they exhibit dense nitrogen radiation fronts, located 5 and 12 cm above the X-point, accounting for 80 % of the input heating power. In validations against density, temperature, and bolometry measurements, the simulations show good agreement and reproduce the detached divertor conditions observed in the experiment. Neutral gas is critical for achieving detachment and modulating the height of the XPR front, in agreement with previous SOLPS-ITER transport modeling and analytical power balance studies. In addition, the front structure is highly dynamic due to turbulence, consisting of ionizing and radiative mantles surrounding intermittent cold spots of recombining plasma. Near the detachment front, density and temperature fluctuation amplitudes exceed the background by more than 400 %, compared to 40 % in an attached reference case. The radial electric field shifts inward, poloidal symmetry of the electrostatic potential is broken (inducing strong radial flows around the XPR), and radial particle and heat transport into the low-field side scrape-off layer increases. These effects may explain the ELM suppression observed in the H-mode XPR regime.",
  "authors": [
    "K. Eder",
    "W. Zholobenko",
    "A. Stegmeir",
    "M. Bernert",
    "D. Coster",
    "F. Jenko",
    "the ASDEX Upgrade Team",
    "the EUROfusion Tokamak Exploitation Team"
  ],
  "published": "2025-04-22T18:27:11Z",
  "updated": "2025-08-08T18:21:42Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": "10.1088/1741-4326/adf901"
}