{
  "arxiv_id": "2506.17523v2",
  "url": "https://arxiv.org/abs/2506.17523v2",
  "pdf_url": "https://arxiv.org/pdf/2506.17523v2.pdf",
  "title": "Two Types of $1/f$ Range in Solar Wind Turbulence",
  "abstract": "The $1/f$ noise is a ubiquitous phenomenon in natural systems. Since the advent of space exploration, the $1/f$ range has been consistently observed in \\textit{in situ} solar wind measurements throughout the heliosphere, sparking decades of debate regarding its origin. Recent Parker Solar Probe (PSP) observations near the Alfv\\'en surface have revealed a systematic absence of the $1/f$ range in pristine solar wind, providing a unique opportunity to investigate its origin in solar wind turbulence. Despite numerous observations of the $1/f$ range at varying frequencies, no study has systematically examined its properties across different solar wind conditions. Here, we identify two distinct types of $1/f$ ranges in solar wind turbulence: the fast/Alfv\\'enic wind type and the slow/mixed wind type. The fast/Alfv\\'enic type appears to be an intrinsic feature of Alfv\\'enic turbulence, while the slow/mixed type resembles classical flicker noise. For the fast/Alfv\\'enic type, we find a near-perfect WKB evolution of the frequency-averaged fluctuation amplitude and an intriguing migration pattern in frequency space. For the slow/mixed type, we examine the solar cycle dependence of the $1/f$ noise using the OMNI-LRO dataset spanning solar cycles 22 to 25. We also analyze the autocorrelation function of the magnetic field vectors and identify a clear relationship between the $1/f$ range and the decline in correlation, as well as unexpected resonance peaks in the autocorrelation function.",
  "authors": [
    "Zesen Huang",
    "Marco Velli",
    "B. D. G. Chandran",
    "Chen Shi",
    "Yuliang Ding",
    "Lorenzo Matteini",
    "Kyung-Eun Choi"
  ],
  "published": "2025-06-21T00:21:41Z",
  "updated": "2025-08-08T05:49:30Z",
  "categories": [
    "astro-ph.SR",
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.SR"
}