{
  "arxiv_id": "2508.05727v1",
  "url": "https://arxiv.org/abs/2508.05727v1",
  "pdf_url": "https://arxiv.org/pdf/2508.05727v1.pdf",
  "title": "Transport of Particles in Strongly Turbulent 3D Magnetized Plasmas",
  "abstract": "In this review, we examine particle transport in strongly turbulent three-dimensional (3D) magnetized plasmas, characterized by intense (large-amplitude) magnetic field fluctuations. Such environments naturally give rise to a network of coherent structures (CoSs), including current sheets, filaments, shocks, switchbacks, and significant magnetic perturbations, which critically influence particle dynamics at the kinetic level. Within this turbulent regime, two fundamental particle energization mechanisms emerge, stochastic acceleration and systematic acceleration. Systematic acceleration within open turbulent volumes promotes the development of power-law tails in energy distributions. Our analysis distinguishes the roles of two electric fields: the perpendicular (or convective) fields, which drive stochastic heating via interactions with randomly moving scatterers, and the parallel electric fields, which enable systematic particle acceleration in regions of strong currents. Combined with accurate estimates of particle escape times in finite volumes, the interplay of these mechanisms leads to the formation of Kappa distributions. The transport properties differ significantly between the two energization modes. Stochastic energization follows Gaussian statistics and can be effectively described by the Fokker-Planck equation. In contrast, systematic acceleration exhibits Levy flight statistics, necessitating a fractional transport equation for an accurate description. Furthermore, the fractal spatial distribution of CoSs introduces deviations from traditional transport models, influencing e.g. particle escape times. Systematic acceleration is most efficient during the early, high-energy phases of turbulence, while stochastic heating becomes dominant during the later stages, contributing to gradual particle energization.",
  "authors": [
    "Heinz Isliker",
    "Loukas Vlahos"
  ],
  "published": "2025-08-07T17:09:38Z",
  "updated": "2025-08-07T17:09:38Z",
  "categories": [
    "physics.plasm-ph",
    "astro-ph.HE"
  ],
  "primary_category": "physics.plasm-ph"
}