{
  "arxiv_id": "2508.06282v1",
  "url": "https://arxiv.org/abs/2508.06282v1",
  "pdf_url": "https://arxiv.org/pdf/2508.06282v1.pdf",
  "title": "Studies on the effect of low-fluence proton and neutron irradiation on   n-type LGADs",
  "abstract": "The presented study investigates the effects of low fluences from $5\\times10^{12}$ up to $1\\times10^{14}$ particles/cm$^{2}$ of 60MeV proton and neutron irradiation on n-type Low Gain Avalanche Detectors (nLGADs). An nLGAD is a silicon sensor with a highly doped gain layer that enables controlled charge multiplication via impact ionization. In contrast to the well-established p-type LGADs for high-energy physics (HEP) applications, nLGADs are optimized for the detection of low-penetrating particles such as UV photons and soft X-rays. In addition to studying their potential application in environments with radiation backgrounds, these novel devices also enable the exploration of the underlying phenomenology arising from the combination of n-type bulk material with a gain layer, which degradation was previously studied predominantly in the context of p-type LGADs. The irradiation effects were characterized through measurements of the leakage current and capacitance with increasing bias voltage (I-V and C-V), revealing systematic and fluence-dependent behavior related to space charge sign inversion (SCSI) of the n-type bulk material, which especially alters the electric field in the sensor and thus the depletion behavior. Additionally, annealing studies were performed to assess both beneficial and reverse annealing regimes with isothermal and isochronal annealing. The findings are consistent with previous high-energy proton studies and contribute to a deeper understanding of the fundamental behavior of nLGADs under irradiation.",
  "authors": [
    "Veronika Kraus",
    "Marcos Fernandez Garcia",
    "Salvador Hidalgo",
    "Michael Moll",
    "Jairo Villegas"
  ],
  "published": "2025-08-08T13:03:10Z",
  "updated": "2025-08-08T13:03:10Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}