{
  "arxiv_id": "2508.05730v1",
  "url": "https://arxiv.org/abs/2508.05730v1",
  "pdf_url": "https://arxiv.org/pdf/2508.05730v1.pdf",
  "title": "A response matrix determined with a coincidence-based acquisition for   correction of charge sharing spectral distortions in energy-resolved photon   counting detectors",
  "abstract": "A model-independent method is proposed to characterize and correct charge sharing spectral distortions in energy-resolved X-ray acquisitions with pixellated photon-counting detectors. The technique is based on the determination of a coincidence-based response matrix (CBRM) through a preliminary calibration with a uniform irradiation and an arbitrary polychromatic spectrum. The calibration requires the collection of the number of coincidences between a reference pixel and its neighbours for different combinations of energy bins, in order to calculate a set of charge sharing probabilities which are independent of the input spectrum. A detector response matrix is determined, which can afterwards be applied to correct other spectra acquired with the same detector and a conventional multi-comparator electronics, without introducing penalties in terms of processing time. The technique was validated with Geant4 simulations of a 1 mm thick CdTe detector and with data collected with a pixel hybrid detector made of a 300 um thick silicon sensor coupled to a Timepix4 ASIC chip. The differences between the reconstructed spectra and reference distributions of an ideal detector or a 3x3 offline clustering algorithm were evaluated in terms of mean absolute percentage errors. It is demonstrated that the response matrix can restore the spectral information with a performance close to standard clustering algorithms and is less affected by noise artifacts than analog charge summing techniques.",
  "authors": [
    "Vincenzo Monaco",
    "Luca Brombal",
    "Pasquale Delogu",
    "Alessandro Feruglio",
    "Massimiliano Fiorini",
    "Renata Longo",
    "Luca Marchetti",
    "Anna Maria Poli",
    "Luigi Rigon",
    "Valeria Rosso"
  ],
  "published": "2025-08-07T17:40:15Z",
  "updated": "2025-08-07T17:40:15Z",
  "categories": [
    "physics.ins-det",
    "physics.med-ph"
  ],
  "primary_category": "physics.ins-det"
}