{
  "arxiv_id": "2508.06749v1",
  "url": "https://arxiv.org/abs/2508.06749v1",
  "pdf_url": "https://arxiv.org/pdf/2508.06749v1.pdf",
  "title": "Investigation of Low-Energy Particle Remnants in High-Energy Collisions   at the LHC with a Skipper-CCD detector",
  "abstract": "We deployed MOSKITA $\\sim$33 m away from the CMS collision point, the first skipper-CCD detector probing low-energy particles produced in high-energy collisions at the Large Hadron Collider (LHC). In this work, we search for beam-related events using data collected in 2024 during beam-on and beam-off periods. The dataset corresponds to integrated luminosities of 113.3 fb$^{-1}$ and 1.54 nb$^{-1}$ for the proton-proton and Pb-Pb collision periods, respectively. We report observed event rates in a model-independent framework across two ionization regions: $\\leq20e^-$ and $>20e^-$. For the low-energy region, we perform a likelihood analysis to test the null hypothesis of no beam-correlated signal. We found no significant correlation during proton-proton and Pb-Pb collisions. For the high-energy region, we present the energy spectra for both collision periods and compare event rates for images with and without luminosity. We observe a slight increase in the event rate following the Pb-Pb collisions, coinciding with a rise in the single-electron rate, which will be investigated in future work. Using the low-energy proton-proton results, we place 95% C.L. constraints on the mass-millicharge parameter space of millicharged particles. Overall, the results in this work demonstrate the viability of skipper-CCD technology to explore new physics at high-energy colliders and motivate future searches with more massive detectors.",
  "authors": [
    "Brenda A. Cervantes-Vergara",
    "Santiago E. Perez",
    "Nicola Bacchetta",
    "Nuria Castello-Mor",
    "Juan Estrada",
    "Marcos Fernandez Garcia",
    "Petra Merkel",
    "Maria Perez Martinez",
    "Dario Rodrigues",
    "Javier Tiffenberg",
    "Rocio Vilar Cortabitarte"
  ],
  "published": "2025-08-08T23:24:59Z",
  "updated": "2025-08-08T23:24:59Z",
  "categories": [
    "hep-ex",
    "physics.ins-det"
  ],
  "primary_category": "hep-ex"
}