{
  "arxiv_id": "2509.12945v1",
  "url": "https://arxiv.org/abs/2509.12945v1",
  "pdf_url": "https://arxiv.org/pdf/2509.12945v1.pdf",
  "title": "FusionMAE: large-scale pretrained model to optimize and simplify   diagnostic and control of fusion plasma",
  "abstract": "In magnetically confined fusion device, the complex, multiscale, and nonlinear dynamics of plasmas necessitate the integration of extensive diagnostic systems to effectively monitor and control plasma behaviour. The complexity and uncertainty arising from these extensive systems and their tangled interrelations has long posed a significant obstacle to the acceleration of fusion energy development. In this work, a large-scale model, fusion masked auto-encoder (FusionMAE) is pre-trained to compress the information from 88 diagnostic signals into a concrete embedding, to provide a unified interface between diagnostic systems and control actuators. Two mechanisms are proposed to ensure a meaningful embedding: compression-reduction and missing-signal reconstruction. Upon completion of pre-training, the model acquires the capability for 'virtual backup diagnosis', enabling the inference of missing diagnostic data with 96.7% reliability. Furthermore, the model demonstrates three emergent capabilities: automatic data analysis, universal control-diagnosis interface, and enhancement of control performance on multiple tasks. This work pioneers large-scale AI model integration in fusion energy, demonstrating how pre-trained embeddings can simplify the system interface, reducing necessary diagnostic systems and optimize operation performance for future fusion reactors.",
  "authors": [
    "Zongyu Yang",
    "Zhenghao Yang",
    "Wenjing Tian",
    "Jiyuan Li",
    "Xiang Sun",
    "Guohui Zheng",
    "Songfen Liu",
    "Niannian Wu",
    "Rongpeng Li",
    "Zhaohe Xu",
    "Bo Li",
    "Zhongbing Shi",
    "Zhe Gao",
    "Wei Chen",
    "Xiaoquan Ji",
    "Min Xu",
    "Wulyu Zhong"
  ],
  "published": "2025-09-16T10:50:29Z",
  "updated": "2025-09-16T10:50:29Z",
  "categories": [
    "physics.plasm-ph",
    "cs.AI"
  ],
  "primary_category": "physics.plasm-ph"
}