[
  {
    "arxiv_id": "2509.14214v1",
    "url": "https://arxiv.org/abs/2509.14214v1",
    "pdf_url": "https://arxiv.org/pdf/2509.14214v1.pdf",
    "title": "Time-of-flight Energy Measurements with BPMs",
    "abstract": "The energy of a bunched non-relativistic ion beam can be deduced from measuring the beam phases in neighbouring Beam Position Monitors (BPMs). This report discusses implementation of such a procedure at the PIP-II H- linac being constructed at Fermilab. The case when the flight time between BPMs is longer than the period of BPM frequency is considered in more detail. When absolute BPM phase calibration is not available, the BPM phase information can be used to track deviations of the beam energy from the de-sired value. Such \"energy deviation\" parameter is operationally implemented at the transfer line between 400 MeV Linac and the Booster, and its analog is expected to be used in the transfer line from PIP-II as well.",
    "authors": [
      "A. Shemyakin",
      "J. Kuharik",
      "R. Sharankova"
    ],
    "published": "2025-09-17T17:46:37Z",
    "updated": "2025-09-17T17:46:37Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.08663v3",
    "url": "https://arxiv.org/abs/2507.08663v3",
    "pdf_url": "https://arxiv.org/pdf/2507.08663v3.pdf",
    "title": "A Neutron Sensitive Detector Using 3D-Printed Scintillators",
    "abstract": "This work reports on the performance of a novel neutron-sensitive scintillating detector fabricated using Fused-Deposition Modelling (FDM) additive manufacturing. FDM is a cost-effective 3D-printing method employing flexible plastic filaments to create custom-shaped components. Scintillating filaments, based on polystyrene doped with \\emph{p}-terphenyl and 1,4-bis (5-phenyloxazol-2-yl) benzene, and enriched with $^6$LiF to enable neutron sensitivity were manufactured in house and achieved visible scintillation with a light output of 30$\\pm$5~photons per MeV. Printed scintillators were then integrated into a detector system consisting of an image intensified TimePix3 camera, offering high spatial and temporal resolution. The detector performance was compared with Geant4 simulations of the scintillating sensor's response to electrons, gamma-rays, and thermal neutrons. A novel event discrimination algorithm, using the properties of the TimePix3 camera, enabled the separation of neutron signatures from the gamma-ray background.",
    "authors": [
      "Adam Barr",
      "Cinzia da Vià",
      "Mosst Tasnim Binte Shawkat",
      "Stephen Watts",
      "John Allison",
      "Gabriele D'Amen",
      "Tianqi Gao"
    ],
    "published": "2025-07-11T15:03:12Z",
    "updated": "2025-09-17T15:51:15Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.14045v1",
    "url": "https://arxiv.org/abs/2509.14045v1",
    "pdf_url": "https://arxiv.org/pdf/2509.14045v1.pdf",
    "title": "Thermal Cycling Reliability of Hybrid Pixel Sensor Modules for The ATLAS   High Granularity Timing Detector",
    "abstract": "The reliability of bump connection structures has become a critical aspect of future silicon detectors for particle physics. The High Granularity Timing Detector (HGTD) for the ATLAS experiment at the High-Luminosity Large Hadron Collider will require 8032 hybrid pixel sensor modules, composed of two Low Gain Avalanche Diode sensors bump-bonded to two readout ASICs and glued to a passive PCB. The detector will operate at low temperature (-30 degrees Celsius) to mitigate the impact of irradiation. The thermomechanical reliability of flip-chip bump connections in HGTD modules is a critical concern, particularly due to their characteristically lower bump density (pixel pitch dimensions of 1.3 mm by 1.3 mm). This paper elaborates on the challenges arising from this design characteristic. Finite element analysis and experimental testing were employed to investigate failure modes in the flip-chip bump structures under thermal cycling from -45 degrees Celsius to 40 degrees Celsius and to guide the module redesign. The optimized design demonstrates significantly enhanced robustness and is projected to fulfill the full lifetime requirements of the HGTD.",
    "authors": [
      "Y. Li",
      "A. Aboulhorma",
      "M. Ait Tamlihat",
      "H. M. Alfanda",
      "N. Atanov",
      "O. Atanova",
      "I. Azzouzi",
      "J. Barreiro Guimarães Da Costa",
      "T. Beau",
      "D. Benchekroun",
      "F. Bendebba",
      "Y. Bimgdi",
      "A. Blot",
      "A. Boikov",
      "J. Bonis",
      "D. Boumediene",
      "C. Brito",
      "A. S. Brogna",
      "A. M. Burger",
      "L. Cadamuro",
      "Y. Cai",
      "N. Cartalade",
      "R. Casanova Mohr",
      "Y. Che",
      "X. Chen",
      "R. Cherkaoui El Moursli",
      "E. Y. S. Chow",
      "L. D. Corpe",
      "C. G. Crozatier",
      "L. D'Eramo",
      "S. Dahbi",
      "D. Dannheim",
      "G. Daubard",
      "Y. I. Davydov",
      "C. de La Taille",
      "J. Debevc",
      "Y. Degerli",
      "E. Delagnes",
      "F. Deliot",
      "M. Dhellot",
      "G. Di Gregorio",
      "P. Dinaucourt",
      "P. J. Dos Santos De Assis",
      "C. Duan",
      "O. Duarte",
      "F. Dulucq",
      "J. Ehrecke",
      "Y. El Ghazali",
      "A. El Moussaouy",
      "R. Estevam",
      "A. Falou",
      "L. Fan",
      "Z. Fan",
      "Y. Fan",
      "K. Farman",
      "F. Fassi",
      "Y. Feng",
      "M. Ferreira",
      "F. Filthaut",
      "F. Fischer",
      "J. Fu",
      "P. Fusté",
      "G. Gaspar De Andrade",
      "Z. Ge",
      "R. Gonçalo",
      "M. Gouighri",
      "S. Grinstein",
      "K. Gritsay",
      "F. Guilloux",
      "S. Guindon",
      "A. Haddad",
      "S. E. D. Hammoud",
      "L. Han",
      "A. M. Henriques Correia",
      "M. Hidaoui",
      "B. Hiti",
      "J. Hofner",
      "S. Hou",
      "P. J. Hsu",
      "K. Hu",
      "Y. Huang",
      "X. Huang",
      "C. Insa",
      "J. Jeglot",
      "X. Jia",
      "G. Kramberger",
      "M. Kuriyama",
      "B. Y. Ky",
      "D. Lacour",
      "A. Lafarge",
      "B. Lakssir",
      "A. Lantheaume",
      "D. Laporte",
      "A. Leopold",
      "M. Li",
      "S. Li",
      "L. Li",
      "S. Li",
      "H. Li",
      "Z. Li",
      "Z. Liang",
      "S. Liang",
      "M. A. Lisboa Leite",
      "B. Liu",
      "Y. L. Liu",
      "K. Liu",
      "K. Liu",
      "Y. W. Liu",
      "M. Lu",
      "Y. J. Lu",
      "F. L. Lucio Alves",
      "F. Lyu",
      "X. Ma",
      "K. Ma",
      "D. Macina",
      "R. Madar",
      "N. Makovec",
      "S. Malyukov",
      "I. Mandić",
      "T. Manoussos",
      "S. Manzoni",
      "G. Martin-Chassard",
      "F. Martins",
      "L. Masetti",
      "R. Mazini",
      "E. Mazzeo",
      "R. Menegasso",
      "J. -P. Meyer",
      "Y. Miao",
      "A. Migayron",
      "M. Mihovilovic",
      "M. Milovanovic",
      "M. Missio",
      "V. Moskalenko",
      "N. Mouadili",
      "A. Moussa",
      "I. Nikolic-Audit",
      "C. C. Ohm",
      "H. Okawa",
      "S. Okkerman",
      "M. Ouchrif",
      "C. Pénélaud",
      "A. Parreira",
      "B. Pascual Dias",
      "J. Pinol Bel",
      "P. -O. Puhl",
      "M. Puklavec",
      "M. Qi",
      "J. Qin",
      "H. Ren",
      "H. Riani",
      "S. Ridaouni",
      "V. Rogozin",
      "L. Royer",
      "F. Rudnyckyj",
      "E. F. Saad",
      "G. T. Saito",
      "A. Salem",
      "H. Santos",
      "Ph. Schwemling",
      "N. Seguin-Moreau",
      "L. Serin",
      "R. P. Serrano Fernandez",
      "Q. Sha",
      "A. Shaikovskii",
      "L. Shan",
      "R. Shen",
      "X. Shi",
      "P. Skomina",
      "H. Smitmanns",
      "H. L. Snoek",
      "A. P. Soulier",
      "A. Stein",
      "H. Stenzel",
      "J. Strandberg",
      "W. Sun",
      "X. Sun",
      "Y. Sun",
      "Y. Tan",
      "K. Tariq",
      "Y. Tayalati",
      "S. Terzo",
      "A. Torrento Coello",
      "S. Trincaz-Duvoid",
      "U. M. Vande Voorde",
      "I. Velkovska",
      "R. P. Vieira",
      "L. A. Vieira Lopes",
      "A. Visibile",
      "J. Wan",
      "W. Wang",
      "C. Wang",
      "Y. Wang",
      "Y. Wang",
      "A. Wang",
      "T. Wang",
      "T. Wang",
      "S. M. Wang",
      "Q. Weitzel",
      "J. Wu",
      "W. Wu",
      "Y. Wu",
      "M. Wu",
      "L. Xia",
      "H. Xu",
      "D. Xu",
      "L. Xu",
      "Z. Yan",
      "X. Yang",
      "X. Yang",
      "H. Yang",
      "H. Yang",
      "J. Ye",
      "I. Youbi",
      "J. Yuan",
      "I. Zahir",
      "H. Zeng",
      "T. Zhang",
      "J. Zhang",
      "Z. Zhang",
      "L. Zhang",
      "D. Zhang",
      "M. Zhao",
      "Z. Zhao",
      "X. Zheng",
      "Z. Zhou",
      "Y. Zhu",
      "X. Zhuang"
    ],
    "published": "2025-09-17T14:50:50Z",
    "updated": "2025-09-17T14:50:50Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.13937v1",
    "url": "https://arxiv.org/abs/2509.13937v1",
    "pdf_url": "https://arxiv.org/pdf/2509.13937v1.pdf",
    "title": "Generating 10 GW-class isolated zeptosecond x-ray bursts through   bootstrapping two plasma-based accelerator stages",
    "abstract": "A method is proposed to generate coherent, intense zeptosecond x-ray pulses by using the electron beam produced by a laser wakefield accelerator (LWFA) stage as the driver for a beam driven plasma wakefield accelerator (PWFA) stage. The LWFA injector stage requires a readily available 100 TW laser driver to produce a GeV class self-injected electron beam. This beam is focused and used as the driver in a PWFA stage that utilizes a solid-density plasma with a modulated density downramp. The concept is shown to be capable of producing an ultra-short electron beam with unprecedented density ($10^{26}~\\mathrm{cm^{-3}}$) and brightness ($ 10^{24}~\\ampere/\\meter^2/\\radian ^2$), that is also pre-bunched on 0.1 Angstrom scales. By colliding this pre-bunched extreme beam with an optical undulator, an intense zeptosecond pulse can be emitted if the spatially focusing region is matched with the lasing region of the beam. Multi-dimensional particle-in-cell simulations are performed of the entire concept to demonstrate that an isolated 10 GW-class zeptosecond pulse with a full-width-half-maximum duration of 700 zs can be generated in a tapered laser pulse. Such an intense zeptosecond pulse generation scheme may provide an essential probe for nuclear physics and quantum electrodynamics processes.",
    "authors": [
      "Qianyi Ma",
      "Yuhui Xia",
      "Zhenan Wang",
      "Yuekai Chen",
      "Letian Liu",
      "Zhiyan Yang",
      "Chao Feng",
      "Xinlu Xu",
      "Xueqing Yan",
      "Chan Joshi",
      "Warren B. Mori"
    ],
    "published": "2025-09-17T13:06:25Z",
    "updated": "2025-09-17T13:06:25Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2506.02832v2",
    "url": "https://arxiv.org/abs/2506.02832v2",
    "pdf_url": "https://arxiv.org/pdf/2506.02832v2.pdf",
    "title": "Testing strong-field QED with the avalanche precursor",
    "abstract": "A two-beam high-power laser facility is essential for the study of one of the most captivating phenomena predicted by strong-field quantum electrodynamics (QED) and yet unobserved experimentally: the avalanche-type cascade. In such a cascade, the energy of intense laser light can be efficiently transformed into high-energy radiation and electron-positron pairs. The future 50-petawatt-scale laser facility NSF OPAL will provide unique opportunities for studying such strong-field QED effects, as it is designed to deliver two ultra-intense, tightly focused laser pulses onto the interaction point. In this work, we investigate the potential of such a facility for studying elementary particle and plasma dynamics deeply in the quantum radiation-dominated regime, and the generation of QED avalanches. With 3D particle-in-cell simulations, we demonstrate that QED avalanche precursors can be reliably triggered under realistic laser parameters and layout (namely, focusing $f/2$, tilted optical axes, and non-ideal co-pointing) with the anticipated capabilities of NSF OPAL. We demonstrate that seed electrons can be efficiently injected into the laser focus by using targets of three types: a gas of heavy atoms, an overcritical plasma, and a thin foil. A strong positron and high-energy photon signal is generated in all cases. The cascade properties can be identified from the final particle distributions, which have a clear directional pattern. At increasing laser field intensity, such distributions provide signatures of the transition, first, to the radiation-dominated interaction regime, and then to a QED avalanche. Our findings can also be used for designing related future experiments.",
    "authors": [
      "A. A. Mironov",
      "S. S. Bulanov",
      "A. Di Piazza",
      "M. Grech",
      "L. Lancia",
      "S. Meuren",
      "J. Palastro",
      "C. Riconda",
      "H. G. Rinderknecht",
      "P. Tzeferacos",
      "G. Gregori"
    ],
    "published": "2025-06-03T13:00:14Z",
    "updated": "2025-09-17T13:01:09Z",
    "categories": [
      "physics.plasm-ph",
      "hep-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1063/5.0283438"
  },
  {
    "arxiv_id": "2412.19859v2",
    "url": "https://arxiv.org/abs/2412.19859v2",
    "pdf_url": "https://arxiv.org/pdf/2412.19859v2.pdf",
    "title": "Statistical research on determining sensitivity of neutrinoless double   beta decays",
    "abstract": "The determination of experimental sensitivity is a key step in the search for neutrinoless double beta decay ($0\\nu\\beta\\beta$), providing a quantitative benchmark for detector design. Two commonly used statistical approaches are the counting method, which estimates sensitivity from the number of events in a predefined region of interest (RoI), and the fitting method, which extracts the signal contribution by fitting the full energy spectrum. In this work, we investigate both discovery sensitivity and exclusion sensitivity within these two approaches. Through statistical derivation and simulation verification, we show that the relative performance of the methods depends on both energy resolution and exposure, while at higher exposures the fitting method consistently yields more stringent sensitivity. These results provide guidance for selecting the optimal statistical method in future $0\\nu\\beta\\beta$ experiments.",
    "authors": [
      "Haoyang Fu",
      "Wentai Luo",
      "Xiangpan Ji",
      "Shaomin Chen"
    ],
    "published": "2024-12-26T03:45:15Z",
    "updated": "2025-09-17T09:27:22Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.13847v1",
    "url": "https://arxiv.org/abs/2509.13847v1",
    "pdf_url": "https://arxiv.org/pdf/2509.13847v1.pdf",
    "title": "Measurement of radiant spectrum for excess heat generation in NiCu and   Ni thin film during hydrogen gas desorption",
    "abstract": "Heat production in Ni-based thin films interacting with hydrogen gas was studied using a radiation calorimeter equipped with a composite photon-detector system. Measurements were performed on pure Ni foil and NiCu composite thin films. Electromagnetic radiation emitted from samples heated to approximately 1100 K in vacuum was recorded over the energy range of 0.05 - 2.5 eV. In this study,detailed spectra were obtained, particularly in the low-energy region below 0.5 eV. The peak of the thermal radiation spectrum was observed around 0.2 eV, deviating from that expected for simple graybody radiation. Spectral variations depending on the presence or absence of hydrogen differed between the NiCu and pure Ni samples. The total radiated energy was determined directly from the measured radiation power, without relying on radiation models. The excess heat generated in the NiCu sample was estimated to be approximately 1.1 W. A comparable but slightly smaller excess heat generation was also observed in Ni. Long-term measurements of the NiCu sample demonstrated sustained excess heat production for at least 215 hours, with a decay time exceeding 2000 hours.",
    "authors": [
      "J. Kasagi",
      "T. Itoh",
      "Y. Shibasaki",
      "Y. Iwamura"
    ],
    "published": "2025-09-17T09:24:15Z",
    "updated": "2025-09-17T09:24:15Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.13831v1",
    "url": "https://arxiv.org/abs/2509.13831v1",
    "pdf_url": "https://arxiv.org/pdf/2509.13831v1.pdf",
    "title": "Signal Processing and Machine Learning Algorithms for Precise Timing   with PICOSEC Micromegas Detectors",
    "abstract": "High particle rates in current and future experiments make pile-up phenomena a critical issue for extracting useful information. In this context, timing can be important as the 4$^{\\mathrm{th}}$ dimension parameter for triggering or event reconstruction. The PICOSEC-Micromegas detector has been shown to offer precise timing of the order of tens of\\,ps. In this work, novel signal processing algorithms are being developed and evaluated to demonstrate the technology's ability for online precise timing. We propose, an algorithm based on Artificial Neural Networks (ANN). This algorithm uses a model to train the ANN. The performance of the different algorithms is evaluated using experimental data, resulting in a timing resolution of 18.3 $\\pm$ 0.6\\,ps, comparable to the standard analysis based on the Constant Fraction Discrimination technique. Additionally, an alternative algorithm using the charge of the pulse exceeding a threshold as a parameter to correct for systematic effects is reported.",
    "authors": [
      "A. Kallitsopoulou",
      "I. Maniatis",
      "I. Manthos",
      "T. Papaevangelou",
      "L. Sohl",
      "A. Tsiamis",
      "S. E. Tzamarias"
    ],
    "published": "2025-09-17T08:56:21Z",
    "updated": "2025-09-17T08:56:21Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.15605v2",
    "url": "https://arxiv.org/abs/2508.15605v2",
    "pdf_url": "https://arxiv.org/pdf/2508.15605v2.pdf",
    "title": "Monochromatic Cherenkov diffraction radiation from continuous coupling   of an electron beam to a thin dielectric slab waveguide",
    "abstract": "A scheme for generation of monochromatic Cherenkov radiation in a thin dielectric layer is proposed. The electrons travel in vacuum parallel to a dielectric, exciting a single synchronous electromagnetic waveguide mode. The proposed scheme is studied quantitatively for near-infrared radiation in silicon induced by a 100-keV electron beam, using time-domain and frequency-domain numerical simulations, with material absorption and dispersion taken into account. This method of radiation generation can be scaled from ultraviolet to terahertz radiation by changing the thickness of the dielectric layer and choosing a material with low loss at the desired wavelength. Comparison with conventional Cherenkov Radiation and Cherenkov Diffraction Radiation is also presented.",
    "authors": [
      "Andrzej Szczepkowicz",
      "Po-Wei Kuo",
      "Yen-Cheh Huang"
    ],
    "published": "2025-08-21T14:30:16Z",
    "updated": "2025-09-17T08:54:44Z",
    "categories": [
      "physics.optics",
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2509.13668v1",
    "url": "https://arxiv.org/abs/2509.13668v1",
    "pdf_url": "https://arxiv.org/pdf/2509.13668v1.pdf",
    "title": "Phase Transition Dynamics Induced by Strong Radio-Frequency Fields in   ReBCO High Temperature Superconductors",
    "abstract": "Probing the dynamics of superconductor phase transitions induced by strong electromagnetic fields is vital to designing high power devices leveraging these materials. The development of high temperature superconductors (HTS) is particularly interesting due to critical temperatures ($T_c$) approaching 90 K, the ability to support high current densities, and their ability to operate in strong static magnetic fields. This work aims to determine the transition dynamics of these materials at radio-frequencies (rf) in the microwave range where they have enormous potential for new applications ranging from particle accelerators to dark matter searches. We have tested two types of coatings formed from rare earth barium copper oxide (REBCO): a film deposited by electron-beam physical vapor deposition, and HTS conductor tapes soldered to a copper substrate with exposed REBCO surfaces. Testing was performed via a hemispherical transverse-electric mode cavity that maximizes the surface rf magnetic field and minimizes the surface electric field on a 2-inch diameter sample. We report on steady-state measurements at low rf power, as well as fully time-resolved transition dynamics on the microsecond timescale seen for the first time with strong surface rf fields.",
    "authors": [
      "Ankur Dhar",
      "Mitchell E. Schneider",
      "Emilio A. Nanni",
      "Jessica Golm",
      "Patrick Krkotić",
      "Walter Wuensch",
      "Sergio Calatroni",
      "Neil Lamas",
      "Teresa Puig",
      "Joffre Gutierrez"
    ],
    "published": "2025-09-17T03:42:51Z",
    "updated": "2025-09-17T03:42:51Z",
    "categories": [
      "physics.acc-ph",
      "cond-mat.supr-con"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.07500v2",
    "url": "https://arxiv.org/abs/2508.07500v2",
    "pdf_url": "https://arxiv.org/pdf/2508.07500v2.pdf",
    "title": "Ionization rate vs. laser intensity determined from ion count vs. peak   intensity due to neutral gas exposure to an 800 nm ultrashort pulsed laser",
    "abstract": "The optical cycle-averaged ionization rate of Ar, O$_{2}$, and N$_{2}$ vs. local instantaneous laser intensity $I$ for linear polarized $800$ nm light is determined up to approx. $300$ TW/cm$^{2}$ by numerically inverting published time-of-flight ion spectrometer data. The published Ar$^{+}$ collection efficiency of the microchannel plate (MCP) at the end of the spectrometer and its $I_{0}$ scale are recalibrated by fitting it to its high $I_{0}$ solution. The relative collection efficiencies of the other species are determined by published MCP cathode data. Results for O$_2$ are consistent with a reevaluation of published data used to determine its cross section $\\sigma_8$ in the multiphoton (low $I$) regime.",
    "authors": [
      "Edward L. Ruden"
    ],
    "published": "2025-08-10T22:26:18Z",
    "updated": "2025-09-17T00:39:43Z",
    "categories": [
      "physics.atom-ph",
      "physics.optics",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2505.14706v3",
    "url": "https://arxiv.org/abs/2505.14706v3",
    "pdf_url": "https://arxiv.org/pdf/2505.14706v3.pdf",
    "title": "Particle identification in the GlueX detector with machine learning",
    "abstract": "In particle physics experiments, identifying the types of particles registered in a detector is essential for the accurate reconstruction of particle collisions. At Thomas Jefferson National Accelerator Facility (Jefferson Lab), the GlueX experiment performs particle identification (PID) by setting specific thresholds, known as cuts, on the kinematic properties of tracks and showers obtained from detector hits. Our research aims to enhance this cut-based method by employing machine-learning algorithms based on multi-layer perceptrons and boosted decision trees. Similar approaches have been applied in other particle physics experiments and offer an opportunity to increase PID accuracies using reconstructed kinematic data. Our study illustrates that both multilayered perceptrons and boosted decision trees can identify charged and neutral particles in Monte Carlo simulated GlueX data with significantly improved accuracy over the current cuts-based PID method.",
    "authors": [
      "Eric Habjan",
      "Richard Dube",
      "James McIntyre",
      "Mezmur Edo",
      "Richard Jones"
    ],
    "published": "2025-05-16T12:23:47Z",
    "updated": "2025-09-17T00:23:44Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex",
      "physics.data-an"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.13555v1",
    "url": "https://arxiv.org/abs/2509.13555v1",
    "pdf_url": "https://arxiv.org/pdf/2509.13555v1.pdf",
    "title": "A Computational Picture of Hydride Formation and Dissipation In Nb SRF   Cavities",
    "abstract": "Research linking surface hydrides to Q-disease, and the subsequent development of methods to eliminate surface hydrides, is one of the great successes of SRF cavity R&D. We use time-dependent Ginzburg-Landau to extend the theory of hydride dissipation to sub-surface hydrides. Just as surface hydrides cause Q-disease behavior, we show that sub-surface hydrides cause high-field Q-slope (HFQS) behavior. We find that the abrupt onset of HFQS is due to a transition from a vortex-free state to a vortex-penetration state. We show that controlling hydride size and depth through impurity doping can eliminate HFQS.",
    "authors": [
      "Aiden Harbick",
      "Mark Transtrum",
      "Nathan Sitaraman",
      "Tomás Arias",
      "Matthias Liepe"
    ],
    "published": "2025-09-16T21:43:49Z",
    "updated": "2025-09-16T21:43:49Z",
    "categories": [
      "cond-mat.supr-con",
      "physics.acc-ph"
    ],
    "primary_category": "cond-mat.supr-con"
  },
  {
    "arxiv_id": "2509.13526v1",
    "url": "https://arxiv.org/abs/2509.13526v1",
    "pdf_url": "https://arxiv.org/pdf/2509.13526v1.pdf",
    "title": "Measuring Orbit Responses with Oscillating Trajectories in the Fermilab   Linac",
    "abstract": "Recording changes in beam transverse positions re-ported by Beam Position Monitors (BPMs) in response to a beam deflection by an upstream dipole corrector (orbit response) is a powerful tool for analysis of accelerator optics and assisting with machine tuning. In the Fermilab Linac, orbit responses are recorded by oscillating the currents of up to 19 correctors, providing faster, drift-resistant measurements through frequency-domain analysis. This report describes the technique, including error estimations and consistency checks and shows an example of the measurements.",
    "authors": [
      "A. Shemyakin",
      "A. Pathak",
      "R. Sharankova"
    ],
    "published": "2025-09-16T20:40:28Z",
    "updated": "2025-09-16T20:40:28Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.13503v1",
    "url": "https://arxiv.org/abs/2509.13503v1",
    "pdf_url": "https://arxiv.org/pdf/2509.13503v1.pdf",
    "title": "Frequency stability of $2.5\\times10^{-17}$ in a Si cavity with AlGaAs   crystalline mirrors",
    "abstract": "Developments in ultrastable lasers have fueled remarkable advances in optical frequency metrology and quantum science. A key ingredient in further improving laser frequency stability is the use of low-noise mirror materials such as AlGaAs crystalline coatings. However, excess noise observed with these coatings limits the performance of cryogenic silicon cavities with AlGaAs mirrors to similar levels achieved with conventional dielectric coatings. With a new pair of crystalline coated mirrors in a 6-cm-long cryogenic silicon cavity operated at 17 K, we demonstrate a clear advantage of crystalline coatings over dielectric coatings. The achieved fractional frequency stability of $2.5 \\times 10^{-17}$ at 10 s is four times better than expected for dielectric mirrors and corresponds to more than tenfold reduction in the coating mechanical loss factor. We also combine two silicon cavities to demonstrate optical frequency averaging for enhanced stability. In addition, we present a long-term frequency drift record of four cryogenic silicon cavities measured over several years. These results open up realistic prospects for cavity-stabilized lasers with $10^{-18}$ fractional stability, as well as an all-optical timescale with continuously operating optical local oscillators.",
    "authors": [
      "Dahyeon Lee",
      "Zoey Z. Hu",
      "Ben Lewis",
      "Alexander Aeppli",
      "Kyungtae Kim",
      "Zhibin Yao",
      "Thomas Legero",
      "Daniele Nicolodi",
      "Fritz Riehle",
      "Uwe Sterr",
      "Jun Ye"
    ],
    "published": "2025-09-16T20:06:01Z",
    "updated": "2025-09-16T20:06:01Z",
    "categories": [
      "physics.optics",
      "physics.atom-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2503.13697v2",
    "url": "https://arxiv.org/abs/2503.13697v2",
    "pdf_url": "https://arxiv.org/pdf/2503.13697v2.pdf",
    "title": "Grid instability growth rates for explicit, electrostatic momentum- and   energy-conserving particle-in-cell algorithms",
    "abstract": "When the Debye length is not resolved in a simulation using the most common particle-in-cell (PIC) algorithm, the plasma will unphysically heat until the Debye length becomes resolved via a phenomenon known as grid heating. This article presents detailed numerical measurements of grid heating for several explicit PIC algorithms including the first systematic (covering the Debye length resolution and drift-velocity parameter space) study of grid-heating growth rates for the most-common electrostatic momentum-conserving PIC algorithm. Additionally, we derive and test a cubic-spline-based PIC algorithm that ensures that the interpolated electric field has a continuous first derivative, but find that a differentiable electric field has minimal impact on grid-heating stability. Also considered are energy-conserving PIC algorithms with linear and quadratic interpolation functions. In all cases, we find that unphysical heating can occur for some combinations of Debye under-resolution and plasma drift. We demonstrate analytically and numerically that grid heating cannot be eliminated by using a higher-order field solve, and give an analytical expression for the cold-beam stability limits of some energy-conserving algorithms.",
    "authors": [
      "Luke C Adams",
      "Gregory R Werner",
      "John R Cary"
    ],
    "published": "2025-03-17T20:13:12Z",
    "updated": "2025-09-16T19:52:01Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1063/5.0271598"
  },
  {
    "arxiv_id": "2509.13494v1",
    "url": "https://arxiv.org/abs/2509.13494v1",
    "pdf_url": "https://arxiv.org/pdf/2509.13494v1.pdf",
    "title": "Optics Reconstruction in the SCL Section of the FNAL Linac",
    "abstract": "The Side-Coupled Linac (SCL) section of the FNAL linac accelerates the beam from 117 MeV to 401.5 MeV, operating at 22-24 mA beam current. Transverse focusing is performed by 32 quadrupoles, and the beam orbit is guided by 19 dipole correctors and measured by 29 BPMs. The bunch length is measured in a single location by a Bunch Shape Monitor (BSM). This paper presents a three-step reconstruction of the machine optics. First, the transverse and longitudinal Twiss parameters at the start of the SCL section are determined using quadrupole scans and BSM measurements at different settings of an upstream cavity. Second, the quadrupole calibrations are adjusted based on differential-trajectory measurements. Finally, the beam is propagated along the SCL linac using the code TraceWin. A comparison between TraceWin simulations and the beam envelope measured by the 12 wire scanners of the SCL linac was performed. Transverse and longitudinal beam parameters at the entrance of the transition section will be reported.",
    "authors": [
      "J. -P. Carneiro",
      "E. Chen",
      "A. Pathak",
      "R. Sharankova",
      "A. Shemyakin"
    ],
    "published": "2025-09-16T19:51:55Z",
    "updated": "2025-09-16T19:51:55Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.13486v1",
    "url": "https://arxiv.org/abs/2509.13486v1",
    "pdf_url": "https://arxiv.org/pdf/2509.13486v1.pdf",
    "title": "A $^{3}$He-$^{21}$Ne Ramsey Comagnetometer with sub-nHz frequency   resolution",
    "abstract": "Nuclear spin comagnetometers offer exceptional precision in measurements of spin energy levels and exhibit long-term stability, making them powerful tools for probing spin-dependent physics beyond the Standard Model as well as for inertial rotation sensing. We describe a new $^{3}$He-$^{21}$Ne Ramsey comagnetometer operating with an in-situ $^{87}$Rb magnetometer for initialization and sensing of nuclear spins. During free precession of nuclear spins we turn off all lasers and introduce a microwave field to suppress back-action from Rb atoms. We demonstrate that scalar and dipolar interactions between nuclear spins can be eliminated via control of the polarized sample geometry. These improvements result in a bias-free measurement with a frequency sensitivity of 0.6 nHz after 6 hours of integration.",
    "authors": [
      "Shaobo Zhang",
      "Jingyao Wang",
      "George Sun",
      "Johannes J. van de Wetering",
      "Michael V. Romalis"
    ],
    "published": "2025-09-16T19:39:52Z",
    "updated": "2025-09-16T19:39:52Z",
    "categories": [
      "physics.atom-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2509.13478v1",
    "url": "https://arxiv.org/abs/2509.13478v1",
    "pdf_url": "https://arxiv.org/pdf/2509.13478v1.pdf",
    "title": "Measurements of the Beam Longitudinal Properties in the Fermilab Linac",
    "abstract": "The Fermilab Linac delivers 400MeV, 25mA H$^-$; beam. The longitudinal bunch parameters are reconstructed using a Bunch Shape Monitor (BSM) installed in the middle of the Linac. For that, the bunch length is measured as a function of the phase of an upstream cavity and fitted to simulations. The cavity gradient and its phase with respect to the beam are recovered from readings of Beam Position Monitors (BPMs). Since the cavity provides a significant transverse defocusing, the BSM measurements are correlated with transverse beam size measurements by a wire scanner (WS). Simulations connect these three types of measurements, allowing to deduce the longitudinal emittance and Courant-Snyder parameters.",
    "authors": [
      "R. Sharankova",
      "J-P. Carneiro",
      "E. Chen",
      "A. Shemyakin"
    ],
    "published": "2025-09-16T19:23:03Z",
    "updated": "2025-09-16T19:23:03Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.13472v1",
    "url": "https://arxiv.org/abs/2509.13472v1",
    "pdf_url": "https://arxiv.org/pdf/2509.13472v1.pdf",
    "title": "The effect of parameter drift in the transport of magnetized plasma   particles",
    "abstract": "We investigate how time dependent modulations of drift wave amplitudes affect particle transport and chaos in a magnetized plasma. Using the Horton model, we apply a sawtooth ramp to a primary wave's amplitude and periodic rectangular kicks to secondary waves, simulating a driven system. Particle transport is quantified by the Mean Square Displacement (MSD) exponent, $\\alpha$, and chaos by the Maximum Lyapunov Exponent (MLE). Our primary finding is a strong negative correlation between the system's average chaoticity and its transport efficiency. We show that rapid sawtooth ramping (short period $\\tau$) produces highly efficient, superdiffusive transport ($\\alpha > 1$). In contrast, slower ramping increases the system's chaos but suppresses transport, driving it towards normal diffusion ($\\alpha \\to 1$). This counter intuitive result demonstrates that heightened chaos destroys the coherent, streamer like structures necessary for superdiffusive flights. Our findings indicate that the coherence of the turbulent field, rather than its raw chaoticity, is the key determinant of transport efficiency, offering a new perspective on plasma control.",
    "authors": [
      "P. Haerter",
      "R. L. Viana"
    ],
    "published": "2025-09-16T19:15:07Z",
    "updated": "2025-09-16T19:15:07Z",
    "categories": [
      "nlin.CD",
      "physics.plasm-ph"
    ],
    "primary_category": "nlin.CD"
  },
  {
    "arxiv_id": "2509.13467v1",
    "url": "https://arxiv.org/abs/2509.13467v1",
    "pdf_url": "https://arxiv.org/pdf/2509.13467v1.pdf",
    "title": "Broadband Single-Shot THz Sampling Using Reflection Gratings",
    "abstract": "Single-shot electro-optic sampling (EOS) is a powerful method enabling the measurement of weak terahertz signals that would otherwise require prohibitively long acquisition times. This is generally achieved by encoding the EOS time delay into a spatial, angular, or frequency coordinate. In general, this technique operates well up to 3 THz but becomes more challenging for larger bandwidths, due to dispersion and imaging imperfections. Here, we demonstrate a reliable angular-encoding single shot EOS implementation that reaches frequencies beyond 6 THz. Diffraction simulations are used to design the experimental setup and adapt this technique to commercial reflection gratings, removing the need for custom-built echelon mirrors. Furthermore, we show that, contrary to earlier reports, group delay dispersion from angular dispersion does not reduce the bandwidth of single-shot EOS.",
    "authors": [
      "Chih-Chieh Wu",
      "Michele Buzzi",
      "Andrea Cavalleri"
    ],
    "published": "2025-09-16T19:09:52Z",
    "updated": "2025-09-16T19:09:52Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2509.13465v1",
    "url": "https://arxiv.org/abs/2509.13465v1",
    "pdf_url": "https://arxiv.org/pdf/2509.13465v1.pdf",
    "title": "Magnetic measurements of Fermilab rapid-cycling Booster gradient magnets",
    "abstract": "Fermilab is upgrading its Booster synchrotron to increase ramp rate and intensity. This is part of the Proton Improvement Plan (PIP-II) that will allow the Main Injector to achieve proton beam power of 1.2 MW within the next few years. This upgrade includes running the 55-year-old Booster magnets at 20 Hz instead of the usual 15 Hz, and construction of some shorter and wider aperture versions of these combined-function gradient magnets. Magnetic measurements were performed to characterize the present 15 Hz AC performance, and then again with 20 Hz ramp cycle to ensure performance and compatibility in this new operating regime. A 3 m-long curved flat-coil was developed for these measurements using Printed Circuit Board (PCB) technology. The probe also has a separate 0.5 m-long body-field probe, allowing integral, body, and end fields to be measured across 100 mm of the magnet aperture. The sampling rate for these measurements during the AC cycle was 200 kHz, and field resolution was better than 0.01%. Details of the probe, measurements, and results are presented.",
    "authors": [
      "J. DiMarco",
      "D. Assell",
      "T. Cummings",
      "D. Johnson",
      "V. Kashikhin",
      "M. Kifarkis",
      "J. Kuharik",
      "J. Larson",
      "M. Mubarak",
      "S. Poopathi",
      "K. Triplett"
    ],
    "published": "2025-09-16T19:02:54Z",
    "updated": "2025-09-16T19:02:54Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.07086v3",
    "url": "https://arxiv.org/abs/2507.07086v3",
    "pdf_url": "https://arxiv.org/pdf/2507.07086v3.pdf",
    "title": "Lifetime study of the ColdADC for the Deep Underground Neutrino   Experiment",
    "abstract": "ColdADC is a custom ASIC digitizer implemented in 65 nm CMOS technology using specialized techniques for long-term reliability in cryogenic environments. ColdADC was developed for use in the DUNE Far Detector complex, which will consist of four liquid argon time projection chambers. Each contains 17 kilotons liquid argon as the target material in order to measure neutrino oscillations. Approximately 40,000 ColdADC ASICs will be installed for DUNE in the first two large detectors and will be operated at cryogenic temperatures during the experiment without replacement. The lifetime of the ColdADC is a critical parameter affecting the data quality and physics sensitivity of the experiment. A measurement of the lifetime of the ColdADC was carried out, and the results shown in this paper assure orders of magnitude longer lifetime of the ColdADC than the planned operation time of the detectors.",
    "authors": [
      "Wenjie Wu",
      "Benjamin Jargowsky",
      "Yiwen Xiao",
      "Alejandro Yankelevich",
      "Jianming Bian",
      "Cheng-Ju Lin",
      "Tarun Prakash",
      "David Christian"
    ],
    "published": "2025-07-09T17:47:21Z",
    "updated": "2025-09-16T18:56:07Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.13460v1",
    "url": "https://arxiv.org/abs/2509.13460v1",
    "pdf_url": "https://arxiv.org/pdf/2509.13460v1.pdf",
    "title": "Initialization-robust characterization of deep sub-electron read noise   pixels via annealed PCH-EM",
    "abstract": "We present an annealed Photon Counting Histogram Expectation Maximization (PCH-EM) algorithm for maximum likelihood characterization of Deep Sub-Electron Read Noise (DSERN) pixels. The annealed variant mitigates initialization-dependent convergence to suboptimal local optima of the likelihood function while achieving uncertainties substantially lower than the Photon Transfer (PT) method in the DSERN regime. Although the annealing principle is optimizer-agnostic, we pair it with PCH-EM for tractability; a single temperature parameter and simple cooling schedule suffice, without re-deriving the original EM update equations. Simulations across varied starting points show more stable parameter estimates with equal or better final likelihoods than the baseline. While designed for DSERN, the method applies across read-noise regimes and matches PT performance outside DSERN. Practically, the method enables reliable characterization of DSERN devices, including direct calibration from raw gray counts to electron counts for photon number resolving applications.",
    "authors": [
      "Aaron J. Hendrickson",
      "David P. Haefner"
    ],
    "published": "2025-09-16T18:52:13Z",
    "updated": "2025-09-16T18:52:13Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.13455v1",
    "url": "https://arxiv.org/abs/2509.13455v1",
    "pdf_url": "https://arxiv.org/pdf/2509.13455v1.pdf",
    "title": "Oakridge PPU Magnets: Results and Measurements",
    "abstract": "The Spallation Neutron Source (SNS) at Oak Ridge National Laboratory (ORNL) is being upgraded from 1.0 GeV to 1.3 GeV (or 1.4 to 2.8 MW). Several water-cooled magnets have been upgraded to transport 30% higher beam energy. Fermilab contributed the magnet design for the new chicane magnets and injection/extraction septum. Designing the magnets was a challenging task because the new magnets required good combined integrated field quality and needed to occupy the old magnets space but with about 20% greater integrated magnetic field. Additional strong requirements applied to the magnets fringe field so as not to disturb the circulating beam. After fabrication of the magnets, an extensive measurement campaign was developed and performed at Fermilab's Magnet Test Facility. The measurements needed to assess magnet performance and provide comparison to design calculations. These included verification of field strength and harmonics along an 8 m length and 200 mm good field diameter for the chicane dipoles, end-field Hall probe mapping of these magnets, and measurements along two differently curved trajectories within the ~3 m septum gradient magnet. Details of the measurements and systems are presented along with results and comparison to field models.",
    "authors": [
      "J. DiMarco",
      "D. Harding",
      "V. Kashikhin",
      "O. Kiemschies",
      "M. Kifarkis",
      "A. Makulski",
      "J. Nogiec",
      "S. Stoynev",
      "T. Strauss",
      "M. Tartaglia",
      "P. Thompson"
    ],
    "published": "2025-09-16T18:40:24Z",
    "updated": "2025-09-16T18:40:24Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.13272v1",
    "url": "https://arxiv.org/abs/2509.13272v1",
    "pdf_url": "https://arxiv.org/pdf/2509.13272v1.pdf",
    "title": "Ionization and temperature measurements in warm dense copper using x-ray   absorption spectroscopy",
    "abstract": "We detail experimental results inferring ionization and temperature for warm dense copper plasmas at several times solid density (15 to 25 g/cm$^3$) and temperatures of 10 to 21 eV. Experiments performed at the OMEGA Laser Facility generate uniform warm dense matter conditions via symmetric shock compression of a buried copper layer. The plasma is probed with a laser-generated x-ray source to collect the K-shell x-ray absorption spectrum. Fitting bound-bound absorption contributions from constituent charge states of copper provides an estimated $\\overline{Z}$ of approximately 4 to 7 for these warm dense copper plasmas. We find that these partially ionized plasmas have K-edge shifts of 12 to 30 eV and bound-bound resonance 1s$\\rightarrow$3p absorption shifts of 4 to 26 eV with respect to the cold K-edge. This study provides necessary experimental data to improve ionization and opacity models in the warm dense matter regime.",
    "authors": [
      "T. Cordova",
      "E. V. Marley",
      "D. A. Chin",
      "R. A. London",
      "H. A. Scott",
      "T. Döppner",
      "F. N. Beg",
      "F. Coppari",
      "M. Millot",
      "J. Emig",
      "S. B. Hansen",
      "P. M. Nilson",
      "P. Sterne",
      "M. J. MacDonald"
    ],
    "published": "2025-09-16T17:29:32Z",
    "updated": "2025-09-16T17:29:32Z",
    "categories": [
      "hep-ex",
      "physics.plasm-ph"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2509.13271v1",
    "url": "https://arxiv.org/abs/2509.13271v1",
    "pdf_url": "https://arxiv.org/pdf/2509.13271v1.pdf",
    "title": "Runaway electron interactions with whistler waves in tokamak plasmas:   energy-dependent transport scaling",
    "abstract": "Resonant interactions between high energy runaway electrons (REs) and whistler waves are a promising mechanism for RE mitigation in tokamak plasmas. While prior studies have largely relied on quasi-linear diffusion models in simplified geometries, we present a first-principles-informed framework that models RE-whistler interactions in a 3D tokamak equilibrium. This is achieved by coupling AORSA, which computes whistler eigenmodes for a given tokamak plasma equilibrium, and KORC, a kinetic orbit code that tracks full orbit RE trajectories in prescribed wave fields. Our results demonstrate that REs undergo scattering to large pitch angles and exhibit anomalous diffusion in both pitch-angle and kinetic energy space. Crucially, we observe a transition between diffusive, sub-diffusive, and super-diffusive transport regimes as a function of initial RE energy - an effect not captured by existing quasi-linear models. This anomalous transport behavior represents a significant advancement in understanding RE dynamics in the presence of wave - particle interactions. By identifying the conditions under which anomalous diffusion arises, this work lays the theoretical foundation for designing targeted, wave-based mitigation strategies in future tokamak experiments.",
    "authors": [
      "Yashika Ghai",
      "D. Del-Castillo-Negrete",
      "D. A. Spong",
      "M. T. Beidler"
    ],
    "published": "2025-09-16T17:29:01Z",
    "updated": "2025-09-16T17:29:01Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.11484v2",
    "url": "https://arxiv.org/abs/2509.11484v2",
    "pdf_url": "https://arxiv.org/pdf/2509.11484v2.pdf",
    "title": "The impact of kinetic and global effects on ballooning 2nd stable   pedestals of conventional and high aspect ratio tokamaks",
    "abstract": "The EPED model [P.B. Snyder et al 2011 Nucl. Fusion 51 103016] had success in describing type-I ELM and QH-mode pedestals in conventional tokamaks, by combining kinetic ballooning mode (KBM) and peeling-ballooning (PB) constraints. Within EPED, the KBM constraint is usually approximated by the ideal ballooning mode (IBM) stability threshold. It has been noted that quantitative differences between local ideal MHD and gyro-kinetic (GK) ballooning stability can be larger at low aspect ratio. KBM critical pedestals are consistent with observation in initial studies on conventional and spherical tokamaks. In this work, the application of a reduced model for the calculation of the kinetic ballooning stability boundary is presented based on a novel and newly developed Gyro-Fluid System (GFS) code [G.M. Staebler et al 2023 Phys. Plasmas 30 102501]. GFS is observed to capture KBMs in DIII-D as well as the NSTX(-U) pedestals, opening the route for the integration of this model into EPED. Finally, high-n global ballooning modes are observed to limit local 2nd stability access and thus provide a transport mechanism that constrains the width evolution with beta_p,ped. The high-n global ballooning stability is approximated by its ideal MHD analogue using ELITE. It is shown that nearly local high-n with k_y*rho_s~1/2 modes can provide a proxy for the critical beta_p,ped when 2nd stable access exists on DIII-D plasmas. The use of GFS and ELITE scaling in EPED provided improved agreement in comparison to EPED1 with DIII-D pedestal data.",
    "authors": [
      "M. S. Anastopoulos Tzanis",
      "M. Yang",
      "A. Kleiner",
      "J. F. Parisi",
      "G. M. Staebler",
      "P. B. Snyder"
    ],
    "published": "2025-09-15T00:14:56Z",
    "updated": "2025-09-16T17:17:08Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2406.12880v2",
    "url": "https://arxiv.org/abs/2406.12880v2",
    "pdf_url": "https://arxiv.org/pdf/2406.12880v2.pdf",
    "title": "Technical design report for the CODEX-$β$ demonstrator",
    "abstract": "The CODEX-$\\beta$ apparatus is a demonstrator for the proposed future CODEX-b experiment, a long-lived-particle detector foreseen for operation at IP8 during HL-LHC data-taking. The demonstrator project, intended to collect data in 2025, is described, with a particular focus on the design, construction, and installation of the new apparatus.",
    "authors": [
      "CODEX-b collaboration",
      ":",
      "Giulio Aielli",
      "Juliette Alimena",
      "Saul Balcarcel-Salazar",
      "James Beacham",
      "Eli Ben Haim",
      "András Barnabás Burucs",
      "Roberto Cardarelli",
      "Matthew J. Charles",
      "Xabier Cid Vidal",
      "Albert De Roeck",
      "Biplab Dey",
      "Silviu Dobrescu",
      "Ozgur Durmus",
      "Mohamed Elashri",
      "Vladimir V. Gligorov",
      "Rebeca Gonzalez Suarez",
      "Thomas Gorordo",
      "Zarria Gray",
      "Conor Henderson",
      "Louis Henry",
      "Philip Ilten",
      "Daniel Johnson",
      "Jacob Kautz",
      "Simon Knapen",
      "Bingxuan Liu",
      "Yang Liu",
      "Saul López Soliño",
      "Pablo Eduardo Menéndez-Valdés Pérez",
      "Titus Mombächer",
      "Benjamin Nachman",
      "David T. Northacker",
      "Gabriel M. Nowak",
      "Michele Papucci",
      "Gabriella Pásztor",
      "Eloi Pazos Rial",
      "María Pereira Martínez",
      "Michael Peters",
      "Jake Pfaller",
      "Luca Pizzimento",
      "Máximo Pló Casasús",
      "Gian Andrea Rassati",
      "Dean J. Robinson",
      "Emilio Xosé Rodríguez Fernández",
      "Debashis Sahoo",
      "Sinem Simsek",
      "Michael D. Sokoloff",
      "Joeal Subash",
      "Aditya Suresh",
      "Paul Swallow",
      "James Swanson",
      "Abhinaba Upadhyay",
      "Riccardo Vari",
      "Carlos Vázquez Sierra",
      "Gábor Veres",
      "Nigel Watson",
      "Michael K. Wilkinson",
      "Michael Williams",
      "Eleanor Winkler"
    ],
    "published": "2024-05-22T08:00:23Z",
    "updated": "2025-09-16T17:06:42Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/07/T07007"
  },
  {
    "arxiv_id": "2508.00720v3",
    "url": "https://arxiv.org/abs/2508.00720v3",
    "pdf_url": "https://arxiv.org/pdf/2508.00720v3.pdf",
    "title": "Propagation and collisionless damping of topologically-protected surface   plasma waves in non-uniformly magnetized plasma columns",
    "abstract": "Recent theoretical studies revealed the existence of topologically-protected surface plasma waves (TSPWs) in cold magnetized plasmas assumed uniform along the direction of a uniaxial magnetic field. Reflections-free propagation of the TSPWs along arbitrarily-shaped plasma boundaries oriented perpendicularly to the magnetic field was shown to be preserved even when their collisionless damping by localized upper-hybrid resonances was accounted for. Here we extend this theory to the realistic case of three-dimensional magnetic field produced by finite-sized magnetic coils. We demonstrate that when TSPWs are launched in the direction of the decreasing magnetic field, they are collisionlessly absorbed within a highly localized (evanescent) region as they propagate away from the magnetic coil. We show that the resulting wave reflection can be negligible -- in clear contrast with conventional wave reflection from the corresponding evanescence regions.",
    "authors": [
      "Roopendra Singh Rajawat",
      "Gennady Shvets"
    ],
    "published": "2025-08-01T15:40:33Z",
    "updated": "2025-09-16T16:44:06Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.02445v2",
    "url": "https://arxiv.org/abs/2508.02445v2",
    "pdf_url": "https://arxiv.org/pdf/2508.02445v2.pdf",
    "title": "Gyrotropy-Induced Symmetry Breaking of Erosion Hot Spots on Antenna   Limiters during High-Power Tokamak RF Operation: Mechanisms and Mitigation   Strategies",
    "abstract": "Ion Cyclotron Range of Frequencies (ICRF) heating is essential for creating plasma in next-generation fusion devices. ICRF antennas often produce hot spots, reducing reliability, material survivability, and overall plasma performance. We show that toroidal and poloidal asymmetries in these hot spots arise intrinsically from the wave physics' gyrotropy, and that they can be compensated for either by controlling the poloidal phasing or by modifying the limiter shapes, reducing total erosion by a factor $\\sim$2 compared to state-of-the-art designs.",
    "authors": [
      "W. Tierens",
      "A. Kumar",
      "J. Lore",
      "K. Fujii",
      "G. Urbanczyk",
      "R. Diab",
      "The WEST Team"
    ],
    "published": "2025-08-04T14:05:01Z",
    "updated": "2025-09-16T16:40:42Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.13206v1",
    "url": "https://arxiv.org/abs/2509.13206v1",
    "pdf_url": "https://arxiv.org/pdf/2509.13206v1.pdf",
    "title": "Virtual states and exponential decay in small-scale dynamo",
    "abstract": "We develop the Kazantsev theory of small-scale dynamo generation at small Prandtl numbers near the generation threshold and restore the concordance between the theory and numerical simulations: the theory predicted a power-law decay below the threshold, while simulations demonstrate exponential decay. We show that the exponential decay is temporary and owes its existence to the flattening of the velocity correlator at large scales. This effect corresponds to the existence of a long-living virtual level in the corresponding Schrodinger type equation. We also find the critical Reynolds number and the increment of growth/decay above and under the threshold; we express them in terms of the quantitative characteristic properties of the velocity correlator, which makes it possible to compare the results with the data of different simulations.",
    "authors": [
      "A. V. Kopyev",
      "A. S. Il'yn",
      "V. A. Sirota",
      "K. P. Zybin"
    ],
    "published": "2025-09-16T16:15:04Z",
    "updated": "2025-09-16T16:15:04Z",
    "categories": [
      "physics.flu-dyn",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.flu-dyn"
  },
  {
    "arxiv_id": "2506.03796v3",
    "url": "https://arxiv.org/abs/2506.03796v3",
    "pdf_url": "https://arxiv.org/pdf/2506.03796v3.pdf",
    "title": "Geoff: The Generic Optimization Framework & Frontend for Particle   Accelerator Controls",
    "abstract": "Geoff is a collection of Python packages that form a framework for automation of particle accelerator controls. With particle accelerator laboratories around the world researching machine learning techniques to improve accelerator performance and uptime, a multitude of approaches and algorithms have emerged. The purpose of Geoff is to harmonize these approaches and to minimize friction when comparing or migrating between them. It provides standardized interfaces for optimization problems, utility functions to speed up development, and a reference GUI application that ties everything together. Geoff is an open-source library developed at CERN and maintained and updated in collaboration between CERN and GSI as part of the EURO-LABS project. This paper gives an overview over Geoff's design, features, and current usage.",
    "authors": [
      "Penelope Madysa",
      "Sabrina Appel",
      "Verena Kain",
      "Michael Schenk"
    ],
    "published": "2025-06-04T09:58:48Z",
    "updated": "2025-09-16T15:03:48Z",
    "categories": [
      "physics.acc-ph",
      "cs.LG"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.1016/j.softx.2025.102335"
  },
  {
    "arxiv_id": "2501.10993v2",
    "url": "https://arxiv.org/abs/2501.10993v2",
    "pdf_url": "https://arxiv.org/pdf/2501.10993v2.pdf",
    "title": "Improved and automated krypton assay for low-background xenon detectors   with Auto-RGMS",
    "abstract": "Ultra-sensitive quantification of trace radioactive krypton-85 is essential for low-background experiments, particularly for next-generation searches of galactic dark matter and neutrino physics using xenon-based time projection chambers (TPCs). While the rare gas mass spectrometer (RGMS) represents the current state-of-the-art for krypton detection in the field, we are developing a fully automated system (Auto-RGMS) to overcome the limitations of its manual operation. Auto-RGMS incorporates a robust control system for rapid measurements and minimized systematic uncertainties. A primary goal is to reach detection limits in the low parts-per-quadrillion (ppq) range for natural krypton by improving the chromatography stage to enhance the separation of krypton from xenon. Investigations into various adsorbent materials identified two candidates. HayeSep Q offers a 12-fold improvement in chromatographic resolution for xenon/krypton separation compared to the previously used adsorbent. Alternatively, HayeSep D provides a more limited improvement in resolution while allowing a higher measurement frequency because of its moderate retention-induced contamination after each measurement. By automating krypton assays and achieving ppq sensitivity, Auto-RGMS will be an indispensable tool for next-generation detectors, maximizing their scientific potential.",
    "authors": [
      "Matteo Guida",
      "Ying-Ting Lin",
      "Hardy Simgen"
    ],
    "published": "2025-01-19T09:30:30Z",
    "updated": "2025-09-16T13:29:13Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1140/epjc/s10052-025-14262-2"
  },
  {
    "arxiv_id": "2507.03914v2",
    "url": "https://arxiv.org/abs/2507.03914v2",
    "pdf_url": "https://arxiv.org/pdf/2507.03914v2.pdf",
    "title": "Revealing Secondary Particle Signatures in Muography Based on the Point   of Closest Approach Algorithm",
    "abstract": "This work reinterprets so-called 'noise' in cosmic ray imaging, indicating that the data of reconstructed Points of Closest Approach (PoCA points) outside the volume of interest defined by traditional tomography methods contain valuable physical information that has been traditionally disregarded. Through analysis of data from the detection system of four resistive plate chambers (RPCs) and Monte Carlo simulations employing energy deposition weighting for coordinate determination, we confirm that these points physically originate from the interaction between muons and the material above the detection system, particularly the roof, resulting in the production of secondary particles. The research yields two principal findings: first, in the four-layer compliance measurement system, the position recording of the first layer can be from secondary particles generated by cosmic rays, while the records from the three layers below represent the actual trajectories of cosmic rays; second, the roof structure significantly impacts the distribution of PoCA points at detector positions, where quantitative analysis demonstrates a strong correlation between roof thickness and the number of reconstructed PoCA points -- a relationship that can be precisely measured through $z$-coordinate distribution analysis in specific intervals. Due to the varying performances of different roofing materials in this analytical method, this approach holds significant potential for development into a new tomography technique.",
    "authors": [
      "Rongfeng Zhang",
      "Zibo Qin",
      "Cheng-en Liu",
      "Qite Li",
      "Yong Ban",
      "Chen Zhou",
      "Qiang Li"
    ],
    "published": "2025-07-05T06:00:26Z",
    "updated": "2025-09-16T11:54:36Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2503.05489v2",
    "url": "https://arxiv.org/abs/2503.05489v2",
    "pdf_url": "https://arxiv.org/pdf/2503.05489v2.pdf",
    "title": "On the use of the Axelrod formula for thermal electron collisions in   Astrophysical Modelling",
    "abstract": "The Axelrod approximation is widely used in astrophysical modelling codes to evaluate electron-impact excitation effective collision strengths for forbidden transitions. Approximate methods such as this are a necessity for many heavy elements with open shells where collisional data is either non existent or sparse as the use of more robust methods prove prohibitively expensive. Atomic data for such forbidden transitions are essential for producing full collisional radiative models that do not assume Local-Thermodynamic-Equilibrium (LTE). In this short work we repeat the optimization of the simple Axelrod formula for a large number of $R$-matrix data sets, ranging from Fe and Ni to the first r-process peak elements of Sr, Y and Zr, to higher Z systems Te, W, Pt and Au. We show that the approximate treatment of forbidden transitions can be a significant source of inaccuracy in such collisional radiative models. We find a large variance of the optimized coefficients for differing systems and charge states, although some general trends can be seen based on the orbital structure of the ground-state-configurations. These trends could potentially inform better estimates for future calculations for elements where $R$-matrix data is not available.",
    "authors": [
      "Leo P. Mulholland",
      "Steven J. Bromley",
      "Connor P. Ballance",
      "Stuart A. Sim",
      "Catherine A. Ramsbottom"
    ],
    "published": "2025-03-07T14:58:19Z",
    "updated": "2025-09-16T11:25:55Z",
    "categories": [
      "astro-ph.HE",
      "physics.atom-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE",
    "doi": "10.1016/j.jqsrt.2025.109545"
  },
  {
    "arxiv_id": "2509.12945v1",
    "url": "https://arxiv.org/abs/2509.12945v1",
    "pdf_url": "https://arxiv.org/pdf/2509.12945v1.pdf",
    "title": "FusionMAE: large-scale pretrained model to optimize and simplify   diagnostic and control of fusion plasma",
    "abstract": "In magnetically confined fusion device, the complex, multiscale, and nonlinear dynamics of plasmas necessitate the integration of extensive diagnostic systems to effectively monitor and control plasma behaviour. The complexity and uncertainty arising from these extensive systems and their tangled interrelations has long posed a significant obstacle to the acceleration of fusion energy development. In this work, a large-scale model, fusion masked auto-encoder (FusionMAE) is pre-trained to compress the information from 88 diagnostic signals into a concrete embedding, to provide a unified interface between diagnostic systems and control actuators. Two mechanisms are proposed to ensure a meaningful embedding: compression-reduction and missing-signal reconstruction. Upon completion of pre-training, the model acquires the capability for 'virtual backup diagnosis', enabling the inference of missing diagnostic data with 96.7% reliability. Furthermore, the model demonstrates three emergent capabilities: automatic data analysis, universal control-diagnosis interface, and enhancement of control performance on multiple tasks. This work pioneers large-scale AI model integration in fusion energy, demonstrating how pre-trained embeddings can simplify the system interface, reducing necessary diagnostic systems and optimize operation performance for future fusion reactors.",
    "authors": [
      "Zongyu Yang",
      "Zhenghao Yang",
      "Wenjing Tian",
      "Jiyuan Li",
      "Xiang Sun",
      "Guohui Zheng",
      "Songfen Liu",
      "Niannian Wu",
      "Rongpeng Li",
      "Zhaohe Xu",
      "Bo Li",
      "Zhongbing Shi",
      "Zhe Gao",
      "Wei Chen",
      "Xiaoquan Ji",
      "Min Xu",
      "Wulyu Zhong"
    ],
    "published": "2025-09-16T10:50:29Z",
    "updated": "2025-09-16T10:50:29Z",
    "categories": [
      "physics.plasm-ph",
      "cs.AI"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.12800v1",
    "url": "https://arxiv.org/abs/2509.12800v1",
    "pdf_url": "https://arxiv.org/pdf/2509.12800v1.pdf",
    "title": "Improving Muon Scattering Tomography Performance With A Muon Momentum   Measurement Scheme",
    "abstract": "Muon imaging, especially muon scattering tomography (MST), has recently garnered significant attention. MST measures the magnitude of muon scattering angles inside an object, which depends not only on the material properties but also on the muon momentum. Due to the difficulty of simultaneous measurement of momentum, it was neglected and taken as a constant in multiple MST reconstruction algorithms. Recently, an experimental measurement scheme has emerged that is feasible in engineering, but it requires many layers of detectors to approach the true momentum. From this, we proposed both an algorithm to incorporating momentum into MST, and a scheme to determine the thresholds of Cherenkov detectors. This novel scheme, termed the \"equi-percentage scheme\", sets momentum thresholds for Cherenkov detector layers based on cosmic muon momentum distribution. Results showed our approach delivers noticeable enhancement in reconstructed image quality even with only two detector layers, reaching near-saturation performance with four layers. This study proves that momentum measurement significantly enhances short-duration MST, and that substantial improvement can be achieved with relatively coarse momentum measurement using 2-4 layers of Cherenkov detectors.",
    "authors": [
      "Pei Yu",
      "Ziwen Pan",
      "Jiajia Zhai",
      "Yu Xu",
      "Li Deng",
      "Zhengyang He",
      "Zhe Chen",
      "Zechao Kang",
      "Yuhong Yu",
      "Xueheng Zhang",
      "Liangwen Chen",
      "Lei Yang",
      "Zhiyu Sun"
    ],
    "published": "2025-09-16T08:19:35Z",
    "updated": "2025-09-16T08:19:35Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.12790v1",
    "url": "https://arxiv.org/abs/2509.12790v1",
    "pdf_url": "https://arxiv.org/pdf/2509.12790v1.pdf",
    "title": "The design of the data acquisition system for SPD experiment",
    "abstract": "The Spin Physics Detector (SPD) experiment at the NICA collider in JINR aims to investigate the spin structure of nucleons and spin-related phenomena. The combination of the number of background processes, the event rate and conditions for event selection makes the use of a classical trigger system impractical, requiring a triggerless data acquisition (DAQ) system. The DAQ system is designed to ensure precise time synchronization, efficient data collection, and high-throughput processing. Its architecture combines commercially available FPGA-based modules and high-speed optical interfaces with custom-developed components based on widely accessible technologies. This approach provides scalability from 180,000 at the initial stage of the experiment to more than 600,000 detector channels in the final configuration and supports data rates up to 20 GB/s or more. The modular system design ensures adaptability for future upgrades while maintaining high efficiency and reliability. Such an approach makes the DAQ system suitable for other high-rate nuclear physics experiments.",
    "authors": [
      "L. Afanasyev",
      "A. Berngardt",
      "A. Boikov",
      "V. Borshch",
      "A. Boykov",
      "D. Cherepkov",
      "D. Erofeev",
      "V. Frolov",
      "K. Gritsay",
      "A. Isupov",
      "K. Kotov",
      "D. Kozyrev",
      "A. Kulikov",
      "O. Mamoutova",
      "N. Reshetikhin",
      "D. Ryabikov",
      "S. Tereshchenko",
      "V. Tereshchenko"
    ],
    "published": "2025-09-16T08:08:12Z",
    "updated": "2025-09-16T08:08:12Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.11522v2",
    "url": "https://arxiv.org/abs/2509.11522v2",
    "pdf_url": "https://arxiv.org/pdf/2509.11522v2.pdf",
    "title": "Conceptual Design Report of Super Tau-Charm Facility: The Accelerator",
    "abstract": "Electron-positron colliders operating in the GeV region of center-of-mass energies or the Tau-Charm energy region, have been proven to enable competitive frontier research, due to its several unique features. With the progress of high energy physics in the last two decades, a new-generation Tau-Charm factory, Super Tau Charm Facility (STCF) has been actively promoting by the particle physics community in China. STCF holds great potential to address fundamental questions such as the essence of color confinement and the matter-antimatter asymmetry in the universe in the next decades. The main design goals of STCF are with a center-of-mass energy ranging from 2 to 7 GeV and a peak luminosity surpassing 5*10^34 cm^-2s^-1 that is optimized at a center-of-mass energy of 4 GeV, which is about 50 times that of the currently operating Tau-Charm factory - BEPCII. The STCF accelerator is composed of two main parts: a double-ring collider with the crab-waist collision scheme and an injector that provides top-up injections for both electron and positron beams. As a typical third-generation electron-positron circular collider, the STCF accelerator faces many challenges in both accelerator physics and technology. In this paper, the conceptual design of the STCF accelerator complex is presented, including the ongoing efforts and plans for technological R&D, as well as the required infrastructure. The STCF project aims to secure support from the Chinese central government for its construction during the 15th Five-Year Plan (2026-2030) in China.",
    "authors": [
      "Jiancong Bao",
      "Anton Bogomyagkov",
      "Zexin Cao",
      "Mingxuan Chang",
      "Fangzhou Chen",
      "Guanghua Chen",
      "Qi Chen",
      "Qushan Chen",
      "Zhi Chen",
      "Kuanjun Fan",
      "Hailiang Gong",
      "Duan Gu",
      "Hao Guo",
      "Tengjun Guo",
      "Chongchao He",
      "Tianlong He",
      "Kaiwen Hou",
      "Hao Hu",
      "Tongning Hu",
      "Xiaocheng Hu",
      "Dazhang Huang",
      "Pengwei Huang",
      "Ruixuan Huang",
      "Zhicheng Huang",
      "Hangzhou Li",
      "Renkai Li",
      "Sangya Li",
      "Weiwei Li",
      "Xuan Li",
      "Xunfeng Li",
      "Yu Liang",
      "Chao Liu",
      "Tao Liu",
      "Xiaoyu Liu",
      "Xuyang Liu",
      "Yuan Liu",
      "Huihui Lv",
      "Qing Luo",
      "Tao Luo",
      "Mikhail Skamarokha",
      "Shaohang Ma",
      "Wenbin Ma",
      "Masahito Hosaka",
      "Xuece Miao",
      "Yihao Mo",
      "Kazuhito Ohmi",
      "Jian Pang",
      "Guoxi Pei",
      "Zhijun Qi",
      "Fenglei Shang",
      "Lei Shang",
      "Caitu Shi",
      "Kun Sun",
      "Li Sun",
      "Jingyu Tang",
      "Anxin Wang",
      "Chengzhe Wang",
      "Hongjin Wang",
      "Lei Wang",
      "Qian Wang",
      "Shengyuan Wang",
      "Shikang Wang",
      "Ziyu Wang",
      "Shaoqing Wei",
      "Yelong Wei",
      "Jun Wu",
      "Sang Wu",
      "Chunjie Xie",
      "Ziyu Xiong",
      "Xin Xu",
      "Jun Yang",
      "Penghui Yang",
      "Tao Yang",
      "Lixin Yin",
      "Chen Yu",
      "Ze Yu",
      "Youjin Yuan",
      "Yifeng Zeng",
      "Ailin Zhang",
      "Haiyan Zhang",
      "Jialian Zhang",
      "Linhao Zhang",
      "Ning Zhang",
      "Ruiyang Zhang",
      "Xiaoyang Zhang",
      "Yihao Zhang",
      "Yangcheng Zhao",
      "Jingxin Zheng",
      "Demin Zhou",
      "Hao Zhou",
      "Yimei Zhou",
      "Zeran Zhou",
      "Bing Zhu",
      "Xinghao Zhu",
      "Zi'an Zhu",
      "Ye Zou"
    ],
    "published": "2025-09-15T02:20:12Z",
    "updated": "2025-09-16T06:58:11Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2506.06059v2",
    "url": "https://arxiv.org/abs/2506.06059v2",
    "pdf_url": "https://arxiv.org/pdf/2506.06059v2.pdf",
    "title": "Driven Collisionless Reconnection of Force-free Flux Tubes: From Onset   to Coalescence",
    "abstract": "We investigate the onset of driven collisionless reconnection and plasmoid formation in a magnetically dominated pair plasma, using 2D Particle-in-Cell simulations. Two force-free flux tubes of radius $R$ are initially pushed together with a prescribed velocity, forming a current sheet whose width shrinks until reconnection sets in. % Even in our largest simulation with $R\\approx 1600$ plasma skin depths, the sheet thickness at reconnection onset is comparable to the skin depth. Plasmoid chains develop when the sheet length-to-width aspect ratio $A\\gtrsim30$. In the strongly magnetized limit, the onset of reconnection occurs in roughly 2--6 light-crossing times, depending on the imposed driving timescale, which controls the duration of the thinning phase. In the subsequent nonlinear merging phase, the evolution becomes effectively independent of the initially imposed velocity, leading to magnetic-energy dissipation consistent with a normalized reconnection rate $\\sim 0.1$. Our results have important implications for explosive release of magnetic energy in magnetospheres of astrophysical compact objects and their surroundings.",
    "authors": [
      "Camille Granier",
      "Daniel Groselj",
      "Luca Comisso",
      "Fabio Bacchini"
    ],
    "published": "2025-06-06T13:12:26Z",
    "updated": "2025-09-16T05:54:56Z",
    "categories": [
      "physics.plasm-ph",
      "hep-th"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.12608v1",
    "url": "https://arxiv.org/abs/2509.12608v1",
    "pdf_url": "https://arxiv.org/pdf/2509.12608v1.pdf",
    "title": "The impact of Alfvenic shear flow on magnetic reconnection and   turbulence",
    "abstract": "Magnetic reconnection is a fundamental and omnipresent energy conversion process in plasma physics. Novel observations of fields and particles from Parker Solar Probe (PSP) have shown the absence of reconnection in a large number of current sheets in the near-Sun solar wind. Using near-Sun observations from PSP Encounters 4 to 11 (Jan 2020 to March 2022), we investigate whether reconnection onset might be suppressed by velocity shear. We compare estimates of the tearing mode growth rate in the presence of shear flow for time periods identified as containing reconnecting current sheets versus non-reconnecting times, finding systematically larger growth rates for reconnection periods. Upon examination of the parameters associated with reconnection onset, we find that 85% of the reconnection events are embedded in slow, non-Alfvenic wind streams. We compare with fast, slow non-Alfvenic, and slow Alfvenic streams, finding that the growth rate is suppressed in highly Alfvenic fast and slow wind and reconnection is not seen in these wind types, as would be expected from our theoretical expressions. These wind streams have strong Alfvenic} flow shear, consistent with the idea of reconnection suppression by such flows. This could help explain the frequent absence of reconnection events in the highly Alfvenic, near-Sun solar wind observed by PSP. Finally, we find a steepening of both the trace and magnitude magnetic field spectra within reconnection periods in comparison to ambient wind. We tie this to the dynamics of relatively balanced turbulence within these reconnection periods and the potential generation of compressible fluctuations.",
    "authors": [
      "Tamar Ervin",
      "Alfred Mallet",
      "Stefan Eriksson",
      "Marc Swisdak",
      "James Juno",
      "Orlando M. Romeo",
      "Tai Phan",
      "Trevor A. Bowen",
      "Roberto Livi",
      "Phyllis L. Whittlesey",
      "Davin E. Larson",
      "Stuart D. Bake"
    ],
    "published": "2025-09-16T03:11:53Z",
    "updated": "2025-09-16T03:11:53Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2509.12599v1",
    "url": "https://arxiv.org/abs/2509.12599v1",
    "pdf_url": "https://arxiv.org/pdf/2509.12599v1.pdf",
    "title": "Validation of the GFS model for Gyrokinetic Stability of NSTX Pedestal   Data",
    "abstract": "This study presents a large database validation of the Gyro Fluid System (GFS) model for linear gyrokinetic stability for high-mode (H-mode) edge transport barrier conditions in the National Spherical Torus Experiment (NSTX) tokamak. The database of linear stability calculations with the CGYRO gyrokinetic code was produced using plasma profile measurements from NSTX discharges to identify kinetic ballooning modes (KBM), trapped electron modes (TEM), and micro-tearing modes (MTM) that limit the pressure profile gradient in the H-mode barrier. A novel Bayesian optimization approach determines optimal resolution parameters for GFS specifically for spherical tokamak pedestal conditions. Our results demonstrate that GFS, with optimized resolution, can achieve accurate linear stability analysis in NSTX pedestal conditions for reduced resolution compared to CGYRO. GFS can accurately find the KBM, TEM, and MTM instability branches. Parametric analysis reveals that GFS accuracy in this extreme pedestal parameter range is degraded for low magnetic shear and near the separatrix conditions. These findings establish GFS as a fast linear eigenmode solver for spherical tokamak pedestal gyrokinetic stability and demonstrate a systematic methodology for determining the optimum resolution settings.",
    "authors": [
      "M. Yang",
      "J. F. Parisi",
      "M. S. Anastopoulos Tzanis",
      "G. M. Staebler"
    ],
    "published": "2025-09-16T02:55:54Z",
    "updated": "2025-09-16T02:55:54Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.12475v1",
    "url": "https://arxiv.org/abs/2509.12475v1",
    "pdf_url": "https://arxiv.org/pdf/2509.12475v1.pdf",
    "title": "Liquid Helium Cryogenic TEM below 1 Å",
    "abstract": "Next-generation cryogenic transmission electron microscopes (TEM) aim to achieve high-resolution imaging at ultracold sample temperatures (< 90 K) and over extended hold times. Lower temperatures enable atomic-scale characterization with improved beam and dose resilience for organic specimens and access to emergent electronic phases in quantum materials. Side-entry liquid helium cooling stages presently lack the mechanical and thermal stability required to support sub-Angstrom information transfer in modern TEM. Here we demonstrate sub-Angstrom atomic imaging TEM with a side-entry stage at specimen temperatures down to ~20K and with low stage drift and stable hold times.",
    "authors": [
      "Suk Hyun Sung",
      "Maya Gates",
      "Nishkarsh Agarwal",
      "Yang Zhang",
      "William Millsaps",
      "Miti Shah",
      "Emily Rennich",
      "Cong Li",
      "Pu Yu",
      "Miaofang Chi",
      "Benjamin H. Savitzky",
      "Ismail El Baggari",
      "Robert Hovden"
    ],
    "published": "2025-09-15T21:45:51Z",
    "updated": "2025-09-15T21:45:51Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.12397v1",
    "url": "https://arxiv.org/abs/2509.12397v1",
    "pdf_url": "https://arxiv.org/pdf/2509.12397v1.pdf",
    "title": "Shock wave bending around a dusty plasma void",
    "abstract": "We report on experimental observations of the bending of a dust acoustic shock wave around a dust void region. This phenomenon occurs as a planar shock wavefront encounters a compressible obstacle in the form of a void whose size is larger than the wavelength of the wave. As they collide, the central portion of the wavefront, that is the first to touch the void, is blocked while the rest of the front continues to propagate, resulting in an inward bending of the shock wave. The bent shock wave eventually collapses, leading to the transient trapping of dust particles in the void. Subsequently, a Coulomb explosion of the trapped particles generates a bow shock. The experiments have been carried out in a DC glow discharge plasma, where the shock wave and the void are simultaneously created as self-excited modes of a three-dimensional dust cloud. The salient features of this phenomenon are reproduced in molecular dynamics simulations, which provide valuable insights into the underlying dynamics of this interaction.",
    "authors": [
      "Sachin Sharma",
      "Rauoof Wani",
      "Prabhakar Srivastav",
      "Meenakshee Sharma",
      "Sayak Bose",
      "Sanat Tiwari",
      "Abhijit Sen"
    ],
    "published": "2025-09-15T19:42:15Z",
    "updated": "2025-09-15T19:42:15Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.12175v1",
    "url": "https://arxiv.org/abs/2509.12175v1",
    "pdf_url": "https://arxiv.org/pdf/2509.12175v1.pdf",
    "title": "An Optomechanical Accelerometer Search for Ultralight Dark Matter",
    "abstract": "We use a cavity optomechanical accelerometer to perform a resonant search for ultralight dark matter at acoustic frequencies near 39 kHz (a particle mass of $0.16$ neV/$c^2$). The accelerometer is based on a Si$_3$N$_4$ membrane, cryogenically cooled to 4 K, with photothermal heating employed to scan the resonance frequency by $10^2$ detector linewidths. Leveraging shot-noise-limited displacement readout and radiation pressure feedback cooling, we realize an acceleration resolution of $\\sim 10\\;\\text{n}g_0/\\sqrt{\\text{Hz}}$ over a bandwidth of $30$ Hz near the fundamental test mass resonance. We find no evidence of a dark matter signal and infer an upper bound on the coupling to normal matter that is several orders of magnitude above the stringent bounds set by equivalence principle experiments. We outline a path toward novel dark matter constraints in future experiments by exploiting arrays of mass-loaded optomechanical sensors at lower temperature probed with distributed squeezed light.",
    "authors": [
      "M. Dey Chowdhury",
      "J. P. Manley",
      "C. A. Condos",
      "A. R. Agrawal",
      "D. J. Wilson"
    ],
    "published": "2025-09-15T17:38:12Z",
    "updated": "2025-09-15T17:38:12Z",
    "categories": [
      "hep-ex",
      "astro-ph.IM",
      "physics.ins-det",
      "physics.optics",
      "quant-ph"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2509.12164v1",
    "url": "https://arxiv.org/abs/2509.12164v1",
    "pdf_url": "https://arxiv.org/pdf/2509.12164v1.pdf",
    "title": "Anomalous electron heating in laboratory magnetized quasi-perpendicular   collisionless shocks",
    "abstract": "We present laboratory results from supercritical, magnetized collisionless shock experiments ($M_A \\lesssim 10$, $\\beta\\sim 1$). We report the first observation of fully-developed shocks ($R=4$ compression ratio and a downstream region decoupled from the piston) after seven upstream ion gyration periods. A foot ahead of the shock exhibits super-adiabatic electron and ion heating. We measure the electron temperature $T_e = 115$ eV and ion temperature $T_i = 15$ eV upstream of the shock; whereas, downstream, we measure $T_e=390$ eV and infer $T_i=340$ eV, consistent with both Thomson scattering ion-acoustic wave spectral broadening and Rankine-Hugoniot conditions. The downstream electron temperature has a $30$-percent excess from adiabatic and collisional electron-ion heating, implying significant collisionless anomalous electron heating. Furthermore, downstream electrons and ions are in equipartition, with a unity electron-ion temperature ratio $T_e/T_i = 1.2$.",
    "authors": [
      "V. Valenzuela-Villaseca",
      "S. Totorica",
      "J. Griff-McMahon",
      "L. -J. Chen",
      "S. Malko",
      "P. V. Heuer",
      "P. Pongkitiwanichakul",
      "W. Fox",
      "D. B. Schaeffer"
    ],
    "published": "2025-09-15T17:26:36Z",
    "updated": "2025-09-15T17:26:36Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE",
      "astro-ph.SR"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2505.18155v2",
    "url": "https://arxiv.org/abs/2505.18155v2",
    "pdf_url": "https://arxiv.org/pdf/2505.18155v2.pdf",
    "title": "Modelling Cosmic-Ray Transport: Magnetized versus Unmagnetized Motion in   Astrophysical Magnetic Turbulence",
    "abstract": "Cosmic-ray transport in turbulent astrophysical environments remains a multifaceted problem, and despite decades of study the impact of complex magnetic field geometry -- evident in simulations and observations -- has only recently received more focused attention. To understand how ensemble-averaged transport behaviour emerges from the intricate interactions between cosmic rays and structured magnetic turbulence, we run test-particle experiments in snapshots of a strongly turbulent magnetohydrodynamics simulation. We characterize particle-turbulence interactions via the gyro radii of particles and their experienced field-line curvatures, which reveals two distinct transport modes: magnetized motion, where particles are tightly bound to strong coherent flux tubes and undergo large-scale mirroring; and unmagnetized motion characterized by chaotic scattering through weak and highly tangled regions of the magnetic field. We formulate an effective stochastic process for each mode: compound subdiffusion with long mean free paths for magnetized motion, and a Langevin process with short mean free paths for unmagnetized motion. A combined stochastic walker that alternates between these two modes accurately reproduces the mean squared displacements observed in the test-particle data. Our results emphasize the critical role of coherent magnetic structures in comprehensively understanding cosmic-ray transport and lay a foundation for developing a theory of geometry-mediated transport.",
    "authors": [
      "Jeremiah Lübke",
      "Patrick Reichherzer",
      "Sophie Aerdker",
      "Frederic Effenberger",
      "Mike Wilbert",
      "Horst Fichtner",
      "Rainer Grauer"
    ],
    "published": "2025-05-23T17:59:52Z",
    "updated": "2025-09-15T17:03:07Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2408.00661v4",
    "url": "https://arxiv.org/abs/2408.00661v4",
    "pdf_url": "https://arxiv.org/pdf/2408.00661v4.pdf",
    "title": "Neuromorphic detection and cooling of microparticles in arrays",
    "abstract": "Micro-objects levitated in a vacuum are an exciting platform for precision sensing due to their low dissipation motion and the potential for control at the quantum level. Arrays of such sensors would offer increased sensitivity, directionality, and in the quantum regime the potential to exploit correlation and entanglement. We use neuromorphic detection via a single event based camera to record the motion of an array of levitated microspheres. We present a scalable method for arbitrary multiparticle tracking and control by implementing real-time feedback to {simultaneously cool the motion of three uncoupled microscale objects",
    "authors": [
      "Yugang Ren",
      "Benjamin Siegel",
      "Ronghao Yin",
      "Qiongyuan Wu",
      "Jonathan D. Pritchett",
      "Muddassar Rashid",
      "James Millen"
    ],
    "published": "2024-08-01T15:49:37Z",
    "updated": "2025-09-15T16:26:40Z",
    "categories": [
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.12030v1",
    "url": "https://arxiv.org/abs/2509.12030v1",
    "pdf_url": "https://arxiv.org/pdf/2509.12030v1.pdf",
    "title": "Acceleration of Multi-Scale LTS Magnet Simulations with Neural Network   Surrogate Models",
    "abstract": "While the prediction of AC losses during transients is critical for designing large-scale low-temperature superconducting (LTS) magnets, brute-force finite-element (FE) simulation of their detailed geometry down to the length scale of the conductors is a computational challenge. Multi-scale methods, balancing between a coarse approximation of the fields at the scale of the magnet and a detailed description at the scale of the conductors, are promising approaches to reduce the computational load while keeping a sufficient accuracy. In this work, we introduce a neural network approach to accelerate multi-scale magneto-thermal simulations of LTS magnets by replacing costly single-turn FE models with neural network surrogates. The neural network architecture is presented and discussed, together with an automated procedure for generating simulation data for its training. The resulting accelerated multi-scale model is used to simulate current ramp-up procedures for the IBA S2C2 magnet. The surrogate-based multi-scale model is compared with a conventional multi-scale model based on a composite wire-in-channel FE model. The surrogate model is shown to reproduce single-turn filament hysteresis, inter-filament coupling, and eddy losses, while the computational time of the multi-scale method is reduced by a factor of 800.",
    "authors": [
      "Louis Denis",
      "Julien Dular",
      "Vincent Nuttens",
      "Mariusz Wozniak",
      "Benoît Vanderheyden",
      "Christophe Geuzaine"
    ],
    "published": "2025-09-15T15:13:20Z",
    "updated": "2025-09-15T15:13:20Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  }
]