{
  "arxiv_id": "2511.03250v1",
  "url": "https://arxiv.org/abs/2511.03250v1",
  "pdf_url": "https://arxiv.org/pdf/2511.03250v1.pdf",
  "title": "Development of a Hermetic Gaseous Xenon Detector for Suppressing   External Radon Background",
  "abstract": "Radon-induced backgrounds, particularly from $^{222}$Rn and its beta-emitting progeny, present a critical challenge for next-generation liquid xenon (LXe) detectors aimed at probing dark matter down to the neutrino fog. To address this, we developed a compact hermetic gaseous xenon (GXe) detector. This device physically isolates the active volume from external radon sources by using a PTFE vessel sealed between two quartz flanges with mechanically compressed ePTFE gaskets. To quantify radon sealing performance, we implemented a dual-loop GXe circulation system and conducted a 670-hour radon-injection measurement campaign. Radon ingress into the hermetic detector was monitored using electrostatic radon detectors and photomultiplier tubes (PMTs). From these two independent measurements, the steady-state ratios of the radon concentrations inside the hermetic detector to those outside were estimated to be $ (1.1 \\pm 0.1) \\times 10^{-2} $ and $ (1.1 \\pm 0.2) \\times 10^{-2} $, corresponding to radon-leakage flows of $ (2.9 \\pm 0.3) \\times 10^{-11} $ and $ (2.6 \\pm 0.4) \\times 10^{-11} $ $ \\thinspace $m$^{3}$ $ \\thinspace $ $\\mathrm{s}^{-1}$, respectively. An extrapolation to a 60-tonne LXe TPC such as XLZD suggests that the radon leakage could amount to $ 1.2 \\times 10^{-2} $ $ \\thinspace $mBq, which is negligible compared to the expected natural radon emanation inside the detector, typically 3$ \\thinspace $mBq. These results demonstrate that flange-based mechanical sealing provides an effective solution for realizing radon-isolated inner detectors in large-scale LXe experiments.",
  "authors": [
    "Ryuta Miyata",
    "Koki Fujikawa",
    "Rina Harata",
    "Yoshitaka Itow",
    "Shingo Kazama",
    "Masatoshi Kobayashi"
  ],
  "published": "2025-11-05T07:27:21Z",
  "updated": "2025-11-05T07:27:21Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}