[
  {
    "arxiv_id": "2511.03705v1",
    "url": "https://arxiv.org/abs/2511.03705v1",
    "pdf_url": "https://arxiv.org/pdf/2511.03705v1.pdf",
    "title": "Analytical Modeling of Asynchronous Event-Driven Readout Architectures   Using Queueing Theory",
    "abstract": "Event-driven imagers and sensor arrays commonly employ asynchronous arbiter trees with a synchronous acknowledge to serialize requests. We present an analytical framework that models the root as an \\(M/D/1\\) queue with deterministic quantum \\(T\\) and implements losses at the sources through one-slot gating. The admitted rate, loss probability, utilization, and mean sojourn time are coupled by self-consistent relations; a closed form for \\(\\mathbb{E}[S_t]\\) separates fixed path delay \\(\\tau_0\\) from queueing effects. The framework matches post-layout results of a physical prototype over light to heavy traffic, reproducing saturation at \\(1/T\\) and the observed latency growth, while classical \\(M/G/1/K\\) and Engset-type abstractions diverge at higher occupancy. Because all relations are algebraic, they enable rapid sizing at design time, including the impact of partitioning into independent tiles: reducing fan-in lowers arbitration depth and \\(\\tau_0\\), decreases loss, and improves latency at fixed \\(T\\), with throughput adding across tiles. The model thereby links architectural parameters to performance metrics and supports selection of acknowledge period, tiling, and link count under practical constraints.",
    "authors": [
      "Dominik S. Górni",
      "Grzegorz W. Deptuch"
    ],
    "published": "2025-11-05T18:37:45Z",
    "updated": "2025-11-05T18:37:45Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.03639v1",
    "url": "https://arxiv.org/abs/2511.03639v1",
    "pdf_url": "https://arxiv.org/pdf/2511.03639v1.pdf",
    "title": "High-Q Superconducting Lumped-Element Resonators for Low-Mass Axion   Searches",
    "abstract": "Low-frequency superconducting lumped-element resonators have recently attracted significant attention in the context of axion dark matter searches. Here we present the design and implementation of a fixed-frequency superconducting resonator operating near $250~\\mathrm{kHz}$, possessing an inductor volume of $\\sim 1$ liter and achieving an unloaded quality factor $Q \\approx 2.1\\times10^{6}$. This resonator represents a significant improvement over the state of the art and informs the design of searches for low-mass axions.",
    "authors": [
      "Roman Kolevatov",
      "Saptarshi Chaudhuri",
      "Lyman Page"
    ],
    "published": "2025-11-05T16:58:14Z",
    "updated": "2025-11-05T16:58:14Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "gr-qc",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.03573v1",
    "url": "https://arxiv.org/abs/2511.03573v1",
    "pdf_url": "https://arxiv.org/pdf/2511.03573v1.pdf",
    "title": "Radiation damage study of a p-type silicon sensor under extreme particle   fluence",
    "abstract": "We investigate the radiation tolerance of p-type silicon pad sensors, indigenously developed for use in high-fluence environments relevant to heavy-ion collider experiments, cosmic-ray observatories, and deep-space missions. Single-pad test structures were irradiated with neutrons over a range of fluence, and post-irradiation performance was characterized. The evolution of leakage current and the calorimetric response of the devices were systematically analyzed as functions of accumulated neutron fluence. In addition, we introduce a simple exponential-annealing model that predicts the time dependence of leakage current after irradiation. The measurements and model together quantify performance degradation and recovery trends, providing guidance for the design and operation of silicon-based calorimetry in harsh radiation environments.",
    "authors": [
      "Arun Kumar Yadav",
      "Sanjib Muhuri",
      "Anup Kumar Sikdar",
      "Subikash Choudhury",
      "Sourav Mukhopadhyay",
      "Jogender Saini",
      "Mitul Abhangi",
      "Ratnesh Kumar",
      "Sudhirsinh Vala",
      "Zubayer Ahammed"
    ],
    "published": "2025-11-05T15:58:02Z",
    "updated": "2025-11-05T15:58:02Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.03511v1",
    "url": "https://arxiv.org/abs/2511.03511v1",
    "pdf_url": "https://arxiv.org/pdf/2511.03511v1.pdf",
    "title": "Beam Cleaning and Collimation Systems",
    "abstract": "Collimation systems in particle accelerators are designed to safely and efficiently dispose of unavoidable beam losses during operation. Their specific roles vary depending on the type of accelerator. The state of the art in hadron beam collimation for high-intensity, high-energy superconducting colliders is exemplified by the system implemented at the CERN Large Hadron Collider (LHC). In this machine, the stored beam energy reaches levels several orders of magnitude higher than the tiny energy required to quench superconducting magnets. It also exceeds by orders of magnitude the damage thresholds of typical accelerator components, placing stringent demands on beam loss control. Collimation systems are therefore essential for the reliable daily operation of modern accelerators. This lecture reviews the design of a multistage collimation system, using the LHC as a case study. The LHC collimation system has achieved unprecedented cleaning performance, with a level of complexity unmatched by any other accelerator. Design aspects and operational challenges of such large-scale collimation systems are also discussed.",
    "authors": [
      "Stefano Redaelli"
    ],
    "published": "2025-11-05T14:41:08Z",
    "updated": "2025-11-05T14:41:08Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2503.14819v2",
    "url": "https://arxiv.org/abs/2503.14819v2",
    "pdf_url": "https://arxiv.org/pdf/2503.14819v2.pdf",
    "title": "Measurement of the Quantum Efficiency of Electrode Materials for VUV   Photons in Liquid Xenon",
    "abstract": "Light dark matter searches using ionization signals in dual-phase liquid xenon (LXe) time projection chambers (TPCs) are limited by low-energy ionization backgrounds, including those from the photoelectric effect on the electrodes. To address this, we measured the quantum efficiency (QE) of various electrode materials for vacuum ultraviolet (VUV) photons in LXe, including platinum (Pt), stainless steel (SUS304), and magnesium fluoride (MgF$_{2}$)-coated aluminum (Al). Our results show that MgF$_{2}$-coated Al exhibits the lowest QE among the tested materials. The QE for VUV photons with a mean wavelength of 179.5~nm was measured to be $(7.2 \\pm 2.3) \\times 10^{-5}$, corresponding to a reduction by a factor of 4.4 compared to SUS304, a commonly used electrode material in direct dark matter experiments with LXe. These findings suggest that employing low-QE electrodes can help mitigate photoelectric-induced backgrounds, potentially improving the sensitivity of LXe TPCs in light dark matter searches.",
    "authors": [
      "Shingo Kazama",
      "Naoki Aoyama",
      "Yoshitaka Itow",
      "Masatoshi Kobayashi"
    ],
    "published": "2025-03-19T01:27:35Z",
    "updated": "2025-11-05T14:28:10Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1093/ptep/ptaf078"
  },
  {
    "arxiv_id": "2511.03417v1",
    "url": "https://arxiv.org/abs/2511.03417v1",
    "pdf_url": "https://arxiv.org/pdf/2511.03417v1.pdf",
    "title": "Design and development of optical modules for the BUTTON-30 detector",
    "abstract": "BUTTON-30 is a neutrino detector demonstrator located in the STFC Boulby underground facility in the north-east of England. The main goal of the project is to deploy and test the performance of the gadolinium-loaded water-based liquid scintillator for neutrino detection in an underground environment. This will pave the way for a future large-volume neutrino observatory that can also perform remote monitoring of nuclear reactors for nonproliferation. This paper describes the design and construction of the watertight optical modules of the experiment.",
    "authors": [
      "D. S. Bhattacharya",
      "J. Bae",
      "M. Bergevin",
      "J. Boissevain",
      "S. Boyd",
      "K. Bridges",
      "L. Capponi",
      "J. Coleman",
      "D. Costanzo",
      "T. Cunniffe",
      "S. A. Dazeley",
      "M. V. Diwan",
      "S. R. Durham",
      "E. Ellingwood",
      "A. Enqvist",
      "T. Gamble",
      "S. Gokhale",
      "J. Gooding",
      "C. Graham",
      "E. Gunger",
      "W. Hopkins",
      "I. Jovanovic",
      "T. Kaptanoglu",
      "E. Kneale",
      "L. Lebanowski",
      "K. Lester",
      "V. A. Li",
      "M. Malek",
      "C. Mauger",
      "N. McCauley",
      "C. Metelko",
      "R. Mills",
      "A. Morgan",
      "F. Muheim",
      "A. Murphy",
      "M. Needham",
      "K. Ogren",
      "G. D. Orebi Gann",
      "K. Y. Oyulmaz",
      "S. M. Paling",
      "A. F. Papatyi",
      "G. Pinkney",
      "J. Puputti",
      "S. Quillin",
      "B. Richards",
      "R. Rosero",
      "A. Scarff",
      "Y. Schnellbach",
      "P. R. Scovell",
      "B. Seitz",
      "L. Sexton",
      "O. Shea",
      "G. D. Smith",
      "R. Svoboda",
      "D. Swinnock",
      "A. Tarrant",
      "F. Thomson",
      "J. N. Tinsley",
      "C. Toth",
      "A. Usón",
      "M. Vagins",
      "J. Webster",
      "S. Woodford",
      "G. Yang",
      "M. Yeh",
      "E. Zhemchugov"
    ],
    "published": "2025-11-05T12:30:40Z",
    "updated": "2025-11-05T12:30:40Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.02512v2",
    "url": "https://arxiv.org/abs/2511.02512v2",
    "pdf_url": "https://arxiv.org/pdf/2511.02512v2.pdf",
    "title": "Neutron Interaction Properties of Structural Materials for Multi-Grid   Neutron Detectors",
    "abstract": "The T-REX neutron time-of-flight spectrometer at the European Spallation Source will use Multi-Grid Technology, which relies on thin B4C coatings on the Al blades of the grids to detect scattered thermal neutrons. Following a Monte Carlo study of internal shielding to suppress neutron multiple scattering in T-REX, the neutron transmission and scattering properties of 12 shielding-material samples have been measured at the ISIS spallation neutron source. Neutron transmission was measured on the EMMA beam line at wavelengths 0.5-4.7 A, using a 2D-position-sensitive, neutron GEM detector, while neutron scattering was measured for 6 of the samples at the Merlin spectrometer, at wavelengths 0.72, 1.28, 1.85 and 2.41 A. The present tests show that a B4C/Al composite material, plated with Ni to stop intrinsic alpha background, is an effective neutron absorber, suitable for incorporation in the Multi-Grid structures which detect the neutrons in inelastic neutron spectrometers .",
    "authors": [
      "A. Backis",
      "C. -C. Lai",
      "M. Aouane",
      "P. P. Deen",
      "K. G. Fissum",
      "J. R. M. Annand",
      "K. Livingston",
      "D. Raspino"
    ],
    "published": "2025-11-04T12:04:15Z",
    "updated": "2025-11-05T10:29:00Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.03336v1",
    "url": "https://arxiv.org/abs/2511.03336v1",
    "pdf_url": "https://arxiv.org/pdf/2511.03336v1.pdf",
    "title": "First global gyrokinetic profile predictions of ITER burning plasma",
    "abstract": "In this work, we present the first global gyrokinetic simulations of the ITER baseline scenario operating at 15 MA using GENE-Tango electrostatic and electromagnetic simulations. The modeled radial region spans close to the magnetic axis up to rho_tor = 0.6. Our results show a pronounced density peaking, moderated by electromagnetic fluctuations. The predicted fusion gain for this scenario is Q = 12.2, aligning well with ITER's mission objectives. We further characterize the turbulence spectra and find that electromagnetic modes, such as microtearing modes, kinetic ballooning modes, and Alfvenic ion temperature gradient modes at low binormal wave numbers, play a critical role in the core transport of this ITER scenario, necessitating high numerical resolution for accurate modeling. Local flux-tube simulations qualitatively reproduce the key features observed in the global gyrokinetic simulations but exhibit a much higher sensitivity to profile gradients, reflecting increased stiffness, likely due to the linearization of the equilibrium profiles and safety factor. Our study also reveals that the imposed external toroidal rotation profiles have a negligible impact on turbulent transport, as their magnitudes are substantially lower than the dominant linear growth rates. Furthermore, we demonstrate that the safety factor profile is of paramount importance: scenarios featuring flat q profiles with near-zero magnetic shear lead to the destabilization of kinetic ballooning modes in the plasma core, significantly enhancing turbulent transport and potentially degrading confinement. Finally, although electron temperature gradient turbulence initially appears large, sometimes exceeding ion-scale transport levels, it is ultimately quenched over long timescales by secular evolution of zonal flows, which are weakly damped under the very low collisionality conditions expected in ITER.",
    "authors": [
      "A. Di Siena",
      "C. Bourdelle",
      "A. Bañón Navarro",
      "G. Merlo",
      "T. Görler",
      "E. Fransson",
      "A. Polevoi",
      "S. H. Kim",
      "F. Koechl",
      "A. Loarte",
      "E. Fable",
      "C. Angioni",
      "P. Mantica",
      "F. Jenko"
    ],
    "published": "2025-11-05T10:12:55Z",
    "updated": "2025-11-05T10:12:55Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2505.04663v2",
    "url": "https://arxiv.org/abs/2505.04663v2",
    "pdf_url": "https://arxiv.org/pdf/2505.04663v2.pdf",
    "title": "CEPC Project Status",
    "abstract": "In this article we give a brief historical review of particle physics achievement through e+e- colliders and proton accelerators in the last half century and perspective for the next half century with worldwide consensus. The Circular Electron Positron Collider (CEPC) is a Higgs factory proposed by Chinese scientists in 2012, and its Technical Design Report (TDR) has been completed in Dec. 2023. Since 2024 CEPC has entered into Engineering Design Report (EDR) phase (2024-2027) and CEPC detector reference design report (Ref-TDR) has been released in Oct. 2025. CEPC plans to apply for the starting the construction in the 16th five year plan (2030-2035).",
    "authors": [
      "Jie Gao"
    ],
    "published": "2025-05-07T03:51:55Z",
    "updated": "2025-11-05T08:49:57Z",
    "categories": [
      "physics.ins-det",
      "physics.acc-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.03250v1",
    "url": "https://arxiv.org/abs/2511.03250v1",
    "pdf_url": "https://arxiv.org/pdf/2511.03250v1.pdf",
    "title": "Development of a Hermetic Gaseous Xenon Detector for Suppressing   External Radon Background",
    "abstract": "Radon-induced backgrounds, particularly from $^{222}$Rn and its beta-emitting progeny, present a critical challenge for next-generation liquid xenon (LXe) detectors aimed at probing dark matter down to the neutrino fog. To address this, we developed a compact hermetic gaseous xenon (GXe) detector. This device physically isolates the active volume from external radon sources by using a PTFE vessel sealed between two quartz flanges with mechanically compressed ePTFE gaskets. To quantify radon sealing performance, we implemented a dual-loop GXe circulation system and conducted a 670-hour radon-injection measurement campaign. Radon ingress into the hermetic detector was monitored using electrostatic radon detectors and photomultiplier tubes (PMTs). From these two independent measurements, the steady-state ratios of the radon concentrations inside the hermetic detector to those outside were estimated to be $ (1.1 \\pm 0.1) \\times 10^{-2} $ and $ (1.1 \\pm 0.2) \\times 10^{-2} $, corresponding to radon-leakage flows of $ (2.9 \\pm 0.3) \\times 10^{-11} $ and $ (2.6 \\pm 0.4) \\times 10^{-11} $ $ \\thinspace $m$^{3}$ $ \\thinspace $ $\\mathrm{s}^{-1}$, respectively. An extrapolation to a 60-tonne LXe TPC such as XLZD suggests that the radon leakage could amount to $ 1.2 \\times 10^{-2} $ $ \\thinspace $mBq, which is negligible compared to the expected natural radon emanation inside the detector, typically 3$ \\thinspace $mBq. These results demonstrate that flange-based mechanical sealing provides an effective solution for realizing radon-isolated inner detectors in large-scale LXe experiments.",
    "authors": [
      "Ryuta Miyata",
      "Koki Fujikawa",
      "Rina Harata",
      "Yoshitaka Itow",
      "Shingo Kazama",
      "Masatoshi Kobayashi"
    ],
    "published": "2025-11-05T07:27:21Z",
    "updated": "2025-11-05T07:27:21Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.03226v1",
    "url": "https://arxiv.org/abs/2511.03226v1",
    "pdf_url": "https://arxiv.org/pdf/2511.03226v1.pdf",
    "title": "Wide frequency-range acceleration using second harmonic RF bucket in   fixed field accelerators",
    "abstract": "We propose a novel acceleration scheme for fixed-field accelerators (FFAs), in which RF buckets with harmonic numbers $h = 1$ and $h = 2$ are time-sequenced to form a single, continuous acceleration path. This approach completes acceleration in two RF frequency sweeps, thereby reducing the total frequency sweep range and shortening the repetition period. The feasibility of this method is demonstrated through longitudinal simulations based on parameters of the FFA at the Institute for Integrated Radiation and Nuclear Science, Kyoto University (KURNS). We also establish operational conditions under which the second harmonic RF bucket remains stable and practically usable.",
    "authors": [
      "Tomonori Uesugi",
      "Yoshihiro Ishi",
      "Yoshiharu Mori"
    ],
    "published": "2025-11-05T06:31:40Z",
    "updated": "2025-11-05T06:31:40Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.03139v1",
    "url": "https://arxiv.org/abs/2511.03139v1",
    "pdf_url": "https://arxiv.org/pdf/2511.03139v1.pdf",
    "title": "α/γ discrimination method for bulky BaF2 detector used in   γ total absorption facility",
    "abstract": "The gamma-ray total absorption facility (GTAF) composed of 40 BaF2 detection units is designed to measure the cross section data of neutron radiation capture reaction online, in order to comply with the experimental nuclear data sheet.We have found that one of the most important sources of experimental background is the initial alpha particles emitted by the BaF2 crystal. Developing data analysis algorithms to eliminate the influence of alpha particles in experimental data has become a key aspect. In this work, in order to meet the needs of data acquisition, online measurement and analysis of neutron radiation cross section, the GTAF data acquisition system adopts a full waveform acquisition method, which results in a large number of data recorded, transmitted, and stored during experiment, which also affects the uncertainty of the cross-section data.Based on the signal waveform characteristics of the BaF2 detection unit, in order to solve the aforementioned problems, three methods, namely the ratio of fast component to total component, pulse width, and time decay constant, are used to identify and distinguish alpha particles and gamma rays. The quality factor FOM is utilized as an evaluation value and several experiments are conducted using three radioactive sources (22Na, 137Cs, 60Co) for verification.",
    "authors": [
      "Chong Zou",
      "Qiwei Zhang",
      "Guangyuan Luan",
      "Hongyi Wu",
      "Haotian Luo",
      "Xuanbo Chen",
      "Xiaoyu Wang",
      "Guozhu He",
      "Jie Ren",
      "Hanxiong Huang",
      "Xichao Ruan",
      "Jie Bao",
      "Xinghua Zhu"
    ],
    "published": "2025-11-05T03:06:17Z",
    "updated": "2025-11-05T03:06:17Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.7498/aps.74.20250017"
  },
  {
    "arxiv_id": "2511.03090v1",
    "url": "https://arxiv.org/abs/2511.03090v1",
    "pdf_url": "https://arxiv.org/pdf/2511.03090v1.pdf",
    "title": "Particle-in-cell simulations of laser crossbeam energy transfer via   magnetized ion-acoustic wave",
    "abstract": "Large magnetic fields, either imposed externally or produced spontaneously, are often present in laser-driven high-energy-density systems. In addition to changing plasma conditions, magnetic fields also directly modify laser-plasma interactions (LPI) by changing participating waves and their nonlonear interactions. In this paper, we use two-dimensional particle-in-cell (PIC) simulations to investigate how magnetic fields directly affect crossbeam energy transfer (CBET) from a pump to a seed laser beam, when the transfer is mediated by the ion-acoustic wave (IAW) quasimode. Our simulations are performed in the parameter space where CBET is the dominant process, and in a linear regime where pump depletion, distribution function evolution, and secondary instabilities are insignificant. We use a Fourier filter to separate out the seed signal, and project the seed fields to two electromagnetic eigenmodes, which become nondegenerate in magnetized plasmas. By comparing the seed energy before CBET occurs and after CBET reaches quasi-steady state, we extract CBET energy gains of both eigenmodes for lasers that are initially linearly polarized. Our simulations reveal that starting from a few MG fields, the two eigenmodes have different gains, and magnetization alters how the gains depend on laser detuning. The overall gain decreases with magnetization when the laser polarizations are initially parallel, while a nonzero gain becomes allowed when the laser polarizations are initially orthogonal. These findings qualitatively agree with theoretical expectations.",
    "authors": [
      "Yuan Shi",
      "John D. Moody"
    ],
    "published": "2025-11-05T00:29:18Z",
    "updated": "2025-11-05T00:29:18Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.03072v1",
    "url": "https://arxiv.org/abs/2511.03072v1",
    "pdf_url": "https://arxiv.org/pdf/2511.03072v1.pdf",
    "title": "Non-Gaussian Magnetic Structures in the Small-Scale Turbulent Dynamo",
    "abstract": "The small-scale turbulent dynamo is a key mechanism for amplifying galactic magnetic fields, yet the resulting field morphology remains poorly understood. Using 3D driven turbulence simulations across a range of compressibilities, characterised by Mach number, and Minkowski functionals, we quantitatively investigate the morphology of magnetic fields generated by the small-scale turbulent dynamo in both the exponentially growing kinematic stage and the statistically steady saturated stage. In both stages and across all Mach numbers, we find that the magnetic field departs significantly from a Gaussian random field. Magnetic structures are statistically less curved and more interconnected in the saturated stage than in the kinematic stage, with these morphological differences decreasing as compressibility increases. Our work provides a quantitative description of how density fluctuations in turbulence and the back-reaction of amplified magnetic fields via the Lorentz force together shape complex, non-Gaussian magnetic structures and offers a valuable framework for comparing simulations with polarisation observations.",
    "authors": [
      "Sasi M. Behara",
      "Amit Seta"
    ],
    "published": "2025-11-04T23:37:47Z",
    "updated": "2025-11-04T23:37:47Z",
    "categories": [
      "astro-ph.GA",
      "astro-ph.IM",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.GA"
  },
  {
    "arxiv_id": "2511.03069v1",
    "url": "https://arxiv.org/abs/2511.03069v1",
    "pdf_url": "https://arxiv.org/pdf/2511.03069v1.pdf",
    "title": "Relativistic multistage resonant and trailing-field acceleration induced   by large-amplitude Alfvén waves in a strong magnetic field",
    "abstract": "We propose a particle acceleration mechanism driven by large-amplitude Alfv\\'en waves in a strong magnetic field. The acceleration process proceeds through multiple stages triggered by counterpropagating wave-particle resonant acceleration (CWRA) via decay instability. Initially, parent and daughter Alfv\\'en waves resonantly accelerate particles perpendicular to the ambient magnetic field. The resultant modulational instability generates electrostatic fields within the wave packet, which are locally amplified by the ponderomotive force of the Alfv\\'en wave packet. These fields subsequently drive further acceleration within a few relativistic gyroperiods via gyroresonant surfing acceleration (GRSA). During this, the v*B force facilitates momentum transfer from the perpendicular to the parallel direction. In the later stage, particles become trapped by the parent wave and gain additional energy through single wave resonant acceleration (SWRA). Furthermore, the accumulation of accelerated particles induces electrostatic trailing fields behind and at the tail of the wave packet, which drive trailing-field acceleration (TFA) of other electrons. The combined effects of these mechanisms, CWRA followed by GRSA and SWRA, result in highly relativistic electron energy. The electron energy accelerated through the above process is higher than that accelerated through TFA. This multistage acceleration process provides insights into the generation of high energy cosmic rays in astrophysical environments.",
    "authors": [
      "S. Isayama",
      "S. Matsukiyo",
      "T. Sano",
      "S. H. Chen"
    ],
    "published": "2025-11-04T23:34:50Z",
    "updated": "2025-11-04T23:34:50Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1103/nccj-mw1y"
  },
  {
    "arxiv_id": "2511.02940v1",
    "url": "https://arxiv.org/abs/2511.02940v1",
    "pdf_url": "https://arxiv.org/pdf/2511.02940v1.pdf",
    "title": "Evolution of an Alfvén Wave-Driven Proton Beam in the Expanding Solar   Wind",
    "abstract": "We investigate the self-consistent formation and long-term evolution of proton beams in the expanding solar wind using an ensemble of one-dimensional hybrid expanding box simulations. Initial conditions are chosen to represent a range of plasma states observed by the Helios spacecraft at 0.3 AU, including an amplitude-modulated Alfv\\'en wave that nonlinearly drives a proton beam aligned with the magnetic field. We compare simulation results with solar wind data out to 1.5 AU and show that our model reproduces key observed features of proton beams on average, such as the radial evolution of the drift and the relative core-to-beam density ratio. These findings support the theory that the observed evolution of the proton beam drift in the solar wind is determined by kinetic instabilities. More broadly, our results indicate that the interplay between nonlinear Alfv\\'en wave dynamics, expansion effects and kinetic instabilities plays a fundamental role in solar wind dynamics, with implications for interpreting solar wind heating rate estimates.",
    "authors": [
      "J. S. Bianco",
      "A. Tenerani",
      "C. Gonzalez",
      "L. Matteini",
      "K. G. Klein"
    ],
    "published": "2025-11-04T19:42:03Z",
    "updated": "2025-11-04T19:42:03Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2511.02939v1",
    "url": "https://arxiv.org/abs/2511.02939v1",
    "pdf_url": "https://arxiv.org/pdf/2511.02939v1.pdf",
    "title": "Characterization of the first full-size production for ePIC TOF layers",
    "abstract": "Low-Gain Avalanche Detectors (LGADs) are characterized by a fast rise time (500 ps) and extremely good time resolution (down to 17 ps). The intrinsic low granularity of LGADs and the large power consumption of readout chips for precise timing are problematic in near-future experiments such as e+e- Higgs factories (FCC-ee) and the ePIC detector at the Electron-Ion Collider. AC-coupled LGADs, where the readout metal is AC-coupled through an insulating oxide layer, could solve both issues at the same time thanks to the 100% fill factor and charge-sharing capabilities. Charge sharing between electrodes allows a hit position resolution well below the pitch/$\\sqrt12$ of standard segmented detectors. At the same time, it relaxes the channel density and power consumption requirements of readout chips. Extensive laboratory characterization of AC-LGAD devices from the first full-size (up to 3x4 cm) production from HPK for ePIC will be shown in this contribution. Both pixel and strip geometry was produced and tested. This study was conducted within the scope of the ePIC detector time of flight (TOF) layer R&D program at the EIC.",
    "authors": [
      "M. Davis",
      "G. Stage",
      "A. Borjigin",
      "S. Beringer",
      "N. Lynch",
      "S. Nakarmi",
      "C. Altafulla",
      "A. Drumm",
      "A. Molnar",
      "A. Tiernan",
      "S. M. Mazza",
      "H. Sadrozinski",
      "B. A. Schumm",
      "A. Seiden",
      "F. Forest",
      "T. Shin"
    ],
    "published": "2025-11-04T19:40:16Z",
    "updated": "2025-11-04T19:40:16Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.02814v1",
    "url": "https://arxiv.org/abs/2511.02814v1",
    "pdf_url": "https://arxiv.org/pdf/2511.02814v1.pdf",
    "title": "Production of High-Specific-Activity Radioisotopes Using High-Energy   Fusion Neutrons",
    "abstract": "We show that transmutation driven by high-energy neutrons from deuterium-tritium (D-T) fusion can produce many medically important radioisotopes-including $^{99}$Mo/${}^{99\\mathrm{m}}\\mathrm{Tc}$, $^{131}$I, $^{177}$Lu, $^{153}$Sm, $^{111}$In, $^{133}$Xe, $^{32}$P, $^{64}$Cu, $^{60}$Co, $^{103}$Pd, $^{89}$Sr, $^{188}$Re, $^{117}$In/$^{117\\mathrm{m}1}$Sn, $^{90}$Y, and $^{166}$Ho - and emerging isotopes such as $^{161}$Tb, $^{195\\mathrm{m}1}$Ir/$^{195\\mathrm{m}}$Pt, $^{47}$Sc, ${}^{103}\\mathrm{Ru}/{}^{103\\mathrm{m}}\\mathrm{Rh}$, ${}^{103}\\mathrm{Pd}/{}^{103\\mathrm{m}}\\mathrm{Rh}$, and $^{119}$Sb with high specific activity and in large quantities. These reactions involve stable, abundant feedstocks and non-fission transmutation channels that change the proton number, enabling chemical rather than isotopic separation. Fusion-based transmutation could provide a flexible and proliferation-resistant platform for supply of high-purity isotopes. A D-T neutron source operating at a few megawatts of fusion power could meet or exceed global demand for most major radioisotopes. Further research is required to develop tailored approaches for feedstock processing and product extraction.",
    "authors": [
      "J. F. Parisi",
      "A. Rutkowski",
      "J. Harter",
      "J. A. Schwartz",
      "S. Chen"
    ],
    "published": "2025-11-04T18:38:38Z",
    "updated": "2025-11-04T18:38:38Z",
    "categories": [
      "nucl-ex",
      "physics.med-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "nucl-ex"
  },
  {
    "arxiv_id": "2503.17524v2",
    "url": "https://arxiv.org/abs/2503.17524v2",
    "pdf_url": "https://arxiv.org/pdf/2503.17524v2.pdf",
    "title": "Temperature-Dependent Calibration Procedures for the Silicon   Photomultiplier Readout of the Cosmic Ray Veto Detector for the Mu2e   Experiment",
    "abstract": "The cosmic ray veto detector for the Mu2e experiment consists of scintillation bars embedded with wavelength-shifting fibers and read out by silicon photomultipliers (SiPMs). In this manuscript the calibration procedures of the SiPMs are described including corrections for the temperature dependence of their light yield. These corrections are needed as the SiPMs are not kept at a constant temperature due to the complexity and cost of implementing a cooling system on such a large detector. Rather, it was decided to monitor the temperature to allow the appropriate corrections to be made. The SiPM temperature dependence has been measured in a dedicated experiment and the calibration procedures were validated with data from production detectors awaiting installation at Fermilab.",
    "authors": [
      "Lincoln Curtis",
      "E. Craig Dukes",
      "Ralf Ehrlich",
      "Josh Greaves",
      "Craig Group",
      "Karl Hardrick",
      "Tyler Horoho",
      "Yuri Oksuzian",
      "Paul Rubinov",
      "Matthew Solt",
      "Yongyi Wu",
      "Anran Zhao"
    ],
    "published": "2025-03-21T20:13:14Z",
    "updated": "2025-11-04T17:47:32Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1016/j.nima.2025.170809"
  },
  {
    "arxiv_id": "2511.02724v1",
    "url": "https://arxiv.org/abs/2511.02724v1",
    "pdf_url": "https://arxiv.org/pdf/2511.02724v1.pdf",
    "title": "Adjustable Low-Cost Highly Sensitive Microwave Oscillator Sensor for   Liquid Level Detection",
    "abstract": "This paper explores the implementation of a low-cost high-precision microwave oscillator sensor with an adjustable input resistance to enhance its limit of detection (LoD). To achieve this, we introduce a \\textit{Z$_{2}$} branch in the input network, comprising a transmission line, a capacitor (\\textit{C$_{B}$}) and a resistor (\\textit{R$_{V}$}). The sensor is tested with eight different liquids with different dielectric constants, including water, IV fluid, milk, ethanol, acetone, petrol, olive oil, and Vaseline. By fine-tuning the \\textit{Z$_{2}$} branch, a clear relationship is found between $\\varepsilon_{r}$ of materials and R$_{V}$.Our experimental results demonstrate outstanding characteristics, including remarkable linearity (nonlinearity < 2.44\\%), high accuracy with an average sensitivity of 21 kHz/$\\mu$m, and an excellent limit of detection (LoD < 0.05 mm). The sensor also exhibits good stability across a range of liquid temperatures and shows robust and repeatable behavior. Considering the strong absorption of microwave energy in liquids with high dielectric constants, this oscillator sensor is a superior choice over capacitive sensors for such applications. We validate the performance of the oscillator sensor using water as a representative liquid. Additionally, we substantiate the sensor's improvement through both experimental results and theoretical analysis. Its advantages, including affordability, compatibility with CMOS and MEMS technologies, and ease of fabrication, make it an excellent choice for small-scale liquid detection applications.",
    "authors": [
      "Mojtaba Joodaki",
      "Mehrdad Jafarian"
    ],
    "published": "2025-11-04T16:50:12Z",
    "updated": "2025-11-04T16:50:12Z",
    "categories": [
      "physics.app-ph",
      "cs.SY",
      "eess.SY",
      "physics.ins-det"
    ],
    "primary_category": "physics.app-ph"
  },
  {
    "arxiv_id": "2511.02671v1",
    "url": "https://arxiv.org/abs/2511.02671v1",
    "pdf_url": "https://arxiv.org/pdf/2511.02671v1.pdf",
    "title": "Time-based Selection of Kaonic Atom X-ray Events with   Quasi-Hemispherical CZT Detectors at the DAFNE collider",
    "abstract": "This work presents the results of a time-based event selection for searching X-ray signals from kaonic atom X-ray transition using a single quasi-hemispherical Cadmium-Zinc-Telluride (CZT) detector at the DA$\\Phi$NE collider. To mitigate the high background level in the measured X-ray spectrum, a dedicated event selection strategy was developed, exploiting the precise timing correlation between e+e- collisions and detector signals. This approach enabled, for the first time, the observation of two characteristic X-ray transitions from kaonic aluminum atoms using a CZT detector: for the 5-4 transition at 50~keV, 362~$\\pm$~41~(stat.)~$\\pm$~20~(sys.) signal events over 1698~$\\pm$~197~(stat.)~$\\pm$~25~(sys.) background events in 5$\\sigma$ were observed, with a resolution of 9.2\\%~FWHM; for the 4-3 transition at 106~keV, 295~$\\pm$~50~(stat.)~$\\pm$~20~(sys.) signal events over 2939~$\\pm$~500~(stat.)~$\\pm$~16~(sys.) background events in 5$\\sigma$ were measured, with a resolution of 6.6 ~FWHM. A strong background suppression of approximately 95\\% of the triggered data was achieved through this time-based selection. The demonstrated timing capability of the CZT detector proved highly effective in isolating time-correlated events within an 80 ns window, setting an important benchmark for the application of these semiconductors in timing-based X-ray spectroscopy. These results highlight the potential of CZT-based detection systems for future precision measurements in high-radiation environments, paving the way for compact, room-temperature X-ray and $\\gamma$-ray spectrometers in fundamental physics and beyond.",
    "authors": [
      "Francesco Artibani",
      "Leonardo Abbene",
      "Antonino Buttacavoli",
      "Manuele Bettelli",
      "Gaetano Gerardi",
      "Fabio Principato",
      "Andrea Zappettini",
      "Massimiliano Bazzi",
      "Giacomo Borghi",
      "Damir Bosnar",
      "Mario Bragadireanu",
      "Marco Carminati",
      "Alberto Clozza",
      "Francesco Clozza",
      "Raffaele Del Grande",
      "Luca De Paolis",
      "Carlo Fiorini",
      "Ivica Friscic",
      "Carlo Guaraldo",
      "Mihail Iliescu",
      "Masahiko Iwasaki",
      "Aleksander Khreptak",
      "Simone Manti",
      "Johann Marton",
      "Pawel Moskal",
      "Fabrizio Napolitano",
      "Hiroaki Ohnishi",
      "Kristian Piscicchia",
      "Francesco Sgaramella",
      "Michal Silarski",
      "Diana Laura Sirghi",
      "Florin Sirghi",
      "Magdalena Skurzok",
      "Antonio Spallone",
      "Kairo Toho",
      "Lorenzo G. Toscano",
      "Oton Vazquez Doce",
      "Johann Zmeskal",
      "Catalina Curceanu",
      "Alessandro Scordo"
    ],
    "published": "2025-11-04T15:49:22Z",
    "updated": "2025-11-04T15:49:22Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2412.19859v3",
    "url": "https://arxiv.org/abs/2412.19859v3",
    "pdf_url": "https://arxiv.org/pdf/2412.19859v3.pdf",
    "title": "Statistical research on determining sensitivity of neutrinoless double   beta decays",
    "abstract": "The determination of experimental sensitivity is a key step in the search for neutrinoless double beta decay ($0\\nu\\beta\\beta$), providing a quantitative benchmark for detector design. Two commonly used statistical approaches are the counting method, which estimates sensitivity from the number of events in a predefined region of interest, and the fitting method, which extracts the signal contribution by fitting the full energy spectrum. In this work, we investigate both discovery sensitivity and exclusion sensitivity within these two approaches. Through statistical derivation and simulation verification, we show that the relative performance of the methods depends on both energy resolution and exposure, while at higher exposures the fitting method consistently yields more stringent sensitivity. These results provide guidance for selecting the optimal statistical method in future $0\\nu\\beta\\beta$ experiments.",
    "authors": [
      "Haoyang Fu",
      "Wentai Luo",
      "Xiangpan Ji",
      "Shaomin Chen"
    ],
    "published": "2024-12-26T03:45:15Z",
    "updated": "2025-11-04T15:35:37Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2504.00541v3",
    "url": "https://arxiv.org/abs/2504.00541v3",
    "pdf_url": "https://arxiv.org/pdf/2504.00541v3.pdf",
    "title": "LEP3: A High-Luminosity e+e- Higgs and ElectroweakFactory in the LHC   Tunnel",
    "abstract": "As stated in the 2019 European Strategy for Particle Physics (ESPP), it is of the utmost importance that the HL-LHC upgrade of the accelerator and the experiments be successfully completed in a timely manner. All necessary efforts should be devoted to achieving this goal. We also recall two of the principal recommendations of the 2019 ESPP for future accelerator initiatives, namely that 1) An electron-positron Higgs factory is the highest priority for the next collider (Rec. c). 2) Europe, together with its international partners, should investigate the technical and financial feasibility of a future hadron collider at CERN with a centre-of-mass energy of at least 100 TeV and with an electron-positron Higgs and electroweak factory as a possible first stage (Rec. e). A major objective in particle physics is always to operate an accelerator that allows a leap of an order of magnitude in the constituent centre-of-mass energy with respect to the previous one. We support FCC-ee and FCC-hh as the preferred option for CERN future, as it addresses both of the above recommendations.   The guidance for the 2025 ESPP requests, in addition to the preferred option, the inclusion of ``prioritised alternatives to be pursued if the chosen preferred option turns out not to be feasible or competitive''. Proposed alternatives to the preferred FCC option include linear, muon colliders and LHeC accelerators. In response to this request we propose reusing the existing LHC tunnel for an electron-positron collider, called LEP3, as a back-up alternative if the FCC cannot proceed. LEP3 leverages much of the R\\&D conducted for FCC-ee, offers high-precision studies of Z, W, and Higgs bosons below the tt threshold, and offers potential physics performance comparable or superior to other fallback options at a lower cost while supporting continued R\\&D towards a next-generation energy frontier machine.",
    "authors": [
      "C. Anastopoulos",
      "R. Assmann",
      "A. Ball",
      "O. Bruning",
      "O. Buchmueller",
      "T. Camporesi",
      "P. Collier",
      "J Dainton",
      "G. Davies",
      "J. R. Ellis",
      "B. Goddard",
      "L. Gouskos",
      "M. Klute",
      "M. Koratzinos",
      "G. Landsberg",
      "K. Long",
      "L. Malgeri",
      "F. Maltoni",
      "F. Moortgat",
      "C. Mariotti",
      "S. Myers",
      "J. A. Osborne",
      "M. Pierini",
      "D. R. Tovey",
      "D. Treille",
      "T. S. Virdee",
      "N. Wardle",
      "M. Zanetti"
    ],
    "published": "2025-04-01T08:47:19Z",
    "updated": "2025-11-04T15:25:53Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex",
      "hep-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.02617v1",
    "url": "https://arxiv.org/abs/2511.02617v1",
    "pdf_url": "https://arxiv.org/pdf/2511.02617v1.pdf",
    "title": "Exploring mechanisms leading to composition errors in monazite (CePO4)   analysed with atom probe tomography",
    "abstract": "Monazite (CePO4) is widely used in U-Th-Pb geochronology due to its reliable age determinations, although isotopic disturbances often require nanoscale investigation to better understand the mechanisms at play. Atom Probe Tomography (APT) offers unique capabilities for nanoscale chemical analysis and 3D atomic reconstruction but presents challenges for insulating materials such as CePO4, particularly due to oxygen loss during field evaporation. This study investigates the effects of laser wavelength, energy, metallic coatings and detection device on mass spectrum optimization and compositional accuracy in synthetic CePO4 samples. Results show that shorter laser wavelengths (260 nm) enhance peak resolution, particularly when combined with advanced reflectron configurations, as demonstrated with the LEAP 6000 XR. Chromium coatings further improve thermal dissipation and reduce noise levels. However, compositional measurements reveal systematic underestimation of oxygen and overestimation of P and Ce, likely influenced by preferential low-field element evaporation. These findings highlight the need to carefully tune experimental parameters to mitigate quantification biases and enhance the reliability of APT analyses for geological materials.",
    "authors": [
      "Tom Veret",
      "Fabien Delaroche",
      "Ivan Blum",
      "Jonathan Houard",
      "Benjamin Klaes",
      "Isabelle Mouton",
      "Frederic De-Geuser",
      "Anne-Magali Seydoux-Guillaume",
      "François Vurpillot"
    ],
    "published": "2025-11-04T14:43:39Z",
    "updated": "2025-11-04T14:43:39Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2511.02513v1",
    "url": "https://arxiv.org/abs/2511.02513v1",
    "pdf_url": "https://arxiv.org/pdf/2511.02513v1.pdf",
    "title": "Pulse shape simulation for the reduced charge collection layer in p-type   high-purity germanium detectors",
    "abstract": "$P$-type high-purity germanium (HPGe) detectors are widely used across many scientific domains, and current data analysis methods have served well in many use cases. However, applications like low-background experiments that search for rare physics, such as dark matter, neutrinoless double-beta decay, and coherent elastic neutrino-nucleus scattering, could profit a lot from a more detailed understanding of the detector response close to the surface. The outer $n^+$ electrode of the $p$-type HPGe detector forms a layer with reduced charge collection, and events originating here can be a critical background source in such experiments. If the difference in detector pulse shape between detector surface and bulk events is known, it can be used to identify and veto these background events. However, a faithful simulation of the detector response in this surface region is difficult and has not been available as a standard method so far. We present a novel three-dimensional pulse shape simulation method for this reduced charge collection (RCC) layer. We have implemented this method as a new feature in the open-source simulation package \\emph{SolidStateDetectors.jl} and show a validation of the numerical simulation results with analytical calculations. An experimental study using a $p$-type HPGe detector also validates our approach. The current implementation supports $p$-type HPGe detectors of fairly arbitrary geometry, but is easily adaptable to $n$-type detectors by adjusting the impurity density profile of the layer. It should also be adaptable to other semiconductor materials in a straightforward fashion.",
    "authors": [
      "P. Zhang",
      "W. Dai",
      "Q. Zhang",
      "F. Hagemann",
      "O. Schulz",
      "C. Alvarez-Garcia",
      "L. Yang",
      "Q. Yue",
      "Z. Zeng",
      "J. Cheng",
      "H. Ma"
    ],
    "published": "2025-11-04T12:04:20Z",
    "updated": "2025-11-04T12:04:20Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "1909.13022v3",
    "url": "https://arxiv.org/abs/1909.13022v3",
    "pdf_url": "https://arxiv.org/pdf/1909.13022v3.pdf",
    "title": "ANUBIS: Proposal to search for long-lived neutral particles in CERN   service shafts",
    "abstract": "Long-lived particles are predicted by many extensions of the Standard Model and have been gaining interest in recent years. In this Letter we present a competitive proposal that substantially extends the sensitivity in lifetime by instrumenting the existing service shafts above the ATLAS or CMS experiments with tracking stations. For scenarios with electrically neutral long-lived particles with $m \\gtrsim 1$~GeV, the lifetime reach is increased by 2-3 orders of magnitude compared to currently operating and approved future experiments at the LHC. A detector design proposal is outlined along with projected costs.",
    "authors": [
      "Martin Bauer",
      "Oleg Brandt",
      "Lawrence Lee",
      "Christian Ohm"
    ],
    "published": "2019-09-28T04:24:13Z",
    "updated": "2025-11-04T10:57:13Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.02467v1",
    "url": "https://arxiv.org/abs/2511.02467v1",
    "pdf_url": "https://arxiv.org/pdf/2511.02467v1.pdf",
    "title": "Demonstration of Sub-Percent Energy Resolution in the NEXT-100 Detector",
    "abstract": "NEXT-100 is a high-pressure xenon time projection chamber with electroluminescent amplification, designed to operate with up to approximately 70.5 kg at 13.5 bar. It is the most recent detector developed by the NEXT collaboration to search for the neutrinoless double-beta decay ($\\beta\\beta 0\\nu$) of Xe-136. The NEXT gas TPC technology offers the best energy resolution near the Q-value of the decay ($Q_{\\beta\\beta}$ = 2458 keV) among xenon detectors, which is set by design to be <1% FWHM. We report here the high-energy calibration of the detector using a Th-228 source, demonstrating linear response and an energy resolution of $(0.90 \\pm 0.02)$% FWHM at the Tl-208 photopeak (2615 keV). This performance extrapolates to a resolution at the double-beta decay end-point of $R(Q_{\\beta\\beta})$ = $(0.93 \\pm 0.02)$% FWHM, confirming the detector's capability for precision energy measurement in the search for $\\beta\\beta 0\\nu$.",
    "authors": [
      "NEXT Collaboration",
      "M. Pérez Maneiro",
      "M. Martínez-Vara",
      "S. Torelli",
      "G. Martínez-Lema",
      "P. Novella",
      "J. A. Hernando Morata",
      "J. J. Gómez-Cadenas",
      "C. Adams",
      "H. Almazán",
      "V. Álvarez",
      "A. I. Aranburu",
      "L. Arazi",
      "I. J. Arnquist",
      "F. Auria-Luna",
      "S. Ayet",
      "Y. Ayyad",
      "C. D. R. Azevedo",
      "K. Bailey",
      "F. Ballester",
      "J. E. Barcelon",
      "M. del Barrio-Torregrosa",
      "A. Bayo",
      "J. M. Benlloch-Rodríguez",
      "F. I. G. M. Borges",
      "A. Brodoline",
      "N. Byrnes",
      "A. Castillo",
      "E. Church",
      "L. Cid",
      "M. Cid",
      "X. Cid",
      "C. A. N. Conde",
      "C. Cortes-Parra",
      "F. P. Cossío",
      "R. Coupe",
      "E. Dey",
      "P. Dietz",
      "C. Echeverria",
      "M. Elorza",
      "R. Esteve",
      "R. Felkai",
      "L. M. P. Fernandes",
      "P. Ferrario",
      "F. W. Foss",
      "Z. Freixa",
      "J. García-Barrena",
      "J. W. R. Grocott",
      "R. Guenette",
      "J. Hauptman",
      "C. A. O. Henriques",
      "P. Herrero-Gómez",
      "V. Herrero",
      "C. Hervés Carrete",
      "Y. Ifergan",
      "A. F. B. Isabel",
      "B. J. P. Jones",
      "F. Kellerer",
      "L. Larizgoitia",
      "A. Larumbe",
      "P. Lebrun",
      "F. Lopez",
      "N. López-March",
      "R. Madigan",
      "R. D. P. Mano",
      "A. Marauri",
      "A. P. Marques",
      "J. Martín-Albo",
      "A. Martínez",
      "R. L. Miller",
      "K. Mistry",
      "J. Molina-Canteras",
      "F. Monrabal",
      "C. M. B. Monteiro",
      "F. J. Mora",
      "K. E. Navarro",
      "D. R. Nygren",
      "E. Oblak",
      "J. Palacio",
      "B. Palmeiro",
      "A. Para",
      "I. Parmaksiz",
      "A. Pazos",
      "J. Pelegrin",
      "M. Querol",
      "J. Renner",
      "I. Rivilla",
      "C. Rogero",
      "L. Rogers",
      "B. Romeo",
      "C. Romo-Luque",
      "E. Ruiz-Chóliz",
      "P. Saharia",
      "F. P. Santos",
      "J. M. F. dos Santos",
      "M. Seemann",
      "I. Shomroni",
      "A. L. M. Silva",
      "P. A. O. C. Silva",
      "A. Simón",
      "S. R. Soleti",
      "M. Sorel",
      "J. Soto-Oton",
      "J. M. R. Teixeira",
      "S. Teruel-Pardo",
      "J. F. Toledo",
      "C. Tonnelé",
      "J. Torrent",
      "A. Trettin",
      "P. R. G. Valle",
      "M. Vanga",
      "P. Vázquez Cabaleiro",
      "J. F. C. A. Veloso",
      "J. D. Villamil",
      "J. Waiton",
      "A. Yubero-Navarro"
    ],
    "published": "2025-11-04T10:50:29Z",
    "updated": "2025-11-04T10:50:29Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.02405v1",
    "url": "https://arxiv.org/abs/2511.02405v1",
    "pdf_url": "https://arxiv.org/pdf/2511.02405v1.pdf",
    "title": "Simulation of multi-species kinetic instabilities with the Numerical   Flow Iteration",
    "abstract": "Kinetic instabilities are one of the most challenging aspects in computational plasma physics. Accurately capturing their onset and evolution requires fine resolution of the high-dimensional distribution functions of each relevant species, which quickly becomes computationally prohibitively expensive. Additionally, plasma dynamics is an inherently multi-scale phenomenon due to the vast separation of scales between heavy ions and light-weight electrons. In previous work the Numerical Flow Iteration (NuFI) was suggested as a high-fidelity alternative with reduced memory complexity making it an interesting candidate to simulate complicated kinetic instabilities. In this work we extend NuFI to non-periodic boundary conditions and demonstrate how it is possible to reduce the computational complexity to allow for longer simulation periods.",
    "authors": [
      "Rostislav-Paul Wilhelm",
      "Manuel Torrilhon"
    ],
    "published": "2025-11-04T09:37:10Z",
    "updated": "2025-11-04T09:37:10Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.02403v1",
    "url": "https://arxiv.org/abs/2511.02403v1",
    "pdf_url": "https://arxiv.org/pdf/2511.02403v1.pdf",
    "title": "Yield and performance validation of the Monolithic Stitched Sensor   (MOSS), the first wafer-scale prototype for the ALICE ITS3 upgrade",
    "abstract": "The ALICE Inner Tracking System upgrade (ITS3) will employ stitched, wafer-scale Monolithic Active Pixel Sensors (MAPS) for the first time in high-energy physics, achieving a material budget of only 0.09$\\,$%$\\,$X$\\mathrm{_{0}}$ per layer. Its first stitched prototype, the Monolithic Stitched Sensor (MOSS), underwent serial testing confirming sensor yield compliance with ITS3 requirements. In-beam tests show the device meets the ITS3 efficiency requirement of >$\\,$99$\\,$% while maintaining a fake-hit rate below 0.1$\\,$hits/pixel/s, with performance sustained up to irradiation levels of 4$\\,$kGy and $4\\times10^{12}$1MeV$\\,$n$\\mathrm{_{eq}}\\,$cm$\\mathrm{^{-2}}$. The sensor demonstrates excellent charge-collection properties and linearity between time-over-threshold and deposited energy in the 1.8 - 6.5$\\,$keV range in response to soft X-ray emissions. This article provides an overview of the validation steps and characterisation results.",
    "authors": [
      "Marius Wilm Menzel"
    ],
    "published": "2025-11-04T09:32:53Z",
    "updated": "2025-11-04T09:32:53Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.02381v1",
    "url": "https://arxiv.org/abs/2511.02381v1",
    "pdf_url": "https://arxiv.org/pdf/2511.02381v1.pdf",
    "title": "Laser diagnostics for negative ion source optimization: insights from   SPIDER at the ITER Neutral Beam Test Facility",
    "abstract": "The ITER Heating Neutral Beams (HNBs) require large, high-energy H/D atom beams (285/330 A/m^2 extracted current density, and 1/0.87 MeV acceleration energy, respectively for H and D). To address the associated challenges, the SPIDER negative ion RF beam source at the Neutral Beam Test Facility (NBTF) in Padova (Italy) serves as a full-scale source prototype with a 100 kV triode accelerator, for design validation and performance verification. SPIDER is equipped with two advanced laser diagnostics to monitor key plasma parameters; Cavity Ring-Down Spectroscopy (CRDS) is used to measure H$^-$\\slash D$^-$ ion densities, while Laser Absorption Spectroscopy (LAS) tracks caesium neutral density in the source. These measurements are essential for optimizing negative ion production and meeting ITER source targets. We present diagnostic upgrade details, recent experimental results, and correlations with other machine parameters. Since CRDS relies on a single 4.637-meter-long optical cavity, the longest used in such sources, it has demonstrated sensitivity to alignment. Based on recent experimental experience, structural improvements are being implemented to enhance both stability and measurement reliability. LAS has mainly been employed as a tool to monitor the caesium conditioning status of SPIDER. Additionally, due to a distributed measurement over four lines of sight, LAS has proven effective in monitoring the caesium distribution within the source. This work demonstrates the essential role of laser diagnostics in developing ITER-relevant plasma sources and informs ongoing efforts to improve measurement accuracy in challenging environments.",
    "authors": [
      "R. Agnello",
      "M. Barbisan",
      "R. Pasqualotto",
      "B. Pouradier-Duteil",
      "E. Sartori",
      "A. Tiso",
      "B. Zaniol"
    ],
    "published": "2025-11-04T09:03:09Z",
    "updated": "2025-11-04T09:03:09Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2505.13926v4",
    "url": "https://arxiv.org/abs/2505.13926v4",
    "pdf_url": "https://arxiv.org/pdf/2505.13926v4.pdf",
    "title": "An exploratory study of a tellurium-loaded liquid scintillator based on   water and p-dioxane",
    "abstract": "Tellurium-loaded liquid scintillators are critical for neutrinoless double-beta decay experiments. However, conventional organic scintillators are constrained by the limited solubility of organic tellurium compounds compared with that of inorganic ones in water, whereas water-based scintillators are likely constrained by the destabilization of surfactants caused by inorganic tellurium compounds. In this work, a surfactant-free water-containing route is explored, in which an aqueous telluric acid solution is introduced into a water-miscible organic scintillator comprising p-dioxane, naphthalene, and PPO. The phase behavior of this system is mapped to delineate homogeneous-mixture domains and to estimate practical upper bounds on tellurium loading. Optical properties are characterized by UV-visible absorption spectroscopy and fluorescence spectroscopy. The scintillation light yield is obtained with a relative method that compares to a reference LAB-PPO scintillator. The measurements demonstrate scintillation quenching induced by water and by tellurium acid. These results provide benchmarks for water-containing and surfactant-free formulations and support the development of high-loading liquid scintillators for future detector design.",
    "authors": [
      "Ye Liang",
      "Haozhe Sun",
      "Zhe Wang"
    ],
    "published": "2025-05-20T04:42:24Z",
    "updated": "2025-11-04T09:03:01Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.02333v1",
    "url": "https://arxiv.org/abs/2511.02333v1",
    "pdf_url": "https://arxiv.org/pdf/2511.02333v1.pdf",
    "title": "Status of the HENSA collaboration at the Canfranc Underground   Laboratory: results from two years of measurement of the neutron flux in hall   B",
    "abstract": "Thiswork deals with the characterization of the neutron flux in hall B of the CanfrancUnderground Laboratory (LSC) employing the High Efficiency Neutron Spectrometry Array (HENSA). The ultimate goal of this measurement is to set a limit on the corresponding effects of the neutron flux in the background of the ANAIS-112 experiment. The preliminary neutron counting rates of two years of measurement are reported. Various data analysis techniques, including pulse shape discrimination, are discussed. The first results on the spectral reconstruction of the neutron flux are also presented.",
    "authors": [
      "N. Mont-Geli",
      "A. Tarifeño-Saldivia",
      "G. Cortés",
      "J. L. Tain",
      "M. Grieger",
      "A. Quero-Ballesteros",
      "M. Pallàs",
      "J. Agramunt",
      "A. Algora",
      "J. Amaré",
      "D. Bemmerer",
      "F. Calviño",
      "D. Cano-Ott",
      "S. Cebrián",
      "D. Cintas",
      "I. Coarasa",
      "A. De Blas",
      "I. Dillman",
      "L. M. Fraile",
      "E. García",
      "R. Garcia",
      "A. M. Lallena",
      "M. Martínez",
      "T. Martínez",
      "E. Nacher",
      "S. E. A. Orrigo",
      "Y. Ortigoza",
      "A. Ortiz de Solórzano",
      "T. Pardo",
      "J. Plaza",
      "J. Puimedón",
      "M. L. Sarsa"
    ],
    "published": "2025-11-04T07:38:21Z",
    "updated": "2025-11-04T07:38:21Z",
    "categories": [
      "physics.ins-det",
      "physics.geo-ph"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.22323/1.441.0312"
  },
  {
    "arxiv_id": "2502.18995v2",
    "url": "https://arxiv.org/abs/2502.18995v2",
    "pdf_url": "https://arxiv.org/pdf/2502.18995v2.pdf",
    "title": "Demonstrating the ability of IceCube DeepCore to probe Earth's interior   with atmospheric neutrino oscillations",
    "abstract": "The IceCube Neutrino Observatory is an optical Cherenkov detector instrumenting one cubic kilometer of ice at the South Pole. The Cherenkov photons emitted following a neutrino interaction are detected by digital optical modules deployed along vertical strings within the ice. The densely instrumented bottom central region of the IceCube detector, known as DeepCore, is optimized to detect GeV-scale atmospheric neutrinos. As upward-going atmospheric neutrinos pass through Earth, matter effects alter their oscillation probabilities due to coherent forward scattering with ambient electrons. These matter effects depend upon the energy of neutrinos and the density distribution of electrons they encounter during their propagation. Using simulated data at the IceCube Deepcore equivalent to its 9.3 years of observation, we demonstrate that atmospheric neutrinos can be used to probe the broad features of the Preliminary Reference Earth Model. In this contribution, we present the preliminary sensitivities for establishing the Earth matter effects, validating the non-homogeneous distribution of Earth's electron density, and measuring the mass of Earth. Further, we also show the DeepCore sensitivity to perform the correlated density measurement of different layers incorporating constraints on Earth's mass and moment of inertia.",
    "authors": [
      "Sharmistha Chattopadhyay",
      "Krishnamoorthi J",
      "Anuj Kumar Upadhyay"
    ],
    "published": "2025-02-26T09:58:34Z",
    "updated": "2025-11-04T05:12:47Z",
    "categories": [
      "hep-ph",
      "hep-ex",
      "physics.geo-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ph",
    "doi": "10.1140/epjs/s11734-025-01741-6"
  },
  {
    "arxiv_id": "2511.02151v1",
    "url": "https://arxiv.org/abs/2511.02151v1",
    "pdf_url": "https://arxiv.org/pdf/2511.02151v1.pdf",
    "title": "Plasma Processing of FRIB Low-Beta Cryomodules using Higher-Order-Modes",
    "abstract": "Improvement in SRF accelerator performance after in-tunnel plasma processing has been seen at SNS and CEBAF. Plasma processing development for FRIB quarter-wave and half-wave resonators (QWRs, HWRs) was initiated in 2020. Plasma processing on individual QWRs (beta = 0.085) and HWRs (beta = 0.53) has been found to significantly reduce field emission. A challenge for the FRIB cavities is the relatively weak fundamental power coupler (FPC) coupling strength (chosen for efficient continuous-wave acceleration), which produces a lot of mismatch during plasma processing at room temperature. For FRIB QWRs, driving the plasma with higher-order modes (HOMs) is beneficial to reduce the FPC mismatch and increase the plasma density. The first plasma processing trial on a spare FRIB QWR cryomodule was done in January 2024, with before-and-after bunker tests and subsequent installation into the linac tunnel. The first in-tunnel plasma processing trial was completed in September 2025. For both cryomodules, before-and-after cold tests showed a significant increase in the average accelerating gradient for field emission onset after plasma processing for some cavities. In parallel with the cryomodule trials, the use of dual-drive plasma is being explored with the goal of improving the effectiveness of plasma processing.",
    "authors": [
      "P. Tutt",
      "W. Chang",
      "K. Elliott",
      "W. Hartung",
      "S. Kim",
      "K. Saito",
      "T. Xu"
    ],
    "published": "2025-11-04T00:42:10Z",
    "updated": "2025-11-04T00:42:10Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.02092v1",
    "url": "https://arxiv.org/abs/2511.02092v1",
    "pdf_url": "https://arxiv.org/pdf/2511.02092v1.pdf",
    "title": "Uncertainty Guided Online Ensemble for Non-stationary Data Streams in   Fusion Science",
    "abstract": "Machine Learning (ML) is poised to play a pivotal role in the development and operation of next-generation fusion devices. Fusion data shows non-stationary behavior with distribution drifts, resulted by both experimental evolution and machine wear-and-tear. ML models assume stationary distribution and fail to maintain performance when encountered with such non-stationary data streams. Online learning techniques have been leveraged in other domains, however it has been largely unexplored for fusion applications. In this paper, we present an application of online learning to continuously adapt to drifting data stream for prediction of Toroidal Field (TF) coils deflection at the DIII-D fusion facility. The results demonstrate that online learning is critical to maintain ML model performance and reduces error by 80% compared to a static model. Moreover, traditional online learning can suffer from short-term performance degradation as ground truth is not available before making the predictions. As such, we propose an uncertainty guided online ensemble method to further improve the performance. The Deep Gaussian Process Approximation (DGPA) technique is leveraged for calibrated uncertainty estimation and the uncertainty values are then used to guide a meta-algorithm that produces predictions based on an ensemble of learners trained on different horizon of historical data. The DGPA also provides uncertainty estimation along with the predictions for decision makers. The online ensemble and the proposed uncertainty guided online ensemble reduces predictions error by about 6%, and 10% respectively over standard single model based online learning.",
    "authors": [
      "Kishansingh Rajput",
      "Malachi Schram",
      "Brian Sammuli",
      "Sen Lin"
    ],
    "published": "2025-11-03T22:03:37Z",
    "updated": "2025-11-03T22:03:37Z",
    "categories": [
      "cs.LG",
      "cs.AI",
      "physics.plasm-ph"
    ],
    "primary_category": "cs.LG"
  },
  {
    "arxiv_id": "2511.02075v1",
    "url": "https://arxiv.org/abs/2511.02075v1",
    "pdf_url": "https://arxiv.org/pdf/2511.02075v1.pdf",
    "title": "Detecting Shearless Phase-Space Transport Barriers in Global Gyrokinetic   Turbulence Simulations with Test Particle Map Models",
    "abstract": "In magnetically confined fusion plasmas, the role played by zonal E$\\times$B flow shear layers in the suppression of turbulent transport is relatively well-understood. However, less is understood about the role played by the weak shear regions that arise in the non-monotonic radial electric field profiles often associated with these shear layers. In electrostatic simulations from the global total-f gyrokinetic particle-in-cell code XGC, we demonstrate how shearless regions with non-zero flow curvature form zonal \"jets\" that, in conjunction with neighboring regions of shear, can act as robust barriers to particle transport and turbulence spreading. By isolating quasi-coherent fluctuations radially localized to the zonal jets, we construct a map model for the Lagrangian dynamics of gyrokinetic test particles in the presence of drift waves. We identify the presence of shearless invariant tori in this model and verify that these tori act as partial phase-space transport barriers in the simulations. We also demonstrate how avalanches impinging on these shearless tori cause reconnection events that form \"cold/warm core ring\" structures analogous to those found in oceanic jets, facilitating transport across the barriers without destroying them completely. We discuss how shearless tori may generically arise from tertiary instabilities or other types of discrete eigenmodes, suggesting their potential relevance to broader classes of turbulent fluctuations.",
    "authors": [
      "Norman M. Cao",
      "Hongxuan Zhu",
      "Gabriel C. Grime",
      "Timothy Stoltzfus-Dueck"
    ],
    "published": "2025-11-03T21:25:43Z",
    "updated": "2025-11-03T21:25:43Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.02070v1",
    "url": "https://arxiv.org/abs/2511.02070v1",
    "pdf_url": "https://arxiv.org/pdf/2511.02070v1.pdf",
    "title": "Integrated Observation of Isotope-Dependent Turbulence, Zonal Flow, and   Turbulence-Driven Transport",
    "abstract": "To address the long-standing unresolved issue of \"isotope effect\" in plasma transport, this study investigates the hydrogen/deuterium (H/D) isotope dependence of a nonlinear turbulence system. The analysis focuses on the zonal flow (ZF) activity, turbulence properties, their nonlinear interaction, and resulting turbulent transport in a torus plasma. ZF activity, observed in low-density electron cyclotron heating plasmas in Heliotron J, is enhanced with increasing D gas fraction from 10 to 80 percent. While the turbulence scale size in the edge region (rho approx 0.8) is larger in D plasmas, the reduction and decoupling of fluctuations, associated with an enhanced ZF, results in beneficial impacts on turbulent transport, driven by an enhanced nonlinear coupling between the ZF and turbulence in D plasmas. These differences in the turbulence nature lead to the significant reduction of turbulence-induced transport observed in the D plasma. These comprehensive observations suggest that the isotope dependence on the turbulence system is essential for explaining the isotope effect on confinement improvement and is vital in predicting the performance of future fusion reactors.",
    "authors": [
      "Shinsuke Ohshima",
      "Hiroyuki Okada",
      "Shinji Kobayashi",
      "Shinichiro Kado",
      "Takashi Minami",
      "Fumiyoshi Kin",
      "Shigeru Inagaki",
      "Shigeru Konoshima",
      "Tohru Mizuuchi",
      "Kazunobu Nagasaki"
    ],
    "published": "2025-11-03T21:10:05Z",
    "updated": "2025-11-03T21:10:05Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.02035v1",
    "url": "https://arxiv.org/abs/2511.02035v1",
    "pdf_url": "https://arxiv.org/pdf/2511.02035v1.pdf",
    "title": "Experimental verification of space-charge saturation scaling laws in   high-gradient photocathode RF guns",
    "abstract": "We investigate the limits of photoemission yield in a high-gradient S-band radiofrequency photoinjector in the space-charge-dominated regime. Using an RF phase-scan technique, where the emitted charge is measured as a function of the RF-field phase in the gun, we directly monitor photoemission over a range of launch fields and laser parameters, enabling quantitative characterization of space-charge saturation. Measurements, supported by simulations and analytic modeling, confirm the characteristic charge-field scaling laws for pancake beams and provide the first experimental verification of cigar-regime scaling in an RF photogun. These results establish a predictive framework for identifying the onset of space-charge saturation and guide the optimization of photoinjectors for ultrafast electron diffraction, microscopy, and high-brightness light sources operating at ultra-high gradients.",
    "authors": [
      "Paul Denham",
      "David Garcia",
      "Atharva Kulkarni",
      "Brian Schaap",
      "Ziteng Liu",
      "Pietro Musumeci",
      "Daniele Filippetto"
    ],
    "published": "2025-11-03T20:17:46Z",
    "updated": "2025-11-03T20:17:46Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.02028v1",
    "url": "https://arxiv.org/abs/2511.02028v1",
    "pdf_url": "https://arxiv.org/pdf/2511.02028v1.pdf",
    "title": "Unified Model of Heated Plasma Expansion",
    "abstract": "Motivated by the need to predict plasma density and temperature distributions created in the early stages of high-intensity laser-plasma interactions, we develop a fluid model of plasma expansion into vacuum that incorporates external heating. We propose a new three-parameter family of self-similar solutions for plasma expansion that models a wide range of spatiotemporal variations of the electron temperature. Depending on the relative scales of the heated plasma domain $L$, the Debye length $\\lambda_D$ and an emergent ion-acoustic correlation length $\\lambda_s$, characterized by the parameters $\\lambda_s/\\lambda_D$ and $L/\\lambda_s$, a spectrum of dynamical behaviors for the expanding plasma are identified. The behavior is classified into five dynamical regimes, ranging from nearly quasineutral expansion to the formation of bare ion slabs susceptible to Coulomb explosion. The limiting self-similar solutions are analyzed, and the dynamics in the five asymptotic limits in the parameter space are detailed. Scaling relations for the length scales and energies of the expanding plasma are proposed. The self-similar framework is applied to laser-plasma interactions, specifically addressing the plasma dynamics at a target surface during prepulse-target interactions. The results offer insights into the expansion behavior based on the laser-plasma parameters, and scaling relations for optimizing laser-plasma schemes and guiding experimental designs in high-intensity laser experiments.",
    "authors": [
      "Ritwik Sain",
      "Lance Labun",
      "Ou Z. Labun",
      "Bjorn Manuel Hegelich"
    ],
    "published": "2025-11-03T20:03:48Z",
    "updated": "2025-11-03T20:03:48Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph",
      "physics.flu-dyn"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.01075v1",
    "url": "https://arxiv.org/abs/2511.01075v1",
    "pdf_url": "https://arxiv.org/pdf/2511.01075v1.pdf",
    "title": "Beam-Beam Backgrounds for the Cool Copper Collider",
    "abstract": "In this paper, we present a comprehensive characterization of beam-beam backgrounds for the Cool Copper Collider (C$^3$), a proposed linear $e^{+}e^{-}$ collider designed for precision Higgs studies at center-of-mass energies of 250 and 550 GeV. Using a simulation pipeline based on the Key4hep framework, we evaluate incoherent pair production and hadron photoproduction backgrounds through the SiD detector for baseline, power-efficiency, and high-luminosity C$^3$ operating scenarios. The occupancy induced by the beam-beam background is evaluated for each scenario, validating the compatibility of the existing SiD detector design with operations at C$^3$ without substantial modifications. At the same time, the modular simulation framework and analysis methodology presented in this paper offer a versatile toolkit for background studies in future collider proposals, contributing to a common platform for different machine designs.",
    "authors": [
      "Dimitrios Ntounis",
      "Caterina Vernieri",
      "Lindsey Gray",
      "Elias Mettner",
      "Tim Barklow",
      "Laith Gordon",
      "Emilio A. Nanni"
    ],
    "published": "2025-11-02T20:51:11Z",
    "updated": "2025-11-02T20:51:11Z",
    "categories": [
      "hep-ex",
      "physics.acc-ph"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2510.21676v2",
    "url": "https://arxiv.org/abs/2510.21676v2",
    "pdf_url": "https://arxiv.org/pdf/2510.21676v2.pdf",
    "title": "Constructing Field Aligned Coordinate Systems for Gyrokinetic   Simulations of Tokamaks in X-point Geometries",
    "abstract": "Structures in tokamak plasmas are elongated along the direction of the magnetic field and short in the directions perpendicular to the magnetic field. Many tokamak simulation codes take advantage of this by using a field aligned coordinate system. However, field aligned coordinate systems have a coordinate singularity at magnetic X-points where the poloidal magnetic field vanishes, which makes it difficult to use field aligned coordinate systems when simulating the core and scrape-off layer (SOL) simultaneously. Here we present an algorithm for computing geometric quantities in a standard field aligned coordinate system that avoids the singularity and allows one to conduct 2D axisymmetric simulations in X-point geometries. We demonstrate the efficacy of this algorithm with an example simulation of the Spherical Tokamak for Energy Production (STEP).",
    "authors": [
      "Akash Shukla",
      "Ammar Hakim",
      "James Juno",
      "Gregory Hammett",
      "Manaure Francisquez"
    ],
    "published": "2025-10-24T17:31:59Z",
    "updated": "2025-11-02T18:09:56Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.14953v2",
    "url": "https://arxiv.org/abs/2506.14953v2",
    "pdf_url": "https://arxiv.org/pdf/2506.14953v2.pdf",
    "title": "Fourier Transform Method Of A Detailed Configuration Accounting In Hot   Plasma Bound-Bound Opacity Calculations",
    "abstract": "G.~Hazak and J.~Kurzweil discovered a method of configurational resolution of transition arrays for the Super Transition Arrays approach to the bound-bound opacity calculation. Their method is based on the representation of the photoabsorption coefficient as the Fourier transform, the linearity of the transition energy between configurations with respect to shell occupation numbers, and factorization of the probabilities of configurations on shell occupation numbers. We extend the Hazak -- Kurzweil method for the calculations with Detailed Configuration Accounting. The resulting expressions for the bound-bound opacity represent an alternative to the widely used ones and are quite convenient for numerical implementation.",
    "authors": [
      "Evgeniya Arapova",
      "Yulia Koryakina",
      "Mikhail Vronskiy"
    ],
    "published": "2025-06-17T20:09:05Z",
    "updated": "2025-11-02T11:24:19Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2501.14242v2",
    "url": "https://arxiv.org/abs/2501.14242v2",
    "pdf_url": "https://arxiv.org/pdf/2501.14242v2.pdf",
    "title": "Sawtooth crash in tokamak as a sequence of Multi-region Relaxed MHD   equilibria",
    "abstract": "This study examines the sawtooth crash phenomenon in tokamak plasmas by modelling it as a sequence of Multi-region Relaxed Magnetohydrodynamic (MRxMHD) equilibria. Using the Stepped-Pressure Equilibrium Code (SPEC), we constructed a series of equilibria representing intermediate states during the sawtooth crash, with progressively increasing reconnection regions. Numerical results demonstrated that the system prefers the lower energy non-axisymmetric equilibria with islands and is eventually back to an axisymmetric state, capturing key features of the reconnection process. Comparisons with the nonlinear MHD code M3D-C1 showed remarkable agreement on the field-line topology, the safety factor, and the current profile. However, the simplified MRxMHD model does not resolve the detailed structure of the current sheet. Despite this limitation, MRxMHD offers an insightful approach and a complementary perspective to initial-value MHD simulations.",
    "authors": [
      "Zhisong Qu",
      "Yao Zhou",
      "Arunav Kumar",
      "Joshua Doak",
      "Joaquim Loizu",
      "Matthew Hole"
    ],
    "published": "2025-01-24T05:02:37Z",
    "updated": "2025-11-02T01:28:23Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.00759v1",
    "url": "https://arxiv.org/abs/2511.00759v1",
    "pdf_url": "https://arxiv.org/pdf/2511.00759v1.pdf",
    "title": "Nonlinear effects in light-ion stopping powers within real-time   time-dependent density functional theory",
    "abstract": "Electronic stopping power models describing fuel heating processes in inertial fusion energy concepts typically assume linear-response behavior through quadratic scaling with the projectile charge. We report the results of real-time time-dependent density functional theory (TDDFT) calculations indicating that even for low-Z ions, nonlinear processes modify stopping powers in warm dense matter by about 10% near and below the Bragg peak. By describing partial neutralization of slow ions, analytic effective charge models capture some qualitative aspects of the TDDFT results but do not always offer quantitative accuracy. Cases where the effective charge inferred from TDDFT exceeds the bare ion charge suggest that more complex nonlinear effects also contribute. These findings will inform future improvements to more efficient stopping power models.",
    "authors": [
      "Alina Kononov",
      "Thomas W. Hentschel",
      "Stephanie B. Hansen",
      "Andrew D. Baczewski"
    ],
    "published": "2025-11-02T01:14:30Z",
    "updated": "2025-11-02T01:14:30Z",
    "categories": [
      "physics.plasm-ph",
      "physics.chem-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.00354v1",
    "url": "https://arxiv.org/abs/2511.00354v1",
    "pdf_url": "https://arxiv.org/pdf/2511.00354v1.pdf",
    "title": "Experimental investigation of plasma-electrode interactions on the   ZaP-HD sheared-flow-stabilized Z-pinch device",
    "abstract": "The ZaP-HD sheared-flow-stabilized (SFS) Z-pinch device is a testbed for experimental investigation of plasma-electrode interactions. The graphite electrode is exposed to a high temperature, high density Z-pinch plasma while supplying large pinch currents. In-situ measurements of the gross carbon erosion flux obtained with S/XB spectroscopy exceed the expected flux from physical sputtering, but have reasonable agreement with the expected sublimation flux. Comparison of the ionization mean free paths of neutrals produced through both erosion processes shows that sublimated carbon is ionized within the sheath while sputtered carbon is ionized beyond the sheath. This suggests a process of electrode recycling and self-healing through redeposition. The sputtered carbon is primarily responsible for net erosion. Ex-situ analysis of electrode material is enabled by the design of a removable coupon. Three different plasma exposure conditions varied the pinch current and number of pulses. Net mass loss measurements support the physical picture of electrode recycling. Erosion rates range from 0.01 to 0.1 mg/C, which are comparable to existing arc discharge devices. Measurements of the microscopic surface morphology and roughness reveal irregular consolidated structures and general smoothing except at high particle fluence. Crack formation suggests the importance of repetitive thermal cycles. Definitive features of sputtering such as pitting and cratering are absent, although further study is needed to attribute the observed changes to other processes. These results indicate some alignment with erosion processes in high-powered arc discharges, which successfully operate solid electrodes in extreme environments. This provides confidence in managing electrode erosion in the SFS Z-pinch configuration.",
    "authors": [
      "Amierul Aqil Khairi",
      "Uri Shumlak"
    ],
    "published": "2025-11-01T01:36:34Z",
    "updated": "2025-11-01T01:36:34Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.08533v2",
    "url": "https://arxiv.org/abs/2508.08533v2",
    "pdf_url": "https://arxiv.org/pdf/2508.08533v2.pdf",
    "title": "Transition to Petschek Reconnection in Subrelativistic Pair Plasmas:   Implications for Particle Acceleration",
    "abstract": "While relativistic magnetic reconnection in pair plasmas has emerged in recent years as a candidate for the origin of radiation from extreme astrophysical environments, the corresponding subrelativistic pair plasma regime has remained less explored, leaving open the question of how relativistic physics affects reconnection. In this paper, we investigate the differences between these regimes by contrasting 2D particle-in-cell simulations of reconnection in pair plasmas with relativistic magnetization ($\\sigma \\gg 1$) and subrelativistic magnetization ($\\sigma < 1$). By utilizing unprecedentedly large domain sizes and outflow boundary conditions, we demonstrate that lowering the magnetization results in a change in the reconnection geometry from a plasmoid chain to a Petschek geometry, where laminar exhausts bounded by slow-mode shocks emanate from a single diffusion region. We attribute this change to the reduced plasmoid production rate in the low-$\\sigma$ case: when the secondary tearing rate is sufficiently low, plasmoids are too few in number to prevent the system from relaxing into a stable Petschek configuration. This geometric change also affects particle energization: we show that while high-$\\sigma$ plasmoid chains generate power-law energy spectra, low-$\\sigma$ Petschek exhausts merely heat incoming plasma and yield negligible nonthermal acceleration. These results have implications for predicting the global current sheet geometry and the resulting energy spectrum in a variety of systems.",
    "authors": [
      "Adam Robbins",
      "Anatoly Spitkovsky"
    ],
    "published": "2025-08-12T00:22:43Z",
    "updated": "2025-10-31T23:18:05Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.00221v1",
    "url": "https://arxiv.org/abs/2511.00221v1",
    "pdf_url": "https://arxiv.org/pdf/2511.00221v1.pdf",
    "title": "Dragging of electric current by hydrodynamic flow at charge neutrality",
    "abstract": "We develop a theory of drag in graphene double layers near charge neutrality. We work in the regime of electron hydrodynamics and account for interlayer correlations of charge puddle disorder. The drag resistivity is expressed in terms of the viscosity, intrinsic conductivity of the electron liquid, and the correlation function of the puddle disorder. The contributions of the interlayer transfer of momentum and energy to drag have opposite signs. This leads to a nonmonotonic dependence of the drag resistivity on the carrier density. For layer-symmetric doping, the drag resistivity changes sign as a function of the carrier density. At interlayer separations shorter than the disorder correlation length, the transconductivity saturates to the disorder-induced enhancement of the intralayer conductivity. We provide quantitative estimates of the effect for Dirac electron liquids in monolayer graphene and bilayer graphene double-layer devices.",
    "authors": [
      "Dmitry Zverevich",
      "Alex Levchenko",
      "A. V. Andreev"
    ],
    "published": "2025-10-31T19:40:21Z",
    "updated": "2025-10-31T19:40:21Z",
    "categories": [
      "cond-mat.mes-hall",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.mes-hall"
  },
  {
    "arxiv_id": "2511.00174v1",
    "url": "https://arxiv.org/abs/2511.00174v1",
    "pdf_url": "https://arxiv.org/pdf/2511.00174v1.pdf",
    "title": "Observation of Ion-wave Satellites to Laser Harmonics in Intense   Picosecond Laser-Solid Interaction",
    "abstract": "Detailed spectra of harmonics produced from ultra-intense, sub-picosecond, high-contrast laser pulses incident on solid targets have shown the first observation of regular red- and blue-shifted satellites. Their frequency shift is slightly less than the frequency of a nominal, pure ion-plasma wave associated with electron critical density, where an ion-acoustic wave would be expected. We explain this as the result of a substantial reduction of Debye shielding as the intense optical fields compete to drive electrons in large-amplitude oscillations. This general effect leads to a larger, dynamical and anisotropic Debye length, which should have a broad impact on plasma physics in this regime.",
    "authors": [
      "R. S. Marjoribanks",
      "L. Zhao",
      "F. W. Budnik",
      "G. Kulcsar",
      "R. Wagner",
      "D. Umstadter",
      "R. P. Drake",
      "M. C. Downer"
    ],
    "published": "2025-10-31T18:26:24Z",
    "updated": "2025-10-31T18:26:24Z",
    "categories": [
      "physics.plasm-ph",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.20628v2",
    "url": "https://arxiv.org/abs/2510.20628v2",
    "pdf_url": "https://arxiv.org/pdf/2510.20628v2.pdf",
    "title": "Magnetic Field-Line Curvature and Its Role in Particle Acceleration by   Magnetically Dominated Turbulence",
    "abstract": "We employ first-principles, fully kinetic particle-in-cell simulations to investigate magnetic field-line curvature in magnetically dominated turbulent plasmas and its role in particle acceleration through curvature-drift motion along the motional electric field. By varying the fluctuation-to-mean magnetic-field ratio $\\delta B_0/B_0$, we examine curvature $\\kappa$ statistics and their connection to particle acceleration. The curvature probability densities display broad power-law wings, scaling linearly in $\\kappa$ below the peak and developing hard high-$\\kappa$ tails for $\\delta B_0/B_0 \\gtrsim 1$. As the mean field strengthens, the high-$\\kappa$ tails steepen, and large-curvature events are suppressed when $\\delta B_0/B_0 \\ll 1$. The probability density functions of magnetic field-line contraction, ${\\bf v}_E \\cdot {\\bf \\kappa}$, with ${\\bf v}_E$ the field-line velocity, develop power-law tails well described by a symmetric Pareto distribution, characteristic of stochastic energy exchanges, with the tails becoming harder as $\\delta B_0/B_0$ increases. Our guiding-center analysis shows that curvature-drift acceleration accounts for a substantial fraction of the energization via the motional electric field, and that it strengthens with increasing $\\delta B_0/B_0$. For well-magnetized particles, curvature-drift acceleration typically exceeds ${\\bf\\nabla}B$ drift, polarization drift, and betatron contributions. These results identify curvature-drift acceleration as a principal pathway through which magnetized turbulence transfers energy to nonthermal particles in astrophysical plasmas.",
    "authors": [
      "Samuel Sebastian",
      "Luca Comisso"
    ],
    "published": "2025-10-23T15:02:34Z",
    "updated": "2025-10-31T18:23:21Z",
    "categories": [
      "astro-ph.HE",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2510.27624v1",
    "url": "https://arxiv.org/abs/2510.27624v1",
    "pdf_url": "https://arxiv.org/pdf/2510.27624v1.pdf",
    "title": "Stellarator divertor design by optimizing coils for surfaces with sharp   corners",
    "abstract": "In stellarators, achieving effective divertor configurations is challenging due to the three-dimensional nature of the magnetic fields, which often leads to chaotic field lines and fuzzy separatrices. This work presents a novel approach to directly optimize modular stellarator coils for a sharp X-point divertor topology akin to the Large Helical Device's (LHD) helical divertor using a target plasma surface with sharp corners. By minimizing the normal magnetic field component on this surface, we target a clean separatrix with minimal chaos. Notably, this approach demonstrates the first LHD-like helical divertor design using optimized modular coils instead of helical coils. Separatrices are produced with significantly lower chaos than in LHD, demonstrating that a wide chaotic layer is not intrinsic to the helical divertor. Additional optimization methods are implemented to improve engineering feasibility of the coils and reduce chaos, including weighted quadrature and manifold optimization, a method which does not rely on normal field minimization. The results outline several new strategies for divertor design in stellarators, though it remains to achieve these edge divertor features at the same time as internal field qualities like quasisymmetry.",
    "authors": [
      "Todd Elder",
      "Matt Landremann",
      "Christoper B. Smiet",
      "Robert Davies"
    ],
    "published": "2025-10-31T16:51:27Z",
    "updated": "2025-10-31T16:51:27Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  }
]