{
  "arxiv_id": "2509.19193v1",
  "url": "https://arxiv.org/abs/2509.19193v1",
  "pdf_url": "https://arxiv.org/pdf/2509.19193v1.pdf",
  "title": "On the Overestimation of Efficiency in Relativistic Electron Scattering",
  "abstract": "Recent reviews in ultrafast electron diffraction (UED) have claimed that relativistic electrons exhibit enhanced elastic scattering efficiency, frequently quantified as a \\gamma^2 increase in the differential cross section. These claims, however, originate from angular-domain analyses that overlook the compression of scattering angles \\theta with increasing electron energy, leading to an apparent, but artificial, enhancement. In this work, we recast the problem in momentum-transfer space q, where scattering is accurately accounted for. This transformation eliminates the angular compression artefact and reveals that high-energy scaling follows a simple \\beta^{-2} dependence, with no intrinsic relativistic gain. We demonstrate this by directly integrating relativistic differential elastic-scattering cross sections from ELSEPA and by applying a straightforward transformation of the well-known Mott-Massey formalism into q-space. The results are general, with calculations performed for elements from carbon to gold and for energies between 50 keV and 5000 keV. They reproduce the long-established trend in total elastic scattering cross sections, in which scattering strength decreases with increasing electron kinetic energy. Practically, at energies above roughly 50 keV, scattering is already dominated by the forward direction, and most of the scattered intensity falls within the acceptance range of typical UED detectors. These findings correct a widespread misconception in the UED literature and provide a more accurate and intuitive framework for interpreting and optimizing high-energy electron scattering experiments.",
  "authors": [
    "Grant Brassem",
    "Christian Viernes",
    "German Sciaini"
  ],
  "published": "2025-09-23T16:12:33Z",
  "updated": "2025-09-23T16:12:33Z",
  "categories": [
    "physics.acc-ph"
  ],
  "primary_category": "physics.acc-ph"
}