{
  "arxiv_id": "2509.20096v1",
  "url": "https://arxiv.org/abs/2509.20096v1",
  "pdf_url": "https://arxiv.org/pdf/2509.20096v1.pdf",
  "title": "Residual energy of magnetohydrodynamic shocks",
  "abstract": "Residual energy quantifies the difference in energy between velocity and magnetic field fluctuations in a plasma. Recent observational evidence highlights that fast-mode interplanetary shock waves have positive residual energy, in sharp contrast to the negative residual energy of the turbulence and magnetic structures that constitute the vast majority of fluctuation power in the solar wind at magnetohydrodynamic (MHD) inertial scales. In this work, we apply the Rankine-Hugoniot conditions to derive an equation for the residual energy of an MHD shock jump as a function of the shock angle, density compression ratio and Alfv\\'en Mach number upstream of the shock. An equation for the cross helicity is similarly derived. The residual energy equation gives only positive values for super-Alfv\\'enic (i.e. fast-mode) shocks. The residual energy and cross helicity of slow-mode shocks and tangential, contact and rotational discontinuities are also determined. A simplified form of the residual energy equation applicable to perpendicular shocks has been verified against residual energy values directly estimated from observations of 141 interplanetary shocks; the equation is found to match well with observations, particularly for shocks with higher density compression ratios and Mach numbers. The use of positive residual energy as a signature for fast-mode shock identification in spacecraft data is briefly considered, and insights from this work relating to compressive fluctuations more generally in the solar wind are discussed.",
  "authors": [
    "S. W. Good",
    "K. J. Palmunen",
    "C. H. K. Chen",
    "E. K. J. Kilpua",
    "T. V. Mäkelä",
    "J. Ruohotie",
    "C. P. Sishtla",
    "J. E. Soljento"
  ],
  "published": "2025-09-24T13:19:59Z",
  "updated": "2025-09-24T13:19:59Z",
  "categories": [
    "astro-ph.SR",
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.SR"
}