{
  "arxiv_id": "2508.12306v1",
  "url": "https://arxiv.org/abs/2508.12306v1",
  "pdf_url": "https://arxiv.org/pdf/2508.12306v1.pdf",
  "title": "Inverse Weak measurement in SERF magnetometer",
  "abstract": "Weak measurement techniques have been extensively applied in the field of quantum precision measurement to detect ultra-small signals due to the amplification effect. In this work, we propose an optical detection system for a spin-exchange relaxation-free (SERF) magnetometer based on the inverse weak measurement (IWM) framework. By using the spatial pattern of a probe laser as the measurement pointer, we successfully detect ultra-weak magnetic fields. In our model, the spatial pattern of the probe laser is weakly coupled to its polarization, which is sensitive to external magnetic fields. Through post-selection on the optical polarization, the ultra-small magnetic field is significantly amplified with the amplification factor inversely proportional to the coupling strength, as reflected in the measured displacement of the final spatial pattern. By analysing the response curve of the probe laser displacement to the magnetic field, we identify the point of maximum sensitivity, achieving a magnetic field sensitivity of 182.8 fT/Hz1/2. Furthermore, in the IWM scheme, the detected signals depend only on the internal degrees of freedom of the probe laser, making the system robust against the fluctuations in laser power. To demonstrate this advantage, we compute the Allan standard deviation of the output signals for both conventional and IWM detection methods. The results indicate that the IWM-based method improves stability of detection by one to two orders of magnitude. This work presents a novel detection approach that integrates weak measurement techniques, offering a significant enhancement in the performance of SERF magnetometers.",
  "authors": [
    "Qian Cao",
    "Liang Xu",
    "Ziqian Yue",
    "Jianqi Yang",
    "Yueyang Zhai"
  ],
  "published": "2025-08-17T09:48:03Z",
  "updated": "2025-08-17T09:48:03Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}