{
  "arxiv_id": "2602.22064v1",
  "url": "https://arxiv.org/abs/2602.22064v1",
  "pdf_url": "https://arxiv.org/pdf/2602.22064v1.pdf",
  "title": "Effects of Screening and Pressure Ionization on the Electron Broadening of Spectral Lines in Dense Plasmas",
  "abstract": "Collisions between electrons and radiating atoms broaden spectral absorption and emission lines in dense plasmas. High densities also introduce screening and pressure ionization effects that distort the wavefunctions of both bound and free electrons. In order to study how dense plasma effects influence the electron broadening of spectral lines, this paper incorporates electron wavefunctions from an average-atom (AA) model to calculate the line width of the B III $2p-2s$ transition at $T = 10$ eV for mass densities ranging from $ρ=10^{-4}-0.4$ g/cc. The calculation method uses the impact approximation, allowing the line width to be written in terms of electron-collision cross sections and an interference term. Compared to an otherwise identical calculation that uses Coulomb free wavefunctions, the AA method is found to modify both the cross sections and the resulting line width at sufficiently high density by introducing screening and pressure ionized bound states. Screening lowers the cross sections at low energies and near electron excitation thresholds, while pressure ionized bound states introduce resonances into the continuum. Thus, as the density increases, the relative line width between the AA and Coulomb calculations follows a general decrease because of screening, with sharp increases at various intervals due to pressure ionization. The AA results are also compared with a common approach to introduce screening through the interaction potential and reduced models that use the Bethe formula for the inelastic electron-collision cross sections.",
  "authors": [
    "Julian P. Kinney",
    "Stephanie B. Hansen",
    "Thomas A. Gomez",
    "Scott D. Baalrud"
  ],
  "published": "2026-02-25T16:10:41Z",
  "updated": "2026-02-25T16:10:41Z",
  "categories": [
    "physics.plasm-ph",
    "physics.atom-ph"
  ],
  "primary_category": "physics.plasm-ph"
}