{
  "arxiv_id": "2602.22177v1",
  "url": "https://arxiv.org/abs/2602.22177v1",
  "pdf_url": "https://arxiv.org/pdf/2602.22177v1.pdf",
  "title": "Runaway electron generation in ITER mitigated disruptions with improved physics models",
  "abstract": "We assess runaway-electron (RE) generation in ITER disruptions mitigated by shattered pellet injection (SPI) using improved physics modelling in the 1D disruption simulation framework Dream. To this end, we extend Dream with four ITER-relevant physics models: (i) a reduced model for RE scrape- off associated with the vertical plasma motion, (ii) a semi-analytical plasmoid- drift model for material deposition, (iii) an adaptive hyper-resistive transport model to suppress unphysical thin-current channels during the current quench (CQ), and (iv) an updated Compton RE generation seed calculated for the new ITER tungsten first-wall design. We simulate full-current 15 MA L-mode (H26, non-nuclear) and H-mode (DTHmode24, nuclear) scenarios, and an intermediate- current 7.5 MA H-mode non-nuclear case, from realistic ITER inputs. Complete avoidance of a multi-MA RE beam is found to require a long pre-thermal quench (TQ) duration to thermalize the hot-tail electrons, high deuterium assimilation with limited neon, and a representative seed current comparable to a single RE in ITER. As previously found with lower fidelity setups [Vallhagen et al, Nucl. Fusion 64 (2024)], these conditions are met by staggered or low-Ne injections in H26, but are typically violated in DT H-mode when nuclear seeds are present. In addition to analyzing the effect of the new models, we investigate the role of the current spike associated with the TQ and importance of radial transport of runaways in the CQ. After incorporating these additional physical effects into a comprehensive disruption model and analyzing their impact, we present a representative ITER DT H-mode SPI scenario which provides a theoretically viable route to tolerable RE currents in ITER fusion power operation.",
  "authors": [
    "L. Votta",
    "F. J. Artola",
    "E. Nardon",
    "O. Vallhagen",
    "M. Hoppe"
  ],
  "published": "2026-02-25T18:25:29Z",
  "updated": "2026-02-25T18:25:29Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}