[
  {
    "arxiv_id": "2602.23215v1",
    "url": "https://arxiv.org/abs/2602.23215v1",
    "pdf_url": "https://arxiv.org/pdf/2602.23215v1.pdf",
    "title": "RF Basics I & II",
    "abstract": "This lecture starts with a brief historical introduction and an explanation how to get from Maxwell's Equations to a simple cavity. After simplifying and adapting the equations for their application to Radio Frequency problems, the most important formulae and characteristics for cavities and wave-guides are derived. The most common figures of merit are explained and some of the different cavity types are introduced. The alternative description of cavities as a lumped circuit model is then introduced, which is often used to characterise the cavity-coupler-generator interplay.",
    "authors": [
      "Frank Gerigk"
    ],
    "published": "2026-02-26T16:59:10Z",
    "updated": "2026-02-26T16:59:10Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.23186v1",
    "url": "https://arxiv.org/abs/2602.23186v1",
    "pdf_url": "https://arxiv.org/pdf/2602.23186v1.pdf",
    "title": "The transient behavior of superconducting multi-cell accelerating cavities",
    "abstract": "We employ an equivalent-circuit model of a multi-cell cavity to explore its time-dependent behavior in order to understand differences between the multi-cell model and the commonly-used model of a single-cell resonator. Furthermore, we address tolerances that arise from manufacturing imperfections.",
    "authors": [
      "Volker Ziemann"
    ],
    "published": "2026-02-26T16:42:40Z",
    "updated": "2026-02-26T16:42:40Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.23139v1",
    "url": "https://arxiv.org/abs/2602.23139v1",
    "pdf_url": "https://arxiv.org/pdf/2602.23139v1.pdf",
    "title": "Charge collection parameterization of MALTA2, a depleted monolithic active pixel sensor",
    "abstract": "A fast simulation method is presented for a depleted monolithic active pixel sensor, which uses a data driven parameterization of the charge collection and propagation. This approach provides an efficient alternative to TCAD simulations, particularly for sensors whose proprietary process details - such as doping profiles or implant geometries - are unavailable. Data was obtained with a MALTA2 sensor fabricated in a 180 nm CMOS imaging technology on 30 μm epitaxial silicon using the MALTA beam telescope at CERN SPS. The model reproduces the measured inpixel efficiency with high accuracy and enables a realistic yet computationally lightweight analog pixel simulation. This method will be further employed in optimizing the digital sensor design for applications in high-rate particle tracking and high-granularity calorimetry.",
    "authors": [
      "L. Fasselt",
      "P. Behera",
      "D. V. Berlea",
      "D. Bortoletto",
      "C. Buttar",
      "T. Chembakan",
      "V. Dao",
      "G. Dash",
      "S. Haberl",
      "T. Inada",
      "F. K. Isik",
      "P. Jana",
      "X. Li",
      "L. Li",
      "H. Pernegger",
      "P. Riedler",
      "W. Snoeys",
      "C. A. Solans Sánchez",
      "A. Swoboda",
      "I. Turk Cakir",
      "M. van Rijnbach",
      "M. Vázquez Núñez",
      "A. Vijay",
      "J. Weick",
      "S. Worm"
    ],
    "published": "2026-02-26T16:02:22Z",
    "updated": "2026-02-26T16:02:22Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.23104v1",
    "url": "https://arxiv.org/abs/2602.23104v1",
    "pdf_url": "https://arxiv.org/pdf/2602.23104v1.pdf",
    "title": "Analytic Expressions for Shielded Halbach Multipoles",
    "abstract": "We employ the method of images to derive analytic expressions for the magnetic field of Halbach multipoles that are enclosed in high-permeability shielding.",
    "authors": [
      "Volker Ziemann"
    ],
    "published": "2026-02-26T15:17:48Z",
    "updated": "2026-02-26T15:17:48Z",
    "categories": [
      "physics.acc-ph",
      "hep-ph",
      "physics.app-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.22992v1",
    "url": "https://arxiv.org/abs/2602.22992v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22992v1.pdf",
    "title": "Hard X-Ray Zernike-Type Phase-Contrast Imaging with a Two-Block Crystal System",
    "abstract": "A novel scheme for Zernike-type hard X-ray phase-contrast imaging is proposed. The scheme relies on X-ray dynamical diffraction in a two-block crystal system with parallel crystal plates of equal thickness. A phase shifter providing a $π/2$ phase shift is placed in the inter-block gap of the crystal system. The method operates in a scanning geometry. The proposed imaging setup is compact and does not require conventional focusing optics. Numerical simulations of phase-contrast image formation are performed.",
    "authors": [
      "Levon Haroutunyan"
    ],
    "published": "2026-02-26T13:35:56Z",
    "updated": "2026-02-26T13:35:56Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2602.22970v1",
    "url": "https://arxiv.org/abs/2602.22970v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22970v1.pdf",
    "title": "Demonstrating Single Photon Counting with Kinetic Inductance Detectors from 3.8 to 25 $μ$m",
    "abstract": "One of the primary objectives of modern astronomy is the atmospheric characterization of Earth-like exoplanets at visible and infrared wavelengths. Achieving this goal requires extremely sensitive detectors capable of measuring faint signal of the exoplanet at the single-photon level while maintaining near-zero dark count rates. In the infrared, however, conventional semiconducting detector technologies struggle to meet these stringent requirements. In this work we demonstrate single-photon counting with superconducting Microwave Kinetic Inductance Detectors at the wavelengths 3.8, 8.5, 18.5, and 25 $μ$m and measure resolving powers ($E/δE$) of 9.9, 5.9, 3.2, and 3.3, respectively, with corresponding dark count rates of 4, 8, 34, and 48 mHz. Our membrane-based devices reach phonon-loss limited performance at 3.8 $μ$m, more than doubling the performance attainable with comparable solid-substrate devices. These results showcase the detector technology in the mid-infrared and the intricate measurement setup required for these sensitive detectors. We discuss how the detector design and measurement setup can be further optimized to increase the detector performance in the mid-infrared.",
    "authors": [
      "Wilbert G. Ras-Vinke",
      "Kevin Kouwenhoven",
      "Jochem J. A. Baselmans",
      "Kenichi Karatsu",
      "David J. Thoen",
      "Vignesh Murugesan",
      "Pieter J. de Visser"
    ],
    "published": "2026-02-26T13:08:43Z",
    "updated": "2026-02-26T13:08:43Z",
    "categories": [
      "astro-ph.IM",
      "cond-mat.supr-con",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2602.22849v1",
    "url": "https://arxiv.org/abs/2602.22849v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22849v1.pdf",
    "title": "Testing beyond the Standard Model scenarios in next-generation long-baseline neutrino oscillation experiments",
    "abstract": "In this thesis, we assess the sensitivity of next-generation long-baseline neutrino oscillation experiments, DUNE, T2HK, and T2HKK, to three popular beyond the Standard Model (BSM) scenarios. Within the three BSM studies, we examine: (i) long-range neutrino-matter interactions induced by flavor-dependent, anomaly-free gauged baryon-lepton symmetries mediated by ultra-light vector boson, showing that DUNE and T2HK can constrain, discover, and in some favorable cases distinguish among different symmetries; (ii) Lorentz invariance violation (LIV), where we derive analytical dependencies of CPT-conserving and CPT-violating LIV parameters on baseline and energy, highlighting the superior reach of DUNE in probing all the LIV parameters, in contrast to T2HK, which is essentially blind to the CPT-conserving LIV parameters; and (iii) active-sterile oscillations over a broad range of $Δm^2_{41}$, where we derive sensitivity to CP phases for benchmark choices of $Δm^2_{41}$ and establish exclusion limits, emphasizing the role of near detectors. Together, these studies show that future long-baseline facilities not only resolve the neutrino mass ordering, value of $δ_{\\rm CP}$, and $θ_{23}$ octant, but also provide powerful probes of BSM physics.",
    "authors": [
      "Pragyanprasu Swain"
    ],
    "published": "2026-02-26T10:38:08Z",
    "updated": "2026-02-26T10:38:08Z",
    "categories": [
      "hep-ph",
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2503.01764v3",
    "url": "https://arxiv.org/abs/2503.01764v3",
    "pdf_url": "https://arxiv.org/pdf/2503.01764v3.pdf",
    "title": "Design and Development of Portable RPC-Based Cosmic Muon Tracker",
    "abstract": "Primary cosmic rays when interact with our atmosphere, produce a cascade of lighter secondary particles namely pion, kaon, neutrons, muons, electrons, positrons and neutrinos. Muons are one of the most abundant and easily detectable particles at the ground surface using a large variety of particle detectors. Resistive Plate Chambers (RPCs) of 2m x 2m in dimension were developed to be used in large scale as the active detector elements in the Iron Calorimeter (ICAL) which was planned to be built by the India-based Neutrino Observatory (INO). As a spin-off of this work, a portable stack of eight, one square foot RPC detectors is developed named as Cosmic Muon Tracker (CMT). It could be used to conduct small-scale particle detector experiments as well as training Students. We will discuss design, integration, characterisation and some of the applications of this detector in this paper.",
    "authors": [
      "Yuvaraj Elangovan",
      "B. Satyanarayana",
      "Ravindra Shinde",
      "Mandar Saraf",
      "Pathaleswar",
      "S. Thoi Thoi",
      "Gobinda Majumder",
      "S. R. Joshi",
      "Piyush Verma",
      "Honey Khindri",
      "Umesh L"
    ],
    "published": "2025-03-03T17:38:15Z",
    "updated": "2026-02-26T09:51:23Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2503.02751v2",
    "url": "https://arxiv.org/abs/2503.02751v2",
    "pdf_url": "https://arxiv.org/pdf/2503.02751v2.pdf",
    "title": "Design and Implementation of a UDP-Based Command Interface for the INO ICAL Experiment",
    "abstract": "Efficient command interface is a critical requirement for experiments employing a large number of front-end DAQ modules and control servers. In the context of the INOICAL (India-based Neutrino Observatory Iron Calorimeter) experiment, this involves 28,800 Resistive Plate Chamber(RPC), charged particle detectors. The acquisition and control of these detectors are facilitated through Front End data acquisition modules known as RPC-DAQs. These modules consists of Ethernet interfaces for data and command connectivity to a server. Each module acts as a network node with a unique IP address. The collective group of hundreds of modules is controlled by a common server over a Local Area Network (LAN). UDP (User Datagram Protocol) is the most commonly used networking protocol which supports Multicast as well as Unicast, can be easily adapted to INO ICAL Experiment. A server can send commands to group of DAQs or any particular DAQ. But UDP may have the problem of packet loss and reliability. To mitigate these issues, this paper suggests a simpler approach that modifies the UDP protocol by implementing a handshaking scheme and checksum, similar to those found in more reliable protocols like TCP. The proposed solution optimizes the use of UDP as a reliable command interface in the INO ICAL experiment, ensuring seamless data acquisition and control. Also, this paper shows the performance study of the custom hybrid UDP Command Interface in the prototype ICAL experiment called Mini Iron Calorimeter (Mini ICAL) which houses 20 units of RPCs and electronics. This work not only addresses the challenges of the INO ICAL experiment but also underscores the adaptability and robustness of the proposed protocol for usage in mini-ICAL and beyond.",
    "authors": [
      "Yuvaraj Elangovan",
      "Mandar Saraf",
      "B. Satyanarayana",
      "S. S. Upadhya",
      "Nagaraj Panyam",
      "Ravindra Shinde",
      "Gobinda Majumder",
      "D. Sil",
      "Pathaleswar",
      "K. C. Ravindran",
      "Upendra Gokhale",
      "Pavan Kumar"
    ],
    "published": "2025-03-04T16:17:15Z",
    "updated": "2026-02-26T09:45:22Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.11304v2",
    "url": "https://arxiv.org/abs/2510.11304v2",
    "pdf_url": "https://arxiv.org/pdf/2510.11304v2.pdf",
    "title": "In-situ Radiation Damage Study of Silicon Carbide Detectors Subjected to Clinical Proton Beams",
    "abstract": "Silicon carbide (SiC) planar PiN diodes from two different manufacturers were irradiated with 252.7 MeV protons from a medical synchrotron. Over the course of two 8h irradiation shifts, the samples were exposed to increasing fluences ranging from 1.4e+11 to 3.5e+13 p+/cm^2. Electrical characterizations, including IV and CV measurements, were performed both before and after irradiation using probe stations, and for selected samples even in-situ between fluence steps directly at the irradiation facility. The results show a gradual compensation of the effective epitaxial doping concentration with each incremental fluence step, observed as a reduction in capacitance before full depletion and confirmed by the extracted effective doping concentration. From these measurements, linear donor removal rates are determined for all sample groups, with values ranging from 4.2/cm to 6.4/cm. These findings provide a quantitative basis for understanding radiation-induced charge carrier removal in 4H-SiC devices and are relevant for predicting the performance and lifetime of future radiation-hard detector technologies, including 4H-SiC LGADs.",
    "authors": [
      "Daniel Radmanovac",
      "Andreas Gsponer",
      "Simon Waid",
      "Sebastian Onder",
      "Matthias Knopf",
      "Juergen Burin",
      "Stefan Gundacker",
      "Thomas Bergauer"
    ],
    "published": "2025-10-13T11:50:02Z",
    "updated": "2026-02-26T08:35:48Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/21/01/C01033"
  },
  {
    "arxiv_id": "2602.22618v1",
    "url": "https://arxiv.org/abs/2602.22618v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22618v1.pdf",
    "title": "Advancing accelerator virtual beam diagnostics through latent evolution modeling: an integrated solution to forward, inverse, tuning, and UQ problems",
    "abstract": "Virtual beam diagnostics relies on computationally intensive beam dynamics simulations where high-dimensional charged particle beams evolve through the accelerator. We propose Latent Evolution Model (LEM), a hybrid machine learning framework with an autoencoder that projects high-dimensional phase spaces into lower-dimensional representations, coupled with transformers to learn temporal dynamics in the latent space. This approach provides a common foundational framework addressing multiple interconnected challenges in beam diagnostics. For \\textit{forward modeling}, a Conditional Variational Autoencoder (CVAE) encodes 15 unique projections of the 6D phase space into a latent representation, while a transformer predicts downstream latent states from upstream inputs. For \\textit{inverse problems}, we address two distinct challenges: (a) predicting upstream phase spaces from downstream observations by utilizing the same CVAE architecture with transformers trained on reversed temporal sequences along with aleatoric uncertainty quantification, and (b) estimating RF settings from the latent space of the trained LEM using a dedicated dense neural network that maps latent representations to RF parameters. For \\textit{tuning problems}, we leverage the trained LEM and RF estimator within a Bayesian optimization framework to determine optimal RF settings that minimize beam loss. This paper summarizes our recent efforts and demonstrates how this unified approach effectively addresses these traditionally separate challenges.",
    "authors": [
      "Mahindra Rautela",
      "Alexander Scheinker"
    ],
    "published": "2026-02-26T04:46:26Z",
    "updated": "2026-02-26T04:46:26Z",
    "categories": [
      "physics.acc-ph",
      "cs.LG"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.18429/JACoW-NAPAC2025-MOP002"
  },
  {
    "arxiv_id": "2511.13084v2",
    "url": "https://arxiv.org/abs/2511.13084v2",
    "pdf_url": "https://arxiv.org/pdf/2511.13084v2.pdf",
    "title": "Electron Recoil via Sample Momentum Transfer under Optical-Mode Excitation",
    "abstract": "The interaction between free electrons and optical modes underlies a variety of quantum and nanoscale light-matter phenomena, yet the associated momentum exchange with the sample largely remained overlooked. Here, we experimentally demonstrate the momentum transfer from free electrons to planar samples during optical mode excitation using momentum-resolved electron energy-loss spectroscopy. The momentum transfer to the sample modifies the apparent dispersion relation which is significant when the planner sample is tilted. Under specific conditions, the sample receives momentum opposite to the electron beam direction.",
    "authors": [
      "Akira Yasuhara",
      "Yamato Kirii",
      "Takumi Sannomiya"
    ],
    "published": "2025-11-17T07:33:20Z",
    "updated": "2026-02-26T01:48:51Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2602.22477v1",
    "url": "https://arxiv.org/abs/2602.22477v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22477v1.pdf",
    "title": "Fused-Silica Activation Cherenkov Detector for Pulsed D--T Fusion Yields",
    "abstract": "We demonstrate a compact, non-toxic, low-cost neutron-yield diagnostic for pulsed D--T fusion systems using an undoped fused-silica (SiO$2$) rod as both activation target and Cherenkov radiator. D--T neutrons (14.1 MeV) activate $^{28}$Si and $^{16}$O to produce short-lived $^{28}$Al ($T{1/2}=134,\\mathrm{s}$) and $^{16}$N ($T_{1/2}=7.13,\\mathrm{s}$). The resulting $β^-$ particles exceed the Cherenkov threshold and generate UV--visible light detected by a fast photomultiplier tube. A SiO$_2$ rod of dimensions $6,\\mathrm{in}\\times1,\\mathrm{in}$ (length $\\times$ diameter) is optically coupled and read out with a CAEN DT5730 digitizer operating in list mode with digital pulse processing. The post-pulse count rate is fit using fixed $^{16}$N and $^{28}$Al half-lives together with background terms to infer neutron fluence. Testing at the ZEUS D--T Dense Plasma Focus established a reference calibration and agreement with a praseodymium-calibrated silver activation detector. Measurements near a D--D Dense Plasma Focus show no activation signal, confirming D--T selectivity. The diagnostic enables pulse-to-pulse yield measurements within minutes following a pulse and is being deployed on Helion Energy's seventh fusion prototype, Polaris.",
    "authors": [
      "N. Kaneshige",
      "S. Alawabdeh",
      "W. Hennig",
      "D. Cech",
      "M. Hua",
      "R. Grazioso"
    ],
    "published": "2026-02-25T23:33:32Z",
    "updated": "2026-02-25T23:33:32Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.22464v1",
    "url": "https://arxiv.org/abs/2602.22464v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22464v1.pdf",
    "title": "The 2027-2034 Vision for Nuclear Physics in Canada, with an outlook to 2041",
    "abstract": "The Canadian subatomic physics community establishes its scientific, and thus funding, priorities through periodic Long-Range Plans (LRP). The community is now putting together a new LRP, which will be in effect from 2027 through 2034, with its scope extending through 2041. As part of this process, the Canadian Institute of Nuclear Physics (CINP) has put together a strategic report, following an extensive consultation process. The report describes the broad and ambitious research program undertaken by the Canadian nuclear physics research community, both onshore and abroad, touching on key questions regarding the origin, evolution, and structure of visible matter in the universe. This document provides a grid of different Canadian nuclear physics projects undertaken now and in the future, and their associated timelines. It concludes with specific recommendations for maximizing Canadian scientific output in nuclear physics.",
    "authors": [
      "Corina Andreoiu",
      "Svetlana Barkanova",
      "Gregory Christian",
      "Alexandros Gezerlis",
      "Garth Huber",
      "Jeffery W. Martin",
      "Ruben Sandapen"
    ],
    "published": "2026-02-25T22:52:49Z",
    "updated": "2026-02-25T22:52:49Z",
    "categories": [
      "nucl-ex",
      "astro-ph.SR",
      "hep-ex",
      "nucl-th",
      "physics.ins-det"
    ],
    "primary_category": "nucl-ex"
  },
  {
    "arxiv_id": "2509.02916v2",
    "url": "https://arxiv.org/abs/2509.02916v2",
    "pdf_url": "https://arxiv.org/pdf/2509.02916v2.pdf",
    "title": "Initial results of the TRIUMF ultracold advanced neutron source",
    "abstract": "We report the first results on ultracold neutron production from a new spallation-driven superfluid $^4$He (He-II) source at TRIUMF, which is being prepared for a new, precise measurement of the neutron electric dipole moment. A total of $(9.3 \\pm 0.8)\\times 10^{5}$ ultracold neutrons were observed at a proton beam current of \\SI{37}{\\uA}, when the target was irradiated for a period of \\SI{60}{\\s}. The results are in fair agreement with expectations based on a detailed simulation of neutron transport and ultracold neutron source cryogenics. There is some indication that the new source might not be as limited by the conduction of heat through the He-II as originally expected. The results indicate that the source is likely to make its ultimate production goals, once the liquid deuterium cold moderator system is completed, with the expectation that $5.7\\times 10^7$~UCNs would be detected in the same experiment with full liquid levels. This would, for example, correspond to delivery of $1.4\\times 10^6$~UCNs delivered to each of two nEDM measurement cells, and a statistical uncertainty of $1\\times 10^{-27}~e$cm on the neutron EDM in 280 days of running.",
    "authors": [
      "B. Algohi",
      "D. Anthony",
      "L. Barrón-Palos",
      "M. Bossé",
      "M. P. Bradley",
      "A. Brossard",
      "T. Bui",
      "J. Chak",
      "R. Chiba",
      "C. Davis",
      "R. de Vries",
      "K. Drury",
      "B. Franke",
      "D. Fujimoto",
      "R. Fujitani",
      "M. Gericke",
      "P. Giampa",
      "C. Gibson",
      "R. Golub",
      "K. Hatanaka",
      "T. Hepworth",
      "T. Higuchi",
      "G. Ichikawa",
      "I. Ide",
      "S. Imajo",
      "A. Jaison",
      "B. Jamieson",
      "M. Katotoka",
      "S. Kawasaki",
      "M. Kitaguchi",
      "W. Klassen",
      "E. Korkmaz",
      "E. Korobkina",
      "F. Kuchler",
      "M. Lavvaf",
      "T. Lindner",
      "N. Lo",
      "S. Longo",
      "K. W. Madison",
      "Y. Makida",
      "J. Malcolm",
      "J. Mammei",
      "R. Mammei",
      "Z. Mao",
      "C. Marshall",
      "J. W. Martin",
      "R. Matsumiya",
      "M. McCrea",
      "E. Miller",
      "M. Miller",
      "K. Mishima",
      "T. Mohammadi",
      "T. Momose",
      "M. Nalbandian",
      "T. Okamura",
      "S. Pankratz",
      "R. Patni",
      "R. Picker",
      "K. Qiao",
      "W. D. Ramsay",
      "W. Rathnakela",
      "T. Reimer",
      "D. Salazar",
      "J. Sato",
      "W. Schreyer",
      "T. Shima",
      "H. M. Shimizu",
      "S. Sidhu",
      "S. Stargardter",
      "R. Stutters",
      "P. Switzer",
      "I. Tanihata",
      "Tushar",
      "S. Vanbergen",
      "W. T. H. van Oers",
      "N. Yazdandoost",
      "Q. Ye",
      "A. Zahra",
      "M. Zhao"
    ],
    "published": "2025-09-03T01:00:39Z",
    "updated": "2026-02-25T22:00:34Z",
    "categories": [
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "nucl-ex"
  },
  {
    "arxiv_id": "2602.22177v1",
    "url": "https://arxiv.org/abs/2602.22177v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22177v1.pdf",
    "title": "Runaway electron generation in ITER mitigated disruptions with improved physics models",
    "abstract": "We assess runaway-electron (RE) generation in ITER disruptions mitigated by shattered pellet injection (SPI) using improved physics modelling in the 1D disruption simulation framework Dream. To this end, we extend Dream with four ITER-relevant physics models: (i) a reduced model for RE scrape- off associated with the vertical plasma motion, (ii) a semi-analytical plasmoid- drift model for material deposition, (iii) an adaptive hyper-resistive transport model to suppress unphysical thin-current channels during the current quench (CQ), and (iv) an updated Compton RE generation seed calculated for the new ITER tungsten first-wall design. We simulate full-current 15 MA L-mode (H26, non-nuclear) and H-mode (DTHmode24, nuclear) scenarios, and an intermediate- current 7.5 MA H-mode non-nuclear case, from realistic ITER inputs. Complete avoidance of a multi-MA RE beam is found to require a long pre-thermal quench (TQ) duration to thermalize the hot-tail electrons, high deuterium assimilation with limited neon, and a representative seed current comparable to a single RE in ITER. As previously found with lower fidelity setups [Vallhagen et al, Nucl. Fusion 64 (2024)], these conditions are met by staggered or low-Ne injections in H26, but are typically violated in DT H-mode when nuclear seeds are present. In addition to analyzing the effect of the new models, we investigate the role of the current spike associated with the TQ and importance of radial transport of runaways in the CQ. After incorporating these additional physical effects into a comprehensive disruption model and analyzing their impact, we present a representative ITER DT H-mode SPI scenario which provides a theoretically viable route to tolerable RE currents in ITER fusion power operation.",
    "authors": [
      "L. Votta",
      "F. J. Artola",
      "E. Nardon",
      "O. Vallhagen",
      "M. Hoppe"
    ],
    "published": "2026-02-25T18:25:29Z",
    "updated": "2026-02-25T18:25:29Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.22172v1",
    "url": "https://arxiv.org/abs/2602.22172v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22172v1.pdf",
    "title": "Effects of realistic laser intensity and phase distribution on high-charge laser wakefield acceleration",
    "abstract": "Laser wakefield acceleration (LWFA) can produce relativistic electron beams and various secondary particles in centimeter-long plasmas, making it a valuable particle source with important applications in many disciplines. In this work, we examine the effects of non-ideal transverse intensity and phase distribution of laser pulses on LWFA through both experimental measurements and particle-in-cell simulations. The complex transverse profile of the 75 TW laser pulses reduces the self-focused intensity in plasma compared with a transversely Gaussian laser. Furthermore, the sheath structure of the nonlinear plasma wake excited by realistic laser pulses is wider and more complicated than that of a Gaussian laser. These hinder the injection of the plasma electrons. As the laser pulse propagates through the plasma, its intensity profile gradually becomes elliptical and drives a plasma wake with a sharp sheath near the azimuths of the major axis, leading to an injection. When using a realistic laser profile in simulations, both the charge and energy of injected electrons closely match experimental results ($\\sim200$ pC of charge and $\\sim 200$ MeV peak energy), whereas the Gaussian laser simulations produce much higher charge ($\\sim500$ pC). Our findings reveal the difference in injection dynamics between LWFA driven by non-ideal laser pulses and those driven by Gaussian pulses, and are useful for applications of LWFA which demand high-charge electron beams.",
    "authors": [
      "Yuhui Xia",
      "Zhenan Wang",
      "Ziyao Tang",
      "Jianghao Hu",
      "Qianyi Ma",
      "Yuekai Chen",
      "Letian Liu",
      "Zhiyan Yang",
      "Hui Zhang",
      "Chenxu Wang",
      "Haoyang Lan",
      "Di Wu",
      "Xiuhong Yang",
      "Yixing Geng",
      "Yanying Zhao",
      "Xueqin Yan",
      "Xinlu Xu"
    ],
    "published": "2026-02-25T18:18:18Z",
    "updated": "2026-02-25T18:18:18Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.22165v1",
    "url": "https://arxiv.org/abs/2602.22165v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22165v1.pdf",
    "title": "Whistler-Alfvén turbulence in a non-neutral ultrarelativistic pair plasma",
    "abstract": "The large-scale dynamics of most conventional space and astrophysical plasmas are predominantly governed by Alfvén modes, which are low-frequency magnetohydrodynamic modes existing in magnetized media. At scales smaller than the ion gyroscale or frequencies exceeding the ion cyclotron frequency, the Alfvén modes transform into kinetic-Alfvén or whistler modes that significantly contribute to plasma dynamics. However, this scenario reverses in non-neutral pair plasmas, such as those found in the magnetospheres of pulsars and magnetars, around rotating black holes and in their relativistic jets, as well as in certain laboratory plasmas. In these systems, the large-scale dynamics is governed by hybrid whistler-Alfvén modes, which transform into pure Alfvén modes at smaller scales. We derive the nonlinear equations that describe the dynamics of whistler-Alfvén modes in ultrarelativistic non-neutral magnetically dominated pair plasma and discuss the spectrum of turbulence governed by these equations.",
    "authors": [
      "Stanislav Boldyrev",
      "Mikhail Medvedev"
    ],
    "published": "2026-02-25T18:14:29Z",
    "updated": "2026-02-25T18:14:29Z",
    "categories": [
      "astro-ph.HE",
      "astro-ph.GA",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE",
    "doi": "10.3847/1538-4357/ae30e1"
  },
  {
    "arxiv_id": "2602.22064v1",
    "url": "https://arxiv.org/abs/2602.22064v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22064v1.pdf",
    "title": "Effects of Screening and Pressure Ionization on the Electron Broadening of Spectral Lines in Dense Plasmas",
    "abstract": "Collisions between electrons and radiating atoms broaden spectral absorption and emission lines in dense plasmas. High densities also introduce screening and pressure ionization effects that distort the wavefunctions of both bound and free electrons. In order to study how dense plasma effects influence the electron broadening of spectral lines, this paper incorporates electron wavefunctions from an average-atom (AA) model to calculate the line width of the B III $2p-2s$ transition at $T = 10$ eV for mass densities ranging from $ρ=10^{-4}-0.4$ g/cc. The calculation method uses the impact approximation, allowing the line width to be written in terms of electron-collision cross sections and an interference term. Compared to an otherwise identical calculation that uses Coulomb free wavefunctions, the AA method is found to modify both the cross sections and the resulting line width at sufficiently high density by introducing screening and pressure ionized bound states. Screening lowers the cross sections at low energies and near electron excitation thresholds, while pressure ionized bound states introduce resonances into the continuum. Thus, as the density increases, the relative line width between the AA and Coulomb calculations follows a general decrease because of screening, with sharp increases at various intervals due to pressure ionization. The AA results are also compared with a common approach to introduce screening through the interaction potential and reduced models that use the Bethe formula for the inelastic electron-collision cross sections.",
    "authors": [
      "Julian P. Kinney",
      "Stephanie B. Hansen",
      "Thomas A. Gomez",
      "Scott D. Baalrud"
    ],
    "published": "2026-02-25T16:10:41Z",
    "updated": "2026-02-25T16:10:41Z",
    "categories": [
      "physics.plasm-ph",
      "physics.atom-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.21990v1",
    "url": "https://arxiv.org/abs/2602.21990v1",
    "pdf_url": "https://arxiv.org/pdf/2602.21990v1.pdf",
    "title": "Proof-of-principle experiment of a novel beam extraction over millions of turns using stable resonance islands and bent crystal",
    "abstract": "A recent study [1] has introduced an advanced method aimed at extracting from a circular particle accelerator over millions of turns using stable islands and a bent crystal. This technique leverages the strength of non-linear beam dynamics along with adiabatic trapping and transport within stable islands, in combination with a bent silicon crystal, to provide an efficient extraction of hadron beams over millions of turns. The positive and encouraging results of the comprehensive numerical simulations were validated through a successful proof-of-principle experiment at the CERN Super Proton Synchrotron, which demonstrated the feasibility of the technique. This paper presents a detailed discussion and analysis of the experimental results.",
    "authors": [
      "D. E. Veres",
      "P. Arrutia",
      "S. Cettour Cave",
      "B. H. F. Lindström",
      "M. Giovannozzi",
      "L. E. Pauwels",
      "F. F. Van der Veken",
      "F. M. Velotti",
      "G. Franchetti"
    ],
    "published": "2026-02-25T15:10:36Z",
    "updated": "2026-02-25T15:10:36Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.21710v1",
    "url": "https://arxiv.org/abs/2602.21710v1",
    "pdf_url": "https://arxiv.org/pdf/2602.21710v1.pdf",
    "title": "Out-of-time-ordered correlators for turbulent fields: a quantum-classical correspondence",
    "abstract": "An extended formulation of out-of-time-ordered correlators (OTOCs), which quantify noncommutative operator growth and information scrambling in quantum many-body systems, is developed for turbulence dynamics as a representative of non-canonical Hamiltonian systems. Based on the Wigner-Weyl transform and the Moyal bracket formalism, the semiclassical limit of OTOC for turbulent plasmas governed by the Hasegawa-Mima equation is derived as an ensemble-averaged squared Lie-Poisson bracket between two chosen functionals of the turbulent fields. The classical-limit OTOC provides a quantitative measure of how a variational perturbation applied to one functional propagates across scales in the turbulent dynamics and how it affects another functional at a later time, thereby capturing scale-dependent or field-dependent transfer processes. In a quasilinear approximation with a strong zonal flow, we derive an inverse-square decay of the OTOC with the time lag, indicating an algebraic suppression of the zonal-mode response to perturbations of the non-zonal fields. This behavior is attributed to zonal-flow shearing, which rapidly scrambles the non-zonal perturbation toward higher wavenumbers, and consequently reduces the low-wavenumber non-zonal content that can feed back onto large-scale zonal modes.",
    "authors": [
      "Motoki Nakata"
    ],
    "published": "2026-02-25T09:16:31Z",
    "updated": "2026-02-25T09:16:31Z",
    "categories": [
      "physics.plasm-ph",
      "physics.flu-dyn"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.21694v1",
    "url": "https://arxiv.org/abs/2602.21694v1",
    "pdf_url": "https://arxiv.org/pdf/2602.21694v1.pdf",
    "title": "Towards Low-Energy Electron High-Resolution Spectroscopy with Transition-Edge Sensors",
    "abstract": "We present a study of the energy resolution of transition-edge sensors (TESs) for the detection of electrons in the 100 eV kinetic energy range. The TES is a Ti-Au bilayer with an active area of $(60 \\times 60)$ $μ\\text{m}^2$ and a critical temperature of $\\sim$ 80 mK. The electron source is based on vertically-aligned multiwall carbon nanotubes located inside the cryostat, with electrons generated via field emission. For electrons in the (92 - 99) eV kinetic energy range, we obtain a Gaussian energy resolution for fully-absorbed electrons of (0.479 $\\pm$ 0.041 $\\pm$ 0.055) eV. When considering the full-width at half-maximum of the peak, the corresponding resolution is of (1.44 $\\pm$ 0.17 $\\pm$ 0.27) eV. The former represents an improvement of (46 - 60)% with respect to previous results, and is mainly attributed to the reduction in the TES active area. The latter is instead an improvement of over a factor of 20, and is mainly due to the reduction in the emitting area of the electron source, which significantly suppresses electron back-scattering in proximity of the TES. These results represent a major milestone toward high-precision spectroscopy on low-energy electrons, which is a key objective for the PTOLEMY experiment.",
    "authors": [
      "R. Ammendola",
      "A. Apponi",
      "G. Benato",
      "M. G. Betti",
      "R. Biondi",
      "P. Bos",
      "M. Cadeddu",
      "A. Casale",
      "O. Castellano",
      "G. Cavoto",
      "L. Cecchini",
      "E. Celasco",
      "M. Chirico",
      "W. Chung",
      "A. G. Cocco",
      "A. P. Colijn",
      "B. Corcione",
      "N. D'Ambrosio",
      "M. D'Incecco",
      "G. De Bellis",
      "M. De Deo",
      "N. de Groot",
      "A. Esposito",
      "M. Farino",
      "S. Farinon",
      "A. D. Ferella",
      "L. Ferro",
      "L. Ficcadenti",
      "G. Galbato Muscio",
      "S. Gariazzo",
      "H. Garrone",
      "F. Gatti",
      "F. Malnati",
      "G. Mangano",
      "L. E. Marcucci",
      "C. Mariani",
      "J. Mead",
      "G. Menichetti",
      "M. Messina",
      "E. Monticone",
      "M. Naafs",
      "S. Nagorny",
      "V. Narcisi",
      "F. Pandolfi",
      "R. Pavarani",
      "C. Pepe",
      "C. Perez de los Heros",
      "O. Pisanti",
      "F. M. Pofi",
      "A. D. Polosa",
      "I. Rago",
      "M. Rajteri",
      "S. Ritarossi",
      "N. Rossi",
      "A. Ruocco",
      "G. Salina",
      "A. Santucci",
      "M. Sestu",
      "A. Tan",
      "V. Tozzini",
      "C. G. Tully",
      "I. van Rens",
      "F. Virzi",
      "G. Visser",
      "M. Viviani"
    ],
    "published": "2026-02-25T08:58:11Z",
    "updated": "2026-02-25T08:58:11Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2406.01293v2",
    "url": "https://arxiv.org/abs/2406.01293v2",
    "pdf_url": "https://arxiv.org/pdf/2406.01293v2.pdf",
    "title": "A time-to-digital converter with steady calibration through single-photon detection",
    "abstract": "Time-to-Digital Converters (TDCs) are a crucial tool in a wide array of fields, in particular for quantum communication, where time taggers performance can severely affect the quality of the entire application. Nowadays, FPGA-based TDCs present a viable alternative to ASIC ones, once the non-linear behavior due to the intrinsic nature of the device is properly mitigated. To compensate for said nonlinearities, a calibration procedure is required, which should be maintained throughout its runtime. Here we present the design and the demonstration of a TDC that is FPGA-based showing a residual FWHM jitter of 27 ps, that is scalable for multichannel operation. The target application in Quantum Key Distribution (QKD) is discussed with a calibration method based on the exploitation of single-photon detection that does not require stopping the data acquisition or using any estimation methods, thus increasing accuracy and removing data loss. The calibration was tested in a relevant environment, investigating the behavior of the device between 5 °C and 80 °C. Moreover, our design is capable of continuously streaming up to 12 Mevents/s for up to ~1 week without the TDC overflowing making it ready for a real-life scenario deployment.",
    "authors": [
      "Matías Rubén Bolaños",
      "Daniele Vogrig",
      "Paolo Villoresi",
      "Giuseppe Vallone",
      "Andrea Stanco"
    ],
    "published": "2024-06-03T13:03:59Z",
    "updated": "2026-02-25T08:40:17Z",
    "categories": [
      "eess.SP",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "eess.SP",
    "doi": "10.1109/TIM.2025.3601244"
  },
  {
    "arxiv_id": "2602.21571v1",
    "url": "https://arxiv.org/abs/2602.21571v1",
    "pdf_url": "https://arxiv.org/pdf/2602.21571v1.pdf",
    "title": "Collisional-radiative data for tokamak disruption mitigation modeling",
    "abstract": "Effective tokamak disruption mitigation is crucial for ensuring the safety and integrity of fusion power reactors. Accurate collisional-radiative (CR) modeling of a radiative plasma is a critical component in predictive disruption mitigation design. In this paper, we focus on quasi-steady-state CR modeling applicable to the current quench phase of a tokamak disruption. We employ the ATOMIC collisional-radiative code from the Los Alamos suite and the newly developed Fusion Collisional-Radiative (FCR) code to model the atomic processes, providing high-fidelity data for radiative power loss, as well as average and effective charge states for hydrogen, helium, neon, and argon plasma species over a wide range of tokamak-relevant electron temperatures and electron densities. Fine-structure-resolved CR models are used for hydrogen and helium plasma species, while configuration-average CR models are implemented for neon and argon plasma species. The calculated values are compared with the superconfiguration CR model (FLYCHK) and the commonly used coronal equilibrium approximation to demonstrate the advantages and limitations of each model. To facilitate coupling of high-fidelity CR data to plasma simulation models, we represent the ATOMIC/FCR results over the relevant plasma parameter range using a smooth tensor product B-spline surface in electron temperature and electron density. This approach yields compact coefficient tables that can be evaluated efficiently while preserving spline smoothness across the domain. These data were previously used to examine ways to minimize runaway electrons in a tokamak current quench, and they are now made available in easy-to-use forms for community use and benchmarking.",
    "authors": [
      "Prashant Sharma",
      "Christopher J. Fontes",
      "Dmitry V. Fursa",
      "Igor Bray",
      "Mark Zammit",
      "James Colgan",
      "Hyun-Kyung Chung",
      "Nathan Garland",
      "Xian-Zhu Tang"
    ],
    "published": "2026-02-25T04:49:33Z",
    "updated": "2026-02-25T04:49:33Z",
    "categories": [
      "physics.plasm-ph",
      "physics.atom-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.21151v2",
    "url": "https://arxiv.org/abs/2602.21151v2",
    "pdf_url": "https://arxiv.org/pdf/2602.21151v2.pdf",
    "title": "A coherent structure transport model for scrape-off layer turbulence",
    "abstract": "Understanding the locality of high-temperature plasma energy deposition on material surfaces in fusion reactors is critical for design. Here, we utilize the Gyrokinetic ElectroMagnetic turbulence including X-points (GEMX) simulation, together with SOLPS-ITER solutions for the background equilibrium electric field including drifts, to model the heat flux at the divertor plate and characterize the heat load width using realistic X-point geometry. We use a theory-based blobby transport model called the \"Coherent Structure Transport\" (CST) model to include the effect of plasma transport in the edge scrape-off layer. The CST model is extremely fast and can be used to quickly analyze any SOLPS-ITER solution. SOLPS-ITER provides the steady state, or equilibrium on which we superimpose blobby turbulence characterized by blob size, amplitude and frequency. We obtain the $1/B_p$ scaling of the heat load exponential decay width $λ_q$, in agreement with the Eich empirical scaling and with the Goldston heuristic theory. When including blobby turbulence in combination with the SOLPS-ITER electric field, we find a secondary peak in the heat flux radial profile, outwardly displaced from the strike point radius, with a relative amplitude that increases with the initial blob density. We describe the CST model in detail and provide initial investigations of the scaling of $λ_q$ and the secondary heat flux peak with blob size and amplitude.",
    "authors": [
      "Zhichen Feng",
      "James Myra",
      "Junyi Cheng",
      "Calder Haubrich",
      "Yang Chen",
      "Xinxing Ma",
      "Darin R. Ernst",
      "Scott Parker"
    ],
    "published": "2026-02-24T17:53:11Z",
    "updated": "2026-02-25T02:52:31Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.21489v1",
    "url": "https://arxiv.org/abs/2602.21489v1",
    "pdf_url": "https://arxiv.org/pdf/2602.21489v1.pdf",
    "title": "A novel perspective on crystal electromagnetic calorimeter design for the CEPC",
    "abstract": "Crystal electromagnetic calorimeters (ECALs) are essential for high-precision measurements of electrons and photons in particle physics experiments. However, the conventional design, in which long crystal bars point radially toward the interaction region and lack longitudinal segmentation, is incompatible with the three-dimensional shower imaging required by Particle Flow Approach (PFA). We propose a novel perspective on crystal ECAL design to address this limitation. The key innovation is a geometric reconfiguration in which crystal bars are oriented to face the interaction region and arranged orthogonally in adjacent longitudinal layers. This layout achieves fine spatial segmentation of energy deposits by correlating measurements of orthogonal crystal bars. An interleaved structure of regular and inverted trapezoidal modules is incorporated to maximize structural uniformity and detector hermeticity. This design is engineered to preserve the excellent intrinsic energy resolution of crystal ECALs while simultaneously providing the detailed three-dimensional shower imaging essential for PFA. Simulation results confirm the feasibility of achieving excellent energy resolution of $1.14\\%/\\sqrt{E} \\oplus 0.44\\%$. Consequently, the proposed design repositions crystal ECAL as a foundational component for PFA-oriented detector systems at facilities such as the Circular Electron Positron Collider (CEPC), offering a new technical pathway to advance the physics goals of future colliders.",
    "authors": [
      "Weizheng Song",
      "Yang Zhang",
      "Shengsen Sun",
      "Fangyi Guo",
      "Yuanzhan Wang",
      "Linghui Wu",
      "Jie Guo",
      "Shaojing Hou",
      "Yong Liu",
      "Quan Ji",
      "Jinfan Chang",
      "Yifang Wang"
    ],
    "published": "2026-02-25T01:39:57Z",
    "updated": "2026-02-25T01:39:57Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.21458v1",
    "url": "https://arxiv.org/abs/2602.21458v1",
    "pdf_url": "https://arxiv.org/pdf/2602.21458v1.pdf",
    "title": "Precision measurements of 2-3 oscillation parameters in the next-generation long-baseline experiments",
    "abstract": "Over the past few decades, data from leading neutrino experiments have firmly established neutrino oscillation, implying non-zero neutrino masses and leptonic mixing and thereby providing confirmed evidence of physics beyond the Standard Model. On the backdrop of the precision era of neutrino oscillation, this thesis underscores its relevance by demonstrating the physics reach of the forthcoming long-baseline experiments -- Deep Underground Neutrino Experiment (DUNE) and Hyper-Kamiokande (Hyper-K) -- to establish non-maximal $θ_{23}$, resolve the correct $θ_{23}$ octant, and improve the precision on $θ_{23}$ and $Δm^2_{31}$ by efficiently breaking parameter degeneracies. This is enabled by DUNE's high-resolution LArTPC detector and its wide-band beam, achieving sensitivity at a high confidence level compared to the global fits of world neutrino data. The combined analysis of DUNE and Hyper-K not only significantly enhances sensitivity to these phenomenological studies but also demonstrates their capabilities at lower exposures when operated together, relative to their nominal individual exposures. In addition, we investigate the impact of flavor-dependent long-range interactions arising from anomaly-free U(1)' extensions of the Standard Model, showing that although subdominant long-range interactions can substantially influence the sensitivity and precision of oscillation parameter measurements, the complementary strengths of DUNE and Hyper-K mitigate these challenges to a large extent.",
    "authors": [
      "Ritam Kundu"
    ],
    "published": "2026-02-25T00:22:48Z",
    "updated": "2026-02-25T00:22:48Z",
    "categories": [
      "hep-ph",
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2602.21422v1",
    "url": "https://arxiv.org/abs/2602.21422v1",
    "pdf_url": "https://arxiv.org/pdf/2602.21422v1.pdf",
    "title": "Unstable magnetic reconnection self-generates turbulence",
    "abstract": "Magnetic reconnection and turbulence are deeply intertwined in magnetohydrodynamic flows, yet how reconnection self-generates turbulence remains unclear. Using an ensemble of high-resolution three-dimensional direct numerical simulations of an unstable magnetised jet with an initially weak mean field, we demonstrate a self-sustained transition from laminar reconnection to fully developed turbulence in the absence of external forcing. We show that a three-dimensional current-sheet instability triggers stochastic reconnection, leading to persistent turbulent energy injection. Energy-budget analysis reveals that the coupling between the turbulent electromotive force and the magnetic mean shear dominates turbulent production, with magnetic fluctuations subsequently transferring energy to the kinetic field through a nonlinear cascade.",
    "authors": [
      "Nick Williams",
      "Alessandro De Rosis",
      "Alex Skillen"
    ],
    "published": "2026-02-24T22:49:36Z",
    "updated": "2026-02-24T22:49:36Z",
    "categories": [
      "physics.plasm-ph",
      "physics.flu-dyn"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.21375v1",
    "url": "https://arxiv.org/abs/2602.21375v1",
    "pdf_url": "https://arxiv.org/pdf/2602.21375v1.pdf",
    "title": "Passive freeze-out of the Richtmyer-Meshkov instability",
    "abstract": "The Richtmyer-Meshkov instability (RMI) poses a major challenge in inertial confinement fusion (ICF) due to its role in mixing and performance degradation. We report the first experimental observation of passive freeze-out of RMI in a low-pressure surrogate regime; an instability stagnation effect induced without modifying the driving pressure pulse or the target surface geometry. Using additively manufactured sub-surface voids in a sinusoidal target, we convert a single shock into a sequence of weaker shocks that suppress instability growth upstream of the surface by over 70%. High-speed X-ray imaging and hydrodynamic simulations suggest that this suppression arises primarily from temporal shaping, with lesser contributions from spatial curvature and shock weakening. Our results demonstrate a driver-independent pathway for controlling shock-driven hydrodynamic instabilities relevant to ICF and other high energy density systems.",
    "authors": [
      "J. Strucka",
      "D. M. Sterbentz",
      "B. Lukic",
      "K. Mughal",
      "Y. Yao",
      "K. Marrow",
      "W. J. Schill",
      "C. F. Jekel",
      "D. A. White",
      "N. Asmedianov",
      "R. Grikshtas",
      "O. Belozerov",
      "S. Efimov",
      "J. Skidmore",
      "A. Rack",
      "Ya. E. Krasik",
      "J. L. Belof",
      "J. P. Chittenden",
      "S. N. Bland"
    ],
    "published": "2026-02-24T21:14:20Z",
    "updated": "2026-02-24T21:14:20Z",
    "categories": [
      "physics.plasm-ph",
      "physics.flu-dyn"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.05977v2",
    "url": "https://arxiv.org/abs/2601.05977v2",
    "pdf_url": "https://arxiv.org/pdf/2601.05977v2.pdf",
    "title": "Comment on Nuclear Fusion 66, 016012 (2026) and arXiv:2508.03561 by Richard Fitzpatrick, A Simple Model of Current Ramp-Up and Ramp-Down in Tokamaks",
    "abstract": "The article Nuclear Fusion \\textbf{66}, 016012 (2026) by Richard Fitzpatrick is based on fundamental errors in the physics of the poloidal magnetic flux in tokamaks. His paper was inspired by an article that I posted on arXiv in various versions, $\\big<$arxiv.org/abs/2507.05456$\\big>$. The September 9, 2025 version was submitted to the Physics of Plasmas, which flatly rejected the article. Before I can resubmit, the Physics of Plasmas stated that the issues with the Fitzpatrick article must be explained. Not only did Fitzpatrick make numerous fundamental errors in science, he totally misrepresented my views as clearly stated in my article and even more explicitly in email exchanges, called ``private communication\" in his paper.",
    "authors": [
      "Allen H Boozer"
    ],
    "published": "2026-01-09T17:53:04Z",
    "updated": "2026-02-24T19:23:18Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.21303v1",
    "url": "https://arxiv.org/abs/2602.21303v1",
    "pdf_url": "https://arxiv.org/pdf/2602.21303v1.pdf",
    "title": "Beam tube boundary effects in stray light modeling of long Fabry-Perot arm cavities for third-generation gravitational-wave detectors",
    "abstract": "Next-generation gravitational-wave detectors such as Cosmic Explorer and the Einstein Telescope will operate 10-40 km Fabry-Perot arm cavities inside vacuum beam tubes. FFT-based paraxial tools treat propagation in free space and therefore do not explicitly enforce beam tube boundary conditions. We introduce a waveguide-like mode description of the optical field that incorporates an imposed beam tube boundary condition and enables an independent benchmark of free-space FFT tools We derive the associated modal-mixing matrices for mirrors and baffles, including a closed-form series for axisymmetric circular apertures. We quantify the strain-equivalent couplings from baffle miscentering and from a localized near-wall tube defect, and show that they are suppressed as baffle density increases. In the relevant regime of densely baffled cavities and small perturbations, beam tube boundary effects are subdominant, which supports the continued use of FFT-based codes to guide the design of 3G detectors.",
    "authors": [
      "M. Andrés-Carcasona",
      "M. Evans"
    ],
    "published": "2026-02-24T19:14:01Z",
    "updated": "2026-02-24T19:14:01Z",
    "categories": [
      "gr-qc",
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "gr-qc"
  },
  {
    "arxiv_id": "2602.21290v1",
    "url": "https://arxiv.org/abs/2602.21290v1",
    "pdf_url": "https://arxiv.org/pdf/2602.21290v1.pdf",
    "title": "Global Magnetohydrodynamic Simulations of Monster Shocks in Neutron Star Magnetospheres",
    "abstract": "Waves launched from the neutron star surface or inner magnetosphere propagate through the magnetosphere as small perturbations, but can grow relative to the background magnetic field and steepen into ``monster shocks'' -- ultra-relativistic magnetized shocks which can power high-energy emission from magnetars, neutron star mergers and collapse. They occur in magnetically dominated plasma and are described by relativistic magnetohydrodynamics (MHD). We present global relativistic MHD simulations of monster shocks in unperturbed and perturbed (``wrinkled'') backgrounds with a global dipolar geometry. Our simulations confirm analytical predictions for equatorial shocks and provide new insight into the behavior of oblique shocks off the equator. Simulations where the shock is formed through Alfvén mode to fast mode conversion are also presented, demonstrating the generic nature of the monster shock mechanism. We explore how the presence of additional modes in the magnetosphere modifies the shock behavior. Modes of comparable amplitude can fragment the shock front, substantially reduce the magnetization, produce localized enhancements in the Lorentz factor relative to an unperturbed dipole background, and intermittently generate additional shocks along a line of sight.",
    "authors": [
      "Michael P. Grehan",
      "Bart Ripperda",
      "Andrei M. Beloborodov",
      "Christopher Thompson",
      "Elias R. Most"
    ],
    "published": "2026-02-24T19:00:04Z",
    "updated": "2026-02-24T19:00:04Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2602.21177v1",
    "url": "https://arxiv.org/abs/2602.21177v1",
    "pdf_url": "https://arxiv.org/pdf/2602.21177v1.pdf",
    "title": "Low-Energy Radon Backgrounds from Electrode Grids in Dual-Phase Xenon TPCs",
    "abstract": "The dual-phase xenon time projection chamber (TPC) is a powerful technology to detect rare interactions such as scatters of dark matter particles on nuclei. In particular, the built-in gain of ionization signals in a dual-phase TPC makes it sensitive to events in the few-electron regime, as expected from low-mass dark matter interactions. The pursuit of this low-energy sensitivity through ionization-only signal detection has so far been hindered by excessive electron backgrounds observed across experiments. Much of this background is attributed to the plate-out of $^{222}$Rn decay chain isotopes on the high voltage electrode grid surfaces that span the full cross section of the TPC. This work presents a first-principle model constructed for this background, the predictions of which are consistent with data from the LZ and LUX experiments. We then discuss mitigation strategies of this background in future dual-phase TPCs and the possibility of applying this grid background model to ionization-only dark matter searches.",
    "authors": [
      "D. S. Akerib",
      "A. K. Al Musalhi",
      "F. Alder",
      "B. J. Almquist",
      "S. Alsum",
      "C. S. Amarasinghe",
      "A. Ames",
      "T. J. Anderson",
      "N. Angelides",
      "H. M. Araújo",
      "J. E. Armstrong",
      "M. Arthurs",
      "X. Bai",
      "A. Baker",
      "J. Balajthy",
      "S. Balashov",
      "J. Bang",
      "J. W. Bargemann",
      "E. E. Barillier",
      "A. Baxter",
      "K. Beattie",
      "T. Benson",
      "E. P. Bernard",
      "A. Bernstein",
      "A. Bhatti",
      "T. P. Biesiadzinski",
      "H. J. Birch",
      "E. Bishop",
      "G. M. Blockinger",
      "E. M. Boulton",
      "B. Boxer",
      "C. A. J. Brew",
      "P. Brás",
      "S. Burdin",
      "D. Byram",
      "M. C. Carmona-Benitez",
      "M. Carter",
      "C. Chan",
      "A. Chawla",
      "H. Chen",
      "Y. T. Chin",
      "N. I. Chott",
      "S. Contreras",
      "M. V. Converse",
      "R. Coronel",
      "A. Cottle",
      "G. Cox",
      "D. Curran",
      "J. E. Cutter",
      "C. E. Dahl",
      "I. Darlington",
      "S. Dave",
      "A. David",
      "J. Delgaudio",
      "S. Dey",
      "L. de Viveiros",
      "L. Di Felice",
      "C. Ding",
      "J. E. Y. Dobson",
      "E. Druszkiewicz",
      "S. Dubey",
      "C. L. Dunbar",
      "S. R. Eriksen",
      "A. Fan",
      "N. M. Fearon",
      "N. Fieldhouse",
      "S. Fiorucci",
      "H. Flaecher",
      "E. D. Fraser",
      "T. M. A. Fruth",
      "P. W. Gaemers",
      "R. J. Gaitskell",
      "A. Geffre",
      "J. Genovesi",
      "C. Ghag",
      "J. Ghamsari",
      "A. Ghosh",
      "S. Ghosh",
      "R. Gibbons",
      "M. G. D. Gilchriese",
      "S. Gokhale",
      "J. Green",
      "M. G. D. van der Grinten",
      "C. Gwilliam",
      "J. J. Haiston",
      "C. R. Hall",
      "T. Hall",
      "R. H Hampp",
      "E. Hartigan-O'Connor",
      "S. J. Haselschwardt",
      "M. A. Hernandez",
      "S. A. Hertel",
      "D. P. Hogan",
      "G. J. Homenides",
      "M. Horn",
      "D. Q. Huang",
      "D. Hunt",
      "C. M. Ignarra",
      "R. G. Jacobsen",
      "E. Jacquet",
      "O. Jahangir",
      "R. S. James",
      "K. Jenkins",
      "W. Ji",
      "A. C. Kaboth",
      "A. C. Kamaha",
      "K. Kamdin",
      "M. K. Kannichankandy",
      "K. Kazkaz",
      "D. Khaitan",
      "A. Khazov",
      "J. Kim",
      "Y. D. Kim",
      "J. Kingston",
      "D. Kodroff",
      "E. V. Korolkova",
      "H. Kraus",
      "S. Kravitz",
      "L. Kreczko",
      "V. A. Kudryavtsev",
      "C. Lawes",
      "E. Leason",
      "D. S. Leonard",
      "K. T. Lesko",
      "C. Levy",
      "J. Liao",
      "J. Lin",
      "A. Lindote",
      "R. Linehan",
      "W. H. Lippincott",
      "J. Long",
      "M. I. Lopes",
      "W. Lorenzon",
      "C. Lu",
      "S. Luitz",
      "W. Ma",
      "V. Mahajan",
      "P. A. Majewski",
      "A. Manalaysay",
      "R. L. Mannino",
      "N. Marangou",
      "R. J. Matheson",
      "C. Maupin",
      "M. E. McCarthy",
      "G. McDowell",
      "D. N. McKinsey",
      "J. McLaughlin",
      "J. B. McLaughlin",
      "R. McMonigle",
      "D. -M. Mei",
      "B. Mitra",
      "E. Mizrachi",
      "M. E. Monzani",
      "K. Morå",
      "J. A. Morad",
      "E. Morrison",
      "B. J. Mount",
      "M. Murdy",
      "A. St. J. Murphy",
      "A. Naylor",
      "C. Nehrkorn",
      "H. N. Nelson",
      "F. Neves",
      "A. Nguyen",
      "A. Nilima",
      "C. L. O'Brien",
      "F. H. O'Shea",
      "I. Olcina",
      "K. C. Oliver-Mallory",
      "J. Orpwood",
      "K. Y Oyulmaz",
      "K. J. Palladino",
      "N. J. Pannifer",
      "N. Parveen",
      "S. J. Patton",
      "B. Penning",
      "G. Pereira",
      "E. Perry",
      "T. Pershing",
      "A. Piepke",
      "S. S. Poudel",
      "Y. Qie",
      "J. Reichenbacher",
      "C. A. Rhyne",
      "Q. Riffard",
      "G. R. C. Rischbieter",
      "E. Ritchey",
      "H. S. Riyat",
      "R. Rosero",
      "P. Rossiter",
      "N. J. Rowe",
      "T. Rushton",
      "D. Rynders",
      "S. Saltão",
      "D. Santone",
      "A. B. M. R. Sazzad",
      "R. W. Schnee",
      "G. Sehr",
      "B. Shafer",
      "S. Shaw",
      "W. Sherman",
      "K. Shi",
      "T. Shutt",
      "C. Silva",
      "G. Sinev",
      "J. Siniscalco",
      "A. M. Slivar",
      "R. Smith",
      "A. M. Softley-Brown",
      "M. Solmaz",
      "V. N. Solovov",
      "P. Sorensen",
      "J. Soria",
      "A. Stevens",
      "T. J. Sumner",
      "A. Swain",
      "N. Swanson",
      "M. Szydagis",
      "D. J. Taylor",
      "R. Taylor",
      "W. C. Taylor",
      "B. P. Tennyson",
      "P. A. Terman",
      "D. R. Tiedt",
      "M. Timalsina",
      "W. H. To",
      "Z. Tong",
      "D. R. Tovey",
      "J. Tranter",
      "M. Trask",
      "K. Trengove",
      "M. Tripathi",
      "L. Tvrznikova",
      "U. Utku",
      "A. Usón",
      "A. Vacheret",
      "A. C. Vaitkus",
      "O. Valentino",
      "V. Velan",
      "A. Wang",
      "J. J. Wang",
      "Y. Wang",
      "R. C. Webb",
      "L. Weeldreyer",
      "J. T. White",
      "T. J. Whitis",
      "K. Wild",
      "M. Williams",
      "J. Winnicki",
      "M. S. Witherell",
      "L. Wolf",
      "F. L. H. Wolfs",
      "S. Woodford",
      "D. Woodward",
      "C. J. Wright",
      "Q. Xia",
      "X. Xiang",
      "J. Xu",
      "Y. Xu",
      "M. Yeh",
      "D. Yeum",
      "J. Young",
      "W. Zha",
      "C. Zhang",
      "H. Zhang",
      "T. Zhang",
      "Y. Zhou"
    ],
    "published": "2026-02-24T18:27:25Z",
    "updated": "2026-02-24T18:27:25Z",
    "categories": [
      "hep-ex",
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2602.22248v1",
    "url": "https://arxiv.org/abs/2602.22248v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22248v1.pdf",
    "title": "Machine Learning on Heterogeneous, Edge, and Quantum Hardware for Particle Physics (ML-HEQUPP)",
    "abstract": "The next generation of particle physics experiments will face a new era of challenges in data acquisition, due to unprecedented data rates and volumes along with extreme environments and operational constraints. Harnessing this data for scientific discovery demands real-time inference and decision-making, intelligent data reduction, and efficient processing architectures beyond current capabilities. Crucial to the success of this experimental paradigm are several emerging technologies, such as artificial intelligence and machine learning (AI/ML) and silicon microelectronics, and the advent of quantum algorithms and processing. Their intersection includes areas of research such as low-power and low-latency devices for edge computing, heterogeneous accelerator systems, reconfigurable hardware, novel codesign and synthesis strategies, readout for cryogenic or high-radiation environments, and analog computing. This white paper presents a community-driven vision to identify and prioritize research and development opportunities in hardware-based ML systems and corresponding physics applications, contributing towards a successful transition to the new data frontier of fundamental science.",
    "authors": [
      "Julia Gonski",
      "Jenni Ott",
      "Shiva Abbaszadeh",
      "Sagar Addepalli",
      "Matteo Cremonesi",
      "Jennet Dickinson",
      "Giuseppe Di Guglielmo",
      "Erdem Yigit Ertorer",
      "Lindsey Gray",
      "Ryan Herbst",
      "Christian Herwig",
      "Tae Min Hong",
      "Benedikt Maier",
      "Maryam Bayat Makou",
      "David Miller",
      "Mark S. Neubauer",
      "Cristián Peña",
      "Dylan Rankin",
      "Seon-Hee",
      "Seo",
      "Giordon Stark",
      "Alexander Tapper",
      "Audrey Corbeil Therrien",
      "Ioannis Xiotidis",
      "Keisuke Yoshihara",
      "G Abarajithan",
      "Sagar Addepalli",
      "Nural Akchurin",
      "Carlos Argüelles",
      "Saptaparna Bhattacharya",
      "Lorenzo Borella",
      "Christian Boutan",
      "Tom Braine",
      "James Brau",
      "Martin Breidenbach",
      "Antonio Chahine",
      "Talal Ahmed Chowdhury",
      "Yuan-Tang Chou",
      "Seokju Chung",
      "Alberto Coppi",
      "Mariarosaria D'Alfonso",
      "Abhilasha Dave",
      "Chance Desmet",
      "Angela Di Fulvio",
      "Karri DiPetrillo",
      "Javier Duarte",
      "Auralee Edelen",
      "Jan Eysermans",
      "Yongbin Feng",
      "Emmett Forrestel",
      "Dolores Garcia",
      "Loredana Gastaldo",
      "Julián García Pardiñas",
      "Lino Gerlach",
      "Loukas Gouskos",
      "Katya Govorkova",
      "Carl Grace",
      "Christopher Grant",
      "Philip Harris",
      "Ciaran Hasnip",
      "Timon Heim",
      "Abraham Holtermann",
      "Tae Min Hong",
      "Gian Michele Innocenti",
      "Koji Ishidoshiro",
      "Miaochen Jin",
      "Jyothisraj Johnson",
      "Stephen Jones",
      "Andreas Jung",
      "Georgia Karagiorgi",
      "Ryan Kastner",
      "Nicholas Kamp",
      "Doojin Kim",
      "Kyoungchul Kong",
      "Katie Kudela",
      "Jelena Lalic",
      "Bo-Cheng Lai",
      "Yun-Tsung Lai",
      "Tommy Lam",
      "Jeffrey Lazar",
      "Aobo Li",
      "Zepeng Li",
      "Haoyun Liu",
      "Vladimir Lončar",
      "Luca Macchiarulo",
      "Christopher Madrid",
      "Benedikt Maier",
      "Zhenghua Ma",
      "Prashansa Mukim",
      "Mark S. Neubauer",
      "Victoria Nguyen",
      "Sungbin Oh",
      "Isobel Ojalvo",
      "Hideyoshi Ozaki",
      "Simone Pagan Griso",
      "Myeonghun Park",
      "Christoph Paus",
      "Santosh Parajuli",
      "Benjamin Parpillon",
      "Sara Pozzi",
      "Ema Puljak",
      "Benjamin Ramhorst",
      "Amy Roberts",
      "Larry Ruckman",
      "Kate Scholberg",
      "Sebastian Schmitt",
      "Noah Singer",
      "Eluned Anne Smith",
      "Alexandre Sousa",
      "Michael Spannowsky",
      "Sioni Summers",
      "Yanwen Sun",
      "Daniel Tapia Takaki",
      "Antonino Tumeo",
      "Caterina Vernieri",
      "Belina von Krosigk",
      "Yash Vora",
      "Linyan Wan",
      "Michael H. L. S. Wang",
      "Amanda Weinstein",
      "Andy White",
      "Simon Williams",
      "Felix Yu"
    ],
    "published": "2026-02-24T18:03:32Z",
    "updated": "2026-02-24T18:03:32Z",
    "categories": [
      "physics.ins-det",
      "cs.AR",
      "eess.SP",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.21271v1",
    "url": "https://arxiv.org/abs/2602.21271v1",
    "pdf_url": "https://arxiv.org/pdf/2602.21271v1.pdf",
    "title": "Kolmogorov Scaling for Total Energy and Cross Helicity in Magnetohydrodynamic Turbulence",
    "abstract": "The problem of scaling in isotropic magnetohydrodynamic (MHD) turbulence has remained unresolved, with competing predictions of $k^{-5/3}$ (Kolmogorov) and $k^{-3/2}$ (Iroshnikov-Kraichnan) scalings. In this paper, we address this long-standing controversy using high-resolution numerical simulations on $8192^2$ and $1536^3$ grids. We show that the total energy and cross helicity spectra are closer to $k^{-5/3}$ than $k^{-3/2}$. The fluxes and structure functions of the total energy and cross helicity also demonstrate robust support for Kolmogorov scaling. The magnetic energy shows $k^{-5/3}$ spectrum, but the kinetic energy exhibits $k^{-3/2}$ spectrum; the latter spectrum is due to the energy transfers from the magnetic field to the velocity field.",
    "authors": [
      "Manthan Verma",
      "Abhishek K. Jha",
      "Mahendra K. Verma"
    ],
    "published": "2026-02-24T15:55:38Z",
    "updated": "2026-02-24T15:55:38Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.16243v3",
    "url": "https://arxiv.org/abs/2510.16243v3",
    "pdf_url": "https://arxiv.org/pdf/2510.16243v3.pdf",
    "title": "A flexible and differentiable coil proxy for stellarator equilibrium optimization",
    "abstract": "Balancing plasma performance and coil cost is a significant challenge when designing a stellarator power plant. Most current stellarator designs are produced by two-stage optimization: stage-1 for the equilibrium and stage-2 for a coil design that reproduces its magnetic configuration. Because few proxies connect both stages, two-stage optimization can produce plasmas that have high-quality physical properties but overly complex coils. In recent years, single-stage optimization is increasingly used to optimize the plasma and coils simultaneously, in order to improve the plasma-coil balance. However, all existing single-stage tools are specialized for filament coils, cannot model coil systems containing permanent magnets (PM) or dipole arrays, and remain challenged by numerical problems.The quasi-single-stage (QSS) optimization finds a middle-ground by integrating a coil optimization subproblem into stage-1 optimization. We present a flexible, differentiable coil complexity proxy based on the newly developed QUADCOIL coil optimization code. QUADCOIL is fast and can target realistic coil metrics and constraints that are unavailable to codes with comparable speed. We demonstrate the effectiveness and flexibility of the QUADCOIL proxy by presenting two QSS optimization studies. The first study produces a permanent magnet solution for the MUSE stellarator with 29% fewer magnets than previous solutions. The second study produces a coil solution for the ARIES-CS stellarator with approx 30% reductions in both peak and average coil force.",
    "authors": [
      "Lanke Fu",
      "Dario Panici",
      "Elizabeth Paul",
      "Alan Kaptanoglu",
      "Amitava Bhattacharjee"
    ],
    "published": "2025-10-17T22:19:19Z",
    "updated": "2026-02-24T15:21:23Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.13060v2",
    "url": "https://arxiv.org/abs/2602.13060v2",
    "pdf_url": "https://arxiv.org/pdf/2602.13060v2.pdf",
    "title": "Quantitative imaging of Abrikosov vortices by scanning quantum magnetometry",
    "abstract": "Understanding vortex matter in type-II superconductors is central to controlling dissipation and flux pinning in superconducting materials and devices. Here, we use cryogenic scanning nitrogen vacancy magnetometry (NVM) to image Abrikosov vortices in the cuprate superconductors BSCCO-2212 and YBCO under controlled field-cooled conditions. Measurements, which are performed using continuous-wave optically detected magnetic resonance (cw-ODMR) in a closed-cycle cryostat, yield quantitative magnetic-field maps with nanoscale spatial resolution. In BSCCO-2212 at 71 K, we resolve a well-ordered triangular vortex lattice, whose symmetry and spacing are confirmed through 2D Fourier analysis and are consistent with flux quantization. YBCO thin films imaged at 3 K exhibit a more disordered vortex arrangement reflecting stronger pinning, while maintaining quantitative agreement between measured vortex density and the applied magnetic field. These results render our cryogenic scanning NVM a reliable quantitative tool for real-space studies of vortices in high-$T_c$ superconductors, in particular since such a remarkable magnetic resolution has been achieved within relatively short acquisition times of 2 to 4 h.",
    "authors": [
      "Clemens Schäfermeier",
      "Ankit Sharma",
      "Christopher Kelvin von Grundherr",
      "Dieter Andres",
      "Andrea Morales",
      "Jan Rhensius",
      "Gabriel Puebla-Hellmann",
      "Mirko Bacani"
    ],
    "published": "2026-02-13T16:15:48Z",
    "updated": "2026-02-24T14:46:46Z",
    "categories": [
      "cond-mat.supr-con",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "cond-mat.supr-con"
  },
  {
    "arxiv_id": "2507.04596v5",
    "url": "https://arxiv.org/abs/2507.04596v5",
    "pdf_url": "https://arxiv.org/pdf/2507.04596v5.pdf",
    "title": "On Topology of Perturbed Vortices",
    "abstract": "Zero-helicity vortices, such as Hill's vortex and field-reversed configurations (FRCs), have long been assumed to be toroidal in topology. This paper proves this assumption false: even under arbitrarily small odd-parity (with respect to the z-axis of symmetry) perturbations, flux surfaces in the interior region become simply connected in topology with crescent-shaped boundaries. A new inner separatrix emerges, separating toroidal flux surfaces in an intermediate region from simply connected surfaces in the core. In a spherical vortex with perturbations at roughly 10% of the background field strength, the simply connected region occupies ~40% of the total closed-field-line volume. The analysis rigorously proves the conjecture regarding field-line closure under odd-parity perturbations in a full three-dimensional context, completing previous partial proofs in two-dimensional geometry. Preliminary numerical simulations of charged particle trajectories in field-reversed configurations revealed crescent-shaped drift surfaces even for small gyroradii. Given that FRCs are sustained by rotating magnetic fields with odd parity, these results motivate a revision of FRC-related fusion confinement physics. Furthermore, given the mathematical equivalence to Hill's vortex, this updates our topological understanding of fluid flow in a wide array of phenomena.",
    "authors": [
      "Taosif Ahsan",
      "Samuel A. Cohen",
      "Alan H. Glasser"
    ],
    "published": "2025-07-07T01:19:11Z",
    "updated": "2026-02-24T14:41:14Z",
    "categories": [
      "math-ph",
      "physics.flu-dyn",
      "physics.plasm-ph"
    ],
    "primary_category": "math-ph"
  },
  {
    "arxiv_id": "2602.20757v1",
    "url": "https://arxiv.org/abs/2602.20757v1",
    "pdf_url": "https://arxiv.org/pdf/2602.20757v1.pdf",
    "title": "Entropy stable numerical schemes for divergence diminishing Chew, Goldberger & Low equations for plasma flows",
    "abstract": "Chew, Goldberger & Low (CGL) equations are a set of hyperbolic PDEs with non-conservative products used to model the plasma flows, when the assumption of local thermodynamic equilibrium is not valid, and the pressure tensor is assumed to be rotated by the magnetic field. This results in the pressure tensor, which is described by the two scalar components. As the magnetic field also evolves, controlling the divergence of the magnetic field is important. In this work, we consider the generalized Lagrange multiplier (GLM) technique for the CGL model. The resulting model is referred to as the GLM-CGL system. To make the system suitable for entropy-stable schemes, we reformulate the GLM-CGL system by treating some conservative terms as non-conservative. The resulting system has a non-conservative part that does not affect entropy evolution. We then propose entropy stable numerical methods for the GLM-CGL model. The numerical results for the GLM-CGL system are then compared with the CGL system without the GLM divergence diminishing approach to demonstrate that the GLM approach indeed leads to significant improvement in the magnetic field divergence diminishing.",
    "authors": [
      "Chetan Singh",
      "Harish Kumar",
      "Deepak Bhoriya",
      "Dinshaw S. Balsara"
    ],
    "published": "2026-02-24T10:35:36Z",
    "updated": "2026-02-24T10:35:36Z",
    "categories": [
      "physics.plasm-ph",
      "math-ph",
      "math.NA"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2504.18831v3",
    "url": "https://arxiv.org/abs/2504.18831v3",
    "pdf_url": "https://arxiv.org/pdf/2504.18831v3.pdf",
    "title": "Letter Of Intent for a future $μ^+ \\to \\mathrm{e}^+ γ$ experiment at the High Intensity Muon Beam facility at PSI",
    "abstract": "Searches for charged lepton flavor violation in the muon sector stand out among the most sensitive and clean probes for physics beyond the Standard Model. Currently, $μ^+ \\to \\mathrm{e}^+ γ$ experiments provide the best constraints in this field for a wide range of models while, in the coming years, new experiments investigating the processes of $μ^+ \\to \\mathrm{e}^+ \\mathrm{e}^+ \\mathrm{e}^-$ and $μ\\to \\mathrm{e}$ conversion in the nuclear field are anticipated to reach comparable or higher sensitivities. The High-Intensity Muon Beam (HIMB) facility at PSI, which is expected to deliver muon beam intensities up to two orders of magnitude higher than the existing beam lines, offers a unique opportunity to significantly enhance the sensitivity of $μ^+ \\to \\mathrm{e}^+ γ$ searches. The discovery potential could be substantially boosted and a sensitivity comparable to that of all the other projects could be reestablished, which is essential for discriminating among competing new-physics scenarios should an observation occur in any of the channels. In this document, we express our interest in developing a $μ^+ \\to \\mathrm{e}^+ γ$ experimental program at HIMB, with the goal of improving, within the next decade, the sensitivity of the $μ^+ \\to \\mathrm{e}^+ γ$ search by more than one order of magnitude relative to the expected final result of the current leading experiment, MEG II. This effort would ensure that PSI retains its leadership in this field.",
    "authors": [
      "Paolo Walter Cattaneo",
      "Wataru Ootani",
      "Francesco Renga",
      "André Schöning",
      "Heiko Augustin",
      "Haris Avudaiyappan",
      "Sei Ban",
      "Paolo Beltrame",
      "Hicham Benmansour",
      "Daniela Bortoletto",
      "Alessandro Bravar",
      "Gianluca Cavoto",
      "Marco Chiappini",
      "Alessandro Corvaglia",
      "Giovanni Dal Maso",
      "Sacha Davidson",
      "Matteo De Gerone",
      "Lorenzo Ferrari Barusso",
      "Marco Francesconi",
      "Luca Galli",
      "Giovanni Gallucci",
      "Flavio Gatti",
      "Helen Hayward",
      "Gavin Hesketh",
      "Malte Hildebrandt",
      "Fumihito Ikeda",
      "Fedor Ignatov",
      "Toshiyuki Iwamoto",
      "Tamasi Kar",
      "Marius Köppel",
      "Francesco Leonetti",
      "Weiyuan Li",
      "Ashley McDougall",
      "Satoshi Mihara",
      "Toshinori Mori",
      "Ljiljana Morvaj",
      "Donato Nicolò",
      "Hajime Nishiguchi",
      "Hiroyasu Ogawa",
      "Atsushi Oya",
      "Angela Papa",
      "Marco Panareo",
      "Daniele Pasciuto",
      "Davide Pinci",
      "Richard Plackett",
      "Nikolaos Rompotis",
      "Massimo Rossella",
      "Thomas Rudzki",
      "Rei Sakakibara",
      "Susanna Scarpellini",
      "Taikan Suehara",
      "Hiromu Suzuki",
      "Masato Takahashi",
      "Michele Tammaro",
      "Gianfranco Tassielli",
      "Yusuke Uchiyama",
      "Ryusei Umakoshi",
      "Antoine Venturini",
      "Luigi Vigani",
      "Cecilia Voena",
      "Joost Vossebeld",
      "Rainer Wallny",
      "Kensuke Yamamoto",
      "Yuji Yamazaki"
    ],
    "published": "2025-04-26T07:36:29Z",
    "updated": "2026-02-24T09:42:45Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2602.20668v1",
    "url": "https://arxiv.org/abs/2602.20668v1",
    "pdf_url": "https://arxiv.org/pdf/2602.20668v1.pdf",
    "title": "Development of a cost-effective X-ray imaging device based on Raspberry Pi Camera",
    "abstract": "This study reports the development and characterization of a cost-effective X-ray imaging device built from Raspberry Pi components, including a high-quality 12.3-megapixel camera configured for indirect detection with a Gd2O2S: Tb scintillation screen. The device was evaluated under both ambient light and X-ray exposure conditions. Initial characterization under ambient light ensured proper optical focusing; subsequently, camera settings (ISO and exposure time) were evaluated and optimized for X-ray imaging performance. Spatial resolution of the developed device was quantified using the Slanted-Edge method to derive the Modulation Transfer Function (MTF). The device achieves MTF20 values of 68 lp/mm under ambient light and 25 lp/mm under X-ray irradiation (50 and 70 kV) with Gd2O2S:Tb screen. Besides, the modularity of the developed device was confirmed by conducting the tests with LYSO:Ce and GAGG:Ce screens. Results demonstrate that this compact, cost-effective platform delivers spatial resolution comparable to clinical radiography systems, with potential applications in scientific, educational, and medical contexts where cost and portability are critical factors.",
    "authors": [
      "Nguyen Duc Ton",
      "Nguyen Thanh Luan",
      "Faizan Anjum",
      "D. Joseph Daniel",
      "Sunghwan Kim",
      "Suchart Kothan",
      "Jakrapong Kaewkhao",
      "Hong Joo Kim"
    ],
    "published": "2026-02-24T08:16:12Z",
    "updated": "2026-02-24T08:16:12Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.20622v1",
    "url": "https://arxiv.org/abs/2602.20622v1",
    "pdf_url": "https://arxiv.org/pdf/2602.20622v1.pdf",
    "title": "A Low Cost Picoseconds Precision Timing and Synchronization Over A Hundred Kilometer",
    "abstract": "Large-scale systems, such as very large accelerators used for fundamental research, require the implementation of precise timing and synchronization systems over distances of several tens of kilometers. A very high precision has been demonstrated by the use of costly and complex clock distribution systems. However, many devices, such as accelerator diagnostics or large-scale detectors, only require picosecond precision. An approach exploiting the CERN White Rabbit protocol, deployed and enhanced on an electronic system capable of generating arbitrary frequencies with Hertz precision, is proposed here. Results of performance tests for the synchronization of a laser system, typically employed as a diagnostic for electron/positron beam polarimetry in accelerators, are provided in this Paper. We demonstrate that without implementing corrections for environmental changes, as temperature drifts, the system can synchronize a pulsed laser with picoseconds precision over a hundred kilometers, exhibiting drifts of a few picoseconds. This work paves the way for a low-cost implementation of picosecond synchronization of accelerator components and large-scale detectors.",
    "authors": [
      "Alice Renaux",
      "Ronic Chiche",
      "A. Martens",
      "Antoine Back",
      "Paul-Éric Pottie",
      "Daniel Charlet"
    ],
    "published": "2026-02-24T07:18:42Z",
    "updated": "2026-02-24T07:18:42Z",
    "categories": [
      "physics.acc-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.20564v1",
    "url": "https://arxiv.org/abs/2602.20564v1",
    "pdf_url": "https://arxiv.org/pdf/2602.20564v1.pdf",
    "title": "Deuterium-Tritium Levitated Dipole Fusion Power Plants",
    "abstract": "Levitated dipole reactors offer an attractive path towards economic fusion power generation. The intrinsic decoupling of the confining magnetic field-generating REBCO magnets and the vacuum vessel offer unparalleled accessibility and maintainability, allowing for high plant duty factors and theoretically low electricity prices. In order to achieve rapid deployment of fusion power to the grid, the use of the Deuterium-Tritium (DT) fuel cycle is required due to its lower required plasma triple products. Historically, designs of levitated dipole fusion power plants have targeted advanced fuels as a DT device was seen to be infeasible due to the high fluxes of 14.1 MeV neutrons on the superconducting core magnet. This study presents high level designs for two feasible first-of-a-kind (FOAK) DT levitated dipole fusion power plants, the larger of which produces 667 MW of fusion power and is predicted to produce 208 MW of net electric power. Both designs consist of a heavily neutron-shielded, high-field REBCO core magnet capable of producing peak magnetic field strengths of 23 T while keeping peak mechanical strains below 0.4%. The neutron shielding is comprised of a layered structure of tungsten and boron carbide, which allows for 92% of the heat deposited in the neutron shield to be radiated out to the first wall while still providing sufficient neutron attenuation to give adequate REBCO conductor lifetimes. The core magnet REBCO coil is comprised of a small \"sacrificial\" section and a larger semi-permanent section. The sacrificial section, comprising ~20% of the coil, will have a neutron damage limited lifetime of ~1 year, after which the core magnet will be quickly removed from the vacuum vessel and replaced. This allows the damaged core magnet to be refurbished and reused, reducing cost and allowing for economic fusion power generation from a DT levitated dipole reactor.",
    "authors": [
      "T. Simpson",
      "R. A. Badcock",
      "T. Berry",
      "C. S. Chisholm",
      "P. J. Fimognari",
      "P. Fisher",
      "D. T. Garnier",
      "K. Lenagh-Glue",
      "B. Leuw",
      "R. Mataira",
      "L. Meadows",
      "T. McIntosh",
      "J. Poata",
      "K. Richardson",
      "B. Smith",
      "A. Simpson",
      "J. D. Tyler",
      "T. Wordsworth"
    ],
    "published": "2026-02-24T05:29:29Z",
    "updated": "2026-02-24T05:29:29Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.20542v1",
    "url": "https://arxiv.org/abs/2602.20542v1",
    "pdf_url": "https://arxiv.org/pdf/2602.20542v1.pdf",
    "title": "Rotation of a Solar Jet Driven by Plasma Flow along Helical Magnetic Fields in an Active Region",
    "abstract": "Solar jets, collimated plasma ejections driven by magnetic reconnection, play a vital role in energy transport and coronal heating. While rotational motions in jets are often attributed to magnetic field untwisting, alternative explanatory mechanisms remain possible. This study investigates a rotating jet in an active region observed on 2023 August 1 using multi-wavelength observations from Atmospheric Imaging Assembly (AIA), Chinese Ha Solar Explorer (CHASE), and Interface Region Imaging Spectrograph (IRIS), combined with a self-consistent time-dependent magnetofrictional (TMF) model and magnetohydrodynamic (MHD) simulation. Spectral diagnostics reveal coexisting red and blue shifts along the edges and central axis of the jet, indicating helical plasma motion within a twisted magnetic structure. Numerical simulations demonstrate that the jet's rotation arises from plasma propagating along helical open field lines, formed via reconnection between a pre-existing flux rope and overlying magnetic fields. Contrary to classical untwisting models, both linear and rotational velocities decrease with altitude during the jet propagation. These results highlight that the observed rotation results from plasma spiral motion along twisted fields rather than untwisting dynamics of the magnetic field itself, providing new insights into solar jet energetics and their connection to broader solar phenomena.",
    "authors": [
      "Lei Huang",
      "Yang Guo",
      "Zhen Li",
      "Jinhan Guo",
      "Mingde Ding"
    ],
    "published": "2026-02-24T04:46:50Z",
    "updated": "2026-02-24T04:46:50Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2602.20538v1",
    "url": "https://arxiv.org/abs/2602.20538v1",
    "pdf_url": "https://arxiv.org/pdf/2602.20538v1.pdf",
    "title": "Range Emulator: A Compact Paraxial Optical System to Emulate Long-Distance Monochromatic Laser Propagation",
    "abstract": "Emulating long-distance light propagation on a laboratory scale is essential for the ground-based testing of intersatellite optical systems. To address this challenge, we propose and analyze a novel optical system called the Range Emulator (RE) to reproduce the spatial propagation effects of a long-distance beam within a compact apparatus. Our analysis identifies that three lenses are required as the minimum number of lenses to implement the RE. Through a numerical exploration, we quantify the fundamental trade-off between system compactness and manufacturing precision. This work provides a practical framework for designing compact optical testbeds for future multi-satellite laser link technologies.",
    "authors": [
      "Subaru Shibai",
      "Kiwamu Izumi"
    ],
    "published": "2026-02-24T04:36:18Z",
    "updated": "2026-02-24T04:36:18Z",
    "categories": [
      "physics.optics",
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2602.20472v1",
    "url": "https://arxiv.org/abs/2602.20472v1",
    "pdf_url": "https://arxiv.org/pdf/2602.20472v1.pdf",
    "title": "Introduction to Strong Alfvénic MHD Turbulence",
    "abstract": "Many astrophysical fluids are magnetized and turbulent. Such fluids can be often described by magnetohydrodynamics (MHD). In this review, we mainly consider MHD turbulence with a strong mean magnetic field whose energy density is greater than or equal to the local kinetic energy density. In these fluids, the MHD waves, especially Alfvén waves, play a dominant dynamical role. Alfvén waves travel along magnetic field lines and collisions of opposite-traveling Alfvén wave packets are essential for turbulence cascade. We focus on strong turbulence regime, where nonlinear interaction during the collision is sufficiently strong and thus one collision is enough to complete turbulence cascade. We will cover the following types of turbulence. First, we review strong Alfvénic MHD turbulence. If the mean magnetic field is very strong, wave packets move very fast and duration of collision is too short to complete turbulence cascade. Even in this case we will show that strong turbulence regime emerges on a small scale. Second, we will consider small-scale MHD turbulence, where interaction of small-scale variants of Alfvén waves (i.e., whistler waves) is important. Third, we review scaling relations in strong relativistic force-free MHD turbulence, where interaction of relativistic Alfvén waves is important. Finally, we briefly discuss scaling relations in compressible MHD turbulence, where interaction of Alfvén waves is still important.",
    "authors": [
      "Jungyeon Cho"
    ],
    "published": "2026-02-24T02:04:37Z",
    "updated": "2026-02-24T02:04:37Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE",
    "doi": "10.1007/s41614-026-00214-0"
  },
  {
    "arxiv_id": "2602.20470v1",
    "url": "https://arxiv.org/abs/2602.20470v1",
    "pdf_url": "https://arxiv.org/pdf/2602.20470v1.pdf",
    "title": "Evolution of Spatial Complexity in Flare Ribbon Substructure and Its Relationship to Magnetic Reconnection Dynamics",
    "abstract": "Recent three-dimensional flare models suggest that flare-ribbon substructure is linked to the fragmentation of the reconnecting current sheet in the corona. Flare-ribbon substructure can therefore potentially serve as a unique diagnostic tool for physical processes in the flare current sheet. In this paper, we describe a new method to quantify the evolution of ribbon substructure, which first extract the ribbon's leading bright front and the quantifies its morphology using the box-counting dimension and Correlation Dimension Mapping (CDM). We first test our method using synthetic observations. We then find that when the flare ribbon boundary has more multi-spatial-scale features (higher box-counting dimension), hard X-ray (HXR) emission and magnetic reconnection rates are the strongest. We also find that the flare-ribbon complexity characterized by CDM has moderate correlation with the IRIS Si IV 1402.77 Å non-thermal velocity (in the negative-polarity ribbon) and reconnection flux rates (in ribbons of both magnetic polarities). We conclude that the build-up of the spatial complexity of the ribbons at multiple spatial scales can serve as an observational proxy for current-sheet fragmentation in the corona.",
    "authors": [
      "Marcel F. Corchado Albelo",
      "Maria D. Kazachenko",
      "Ryan J. French",
      "Vadim M. Uritsky",
      "Emily Mason",
      "Cole A. Tamburri",
      "Rahul Yadav",
      "Benjamin J. Lynch"
    ],
    "published": "2026-02-24T02:00:40Z",
    "updated": "2026-02-24T02:00:40Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2602.20460v1",
    "url": "https://arxiv.org/abs/2602.20460v1",
    "pdf_url": "https://arxiv.org/pdf/2602.20460v1.pdf",
    "title": "Radiation damage to normal mammalian tissue in vivo with laser-driven protons at ultra-high instantaneous dose rate",
    "abstract": "The differential sparing of normal tissues relative to tumor control observed at ultra-high dose rates, referred to as the FLASH effect, has recently gained considerable attention. The therapeutic advantages of FLASH radiotherapy are expected to be further amplified through the use of protons and ions, which enable precise dose deposition at tumor depth while minimizing irradiation of healthy tissues proximal and distal to the target. Nevertheless, the mechanism underlying this sparing effect remains poorly understood. Laser-driven proton accelerators are capable of delivering uniquely high instantaneous dose rates in ultrashort bunches. Here, we report the first in vivo investigation of normal tissue response to laser-driven proton irradiation. Our findings reveal a reduction in tissue swelling following laser-driven proton treatment compared with X-ray irradiations at conventional dose rates. RNA sequencing identified differential gene expression associated with immune and epidermal programs following laser-driven proton irradiations at two different dose levels.",
    "authors": [
      "Lieselotte Obst-Huebl",
      "Jamie L. Inman",
      "Jared De Chant",
      "Kei Nakamura",
      "Sahel Hakimi",
      "Morgan Cole",
      "Hang Chang",
      "Cameron G. R. Geddes",
      "Anthony J. Gonsalves",
      "Jian-Hua Mao",
      "Carl B. Schroeder",
      "Blake A. Simmons",
      "Jeroen van Tilborg",
      "Eric Esarey",
      "Antoine M. Snijders"
    ],
    "published": "2026-02-24T01:39:45Z",
    "updated": "2026-02-24T01:39:45Z",
    "categories": [
      "physics.med-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.med-ph"
  },
  {
    "arxiv_id": "2602.20428v1",
    "url": "https://arxiv.org/abs/2602.20428v1",
    "pdf_url": "https://arxiv.org/pdf/2602.20428v1.pdf",
    "title": "Conceptual Design of Highly-Constrained Splitters for the FFA@CEBAF Energy Upgrade Study",
    "abstract": "The Continuous Electron Beam Accelerator Facility (CEBAF) at Jefferson Lab is investigating a significant energy upgrade utilizing Fixed-Field Alternating-gradient (FFA) recirculating arcs. This upgrade requires the design of complex horizontal beam splitters to manage up to six concurrent beam passes. This paper presents the conceptual design of these splitters, which are subject to severe physical constraints imposed by the existing accelerator tunnel and multifaceted beam dynamics requirements for matching into the permanent-magnet FFA arcs. The design methodology, centered on multi-pass simulations in the Bmad toolkit, is detailed from the initial geometric layout through the advanced optics matching. Key results include a robust geometric arrangement that fits within the spatial boundaries and the development of multiple, flexible optics matching solutions. Furthermore, the design integrates a viable scheme for extracting high-energy beams for the experimental halls, a critical operational requirement. This work establishes a comprehensive and viable conceptual design, forming a baseline for future engineering and performance optimization studies.",
    "authors": [
      "Ryan Bodenstein",
      "Jay Benesch",
      "Alexander Coxe",
      "Kirsten Deitrick",
      "Brian Freeman",
      "Randika Gamage",
      "Reza Kazimi",
      "Donish Khan",
      "Katheryne Price",
      "Ben Schaumloffel"
    ],
    "published": "2026-02-24T00:01:02Z",
    "updated": "2026-02-24T00:01:02Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.20411v1",
    "url": "https://arxiv.org/abs/2602.20411v1",
    "pdf_url": "https://arxiv.org/pdf/2602.20411v1.pdf",
    "title": "Driver-delay chicanes for a multistage plasma-based accelerator facility",
    "abstract": "The SPARTA project aims to design a medium-sized accelerator facility that facilitates new experiments in strong-field quantum electrodynamics using plasma-based accelerators. For this, we need several plasma stages and, therefore, several drivers. Drivers can be either an ultra-relativistic charged particle beam or a high-intensity laser beam. In case we use particle beams, we need a method of distributing these beams from a radio-frequency accelerator to the different plasma stages. A central part of this is a delay scheme that ensures temporal synchronization of the drivers. In this paper, we demonstrate how to achieve a 2 ns delay in $\\sim$12 m, while keeping the first-order beam parameters periodic.",
    "authors": [
      "D. Kalvik",
      "E. Adli",
      "P. Drobniak",
      "F. Peña",
      "C. A. Lindstrøm"
    ],
    "published": "2026-02-23T23:17:52Z",
    "updated": "2026-02-23T23:17:52Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  }
]