{
  "arxiv_id": "2104.12730v2",
  "url": "https://arxiv.org/abs/2104.12730v2",
  "pdf_url": "https://arxiv.org/pdf/2104.12730v2.pdf",
  "title": "An efficient high-current circuit for fast radio-frequency spectroscopy   in cold atomic gases",
  "abstract": "We design and implement a low-impedance, high-current radio-frequency (RF) circuit, enabling fast coherent coupling between magnetic levels in cold alkali atomic samples. It is based on a compact shape-optimized coil that maximizes the RF field coupling with the atomic magnetic dipole, and on coaxial transmission-line transformers that step up the field-generating current flowing in the coil by a factor $\\sim\\,4$ to about $7.5\\,$A for $100\\,$W of RF driving. This allows to obtain a RF coupling field of about $0.035\\,\\text{G}/\\sqrt{\\text{W}}$ at the atomic sample location. The system is robust and versatile, as it generates a large RF field without compromising on the available optical access, and its central resonant frequency can be adjusted in situ. Our approach provides a cost-effective, reliable solution, featuring a negligible level of interference with surrounding electronic equipment thanks to its symmetric layout. We test the circuit performance using a maximum RF power of $80\\,$W at a frequency around $82\\,$MHz, which corresponds to a measured Rabi frequency $\\Omega_R/2\\pi \\simeq 18.5\\,$kHz, i.e. a $\\pi$-pulse duration of about $27\\,\\mu$s, between two of the lowest states of ${}^6$Li at an offset magnetic field of $770\\,$G. Our solution can be readily adapted to other atomic species and vacuum chamber designs, in view of an increasing modularity of cold atom experiments.",
  "authors": [
    "F. Scazza",
    "G. Del Pace",
    "L. Pieri",
    "R. Concas",
    "W. J. Kwon",
    "G. Roati"
  ],
  "published": "2021-04-26T17:21:53Z",
  "updated": "2025-10-29T11:08:32Z",
  "categories": [
    "physics.atom-ph",
    "cond-mat.quant-gas",
    "physics.ins-det"
  ],
  "primary_category": "physics.atom-ph",
  "doi": "10.1063/5.0276530"
}