{
  "arxiv_id": "2505.00042v2",
  "url": "https://arxiv.org/abs/2505.00042v2",
  "pdf_url": "https://arxiv.org/pdf/2505.00042v2.pdf",
  "title": "Characterisation of the neutron beam in the n_TOF-EAR2 experimental area   at CERN following the spallation target upgrade",
  "abstract": "The n_TOF facility at CERN has undergone a major upgrade after the installation of a new spallation target, designed to improve the features of both neutron beamlines at the experimental areas 1 and 2 (EAR1 and EAR2) and the commissioning of a new experimental area (NEAR). Due to improved coupling of the spallation target with the EAR2 beamline, the upgrade resulted in a significantly increased neutron flux and improved neutron energy resolution. This paper presents the results of the commissioning phase that followed to characterise the EAR2 neutron beamline and validate the FLUKA Monte Carlo simulations of the facility. The main features of the neutron beam, namely the neutron flux, spatial profile and energy resolution, are evaluated and compared to the previous target. The neutron flux presents a general increase of 20% below 1 eV, 40% between 1 eV and 100 keV and 50% between 100 keV and 10 MeV. The measured width of the beam profile was 3 cm (FWHM) at the reference position for neutron capture measurements. The energy resolution with the new spallation target shows a significant improvement compared to the previous one. Moreover, FLUKA Monte Carlo simulations present a good agreement with the measured neutron flux and profile within uncertainties, and a remarkable reproduction of the energy resolution.",
  "authors": [
    "J. A. Pavon-Rodriguez",
    "J. Lerendegui-Marco",
    "A. Manna",
    "S. Amaducci",
    "M. Sabate-Gilarte",
    "E. Musacchio-Gonzalez",
    "M. Bacak",
    "V. Alcayne",
    "M. A.",
    "Cortes-Giraldo",
    "V. Vlachoudis",
    "R. Zarrella",
    "F. Garcia-Infantes",
    "E. Stamati",
    "A. Casanovas",
    "N. Patronis",
    "L. Tassan-Got",
    "J. M. Quesada",
    "the n_TOF Collaboration"
  ],
  "published": "2025-04-29T21:19:07Z",
  "updated": "2025-10-29T13:45:45Z",
  "categories": [
    "physics.ins-det",
    "hep-ex",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det"
}