{
  "arxiv_id": "2506.08384v2",
  "url": "https://arxiv.org/abs/2506.08384v2",
  "pdf_url": "https://arxiv.org/pdf/2506.08384v2.pdf",
  "title": "Planar Collisionless Shock Simulations with Semi-Implicit   Particle-in-Cell Model FLEKS",
  "abstract": "This study investigates the applicability of the semi-implicit particle-in-cell code FLEKS to heliospheric shock simulations. We examine one- and two-dimensional local planar shock simulations, initialized using MHD states with upstream conditions representative of plasmas in the hypersonic, $\\beta\\sim 1$ regime, for both quasi-perpendicular and quasi-parallel configurations. The refined algorithm in FLEKS proves robust, enabling accurate shock simulations with a grid resolution on the order of the electron inertial length $d_e$. Our simulations successfully capture key shock features, including shock structures (foot, ramp, overshoot, and undershoot), upstream and downstream waves (fast magnetosonic, whistler, Alfv\\'en ion-cyclotron, and mirror modes), and non-Maxwellian particle distributions. Crucially, we find that at least two spatial dimensions are critical for accurately reproducing downstream wave physics in quasi-perpendicular shocks and capturing the complex dynamics of quasi-parallel shocks, including surface rippling, shocklets, SLAMS, magnetic reconnection and jets. Furthermore, our parameter studies demonstrate the impact of mass ratio and grid resolution on shock physics. This work provides valuable guidance for selecting appropriate physical and numerical parameters for shock simulations using a semi-implicit PIC method, paving the way for incorporating kinetic shock processes into large-scale collisionless plasma simulations with the MHD-AEPIC model.",
  "authors": [
    "Hongyang Zhou",
    "Yuxi Chen",
    "Chuanfei Dong",
    "Liang Wang",
    "Ying Zou",
    "Brian Walsh",
    "Gábor Tóth"
  ],
  "published": "2025-06-10T02:50:06Z",
  "updated": "2025-10-30T02:19:19Z",
  "categories": [
    "physics.space-ph",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.space-ph"
}