{
  "arxiv_id": "2511.22308v2",
  "url": "https://arxiv.org/abs/2511.22308v2",
  "pdf_url": "https://arxiv.org/pdf/2511.22308v2.pdf",
  "title": "Timing resolution from very thin LGAD sensors tested on particle beam down to 12 ps",
  "abstract": "The paper reports on the timing resolution obtained with the Low-Gain Avalanche Diode (LGAD) sensors for extreme fluences at the DESY Test Beam Facility with 4 GeV/c electrons. The LGADs adopt an $n$-in-$p$ technology with a $p^{+}$-type boron gain implant, co-implanted with carbon to mitigate acceptor deactivation. The substrate thickness of the sensors varies from 20 $μ$m to 45 $μ$m, with an active area spanning from 0.75 $\\times$ 0.75 to 1.28 $\\times$ 1.28 mm$^{2}$. A set of 30 $μ$m sensors irradiated with neutrons at fluences between 4 $\\times$ 10$^{14}$ and 2.5 $\\times$ 10$^{15}$ n$_{\\textrm{1 MeV eq.}}$cm$^{-2}$ were tested on the beam. The gain was measured between 7 and 40 across all non-irradiated sensors in the study, and between 7 and 30 in irradiated sensors. The experimental setup consisted of a 45 $μ$m-thick trigger sensor with an active area of 3.6 $\\times$ 3.6 mm$^{2}$, four device-under-test (DUT) planes, and a Photonis micro-channel plate photomultiplier tube (MCP) as a time reference. The timing resolution was calculated from Gaussian fitting of the difference in times of arrival of a particle at a DUT and the MCP, using the constant fraction discrimination technique. A timing resolution of 26.4 ps was achieved in 45 $μ$m sensors, and down to 16.6 ps in 20 $μ$m sensors. The combination of two 20 $μ$m LGAD sensors reached a timing resolution of 12.2 ps. A timing resolution of below 20 ps was obtained in all irradiated 30 $μ$m sensors.",
  "authors": [
    "Robert Stephen White",
    "Marco Ferrero",
    "Valentina Sola",
    "Anna Rita Altamura",
    "Roberta Arcidiacono",
    "Maurizio Boscardin",
    "Nicolo Cartglia",
    "Matteo Centis Vignali",
    "Tommaso Croci",
    "Matteo Durando",
    "Simone Galletto",
    "Alessandro Fondacci",
    "Leonardo Lanteri",
    "Luca Menzio",
    "Francesco Moscatelli",
    "Giovanni Paternoster",
    "Federico Siviero"
  ],
  "published": "2025-11-27T10:39:44Z",
  "updated": "2026-01-14T10:03:41Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}