{
  "arxiv_id": "2601.09629v1",
  "url": "https://arxiv.org/abs/2601.09629v1",
  "pdf_url": "https://arxiv.org/pdf/2601.09629v1.pdf",
  "title": "Characterization of Silicon-Membrane TES Microcalorimeters for Large-Format X-ray Spectrometers with Integrated Microwave SQUID Readout",
  "abstract": "We present the electro-thermal characterization of transition-edge sensor (TES) detectors suspended on Si membranes fabricated using a silicon-on-insulator (SOI) wafer. The use of an all-silicon fabrication platform, in contrast to the more commonly used silicon nitride membranes, is compatible with monolithic fabrication of integrated TES and SQUID circuits. The all-silicon architecture additionally allows efficient use of focal plane area; the readout circuitry may be positioned out of the focal plane by bending a thinned portion of the chip. Compatibility with integrated fabrication and efficient use of focal plane area provide a path to an efficient soft X-ray spectrometer.   This work is motivated by our goal to develop a 10,000-pixel TES spectrometer to overcome critical measurement limitations in catalysis research. The characterization of fragile, carbon-based intermediates via techniques like Resonant Inelastic X-ray Scattering (RIXS) is often precluded by the slow, high-flux nature of existing technologies. The new instrument will allow for fast RIXS measurements to be made without causing sample damage. We verify the detector models and measure the energy resolution using a pulsed optical laser, demonstrating the viability of this approach for the final instrument to be deployed at the National Synchrotron Light Source II (NSLS-II).",
  "authors": [
    "Avirup Roy",
    "Robinjeet Singh",
    "Joel C. Weber",
    "W. B. Doriese",
    "Johnathon Gard",
    "Mark W. Keller",
    "John A. B. Mates",
    "Kelsey M. Morgan",
    "Nathan J. Ortiz",
    "Daniel S. Swetz",
    "Daniel R. Schmidt",
    "Joel N. Ullom",
    "Evan P. Jahrman",
    "Thomas C. Allison",
    "Sasawat Jamnuch",
    "John Vinson",
    "Charles J. Titus",
    "Cherno Jaye",
    "Daniel A. Fischer",
    "Galen C. O'Neil"
  ],
  "published": "2026-01-14T17:01:34Z",
  "updated": "2026-01-14T17:01:34Z",
  "categories": [
    "physics.ins-det",
    "cond-mat.supr-con",
    "quant-ph"
  ],
  "primary_category": "physics.ins-det"
}