{
  "arxiv_id": "2508.09895v2",
  "url": "https://arxiv.org/abs/2508.09895v2",
  "pdf_url": "https://arxiv.org/pdf/2508.09895v2.pdf",
  "title": "Exploring the Physics of the Plasma Liner Experiment: A Multi-dimensional Study with FLASH, OSIRIS, and HELIOS",
  "abstract": "The Plasma Liner Experiment (PLX) at Los Alamos National Laboratory (LANL) is a platform that seeks to achieve fusion via the Plasma-Jet-Driven Magneto-Inertial Fusion (PJMIF) concept. The experiment utilizes a constellation of plasma guns to generate fusion-relevant conditions and consists of three main phases: (1) target formation, in which up to four plasma guns shoot magnetized hydrogen or deuterium-tritium jets to form a quasi-spherical target, (2) liner formation, in which a 36 guns fire high-atomic-number (e.g., xenon) jets to form a liner shell, and (3) target compression, in which the formed liner implodes the pre-formed target. Each phase of the PLX operates in different plasma regimes, with different physics at play, thus each phase must be simulated separately with appropriate codes. In this study we highlight 1-, 2-, and 3-D simulation results of all three phases using the FLASH, OSIRIS, and HELIOS codes. Some of the key physical processes involved include shock dynamics, kinetic effects, anisotropic thermal conduction, resistive magnetic diffusion, radiation transport, and magnetized jet dynamics. The simulations show that the PLX can form a preheated ($\\sim$40 eV), magnetized (electron Hall parameter $>$1) target plasma, and a quasi-collisional liner shell, which can subsequently compress the target to fusion-relevant conditions, reaching temperatures in excess of 1 keV.",
  "authors": [
    "E. C. Hansen",
    "P. Farmakis",
    "D. Michta",
    "C. Ren",
    "H. Wen",
    "S. Langendorf",
    "F. Chu",
    "P. Tzeferacos"
  ],
  "published": "2025-08-13T15:55:14Z",
  "updated": "2025-12-17T18:37:01Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}