{
  "arxiv_id": "2510.09579v2",
  "url": "https://arxiv.org/abs/2510.09579v2",
  "pdf_url": "https://arxiv.org/pdf/2510.09579v2.pdf",
  "title": "The impact of plasma turbulence on atomic reaction rates in detached divertors",
  "abstract": "Numerical modeling of the edge and scrape-off layer (SOL) must account for atomic processes such as hydrogenic ionization and recombination, charge-exchange, and line radiation. Their reaction rates depend non-linearly on density and temperature and are thus sensitive to turbulent fluctuations, whose inclusion/omission may significantly affect model outcomes. We quantify the impact of fluctuations by studying global turbulence simulations of the edge and SOL of ASDEX-Upgrade in both attached and detached conditions. While the effect of fluctuations is minimal for the attached state, pronounced discrepancies emerge in colder, detached conditions. When accounting for turbulent fluctuations, ionization and radiation rates at the detachment front are reduced by a factor of 2 when compared to mean-field calculations. The effect arises from fluctuations crossing below the ionization temperature threshold, facilitated by low mean temperature and increased fluctuation amplitudes at the detachment front. The rate reduction (rather than rate increase) is explained by the character of divertor fluctuations (negative density-temperature correlation, i.e. cold and dense blobs), notably distinct from characteristic fluctuations found at the outboard-midplane (positive correlation, i.e. hot and dense blobs). Furthermore, the cold and dense fluctuations enable efficient plasma recombination even at average temperatures above the recombination threshold. In detached conditions, the combined plasma particle source from ionization and recombination is therefore effectively reduced by at least 50% when compared to the standard mean-field source.",
  "authors": [
    "Konrad Eder",
    "Wladimir Zholobenko",
    "Andreas Stegmeir",
    "Kaiyu Zhang",
    "Frank Jenko"
  ],
  "published": "2025-10-10T17:34:48Z",
  "updated": "2025-12-17T22:37:28Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}