{
  "arxiv_id": "2512.16196v1",
  "url": "https://arxiv.org/abs/2512.16196v1",
  "pdf_url": "https://arxiv.org/pdf/2512.16196v1.pdf",
  "title": "Toward the Origins of Binding Energy Shifts and Satellites Formation During Plasma-XPS Measurements",
  "abstract": "In plasma X ray photoelectron spectroscopy emerges as a powerful platform for real time, in situ chemical analysis under conditions relevant to semiconductor processing and other plasma enabled technologies. This study investigates the origins of binding energy shifts and satellite peaks formation observed during plasma XPS measurements across conductive, dielectric, and gas phase systems. Using a standard laboratory based ambient pressure XPS apparatus coupled with an alternating current driven capacitively coupled plasma source, we show that metastable surface species, such as transient Au oxides, can be detected during plasma exposure, revealing chemical states hardly accessible using conventional ultrahigh vacuum XPS. In dielectric samples, we observe pressure- and plasma type dependent BE shifts up to 50 eV, attributed to X ray induced and plasma mediated surface charging. These shifts are mitigated at higher pressures plasmas or in electronegative plasmas, the latter due to enhanced charge compensation mechanisms involving slow negative ions. For gas phase species, AC plasma excitation leads to spectral broadening and the emergence of satellite peaks with a few eV energy separations, linked to oscillating local plasma potentials in the probing volume. These findings highlight the important and complex interplay of plasma parameters, surface charging, and local electric fields in shaping XPS spectra. Overall, plasma XPS emerges as a critical metrological tool for probing transient surface chemistry, with implications for semiconductor processing, material synthesis, and plasma diagnostics.",
  "authors": [
    "J. Trey Diulus",
    "Ashley R. Head",
    "Jorge Anibal Boscoboinik",
    "Carles Corbella Roca",
    "Alexander Tselev",
    "Andrei Kolmakov"
  ],
  "published": "2025-12-18T05:37:38Z",
  "updated": "2025-12-18T05:37:38Z",
  "categories": [
    "physics.plasm-ph",
    "physics.ins-det"
  ],
  "primary_category": "physics.plasm-ph"
}