{
  "arxiv_id": "2512.15271v1",
  "url": "https://arxiv.org/abs/2512.15271v1",
  "pdf_url": "https://arxiv.org/pdf/2512.15271v1.pdf",
  "title": "MHD Simulation Study on Impurity Assimilation Efficiency and Disruption Dynamics during Shattered Pellet Injection",
  "abstract": "Shattered Pellet Injection (SPI) has become a critical technique for mitigating plasma disruptions in fusion devices, yet optimizing its efficiency demands a proper understanding of the interaction between impurity dynamics and MHD response. We perform 3D nonlinear MHD simulations of SPI-induced disruption in a J-TEXT-like tokamak using the NIMROD code, systematically examining key parameters: fragment velocity and fineness, injection quantity, impurity composition, injection location and multiple injectors, resistivity, and parallel thermal conductivity. We find that slower fragment velocity enhances impurity assimilation and amplifies MHD activity. Finer fragments significantly increase impurity ablation and cooling efficiency. Mixed deuterium-neon pellets effectively elevate electron density without compromising radiative cooling efficiency. Plasma poloidal rotation affects ablation and cooling efficiency, whereas toroidally uniform multi-pellet injection enhances impurity ablation by nearly a factor equal to the number of pellets and lowers radiation asymmetry. Higher plasma parallel thermal conductivity results in higher radiation cooling efficiency in parallel directions, enhances impurity transport, and reduces toroidal peaking factor (TPF) of radiation. Variations in resistivity significantly influence Ohmic heating, impurity deposition and current dynamics after TQ, with higher resistivity leading to stronger magnetic perturbations and more pronounced current spikes. These findings provide physical bases for optimizing SPI schemes in future tokamak devices.",
  "authors": [
    "Jinqiang Mao",
    "Ping Zhu",
    "Shiyong Zeng"
  ],
  "published": "2025-12-17T10:25:25Z",
  "updated": "2025-12-17T10:25:25Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}