{
  "arxiv_id": "2508.16197v2",
  "url": "https://arxiv.org/abs/2508.16197v2",
  "pdf_url": "https://arxiv.org/pdf/2508.16197v2.pdf",
  "title": "On the nature and charge state of the X-Defect, a radiation-induced Silicon defect with field-enhanced charge carrier emission",
  "abstract": "The elusive X-Defect, a defect found in low-resistivity $p$-type Silicon after irradiation, observed as a low-temperature shoulder of the $\\mathrm{B}_\\mathrm{i}\\mathrm{O}_\\mathrm{i}$ defect (Boron-interstitial-Oxygen-interstitial complex) in Thermally Stimulated Current (TSC) measurements, was investigated to determine its properties, matching them with those of a previously identified defect. Through a combination of TSC, Deep-Level Transient Spectroscopy (DLTS), Difference-DLTS (DDLTS), numerical simulations of field-enhanced charge carrier emissions in TSC measurements and a comparison to literature, the X-Defect was identified as the singly positively charged Silicon di-vacancy $\\mathrm{V}_2(+/0)$. This assignment is supported by an agreement in activation energy, capture cross-section, trap type and charge emission process, as well as simulations comparing the effects of phonon-assisted tunnelling (PAT) and Poole-Frenkel (PF) mechanisms on TSC spectra. DDTLS measurements revealed a quadratic dependence of the activation energy on the electric field strength, confirming PAT as the prevailing mechanism over PF in the case of the radiation-induced X-Defect. Assigning the X-Defect to an electrically neutral defect in the space charge region resolves previous contradictions regarding its deficiency in impacting on the effective doping concentration.",
  "authors": [
    "Niels Sorgenfrei",
    "Yana Gurimskaya",
    "Anja Himmerlich",
    "Michael Moll",
    "Ulrich Parzefall",
    "Ioana Pintilie",
    "Joern Schwandt"
  ],
  "published": "2025-08-22T08:15:29Z",
  "updated": "2025-11-27T08:15:02Z",
  "categories": [
    "cond-mat.mtrl-sci",
    "hep-ex",
    "physics.ins-det"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1016/j.nima.2025.171133"
}