{
  "arxiv_id": "2509.09766v2",
  "url": "https://arxiv.org/abs/2509.09766v2",
  "pdf_url": "https://arxiv.org/pdf/2509.09766v2.pdf",
  "title": "Nonequilibrium nonlinear response theory of amplitude-dependent dissipative conductivity in disordered superconductors",
  "abstract": "This work investigates amplitude-dependent nonlinear corrections to the dissipative conductivity in superconductors, using the Keldysh--Usadel theory of nonequilibrium superconductivity, which captures the nonequilibrium dynamics of both quasiparticles and the pair potential. Our rigorous formulation naturally incorporates both the direct nonlinear action of the photon field and indirect contributions mediated by nonequilibrium variations in the pair potential, namely the Eliashberg effect and the Higgs mode. The third-harmonic current, often regarded as a hallmark of the Higgs mode in disordered superconductors, arises from both the direct photon action and the Higgs mode. Our numerical results are in excellent agreement with previous studies. In contrast, the first-harmonic current, and consequently the dissipative conductivity, receives contributions from all three mechanisms: the direct photon action, the Higgs mode, and the Eliashberg effect. It is shown that that the nonlinear correction to dissipative conductivity in dirty-limit superconductors can serve as a fingerprint of the Higgs mode, appearing as a resonance peak at a frequency near the superconducting gap \\( Δ\\). In addition, our results provide microscopic insight into amplitude-dependent dissipation at frequencies well below \\( Δ\\), which is particularly relevant for applied superconducting devices. In particular, the long-standing issue concerning the frequency dependence of the amplitude-dependent quality factor is explained as originating from the direct nonlinear action of the photon field, rather than from contributions by the Higgs mode and the Eliashberg effect. Our practical and explicit expression for the nonlinear conductivity formula makes our results accessible to a broad range of researchers.",
  "authors": [
    "Takayuki Kubo"
  ],
  "published": "2025-09-11T18:00:02Z",
  "updated": "2025-11-27T04:12:02Z",
  "categories": [
    "cond-mat.supr-con",
    "physics.acc-ph",
    "physics.ins-det",
    "quant-ph"
  ],
  "primary_category": "cond-mat.supr-con"
}