{
  "arxiv_id": "2511.22529v1",
  "url": "https://arxiv.org/abs/2511.22529v1",
  "pdf_url": "https://arxiv.org/pdf/2511.22529v1.pdf",
  "title": "A nonlinear multiphysics model for the design validation of the ASTAROTH copper-steel cryogenic chamber",
  "abstract": "Among the global efforts to directly detect dark matter, the only positive claim so far relies on NaI(Tl) crystal detectors, making this technology of particular interest. ASTAROTH is a project aimed at developing the next generation of such detectors by reading out their scintillation light with SiPM matrices operated at cryogenic temperatures. This paper describes the innovative design of the ASTAROTH cryostat, consisting of a double-walled copper-steel cryogenic chamber that cools the detectors by means of a liquid argon bath. The detectors are thermalized in a helium atmosphere at a temperature tunable from 87 to 150 K. The design has been validated in terms of heat transfer efficiency and mechanical stress, developing of a nonlinear multiphysics model. The mechanical properties of OFHC copper were experimentally evaluated on dedicated tensile samples. The simulation results show that the structural integrity is guaranteed. At the highest operating temperature, the region with the steepest temperature gradient exhibits stresses that slightly exceed the yield strength of copper (localized strain-hardened condition). Following construction, the cryostat was commissioned and has been in regular operation for over 30 cooling cycles, with no signs of degradation. The temperature can be tuned across the full target range and remains stable within 0.1 K. These results demonstrate that this is a viable design for next-generation dark matter detectors, as well as for a variety of applications requiring uniform and tunable gas-conducted cooling of instrumentation.",
  "authors": [
    "F. Alessandria",
    "F. B. Armani",
    "S. Coelli",
    "D. Cortis",
    "D. D'Angelo",
    "E. Martinenghi",
    "M. Monti",
    "D. Orlandi",
    "M. Sorbi",
    "V. Toso",
    "A. Zani"
  ],
  "published": "2025-11-27T15:09:09Z",
  "updated": "2025-11-27T15:09:09Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}