{
  "arxiv_id": "2601.17161v1",
  "url": "https://arxiv.org/abs/2601.17161v1",
  "pdf_url": "https://arxiv.org/pdf/2601.17161v1.pdf",
  "title": "Industrial Deposition of Wavelength-Shifting Films for Liquid Argon Photon Detection Systems",
  "abstract": "The Deep Underground Neutrino Experiment (DUNE) Phase-II Far Detector is considering an unprecedentedly large-area ~2000 m$^2$ photon detection system to achieve a target mean light yield of 180 PE/MeV. Meeting this requirement demands scalable, cost-effective, and high-quality wavelength-shifter (WLS) coatings capable of converting 127 nm liquid-argon scintillation light into visible photons with high efficiency. We report on the successful realization of an industrial physical vapor deposition (PVD) process for \\textit{p}-terphenyl (pTP) coatings, adapted from vacuum deposition techniques developed for OLED display manufacturing, to produce uniform WLS layers on large-area inorganic substrates, a task traditionally challenged by adhesion and uniformity issues at organic--inorganic interfaces. Surface characterization by profilometry and spectroscopic measurements confirms sub-10% thickness uniformity for 1-2 $μ$m films and emission spectra consistent with high-quality pTP reference samples. The industrial process demonstrates reproducibility, scalability, and significantly reduced production time compared to laboratory-based methods, while maintaining the optical quality required for large-scale liquid-argon time-projection chamber (LArTPC) photon detection systems. These results establish a viable pathway for mass production of high-performance pTP coatings for DUNE FD3 and future neutrino experiments.",
  "authors": [
    "Babak Azmoun",
    "Aleksey Bolotnikov",
    "Francesca Capocasa",
    "Milind Diwan",
    "Yimin Hu",
    "Jay Hyun Jo",
    "William Lenz",
    "Yichen Li",
    "Abdul Rumaiz",
    "Vyara Tsvetkova",
    "Matteo Vicenzi"
  ],
  "published": "2026-01-23T20:48:23Z",
  "updated": "2026-01-23T20:48:23Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}