[
  {
    "arxiv_id": "2601.19579v1",
    "url": "https://arxiv.org/abs/2601.19579v1",
    "pdf_url": "https://arxiv.org/pdf/2601.19579v1.pdf",
    "title": "First observation of the $γ$-ray beam production by the backward Compton scattering of extreme ultraviolet light emitted from an undulator",
    "abstract": "Compton scattering of photons off high-energy electrons is a fundamental quantum mechanical process widely utilized to produce a $γ$-ray beam for scientific research. Instead of injecting laser light into a storage ring as a conventional way, we have developed an innovative method to achieve drastically higher energies approaching the ring energy by the backward Compton scattering of extreme ultraviolet light. In this method, $92$ $\\mathrm{eV}$ photons obtained from an undulator in a storage ring were reflected back to the original ring using a Mo/Si multilayer mirror. Consequently, $γ$-ray beam production through the extreme ultraviolet light Compton scattering was observed for the first time in a demonstration experiment at the $1$ $\\mathrm{GeV}$ ring, NewSUBARU. The measured energy spectrum was well reproduced by a theoretical calculation with the maximum energy of $0.543$ $\\mathrm{GeV}$. The production rate was $1.4 \\pm 0.1$ kcps for the energies above $0.160$ $\\mathrm{GeV}$. This rate was quantitatively explained by the luminosity and the scattering cross section. The present work paved the way to create a new $γ$-ray beam source for future applications such as hadron photoproduction experiments.",
    "authors": [
      "Norihito Muramatsu",
      "Manabu Miyabe",
      "Masahiro Okabe",
      "Schin Date",
      "Tetsuo Harada",
      "Kazuhiro Kanda",
      "Shuji Miyamoto",
      "Haruo Ohkuma",
      "Hajime Shimizu",
      "Shinsuke Suzuki",
      "Atsushi Tokiyasu"
    ],
    "published": "2026-01-27T13:11:50Z",
    "updated": "2026-01-27T13:11:50Z",
    "categories": [
      "physics.acc-ph",
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.19565v1",
    "url": "https://arxiv.org/abs/2601.19565v1",
    "pdf_url": "https://arxiv.org/pdf/2601.19565v1.pdf",
    "title": "Development of Low-Noise Two-stage dc-SQUID for TES Detector Readout",
    "abstract": "Direct-current superconducting quantum interference devices (dc-SQUIDs) are one of the most sensitive magnetic detectors. These sensors are extensively used in the readout of superconducting transition edge sensors (TESs), which are used for the detection of weak signals. A cosmic microwave background (CMB) polarization telescope operating in 22-48 GHz is currently under developing. The TESs calorimeter of the telescope will be readout by a time-division multiplexer (TDM) SQUID readout system. We develop a two-stage dc-SQUID amplifier circuit, comprising an input-stage SQUID with 4 SQUID cells and a series SQUID array (SSA) with 100 SQUID cells. This configuration has been shown to achieve extremely high signal gain while effectively controlling system noise. We assess the system noise at $300$ $mK$ in an adiabatic demagnetisation refrigerator (ADR). The the measured magnetic flux noise of the two-stage SQUID circuit system is approximately $0.3$ $μΦ_{0}/\\sqrt{Hz}$ at $10$ $kHz$. The current noise equivalent to the input coil of input SQUID is about $2.4$ $pA/\\sqrt{Hz}$. This result meets the low-noise readout requirements of the CMB TES and other applications with TES detectors.",
    "authors": [
      "Nan Li",
      "Mengjie Song",
      "Sixiao Hu",
      "Wentao Wu",
      "Songqing Liu",
      "Tangchong Kuang",
      "Yudong Gu",
      "Xiangxiang Ren",
      "Xufang Li",
      "He Gao",
      "Zhengwei Li",
      "Congzhan Liu"
    ],
    "published": "2026-01-27T12:57:57Z",
    "updated": "2026-01-27T12:57:57Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.16311v2",
    "url": "https://arxiv.org/abs/2512.16311v2",
    "pdf_url": "https://arxiv.org/pdf/2512.16311v2.pdf",
    "title": "Bunch-by-Bunch Prediction of Beam Transverse Position, Phase, and Length in a Storage Ring Using Neural Networks",
    "abstract": "Real-time, bunch-by-bunch monitoring of transverse position, longitudinal phase, and bunch length is crucial for beam control in diffraction-limited storage rings, where complex collective dynamics pose unprecedented diagnostic challenges. This study presents a neural network framework that simultaneously predicts these parameters directly from beam position monitor waveforms. The hybrid architecture integrates specialized Multi-Layer Perceptron (MLP), Convolutional Neural Network (CNN), and Long Short-Term Memory with Attention (LSTM-Attention) sub-networks, overcoming key limitations of traditional methods such as serial processing chains and batch-mode operation. Validated on experimental data from the Shanghai Synchrotron Radiation Facility and Hefei Light Source, the model achieves high prediction accuracy with a sub-millisecond latency of 0.042 ms per bunch. This performance demonstrates its potential as a core tool for real-time, multi-parameter diagnostics and active feedback in next-generation light sources.",
    "authors": [
      "Can Liu",
      "Xing Yang",
      "Youming Deng",
      "Qingqing Duan",
      "Yongbin Leng"
    ],
    "published": "2025-12-18T08:51:01Z",
    "updated": "2026-01-27T08:45:54Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.03955v2",
    "url": "https://arxiv.org/abs/2509.03955v2",
    "pdf_url": "https://arxiv.org/pdf/2509.03955v2.pdf",
    "title": "Beamstrahlung monitoring at SuperKEKB upgrade 2023",
    "abstract": "Beam monitoring is crucial for particle accelerators to achieve high luminosity. We describe an upgrade of the LABM, a beam monitoring device utilizing observation of the beamstrahlung, radiation emitted by a beam of charged particles when it accelerates in the electromagnetic field of another beam of charged particles.",
    "authors": [
      "Dmitri Liventsev",
      "Giovanni Bonvicini",
      "Daniel Ricalde Herrmann",
      "Pedro L. M. Podesta-Lerma",
      "Makoto Tobiyama"
    ],
    "published": "2025-09-04T07:32:11Z",
    "updated": "2026-01-27T05:54:32Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.19188v1",
    "url": "https://arxiv.org/abs/2601.19188v1",
    "pdf_url": "https://arxiv.org/pdf/2601.19188v1.pdf",
    "title": "Development of Electroformed X-ray Optics Bridging Synchrotron Technology and Space Astronomy",
    "abstract": "We have developed X-ray telescope mirrors using an original electroforming replication technique established through the fabrication of millimeter-aperture, ultra-short-focal-length nanofocusing mirrors for synchrotron X-ray microscopy. This paper presents detailed results of X-ray illumination tests of a 60-mm-diameter, full-circumference, double-reflection monolithic electroformed nickel mirror and its Mirror Module Assembly (MMA). The experiments were conducted at the 1-km beamline BL29XUL at SPring-8. To simulate a parallel X-ray beam from celestial sources, we constructed a dedicated evaluation system, the High-Brilliance X-ray Kilometer-long Large-Area Expanded-beam Evaluation System (HBX-KLAEES). Owing to the high photon flux and the quasi-point-like source with a small divergence provided by HBX-KLAEES, the imaging performance was evaluated with high fidelity, resolving both the sharp core and large-angle components of the Point Spread Function (PSF). The results show an extremely sharp core with a Full Width at Half Maximum (FWHM) of 0.7 arcsec and a Half Power Diameter (HPD) of 14 arcsec, even after integration into the MMA. In addition, a positive correlation was found between angular resolution and axial figure error in both the primary and secondary mirror sections, indicating that axial figure errors contribute to image degradation. Based on these results, the MMA was selected as one of the hard X-ray optics for the FOXSI-4 sounding rocket experiment, which performs high-resolution soft and hard X-ray imaging spectroscopy of solar flares and was successfully launched. These results demonstrate the potential for further improvements in angular resolution and the development of high-resolution, ultra-short focal length X-ray optics for small satellites, including CubeSats.",
    "authors": [
      "Ryuto Fujii",
      "Koki Sakuta",
      "Kazuki Ampuku",
      "Yusuke Yoshida",
      "Makoto Yoshihara",
      "Ayumu Takigawa",
      "Keitoku Yoshihira",
      "Tetsuo Kano",
      "Naoki Ishida",
      "Noriyuki Narukage",
      "Keisuke Tamura",
      "Kikuko Miyata",
      "Gota Yamaguchi",
      "Hidekazu Takano",
      "Yoshiki Kohmura",
      "Shutaro Mohri",
      "Takehiro Kume",
      "Yusuke Matsuzawa",
      "Yoichi Imamura",
      "Takahiro Saito",
      "Kentaro Hiraguri",
      "Hirokazu Hashizume",
      "Hidekazu Mimura",
      "Ikuyuki Mitsuishi"
    ],
    "published": "2026-01-27T04:42:58Z",
    "updated": "2026-01-27T04:42:58Z",
    "categories": [
      "astro-ph.IM",
      "astro-ph.SR",
      "physics.ins-det",
      "physics.optics",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2511.09960v4",
    "url": "https://arxiv.org/abs/2511.09960v4",
    "pdf_url": "https://arxiv.org/pdf/2511.09960v4.pdf",
    "title": "High-throughput Parasitic-independent Probe Thermal Resistance Calibration for Robust Thermal Mapping with Scanning Thermal Microscopy",
    "abstract": "Nanostructured materials, critical for thermal management in semiconductor devices, exhibit a strong size dependence in thermal transport. Studying thermal resistance variation across grain boundaries is critical for designing effective thermal interface materials. Frequency-domain Thermoreflectance (FDTR)-based techniques can provide thermal resistance mapping at the micrometer (μm) scale. Scanning Thermal Microscopy (SThM) enables quantification of local thermal transport with significantly higher spatial resolution (<100 nm). However, challenges in quantifying the raw signal to thermal conductivity and surface sensitivity limit its widespread adoption for understanding nanoscale heat transport and defect-mediated thermal properties in nanostructured films. Here, we introduce a circuit-based probe thermal resistance (R_p) calibration technique independent of parasitic heat pathways, enabling accurate determination of probe heat dissipation and tip temperature rise, thereby allowing extraction of local thermal resistance. SThM achieved sub-100 nm spatial resolution in mapping thermal resistance across a 15 nm-thick Al film deposited via e-beam evaporation on SiO_2 substrate. The thermal resistance maps are converted to thermal conductivity using robust analytical and finite element models that account for tip-sample geometry, lateral heat spreading, and buried interface effects. Gaussian distribution fitting of pixel-level thermal resistance values yields k_Al = 45.1(+4.7/-3.6) W/(m.K) for the ultra-thin Al film (13-15 nm), representing a 5.3-fold reduction from bulk aluminum (237 W/(m.K)). These results agree with published experimental data and theoretical frameworks explaining thickness-dependent heat transport in ultra-thin metallic films.",
    "authors": [
      "Ram Munde",
      "Heng-Ray Chuang",
      "Raisul Islam"
    ],
    "published": "2025-11-13T04:42:28Z",
    "updated": "2026-01-27T02:27:06Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.18780v1",
    "url": "https://arxiv.org/abs/2601.18780v1",
    "pdf_url": "https://arxiv.org/pdf/2601.18780v1.pdf",
    "title": "OptiGAN for Crystal Arrays: Physics-Informed Generative Modeling of Optical Photon Transport in PET Detector Arrays",
    "abstract": "Monte Carlo simulations of optical photon transport are computationally prohibitive for large-scale optical systems including detector arrays and PET systems, restricting practical use to single-crystal studies. This work presents an enhanced conditional generative adversarial network (optiGAN) replacing optical simulations at the crystal array level, extending our single-crystal approach to a 3x3 BGO array. We enhance the Wasserstein-GAN framework with Fourier feature encoding, a learnable latent mapping network, and a physics-informed loss enforcing momentum conservation. Training data is reduced eight-fold by exploiting symmetry. Evaluation employs three studies: a full array evaluation testing generalization from the fundamental domain to the complete geometry, a high-resolution study probing out-of-distribution generalization to untrained positions, and a pencil beam $γ$-photon study assessing practical applicability for experimental detector characterization. Performance is benchmarked against GATE10/Geant4 ground truth, using intrinsic fluctuations between independent Monte Carlo runs as baseline. OptiGAN achieves sliced Wasserstein similarity within 3$σ$-agreement of the baseline across all conditions, demonstrating successful generalization to the full array. The model transitions from electron-emission training data to realistic $γ$-photon interactions, producing flood maps that reproduce characteristic patterns including photopeak clusters and inter-crystal scatter lines. This proof-of-concept demonstrates that physics-informed generative models can accurately simulate optical photon transport in segmented scintillator arrays. The reproduction of experimentally relevant flood map features validates optiGAN for PET detector development and establishes a foundation for models generalizing across diverse array configurations.",
    "authors": [
      "Stephan Naunheim",
      "Brandon Pardi",
      "Guneet Mummaneni",
      "Carlotta Trigila",
      "Emilie Roncali"
    ],
    "published": "2026-01-26T18:48:05Z",
    "updated": "2026-01-26T18:48:05Z",
    "categories": [
      "physics.ins-det",
      "physics.comp-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.04554v2",
    "url": "https://arxiv.org/abs/2511.04554v2",
    "pdf_url": "https://arxiv.org/pdf/2511.04554v2.pdf",
    "title": "Electromagnetic plasma wave modes propagating along light-cone coordinates",
    "abstract": "We present new electromagnetic plasma wavepacket solutions that propagates in one time and one space coordinates. Differently to the usual plane wave solution, which is written in terms of separation of variables, all our solutions are along the light-cone coordinates. This allow us to find several new solutions whose functionality properties rely on the conditions imposed on the choice for their light-cone coordinates dependence. The presented wavepacket solutions are constructed in terms of multiplications of Airy functions, Parabolic cylinder functions, Mathieu functions, or Bessel functions. We thoroughly analyze the case of a double Airy solution, which have new electromagnetic properties, as a defined wavefront, and velocity faster than the electromagnetic plane wave counterpart solution. It is also mentioned how more general structured wavepackets can be constructed from these new solutions.",
    "authors": [
      "Felipe A. Asenjo",
      "Swadesh M. Mahajan"
    ],
    "published": "2025-11-06T17:07:31Z",
    "updated": "2026-01-26T17:59:15Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.18719v1",
    "url": "https://arxiv.org/abs/2601.18719v1",
    "pdf_url": "https://arxiv.org/pdf/2601.18719v1.pdf",
    "title": "Detection of high-frequency gravitational waves using SRF cavities",
    "abstract": "Today, apart from some isolated R&D efforts, there are no gravitational wave (GW) experiments, yet which explore a large part of the vast frequency range above the LIGO/Virgo band. It is planned to establish an experiment at Deutsches Elektronen-Synchrotron (DESY) and at the Superconducting Quantum Materials and Systems (SQMS) Center at Fermi National Accelerator Laboratory (Fermilab) to search for high-frequency GWs in the frequency range of 10 kHz to 100 MHz. The basic idea is to use superconducting radiofrequency (SRF) cavities to detect tiny harmonic deformations induced by GWs which change the boundary conditions of the oscillating electromagnetic field. This paper summarizes the challenging environmental boundary requirements, and the R&D to operate a cavity using a low level RF (LLRF) system which pushes beyond state-of-the-art accuracy and resolutions and a seismic noise mitigated cryostat at 1.8 K. The focus of this paper is the warm and cold commissioning of a prototype cavity, built 20 years ago during the MAGO collaboration, and its first measurement in our collaborative research project.",
    "authors": [
      "M. Wenskat",
      "B. Giaccone",
      "J. Branlard",
      "V. Chouhan",
      "C. Dokuyucu",
      "L. Fischer",
      "I. Gonin",
      "A. Grassellino",
      "W. Hillert",
      "T. Khabiboulline",
      "T. Krokotsch",
      "F. Ludwig",
      "G. Marconato",
      "A. Melnychuk",
      "G. Moortgat-Pick",
      "A. Muhs",
      "A. Netepenko",
      "Y. Orlov",
      "M. Paulsen",
      "K. Peters",
      "L. Pfeiffer",
      "S. Posen",
      "O. Pronitchev",
      "H. Schlarb"
    ],
    "published": "2026-01-26T17:42:03Z",
    "updated": "2026-01-26T17:42:03Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.08054v3",
    "url": "https://arxiv.org/abs/2601.08054v3",
    "pdf_url": "https://arxiv.org/pdf/2601.08054v3.pdf",
    "title": "Magnetic reconnection as an Adler-Ohmic bifurcation: The topological origin of Bohm resistivity",
    "abstract": "The physical origin of 'anomalous' resistivity in magnetic reconnection remains one of the longest-standing problems in space plasma physics. While the empirical Bohm diffusion scaling ($η\\propto T/B$) is widely invoked to explain fast reconnection rates, it lacks a rigorous derivation from first principles. Here, we derive this scaling by modeling the ensemble of electron gyro-axes in a magnetized plasma as an overdamped spintronic condensate governed by the Landau-Lifshitz-Gilbert equation. We demonstrate that the breakdown of the \"frozen-in\" condition is rigorously identified as an Adler-Ohmic bifurcation: a topological phase transition where electron gyro-axes lose synchronization with the mean magnetic field. Unlike stochastic turbulence models, this framework predicts a coherent, explosive onset of resistivity that naturally saturates at the Bohm limit. We support this thesis with renormalization group theory and a novel analysis of Magnetospheric Multiscale mission data, which reveals an explosive phase space confinement consistent with collective phase slippage rather than chaotic scattering. These results suggest that Bohm resistivity is a universal topological property of magnetized matter at the critical point of reconnection.",
    "authors": [
      "Magnus F Ivarsen"
    ],
    "published": "2026-01-12T22:48:40Z",
    "updated": "2026-01-26T16:48:20Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR",
      "cond-mat.soft",
      "cond-mat.stat-mech",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.18649v1",
    "url": "https://arxiv.org/abs/2601.18649v1",
    "pdf_url": "https://arxiv.org/pdf/2601.18649v1.pdf",
    "title": "Closure models for the feedback of energetic particles on plasma turbulence",
    "abstract": "Energetic particles interact with the plasma surrounding them, resonating with certain plasma waves to stabilize them while destabilizing others, and changing the character of the background turbulence in ways that have not been fully quantified or understood. Interaction with the turbulent background plasma is key to the acceleration of many types of energetic particles including high-energy cosmic rays, solar energetic particles, and pick-up ions. This is a process that would ideally be described by a kinetic model, a type of model that follows a probability distribution function (PDF) for all particles in 7-dimensional space. Because of the high dimensionality of a kinetic model, such simulations use the largest computational resources available, and are yet unable to simulate a realistic number of particles, reach the large scales necessary for astrophysical problems, or use high-precision numerical methods. Two available alternatives to kinetic plasma models have been explored: a multi-fluid model, and a hybrid fluid/Fokker-Planck model. These methods are hampered by the physical modeling of the coupling. We develop a new model, which follows the PDF for all particles; this can be viewed as a step toward physical realism above a multi-fluid MHD model, while also being more computationally efficient than a kinetic model. The equations we develop model both the background plasma and the energetic particles self-consistently. Over the last decade, similar PDF methods have been developed to a high level of sophistication to model reactive flows and turbulent combustion for engineering applications. For treatment of the feedback of the energetic particles on a background plasma, a PDF closure approach should evaluate the mean characteristics, including the density, with better statistical quality than will particle-sampling procedures.",
    "authors": [
      "J. Pratt"
    ],
    "published": "2026-01-26T16:20:21Z",
    "updated": "2026-01-26T16:20:21Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2601.18624v1",
    "url": "https://arxiv.org/abs/2601.18624v1",
    "pdf_url": "https://arxiv.org/pdf/2601.18624v1.pdf",
    "title": "Spin-redirection Berry phase with planar rays",
    "abstract": "Geometric or Berry phases are fundamental manifestations that appear in many areas of physics. They arise from the geometry of the space describing the properties of multi-component wave fields. An important example for electromagnetic waves is the spin-redirection Berry phase associated with the evolution of the spin direction. Because this effect has traditionally been studied in isotropic media where the spin is aligned with the ray trajectory, it has become commonly assumed that this spin-redirection Berry phase requires nonplanar rays. Here we show that a spin-redirection phase can in fact arise along a planar ray if the spin evolves along the ray. We expose this effect through the singular example of a moving unmagnetized plasma, and demonstrate how this behavior can more generally arise from a finite transverse spin. In identifying this new spin-redirection mechanism our work not only provides the tools to discover additional manifestations of SOIs in nature, but also uncovers supplemental degrees of freedom to harness SOIs to control light.",
    "authors": [
      "Aymeric Braud",
      "Renaud Gueroult"
    ],
    "published": "2026-01-26T16:01:21Z",
    "updated": "2026-01-26T16:01:21Z",
    "categories": [
      "physics.optics",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2407.12071v4",
    "url": "https://arxiv.org/abs/2407.12071v4",
    "pdf_url": "https://arxiv.org/pdf/2407.12071v4.pdf",
    "title": "Observation of quantum effects on radiation reaction in strong fields",
    "abstract": "Radiation reaction, the force experienced by an accelerated charge due to radiation emission, has long been the subject of extensive theoretical and experimental research. Experimental verification of a quantum, strong-field description of radiation reaction is fundamentally important, and has wide-ranging implications for astrophysics, laser-driven particle acceleration, next-generation particle colliders and inverse-Compton photon sources for medical and industrial applications. However, the difficulty of accessing regimes where strong field and quantum effects dominate inhibited previous efforts to observe quantum radiation reaction in charged particle dynamics with high significance. We report the first high significance (> 5σ) observation of strong-field radiation reaction on electron spectra where quantum effects are substantial. We obtain the first, quantitative, strong evidence favouring the quantum-continuous and quantum-stochastic models over the classical model; the quantum models perform comparably. The lower electron energy losses predicted by the quantum models accounts for their improved performance. Model comparison was performed using a novel Bayesian framework which has widespread utility for laser-particle collision experiments, including those utilising conventional accelerators, where some collision parameters cannot be measured directly.",
    "authors": [
      "Eva E. Los",
      "Elias Gerstmayr",
      "Christopher Arran",
      "Matthew J. V. Streeter",
      "Cary Colgan",
      "Claudia C. Cobo",
      "Brendan Kettle",
      "Thomas G. Blackburn",
      "Nicolas Bourgeois",
      "Luke Calvin",
      "Jason Cardarelli",
      "Niall Cavanagh",
      "Stephen J. D. Dann",
      "Antonino Di Piazza",
      "Rebecca Fitzgarrald",
      "Anton Ilderton",
      "Christoph H. Keitel",
      "Mattias Marklund",
      "Paul McKenna",
      "Christopher D. Murphy",
      "Zulfikar Najmudin",
      "Peter Parsons",
      "Paramel P. Rajeev",
      "Daniel R. Symes",
      "Matteo Tamburini",
      "Alexander G. R. Thomas",
      "Jonathan C. Wood",
      "Matthew Zepf",
      "Gianluca Sarri",
      "Christopher P. Ridgers",
      "Stuart P. D Mangles"
    ],
    "published": "2024-07-16T12:53:04Z",
    "updated": "2026-01-26T14:53:01Z",
    "categories": [
      "hep-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "hep-ph",
    "doi": "10.1038/s41467-025-67918-8"
  },
  {
    "arxiv_id": "2510.00273v3",
    "url": "https://arxiv.org/abs/2510.00273v3",
    "pdf_url": "https://arxiv.org/pdf/2510.00273v3.pdf",
    "title": "Physical Thickness Characterization of the FRIB Production Targets",
    "abstract": "The FRIB heavy-ion accelerator, commissioned in 2022, is a leading facility   for producing rare isotope beams (RIBs) and exploring nuclei beyond the limits of stability.   These RIBs are produced via reactions between stable primary beams and a graphite target.   Approximately 20-40 \\% of the primary beam power is deposited in the target,   requiring efficient thermal dissipation.   Currently, FRIB operates with a primary beam power of up to 20 kW. To enhance thermal dissipation efficiency,   a single-slice rotating graphite target with a diameter of approximately 30 cm is employed.   The effective target region is a 1 cm-wide outer rim of the graphite disc.   To achieve high RIB production rates, the areal thickness variation must be constrained within 2 \\%.   This paper presents physical thickness characterizations of FRIB production targets with various nominal thicknesses,   measured using a custom-built non-contact thickness measurement apparatus.",
    "authors": [
      "D. J. Lee",
      "M. Reaume",
      "W. Franklin",
      "J. Song"
    ],
    "published": "2025-09-30T20:52:04Z",
    "updated": "2026-01-26T13:58:59Z",
    "categories": [
      "physics.acc-ph",
      "nucl-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.18495v1",
    "url": "https://arxiv.org/abs/2601.18495v1",
    "pdf_url": "https://arxiv.org/pdf/2601.18495v1.pdf",
    "title": "Evidence of Langmuir/$\\mathcal{Z}$-mode Wave Decay into $\\mathcal{Z}$-mode Electromagnetic Radiation in the Solar Wind",
    "abstract": "The nonlinear decay of Langmuir/$\\mathcal{Z}$-mode waves into electromagnetic $\\mathcal{Z}$-mode wave radiation at the plasma frequency is observed for the first time in the solar wind. This finding was enabled by the unprecedented high-resolution electric and magnetic field measurements provided by the Radio Plasma Waves (RPW) instrument aboard the Solar Orbiter spacecraft, which encountered an electron beam associated with a Type III radio burst. The decay process is definitively identified through multiple lines of evidence: satisfaction of frequency and wavevector resonance conditions, strong phase coherence and temporal coincidence between the interacting waves, exclusion of competing mechanisms, and full agreement with theoretical predictions. Particle-in-cell simulations, conducted under close beam-plasma conditions, successfully reproduce the key features of the observations. Notably, they suggest that the wave packet observed by Solar Orbiter may be trapped within an extended, nearly flat-bottomed density well, where the decay process is not overcome by wave scattering on random density fluctuations and subsequent mode conversion effects.",
    "authors": [
      "F. J. Polanco-Rodríguez",
      "C. Krafft",
      "P. Savoini"
    ],
    "published": "2026-01-26T13:55:16Z",
    "updated": "2026-01-26T13:55:16Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.18470v1",
    "url": "https://arxiv.org/abs/2601.18470v1",
    "pdf_url": "https://arxiv.org/pdf/2601.18470v1.pdf",
    "title": "Design and modeling of a liquid-lead dump concept for beamstrahlung radiation absorption in the CERN Future Circular e$^+$e$^-$ Collider",
    "abstract": "The electron-positron Future Circular Collider (FCC-ee) being developed at CERN will generate intense beamstrahlung radiation, thus requiring photon absorbers downstream of the interaction points. This work presents the conceptual design of flowing-liquid-lead absorbers capable of dissipating around 370 kW of photon power, with a mean photon energy of 62 MeV. Two configurations are investigated: an inclined-flow geometry, developed to increase the photon interaction length to maximize absorption, and a compact upstream slope with an additional pool, in which a free-surface lead flow intercepts the power peak before a downstream pool dissipates the remaining load. Photon-matter interactions are modeled using Monte Carlo simulations in fluka, while conjugate heat-transfer and free-surface dynamics are analyzed through computational-fluid-dynamics simulations using ansys fluent. Design refinements are introduced based on the simulated thermal and hydraulic performance and to mitigate secondary effects such as photon backscattering. Both configurations demonstrate stable operation within the 300 kg/s flow limit and maintain liquid-lead and structural temperatures within the operational range of 450--500 $^{\\circ}$C. The results establish circulating liquid lead as a feasible and thermally robust baseline technology for beamstrahlung absorption in FCC-ee.",
    "authors": [
      "Silvio Candido",
      "Rui Franqueira Ximenes",
      "Anton Lechner",
      "Alessandro Frasca",
      "Giuseppe Lerner",
      "Antonio Perillo Marcone",
      "Regis Seidenbinder",
      "Markus Widorski",
      "Louise Jorat",
      "Giacomo Lavezzari",
      "Davide Bozzato",
      "Gabriel Banks",
      "Marco Calviani",
      "Luca Tricarico",
      "Carlo Carrelli",
      "Mariano Tarantino"
    ],
    "published": "2026-01-26T13:19:01Z",
    "updated": "2026-01-26T13:19:01Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.05274v2",
    "url": "https://arxiv.org/abs/2510.05274v2",
    "pdf_url": "https://arxiv.org/pdf/2510.05274v2.pdf",
    "title": "A note on thermal effects in non-linear models for plasma-based acceleration",
    "abstract": "We investigate the impact of a non-negligible background temperature on relativistic plasma wake-fields generated when a beam of charged particles passes through a neutral plasma at rest. We focus on the blowout regime, wherein the plasma response is highly non-linear: plasma electrons are radially blown out and expelled away from the propagation axis of the beam particles, creating a region (bubble) of ions without electrons. Our study builds upon earlier investigations for non-linear models of plasma wakefields developed in the limit of zero background temperature (Lu et al., Phys. Rev. Lett. 96, 165002 (2006)). In the presence of a non-zero background temperature, we characterize the model and focus on its predictions for the bubble size and the electromagnetic fields inside the bubble. Model predictions are studied in combination with PIC simulations.",
    "authors": [
      "D. Simeoni",
      "G. Parise",
      "A. R. Rossi",
      "A. Frazzitta",
      "F. Guglietta",
      "M. Sbragaglia"
    ],
    "published": "2025-10-06T18:42:15Z",
    "updated": "2026-01-26T12:53:51Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.03417v3",
    "url": "https://arxiv.org/abs/2511.03417v3",
    "pdf_url": "https://arxiv.org/pdf/2511.03417v3.pdf",
    "title": "Design and development of optical modules for the BUTTON-30 detector",
    "abstract": "BUTTON-30 is a neutrino detector demonstrator located in the STFC Boulby underground facility in the north-east of England. The main goal of the project is to deploy and test the performance of the gadolinium-loaded water-based liquid scintillator for neutrino detection in an underground environment. This will pave the way for a future large-volume neutrino observatory that can also perform remote monitoring of nuclear reactors for nonproliferation. This paper describes the design and construction of the watertight optical modules of the experiment.",
    "authors": [
      "D. S. Bhattacharya",
      "J. Bae",
      "M. Bergevin",
      "J. Boissevain",
      "S. Boyd",
      "K. Bridges",
      "L. Capponi",
      "J. Coleman",
      "D. Costanzo",
      "T. Cunniffe",
      "S. A. Dazeley",
      "M. V. Diwan",
      "S. R. Durham",
      "E. Ellingwood",
      "A. Enqvist",
      "T. Gamble",
      "S. Gokhale",
      "J. Gooding",
      "C. Graham",
      "E. Gunger",
      "W. Hopkins",
      "I. Jovanovic",
      "T. Kaptanoglu",
      "E. Kneale",
      "L. Lebanowski",
      "K. Lester",
      "V. A. Li",
      "M. Malek",
      "C. Mauger",
      "N. McCauley",
      "C. Metelko",
      "R. Mills",
      "A. Morgan",
      "F. Muheim",
      "A. Murphy",
      "M. Needham",
      "K. Ogren",
      "G. D. Orebi Gann",
      "K. Y. Oyulmaz",
      "S. M. Paling",
      "A. F. Papatyi",
      "G. Pinkney",
      "J. Puputti",
      "S. Quillin",
      "B. Richards",
      "R. Rosero",
      "A. Scarff",
      "Y. Schnellbach",
      "P. R. Scovell",
      "B. Seitz",
      "L. Sexton",
      "O. Shea",
      "G. D. Smith",
      "R. Svoboda",
      "D. Swinnock",
      "A. Tarrant",
      "F. Thomson",
      "J. N. Tinsley",
      "C. Toth",
      "A. Usón",
      "M. Vagins",
      "J. Webster",
      "S. Woodford",
      "G. Yang",
      "M. Yeh",
      "E. Zhemchugov"
    ],
    "published": "2025-11-05T12:30:40Z",
    "updated": "2026-01-26T12:14:55Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.18338v1",
    "url": "https://arxiv.org/abs/2601.18338v1",
    "pdf_url": "https://arxiv.org/pdf/2601.18338v1.pdf",
    "title": "Precision Light Yield and Crosstalk Characterization for the SuperFGD scintillator cubes",
    "abstract": "A detailed study of a $5\\times5\\times5$ cube prototype of the SuperFGD detector was performed using a 730 MeV/$c$ pion beam at the SC-1000 synchrocyclotron (PNPI, Gatchina, Russia). The detector, based on plastic scintillation cubes with orthogonal wavelength-shifting (WLS) fiber readout and silicon photomultipliers (SiPMs), was tested to evaluate its performance in terms of light yield, spatial uniformity, and optical crosstalk. Using high-resolution tracking, the spatial distribution of light yield was mapped with a granularity of 0.5 mm. An average light response map was obtained by combining data from 27 cubes. Optical crosstalk between adjacent cubes was also measured and characterized in four directions (left, right, up, down). Position-dependent crosstalk values ranged from 2% to 6%, with the highest levels observed near cube interfaces. These results confirm the excellent performance and scalability of the SuperFGD design, and provide valuable input for simulation tuning and reconstruction algorithms in the ND280 upgrade of the T2K experiment. The obtained result on the response uniformity and crosstalk are reasonably well described by simple MC model of the setup.",
    "authors": [
      "I. Alekseev",
      "A. Chvirova",
      "M. Danilov",
      "S. Fedotov",
      "A. Khotjantsev",
      "M. Kolupanova",
      "N. Kozlenko",
      "A. Krapiva",
      "Y. Kudenko",
      "A. Mefodiev",
      "O. Mineev",
      "D. Novinsky",
      "E. Samigullin",
      "N. Skrobova",
      "D. Svirida"
    ],
    "published": "2026-01-26T10:27:19Z",
    "updated": "2026-01-26T10:27:19Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.18293v1",
    "url": "https://arxiv.org/abs/2601.18293v1",
    "pdf_url": "https://arxiv.org/pdf/2601.18293v1.pdf",
    "title": "Non-Destructive Beam Monitoring via Secondary Radiation Detection with Ce-Doped Silica Fibers",
    "abstract": "Non-destructive beam diagnostics are essential for low-energy medical cyclotrons, where even thin interceptive devices can severely degrade beam quality. We investigate an external fiber monitor (EFM) based on Ce-doped silica scintillating fibers that detects secondary radiation generated at existing beamline components of the 18 MeV Bern Medical Cyclotron beam transfer line (BTL). Three use cases were studied: (i) beam intensity monitoring around an electrically isolated, water-cooled beam dump; (ii) beam-loss monitoring around a 10 mm collimator under varying the beam focusing; and (iii) by steering a 6.5 mm $\\times$ 6.5 mm beam spot on a beam dump. For case (i), the summed EFM signal exhibits a linear dependence on the current on target over nearly three orders of magnitude. In case (ii), a normalized EFM-based beam-loss proxy scales monotonically with an electrical loss proxy across several focusing settings. Furthermore, opposing-fiber signal ratios provide decoupled, monotonic sensitivity to horizontal and vertical beam displacements.",
    "authors": [
      "Alexander Gottstein",
      "Pierluigi Casolaro",
      "Gaia Dellepiane",
      "Lars Eggimann",
      "Eva Kasanda",
      "Isidre Mateu",
      "Samuel Usherovich",
      "Paola Scampoli",
      "Cornelia Hoehr",
      "Saverio Braccini"
    ],
    "published": "2026-01-26T09:21:52Z",
    "updated": "2026-01-26T09:21:52Z",
    "categories": [
      "physics.ins-det",
      "physics.acc-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.18384v4",
    "url": "https://arxiv.org/abs/2510.18384v4",
    "pdf_url": "https://arxiv.org/pdf/2510.18384v4.pdf",
    "title": "Diagnostics of a Multicusp-Assisted Inductively-Coupled Radio-Frequency Plasma Source for Plasma Immersion Ion Implantation",
    "abstract": "In this article, we present a detailed characterisation of a multicusp-assisted inductively coupled RF plasma source for plasma immersion ion implantation (PIII). Using laser-induced fluorescence (LIF) and RF-compensated Langmuir probe diagnostics, we measured ion temperature T i and drift velocity v z in argon plasmas near an immersed electrode. The multicusp configuration enhances plasma density at low pressure, enabling stable operation down to 0.8 mTorr. Timeaveraged measurements show no detectable perturbation near the pulsed electrode, indicating full plasma recovery between high-voltage pulses. LIF-derived potential profiles match Riemann's presheath theory, and ion velocity distributions reveal acceleration consistent with sheath dynamics. These results support the use of LIF for steady-state characterisation of the bulk and presheath regions in PIII systems.",
    "authors": [
      "Moreno Joel",
      "Jimenez Marilyn",
      "Okerstrom Daniel",
      "Bradley Michael P.",
      "Couëdel Lénaïc"
    ],
    "published": "2025-10-21T08:03:30Z",
    "updated": "2026-01-26T08:08:13Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.11603v3",
    "url": "https://arxiv.org/abs/2601.11603v3",
    "pdf_url": "https://arxiv.org/pdf/2601.11603v3.pdf",
    "title": "The use of spectral indices in environmental monitoring of smouldering coal-waste dumps",
    "abstract": "The study aimed to evaluate the applicability of environmental indices in the monitoring of smouldering coal-waste dumps. A dump located in the Upper Silesian Coal Basin served as the research site for a multi-method analysis combining remote sensing and field-based data. Two UAV survey campaigns were conducted, capturing RGB, infrared, and multispectral imagery. These were supplemented with direct ground measurements of subsurface temperature and detailed vegetation mapping. Additionally, publicly available satellite data from the Landsat and Sentinel missions were analysed. A range of vegetation and fire-related indices (NDVI, SAVI, EVI, BAI, among others) were calculated to identify thermally active zones and assess vegetation conditions within these degraded areas. The results revealed strong seasonal variability in vegetation indices on thermally active sites, with evidence of disrupted vegetation cycles, including winter greening in moderately heated root zones - a pattern indicative of stress and degradation processes. While satellite data proved useful in reconstructing the fire history of the dump, their spatial resolution was insufficient for detailed monitoring of small-scale thermal anomalies. The study highlights the diagnostic potential of UAV-based remote sensing in post-industrial environments undergoing land degradation but emphasises the importance of field validation for accurate environmental assessment.",
    "authors": [
      "Anna Abramowicz",
      "Michal Laska",
      "Adam Nadudvari",
      "Oimahmad Rahmonov"
    ],
    "published": "2026-01-08T16:44:21Z",
    "updated": "2026-01-26T08:03:24Z",
    "categories": [
      "physics.geo-ph",
      "physics.ins-det",
      "stat.AP"
    ],
    "primary_category": "physics.geo-ph",
    "doi": "10.1016/j.rsase.2025.101865"
  },
  {
    "arxiv_id": "2601.18131v1",
    "url": "https://arxiv.org/abs/2601.18131v1",
    "pdf_url": "https://arxiv.org/pdf/2601.18131v1.pdf",
    "title": "Sub-ion scale current sheets in kinetic Alfvén wave turbulence",
    "abstract": "3D kinetic particle-in-cell (PIC) simulations are performed using the kinetic Alfvén wave (KAW) eigenvector relations from a two-fluid model as initial conditions, in order to study turbulent fluctuations and intermittent structures at sub-ion and electron scales. Simulations with different ion-to-electron mass ratios are set up to investigate the role of electron scales in the formation of intermittent structures. We analyze the current sheet structures that develop in these simulations. Two algorithms, namely Breadth-First Search (BFS) and Density-Based Spatial Clustering of Applications with Noise (DBSCAN), are employed to determine the thickness, length, and width of the current sheets, and both methods are found to yield consistent results. The average current sheet thickness scales inversely with the square root of the ion-to-electron mass ratio, with values close to the electron skin depth ($d_e$), indicating the presence of electron-scale current sheets in the simulations. The widths and lengths of the current sheets show a weaker scaling with the mass ratio. The scale-dependent kurtosis reveals enhanced intermittency at electron scales, consistent with magnetosheath observations. Distributions of scale-dependent properties of the current sheets also align with the electron skin depth of the different simulations and they lie within ranges observed in kinetic scale solar wind turbulence. This study reveals the nature of sub-ion-scale current sheets in KAW turbulence and their role in dissipation.",
    "authors": [
      "Johan Sharma",
      "Ch Akshath Kumar",
      "Kirit D. Makwana",
      "Tulasi N Parashar",
      "Sruti Satyasmita"
    ],
    "published": "2026-01-26T04:26:02Z",
    "updated": "2026-01-26T04:26:02Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR",
      "physics.comp-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.18114v1",
    "url": "https://arxiv.org/abs/2601.18114v1",
    "pdf_url": "https://arxiv.org/pdf/2601.18114v1.pdf",
    "title": "Mitigating Deadtime in Distributed Optical Arrays: A Liveness-Aware Trigger Approach for High-Energy Neutrino Detection",
    "abstract": "Large-scale neutrino observatories operate under unavoidable detector deadtime arising from photomultiplier saturation, digitizer limits, and front-end readout constraints. Conventional coincidence-based trigger logic implicitly assumes continuous sensor availability and therefore suffers systematic efficiency loss when channels become temporarily non-live. This work presents the design of a liveness-aware trigger architecture targeting low-latency FPGA deployment in distributed optical arrays. We introduce a recursive Infinite Impulse Response (IIR) update law implemented as a fully synthesizable pipeline that constructs a continuity-preserving effective observable at each sensor node. Rather than collapsing during non-liveness intervals, the observable decays smoothly while retaining phase and amplitude information relevant for network-level coherence estimation. By explicitly separating continuous measurement construction from discrete trigger decision logic, the proposed architecture enables graceful degradation under partial channel non-liveness. Performance is evaluated using a hybrid validation framework that combines representative event topologies derived from IceCube Open Data with a hardware-accurate signal and noise model spanning a wide dynamic range. Simulation results demonstrate that the proposed trigger sustains high event recovery efficiency in regimes of elevated deadtime probability, where conventional coincidence logic degrades substantially. Furthermore, the continuity-preserving observable yields up to a two-order-of-magnitude improvement in effective signal-to-noise ratio, enabling robust detection under strong saturation and non-ideal operating conditions. This method provides a robust foundation for next-generation firmware-level trigger strategies in large-scale, noise-dominated detector systems.",
    "authors": [
      "Thammarat Yawisit",
      "Pittaya Pannil"
    ],
    "published": "2026-01-26T04:00:36Z",
    "updated": "2026-01-26T04:00:36Z",
    "categories": [
      "physics.ins-det",
      "physics.comp-ph",
      "physics.data-an"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.14400v5",
    "url": "https://arxiv.org/abs/2509.14400v5",
    "pdf_url": "https://arxiv.org/pdf/2509.14400v5.pdf",
    "title": "Electron Inertia and Magnetic Reconnection",
    "abstract": "When electron inertia is the only non-ideal effect in the evolution of a magnetic field $\\vec{B}$, the field lines of $\\vec{B}$ reconnect, but the lines of a related field $\\vec{\\mathcal{B}}$ do not. $\\vec{\\mathcal{B}} \\equiv \\vec{B} + \\vec{\\nabla}\\times \\left( (c/ω_{pe})^2μ_0\\vec{j} \\right)$ with $ω_{pe}$ the plasma frequency and $\\vec{j}$ the current density. Although a full four-dimensional relativistic calculation of $\\vec{\\mathcal{B}}$ has been made, studies of $\\vec{\\mathcal{B}}$ have been focused on systems that depend on only two spatial coordinates. Three results are given: (1) A relatively simple demonstration in three dimensional space that the lines of $\\vec{\\mathcal{B}}$ do not reconnect when electron inertia is the only non-ideal effect. (2) The guiding center motion of charged particles is modified by a term that is proportional to $(c/ω_{pe})^2$, which is smaller than the drifts proportional to the gyroradius unless the current density is extremely large. (3) In three dimensional space, the evolution velocity of $\\vec{\\mathcal{B}}$ is characteristically chaotic, which means neighboring streamlines separate exponentially on a timescale $τ_u$. $\\vec{\\mathcal{B}}$ undergoes large scale reconnection on a timescale that is only an order of magnitude or two longer than $τ_u$ unless all diffusive non-ideal effects, such as resistivity, are absolutely zero.",
    "authors": [
      "Allen H Boozer"
    ],
    "published": "2025-09-17T20:02:37Z",
    "updated": "2026-01-26T02:10:58Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.18054v1",
    "url": "https://arxiv.org/abs/2601.18054v1",
    "pdf_url": "https://arxiv.org/pdf/2601.18054v1.pdf",
    "title": "Design of a Miniature Kibble Balance for Kilogram-Scale Mass Calibration -- KBmini",
    "abstract": "Tabletop version Kibble balances are a significant developing trend for mass realizations following the revised International System of Units. A key innovation through the miniaturization of the Kibble balance from a large-scale instrument into a tabletop device is making the quantum-based realization of mass accessible to a wider range of calibration laboratories and industries. This paper presents a tabletop Kibble balance design at Tsinghua University targeting E2-accuracy class mass calibrations from 1 g to 1 kg. For calibrating a mass of 1 kg, for instance, the required relative standard measurement uncertainty must be below 0.27 ppm to meet E2-accuracy class. Major components and features of the proposed system are discussed. A novel method of multi-harmonic excitation is proposed to improve the coil-motion linearity during velocity measurement. We show that injecting odd-order harmonics into the motion-driving current can significantly improve the uniformity of the coil's moving velocity, while the second-order component can address the asymmetry between upward and downward movements. This achieves a flat velocity $Δv/v< 5\\%$ over 60% of the motion cycle.",
    "authors": [
      "Shisong Li",
      "Nanjia Li",
      "Weibo Liu",
      "Elsayed E. E. Qupasie",
      "Wei Zhao",
      "Songling Huang"
    ],
    "published": "2026-01-26T01:00:03Z",
    "updated": "2026-01-26T01:00:03Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.17955v1",
    "url": "https://arxiv.org/abs/2601.17955v1",
    "pdf_url": "https://arxiv.org/pdf/2601.17955v1.pdf",
    "title": "Spectral Evolution and Current Sheet Analysis as Probes of Reconnection-Mediated Decay in Magnetically Dominated Turbulence",
    "abstract": "The decay of magnetically dominated turbulence exhibits robust inverse transfer of magnetic energy even in the absence of net magnetic helicity, challenging traditional cascade-based phenomenology. While recent studies suggest that magnetic reconnection governs the evolution of such systems, a comprehensive understanding has been lacking. Here we test a reconnection-mediated model for decaying magnetic turbulence in two-dimensional (strict-2D), 2.5D, and three-dimensional (3D) systems with both helical and nonhelical initial conditions. We show that the magnetic-energy decay timescale scales with the Lundquist number in a manner consistent with Sweet-Parker-type reconnection rather than Alfvenic or purely resistive timescales. We develop a broken power-law model for the magnetic energy spectra and provide analytic predictions for the temporal evolution of energy across both sub-inertial and inertial ranges, which are confirmed by high-resolution simulations. In nonhelical turbulence, these results favor anastrophy as the dominant constraint over helicity fluctuations. Using Minkowski functionals to analyze reconnecting current sheets in real space, we find that the structures controlling the decay are substantially smaller than the global magnetic correlation scale, implying local Lundquist numbers well below the system-scale value. This explains the weak sensitivity of global decay laws to current-sheet resolution and that the current-sheet aspect ratios converge toward Sweet-Parker predictions only at sufficiently high resolution. Together, these results establish magnetic reconnection as the organizing principle underlying inverse transfer, spectral evolution, and decay in magnetically dominated turbulence, providing a unified picture applicable across dimensionality and helicity regimes with direct implications for astrophysical plasmas.",
    "authors": [
      "Chandranathan Anandavijayan",
      "Pallavi Bhat"
    ],
    "published": "2026-01-25T19:09:28Z",
    "updated": "2026-01-25T19:09:28Z",
    "categories": [
      "astro-ph.HE",
      "physics.flu-dyn",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2510.13946v3",
    "url": "https://arxiv.org/abs/2510.13946v3",
    "pdf_url": "https://arxiv.org/pdf/2510.13946v3.pdf",
    "title": "Bell Instability and Cosmic-Ray Acceleration in Active Galactic Nuclei Ultrafast Outflow Shocks",
    "abstract": "We investigate magnetic-field amplification driven by the nonresonant hybrid (NRH or Bell) instability and its impact on cosmic-ray (CR) acceleration at reverse shocks of ultrafast outflows (UFOs) from active galactic nuclei (AGN). Previous kinetic studies by particle-in-cell simulations have demonstrated that when maximum CR energy is near the injection scale, NRH instability efficiently amplifies magnetic field up to the saturation level. However, the efficiency of NRH instability goes down as maximum energy increase since CR current is carried by escaping CRs near the maximum energy. We employ a one-dimensional MHD--CR framework solving telegraph-type diffusion--convection equations to trace the coupled evolution of CRs, magnetic fields, and shock dynamics under realistic parameters. We find a distinct transition with magnetic field strength: for weak background fields ($B_{0}\\!\\lesssim\\!10^{-4}\\,\\mathrm{G}$), NRH instability efficiently amplifies upstream turbulence, driving a self-regulated state where $E_{\\max}$ becomes independent of initial strength of magnetic turbulence. In contrast, for stronger background fields ($B_{0}\\!\\gtrsim\\!10^{-3}\\,\\mathrm{G}$), the escaping CR current is too weak to drive NRH instability, and magnetic turbulence further decays through parametric instabilities, potentially reducing the acceleration efficiency. We give the physical interpretation for the transition and discuss conditions for PeV--EeV acceleration at UFO reverse shocks.",
    "authors": [
      "Rei Nishiura",
      "Tsuyoshi Inoue"
    ],
    "published": "2025-10-15T18:00:00Z",
    "updated": "2026-01-25T18:15:18Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2601.17841v1",
    "url": "https://arxiv.org/abs/2601.17841v1",
    "pdf_url": "https://arxiv.org/pdf/2601.17841v1.pdf",
    "title": "Smooth Polar B-Splines with High-Order Regularity at the Origin",
    "abstract": "We introduce a smooth B-spline discretization in polar coordinates on the unit disc that corrects the loss of regularity present at the origin caused by the coordinate singularity in standard tensor-product B-spline formulations. The method constructs \"smooth polar splines\" via a Galerkin projection of harmonic polar functions $S_l^{-m}(r,θ) := r^l \\sin(mθ)$ and $S_l^{m}(r,θ) := r^l \\cos(mθ)$, derived from the polar representation of Cartesian monomials, onto the central tensor-product B-spline basis in the innermost radial region. The radial component reproduces $r^l$ exactly for $0 \\le l \\leq p$, where $p$ is the B-spline degree, satisfying the near-origin regularity condition. However, exact compatibility with $C^\\infty$-regularity at the origin is recovered only in the limit $Δθ\\to 0$, when the angular component resolves all angular harmonics accurately. The smooth polar splines are linear combinations of standard tensor-product B-splines and lie in the same function space, enabling mapping between the $C^\\infty$-regular subspace and the original discretization space via an exact prolongation operator and a corresponding restriction operator acting on the discrete variables. They match standard tensor-product B-splines away from the origin, preserve orthogonality among the newly constructed origin-centered basis functions, and maintain local support and sparse matrices. This smoothness and locality improve the conditioning of mass and stiffness matrices, conserve charge, and reduce statistical errors in particle-in-cell simulations near the origin, while eliminating spurious eigenvalues in eigenvalue problems. The approach provides a robust, high-order, and efficient adaptation of tensor-product B-splines for polar coordinates in physics simulations.",
    "authors": [
      "Peiyou Jiang",
      "Roman Hatzky",
      "Zhixin Lu",
      "Eric Sonnendrücker",
      "Matthias Borchardt",
      "Ralf Kleiber",
      "Martin Campos Pinto",
      "Ronald Remmerswaal"
    ],
    "published": "2026-01-25T13:46:16Z",
    "updated": "2026-01-25T13:46:16Z",
    "categories": [
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.comp-ph"
  },
  {
    "arxiv_id": "2601.17554v1",
    "url": "https://arxiv.org/abs/2601.17554v1",
    "pdf_url": "https://arxiv.org/pdf/2601.17554v1.pdf",
    "title": "Full event interpretation with machine-learning-based particle-flow reconstruction in the CMS detector",
    "abstract": "The particle-flow (PF) algorithm constructs a global description of each particle collision by producing a comprehensive list of final-state particles, and is central to event reconstruction in the CMS experiment at the CERN LHC. The existing PF implementation relies on physics-motivated heuristics and assumptions that can be replaced by machine-learning (ML) models trained directly on simulated data and naturally suited to modern graphics processing units (GPUs). A state-of-the-art ML-based PF (MLPF) reconstruction algorithm, implemented within the CMS software framework, is presented. The MLPF algorithm performs a learnable full-event reconstruction on GPUs, generalizes across detector conditions and collision energies, and replaces multiple modular reconstruction steps with a single unified model. Physics performance comparable to standard PF reconstruction is achieved in both simulation and data, with improved jet energy resolution and inference time. In simulated top quark-antiquark events under LHC Run-3 (2023$-$2024) conditions, the jet energy resolution improves by 10$-$20% for jets with transverse momentum between 30$-$100 GeV. Inference time is evaluated using simulated multijet events, with a median of 20 ms per event on an Nvidia L4 GPU, compared to approximately 110 ms for the standard CMS PF reconstruction.",
    "authors": [
      "CMS Collaboration"
    ],
    "published": "2026-01-24T18:49:22Z",
    "updated": "2026-01-24T18:49:22Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.17547v1",
    "url": "https://arxiv.org/abs/2601.17547v1",
    "pdf_url": "https://arxiv.org/pdf/2601.17547v1.pdf",
    "title": "Plasma Decay of Nanosecond Pulsed Laser-Produced Ar and Ar-H2O Sparks at Atmospheric Pressure",
    "abstract": "Time-resolved diagnostics were applied to investigate free-electron properties in nanosecond laser-produced discharges sustained at atmospheric pressure in Ar and in Ar with 3% H2O. The discharges were generated using 23 ns, 1064 nm laser pulses. Broadband plasma imaging and laser Thomson scattering were combined with optical emission spectroscopy, with particular emphasis on Stark broadening of the Halpha and Hbeta lines. The plasma exhibited a bright emission that persisted for up to 30--40 us after breakdown, followed by a very weak glow lasting up to 19 ms. Peak electron number density of about 2 x 10^17 cm-3 and electron temperature of about 7 eV were measured. Excellent agreement between both techniques was obtained for absolute electron number densities. The inferred temporal decay of free electrons is consistent with processes dominated by ambipolar expansion and two- and three-body electron-ion recombination. These results provide benchmark data for modeling nanosecond laser discharges and demonstrate the reliability of combining Thomson scattering with Stark broadening in atmospheric laser sparks.",
    "authors": [
      "Ji Yung Ahn",
      "Jianan Wang",
      "Tasnim Akbar Faruquee",
      "Marien Simeni Simeni"
    ],
    "published": "2026-01-24T18:34:57Z",
    "updated": "2026-01-24T18:34:57Z",
    "categories": [
      "physics.plasm-ph",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.17463v1",
    "url": "https://arxiv.org/abs/2601.17463v1",
    "pdf_url": "https://arxiv.org/pdf/2601.17463v1.pdf",
    "title": "Polyurethane-Based Scintillators for Neutron and Gamma Radiation Detection in Medical and Industrial Applications",
    "abstract": "Organic scintillators using a solid polyurethane (PU) matrix have been introduced to combine the robustness of a construction material with scintillating properties that allow gamma rays and fast neutrons to be detected efficiently and at low cost. This work compares two corresponding materials, the older M600 and the more recent M700, with EJ-276D and EJ-200 representing common plastic scintillators with and without pulse-shape discrimination (PSD) capabilities, respectively. Characterization measurements were performed with small samples of 26 mm diameter and 10 mm height, which were coupled to a photomultiplier tube (PMT) and simultaneously exposed to 252Cf fission neutrons and 137Cs gamma rays. M700 turned out to provide the best PSD performance and about the same light yield as EJ-276D, while its light pulses exhibit a shorter pulse decay. An accelerated ageing process applied in between two test campaigns was too short to trigger distinct performance degradation in any of the materials, though optical degradation was visible in EJ-276D and in EJ-200 but not in the PU-based materials. Nevertheless, the extremely robust polyurethane matrix promises advantages in medical and industrial applications where resilience and long-term stability are of crucial importance.",
    "authors": [
      "Olga Maiatska",
      "Torsten Dünnebacke",
      "Martin Kreuels",
      "Guntram Pausch",
      "Falko Scherwinski",
      "Jürgen R. Stein"
    ],
    "published": "2026-01-24T13:27:53Z",
    "updated": "2026-01-24T13:27:53Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex",
      "physics.app-ph",
      "physics.med-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.08532v2",
    "url": "https://arxiv.org/abs/2601.08532v2",
    "pdf_url": "https://arxiv.org/pdf/2601.08532v2.pdf",
    "title": "Enhanced Athermal Phonon Responsivity in a Kinetic Inductance Detector with Integrated Phonon Collectors",
    "abstract": "Cryogenic phonon detectors are adopted in light dark matter searches and coherent elastic neutrino-nucleus scattering experiments as they can achieve low energy thresholds. The phonon mediated sensing of silicon particle absorbers has already been proved with Kinetic Inductance Detectors (KIDs), acting both as sensors and athermal phonon absorbers at the same time. In this work we present the design and the performance of an improved detector, where the KID acts only as sensor and is coupled to dedicated phonon collectors. The separation between the detector and the collectors increases the variation of the quasi-particle density within the device, thereby enhancing its responsivity. The meander of the KID is composed of a 77nm trilayer wire of Aluminum-Titanium-Aluminum, while the phonon collectors are made of a 100nm Aluminum layer and act as quasi-particles funnels. Inside the collectors, the absorbed athermal phonons generate quasi-particles which, after diffusion, are trapped in the lower-gap superconducting trilayer. The performance of this setup is compared to that of a standard phonon-mediated KID, showing an increase in responsivity by around a factor of five.",
    "authors": [
      "Leonardo Pesce",
      "Alessio Ludovico De Santis",
      "Martino Calvo",
      "Matteo Cappelli",
      "Usasi Chowdhury",
      "Angelo Cruciani",
      "Giorgio Del Castello",
      "Daniele Delicato",
      "Matteo Folcarelli",
      "Matteo del Gallo Roccagiovine",
      "Alessandro Monfardini",
      "Davide Quaranta",
      "Marco Vignati"
    ],
    "published": "2026-01-13T13:17:19Z",
    "updated": "2026-01-24T10:14:51Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.17308v1",
    "url": "https://arxiv.org/abs/2601.17308v1",
    "pdf_url": "https://arxiv.org/pdf/2601.17308v1.pdf",
    "title": "Hybrid collisional-radiative modeling for high-fidelity atomic kinetics",
    "abstract": "The fidelity of collisional-radiative (CR) models is critical for advancing our understanding of radiative properties and ionization balance in fusion plasmas. In this work, we present and evaluate hybrid CR schemes that combine fine-structure resolution with superconfiguration averaging, offering a practical compromise between accuracy and computational efficiency. Two hybrid CR models are developed for helium, lithium, and beryllium, retaining detailed fine-structure states up to selected principal quantum numbers, while higher-lying states are statistically averaged to form superconfigurations. These models are applied to compute radiative power loss, as well as average and effective charge states, across a wide range of electron temperatures and densities. The results are benchmarked against a fully fine-structure-resolved CR model to assess the accuracy of the hybrid approach. The findings demonstrate the versatility of hybrid CR schemes and their suitability for detailed plasma simulations where predictive fidelity must be balanced with computational cost.",
    "authors": [
      "Prashant Sharma",
      "Christopher J. Fontes",
      "Mark Zammit",
      "James Colgan",
      "Nathan Garland",
      "Xian-Zhu Tang"
    ],
    "published": "2026-01-24T05:08:19Z",
    "updated": "2026-01-24T05:08:19Z",
    "categories": [
      "physics.plasm-ph",
      "physics.atom-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.11989v2",
    "url": "https://arxiv.org/abs/2601.11989v2",
    "pdf_url": "https://arxiv.org/pdf/2601.11989v2.pdf",
    "title": "Topological aspects of zero modes in cavity resonators",
    "abstract": "We discuss the relationship between the zero modes of electromagnetic fields in a cavity resonator and the cavity's topological characteristics. We show that the dimension of the electromagnetic zero-mode space coincides with the dimension of the corresponding homology group of the cavity. Moreover, we prove that the alternating sum of the dimensions of the electromagnetic zero-mode spaces is closely related to the Euler characteristic of the cavity boundary, and hence to the integral of the curvature.",
    "authors": [
      "Osamu Kamigaito"
    ],
    "published": "2026-01-17T09:46:16Z",
    "updated": "2026-01-23T23:30:26Z",
    "categories": [
      "physics.acc-ph",
      "physics.class-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.17220v1",
    "url": "https://arxiv.org/abs/2601.17220v1",
    "pdf_url": "https://arxiv.org/pdf/2601.17220v1.pdf",
    "title": "Evaluation of the beam-induced depolarization of the HJET target at the EIC",
    "abstract": "The Polarized Atomic Hydrogen Gas Jet Target (HJET) has played a central role in the absolute calibration of proton beam polarization at RHIC and is foreseen as a key element of the hadron polarimetry program at the future Electron--Ion Collider (EIC). The substantially higher beam current, reduced bunch spacing, and shorter bunch length planned for EIC operation motivate a careful reassessment of possible beam-induced depolarization of the jet target. In this paper, the depolarization of ground-state hydrogen atoms caused by the time-dependent magnetic field of the circulating polarized proton beam is quantitatively evaluated. The hydrogen atom is treated as a four-level hyperfine system in a holding magnetic field, and transitions driven by harmonic components of the bunch-induced magnetic field are analyzed using time-dependent quantum-mechanical evolution along atomic trajectories. Numerical tracking of hydrogen atoms through the beam region is performed using nominal EIC beam parameters. It is shown that, for a holding field of $120\\,\\mathrm{mT}$ (as used at RHIC), the resulting depolarization of the jet target at the EIC is negligibly small, $\\lesssim 0.01\\%$, and well below the level relevant for EIC polarization accuracy requirements. The stability of this result with respect to plausible variations of the EIC proton beam parameters is also evaluated.",
    "authors": [
      "A. A. Poblaguev"
    ],
    "published": "2026-01-23T23:08:45Z",
    "updated": "2026-01-23T23:08:45Z",
    "categories": [
      "physics.ins-det",
      "physics.acc-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.17186v1",
    "url": "https://arxiv.org/abs/2601.17186v1",
    "pdf_url": "https://arxiv.org/pdf/2601.17186v1.pdf",
    "title": "Two-Stage Gamma-Neutron Source Classification in Water Cherenkov Detectors: Energy Threshold Screening and Machine Learning Pulse Analysis",
    "abstract": "Water Cherenkov detectors offer a robust and economical solution for real-time radiation monitoring by detecting Cherenkov light from charged particles moving faster than light in water. This work presents a novel two-stage classification framework for gamma-neutron discrimination: an initial physics-based energy threshold filters unambiguous low-energy gamma sources, followed by a machine learning ensemble that resolves ambiguities at higher energies. The detector response was characterized using $^{60}$Co (1.17/1.33~MeV), $^{137}$Cs (0.66~MeV), and a shielded $^{241}$AmBe source, with lead, paraffin, and cadmium shielding employed to isolate neutron and gamma interactions. Energy calibration established a linear ADU to MeV conversion ($R^2 = 0.966$), enabling identification of a neutron detection threshold at $2.62 \\pm 0.77$~MeV via a $3σ$ significance analysis. Stage one categorizes sources as pure gamma (below threshold) or neutron-emitting (at threshold). For ambiguous cases above threshold, a machine learning pipeline utilizing pulse shape analysis was developed. A soft voting ensemble (Bagging, CatBoost, and MLP) achieved an accuracy of 0.816 and an AUC of 0.921. This hybrid scheme combines physics-based filtering with ML refinement, offering an interpretable and scalable solution for nuclear security, nonproliferation monitoring, and fundamental radiation research.",
    "authors": [
      "Alejandro Núñez-Selin",
      "Iván Sidelnik",
      "Christian Sarmiento-Cano",
      "Hernán Asorey",
      "Luis A. Núñez"
    ],
    "published": "2026-01-23T21:32:04Z",
    "updated": "2026-01-23T21:32:04Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.17161v1",
    "url": "https://arxiv.org/abs/2601.17161v1",
    "pdf_url": "https://arxiv.org/pdf/2601.17161v1.pdf",
    "title": "Industrial Deposition of Wavelength-Shifting Films for Liquid Argon Photon Detection Systems",
    "abstract": "The Deep Underground Neutrino Experiment (DUNE) Phase-II Far Detector is considering an unprecedentedly large-area ~2000 m$^2$ photon detection system to achieve a target mean light yield of 180 PE/MeV. Meeting this requirement demands scalable, cost-effective, and high-quality wavelength-shifter (WLS) coatings capable of converting 127 nm liquid-argon scintillation light into visible photons with high efficiency. We report on the successful realization of an industrial physical vapor deposition (PVD) process for \\textit{p}-terphenyl (pTP) coatings, adapted from vacuum deposition techniques developed for OLED display manufacturing, to produce uniform WLS layers on large-area inorganic substrates, a task traditionally challenged by adhesion and uniformity issues at organic--inorganic interfaces. Surface characterization by profilometry and spectroscopic measurements confirms sub-10% thickness uniformity for 1-2 $μ$m films and emission spectra consistent with high-quality pTP reference samples. The industrial process demonstrates reproducibility, scalability, and significantly reduced production time compared to laboratory-based methods, while maintaining the optical quality required for large-scale liquid-argon time-projection chamber (LArTPC) photon detection systems. These results establish a viable pathway for mass production of high-performance pTP coatings for DUNE FD3 and future neutrino experiments.",
    "authors": [
      "Babak Azmoun",
      "Aleksey Bolotnikov",
      "Francesca Capocasa",
      "Milind Diwan",
      "Yimin Hu",
      "Jay Hyun Jo",
      "William Lenz",
      "Yichen Li",
      "Abdul Rumaiz",
      "Vyara Tsvetkova",
      "Matteo Vicenzi"
    ],
    "published": "2026-01-23T20:48:23Z",
    "updated": "2026-01-23T20:48:23Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.16928v1",
    "url": "https://arxiv.org/abs/2601.16928v1",
    "pdf_url": "https://arxiv.org/pdf/2601.16928v1.pdf",
    "title": "Neutron spectrum measurement in the Yemi underground laboratory",
    "abstract": "We report on the measurement of neutron energy spectra at the newly established Yemi Underground Laboratory (Yemilab) in the Republic of Korea, designed to host dark matter and rare-event search experiments. A high-sensitivity neutron spectrometer was employed, consisting of ten cylindrical {}^{3}He proportional counters, eight of which were embedded in cylindrical high-density polyethylene moderators of various sizes. To quantify and mitigate contributions from internal α-backgrounds, each detector underwent a dedicated background measurement using a cadmium-shielded box. These backgrounds, primarily originating from trace amounts of U and Th in the stainless-steel housings, were characterized and subtracted during data analysis. Neutron measurements were carried out at three locations within the Yemilab between March to October 2023. After waveform-based event selection and correction for \\alphasym-backgrounds, neutron count rates were estimated and corresponding energy spectra were reconstructed using the unfolding method. The total neutron fluence rates were measured ranged from (3.24 $\\pm$ 0.11) to (4.01 $\\pm$ 0.10) $\\times~10^{-5}~ {cm}^{-2}~{s}^{-1}$, with thermal and fast neutron components (1 - 10 MeV) ranging from (1.32 $\\pm$ 0.05) to (1.51 $\\pm$ 0.05) $\\times 10^{-5}~{cm}^{-2}~{s}^{-1}$ and (0.27 $\\pm$ 0.03) to (0.34 $\\pm$ 0.10) $\\times~10^{-5}~{cm}^{-2}~{s}^{-1}$, respectively.",
    "authors": [
      "Joong Hyun Kim",
      "Sinchul Kang",
      "HyeoungWoo Park",
      "Jungho Kim",
      "Hyeonseo Park",
      "Young Soo Yoon",
      "Hongjoo Kim",
      "Yeongduk Kim",
      "Jungho So",
      "SungHyun Kim"
    ],
    "published": "2026-01-23T17:40:36Z",
    "updated": "2026-01-23T17:40:36Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.16925v1",
    "url": "https://arxiv.org/abs/2601.16925v1",
    "pdf_url": "https://arxiv.org/pdf/2601.16925v1.pdf",
    "title": "Investigating ultra-thin 4H-SiC AC-LGADs for superior radiation-hard timing applications",
    "abstract": "The Low Gain Avalanche Diodes (LGADs) are promising particle detectors for timing resolution better than $50$ ps under a high radiation environment. This study investigates n-in-p LGAD architecture, focusing on ultra-thin sensors of thickness less than $50\\ μ$m using the WeightField2 program. The capabilities of WeightField2 are demonstrated by comparing its results with irradiation measurements from an FBK LGAD wafer, showing good agreement across unirradiated and neutron-irradiated conditions. This paper presents device simulations in High Luminosity LHC conditions (lifetime integrated fluence $ \\mathcal{O} (10^{14})\\ \\mathrm{n_{eq}~cm^{-2}}$, temperature $ \\approx 243\\ \\mathrm{K} $), and taking into account radiation damage, gain reduction due to fluence, and lattice defects. It is shown that a 20 $μ$m thick sensor achieves the best timing performance. Among Silicon (Si), Diamond (C), and 4H-Silicon Carbide (4H-SiC), we found 4H-SiC to be the most promising: it provides the highest gain value for a fixed thickness and gain implant layer configuration, and best retains high charge collection value and timing capability under increasing fluence up to $50\\times10^{14}\\ \\mathrm{n_{eq}~cm^{-2}}$. A time resolution less than 25 ps is reported with different gain implant concentrations for a $20 μ$m 4H-SiC sensor. This work presents the potential of SiC-based LGADs in high-radiation collider environments.",
    "authors": [
      "Jaideep Kalani",
      "Saptarshi Datta",
      "Ganesh J Tambve",
      "Prabhakar Palni"
    ],
    "published": "2026-01-23T17:34:01Z",
    "updated": "2026-01-23T17:34:01Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.18956v2",
    "url": "https://arxiv.org/abs/2511.18956v2",
    "pdf_url": "https://arxiv.org/pdf/2511.18956v2.pdf",
    "title": "Ion Temperature Anisotropy Limits from Magnetic Curvature Scattering in Magnetotail Reconnection Jets",
    "abstract": "In collisionless plasmas, relaxation of the deviations of ion velocity distribution functions (VDFs) from local thermodynamic equilibrium occurs through particle interactions with electromagnetic fields. In particular, in the Earth's magnetotail, the deviations of the ion VDFs, typically consisting of multiple components, from the equilibrium must be limited to maintain stability of the current sheet. Curvature scattering is a leading candidate mechanism to limit such deviations, but its role remains insufficiently understood. We investigate the limits of ion temperature anisotropy in a magnetotail-like configuration by modeling a quasi-1D current sheet with a finite magnetic field curvature and three ion populations. We derive analytical thresholds for anisotropy based on current sheet stability and validate against spacecraft observations and numerical simulations. Our findings demonstrate that curvature scattering imposes limits on ion anisotropies, thereby maintaining the stability of the current sheet.",
    "authors": [
      "Louis Richard",
      "Anton V. Artemyev",
      "Cecilia Norgren",
      "Xin An",
      "Sergey R. Kamaletdinov",
      "Yuri V. Khotyaintsev"
    ],
    "published": "2025-11-24T10:18:43Z",
    "updated": "2026-01-23T16:29:04Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2411.03476v5",
    "url": "https://arxiv.org/abs/2411.03476v5",
    "pdf_url": "https://arxiv.org/pdf/2411.03476v5.pdf",
    "title": "Functional Verification for Endcap Concentrator ASICs in the High-Granularity Calorimeter Upgrade of CMS",
    "abstract": "The High-Granularity Calorimeter (HGCAL) will replace the current CMS Endcap Calorimeter during Long-Shutdown 3. The Endcap Concentrator (ECON) ASICs represent key elements in the readout chain, processing trigger (ECON-T) and data (ECON-D) streams from the HGCROC to the lpGBT. The ECONs will operate in a radiation environment with a High-Energy Hadron (${E\\geq20MeV}$) flux up to $2\\cdot10^{7} cm^{-2}s^{-1}$. This contribution describes the Universal Verification Methodology (UVM)-based functional verification of the ECON ASICs focusing on the re-use of existing components to manage the complexity of the verification environment.",
    "authors": [
      "M. Lupi",
      "G. Bergamin",
      "D. Ceresa",
      "D. Coko",
      "G. Cummings",
      "V. Gingu",
      "M. Hammer",
      "J. Hirschauer",
      "J. Hoff",
      "N. Kharwadkar",
      "S. Kulis",
      "C. Mantilla-Suarez",
      "D. Noonan",
      "P. Rubinov",
      "S. Scarfì",
      "A. Shenai",
      "C. Syal",
      "X. Wang",
      "R. Wickwire",
      "J. Wilson"
    ],
    "published": "2024-11-05T19:59:49Z",
    "updated": "2026-01-23T15:51:02Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/02/C02004"
  },
  {
    "arxiv_id": "2411.03478v5",
    "url": "https://arxiv.org/abs/2411.03478v5",
    "pdf_url": "https://arxiv.org/pdf/2411.03478v5.pdf",
    "title": "Reusable Verification Components for High-Energy Physics readout ASICs",
    "abstract": "Verification is a critical aspect of designing front-end (FE) readout ASICs for High-Energy Physics (HEP) experiments. These ASICs share several similar functional features, resulting in similar verification objectives, which can be addressed using comparable verification strategies. This contribution presents a set of re-usable verification components for addressing common verification tasks, such as clock generation, reset handling, configuration, as well as hit and fault injections. The components were developed as part of the CHIPS initiative and they have been successfully used in the verification of multiple HEP ASICs.",
    "authors": [
      "M. Lupi S. Esposito",
      "X. Llopart-Cudie",
      "A. Pulli",
      "S. Scarfí",
      "N. Kharwadkar"
    ],
    "published": "2024-11-05T20:03:43Z",
    "updated": "2026-01-23T15:50:44Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1088/1748-0221/20/02/C02002"
  },
  {
    "arxiv_id": "2511.03857v3",
    "url": "https://arxiv.org/abs/2511.03857v3",
    "pdf_url": "https://arxiv.org/pdf/2511.03857v3.pdf",
    "title": "Challenges and strategies in verification of FastRICH ASIC for the LHCb RICH detector",
    "abstract": "The FastRICH ASIC provides high-precision, triggerless readout for the LS3 Enhancements and Upgrades II of the LHCb RICH detector. The demands of continuous data acquisition and varying hit rates across the detector impose unique challenges on the ASIC's design and verification. This work presents the verification strategy for FastRICH, focusing on functional correctness, timing performance, and operational robustness. The methodology includes simulations across occupancy scenarios, validation of timing precision, and stress testing under pile-up and high-rate conditions. Results demonstrate that FastRICH meets its performance requirements over the full range of expected occupancies. Key design and verification challenges specific to triggerless, fast-timing ASICs are discussed, along with lessons learned for future developments.",
    "authors": [
      "M. Lupi",
      "R. Ballabriga",
      "F. N. Bandi",
      "G. Bergamin",
      "D. Ceresa",
      "D. Gascon",
      "S. Gomez",
      "J. Kaplon",
      "R. Manera",
      "J. Mauricio",
      "A. Paternò",
      "D. Peninon-Herbaut",
      "A. Pulli",
      "S. Scarfì",
      "G. J. Wegrzyn",
      "K. Wyllie"
    ],
    "published": "2025-11-05T20:58:06Z",
    "updated": "2026-01-23T15:48:01Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.17101v1",
    "url": "https://arxiv.org/abs/2601.17101v1",
    "pdf_url": "https://arxiv.org/pdf/2601.17101v1.pdf",
    "title": "Accelerating Molecular H$_2^+$ Beam in AGS and RHIC",
    "abstract": "After the recent success of acceleration molecular H$_2^+$ beam (from EBIS) in Booster to 1.0 GeV/u kinetic energy, we propose to carry out tests to accelerate H$_2^+$ beam in AGS (up to 12 GeV/u) and to RHIC (up to 100 GeV/u). In this Note, we address the main effects that might hamper H$_2^+$ beam acceleration, outline the impacts and benefits of high energy H$_2^+$ beam to BNL.",
    "authors": [
      "Xiaodong Jiang"
    ],
    "published": "2026-01-23T15:36:32Z",
    "updated": "2026-01-23T15:36:32Z",
    "categories": [
      "physics.acc-ph",
      "nucl-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.16822v1",
    "url": "https://arxiv.org/abs/2601.16822v1",
    "pdf_url": "https://arxiv.org/pdf/2601.16822v1.pdf",
    "title": "Design and characterization of the POKERINO prototype for the POKER/NA64 experiment at CERN",
    "abstract": "The NA64 experiment at CERN H4 beamline recently started a high-energy positron-beam program to search for light dark matter particles through a thick-target, missing-energy measurement. To fulfil the energy resolution requirement of the physics measurement $σ_E/E\\simeq2.5\\%/\\sqrt{E\\mathrm{[GeV}]} \\oplus 0.5\\%$ and cope with the constraints and performance requests of the NA64 setup, a new high-resolution homogeneous electromagnetic calorimeter PKR-CAL has been designed. The detector is based on PbWO$_4$ crystals, each read by multiple SiPM sensors to maximize the light collection. The PKR-CAL design has been optimized to mitigate and control unavoidable SiPM saturation effects at high light levels, as well as to minimize the gain fluctuations induced by instantaneous variations of the H4 beam intensity. The $R\\&D$ program culminated in the construction of a small-scale prototype, POKERINO. In this work, we present the results from the experimental characterization campaign of the POKERINO aiming at demonstrating that the obtained performances are compatible with the application requirements.",
    "authors": [
      "Andrei Antonov",
      "Pietro Bisio",
      "Mariangela Bondì",
      "Andrea Celentano",
      "Anna Marini",
      "Luca Marsicano"
    ],
    "published": "2026-01-23T15:20:39Z",
    "updated": "2026-01-23T15:20:39Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.17099v1",
    "url": "https://arxiv.org/abs/2601.17099v1",
    "pdf_url": "https://arxiv.org/pdf/2601.17099v1.pdf",
    "title": "Detecting the full photoemission cone from laser-based ARPES experiments by leveraging deflector technology",
    "abstract": "Angle-resolved photoemission spectroscopy (ARPES) provides a direct access to the electronic band structure of solid and molecular systems. The momentum range accessible by this technique depends directly on the photon energy used, and low-photon-energy sources are insufficient to photoemit electrons over the full Brillouin zone of most quantum materials. In addition, while electrons are emitted over a 2$π$ solid angle, conventional hemispherical analyzers only collect a small subset of those electrons. A previous work [RSI 92, 123907 (2021)] demonstrated that electrons emitted over a larger field-of-view can be acquired in one fixed configuration by accelerating them towards the analyzer with a bias voltage. Here, we extend this work by leveraging the deflector technology of novel ARPES hemispherical analyzers. We demonstrate the ability to detect all $2π$ photoemitted electrons in a fixed configuration for various materials such as gold, cuprates and transition-metal dichalcogenides. This approach is especially advantageous for time-resolved ARPES, as electron dynamics over a large momentum range can be accessed with identical measurement conditions.",
    "authors": [
      "Nicolas Gauthier",
      "Benson Kwaku Frimpong",
      "Dario Armanno",
      "Akib Jabed",
      "Francesco Goto",
      "Vicky Hasse",
      "Claudia Felser",
      "Genda Gu",
      "Heide Ibrahim",
      "Francois Légaré",
      "Fabio Boschini"
    ],
    "published": "2026-01-23T15:15:20Z",
    "updated": "2026-01-23T15:15:20Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "cond-mat.str-el",
      "cond-mat.supr-con",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2601.10571v2",
    "url": "https://arxiv.org/abs/2601.10571v2",
    "pdf_url": "https://arxiv.org/pdf/2601.10571v2.pdf",
    "title": "Corrections for systematic errors in slit-profiler transverse phase space measurements",
    "abstract": "In photo injectors, the transverse emittance is one of the key measures of beam quality as it defines the possible performance of the whole facility. As such it is important to measure the emittance in photo injectors and ensure the accuracy of these measurements. While there are many different methods of measuring the emittance, this paper focuses on quantifying the systematic errors present in transverse phase space measurements taken with slit-profiler methods, i.e. scanning a narrow slit over the beam and continually measuring the passed beamlets' divergence with a downstream profiler. The measurement errors include effects of the slit size, beamlet imaging, and residual space charge. While these effects are generally small, they can have significant impact on the measured emittance when the 2D phase space is strongly coupled. The systematic effects studied and corrections are demonstrated with simulations and measurements from the Photo Injector Test facility at DESY in Zeuthen (PITZ) using a slit-screen emittance scanner.",
    "authors": [
      "C. Richard",
      "M. Krasilnikov",
      "N. Aftab",
      "Z. Amirkhanyan",
      "D. Dmytriiev",
      "A. Hoffmann",
      "X. -K. Li",
      "Z. Lotfi",
      "F. Stephan",
      "G. Vashchenko",
      "S. Zeeshan"
    ],
    "published": "2026-01-15T16:37:09Z",
    "updated": "2026-01-23T14:55:29Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.16794v1",
    "url": "https://arxiv.org/abs/2601.16794v1",
    "pdf_url": "https://arxiv.org/pdf/2601.16794v1.pdf",
    "title": "Improved Kelbg Potentials for $Z>1$ and Application to Carbon Plasmas",
    "abstract": "In this work, we present a general form for the electron-ion diffractive potential derived from the quantum pair density matrix and fit to the improved Kelbg potential for atomic numbers up to $Z = 54$. We apply classical molecular dynamics using the improved Kelbg potential for carbon with various forms of the Pauli potential to compute internal energies and pressures for hot, dense plasma conditions. Our results are compared to an equation of state model based on path integral Monte Carlo and density functional theory simulations to examine the extent to which the improved Kelbg potential reproduces the internal energy and pressure of carbon plasmas. The regions of validity for carbon agree generally with those derived previously for hydrogen once pressure ionization effects are incorporated. Based on our carbon results and previously published hydrogen studies, we discuss the general applicability and limitations of these potentials for equation of state studies in warm dense matter and high energy density plasmas.",
    "authors": [
      "Heather D. Whitley",
      "Michael S. Murillo",
      "John I. Castor",
      "Liam G. Stanton",
      "Lorin X. Benedict",
      "Philip A. Sterne",
      "James N. Glosli",
      "Frank R. Graziani"
    ],
    "published": "2026-01-23T14:47:15Z",
    "updated": "2026-01-23T14:47:15Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.16760v1",
    "url": "https://arxiv.org/abs/2601.16760v1",
    "pdf_url": "https://arxiv.org/pdf/2601.16760v1.pdf",
    "title": "RF Applications",
    "abstract": "Radiofrequency (RF) systems play a critical role in particle accelerators by enabling the acceleration, manipulation, and diagnosis of charged particle beams. At the heart of many of these systems lies the RF cavity, whose effective design requires close collaboration among RF designers, beam physicists, and mechanical engineers. This chapter presents the fundamental principles of RF systems, with particular emphasis on RF cavities, and underscores the interdisciplinary effort involved in their development. The SwissFEL X-ray free-electron laser at the Paul Scherrer Institut serves as a key example to illustrate these concepts.",
    "authors": [
      "Thomas Geoffrey Lucas"
    ],
    "published": "2026-01-23T14:05:51Z",
    "updated": "2026-01-23T14:05:51Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  }
]