{
  "arxiv_id": "2504.02773v4",
  "url": "https://arxiv.org/abs/2504.02773v4",
  "pdf_url": "https://arxiv.org/pdf/2504.02773v4.pdf",
  "title": "Disentangling Core and Edge Mechanisms of the Density Limit in DIII-D   Negative Triangularity Plasmas",
  "abstract": "The density limit is investigated in the DIII-D negative triangularity (NT) plasmas which lack a standard H-mode edge. We find the limit may not be a singular disruptive boundary but a multifaceted density saturation phenomenon governed by distinct core and edge transport mechanisms. Sustained, non-disruptive operation is achieved at densities up to 1.8 times the Greenwald limit ($n_\\mathrm{G}$) until the termination of auxiliary heating. Systematic power scans reveal distinct power scalings for the core ($n_e \\propto P_\\mathrm{SOL}^{0.27\\pm0.03}$) and edge ($n_e \\propto P_\\mathrm{SOL}^{0.42\\pm0.04}$) density limits. The edge density saturation is triggered abruptly by the onset of a non-disruptive, high-field side radiative instability that clamps the edge density below $n_\\mathrm{G}$. In contrast, the core density continues to rise until it saturates, a state characterized by substantially enhanced core turbulence. Core transport evolves from a diffusive to an intermittent, avalanche-like state, as indicated by heavy-tailed probability density functions (kurtosis $\\approx 6$), elevated Hurst exponents, and a $1/f$-type power spectrum. These findings suggest that the density limit in the low-confinement regime is determined by a combination of edge radiative instabilities and core turbulent transport. This distinction provides separate targets for control strategies aimed at extending the operational space of future fusion devices.",
  "authors": [
    "R. Hong",
    "P. H. Diamond",
    "O. Sauter",
    "J. Chen",
    "F. Khabanov",
    "Z. Li",
    "D. Liu",
    "A. Marinoni",
    "G. R. McKee",
    "T. L. Rhodes",
    "F. Scotti",
    "K. E. Thome",
    "G. R. Tynan",
    "M. A. Van Zeeland",
    "Z. Yan",
    "L. Zeng",
    "the DIII-D NT Team"
  ],
  "published": "2025-04-03T17:14:44Z",
  "updated": "2025-08-29T22:55:57Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}