{
  "arxiv_id": "2510.24445v1",
  "url": "https://arxiv.org/abs/2510.24445v1",
  "pdf_url": "https://arxiv.org/pdf/2510.24445v1.pdf",
  "title": "Noise Estimation and Suppression in Quantitative EMCD Measurements",
  "abstract": "Quantitative electron magnetic circular dichroism (EMCD) in transmission electron microscopy (TEM) enables the measurement of magnetic moments with elemental and atomic site sensitivity, but its practical application is fundamentally limited by noise. This study presents a comprehensive methodology for noise estimation and suppression in EMCD measurements, demonstrated on Ti-doped barium hexaferrite lamellae. By employing a classical three-beam geometry and long-term acquisition of electron energy-loss spectra, we systematically analyze the signal-to-noise ratio (SNR) across individual energy channels using bootstrap statistics. A robust energy alignment procedure based on the neighboring Ba-M4,5 edges with an adequate energy upsampling is introduced to minimize systematic errors from energy misalignment. The impact of detector noise, particularly from CMOS-based EELS cameras, is evaluated through variance-to-mean analysis and described by the noise amplification coefficients, revealing that detector-amplified shot noise is the dominant noise source. We recommend a stricter SNR threshold for reliable EMCD detection and quantification, ensuring that critical spectral features such as the Fe-L2,3 peaks meet the requirements for quantitative analysis. The approach also provides a framework for determining the minimum electron dose necessary for valid measurements and can be generalized to scintillator-based or direct electron detectors. This work advances the reliability of EMCD as a quantitative tool for magnetic characterization at the nanoscale with unknown magnetic structures. The proposed procedures lay the groundwork for improved error handling and SNR optimization in future EMCD studies.",
  "authors": [
    "Hitoshi Makino",
    "Bernd Rellinghaus",
    "Sebastian Schneider",
    "Axel Lubk",
    "Darius Pohl"
  ],
  "published": "2025-10-28T14:08:57Z",
  "updated": "2025-10-28T14:08:57Z",
  "categories": [
    "cond-mat.mtrl-sci",
    "physics.ins-det"
  ],
  "primary_category": "cond-mat.mtrl-sci"
}