{
  "arxiv_id": "2510.25272v1",
  "url": "https://arxiv.org/abs/2510.25272v1",
  "pdf_url": "https://arxiv.org/pdf/2510.25272v1.pdf",
  "title": "Characterization of the Li$_2$WO$_4$ crystal as a cryogenic   scintillating calorimeter",
  "abstract": "A wide range of scintillating bolometers is under investigation for applications in the search for rare events and processes beyond the Standard Model. In this work, we report the first measurement of a natural, non-molybdenum-doped, lithium tungstate (LWO) crystal operated underground as a scintillating cryogenic calorimeter. The detector achieved a baseline energy resolution of 0.5 keV RMS with a low-energy threshold of about 1.5 keV. The simultaneous readout of heat and light enabled particle identification, revealing a clear separation between $\\beta/\\gamma$, $\\alpha$, and nuclear recoil populations above 300 keV, with a light-yield-based particle discrimination better than $6\\sigma$. These results, fully comparable with those achieved with other compounds in the field, demonstrate that LWO is a promising candidate for rare-event searches. In particular, the combination of excellent radio-purity (with U/Th levels below 0.5 mBq/kg) and sensitivity to neutron interactions via the $^6$Li(n,$\\alpha$)$^3$H reaction makes this material an attractive option for next-generation experiments on dark matter, coherent elastic neutrino-nucleus scattering, and spin-dependent interactions.",
  "authors": [
    "D. L. Helis",
    "A. Melchiorre",
    "S. Nagorny",
    "M. Noia",
    "L. Pagnanini",
    "S. Pirro",
    "A. Puiu",
    "G. Benato",
    "P. Carniti",
    "R. Elleboro",
    "P. Gambacorta",
    "C. Gotti",
    "V. D. Grigorieva",
    "S. Nisi",
    "E. Olivieri",
    "G. Pessina",
    "S. Piacentini",
    "M. Shafiee",
    "V. N. Shlegel"
  ],
  "published": "2025-10-29T08:30:33Z",
  "updated": "2025-10-29T08:30:33Z",
  "categories": [
    "physics.ins-det",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det"
}