{
  "arxiv_id": "2510.25286v1",
  "url": "https://arxiv.org/abs/2510.25286v1",
  "pdf_url": "https://arxiv.org/pdf/2510.25286v1.pdf",
  "title": "Advanced structural characterization of single-walled carbon nanotubes   with 4D-STEM",
  "abstract": "Single wall carbon nanotubes (SWCNT) exhibit remarkable optical and electrical properties making them one of the most promising materials for next generation electronic and optoelectronic devices. Their electronic properties strongly depend on their chirality, i.e., their structural configuration, as well as on the presence and nature of atomic defects. Currently, the lack of versatile and efficient structural characterization techniques limits SWCNT applications. Here, we report how four-dimensional scanning transmission electron microscopy (4D-STEM) can address critical challenges in SWCNT structural analysis. Using modern fast pixelated electron detectors, we were able to acquire rapidly a large number of low noise electron diffraction patterns of SWCNTs. The resulting 4D-STEM data allow to precisely determine the local chirality of multiple nanotubes at once, with limited electron dose (down to 1750 e-/{\\AA}^2) and nanometric spatial resolution (down to 3.1 nm). We also show how this approach enables to track the chirality along a single nanotube, while giving access to the strain distribution. Then, we report how 4D-STEM data enable to reconstruct high-resolution images with electron ptychography. With this second approach, structural information can be obtained with atomic scale spatial resolution allowing atomic defect imaging. Finally, we investigate how multi-slice electron ptychography could provide even further insight on nanotube defect structures thanks to its close to 3D imaging capabilities at atomic resolution.",
  "authors": [
    "Antonin Louiset",
    "Daniel Förster",
    "Vincent Jourdain",
    "Saïd Tahir",
    "Nicola Vigano",
    "Jean-Luc Rouvière",
    "Christophe Bichara",
    "Hanako Okuno"
  ],
  "published": "2025-10-29T08:42:34Z",
  "updated": "2025-10-29T08:42:34Z",
  "categories": [
    "cond-mat.mtrl-sci",
    "physics.ins-det"
  ],
  "primary_category": "cond-mat.mtrl-sci"
}