{
  "arxiv_id": "2512.23114v1",
  "url": "https://arxiv.org/abs/2512.23114v1",
  "pdf_url": "https://arxiv.org/pdf/2512.23114v1.pdf",
  "title": "Breaking seed dormancy in Mediterranean Brassica rapa wild populations: is cold plasma treatment efficient?",
  "abstract": "Turnip (Brassica rapa) is a native species of the Mediterranean area, spread from northwest France to south Algeria. In this study, dormancy and germination traits were assessed for 61 wild Brassica rapa populations collected across the Mediterranean region. Seed dormancy is a key factor influencing germination and seedling establishment. Three dormancy-breaking methods were compared: gibberellic acid, scarification and cold plasma. The efficiency and selectivity were evaluated through germination ability, time to 10% germination (T10), mean germination time and greenhouse emergence. Five days after imbibition, germination was only 18% for the untreated seeds but 60% for the plasma-treated seeds. Germination also began 24 hours earlier and mean germination time was reduced across most populations. However, there was a limited effect on seedling emergence, which remained around 55% for both untreated and treated samples. Comparative analysis indicates that cold plasma was more effective in alleviating embryo dormancy. In addition, histological and scanning electron microscopy showed that the seed coat differed according to the geographical origin of the populations, with a deeper dormancy in seeds from Sicilian populations.",
  "authors": [
    "M. H. Wagner",
    "T. Dufour",
    "A. Geraci",
    "E. Oddo",
    "G. R. Tarantino",
    "F. Scafidi",
    "C. Bailly",
    "H. Hadj Arab",
    "B. Boucenna",
    "M. Tiret",
    "C. Falentin",
    "A. Dupont",
    "S. Ducournau",
    "A. M. Chèvre"
  ],
  "published": "2025-12-28T23:35:41Z",
  "updated": "2025-12-28T23:35:41Z",
  "categories": [
    "physics.plasm-ph",
    "physics.bio-ph"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": "10.15258/sst.2025.53.3.03"
}