[
  {
    "arxiv_id": "2512.25021v1",
    "url": "https://arxiv.org/abs/2512.25021v1",
    "pdf_url": "https://arxiv.org/pdf/2512.25021v1.pdf",
    "title": "Detector Response Matrices, Effective Areas, and Flash-Effective Areas for Radiation Detectors",
    "abstract": "A Detector Response Matrix (DRM) is a discrete representation of an instrument's Detector Response Function (DRF), which quantifies how many discrete energy depositions occur in a detector volume for a given distribution of particles incident on the detector. For simple radiation detectors that can count such energy depositions (such as scintillators, Proportional Counter Tubes (PCTs), etc), we consider the ideal counting DRF, $\\mathbf{G}_\\varphi (E_\\mathrm{in}, E_\\mathrm{dep})$, which relates the detector's counting histogram (number of energy depositions within a given channel) to an incident particles characterization, $\\varphi$ (e.g. incident flux, fluence, intensity). From the counting DRF we can derive the counting DRM, the effective area, and the flash effective area (which measures the total energy deposited in the detector from a large, instantaneous fluence).",
    "authors": [
      "Gregory Bowers",
      "Eve Chase",
      "William Ford",
      "Daniel Coupland",
      "Brian Larsen",
      "Caleb Roecker",
      "Karl Smith",
      "Kurtis Bartlett",
      "Katherine Gattiker Katherine Mesick"
    ],
    "published": "2025-12-31T18:20:10Z",
    "updated": "2025-12-31T18:20:10Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "math-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2503.20475v3",
    "url": "https://arxiv.org/abs/2503.20475v3",
    "pdf_url": "https://arxiv.org/pdf/2503.20475v3.pdf",
    "title": "An electron-hadron collider at the high-luminosity LHC",
    "abstract": "We discuss a concept of a lower-energy version of the Large Hadron-electron Collider (LHeC), delivering electron-hadron collisions concurrently to the hadron-hadron collisions at the high-luminosity LHC at CERN. Assuming the use of a 20 GeV electron Energy Recovery Linac (ERL), we report the results on the optimised beam dynamics, accelerator technologies, and detector constraints required for such a \"phase-one\" LHeC. Finally, we also discuss the ERL configurations and the possibility of delivering electron-hadron collisions during the planned {Run5} of the LHC, which opens excellent research capabilities - the unique scientific potential of the proposed facility is outlined.",
    "authors": [
      "Kevin David J André",
      "Laurent Forthomme",
      "Bernhard Holzer",
      "Krzysztof Piotrzkowski"
    ],
    "published": "2025-03-26T11:59:29Z",
    "updated": "2025-12-31T16:26:15Z",
    "categories": [
      "hep-ex",
      "physics.acc-ph"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1088/1367-2630/ae2e31"
  },
  {
    "arxiv_id": "2512.18355v2",
    "url": "https://arxiv.org/abs/2512.18355v2",
    "pdf_url": "https://arxiv.org/pdf/2512.18355v2.pdf",
    "title": "Discrete Electron Emission",
    "abstract": "Analysis of space-charge effects on electron emission typically makes some assumption of continuity and smoothness, whether this is continuity of charge as in the classical derivation of the Child-Langmuir current, or the mean-field approximation used in particle-in-cell simulations. However, when studying the physics of electron emission and propagation at the mesoscale it becomes necessary to consider the discrete nature of electronic charge to account for the space-charge effect of each individual point charge. In this paper we give an extensive analysis of some previous work on the distribution of electrons under space-charge limited conditions. We examine the spacing of electrons as they are emitted from a planar surface, We present simplified models for analysis of such conditions to derive scaling laws for emission and compare them to computer simulations.",
    "authors": [
      "Arnar Jonsson",
      "Kristinn Torfason",
      "Andrei Manolescu",
      "Agust Valfells"
    ],
    "published": "2025-12-20T12:51:32Z",
    "updated": "2025-12-31T15:03:59Z",
    "categories": [
      "physics.acc-ph",
      "cond-mat.mes-hall"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.07800v2",
    "url": "https://arxiv.org/abs/2510.07800v2",
    "pdf_url": "https://arxiv.org/pdf/2510.07800v2.pdf",
    "title": "Constraints on inelastic dark matter from the CDEX-1B experiment",
    "abstract": "We present limits on spin-independent inelastic weakly interacting massive particles (WIMP)-nucleus scattering using the 737.1 kg$\\cdot$day dataset from the CDEX-1B experiment. Expected nuclear recoil spectra for various inelastic WIMP masses $m_χ$ and mass splittings $δ$ are calculated under the standard halo model. An accurate background model of CDEX-1B is constructed by simulating all major background sources. The model parameters are then determined through maximum likelihood estimation and Markov chain Monte Carlo fitting. The resulting 90\\% confidence level upper limits on the WIMP-nucleon cross section $σ_{\\mathrm{n}}$ exclude certain DAMA/LIBRA allowed regions: the $χ^2 < 4$ regions for $δ< 30$ keV at $m_χ= 250$ GeV and the $χ^2 < 9$ region for $δ< 50$ keV at $m_χ= 500$ GeV. The method is applicable to other inelastic dark matter scenarios, and the upcoming CDEX-50 experiment is expected to improve sensitivity by four orders of magnitude.",
    "authors": [
      "Y. F. Liang",
      "L. T. Yang",
      "Q. Yue",
      "K. J. Kang",
      "Y. J. Li",
      "H. P. An",
      "Greeshma C.",
      "J. P. Chang",
      "H. Chen",
      "Y. H. Chen",
      "J. P. Cheng",
      "J. Y. Cui",
      "W. H. Dai",
      "Z. Deng",
      "Y. X. Dong",
      "C. H. Fang",
      "H. Gong",
      "Q. J. Guo",
      "T. Guo",
      "X. Y. Guo",
      "L. He",
      "J. R. He",
      "H. X. Huang",
      "T. C. Huang",
      "S. Karmakar",
      "Y. S. Lan",
      "H. B. Li",
      "H. Y. Li",
      "J. M. Li",
      "J. Li",
      "M. C. Li",
      "Q. Y. Li",
      "R. M. J. Li",
      "X. Q. Li",
      "Y. L. Li",
      "B. Liao",
      "F. K. Lin",
      "S. T. Lin",
      "J. X. Liu",
      "R. Z. Liu",
      "S. K. Liu",
      "Y. D. Liu",
      "Y. Liu",
      "Y. Y. Liu",
      "H. Ma",
      "Y. C. Mao",
      "A. Mureed",
      "H. Pan",
      "N. C. Qi",
      "J. Ren",
      "X. C. Ruan",
      "M. B. Shen",
      "H. Y. Shi",
      "M. K. Singh",
      "T. X. Sun",
      "W. L. Sun",
      "C. J. Tang",
      "Y. Tian",
      "H. F. Wan",
      "G. F. Wang",
      "J. Z. Wang",
      "L. Wang",
      "Q. Wang",
      "Q. Wang",
      "Y. F. Wang",
      "Y. X. Wang",
      "H. T. Wong",
      "Y. C. Wu",
      "H. Y. Xing",
      "K. Z. Xiong",
      "R. Xu",
      "Y. Xu",
      "T. Xue",
      "Y. L. Yan",
      "N. Yi",
      "C. X. Yu",
      "H. J. Yu",
      "X. Yu",
      "M. Zeng",
      "Z. Zeng",
      "F. S. Zhang",
      "P. Zhang",
      "P. Zhang",
      "Z. Y. Zhang",
      "M. G. Zhao",
      "J. F. Zhou",
      "Z. Y. Zhou",
      "J. J. Zhu"
    ],
    "published": "2025-10-09T05:29:23Z",
    "updated": "2025-12-31T14:37:50Z",
    "categories": [
      "hep-ex",
      "hep-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1103/cyyp-7w7g"
  },
  {
    "arxiv_id": "2512.24878v1",
    "url": "https://arxiv.org/abs/2512.24878v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24878v1.pdf",
    "title": "Image-Plane Detection of Spatially Entangled Photon Pairs with a CMOS Camera",
    "abstract": "Spatially entangled photon pairs (biphotons) generated by spontaneous parametric down-conversion offer unique opportunities for quantum imaging, but image-plane biphoton correlations are difficult to observe with camera-based detectors. Previous camera-based biphoton imaging experiments have relied on photon-counting detection, which necessitates operation deep in the photon-sparse regime and requires extremely low dark rates.   Here, we demonstrate the detection of spatial biphoton joint probability distributions in both the image plane and the pupil plane (also termed \"near-field plane\" and \"far-field plane\" respectively) using a conventional scientific CMOS camera operated in linear mode. We work at mesoscopic intensity levels, corresponding to a photon flux approximately four orders of magnitude higher than typical photon-counting approaches. From the measured image- and pupil plane correlations, we observe position and momentum correlations consistent with an EPR-type entanglement witness.   A tailored correlation analysis suited for image plane imaging suppresses detector artifacts and intensity fluctuations, enabling acquisition with significantly fewer frames. Our results demonstrate that spatially entangled-light imaging can be performed efficiently with standard imaging hardware, extending quantum imaging techniques beyond the photon-counting regime.",
    "authors": [
      "David McFadden",
      "Rainer Heintzmann"
    ],
    "published": "2025-12-31T14:15:59Z",
    "updated": "2025-12-31T14:15:59Z",
    "categories": [
      "quant-ph",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2512.24837v1",
    "url": "https://arxiv.org/abs/2512.24837v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24837v1.pdf",
    "title": "A Low Background Beta Detection System using a Time Projection Chamber",
    "abstract": "In this paper, we present a Time Projection Chamber (TPC) system for low-background beta radiation measurements. The system consists of a TPC with two-dimensional-strip readout Micromegas and an anti-coincidence detector with readout pads for cosmic ray veto. The detector system utilize an AGET-based waveform sampling system for data acquisition.   The beta detection capability of the system was verified through experimental test using $^{90}$Sr beta source. Additionally, a dedicated simulation program based on Geant4 was developed to model the entire detection process, including responses to both the beta source and background radiation. Simulation results were compared with experimental data for both beta and background samples, showing good agreements.   The simulation samples were utilized to optimize and train classification models for beta and background discrimination. By applying the selected model into test data, the system achieved a background rate of 0.49 $\\rm cpm/cm^2$ while retaining more than 55% of $^{90}$Sr beta signals within a 7 cm diameter detection region. Further analysis revealed that approximately 70% of the background originates from environmental gamma radiation, while the remaining contribution mainly comes from intrinsic radioactivity of detector materials, particularly the FR-4 based field cage and readout plane. Based on the knowledge gained from the experiments and simulations, an optimization of the TPC system has been proposed, with simulation predicting a potential reduction of the background rate to 0.0012 $\\rm cpm/cm^2$.",
    "authors": [
      "Ruiyang Zhang",
      "Zhiyong Zhang",
      "Zengxuan Huang",
      "Yong Zhou",
      "Jianbei Liu",
      "Songsong Tang",
      "Yuanfei Cheng",
      "Changqing Feng",
      "Ming Shao",
      "Yi Zhou"
    ],
    "published": "2025-12-31T12:58:05Z",
    "updated": "2025-12-31T12:58:05Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2506.07213v4",
    "url": "https://arxiv.org/abs/2506.07213v4",
    "pdf_url": "https://arxiv.org/pdf/2506.07213v4.pdf",
    "title": "AttoSHINE: Generation of continuous-wave terawatt-scale attosecond X-ray pulses at SHINE",
    "abstract": "Attosecond X-ray pulses are a critical tool for tracking ultrafast electron dynamics in condensed matter, molecular systems, and strongly correlated materials. Recent breakthroughs have pushed X-ray free electron lasers (XFELs) into the attosecond domain, significantly surpassing their previous femtosecond capabilities. Building on these advancements, this work investigates the potential of the Shanghai High Repetition Rate XFEL and Extreme Light Facility (SHINE), China's first continuous-wave (CW) XFEL, to generate intense attosecond X-ray pulses, thereby offering transformative capabilities for X-ray science. Through comprehensive start-to-end simulations, we show that SHINE is capable of producing hard X-ray pulses with peak powers reaching the terawatt-scale and average pulse durations of approximately 300 as. This is achieved using a self-chirping scheme within the existing machine configuration, requiring no additional hardware. Our findings demonstrate that CW XFELs can generate intense attosecond X-ray pulses at megahertz repetition rates, opening new opportunities for real-time studies of electronic dynamics in complex systems.",
    "authors": [
      "Bingyang Yan",
      "Chenzhi Xu",
      "Si Chen",
      "Duan Gu",
      "Ye Chen",
      "Jiawei Yan",
      "Haixiao Deng"
    ],
    "published": "2025-06-08T16:32:35Z",
    "updated": "2025-12-31T10:11:43Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.24760v1",
    "url": "https://arxiv.org/abs/2512.24760v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24760v1.pdf",
    "title": "Runaway electron avalanche and macroscopic beam formation: simulations of the DTT full power scenario",
    "abstract": "The transition of the Divertor Tokamak Test (DTT) facility from its initial commissioning phase (Day-0, plasma current $I_{p}=2$ MA) to the full power scenario ($I_{p}=5.5$ MA) introduces a critical shift in the dynamics of runaway electrons (REs) generation. While previous predictive studies of the low-current scenario indicated a robust safety margin against RE beam formation, this work reveals that the exponential scaling of the RE avalanche gain with plasma current severely narrows the safe operational window in the full power scenario. Using the non-linear magnetohydrodynamic code JOREK, we perform comprehensive 2D simulations of the current quench (CQ) phase of several disruption scenarios, systematically scanning initial RE seed currents and injected impurity levels. The results demonstrate that in the full power scenario, the avalanche multiplication factor is sufficiently high ($G_\\text{av} \\approx 1.3 \\cdot 10^5$) to convert a mere 5.5 A seed current into macroscopic RE beams of $\\approx 0.7$ MA when large amounts of impurities are present. For even higher RE seeds, the RE current can peak at $ \\approx 3.2$ MA, constituting up to $\\approx$ 80% of the total plasma current during the CQ. These findings suggest that, unlike the Day-0 phase, the disruption mitigation strategy for the full power scenario involves a careful balance between thermal load mitigation and RE avoidance, necessitating a well-chosen quantity of injected impurities. This work provides the baseline needed for future estimations of RE loads on the plasma-facing components of DTT, which will be essential for designing and positioning mitigation components like sacrificial limiters.",
    "authors": [
      "E. Emanuelli",
      "F. Vannini",
      "M. Hoelzl",
      "E. Nardon",
      "V. Bandaru",
      "N. Schwarz",
      "D. Bonfiglio",
      "G. Ramogida",
      "F. Subba",
      "JOREK Team"
    ],
    "published": "2025-12-31T10:09:27Z",
    "updated": "2025-12-31T10:09:27Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.24723v1",
    "url": "https://arxiv.org/abs/2512.24723v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24723v1.pdf",
    "title": "Cataloging the nonlinear waves excited by moving a charged body in the dusty plasma medium",
    "abstract": "The nonlinear waves excited by the movement of a charged body in the dusty plasma medium are studied. A charged body moving through a dusty plasma medium can generate diverse nonlinear waves, such as precursors and pinned solitons. These wave excitations under weakly nonlinear and dispersive limits are described theoretically by the forced Korteweg-de Vries (fKdV) type equation. We have examined the role of the driver in shaping and evolving these wave excitations. In particular we studied the effect of primarily three source parameters, namely, amplitude, width, and flow speed, on the evolution of nonlinear structures. The driver generates a perturbation in the stable system configuration, which couples with medium characteristics and eventually evolves into propagating excitations. Our finding shows that the excitation of nonlinear structure by a moving body in a plasma medium is not just dictated by the mach number but also the features of the source such as amplitude and width. As a novel finding apart from pinned and precursor solitons, we observe another nonlinear structure that lags behind the source term, maintaining its shape and speed as it propagates. These features are the first ever theoretical depiction of such lagging structures.",
    "authors": [
      "Swathi S Krishna",
      "S. K. Mishra",
      "S. Jaiswal"
    ],
    "published": "2025-12-31T08:40:39Z",
    "updated": "2025-12-31T08:40:39Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.24719v1",
    "url": "https://arxiv.org/abs/2512.24719v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24719v1.pdf",
    "title": "Achieving High Efficiency And Enhanced Beam Quality In Laser Wakefield Acceleration",
    "abstract": "Laser wakefield acceleration, characterized by the extremely high electric field gradient exceeding 100GV/m, is regarded as a compact and cost affordable technology for the next generation of particle colliders and light sources. However, it has always been a major challenge to effectively increase the energy transfer efficiency from the laser to the accelerated beam, while ensuring the beam quality remains suitable for practical applications. This study demonstrates that the laser with shorter pulse duration allows for a two-step dechirping process of the accelerated electron beam with charge of nanocoulomb level. The electron beams with an energy spread of 1% can be generated with the energy transfer efficiency of 10% to 30% in a large parameter space. For example, one electron beam with the energy of 420MeV, the charge of 5.5nC and the RMS energy spread of 2% can be produced using an 8.3J laser pulse with 7.2fs duration.",
    "authors": [
      "Jia Wang",
      "Ming Zeng",
      "Dazhang Li",
      "Wentao Wang",
      "Song Li",
      "Ke Feng",
      "Jie Gao"
    ],
    "published": "2025-12-31T08:32:22Z",
    "updated": "2025-12-31T08:32:22Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.24544v1",
    "url": "https://arxiv.org/abs/2512.24544v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24544v1.pdf",
    "title": "Computing Flux-Surface Shapes in Tokamaks and Stellarators",
    "abstract": "There is currently no agreed-upon methodology for characterizing a stellarator magnetic field geometry, and yet modern stellarator designs routinely attain high levels of magnetic-field quasi-symmetry through careful flux-surface shaping. Here, we introduce a general method for computing the shape of an ideal-MHD equilibrium that can be used in both axisymmetric and non-axisymmetric configurations. This framework uses a Fourier mode analysis to define the shaping modes (e.g. elongation, triangularity, squareness, etc.) of cross-sections that can be non-planar. Relative to an axisymmetric equilibrium, the additional degree of freedom in a non-axisymmetric equilibrium manifests as a rotation of each shaping mode about the magnetic axis. Using this method, a shaping analysis is performed on non-axisymmetric configurations with precise quasi-symmetry and select cases from the QUASR database spanning a range of quasi-symmetry quality. Empirically, we find that quasi-symmetry results from a spatial resonance between shape complexity and shape rotation about the magnetic axis. The quantitative features of this resonance correlate closely with a configuration's rotational transform and number of field periods. Based on these observations, it is conjectured that this shaping paradigm can facilitate systematic investigations into the relationship between general flux-surface geometries and other figures of merit.",
    "authors": [
      "M. J. Gerard",
      "M. J. Pueschel",
      "S. Stewart",
      "H. O. M. Hillebrecht",
      "B. Geiger"
    ],
    "published": "2025-12-31T01:02:11Z",
    "updated": "2025-12-31T01:02:11Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2505.00288v6",
    "url": "https://arxiv.org/abs/2505.00288v6",
    "pdf_url": "https://arxiv.org/pdf/2505.00288v6.pdf",
    "title": "Nyström Type Exponential Integrators for Strongly Magnetized Charged Particle Dynamics",
    "abstract": "Solving for charged particle motion in electromagnetic fields (i.e. the particle pushing problem) is a computationally intensive component of particle-in-cell (PIC) methods for plasma physics simulations. This task is especially challenging when the plasma is strongly magnetized due numerical stiffness arising from the wide range of time scales between highly oscillatory gyromotion and long term macroscopic behavior. A promising approach to solve these problems is by a class of methods known as exponential integrators that can solve linear problems exactly and are A-stable. This work extends the standard exponential integration framework to derive Nyström-type exponential integrators that integrates the Newtonian equations of motion as a second-order differential equation directly. In particular, we derive second-order and third-order Nyström-type exponential integrators for strongly magnetized particle pushing problems. Numerical experiments show that the Nyström-type exponential integators exhibit significant improvement in computation speed over the standard exponential integrators.",
    "authors": [
      "Tri P. Nguyen",
      "Ilon Joseph",
      "Mayya Tokman"
    ],
    "published": "2025-05-01T04:22:49Z",
    "updated": "2025-12-31T00:32:05Z",
    "categories": [
      "physics.comp-ph",
      "math.NA",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.comp-ph",
    "doi": "10.1016/j.cpc.2025.109848"
  },
  {
    "arxiv_id": "2512.24363v1",
    "url": "https://arxiv.org/abs/2512.24363v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24363v1.pdf",
    "title": "The sun as colliding beam, betatron cosmic ray factory",
    "abstract": "A theory of cosmic ray production within the solar system (not extra-galactic) is presented. The sun's time variable magnetic flux linkage makes the sun (as well, perhaps, as Jupiter) a natural, all-purpose, betatron storage ring, with semi-infinite acceptance aperture, capable of storing and accelerating counter-circulating, opposite-sign, colliding beams.   The puzzle of how positrons and anti-protons can be well represented at all energies, is explained, initially, by the low energy capture of particles of either sign by the sun's magnetic dipole field. Later, as the magnetic field bending has become negligible compared to the gravitational bending, both positive and negative beams will have survived the gradual transition from predominantly magnetic to predominantly gravitational bending. Later, anti-particles produced in QED beam-beam collisions of sufficiently high energy, are also accelerated.   The high quality of cosmic ray data collected over recent decades, at steadily increasing energies, especially by the International Space Station (ISS), make the study of cosmic ray production mechanisms both timely and essential.   The paper describes how longitudinal electric fields, explained by the Parker solar wind theory can enable the sun to serve as a ``booster'' accelerator of cosmic rays, increasing the maximum cosmic ray energies enough to produce the observed 13 orders of magnitude maximum particle energy and the energy flux needed to maintain the observed cosmic ray atmosphere equilibrium within the solar system.   A steady state mechanism is described, based on semi-quantitative discussion of a relativistic Hamilton-Jacobi formalism, according to which the highest energy cosmic rays observed can have been produced by the Parker longitudinal electric field component, during fractionally brief, but periodic, circular or semi-circular turns centered on the sun.",
    "authors": [
      "Richard M. Talman"
    ],
    "published": "2025-12-30T17:19:39Z",
    "updated": "2025-12-30T17:19:39Z",
    "categories": [
      "physics.acc-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.19290v2",
    "url": "https://arxiv.org/abs/2512.19290v2",
    "pdf_url": "https://arxiv.org/pdf/2512.19290v2.pdf",
    "title": "Optimal operating parameters for next-generation xenon gas time projection chambers",
    "abstract": "The next-generation of neutrinoless double beta decay ($0νββ$) searches are targeting half-life sensitivities towards 10$^{27}$--10$^{28}$ years. Gaseous xenon time projection chamber (GXeTPC) detectors are a technology that may be able to meet this challenge due to their excellent background rejection power, scalability, and energy resolution. This paper explores how the design choices of a next-generation GXeTPC time projection chamber can impact the overall performance of the experiment. We study the performance of systems using xenon enriched in the isotope $^{136}$Xe or natural xenon, focusing on scenarios that incorporate one tonne of source isotope. The detector size, copper shielding mass, energy resolution, pressure, and diffusion amount are surveyed to evaluate the overall performance dependencies on these parameters. A detector optimized for using enriched xenon is preferred, with a factor of 10 lower background rate, driven by the large intrinsic backgrounds introduced by the copper shielding used in the detector. The performance of three types of gas TPC technologies was also explored based on different gas additives used to reduce diffusion to different levels. For all TPC technologies, we find background rates of a fraction of a count per tonne year in the region of interest are achievable. These performances are contingent on suitable energy resolution and event position placement in the drift direction being achieved for the specific detector technology. When factoring in the considerations for the construction of the detector in addition to the selection performance, there is no clear optimum pressure, with advantages and disadvantages if a high or low pressure default configuration is chosen.",
    "authors": [
      "K. Mistry",
      "D. R. Nygren"
    ],
    "published": "2025-12-22T11:31:52Z",
    "updated": "2025-12-30T16:18:07Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.00705v3",
    "url": "https://arxiv.org/abs/2508.00705v3",
    "pdf_url": "https://arxiv.org/pdf/2508.00705v3.pdf",
    "title": "An Online Data Analysis Framework for Small-Scale Physics Experiments",
    "abstract": "A robust and flexible architecture capable of providing real-time analysis on diagnostic data is of crucial importance to physics experiments. In this paper, we present such an online framework, used in June 2025 as part of the HRMT-68 experiment, performed at the HiRadMat facility at CERN, using the Super Proton Synchrotron (SPS) beam line. HRMT-68 was a fixed-target laboratory astrophysics experiment aiming to identify plasma instabilities generated by a relativistic electron-positron beam during traversal of an argon plasma. This framework was essential for experimental data acquisition and analysis, and can be adapted for a broad range of experiments with a variety of experimental diagnostics. The framework's modular and customizable design enabled us to rapidly observe and extract emergent features from a diverse range of diagnostic data. Simultaneously, it allowed for both the introduction of new diagnostic devices and the modification of our analysis as features of interest were identified. As a result, we were able to effectively diagnose equipment malfunction, and infer the beam's response to varying bunch duration, beam intensity, and the plasma state without resorting to offline analysis, at which time adjustment or improvement would have been impossible. We present the features of this agile framework, whose codebase we have made publicly available, which can be adapted for future experiments with minimal modification.",
    "authors": [
      "Hayden Ramm",
      "Pascal Simon",
      "Paraskevi Alexaki",
      "Christopher Arran",
      "Robert Bingham",
      "Alice Goillot",
      "Jon Tomas Gudmundsson",
      "Jonathan Halliday",
      "Bryn Lloyd",
      "Eva Los",
      "Vasiliki Stergiou",
      "Sifei Zhang",
      "Gianluca Gregori",
      "Nikolaos Charitonidis"
    ],
    "published": "2025-08-01T15:20:24Z",
    "updated": "2025-12-30T16:07:07Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.24305v1",
    "url": "https://arxiv.org/abs/2512.24305v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24305v1.pdf",
    "title": "Coordinates based on a magnetic mirror field",
    "abstract": "We construct a coordinate system fitting the geometry of a given, cylindrically symmetric, magnetic field.",
    "authors": [
      "R. D. Hazeltine"
    ],
    "published": "2025-12-30T15:54:17Z",
    "updated": "2025-12-30T15:54:17Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.24290v1",
    "url": "https://arxiv.org/abs/2512.24290v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24290v1.pdf",
    "title": "Fast reconstruction-based ROI triggering via anomaly detection in the CYGNO optical TPC",
    "abstract": "Optical-readout Time Projection Chambers (TPCs) produce megapixel-scale images whose fine-grained topological information is essential for rare-event searches, but whose size challenges real-time data selection. We present an unsupervised, reconstruction-based anomaly-detection strategy for fast Region-of-Interest (ROI) extraction that operates directly on minimally processed camera frames. A convolutional autoencoder trained exclusively on pedestal images learns the detector noise morphology without labels, simulation, or fine-grained calibration. Applied to standard data-taking frames, localized reconstruction residuals identify particle-induced structures, from which compact ROIs are extracted via thresholding and spatial clustering. Using real data from the CYGNO optical TPC prototype, we compare two pedestal-trained autoencoder configurations that differ only in their training objective, enabling a controlled study of its impact. The best configuration retains (93.0 +/- 0.2)% of reconstructed signal intensity while discarding (97.8 +/- 0.1)% of the image area, with an inference time of approximately 25 ms per frame on a consumer GPU. The results demonstrate that careful design of the training objective is critical for effective reconstruction-based anomaly detection and that pedestal-trained autoencoders provide a transparent and detector-agnostic baseline for online data reduction in optical TPCs.",
    "authors": [
      "F. D. Amaro",
      "R. Antonietti",
      "E. Baracchini",
      "L. Benussi",
      "C. Capoccia",
      "M. Caponero",
      "L. G. M. de Carvalho",
      "G. Cavoto",
      "I. A. Costa",
      "A. Croce",
      "M. D'Astolfo",
      "G. D'Imperio",
      "G. Dho",
      "E. Di Marco",
      "J. M. F. dos Santos",
      "D. Fiorina",
      "F. Iacoangeli",
      "Z. Islam",
      "E. Kemp",
      "H. P. Lima",
      "G. Maccarrone",
      "R. D. P. Mano",
      "D. J. G. Marques",
      "G. Mazzitelli",
      "P. Meloni",
      "A. Messina",
      "V. Monno",
      "C. M. B. Monteiro",
      "R. A. Nobrega",
      "G. M. Oppedisano",
      "I. F. Pains",
      "E. Paoletti",
      "F. Petrucci",
      "S. Piacentini",
      "D. Pierluigi",
      "D. Pinci",
      "F. Renga",
      "A. Russo",
      "G. Saviano",
      "P. A. O. C. Silva",
      "N. J. Spooner",
      "R. Tesauro",
      "S. Tomassini",
      "D. Tozzi"
    ],
    "published": "2025-12-30T15:28:18Z",
    "updated": "2025-12-30T15:28:18Z",
    "categories": [
      "physics.ins-det",
      "cs.LG",
      "physics.data-an"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.24254v1",
    "url": "https://arxiv.org/abs/2512.24254v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24254v1.pdf",
    "title": "GPT-like transformer model for silicon tracking detector simulation",
    "abstract": "Simulating physics processes and detector responses is essential in high energy physics and represents significant computing costs. Generative machine learning has been demonstrated to be potentially powerful in accelerating simulations, outperforming traditional fast simulation methods. The efforts have focused primarily on calorimeters. This work presents the very first studies on using neural networks for silicon tracking detectors simulation. The GPT-like transformer architecture is determined to be optimal for this task and applied in a fully generative way, ensuring full correlations between individual hits. Taking parallels from text generation, hits are represented as a flat sequence of feature values. The resulting tracking performance, evaluated on the Open Data Detector, is comparable with the full simulation.",
    "authors": [
      "Tadej Novak",
      "Borut Paul Kerševan"
    ],
    "published": "2025-12-30T14:28:14Z",
    "updated": "2025-12-30T14:28:14Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.24209v1",
    "url": "https://arxiv.org/abs/2512.24209v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24209v1.pdf",
    "title": "Performance of an LYSO-Based Active Converter for a Photon Pair-Spectrometer aiming for 52.8 MeV photon detection in Future $μ^+ \\to e^+ γ$ Search Experiments",
    "abstract": "For future $μ^+ \\to e^+ γ$ search experiments with a branching-ratio sensitivity of $10^{-15}$, we are developing a photon pair-spectrometer employing an active LYSO converter, aiming at target resolutions of 30 ps in timing and 200 keV in energy measurement for detecting 52.8 MeV photons. The converter generates electron-positron pairs from incident photons while simultaneously measuring their energy deposition and timing. On the basis of simulation studies, we optimized the converter thickness and segment dimensions, and accordingly fabricated prototype LYSO segments. Their single-MIP detection performance was evaluated using an electron beam at the KEK PF-AR test beamline. The prototypes exhibited excellent performance, achieving a time resolution of 25 ps and a light yield of $10^4$ photoelectrons, both substantially surpassing the design requirements.",
    "authors": [
      "Sei Ban",
      "Lukas Gerritzen",
      "Fumihito Ikeda",
      "Toshiyuki Iwamoto",
      "Wataru Ootani",
      "Atsushi Oya",
      "Rei Sakakibara",
      "Rintaro Yokota"
    ],
    "published": "2025-12-30T13:22:15Z",
    "updated": "2025-12-30T13:22:15Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.24191v1",
    "url": "https://arxiv.org/abs/2512.24191v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24191v1.pdf",
    "title": "Soft x-rays with Orbital Angular Momentum for resonant scattering experiments at the SOLEIL synchrotron",
    "abstract": "The paper presents a comprehensive description of a new setup implemented and commissioned at the SEXTANTS beamline of the SOLEIL synchrotron for absorption and scattering experiments with x-ray beams carrying an orbital angular momentum, also known as twisted x-ray beams. Two alternative methods have been implemented, based on the use of either spiral zone plates or fork gratings devices, and we show how they can be used for both defining and assessing the orbital angular momentum of an x-ray beam. We show also how multiple devices can be used in sequence to define an integer arithmetic of the orbital angular momentum of the final x-ray beam. Finally, we report the results of the first resonant scattering pilot experiments in transmission and reflection mode, intended to assess the feasibility of future users measurements. The availability of twisted soft x-rays complements the range of experimental techniques in elastic, resonant and coherent scattering available at the SEXTANTS beamline of the SOLEIL synchrotron.",
    "authors": [
      "Pietro Carrara",
      "Franck Fortuna",
      "Renaud Delaunay",
      "Joan Vila-Comamala",
      "Benedikt Rösner",
      "Christian David",
      "Stefania Pizzini",
      "Clément Fourniols",
      "Laurent Vila",
      "Matteo Pancaldi",
      "Carlo Spezzani",
      "Flavio Capotondi",
      "Pierre Nonnon",
      "Mauro Fanciulli",
      "Thierry Ruchon",
      "Nicolas Jaouen",
      "Horia Popescu",
      "Maurizio Sacchi"
    ],
    "published": "2025-12-30T12:48:45Z",
    "updated": "2025-12-30T12:48:45Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.acc-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2512.24054v1",
    "url": "https://arxiv.org/abs/2512.24054v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24054v1.pdf",
    "title": "The role of particle feedback on particle acceleration in magnetic reconnection",
    "abstract": "Magnetic reconnection is a ubiquitous process in astrophysical plasmas and an efficient mechanism for particle acceleration. Using 2.5D magnetohydrodynamic (MHD) simulations with a co-evolving fluid-particle framework, we investigate how particle feedback affects reconnection and acceleration. Our simulations demonstrate that particle feedback to the fluid amplifies shear flows within magnetic islands, which strengthens the convective electric field and thereby boosts particle acceleration. This mechanism results in a higher maximum particle energy and a harder non-thermal energy spectrum. The guide field suppresses both the increase in gas internal energy and particle acceleration. These findings highlight the complex interplay between feedback, guide fields, and reconnection dynamics.",
    "authors": [
      "Shimin Liang",
      "Nianyu Yi"
    ],
    "published": "2025-12-30T07:55:01Z",
    "updated": "2025-12-30T07:55:01Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.23974v1",
    "url": "https://arxiv.org/abs/2512.23974v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23974v1.pdf",
    "title": "Design, construction, and testing of the PandaX-xT cryogenics system",
    "abstract": "The PandaX-xT is a next-generation experiment with broad scientific goals, including the search for dark matter, Neutrinoless Double Beta Decay, and astrophysical neutrinos, using a dual-phase time projection chamber with about 43 tons of liquid xenon. A new cryogenics system of the PandaX-xT is described in this paper. It is developed to handle large mass of liquid xenon efficiently and safely, including two cooling towers for normal operation and one liquid-nitrogen coil for emergency case. Each cooling tower equipped with an AL600 Gifford-McMahon cryocooler features a 1300 W heater, specifically designed to maintain the cold finger's temperature at the desired setpoint. The performance of the cooling tower and the coil has been tested. The cryogenics system with two cooling towers has achieved about 1900~W cooling power at 178~K. The liquid nitrogen coil provides emergency cooling power of more than 1500~W at liquid xenon temperature. For the prototype of a 1-tonne liquid xenon detector, the fluctuation of xenon saturated vapor pressure remains below 1 kPa over one month, while the pressure is around 210~kPa.",
    "authors": [
      "Xu Wang",
      "Li Zhao",
      "Xiang Xiao",
      "Xiangyi Cui",
      "Shuaijie Li",
      "Jianglai Liu"
    ],
    "published": "2025-12-30T04:07:26Z",
    "updated": "2025-12-30T04:07:26Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.22446v2",
    "url": "https://arxiv.org/abs/2512.22446v2",
    "pdf_url": "https://arxiv.org/pdf/2512.22446v2.pdf",
    "title": "Electrode Geometry Optimization in Vortex-Type Seawater Magnetohydrodynamic Generators",
    "abstract": "Magnetohydrodynamics (MHD) generators present a promising pathway for clean energy conversion by directly transforming conductive fluids' kinetic energy into electricity. This study investigates the impact of electrode geometry modifications on the performance of a vortex-type seawater MHD generator. Three electrode designs, partial, whole-area, and spiral, are analyzed through combined analytical and numerical simulations using COMSOL Multiphysics. The study focuses on internal resistance reduction, current density distribution, and overall power output. The results indicate that electrode area and spacing are critical determinants of performance. The whole-area electrode achieves the highest output, with a 155 percent increase in power compared to the baseline partial electrode. The spiral electrode demonstrates reduced internal resistance and improved current flow but exhibits lower open-circuit voltage due to reduced electrode spacing. The simulations show strong agreement with theoretical models, with deviations of less than 4 percent in open-circuit voltage predictions. These findings highlight the importance of geometric optimization for advancing seawater-based MHD generators as sustainable and efficient energy conversion systems.",
    "authors": [
      "Arleen Natalie",
      "Budiarso",
      "Ridho Irwansyah"
    ],
    "published": "2025-12-27T03:07:35Z",
    "updated": "2025-12-30T03:44:29Z",
    "categories": [
      "physics.flu-dyn",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.flu-dyn"
  },
  {
    "arxiv_id": "2512.23072v2",
    "url": "https://arxiv.org/abs/2512.23072v2",
    "pdf_url": "https://arxiv.org/pdf/2512.23072v2.pdf",
    "title": "Thermodynamically Consistent Vibrational-Electron Heating: Generalized Model for Multi-Quantum Transitions",
    "abstract": "Accurate prediction of electron temperature ($T_{\\rm e}$) is critical for non-equilibrium plasma applications ranging from hypersonic flight to plasma-assisted combustion. We recently proposed a thermodynamically consistent model for vibrational-electron heating [Phys. Fluids 37, 096141 (2025)] that enforces the convergence of $T_{\\rm e}$ to the vibrational temperature ($T_{\\rm v}$) at equilibrium. However, the original derivation was restricted to single-quantum transitions, limiting its validity to low-temperature regimes ($T_{\\rm e} \\lesssim 1.5$ eV). In this Letter, we generalize the model to include multi-quantum overtone transitions, extending its applicability to high-energy regimes. We demonstrate that previous models neglecting hot-band transitions incur a systematic heating error of $\\exp(-θ_{\\rm v}/T_{\\rm v})$, where $θ_{\\rm v}$ is the characteristic vibrational temperature. This error exceeds 40\\% when $T_{\\rm v}$ is greater than $θ_{\\rm v}$, effectively preventing thermal relaxation. To correct this, we derive a formulation where the total heating rate is a summation of channel-specific cooling rates $Q_{\\rm e-v}^{(m)}$, each associated with a quantum jump $m$, scaled by a thermodynamic factor $\\exp(mθ_{\\rm v}/T_{\\rm e}-mθ_{\\rm v}/T_{\\rm v})$. This generalized model preserves thermodynamic consistency by ensuring zero net energy transfer at equilibrium.",
    "authors": [
      "Bernard Parent",
      "Felipe Martin Rodriguez Fuentes"
    ],
    "published": "2025-12-28T20:34:04Z",
    "updated": "2025-12-30T02:53:17Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.23885v1",
    "url": "https://arxiv.org/abs/2512.23885v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23885v1.pdf",
    "title": "Control and read-out of the HEPD-02 tracking system onboard CSES-02 satellite",
    "abstract": "The High Energy Particle Detector (HEPD-02) is a payload of the second China Seismo-Electromagnetic Satellite (CSES-02), designed and built by the Italian Limadou collaboration. Its purpose is to detect cosmic rays and trapped particles of radiation belts, in the kinetic energy range 3-100 MeV for electrons, 30-200 MeV for protons. HEPD-02 is the first space detector to use a tracking detector based on Monolithic Active Pixel Sensors (MAPS). The MAPS provides high spatial resolution, low noise, increased robustness, and low production costs. Operating MAPS in space presents a significant challenge due to strict power consumption requirements. To meet such constraints, a custom Tracker Data Acquisition (TDAQ) board and firmware have been designed and implemented, by using a commercial low-power Field Programmable Gate Array (FPGA). This paper addresses the design features of the TDAQ unit, enabling the tracking detector to be operated efficiently, with particular focus on the power consumption performance.",
    "authors": [
      "S. Bartocci",
      "R. Battiston",
      "S. Beolè",
      "F. Benotto",
      "P. Cipollone",
      "S. Coli",
      "A. Contin",
      "M. Cristoforetti",
      "C. De Donato",
      "C. De Santis",
      "A. Di Luca",
      "F. Dumitrache",
      "F. M. Follega",
      "S. Garrafa Botta",
      "G. Gebbia",
      "R. Iuppa",
      "A. Lega",
      "M. Lolli",
      "G. Masciantonio",
      "M. Mergè",
      "M. Mese",
      "R. Nicolaidis",
      "F. Nozzoli",
      "A. Oliva",
      "G. Osteria",
      "F. Palma",
      "F. Palmonari",
      "B. Panico",
      "S. Perciballi",
      "F. Perfetto",
      "P. Picozza",
      "M. Pozzato",
      "E. Ricci",
      "M. Ricci",
      "S. B. Ricciarini",
      "Z. Sahnoun",
      "U. Savino",
      "V. Scotti",
      "E. Serra",
      "A. Sotgiu",
      "R. Sparvoli",
      "P. Ubertini",
      "V. Vilona",
      "S. Zoffoli",
      "P. Zuccon"
    ],
    "published": "2025-12-29T22:22:39Z",
    "updated": "2025-12-29T22:22:39Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.23884v1",
    "url": "https://arxiv.org/abs/2512.23884v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23884v1.pdf",
    "title": "Autoregressive long-horizon prediction of plasma edge dynamics",
    "abstract": "Accurate modeling of scrape-off layer (SOL) and divertor-edge dynamics is vital for designing plasma-facing components in fusion devices. High-fidelity edge fluid/neutral codes such as SOLPS-ITER capture SOL physics with high accuracy, but their computational cost limits broad parameter scans and long transient studies. We present transformer-based, autoregressive surrogates for efficient prediction of 2D, time-dependent plasma edge state fields. Trained on SOLPS-ITER spatiotemporal data, the surrogates forecast electron temperature, electron density, and radiated power over extended horizons. We evaluate model variants trained with increasing autoregressive horizons (1-100 steps) on short- and long-horizon prediction tasks. Longer-horizon training systematically improves rollout stability and mitigates error accumulation, enabling stable predictions over hundreds to thousands of steps and reproducing key dynamical features such as the motion of high-radiation regions. Measured end-to-end wall-clock times show the surrogate is orders of magnitude faster than SOLPS-ITER, enabling rapid parameter exploration. Prediction accuracy degrades when the surrogate enters physical regimes not represented in the training dataset, motivating future work on data enrichment and physics-informed constraints. Overall, this approach provides a fast, accurate surrogate for computationally intensive plasma edge simulations, supporting rapid scenario exploration, control-oriented studies, and progress toward real-time applications in fusion devices.",
    "authors": [
      "Hunor Csala",
      "Sebastian De Pascuale",
      "Paul Laiu",
      "Jeremy Lore",
      "Jae-Sun Park",
      "Pei Zhang"
    ],
    "published": "2025-12-29T22:19:27Z",
    "updated": "2025-12-29T22:19:27Z",
    "categories": [
      "physics.plasm-ph",
      "cs.AI"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "1512.08282v3",
    "url": "https://arxiv.org/abs/1512.08282v3",
    "pdf_url": "https://arxiv.org/pdf/1512.08282v3.pdf",
    "title": "Positron Bunch Radiation in the System of Tightly Packed Nanotubes",
    "abstract": "Radiation emitted by a bunch of positrons channeled in nanotubes at zero emission angle is studied taking into account medium polarization. The formation of radiation is characterized by an energy threshold that depends on the oscillation amplitude of each positron. When the bunch energy reaches the maximum value of the threshold energy, radiation is produced by all positrons in the bunch. The nanotube potential barrier is described using a harmonic model. The spectral line shape of the radiation from the positron bunch, the fundamental radiation frequency, and the number of emitted photons are determined. It is shown that a system of tightly packed carbon nanotubes can generate an intense, quasi-monochromatic, and directed beam of circularly polarized soft X-ray photons with an energy of about $3$~\\SI{}{\\kilo\\electronvolt} (wavelength $4.1$~\\SI{}{\\angstrom}).",
    "authors": [
      "Hayk L. Gevorgyan",
      "Koryun L. Gevorgyan",
      "Lekdar A. Gevorgian"
    ],
    "published": "2015-12-27T21:54:18Z",
    "updated": "2025-12-29T19:22:19Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.23682v1",
    "url": "https://arxiv.org/abs/2512.23682v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23682v1.pdf",
    "title": "Predicting core transport in ITER baseline discharges with neon injections",
    "abstract": "Achieving self-consistent performance predictions for ITER requires integrated modeling of core transport and divertor power exhaust under realistic impurity conditions. We present results from the first systematic power-flow and impurity-content study for the ITER 15 MA baseline scenario constrained directly by existing SOLPS-ITER neon-seeded divertor solutions. Using the OMFIT STEP workflow, stationary temperature and density profiles are predicted with TGYRO for $1.5 \\le Z_{\\rm eff} \\le 2.5$, and the corresponding power crossing the separatrix $P_{\\rm sep}$ is evaluated. We find that $P_{\\rm sep}$ varies by more than a factor of 1.7 across this scan and matches the $\\sim 100$~MW SOLPS-ITER prediction when $Z_{\\rm eff} \\simeq 1.6$ or when auxiliary heating is reduced to $\\sim 75\\%$ of nominal. Rotation-sensitivity studies show that plausible variations in toroidal flow magnitude modify $P_{\\rm sep}$ by $\\lesssim 20\\%$, while AURORA modeling confirms that charge-exchange radiation inside the separatrix is dynamically negligible under predicted ITER neutral densities. These results identify a restricted compatibility window, $Z_{\\rm eff} \\approx 1.6$--1.75 and $0.75 \\lesssim f_{P_{\\rm aux}} \\le 1.0$, in which core transport predictions remain aligned with neon-seeded divertor protection targets. This self-consistent, model-constrained framework provides actionable guidance for impurity control and auxiliary-heating scheduling in early ITER operation and supports future whole-device scenario optimization.",
    "authors": [
      "Dmitri M Orlov",
      "Joseph McClenaghan",
      "Jeff Candy",
      "Jeremy D Lore",
      "Nathan T Howard",
      "Francesco Sciortino",
      "Christopher Holland"
    ],
    "published": "2025-12-29T18:40:00Z",
    "updated": "2025-12-29T18:40:00Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.23612v1",
    "url": "https://arxiv.org/abs/2512.23612v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23612v1.pdf",
    "title": "High-resolution 3D-printed plastic scintillators with tertiary dye",
    "abstract": "Additive manufacturing offers efficient production of plastic scintillators with nontrivial geometries using vat polymerization, allowing fabrication of geometries which would be difficult or even impossible to produce using conventional subtractive manufacturing. This work presents a novel photocurable scintillator formula that includes coumarin 450 as a tertiary dye to enable high-resolution 3D printing via the manipulation of the 405 nm cure light. Bulk photocured and 3D printed (with and without tertiary dye) samples were compared through observational assessment and spectral response. All samples showed pulse shape discrimination between neutron and gamma events. Inclusion of the tertiary dye has minimal impact on emission spectrum and light output, but significant impact on print resolution as shown by comparison of printed high-complexity geometries and feature resolution test objects. With the use of a cure-limiting dye, unsupported features, such as freestanding pillars, were resolvable down to 0.7 mm. Even finer resolution at or below 0.1 mm was achieved in fully supported, integrated structures printed with off-the-shelf 405 nm desktop 3D printer. Scintillators demonstrated a light output up to 50% of EJ-200 with a PSD figure of merit up to 1.35 at 0.9-1.1 MeVee.",
    "authors": [
      "Chandler Moore",
      "Michael Febbraro",
      "Juan Manfredi",
      "Allen Wood",
      "Daniel Rutstrom",
      "Thomas Ruland",
      "Brennan Hackett",
      "Paul Hausladen"
    ],
    "published": "2025-12-29T17:13:25Z",
    "updated": "2025-12-29T17:13:25Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex",
      "physics.app-ph"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/10/P10043"
  },
  {
    "arxiv_id": "2512.23556v1",
    "url": "https://arxiv.org/abs/2512.23556v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23556v1.pdf",
    "title": "The new generation lunar gravitational wave detectors: sky map resolution and joint analysis",
    "abstract": "Lunar-based gravitational-wave interferometry is a fascinating endeavor, and was proposed as a promising approach to bridge the observational gap between space-borne and ground-based detectors. In this work, we adopt the Fisher-matrix method to examine the angular-resolution performance of the newly proposed Crater Interferometry Gravitational-wave Observatory (CIGO) on the lunar crater rim near the north pole, together with TianQin and LISA, for monochromatic sources in the 0.1-10 Hz band. We find that above 0.1 Hz, CIGO achieves better localization accuracy than the other two space-based missions and dominates the combined detector network's performance, provided that lunar noise mitigation is achieved in the 0.1-2.87 Hz frequency range. We further explore an upgraded Tetrahedron configuration, TCIGO, with a fourth station at the bottom of a crater, which forms a regular tetrahedral constellation on the lunar surface. The result shows that TCIGO yields a five-fold improvement in angular-resolution capability over CIGO and gets better sky coverage across the target frequency band.",
    "authors": [
      "Xiaolin Zhang",
      "Chengye Yu",
      "Haoran Li",
      "Sobhan Kazempour",
      "Mingqiu Li",
      "Sichun Sun"
    ],
    "published": "2025-12-29T15:52:13Z",
    "updated": "2025-12-29T15:52:13Z",
    "categories": [
      "gr-qc",
      "astro-ph.IM",
      "hep-ph",
      "physics.ins-det"
    ],
    "primary_category": "gr-qc"
  },
  {
    "arxiv_id": "2512.23554v1",
    "url": "https://arxiv.org/abs/2512.23554v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23554v1.pdf",
    "title": "An integrated quantitative single-objective light-sheet microscope for subcellular dynamics in embryos and cultured multicellular systems",
    "abstract": "Quantitative imaging of subcellular processes in living embryos, stem-cell systems, and organoid models requires microscopy platforms that combine high spatial resolution, fast volumetric acquisition, long-term stability, and minimal phototoxicity. Single-objective light-sheet approaches based on oblique plane microscopy (OPM) are well suited for live imaging in standard sample geometries, but most existing implementations lack the optical calibration, timing precision, and end-to-end integration required for reproducible quantitative measurements. Here we present a fully integrated and quantitatively characterized OPM platform engineered for dynamic studies of transcription and nuclear organization in embryos, embryonic stem cells, and three-dimensional culture systems. The system combines high numerical aperture remote refocusing with tilt-invariant light-sheet scanning and hardware-timed synchronization of laser excitation, galvo scanning, and camera readout. We provide a comprehensive characterization of the optical performance, including point spread function, sampling geometry, usable field of view, and system stability, establishing a well-defined framework for quantitative volumetric imaging. To support high-throughput operation, we developed a unified acquisition and reconstruction pipeline that enables real time volumetric imaging at hardware-limited rates while preserving deterministic timing and reproducible geometry. Using this platform, we demonstrate quantitative three-dimensional imaging of MS2-labeled transcription sites in living Drosophila embryos, cultured mouse embryonic stem cells, and mESC-derived gastruloids, enabling extraction of transcriptional intensity traces across diverse biological contexts. This work establishes OPM as a robust and quantitatively calibrated single-objective light-sheet platform for transcription imaging in complex living systems.",
    "authors": [
      "Armin Shoushtarizadeh",
      "Michele Cerminara",
      "Corinne Chureau",
      "Leah Friedman",
      "Deepthi Kailash",
      "Thomas Gregor"
    ],
    "published": "2025-12-29T15:50:51Z",
    "updated": "2025-12-29T15:50:51Z",
    "categories": [
      "q-bio.QM",
      "physics.bio-ph",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "q-bio.QM"
  },
  {
    "arxiv_id": "2512.23433v1",
    "url": "https://arxiv.org/abs/2512.23433v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23433v1.pdf",
    "title": "Ab initio recombination in the expanding ultracold plasmas",
    "abstract": "The efficiency of recombination is of crucial importance for the existence of ultracold plasmas, particularly, the ones formed in the magneto-optical traps. Unfortunately, a straightforward simulation of the recombination encounters the problem of huge difference in the spatial and temporal scales for free and bound motion of the electrons. As a result, only the \"virtual\" electron-ion pairs are usually reproduced in such simulations, and it is necessary to employ some additional criteria to identify them with the recombined atoms (this might be a minimal number of revolutions of the electron about the nearest ion or a maximal distance between them). It is the aim of this paper to present the first successful ab initio simulation of the recombination without any auxiliary assumptions. We employed a special algorithm, which was based on: (i) using the \"scalable\" reference frame, co-moving with the expanding plasma, (ii) dynamical choice of the number of \"mirror\" cells, taking into account in calculation of the Coulomb sums, and (iii) accurate treatment of the singular interparticle interactions, without any truncation or \"softening\" of the Coulomb forces. Then, the recombination events are identified by a series of sharp equidistant peaks in the kinetic and/or potential energies for a sample of particles, which are caused by the captured electrons passing near the pericenters of their orbits; and this is confirmed by a detailed inspection of the particle trajectories. Thereby, we were able to trace formation of the real - rather than \"virtual\" - electron-ion pairs. The total efficiency of recombination for the realistic experimental conditions was found to be about 20%, which is in perfect agreement both with the laboratory measurements and with the earlier semi-empirical simulations.",
    "authors": [
      "Yurii V. Dumin",
      "Ludmila M. Svirskaya"
    ],
    "published": "2025-12-29T12:51:53Z",
    "updated": "2025-12-29T12:51:53Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.23230v1",
    "url": "https://arxiv.org/abs/2512.23230v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23230v1.pdf",
    "title": "Axisymmetric magnetic field effects on hollow cathode generated plasma column in APPEL-device",
    "abstract": "An elongated plasma column has been successfully generated and sustained in a linear plasma device using a hollow cathode discharge in the presence of an axisymmetric magnetic field. The confinement of cold energetic electrons produced near the hollow cathode plays a crucial role in guiding the plasma along the device axis. Experimental diagnostics reveal a high concentration of energetic electrons in the peripheral region near the source, which progressively converge toward the axis at a downstream location approximately 3.0 meters from the cathode. The length of the plasma column exhibits an inverse relationship with the electron-neutral collision frequency, indicating the significance of collisional damping in the propagation of energetic electrons. These observations are further supported by fluid simulations performed using COMSOL Multiphysics, which qualitatively reproduce the experimental trends. The results are consistent with a theoretical model previously proposed by the authors, reinforcing the understanding of energetic electron behaviour in magnetically guided plasma columns.",
    "authors": [
      "Y. Patil",
      "S. K. Karkari"
    ],
    "published": "2025-12-29T06:15:40Z",
    "updated": "2025-12-29T06:15:40Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.23114v1",
    "url": "https://arxiv.org/abs/2512.23114v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23114v1.pdf",
    "title": "Breaking seed dormancy in Mediterranean Brassica rapa wild populations: is cold plasma treatment efficient?",
    "abstract": "Turnip (Brassica rapa) is a native species of the Mediterranean area, spread from northwest France to south Algeria. In this study, dormancy and germination traits were assessed for 61 wild Brassica rapa populations collected across the Mediterranean region. Seed dormancy is a key factor influencing germination and seedling establishment. Three dormancy-breaking methods were compared: gibberellic acid, scarification and cold plasma. The efficiency and selectivity were evaluated through germination ability, time to 10% germination (T10), mean germination time and greenhouse emergence. Five days after imbibition, germination was only 18% for the untreated seeds but 60% for the plasma-treated seeds. Germination also began 24 hours earlier and mean germination time was reduced across most populations. However, there was a limited effect on seedling emergence, which remained around 55% for both untreated and treated samples. Comparative analysis indicates that cold plasma was more effective in alleviating embryo dormancy. In addition, histological and scanning electron microscopy showed that the seed coat differed according to the geographical origin of the populations, with a deeper dormancy in seeds from Sicilian populations.",
    "authors": [
      "M. H. Wagner",
      "T. Dufour",
      "A. Geraci",
      "E. Oddo",
      "G. R. Tarantino",
      "F. Scafidi",
      "C. Bailly",
      "H. Hadj Arab",
      "B. Boucenna",
      "M. Tiret",
      "C. Falentin",
      "A. Dupont",
      "S. Ducournau",
      "A. M. Chèvre"
    ],
    "published": "2025-12-28T23:35:41Z",
    "updated": "2025-12-28T23:35:41Z",
    "categories": [
      "physics.plasm-ph",
      "physics.bio-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.15258/sst.2025.53.3.03"
  },
  {
    "arxiv_id": "2512.23034v1",
    "url": "https://arxiv.org/abs/2512.23034v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23034v1.pdf",
    "title": "Treatment of sunflower seeds by cold atmospheric plasma enhances their tolerance to water stress during germination and early seedling development",
    "abstract": "The aim of this study was to investigate the impact of ambient air plasma treatment on both sunflower seed germination and early steps of seedling development under water stress. Dry seeds were exposed to a cold atmospheric plasma (CAP) generated in a dielectric barrier device where excited molecular nitrogen and ozone were detected by optical emission spectroscopy and mass spectrometry respectively. Interestingly, we explain the crucial role of gap's accuracy when treating seeds with CAP, especially to improve interaction between seeds and plasma and therefore ensure an efficient treatment. CAP significantly improved the germination rates of seeds of dormant and non-dormant sunflower genotypes under water stress, demonstrating its efficiency in alleviating seed dormancy and in improving germination under suboptimal conditions. Furthermore, greenhouse experiments demonstrated that plasma treatment also stimulated seedling development under water stress conditions. These findings highlight the potential of CAP treatment as an effective approach to promote the whole process of emergence of crop species.",
    "authors": [
      "L. Taras",
      "C. Bailly",
      "T. Dufour"
    ],
    "published": "2025-12-28T18:23:39Z",
    "updated": "2025-12-28T18:23:39Z",
    "categories": [
      "physics.plasm-ph",
      "physics.bio-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1088/1361-6463/ae2ae6"
  },
  {
    "arxiv_id": "2509.14400v4",
    "url": "https://arxiv.org/abs/2509.14400v4",
    "pdf_url": "https://arxiv.org/pdf/2509.14400v4.pdf",
    "title": "Electron Inertia and Magnetic Reconnection",
    "abstract": "When electron inertia is the only non-ideal effect in the evolution of a magnetic field $\\vec{B}$, the field lines of $\\vec{B}$ reconnect, but the lines of a related field $\\vec{\\mathcal{B}}$ do not. $\\vec{\\mathcal{B}} \\equiv \\vec{B} + \\vec{\\nabla}\\times \\left( (c/ω_{pe})^2μ_0\\vec{j} \\right)$ with $ω_{pe}$ the plasma frequency and $\\vec{j}$ the current density. Although a full four-dimensional relativistic calculation of $\\vec{\\mathcal{B}}$ has been made, studies of $\\vec{\\mathcal{B}}$ have been focused on systems that depend on only two spatial coordinates. Three results are given: (1) A relatively simple demonstration in three dimensional space that the lines of $\\vec{\\mathcal{B}}$ do not reconnect when electron inertia is the only non-ideal effect. (2) The guiding center motion of charged particles is modified by a term that is proportional to $(c/ω_{pe})^2$, which is smaller than the drifts proportional to the gyroradius unless the current density is extremely large. (3) In three dimensional space, the evolution velocity of $\\vec{\\mathcal{B}}$ is characteristically chaotic, which means neighboring streamlines separate exponentially on a timescale $τ_u$. $\\vec{\\mathcal{B}}$ undergoes large scale reconnection on a timescale that is only an order of magnitude or two longer than $τ_u$ unless all diffusive non-ideal effects, such as resistivity, are absolutely zero.",
    "authors": [
      "Allen H Boozer"
    ],
    "published": "2025-09-17T20:02:37Z",
    "updated": "2025-12-28T17:01:45Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2503.03103v2",
    "url": "https://arxiv.org/abs/2503.03103v2",
    "pdf_url": "https://arxiv.org/pdf/2503.03103v2.pdf",
    "title": "Fast Jet Tagging with MLP-Mixers on FPGAs",
    "abstract": "We explore the innovative use of MLP-Mixer models for real-time jet tagging and establish their feasibility on resource-constrained hardware like FPGAs. MLP-Mixers excel in processing sequences of jet constituents, achieving state-of-the-art performance on datasets mimicking Large Hadron Collider conditions. By using advanced optimization techniques such as High-Granularity Quantization and Distributed Arithmetic, we achieve unprecedented efficiency. These models match or surpass the accuracy of previous architectures, reduce hardware resource usage by up to 97%, double the throughput, and half the latency. Additionally, non-permutation-invariant architectures enable smart feature prioritization and efficient FPGA deployment, setting a new benchmark for machine learning in real-time data processing at particle colliders.",
    "authors": [
      "Chang Sun",
      "Jennifer Ngadiuba",
      "Maurizio Pierini",
      "Maria Spiropulu"
    ],
    "published": "2025-03-05T01:37:47Z",
    "updated": "2025-12-28T15:01:25Z",
    "categories": [
      "physics.ins-det",
      "cs.LG"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/2632-2153/adf596"
  },
  {
    "arxiv_id": "2512.11290v2",
    "url": "https://arxiv.org/abs/2512.11290v2",
    "pdf_url": "https://arxiv.org/pdf/2512.11290v2.pdf",
    "title": "Charge transport and mode transition in dual-energy electron beam diodes",
    "abstract": "This Letter uncovers five distinct charge transport modes and their transitions in dual-energy electron beam diodes. We via first-principle particle-in-cell (PIC) simulations establish that the specific mode (e.g., space charge oscillations) and the current transport characteristics are essentially governed by the interplay between the electron beam energy and injected current density. A generalized analysis is conducted for n-component electron beams, and a theoretical piecewise function is for the transmitted current density proposed, which agrees well with the PIC results under designed conditions. The discovery provides a mechanistic picture of multiple electron beam transport in diodes, paving the way for novel designs of high-performance modern vacuum electronic devices.",
    "authors": [
      "Chubin Lin",
      "Jiandong Chen",
      "Huihui Wang",
      "Yangyang Fu"
    ],
    "published": "2025-12-12T05:34:30Z",
    "updated": "2025-12-28T11:58:32Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.22811v1",
    "url": "https://arxiv.org/abs/2512.22811v1",
    "pdf_url": "https://arxiv.org/pdf/2512.22811v1.pdf",
    "title": "Plastic inorganic Sn2BiS2I3 semiconductor enabled deformable and flexible electronic tongue for heavy metal detection",
    "abstract": "Deformable and flexible electronics have garnered significant attention due to their distinctive properties; however, their current applications are primarily limited to the thermoelectric domain. Expanding the range of these electronics and their application scope represents a pivotal trend in their development. In this work, a plastic inorganic semiconductor material, Sn2BiS2I3, with a band gap of 1.2 eV was synthesized and fabricated into a three-electrode flexible and portable electronic tongue capable of detecting heavy metal elements. The electronic tongue device exhibits exceptional linearity and demonstrates resistance against interference from impurity ions. The linear regression equation is expressed as Y=0.24+19.06X, yielding a linear coefficient of approximately 0.96, and the detectable limit stands at around 1.1 ppb, surpassing the 2.0 ppb limit of the ICP-AES instrument. Furthermore, mechanical testing reveals the favorable plasticity of Sn2BiS2I3, as evidenced by the absence of cracks during nanoindentation. The indentation hardness of Sn2BiS2I3 is approximately 1.67 GPa, slightly exceeding the hardness of Cu, which is 1.25 GPa. This study expands the repertoire of deformable and flexible electronics, offering a new and exceptional choice for biomimetic tongue sensor materials.",
    "authors": [
      "Qiao Wang",
      "Pengyue Zhao"
    ],
    "published": "2025-12-28T06:49:31Z",
    "updated": "2025-12-28T06:49:31Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2507.19436v3",
    "url": "https://arxiv.org/abs/2507.19436v3",
    "pdf_url": "https://arxiv.org/pdf/2507.19436v3.pdf",
    "title": "Unveiling the Velocity-Space Signature of Ion Cyclotron Damping Using Liouville Mapping",
    "abstract": "Ion cyclotron damping is a key mechanism for the dissipation of electromagnetic wave energy in weakly collisional plasmas. This study presents a combined approach using Liouville mapping and the field-particle correlation technique to investigate qualitatively and quantitatively the velocity-space signature of ion cyclotron damping. Liouville mapping offers a computationally efficient way to predict perturbations to the particle velocity distribution function using single-particle trajectories in prescribed electromagnetic fields. One may apply the field-particle correlation technique to these perturbed velocity distributions to reveal the unique velocity-space signatures of the secular energy transfer rate associated with specific wave-particle interactions. We validate this method by reproducing known Landau damping signatures for kinetic Alfvén waves, and then we apply this method to ion cyclotron waves where ion cyclotron damping dominates. The resulting velocity-space signature reveals distinct energization features of ion cyclotron damping : (i) a quadrupolar pattern in the perpendicular $(v_x, v_y)$ plane; and (ii) a localized energization near the $n = 1$ resonant velocity in gyrotropic $(v_\\parallel, v_\\perp)$ velocity-space. The quantitative patterns remain unchanged as the ion plasma beta $β_i$ is varied, ultimately showing minimal $v_\\perp$ dependence on $β_i$ of the velocity-space signature at the $n = 1$ resonant velocity. This work provides a systematic study of how the ion cyclotron damping signature varies with $β_i$, offering a practical foundation to identify ion cyclotron damping using kinetic simulation data or spacecraft data.",
    "authors": [
      "Rui Huang",
      "Gregory G. Howes"
    ],
    "published": "2025-07-25T17:07:15Z",
    "updated": "2025-12-28T01:22:17Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1063/5.0293700"
  },
  {
    "arxiv_id": "2512.22641v1",
    "url": "https://arxiv.org/abs/2512.22641v1",
    "pdf_url": "https://arxiv.org/pdf/2512.22641v1.pdf",
    "title": "Simultaneous measurement of surface topography and subsurface velocity field in free-surface turbulent flow",
    "abstract": "This work presents a novel combination of two well-established techniques: particle image velocimetry (PIV) and fringe projection profilometry (FPP). Despite seemingly conflicting requirements -- PIV requires a transparent fluid, while FPP requires an opaque surface to project onto -- both requirements are met by adding fluorescein disodium salt, a fluorescent dye, to the water. This dye strongly absorbs the blue light projected onto the surface for FPP while interacting weakly with the green laser light used for PIV, achieving simultaneous opacity and transparency depending on colour. However, this approach presents several challenges, which we are able to solve with a combination of optical filters on the projector and cameras. A series of validation experiments were performed to assess the accuracy of surface elevation measurements at various dye concentrations. The technique was then demonstrated for the case of a vortex street generated by a cylinder interacting with surface waves. Our results show that a dye concentration of 12\\,mg/L, although insufficient to make the water opaque to the projected light, yields a mean absolute error in surface elevation of only 20 micrometres.",
    "authors": [
      "Ali Semati",
      "Adharsh Shankaran",
      "Benjamin K. Smeltzer",
      "Eirik Æsøy",
      "R. Jason Hearst",
      "Simen Å. Ellingsen"
    ],
    "published": "2025-12-27T16:26:30Z",
    "updated": "2025-12-27T16:26:30Z",
    "categories": [
      "physics.flu-dyn",
      "physics.ins-det"
    ],
    "primary_category": "physics.flu-dyn"
  },
  {
    "arxiv_id": "2512.22632v1",
    "url": "https://arxiv.org/abs/2512.22632v1",
    "pdf_url": "https://arxiv.org/pdf/2512.22632v1.pdf",
    "title": "Stringent constraints on non-standard neutrino interactions using high-purity $ν_μ$ CC events in IceCube DeepCore",
    "abstract": "The neutral-current (NC) non-standard interactions (NSI) of neutrinos with fermions can modify the flavor oscillations of atmospheric neutrinos as they propagate through the Earth. We present constraints on the NC-NSI parameters $\\varepsilon_{μτ}$ and $\\varepsilon_{ττ}-\\varepsilon_{μμ}$ (one at a time) using a high-purity sample of $ν_μ$ charged-current (CC) atmospheric neutrino events collected by IceCube DeepCore over 7.5 years of livetime. These two parameters significantly affect the $ν_μ$ disappearance channel for which this golden event sample is optimized by the IceCube Collaboration. The best fit to this dataset is consistent with no NSI hypothesis, and we place the most stringent constraints to date: $-\\,0.0094 < \\varepsilon_{μτ} < 0.0079$ and $-\\,0.030 < \\varepsilon_{ττ}-\\varepsilon_{μμ} < 0.029$ at 90% confidence level.",
    "authors": [
      "J Krishnamoorthi",
      "Anil Kumar",
      "Sanjib Kumar Agarwalla"
    ],
    "published": "2025-12-27T16:09:04Z",
    "updated": "2025-12-27T16:09:04Z",
    "categories": [
      "hep-ph",
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2507.12495v2",
    "url": "https://arxiv.org/abs/2507.12495v2",
    "pdf_url": "https://arxiv.org/pdf/2507.12495v2.pdf",
    "title": "Assessing the economic benefits of space weather mitigation investment decisions: Evidence from Aotearoa New Zealand",
    "abstract": "Space weather events pose a growing threat to modern economies, yet their macroeconomic consequences still remain underexplored. This study presents the first dedicated economic assessment of geomagnetic storm impacts on Aotearoa New Zealand, quantifying potential gross domestic product (GDP) losses across seven conservative disruption and mitigation scenarios due to an extreme coronal mass ejection (CME). The primary focus is upon the damaging impacts of geomagnetically induced currents (GICs) on the electrical power transmission network. We support space weather mitigation investments decisions by providing a first-order approximation of their potential economic benefits, using best-in-class scientific models. In the absence of mitigation, a severe but realistic storm could result in up to NZ\\$8.36 billion in lost GDP, with more than half stemming from cascading supply chain effects. Yet, even less severe scenarios incur losses exceeding NZ\\$3 billion. Importantly, even with conservative impact estimates we find that research-led operational strategies, such as optimized switching and islanding, can avoid up to NZ\\$370 million in losses for as little as NZ\\$0.5 million in expenditure, delivering a benefit-cost ratio of 740 to 1. Equally, physical protections such as GIC blocking devices achieve benefit-cost returns up to 80 to 1, highlighting the strong case for investment in space weather mitigation. When also acknowledging additional unmodelled impacts, including multi-billion losses in capital equipment and long-term revenue, the economic rationale for pre-emptive mitigation becomes even more pertinent. Future research needs to integrate the modelling of capital and revenue losses for strategically important industrial facilities.",
    "authors": [
      "Edward J. Oughton",
      "Andrew Renton",
      "Daniel Mac Marnus",
      "Dennies Bor",
      "Craig J. Rodger"
    ],
    "published": "2025-07-15T21:01:40Z",
    "updated": "2025-12-27T15:46:56Z",
    "categories": [
      "physics.geo-ph",
      "eess.SY",
      "physics.plasm-ph",
      "physics.soc-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.geo-ph"
  },
  {
    "arxiv_id": "2512.22611v1",
    "url": "https://arxiv.org/abs/2512.22611v1",
    "pdf_url": "https://arxiv.org/pdf/2512.22611v1.pdf",
    "title": "Impact of fast ions on turbulent transport in high-\\b{eta} HL-2A scenarios",
    "abstract": "The fast-ion (FI) on turbulent transport is one of the key topics of magnetic confinement fusion. This work focus on the impact of FI pressure gradients on turbulence in a high-\\b{eta} plasma scenario using gyrokinetic simulations. Linear analyses reveal that FIs strongly stabilize ion temperature gradient (ITG) modes via the thermal-ion dilution, while their influence on trapped electron modes (TEMs) is minimal. At elevated FI pressure gradients, a transition to a FI-driven BAE (FI-BAE) regime occurs, as evidenced by mode structure and frequency alignment within the Alfvénic gap. Electron \\b{eta} scans further demonstrate the emergence of kinetic ballooning modes (KBMs) at higher \\b{eta}, whereas an ITG-TEM hybrid turbulence dominates near experimental \\b{eta} values. Nonlinear simulations show that moderate FI pressure suppresses transport via zonal flow (ZF) shear, whereas strong FI drive weakens ZFs and enhances transport by destabilizing FI-BAEs. These results highlight the dual role of FIs in regulating turbulence and offer insight into multiscale transport physics relevant for high-performance plasmas.",
    "authors": [
      "Jingchun Li",
      "Zhaoyang Lu",
      "Jianqiang Xu",
      "Wei Chen",
      "Jiaqi Dong",
      "Jingting Luo",
      "Yong Liu"
    ],
    "published": "2025-12-27T14:38:33Z",
    "updated": "2025-12-27T14:38:33Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.18425v3",
    "url": "https://arxiv.org/abs/2506.18425v3",
    "pdf_url": "https://arxiv.org/pdf/2506.18425v3.pdf",
    "title": "Spatial, Spectral and Temporal Response of High Intensity Laser Plasma Mirrors- Direct Observation of the Ponderomotive Push",
    "abstract": "Plasma-based optics have emerged as a powerful platform for manipulating and amplifying ultra-intense laser pulses. However, the inherently nonlinear and dynamic nature of plasma leads to significant spatial, spectral, and temporal modulations when driven at relativistic intensities. These modifications can dramatically alter the structure of the reflected laser pulses, posing challenges for their use in applications such as vacuum ultraviolet (VUV) and X-ray generation, as well as relativistic particle acceleration. Comprehensive, multidimensional diagnostics are essential to accurately characterize these so-called `plasma mirrors' (PMs). We present a direct, \\textit{in situ} measurement of the three-dimensional plasma surface evolution during femtosecond laser irradiation, achieved through simultaneous analysis of the wavefront, spectrum, and temporal profile of the reflected light. Our measurements reveal surface deformations on the order of a few hundred nanometers at relativistic intensities, in agreement with three-dimensional particle-in-cell (3D-PIC) simulations. Additionally, the PM induces substantial modifications to the pulse spectrum and temporal profile, introducing spatio-temporal couplings.",
    "authors": [
      "Sk Rakeeb",
      "Animesh Sharma",
      "Sagar Dam",
      "Ameya Parab",
      "Amit Lad",
      "Yash. M. Ved",
      "Amita Das",
      "G. Ravindra Kumar"
    ],
    "published": "2025-06-23T09:04:19Z",
    "updated": "2025-12-27T07:24:48Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.27239v3",
    "url": "https://arxiv.org/abs/2510.27239v3",
    "pdf_url": "https://arxiv.org/pdf/2510.27239v3.pdf",
    "title": "Synchronized Catastrophic Collapse and Extreme Intensity Amplification of Ultra-Intense Pulses in Near-Resonance Magnetized Plasma",
    "abstract": "Ultra-high field intensities are essential for developing high-energy-density physics and compact plasma accelerators, but they are essentially constrained by the limitations of focusing distance and nonlinear efficiency. We present a theoretical model for extreme laser energy concentration in under-dense plasma that shows a highly effective, magnetically supported pathway. We demonstrate a fundamental, nonlinear enhancement of the relativistic self-focusing (RSF) mechanism by adjusting an external magnetic field close to the cyclotron resonance (Ce=0.7). Over a remarkably short distance of 1.25 Rayleigh lengths, the pulse is driven into a catastrophic, coupled collapse by this magnetic enhancement. Significant temporal self-compression (0.60) and simultaneous spatial confinement (0.05) are the outcomes of the dynamics. Importantly, this combined confinement results in a localized peak intensity amplification factor greater than 103 compared to the initial state. This work offers a clear, practical blueprint for upcoming laser-plasma experiments and validates a reliable and compact technique for producing petawatt-scale power densities.",
    "authors": [
      "Sintu Kumar",
      "Pratibha Jaiswal",
      "Km. Shivani Bhardwaj",
      "Rajesh Kumar Rai"
    ],
    "published": "2025-10-31T07:07:06Z",
    "updated": "2025-12-27T05:02:59Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.14598v2",
    "url": "https://arxiv.org/abs/2512.14598v2",
    "pdf_url": "https://arxiv.org/pdf/2512.14598v2.pdf",
    "title": "Hybrid Machine-Learning Particle Identification for the ePIC Proximity-Focusing RICH",
    "abstract": "We present a machine-learning-based particle-identification study for the proximity-focusing Ring Imaging Cherenkov (pfRICH) detector of the ePIC experiment at the Electron-Ion Collider. Operating in the backward region ($-3.5 \\lesssim η\\lesssim -1.5$), the pfRICH is designed to achieve at least $3σ$ separation among pions, kaons, and protons up to $7,\\mathrm{GeV}/c$ for Semi-Inclusive Deep Inelastic Scattering measurements. Using a standalone Geant4 simulation of the pfRICH, we develop a hybrid machine-learning approach that combines convolutional neural-network-based feature extraction with gradient-boosted decision-tree classifiers. This method significantly enhances Cherenkov-ring pattern recognition and improves particle-separation performance, demonstrating the effectiveness of hybrid machine-learning techniques for next-generation Cherenkov detectors at the EIC.",
    "authors": [
      "D. H. Dongwi",
      "C. -J. Naïm",
      "L. Rhode",
      "A. Deshpande"
    ],
    "published": "2025-12-16T17:07:56Z",
    "updated": "2025-12-27T00:52:13Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.00959v2",
    "url": "https://arxiv.org/abs/2512.00959v2",
    "pdf_url": "https://arxiv.org/pdf/2512.00959v2.pdf",
    "title": "A Bidirectional Diode-Clamp Circuit Paradigm for Time-Resolved Measurement of Electrical Short-Circuits",
    "abstract": "Conventional electrical fault models, which rely on static thresholds and instantaneous trip mechanisms, fail to capture the time-evolving dynamics of real faults, creating vulnerabilities in modern power systems. This paper introduces a diode-clamp circuit architecture that reconceives short-circuits as governed, sustained processes and establishes a physics-consistent, measurement system. An Arduino-based data acquisition system recorded continuous fault evolution across multiple input voltages and durations. Multi-resolution sampling at 10ms, 50ms, and 100ms enabled high-fidelity capture of both transients and sustained-state dynamics. The clamped mechanism constrained the circuit to a bounded regime, enabling repeatable observation. Experiments yielded definitive, measurable minima and maxima for voltage, current, and resistance, empirically refuting the classical assumption of instantaneous, unbounded current. Newly introduced metrics quantify this performance: the Sustained-to-Capacitive Energy Ratio (SCER ~1.53x10^12) proves fault energy originates from sustained dynamics, not transient discharge. The Sustained Fault Efficiency (SFE>1) demonstrates that governed fault power can exceed nominal operating power. This work provides the first fully validated short-circuit quantification system, yielding empirical data for next-generation battery management, adaptive grid protection, and fault-tolerant electronics.",
    "authors": [
      "Alex Mwololo Kimuya",
      "Dickson Mwenda Kinyua"
    ],
    "published": "2025-11-30T16:21:19Z",
    "updated": "2025-12-27T00:13:31Z",
    "categories": [
      "eess.SY",
      "physics.ins-det"
    ],
    "primary_category": "eess.SY"
  },
  {
    "arxiv_id": "2512.18290v2",
    "url": "https://arxiv.org/abs/2512.18290v2",
    "pdf_url": "https://arxiv.org/pdf/2512.18290v2.pdf",
    "title": "Robust and scalable simulation-based inference for gravitational wave signals with gaps",
    "abstract": "The Laser Interferometer Space Antenna (LISA) data stream will inevitably contain gaps due to maintenance and environmental disturbances, introducing nonstationarities and spectral leakage that compromise standard frequency-domain likelihood evaluations. We present a scalable Simulation-Based Inference (SBI) framework capable of robust parameter estimation directly from gapped time-series data. We employ Flow Matching Posterior Estimation (FMPE) conditioned on a learned summary of the data, optimized through an end-to-end training strategy. To address the computational challenges of long-duration signals, we propose a dual-pathway summarizer architecture: a 1D Convolutional Neural Network (CNN) operating on the time domain for high precision, and a novel wavelet-based 2D CNN utilizing asymmetric, dilated kernels to achieve scalability for datasets spanning months. We demonstrate the efficacy of this framework on simulated Galactic Binary-like signals, showing that our joint training approach yields tighter, unbiased posteriors compared to two-stage reconstruction pipelines. Furthermore, we provide the first systematic comparison showing that FMPE offers superior stability and coverage calibration over conventional Normalizing Flows in the presence of severe data artifacts.",
    "authors": [
      "Ruiting Mao",
      "Jeong Eun Lee",
      "Matthew C. Edwards"
    ],
    "published": "2025-12-20T09:30:10Z",
    "updated": "2025-12-26T21:06:49Z",
    "categories": [
      "astro-ph.IM",
      "gr-qc",
      "physics.data-an",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2512.22355v1",
    "url": "https://arxiv.org/abs/2512.22355v1",
    "pdf_url": "https://arxiv.org/pdf/2512.22355v1.pdf",
    "title": "On the accessibility of stable reactor operating regimes in quasi-symmetric stellarators",
    "abstract": "Maximising particle and energy confinement is crucial for achieving the sustained burning plasma conditions necessary to realise fusion energy. For stellarator reactors, one proposed strategy for avoiding destructive instabilities is to operate at high-field but low(er) plasma pressure. In this work, we investigate the accessibility of such a reactor-relevant low-beta regime in a reactor-scale quasi-axisymmetric stellarator using state-of-the-art high-fidelity macro- and microscopic simulation tools. We consider a configuration with a flattened core pressure profile and favourable properties from the macroscopic and neoclassical perspectives. By contrast, linear and nonlinear calculations with the GENE code show an abrupt transition to a regime of highly deleterious transport at low (local) plasma beta. We describe the characterisation of these transport regimes as well as the confinement transition. We discuss the implications broadly for stellarator optimisation and highlight the impact on quasi-symmetric stellarator design strategies.",
    "authors": [
      "Adelle M. Wright",
      "Benjamin J. Faber"
    ],
    "published": "2025-12-26T19:34:20Z",
    "updated": "2025-12-26T19:34:20Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  }
]