{
  "arxiv_id": "2509.15425v2",
  "url": "https://arxiv.org/abs/2509.15425v2",
  "pdf_url": "https://arxiv.org/pdf/2509.15425v2.pdf",
  "title": "Structure-preserving long-time simulations of turbulence in magnetized ideal fluids",
  "abstract": "We address three two-dimensional magnetohydrodynamics models: reduced magnetohydrodynamics (RMHD), Hazeltine's model, and the Charney--Hasegawa--Mima (CHM) equation. These models are derived to capture the basic features of magnetohydrodynamic turbulence and plasma behaviour. They all possess non-canonical Hamiltonian formulations in terms of Lie--Poisson brackets, which imply an infinite number of conservation laws along with symplecticity of the phase flow. This geometric structure in phase space affects the statistical long-time behaviour. Therefore, to capture the qualitative features in long-time numerical simulations, it is critical to use a discretization that preserves the rich phase space geometry. Here, we use the matrix hydrodynamics approach to achieve structure-preserving discretizations for each model. We furthermore carry out long-time simulations with randomized initial data and a comparison between the models. The study shows consistent behaviour for the magnetic potential: both RMHD and Hazeltine's model produce magnetic dipoles (in CHM, the magnetic potential is prescribed). These results suggest an inverse cascade of magnetic energy and of the mean-square magnetic potential, which is empirically verified via spectral scaling diagrams. On the other hand, the vorticity field dynamics differs between the models: RMHD forms sharp vortex filaments with rapidly growing vorticity values, whereas Hazeltine's model and CHM show only small variation in the vorticity values. Related to this observation, both Hazeltine's model and CHM give spectral scaling diagrams indicating an inverse cascade of kinetic energy not present in RMHD.",
  "authors": [
    "Klas Modin",
    "Michael Roop"
  ],
  "published": "2025-09-18T21:04:46Z",
  "updated": "2026-02-10T13:03:00Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}