{
  "arxiv_id": "2512.01618v2",
  "url": "https://arxiv.org/abs/2512.01618v2",
  "pdf_url": "https://arxiv.org/pdf/2512.01618v2.pdf",
  "title": "Effects of Turbulent Energy Exchange between Electrons and Ions on Global Temperature Profiles",
  "abstract": "Microscale turbulence drives not only particle and heat transport but also energy exchange between different particle species. Previous local gyrokinetic studies have shown that turbulent energy exchange can exceed collisional exchange in weakly collisional plasmas, and that ion temperature gradient (ITG) turbulence may hinder ion heating by alpha-heated electrons. In addition, it has been clarified that trapped electron mode (TEM) turbulence transfers energy from electrons to ions, thereby enhancing ion heating. In this work, we extend these studies by examining the impact of turbulent energy exchange on the global temperature profiles at a steady state using the one-dimensional transport solver GOTRESS. For the case of DIII-D discharge 128913 [A. E. White et al., Phys. Plasmas 15, 056116 (2008)], turbulent energy exchange has minimal influence on temperature profiles. However, in the case of enhanced electron heating in a DIIID like tokamak plasma, energy transfer from hot electrons to cold ions driven by TEM turbulence becomes comparable to, or even exceeds, the collisional contribution, leading to a significant increase in the ion temperature profile. For ITER Baseline and SPARC standard H-mode scenarios [N.T. Howard et al., Nucl. Fusion 65, 016002(2024), P. Rodriguez Fernandez et al., J. Plasma Phys. 86, 865860503(2020)], the turbulent energy exchange is largely compensated by the collisional one, producing only small effects. These results indicate that the impact of turbulent energy exchange on the global temperature profiles in steady state conditions of future fusion reactor scenarios is expected to be negligibly small, although it can become significant in situations such as plasma start up phases, where the heating power is strongly unbalanced between electrons and ions.",
  "authors": [
    "T. Kato",
    "H. Sugama",
    "M. Honda"
  ],
  "published": "2025-12-01T12:38:36Z",
  "updated": "2026-02-09T02:08:57Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}