{
  "arxiv_id": "2602.06235v1",
  "url": "https://arxiv.org/abs/2602.06235v1",
  "pdf_url": "https://arxiv.org/pdf/2602.06235v1.pdf",
  "title": "Enhanced TNSA Ion Acceleration via Optical Confinement and Geometric Plasma Focusing in Annular Sector Targets",
  "abstract": "Enhancing the conversion efficiency and maximum energy of laser-driven ion beams is a critical challenge for applications in hadron therapy and high-energy density physics. In this work, we present a comprehensive two-dimensional Particle-In-Cell (PIC) simulation study comparing Target Normal Sheath Acceleration (TNSA) from standard flat foils and novel annular sector (C-shaped) targets. Under identical ultra-intense laser irradiation (a0=10, tau=25 fs), the annular sector geometry demonstrates a substantial enhancement in acceleration performance driven by two synergistic mechanisms: electromagnetic cavity confinement and geometric plasma focusing. Our analysis reveals that the target void acts as an optical trap, sustaining oscillating electromagnetic fields for over 300fs via multiple internal reflections. This confinement results in a total laser energy absorption of 49% (compared to 16% for flat targets), which yields a peak electron temperature of 5.1 MeV more than double the 2.2MeV observed in flat targets. Furthermore, phase space diagnostics confirm that ion bunches accelerated from the converging cavity walls superimpose at the geometric center, creating a localized high-density focal spot. Consequently, the annular target increases the proton cut-off energy to 22MeV (vs. 12MeV for flat targets) and boosts Carbon ion energies beyond 60MeV. These findings establish that tailoring target curvature to exploit optical trapping and geometric focusing offers a robust pathway for developing compact, high-efficiency laser-ion sources.",
  "authors": [
    "Mohammad Rezaei-Pandari",
    "Mahdi Shayganmanesh",
    "Mohammad Hossein Mahdieh"
  ],
  "published": "2026-02-05T22:25:18Z",
  "updated": "2026-02-05T22:25:18Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}