{
  "arxiv_id": "2602.07664v1",
  "url": "https://arxiv.org/abs/2602.07664v1",
  "pdf_url": "https://arxiv.org/pdf/2602.07664v1.pdf",
  "title": "Assessing the impact of Open Research Information Infrastructures using NLP driven full-text Scientometrics: A case study of the LXCat open-access platform",
  "abstract": "Open research information (ORI) play a central role in shaping how scientific knowledge is produced, disseminated, validated, and reused across the research lifecycle. While the visibility of such ORI infrastructures is often assessed through citation-based metrics, in this study, we present a full-text, natural language processing (NLP) driven scientometric framework to systematically quantify the impact of ORI infrastructures beyond citation counts, using the LXCat platform for low temperature plasma (LTP) research as a representative case study. The modeling of LTPs and interpretation of LTP experiments rely heavily on accurate data, much of which is hosted on LXCat, a community-driven, open-access platform central to the LTP research ecosystem. To investigate the scholarly impact of the LXCat platform over the past decade, we analyzed a curated corpus of full-text research articles citing three foundational LXCat publications. We present a comprehensive pipeline that integrates chemical entity recognition, dataset and solver mention extraction, affiliation based geographic mapping and topic modeling to extract fine-grained patterns of data usage that reflect implicit research priorities, data practices, differential reliance on specific databases, evolving modes of data reuse and coupling within scientific workflows, and thematic evolution. Importantly, our proposed methodology is domain-agnostic and transferable to other ORI contexts, and highlights the utility of NLP in quantifying the role of scientific data infrastructures and offers a data-driven reflection on how open-access platforms like LXCat contribute to shaping research directions. This work presents a scalable scientometric framework that has the potential to support evidence based evaluation of ORI platforms and to inform infrastructure design, governance, sustainability, and policy for future development.",
  "authors": [
    "Kalp Pandya",
    "Khushi Shah",
    "Nirmal Shah",
    "Nakshi Shah",
    "Bhaskar Chaudhury"
  ],
  "published": "2026-02-07T19:15:40Z",
  "updated": "2026-02-07T19:15:40Z",
  "categories": [
    "physics.plasm-ph",
    "cs.DL",
    "cs.IR"
  ],
  "primary_category": "physics.plasm-ph"
}