{
  "arxiv_id": "2602.05282v1",
  "url": "https://arxiv.org/abs/2602.05282v1",
  "pdf_url": "https://arxiv.org/pdf/2602.05282v1.pdf",
  "title": "First Detailed MeerKAT Imaging Spectroscopy of a Solar Flare",
  "abstract": "Radio observations provide powerful diagnostics of energy release, particle acceleration, and transport processes in solar flares. However, despite recent progress in radio interferometric imaging spectroscopy, current instruments still face limitations in image fidelity and resolution, restricting detailed spectroscopic studies of flaring regions. Here we present high-fidelity imaging spectroscopy of a M1.3 GOES class flare with MeerKAT, a precursor to the future-generation array SKA-Mid. Radio emissions at the observed frequencies typically originate in the low corona, offering valuable insights into magnetic reconnection and primary energy-release sites. The obtained images achieve an unprecedented dynamic range exceeding 10^3, enabling simultaneous analysis of bright coherent bursts and faint incoherent emission from the active region. Multiple spatially distinct coherent sources are identified, implying contributions from different populations of accelerated electrons. The incoherent emission extends beyond AIA structures, highlighting MeerKAT's ability to detect dilute but hot plasma invisible to Extreme Ultraviolet instruments. Combined with co-temporal Hard X-ray images and magnetic field extrapolations, the radio sources are located within distinct magnetic structures, further revealing their association with different populations of accelerated electrons. These results demonstrate MeerKAT imaging spectroscopy as powerful diagnostics of solar flares and pave the way for future solar flare studies with SKA-Mid.",
  "authors": [
    "Yingjie Luo",
    "Eduard P. Kontar",
    "Roelf Du Toit Strauss",
    "Gert J. J. Botha",
    "Tomasz Mrozek",
    "Gelu M. Nita",
    "Sarah Buchner",
    "James O. Chibueze"
  ],
  "published": "2026-02-05T04:07:00Z",
  "updated": "2026-02-05T04:07:00Z",
  "categories": [
    "astro-ph.SR",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.SR"
}