{
  "arxiv_id": "2602.08806v1",
  "url": "https://arxiv.org/abs/2602.08806v1",
  "pdf_url": "https://arxiv.org/pdf/2602.08806v1.pdf",
  "title": "Two-Dimensional Kelvin-Helmholtz Instability with Anisotropic Pressure",
  "abstract": "The Kelvin-Helmholtz (KH) instability occurs in multiple heliospheric (solar-wind stream interfaces, planetary magnetospheres, cometary tails, heliopause flanks) and interstellar (protoplanetary disks, relativistic jets, neutron star accretion disks) environments. While the KH instability has been well-studied in the magnetohydrodynamic (MHD) limit, only limited studies were performed in the collisionless regime, which is conducive to development of anisotropic pressures. Collisionless plasmas are often described using the Chew Goldberger and Low (CGL) equations which feature an anisotropic pressure tensor. This paper presents a comprehensive analysis of the CGL version of the KH instability using linearised and numerical techniques. We find that the largest growth rates and the greatest incidence of magnetic effects occur in the MHD limit. In the large relaxation time CGL limit, part of the energy goes into the formation of pressure anisotropies, resulting in smaller amounts of energy being available for bending the field lines. Consequently, when we cross-compare CGL and MHD simulations that are otherwise identical, the current densities are largest in the MHD limit, and the largest magnetic islands also form in that limit. Early and late time formation of pressure anisotropies have also been studied. We also find that the strongest trend for forming intermittencies in the flow also occurs in the MHD limit. The paper also discusses possible consequences of our results for turbulence and reconnection in the heliosheath (the layer between the solar wind termination shock and the heliopause).",
  "authors": [
    "Shishir Biswas",
    "Masaru Nakanotani",
    "Dinshaw S. Balsara",
    "Vladimir Florinski",
    "Merav Opher"
  ],
  "published": "2026-02-09T15:45:01Z",
  "updated": "2026-02-09T15:45:01Z",
  "categories": [
    "astro-ph.SR",
    "astro-ph.EP",
    "physics.comp-ph",
    "physics.flu-dyn",
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.SR"
}