{
  "arxiv_id": "2602.08614v1",
  "url": "https://arxiv.org/abs/2602.08614v1",
  "pdf_url": "https://arxiv.org/pdf/2602.08614v1.pdf",
  "title": "JOREK simulations of the X-point radiator formation and its movement in ASDEX Upgrade",
  "abstract": "Future large-scale magnetic confinement fusion reactors require operational regimes that can avoid extreme heat fluxes onto the plasma-facing components. One promising regime is the X-point radiator (XPR), which relies on a highly radiative, cold and dense plasma volume forming above the X-point, and which can be accessed via impurity seeding. Experimentally, the height of the XPR can be controlled by adjusting the seeding rate and heating power. This contribution presents axisymmetric (2D) simulations of the XPR regime in ASDEX Upgrade using the nonlinear MHD code JOREK extended with a kinetic particle framework for the main species neutrals and nitrogen impurities. With the time-dependent simulations, the progression from attached divertors to a complete detachment with the XPR formation is shown, highlighting the effects of the neutrals and impurities separately. Amidst this progression, the formation and the loss of the high-field-side high-density are observed. After the XPR is well-formed at the height of 6.8 cm, the fuelling and seeding rates are adjusted so that the XPR remains stationary. From the stationary case, the seeding rate is then changed to see how the XPR location reacts. By increasing and decreasing the seeding rate, the XPR responds by moving upwards and downwards, respectively. These simulations show JOREK's capability of simulating time-varying XPR, which will provide a baseline for the transition to 3D simulations, so the MHD activities and their interaction with the XPR can be studied.",
  "authors": [
    "Y. C. Liang",
    "A. Cathey",
    "M. Hoelzl",
    "S. Q. Korving",
    "M. Szucs",
    "O. Pan",
    "D. Maris",
    "F. Antlitz",
    "the JOREK Team",
    "the ASDEX Upgrade Team"
  ],
  "published": "2026-02-09T12:59:22Z",
  "updated": "2026-02-09T12:59:22Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}