{
  "arxiv_id": "2510.14343v1",
  "url": "https://arxiv.org/abs/2510.14343v1",
  "pdf_url": "https://arxiv.org/pdf/2510.14343v1.pdf",
  "title": "Beam-commissioning-oriented optics study of HFRS Phase-I based on   measured magnetic field data",
  "abstract": "The construction of the first phase of the High energy FRagment Separator (HFRS Phase-I) has already been completed and it is anticipated to start beam commissioning in autumn 2025. This paper presents the first order and higher order beam optics calculations for the HFRS Phase-I, using measured magnet data, and evaluates its experimental performance in preparation for beam commissioning. The first order optics of HFRS is calculated based on the sliced magnetic fields and the higher order aberrations are corrected using a self-compiled program. Monte Carlo particle tracking is employed to analyze the beam phase spaces on the focal planes. The experimental performance of the machine is evaluated through Monte Carlo simulations. The beam phase spaces on the focal planes are thoroughly examined, demonstrating that the higher order aberrations have been well corrected. Moreover, the experimental performance of HFRS is evaluated based on the corrected higher order optics, yielding satisfactory results: the secondary beams of interest can be well separated and exhibit high transmission efficiency. This work provides valuable insights for the upcoming beam commissioning of HFRS Phase-I. The effective correction of higher order aberrations and optimized magnet settings lay a solid foundation for future experiments.",
  "authors": [
    "Ke Wang",
    "Li-Na Sheng",
    "Xue-Heng Zhang",
    "Bei-Min Wu",
    "Ming-Bang Lü",
    "Dong-Sheng Ni",
    "Jing Yang",
    "Xiang Zhang",
    "Fu-Qiang Liu",
    "Qing-Gao Yao",
    "Xiao-Wei Xu",
    "Ya-Jun Zheng",
    "Guo-Dong Shen",
    "Geng Wang",
    "You-Jin Yuan",
    "Jian-Cheng Yang",
    "Liang Lu"
  ],
  "published": "2025-10-16T06:28:42Z",
  "updated": "2025-10-16T06:28:42Z",
  "categories": [
    "physics.acc-ph"
  ],
  "primary_category": "physics.acc-ph"
}