{
  "arxiv_id": "2510.14437v1",
  "url": "https://arxiv.org/abs/2510.14437v1",
  "pdf_url": "https://arxiv.org/pdf/2510.14437v1.pdf",
  "title": "Evaluating plastic scintillator performance as a substitute of LYSO in   SiPM based animal PET scanners: A GEANT4 simulation analysis",
  "abstract": "A systematic study is conducted to understand the coincident resolving time (CRT) for a pair of Lutetium-yttrium oxyorthosilicate (LYSO) and the plastic scintillation detector bars under the Geant4 framework. Crystals are coupled to a silicon photomultiplier single pad wafer with an appropriate optical coupling for signal readout. Pad reads the light photons undergoing optoelectronic conversion at the wafer site and generates electrical pulses with a bi-exponential shape. These signals are used to determine the trigger time stamp of back-to-back gamma-rays emitted from a point source, enabling the evaluation of CRT performance at different plastic scintillator lengths. For the LYSO detector, the simulation yields the CRT response of 174 ps, which aligns to the literature reported value for the dimensions 2 mm x 2 mm x 10 mm. To identify the plastic scintillator dimensions with an integrated gamma-ray detection efficiency comparable to LYSO's photopeak efficiency at 511 keV gamma photons, various bar lengths of commercial plastic BC404 and TIFR Ooty's in-house developed plastic material are attempted in Geant4. Consequently, for both the plastic scintillators, the equivalent length (for the same cross-sectional area) was found to be 4 times that of LYSO crystal length at a threshold of 25 keV. CRT value determined for this dimension is found to be $\\approx$ 300 ps for both the plastic medium. It suggests that, if an animal preclinical PET scanner is developed with plastic bars, the minimum achievable image resolution (FWHM) of $\\approx$ 4.5 cm can be expected for a pair of detection elements.",
  "authors": [
    "Davinder Siwal",
    "P. K. Mohanty",
    "D. Bose",
    "A. Jain"
  ],
  "published": "2025-10-16T08:37:30Z",
  "updated": "2025-10-16T08:37:30Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}