{
  "arxiv_id": "2512.19495v1",
  "url": "https://arxiv.org/abs/2512.19495v1",
  "pdf_url": "https://arxiv.org/pdf/2512.19495v1.pdf",
  "title": "Time-domain anode-decoupling co-design for a floating MCP TOF-MS readout",
  "abstract": "We present a microchannel plate detector for compact time-of-flight mass spectrometers (TOF-MS) that jointly optimizes the anode geometry and high-voltage AC-decoupling network for electrically floating operation. Undershoot-driven baseline artifacts and pulse broadening are addressed by a time-domain co-design of the anode geometry and decoupling network. The design is validated through a staged workflow that combines full-wave electromagnetic simulations, vector network analyzer measurements, circuit-level transient models, and end-to-end mass spectra. The resulting planar circular patch anode with anode-proximal decoupling confines fields, preserves peak amplitude, and suppresses post-pulse energy, leading to fast settling and minimal baseline wander. We show that the effective high-pass corner set by the decoupling capacitance directly governs undershoot decay and baseline recovery. Measurements in a representative TOF-MS test setup demonstrate waveguide-level pulse fidelity at a fraction of the mass and volume of heritage waveguide-based detectors, with residual ripples in the measured response originating from downstream cable and digitizer terminations rather than the detector itself. By limiting detector-induced temporal broadening and inter-peak baseline coupling, the design supports high mass resolution and dynamic range in miniaturized TOF-MS architectures. Variants of this planar flight-ready architecture are being implemented in several next-generation spaceborne TOF-MS instruments currently under development at the University of Bern.",
  "authors": [
    "Robin F. Bonny",
    "Lorenzo Obersnel",
    "Martin Rubin",
    "André Galli",
    "Peter Wurz",
    "Rico G. Fausch"
  ],
  "published": "2025-12-22T15:49:49Z",
  "updated": "2025-12-22T15:49:49Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}