{
  "arxiv_id": "2510.07144v2",
  "url": "https://arxiv.org/abs/2510.07144v2",
  "pdf_url": "https://arxiv.org/pdf/2510.07144v2.pdf",
  "title": "Chaotic Motion of Ions In Finite-amplitude Low-frequency Alfvén Waves",
  "abstract": "Finite-amplitude low-frequency Alfvén waves (AWs) are ubiquitous in space plasmas, where they play a key role in the transport and dissipation of energy, particularly in the heating of ions in the solar corona and solar wind. In this study, we investigate the nonlinear interaction between ions and obliquely propagating AWs. When the wave amplitude and propagation angle lie within specific ranges, ion motion becomes chaotic. We quantify this behavior using the maximum Lyapunov exponent ($λ_{\\mathrm{m}}$) and define a new parameter, the Chaos Ratio (CR), to describe the fraction of chaotic particles across different initial states. The global chaos threshold is determined as the contour CR = 0.01. Analysis of magnetic moment variations reveals that the physical origin of chaos is pitch-angle scattering induced by \\textit{wave-driven field-line curvature} (WFLC), which disrupts adiabatic invariance and leads to stochastic ion energization. The onset condition for chaos can be expressed by an effective relative curvature radius, $P_{eff.} < 25$. This analytical criterion delineates the boundary of the chaotic region in the ($k_x$, $k_z$, $B_w$) parameter space and agrees well with numerical results. The identified WFLC mechanism provides a new physical pathway for converting macroscale Alfvénic disturbances into microscopic ion heating. \\textbf{This analysis offers a simplified model that illustrates a plausible ion energization mechanism in Alfvénic turbulent plasmas}, including those associated with solar wind switchbacks and coronal fluctuations. These results highlight a universal chaotic process that may underlie stochastic heating in heliospheric and astrophysical plasmas.",
  "authors": [
    "Jingyu Peng",
    "Jiansen He",
    "Rong Lin"
  ],
  "published": "2025-10-08T15:45:40Z",
  "updated": "2026-02-21T07:04:35Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": "10.3847/1538-4357/ae3f1c"
}