{
  "arxiv_id": "2510.24780v2",
  "url": "https://arxiv.org/abs/2510.24780v2",
  "pdf_url": "https://arxiv.org/pdf/2510.24780v2.pdf",
  "title": "Optical design and sensitivity optimization of Cryogenic sub-Hz cROss torsion bar detector with quantum NOn-demolition Speed meter (CHRONOS)",
  "abstract": "We present the optical design and sensitivity modeling of the 2.5 m Cryogenic sub-Hz cROss torsion-bar detector with quantum NOn-demolition Speed meter (CHRONOS), a triangular Sagnac speed-meter interferometer incorporating power- and signal-recycling techniques. Using ABCD-matrix analysis and Finesse3 simulations, we show that stable eigenmodes are obtained with optimized mirror curvatures and focal placements, achieving mode-matching efficiencies above 99.5 %. The resulting configuration reaches a quantum-noise-limited strain sensitivity of $h \\simeq 3\\times10^{-18},\\mathrm{Hz^{-1/2}}$ at 1 Hz, with a ring-cavity finesse $\\mathcal{F}\\simeq3.1\\times10^{4}$ and round-trip Gouy phase $ψ_{\\mathrm{rt}}\\approx153^{\\circ}$. The power-recycling cavity detuning ($φ_p=-85^{\\circ}$) dominates the low-frequency quantum noise, while the signal-recycling cavity detuning ($φ_s=0^{\\circ}$) mainly introduces a uniform quadrature rotation. The optimal homodyne angle ($ζ_{\\mathrm{opt}}\\simeq46^{\\circ}$) balances shot-noise and radiation-pressure effects to give the best sensitivity near 1 Hz. Assuming end-mirror reflectivity $R_{\\mathrm{ETM}}=99.9999\\%$ under cryogenic operation at 10 K, CHRONOS can achieve quantum-noise-limited performance on a laboratory scale and serve as a testbed for future long-baseline, cryogenic interferometers probing sub-hertz gravitational waves.",
  "authors": [
    "Yuki Inoue",
    "Daiki Tanabe",
    "M. Afif Ismail",
    "Vivek Kumar",
    "Mario Juvenal S Onglao",
    "Ta-Chun Yu"
  ],
  "published": "2025-10-25T15:49:08Z",
  "updated": "2026-02-23T02:29:23Z",
  "categories": [
    "physics.ins-det",
    "astro-ph.CO",
    "astro-ph.IM",
    "gr-qc"
  ],
  "primary_category": "physics.ins-det"
}