{
  "arxiv_id": "2601.12622v2",
  "url": "https://arxiv.org/abs/2601.12622v2",
  "pdf_url": "https://arxiv.org/pdf/2601.12622v2.pdf",
  "title": "Direct in-chamber radon-220 (thoron) emanation measurements for rare-event physics experiments",
  "abstract": "Measuring radon emanation from detector materials is a key method for controlling radon, a significant background in rare-event physics experiments. Methods for measuring radon emanation are well-established but have predominantly focused on the 222Rn isotope, the dominant radon isotope for these backgrounds. However, measurements of 220Rn (thoron), the second most abundant radon isotope, remain relatively unexplored. 220Rn emanation measurements are challenging because the 220Rn must be transferred from the emanation chamber to the active detector within its short 55 s half-life. In this study, a direct in-chamber approach for measuring 220Rn emanation is presented in which the sample is placed directly within the active detector chamber, thereby minimising losses during transfer. The method was demonstrated with a DURRIDGE RAD8 electrostatic radon detector, which measured 220Rn emanation from low-activity thoriated rods with an activity of 76 +/- 20 mBq. Compared with a conventional flowthrough 220Rn emanation setup, the in-chamber method increased sensitivity by a factor of 3. Using helium as the carrier gas provided a further sensitivity increase, giving an overall sensitivity gain of ~5. These results indicate that in-chamber 220Rn emanation measurements provide an effective tool for low-background experiments and have the potential to accelerate radon studies by exploiting the shorter half-life of 220Rn.",
  "authors": [
    "R. R. Marcelo Gregorio",
    "F. Dastgiri",
    "A. Basharina-Freshville",
    "V. U. Bashu",
    "A. Cottle",
    "L. J. Bignell",
    "C. Ghag",
    "G. J. Lane",
    "A. G. McLean",
    "N. J. C. Spooner"
  ],
  "published": "2026-01-18T23:29:34Z",
  "updated": "2026-02-21T00:50:16Z",
  "categories": [
    "physics.ins-det",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det"
}