{
  "arxiv_id": "2601.12645v2",
  "url": "https://arxiv.org/abs/2601.12645v2",
  "pdf_url": "https://arxiv.org/pdf/2601.12645v2.pdf",
  "title": "Radio-frequency pulse design in local rotating frame in magnetic resonance imaging",
  "abstract": "The problem of spatially selective radio-frequency (RF) pulse design in magnetic resonance imaging (MRI) is typically stated in the form of determining, analytically or numerically, RF waveforms to be applied in synchrony with one or more predetermined gradient waveforms. In most cases, the dynamics of the nuclear spin magnetization under the RF and gradient fields is described in a global rotating frame that cancels the effect of the static (main) magnetic field B0. In this work, we consider an alternative frame of reference, which can be called a local rotating frame where total longitudinal magnetic field (B0 plus gradient) in every voxel is zero. In this frame, the effect of time-dependent gradient field is integrated out, and the remaining magnetization dynamics, governed by much weaker RF fields, becomes both simpler and slower. We show that recasting existing RF design methods in such a frame provides useful insights and techniques that are not obvious in the conventional description. The methods we consider include (i) two-dimensional spatial RF pulse design in the excitation k-space, (ii) Shinnar-Le Roux RF design, (iii) residual phase calculation in slice-selective excitation, and (iv) iterative and numerical solutions for multi-coil RF pulse design. In particular, we show that the new formalism can substantially reduce the Bloch simulation time which can greatly benefit iterative pulse designs in parallel transmit. In all, the proposed framework provides considerable theoretical insights and practical utility for RF pulse design in MRI.",
  "authors": [
    "Seung-Kyun Lee"
  ],
  "published": "2026-01-19T01:35:18Z",
  "updated": "2026-02-21T14:05:55Z",
  "categories": [
    "physics.ins-det",
    "physics.med-ph"
  ],
  "primary_category": "physics.ins-det"
}