{
  "arxiv_id": "2602.15946v2",
  "url": "https://arxiv.org/abs/2602.15946v2",
  "pdf_url": "https://arxiv.org/pdf/2602.15946v2.pdf",
  "title": "On-chip probabilistic inference for charged-particle tracking at the sensor edge",
  "abstract": "Modern scientific instruments operate under increasingly extreme constraints on bandwidth, latency, and power. Inference at the sensor edge determines experimental data collection efficiency by deciding which information to save for further analysis. Particle tracking detectors at the Large Hadron Collider exemplify this challenge: pixelated silicon sensors generate rich spatiotemporal ionization patterns, yet most of this information is discarded due to data-rate limitations. Concurrently, advancements in co-design tools provide rapid turn-around for incorporating machine learning into application-specific integrated circuits, motivating designs for particle detectors with new integrated technologies. We demonstrate that neural networks embedded in the front-end electronics can infer charged-particle kinematic parameters from a single silicon layer. We regress hit positions and incident angles with calibrated uncertainties, while satisfying stringent constraints on numerical precision, latency, and silicon area. Our results establish a path toward probabilistic inference directly at the edge, opening new opportunities for intelligent sensing in high-rate scientific instruments.",
  "authors": [
    "Arghya Ranjan Das",
    "David Jiang",
    "Rachel Kovach-Fuentes",
    "Shiqi Kuang",
    "Ana Sofía Calle Muñoz",
    "Danush Shekar",
    "Jennet Dickinson",
    "Giuseppe Di Guglielmo",
    "Lindsey Gray",
    "Mia Liu",
    "Corrinne Mills",
    "Mark S. Neubauer",
    "Daniel Abadjiev",
    "Anthony Badea",
    "Doug Berry",
    "Karri DiPetrillo",
    "Farah Fahim",
    "Abhijith Gandrakota",
    "Harshul Gupta",
    "James Hirschauer",
    "Eliza Howard",
    "Ron Lipton",
    "Petar Maksimovic",
    "Nick Manganelli",
    "Benjamin Parpillon",
    "Jannicke Pearkes",
    "Ricardo Silvestre",
    "Morris Swartz",
    "Chinar Syal",
    "Nhan Tran",
    "Amit Trivedi",
    "Keith Ulmer",
    "Mohammad Abrar Wadud",
    "Benjamin Weiss",
    "Eric You"
  ],
  "published": "2026-02-17T19:03:17Z",
  "updated": "2026-02-20T19:36:35Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}