{
  "arxiv_id": "2602.18974v1",
  "url": "https://arxiv.org/abs/2602.18974v1",
  "pdf_url": "https://arxiv.org/pdf/2602.18974v1.pdf",
  "title": "How Does The Magnetic Gradient Scale Length Influence Complexity of Filamentary Coils in Stellarators?",
  "abstract": "The distance between the last closed flux surface (LCFS) and the nearest electromagnetic coils is a dominating factor in the cost, size, and engineering difficulty of stellarators. The smallest magnetic gradient scale length on the LCFS - denoted L_gradB - has been shown to be a good proxy for minimum coil-surface distance in optimizations of a current potential on a winding surface, such as through the REGCOIL method. However, it has not been shown the same is true for filament coils, or that the magnetic gradient scale length is an effective objective function in optimization. In this paper, we explore examples in which min(L_gradB) is correlated with the minimum coil-surface distance for filament coils. First, we analyze a subset of the single-stage-optimized equilibria from the QUASR dataset [Giuliani et al. JPP (2024)]. We find that the majority of configurations have min(L_gradB) located nearby the point of closest coil-surface distance. Second, we optimize quasihelically symmetric equilibria to have improved min(L_gradB), and optimize coils via a continuation method. We then traced alpha particles to test confinement. Finally, we compare min(L_gradB) to the minimum coil-surface distance with filament coils optimized for a set of finite beta equilibria with random boundary shapes. For all datasets, we find that min(L_gradB) is correlated with both the minimum coil-surface and coil-coil distances if sufficient coil length is allowed. Even when there is a trade-off with proxies for confinement, optimizing for improved min(L_gradB) can result in better confinement in the presence of coils, up to a point. This is because - when holding coil-coil distance constant - equilibria with lower min(L_gradB) have a larger normal field error dominated by coil ripple causing particle loss. Both can be reduced by increasing coil-surface distance for equilibria with a high min(L_gradB).",
  "authors": [
    "John Kappel",
    "Matt Landreman",
    "Philipp Jurašić",
    "Sophia A Henneberg"
  ],
  "published": "2026-02-21T22:42:34Z",
  "updated": "2026-02-21T22:42:34Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}