{
  "arxiv_id": "2602.18706v1",
  "url": "https://arxiv.org/abs/2602.18706v1",
  "pdf_url": "https://arxiv.org/pdf/2602.18706v1.pdf",
  "title": "Fast reconnection in a coronal torn plasma sheet",
  "abstract": "Tearing instability, also known as plasmoid instability, is an effective mechanism to speed up magnetic reconnection process, working in a wide range of magnetized plasma systems with different spatial scales, ionization degrees, and collisionality. However, due to observational limitations, observations of {plasma sheet} tearing and the resulting plasmoids are rather scarce. This scarcity significantly hinders our understanding of the role of plasmoids in the reconnection process from an observational perspective. Using high-spatiotemporal multiwavelength observations from the Solar Dynamics Observatory, we traced the entire evolution of a coronal {plasma sheet}. Its formation was driven by the emergence of photospheric magnetic flux, followed by tearing, and eventual decay. The evolution of the {plasma sheet} exhibited two distinct stages. Initially, it rose rapidly, lengthened, and underwent tearing at a low frequency. Subsequently, its ascent slowed, it began to shorten, and the tearing occurred more frequently. Detailed analysis of the reconnecting {plasma sheet} focuses on heating, plasmoid dynamics (formation and ejection), and the resulting reconnection rate change. Two key heating processes are identified: {plasma sheet} tearing and coalescence involving plasmoids and magnetic cusps. More importantly, combining observations with analytical studies suggests that plasmoids are key carriers of magnetic flux fast transferring in the observed torn {plasma sheet}, and their formation and ejection significantly enhance the reconnection rate and facilitate the onset of fast reconnection.",
  "authors": [
    "Zehao Tang"
  ],
  "published": "2026-02-21T03:39:15Z",
  "updated": "2026-02-21T03:39:15Z",
  "categories": [
    "astro-ph.SR",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.SR"
}