{
  "arxiv_id": "2602.18544v1",
  "url": "https://arxiv.org/abs/2602.18544v1",
  "pdf_url": "https://arxiv.org/pdf/2602.18544v1.pdf",
  "title": "The Free-Electron Laser Model of Magnetospheric Chorus",
  "abstract": "Chorus waves are electromagnetic waves named for their resemblance to birds chirping at dawn when their radio frequencies are played as audio. The amplification of chorus in Earth's magnetosphere has been the subject of intense scientific inquiry since the discovery of the Van Allen radiation belts in 1958. Resonant interactions between chorus and radiation belt electrons can lead to the exponential growth of small seed waves by a factor of fifty within milliseconds. These powerful modes can cause rapid acceleration of electrons and endanger space-based technologies. Recent efforts to understand chorus amplification have drawn upon parallels to free-electron lasers, laboratory devices that generate intense coherent light with tunable frequencies. This approach, known as the free-electron laser model of magnetospheric chorus, is the subject of this dissertation. In this work, we build on previous research on the free-electron laser model, ultimately presenting a novel nonlinear model of whistler-mode chorus in the magnetosphere. In the first chapter, we provide a brief introduction to whistlers, magnetospheric chorus, and free-electron lasers. We also derive the 2N+2 equations foundational to the interaction of chorus with N resonant electrons. In the second chapter, we derive a reduced set of just three nonlinear equations using the method of collective variables. We then derive a Ginzburg-Landau equation (GLE) for the behavior of a chorus wave packet with a spectrum of frequencies with spatially varying amplitudes and discuss the prediction of solitary chorus waves. In the third chapter, we focus on the behavior of the single-mode solutions predicted by the GLE, including their linear stability and the phenomenon of mode condensation, where a single mode can emerge from a noisy spectrum. In the final chapter, we summarize the results and discuss open questions and future directions.",
  "authors": [
    "Brandon Bonham"
  ],
  "published": "2026-02-20T16:32:24Z",
  "updated": "2026-02-20T16:32:24Z",
  "categories": [
    "physics.space-ph",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.space-ph"
}