{
  "arxiv_id": "2602.20139v1",
  "url": "https://arxiv.org/abs/2602.20139v1",
  "pdf_url": "https://arxiv.org/pdf/2602.20139v1.pdf",
  "title": "Development of a Cherenkov-Based Time-of-Flight Detector Using Silicon Photomultipliers",
  "abstract": "The aim of this work is to develop high precision Time-of-Flight (TOF) devices based on high refractive index solid Cherenkov radiators read out by silicon photomultipliers (SiPMs). Cherenkov light is prompt and therefore ideal for reaching the intrinsic timing limits of TOF systems. By utilizing a thin, high-refractive-index radiator a nearly instantaneous signal is generated by particles exceeding the Cherenkov threshold. In order to achieve the ultimate time resolution, we carried out a rigorous optimization of the radiator material and geometry, alongside the efficiency of the optical coupling to the SiPM sensors. The key factors limiting the time resolution were characterized by comprehensive Monte Carlo simulations, subsequently validated against experimental beam test data. We assembled small-scale prototypes instrumented with various Hamamatsu SiPM arrays sensors with pitches ranging from 1.3 to 3 mm coupled with various window materials, such as fused silica and MgF2, featuring various thickness values. The prototypes were successfully tested in beam test campaigns at the CERN-PS T10 beam line. The data were collected with a complete chain of front-end and readout electronics based on either the Petiroc 2A or the Radioroc 2 interfaced to a picoTDC to measure charges and times. By comparing the time measurements with two SiPM arrays we were able to measure a time resolution better than 33.2 ps at the full system level with a charged particle detection efficiency of 100%. Our results demonstrate the expected performance benchmarks for the charged particle detection efficiency and time resolution and highlight the potential of the developed Cherenkov-based TOF detectors for next-generation particle identification systems.",
  "authors": [
    "Liliana Congedo",
    "Giuseppe De Robertis",
    "Antonio Di Mauro",
    "Mario Giliberti",
    "Francesco Licciulli",
    "Antonio Liguori",
    "Rocco Liotino",
    "Leonarda Lorusso",
    "Mario Nicola Mazziotta",
    "Eugenio Nappi",
    "Nicola Nicassio",
    "Giuliana Panzarini",
    "Roberta Pillera",
    "Giacomo Volpe"
  ],
  "published": "2026-02-23T18:49:57Z",
  "updated": "2026-02-23T18:49:57Z",
  "categories": [
    "physics.ins-det",
    "astro-ph.IM",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}