{
  "arxiv_id": "2602.19399v1",
  "url": "https://arxiv.org/abs/2602.19399v1",
  "pdf_url": "https://arxiv.org/pdf/2602.19399v1.pdf",
  "title": "Imaging the Superconducting Proximity Effect in S-S'-S Transition Edge Sensors",
  "abstract": "Proximity effects at superconducting interfaces, between different superconductors (S-S') or between superconductors and normal metals (S-N), are fundamental to the performance of superconducting electronics, yet only few experiments have directly probed the spatial structure of proximity effects within a device. This is particularly relevant for transition edge sensors (TESs), where the interplay of direct and inverse proximity effects governs detector sensitivity. Here, we use scanning superconducting interference device (SQUID) susceptometry to directly image the local diamagnetic response in functional S-S'-S TES structures. We resolve long range proximity coupling extending over tens of micrometers, revealing that the local transition temperature is dramatically tuned by neighboring regions, being either enhanced by superconducting (S) leads or suppressed by normal metal (N) contacts. Our observations are quantitatively supported by Ginzburg Landau modeling of the device geometry and calculations of the temperature dependent diamagnetism based on self-consistent Usadel equations. By providing spatially resolved measurements of the interplay of proximity effects in TES devices, this work establishes a framework for understanding and controlling superconducting states in heterogeneous superconducting structures.",
  "authors": [
    "Austin R. Kaczmarek",
    "Samantha Walker",
    "Jason Austermann",
    "Douglas Bennett",
    "W. Bertrand Doriese",
    "Shannon M. Duff",
    "Johannes Hubmayr",
    "Kelsey Morgan",
    "Michael D. Niemack",
    "Dan Schmidt",
    "Daniel Swetz",
    "Joel Ullom",
    "Joel Weber",
    "Katja C. Nowack"
  ],
  "published": "2026-02-23T00:18:20Z",
  "updated": "2026-02-23T00:18:20Z",
  "categories": [
    "cond-mat.supr-con",
    "physics.ins-det"
  ],
  "primary_category": "cond-mat.supr-con"
}