{
  "arxiv_id": "2602.20564v1",
  "url": "https://arxiv.org/abs/2602.20564v1",
  "pdf_url": "https://arxiv.org/pdf/2602.20564v1.pdf",
  "title": "Deuterium-Tritium Levitated Dipole Fusion Power Plants",
  "abstract": "Levitated dipole reactors offer an attractive path towards economic fusion power generation. The intrinsic decoupling of the confining magnetic field-generating REBCO magnets and the vacuum vessel offer unparalleled accessibility and maintainability, allowing for high plant duty factors and theoretically low electricity prices. In order to achieve rapid deployment of fusion power to the grid, the use of the Deuterium-Tritium (DT) fuel cycle is required due to its lower required plasma triple products. Historically, designs of levitated dipole fusion power plants have targeted advanced fuels as a DT device was seen to be infeasible due to the high fluxes of 14.1 MeV neutrons on the superconducting core magnet. This study presents high level designs for two feasible first-of-a-kind (FOAK) DT levitated dipole fusion power plants, the larger of which produces 667 MW of fusion power and is predicted to produce 208 MW of net electric power. Both designs consist of a heavily neutron-shielded, high-field REBCO core magnet capable of producing peak magnetic field strengths of 23 T while keeping peak mechanical strains below 0.4%. The neutron shielding is comprised of a layered structure of tungsten and boron carbide, which allows for 92% of the heat deposited in the neutron shield to be radiated out to the first wall while still providing sufficient neutron attenuation to give adequate REBCO conductor lifetimes. The core magnet REBCO coil is comprised of a small \"sacrificial\" section and a larger semi-permanent section. The sacrificial section, comprising ~20% of the coil, will have a neutron damage limited lifetime of ~1 year, after which the core magnet will be quickly removed from the vacuum vessel and replaced. This allows the damaged core magnet to be refurbished and reused, reducing cost and allowing for economic fusion power generation from a DT levitated dipole reactor.",
  "authors": [
    "T. Simpson",
    "R. A. Badcock",
    "T. Berry",
    "C. S. Chisholm",
    "P. J. Fimognari",
    "P. Fisher",
    "D. T. Garnier",
    "K. Lenagh-Glue",
    "B. Leuw",
    "R. Mataira",
    "L. Meadows",
    "T. McIntosh",
    "J. Poata",
    "K. Richardson",
    "B. Smith",
    "A. Simpson",
    "J. D. Tyler",
    "T. Wordsworth"
  ],
  "published": "2026-02-24T05:29:29Z",
  "updated": "2026-02-24T05:29:29Z",
  "categories": [
    "physics.plasm-ph",
    "physics.acc-ph"
  ],
  "primary_category": "physics.plasm-ph"
}