[
  {
    "arxiv_id": "2602.13060v2",
    "url": "https://arxiv.org/abs/2602.13060v2",
    "pdf_url": "https://arxiv.org/pdf/2602.13060v2.pdf",
    "title": "Quantitative imaging of Abrikosov vortices by scanning quantum magnetometry",
    "abstract": "Understanding vortex matter in type-II superconductors is central to controlling dissipation and flux pinning in superconducting materials and devices. Here, we use cryogenic scanning nitrogen vacancy magnetometry (NVM) to image Abrikosov vortices in the cuprate superconductors BSCCO-2212 and YBCO under controlled field-cooled conditions. Measurements, which are performed using continuous-wave optically detected magnetic resonance (cw-ODMR) in a closed-cycle cryostat, yield quantitative magnetic-field maps with nanoscale spatial resolution. In BSCCO-2212 at 71 K, we resolve a well-ordered triangular vortex lattice, whose symmetry and spacing are confirmed through 2D Fourier analysis and are consistent with flux quantization. YBCO thin films imaged at 3 K exhibit a more disordered vortex arrangement reflecting stronger pinning, while maintaining quantitative agreement between measured vortex density and the applied magnetic field. These results render our cryogenic scanning NVM a reliable quantitative tool for real-space studies of vortices in high-$T_c$ superconductors, in particular since such a remarkable magnetic resolution has been achieved within relatively short acquisition times of 2 to 4 h.",
    "authors": [
      "Clemens Schäfermeier",
      "Ankit Sharma",
      "Christopher Kelvin von Grundherr",
      "Dieter Andres",
      "Andrea Morales",
      "Jan Rhensius",
      "Gabriel Puebla-Hellmann",
      "Mirko Bacani"
    ],
    "published": "2026-02-13T16:15:48Z",
    "updated": "2026-02-24T14:46:46Z",
    "categories": [
      "cond-mat.supr-con",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "cond-mat.supr-con"
  },
  {
    "arxiv_id": "2504.18831v3",
    "url": "https://arxiv.org/abs/2504.18831v3",
    "pdf_url": "https://arxiv.org/pdf/2504.18831v3.pdf",
    "title": "Letter Of Intent for a future $μ^+ \\to \\mathrm{e}^+ γ$ experiment at the High Intensity Muon Beam facility at PSI",
    "abstract": "Searches for charged lepton flavor violation in the muon sector stand out among the most sensitive and clean probes for physics beyond the Standard Model. Currently, $μ^+ \\to \\mathrm{e}^+ γ$ experiments provide the best constraints in this field for a wide range of models while, in the coming years, new experiments investigating the processes of $μ^+ \\to \\mathrm{e}^+ \\mathrm{e}^+ \\mathrm{e}^-$ and $μ\\to \\mathrm{e}$ conversion in the nuclear field are anticipated to reach comparable or higher sensitivities. The High-Intensity Muon Beam (HIMB) facility at PSI, which is expected to deliver muon beam intensities up to two orders of magnitude higher than the existing beam lines, offers a unique opportunity to significantly enhance the sensitivity of $μ^+ \\to \\mathrm{e}^+ γ$ searches. The discovery potential could be substantially boosted and a sensitivity comparable to that of all the other projects could be reestablished, which is essential for discriminating among competing new-physics scenarios should an observation occur in any of the channels. In this document, we express our interest in developing a $μ^+ \\to \\mathrm{e}^+ γ$ experimental program at HIMB, with the goal of improving, within the next decade, the sensitivity of the $μ^+ \\to \\mathrm{e}^+ γ$ search by more than one order of magnitude relative to the expected final result of the current leading experiment, MEG II. This effort would ensure that PSI retains its leadership in this field.",
    "authors": [
      "Paolo Walter Cattaneo",
      "Wataru Ootani",
      "Francesco Renga",
      "André Schöning",
      "Heiko Augustin",
      "Haris Avudaiyappan",
      "Sei Ban",
      "Paolo Beltrame",
      "Hicham Benmansour",
      "Daniela Bortoletto",
      "Alessandro Bravar",
      "Gianluca Cavoto",
      "Marco Chiappini",
      "Alessandro Corvaglia",
      "Giovanni Dal Maso",
      "Sacha Davidson",
      "Matteo De Gerone",
      "Lorenzo Ferrari Barusso",
      "Marco Francesconi",
      "Luca Galli",
      "Giovanni Gallucci",
      "Flavio Gatti",
      "Helen Hayward",
      "Gavin Hesketh",
      "Malte Hildebrandt",
      "Fumihito Ikeda",
      "Fedor Ignatov",
      "Toshiyuki Iwamoto",
      "Tamasi Kar",
      "Marius Köppel",
      "Francesco Leonetti",
      "Weiyuan Li",
      "Ashley McDougall",
      "Satoshi Mihara",
      "Toshinori Mori",
      "Ljiljana Morvaj",
      "Donato Nicolò",
      "Hajime Nishiguchi",
      "Hiroyasu Ogawa",
      "Atsushi Oya",
      "Angela Papa",
      "Marco Panareo",
      "Daniele Pasciuto",
      "Davide Pinci",
      "Richard Plackett",
      "Nikolaos Rompotis",
      "Massimo Rossella",
      "Thomas Rudzki",
      "Rei Sakakibara",
      "Susanna Scarpellini",
      "Taikan Suehara",
      "Hiromu Suzuki",
      "Masato Takahashi",
      "Michele Tammaro",
      "Gianfranco Tassielli",
      "Yusuke Uchiyama",
      "Ryusei Umakoshi",
      "Antoine Venturini",
      "Luigi Vigani",
      "Cecilia Voena",
      "Joost Vossebeld",
      "Rainer Wallny",
      "Kensuke Yamamoto",
      "Yuji Yamazaki"
    ],
    "published": "2025-04-26T07:36:29Z",
    "updated": "2026-02-24T09:42:45Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2602.20668v1",
    "url": "https://arxiv.org/abs/2602.20668v1",
    "pdf_url": "https://arxiv.org/pdf/2602.20668v1.pdf",
    "title": "Development of a cost-effective X-ray imaging device based on Raspberry Pi Camera",
    "abstract": "This study reports the development and characterization of a cost-effective X-ray imaging device built from Raspberry Pi components, including a high-quality 12.3-megapixel camera configured for indirect detection with a Gd2O2S: Tb scintillation screen. The device was evaluated under both ambient light and X-ray exposure conditions. Initial characterization under ambient light ensured proper optical focusing; subsequently, camera settings (ISO and exposure time) were evaluated and optimized for X-ray imaging performance. Spatial resolution of the developed device was quantified using the Slanted-Edge method to derive the Modulation Transfer Function (MTF). The device achieves MTF20 values of 68 lp/mm under ambient light and 25 lp/mm under X-ray irradiation (50 and 70 kV) with Gd2O2S:Tb screen. Besides, the modularity of the developed device was confirmed by conducting the tests with LYSO:Ce and GAGG:Ce screens. Results demonstrate that this compact, cost-effective platform delivers spatial resolution comparable to clinical radiography systems, with potential applications in scientific, educational, and medical contexts where cost and portability are critical factors.",
    "authors": [
      "Nguyen Duc Ton",
      "Nguyen Thanh Luan",
      "Faizan Anjum",
      "D. Joseph Daniel",
      "Sunghwan Kim",
      "Suchart Kothan",
      "Jakrapong Kaewkhao",
      "Hong Joo Kim"
    ],
    "published": "2026-02-24T08:16:12Z",
    "updated": "2026-02-24T08:16:12Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.20622v1",
    "url": "https://arxiv.org/abs/2602.20622v1",
    "pdf_url": "https://arxiv.org/pdf/2602.20622v1.pdf",
    "title": "A Low Cost Picoseconds Precision Timing and Synchronization Over A Hundred Kilometer",
    "abstract": "Large-scale systems, such as very large accelerators used for fundamental research, require the implementation of precise timing and synchronization systems over distances of several tens of kilometers. A very high precision has been demonstrated by the use of costly and complex clock distribution systems. However, many devices, such as accelerator diagnostics or large-scale detectors, only require picosecond precision. An approach exploiting the CERN White Rabbit protocol, deployed and enhanced on an electronic system capable of generating arbitrary frequencies with Hertz precision, is proposed here. Results of performance tests for the synchronization of a laser system, typically employed as a diagnostic for electron/positron beam polarimetry in accelerators, are provided in this Paper. We demonstrate that without implementing corrections for environmental changes, as temperature drifts, the system can synchronize a pulsed laser with picoseconds precision over a hundred kilometers, exhibiting drifts of a few picoseconds. This work paves the way for a low-cost implementation of picosecond synchronization of accelerator components and large-scale detectors.",
    "authors": [
      "Alice Renaux",
      "Ronic Chiche",
      "A. Martens",
      "Antoine Back",
      "Paul-Éric Pottie",
      "Daniel Charlet"
    ],
    "published": "2026-02-24T07:18:42Z",
    "updated": "2026-02-24T07:18:42Z",
    "categories": [
      "physics.acc-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.20564v1",
    "url": "https://arxiv.org/abs/2602.20564v1",
    "pdf_url": "https://arxiv.org/pdf/2602.20564v1.pdf",
    "title": "Deuterium-Tritium Levitated Dipole Fusion Power Plants",
    "abstract": "Levitated dipole reactors offer an attractive path towards economic fusion power generation. The intrinsic decoupling of the confining magnetic field-generating REBCO magnets and the vacuum vessel offer unparalleled accessibility and maintainability, allowing for high plant duty factors and theoretically low electricity prices. In order to achieve rapid deployment of fusion power to the grid, the use of the Deuterium-Tritium (DT) fuel cycle is required due to its lower required plasma triple products. Historically, designs of levitated dipole fusion power plants have targeted advanced fuels as a DT device was seen to be infeasible due to the high fluxes of 14.1 MeV neutrons on the superconducting core magnet. This study presents high level designs for two feasible first-of-a-kind (FOAK) DT levitated dipole fusion power plants, the larger of which produces 667 MW of fusion power and is predicted to produce 208 MW of net electric power. Both designs consist of a heavily neutron-shielded, high-field REBCO core magnet capable of producing peak magnetic field strengths of 23 T while keeping peak mechanical strains below 0.4%. The neutron shielding is comprised of a layered structure of tungsten and boron carbide, which allows for 92% of the heat deposited in the neutron shield to be radiated out to the first wall while still providing sufficient neutron attenuation to give adequate REBCO conductor lifetimes. The core magnet REBCO coil is comprised of a small \"sacrificial\" section and a larger semi-permanent section. The sacrificial section, comprising ~20% of the coil, will have a neutron damage limited lifetime of ~1 year, after which the core magnet will be quickly removed from the vacuum vessel and replaced. This allows the damaged core magnet to be refurbished and reused, reducing cost and allowing for economic fusion power generation from a DT levitated dipole reactor.",
    "authors": [
      "T. Simpson",
      "R. A. Badcock",
      "T. Berry",
      "C. S. Chisholm",
      "P. J. Fimognari",
      "P. Fisher",
      "D. T. Garnier",
      "K. Lenagh-Glue",
      "B. Leuw",
      "R. Mataira",
      "L. Meadows",
      "T. McIntosh",
      "J. Poata",
      "K. Richardson",
      "B. Smith",
      "A. Simpson",
      "J. D. Tyler",
      "T. Wordsworth"
    ],
    "published": "2026-02-24T05:29:29Z",
    "updated": "2026-02-24T05:29:29Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.20538v1",
    "url": "https://arxiv.org/abs/2602.20538v1",
    "pdf_url": "https://arxiv.org/pdf/2602.20538v1.pdf",
    "title": "Range Emulator: A Compact Paraxial Optical System to Emulate Long-Distance Monochromatic Laser Propagation",
    "abstract": "Emulating long-distance light propagation on a laboratory scale is essential for the ground-based testing of intersatellite optical systems. To address this challenge, we propose and analyze a novel optical system called the Range Emulator (RE) to reproduce the spatial propagation effects of a long-distance beam within a compact apparatus. Our analysis identifies that three lenses are required as the minimum number of lenses to implement the RE. Through a numerical exploration, we quantify the fundamental trade-off between system compactness and manufacturing precision. This work provides a practical framework for designing compact optical testbeds for future multi-satellite laser link technologies.",
    "authors": [
      "Subaru Shibai",
      "Kiwamu Izumi"
    ],
    "published": "2026-02-24T04:36:18Z",
    "updated": "2026-02-24T04:36:18Z",
    "categories": [
      "physics.optics",
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2602.20428v1",
    "url": "https://arxiv.org/abs/2602.20428v1",
    "pdf_url": "https://arxiv.org/pdf/2602.20428v1.pdf",
    "title": "Conceptual Design of Highly-Constrained Splitters for the FFA@CEBAF Energy Upgrade Study",
    "abstract": "The Continuous Electron Beam Accelerator Facility (CEBAF) at Jefferson Lab is investigating a significant energy upgrade utilizing Fixed-Field Alternating-gradient (FFA) recirculating arcs. This upgrade requires the design of complex horizontal beam splitters to manage up to six concurrent beam passes. This paper presents the conceptual design of these splitters, which are subject to severe physical constraints imposed by the existing accelerator tunnel and multifaceted beam dynamics requirements for matching into the permanent-magnet FFA arcs. The design methodology, centered on multi-pass simulations in the Bmad toolkit, is detailed from the initial geometric layout through the advanced optics matching. Key results include a robust geometric arrangement that fits within the spatial boundaries and the development of multiple, flexible optics matching solutions. Furthermore, the design integrates a viable scheme for extracting high-energy beams for the experimental halls, a critical operational requirement. This work establishes a comprehensive and viable conceptual design, forming a baseline for future engineering and performance optimization studies.",
    "authors": [
      "Ryan Bodenstein",
      "Jay Benesch",
      "Alexander Coxe",
      "Kirsten Deitrick",
      "Brian Freeman",
      "Randika Gamage",
      "Reza Kazimi",
      "Donish Khan",
      "Katheryne Price",
      "Ben Schaumloffel"
    ],
    "published": "2026-02-24T00:01:02Z",
    "updated": "2026-02-24T00:01:02Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.20411v1",
    "url": "https://arxiv.org/abs/2602.20411v1",
    "pdf_url": "https://arxiv.org/pdf/2602.20411v1.pdf",
    "title": "Driver-delay chicanes for a multistage plasma-based accelerator facility",
    "abstract": "The SPARTA project aims to design a medium-sized accelerator facility that facilitates new experiments in strong-field quantum electrodynamics using plasma-based accelerators. For this, we need several plasma stages and, therefore, several drivers. Drivers can be either an ultra-relativistic charged particle beam or a high-intensity laser beam. In case we use particle beams, we need a method of distributing these beams from a radio-frequency accelerator to the different plasma stages. A central part of this is a delay scheme that ensures temporal synchronization of the drivers. In this paper, we demonstrate how to achieve a 2 ns delay in $\\sim$12 m, while keeping the first-order beam parameters periodic.",
    "authors": [
      "D. Kalvik",
      "E. Adli",
      "P. Drobniak",
      "F. Peña",
      "C. A. Lindstrøm"
    ],
    "published": "2026-02-23T23:17:52Z",
    "updated": "2026-02-23T23:17:52Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.20369v1",
    "url": "https://arxiv.org/abs/2602.20369v1",
    "pdf_url": "https://arxiv.org/pdf/2602.20369v1.pdf",
    "title": "LANTERN: Characterization technology for low threshold cryogenic detectors",
    "abstract": "The use of low-temperature detectors, such as cryogenic calorimeters, has pioneered the recent advancements in low-energy rare event searches. These detectors provide a low-noise environment essential for the direct detection of dark matter and neutrinos. Characterizing these detectors within the region of interest (ROI), typically spanning from O(10~eV) to O(1~keV), has proven to be a challenging task. Conventional radioactive sources produce signals above this range, leading to nonlinearities and saturation effects. Moreover, these detectors are usually deployed in low background environments, meaning that having a radioactive source during physics runs can spoil the measurement making the use of this type of solution unfeasible.   As a solution to these issues, we introduce LANTERN, an optical calibration system designed for highly segmented cryogenic calorimeters. LANTERN utilizes the photostatistics resulting from the absorption of monochromatic UV-Vis photons emitted by LEDs to analyze the detector response curve, without needing prior knowledge of the total energy deposited. The system employs a fast-switching LED matrix that operates at excitation times faster than the typical response of cryogenic detectors and can currently characterize up to 64 calorimeters independently.   In this work, the validation of the final electronics designed for the project is shown. The first test was carried out by calibrating one of the cryogenic detectors of the BULLKID-DM experiment and checking the energy-reconstruction error of the spectral features produced by the surrounding lead casing. An error of $\\approx 2\\%$ has been observed in the energy reconstruction. The second validation was carried out by cross-calibrating one of the CALDER thin detectors with a commercial LED driver, and compatible results between the two setups were achieved.",
    "authors": [
      "Giorgio Del Castello"
    ],
    "published": "2026-02-23T21:14:10Z",
    "updated": "2026-02-23T21:14:10Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.20233v1",
    "url": "https://arxiv.org/abs/2602.20233v1",
    "pdf_url": "https://arxiv.org/pdf/2602.20233v1.pdf",
    "title": "Operational Accelerator Tuning via Model-Coupled Optics and Bayesian Steering",
    "abstract": "We present an on-line tuning strategy for the ISAC post-accelerator that pre-sets machine optics with a digital twin and then performs Bayesian optimization for steering under online operation with beam. The model computes end-to-end tunes in seconds and interfaces with the control system under device bounds, slew-rate limits, and loss interlocks. We report three experimental case studies demonstrating that decoupling optics from steering yields faster and more reliable convergence than a fully Bayesian optics-plus-steering baseline under identical conditions. Across these cases, iterations to high transmission tunes are reduced by a factor of 4-6, with final average transmissions in the mid- to high-90% range. By factorizing optics from steering, the dimensionality of the parameter space is reduced, convergence becomes more predictable, and operational safeguards are easier to enforce.",
    "authors": [
      "O. Hassan",
      "O. Shelbaya",
      "P. M. Jung",
      "O. Kester",
      "T. Planche",
      "W. Fedorko"
    ],
    "published": "2026-02-23T18:55:33Z",
    "updated": "2026-02-23T18:55:33Z",
    "categories": [
      "physics.acc-ph",
      "physics.app-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.20139v1",
    "url": "https://arxiv.org/abs/2602.20139v1",
    "pdf_url": "https://arxiv.org/pdf/2602.20139v1.pdf",
    "title": "Development of a Cherenkov-Based Time-of-Flight Detector Using Silicon Photomultipliers",
    "abstract": "The aim of this work is to develop high precision Time-of-Flight (TOF) devices based on high refractive index solid Cherenkov radiators read out by silicon photomultipliers (SiPMs). Cherenkov light is prompt and therefore ideal for reaching the intrinsic timing limits of TOF systems. By utilizing a thin, high-refractive-index radiator a nearly instantaneous signal is generated by particles exceeding the Cherenkov threshold. In order to achieve the ultimate time resolution, we carried out a rigorous optimization of the radiator material and geometry, alongside the efficiency of the optical coupling to the SiPM sensors. The key factors limiting the time resolution were characterized by comprehensive Monte Carlo simulations, subsequently validated against experimental beam test data. We assembled small-scale prototypes instrumented with various Hamamatsu SiPM arrays sensors with pitches ranging from 1.3 to 3 mm coupled with various window materials, such as fused silica and MgF2, featuring various thickness values. The prototypes were successfully tested in beam test campaigns at the CERN-PS T10 beam line. The data were collected with a complete chain of front-end and readout electronics based on either the Petiroc 2A or the Radioroc 2 interfaced to a picoTDC to measure charges and times. By comparing the time measurements with two SiPM arrays we were able to measure a time resolution better than 33.2 ps at the full system level with a charged particle detection efficiency of 100%. Our results demonstrate the expected performance benchmarks for the charged particle detection efficiency and time resolution and highlight the potential of the developed Cherenkov-based TOF detectors for next-generation particle identification systems.",
    "authors": [
      "Liliana Congedo",
      "Giuseppe De Robertis",
      "Antonio Di Mauro",
      "Mario Giliberti",
      "Francesco Licciulli",
      "Antonio Liguori",
      "Rocco Liotino",
      "Leonarda Lorusso",
      "Mario Nicola Mazziotta",
      "Eugenio Nappi",
      "Nicola Nicassio",
      "Giuliana Panzarini",
      "Roberta Pillera",
      "Giacomo Volpe"
    ],
    "published": "2026-02-23T18:49:57Z",
    "updated": "2026-02-23T18:49:57Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.10363v4",
    "url": "https://arxiv.org/abs/2601.10363v4",
    "pdf_url": "https://arxiv.org/pdf/2601.10363v4.pdf",
    "title": "A compact Optical Liquid Argon Facility at Roma Tre",
    "abstract": "In this paper we present a compact test facility for the measurement of optical properties of liquid argon as scintillator. The setup is under preparation at Roma Tre and it has a volume of 40 L liquid argon, which is liquefied from argon gas with a purity of $\\ge 99.9999\\%$ vol. To readout the scintillation photons from liquid argon with the highest intensity near 127 nm, we use the vacuum ultraviolet silicon photomultipliers from Hamamatsu. By submerging the photon detectors directly inside the liquid argon, we can eliminate the systematics from the wavelength shifter and light guides which have been commonly used to detect the scintillation photons of liquid argon.",
    "authors": [
      "Hexi Shi",
      "Valerio D'Andrea",
      "Giuseppe Salamanna",
      "Krzysztof Szczepaniec",
      "Diego Tagnani"
    ],
    "published": "2026-01-15T13:10:24Z",
    "updated": "2026-02-23T17:42:28Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.26747v2",
    "url": "https://arxiv.org/abs/2510.26747v2",
    "pdf_url": "https://arxiv.org/pdf/2510.26747v2.pdf",
    "title": "Spectral Deconvolution without the Deconvolution: Extracting Temperature from X-ray Thomson Scattering Spectra without the Source-and-Instrument Function",
    "abstract": "X-ray Thomson scattering (XRTS) probes the dynamic structure factor of the system, but the measured spectrum is broadened by the combined source-and-instrument function (SIF) of the setup. In order to extract properties such as temperature from an XRTS spectrum, the broadening by the SIF needs to be removed. Recent work [Dornheim et al. Nature Commun. 13, 7911 (2022)] has suggested that the SIF may be deconvolved using the two-sided Laplace transform. However, the extracted information can depend strongly on the shape of the input SIF, and the SIF is in practice challenging to measure accurately. Here, we propose an alternative approach: we demonstrate that considering ratios of Laplace-transformed XRTS spectra collected at different scattering angles is equivalent to performing the deconvolution, but without the need for explicit knowledge of the SIF. From these ratios, it is possible to directly extract the temperature from the scattering spectra, when the system is in thermal equilibrium. We find the method to be generally robust to spectral noise and physical differences between the spectrometers, and we explore situations in which the method breaks down. Furthermore, the fact that consistent temperatures can be extracted for systems in thermal equilibrium indicates that non-equilibrium effects could be identified by inconsistent temperatures of a few eV between the ratios of three or more scattering angles.",
    "authors": [
      "Thomas Gawne",
      "Alina Kononov",
      "Andrew Baczewski",
      "Hannah Bellenbaum",
      "Maximilian P Böhme",
      "Zhandos Moldabekov",
      "Thomas R Preston",
      "Sebastian Schwalbe",
      "Jan Vorberger",
      "Tobias Dornheim"
    ],
    "published": "2025-10-30T17:40:50Z",
    "updated": "2026-02-23T16:11:24Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.16643v2",
    "url": "https://arxiv.org/abs/2512.16643v2",
    "pdf_url": "https://arxiv.org/pdf/2512.16643v2.pdf",
    "title": "Temperature dependence of the long-term annealing behavior of neutron irradiated diodes from 8-inch p-type silicon wafers",
    "abstract": "To face the higher levels of radiation due to the 10-fold increase in integrated luminosity during the High-Luminosity LHC, the CMS detector will replace the current Calorimeter Endcap (CE) using the High-Granularity Calorimeter (HGCAL) concept. The high-radiation regions of the the CE, where fluences between $1\\cdot10^{14}~n_{eq}/cm^{2}$ and $1\\cdot10^{16}~n_{eq}/cm^{2}$ and doses of up to 2\\,MGy are expected considering an integrated luminosity of $3\\,ab^{-1}$, will be equipped with silicon pad sensors. This includes the entire electromagnetic as well as parts of the hadronic section of the CE. The silicon sensors are processed on 8-inch p-type wafers with an active thickness of 300\\,\\textmu m, 200\\,\\textmu m and 120\\,\\textmu m and cut into hexagonal shapes for optimal use of the full wafer area and tiling. With each main sensor, several small test structures (e.g. pad diodes) are hosted on the wafers, used for quality assurance and radiation hardness tests. In order to investigate the radiation-induced bulk damage, these diodes have been irradiated with reactor neutrons at JSI (Jozef Stefan Institute, Ljubljana, Slovenia) to fluences between $5\\cdot10^{14}~n_{eq}/cm^{2}$ and $1.5\\cdot10^{16}~n_{eq}/cm^{2}$. This study focuses on the isothermal annealing behavior of the bulk material at different temperatures between 5.5°C and 60°C using electrical characterization and charge collection measurements. The results are used to extract the annealing time constants for this material and fluence range based on the Hamburg model approach to allow an estimation of the expected annealing effects in silicon sensors during the year-end technical stops and the long HL-LHC shutdowns. The annealing parameters found will make it possible to model the annealing behavior of p-type silicon detector projects at HL-LHC fluence ranges better than the existing Hamburg model.",
    "authors": [
      "Leena Diehl",
      "Oliwia Kaluzinska",
      "Marie Mühlnikel",
      "Max Andersson",
      "Natalya Gerassyova",
      "Jenan Amer",
      "Eva Sicking",
      "Dana Groner",
      "Jan Kieseler",
      "Matteo Defranchis"
    ],
    "published": "2025-12-18T15:15:21Z",
    "updated": "2026-02-23T14:38:44Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.19890v1",
    "url": "https://arxiv.org/abs/2602.19890v1",
    "pdf_url": "https://arxiv.org/pdf/2602.19890v1.pdf",
    "title": "Test-beam results from MiniCACTUS-v2: A depleted monolithic CMOS timing sensor prototype",
    "abstract": "MiniCACTUS-v2 is a monolithic sensor prototype designed in LF 150 nm CMOS process for time tagging of individual Minimum Ionizing Particles with an accuracy better than 100 ps. The sensing element is a deep n-well/p-substrate diode without internal amplification. To minimize detector capacitances, the analog front-ends and the discriminators for each pixel have been implemented outside the pixel, at the column level. After fabrication, the sensors have been thinned to 150 microns, 175 microns and 200 microns and then post-processed for backside biasing. The breakdown voltages measured on these sensors are higher than 500 V, ensuring the complete depletion of the charge collection volume. In this paper, we will focus on the time resolution measurements from a test-beam campaign conducted in July 2025 at SPS-CERN. During this period, several pixels from the 3 different sensor thicknesses have been tested at different bias voltages. The best time resolution measured is 48.88 ps on a 0.5 mm x 0.5 mm pixel from a 175 microns-thick sensor at 500 V, with nominal settings for the on-chip analog front-end and discriminator.",
    "authors": [
      "Y. Degerli",
      "R. Aleksan",
      "R. Casanova",
      "Y. Gan",
      "S. Grinstein",
      "F. Guilloux",
      "A. Hanlon",
      "T. Hemperek",
      "J. P. Meyer",
      "J. Pinol",
      "P. Schwemling",
      "E. Vilella"
    ],
    "published": "2026-02-23T14:32:39Z",
    "updated": "2026-02-23T14:32:39Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.19830v1",
    "url": "https://arxiv.org/abs/2602.19830v1",
    "pdf_url": "https://arxiv.org/pdf/2602.19830v1.pdf",
    "title": "Superconducting Accelerator Magnets",
    "abstract": "This course introduces key aspects of superconducting magnet technology in accelerators: basic principles, superconducting materials (NbTi, Nb$_3$Sn, ReBCO), wire and cable architectures, and fabrication methods. Compared to copper or permanent magnets, superconducting systems require cryogenics and complex protection schemes but enable superior performance. Core challenges - like flux pinning, magnetization effects, quench behavior, mechanical forces interception, power tests and magnetic measurements - are addressed through examples of magnets from PSI and CERN.",
    "authors": [
      "Stephane Sanfilippo"
    ],
    "published": "2026-02-23T13:29:03Z",
    "updated": "2026-02-23T13:29:03Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.19808v1",
    "url": "https://arxiv.org/abs/2602.19808v1",
    "pdf_url": "https://arxiv.org/pdf/2602.19808v1.pdf",
    "title": "Conventional Accelerator Magnets",
    "abstract": "This course introduces conventional magnets used in particle accelerators, focusing on both normal-conducting copper coil magnets and permanent magnets (PMs). It covers magnet classification, design principles, material selection, and mechanical constraints. Advantages and limitations of PMs compared to copper coil magnets are discussed. Key construction steps and cooling methods are presented. The course also includes magnetic field measurement techniques and quality control. Practical examples from PSI and CERN illustrate the concepts.",
    "authors": [
      "Stephane Sanfilippo"
    ],
    "published": "2026-02-23T13:07:52Z",
    "updated": "2026-02-23T13:07:52Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.19730v1",
    "url": "https://arxiv.org/abs/2602.19730v1",
    "pdf_url": "https://arxiv.org/pdf/2602.19730v1.pdf",
    "title": "Designing electrostatic MEMS-based electron optics: the case of the spiral phase plate",
    "abstract": "A new generation of microfabricated MEMS for electron optics is changing electron microscopy for the better. These devices allow operations on the electron beam that are impossible with conventional electron optics. Unprecedented phase landscapes like tunable spiral phase plates and localized strong phase gradients are just some examples of what can be achieved. This work establishes the methodological foundation to design and control MEMS based phase plates. The design strategy is rooted on a novel analytical and numerical modeling of thin electrodes with accurate account of the fringing fields having a major role in the thin-MEMS geometry. We designed, fabricated and characterized experimentally a spiral phase plate, and assessed the quality of the generated vortex beam while discussing the most relevant control parameters and design approaches.",
    "authors": [
      "Payam Habibdazeh Kavkani",
      "Amir H. Tavabi",
      "Paolo Rosi",
      "Alberto Roncaglia",
      "Enzo Rotunno",
      "Luca Belsito",
      "Sergio Sapienza",
      "Stefano Frabboni",
      "Rafal E. Dunin-Borkowski",
      "Marco Beleggia",
      "Vincenzo Grillo"
    ],
    "published": "2026-02-23T11:29:12Z",
    "updated": "2026-02-23T11:29:12Z",
    "categories": [
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.19712v1",
    "url": "https://arxiv.org/abs/2602.19712v1",
    "pdf_url": "https://arxiv.org/pdf/2602.19712v1.pdf",
    "title": "SHARP: A compact focusing system for medical applications using a diverging plasma lens",
    "abstract": "Cancer therapy for deep-seated tumors requires precise irradiation of a small target deep within the patient while minimizing radiation exposure to surrounding tissues. This can be accomplished with a round beam sharply converging towards a single spot, requiring a large beam size in both planes at the exit of the focusing system. Achieving this over a short distance using only quadrupole lenses is challenging; but by using a linear active plasma lens (APL) in defocusing mode, the beam can be quickly and non-destructively enlarged before focusing using quadrupoles. The position of the irradiation spot can also be scanned in three dimensions by changing magnet settings. The SHARP project will develop and test this concept. Such a system can be used with very high energy electrons (hundreds of MeV), creating a Bragg-peak-like spot using novel accelerator technology. This could lead to more compact radiotherapy facilities, not requiring a bulky infrastructure typically associated with proton radiotherapy machines. If successful, SHARP will enable precision conformal radiotherapy, spatial fractionation, and potentially be useful for FLASH radiotherapy.",
    "authors": [
      "Kyrre Ness Sjobak",
      "Elisabeth Rød-Lindberg",
      "Abélia Ellingsen",
      "Pierre Drobniak",
      "Vilde Flognfeldt Rieker",
      "Fardous Reaz",
      "Carl Andreas Lindstrøm",
      "Erik Adli"
    ],
    "published": "2026-02-23T11:02:13Z",
    "updated": "2026-02-23T11:02:13Z",
    "categories": [
      "physics.med-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.med-ph"
  },
  {
    "arxiv_id": "2602.19676v1",
    "url": "https://arxiv.org/abs/2602.19676v1",
    "pdf_url": "https://arxiv.org/pdf/2602.19676v1.pdf",
    "title": "Gyrokinetic simulation of the effect of transient fueling on plasma turbulence in ADITYA-U tokamak",
    "abstract": "The gradient-driven microturbulence in ADITYA-U tokamak plasmas has been suppressed by injecting short gas puffs. The suppression of microturbulence increases the core temperature and subsequently the energy confinement time following the gas puff. The gas injection modifies the radial density profile, making it relatively flatter near the mid-radius. Global electrostatic gyrokinetic simulations show that this modification to the radial density profile due to gas injection suppresses the existing trapped electron mode (TEM). Simulation results show that the TEM-dominated turbulence suppression reduces the turbulence-driven heat transport, leading to an increase in core temperature. Applying multiple periodic gas-puffs leads to multiple periodic events of TEM suppression, improving the overall energy confinement time, and is used as an active control mechanism to influence microturbulence in ADITYA-U tokamak.",
    "authors": [
      "Jaya Kumar Alageshan",
      "Suman Dolui",
      "Joydeep Ghosh",
      "Kishore Mishra",
      "Sarveshwar Sharma",
      "Abhijit Sen",
      "Manjunatha Valmiki",
      "Sandeep Agrawal",
      "Sanjay Wandhekar",
      "Zhihong Lin",
      "Animesh Kuley"
    ],
    "published": "2026-02-23T10:19:43Z",
    "updated": "2026-02-23T10:19:43Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.00586v3",
    "url": "https://arxiv.org/abs/2601.00586v3",
    "pdf_url": "https://arxiv.org/pdf/2601.00586v3.pdf",
    "title": "Elaboration on the kinetic approach of Derbenev and Kondratenko to spin-polarized beams in electron storage rings",
    "abstract": "We present a detailed account of the kinetic approach for describing the effect of synchrotron radiation on electron and positron spin polarization in storage rings. This approach was introduced in 1974 by Derbenev and Kondratenko and was extended by us since 2001. The kinetic approach is much less frequently utilized but it is more general than the original non-kinetic approach of Derbenev and Kondratenko from 1972 since the kinetic approach is not centered on the invariant spin field. As with the non-kinetic approach the kinetic approach covers the radiative depolarization effect, the Sokolov-Ternov effect and its Baier-Katkov correction as well as the kinetic polarization effect but it enables the calculation of corrections to the original Derbenev-Kondratenko formulas and thereby provides estimates of the reliability of the latter. The kinetic approach is applicable to storage rings with energies from a few GeV up to the energies of the FCC-ee and CEPC and beyond. The kinetic approach is based on the spin-orbit Wigner functions which lead to the so-called Bloch equation for the polarization density which is a generalization of Fokker-Planck equations to spin motion. In turn, as discovered in 2019, the Bloch equation is based on stochastic ordinary differential equations which can be used to develop Monte-Carlo spin tracking codes covering the key effects beyond the radiative depolarization effect. These stochastic ordinary differential equations lead to a new viewpoint of the physical effects, in particular the kinetic polarization effect.",
    "authors": [
      "Klaus Heinemann",
      "Dan T. Abell",
      "Jose Agudelo",
      "Desmond P. Barber",
      "Oleksii Beznosov",
      "Joseph P. Devlin",
      "James A. Ellison",
      "Eiad Hamwi",
      "Boaz Nash",
      "Mathias Vogt"
    ],
    "published": "2026-01-02T06:14:44Z",
    "updated": "2026-02-23T06:30:26Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.19527v1",
    "url": "https://arxiv.org/abs/2602.19527v1",
    "pdf_url": "https://arxiv.org/pdf/2602.19527v1.pdf",
    "title": "Friction-induced scale-selection in the extended Cahn-Hilliard model for zonal staircase",
    "abstract": "In this work, we describe a possible mechanism to set the radial scale of zonal flows, which may be applicable to the $E \\times B$ staircase found in the global full-f simulations such as [G. Dif-Pradalier et al. Phys. Rev. Lett. 114, 085004 (2015)]. 1D numerical simulation results of the Cahn-Hilliard model - extended to include zonal flow friction - can be understood from a heuristic nonlinear analysis. The staircase step-size $Δ$ is found to decrease as the dimensionless zonal flow friction $μ$ increases. It scales like $Δ\\sim \\log μ^α$, with $α\\simeq -0.41$, up to a constant offset.",
    "authors": [
      "M. Leconte",
      "T. S. Hahm"
    ],
    "published": "2026-02-23T05:35:42Z",
    "updated": "2026-02-23T05:35:42Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1103/n1wb-jnzd"
  },
  {
    "arxiv_id": "2602.14870v2",
    "url": "https://arxiv.org/abs/2602.14870v2",
    "pdf_url": "https://arxiv.org/pdf/2602.14870v2.pdf",
    "title": "Application of RFSoC Technology for Beam Position Monitors at the SuperKEKB Storage Rings Injection Points",
    "abstract": "In order to achieve its ambitious luminosity target, the SuperKEKB collider must achieve and sustain high beam currents on the order of Ampere in its storage rings. This requires continuous top-up injection and operation with a two-bunch injection scheme, injecting two 96 ns spaced bunches in a single injection cycle. An important input for tuning the injection beam is the position reading from a dedicated beam position monitor (BPM), located after the septum magnets, slightly upstream of where the injected and stored beams converge. Previously, the readout electronics used for these special BPMs were not capable of independent measurement of both bunches in the two-bunch injection mode and modification of the concerned devices and their firmware was not feasible. The opportunity was taken to develop a new readout device based on the AMD/Xilinx RF System on a Chip (RFSoC) platform with the goal of not only providing a sufficiently flexible and performant readout solution for the concerned BPMs, but also to evaluate and gain experience with the platform for beam monitor electronics applications. This paper is concerned with the details of this development as well as evaluation and operation of the developed device.",
    "authors": [
      "B. Urbschat",
      "G. Mitsuka",
      "L. Ruckman"
    ],
    "published": "2026-02-16T16:02:20Z",
    "updated": "2026-02-23T03:50:15Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.04298v2",
    "url": "https://arxiv.org/abs/2510.04298v2",
    "pdf_url": "https://arxiv.org/pdf/2510.04298v2.pdf",
    "title": "A Particle-in-Cell Simulation Framework for Thomson Scattering Analysis in Inertial Confinement Fusion",
    "abstract": "In inertial confinement fusion (ICF), Thomson scattering (TS) is a widely used diagnostic technique for probing plasma conditions. We present a first-principles numerical approach to obtaining scattered light signals of ion acoustic features with high resolution in angle and frequency space using particle-in-cell simulations under typical ICF conditions. Our method demonstrates good agreement with existing theories for thermal collective TS. In the super-thermal collective regime, the results align with theory when the driven plasma modes are well-matched in wave vectors to the probe and collecting beams. Moreover, we also find that TS signals can remain significant even under imperfect wave-vector matching-a result that contradicts the conventional expectation that the TS spectrum strictly follows the plasma density spectrum. We attribute this discrepancy to a beating wave mechanism arising from the interaction between the probe beam and driven plasma density modulations. Our work thus provides a practical framework for interpreting TS signals from driven ion modes, a common yet complex feature in ICF plasmas.",
    "authors": [
      "Ziang Zhu",
      "Yifan Liu",
      "Jun Li",
      "Han Wen",
      "Shihui Cao",
      "Yin Shi",
      "Qing Jia",
      "Chaoxin Chen",
      "Yaoyuan Liu",
      "Hang Zhao",
      "Tao Gong",
      "Zhichao Li",
      "Dong Yang",
      "Jian Zheng"
    ],
    "published": "2025-10-05T17:25:25Z",
    "updated": "2026-02-23T03:44:38Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.19472v1",
    "url": "https://arxiv.org/abs/2602.19472v1",
    "pdf_url": "https://arxiv.org/pdf/2602.19472v1.pdf",
    "title": "Three Dimensional Multiphysics Modelling of Helicon Wave Heating and Antenna Plasma Coupling for Boundary Density Control in Toroidal Fusion Plasmas",
    "abstract": "Active control of scrape off layer density is emerging as a critical requirement for improving ion cyclotron resonance heating and enabling high performance steady state operation in future magnetic confinement fusion devices. Helicon wave excitation offers a promising physics based approach to generating high density boundary plasmas with high ionization efficiency and low impurity release. In this work, we develop THEMIS code, a fully three dimensional (3D) multiphysics model of helicon wave propagation and power deposition in a toroidal fusion relevant configuration, employing a finite temperature thermal dielectric tensor. The code quantifies the relative contributions of Doppler shifted cyclotron damping, anomalous Doppler damping, collisional damping, and Landau damping, and demonstrates that slow wave propagation and electron Landau damping dominate the accessible heating regime in Helimak device. A comparative study of four planar antenna geometries under the present protruding window configuration shows that geometric cutoffs and SOL density gradients severely limit power penetration into the core accessible region. To address this constraint, we introduce a recessed window launch scheme that positions the dielectric window inside the vacuum vessel and perform systematic parameter scans of window position, antenna geometry, and installation orientation. From these analyses, we identify the key physics driven principles governing efficient helicon wave coupling: the importance of open circuit termination, maximized strap length and width, controlled inter turn spacing, and sufficient clearance from metallic walls to avoid near field suppression. Guided by these principles, we designed an optimized racetrack spiral antenna that increases coupling efficiency by more than an order of magnitude compared with conventional short circuited rectangular spiral antenna.",
    "authors": [
      "Hua Zhou",
      "Lei Chang",
      "GuoSheng Xu",
      "YiWei Zhang",
      "Matthew Hole",
      "Dan Du",
      "ZhiSong Qu",
      "MuQuan Wu"
    ],
    "published": "2026-02-23T03:31:03Z",
    "updated": "2026-02-23T03:31:03Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.19468v1",
    "url": "https://arxiv.org/abs/2602.19468v1",
    "pdf_url": "https://arxiv.org/pdf/2602.19468v1.pdf",
    "title": "Cold Neutron Imaging and Efficiency Measurements with a Boron-10 Coated Double-GEM Detector",
    "abstract": "A B-10 coated GEM neutron detector (BGEM) was developed as a He-3 free alternative for cold-neutron beamline instrumentation, employing a single B4C converter cathode, a double-GEM amplification stage, and an orthogonal strip readout over an active area of 10 x 10 cm^2. Performance was evaluated at the Bio-REF cold-neutron beamline of the HANARO research reactor using a monochromatic 4.5 {\\angstrom} beam (En = 4.03 meV). The absolute detection efficiency, measured relative to a calibrated Li-6 based Ce:LiCAF scintillation detector, was εBGEM = 8.69 +/- 0.20 % (stat.). The spatial resolution was estimated from the edge smearing of reconstructed images of 1 mm diameter Cd-mask holes via an error-function fit to the radial edge profile, yielding approximately 700 μm. These results demonstrate stable cold-neutron operation of a single converter BGEM detector and provide a baseline for further efficiency improvements via converter and geometry optimization.",
    "authors": [
      "WooJong Kim",
      "DongHyun Kim",
      "Minjae Kwon",
      "Jason Sang Hun Lee",
      "Hyupwoo Lee",
      "Inkyu Park",
      "Donghyun Song",
      "Inseok Yoon",
      "Myeonghun Choi"
    ],
    "published": "2026-02-23T03:27:17Z",
    "updated": "2026-02-23T03:27:17Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.24780v2",
    "url": "https://arxiv.org/abs/2510.24780v2",
    "pdf_url": "https://arxiv.org/pdf/2510.24780v2.pdf",
    "title": "Optical design and sensitivity optimization of Cryogenic sub-Hz cROss torsion bar detector with quantum NOn-demolition Speed meter (CHRONOS)",
    "abstract": "We present the optical design and sensitivity modeling of the 2.5 m Cryogenic sub-Hz cROss torsion-bar detector with quantum NOn-demolition Speed meter (CHRONOS), a triangular Sagnac speed-meter interferometer incorporating power- and signal-recycling techniques. Using ABCD-matrix analysis and Finesse3 simulations, we show that stable eigenmodes are obtained with optimized mirror curvatures and focal placements, achieving mode-matching efficiencies above 99.5 %. The resulting configuration reaches a quantum-noise-limited strain sensitivity of $h \\simeq 3\\times10^{-18},\\mathrm{Hz^{-1/2}}$ at 1 Hz, with a ring-cavity finesse $\\mathcal{F}\\simeq3.1\\times10^{4}$ and round-trip Gouy phase $ψ_{\\mathrm{rt}}\\approx153^{\\circ}$. The power-recycling cavity detuning ($φ_p=-85^{\\circ}$) dominates the low-frequency quantum noise, while the signal-recycling cavity detuning ($φ_s=0^{\\circ}$) mainly introduces a uniform quadrature rotation. The optimal homodyne angle ($ζ_{\\mathrm{opt}}\\simeq46^{\\circ}$) balances shot-noise and radiation-pressure effects to give the best sensitivity near 1 Hz. Assuming end-mirror reflectivity $R_{\\mathrm{ETM}}=99.9999\\%$ under cryogenic operation at 10 K, CHRONOS can achieve quantum-noise-limited performance on a laboratory scale and serve as a testbed for future long-baseline, cryogenic interferometers probing sub-hertz gravitational waves.",
    "authors": [
      "Yuki Inoue",
      "Daiki Tanabe",
      "M. Afif Ismail",
      "Vivek Kumar",
      "Mario Juvenal S Onglao",
      "Ta-Chun Yu"
    ],
    "published": "2025-10-25T15:49:08Z",
    "updated": "2026-02-23T02:29:23Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.CO",
      "astro-ph.IM",
      "gr-qc"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2505.11361v5",
    "url": "https://arxiv.org/abs/2505.11361v5",
    "pdf_url": "https://arxiv.org/pdf/2505.11361v5.pdf",
    "title": "Magnetic dipole-dipole transition for scintillation quenching",
    "abstract": "A magnetic dipole-dipole interaction is proposed as a scintillation quenching mechanism. The interaction rate follows $R^{-6}$ as the electric dipole-dipole interaction in F$\\mathrm{\\ddot{o}}$ster resonance energy transfer theory. The proposed mechanism causes a long-range resonance energy transfer, and the resonance condition is that the spins of donor and acceptor electrons both flip, and the energy level differences are the same. The new mechanism is distinct to the known spin-orbit coupling induced intersystem crossing, and it can enhance the overall intersystem crossing rate. When oxygen or organic molecules including heavy elements are dissolved in a liquid scintillator, these requirements are possible to be satisfied. The proposal in the paper adds a new approach for scintillation quenching in liquid scintillators.",
    "authors": [
      "Zhe Wang"
    ],
    "published": "2025-05-16T15:28:56Z",
    "updated": "2026-02-23T02:21:42Z",
    "categories": [
      "physics.ins-det",
      "physics.chem-ph"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/21/02/P02033"
  },
  {
    "arxiv_id": "2602.19399v1",
    "url": "https://arxiv.org/abs/2602.19399v1",
    "pdf_url": "https://arxiv.org/pdf/2602.19399v1.pdf",
    "title": "Imaging the Superconducting Proximity Effect in S-S'-S Transition Edge Sensors",
    "abstract": "Proximity effects at superconducting interfaces, between different superconductors (S-S') or between superconductors and normal metals (S-N), are fundamental to the performance of superconducting electronics, yet only few experiments have directly probed the spatial structure of proximity effects within a device. This is particularly relevant for transition edge sensors (TESs), where the interplay of direct and inverse proximity effects governs detector sensitivity. Here, we use scanning superconducting interference device (SQUID) susceptometry to directly image the local diamagnetic response in functional S-S'-S TES structures. We resolve long range proximity coupling extending over tens of micrometers, revealing that the local transition temperature is dramatically tuned by neighboring regions, being either enhanced by superconducting (S) leads or suppressed by normal metal (N) contacts. Our observations are quantitatively supported by Ginzburg Landau modeling of the device geometry and calculations of the temperature dependent diamagnetism based on self-consistent Usadel equations. By providing spatially resolved measurements of the interplay of proximity effects in TES devices, this work establishes a framework for understanding and controlling superconducting states in heterogeneous superconducting structures.",
    "authors": [
      "Austin R. Kaczmarek",
      "Samantha Walker",
      "Jason Austermann",
      "Douglas Bennett",
      "W. Bertrand Doriese",
      "Shannon M. Duff",
      "Johannes Hubmayr",
      "Kelsey Morgan",
      "Michael D. Niemack",
      "Dan Schmidt",
      "Daniel Swetz",
      "Joel Ullom",
      "Joel Weber",
      "Katja C. Nowack"
    ],
    "published": "2026-02-23T00:18:20Z",
    "updated": "2026-02-23T00:18:20Z",
    "categories": [
      "cond-mat.supr-con",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.supr-con"
  },
  {
    "arxiv_id": "2502.04374v3",
    "url": "https://arxiv.org/abs/2502.04374v3",
    "pdf_url": "https://arxiv.org/pdf/2502.04374v3.pdf",
    "title": "The Numerics of VMEC++",
    "abstract": "VMEC++ is a Python-friendly, from-scratch reimplementation in C++ of the Variational Moments Equilibrium Code (VMEC), a fixed- and free-boundary ideal-MHD equilibrium solver for stellarators and tokamaks. The first VMEC implementation was written by Steven P. Hirshman and colleagues in the 1980s and 1990s and its latest Fortran incarnation (PARVMEC, https://github.com/ORNL-Fusion/PARVMEC) is widely used in stellarator optimization systems. Our work improves on previous implementations with regard to various critical aspects: special care has been put in providing an idiomatic Python experience, from installation to actual usage; VMEC++ has a zero-crash policy; it supports inputs in the classic INDATA format as well as friendlier JSON files. VMEC++ execution times are typically less than or equal to previous implementations, and time to convergence can be decreased dramatically by leveraging its hot-restart feature: by providing the output of a VMEC++ run as initial state for a subsequent one, VMEC++ is initialized using the previously converged equilibrium. This can dramatically decrease runtimes when running on many similar magnetic configurations as it typically happens in stellarator optimization pipelines. On the flip side, some features of the original Fortran VMEC implementation are not yet available in VMEC++, such as support for non-stellarator-symmetric configurations. This contribution presents the internal numerics of the open-source VMEC++ package publicly for the first time.",
    "authors": [
      "Jonathan Schilling"
    ],
    "published": "2025-02-05T14:02:06Z",
    "updated": "2026-02-22T22:04:46Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.IM"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.03620v4",
    "url": "https://arxiv.org/abs/2601.03620v4",
    "pdf_url": "https://arxiv.org/pdf/2601.03620v4.pdf",
    "title": "On flying near the base of a pseudo-streamer",
    "abstract": "Near the 10 solar radius perihelion of Parker Solar Probe encounter 24, a confined region containing an enhanced plasma density (25,000 per cubic centimeter) and broadband electrostatic waves was encountered. The solar wind velocity (200 kilometers per second) and ion temperature (25 electron Volts) were significantly reduced as compared to their values in the ambient solar wind. Because the polarity of the radial magnetic field did not change sign on the two sides of the crossing and the crossed region contained a double-peaked plasma structure, the spacecraft must have passed near the base of a pseudo-streamer. In the plasma frame, an electric field as large as 400 millivolts per meter was detected during the crossing. This field is not associated with an ExB drift because it is observed in the plasma rest frame. Instead, it is balanced by the Generalized Ohm's Law terms whose current dependent term associated with this electric field was less than 1 milliampere per square meter, corresponding to a drift velocity less than 2.5 kilometers per second. The region also contained a turbulent plasma with density fluctuations as large as 0.3, suggesting that the resistive term in the Generalized Ohm's Law could be significant. In addition, both the density and electric field had non-zero slopes as functions of time, suggesting that the pressure gradient term in the Generalized Ohm's Law also mattered. This large electric field in the plasma rest frame may be the first and largest such field ever reported.",
    "authors": [
      "Forrest Mozer",
      "Oleksiy Agapitov",
      "Kyungeun Choi",
      "Andrii Voshchepynets"
    ],
    "published": "2026-01-07T06:01:19Z",
    "updated": "2026-02-22T20:18:28Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2601.00441v2",
    "url": "https://arxiv.org/abs/2601.00441v2",
    "pdf_url": "https://arxiv.org/pdf/2601.00441v2.pdf",
    "title": "Magnetic plasmoid explosions in the context of magnetar giant flares and fast radio bursts",
    "abstract": "Magnetar flares are highly energetic and rare events in which intense X and γ-ray emission is released from strongly magnetised neutron stars. The events are also accompanied by mass ejection from the neutron star. Fast radio bursts are short and intense pulses of coherent radio emission. Their large dispersion measures support an extragalactic origin. While their exact origin still remains elusive, a substantial number of models associates them with strong magnetic field and high-energy relativistic plasma found in the vicinity of magnetars. There is growing evidence that some fast radio bursts are associated with flare-type events from magnetars. We provide a set of configurations describing a relativistic, spherical, magnetic plasmoid explosion. We proceed by solving the equations of relativistic magnetohydrodynamics for a system that expands while maintaining its internal equilibrium. We find the interdependent relation between pressure, mass density, Lorentz factor, and magnetic field that determines the detailed properties of the solutions. A dichotomy of solutions exists that correspond to higher and lower density and thermal pressure compared to the external one. For stronger toroidal magnetic fields, the maximum permitted expansion velocity becomes lower than the weaker toroidal fields. These solution classes can be applied to magnetar giant flares and fast radio bursts. Those that corresponding to over densities and higher pressure can be associated with magnetar flares, and those corresponding to underdensities can be relevant to fast radio bursts that correspond to magnetically dominated events with low mass loading. [Abridged]",
    "authors": [
      "Konstantinos N. Gourgouliatos"
    ],
    "published": "2026-01-01T19:00:14Z",
    "updated": "2026-02-22T18:15:37Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2602.19291v1",
    "url": "https://arxiv.org/abs/2602.19291v1",
    "pdf_url": "https://arxiv.org/pdf/2602.19291v1.pdf",
    "title": "Neoclassical transport and profile prediction in transport barriers",
    "abstract": "Strong gradient regions in tokamaks, such as the pedestal or internal transport barriers, are regions of reduced turbulence where neoclassical transport can play a dominant role. However, standard neoclassical transport theory assumes that the gradient length scales of density, temperature, and potential are of the order of the system size. In the pedestal, gradient length scales are much shorter and are measured to be of the order of the ion poloidal gyroradius. We present an extension of neoclassical theory that is applicable in transport barriers of large aspect ratio tokamaks. We show that particle and momentum transport are connected in such a way that a source of parallel momentum can drive a significant neoclassical ion particle flux. In strong gradient regions, density, electric potential, mean parallel flow, and ion temperature are shown to no longer be flux functions. Instead, they have a small but important poloidally varying piece that modifies the transport equations to lowest order. This introduces a nonlinearity in the transport problem through the coupling with quasineutrality that yields multiple co-existing solutions when solving for the plasma profiles. The different solutions could be connected to low and high transport states and jumps between solutions could be an indication of H-L back-transitions.",
    "authors": [
      "Silvia Trinczek",
      "Felix I. Parra"
    ],
    "published": "2026-02-22T17:57:51Z",
    "updated": "2026-02-22T17:57:51Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.19110v1",
    "url": "https://arxiv.org/abs/2602.19110v1",
    "pdf_url": "https://arxiv.org/pdf/2602.19110v1.pdf",
    "title": "Machine learning prediction of plasma behavior from discharge configurations on WEST",
    "abstract": "Accurately predicting plasma behavior based on discharge configurations is essential for the safe and efficient operation of tokamak experiments. While physics-based integrated modeling codes provide valuable insights, their high computational cost limits their applicability for fast scenario design and control optimization. In this study, we propose a transformer-based machine learning model to predict key global plasma parameters on the WEST tokamak, including the normalized beta ($β_{n}$), toroidal beta ($β_{t}$), poloidal beta ($β_{p}$), plasma stored energy ($W_{\\mathrm{mhd}}$), safety factor at the magnetic axis ($q_{0}$), and safety factor at the 95% flux surface ($q_{95}$). The model uses only signals that can be defined before the discharge, such as magnetic coil currents, auxiliary heating power, plasma current reference, and line-averaged plasma density. Trained on 550 discharges from the WEST campaigns, the model demonstrates an average mean square error (MSE) loss of 0.026, an average coefficient of determination $R^{2}$ of 0.94, and achieves inference times on the order of 0.1 seconds. These results highlight the potential of data-driven surrogate models for assisting in discharge planning, scenario evaluation, and real-time control of tokamak plasmas.",
    "authors": [
      "Chenguang Wan",
      "Feda Almuhisen",
      "Philippe Moreau",
      "Remy Nouailletas",
      "Zhisong Qu",
      "Youngwoo Cho",
      "Robin Varennes",
      "Kyungtak Lim",
      "Kunpeng Li",
      "Jia Huang",
      "Weidong Chen",
      "Jiangang Li",
      "Xavier Garbet"
    ],
    "published": "2026-02-22T09:51:14Z",
    "updated": "2026-02-22T09:51:14Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.19104v1",
    "url": "https://arxiv.org/abs/2602.19104v1",
    "pdf_url": "https://arxiv.org/pdf/2602.19104v1.pdf",
    "title": "The Role of Inhomogeneities in the Turbulent Accretion of Black Holes",
    "abstract": "Observations of supermassive black holes by the Event Horizon Telescope reveal significant inhomogeneities, most likely related to density and magnetic field perturbations. To model these features, we conduct high-resolution 2D general-relativistic magnetohydrodynamics (GRMHD) simulations of a Fishbone-Moncrief torus around a Kerr black hole using the Black Hole Accretion Code $\\texttt{BHAC}$. We compare unperturbed accretion with a case featuring plasma density bubbles with pressure balanced magnetic islands of different amplitudes. Power spectrum analysis of accretion time series, performed via the Blackman-Tukey method, shows that the perturbed case exhibits (1) steeper spectral indices compared to the unperturbed case, deviating from the characteristic $1/ω$ noise spectrum, and (2) increased correlation times, providing evidence for absorption of macro-structures at the event horizon. Spatial auto-correlation analysis of near-horizon turbulence confirms larger energy-containing coherent structures in the perturbed case altering the accretion rate. These results provide new insights for interpreting observations of supermassive black hole environments, where near-horizon turbulence may play a key role in the accretion process.",
    "authors": [
      "Giuseppe Ficarra",
      "Michele Arcuri",
      "Rita Megale",
      "Sergio Servidio"
    ],
    "published": "2026-02-22T09:24:46Z",
    "updated": "2026-02-22T09:24:46Z",
    "categories": [
      "gr-qc",
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "gr-qc"
  },
  {
    "arxiv_id": "2602.19081v1",
    "url": "https://arxiv.org/abs/2602.19081v1",
    "pdf_url": "https://arxiv.org/pdf/2602.19081v1.pdf",
    "title": "Nanometer-scale pre-bunched electron beams generated from all-optical plasma-based acceleration",
    "abstract": "High-quality and prebunched electron beams can produce coherent x-rays with high intensity and narrow bandwidth, which is essential for modern light sources. An all-optical scheme based on plasma-based acceleration to produce bright electron beams that are pre-bunched on nanometer-scales is proposed. By using a density modulation created by two low intensity counter-propagating lasers, the phase velocity of the plasma wake excited by an intense driver laser in a uniform plasma can be modulated at a frequency twice that of the colliding lasers and thus turn the injection on and off. The injected electrons are micro-bunched at the Doppler shifted wavelength of the modulated wavelength using the corresponding phase velocity of the gradual expansion of the wakefield. It is demonstrated that by controlling the properties of the drive and colliding lasers, that beams with exotic pre-bunched structures can be produced, which may have critical applications in ultrafast high power x-rays. This extremely compact, all-optical scheme to produce ultra-bright pre-bunched electron beams may therefore enable novel applications for ultrafast x-ray users and arouse general interest in various fields.",
    "authors": [
      "Zhenan Wang",
      "Zewei Xu",
      "Qianyi Ma",
      "Yuhui Xia",
      "Letian Liu",
      "Chenxu Wang",
      "Thamine Dalichaouch",
      "Xueqing Yan",
      "Xinlu Xu",
      "Warren B. Mori"
    ],
    "published": "2026-02-22T07:37:47Z",
    "updated": "2026-02-22T07:37:47Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.18974v1",
    "url": "https://arxiv.org/abs/2602.18974v1",
    "pdf_url": "https://arxiv.org/pdf/2602.18974v1.pdf",
    "title": "How Does The Magnetic Gradient Scale Length Influence Complexity of Filamentary Coils in Stellarators?",
    "abstract": "The distance between the last closed flux surface (LCFS) and the nearest electromagnetic coils is a dominating factor in the cost, size, and engineering difficulty of stellarators. The smallest magnetic gradient scale length on the LCFS - denoted L_gradB - has been shown to be a good proxy for minimum coil-surface distance in optimizations of a current potential on a winding surface, such as through the REGCOIL method. However, it has not been shown the same is true for filament coils, or that the magnetic gradient scale length is an effective objective function in optimization. In this paper, we explore examples in which min(L_gradB) is correlated with the minimum coil-surface distance for filament coils. First, we analyze a subset of the single-stage-optimized equilibria from the QUASR dataset [Giuliani et al. JPP (2024)]. We find that the majority of configurations have min(L_gradB) located nearby the point of closest coil-surface distance. Second, we optimize quasihelically symmetric equilibria to have improved min(L_gradB), and optimize coils via a continuation method. We then traced alpha particles to test confinement. Finally, we compare min(L_gradB) to the minimum coil-surface distance with filament coils optimized for a set of finite beta equilibria with random boundary shapes. For all datasets, we find that min(L_gradB) is correlated with both the minimum coil-surface and coil-coil distances if sufficient coil length is allowed. Even when there is a trade-off with proxies for confinement, optimizing for improved min(L_gradB) can result in better confinement in the presence of coils, up to a point. This is because - when holding coil-coil distance constant - equilibria with lower min(L_gradB) have a larger normal field error dominated by coil ripple causing particle loss. Both can be reduced by increasing coil-surface distance for equilibria with a high min(L_gradB).",
    "authors": [
      "John Kappel",
      "Matt Landreman",
      "Philipp Jurašić",
      "Sophia A Henneberg"
    ],
    "published": "2026-02-21T22:42:34Z",
    "updated": "2026-02-21T22:42:34Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.16297v2",
    "url": "https://arxiv.org/abs/2602.16297v2",
    "pdf_url": "https://arxiv.org/pdf/2602.16297v2.pdf",
    "title": "Characterization of an MPPC-Based Scintillator Telescope and Measurement of Cosmic Muon Angular Distribution",
    "abstract": "This report presents the design, characterization, and application of a high-sensitivity optical detection system based on plastic scintillators coupled to Multi-Pixel Photon Counters (MPPCs). The primary objective was to evaluate the performance of MPPCs (Silicon Photomultipliers) as robust, low-voltage alternatives to traditional photomultiplier tubes for detecting faint scintillation light. The optoelectronic properties of the sensors were analyzed, including single-photoelectron gain calibration and dark count rate measurements, to optimize the signal-to-noise ratio. By embedding wavelength-shifting fibers to enhance light collection efficiency, the system was configured into a three-fold coincidence telescope. The angular distribution of the cosmic ray muon flux was measured to validate the detector's stability and geometric acceptance. Fitting the experimental data to a $\\bm{\\cos^n(θ)}$ distribution yielded an angular exponent of $\\bm{n = 1.44 \\pm 0.06}$, consistent with literature values. These results demonstrate the efficacy of the MPPC-scintillator coupling for precise photon counting and timing applications in high-energy physics instrumentation.",
    "authors": [
      "Sahla Manithottathil",
      "Anuj Gupta",
      "Mudit Kumar",
      "Navaneeth Poonthottathil"
    ],
    "published": "2026-02-18T09:27:39Z",
    "updated": "2026-02-21T18:15:07Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.12645v2",
    "url": "https://arxiv.org/abs/2601.12645v2",
    "pdf_url": "https://arxiv.org/pdf/2601.12645v2.pdf",
    "title": "Radio-frequency pulse design in local rotating frame in magnetic resonance imaging",
    "abstract": "The problem of spatially selective radio-frequency (RF) pulse design in magnetic resonance imaging (MRI) is typically stated in the form of determining, analytically or numerically, RF waveforms to be applied in synchrony with one or more predetermined gradient waveforms. In most cases, the dynamics of the nuclear spin magnetization under the RF and gradient fields is described in a global rotating frame that cancels the effect of the static (main) magnetic field B0. In this work, we consider an alternative frame of reference, which can be called a local rotating frame where total longitudinal magnetic field (B0 plus gradient) in every voxel is zero. In this frame, the effect of time-dependent gradient field is integrated out, and the remaining magnetization dynamics, governed by much weaker RF fields, becomes both simpler and slower. We show that recasting existing RF design methods in such a frame provides useful insights and techniques that are not obvious in the conventional description. The methods we consider include (i) two-dimensional spatial RF pulse design in the excitation k-space, (ii) Shinnar-Le Roux RF design, (iii) residual phase calculation in slice-selective excitation, and (iv) iterative and numerical solutions for multi-coil RF pulse design. In particular, we show that the new formalism can substantially reduce the Bloch simulation time which can greatly benefit iterative pulse designs in parallel transmit. In all, the proposed framework provides considerable theoretical insights and practical utility for RF pulse design in MRI.",
    "authors": [
      "Seung-Kyun Lee"
    ],
    "published": "2026-01-19T01:35:18Z",
    "updated": "2026-02-21T14:05:55Z",
    "categories": [
      "physics.ins-det",
      "physics.med-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.12945v2",
    "url": "https://arxiv.org/abs/2602.12945v2",
    "pdf_url": "https://arxiv.org/pdf/2602.12945v2.pdf",
    "title": "Cross-correlation on a single channel for resistance noise measurements",
    "abstract": "This work has been submitted to the IEEE for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible.   Cross-correlation is an established tool to reduce the background in resistance noise measurements. However, the conventional method requires the amplifier, demodulator and digitizer channels to be duplicated, increasing the cost and complexity of the measurement circuit. We propose an alternating-current technique that allows cross-correlation with only a single channel by modulating the device under test with two carrier frequencies simultaneously. Using multiple software-based demodulators, we show that this method produces accurate amplitude measurements and noise spectra. The signal-to-noise-ratio is improved by 7 dB, and longer measurement durations increase this improvement.",
    "authors": [
      "Tim Thyzel"
    ],
    "published": "2026-02-13T14:07:48Z",
    "updated": "2026-02-21T13:47:28Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.07144v2",
    "url": "https://arxiv.org/abs/2510.07144v2",
    "pdf_url": "https://arxiv.org/pdf/2510.07144v2.pdf",
    "title": "Chaotic Motion of Ions In Finite-amplitude Low-frequency Alfvén Waves",
    "abstract": "Finite-amplitude low-frequency Alfvén waves (AWs) are ubiquitous in space plasmas, where they play a key role in the transport and dissipation of energy, particularly in the heating of ions in the solar corona and solar wind. In this study, we investigate the nonlinear interaction between ions and obliquely propagating AWs. When the wave amplitude and propagation angle lie within specific ranges, ion motion becomes chaotic. We quantify this behavior using the maximum Lyapunov exponent ($λ_{\\mathrm{m}}$) and define a new parameter, the Chaos Ratio (CR), to describe the fraction of chaotic particles across different initial states. The global chaos threshold is determined as the contour CR = 0.01. Analysis of magnetic moment variations reveals that the physical origin of chaos is pitch-angle scattering induced by \\textit{wave-driven field-line curvature} (WFLC), which disrupts adiabatic invariance and leads to stochastic ion energization. The onset condition for chaos can be expressed by an effective relative curvature radius, $P_{eff.} < 25$. This analytical criterion delineates the boundary of the chaotic region in the ($k_x$, $k_z$, $B_w$) parameter space and agrees well with numerical results. The identified WFLC mechanism provides a new physical pathway for converting macroscale Alfvénic disturbances into microscopic ion heating. \\textbf{This analysis offers a simplified model that illustrates a plausible ion energization mechanism in Alfvénic turbulent plasmas}, including those associated with solar wind switchbacks and coronal fluctuations. These results highlight a universal chaotic process that may underlie stochastic heating in heliospheric and astrophysical plasmas.",
    "authors": [
      "Jingyu Peng",
      "Jiansen He",
      "Rong Lin"
    ],
    "published": "2025-10-08T15:45:40Z",
    "updated": "2026-02-21T07:04:35Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.3847/1538-4357/ae3f1c"
  },
  {
    "arxiv_id": "2602.18706v1",
    "url": "https://arxiv.org/abs/2602.18706v1",
    "pdf_url": "https://arxiv.org/pdf/2602.18706v1.pdf",
    "title": "Fast reconnection in a coronal torn plasma sheet",
    "abstract": "Tearing instability, also known as plasmoid instability, is an effective mechanism to speed up magnetic reconnection process, working in a wide range of magnetized plasma systems with different spatial scales, ionization degrees, and collisionality. However, due to observational limitations, observations of {plasma sheet} tearing and the resulting plasmoids are rather scarce. This scarcity significantly hinders our understanding of the role of plasmoids in the reconnection process from an observational perspective. Using high-spatiotemporal multiwavelength observations from the Solar Dynamics Observatory, we traced the entire evolution of a coronal {plasma sheet}. Its formation was driven by the emergence of photospheric magnetic flux, followed by tearing, and eventual decay. The evolution of the {plasma sheet} exhibited two distinct stages. Initially, it rose rapidly, lengthened, and underwent tearing at a low frequency. Subsequently, its ascent slowed, it began to shorten, and the tearing occurred more frequently. Detailed analysis of the reconnecting {plasma sheet} focuses on heating, plasmoid dynamics (formation and ejection), and the resulting reconnection rate change. Two key heating processes are identified: {plasma sheet} tearing and coalescence involving plasmoids and magnetic cusps. More importantly, combining observations with analytical studies suggests that plasmoids are key carriers of magnetic flux fast transferring in the observed torn {plasma sheet}, and their formation and ejection significantly enhance the reconnection rate and facilitate the onset of fast reconnection.",
    "authors": [
      "Zehao Tang"
    ],
    "published": "2026-02-21T03:39:15Z",
    "updated": "2026-02-21T03:39:15Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2601.12622v2",
    "url": "https://arxiv.org/abs/2601.12622v2",
    "pdf_url": "https://arxiv.org/pdf/2601.12622v2.pdf",
    "title": "Direct in-chamber radon-220 (thoron) emanation measurements for rare-event physics experiments",
    "abstract": "Measuring radon emanation from detector materials is a key method for controlling radon, a significant background in rare-event physics experiments. Methods for measuring radon emanation are well-established but have predominantly focused on the 222Rn isotope, the dominant radon isotope for these backgrounds. However, measurements of 220Rn (thoron), the second most abundant radon isotope, remain relatively unexplored. 220Rn emanation measurements are challenging because the 220Rn must be transferred from the emanation chamber to the active detector within its short 55 s half-life. In this study, a direct in-chamber approach for measuring 220Rn emanation is presented in which the sample is placed directly within the active detector chamber, thereby minimising losses during transfer. The method was demonstrated with a DURRIDGE RAD8 electrostatic radon detector, which measured 220Rn emanation from low-activity thoriated rods with an activity of 76 +/- 20 mBq. Compared with a conventional flowthrough 220Rn emanation setup, the in-chamber method increased sensitivity by a factor of 3. Using helium as the carrier gas provided a further sensitivity increase, giving an overall sensitivity gain of ~5. These results indicate that in-chamber 220Rn emanation measurements provide an effective tool for low-background experiments and have the potential to accelerate radon studies by exploiting the shorter half-life of 220Rn.",
    "authors": [
      "R. R. Marcelo Gregorio",
      "F. Dastgiri",
      "A. Basharina-Freshville",
      "V. U. Bashu",
      "A. Cottle",
      "L. J. Bignell",
      "C. Ghag",
      "G. J. Lane",
      "A. G. McLean",
      "N. J. C. Spooner"
    ],
    "published": "2026-01-18T23:29:34Z",
    "updated": "2026-02-21T00:50:16Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.18667v1",
    "url": "https://arxiv.org/abs/2602.18667v1",
    "pdf_url": "https://arxiv.org/pdf/2602.18667v1.pdf",
    "title": "A tutorial on inversion-based shape control with design application to NSTX-U",
    "abstract": "One of the most common designs for magnetic control in tokamaks is to ``linearize an equilibrium'' to obtain a sensitivity mapping, then invert this mapping in order to determine the feedback control currents or voltages. For this work, we refer to this broad class of methods as inversion-based shape control (IBSC). In this work we describe the IBSC framework in a comprehensive manner and show how variations such as using dynamic voltage mappings and quadratic-program constrained control fit naturally into the framework. Despite the prevalence of IBSC, some of these extensions and the challenges associated with specific variations of IBSC are less widely known. We pay special attention to the challenge of decoupling the interaction between shape control and vertical control, which was a source of degraded vertical control performance on NSTX-U. This work is intended to provide a systematic overview of IBSC, and to that end, we have provided background material, proposed design procedures, and tutorials on the magnetic control design process within the appendices. Applying the systematic design procedure to NSTX-U, we find that the vertical control bobble on NSTX-U can be removed via decoupling, and that the vertical control phase margin can be improved by 6 degrees just by including PF1A and PF2 as vertical actuators.",
    "authors": [
      "J. T. Wai",
      "M. D. Boyer",
      "D. J. Battaglia",
      "F. Carpanese",
      "F. Felici",
      "W. P. Wehner",
      "A. S. Welander",
      "E. Kolemen"
    ],
    "published": "2026-02-21T00:28:39Z",
    "updated": "2026-02-21T00:28:39Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.13272v2",
    "url": "https://arxiv.org/abs/2509.13272v2",
    "pdf_url": "https://arxiv.org/pdf/2509.13272v2.pdf",
    "title": "Ionization and temperature measurements in warm dense copper using x-ray absorption spectroscopy",
    "abstract": "We detail experimental results inferring ionization and temperature for warm dense copper plasmas at several times solid density (15 to 25 g/cm$^3$) and temperatures of 10 to 21 eV. Experiments performed at the OMEGA Laser Facility generate uniform warm dense matter conditions via symmetric shock compression of a buried copper layer. The plasma is probed with a laser-generated x-ray source to collect the K-shell x-ray absorption spectrum. Fitting bound-bound absorption contributions from constituent charge states of copper provides an estimated $\\overline{Z}$ of approximately 4 to 7 for these warm dense copper plasmas. We find that these partially ionized plasmas have K-edge shifts of 12 to 30 eV and bound-bound resonance 1s$\\rightarrow$3p absorption shifts of 4 to 26 eV with respect to the cold K-edge. This study provides necessary experimental data to improve ionization and opacity models in the warm dense matter regime.",
    "authors": [
      "T. Cordova",
      "E. V. Marley",
      "D. A. Chin",
      "R. A. London",
      "H. A. Scott",
      "M. K. G. Kruse",
      "T. Döppner",
      "F. N. Beg",
      "F. Coppari",
      "M. Millot",
      "J. Emig",
      "S. B. Hansen",
      "P. M. Nilson",
      "P. Sterne",
      "M. J. MacDonald"
    ],
    "published": "2025-09-16T17:29:32Z",
    "updated": "2026-02-20T22:34:10Z",
    "categories": [
      "hep-ex",
      "physics.plasm-ph"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2602.18619v1",
    "url": "https://arxiv.org/abs/2602.18619v1",
    "pdf_url": "https://arxiv.org/pdf/2602.18619v1.pdf",
    "title": "Suppression of Electromagnetic Pulses from Laser-Target Interactions by Strong Magnetic Fields",
    "abstract": "Laser-target interactions generate intense electromagnetic pulses (EMP) that can interfere with measurements and damage equipment. In this paper we show that applying a magnetic field to nanosecond pulse laser-target interactions decreases the magnitude of EMP. We demonstrate this effect in two experiments with different geometries (spherical vs. planar), laser intensities (${\\sim}10^{13}$ vs. ${\\sim} 10^{15}$~W/cm$^2$) and applied field strength (12~T vs. 0.1~T) that both observed suppression of EMP in the ${\\sim} 1$~GHz band (by factors of $0.65\\times$ and $0.32\\times$ respectively). We then observe the opposite effect at high intensities with a picosecond pulse: for planar experiments with laser intensities ${\\sim}10^{19}$~W/cm$^2$ and magnetic fields of 6--10~T, the magnitude of EMP is increased by a factor of $1.75\\times$. These results provide a benchmark for models of EMP generation, but suggest that magnetic fields are not a viable solution for mitigating EMP on the high intensity laser facilities where it is most damaging.",
    "authors": [
      "P. V. Heuer",
      "J. L. Peebles",
      "J. R. Davies",
      "D. H. Barnak",
      "B. Stanley",
      "N. Pelepchan",
      "M. Cufari",
      "J. A. Frenje",
      "C. Niemann",
      "N. A. Rongione",
      "C. Constantin",
      "E. Cisneros",
      "P. Pribyl",
      "H. Sio",
      "H. Chen"
    ],
    "published": "2026-02-20T21:17:48Z",
    "updated": "2026-02-20T21:17:48Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.15946v2",
    "url": "https://arxiv.org/abs/2602.15946v2",
    "pdf_url": "https://arxiv.org/pdf/2602.15946v2.pdf",
    "title": "On-chip probabilistic inference for charged-particle tracking at the sensor edge",
    "abstract": "Modern scientific instruments operate under increasingly extreme constraints on bandwidth, latency, and power. Inference at the sensor edge determines experimental data collection efficiency by deciding which information to save for further analysis. Particle tracking detectors at the Large Hadron Collider exemplify this challenge: pixelated silicon sensors generate rich spatiotemporal ionization patterns, yet most of this information is discarded due to data-rate limitations. Concurrently, advancements in co-design tools provide rapid turn-around for incorporating machine learning into application-specific integrated circuits, motivating designs for particle detectors with new integrated technologies. We demonstrate that neural networks embedded in the front-end electronics can infer charged-particle kinematic parameters from a single silicon layer. We regress hit positions and incident angles with calibrated uncertainties, while satisfying stringent constraints on numerical precision, latency, and silicon area. Our results establish a path toward probabilistic inference directly at the edge, opening new opportunities for intelligent sensing in high-rate scientific instruments.",
    "authors": [
      "Arghya Ranjan Das",
      "David Jiang",
      "Rachel Kovach-Fuentes",
      "Shiqi Kuang",
      "Ana Sofía Calle Muñoz",
      "Danush Shekar",
      "Jennet Dickinson",
      "Giuseppe Di Guglielmo",
      "Lindsey Gray",
      "Mia Liu",
      "Corrinne Mills",
      "Mark S. Neubauer",
      "Daniel Abadjiev",
      "Anthony Badea",
      "Doug Berry",
      "Karri DiPetrillo",
      "Farah Fahim",
      "Abhijith Gandrakota",
      "Harshul Gupta",
      "James Hirschauer",
      "Eliza Howard",
      "Ron Lipton",
      "Petar Maksimovic",
      "Nick Manganelli",
      "Benjamin Parpillon",
      "Jannicke Pearkes",
      "Ricardo Silvestre",
      "Morris Swartz",
      "Chinar Syal",
      "Nhan Tran",
      "Amit Trivedi",
      "Keith Ulmer",
      "Mohammad Abrar Wadud",
      "Benjamin Weiss",
      "Eric You"
    ],
    "published": "2026-02-17T19:03:17Z",
    "updated": "2026-02-20T19:36:35Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.16401v3",
    "url": "https://arxiv.org/abs/2509.16401v3",
    "pdf_url": "https://arxiv.org/pdf/2509.16401v3.pdf",
    "title": "Quantifying the Effects of Parameters in Widespread SEP Events with EPREM",
    "abstract": "The Energetic Particle Radiation Environment Model (EPREM) solves the focused transport equation (FTE) on a Lagrangian grid in a frame co-moving with the solar wind plasma and simulates the acceleration and transport of solar energetic particles (SEP) in the heliosphere. When not coupled to an external magnetohydrodynamic model, EPREM functions in an uncoupled mode where an ideal cone-shock is injected into a homogeneous background solar wind. We carried out an analysis of the effects of multiple physical parameters in producing widespread SEP events simulated by the uncoupled EPREM using a relatively simple model of a strong magnetized shock propagating radially outward through the inner heliosphere to produce the requisite MHD quantities for EPREM's sophisticated model of proton acceleration and transport. We compared a baseline simulation with seven variations in which the value of a single parameter differed from its baseline value. All simulations exhibit complex profiles of SEP flux as a function of time and energy, with clear dependence on parameters related to diffusion, mean free path, and shock profile. Moreover, while all simulations exhibit significant longitudinal spread in SEP flux, for certain parameter values there exists a decrease or absence in SEP flux at observers located $\\geq 90^\\circ$ from the shock origin. Relating the differences in SEP flux to the specific values of each parameter in the simulations provides insight into the morphology of observed SEP events and the state of the solar wind through which the driving CME propagates.",
    "authors": [
      "Matthew A. Young",
      "Bala Poduval"
    ],
    "published": "2025-09-19T20:23:20Z",
    "updated": "2026-02-20T18:37:12Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2602.18544v1",
    "url": "https://arxiv.org/abs/2602.18544v1",
    "pdf_url": "https://arxiv.org/pdf/2602.18544v1.pdf",
    "title": "The Free-Electron Laser Model of Magnetospheric Chorus",
    "abstract": "Chorus waves are electromagnetic waves named for their resemblance to birds chirping at dawn when their radio frequencies are played as audio. The amplification of chorus in Earth's magnetosphere has been the subject of intense scientific inquiry since the discovery of the Van Allen radiation belts in 1958. Resonant interactions between chorus and radiation belt electrons can lead to the exponential growth of small seed waves by a factor of fifty within milliseconds. These powerful modes can cause rapid acceleration of electrons and endanger space-based technologies. Recent efforts to understand chorus amplification have drawn upon parallels to free-electron lasers, laboratory devices that generate intense coherent light with tunable frequencies. This approach, known as the free-electron laser model of magnetospheric chorus, is the subject of this dissertation. In this work, we build on previous research on the free-electron laser model, ultimately presenting a novel nonlinear model of whistler-mode chorus in the magnetosphere. In the first chapter, we provide a brief introduction to whistlers, magnetospheric chorus, and free-electron lasers. We also derive the 2N+2 equations foundational to the interaction of chorus with N resonant electrons. In the second chapter, we derive a reduced set of just three nonlinear equations using the method of collective variables. We then derive a Ginzburg-Landau equation (GLE) for the behavior of a chorus wave packet with a spectrum of frequencies with spatially varying amplitudes and discuss the prediction of solitary chorus waves. In the third chapter, we focus on the behavior of the single-mode solutions predicted by the GLE, including their linear stability and the phenomenon of mode condensation, where a single mode can emerge from a noisy spectrum. In the final chapter, we summarize the results and discuss open questions and future directions.",
    "authors": [
      "Brandon Bonham"
    ],
    "published": "2026-02-20T16:32:24Z",
    "updated": "2026-02-20T16:32:24Z",
    "categories": [
      "physics.space-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2602.18318v1",
    "url": "https://arxiv.org/abs/2602.18318v1",
    "pdf_url": "https://arxiv.org/pdf/2602.18318v1.pdf",
    "title": "Prompt Gamma Timing in Carbon Therapy: First Experimental Results with the TIARA Detector",
    "abstract": "In the context of range monitoring for particle therapy, this study presents the first experimental results obtained with the TIARA detector using carbon-ion beams at the CNAO clinical center in Pavia, Italy. TIARA is based on the Prompt Gamma Timing (PGT) technique, which measures the time of flight (TOF) between incident ions and prompt gamma rays (PGs) emitted during nuclear interactions in the target. While the TIARA prototype has previously been validated with protons, carbons present a more challenging scenario due to their higher linear energy transfer, nuclear fragmentation products, and the continuous beam time structure of synchrotron accelerators. Experiments were performed by irradiating PMMA targets of different thicknesses with 200 MeV/u carbon beams. A coincidence time resolution of 279$\\pm$35 ps FWHM was achieved, outperforming results previously obtained with protons at the same facility. A range accuracy of 4.74$\\pm$0.36 mm at a 2$σ$ confidence level was measured at clinical intensity, when considering 5600 detected PGs, corresponding to the grouping of four irradiation spots of 2.4$\\cdot$10$^6$ ions each. Overall, the results demonstrate that PGT-based range monitoring remains viable for carbon-ion beams, although increased background from secondary protons indicates that detector configuration adaptations are required.",
    "authors": [
      "Maxime Pinson",
      "Adélie André",
      "Yannick Boursier",
      "Mathieu Dupont",
      "Marie-Laure Gallin Martel",
      "Alicia Garnier",
      "Christophe Hoarau",
      "Pavel Kavrigin",
      "Daniel Maneval",
      "Christian Morel",
      "Jean-François Muraz",
      "Marco Pullia",
      "Simone Savazzi",
      "Sara Marcatili"
    ],
    "published": "2026-02-20T16:18:02Z",
    "updated": "2026-02-20T16:18:02Z",
    "categories": [
      "physics.med-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.med-ph"
  }
]