{
  "arxiv_id": "1501.02747v2",
  "url": "https://arxiv.org/abs/1501.02747v2",
  "pdf_url": "https://arxiv.org/pdf/1501.02747v2.pdf",
  "title": "A detailed and unified treatment of spin-orbit systems using tools distilled from the theory of bundles",
  "abstract": "We return to our study \\cite{BEH} of invariant spin fields and spin tunes for polarized beams in storage rings but in contrast to the continuous-time treatment in \\cite{BEH}, we now employ a discrete-time formalism, beginning with the $\\rm{Poincar\\acute{e}}$ maps of the continuous time formalism. We then substantially extend our toolset and generalize the notions of invariant spin field and invariant frame field. We revisit some old theorems and prove several theorems believed to be new. In particular we study two transformation rules, one of them known and the other new, where the former turns out to be an $SO(3)$-gauge transformation rule. We then apply the theory to the dynamics of spin-$1/2$ and spin-$1$ particle bunches and their density matrix functions, describing semiclassically the particle-spin content of bunches. Our approach thus unifies the spin-vector dynamics from the T-BMT equation with the spin-tensor dynamics and other dynamics. This unifying aspect of our approach relates the examples elegantly and uncovers relations between the various underlying dynamical systems in a transparent way. As in \\cite{BEH}, the particle motion is integrable but we now allow for nonlinear particle motion on each torus. Since this work is inspired by notions from the theory of bundles, we also provide insight into the underlying bundle-theoretic aspects of the well-established concepts of invariant spin field, spin tune and invariant frame field. Since we neglect, as is usual, the Stern-Gerlach force, the underlying principal bundle is of product formso that we can present the theory in a fashion which does not use bundle theory. Nevertheless we occasionally mention the bundle-theoretic meaningof our concepts and we also mention the similarities with the geometrical approach to Yang-Mills Theory.",
  "authors": [
    "Klaus Heinemann",
    "Desmond P. Barber",
    "James A. Ellison",
    "Mathias Vogt"
  ],
  "published": "2015-01-12T18:34:22Z",
  "updated": "2026-01-19T22:12:30Z",
  "categories": [
    "physics.acc-ph"
  ],
  "primary_category": "physics.acc-ph"
}