{
  "arxiv_id": "2601.18470v1",
  "url": "https://arxiv.org/abs/2601.18470v1",
  "pdf_url": "https://arxiv.org/pdf/2601.18470v1.pdf",
  "title": "Design and modeling of a liquid-lead dump concept for beamstrahlung radiation absorption in the CERN Future Circular e$^+$e$^-$ Collider",
  "abstract": "The electron-positron Future Circular Collider (FCC-ee) being developed at CERN will generate intense beamstrahlung radiation, thus requiring photon absorbers downstream of the interaction points. This work presents the conceptual design of flowing-liquid-lead absorbers capable of dissipating around 370 kW of photon power, with a mean photon energy of 62 MeV. Two configurations are investigated: an inclined-flow geometry, developed to increase the photon interaction length to maximize absorption, and a compact upstream slope with an additional pool, in which a free-surface lead flow intercepts the power peak before a downstream pool dissipates the remaining load. Photon-matter interactions are modeled using Monte Carlo simulations in fluka, while conjugate heat-transfer and free-surface dynamics are analyzed through computational-fluid-dynamics simulations using ansys fluent. Design refinements are introduced based on the simulated thermal and hydraulic performance and to mitigate secondary effects such as photon backscattering. Both configurations demonstrate stable operation within the 300 kg/s flow limit and maintain liquid-lead and structural temperatures within the operational range of 450--500 $^{\\circ}$C. The results establish circulating liquid lead as a feasible and thermally robust baseline technology for beamstrahlung absorption in FCC-ee.",
  "authors": [
    "Silvio Candido",
    "Rui Franqueira Ximenes",
    "Anton Lechner",
    "Alessandro Frasca",
    "Giuseppe Lerner",
    "Antonio Perillo Marcone",
    "Regis Seidenbinder",
    "Markus Widorski",
    "Louise Jorat",
    "Giacomo Lavezzari",
    "Davide Bozzato",
    "Gabriel Banks",
    "Marco Calviani",
    "Luca Tricarico",
    "Carlo Carrelli",
    "Mariano Tarantino"
  ],
  "published": "2026-01-26T13:19:01Z",
  "updated": "2026-01-26T13:19:01Z",
  "categories": [
    "physics.acc-ph"
  ],
  "primary_category": "physics.acc-ph"
}