[
  {
    "arxiv_id": "2602.06684v1",
    "url": "https://arxiv.org/abs/2602.06684v1",
    "pdf_url": "https://arxiv.org/pdf/2602.06684v1.pdf",
    "title": "First results from the E302 efficiency$\\unicode{x2013}$instability experiment at the FACET-II facility",
    "abstract": "The beam-breakup (BBU) instability in plasma accelerators is seeded by a transverse offset between the driver and a trailing bunch. The BBU instability induces oscillations in the trailing bunch, which are detrimental to its beam quality. When the instability is large, assuming little mitigation from ion motion and energy spread, the beam suffers emittance growth, and charge can be kicked transversely out of the plasma channel. The detrimental effect on beam quality is substantially worse at high efficiencies, which places constraints on the achievable power efficiency in applications such as linear colliders, where maintaining the beam quality is required. In this paper, we present the first experimental signatures of the BBU instability in data taken in the E302 experiment at the FACET-II facility at SLAC National Accelerator Laboratory. We use a specific beam-optical setup and a novel method to probe for transverse instabilities on diagnostic screens downstream of a magnetic dipole spectrometer. We complement the analysis with full 3D particle-in-cell (PIC) simulations of the plasma interaction using similar driver and trailing bunch parameters on a simulated FACET-II spectrometer.",
    "authors": [
      "O. G. Finnerud",
      "E. Adli",
      "R. Ariniello",
      "S. Corde",
      "T. N. Dalichaouch",
      "C. Emma",
      "S. Gessner",
      "C. Hansel",
      "M. J. Hogan",
      "C. Joshi",
      "D. Kalvik",
      "A. Knetsch",
      "C. A. Lindstrøm",
      "M. Litos",
      "N. Majernik",
      "K. A. Marsh",
      "B. D. O'Shea",
      "I. Rajkovic",
      "S. Rego",
      "D. Storey",
      "C. Zhang"
    ],
    "published": "2026-02-06T13:16:43Z",
    "updated": "2026-02-06T13:16:43Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.06483v1",
    "url": "https://arxiv.org/abs/2602.06483v1",
    "pdf_url": "https://arxiv.org/pdf/2602.06483v1.pdf",
    "title": "Synchronization of Synchrotron Radiation Bursts during a spatio-temporal Instability in accelerator-Based source",
    "abstract": "Synchronization is a fundamental phenomenon in dynamical systems, occurring in a wide range of contexts such as mechanical, chemical, biological, and social systems. In this work, we explore a novel manifestation of synchronization in accelerator-based light sources, specifically in storage rings where relativistic electron bunches circulate and emit synchrotron radiation, used for user experiments. In such systems, a systematic spatio-temporal instability arises when the bunch contains a large number of electrons. This instability is characterized by the spontaneous formation of microstructures within the bunch, which appear with a bursting behavior. We demonstrate that these bursting events can be synchronized with an external sinusoidal signal by modulating the electric field in a radiofrequency (RF) cavity. This external modulation induces typical synchronization features such as Arnold tongues at fundamental, harmonic, and subharmonic frequencies of the natural bursting rate, as well as phase-slip phenomena near the synchronization threshold. The synchronization mechanism is analyzed using numerical simulations based on the Vlasov-Fokker-Planck equation, and a proof-of-principle experiment is conducted at the SOLEIL synchrotron facility.",
    "authors": [
      "C. Evain",
      "A. -A. Diallo",
      "E. Roussel",
      "C. Szwaj",
      "M. Herda",
      "M. -A. Tordeux",
      "F. Ribeiro",
      "M. Labat",
      "N. Hubert",
      "J. -B. Brubach",
      "P. Roy",
      "S. Bielawski"
    ],
    "published": "2026-02-06T08:21:49Z",
    "updated": "2026-02-06T08:21:49Z",
    "categories": [
      "nlin.AO",
      "physics.acc-ph"
    ],
    "primary_category": "nlin.AO"
  },
  {
    "arxiv_id": "2602.05782v1",
    "url": "https://arxiv.org/abs/2602.05782v1",
    "pdf_url": "https://arxiv.org/pdf/2602.05782v1.pdf",
    "title": "Vacuum Brazing",
    "abstract": "First, we describe vacuum brazing and vacuum soldering. Then, we demonstrate how vacuum assists in reducing specific metal oxides, significantly enhancing the wetting of the braze material. Examples of metal-to-metal brazing and soldering are provided. The brazing of large accelerating cavities, specifically Radio Frequency Quadrupoles (RFQ), is then explained in more detail to present a comprehensive procedure tailored for high-precision, large-scale assemblies. Finally, we discuss the process of brazing ceramics using both techniques: with metallisation and with active brazing alloy.",
    "authors": [
      "Serge Mathot"
    ],
    "published": "2026-02-05T15:39:17Z",
    "updated": "2026-02-05T15:39:17Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.20356v2",
    "url": "https://arxiv.org/abs/2512.20356v2",
    "pdf_url": "https://arxiv.org/pdf/2512.20356v2.pdf",
    "title": "Optimizing the interaction geometry of inverse Compton scattering x-ray sources",
    "abstract": "Inverse Compton scattering (ICS) is a promising method for generating coherent and tunable x-rays in a compact setup. In this paper, we present a theoretical framework describing the output of an ICS x-ray source for arbitrary interaction angles between pulsed electron and laser beams. This allows for analytic optimization of the x-ray beam properties by varying the parameters defining the geometry. In general, different x-ray applications require optimization of different x-ray beam properties, such as energy spread for x-ray spectroscopy and angular spread for x-ray scattering measurements. In this paper, we restrict ourselves to optimization of the x-ray brilliance, which is a comprehensive figure of merit for x-ray beam quality. We investigate two specific ICS interaction geometries in particular: head-on scattering of a laser beam off an electron beam; and scattering of a laser beam off an electron beam in a co-propagating geometry, interacting under a grazing angle. For head-on scattering we show that a tightly focused, cylindrically symmetric laser pulse, which balances laser intensity and interaction time, optimizes the x-ray brilliance. For a co-propagating, grazing angle geometry, an elliptical focus of the laser pulse is required to mitigate the effect of a reduced interaction time. We find that the latter geometry is especially useful for soft x-ray generation.",
    "authors": [
      "C. W. Sweers",
      "O. J. Luiten"
    ],
    "published": "2025-12-23T13:37:11Z",
    "updated": "2026-02-05T10:43:15Z",
    "categories": [
      "physics.acc-ph",
      "physics.optics"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.05530v1",
    "url": "https://arxiv.org/abs/2602.05530v1",
    "pdf_url": "https://arxiv.org/pdf/2602.05530v1.pdf",
    "title": "High-intensity LINACS: Dynamics, Instabilities and Mitigations",
    "abstract": "In this lecture we discuss the intensity limitations in hadron LINACs. First, we will detail what are the two main meanings of intensity limitations as they differ substantially between high power LINACs and high brightness LINACs. Then we will illustrate in detail the building blocks of hadron linacs focusing on the beam dynamics. We will conclude with few examples of intensity limitations and their mitigations.",
    "authors": [
      "Alessandra Lombardi"
    ],
    "published": "2026-02-05T10:42:58Z",
    "updated": "2026-02-05T10:42:58Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.05518v1",
    "url": "https://arxiv.org/abs/2602.05518v1",
    "pdf_url": "https://arxiv.org/pdf/2602.05518v1.pdf",
    "title": "Three-Dimensional Spiral Beam Injection:Design Principles and Experimental Verification",
    "abstract": "A proof of principle experiment of Three-dimensional spiral beam injection scheme has been carried out. This injection scheme requires a strongly x-y coupled beam to meet magnetic field distribution through solenoid magnet fringe field. In this paper, we introduce outline of experimental setup, results of x-y coupling adjustment with DC electron beam of 80 keV. The results of this experiment will be evaluated and improvements for actual operation will be discussed.",
    "authors": [
      "Hiromi Iinuma",
      "Ryota Matsushita",
      "Muhammad Abdul Rehman",
      "Hisayoshi Nakayama",
      "Satoshi Ohsawa",
      "Kazuro Furukawa"
    ],
    "published": "2026-02-05T10:23:36Z",
    "updated": "2026-02-05T10:23:36Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2503.20904v4",
    "url": "https://arxiv.org/abs/2503.20904v4",
    "pdf_url": "https://arxiv.org/pdf/2503.20904v4.pdf",
    "title": "Experimental evidence of production of directional muons from a laser-wakefield accelerator",
    "abstract": "We report on experimental evidence of the generation of directional muons from a laser-wakefield accelerator driven by a PW-class laser. The muons were generated following the interaction of a GeV-scale high-charge electron beam with a 2cm-thick Pb target and were detected using a Timepix3 detector placed behind a suitable shielding configuration. Data analysis indicates a $(99.1\\pm0.5)$% confidence of muon detection over noise, in excellent agreement with numerical modelling. Extrapolation of the experimental setup to higher electron energies and charges suggests the potential to guide and separate from noise approximately $10^4$ muons/s onto cm$^2$-scale areas for applications using a 10 Hz PW laser. These results demonstrate the possibility of generating and transporting directional muon beams using high-power lasers and establish a foundation for the systematic application of laser-driven high-energy muon beams.",
    "authors": [
      "L. Calvin",
      "E. Gerstmayr",
      "C. Arran",
      "L. Tudor",
      "T. Foster",
      "K. Fleck",
      "B. Bergmann",
      "D. Doria",
      "B. Kettle",
      "H. Maguire",
      "V. Malka",
      "P. Manek",
      "S. P. D. Mangles",
      "P. McKenna",
      "R. E. Mihai",
      "S. Popa",
      "C. Ridgers",
      "J. Sarma",
      "P. Smolyanskiy",
      "R. Wilson",
      "R. M. Deas",
      "G. Sarri"
    ],
    "published": "2025-03-26T18:19:07Z",
    "updated": "2026-02-04T12:24:03Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.02894v2",
    "url": "https://arxiv.org/abs/2508.02894v2",
    "pdf_url": "https://arxiv.org/pdf/2508.02894v2.pdf",
    "title": "Nb3Sn coating of SRF cavity by co-sputtering from a composite target",
    "abstract": "We deposited Nb3Sn film on the inner surface of a 2.6 GHz Nb superconducting radiofrequency (SRF) cavity by co-sputtering using a composite of Nb and Sn tube targets in a DC cylindrical magnetron sputtering system, followed by thermal annealing of the coated cavity. An aluminum mockup cavity, replicating a 2.6 GHz Nb SRF cavity geometry, was utilized to optimize deposition parameters, resulting in co-sputtered Nb-Sn films with Sn content of 32 - 42 at. % on the beam tubes and equator positions. Several annealing conditions were investigated to improve the surface homogeneity of the Nb3Sn film. The best co-sputtered Nb-Sn film was achieved after annealing at 600 C for 6 h, followed by annealing at 950 C for 1 h. The best process was applied to a Nb cavity, which was RF tested in a cryogenic dewar. RF testing of the Nb3Sn-coated cavity demonstrated a superconducting transition temperature (Tc) close to the highest reported, at 17.78 K. The Nb3Sn cavity underwent a light Sn recoating process, followed by additional RF testing, resulting in enhancement of the RF performance, primarily due to improved surface homogeneity of the Nb3Sn coating.",
    "authors": [
      "Md Sharifuzzaman Shakel",
      "Grigory V. Eremeev",
      "Anne-Marie Valente-Feliciano",
      "Uttar Pudasaini",
      "Hani E. Elsayed-Ali"
    ],
    "published": "2025-08-04T20:46:17Z",
    "updated": "2026-02-03T20:40:13Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.03754v1",
    "url": "https://arxiv.org/abs/2602.03754v1",
    "pdf_url": "https://arxiv.org/pdf/2602.03754v1.pdf",
    "title": "A numerical study on plasma acceleration processes with ion dynamics at the sub-nanosecond timescale",
    "abstract": "Plasma wakefield acceleration is a groundbreaking technique for accelerating particles, capable of sustaining gigavolt-per-meter accelerating fields. Understanding the physical mechanisms governing the recovery of plasma accelerating properties over time is essential for successfully achieving high-repetition-rate plasma acceleration, a key requirement for applicability in both research and commercial settings. In this paper, we present numerical simulations of the early-stage plasma evolution based on the parameters of the SPARC_LAB hydrogen plasma recovery time experiment (Pompili et al., Comm. Phys. 7, 241 (2024)), employing spatially resolved Particle-in-Cell and fluid models. The experiment reports on a non-monotonic dependence of the plasma recovery time on the initial plasma density, an effect for which ion motion has been invoked as a contributing factor. The simulations presented here provide further insight into the role of ion dynamics in shaping this behavior. Furthermore, comparing Particle-in-Cell and fluid approaches allows us to assess the quality of fluid models for describing this class of plasma dynamics.",
    "authors": [
      "G. Parise",
      "A. Cianchi",
      "M. Galletti",
      "F. Guglietta",
      "R. Pompili",
      "A. R. Rossi",
      "M. Sbragaglia",
      "D. Simeoni"
    ],
    "published": "2026-02-03T17:17:41Z",
    "updated": "2026-02-03T17:17:41Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.15818v2",
    "url": "https://arxiv.org/abs/2601.15818v2",
    "pdf_url": "https://arxiv.org/pdf/2601.15818v2.pdf",
    "title": "Muon beams towards muonium physics: progress and prospects",
    "abstract": "Advances in accelerator technology have led to significant improvements in the quality of muon beams over the past decades. Investigations of the muon and muonium enable precise measurements of fundamental constants, as well as searches for new physics beyond the Standard Model. Furthermore, by utilizing muon beams with high intensity and polarization, studies of the dynamics of the muon and muonium within atomic level can offer valuable insights into materials science. This review presents recent progress and prospects at the frontiers of muon beams and high-precision muonium physics. It also provides an overview of novel methods and detection techniques to achieve high sensitivities in different areas, including particle physics, nuclear physics, materials science and beyond.",
    "authors": [
      "Siyuan Chen",
      "Mingchen Sun",
      "Jian Tang"
    ],
    "published": "2026-01-22T10:05:19Z",
    "updated": "2026-02-03T11:59:31Z",
    "categories": [
      "hep-ex",
      "cond-mat.mtrl-sci",
      "physics.acc-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2602.03270v1",
    "url": "https://arxiv.org/abs/2602.03270v1",
    "pdf_url": "https://arxiv.org/pdf/2602.03270v1.pdf",
    "title": "Computational Tools in EN-MME: Implicit and Explicit Finite-Element Simulations",
    "abstract": "This paper recalls the principles of the finite-element methods (FEM) theory and declines its application in the EN-MME group, for the numerical modelling and study of particle accelerator equipment. Implicit and explicit methods are compared, and practical examples of their use are given.",
    "authors": [
      "Federico Carra",
      "Giuditta Coladonato",
      "Audrey Piccini",
      "Joanna Sylwia Swieszek",
      "Nikolina Vejnovic"
    ],
    "published": "2026-02-03T08:56:15Z",
    "updated": "2026-02-03T08:56:15Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.01504v2",
    "url": "https://arxiv.org/abs/2602.01504v2",
    "pdf_url": "https://arxiv.org/pdf/2602.01504v2.pdf",
    "title": "First Experimental Demonstration of Beam Storage by Three-Dimensional Spiral Injection Scheme for Ultra-Compact Storage Rings",
    "abstract": "Three-dimensional spiral injection scheme enables storage in ultra-compact rings with nanosecond revolution period. We report the first successful storage of a $297\\,\\mathrm{keV/}c$ electron beam in a $22\\,\\mathrm{cm}$ weak-focusing storage ring with a $4.7\\,\\mathrm{ns}$ revolution period using multi-turn vertical kick with a $140\\,\\mathrm{ns}$ kicker pulse. Using a scintillating-fiber detector, we observe a signal exceeding $5σ$ of the pre-injection rms noise for $\\geq 1\\,\\mathrm{μs}$, confirming beam storage. By varying the weak-focusing field configuration and measuring the stored beam distribution, we show that the storage beam resides within the predicted region by Monte Carlo simulations. This result is a key proof-of-principle for realizing ultra-compact storage rings for next-generation precision measurements including the muon experiments at J-PARC and PSI.",
    "authors": [
      "R. Matsushita",
      "H. Iinuma",
      "S. Ohsawa",
      "H. Nakayama",
      "K. Furukawa",
      "S. Ogawa",
      "N. Saito",
      "T. Mibe",
      "M. A. Rehman"
    ],
    "published": "2026-02-02T00:33:47Z",
    "updated": "2026-02-03T08:24:08Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.08763v2",
    "url": "https://arxiv.org/abs/2507.08763v2",
    "pdf_url": "https://arxiv.org/pdf/2507.08763v2.pdf",
    "title": "Angular momentum dynamics of vortex particles in accelerators",
    "abstract": "Experiments with spin-polarized beams of leptons and hadrons typically employ plane-wave states with definite momenta and energies. In contrast, vortex states represent cylindrical waves carrying a well-defined orbital angular momentum projection along the propagation direction. This projection can be arbitrarily large, endowing such particles with magnetic moments orders of magnitude greater than those of plane-wave states. Consequently, vortex particles could complement - or even replace - spin-polarized beams in high-energy collisions, enabling access to observables beyond the reach of the conventional states. Although relativistic vortex beams have yet to be realized, we investigate the radiative and non-radiative dynamics of angular momentum for vortex particles in accelerators. We compute the timescale for angular momentum loss via photon emission, finding it significantly longer than typical acceleration times. The non-radiative dynamics is governed by precession, with the orbital angular momentum precessing at a frequency markedly different from that of spin. Similar to spin tunes in circular accelerators, this can induce resonances that disrupt the beam's orbital momentum - occurring far more frequently for vortex beams than for spin-polarized ones. Thus, vortex particle acceleration can be more feasible in linacs, while Siberian snakes could serve as a tool for angular momentum manipulations.",
    "authors": [
      "D. Karlovets",
      "D. Grosman",
      "I. Pavlov"
    ],
    "published": "2025-07-11T17:20:08Z",
    "updated": "2026-02-02T22:22:09Z",
    "categories": [
      "physics.acc-ph",
      "hep-ph",
      "quant-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.02867v1",
    "url": "https://arxiv.org/abs/2602.02867v1",
    "pdf_url": "https://arxiv.org/pdf/2602.02867v1.pdf",
    "title": "Monochromation of pulsed electron beams with terahertz radiation at a planar mirror",
    "abstract": "Exquisite control of electron beam energy is required for many electron spectroscopy and imaging applications. For both continuous and pulsed beams, the beam energy spread is fundamentally limited by the electron source, and is typically a sizable fraction of an electron-volt. In this paper, we present a means to reduce electron beam energy spread after emission to the level of a few 10s of meV rms using femtosecond photoemission and an interaction with laser-derived single- to few-cycle terahertz (THz) radiation. We show analytically and in particle tracking simulations that this interaction can remove energy spread stored in both the transverse and longitudinal degrees of freedom. We analytically formulate the limit of energy spread that this technique can achieve, and map the non-ideal affects arising at high frequencies. The interaction is mediated by the beam's passage through a mirror which is reflective to terahertz radiation but allows transmission of the majority of the electron beam (e.g. a wire mesh). This method then only requires beam current losses of a few tens of percent, far smaller than what is achieved in prism and slit-based electron monochromators.",
    "authors": [
      "Cecilia Abbamonte",
      "Adam Bartnik",
      "Jared Maxson"
    ],
    "published": "2026-02-02T22:17:58Z",
    "updated": "2026-02-02T22:17:58Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.24618v2",
    "url": "https://arxiv.org/abs/2510.24618v2",
    "pdf_url": "https://arxiv.org/pdf/2510.24618v2.pdf",
    "title": "Distributed Inter-Strand Coupling Current Model for Finite Element Simulations of Rutherford Cables",
    "abstract": "In this paper, we present the Distributed Inter-Strand Coupling Current (DISCC) model. It is a finite element (FE) model based on a homogenization approach enabling efficient and accurate simulation of the transient magnetic response of superconducting Rutherford cables without explicitly representing individual strands. The DISCC model reproduces the inter-strand coupling current dynamics via a novel mixed FE formulation, and can be combined with the Reduced Order Hysteretic Magnetization (ROHM) and Flux (ROHF) models in order to reproduce the effects of internal strand dynamics: hysteresis, eddy, and inter-filament coupling currents, as well as ohmic effects. The DISCC model offers a massive reduction of the computational time compared to fully detailed FE models and still accounts for all types of loss and magnetization contributions. As a result, Rutherford cables homogenized with the DISCC model can be directly included in FE models of magnet cross-sections for efficient electro-magneto-thermal simulations of their transient response. We present two possible FE formulations for the implementation of the DISCC model, a first one based on the h-phi-formulation, and a second one based on the h-phi-a-formulation, which is well suited for an efficient treatment of the ferromagnetic regions in magnet cross-sections.",
    "authors": [
      "Julien Dular",
      "Alexander Glock",
      "Arjan Verweij",
      "Mariusz Wozniak"
    ],
    "published": "2025-10-28T16:45:23Z",
    "updated": "2026-02-02T14:13:53Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.01972v1",
    "url": "https://arxiv.org/abs/2602.01972v1",
    "pdf_url": "https://arxiv.org/pdf/2602.01972v1.pdf",
    "title": "Heat load measurements for the PIP-II pHB650 cryomodule",
    "abstract": "Phase-3 testing of the pHB650 cryomodule at the PIP-II Injector Test Facility was conducted to evaluate the effectiveness of heat load mitigations performed after earlier phases of testing and to continue pinpointing any sources of unexpectedly high heat loads.. The programme measured HTTS, LTTS, and 2 K isothermal/non-isothermal loads under \"standard\", \"linac\", and \"simulated dynamic\" operating modes, recording data both inside the cryomodule and across the bayonet can circuits. Thermal-acoustic oscillations were eliminated by replacing the original G10 cooldown-valve stem with a stainless-steel stem fitted with wipers. A newly developed Python script automated acquisition of ACNET data, performed real-time heat-load calculations, and generated plots and tables that were posted to the electronic logbook within minutes, vastly reducing manual effort and accelerating feedback between SRF and cryogenics teams. Analysis showed that JT heat-exchanger effectiveness and temperature stratification in the two-phase and relief piping strongly influence the observed loads and helped isolate sources of excess heat. The campaign demonstrates that rigorous pre-test planning, real-time diagnostics, and automated reporting can improve both accuracy and efficiency, providing a template for future PIP-II cryomodule tests and for implementing targeted heat-load mitigations.",
    "authors": [
      "D. Porwisiak",
      "M. J. White",
      "V. Roger",
      "J. Bernardini",
      "B. J. Hansen",
      "J. P. Holzbauer",
      "J. Makara",
      "J. Ozelis",
      "D. Passarelli",
      "S. Yoon",
      "J. Subedi",
      "S. Ranpariya",
      "V. Patel",
      "J. Dong"
    ],
    "published": "2026-02-02T11:25:46Z",
    "updated": "2026-02-02T11:25:46Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.00501v1",
    "url": "https://arxiv.org/abs/2602.00501v1",
    "pdf_url": "https://arxiv.org/pdf/2602.00501v1.pdf",
    "title": "KEK Accelerator Test Facility Low-Level RF and Timing Systems",
    "abstract": "The KEK Accelerator Test Facility (ATF) is a dedicated testbed for nanobeam technologies in support of the International Linear Collider (ILC). Stable pulsed operation requires synchronization of the facility timing system with the Low-Level RF (LLRF) system. The timing system distributes trigger and gate signals to key subsystems, including the DAQ, klystrons, laser systems, pulsed kicker magnets, and interlocks. The LLRF system provides phase-coherent RF references and facility-wide clock distribution for synchronization. Achieving ~100 fs-level synchronization depends critically on the phase-noise power spectral density (PN-PSD) of the distributed clock signals and on preserving this performance throughout the distribution network. We present facility-wide measurements of the KEK ATF LLRF clock PN-PSD and discuss the resulting synchronization floor imposed by the stability of the ATF Linac and Damping Ring signal generators.",
    "authors": [
      "Konstantin Popov",
      "Alexander Aryshev",
      "Hiroshi Kaji",
      "Toshiyuki Okugi"
    ],
    "published": "2026-01-31T04:05:04Z",
    "updated": "2026-01-31T04:05:04Z",
    "categories": [
      "physics.acc-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.21809v1",
    "url": "https://arxiv.org/abs/2601.21809v1",
    "pdf_url": "https://arxiv.org/pdf/2601.21809v1.pdf",
    "title": "Description of electromagnetic fields in inhomogeneous accelerating sections. IV couplers",
    "abstract": "A new approach to incorporating coupling elements into a generalized coupled mode theory is presented. The simplest model of coupling of a structured waveguide with an external RF power source and load through loops and transmission lines was used. Even such a simple model significantly complicated the system of coupled equations. It turned into a coupled integro-differential system of the Barbashin type with degenerate kernels. Since the integral kernels are degenerate, this system is reduced to three independent systems of differential equations. Instead of solving a system of coupled integro-differential equations, we need to find solutions to three systems of ordinary differential equations. Two systems describe the distribution of the field excited by one loop and the specified value of the excitation current in it. In the first system the loop is located at the section's input, and in the second, at the section's output. The third system does not depend on the loop parameters at all. It describes the distribution of the field excited by an electron beam in a section without loops. Based on the developed analytical model, the computer code was developed for matching the loop couplers for the uniform accelerating sections of X-band. The calculation results were used to simulate the non-uniform section. Without additional matching, we obtained an input reflection coefficient of 8E-3.",
    "authors": [
      "M. I. Ayzatsky"
    ],
    "published": "2026-01-29T14:53:13Z",
    "updated": "2026-01-29T14:53:13Z",
    "categories": [
      "physics.acc-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2503.11285v4",
    "url": "https://arxiv.org/abs/2503.11285v4",
    "pdf_url": "https://arxiv.org/pdf/2503.11285v4.pdf",
    "title": "Knock Out Slow Extraction Using Betatron Sidebands at High Harmonics",
    "abstract": "Radio frequency knock out resonant slow extraction is a standard method for extracting stored particle beams from synchrotrons by transverse excitation. Excitation signals comprising many betatron sidebands have shown to reduce intensity fluctuations of the extracted beam spill and are used at several facilities. In this contribution, the effect of individual sidebands at different harmonics on the spill quality is systematically studied using efficient noise excitation signals fully covering the respective sidebands. Particle tracking simulations show a clear correlation between the chosen excitation frequency and the spill quality. This relation is attributed to the spectrum of particle motion shortly before their extraction, and an empiric relation between the spectrum, the excitation frequency, and the resulting spill quality is given. Experiments show an additional reduction of pile-up when using higher excitation frequencies. These insights have implications for an optimal design of excitation waveforms and hardware for Knock Out extraction systems.",
    "authors": [
      "Philipp Niedermayer",
      "Rahul Singh",
      "Eike Feldmeier",
      "Christian Schömers",
      "Marcel Hun"
    ],
    "published": "2025-03-14T10:46:10Z",
    "updated": "2026-01-29T08:53:38Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.1103/gndl-srhs"
  },
  {
    "arxiv_id": "2601.21385v1",
    "url": "https://arxiv.org/abs/2601.21385v1",
    "pdf_url": "https://arxiv.org/pdf/2601.21385v1.pdf",
    "title": "A general framework for interactions between electron beams and quantum optical systems",
    "abstract": "We provide a theoretical framework to describe the dynamics of a free-electron beam interacting with quantized bound systems in arbitrary electromagnetic environments. This expands the quantum optics toolbox to incorporate free-electron beams for applications in highly tunable quantum control, imaging, and spectroscopy at the nanoscale. The framework recovers previously studied results and shows that electromagnetic environments can amplify the intrinsically weak coupling between a free-electron and a bound electron to reach previously inaccessible interaction regimes. We leverage this enhanced coupling for experimentally feasible protocols in coherent qubit control and towards the nondestructive readout and projective control of the electron beam's quantum-number statistics. Our framework is broadly applicable to microwave-frequency qubits, optical nanophotonics, cavity quantum electrodynamics, and emerging platforms at the interface of electron microscopy and quantum information.",
    "authors": [
      "Jakob M. Grzesik",
      "Aviv Karnieli",
      "Charles Roques-Carmes",
      "Dylan S. Black",
      "Trung Kiên Lê",
      "Olav Solgaard",
      "Shanhui Fan",
      "Jelena Vučković"
    ],
    "published": "2026-01-29T08:20:52Z",
    "updated": "2026-01-29T08:20:52Z",
    "categories": [
      "quant-ph",
      "physics.acc-ph",
      "physics.optics"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2512.03997v3",
    "url": "https://arxiv.org/abs/2512.03997v3",
    "pdf_url": "https://arxiv.org/pdf/2512.03997v3.pdf",
    "title": "Comment on \"Monochromatization interaction region optics design for direct s-channel Higgs production at FCC-ee\"",
    "abstract": "The original article [1] can be logically divided into two parts: 1) the selection of main parameters for monochromatization and 2) interaction region optics design; the comment pertains only to the first part. The authors of [1] state that \"The purpose of this paper is to report on the development of realistic IR optics designs for monochromatization at the FCC-ee\". However, the proposed parameters do not seem very realistic and raise many questions; due to space limitations, we will only consider the most important ones.",
    "authors": [
      "Dmitry Shatilov"
    ],
    "published": "2025-12-03T17:29:11Z",
    "updated": "2026-01-29T06:40:51Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.1016/j.nima.2026.171316"
  },
  {
    "arxiv_id": "2601.20997v1",
    "url": "https://arxiv.org/abs/2601.20997v1",
    "pdf_url": "https://arxiv.org/pdf/2601.20997v1.pdf",
    "title": "From Beam to Bedside: Reinforcing Domestic Supply of $^{99}$Mo/$^{99m}$Tc using Novel High-Current D+ Cyclotrons for Compact Neutron Generation and $^{99}$Mo Production",
    "abstract": "Technetium-99m ($^{99m}$Tc) is essential to more than 16 million diagnostic procedures performed annually in the United States. It is typically acquired on-site from generators containing $^{99}$Mo, in turn produced at nuclear reactor facilities. This supply chain involves multiple points of vulnerability, which can lead to shortages and delays with potentially negative patient outcomes. We report on the development of a new family of cyclotrons originally designed for the IsoDAR neutrino experiment, capable of operating at much higher current than typical cyclotrons. When operated with deuterons at 1.5 MeV/amu and an anticipated continuous beam current of 5 mA, simulations project that such a system would yield $\\sim$10$^{13}$ neutrons per second using a thin beryllium target. This neutron yield is sufficient, in principle, to support $^{99}$Mo production without the use of highly enriched uranium or reliance on foreign reactors. Simulations and conceptual design studies suggest that the system's beam dynamics could make it a viable pathway toward decentralized, hospital-based isotope generation. The relatively low energy of the deuterons minimizes activation and safety concerns. This work presents the physics motivation, technical design considerations, and projected neutron yields, outlining a pathway from a neutrino-physics prototype to a biomedical isotope production platform.",
    "authors": [
      "Jarrett Moon",
      "Daniel Winklehner",
      "Jose Alonso",
      "Claire Huchthausen",
      "David McClain",
      "Janet Conrad"
    ],
    "published": "2026-01-28T19:47:47Z",
    "updated": "2026-01-28T19:47:47Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.20360v1",
    "url": "https://arxiv.org/abs/2601.20360v1",
    "pdf_url": "https://arxiv.org/pdf/2601.20360v1.pdf",
    "title": "Transit-time oscillations in nanoscale vacuum diode with a pure resistive load",
    "abstract": "We examine the Ramo current in a nanoscale planar vacuum diode undergoing field emission in the presence of a DC voltage supply and an external resistor. We describe a simple mechanism for generating persistent current oscillations in the diode due to the voltage drop across the external resistor (beam loading) which reduces the total field and inhibits the emission. The amplitude and the frequency, which is in the THz domain, depend on the operating parameters of the diode. Molecular dynamics simulations are used to find the characteristics and physical basis of the mechanism, and a simple analytical model is presented, in good agreement with the simulation.",
    "authors": [
      "Bjartþhór Steinn Alexandersson",
      "Kristinn Torfason",
      "Andrei Manolescu",
      "Ágúst Valfells"
    ],
    "published": "2026-01-28T08:20:21Z",
    "updated": "2026-01-28T08:20:21Z",
    "categories": [
      "cond-mat.mes-hall",
      "physics.acc-ph"
    ],
    "primary_category": "cond-mat.mes-hall"
  },
  {
    "arxiv_id": "2601.19865v1",
    "url": "https://arxiv.org/abs/2601.19865v1",
    "pdf_url": "https://arxiv.org/pdf/2601.19865v1.pdf",
    "title": "Laboratory Tests of Laser Control of Electron Beams for Future Colliders",
    "abstract": "Laser-driven Compton backscattering (CBS) has been proposed as method for controlling the intensity of colliding bunches in the FCC-ee so as to avoid the flip-flop instability caused by intensity asymmetry in colliding bunches. Laser-based collimation has also been proposed as an indestructible collimator for high-intensity electron beams. We have initiated a laboratory-based test program of these concepts with the E344 experiment at FACET-II. In this paper, we describe simulations of laser-beam interactions at FACET-II and the relevant scaling for FCC-ee. We also describe the experimental setup and diagnostics that will be used to make the measurements at FACET-II.",
    "authors": [
      "Claire Munting",
      "Peter Kicsiny",
      "Edoardo Barbi",
      "Noe Gonzalez",
      "Spencer Gessner",
      "Illya Drebot"
    ],
    "published": "2026-01-27T18:23:38Z",
    "updated": "2026-01-27T18:23:38Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.19579v1",
    "url": "https://arxiv.org/abs/2601.19579v1",
    "pdf_url": "https://arxiv.org/pdf/2601.19579v1.pdf",
    "title": "First observation of the $γ$-ray beam production by the backward Compton scattering of extreme ultraviolet light emitted from an undulator",
    "abstract": "Compton scattering of photons off high-energy electrons is a fundamental quantum mechanical process widely utilized to produce a $γ$-ray beam for scientific research. Instead of injecting laser light into a storage ring as a conventional way, we have developed an innovative method to achieve drastically higher energies approaching the ring energy by the backward Compton scattering of extreme ultraviolet light. In this method, $92$ $\\mathrm{eV}$ photons obtained from an undulator in a storage ring were reflected back to the original ring using a Mo/Si multilayer mirror. Consequently, $γ$-ray beam production through the extreme ultraviolet light Compton scattering was observed for the first time in a demonstration experiment at the $1$ $\\mathrm{GeV}$ ring, NewSUBARU. The measured energy spectrum was well reproduced by a theoretical calculation with the maximum energy of $0.543$ $\\mathrm{GeV}$. The production rate was $1.4 \\pm 0.1$ kcps for the energies above $0.160$ $\\mathrm{GeV}$. This rate was quantitatively explained by the luminosity and the scattering cross section. The present work paved the way to create a new $γ$-ray beam source for future applications such as hadron photoproduction experiments.",
    "authors": [
      "Norihito Muramatsu",
      "Manabu Miyabe",
      "Masahiro Okabe",
      "Schin Date",
      "Tetsuo Harada",
      "Kazuhiro Kanda",
      "Shuji Miyamoto",
      "Haruo Ohkuma",
      "Hajime Shimizu",
      "Shinsuke Suzuki",
      "Atsushi Tokiyasu"
    ],
    "published": "2026-01-27T13:11:50Z",
    "updated": "2026-01-27T13:11:50Z",
    "categories": [
      "physics.acc-ph",
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.16311v2",
    "url": "https://arxiv.org/abs/2512.16311v2",
    "pdf_url": "https://arxiv.org/pdf/2512.16311v2.pdf",
    "title": "Bunch-by-Bunch Prediction of Beam Transverse Position, Phase, and Length in a Storage Ring Using Neural Networks",
    "abstract": "Real-time, bunch-by-bunch monitoring of transverse position, longitudinal phase, and bunch length is crucial for beam control in diffraction-limited storage rings, where complex collective dynamics pose unprecedented diagnostic challenges. This study presents a neural network framework that simultaneously predicts these parameters directly from beam position monitor waveforms. The hybrid architecture integrates specialized Multi-Layer Perceptron (MLP), Convolutional Neural Network (CNN), and Long Short-Term Memory with Attention (LSTM-Attention) sub-networks, overcoming key limitations of traditional methods such as serial processing chains and batch-mode operation. Validated on experimental data from the Shanghai Synchrotron Radiation Facility and Hefei Light Source, the model achieves high prediction accuracy with a sub-millisecond latency of 0.042 ms per bunch. This performance demonstrates its potential as a core tool for real-time, multi-parameter diagnostics and active feedback in next-generation light sources.",
    "authors": [
      "Can Liu",
      "Xing Yang",
      "Youming Deng",
      "Qingqing Duan",
      "Yongbin Leng"
    ],
    "published": "2025-12-18T08:51:01Z",
    "updated": "2026-01-27T08:45:54Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.03955v2",
    "url": "https://arxiv.org/abs/2509.03955v2",
    "pdf_url": "https://arxiv.org/pdf/2509.03955v2.pdf",
    "title": "Beamstrahlung monitoring at SuperKEKB upgrade 2023",
    "abstract": "Beam monitoring is crucial for particle accelerators to achieve high luminosity. We describe an upgrade of the LABM, a beam monitoring device utilizing observation of the beamstrahlung, radiation emitted by a beam of charged particles when it accelerates in the electromagnetic field of another beam of charged particles.",
    "authors": [
      "Dmitri Liventsev",
      "Giovanni Bonvicini",
      "Daniel Ricalde Herrmann",
      "Pedro L. M. Podesta-Lerma",
      "Makoto Tobiyama"
    ],
    "published": "2025-09-04T07:32:11Z",
    "updated": "2026-01-27T05:54:32Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.18719v1",
    "url": "https://arxiv.org/abs/2601.18719v1",
    "pdf_url": "https://arxiv.org/pdf/2601.18719v1.pdf",
    "title": "Detection of high-frequency gravitational waves using SRF cavities",
    "abstract": "Today, apart from some isolated R&D efforts, there are no gravitational wave (GW) experiments, yet which explore a large part of the vast frequency range above the LIGO/Virgo band. It is planned to establish an experiment at Deutsches Elektronen-Synchrotron (DESY) and at the Superconducting Quantum Materials and Systems (SQMS) Center at Fermi National Accelerator Laboratory (Fermilab) to search for high-frequency GWs in the frequency range of 10 kHz to 100 MHz. The basic idea is to use superconducting radiofrequency (SRF) cavities to detect tiny harmonic deformations induced by GWs which change the boundary conditions of the oscillating electromagnetic field. This paper summarizes the challenging environmental boundary requirements, and the R&D to operate a cavity using a low level RF (LLRF) system which pushes beyond state-of-the-art accuracy and resolutions and a seismic noise mitigated cryostat at 1.8 K. The focus of this paper is the warm and cold commissioning of a prototype cavity, built 20 years ago during the MAGO collaboration, and its first measurement in our collaborative research project.",
    "authors": [
      "M. Wenskat",
      "B. Giaccone",
      "J. Branlard",
      "V. Chouhan",
      "C. Dokuyucu",
      "L. Fischer",
      "I. Gonin",
      "A. Grassellino",
      "W. Hillert",
      "T. Khabiboulline",
      "T. Krokotsch",
      "F. Ludwig",
      "G. Marconato",
      "A. Melnychuk",
      "G. Moortgat-Pick",
      "A. Muhs",
      "A. Netepenko",
      "Y. Orlov",
      "M. Paulsen",
      "K. Peters",
      "L. Pfeiffer",
      "S. Posen",
      "O. Pronitchev",
      "H. Schlarb"
    ],
    "published": "2026-01-26T17:42:03Z",
    "updated": "2026-01-26T17:42:03Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.00273v3",
    "url": "https://arxiv.org/abs/2510.00273v3",
    "pdf_url": "https://arxiv.org/pdf/2510.00273v3.pdf",
    "title": "Physical Thickness Characterization of the FRIB Production Targets",
    "abstract": "The FRIB heavy-ion accelerator, commissioned in 2022, is a leading facility   for producing rare isotope beams (RIBs) and exploring nuclei beyond the limits of stability.   These RIBs are produced via reactions between stable primary beams and a graphite target.   Approximately 20-40 \\% of the primary beam power is deposited in the target,   requiring efficient thermal dissipation.   Currently, FRIB operates with a primary beam power of up to 20 kW. To enhance thermal dissipation efficiency,   a single-slice rotating graphite target with a diameter of approximately 30 cm is employed.   The effective target region is a 1 cm-wide outer rim of the graphite disc.   To achieve high RIB production rates, the areal thickness variation must be constrained within 2 \\%.   This paper presents physical thickness characterizations of FRIB production targets with various nominal thicknesses,   measured using a custom-built non-contact thickness measurement apparatus.",
    "authors": [
      "D. J. Lee",
      "M. Reaume",
      "W. Franklin",
      "J. Song"
    ],
    "published": "2025-09-30T20:52:04Z",
    "updated": "2026-01-26T13:58:59Z",
    "categories": [
      "physics.acc-ph",
      "nucl-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.18470v1",
    "url": "https://arxiv.org/abs/2601.18470v1",
    "pdf_url": "https://arxiv.org/pdf/2601.18470v1.pdf",
    "title": "Design and modeling of a liquid-lead dump concept for beamstrahlung radiation absorption in the CERN Future Circular e$^+$e$^-$ Collider",
    "abstract": "The electron-positron Future Circular Collider (FCC-ee) being developed at CERN will generate intense beamstrahlung radiation, thus requiring photon absorbers downstream of the interaction points. This work presents the conceptual design of flowing-liquid-lead absorbers capable of dissipating around 370 kW of photon power, with a mean photon energy of 62 MeV. Two configurations are investigated: an inclined-flow geometry, developed to increase the photon interaction length to maximize absorption, and a compact upstream slope with an additional pool, in which a free-surface lead flow intercepts the power peak before a downstream pool dissipates the remaining load. Photon-matter interactions are modeled using Monte Carlo simulations in fluka, while conjugate heat-transfer and free-surface dynamics are analyzed through computational-fluid-dynamics simulations using ansys fluent. Design refinements are introduced based on the simulated thermal and hydraulic performance and to mitigate secondary effects such as photon backscattering. Both configurations demonstrate stable operation within the 300 kg/s flow limit and maintain liquid-lead and structural temperatures within the operational range of 450--500 $^{\\circ}$C. The results establish circulating liquid lead as a feasible and thermally robust baseline technology for beamstrahlung absorption in FCC-ee.",
    "authors": [
      "Silvio Candido",
      "Rui Franqueira Ximenes",
      "Anton Lechner",
      "Alessandro Frasca",
      "Giuseppe Lerner",
      "Antonio Perillo Marcone",
      "Regis Seidenbinder",
      "Markus Widorski",
      "Louise Jorat",
      "Giacomo Lavezzari",
      "Davide Bozzato",
      "Gabriel Banks",
      "Marco Calviani",
      "Luca Tricarico",
      "Carlo Carrelli",
      "Mariano Tarantino"
    ],
    "published": "2026-01-26T13:19:01Z",
    "updated": "2026-01-26T13:19:01Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.05274v2",
    "url": "https://arxiv.org/abs/2510.05274v2",
    "pdf_url": "https://arxiv.org/pdf/2510.05274v2.pdf",
    "title": "A note on thermal effects in non-linear models for plasma-based acceleration",
    "abstract": "We investigate the impact of a non-negligible background temperature on relativistic plasma wake-fields generated when a beam of charged particles passes through a neutral plasma at rest. We focus on the blowout regime, wherein the plasma response is highly non-linear: plasma electrons are radially blown out and expelled away from the propagation axis of the beam particles, creating a region (bubble) of ions without electrons. Our study builds upon earlier investigations for non-linear models of plasma wakefields developed in the limit of zero background temperature (Lu et al., Phys. Rev. Lett. 96, 165002 (2006)). In the presence of a non-zero background temperature, we characterize the model and focus on its predictions for the bubble size and the electromagnetic fields inside the bubble. Model predictions are studied in combination with PIC simulations.",
    "authors": [
      "D. Simeoni",
      "G. Parise",
      "A. R. Rossi",
      "A. Frazzitta",
      "F. Guglietta",
      "M. Sbragaglia"
    ],
    "published": "2025-10-06T18:42:15Z",
    "updated": "2026-01-26T12:53:51Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.18293v1",
    "url": "https://arxiv.org/abs/2601.18293v1",
    "pdf_url": "https://arxiv.org/pdf/2601.18293v1.pdf",
    "title": "Non-Destructive Beam Monitoring via Secondary Radiation Detection with Ce-Doped Silica Fibers",
    "abstract": "Non-destructive beam diagnostics are essential for low-energy medical cyclotrons, where even thin interceptive devices can severely degrade beam quality. We investigate an external fiber monitor (EFM) based on Ce-doped silica scintillating fibers that detects secondary radiation generated at existing beamline components of the 18 MeV Bern Medical Cyclotron beam transfer line (BTL). Three use cases were studied: (i) beam intensity monitoring around an electrically isolated, water-cooled beam dump; (ii) beam-loss monitoring around a 10 mm collimator under varying the beam focusing; and (iii) by steering a 6.5 mm $\\times$ 6.5 mm beam spot on a beam dump. For case (i), the summed EFM signal exhibits a linear dependence on the current on target over nearly three orders of magnitude. In case (ii), a normalized EFM-based beam-loss proxy scales monotonically with an electrical loss proxy across several focusing settings. Furthermore, opposing-fiber signal ratios provide decoupled, monotonic sensitivity to horizontal and vertical beam displacements.",
    "authors": [
      "Alexander Gottstein",
      "Pierluigi Casolaro",
      "Gaia Dellepiane",
      "Lars Eggimann",
      "Eva Kasanda",
      "Isidre Mateu",
      "Samuel Usherovich",
      "Paola Scampoli",
      "Cornelia Hoehr",
      "Saverio Braccini"
    ],
    "published": "2026-01-26T09:21:52Z",
    "updated": "2026-01-26T09:21:52Z",
    "categories": [
      "physics.ins-det",
      "physics.acc-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.11989v2",
    "url": "https://arxiv.org/abs/2601.11989v2",
    "pdf_url": "https://arxiv.org/pdf/2601.11989v2.pdf",
    "title": "Topological aspects of zero modes in cavity resonators",
    "abstract": "We discuss the relationship between the zero modes of electromagnetic fields in a cavity resonator and the cavity's topological characteristics. We show that the dimension of the electromagnetic zero-mode space coincides with the dimension of the corresponding homology group of the cavity. Moreover, we prove that the alternating sum of the dimensions of the electromagnetic zero-mode spaces is closely related to the Euler characteristic of the cavity boundary, and hence to the integral of the curvature.",
    "authors": [
      "Osamu Kamigaito"
    ],
    "published": "2026-01-17T09:46:16Z",
    "updated": "2026-01-23T23:30:26Z",
    "categories": [
      "physics.acc-ph",
      "physics.class-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.17220v1",
    "url": "https://arxiv.org/abs/2601.17220v1",
    "pdf_url": "https://arxiv.org/pdf/2601.17220v1.pdf",
    "title": "Evaluation of the beam-induced depolarization of the HJET target at the EIC",
    "abstract": "The Polarized Atomic Hydrogen Gas Jet Target (HJET) has played a central role in the absolute calibration of proton beam polarization at RHIC and is foreseen as a key element of the hadron polarimetry program at the future Electron--Ion Collider (EIC). The substantially higher beam current, reduced bunch spacing, and shorter bunch length planned for EIC operation motivate a careful reassessment of possible beam-induced depolarization of the jet target. In this paper, the depolarization of ground-state hydrogen atoms caused by the time-dependent magnetic field of the circulating polarized proton beam is quantitatively evaluated. The hydrogen atom is treated as a four-level hyperfine system in a holding magnetic field, and transitions driven by harmonic components of the bunch-induced magnetic field are analyzed using time-dependent quantum-mechanical evolution along atomic trajectories. Numerical tracking of hydrogen atoms through the beam region is performed using nominal EIC beam parameters. It is shown that, for a holding field of $120\\,\\mathrm{mT}$ (as used at RHIC), the resulting depolarization of the jet target at the EIC is negligibly small, $\\lesssim 0.01\\%$, and well below the level relevant for EIC polarization accuracy requirements. The stability of this result with respect to plausible variations of the EIC proton beam parameters is also evaluated.",
    "authors": [
      "A. A. Poblaguev"
    ],
    "published": "2026-01-23T23:08:45Z",
    "updated": "2026-01-23T23:08:45Z",
    "categories": [
      "physics.ins-det",
      "physics.acc-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.17101v1",
    "url": "https://arxiv.org/abs/2601.17101v1",
    "pdf_url": "https://arxiv.org/pdf/2601.17101v1.pdf",
    "title": "Accelerating Molecular H$_2^+$ Beam in AGS and RHIC",
    "abstract": "After the recent success of acceleration molecular H$_2^+$ beam (from EBIS) in Booster to 1.0 GeV/u kinetic energy, we propose to carry out tests to accelerate H$_2^+$ beam in AGS (up to 12 GeV/u) and to RHIC (up to 100 GeV/u). In this Note, we address the main effects that might hamper H$_2^+$ beam acceleration, outline the impacts and benefits of high energy H$_2^+$ beam to BNL.",
    "authors": [
      "Xiaodong Jiang"
    ],
    "published": "2026-01-23T15:36:32Z",
    "updated": "2026-01-23T15:36:32Z",
    "categories": [
      "physics.acc-ph",
      "nucl-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.10571v2",
    "url": "https://arxiv.org/abs/2601.10571v2",
    "pdf_url": "https://arxiv.org/pdf/2601.10571v2.pdf",
    "title": "Corrections for systematic errors in slit-profiler transverse phase space measurements",
    "abstract": "In photo injectors, the transverse emittance is one of the key measures of beam quality as it defines the possible performance of the whole facility. As such it is important to measure the emittance in photo injectors and ensure the accuracy of these measurements. While there are many different methods of measuring the emittance, this paper focuses on quantifying the systematic errors present in transverse phase space measurements taken with slit-profiler methods, i.e. scanning a narrow slit over the beam and continually measuring the passed beamlets' divergence with a downstream profiler. The measurement errors include effects of the slit size, beamlet imaging, and residual space charge. While these effects are generally small, they can have significant impact on the measured emittance when the 2D phase space is strongly coupled. The systematic effects studied and corrections are demonstrated with simulations and measurements from the Photo Injector Test facility at DESY in Zeuthen (PITZ) using a slit-screen emittance scanner.",
    "authors": [
      "C. Richard",
      "M. Krasilnikov",
      "N. Aftab",
      "Z. Amirkhanyan",
      "D. Dmytriiev",
      "A. Hoffmann",
      "X. -K. Li",
      "Z. Lotfi",
      "F. Stephan",
      "G. Vashchenko",
      "S. Zeeshan"
    ],
    "published": "2026-01-15T16:37:09Z",
    "updated": "2026-01-23T14:55:29Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.16760v1",
    "url": "https://arxiv.org/abs/2601.16760v1",
    "pdf_url": "https://arxiv.org/pdf/2601.16760v1.pdf",
    "title": "RF Applications",
    "abstract": "Radiofrequency (RF) systems play a critical role in particle accelerators by enabling the acceleration, manipulation, and diagnosis of charged particle beams. At the heart of many of these systems lies the RF cavity, whose effective design requires close collaboration among RF designers, beam physicists, and mechanical engineers. This chapter presents the fundamental principles of RF systems, with particular emphasis on RF cavities, and underscores the interdisciplinary effort involved in their development. The SwissFEL X-ray free-electron laser at the Paul Scherrer Institut serves as a key example to illustrate these concepts.",
    "authors": [
      "Thomas Geoffrey Lucas"
    ],
    "published": "2026-01-23T14:05:51Z",
    "updated": "2026-01-23T14:05:51Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.02729v2",
    "url": "https://arxiv.org/abs/2601.02729v2",
    "pdf_url": "https://arxiv.org/pdf/2601.02729v2.pdf",
    "title": "The Future of Higgs Physics",
    "abstract": "In this lecture, I discuss measurements of the properties of the Higgs boson and related observables in the era of Higgs factories. This highly motivated experimental program is the challenge for the next generation of particle physicists.",
    "authors": [
      "Michael E. Peskin"
    ],
    "published": "2026-01-06T05:47:51Z",
    "updated": "2026-01-22T02:52:26Z",
    "categories": [
      "hep-ph",
      "hep-ex",
      "physics.acc-ph"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2601.13517v2",
    "url": "https://arxiv.org/abs/2601.13517v2",
    "pdf_url": "https://arxiv.org/pdf/2601.13517v2.pdf",
    "title": "Demonstration of a novel phase space painting method in a coupled lattice to mitigate space charge in high-intensity hadron beams",
    "abstract": "Multi-turn charge-exchange injection is the primary method of creating high-intensity hadron beams in circular accelerators, and phase space painting during injection enables tailoring of the accumulated phase space distribution. A technique we call eigenpainting allows injection of particles into a single mode of a coupled ring, providing full four-dimensional control of the phase space distribution. Under ideal conditions, uniform eigenpainting generates a linear-force equilibrium distribution in the transverse plane, with zero volume in four-dimensional transverse phase space, even including space charge. We have implemented eigenpainting for the first time in the Spallation Neutron Source (SNS) Accumulator Ring. Injecting 8.8 $μ$C of 800 MeV beam, we obtain a final ratio of intrinsic transverse emittances of $\\approx$2.4. We analyze the effect of space charge on the final distribution through comparison of the reconstructed phase space to particle-in-cell simulations.",
    "authors": [
      "Nicholas J. Evans",
      "Austin Hoover",
      "Timofey Gorlov",
      "Vasiliy Morozov"
    ],
    "published": "2026-01-20T02:10:00Z",
    "updated": "2026-01-21T18:02:30Z",
    "categories": [
      "physics.acc-ph",
      "physics.app-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2506.06814v2",
    "url": "https://arxiv.org/abs/2506.06814v2",
    "pdf_url": "https://arxiv.org/pdf/2506.06814v2.pdf",
    "title": "An analytical optimization of plasma density profiles for downramp injection in laser wake-field acceleration",
    "abstract": "We propose and detail a multi-step analytical procedure, based on an improved fully relativistic plane model for Laser Wake Field Acceleration, to tailor the initial density of a cold diluted plasma to the laser pulse profile, so as to control and optimize the partial wave-breaking of the plasma wave and maximize the acceleration of small bunches of electrons self-injected by the first wave-breaking at the density down-ramp, at least in the first stages of their acceleration phase. We find an excellent agreement with the results of Particle In Cell simulations obtained with the same input data.",
    "authors": [
      "Gaetano Fiore",
      "Paolo Tomassini"
    ],
    "published": "2025-06-07T14:45:03Z",
    "updated": "2026-01-21T17:48:08Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.18564v2",
    "url": "https://arxiv.org/abs/2509.18564v2",
    "pdf_url": "https://arxiv.org/pdf/2509.18564v2.pdf",
    "title": "Impact of Nitrogen and Oxygen Interstitials on Niobium SRF Cavity Performance",
    "abstract": "Superconducting radiofrequency (SRF) cavities are the leading technology for highly efficient particle acceleration, and their performance can be significantly enhanced through the controlled introduction of interstitial impurities into bulk niobium. Nitrogen doping has demonstrated a substantial reduction in surface resistance, which improves the quality factor of the cavities. More recently, oxygen doping has emerged as a promising alternative, demonstrating comparable reductions in surface resistance. In this study, we combine cavity measurements on 1.3 GHz niobium SRF cavities subjected to a range of nitrogen- and oxygen-based treatments with material characterizations performed on cavity cutouts processed under identical conditions. This approach allows us to quantitatively assess the contribution of each impurity to the reduction of surface resistance. We find that nitrogen is ten times more effective than oxygen in reducing surface resistance at 16 MV/m. We also observe an additive effect of O and N impurities in reducing R$_\\mathrm{T}$. We discuss these results in the context of field dependent nonequilibrium superconductivity, gap enhancement, and hydrogen trapping mechanisms.",
    "authors": [
      "Hannah Hu",
      "Young-Kee Kim",
      "Daniel Bafia"
    ],
    "published": "2025-09-23T02:41:21Z",
    "updated": "2026-01-21T17:05:03Z",
    "categories": [
      "physics.acc-ph",
      "cond-mat.supr-con"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.14583v1",
    "url": "https://arxiv.org/abs/2601.14583v1",
    "pdf_url": "https://arxiv.org/pdf/2601.14583v1.pdf",
    "title": "Two-port CW measurements on RF cavities: Notes on self-consistency assessment and indirect methods",
    "abstract": "In the case of a radio-frequency (RF) cavity with a mismatched input coupler, a direct calculation of the power dissipation in the cavity and the intrinsic quality factor from continuous-wave (CW) measurements may have uncertainty due to systematic errors. Formulae for an indirect calculation of these quantities are derived for the case of a cavity with two couplers of fixed coupling strength. In this approach, the signal from the pickup coupler is used to infer the amplitude of the \"emitted wave\" from the input coupler. A graphical method for self-consistency assessment is evaluated. The impact of frequency offsets is considered. Applications of these methods are presented, drawing on cold tests of superconducting cavities produced for the Facility for Rare Isotope Beams.",
    "authors": [
      "Walter H. Hartung",
      "Wei Chang",
      "Sang-Hoon Kim",
      "Taro Konomi",
      "Ting Xu"
    ],
    "published": "2026-01-21T01:45:25Z",
    "updated": "2026-01-21T01:45:25Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2506.07213v5",
    "url": "https://arxiv.org/abs/2506.07213v5",
    "pdf_url": "https://arxiv.org/pdf/2506.07213v5.pdf",
    "title": "AttoSHINE: Generation of continuous-wave terawatt-scale attosecond X-ray pulses at SHINE",
    "abstract": "Attosecond X-ray pulses are a critical tool for tracking ultrafast electron dynamics in condensed matter, molecular systems, and strongly correlated materials. Recent breakthroughs have pushed X-ray free electron lasers (XFELs) into the attosecond domain, significantly surpassing their previous femtosecond capabilities. Building on these advancements, this work investigates the potential of the Shanghai High Repetition Rate XFEL and Extreme Light Facility (SHINE), China's first continuous-wave (CW) XFEL, to generate intense attosecond X-ray pulses, thereby offering transformative capabilities for X-ray science. Through comprehensive start-to-end simulations, we show that SHINE is capable of producing hard X-ray pulses with peak powers reaching the terawatt-scale and average pulse durations of approximately 300 as. This is achieved using a self-chirping scheme within the existing machine configuration, requiring no additional hardware. Our findings demonstrate that CW XFELs can generate intense attosecond X-ray pulses at megahertz repetition rates, opening new opportunities for real-time studies of electronic dynamics in complex systems.",
    "authors": [
      "Bingyang Yan",
      "Chenzhi Xu",
      "Si Chen",
      "Duan Gu",
      "Ye Chen",
      "Jiawei Yan",
      "Haixiao Deng"
    ],
    "published": "2025-06-08T16:32:35Z",
    "updated": "2026-01-20T14:39:34Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.20417v2",
    "url": "https://arxiv.org/abs/2511.20417v2",
    "pdf_url": "https://arxiv.org/pdf/2511.20417v2.pdf",
    "title": "Comparative evaluation of future collider options",
    "abstract": "In anticipation of the completion of the High-Luminosity Large Hadron Collider (HL-LHC) programme by the end of 2041, CERN is preparing to launch a new major facility in the mid-2040s. According to the 2020 update of the European Strategy for Particle Physics (ESPP), the highest-priority next collider is an electron-positron Higgs factory, followed in the longer term by a hadron-hadron collider at the highest achievable energy. The CERN directorate established a Future Colliders Comparative Evaluation working group in June 2023. This group brings together project leaders and domain experts to conduct a consistent evaluation of the Future Circular Collider (FCC) and alternative scenarios based on shared assumptions and standardized criteria. This report presents a comparative evaluation of proposed future collider projects submitted as input for the Update of the European Strategy for Particle Physics. These proposals are compared considering main performance parameters, environmental impact and sustainability, technical maturity, cost of construction and operation, required human resources, and realistic implementation timelines. An overview of the international collider projects within a similar timeframe, notably the CEPC in China and the ILC in Japan is also presented, as well as a short review of the status and prospects of new accelerator techniques.",
    "authors": [
      "G. Arduini",
      "M. Benedikt",
      "F. Gianotti",
      "K. Jakobs",
      "M. Lamont",
      "R. Losito",
      "M. Meddahi",
      "J. Mnich",
      "N. Mounet",
      "D. Schulte",
      "F. Sonnemann",
      "S. Stapnes",
      "F. Zimmermann"
    ],
    "published": "2025-11-25T15:41:09Z",
    "updated": "2026-01-20T13:29:20Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.23731/CYRM-2025-0011"
  },
  {
    "arxiv_id": "2601.13739v1",
    "url": "https://arxiv.org/abs/2601.13739v1",
    "pdf_url": "https://arxiv.org/pdf/2601.13739v1.pdf",
    "title": "The Hamilton-Jacobi Equation and its Application to Nonlinear Beam Dynamics: Comparison of Approaches",
    "abstract": "The rarely used Hamilton-Jacobi equation has been utilized as an elegant way to find the trajectories of mechanical systems and to derive symplectic maps. Further, the exact solution in kick approximation of Hamilton's equations of motion in interaction representation is written as a generalized one-turn twist map.   One can imagine that the nonlinear kick comes first, followed by the one-period rotation along the machine circumference, or a second alternative in which the one-period rotation occurs before the kick. There is a difference in the result of solving Hamilton's equations between the two cases, which is expressed in obtaining a standard forward twist map in the first case, or alternatively a backward map in the second one. This nontrivial and intuitively unclear peculiarity is usually ignored/overlooked in practically all specialized references on the topic.   Finally, the statistical properties and the behavior of the density distribution of a particle beam in configuration space under the influence of an isolated sextupole have been studied.",
    "authors": [
      "Stephan I. Tzenov"
    ],
    "published": "2026-01-20T08:52:42Z",
    "updated": "2026-01-20T08:52:42Z",
    "categories": [
      "physics.acc-ph",
      "nlin.SI",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.13577v1",
    "url": "https://arxiv.org/abs/2601.13577v1",
    "pdf_url": "https://arxiv.org/pdf/2601.13577v1.pdf",
    "title": "Toward Ultra-fast Treatments: Large Energy Acceptance Beam Delivery Systems and Opportunities for Proton Beam Therapy",
    "abstract": "Treatment delivery is largely determined by capabilities of the beam delivery system (BDS), where faster delivery can have many potential benefits including improved dosimetric quality, utility, cost effectiveness, patient throughput and comfort. Despite significant developments in accelerators, delivery methodologies, dose optimisation and more, the energy layer switching time (ELST) is still a persisting limitation in existing BDS. The ELST can contribute significantly to beam delivery time (BDT) and extend treatment times, requiring compensation by optimisation planning approaches, motion mitigation strategies, or active beam modification. This fundamental constraint can be addressed by increasing the narrow energy acceptance range of conventional beamlines to minimise the ELST, enabling ultra-fast delivery. A large energy acceptance (LEA) BDS has the potential to revolutionise PBT through immediate improvements to current treatment delivery and emerging delivery modalities: the complete exploitation of PBT - and unlocking its full potential - can only be made possible with advances in beam delivery technologies. We review the abundant opportunities offered by an ultra-fast BDS: shorter treatment times, reduced motion induced dose degradation, improved effectiveness of motion management techniques, possibilities for volumetric rescanning, bidirectional delivery, further planning optimisation, and novel delivery strategies. We overview the design concepts of several LEA proposals, technology requirements, and also discuss the remaining challenges and considerations with realising a LEA BDS in practice. There are multiple avenues requiring further development and study, however the clinical potential and benefits of this enabling technology are clear: ultra-fast delivery offers both immediate and future improvements to PBT treatments.",
    "authors": [
      "Jacinta Yap",
      "Adam Steinberg",
      "Hannah Norman",
      "Konrad Nesteruk",
      "Suzie Sheehy"
    ],
    "published": "2026-01-20T04:03:14Z",
    "updated": "2026-01-20T04:03:14Z",
    "categories": [
      "physics.med-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.med-ph"
  },
  {
    "arxiv_id": "1501.02747v2",
    "url": "https://arxiv.org/abs/1501.02747v2",
    "pdf_url": "https://arxiv.org/pdf/1501.02747v2.pdf",
    "title": "A detailed and unified treatment of spin-orbit systems using tools distilled from the theory of bundles",
    "abstract": "We return to our study \\cite{BEH} of invariant spin fields and spin tunes for polarized beams in storage rings but in contrast to the continuous-time treatment in \\cite{BEH}, we now employ a discrete-time formalism, beginning with the $\\rm{Poincar\\acute{e}}$ maps of the continuous time formalism. We then substantially extend our toolset and generalize the notions of invariant spin field and invariant frame field. We revisit some old theorems and prove several theorems believed to be new. In particular we study two transformation rules, one of them known and the other new, where the former turns out to be an $SO(3)$-gauge transformation rule. We then apply the theory to the dynamics of spin-$1/2$ and spin-$1$ particle bunches and their density matrix functions, describing semiclassically the particle-spin content of bunches. Our approach thus unifies the spin-vector dynamics from the T-BMT equation with the spin-tensor dynamics and other dynamics. This unifying aspect of our approach relates the examples elegantly and uncovers relations between the various underlying dynamical systems in a transparent way. As in \\cite{BEH}, the particle motion is integrable but we now allow for nonlinear particle motion on each torus. Since this work is inspired by notions from the theory of bundles, we also provide insight into the underlying bundle-theoretic aspects of the well-established concepts of invariant spin field, spin tune and invariant frame field. Since we neglect, as is usual, the Stern-Gerlach force, the underlying principal bundle is of product formso that we can present the theory in a fashion which does not use bundle theory. Nevertheless we occasionally mention the bundle-theoretic meaningof our concepts and we also mention the similarities with the geometrical approach to Yang-Mills Theory.",
    "authors": [
      "Klaus Heinemann",
      "Desmond P. Barber",
      "James A. Ellison",
      "Mathias Vogt"
    ],
    "published": "2015-01-12T18:34:22Z",
    "updated": "2026-01-19T22:12:30Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.13123v1",
    "url": "https://arxiv.org/abs/2601.13123v1",
    "pdf_url": "https://arxiv.org/pdf/2601.13123v1.pdf",
    "title": "Aspects of Mechanical Engineering for Undulators",
    "abstract": "This paper gives an overview about aspects of mechanical engineering of undulators. It is based mainly on two types that are used in the SwissFEL facility. The U15 Undulator is an example of an in-vacuum type and the UE38 is an APPLE-X type. It describes the frame, the adjustment of the magnets with flexible keepers and the adjustment of the whole device with eccentric movers.",
    "authors": [
      "Haimo Joehri"
    ],
    "published": "2026-01-19T15:11:17Z",
    "updated": "2026-01-19T15:11:17Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.13120v1",
    "url": "https://arxiv.org/abs/2601.13120v1",
    "pdf_url": "https://arxiv.org/pdf/2601.13120v1.pdf",
    "title": "Innovations in High- and Ultra-precision Machining",
    "abstract": "Modern precision manufacturing faces the challenge of integrating accuracy requirements into a framework of agile and sustainable production technologies. This development leads to numerous further challenges, affecting almost all areas of precision manufacturing industry. To overcome those challenges, this article presents promising technologies and innovative solution concepts from the field of temperature measurement in the cutting zone, process design for advanced materials, the development of reconfigurable machine tools, the optimization of the temperature behaviour of high-speed spindles and the use of edge computing in machine tools. Using the presented solutions, modern precision machining can be made more future-oriented in terms of sustainability and resilience.",
    "authors": [
      "Eckart Uhlmann",
      "Mitchel Polte",
      "Toni Hocke",
      "Julius Tschöpel"
    ],
    "published": "2026-01-19T15:06:40Z",
    "updated": "2026-01-19T15:06:40Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.12836v1",
    "url": "https://arxiv.org/abs/2601.12836v1",
    "pdf_url": "https://arxiv.org/pdf/2601.12836v1.pdf",
    "title": "Development of next-generation light-weight ternary Mg--Al--Li alloys for beampipe applications in particle accelerators",
    "abstract": "The current study reports the design of advanced light-weight materials for high-energy accelerator beampipe applications. The objective is to optimize the combined requirements of high radiation length and stiffness properties of the designed materials. The present study targets conventional beampipe materials such as aluminum, titanium, and stainless steel as primary performance benchmarks. These conventional beampipes are used at synchrotron radiation sources, such as Indus-1 and Indus-2 in India, the Nuclotron-based Ion Collider Facility in Russia, and the ring synchrotron facility SIS 100/300 at the Facility for Antiproton and Ion Research in Germany. In this context, a series of ternary Mg--Al--Li alloys is systematically investigated to enhance the figure of merit. Two aluminum--rich alloys, A1 ($\\mathrm{Al_{61.5}Li_{10.8}Mg_{27.7}}$) and A2 ($\\mathrm{Al_{66}Li_{19.4}Mg_{14.6}}$), along with three magnesium-rich alloys, M1 ($\\mathrm{Al_{23.9}Li_{29.3}Mg_{46.8}}$), M2 ($\\mathrm{Al_{19}Li_{20.6}Mg_{60.4}}$), and M3 ($\\mathrm{Al_{39.8}Li_{20.1}Mg_{40.1}}$) are explored. Thermodynamic stability, density, liquidus temperature, and phases are evaluated using Latin hypercube sampling within the Thermo-Calc TC-Python framework. Elastic properties are obtained from density functional theory calculations performed using the Vienna \\textit{Ab Initio} Simulation Package. Our results show that, although the elastic moduli ($E$) of the investigated Mg-Al-Li alloys are comparable to those of conventional beampipe materials, their significantly higher radiation lengths ($X_0$) lead to an overall improvement in the figure of merit $X_0 E^{1/3}$.",
    "authors": [
      "Kamaljeet Singh",
      "Kangkan Goswami",
      "Raghunath Sahoo",
      "Sumanta Samal"
    ],
    "published": "2026-01-19T08:47:10Z",
    "updated": "2026-01-19T08:47:10Z",
    "categories": [
      "physics.acc-ph",
      "cond-mat.mtrl-sci",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  }
]