{
  "arxiv_id": "2503.15239v3",
  "url": "https://arxiv.org/abs/2503.15239v3",
  "pdf_url": "https://arxiv.org/pdf/2503.15239v3.pdf",
  "title": "Ultra-cold neutron simulation framework for the free neutron lifetime   experiment $τ$SPECT",
  "abstract": "The precise determination of the free neutron lifetime is of great significance in modern precision physics. This key observable is linked to the mixing of up and down quarks via the Cabibbo-Kobayashi-Maskawa matrix element $V_{ud}$, and the abundance of primordial elements after the Big-Bang Nucleosynthesis. However, the two leading measurement techniques for the neutron lifetime currently yield incompatible results, a discrepancy referred to as the neutron lifetime puzzle. To address the systematic uncertainties arising from neutron interactions with material walls, the $\\tau$SPECT experiment employs a fully magnetic trap for ultra-cold neutrons (UCNs).   UCNs are extremely low-energy neutrons with typical velocities below $8\\,\\textrm{m/s}$, which can be manipulated using magnetic fields, gravity, and suitable material guides, whose surface can reflect them at any angle of incidence. To precisely study and characterize UCN behavior during production, guidance, storage, and detection in $\\tau$SPECT, we have developed a dedicated simulation framework. This framework is built upon the externally developed UCN Monte Carlo software package PENTrack and is enhanced with two companion tools: one for flexible and parametrizable upstream configuration of PENTrack such that the simulation's input settings can be adjusted to reproduce the experimental observations. The second package is used for analyzing, visualizing, and animating simulation data.   The simulation results align well with experimental data obtained with $\\tau$SPECT at the Paul Scherrer Institute and serve as a powerful resource for identifying systematic uncertainties and guiding future improvements to the current experimental setup.",
  "authors": [
    "Julian Auler",
    "Utkarsh Bajpai",
    "Martin Engler",
    "Viktoria Ermuth",
    "Martin Fertl",
    "Konrad Franz",
    "Werner Heil",
    "Simon Kaufmann",
    "Bernhard Lauss",
    "Niklas Pfeifer",
    "Dieter Ries",
    "Sylvain Vanneste",
    "Noah Yazdandoost"
  ],
  "published": "2025-03-19T14:15:34Z",
  "updated": "2025-08-29T13:36:17Z",
  "categories": [
    "physics.ins-det",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det"
}