{
  "arxiv_id": "2508.21173v1",
  "url": "https://arxiv.org/abs/2508.21173v1",
  "pdf_url": "https://arxiv.org/pdf/2508.21173v1.pdf",
  "title": "X-ray diffraction strains in laser-ablated aluminum, nickel, sodium and   Invar: pressures to 475 GPa",
  "abstract": "Dynamically compressed materials in longitudinal waves are described by two physical models: hydrostatic pressure, with equal, normal, principal stresses or material uniaxially strained in the wave propagation direction. These models are disparate, so experimental comparisons and evaluations are important. Polycrystalline material in a state of hydrostatic pressure, will have no eccentricity of X-ray diffracted Debye-Scherrer rings. A general three-dimensional solution of Bragg diffracted X-rays based on principal crystallographic strains in the compression wave was found. The distortion of X-ray diffraction beams has been used for strain measurements; the analysis developed incorporates a strained reciprocal lattice and the incident X-ray beam. Strain distorted Polanyi surfaces form an annulus of compression with an ellipsoid of revolution in reciprocal space which is intersected by Ewald sphere for Bragg diffraction. The in-situ measurements for strain describe nanosecond diffraction evaluated using two planes, and both in the same crystallographic phase. Diffraction from Al, Ni, Na, and Invar quantify the compression axial strains in these materials: the compression axial ratios are 0.65, 1.05, 0.88 and 1.58 at pressures of 291, 402, 409, and 367 GPa for the respective materials. Crystal structure transformations with homogeneous pressurized stresses, mandating equal normal strains, should not be anticipated to agree with heterogeneous, uniaxially strained and sheared crystalline phases. Measurements support in-plane strains increasing with pressure, p, in fcc and hcp aluminum as with p in GPa.",
  "authors": [
    "S. J. Burns",
    "Danae N. Polsin"
  ],
  "published": "2025-08-28T19:24:55Z",
  "updated": "2025-08-28T19:24:55Z",
  "categories": [
    "cond-mat.mtrl-sci",
    "physics.plasm-ph"
  ],
  "primary_category": "cond-mat.mtrl-sci"
}