{
  "arxiv_id": "2602.15500v1",
  "url": "https://arxiv.org/abs/2602.15500v1",
  "pdf_url": "https://arxiv.org/pdf/2602.15500v1.pdf",
  "title": "From Coils to Surface Recession: Fully Coupled Simulation of Ablation in ICP Wind Tunnels",
  "abstract": "This work presents a fully coupled, multiphysics computational framework for predicting the thermo-chemical material response of thermal protection systems in inductively coupled plasma (ICP) wind tunnels. The framework integrates a high-fidelity Navier-Stokes plasma solver, an electromagnetic field solver, and a discontinuous-Galerkin material response solver using a partitioned coupling strategy. This enables an ab initio, end-to-end simulation of the 350 kW Plasmatron X facility at the University of Illinois Urbana-Champaign (UIUC), including plasma generation, electromagnetic heating, near-wall thermochemistry, and time-accurate material ablation. The model captures key ICP physics such as vortex-mode recirculation, Joule-heating-driven plasma formation, and Lorentz-force-induced flow confinement, and accurately predicts the transition from subsonic to supersonic jet behavior at low pressures. Validation against cold-wall calorimetry and graphite ablation experiments shows that predicted stagnation-point heat fluxes fall well within experimental uncertainty, while fully coupled simulations accurately reproduce measured stagnation temperature histories and recession rates with errors below 12% and 10%, respectively. Remaining discrepancies during early transient heating are attributed to uncertainties in power-coupling efficiency, equilibrium ablation modeling, and material property datasets. Overall, the framework demonstrates strong predictive capability for ICP wind tunnel environments and provides a foundation for improved design, interpretation, and planning of hypersonic material testing campaigns.",
  "authors": [
    "Sanjeev Kumar",
    "Alessandro Munafo",
    "Blaine Vollmer",
    "Daniel J. Bodony",
    "Gregory S. Elliott",
    "Kelly A. Stephani",
    "Sean Kearney",
    "Marco Panesi"
  ],
  "published": "2026-02-17T11:13:00Z",
  "updated": "2026-02-17T11:13:00Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}