[
  {
    "arxiv_id": "2602.17575v1",
    "url": "https://arxiv.org/abs/2602.17575v1",
    "pdf_url": "https://arxiv.org/pdf/2602.17575v1.pdf",
    "title": "Momentum Measurement of Charged Particles in FASER's Emulsion Detector at the LHC",
    "abstract": "We present a momentum measurement method based on multiple Coulomb scattering (MCS) in the FASER$ν$ emulsion detector. The measurement of charged-particle momenta is essential for studying neutrino interactions in the TeV energy range at the FASER experiment. This method exploits the sub-micron spatial resolution and long tracking length of the FASER$ν$ detector, enabling momentum determination from a few GeV up to a few TeV. The performance was evaluated using Geant4-based Monte Carlo simulations and validated with muon test beam data in the momentum range 100-300 GeV. As a first probe of the method for higher momentum muons, background muons recorded by the FASER$ν$ detector were examined, showing reconstructed momenta consistent with expectations from their angular spread.",
    "authors": [
      "FASER Collaboration",
      "Roshan Mammen Abraham",
      "Xiaocong Ai",
      "Saul Alonso Monsalve",
      "John Anders",
      "Emma Kate Anderson",
      "Claire Antel",
      "Akitaka Ariga",
      "Tomoko Ariga",
      "Jeremy Atkinson",
      "Florian U. Bernlochner",
      "Tobias Boeckh",
      "Eliot Bornand",
      "Jamie Boyd",
      "Lydia Brenner",
      "Angela Burger",
      "Franck Cadoux",
      "Roberto Cardella",
      "David W. Casper",
      "Charlotte Cavanagh",
      "Shiyang Chen",
      "Xin Chen",
      "Xing Cheng",
      "Kohei Chinone",
      "Dhruv Chouhan",
      "Andrea Coccaro",
      "Stephane Débieux",
      "Ansh Desai",
      "Sergey Dmitrievsky",
      "Radu Dobre",
      "Monica D'Onofrio",
      "Sinead Eley",
      "Yannick Favre",
      "Jonathan L. Feng",
      "Carlo Alberto Fenoglio",
      "Didier Ferrere",
      "Max Fieg",
      "Wissal Filali",
      "Elena Firu",
      "Haruhi Fujimori",
      "Edward Galantay",
      "Ali Garabaglu",
      "Stephen Gibson",
      "Sergio Gonzalez-Sevilla",
      "Yuri Gornushkin",
      "Yotam Granov",
      "Jinjing Gu",
      "Carl Gwilliam",
      "Elie Hammou",
      "Daiki Hayakawa",
      "Michael Holzbock",
      "Shih-Chieh Hsu",
      "Zhen Hu",
      "Giuseppe Iacobucci",
      "Tomohiro Inada",
      "Luca Iodice",
      "Sune Jakobsen",
      "Cesar Jesus-Valls",
      "Arash Jofrehei",
      "Hans Joos",
      "Enrique Kajomovitz",
      "Takumi Kanai",
      "Hiroaki Kawahara",
      "Alex Keyken",
      "Felix Kling",
      "Daniela Köck",
      "Pantelis Kontaxakis",
      "Jelle Koorn",
      "Umut Kose",
      "Peter Krack",
      "Susanne Kuehn",
      "Thanushan Kugathasan",
      "Sebastian Laudage",
      "Lorne Levinson",
      "Botao Li",
      "Jinfeng Liu",
      "Yi Liu",
      "Margaret S. Lutz",
      "Jack MacDonald",
      "Joern Mahlstedt",
      "Toni Mäkelä",
      "Anna Mascellani",
      "Lawson McCoy",
      "Josh McFayden",
      "Andrea Pizarro Medina",
      "Théo Moretti",
      "Keiko Moriyama",
      "Toshiyuki Nakano",
      "Laurie Nevay",
      "Motoya Nonaka",
      "Yuma Ohara",
      "Ken Ohashi",
      "Kazuaki Okui",
      "Hidetoshi Otono",
      "Lorenzo Paolozzi",
      "Annabelle Parry",
      "Pawan Pawan",
      "Brian Petersen",
      "Titi Preda",
      "Markus Prim",
      "Junkai Qin",
      "Michaela Queitsch-Maitland",
      "Juan Rojo",
      "Hiroki Rokujo",
      "André Rubbia",
      "Osamu Sato",
      "Paola Scampoli",
      "Kristof Schmieden",
      "Matthias Schott",
      "Cristiano Sebastiani",
      "Anna Sfyrla",
      "Davide Sgalaberna",
      "Mansoora Shamim",
      "Yosuke Takubo",
      "Noshin Tarannum",
      "Simon Thor",
      "Eric Torrence",
      "Oscar Ivan Valdes Martinez",
      "Svetlana Vasina",
      "Benedikt Vormwald",
      "Chi Wang",
      "Yuxiao Wang",
      "Eli Welch",
      "Aaron White",
      "Monika Wielers",
      "Benjamin James Wilson",
      "Yue Xu",
      "Heng Yang",
      "Lekai Yao",
      "Daichi Yoshikawa",
      "Stefano Zambito",
      "Shunliang Zhang",
      "Yuxuan Zhang",
      "Xingyu Zhao",
      "Zijian Zhao"
    ],
    "published": "2026-02-19T17:33:45Z",
    "updated": "2026-02-19T17:33:45Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "1201.1154v2",
    "url": "https://arxiv.org/abs/1201.1154v2",
    "pdf_url": "https://arxiv.org/pdf/1201.1154v2.pdf",
    "title": "Magnetic Alloy/Ferrite cavities",
    "abstract": "RF cavities loaded with magnetic alloy (MA) or ferrite ring cores are used in synchrotrons and storage rings if the maximum RF frequency is in the order of a few MHz. A simple model for the description of cavities of this type is derived. The most important parameters are defined, and some properties of the material and of the cavity are summarized. Different cavity configurations, development aspects, and several practical topics are covered. A few specific ferrite- and MA-loaded cavity systems are discussed as examples.",
    "authors": [
      "Harald Klingbeil"
    ],
    "published": "2012-01-05T12:50:29Z",
    "updated": "2026-02-19T17:07:41Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.17536v1",
    "url": "https://arxiv.org/abs/2602.17536v1",
    "pdf_url": "https://arxiv.org/pdf/2602.17536v1.pdf",
    "title": "Toward a Fully Autonomous, AI-Native Particle Accelerator",
    "abstract": "This position paper presents a vision for self-driving particle accelerators that operate autonomously with minimal human intervention. We propose that future facilities be designed through artificial intelligence (AI) co-design, where AI jointly optimizes the accelerator lattice, diagnostics, and science application from inception to maximize performance while enabling autonomous operation. Rather than retrofitting AI onto human-centric systems, we envision facilities designed from the ground up as AI-native platforms. We outline nine critical research thrusts spanning agentic control architectures, knowledge integration, adaptive learning, digital twins, health monitoring, safety frameworks, modular hardware design, multimodal data fusion, and cross-domain collaboration. This roadmap aims to guide the accelerator community toward a future where AI-driven design and operation deliver unprecedented science output and reliability.",
    "authors": [
      "Chris Tennant"
    ],
    "published": "2026-02-19T16:49:36Z",
    "updated": "2026-02-19T16:49:36Z",
    "categories": [
      "physics.acc-ph",
      "cs.AI"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2505.06362v2",
    "url": "https://arxiv.org/abs/2505.06362v2",
    "pdf_url": "https://arxiv.org/pdf/2505.06362v2.pdf",
    "title": "Modeling the light response of an optically readout GEM based TPC for the CYGNO experiment",
    "abstract": "The use of gaseous Time Projection Chambers enables the detection and the detailed study of rare events due to particles interactions with the atoms of the gas with energy releases as low as a few keV. Due to this capability, these instruments are being developed for applications in the field of astroparticle physics, such as the study of dark matter and neutrinos. To readout events occurring in the sensitive volume with a high granularity, the CYGNO collaboration is developing a solution where the light generated during the avalanche processes occurring in a multiplication stage based on Gas Electron Multiplier (GEM) is read out by optical sensors with very high sensitivity and spatial resolution. To achieve a high light output, gas gain values of the order of $10^5\\text{-}10^6$ are needed. Experimentally, a dependence of the detector response on the spatial density of the charge collected in the GEM holes has been observed, indicating a gain-reduction effect likely caused by space-charge buildup within the multiplication channels. This paper presents data collected with a prototype featuring a sensitive volume of about two liters, together with a model developed by the collaboration to describe and predict the gain dependence on charge density. A comparison with experimental data shows that the model accurately reproduces the gain behaviour over nearly one order of magnitude, with a percent-level precision.",
    "authors": [
      "Fernando Dominques Amaro",
      "Rita Antonietti",
      "Elisabetta Baracchini",
      "Luigi Benussi",
      "Stefano Bianco",
      "Roberto Campagnola",
      "Cesidio Capoccia",
      "Michele Caponero",
      "Gianluca Cavoto",
      "Igor Abritta Costa",
      "Antonio Croce",
      "Emiliano Danè",
      "Melba D'Astolfo",
      "Giorgio Dho",
      "Flaminia Di Giambattista",
      "Emanuele Di Marco",
      "Giulia D'Imperio",
      "Joaquim Marques Ferreira dos Santos",
      "Davide Fiorina",
      "Francesco Iacoangeli",
      "Zahoor Ul Islam",
      "Herman Pessoa Lima Junior",
      "Ernesto Kemp",
      "Francesca Lewis",
      "Giovanni Maccarrone",
      "Rui Daniel Passos Mano",
      "Robert Renz Marcelo Gregorio",
      "David Josè Gaspar Marques",
      "Luan Gomes Mattosinhos de Carvalho",
      "Giovanni Mazzitelli",
      "Alasdair Gregor McLean",
      "Pietro Meloni",
      "Andrea Messina",
      "Cristina Maria Bernardes Monteiro",
      "Rafael Antunes Nobrega",
      "Igor Fonseca Pains",
      "Matteo Pantalena",
      "Emiliano Paoletti",
      "Luciano Passamonti",
      "Fabrizio Petrucci",
      "Stefano Piacentini",
      "Davide Piccolo",
      "Daniele Pierluigi",
      "Davide Pinci",
      "Atul Prajapati",
      "Francesco Renga",
      "Rita Joana Cruz Roque",
      "Filippo Rosatelli",
      "Alessandro Russo",
      "Sabrina Salamino",
      "Giovanna Saviano",
      "Federico Francesco Scamporlino",
      "Angelo Serrecchia",
      "Pedro Alberto Oliveira Costa Silva",
      "Neil John Curwen Spooner",
      "Roberto Tesauro",
      "Sandro Tomassini",
      "Samuele Torelli",
      "Donatella Tozzi"
    ],
    "published": "2025-05-09T18:06:09Z",
    "updated": "2026-02-19T16:14:57Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.17468v1",
    "url": "https://arxiv.org/abs/2602.17468v1",
    "pdf_url": "https://arxiv.org/pdf/2602.17468v1.pdf",
    "title": "Tolerances to driver-witness misalignment in a quasilinear plasma wakefield accelerator",
    "abstract": "Plasma-based accelerators offer high accelerating gradients and scalability through staging or long plasma sources, which makes them good candidates for future accelerator and collider concepts. Proton-driven accelerators in particular have the potential to bring particles to high energy in a single stage. In the quasilinear regime - where the plasma wake is only partially evacuated - a witness bunch of electrons drives a cavitated wake, which acts to preserve the emittance of the portion of the witness inside this self-blowout. In the case of a misalignment between the driver and witness, this behaviour can persist, but its effectiveness is reduced. In this paper, we study transverse witness dynamics in this regime, and develop analytical models to describe the witness motion, and develop a metric to estimate emittance preservation based on a single parameter which estimates the density of the witness after phase mixing. Particle in cell simulations using the AWAKE Run 2c baseline parameters show excellent agreement with the predictive models developed. This work allows alignment constraints to be set both for the AWAKE experiment and other wakefield acceleration schemes operating in the quasilinear regime.",
    "authors": [
      "T. C. Wilson",
      "J. Farmer",
      "K. Lotov",
      "A. Pukhov"
    ],
    "published": "2026-02-19T15:34:28Z",
    "updated": "2026-02-19T15:34:28Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.17396v1",
    "url": "https://arxiv.org/abs/2602.17396v1",
    "pdf_url": "https://arxiv.org/pdf/2602.17396v1.pdf",
    "title": "Prospects for Direct Electron Detectors in Ultrafast Electron Scattering Experiments",
    "abstract": "Ultrafast electron diffraction and phonon-diffuse scattering (UED(S)) experiments make use of photo-induced changes to electron scattering intensity across 2D detectors to report on a very wide range of dynamic structural phenomena in molecules and materials. Compared to ultrafast spectroscopies, these techniques have very high structural-information content and competitive time-resolution, but sensitivity to relative changes in electron scattering intensity is orders of magnitude lower. Hybrid pixel counting detectors (HPCDs) are a promising technology for improved sensitivity and signal-to-noise in UED(S) experiments, as they offer near-zero readout noise and dark counts with the possibility of new acquisition modalities (e.g. shot-to-shot normalization) due to their high frame rates. However, it is well known that HPCDs suffer from count losses at high electron fluxes even in CW beam applications. How this translates to ultrashort electron pulse exposures has yet to be determined and is critical to understanding the application of this technology to ultrafast electron scattering experiments. Here we show that count losses are exacerbated significantly in ultrafast (pulsed) experiments and that HPCDs require count rates to be kept below $\\approx 2$ electrons per pixel per pulse. This count-rate limitation presents a severe constraint on electron bunch charge when interrogating single crystal samples. A model for the electron counting uncertainties in HPCDs across the entire relevant range of average count rates is proposed, from which we derive experimental strategies to optimize data quality in UEDS using direct electron detectors. Finally, we suggest ways HPCDs could be better adapted to ultrashort pulsed beam experiments.",
    "authors": [
      "Laurenz Kremeyer",
      "David Cai",
      "Malik Lahlou",
      "Sebastian Hammer",
      "Raphael Schwenzer",
      "Bradley J. Siwick"
    ],
    "published": "2026-02-19T14:21:24Z",
    "updated": "2026-02-19T14:21:24Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.24196v3",
    "url": "https://arxiv.org/abs/2510.24196v3",
    "pdf_url": "https://arxiv.org/pdf/2510.24196v3.pdf",
    "title": "Design and characterization of a photosensor system for the RELICS experiment",
    "abstract": "In this paper, we present the design and characterization of a photosensor system developed for the RELICS experiment. An extended dynamic range base was designed to mitigate photomultiplier tube (PMT) saturation caused by intense cosmic muon backgrounds in the surface-level RELICS detector. The system employs dual readout from the anode and the seventh dynode to extend the linear response range of the PMT. In particular, our characterization and measurements of Hamamatsu R8520-406 PMTs confirm stable operation under positive high-voltage bias, extending the linear response range by more than an order of magnitude. Furthermore, a model of PMT saturation and recovery was developed to evaluate the influence of cosmic muon signals in the RELICS detector. The results demonstrate the system capability to detect coherent elastic neutrino-nucleus scattering signals under surface-level cosmic backgrounds, and suggest the potential to extend the scientific reach of RELICS to MeV-scale interactions.",
    "authors": [
      "Jijun Yang",
      "Ruize Li",
      "Chang Cai",
      "Guocai Chen",
      "Jiangyu Chen",
      "Huayu Dai",
      "Rundong Fang",
      "Fei Gao",
      "Jingfan Gu",
      "Xiaoran Guo",
      "Jiheng Guo",
      "Gaojun Jin",
      "Fali Ju",
      "Yanzhou Hao",
      "Yang Lei",
      "Kaihang Li",
      "Meng Li",
      "Minhua Li",
      "Shengchao Li",
      "Siyin Li",
      "Tao Li",
      "Qing Lin",
      "Jiajun Liu",
      "Sheng Lv",
      "Guang Luo",
      "Kangwei Ni",
      "Chuanping Shen",
      "Mingzhuo Song",
      "Lijun Tong",
      "Jun Wang",
      "Xiaoyu Wang",
      "Wei Wang",
      "Xiaoping Wang",
      "Zihu Wang",
      "Yuehuan Wei",
      "Liming Weng",
      "Xiang Xiao",
      "Lingfeng Xie",
      "Litao Yang",
      "Long Yang",
      "Jingqiang Ye",
      "Jiachen Yu",
      "Qian Yue",
      "Yuyong Yue",
      "Bingwei Zhang",
      "Yuming Zhang",
      "Yifei Zhao",
      "Chenhui Zhu"
    ],
    "published": "2025-10-28T09:03:00Z",
    "updated": "2026-02-19T09:50:01Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/21/02/P02039"
  },
  {
    "arxiv_id": "2602.17173v1",
    "url": "https://arxiv.org/abs/2602.17173v1",
    "pdf_url": "https://arxiv.org/pdf/2602.17173v1.pdf",
    "title": "Standards and Safety: an Overview",
    "abstract": "This note is intended to provide an overview of the implications of regulations and standards on the safety of mechanical equipment, with a focus on accelerator components. Each research facility has different internal rules and standards which are applicable to specific cases; however, the main reference legal frame in Europe is everywhere based on the applicable European Directives. After a brief introduction to the 'safety' for mechanical systems, the process of 'risk analysis' will be introduced. The majority of this note will then deal with regulations and standards for pressure and cryogenic equipment. The European Pressure Equipment Directive (PED) will be briefly described, together with the concept of 'harmonized standards' and their implications on the entire lifecycle of a pressure equipment, with some hints at the peculiarities of accelerator components. In the second part of this note, regulations and standards for machinery, load-lifting accessories and buildings will be briefly mentioned to complete the picture of the most common cases in an accelerator facility.",
    "authors": [
      "Luca Dassa"
    ],
    "published": "2026-02-19T08:39:35Z",
    "updated": "2026-02-19T08:39:35Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.17126v1",
    "url": "https://arxiv.org/abs/2602.17126v1",
    "pdf_url": "https://arxiv.org/pdf/2602.17126v1.pdf",
    "title": "Measurement of ionization yield of low energy ions in low pressure $\\mathrm{CF}_{4}$ gas for dark matter searches",
    "abstract": "Direction-sensitive direct dark matter search experiments have been conducted using gaseous detectors. In spite of the long history of the study on the energy deposition of charged particles in materials, a full agreement between the measured results and theoretical predictions, especially in a low energy scale, are yet to be achieved. It is thus important to experimentally measure the ionization yields of recoil nuclei for the experiments with gaseous detectors using an ionization charge readout scheme. This study measured the ionization yield using a low-energy ion beam facility at Kanagawa University. The ionization yields for fluorine ions with an energy range of 5 $\\sim$ 50 keV were measured using a dedicated proportional wire chamber filled with $\\mathrm{CF}_{4}$ gas at 0.06 atm. The low-energy ion injection scheme into a gaseous detector was established and the ionization yield for fluorine ions was obtained to be 0.45 at 30 keV with a moderate dependence on the ion energy.",
    "authors": [
      "Satoshi Higashino",
      "Wakako Toyama",
      "Takuya Shiraishi",
      "Yasushi Hoshino",
      "Tatsuhiro Naka",
      "Kentaro Miuchi"
    ],
    "published": "2026-02-19T06:55:50Z",
    "updated": "2026-02-19T06:55:50Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.17000v1",
    "url": "https://arxiv.org/abs/2602.17000v1",
    "pdf_url": "https://arxiv.org/pdf/2602.17000v1.pdf",
    "title": "Power attenuation in millimeter-wave and terahertz superconducting rectangular waveguides: linear response, TLS loss, and Higgs-mode nonlinearity",
    "abstract": "Superconducting waveguides are a promising platform for ultralow-loss transmission in the millimeter-wave to terahertz band under cryogenic conditions, with potential applications in astronomical instrumentation and emerging quantum technologies. We develop a framework, based on microscopic superconductivity theory, to evaluate the power-flow attenuation constant $α$ of superconducting rectangular waveguides in the $100~\\mathrm{GHz}$--THz range, applicable to arbitrary electronic mean free paths $\\ell$ from the dirty limit $\\ell\\llξ_0$ to the clean limit $\\ell\\ggξ_0$. We also derive an analytical expression for two-level-system (TLS)-induced attenuation $α_{\\rm TLS}$ in thin native oxide layers within the standard TLS model. Using this framework, we perform numerical evaluations of $α$ for representative materials over standard waveguide sizes from WR15 to WR1. In the high-frequency regime $f \\gtrsim 0.5 Δ/h$, low attenuation favors the clean regime $\\ell\\gtrsimξ_0$, indicating that high-purity materials can achieve very low attenuation below their gap frequency. For the TLS contribution, using parameter values representative of native Nb oxides, we find that $α_{\\rm TLS}$ can become relevant at sufficiently low temperatures $T/T_c\\lesssim 0.1$-0.2, where quasiparticle dissipation is exponentially suppressed. Finally, we extend the discussion to the strong-excitation regime using a recently developed nonlinear-response theory within the Keldysh--Usadel framework of nonequilibrium superconductivity and show that nonlinear dissipation produces a Higgs-mode peak in $α$ near $f\\simeq Δ/h$ via a Kerr-type nonlinearity of the dissipative conductivity. This peak provides a distinct hallmark of the Higgs mode that has been largely overlooked so far.",
    "authors": [
      "Takayuki Kubo"
    ],
    "published": "2026-02-19T01:49:24Z",
    "updated": "2026-02-19T01:49:24Z",
    "categories": [
      "cond-mat.supr-con",
      "physics.acc-ph",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "cond-mat.supr-con"
  },
  {
    "arxiv_id": "2602.16991v1",
    "url": "https://arxiv.org/abs/2602.16991v1",
    "pdf_url": "https://arxiv.org/pdf/2602.16991v1.pdf",
    "title": "Radiological mapping and uncertainty quantification by a fast Microcanonical Langevin Monte Carlo sampler",
    "abstract": "Radiological mapping plays a critical role in nuclear emergency response and environmental management activities. A radiation image, representing the spatial and intensity distribution of the radioactivity, is reconstructed from the radiation data and associated contextual information. Typical image reconstruction methods, such as Maximum Likelihood Expectation-Maximization (ML-EM), only provide point estimates of the pixel or voxel activities without associated uncertainties. Here, we apply a new Microcanonical Langevin Monte Carlo (MCLMC) sampler for radiation image reconstruction and uncertainty quantification. The MCLMC sampler properties are first tested with synthetic radiation images. Methods to obtain the radiation distribution estimate and the associated uncertainty from the samples drawn by MCLMC are discussed. Given sufficient measurement statistics, the radiation distribution estimate obtained from MCLMC results closely resembles the ground truth with less risk of over- or under-fitting compared to ML-EM. When MCLMC is run in parallel on a GPU, it can converge in about 10 seconds for an image with $10^3$--$10^4$ pixels, which is significantly faster than other comparable Markov Chain Monte Carlo (MCMC) samplers. We also tested MCLMC on a dataset from a real distributed source radiological mapping campaign, and the reconstructed results agree well with ground truth. The fast MCLMC sampler therefore enables improved imaging accuracy and prompt uncertainty quantification for reconstructed radiation images, which can better inform decision-making in response to radiological events.",
    "authors": [
      "Lei Pan",
      "Jaewon Lee",
      "Brian J. Quiter",
      "Jakob Robnik",
      "Uroš Seljak",
      "Jayson R. Vavrek"
    ],
    "published": "2026-02-19T01:30:44Z",
    "updated": "2026-02-19T01:30:44Z",
    "categories": [
      "physics.med-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.med-ph"
  },
  {
    "arxiv_id": "2602.16828v1",
    "url": "https://arxiv.org/abs/2602.16828v1",
    "pdf_url": "https://arxiv.org/pdf/2602.16828v1.pdf",
    "title": "Performance of the Endcap Time-of-Flight detector in the STAR beam-energy scan",
    "abstract": "The STAR experiment at RHIC at Brookhaven National Laboratory completed the installation of an endcap time-of-flight subsystem (eTOF) in February 2019. The eTOF subsystem provided essential mid-rapidity particle identification (PID) for the fixed-target (FXT) portion of phase II of the beam energy scan (BES II). The FXT program allowed BES II to include center-of-mass energies from $\\sqrt{s_{_{NN}}} = 3.0$ GeV to $\\sqrt{s_{_{NN}}} = 7.7$ GeV, not accessible by colliding beams. The eTOF detectors and readout electronics were designed for the CBM experiment at FAIR and adapted for use at STAR. In this paper, we describe the details of the system in terms of geometrical layout, acceptance, calibration, hit reconstruction, and particle identification. The system achieved a time resolution of about 70 ps and a PID efficiency of about 70\\%, meeting the design goals of the project.",
    "authors": [
      "Mathias C. Labonté",
      "Daniel Cebra",
      "Zachary Sweger",
      "Geary Eppley",
      "Frank Geurts",
      "Yannick Söhngen",
      "Norbert Herrmann",
      "Esteban Rubio",
      "Philipp Weidenkaff",
      "Ingo Deppner",
      "Pierre-Alain Loizeau",
      "Jochen Frühauf",
      "David Emschermann",
      "Florian Seck",
      "David Tlusty",
      "Dongdong Hu",
      "Yongjie Sun",
      "Tonko Ljubicic",
      "Yi Wang"
    ],
    "published": "2026-02-18T19:50:01Z",
    "updated": "2026-02-18T19:50:01Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.21122v3",
    "url": "https://arxiv.org/abs/2512.21122v3",
    "pdf_url": "https://arxiv.org/pdf/2512.21122v3.pdf",
    "title": "Coherent-state boundary conditions as the first-principles origin of background fields in QED",
    "abstract": "QED formulated in prescribed classical background electromagnetic fields is a standard framework for strong-field and laser\\textendash matter interactions. It is usually treated as a theory modified by externally imposed fields, obscuring its precise relation to full QED and, in particular, the role of asymptotic boundary conditions for the gauge field. Starting from an operator-based formulation, we show that QED with background fields is not a distinct theory but arises as a well-defined boundary-condition limit of full QED, in which the classical background field emerges from coherent-state boundary conditions on the quantized electromagnetic field. In this limit, the conventional generating functional used in calculations with prescribed background fields is recovered naturally, while relaxing the boundary conditions allows depletion and backreaction effects to be incorporated within the same framework. The central new result is a rigorous operator-level proof of the equivalence between the fixed background-field approximation and coherent-state asymptotic boundary conditions\\textemdash a formulation that, to our knowledge, has not been made explicit in previous approaches. We further demonstrate that the apparent time dependence of background fields does not originate from an explicitly time-dependent Hamiltonian, but instead reflects the choice of picture\\textemdash Schrödinger versus Heisenberg\\textemdash in the underlying quantum theory. Rather than introducing new properties of coherent states, our analysis provides a first-principles reinterpretation of the fixed background-field approximation as a controlled and picture-dependent limit of full QED.",
    "authors": [
      "Keita Seto"
    ],
    "published": "2025-12-24T11:49:53Z",
    "updated": "2026-02-18T18:16:47Z",
    "categories": [
      "physics.plasm-ph",
      "hep-ph",
      "physics.optics",
      "quant-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.16672v1",
    "url": "https://arxiv.org/abs/2602.16672v1",
    "pdf_url": "https://arxiv.org/pdf/2602.16672v1.pdf",
    "title": "FLUKA-Based Optimization of Muon Production Target Design for a Muon Collider Demonstrator",
    "abstract": "This study investigates how target geometry and material influence pion and muon production from an 8 GeV proton beam, in support of target-system design for a muon collider demonstrator. A 2 m long, 0.7 m radius solenoid with a 5 T peak magnetic field is used to capture secondary particles, with the target positioned at its center. We examine how variations in target radius, length, and material affect secondary-beam yield and emittance at the solenoid exit. In parallel, we evaluate temperature rise within the target to assess material limitations and guide future work on thermal and structural survivability. The results provide initial intuition for optimizing both particle yield and target durability in muon collider front-end systems.",
    "authors": [
      "Ruaa Al-Harthy"
    ],
    "published": "2026-02-18T18:09:08Z",
    "updated": "2026-02-18T18:09:08Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.16652v1",
    "url": "https://arxiv.org/abs/2602.16652v1",
    "pdf_url": "https://arxiv.org/pdf/2602.16652v1.pdf",
    "title": "Nonlinear Frequency Shifts due to Phase Coherent Interactions in Incompressible Hall MHD Turbulence",
    "abstract": "Turbulence in the magnetized plasma is well understood to be the consequence of wave interactions. When the Hall effect is added to the minimum magnetohydrodynamics (MHD), the MHD waves become dispersive and different nonlinear interactions are expected. The emergent turbulent state will thus be expected to be different. For incompressible Hall MHD we develop a reduced model for wave-wave interactions concentrating on those processes that will lead to phase coherent modifications to the linear dispersion of a given wave. We show that these special interactions provide an amplitude-dependent contribution to the linear dispersion relation, which yields nonlinear frequency shifts. The resonance-driven frequency shifts are dominant and add damping or growth to the linear dispersion. The damping/growth rates represent the nonlinear time scales for energy redistribution and can be used in conjunction with a conjecture like the \"critical balance\" to estimate the energy spectral content.",
    "authors": [
      "Erik C. Hansen",
      "Prerana Sharma",
      "Swadesh M. Mahajan"
    ],
    "published": "2026-02-18T17:47:34Z",
    "updated": "2026-02-18T17:47:34Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.16624v1",
    "url": "https://arxiv.org/abs/2602.16624v1",
    "pdf_url": "https://arxiv.org/pdf/2602.16624v1.pdf",
    "title": "Measurement of the Saturation Length of the Self-Modulation Instability",
    "abstract": "The self-modulation (SM) instability transforms a long charged particle bunch traveling in plasma into a train of microbunches that resonantly drives large-amplitude wakefields. We present the first determination of the saturation length of SM using experimental and numerical results. The saturation length is the distance over which wakefields reach their maximum amplitude along the plasma. By varying the plasma length and measuring the radius of the transverse distribution of the bunch, we find that the saturation length of SM decreases with plasma density and initial field amplitude, e.g., when seeding. The saturation length is a fundamental parameter of the instability, and these results are key for understanding SM and designing plasma wakefield accelerators driven by long bunches, such as AWAKE, or by long laser pulses for radiation production.",
    "authors": [
      "A. Clairembaud",
      "M. Turner",
      "M. Bergamaschi",
      "L. Ranc",
      "F. Pannell",
      "J. Mezger",
      "H. Jaworska",
      "N. van Gils",
      "J. Farmer",
      "P. Muggli",
      "the AWAKE Collaboration"
    ],
    "published": "2026-02-18T17:18:25Z",
    "updated": "2026-02-18T17:18:25Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.16567v1",
    "url": "https://arxiv.org/abs/2602.16567v1",
    "pdf_url": "https://arxiv.org/pdf/2602.16567v1.pdf",
    "title": "Scattering and sputtering on the lunar surface; Insights from negative ions observed at the surface",
    "abstract": "Context. Airless planetary bodies are directly exposed to solar wind ions, which can scatter or become implanted upon impact with the regolith-covered surface, while also sputtering surface atoms.   Aims. We construct a semi-analytical model for the scattering of ions of hundreds of eV and the sputtering of surface atoms, both resulting in the emission of negative ions from the lunar surface. Our model contains a novel description of the scattering process that is physics-based and constrained by observations.   Methods. We use data from the Negative Ions at the Lunar Surface (NILS) instrument on the Chang'e-6 lander to update prior knowledge of ion scattering and sputtering from lunar regolith through Bayesian inference.   Results. Our model shows good agreement with the NILS data. A precipitating solar wind proton has roughly a 22% chance of scattering from the lunar surface in any charge state, and about an 8% chance of sputtering a surface hydrogen atom. The resulting ratio of scattered to sputtered hydrogen flux is eta_sc / eta_sp = 1.5 for a proton speed of 300 km/s. We find a high probability (7-20%) that a hydrogen atom leaves the surface negatively charged. The angular emission distributions at near-grazing angles for both scattered and sputtered fluxes are controlled by surface roughness. Our model also indicates significant inelastic energy losses for hydrogen interacting with the regolith, suggesting a longer effective path length than previously assumed. Finally, we estimate a surface binding energy of 5.5 eV, consistent with the observations.   Conclusions. Our model describes the scattering and sputtering of particles of any charge state from any homogeneous, multi-species surface. Using NILS data, we successfully applied the model to update our understanding of solar wind interacting with lunar regolith, and the emission of negative hydrogen ions.",
    "authors": [
      "Romain Canu-Blot",
      "Martin Wieser",
      "Umberto Rollero",
      "Thomas Maynadié",
      "Stas Barabash",
      "Gabriella Stenberg Wieser",
      "Aibing Zhang",
      "Wenjing Wang",
      "Chi Wang"
    ],
    "published": "2026-02-18T16:09:02Z",
    "updated": "2026-02-18T16:09:02Z",
    "categories": [
      "physics.space-ph",
      "physics.atom-ph",
      "physics.ins-det",
      "stat.AP"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2504.20755v2",
    "url": "https://arxiv.org/abs/2504.20755v2",
    "pdf_url": "https://arxiv.org/pdf/2504.20755v2.pdf",
    "title": "Low dose gamma irradiation study of ATLAS ITk MD8 diodes",
    "abstract": "Silicon strip detectors developed for the Inner Tracker (ITk) of the ATLAS experiment will operate in a harsh radiation environment of the HL-LHC accelerator. The ITk is thus designed to endure a total fluence of 1.6E15 1MeV n_eq/cm2 and a total ionizing dose (TID) of 66 Mrad in the strip detector region. A radiation-hard n^+-in-p technology is implemented in the ITk strip sensors. To achieve the required radiation hardness, extensive irradiation studies were conducted during sensor development, primarily performed up to the maximal expected total fluence and TID to ensure a full functionality of the detector at its end-of-life. These studies included irradiations of sensors with various particle types and energies, including the Co60 gamma-rays. Our previous results obtained for gamma-irradiated diodes and strip sensors indicate a linear increase of bulk current with TID, while the surface current saturates at the lowest TID levels checked (66 Mrad), preventing a determination of the exact TID for which the observed saturation occurs. This work presents the results coming from irradiations by Co60 gamma-rays to multiple low TIDs, ranging from 0.5 to 100 krad. The detailed study of total, bulk, and surface currents of diodes explores an unknown dependence of surface current on the TID, annealing, and temperature. Additionally, the effect of the p-stop implant between the bias and the guard ring of measured samples is shown. The observations are relevant for the initial operations of the new ATLAS tracker.",
    "authors": [
      "M. Mikeštíková",
      "V. Fadeyev",
      "P. Federičová",
      "P. Gallus",
      "J. Kozáková",
      "J. Kroll",
      "M. Kůtová",
      "J. Kvasnička",
      "P. Tůma",
      "M. Ullán",
      "Y. Unno"
    ],
    "published": "2025-04-29T13:34:38Z",
    "updated": "2026-02-18T16:07:36Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.16542v1",
    "url": "https://arxiv.org/abs/2602.16542v1",
    "pdf_url": "https://arxiv.org/pdf/2602.16542v1.pdf",
    "title": "Laboratory observation of collective beam-plasma instabilities in a relativistic pair jet",
    "abstract": "We report on a measurement of collective behavior in a relativistic electron-positron pair plasma produced in the laboratory. Using the Fireball platform at CERN's HiRadMat facility, 440 GeV protons were used to generate an ultra-relativistic, charge-neutral electron-positron pair beam that propagated through an ambient RF discharge plasma. Magnetic-field amplification due to a beam-plasma instability was diagnosed using a high-sensitivity Faraday-rotation probe, supported by detailed characterization of the diagnostic impulse response. The measured path-integrated magnetic field agrees quantitatively with predictions from particle-in-cell simulations. The results provide a critical benchmark for models of relativistic beam-plasma interactions in astrophysical contexts such as blazar jets and pulsar-wind nebulae.",
    "authors": [
      "J W D Halliday",
      "C D Arrowsmith",
      "A M Goillot",
      "P J Bilbao",
      "P Simon",
      "V Stergiou",
      "S Zhang",
      "P Alexaki",
      "M Bochmann",
      "A F A Bott",
      "S Burger",
      "H Chen",
      "F D Cruz",
      "T Davenne",
      "A Dyson",
      "A Ebn Rahmoun",
      "I Efthymiopoulos",
      "D H Froula",
      "J T Gudmundsson",
      "D Haberberger",
      "T Hodge",
      "S Iaquinta",
      "E E Los",
      "G Marshall",
      "F Miniati",
      "S Parker",
      "B Reville",
      "P Rousiadou",
      "S Sarkar",
      "A A Schekochihin",
      "K G Schlesinger",
      "L O Silva",
      "T Silva",
      "R Simpson",
      "E Soria",
      "R M G M Trines",
      "T Vieu",
      "N Charitonidis",
      "R Bingham",
      "G Gregori"
    ],
    "published": "2026-02-18T15:42:34Z",
    "updated": "2026-02-18T15:42:34Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.16529v1",
    "url": "https://arxiv.org/abs/2602.16529v1",
    "pdf_url": "https://arxiv.org/pdf/2602.16529v1.pdf",
    "title": "Thermal Decoherence and Population Transfer of MeV Channeling Electrons in Diamond",
    "abstract": "Channeling radiation in oriented crystals arises from transitions between quantized transverse bound states in the MeV regime and is strongly affected by thermal diffuse scattering through population transfer and decoherence. A frozen-phonon multislice propagation framework is developed to track a reduced transverse Hilbert space spanned by selected bound-state manifolds using configuration-resolved projection amplitudes. Beyond reproducing transition energies, the method yields reduced manifold density matrices, thermal population kinetics, and depth-resolved coherence metrics. Applied to axial electron channeling in $\\langle100\\rangle$ diamond at 16.9 MeV, the results show approximately exponential population loss with strongly state-dependent feeding among low-lying manifolds. For an initial coherent superposition in the degenerate 2p manifold, the intra-manifold purity relaxes toward the maximally mixed limit, consistent with thermally induced random basis rotations. Under 1s initial excitation, population transferred into the 2p and 3d manifolds remains close to maximally mixed, while weak cross-manifold coherences persist. The framework enables quantitative analysis of thermal population dynamics, decoherence, and their links to spontaneous and coherently driven emission observables across a broad range of crystal structures.",
    "authors": [
      "Tadas Paulauskas"
    ],
    "published": "2026-02-18T15:17:12Z",
    "updated": "2026-02-18T15:17:12Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.acc-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2512.06397v2",
    "url": "https://arxiv.org/abs/2512.06397v2",
    "pdf_url": "https://arxiv.org/pdf/2512.06397v2.pdf",
    "title": "Measuring the buried interphase between solid electrolytes and lithium metal using neutrons",
    "abstract": "Interfaces are the key to next generation high energy batteries including solid state Li metal batteries. In solid state batteries, the buried nature of solid solid electrolyte electrode interfaces makes studying them difficult. Neutrons have significant potential to non destructively probe these buried solid solid interfaces. This work presents a comparative study using both neutron depth profiling (NDP) and neutron reflectometry (NR) to study a model lithium metal-lithium phosphorus oxynitride (LiPON) solid electrolyte system. In the NDP data, no distinct interphase is observed at the interface. NR shows a difference between electrodeposited, and vapor deposited LiPON -Li interfaces but finds both are gradient interphases that are less than 30 nm thick. Additional simulations of the LiPON-Li2O-Li system demonstrate that NDP has an excellent resolution in the 50 nm-1 mm regime while NR has an ideal resolution from 0.1 - 200 nm with different sample requirements. Together NDP and NR can provide a complementary understanding of interfaces between Li metal and solid electrolytes across relevant length scales.",
    "authors": [
      "Andrew S. Westover",
      "Katie L. Browning",
      "Antonino Cannavo",
      "Ralph Gilles",
      "Jiri Vacik",
      "James F. Browning",
      "Neelima Paul",
      "Giovanni Ceccio",
      "Vasyl Lavrentiev"
    ],
    "published": "2025-12-06T10:59:46Z",
    "updated": "2026-02-18T15:15:04Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2512.16630v5",
    "url": "https://arxiv.org/abs/2512.16630v5",
    "pdf_url": "https://arxiv.org/pdf/2512.16630v5.pdf",
    "title": "Photon Accelerator in Magnetized Electron-Ion Plasma",
    "abstract": "Strong magnetic fields and plasmas are intrinsically linked in both terrestrial laboratory experiments and in space phenomena. One of the most profound consequences of that is the change in relationship between the frequency and the wave number of electromagnetic waves propagating in plasma in the presence of such magnetic fields when compared to the case without these fields. Furthermore, magnetic fields alter electromagnetic wave interaction with relativistic plasma waves, resulting in different outcomes for particle and radiation generation. For a relativistic plasma wave-based photon acceleration this leads to an increased frequency gain, and, thus, potentially to higher efficiency. The influence of a magnetic field leads to quantitative and qualitative change in the properties of photon acceleration, amplifying the increase in the electromagnetic wave frequency.",
    "authors": [
      "Sergei Bulanov",
      "Stepan Bulanov",
      "Timur Esirkepov",
      "Gianluca Gregori",
      "Gabriele Grittani",
      "Marcel Lamač",
      "Brandon Russell",
      "Alec Thomas",
      "Petr Valenta"
    ],
    "published": "2025-12-18T15:06:33Z",
    "updated": "2026-02-18T12:28:02Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.16297v1",
    "url": "https://arxiv.org/abs/2602.16297v1",
    "pdf_url": "https://arxiv.org/pdf/2602.16297v1.pdf",
    "title": "Characterization of an MPPC-Based Scintillator Telescope and Measurement of Cosmic Muon Angular Distribution",
    "abstract": "This report presents the design, characterization, and application of a high-sensitivity optical detection system based on plastic scintillators coupled to Multi-Pixel Photon Counters (MPPCs). The primary objective was to evaluate the performance of MPPCs (Silicon Photomultipliers) as robust, low-voltage alternatives to traditional photomultiplier tubes for detecting faint scintillation light. The optoelectronic properties of the sensors were analyzed, including single-photoelectron gain calibration and dark count rate measurements, to optimize the signal-to-noise ratio. By embedding wavelength-shifting fibers to enhance light collection efficiency, the system was configured into a three-fold coincidence telescope. The angular distribution of the cosmic ray muon flux was measured to validate the detector's stability and geometric acceptance. Fitting the experimental data to a $\\bm{\\cos^n(θ)}$ distribution yielded an angular exponent of $\\bm{n = 1.44 \\pm 0.06}$, consistent with literature values. These results demonstrate the efficacy of the MPPC-scintillator coupling for precise photon counting and timing applications in high-energy physics instrumentation.",
    "authors": [
      "Sahla Manithottathil",
      "Anuj Gupta",
      "Mudit Kumar",
      "Navaneeth Poonthottathil"
    ],
    "published": "2026-02-18T09:27:39Z",
    "updated": "2026-02-18T09:27:39Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.02971v2",
    "url": "https://arxiv.org/abs/2510.02971v2",
    "pdf_url": "https://arxiv.org/pdf/2510.02971v2.pdf",
    "title": "Millimeter-Wavelength Lens-Absorber-Coupled Ti/Al Kinetic Inductance Detectors",
    "abstract": "This work presents Ti/Al bi-layer Microwave Kinetic Inductance Detectors (MKIDs) based on lens-coupled spiral absorbers as the quasi-optical coupling mechanism for millimeter-wavelength radiation detection. From simulations, the lens-coupled absorbers provide a 70% lens aperture efficiency in both polarizations over an octave band with a spiral array absorber and over 10% relative bandwidth with a single spiral. We have fabricated and measured two devices with bare Ti/Al MKIDs: a 3x3 cm chip with 9 pixels to characterize the optical response at 85 GHz of the two variations of the absorber; and a large format demonstrator with 253 spiral-array pixels showing potential towards a large format millimeter-wavelength camera. We estimate a sensitivity of 1 $\\mathrm{mK}\\cdot\\mathrm{Hz}^{-0.5}$ and a 95% detector yield.",
    "authors": [
      "Alejandro Pascual Laguna",
      "Victor Rollano",
      "Aimar Najarro-Fiandra",
      "David Rodriguez",
      "Maria T. Magaz",
      "Daniel Granados",
      "Alicia Gomez"
    ],
    "published": "2025-10-03T13:03:14Z",
    "updated": "2026-02-18T08:43:59Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "astro-ph.IM",
    "doi": "10.1109/TASC.2026.3665923"
  },
  {
    "arxiv_id": "2602.16221v1",
    "url": "https://arxiv.org/abs/2602.16221v1",
    "pdf_url": "https://arxiv.org/pdf/2602.16221v1.pdf",
    "title": "Reinterpreting the sunward electron deficit: Implications for solar wind acceleration and core population formation",
    "abstract": "This paper re-evaluates the relationship between the observed sunward electron cutoff energy and the depth of the Sun's global electrostatic potential. It investigates whether taking into account the effects of local traps formed by magnetic fluctuations provides an alternative explanation for the observed electron deficit. The fluctuations of the highly variable interplanetary magnetic field form a series of shallow magnetic mirror traps that move at approximately the speed of the solar wind. The study investigates the dynamics of electrons as they move outward against an attractive solar electrostatic potential and interact with these traps. By following the motion of the electrons using first-principles calculations, we assess the effect of the traps on the velocity distribution of the particles. Electrons that escape the local trap continue to lose energy as they move outward until they are eventually captured by subsequent traps, preventing them from returning to the observer as sunward-moving particles. We derive a mathematical expression for the cutoff velocity, defined as the limit beyond which particles can no longer overtake the outer endpoint of a local trap. It turns out that the observed cutoff energy characterizes only the local potential drop within a trap, rather than the total depth of the Sun's potential well. The true potential well can be significantly deeper, scaled by the ratio of the radial distance from the Sun to the trap size. Furthermore, electrons captured by these moving traps contribute to the formation of the solar wind core population. The Sun's electrostatic potential is a more significant factor in solar wind acceleration than previously interpreted from cutoff data. The interaction between electrostatic deceleration and moving magnetic traps provides a new framework for understanding the origin and behavior of the solar wind core electrons.",
    "authors": [
      "Zoltan Nemeth"
    ],
    "published": "2026-02-18T06:56:38Z",
    "updated": "2026-02-18T06:56:38Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2601.11837v2",
    "url": "https://arxiv.org/abs/2601.11837v2",
    "pdf_url": "https://arxiv.org/pdf/2601.11837v2.pdf",
    "title": "High-Voltage Performance Testing in LAr of the PMMA Cathode Connection for the DarkSide-20k Experiment",
    "abstract": "DarkSide-20k (DS-20k) is a next-generation dual-phase liquid argon (LAr) time projection chamber (TPC) devoted to the direct-detection of dark matter. The detector is currently under construction in Hall-C at the Laboratori Nazionali del Gran Sasso, Italy, at a depth of approximately 3500 m water equivalent. The detector will instrument 49.7 t of low-radioactivity underground LAr contained within an acrylic TPC and is designed to reach a WIMP-nucleon spin-independent cross-section sensitivity down to $10^{-48}\\,\\mathrm{cm}^{2}$ for a WIMP mass of $0.1\\,\\mathrm{TeV}/c^{2}$ in a 200 tonne-year run. In DS-20k a uniform electric drift field is established in the active volume to transport ionization electrons toward the electroluminescence region, with the required high voltage delivered to the TPC cathode through a custom cable and stress-cone assembly. At the University of California, Davis, a dedicated test setup was developed to reproduce the DS-20k cathode high-voltage connection in LAr, matching the local electric-field conditions. This work summarizes the results of a comprehensive test campaign validating the operation of the DS-20k cathode HV system in LAr up to $-100$ kV.",
    "authors": [
      "Ludovico Luzzi"
    ],
    "published": "2026-01-17T00:03:03Z",
    "updated": "2026-02-18T02:02:11Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.16074v1",
    "url": "https://arxiv.org/abs/2602.16074v1",
    "pdf_url": "https://arxiv.org/pdf/2602.16074v1.pdf",
    "title": "Melting Coulomb clusters through nonreciprocity-enhanced parametric pumping",
    "abstract": "Complex systems out of equilibrium often experience intermittent oscillations between quiescent and highly dynamic states. The type of intermittency depends on how energy is pumped into the system, and how it is dissipated. While intermittency is usually driven by stochastic noise or external forcing, energy can also be sourced from field-mediated interactions between particles, which are often nonreciprocal and effectively violate Newton's 3rd law. Here we demonstrate how nonreciprocal interactions produce intermittency in clusters of charged micron-sized particles confined in a plasma sheath. Through three-dimensional particle tracking, we observe that vertical oscillations, induced by fluctuations of the plasma environment, can be parametrically coupled to the horizontal modes. Experiments and simulations show that nonreciprocal interactions strongly amplify this parametric coupling, creating a positive feedback loop that drives explosive growth of both the horizontal and vertical modes. This mechanism triggers abrupt melting transitions from an ordered cluster to an ergodic gas-like state, and leads to intermittent switching between states over long time scales. Overall, our work identifies nonreciprocal interactions as a key mechanism through which strongly coupled finite systems transform interaction-mediated activity into dynamical nonequilibrium states.",
    "authors": [
      "Zhicheng Shu",
      "Wei-Chih Li",
      "Wentao Yu",
      "Justin C. Burton"
    ],
    "published": "2026-02-17T22:57:46Z",
    "updated": "2026-02-17T22:57:46Z",
    "categories": [
      "cond-mat.soft",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.soft"
  },
  {
    "arxiv_id": "2511.08881v2",
    "url": "https://arxiv.org/abs/2511.08881v2",
    "pdf_url": "https://arxiv.org/pdf/2511.08881v2.pdf",
    "title": "Commissioning the Resonance Ionization Spectroscopy Experiment at FRIB",
    "abstract": "This manuscript reports on the commissioning of the Resonance Ionization Spectroscopy Experiment (RISE) at the BECOLA facility at FRIB. The new instrument implements the collinear resonance ionization spectroscopy technique for sensitive measurements of isotope shifts and hyperfine structure of short-lived isotopes produced at FRIB. The existing BECOLA beamline was extended to integrate an electrostatic ion-beam bender and an ion detector at ultra-high vacuum. An injection-seeded Ti:Sapphire laser and a multi-harmonic pulsed Nd:YAG laser were installed to perform resonant excitation and selective ionization. Commissioning tests were performed to demonstrate the capabilities of the new instrument by measuring the hyperfine structure of stable $^{27}$Al produced in an offline ion source. The RISE instrument is ready and operational for future studies of short-lived isotopes at FRIB.",
    "authors": [
      "A. J. Brinson",
      "B. J. Rickey",
      "J. M. Allmond",
      "A. Dockery",
      "A. Fernandez Chiu",
      "R. F. Garcia Ruiz",
      "T. J. Gray",
      "J. Karthein",
      "T. T. King",
      "K. Minamisono",
      "A. Ortiz-Cortes",
      "S. V. Pineda",
      "M. Reponen",
      "B. C. Rasco",
      "S. M. Udrescu",
      "A. R. Vernon",
      "S. G. Wilkins"
    ],
    "published": "2025-11-12T01:35:09Z",
    "updated": "2026-02-17T22:52:25Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1103/hm9t-4pgp"
  },
  {
    "arxiv_id": "2602.15992v1",
    "url": "https://arxiv.org/abs/2602.15992v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15992v1.pdf",
    "title": "Properties of a compact neutron supermirror transmission polarizer with an electromagnetic system",
    "abstract": "The paper will present SVAROG, a compact neutron supermirror transmission multichannel polarizer with an electromagnetic system. The basic properties of this polarizer will be considered. Variants for using this polarizer in experimenrtla facilities of the PIK research reactor (Petersburg Nuclear Physics Institute of National Research Centre «Kurchatov Institute» (NRC «Kurchatov Institute» - PNPI)) will be discussed and a comparison of the considered polarizer with known neutron transmission polarizers will be carried out.",
    "authors": [
      "V. G. Syromyatnikov",
      "S. Yu. Semenikhin",
      "M. V. Lasitsa"
    ],
    "published": "2026-02-17T20:29:09Z",
    "updated": "2026-02-17T20:29:09Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex",
      "physics.acc-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.15990v1",
    "url": "https://arxiv.org/abs/2602.15990v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15990v1.pdf",
    "title": "Memristive tabular variational autoencoder for compression of analog data in high energy physics",
    "abstract": "We present an implementation of edge AI to compress data on an in-memory analog content-addressable memory (ACAM) device. A variational autoencoder is trained on a simulated sample of energy measurements from incident high-energy electrons on a generic three-layer scintillator-based calorimeter. The encoding part is distilled into tabular format by regressing the latent space variables using decision trees, which is then programmed on a memristor-based ACAM. In real-time, the ACAM compresses 48 continuously valued incoming energies measured by the calorimeter sensors into the latent space, achieving a compression factor of 12x, which is transmitted off-detector for decompression. The performance result of the ACAM, obtained using the Structural Simulation Toolkit, the SST open source framework, gives a latency value of 24 ns and a throughput of 330M compressions per second, i.e., 3 ns between successive inputs, and an average energy consumption of 4.1 nJ per compression.",
    "authors": [
      "Rajat Gupta",
      "Yuvaraj Elangovan",
      "Tae Min Hong",
      "James Ignowski",
      "John Moon",
      "Aishwarya Natarajan",
      "Stephen Roche",
      "Luca Buonanno"
    ],
    "published": "2026-02-17T20:26:56Z",
    "updated": "2026-02-17T20:26:56Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "physics.data-an"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.05331v2",
    "url": "https://arxiv.org/abs/2601.05331v2",
    "pdf_url": "https://arxiv.org/pdf/2601.05331v2.pdf",
    "title": "Directed Nano-antennas for Laser Fusion",
    "abstract": "Why do we use nano-antennas for fusion? In three sentences: The present laser induced fusion plans use extreme mechanical shock compression to get one hotspot and then ignition. Still fusion burning spreads slower than expansion, and mechanical instabilities may also develop. With nano-antennas in radiation dominated systems, simultaneous ignition can be achieved in the whole target volume and there is no time left for mechanical instabilities. Ignition is achieved with protons accelerated in the direction of the nanoantennas that are orthogonal to the direction of laser irradiation.   Present laser fusion methods are based on extreme and slow mechanical compression with an ablator surface on the fuel target pellet to increase compression and eliminate penetration of laser electromagnetic energy into the target. This arises from a mistaken assumption, [1] that the detonation normal 4-vector should have vanishing time-like component, and this assumption eliminates the possibility to rapid or even simultaneous, radiation dominated detonations, (which are well known in the burning (or hadronization) of Quark Gluon Plasma).",
    "authors": [
      "FUSENOW",
      "NAPLIFE Collaborations",
      ":",
      "Zsuzsanna Márton",
      "Imene Benabdelghani",
      "Márk Aladi",
      "Judit Budai",
      "Aldo Bonasera",
      "Attila Bonyár",
      "Mária Csete",
      "Tibor Gilinger",
      "Martin Greve",
      "Jan-Petter Hansen",
      "Gergely Hegedűs",
      "Ádám Inger",
      "Miklos Kedves",
      "Károly Osvay",
      "István Papp",
      "Péter Rácz",
      "András Szenes",
      "Ágnes Szokol",
      "Dávid Vass",
      "Parvin Varmazyar",
      "Miklós Veres",
      "Konstantin Zsukovszki",
      "Tamás S. Bíró",
      "Norbert Kroó",
      "Laszlo P. Csernai"
    ],
    "published": "2026-01-08T19:20:01Z",
    "updated": "2026-02-17T19:03:35Z",
    "categories": [
      "physics.plasm-ph",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.15946v1",
    "url": "https://arxiv.org/abs/2602.15946v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15946v1.pdf",
    "title": "On-chip probabilistic inference for charged-particle tracking at the sensor edge",
    "abstract": "Modern scientific instruments operate under increasingly extreme constraints on bandwidth, latency, and power. Inference at the sensor edge determines experimental data collection efficiency by deciding which information to save for further analysis. Particle tracking detectors at the Large Hadron Collider exemplify this challenge: pixelated silicon sensors generate rich spatiotemporal ionization patterns, yet most of this information is discarded due to data-rate limitations. Concurrently, advancements in co-design tools provide rapid turn-around for incorporating machine learning into application-specific integrated circuits, motivating designs for particle detectors with new integrated technologies. We demonstrate that neural networks embedded in the front-end electronics can infer charged-particle kinematic parameters from a single silicon layer. We regress hit positions and incident angles with calibrated uncertainties, while satisfying stringent constraints on numerical precision, latency, and silicon area. Our results establish a path toward probabilistic inference directly at the edge, opening new opportunities for intelligent sensing in high-rate scientific instruments.",
    "authors": [
      "Arghya Ranjan Das",
      "David Jiang",
      "Rachel Kovach-Fuentes",
      "Shiqi Kuang",
      "Ana Sofía Calle Muñoz",
      "Danush Shekar",
      "Jennet Dickinson",
      "Giuseppe Di Guglielmo",
      "Lindsey Gray",
      "Mia Liu",
      "Corrinne Mills",
      "Mark S. Neubauer",
      "Daniel Abadjiev",
      "Anthony Badea",
      "Doug Berry",
      "Karri DiPetrillo",
      "Farah Fahim",
      "Abhijith Gandrakota",
      "Harshul Gupta",
      "James Hirschauer",
      "Eliza Howard",
      "Ron Lipton",
      "Petar Maksimovic",
      "Nick Manganelli",
      "Benjamin Parpillon",
      "Jannicke Pearkes",
      "Ricardo Silvestre",
      "Morris Swartz",
      "Chinar Syal",
      "Nhan Tran",
      "Amit Trivedi",
      "Keith Ulmer",
      "Mohammad Abrar Wadud",
      "Benjamin Weiss",
      "Eric You"
    ],
    "published": "2026-02-17T19:03:17Z",
    "updated": "2026-02-17T19:03:17Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.15939v1",
    "url": "https://arxiv.org/abs/2602.15939v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15939v1.pdf",
    "title": "Particle-in-Cell Methods for Simulations of Sheared, Expanding, or Escaping Astrophysical Plasma",
    "abstract": "Particle-in-Cell (PIC) methods have achieved widespread recognition as simple and flexible approaches to model collisionless plasma physics in fully kinetic simulations of astrophysical environments. However, in many situations the standard PIC algorithm must be extended to include macroscopic effects in microscale simulations. For plasmas subjected to shearing or expansion, shearing-box and expanding-box methods can be incorporated into PIC to account for these global effects. For plasmas subjected to local acceleration in confined regions of space, a leaky-box method can allow closed-box PIC simulations to account for particle escape from the accelerator region. In this work, we review and improve methods to include shearing, expansion, and escape in PIC simulations. We provide the numerical details of how Maxwell's equations and the particle equations of motion are solved in each case, and introduce generalized Boris-like particle pushers to solve the momentum equation in the presence of extra forces. This work is intended to serve as a comprehensive reference for the implementation of shearing-box, expanding-box, and leaky-box algorithms in PIC.",
    "authors": [
      "Fabio Bacchini",
      "Evgeny A. Gorbunov",
      "Maximilien Péters de Bonhome",
      "Paul Els",
      "Konstantinos-Xanthos Argyropoulos",
      "Minh Nhat Ly",
      "Daniel Grošelj"
    ],
    "published": "2026-02-17T19:00:19Z",
    "updated": "2026-02-17T19:00:19Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.15777v1",
    "url": "https://arxiv.org/abs/2602.15777v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15777v1.pdf",
    "title": "New Challenges in Plasma Accelerators: Final Focusing for Wakefield Colliders",
    "abstract": "The focusing of particle beams for collider experiments is crucial for maximizing the luminosity and thus the discovery potential of these machines. In recent years, plasma wakefield acceleration has emerged as a leading candidate for achieving higher energy collisions with smaller facility footprints due to the large accelerating gradients in the plasma. This higher beam energy poses significant challenges for the final focusing system of the collider. Here, we discuss the various challenges of final focusing for TeV-scale plasma accelerators and propose possible solutions. Finally, we present the first design of a final focusing system for a 10 TeV linear wakefield collider, evaluate its performance, and discuss its shortcomings as well as improvements for future designs.",
    "authors": [
      "Keegan Downham",
      "Spencer Gessner",
      "Lewis Kennedy",
      "Rogelio Tomás",
      "Andrei Seryi"
    ],
    "published": "2026-02-17T18:06:54Z",
    "updated": "2026-02-17T18:06:54Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2212.00126v3",
    "url": "https://arxiv.org/abs/2212.00126v3",
    "pdf_url": "https://arxiv.org/pdf/2212.00126v3.pdf",
    "title": "Proton Computed Tomography Image Reconstruction Based on the Richardson-Lucy Algorithm",
    "abstract": "Proton therapy is an emerging method in cancer therapy. One of the main developments is to increase the accuracy of the Bragg-peak position calculation, which requires more precise relative stopping power (RSP) measurements. A promising choice is the application of proton computed tomography (pCT) systems which takes the images under similar conditions, as they use the same irradiation device and hadron beam for imaging and treatment. A key aim is to develop a precise image reconstruction algorithm for pCT systems to reach their maximal performance.   In this work, an iterative image reconstruction algorithm, based on the Richardson-Lucy iteration is proposed for the first time for proton CT image reconstruction. Monte Carlo (MC) simulations of CTP528 and CTP404 phantoms were used to benchmark the proposed method. In the case of an idealized detector setup, using a 1 mm pitch grid, 4.88 lp/cm spatial resolution and 0.66% average RSP uncertainty was achieved. The present method provides a promising proof-of-concept candidate for compromise between accuracy and speed with several further development directions.",
    "authors": [
      "Gábor Bíró",
      "Ákos Sudár",
      "Zsófia Jólesz",
      "Gábor Papp",
      "Gergely Gábor Barnaföldi"
    ],
    "published": "2022-11-30T21:28:10Z",
    "updated": "2026-02-17T17:08:34Z",
    "categories": [
      "physics.med-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.med-ph"
  },
  {
    "arxiv_id": "2512.08549v2",
    "url": "https://arxiv.org/abs/2512.08549v2",
    "pdf_url": "https://arxiv.org/pdf/2512.08549v2.pdf",
    "title": "A journey to ITACA: Ion Tracking with Ammonium Cations Apparatus",
    "abstract": "A unique feature of gas xenon electroluminescent time projection chambers (GXeEL TPCs) in $0νββ$ searches is their ability to reconstruct event topology, in particular to distinguish \"single-electron\" from \"double-electron\" tracks, the latter being the signature of a $0νββ$ decay near the decay endpoint $Q_{ββ}$. Together with excellent energy resolution and the t$_0$ provided by primary scintillation, this topological information is key to suppressing backgrounds. Preserving EL, however, requires operation in pure xenon (with helium as the only benign additive), where electron diffusion is large. Consequently, reconstructed track fidelity is limited by diffusion and intrinsic EL blurring. We propose augmenting the detector with the ability to image not only the electron track but also the corresponding mirror ion track. Introducing trace amounts of NH$_3$ ($\\sim$100 ppb) converts primary xenon ions into ammonium ions, NH$_4^+$, via a fast two-step ion-molecule process involving charge transfer followed by proton transfer, while leaving EL unaffected. Electrons drift rapidly to the anode, producing the standard EL image, whereas NH$_4^+$ ions drift slowly toward the cathode, allowing time to determine the event energy and barycenter. For events in the region of interest, an ion sensor near the cathode at the projected barycenter captures the ions. Laser interrogation of the sensor's molecular layer then reveals an ion-track image with sub-millimeter diffusion and no EL-induced smearing. Combined electron-ion imaging strengthens topological discrimination, improving background rejection by about an order of magnitude and significantly extending the discovery potential of GXeEL TPCs for very long $0νββ$ lifetimes.",
    "authors": [
      "J. J. Gómez-Cadenas",
      "L. Arazi",
      "M. Elorza",
      "Z. Freixa",
      "F. Monrabal",
      "A. Pazos",
      "J. Renner",
      "S. R. Soleti",
      "S. Torelli"
    ],
    "published": "2025-12-09T12:46:14Z",
    "updated": "2026-02-17T15:37:16Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.15652v1",
    "url": "https://arxiv.org/abs/2602.15652v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15652v1.pdf",
    "title": "The COHERENT Experiment: 2026 Update",
    "abstract": "The COHERENT experiment measures neutrino-induced recoils from coherent elastic neutrino-nucleus scattering (CEvNS) with multiple nuclear targets at the Spallation Neutron Source (SNS) at the Oak Ridge National Laboratory (ORNL), USA. Several successful CEvNS measurements have been achieved in recent years with tens-of-kg detector masses, with a CsI scintillating crystal, a liquid argon single-phase detector, and high-purity germanium spectrometers. For the next phase, COHERENT aims at high-statistics detection of CEvNS events for precision tests of the standard model of particle physics, and to probe new physics beyond-the-standard model. Percent-level precision can be achieved by lowering thresholds, reducing backgrounds, and by scaling up the detector masses. It goes hand in hand with benchmarking the neutrino flux from the SNS. Further detectors will measure CEvNS in additional nuclei, including lighter target nuclei such as sodium and neon, to continue to test the expected neutron-number-squared dependence of the cross section. COHERENT can furthermore study charged-current and neutral-current inelastic neutrino-nucleus cross sections on various nuclei at neutrino energies below $\\sim$50 MeV. Many of these cross sections have never been measured before, but are critical input for the interpretation of core-collapse supernova detection in large-scale neutrino experiments such as DUNE, Super-K, Hyper-K, and HALO.",
    "authors": [
      "M. Adhikari",
      "M. Ahn",
      "D. Amaya Matamoros",
      "P. S. Barbeau",
      "V. Belov",
      "I. Bernardi",
      "C. Bock",
      "A. Bolozdynya",
      "R. Bouabid",
      "J. Browning",
      "B. Cabrera-Palmer",
      "N. Cedarblade-Jones",
      "S. Chen",
      "A. I. Colón Rivera",
      "V. da Silva",
      "J. Daughhetee",
      "Y. Efremenko",
      "S. R. Elliott",
      "A. Erlandson",
      "L. Fabris",
      "M. L. Fischer",
      "S. Foster",
      "A. Galindo-Uribarri",
      "E. Granados Vazquez",
      "M. P. Green",
      "B. Hackett",
      "J. Hakenmüller",
      "M. Harada",
      "M. R. Heath",
      "S. Hedges",
      "Y. Hino",
      "H. Huang",
      "W. Huang",
      "H. Jeong",
      "B. A. Johnson",
      "T. Johnson",
      "A. Khromov",
      "D. Kim",
      "L. Kong",
      "A. Konovalov",
      "Y. Koshio",
      "E. Kozlova",
      "A. Kumpan",
      "O. Kyzylova",
      "Y. Lee",
      "S. M. Lee",
      "G. Li",
      "L. Li",
      "Z. Li",
      "J. M. Link",
      "J. Liu",
      "Q. Liu",
      "X. Lu",
      "M. Luxnat",
      "D. M. Markoff",
      "J. Mattingly",
      "H. McLaurin",
      "K. McMichael",
      "N. Meredith",
      "Y. Nakajima",
      "F. Nakanishi",
      "J. Newby",
      "B. Nolan",
      "J. O'Reilly",
      "A. Orvedahl",
      "D. S. Parno",
      "D. Pérez-Loureiro",
      "D. Pershey",
      "C. G. Prior",
      "J. Queen",
      "R. Rapp",
      "H. Ray",
      "O. Razuvaeva",
      "D. Reyna",
      "D. Rudik",
      "J. Runge",
      "D. J. Salvat",
      "J. Sander",
      "K. Scholberg",
      "H. Sekiya",
      "J. Seligman",
      "A. Shakirov",
      "G. Simakov",
      "J. Skweres",
      "W. M. Snow",
      "V. Sosnovtsev",
      "Q. Stefan",
      "M. Stringer",
      "C. Su",
      "T. Subedi",
      "B. Suh",
      "B. Sur",
      "R. Tayloe",
      "Y. -T. Tsai",
      "J. Vaccaro",
      "E. E. van Nieuwenhuizen",
      "C. J. Virtue",
      "G. Visser",
      "K. Walkup",
      "E. M. Ward",
      "R. Wendell",
      "T. Wongjirad",
      "C. Yang",
      "Y. Yang",
      "J. Yoo",
      "C. -H. Yu",
      "Y. Yu",
      "A. Zaalishvili",
      "J. Zettlemoyer",
      "Y. Zheng"
    ],
    "published": "2026-02-17T15:24:29Z",
    "updated": "2026-02-17T15:24:29Z",
    "categories": [
      "hep-ex",
      "hep-ph",
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2404.09793v2",
    "url": "https://arxiv.org/abs/2404.09793v2",
    "pdf_url": "https://arxiv.org/pdf/2404.09793v2.pdf",
    "title": "First search for light fermionic dark matter absorption on electrons using germanium detector in CDEX-10 experiment",
    "abstract": "We present the first results of the search for sub-MeV fermionic dark matter absorbed by electron targets of germanium using the 205.4~kg$\\cdot$day data collected by the CDEX-10 experiment, with the analysis threshold of 160~eVee. No significant dark matter (DM) signals over the background are observed. Results are presented as limits on the cross section of DM--electron interaction. We present new constraints of cross section in the DM range of 0.1--10 keV/$c^2$ for vector and axial-vector interaction. The upper limit on the cross section is set to be $\\rm 6.8\\times10^{-46}~cm^2$ for vector interaction, and $\\rm 2.3\\times10^{-46}~cm^2$ for axial-vector interaction at DM mass of 5 keV/$c^2$.",
    "authors": [
      "J. X. Liu",
      "L. T. Yang",
      "Q. Yue",
      "K. J. Kang",
      "Y. J. Li",
      "H. P. An",
      "Greeshma C.",
      "J. P. Chang",
      "Y. H. Chen",
      "J. P. Cheng",
      "W. H. Dai",
      "Z. Deng",
      "C. H. Fang",
      "X. P. Geng",
      "H. Gong",
      "Q. J. Guo",
      "T. Guo",
      "X. Y. Guo",
      "L. He",
      "J. R. He",
      "J. W. Hu",
      "H. X. Huang",
      "T. C. Huang",
      "L. Jiang",
      "S. Karmakar",
      "H. B. Li",
      "H. Y. Li",
      "J. M. Li",
      "J. Li",
      "M. C. Li",
      "Q. Y. Li",
      "R. M. J. Li",
      "X. Q. Li",
      "Y. L. Li",
      "Y. F. Liang",
      "B. Liao",
      "F. K. Lin",
      "S. T. Lin",
      "S. K. Liu",
      "Y. D. Liu",
      "Y. Liu",
      "Y. Y. Liu",
      "H. Ma",
      "Y. C. Mao",
      "Q. Y. Nie",
      "H. Pan",
      "N. C. Qi",
      "J. Ren",
      "X. C. Ruan",
      "M. B. Shen",
      "M. K. Singh",
      "T. X. Sun",
      "W. L. Sun",
      "C. J. Tang",
      "Y. Tian",
      "G. F. Wang",
      "J. Z. Wang",
      "L. Wang",
      "Q. Wang",
      "Y. F. Wang",
      "Y. X. Wang",
      "H. T. Wong",
      "Y. C. Wu",
      "H. Y. Xing",
      "K. Z. Xiong",
      "R. Xu",
      "Y. Xu",
      "T. Xue",
      "Y. L. Yan",
      "N. Yi",
      "C. X. Yu",
      "H. J. Yu",
      "M. Zeng",
      "Z. Zeng",
      "B. T. Zhang",
      "F. S. Zhang",
      "L. Zhang",
      "P. Zhang",
      "Z. H. Zhang",
      "Z. Y. Zhang",
      "J. Z. Zhao",
      "K. K. Zhao",
      "M. G. Zhao",
      "J. F. Zhou",
      "Z. Y. Zhou",
      "J. J. Zhu"
    ],
    "published": "2024-04-15T13:48:25Z",
    "updated": "2026-02-17T14:33:43Z",
    "categories": [
      "hep-ex",
      "hep-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1103/hq9t-z4xf"
  },
  {
    "arxiv_id": "2503.16215v2",
    "url": "https://arxiv.org/abs/2503.16215v2",
    "pdf_url": "https://arxiv.org/pdf/2503.16215v2.pdf",
    "title": "Quantum Metrology of Newton's Constant with Levitated Mechanical Systems",
    "abstract": "Newton's constant is the least well-measured among the fundamental constants of Nature, and, indeed, its accurate measurement has long served an experimental challenge. Levitated mechanical systems are attracting growing attention for their promising applications in sensing and as an experimental platform for exploring the intersection between quantum physics and gravitation. Here we propose a mechanical interferometric scheme of interacting levitated oscillators for the accurate estimation of Newton's constant. Our scheme promises to beat the current standard by several orders of magnitude.",
    "authors": [
      "Francis J. Headley",
      "Alessio Belenchia",
      "Mauro Paternostro",
      "Daniel Braun"
    ],
    "published": "2025-03-20T15:08:04Z",
    "updated": "2026-02-17T14:13:35Z",
    "categories": [
      "quant-ph",
      "physics.ins-det"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2502.04374v2",
    "url": "https://arxiv.org/abs/2502.04374v2",
    "pdf_url": "https://arxiv.org/pdf/2502.04374v2.pdf",
    "title": "The Numerics of VMEC++",
    "abstract": "VMEC++ is a Python-friendly, from-scratch reimplementation in C++ of the Variational Moments Equilibrium Code (VMEC), a fixed- and free-boundary ideal-MHD equilibrium solver for stellarators and tokamaks. The first VMEC implementation was written by Steven P. Hirshman and colleagues in the 1980s and 1990s and its latest Fortran incarnation (PARVMEC, https://github.com/ORNL-Fusion/PARVMEC) is widely used in stellarator optimization systems. Our work improves on previous implementations with regard to various critical aspects: special care has been put in providing an idiomatic Python experience, from installation to actual usage; VMEC++ has a zero-crash policy; it supports inputs in the classic INDATA format as well as friendlier JSON files. VMEC++ execution times are typically less than or equal to previous implementations, and time to convergence can be decreased dramatically by leveraging its hot-restart feature: by providing the output of a VMEC++ run as initial state for a subsequent one, VMEC++ is initialized using the previously converged equilibrium. This can dramatically decrease runtimes when running on many similar magnetic configurations as it typically happens in stellarator optimization pipelines. On the flip side, some features of the original Fortran VMEC implementation are not yet available in VMEC++, such as support for non-stellarator-symmetric configurations. This contribution presents the internal numerics of the open-source VMEC++ package publicly for the first time.",
    "authors": [
      "Jonathan Schilling"
    ],
    "published": "2025-02-05T14:02:06Z",
    "updated": "2026-02-17T11:25:46Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.IM"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.15500v1",
    "url": "https://arxiv.org/abs/2602.15500v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15500v1.pdf",
    "title": "From Coils to Surface Recession: Fully Coupled Simulation of Ablation in ICP Wind Tunnels",
    "abstract": "This work presents a fully coupled, multiphysics computational framework for predicting the thermo-chemical material response of thermal protection systems in inductively coupled plasma (ICP) wind tunnels. The framework integrates a high-fidelity Navier-Stokes plasma solver, an electromagnetic field solver, and a discontinuous-Galerkin material response solver using a partitioned coupling strategy. This enables an ab initio, end-to-end simulation of the 350 kW Plasmatron X facility at the University of Illinois Urbana-Champaign (UIUC), including plasma generation, electromagnetic heating, near-wall thermochemistry, and time-accurate material ablation. The model captures key ICP physics such as vortex-mode recirculation, Joule-heating-driven plasma formation, and Lorentz-force-induced flow confinement, and accurately predicts the transition from subsonic to supersonic jet behavior at low pressures. Validation against cold-wall calorimetry and graphite ablation experiments shows that predicted stagnation-point heat fluxes fall well within experimental uncertainty, while fully coupled simulations accurately reproduce measured stagnation temperature histories and recession rates with errors below 12% and 10%, respectively. Remaining discrepancies during early transient heating are attributed to uncertainties in power-coupling efficiency, equilibrium ablation modeling, and material property datasets. Overall, the framework demonstrates strong predictive capability for ICP wind tunnel environments and provides a foundation for improved design, interpretation, and planning of hypersonic material testing campaigns.",
    "authors": [
      "Sanjeev Kumar",
      "Alessandro Munafo",
      "Blaine Vollmer",
      "Daniel J. Bodony",
      "Gregory S. Elliott",
      "Kelly A. Stephani",
      "Sean Kearney",
      "Marco Panesi"
    ],
    "published": "2026-02-17T11:13:00Z",
    "updated": "2026-02-17T11:13:00Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.09491v4",
    "url": "https://arxiv.org/abs/2510.09491v4",
    "pdf_url": "https://arxiv.org/pdf/2510.09491v4.pdf",
    "title": "Investigating Solid-Fluid Phase Coexistence in DC Plasma Bilayer Crystals: The Role of Particle Pairing and Mode Coupling",
    "abstract": "This article presents a detailed investigation of solid-fluid phase coexistence in a bilayer dusty plasma crystal subjected to varying confinement ring bias voltages in a DC glow discharge argon plasma. Melamine formaldehyde particles were employed to form a stable, hexagonally ordered bilayer crystal within a confinement ring electrically isolated from the grounded cathode. By systematically adjusting the confinement ring bias, a distinct phase coexistence emerged characterized by a fluid-like melted core surrounded by a solid crystalline periphery. Crucially, analysis of the phonon spectra revealed frequency shifts that deviate significantly from the predictions of classical monolayer Mode-Coupling Instability (MCI) theory. Stability analysis further demonstrated that dynamic interlayer particle pairing and the associated increase in non-reciprocal interaction strength are strongly correlated with the onset of structural destabilization. These findings highlight previously underappreciated mechanisms driving the melting transition in bilayer dusty plasmas, offering a more comprehensive understanding of phase behavior in complex plasma systems. The results underscore the importance of interlayer coupling and confinement effects in tuning structural transitions.",
    "authors": [
      "Siddhartha Mangamuri",
      "Lénaïc Couëdel",
      "Surabhi Jaiswal"
    ],
    "published": "2025-10-10T15:52:47Z",
    "updated": "2026-02-17T10:06:26Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1103/nxt3-qwj6"
  },
  {
    "arxiv_id": "2602.15450v1",
    "url": "https://arxiv.org/abs/2602.15450v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15450v1.pdf",
    "title": "Impact of front-end parameters of the ARCADIA MD3 on charged particle detection",
    "abstract": "The ARCADIA INFN R&D project developed a Fully Depleted Monolithic Active Pixel Sensor (FD-MAPS) using a customized LFoundry 110 nm CIS process. The first in-beam characterization of the ARCADIA Main Demonstrator 3 (MD3) sensor with 200 $μ$m active thickness has been performed at the Fermilab Test Beam Facility with a 120 GeV proton beam. The Device Under Test (DUT) is tested with a trigger-less telescope composed of two ARCADIA MD3 tracking planes. This early study investigates the effect of the front-end parameters on the tracking performance.",
    "authors": [
      "C. Pantouvakis",
      "S. Garbolino",
      "M. Rignanese",
      "P. Affleck",
      "A. Apresyan",
      "P. Azzi",
      "N. Bacchetta",
      "C. Bonini",
      "D. Chiappara",
      "S. Ciarlantini",
      "D. Falchieri",
      "A. Hayrapetyan",
      "S. Mattiazzo",
      "L. Pancheri",
      "D. Pantano",
      "A. Rivetti",
      "M. Rolo",
      "R. Santoro",
      "R. Turrisi",
      "J. Wyss",
      "S. Xie",
      "A. Zingaretti",
      "I. Zoi",
      "P. Giubilato"
    ],
    "published": "2026-02-17T09:33:25Z",
    "updated": "2026-02-17T09:33:25Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.05864v2",
    "url": "https://arxiv.org/abs/2511.05864v2",
    "pdf_url": "https://arxiv.org/pdf/2511.05864v2.pdf",
    "title": "Compressive multi-beam scanning transmission electron microscopy",
    "abstract": "We demonstrate a multi-beam scanning transmission electron microscopy (STEM) imaging that integrates down-sampling with super-resolution image reconstruction via a compressive sensing framework. A custom condenser aperture with six randomly positioned circular holes is employed to produce a multi-beam STEM probe, with the beam shape and distribution tuned through defocus. While the raw multi-beam images exhibit overlapping patterns, reconstruction using Adam optimization and total variation normalization yields high-fidelity images that closely reproduce the original sample structures, even from substantially down-sampled data. The proposed approach offers a pathway toward significant acceleration of such techniques through multibeam sparse sampling and computational reconstruction potentially useful for the analytical scanning methods in general.",
    "authors": [
      "Akira Yasuhara",
      "Takumi Sannomiya",
      "Ryoichi Horisaki"
    ],
    "published": "2025-11-08T05:37:33Z",
    "updated": "2026-02-17T09:09:58Z",
    "categories": [
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.15440v1",
    "url": "https://arxiv.org/abs/2602.15440v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15440v1.pdf",
    "title": "The First Instrumentally Documented Fall of an Iron Meteorite: atmospheric trajectory and ground impact",
    "abstract": "Iron meteorite falls are rare compared to stony meteorites, and until recently no iron meteorite had a reliably determined pre-atmospheric orbit. This changed on 2020 November 7, when a bright fireball was observed across Sweden and neighboring regions, with optical, acoustic, and seismic detections extending up to 665 km from the trajectory. After a month-long recovery effort, a 13.8 kg iron meteorite was discovered near Ådalen, representing the first instrumentally recorded and recovered fall of its type and the first iron meteorite with a derivable heliocentric orbit; the event also exhibited the lowest terminal height measured for a well-documented fireball. We combine optical, infrasound, and seismic data to reconstruct the luminous trajectory and employ a Monte Carlo model to simulate the dark flight phase and predicted strewn field, while also investigating the plausibility of a ricochet prior to final deposition. Our analysis identifies distinct aerodynamic properties of iron meteoroids compared to stony bodies, including the influence of streamlined shapes and deep regmaglypts on drag and flight stability, underscoring the need to incorporate iron-specific parameters into entry models to constrain atmospheric dynamics and improve recovery predictions for future events.",
    "authors": [
      "Jarmo Moilanen",
      "Maria Gritsevich",
      "Jaakko Visuri"
    ],
    "published": "2026-02-17T09:03:37Z",
    "updated": "2026-02-17T09:03:37Z",
    "categories": [
      "astro-ph.EP",
      "astro-ph.IM",
      "physics.geo-ph",
      "physics.ins-det",
      "physics.pop-ph"
    ],
    "primary_category": "astro-ph.EP"
  },
  {
    "arxiv_id": "2602.15431v1",
    "url": "https://arxiv.org/abs/2602.15431v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15431v1.pdf",
    "title": "Flux pumping and bifurcated relaxations of helical core in 3D magnetohydrodynamic modelling of ASDEX Upgrade plasmas",
    "abstract": "Flux pumping was achieved in recent hybrid scenario experiments in the ASDEX Upgrade (AUG) tokamak, which is characterized by a sawtooth-free helical quiescent state and the anomalous radial redistribution of toroidal current density and poloidal magnetic flux. In this article, the self-regulation mechanism of the AUG core plasma during flux pumping is investigated at realistic parameters using the JOREK code based on the two-temperature, nonlinear, full magnetohydrodynamic (MHD) model. A key milestone in AUG flux pumping modelling is achieved by quantitatively reproducing the clamped current density and safety factor profiles in the plasma core, demonstrating the effectiveness of the dynamo effect in sustaining the flux pumping state. The dynamo term, that is of particular interest, is primarily generated by the pressure-gradient driven m/n = 1/1 quasi-interchange-like MHD instability. The work systematically extrapolates the parameter regimes of flux pumping from the above AUG base case by scanning dissipation coefficients and plasma beta. The simulation results reveal bifurcated plasma behaviours at different Hartmann numbers, including distinct states such as flux pumping (helical core with a flat current density), sawteeth (periodic kink-cycling), single crash (without subsequent cycle), and quasi-stationary magnetic island (peaked current density). Transitions from marginal flux pumping state to sawteeth are observed in long-term simulations. The relationships between system dissipation, plasma beta, and different plasma states are carefully analyzed. For practical purposes, the potential operational window for flux pumping, as determined by plasma density and temperature, is estimated. The modelling efforts advance the understanding of flux pumping and facilitate the development of a fast surrogate model for efficient evaluation of flux pumping.",
    "authors": [
      "H. Zhang",
      "M. Hoelzl",
      "I. Krebs",
      "A. Burckhart",
      "A. Bock",
      "S. Guenter",
      "V. Igochine",
      "K. Lackner",
      "D. Bonfiglio",
      "E. Fable",
      "F. Stefanelli",
      "R. Ramasamy",
      "H. Zohm",
      "JOREK TEAM",
      "ASDEX UPGRADE TEAM"
    ],
    "published": "2026-02-17T08:52:36Z",
    "updated": "2026-02-17T08:52:36Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.15310v1",
    "url": "https://arxiv.org/abs/2602.15310v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15310v1.pdf",
    "title": "Compton imaging of undepleted volumes of germanium detectors",
    "abstract": "The shape of the undepleted volume of a p-type high-purity Broad Energy Germanium detector, dependent on the bias voltage, has been imaged by measuring spatially-resolved Compton-scattering efficiency. The bias voltage was raised stepwise from $-50\\,\\text{V}$ to the full-depletion voltage. The geometric acceptance was determined at full depletion. Below full depletion, the relative acceptance observed for $2\\times2\\times2\\,\\text{mm}^3$ voxels was used to create the image of the undepleted volume for each bias voltage. The images were used to extract the impurity density profile of the detector by fitting predictions of the open-source software package SolidStateDetectors$.$jl to the images. The result is shown and compared to the impurity density profile deduced from capacitance measurements. This is the first time that three-dimensional images of the undepleted volumes of a germanium detector have become available and have been used to deduce an impurity density profile.",
    "authors": [
      "Iris Abt",
      "Arthur Butorev",
      "Felix Hagemann",
      "David Hervas Aguilar",
      "Johanna Lührs",
      "Julia Penner",
      "Oliver Schulz"
    ],
    "published": "2026-02-17T02:33:33Z",
    "updated": "2026-02-17T02:33:33Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.15296v1",
    "url": "https://arxiv.org/abs/2602.15296v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15296v1.pdf",
    "title": "GPS constellation search for exotic physics messengers coincident with the binary neutron star merger GW170817",
    "abstract": "The Global Positioning System (GPS) includes a continuously operating, planet-scale network of atomic clocks that, beyond navigation and time dissemination, enables precision tests of fundamental physics. Here we use GPS carrier phase archival data to perform a retrospective search for exotic low-mass fields (ELFs) that might be emitted by the binary neutron-star merger GW170817, complementing gravitational wave and electromagnetic modalitiesnin multi-messenger astronomy. Such ultra-relativistic fields would imprint a dispersive, anti-chirp signature in clock-frequency time series, delayed with respect to the LIGO-Virgo gravitational wave detection. We construct network-median pseudo-frequency data from eighteen Rb satellite clocks referenced to a terrestrial hydrogen maser and conduct a template-bank search spanning ELF pulse duration, arrival delay, and characteristic frequency. No statistically significant signal is observed after accounting for noise statistics and template-bank trials. We derive 95\\% confidence-level lower bounds on the interaction energy scale $Λ_α$ of quadratic couplings driving variations in electromagnetic fine-structure constant. These limits improve upon existing astrophysical and gravity-test constraints across the ELF-energy range $\\approx10^{-18}$--$10^{-14}\\,\\mathrm{eV}$. This demonstrates that mature global satellite-clock networks provide an observational capability for retrospective, multi-messenger searches for new physics using decades of archival timing data.",
    "authors": [
      "Arko P. Sen",
      "Geoffrey Blewitt",
      "Andrey Sarantsev",
      "Paul Ries",
      "Andrei Derevianko"
    ],
    "published": "2026-02-17T01:40:17Z",
    "updated": "2026-02-17T01:40:17Z",
    "categories": [
      "astro-ph.IM",
      "astro-ph.HE",
      "physics.atom-ph",
      "physics.data-an",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2509.18532v3",
    "url": "https://arxiv.org/abs/2509.18532v3",
    "pdf_url": "https://arxiv.org/pdf/2509.18532v3.pdf",
    "title": "A Doppler backscattering diagnostic for the EXL-50U spherical tokamak: plasma considerations and preliminary quasioptical design",
    "abstract": "The EXL-50U spherical tokamak was built by Energy iNNovation to develop technologies for proton-boron fusion in spherical tokamaks (Liu et al., Phys. Plasmas 2024). We present a conceptual design of the Doppler backscattering (DBS) diagnostic for the EXL-50U spherical tokamak. DBS is a diagnostic capable of measuring plasma turbulence, which is especially important for transport in tokamaks. Starting from a set of physical design constraints, such as port window availability and in-vessel space, we used SCOTTY (Hall-Chen et al., PPCF 2022), an in-house beam tracing code, to predict the location of the cutoffs and the corresponding scattering wavenumbers for several EXL-50U plasma scenarios. We find that we are able to measure scattering locations of 0.15 $<$ $ρ$ $<$ 1, with corresponding turbulent wavenumbers of 2.47 cm$^{-1}$$<$ $k_{\\perp}$ $<$ 9.49 cm$^{-1}$. Here, $ρ$ is the normalised radial coordinate of the scattering location, and $k_{\\perp}$ is the corresponding turbulent wavenumber. We then determine the optimal toroidal launch angles to ensure that the probe beam's wavevector is perpendicular to the magnetic field at the cutoff location, thereby maximising the backscattered signal. This matching is crucial due to the EXL-50U's high magnetic pitch angle, $\\sim35^{\\circ}$ at the outboard midplane. Given our results, we propose the use of toroidal steering and tunable frequency channels to ensure beams are well-matched with the magnetic pitch angle. We propose a quasioptical system that covers the U-band range (40--60 GHz).",
    "authors": [
      "Ying Hao Matthew Liang",
      "Valerian Hongjie Hall-Chen",
      "Terry L. Rhodes",
      "Yumin Wang",
      "Yihang Zhao"
    ],
    "published": "2025-09-23T01:54:04Z",
    "updated": "2026-02-17T00:50:37Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.25423v2",
    "url": "https://arxiv.org/abs/2509.25423v2",
    "pdf_url": "https://arxiv.org/pdf/2509.25423v2.pdf",
    "title": "Electropolishing-Induced Topographic Defects in Niobium: Insights and Implications for Superconducting Radio Frequency Applications",
    "abstract": "Electropolishing is the premier surface preparation method for high-Q, high-gradient superconducting RF cavities made of Nb. This leaves behind an apparently smooth surface, yet the achievable peak magnetic fields fall well below the superheating field of Nb, in most cases. In this work, the ultimate surface finish of electropolishing was investigated by studying its effect on highly polished Nb samples. Electropolishing introduces high slope angle sloped-steps at grain boundaries. The magnetic field enhancement and superheating field suppression factors associated with such a geometry are calculated in the London theory. Despite the by-eye smoothness of electropolished Nb, such defects compromise the stability of the low-loss Meissner state, likely limiting the achievable peak accelerating fields in superconducting RF cavities. Finally, the impact of surface roughness on impurity diffusion is investigated which can link surface roughness to the effectiveness of heat treatments like low-temperature baking or nitrogen infusion in the vortex nucleation or hydride hypotheses. Surface roughness tends to decrease the effective dose of impurities as a result of the expansion of impurities into regions with greater internal angle. The effective dose of impurities can be protected by minimizing slope angles and step heights, ensuring uniformity.",
    "authors": [
      "Oleksandr Hryhorenko",
      "Anne-Marie Valente-Feliciano",
      "Eric M. Lechner"
    ],
    "published": "2025-09-29T19:31:12Z",
    "updated": "2026-02-16T22:54:04Z",
    "categories": [
      "cond-mat.supr-con",
      "cond-mat.mtrl-sci",
      "physics.acc-ph",
      "physics.app-ph"
    ],
    "primary_category": "cond-mat.supr-con",
    "doi": "10.1088/1361-6668/ae40a3"
  }
]