{
  "arxiv_id": "2509.09126v1",
  "url": "https://arxiv.org/abs/2509.09126v1",
  "pdf_url": "https://arxiv.org/pdf/2509.09126v1.pdf",
  "title": "Exploration on the Two-stream Instability in the Polar Cusp Under Solar   Storm Disturbances and its Potential Impacts on Spacecraft",
  "abstract": "During solar storms, the polar cusp often exhibits electron populations with distinct velocity distributions, which may be associated with the two-stream instability. This study reveals the evolution of the two-stream instability associated with electron velocities and the interaction between the growth phase of the two-stream instability and the electrostatic solitary waves (ESWs). The results from particle-in-cell (PIC) simulations are compared with satellite observational data and computational outcomes. The potential risks associated with two-stream instability, including surface charge accumulation and communication system interference on spacecraft, are also explored. The findings show that, in the high-latitude polar cusp region, the interaction between the solar wind plasma propagating along magnetic field lines and the upward-moving ionospheric plasma could drive two-stream instability, leading to the formation of electron hole structures in phase space and triggering a bipolar distribution of ESWs. When the spatial magnetic field and wave vector meet specific conditions, the enhanced electron cyclotron motion could suppress the formation of two-stream instability and electron hole structures, leading to a reduction in the amplitude of the ESWs. The results offer valuable insights for a deeper understanding of the impact of solar storms on the polar cusp environment, as well as for monitoring electromagnetic environment and ensuring the stable operation of spacecraft.",
  "authors": [
    "Jikai Sun",
    "Lei Chang",
    "Yu Liu",
    "Guojun Wang",
    "Zichen Kan",
    "Shijie Zhang",
    "Jingjing Ma",
    "Dingzhou Li",
    "Yingxin Zhao"
  ],
  "published": "2025-09-11T03:42:32Z",
  "updated": "2025-09-11T03:42:32Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}