{
  "arxiv_id": "2505.18155v2",
  "url": "https://arxiv.org/abs/2505.18155v2",
  "pdf_url": "https://arxiv.org/pdf/2505.18155v2.pdf",
  "title": "Modelling Cosmic-Ray Transport: Magnetized versus Unmagnetized Motion in   Astrophysical Magnetic Turbulence",
  "abstract": "Cosmic-ray transport in turbulent astrophysical environments remains a multifaceted problem, and despite decades of study the impact of complex magnetic field geometry -- evident in simulations and observations -- has only recently received more focused attention. To understand how ensemble-averaged transport behaviour emerges from the intricate interactions between cosmic rays and structured magnetic turbulence, we run test-particle experiments in snapshots of a strongly turbulent magnetohydrodynamics simulation. We characterize particle-turbulence interactions via the gyro radii of particles and their experienced field-line curvatures, which reveals two distinct transport modes: magnetized motion, where particles are tightly bound to strong coherent flux tubes and undergo large-scale mirroring; and unmagnetized motion characterized by chaotic scattering through weak and highly tangled regions of the magnetic field. We formulate an effective stochastic process for each mode: compound subdiffusion with long mean free paths for magnetized motion, and a Langevin process with short mean free paths for unmagnetized motion. A combined stochastic walker that alternates between these two modes accurately reproduces the mean squared displacements observed in the test-particle data. Our results emphasize the critical role of coherent magnetic structures in comprehensively understanding cosmic-ray transport and lay a foundation for developing a theory of geometry-mediated transport.",
  "authors": [
    "Jeremiah Lübke",
    "Patrick Reichherzer",
    "Sophie Aerdker",
    "Frederic Effenberger",
    "Mike Wilbert",
    "Horst Fichtner",
    "Rainer Grauer"
  ],
  "published": "2025-05-23T17:59:52Z",
  "updated": "2025-09-15T17:03:07Z",
  "categories": [
    "physics.plasm-ph",
    "astro-ph.HE"
  ],
  "primary_category": "physics.plasm-ph"
}