{
  "arxiv_id": "2509.10434v1",
  "url": "https://arxiv.org/abs/2509.10434v1",
  "pdf_url": "https://arxiv.org/pdf/2509.10434v1.pdf",
  "title": "Viewing heat through ice: an infrared camera monitors hydrogel freezing   and thawing during cryoapplication",
  "abstract": "Cryosurgery employs a safe and relatively simple technique of exposure and is an advantageous and highly rated method. For its effective application, it is necessary to control both the volume of the expanding freezing zone and volumetric thermal field dynamics. The aim of this study was to perform a thermal imaging study of freezing and thawing in a model system (gel phantom) to predict the dynamics of the freezing zone during cryodestruction of biological tissues in vivo. Here, the thermal imager is an effective tool for demonstrating the surface temperature distribution. We have studied how the observed infrared image relates to the distribution and change of the thermal field in depth. For this purpose, we created test measuring equipment for simultaneous analysis of the dynamics of thermal fields on the surface, video recording of freezing and thawing on the surface as well as in the depth of the gel phantom, measuring the temperature at any given point in the depth and modeling in the zone of low-temperature exposure of vessels with different blood flow parameters. It was revealed that with a modeled vessel in the low-temperature exposure zone, the surface thermal fields deformed and they gained the shape of butterfly wings. Our experimental study in a gel phantom is supported by numerical calculations, demonstrating how the freezing zone and thermal isotherms on the surface and in depth evolve under real conditions, thereby providing a basis for assessing the cryoeffect time and intensity in practice. Key words: cryoapplication; freezing; thawing; temperature field dynamics; infrared thermography; gel phantom; testing measuring equipment; vessel simulation.",
  "authors": [
    "Gennadiy O. Kovalov",
    "Mykola O. Chyzh",
    "Vyacheslav Yu. Globa",
    "Oleksandr F. Todrin",
    "Galyna V. Shustakova",
    "Eduard Yu. Gordiyenko",
    "Yuliya V. Fomenko",
    "Oleh V. Ivakhnenko",
    "Polina O. Kofman",
    "Sergey N. Shevchenko"
  ],
  "published": "2025-09-12T17:42:27Z",
  "updated": "2025-09-12T17:42:27Z",
  "categories": [
    "physics.med-ph",
    "physics.ins-det"
  ],
  "primary_category": "physics.med-ph"
}