{
  "arxiv_id": "2509.11416v1",
  "url": "https://arxiv.org/abs/2509.11416v1",
  "pdf_url": "https://arxiv.org/pdf/2509.11416v1.pdf",
  "title": "Role of magnetic shear distribution on the formation of eruptive flux   ropes",
  "abstract": "Erupting flux ropes play crucial role in powering a wide range of solar transients, including flares, jets, and coronal mass ejections. These events are driven by the release of stored magnetic energy, facilitated by the shear in the complex magnetic topologies. However, the mechanisms governing the formation and eruption of flux ropes, particularly the role of magnetic shear distribution in coronal arcades are not fully understood. We employ magnetohydrodynamic simulations incorporating nonadiabatic effects of optically thin radiative losses, magnetic field-aligned thermal conduction, and spatially varying (steady) background heating, to realistically model the coronal environment. A stratified solar atmosphere under gravity is initialized with a non-force-free field comprising sheared arcades. We study two different cases by varying the initial shear to analyze their resulting dynamics, and the possibility of flux rope formation and eruptions. Our results show that strong initial magnetic shear leads to spontaneous flux rope formation and eruption via magnetic reconnection, driven by Lorentz force. The shear distribution infers the non-potentiality distributed along arcades and demonstrates its relevance in identifying sites prone to eruptive activity. The evolution of mean shear and the relative strength between guide to reconnection fields during the pre- and post-eruption phases are explored, with implications of bulk heating for the ``hot onset'' phenomena in flares, and particle acceleration. On the other hand, the weaker shear case does not lead to formation of any flux ropes. Our findings highlight the limitations of relying solely on foot point shear and underscore the need for coronal scale diagnostics. These results are relevant for understanding eruptive onset conditions and can promote a better interpretation of coronal observations from current and future missions.",
  "authors": [
    "Samrat Sen",
    "Sushree S Nayak",
    "Patrick Antolin"
  ],
  "published": "2025-09-14T20:08:33Z",
  "updated": "2025-09-14T20:08:33Z",
  "categories": [
    "astro-ph.SR",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.SR"
}