{
  "arxiv_id": "2511.04044v1",
  "url": "https://arxiv.org/abs/2511.04044v1",
  "pdf_url": "https://arxiv.org/pdf/2511.04044v1.pdf",
  "title": "Electromagnetic turbulence in EAST plasmas with internal transport   barrier",
  "abstract": "In this study, global nonlinear electromagnetic gyrokinetic simulations are conducted to investigate turbulence in the Internal transport barrier (ITB) region of the EAST tokamak discharge with weakly reversed magnetic shear. Linear simulations reveal two dominant ion temperature gradient (ITG) modes: a higher frequency mode at the $q=1$ surface, which dominates in the electrostatic limit, and a lower frequency mode near the $q_{\\min}$ surface, which prevails under the experimental $\\beta$ (the ratio of plasma pressure to magnetic pressure). Finite $\\beta$ effects effectively suppress higher frequency ITG modes, and once $\\beta_i$ on axis exceeds 0.5\\%, this ITG mode is no longer dominant, and the ITG mode near $q_{\\min}$ surface becomes the primary instability. Therefore, electromagnetic effects play a crucial role in stabilizing ITG modes, and in causing the transition between the most unstable mode at different radial positions. The linear growth rate of the unstable mode in the electrostatic limit is approximately 1.25 times higher than that of the dominant mode in the electromagnetic case. However, in the electromagnetic nonlinear regime, the thermal ion heat conductivity is reduced by at least a factor of 4. This reduction primarily results from nonlinear electromagnetic effects enhancing the shearing effect of zonal flows, thereby further suppressing microturbulence. Finally, energetic particles exert a slight stabilizing effect on ITG turbulence due to dilution and finite $\\beta$ contributions. It is emphasized that the electromagnetic effect on ITG with weak magnetic shear should be included to accurately calculate the transport coefficients.",
  "authors": [
    "Yuehao Ma",
    "Pengfei Liu",
    "Jian Bao",
    "Zhihong Lin",
    "Huishan Cai"
  ],
  "published": "2025-11-06T04:28:08Z",
  "updated": "2025-11-06T04:28:08Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}