{
  "arxiv_id": "2601.06717v1",
  "url": "https://arxiv.org/abs/2601.06717v1",
  "pdf_url": "https://arxiv.org/pdf/2601.06717v1.pdf",
  "title": "Plasma Discharge Undulator: a novel concept for plasma-based radiation sources",
  "abstract": "Plasma discharge devices have recently emerged as compact and versatile tools for particle beam manipulation. Building upon the Active Plasma Lens (APL) and its curved extension, the Active Plasma Bending (ABP), this work introduces the concept of the Plasma Discharge Undulator (PDU). In a PDU, a high-current discharge within a capillary generates an azimuthal magnetic field providing strong linear focusing ($O(1)$ (kT/m)), while a controlled and periodical spatial modulation of the discharge axis acts as a geometric driving term. The resulting beam dynamics can be modeled as a forced harmonic oscillator, yielding a well-defined oscillation at wavelength $λ_{\\mathrm{PDU}}$, distinct from the natural betatron wavelength $λ_β$ related to APL focusing. Proper injection conditions result in the suppression of collective betatron oscillations, significantly reducing the intrinsic undulator strength spread typical of conventional plasma undulators, while allowing for matched beam transport thanks to APL strong focusing. Analytical models for particle trajectories and radiation emission are developed, and the one-dimensional requirements for free-electron laser (FEL) emission are evaluated, providing scaling relations and feasibility criteria for FEL operation in the proposed scheme. Theoretical estimates and multi-particle simulations indicate that the PDU can operate in the short-period regime ($λ_{\\mathrm{PDU}} = $ mm-cm) with tunable undulator strength $K_{\\mathrm{PDU}}$, supporting narrow-band radiation emission. The PDU thus provides a pathway toward miniaturized, tunable, fully-plasma-based light sources with enhanced control over focusing and spectral properties.",
  "authors": [
    "Andrea Frazzitta"
  ],
  "published": "2026-01-10T23:32:44Z",
  "updated": "2026-01-10T23:32:44Z",
  "categories": [
    "physics.acc-ph"
  ],
  "primary_category": "physics.acc-ph"
}