{
  "arxiv_id": "2601.07043v1",
  "url": "https://arxiv.org/abs/2601.07043v1",
  "pdf_url": "https://arxiv.org/pdf/2601.07043v1.pdf",
  "title": "PANDA-film: an automated system for electrodeposition of polymer thin films and their wetting analysis",
  "abstract": "Thin polymer films are widely used as functional and protective coatings. However, determining the composition and processing conditions that produce a desired function is a tedious process due to the large number of factors that must be considered and the manual nature of most synthesis and characterization methods. Self-driving labs (SDLs), or robotic systems that prepare and test materials samples, are designed to overcome this bottleneck by enabling the efficient exploration of complex parameter spaces. In this paper, we report the development and testing of the polymer analysis and discovery array (PANDA)-film, a modular SDL for electrochemically synthesizing polymer films and then determining their water contact angle as a measure of surface energy. The system is designed to be highly modular and based upon a lowcost gantry platform to facilitate adoption. In addition to validating fluid handling and electrochemical tasks, we introduce two novel modular capabilities that enable PANDA-film to run sustained campaigns to study the wetting properties of films: (1) an electromagnetic capping/decapping system to mitigate fluid evaporation, and (2) a top-down optical method to determine water contact angle based upon reflectance. These capabilities are validated by depositing and characterizing a poly(allyl methacrylate) (PAMA) film using electrodeposition of polymer networks (EPoN). Comprehensive details for replicating the hardware and software of PANDA-film are included.",
  "authors": [
    "Harley Quinn",
    "Gregory A. Robben",
    "Zhaoyi Zheng",
    "Jin Yan",
    "Yuanzhi Li",
    "Zhaoji Yang",
    "Maria Politi",
    "Nadya Peek",
    "Lilo Pozzo",
    "Jörg G. Werner",
    "Keith A. Brown"
  ],
  "published": "2026-01-11T19:38:17Z",
  "updated": "2026-01-11T19:38:17Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}