{
  "arxiv_id": "2601.04903v2",
  "url": "https://arxiv.org/abs/2601.04903v2",
  "pdf_url": "https://arxiv.org/pdf/2601.04903v2.pdf",
  "title": "Wakefield Acceleration in a Layered Plasma Waveguide",
  "abstract": "Plasma wakefield accelerators (PWFA) represent one of the promising new accelerator concepts that are now being developed intensively for future applications in high-energy physics and industry. Among the unresolved problems of practical implementation of PWFA there are maintaining the required quality (emittance, size, energy spread of bunches) and stable transportation of drive and accelerated (witness) bunches over long acceleration distances. For improving the bunch transport, we propose to fill the bunch transport channel with the background plasma, the density of which is lower than the main plasma density building up an accelerating wake wave. We call this waveguide structure a layered plasma waveguide (LPW). The wakefield excitation by a regular sequence of electron bunches in the LPW of cylindrical configuration has been explored both analytically and numerically. The layered plasma has been modeled as a combination of a tubular plasma and a plasma column of significantly different densities. The plasma column has a lower density. The dispersion dependencies of the TM-modes of the LPW was obtained and analyzed, and it was found that there was a single TM wave resonant with the electron bunch. Based on the obtained analytical expressions, the structures of the axial and radial wakefield amplitudes have been numerically investigated for the cases of a single drive bunch and a regular train of bunches. It is shown that for certain density ratios of the outer and inner plasmas, it is possible both to accelerate and focus simultaneously the drive and witness bunches. The 2.5D particle-in-cell code was used to simulate the witness acceleration of an electron bunch by a wakefield created by drive electron bunches in a two-layer plasma wakefield accelerator. The simulation showed good agreement with the results of analytical calculations.",
  "authors": [
    "G. V. Sotnikov",
    "K. V. Galaydych",
    "P. I. Markov"
  ],
  "published": "2026-01-08T12:58:42Z",
  "updated": "2026-01-12T11:12:12Z",
  "categories": [
    "physics.acc-ph"
  ],
  "primary_category": "physics.acc-ph"
}