{
  "arxiv_id": "2601.00586v2",
  "url": "https://arxiv.org/abs/2601.00586v2",
  "pdf_url": "https://arxiv.org/pdf/2601.00586v2.pdf",
  "title": "Elaboration on the kinetic approach of Derbenev and Kondratenko to spin-polarized beams in electron storage rings",
  "abstract": "We present a detailed account of the kinetic approach for describing the effect of synchrotron radiation on electron and positron spin polarization in storage rings. This approach was introduced in 1974 by Derbenev and Kondratenko and was extended by us since 2001. The kinetic approach is much less frequently utilized but it is more general than the original non-kinetic approach of Derbenev and Kondratenko from 1972 since the kinetic approach is not centered on the invariant spin field. As with the non-kinetic approach the kinetic approach covers the radiative depolarization effect, the Sokolov-Ternov effect and its Baier-Katkov correction as well as the kinetic polarization effect but it enables the calculation of corrections to the original Derbenev-Kondratenko formulas and thereby provides estimates of the reliability of the latter. The kinetic appoach is applicable to storage rings with energies from a few GeV up to the energies of the FCC-ee and CEPC and beyond. The kinetic approach is based on the spin-orbit Wigner functions which lead to the so-called Bloch equation for the polarization density which is a generalization of Fokker-Planck equations to spin motion. In turn, as discovered in 2019, the Bloch equation is based on stochastic ordinary differential equations which can be used to develop Monte-Carlo spin-tracking codes covering the key effects beyond just radiative depolarization. These stochastic ordinary differential equations lead to a new viewpoint of the physical effects, in particular the kinetic polarization effect.",
  "authors": [
    "Klaus Heinemann",
    "Dan T. Abell",
    "Jose Agudelo",
    "Desmond P. Barber",
    "Oleksii Beznosov",
    "Joseph P. Devlin",
    "James A. Ellison",
    "Eiad Hamwi",
    "Boaz Nash",
    "Mathias Vogt"
  ],
  "published": "2026-01-02T06:14:44Z",
  "updated": "2026-01-12T05:20:58Z",
  "categories": [
    "physics.acc-ph"
  ],
  "primary_category": "physics.acc-ph"
}