{
  "arxiv_id": "2601.07205v1",
  "url": "https://arxiv.org/abs/2601.07205v1",
  "pdf_url": "https://arxiv.org/pdf/2601.07205v1.pdf",
  "title": "Effect of LH and ECR waves on plasma parameters in ADITYA Upgrade tokamak",
  "abstract": "The plasma discharges in ADITYA Upgrade Tokamak are produced by means of transformer action, in which Ohmically created plasma is driven by means of a secondary loop voltage. Due to reduction of plasma resistivity after a certain level of plasma temperature, Ohmic heating becomes poor and further achievement of temperature needs other heating techniques. ADITYA-U tokamak is facilitated with a 42 GHz-500 kW Electron Cyclotron Resonant Heating (ECRH) system. Also, there is a Lower Hybrid Current Drive (LHCD) system installed and operated at 3.7 GHz for driving non-inductive plasma current followed by the Ohmic current drive. Though an eventual impact in the rise of plasma temperature and plasma current due to the application of ECRH and LHCD respectively are very obvious, their energy coupling with the plasma results in several interesting outcomes in a number of experimentally measured plasma parameters. The present work addresses such impactful observations that are noticed and reported for the first time in ADITYA-U Tokamak.",
  "authors": [
    "S. Aich",
    "S. Dolui",
    "K. Singh",
    "J. Ghosh",
    "K. A. Jadeja",
    "R. L. Tanna",
    "K. M. Patel",
    "K. Galodiya",
    "A. Patel",
    "L. K. Pradhan",
    "B. K. Shukla",
    "H. Mistry",
    "J. Patel",
    "H. Patel",
    "D. Purohit",
    "K. G. Parmar",
    "P. K. Sharma",
    "J. Kumar",
    "B. Hegde",
    "Abhijeet Kumar",
    "Vismay Raulji",
    "Praveenlal E. V.",
    "T. M. Macwan",
    "R. Kumar",
    "A. Kumar",
    "A. Kumawat",
    "H. Raj",
    "I. Hauque",
    "Komal",
    "S. Banerjee",
    "P. Verma",
    "ADITYA-U team"
  ],
  "published": "2026-01-12T05:00:43Z",
  "updated": "2026-01-12T05:00:43Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}