{
  "arxiv_id": "2601.07167v1",
  "url": "https://arxiv.org/abs/2601.07167v1",
  "pdf_url": "https://arxiv.org/pdf/2601.07167v1.pdf",
  "title": "Discharge characteristics and parameter diagnosis of dielectric barrier discharge patterns in double-gap configuration",
  "abstract": "Pattern discharge is a common mode in dielectric barrier discharge (DBD) and has broad application prospects in various industrial fields, such as material surface treatment, environmental monitoring, and biomedical applications. In this work, a mixed gas of 75% argon and 25% air is used to generate a pattern discharge. A double-gap boundary composed of hexagonal configuration and square configuration is employed, and the gas pressure is fixed at 20 kPa. By varying the applied voltage amplitude, single-ring pattern, square-point-line pattern, square lattice pattern, and annular-lattice pattern are obtained for the first time. The discharge characteristics and their temporal correlation are studied using both optical method and electrical method. The results show that the discharge patterns exhibit multiple discharges in each half of the voltage cycle, and these discharges are temporally correlated with each other. Time-resolved discharge images of the square lattice pattern are captured using an enhanced charge-coupled device (ICCD). The experimental results reveal that multiple discharges in a half-voltage cycle correspond to the ignition process of the pattern in the radial direction from the outside to the inside. The morphology of the square lattice pattern observed by the naked eye is actually the result of the temporal superposition of luminescence from points at different positions in the evolution process.",
  "authors": [
    "Tian Shuang",
    "Zhang Han",
    "Zhang Xi",
    "Zhang Xuexue",
    "Li Qing",
    "Li Xuecehng",
    "Run Junxia"
  ],
  "published": "2026-01-12T03:26:58Z",
  "updated": "2026-01-12T03:26:58Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}