{
  "arxiv_id": "2511.02028v2",
  "url": "https://arxiv.org/abs/2511.02028v2",
  "pdf_url": "https://arxiv.org/pdf/2511.02028v2.pdf",
  "title": "Unified Model of Heated Plasma Expansion",
  "abstract": "Motivated by the need to predict plasma density and temperature distributions created in the early stages of high-intensity laser-plasma interactions, we develop a fluid model of plasma expansion into vacuum that incorporates external heating. We propose a new three-parameter family of self-similar solutions for plasma expansion that models a wide range of spatiotemporal variations of the electron temperature. Depending on the relative scales of the heated plasma domain $L$, the Debye length $λ_D$ and an emergent ion-acoustic correlation length $λ_s$, characterized by the parameters $\\frac{λ_s}{λ_D}$ and $\\frac{L}{λ_s}$, a spectrum of dynamical behaviors for the expanding plasma are identified. The behavior is classified into five dynamical regimes, ranging from nearly quasineutral expansion to the formation of bare ion slabs susceptible to Coulomb explosion. Self-similar solutions with spatially uniform electron temperature with exponential time dependence are analyzed, and the dynamics in the five asymptotic limits in the parameter space are detailed. Scaling relations for the length scales and energies of the expanding plasma are proposed. The self-similar framework is applied to laser-plasma interactions, specifically addressing the plasma dynamics at a target surface as the target interacts with the rising laser intensity envelope. The results offer insights into the expansion behavior based on the laser-plasma parameters, and scaling relations for optimizing laser-plasma schemes and guiding experimental designs in high-intensity laser experiments.",
  "authors": [
    "Ritwik Sain",
    "Lance Labun",
    "Ou Z. Labun",
    "Bjorn Manuel Hegelich"
  ],
  "published": "2025-11-03T20:03:48Z",
  "updated": "2026-02-09T01:42:35Z",
  "categories": [
    "physics.plasm-ph",
    "physics.acc-ph",
    "physics.flu-dyn"
  ],
  "primary_category": "physics.plasm-ph"
}