{
  "arxiv_id": "2602.09672v1",
  "url": "https://arxiv.org/abs/2602.09672v1",
  "pdf_url": "https://arxiv.org/pdf/2602.09672v1.pdf",
  "title": "X-ray reflection: a FLUKA model and its application in the design of synchrotron light beamlines and CERN's Future Circular Collider",
  "abstract": "Relying on atomic scattering factors from evaluated databases, a new model for the reflectivity of x rays on solid surfaces has been developed for FLUKA v4-6.0. This model accounts for the variation of reflectivity as a function of the photon energy, its incidence angle, and linear polarisation; surface roughness effects are also taken into account. FLUKA reflectivities agree well with those obtained from state-of-the-art codes used for the characterization of optical devices, both for homogeneous solids and for multilayer mirrors. This new capability renders FLUKA a nearly one-stop shop for synchrotron radiation simulations: emission from bending magnets and wigglers, photon transport and interaction, electromagnetic (and hadronic when applicable) shower development in complex geometries, as well as x-ray reflection at designated solid surfaces can now be all accounted for in a single FLUKA run. This streamlined FLUKA simulation workflow greatly simplifies the plethora of simulation tools that Monte Carlo practitioners previously needed to rely on. Two application scenarios of this new reflectivity model are showcased: first, the use of a multilayer mirror to deflect x rays from an optical hutch onto an experimental hall at the MINERVA beamline of the ALBA synchrotron and, second, the assessment of the photon flux near the interaction point at the CERN's Future Circular Collider (in its electron-positron stage) as a result of upstream x-ray reflections.",
  "authors": [
    "Giuseppe Mazzola",
    "Sunil Chitra",
    "Arnaud Devienne",
    "Alessandro Frasca",
    "María José García Fusté",
    "Dominique Heinis",
    "Anton Lechner",
    "Giuseppe Lerner",
    "Luca Rebuffi",
    "Manuel Sanchez del Rio",
    "David L. Windt",
    "Eugeni Graugés",
    "Francesc Salvat Pujol"
  ],
  "published": "2026-02-10T11:27:31Z",
  "updated": "2026-02-10T11:27:31Z",
  "categories": [
    "physics.acc-ph"
  ],
  "primary_category": "physics.acc-ph"
}