{
  "arxiv_id": "2508.03537v1",
  "url": "https://arxiv.org/abs/2508.03537v1",
  "pdf_url": "https://arxiv.org/pdf/2508.03537v1.pdf",
  "title": "The High Level Trigger and Express Data Production at STAR",
  "abstract": "The STAR experiment at the Relativistic Heavy Ion Collider (RHIC) has developed and deployed a high-performance High Level Trigger (HLT) and Express Data Production system to enable real-time event processing during the Beam Energy Scan phase-II (BES-II) program. Designed to meet the demands of high event rates and complex final states, the HLT performs online tracking, event reconstruction, and physics object selection using parallelized algorithms including the Cellular Automaton Track Finder and the KF Particle Finder, optimized for identifying both long- and short-lived particles.   Tightly integrated with the STAR data acquisition (DAQ) and detector control systems, the HLT employs a dedicated computing cluster to perform near real-time calibration, vertexing, and event filtering. The Express Data Production pipeline runs concurrently, enabling fast reconstruction and immediate physics analysis. This architecture allows for real-time monitoring of data quality, detector performance, and beam conditions, supporting dynamic feedback during operations.   This framework has been instrumental in enabling prompt identification of rare signals such as hyperons and hypernuclei. Notably, it enabled the first real-time reconstruction of ${}^5_{\\Lambda}\\mathrm{He}$ hypernuclei with high statistical significance, as well as efficient processing of hundreds of millions of heavy-ion collision events during BES-II.   The successful operation of this real-time system demonstrates its effectiveness in handling high data volumes while maintaining stringent physics quality standards. It establishes a scalable and modular model for future high-luminosity experiments requiring integrated online tracking, event selection, and rapid offline-quality reconstruction within hours of data taking.",
  "authors": [
    "Wayne Betts",
    "Jinhui Chen",
    "Yuri Fisyak",
    "Hongwei Ke",
    "Ivan Kisel",
    "Pavel Kisel",
    "Grigory Kozlov",
    "Jeffery Landgraf",
    "Jerome Lauret",
    "Tonko Ljubicic",
    "Yugang Ma",
    "Spyridon Margetis",
    "Hao Qiu",
    "Diyu Shen",
    "Qiye Shou",
    "Xiangming Sun",
    "Aihong Tang",
    "Gene Van Buren",
    "Iouri Vassiliev",
    "Baoshan Xi",
    "Zhenyu Ye",
    "Zhengqiao Zhang",
    "Maksym Zyzak"
  ],
  "published": "2025-08-05T15:05:34Z",
  "updated": "2025-08-05T15:05:34Z",
  "categories": [
    "physics.ins-det",
    "hep-ex",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det"
}