{
  "arxiv_id": "2508.04621v1",
  "url": "https://arxiv.org/abs/2508.04621v1",
  "pdf_url": "https://arxiv.org/pdf/2508.04621v1.pdf",
  "title": "Controlling the electric force on a dust particle during the afterglow   of a plasma at a higher gas pressure",
  "abstract": "When dust particles are immersed in a plasma, and the power that sustains a plasma is terminated, the charge of dust particles will change in the early afterglow, as electrons and ions gradually diminish in number. The possibility of controlling this charge, along with the electric force acting on the particles in the late afterglow, has earlier been demonstrated at a low gas pressure of 8 mTorr. Here, it is confirmed experimentally that controlling particles is possible also at a higher gas pressure of 90 mTorr, in a capacitively coupled radio-frequency plasma (CCP). A timed application of a DC electric field during the afterglow is a key element of this control scheme. Analyzing the experimental results, the electric force in the late afterglow was determined by comparing measurements of particle velocity to a prediction made by integrating the equation of motion, taking into account gas friction. In addition to applying friction to dust particles, gas also slows the drifting motion of electrons and ions, reducing their energy during the afterglow, but nevertheless we find that dust particles become charged in the afterglow so that one can apply an electric force to them that is comparable to the gravitational force, even at a higher pressure than had previously been demonstrated. This result extends the parameter range for which it is expected that particle contamination in semiconductor manufacturing can be mitigated by controlling charge and forces during the afterglow. Because of the way that forces scale with particle size, it is expected that submicron particles can be controlled even more easily than the larger spheres in the present experiment.",
  "authors": [
    "Neeraj Chaubey",
    "J. Goree"
  ],
  "published": "2025-08-06T16:48:33Z",
  "updated": "2025-08-06T16:48:33Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}