{
  "arxiv_id": "2507.15323v2",
  "url": "https://arxiv.org/abs/2507.15323v2",
  "pdf_url": "https://arxiv.org/pdf/2507.15323v2.pdf",
  "title": "Improving terahertz-detection sensitivity of 8x8 FET arrays through liquid-nitrogen cooling in a compact low-noise cryostat",
  "abstract": "We show that the sensitivity of antenna-coupled field-effect transistors (FETs) to terahertz (THz) radiation improves continuously with decreasing temperature. The noise-equivalent power (NEP) of 540 GHz patch-antenna-coupled FETs decreases as temperature reduces to 20 K. We project NEP values approaching 1 to 2 pW/sqrt(Hz) under efficient power coupling conditions (e.g., using a superstrate Si-lens), which is comparable to superconducting niobium transition-edge sensors (TESs) at 4 K. Building on these findings, a compact, low-noise, liquid-nitrogen-cooled (77 K) FET-based direct (incoherent) THz-power sensing system} for spectroscopy applications was realized. Here, an 8x8 pixel-binned detector array fabricated in a commercial 65-nm Si-CMOS process, was optimized for operation in the 2.85 to 3.4 THz band. Characterization was performed in the focal plane of a 2.85-THz quantum-cascade laser delivering approx. 2~mW of THz power. A linear dynamic range exceeding 67 dB was achieved without saturation (for 1~Hz-detection bandwidth). The system provides a -3 dB readout bandwidth of 5 MHz, exceeding that of conventional thermal detectors (typically 1 kHz). Combined with its broad temperature operability 20 K to 300 K and compact design, the system is particularly well suited for space- and payload-constrained platforms such as balloon- and satellite-based missions, where deep cryogenic cooling is impractical.",
  "authors": [
    "Jakob Holstein",
    "Nicholas K. North",
    "Arne Hof",
    "Sanchit Kondawar",
    "Dmytro B. But",
    "Mohammed Salih",
    "Lianhe Li",
    "Edmund H. Linfield",
    "A. Giles Davies",
    "Joshua R. Freeman",
    "Alexander Valavanis",
    "Alvydas Lisauskas",
    "Hartmut G. Roskos"
  ],
  "published": "2025-07-21T07:29:06Z",
  "updated": "2026-02-12T09:15:18Z",
  "categories": [
    "physics.app-ph",
    "physics.ins-det"
  ],
  "primary_category": "physics.app-ph"
}