{
  "arxiv_id": "2601.16928v2",
  "url": "https://arxiv.org/abs/2601.16928v2",
  "pdf_url": "https://arxiv.org/pdf/2601.16928v2.pdf",
  "title": "Neutron spectrum measurement in the Yemi underground laboratory",
  "abstract": "We report on the measurement of neutron energy spectra at the newly established Yemi Underground Laboratory (Yemilab) in the Republic of Korea, designed to host dark matter and rare-event search experiments. A high-sensitivity neutron spectrometer was employed, consisting of ten cylindrical {}^{3}He proportional counters, eight of which were embedded in cylindrical high-density polyethylene moderators of various sizes. To quantify and mitigate contributions from internal α-backgrounds, each detector underwent a dedicated background measurement using a cadmium-shielded box. These backgrounds, primarily originating from trace amounts of U and Th in the stainless-steel housings, were characterized and subtracted during data analysis. Neutron measurements were carried out at three locations within the Yemilab between March to October 2023. After waveform-based event selection and correction for \\alphasym-backgrounds, neutron count rates were estimated and corresponding energy spectra were reconstructed using the unfolding method. The total neutron fluence rates were measured ranged from (3.24 $\\pm$ 0.11) to (4.01 $\\pm$ 0.10) $\\times~10^{-5}~ {cm}^{-2}~{s}^{-1}$, with thermal and fast neutron components (1 - 10 MeV) ranging from (1.32 $\\pm$ 0.05) to (1.51 $\\pm$ 0.05) $\\times 10^{-5}~{cm}^{-2}~{s}^{-1}$ and (0.27 $\\pm$ 0.03) to (0.34 $\\pm$ 0.10) $\\times~10^{-5}~{cm}^{-2}~{s}^{-1}$, respectively.",
  "authors": [
    "Joong Hyun Kim",
    "Sinchul Kang",
    "HyeoungWoo Park",
    "Jungho Kim",
    "Hyeonseo Park",
    "Young Soo Yoon",
    "Hongjoo Kim",
    "Yeongduk Kim",
    "Jungho So",
    "SungHyun Kim"
  ],
  "published": "2026-01-23T17:40:36Z",
  "updated": "2026-02-10T16:15:14Z",
  "categories": [
    "physics.ins-det",
    "hep-ex",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.1016/j.astropartphys.2026.103215"
}