{
  "arxiv_id": "2602.10828v1",
  "url": "https://arxiv.org/abs/2602.10828v1",
  "pdf_url": "https://arxiv.org/pdf/2602.10828v1.pdf",
  "title": "A Helical-Deflector-Based Radio-Frequency Spiral Scanning System for keV Energy Electrons",
  "abstract": "We present the design, modeling, and experimental validation of a radio-frequency based time-to-position conversion system for keV electrons incorporating a helical deflector operating in the 400-1000 MHz range. The device performs circular deflection of the electrons when driven by a single RF frequency and enables spiral scanning when two phase-locked RF voltages with slightly different frequencies are applied. The superposition of the two phase-locked RF voltages produces an amplitude-beating field whose slowly varying envelope modulates the deflection radius, transforming the circular scan into a controlled spiral on the detector plane. A detailed theoretical model describing the electron dynamics under two phase-locked RF voltages with different frequencies was derived, yielding analytical expressions for the transverse velocity and radius-vector components at the deflector exit. Spiral scanning will allow measurements with picosecond resolution in a time range 1-2 orders of magnitude larger than the period of the circular scanning.",
  "authors": [
    "Vanik Kakoyan",
    "Simon Zhamkochyan",
    "Vardan Bardakhchyan",
    "Sergey Abrahamyan",
    "Amur Margaryan",
    "Aram Kakoyan",
    "Hasmik Rostomyan",
    "Anna Safaryan",
    "Gagik Sughyan",
    "Hayk Gevorgyan",
    "Artashes Papyan",
    "Martin Pinamyan",
    "Mikael Ivanyan",
    "Satoshi N. Nakamura",
    "John Annand",
    "Kenneth Livingston",
    "Rachel Montgomery",
    "Patrick Achenbach",
    "Josef Pochodzalla",
    "Dimiter L. Balabanski",
    "Ani Aprahamian",
    "Viatcheslav Sharyy",
    "Dominique Yvon",
    "Hayk Elbakyan"
  ],
  "published": "2026-02-11T13:15:07Z",
  "updated": "2026-02-11T13:15:07Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}