{
  "arxiv_id": "2602.09836v1",
  "url": "https://arxiv.org/abs/2602.09836v1",
  "pdf_url": "https://arxiv.org/pdf/2602.09836v1.pdf",
  "title": "Conceptual Design of a Novel Highly Granular Crystal Electromagnetic Calorimeter for Future Higgs Factories",
  "abstract": "Next-generation high-energy electron-positron colliders, operating as Higgs factories, require an unprecedented jet energy resolution for precision measurements of Higgs and Z/W bosons. To address this challenge, a conceptual design is presented for a novel high-granularity crystal electromagnetic calorimeter that combines the superior intrinsic energy resolution of a homogeneous calorimeter with the fine segmentation required for particle-flow reconstruction. The crystal electromagnetic calorimeter design is based on orthogonally arranged long scintillating crystal bars read out by silicon photomultipliers (SiPMs) at both ends. Key design specifications were established through comprehensive simulation studies. Critical technical considerations, including crystal choices, photosensors, electronics, mechanical support, and radiation damage, are discussed. A dedicated digitisation framework was developed to realistically model effects from the crystal, SiPMs, and readout electronics. The performance of a single calorimeter module was evaluated using simulated electron showers. Simulation results for a single module demonstrate an excellent electromagnetic energy resolution of $1.12\\%/\\sqrt{E(\\mathrm{GeV})}\\oplus0.24\\%$ and an energy linearity within $\\pm0.5\\%$ for electrons from 3 GeV to 100 GeV. The performance significantly exceeds the design requirement of $\\leq 3\\%/\\sqrt{E(\\mathrm{GeV})}\\oplus1\\%$. The results establish the feasibility of the proposed high-granularity crystal calorimeter concept and point to a promising pathway toward the precision calorimetry required for future high-energy electron-positron collider experiments.",
  "authors": [
    "Baohua Qi",
    "Fangyi Guo",
    "Yong Liu",
    "Manqi Ruan",
    "Weizheng Song",
    "Shengsen Sun",
    "Yifang Wang",
    "Yuexin Wang",
    "Haijun Yang",
    "Yang Zhang",
    "Zhiyu Zhao"
  ],
  "published": "2026-02-10T14:43:18Z",
  "updated": "2026-02-10T14:43:18Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}