{
  "arxiv_id": "2602.10642v1",
  "url": "https://arxiv.org/abs/2602.10642v1",
  "pdf_url": "https://arxiv.org/pdf/2602.10642v1.pdf",
  "title": "Fully nonlinear phenomenology of the bump-on-tail (BOT) instability with drag, diffusion and Krook relaxation",
  "abstract": "Energetic-particle-driven modes in magnetically confined fusion plasmas often exhibit nonlinear frequency sweeping, reflecting complex wave-particle interactions near marginal stability. While the bump-on-tail (BOT) instability within the Berk-Breizman framework has served as a canonical model for understanding such phenomena, a unified nonlinear description remains incomplete when drag, diffusion, and Krook relaxation act simultaneously. In this work, we present a comprehensive numerical investigation of the BOT instability that explicitly retains all three collision operators together with external wave damping. Using a validated characteristic-based BOT code, we systematically scan the multi-dimensional collision parameter space and construct nonlinear regime maps and bifurcation diagrams. To organize the rich dynamics, we introduce a two-level categorization that combines global wave-energy evolution with chirping subtypes identified from spectral morphology. We find that diffusion and Krook relaxation regularize the nonlinear dynamics and promote ordered transitions from chaotic behaviors to periodic oscillations and steady saturation as collision strength increases, with the saturation level decreasing approximately exponentially with external damping. In contrast, drag alone does not admit steady solutions and instead drives persistent or chaotic chirping through convective deformation of resonant phase-space structures. When drag is combined with diffusion or Krook relaxation, clear transition sequences emerge: increasing drag breaks hole-clump symmetry, broadens the effective resonance region, and drives systematic transitions from transient to intermittent and persistent chirping.",
  "authors": [
    "Shi-Jie Zhang",
    "Lei Chang",
    "Zhao-Ju Bo",
    "Zhi-Song Qu",
    "Ilya Zadiriev",
    "Elena Kralkina",
    "Shogo Isayama",
    "Sin-Jae You",
    "Zi-Chen Kan",
    "Ji-Kai Sun",
    "Jing-Jing Ma"
  ],
  "published": "2026-02-11T08:43:48Z",
  "updated": "2026-02-11T08:43:48Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}