{
  "arxiv_id": "2502.19061v2",
  "url": "https://arxiv.org/abs/2502.19061v2",
  "pdf_url": "https://arxiv.org/pdf/2502.19061v2.pdf",
  "title": "Conceptual study on using Doppler backscattering to measure magnetic pitch angle in tokamak plasmas",
  "abstract": "We introduce a new approach to measure the magnetic pitch angle profile in tokamak plasmas with Doppler backscattering (DBS), a technique traditionally used for measuring flows and density fluctuations. The DBS signal is maximised when its probe beam's wavevector is perpendicular to the magnetic field at the cutoff location, independent of the density fluctuations. Hence, if one could isolate this effect, DBS would then yield information about the magnetic pitch angle. By varying the toroidal launch angle, the DBS beam reaches cutoff with different angles with respect to the magnetic field, but with other properties remaining similar. Hence, the toroidal launch angle which gives maximum backscattered power is thus that which is matched to the pitch angle at the cutoff location, enabling inference of the magnetic pitch angle. We performed systematic scans of the DBS toroidal launch angle for repeated DIII-D tokamak discharges. Experimental DBS data from this scan were analysed and combined with Gaussian beam-tracing simulations using the Scotty code. The pitch-angle inferred from DBS is consistent with that from magnetics-only and motional-Stark-effect-constrained (MSE) equilibrium reconstruction in the edge. In the core, the pitch angles from DBS and magnetics-only reconstructions differ by one to two degrees, while simultaneous MSE measurements were not available. The uncertainty in these measurements was under a degree; we show that this uncertainty is primarily due to the error in toroidal steering, the number of toroidally separated measurements, and shot-to-shot repeatability. We find that the error of pitch-angle measurements can be reduced by optimising the poloidal launch angle and initial beam properties.",
  "authors": [
    "AK Yeoh",
    "VH Hall-Chen",
    "QT Pratt",
    "BS Victor",
    "J Damba",
    "TL Rhodes",
    "NA Crocker",
    "KR Fong",
    "JC Hillesheim",
    "FI Parra",
    "J Ruiz Ruiz"
  ],
  "published": "2025-02-26T11:38:54Z",
  "updated": "2025-12-18T08:11:00Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}