{
  "arxiv_id": "2512.16789v1",
  "url": "https://arxiv.org/abs/2512.16789v1",
  "pdf_url": "https://arxiv.org/pdf/2512.16789v1.pdf",
  "title": "Evaluation of a large-area double-sided silicon strip detector for quality assurance in ion-beam radiotherapy",
  "abstract": "Designed to provide quality assurance for ion-beam radiotherapy, the prototype fIVI (filtered Interaction Vertex Imaging) Range Monitoring System is a two-layer tracker which employs double-sided strip-segmented silicon detectors. To meet the high demands of a clinical environment, a large sensitive area is required, along with a fast and compact readout. As this device utilizes sensors and readout electronics adapted from particle physics, where the expected energy and count rate differ significantly from radiotherapy, validation was necessary to ensure that these sensors would function effectively at the order 100 MeV/u energies and order MHz count rates expected during clinical irradiation. Tests were conducted using scattered subclinical 19 MeV protons at high intensity, and clinical 207 MeV/u carbon ions at low intensity to independently validate these variables. The detection system is found to operate at rates up to 1.3 MHz, with a negligible fraction of events being affected by pileup. The efficiency of hit reconstruction is high, with a timestamp resolution of 6.25 ns, and a coincidence window of 31.25 ns, as is required for clinical event rates. With these settings, over 90% of particle interactions are able to reconstruct unique hit positions and contribute to track formation. This device is the first system using large-area, high-resolution detectors which meets the demanding count rate requirements associated with clinical radiotherapy.",
  "authors": [
    "Devin Hymers",
    "Sebastian Schroeder",
    "Olga Bertini",
    "Johann Heuser",
    "Joerg Lehnert",
    "Christian Joachim Schmidt",
    "Dennis Mücher"
  ],
  "published": "2025-12-18T17:24:53Z",
  "updated": "2025-12-18T17:24:53Z",
  "categories": [
    "physics.ins-det",
    "physics.med-ph"
  ],
  "primary_category": "physics.ins-det"
}