{
  "arxiv_id": "2512.15576v1",
  "url": "https://arxiv.org/abs/2512.15576v1",
  "pdf_url": "https://arxiv.org/pdf/2512.15576v1.pdf",
  "title": "Radial electric field and density fluctuations measured by Doppler reflectometry during the post-pellet enhanced confinement phase in W7-X",
  "abstract": "Radial profiles of density fluctuations and radial electric field, $E_r$, have been measured using Doppler reflectometry during the post-pellet enhanced confinement phase achieved, under different heating power levels and magnetic configurations, along the 2018 W7-X experimental campaign. A pronounced $E_r$-well is measured with local values as high as -40 kV/m in the radial range $ρ\\sim 0.7-0.8$ during the post-pellet enhanced confinement phase. The maximum $E_r$ intensity scales with both plasma density and Electron Cyclotron Heating (ECH) power level following a similar trend as the plasma energy content. A good agreement is found when the experimental $E_r$ profiles are compared to simulations carried out using the neoclassical codes DKES and KNOSOS. The density fluctuation level decreases from the plasma edge toward the plasma core and the drop is more pronounced in the post-pellet enhanced confinement phase than in reference gas fuelled plasmas. Besides, in the post-pellet phase, the density fluctuation level is lower in the high iota magnetic configuration than in the standard one. In order to discriminate whether this difference is related to the differences in the plasma profiles or in the stability properties of the two configurations, gyrokinetic simulations have been carried out using the codes \\texttt{stella} and EUTERPE. The simulation results point to the plasma profile evolution after the pellet injection and the stabilization effect of the radial electric field profile as the dominant players in the stabilization of the plasma turbulence.",
  "authors": [
    "T. Estrada",
    "D. Carralero",
    "T. Windisch",
    "E. Sánchez",
    "J. M. García-Regaña",
    "J. Martínez-Fernández",
    "A. de la Peña",
    "J. L. Velasco",
    "J. A. Alonso",
    "M. Beurskens",
    "S. Bozhenkov",
    "H. Damm",
    "G. Fuchert",
    "R. Kleiber",
    "N. Pablant",
    "E. Pasch"
  ],
  "published": "2025-12-17T16:34:07Z",
  "updated": "2025-12-17T16:34:07Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": "10.1088/1741-4326/abddee"
}