[
  {
    "arxiv_id": "2512.16867v1",
    "url": "https://arxiv.org/abs/2512.16867v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16867v1.pdf",
    "title": "Electric field diagnostics in a continuous rf plasma using Rydberg-EIT",
    "abstract": "We present a non-invasive spectroscopic technique to measure electric fields in plasma, leveraging large polarizabilities and Stark shifts of Rydberg atoms. Rydberg Stark shifts are measured with high precision using narrow-linewidth lasers via Electromagnetically Induced Transparency (EIT) of rubidium vapor seeded into a continuous, inductively coupled radio-frequency (rf) plasma in a few mTorr of argon gas. Without plasma, the Rydberg-EIT spectra exhibit rf modulation sidebands caused by electric- and magnetic-dipole transitions in the rf drive coil. With the plasma present, the rf modulation sidebands vanish due to screening of the rf drive field from the plasma interior. The lineshapes of the EIT spectra in the plasma reflect the plasma's Holtsmark microfield distribution, allowing us to determine plasma density and collisional line broadening over a range of pressures and rf drive powers. The work is expected to have applications in non-invasive spatio-temporal electric-field diagnostics of low-pressure plasma, plasma sheaths, process plasma and dusty plasma.",
    "authors": [
      "Bineet Dash",
      "Xinyan Xiang",
      "Dingkun Feng",
      "Eric Paradis",
      "Georg Raithel"
    ],
    "published": "2025-12-18T18:37:58Z",
    "updated": "2025-12-18T18:37:58Z",
    "categories": [
      "physics.atom-ph",
      "physics.plasm-ph",
      "quant-ph"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2512.16839v1",
    "url": "https://arxiv.org/abs/2512.16839v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16839v1.pdf",
    "title": "A MAPS Detector for High Resolution Low Dose EBSD",
    "abstract": "The use of highly sensitive pixelated direct detectors has dramatically improved the performance of high energy instrumentation such as transmission electron microscopy. Here, we describe a recently developed monolithic active pixel sensor designed for low energy scanning electron microscopy applications. This detector enables electron backscatter diffraction (EBSD) at lower energies and dose than are accessible with existing scintillator-coupled detectors, expanding grain orientation mapping capabilities to materials such as ceramics that are poor electron conductors. The high detector sensitivity allows collection of rich diffraction information - providing dislocation defect contrast that is otherwise not accessible via EBSD. Indeed, even the energy of single electron interaction events can be measured with this detector, which we demonstrate to energy filter diffraction patterns revealing details of how diffraction occurs at low energy.",
    "authors": [
      "Barnaby D. A. Levin",
      "Kalani Moore",
      "Nicolò M. Della Ventura",
      "McLean P. Echlin",
      "Tresa M. Pollock",
      "Daniel S. Gianola"
    ],
    "published": "2025-12-18T18:17:29Z",
    "updated": "2025-12-18T18:17:29Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mes-hall",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.16789v1",
    "url": "https://arxiv.org/abs/2512.16789v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16789v1.pdf",
    "title": "Evaluation of a large-area double-sided silicon strip detector for quality assurance in ion-beam radiotherapy",
    "abstract": "Designed to provide quality assurance for ion-beam radiotherapy, the prototype fIVI (filtered Interaction Vertex Imaging) Range Monitoring System is a two-layer tracker which employs double-sided strip-segmented silicon detectors. To meet the high demands of a clinical environment, a large sensitive area is required, along with a fast and compact readout. As this device utilizes sensors and readout electronics adapted from particle physics, where the expected energy and count rate differ significantly from radiotherapy, validation was necessary to ensure that these sensors would function effectively at the order 100 MeV/u energies and order MHz count rates expected during clinical irradiation. Tests were conducted using scattered subclinical 19 MeV protons at high intensity, and clinical 207 MeV/u carbon ions at low intensity to independently validate these variables. The detection system is found to operate at rates up to 1.3 MHz, with a negligible fraction of events being affected by pileup. The efficiency of hit reconstruction is high, with a timestamp resolution of 6.25 ns, and a coincidence window of 31.25 ns, as is required for clinical event rates. With these settings, over 90% of particle interactions are able to reconstruct unique hit positions and contribute to track formation. This device is the first system using large-area, high-resolution detectors which meets the demanding count rate requirements associated with clinical radiotherapy.",
    "authors": [
      "Devin Hymers",
      "Sebastian Schroeder",
      "Olga Bertini",
      "Johann Heuser",
      "Joerg Lehnert",
      "Christian Joachim Schmidt",
      "Dennis Mücher"
    ],
    "published": "2025-12-18T17:24:53Z",
    "updated": "2025-12-18T17:24:53Z",
    "categories": [
      "physics.ins-det",
      "physics.med-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.16769v1",
    "url": "https://arxiv.org/abs/2512.16769v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16769v1.pdf",
    "title": "Operation of silicon photomultipliers in a dilution refrigerator down to 9.4 mK towards a cryogenic cosmic ray muon veto system",
    "abstract": "We report the characterisation of a FBK NUV-HD-cryo silicon photomultiplier (SiPM) sensor operated in an 9.4 $\\pm$ 0.2 mK environment inside a dilution refrigerator, towards the development of a cryogenic cosmic ray muon veto system to be operated internal to a dilution refrigerator required for low background experiments such as the QUEST-DMC dark matter search experiment. We characterise the single photon response and the gain (the charge produced per detected photon), the dark count noise rate, and correlated noise contributions as a function of operating voltage. This paper also reports first proof of concept measurements of using a SiPM directly coupled to scintillator in a 9.4 mK temperature environment, towards detecting candidate cosmic ray muon signals.",
    "authors": [
      "QUEST-DMC Collaboration",
      ":",
      "A. Kemp",
      "S. Autti",
      "E. Bloomfield",
      "A. Casey",
      "N. Darvishi",
      "N. Eng",
      "P. Franchini",
      "R. P. Haley",
      "P. J. Heikkinen",
      "A. Jennings",
      "S. Koulosousas",
      "E. Leason",
      "L. V. Levitin",
      "J. March-Russell",
      "A. Mayer",
      "J. Monroe",
      "D. Münstermann",
      "M. T. Noble",
      "J. R. Prance",
      "X. Rojas",
      "T. Salmon",
      "J. Saunders",
      "J. Smirnov",
      "R. Smith",
      "M. D. Thompson",
      "A. Thomson",
      "A. Ting",
      "V. Tsepelin",
      "S. M. West",
      "L. Whitehead",
      "D. E. Zmeev"
    ],
    "published": "2025-12-18T17:02:51Z",
    "updated": "2025-12-18T17:02:51Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.14649v4",
    "url": "https://arxiv.org/abs/2509.14649v4",
    "pdf_url": "https://arxiv.org/pdf/2509.14649v4.pdf",
    "title": "Intensified optical camera with Timepix4 readout",
    "abstract": "We report the first characterization results of an optical time-stamping camera based on the Timepix4 chip coupled to a fully depleted optical silicon sensor and fast image intensifier, enabling sub-nanosecond scale, time-resolved imaging for single photons. The system achieves an RMS time resolution of 0.3 ns in direct detection mode without the intensifier and from 0.6 to 1.5 ns in the single-photon regime with an intensifier for different amplitude-based signal selections. This shows that Timepix4 provides a significant improvement over previous Timepix3-based cameras in terms of timing precision, and also in pixel count and data throughput. We analyze key factors that affect performance, including sensor bias and timewalk effect, and demonstrate effective correction methods to recover high temporal accuracy. The camera's temporal resolution, event-driven readout and high rate capability make it a scalable platform for a wide range of applications, including quantum optics, ultrafast imaging, and time-correlated photon counting experiments.",
    "authors": [
      "Erik Hogenbirk",
      "Andrei Nomerotski",
      "Bram Bouwens",
      "Gabriel Diaz",
      "Shazia Farooq",
      "Sergei Kulkov",
      "Erik Maddox",
      "Ondrej Matousek",
      "Peter Svihra",
      "Henrique Zanoli"
    ],
    "published": "2025-09-18T06:09:03Z",
    "updated": "2025-12-18T16:48:13Z",
    "categories": [
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.05067v2",
    "url": "https://arxiv.org/abs/2507.05067v2",
    "pdf_url": "https://arxiv.org/pdf/2507.05067v2.pdf",
    "title": "Quantifying Resolution Limits in Pedestal Profile Measurements with Gaussian Process Regression",
    "abstract": "Edge transport barriers (ETBs) in magnetically confined fusion plasmas, commonly known as pedestals, play a crucial role in achieving high confinement plasmas. However, their defining characteristic, a steep rise in plasma pressure over short length scales, makes them challenging to diagnose experimentally. In this work, we use Gaussian Process Regression (GPR) to develop first-principles metrics for quantifying the spatiotemporal resolution limits of inferring differentiable profiles of temperature, pressure, or other quantities from experimental measurements. Although we focus on pedestals, the methods are fully general and can be applied to any setting involving the inference of profiles from discrete measurements. First, we establish a correspondence between GPR and low-pass filtering, giving an explicit expression for the effective `cutoff frequency' associated with smoothing incurred by GPR. Second, we introduce a novel information-theoretic metric, \\(N_{eff}\\), which measures the effective number of data points contributing to the inferred value of a profile or its derivative. These metrics enable a quantitative assessment of the trade-off between `over-fitting' and `over-regularization', providing both practitioners and consumers of GPR with a systematic way to evaluate the credibility of inferred profiles. We apply these tools to develop practical advice for using GPR in both time-independent and time-dependent settings, and demonstrate their usage on inferring pedestal profiles using measurements from the DIII-D tokamak.",
    "authors": [
      "Norman M. Cao",
      "David R. Hatch",
      "Craig Michoski",
      "Todd A. Oliver",
      "David Eldon",
      "Andrew Oakleigh Nelson",
      "Matthew Waller"
    ],
    "published": "2025-07-07T14:49:56Z",
    "updated": "2025-12-18T16:16:22Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1088/1741-4326/ae2d6f"
  },
  {
    "arxiv_id": "2512.16689v1",
    "url": "https://arxiv.org/abs/2512.16689v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16689v1.pdf",
    "title": "CARONTE: a Physics-Informed Extreme Learning Machine-Based Algorithm for Plasma Boundary Reconstruction in Magnetically Confined Fusion Devices",
    "abstract": "In this work, we propose a novel physics informed neural network based algorithm for real time plasma boundary reconstruction in tokamak devices. The approach is based on a single Extreme Learning Machine network used to solve the homogeneous Grad Shafranov equation, which is required to identify the plasma boundary. This architecture enables the real time training of the network parameters using the available magnetic sensor data and, consequently, dynamically adapting the network output to the evolving plasma equilibrium. We demonstrate that, the network performs accurate plasma boundary reconstruction for complex configurations, outperforming well established methods, such as the algorithm used for decades at the Joint European Torus, the world's largest tokamak, until it ceased operation in 2023. Indeed, compared to the latter, the proposed solution better generalizes the poloidal flux function, without requiring algorithm retuning across different plasma equilibria. The proposed neural network reconstructor demonstrates also greater robustness with respect to noise on the magnetic measurements. Moreover, this method takes advantage of the generalization power of neural networks but without the need for extensive, time consuming training based on a huge amount of experimental data, making its implementation on existing devices straightforward.",
    "authors": [
      "Federico Fiorenza",
      "Sara Dubbioso",
      "Gianmaria De Tommasi",
      "Alfredo Pironti"
    ],
    "published": "2025-12-18T15:55:33Z",
    "updated": "2025-12-18T15:55:33Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.16643v1",
    "url": "https://arxiv.org/abs/2512.16643v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16643v1.pdf",
    "title": "Temperature dependence of the long-term annealing behavior of neutron irradiated diodes from 8-inch p-type silicon wafers",
    "abstract": "To face the higher levels of radiation due to the 10-fold increase in integrated luminosity during the High-Luminosity LHC, the CMS detector will replace the current Calorimeter Endcap (CE) using the High-Granularity Calorimeter (HGCAL) concept. The high-radiation regions of the the CE, where fluences between $1\\cdot10^{14}~n_{eq}/cm^{2}$ and $1\\cdot10^{16}~n_{eq}/cm^{2}$ and doses of up to 2\\,MGy are expected considering an integrated luminosity of $3\\,ab^{-1}$, will be equipped with silicon pad sensors. This includes the entire electromagnetic as well as parts of the hadronic section of the CE. The silicon sensors are processed on 8-inch p-type wafers with an active thickness of 300\\,\\textmu m, 200\\,\\textmu m and 120\\,\\textmu m and cut into hexagonal shapes for optimal use of the full wafer area and tiling. With each main sensor, several small test structures (e.g. pad diodes) are hosted on the wafers, used for quality assurance and radiation hardness tests. In order to investigate the radiation-induced bulk damage, these diodes have been irradiated with reactor neutrons at JSI (Jozef Stefan Institute, Ljubljana, Slovenia) to fluences between $5\\cdot10^{14}~n_{eq}/cm^{2}$ and $1.5\\cdot10^{16}~n_{eq}/cm^{2}$. This study focuses on the isothermal annealing behavior of the bulk material at different temperatures between 5.5°C and 60°C using electrical characterization and charge collection measurements. The results are used to extract the annealing time constants for this material and fluence range based on the Hamburg model approach to allow an estimation of the expected annealing effects in silicon sensors during the year-end technical stops and the long HL-LHC shutdowns. The annealing parameters found will make it possible to model the annealing behavior of p-type silicon detector projects at HL-LHC fluence ranges better than the existing Hamburg model.",
    "authors": [
      "Leena Diehl",
      "Oliwia Kaluzinska",
      "Marie Mühlnikel",
      "Max Andersson",
      "Natalya Gerassyova",
      "Jenan Amer",
      "Eva Sicking",
      "Dana Groner",
      "Jan Kieseler",
      "Matteo Defranchis"
    ],
    "published": "2025-12-18T15:15:21Z",
    "updated": "2025-12-18T15:15:21Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.16630v1",
    "url": "https://arxiv.org/abs/2512.16630v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16630v1.pdf",
    "title": "Photon Accelerator in Magnetized Plasma",
    "abstract": "Strong magnetic fields and plasmas are intrinsically linked in both terrestrial laboratory experiments and in space phenomena. One of the most profound consequences of that is the change in relationship between the frequency and the wave number of electromagnetic waves propagating in plasma in the presence of such magnetic fields when compared to the case without these fields. Furthermore, magnetic fields alter electromagnetic wave interaction with relativistic plasma waves, resulting in different outcomes for particle and radiation generation. For a relativistic plasma wave-based photon acceleration this leads to an increased frequency gain, and, thus, potentially to higher efficiency. The influence of a magnetic field leads to quantitative and qualitative change in the properties of photon acceleration, amplifying the increase in the electromagnetic wave frequency.",
    "authors": [
      "Sergei Bulanov",
      "Stepan Bulanov",
      "Timur Esirkepov",
      "Gianluca Gregori",
      "Gabriele Grittani",
      "Brandon Russell",
      "Alec Thomas",
      "Petr Valenta"
    ],
    "published": "2025-12-18T15:06:33Z",
    "updated": "2025-12-18T15:06:33Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.04205v2",
    "url": "https://arxiv.org/abs/2509.04205v2",
    "pdf_url": "https://arxiv.org/pdf/2509.04205v2.pdf",
    "title": "Toward precision physics tests with future COHERENT detectors",
    "abstract": "We present a comprehensive sensitivity study of future CE$ν$NS detectors, focusing on a cryogenic cesium iodide detector and a tonne-scale liquid argon one, currently being developed by the COHERENT Collaboration. These setups will enable precision measurements of the weak mixing angle at low energies and allow accurate extraction of the neutron nuclear distribution radius. We also demonstrate that next-generation detectors will place constraints on the neutrino charge radius comparable to or better than current global fits. In addition, we explore the sensitivity to non standard neutrino electromagnetic properties, such as magnetic moments and millicharges, as well as new mediators. These findings reinforce the role of CE$ν$NS experiments in the upcoming precision era, with future detectors playing a key role in advancing our understanding of neutrino interactions and electroweak physics at low energies.",
    "authors": [
      "M. Atzori Corona",
      "M. Cadeddu",
      "N. Cargioli",
      "F. Dordei",
      "C. Giunti",
      "R. Pavarani"
    ],
    "published": "2025-09-04T13:31:19Z",
    "updated": "2025-12-18T14:48:12Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "hep-ph"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.3390/universe11120416"
  },
  {
    "arxiv_id": "2512.16604v1",
    "url": "https://arxiv.org/abs/2512.16604v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16604v1.pdf",
    "title": "Disruption Modelling for Engineering and Physics Design of Tokamak Energy ST-E1 Fusion Power Plant",
    "abstract": "Plasma disruptions represent a critical challenge for high-performance tokamak operations, as they can compromise machine integrity and reduce operational availability. Although future fusion devices essentially need to incorporate strategies to minimise disruption occurrence, complete avoidance remains unattainable. Consequently, assessing and characterising unmitigated disruption consequences is fundamental for the design and qualification of next-generation fusion power plants. This work supports the pre-conceptual design of ST-E1, a low aspect-ratio Tokamak Fusion Power Plant developed by Tokamak Energy Ltd., by presenting a comprehensive disruption modelling approach applied across different design stages. The methodology integrates both physics and engineering considerations to evaluate the impact of disruptions on machine performance and structural integrity. From an engineering perspective, several ST-E1 layout options were analysed to investigate the electromagnetic response of key components under disruption-induced loads, enabling comparison between alternative design solutions. On the physics side, a broad set of disruption scenarios was explored, scanning operational space parameters, plasma-material interactions, and associated thermal loads. Furthermore, the study examined variations in disruption behaviour arising from different reference equilibria, focusing on a range starting from Double Null to Single Null configurations, reflecting the increasing up-down asymmetry consequences. The results reveal significant contrasts in plasma dynamics and structures electromagnetic behaviour between configurations, highlighting the importance of disruption modelling in guiding design choices. These analyses have proven instrumental in shaping ST-E1 development, offering critical insights for mitigating risks and optimising future fusion reactor designs.",
    "authors": [
      "M. Scarpari",
      "X. Zhang",
      "K. Borowiec",
      "P. F. Buxton",
      "G. Calabro",
      "S. Carusotti",
      "A. Ciula",
      "V. Godhani",
      "J. D. Lore",
      "E. N. J. Maartensson",
      "S. A. M. McNamara",
      "J. H. Nichols",
      "M. Notazio",
      "M. Robinson",
      "M. Romanelli",
      "J. Willis",
      "ST-E1 Team"
    ],
    "published": "2025-12-18T14:46:08Z",
    "updated": "2025-12-18T14:46:08Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.21375v2",
    "url": "https://arxiv.org/abs/2510.21375v2",
    "pdf_url": "https://arxiv.org/pdf/2510.21375v2.pdf",
    "title": "Picosecond Precision Heavy Ion Detector for Λ Hypernuclei Lifetime Studies",
    "abstract": "In this paper, we present the design and preliminary performance evaluation of a new heavy ion detector for direct measurements of heavy Λ hypernuclei lifetime. The detector employs the previously developed 10 picosecond resolution Radio Frequency (RF) Timer, which converts the temporal information of incident particles into spatial coordinates of secondary or photoelectrons on a position-sensitive detector by means of circular RF scanning in the 500-1000 MHz range. Here, we report the detector design to achieve efficient suppression of accidental background and effective separation of prompt reaction products and delayed events from Λ hypernuclei decays, results of test studies carried out with RF synchronized laser as well as preliminary results obtained by using alpha particles. Dedicated Monte-Carlo simulations have been performed to estimate the detector's performance under realistic experimental conditions at RF-driven electron, photon, or proton beams. The results confirm the feasibility of the proposed design and provide a basis for upcoming experimental measurements, based on the delayed fission detection.",
    "authors": [
      "Simon Zhamkochyan",
      "Sergey Abrahamyan",
      "Amur Margaryan",
      "Hayk Elbakyan",
      "Aram Kakoyan",
      "Samvel Mayilyan",
      "Artashes Papyan",
      "Hasmik Rostomyan",
      "Anna Safaryan",
      "Gagik Sughyan",
      "Narek Margaryan",
      "Garnik Ayvazyan",
      "John Annand",
      "Kenneth Livingston",
      "Rachel Montgomery",
      "Patrick Achenbach",
      "Josef Pochodzalla",
      "Dimiter Balabanski",
      "Satoshi Nakamura",
      "Ani Aprahamian",
      "Vanik Kakoyan"
    ],
    "published": "2025-10-24T11:58:51Z",
    "updated": "2025-12-18T14:24:27Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.16546v1",
    "url": "https://arxiv.org/abs/2512.16546v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16546v1.pdf",
    "title": "SCOPE: Simple Coil Optimization for Plasma and Engineering",
    "abstract": "Designing superconducting coils for a tokamak fusion device is a highly coupled, non-linear design problem. The coils have many disparate engineering requirements from structural to power electronics, as well strict limits placed on the system by the high temperature superconducting (HTS) cables. Simultaneously, the coils must be able to contain multiple plasma scenarios from inception, through ramp up, to flat top, and ramp down, all whilst applying a large, controlled, inductive voltage to drive current. In addition, we wish to optimize divertor separatrices to increase the likelihood of designing a suitable divertor strikepoint. Lastly, the physical limits of the entire tokamak must be taken into account and space reserved for support structures, access for maintenance schemes, and installation limits. The method outlined here uses a combined simulated annealing method to find optimal coil sizes and positions with a constrained quadratic or quartic optimization for the coil currents. The method is designed to optimize coils for multiple scenarios simultaneously, including ramp-ups, to avoid over optimization of a single design point. A key enabler is the efficient implementation that allows millions of evaluations to be performed in a few hours with modest computational power. This optimization method is part of a larger, iterative workflow which enables further, detailed design work to feedback on the optimization.",
    "authors": [
      "Nathan Welch",
      "Chris Marsden"
    ],
    "published": "2025-12-18T13:53:18Z",
    "updated": "2025-12-18T13:53:18Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.15853v2",
    "url": "https://arxiv.org/abs/2509.15853v2",
    "pdf_url": "https://arxiv.org/pdf/2509.15853v2.pdf",
    "title": "Electron-positron pair generation using a single kJ-class laser pulse in a foam-reflector setup",
    "abstract": "We investigate the process of creating electron-positron pairs from laser-matter interaction in pre-ionised foam targets using particle-in-cell simulations. A high-intensity laser pulse drives electrons via direct laser acceleration up to a cone-shaped reflector. The high-energy electrons interact with the reflected laser pulse, generating abundant pairs. The effects of the plasma-channel shape on the propagation of the laser pulse and subsequent pair production is studied. The results show that the number of Compton emission and Breit-Wheeler pair creation events is highly sensitive to the diffraction of the laser due to its interaction with the foam.",
    "authors": [
      "Oliver Mathiak",
      "Lars Reichwein",
      "Alexander Pukhov"
    ],
    "published": "2025-09-19T10:44:00Z",
    "updated": "2025-12-18T09:37:29Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.16311v1",
    "url": "https://arxiv.org/abs/2512.16311v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16311v1.pdf",
    "title": "Bunch-by-Bunch Prediction of Beam Transverse Position, Phase, and Length in a Storage Ring Using Neural Networks",
    "abstract": "Real-time, bunch-by-bunch monitoring of transverse position, longitudinal phase, and bunch length is crucial for beam control in diffraction-limited storage rings, where complex collective dynamics pose unprecedented diagnostic challenges. This study presents a neural network framework that simultaneously predicts these parameters directly from beam position monitor waveforms. The hybrid architecture integrates specialized Multi-Layer Perceptron (MLP), Convolutional Neural Network (CNN), and Long Short-Term Memory with Attention (LSTM-Attention) sub-networks, overcoming key limitations of traditional methods such as serial processing chains and batch-mode operation. Validated on experimental data from the Shanghai Synchrotron Radiation Facility and Hefei Light Source, the model achieves high prediction accuracy with a sub-millisecond latency of 0.042 ms per bunch. This performance demonstrates its potential as a core tool for real-time, multi-parameter diagnostics and active feedback in next-generation light sources.",
    "authors": [
      "Can Liu",
      "Xing Yang",
      "Youming Deng",
      "Qingqing Duan",
      "Yongbin Leng"
    ],
    "published": "2025-12-18T08:51:01Z",
    "updated": "2025-12-18T08:51:01Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2502.19061v2",
    "url": "https://arxiv.org/abs/2502.19061v2",
    "pdf_url": "https://arxiv.org/pdf/2502.19061v2.pdf",
    "title": "Conceptual study on using Doppler backscattering to measure magnetic pitch angle in tokamak plasmas",
    "abstract": "We introduce a new approach to measure the magnetic pitch angle profile in tokamak plasmas with Doppler backscattering (DBS), a technique traditionally used for measuring flows and density fluctuations. The DBS signal is maximised when its probe beam's wavevector is perpendicular to the magnetic field at the cutoff location, independent of the density fluctuations. Hence, if one could isolate this effect, DBS would then yield information about the magnetic pitch angle. By varying the toroidal launch angle, the DBS beam reaches cutoff with different angles with respect to the magnetic field, but with other properties remaining similar. Hence, the toroidal launch angle which gives maximum backscattered power is thus that which is matched to the pitch angle at the cutoff location, enabling inference of the magnetic pitch angle. We performed systematic scans of the DBS toroidal launch angle for repeated DIII-D tokamak discharges. Experimental DBS data from this scan were analysed and combined with Gaussian beam-tracing simulations using the Scotty code. The pitch-angle inferred from DBS is consistent with that from magnetics-only and motional-Stark-effect-constrained (MSE) equilibrium reconstruction in the edge. In the core, the pitch angles from DBS and magnetics-only reconstructions differ by one to two degrees, while simultaneous MSE measurements were not available. The uncertainty in these measurements was under a degree; we show that this uncertainty is primarily due to the error in toroidal steering, the number of toroidally separated measurements, and shot-to-shot repeatability. We find that the error of pitch-angle measurements can be reduced by optimising the poloidal launch angle and initial beam properties.",
    "authors": [
      "AK Yeoh",
      "VH Hall-Chen",
      "QT Pratt",
      "BS Victor",
      "J Damba",
      "TL Rhodes",
      "NA Crocker",
      "KR Fong",
      "JC Hillesheim",
      "FI Parra",
      "J Ruiz Ruiz"
    ],
    "published": "2025-02-26T11:38:54Z",
    "updated": "2025-12-18T08:11:00Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.16196v1",
    "url": "https://arxiv.org/abs/2512.16196v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16196v1.pdf",
    "title": "Toward the Origins of Binding Energy Shifts and Satellites Formation During Plasma-XPS Measurements",
    "abstract": "In plasma X ray photoelectron spectroscopy emerges as a powerful platform for real time, in situ chemical analysis under conditions relevant to semiconductor processing and other plasma enabled technologies. This study investigates the origins of binding energy shifts and satellite peaks formation observed during plasma XPS measurements across conductive, dielectric, and gas phase systems. Using a standard laboratory based ambient pressure XPS apparatus coupled with an alternating current driven capacitively coupled plasma source, we show that metastable surface species, such as transient Au oxides, can be detected during plasma exposure, revealing chemical states hardly accessible using conventional ultrahigh vacuum XPS. In dielectric samples, we observe pressure- and plasma type dependent BE shifts up to 50 eV, attributed to X ray induced and plasma mediated surface charging. These shifts are mitigated at higher pressures plasmas or in electronegative plasmas, the latter due to enhanced charge compensation mechanisms involving slow negative ions. For gas phase species, AC plasma excitation leads to spectral broadening and the emergence of satellite peaks with a few eV energy separations, linked to oscillating local plasma potentials in the probing volume. These findings highlight the important and complex interplay of plasma parameters, surface charging, and local electric fields in shaping XPS spectra. Overall, plasma XPS emerges as a critical metrological tool for probing transient surface chemistry, with implications for semiconductor processing, material synthesis, and plasma diagnostics.",
    "authors": [
      "J. Trey Diulus",
      "Ashley R. Head",
      "Jorge Anibal Boscoboinik",
      "Carles Corbella Roca",
      "Alexander Tselev",
      "Andrei Kolmakov"
    ],
    "published": "2025-12-18T05:37:38Z",
    "updated": "2025-12-18T05:37:38Z",
    "categories": [
      "physics.plasm-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.08421v4",
    "url": "https://arxiv.org/abs/2506.08421v4",
    "pdf_url": "https://arxiv.org/pdf/2506.08421v4.pdf",
    "title": "High-precision Beam Optics Calculation of the HIAF-BRing Using Measured Fields",
    "abstract": "The construction of the High Intensity heavy ion Accelerator Facility (HIAF) has been completed, with current efforts focused on subsystem commissioning. Beam commissioning is scheduled for autumn 2025, marking a critical milestone in the HIAF project. This paper presents high-precision optics calculations for the Booster Ring (BRing) of HIAF, a key component for achieving stable heavy-ion beam acceleration. Leveraging high-precision magnetic field data, each magnet is divided into hundreds of slices, thus establishing a high-precision sliced optics model for BRing. Detailed calculations of BRing's optics are presented in this work. Critical parameters including tunes and betatron functions of the lattice based on the measured magnetic fields and those of the ideal lattice have been compared. The results highlight the impact of realistic magnetic field on beam dynamics and provide essential insights for accelerator tuning and optimization. These findings serve as a fundamental reference for beam commissioning and long-term operation, ensuring beam stability and performance reproducibility in HIAF.",
    "authors": [
      "Ke Wang",
      "Li-Na Sheng",
      "Geng Wang",
      "Wei-Ping Chai",
      "You-Jin Yuan",
      "Jian-Cheng Yang",
      "Guo-Dong Shen",
      "Liang Lu"
    ],
    "published": "2025-06-10T03:47:11Z",
    "updated": "2025-12-18T04:36:49Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.1088/1748-0221/20/08/P08023"
  },
  {
    "arxiv_id": "2512.16060v1",
    "url": "https://arxiv.org/abs/2512.16060v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16060v1.pdf",
    "title": "Frequency Extraction from Invariant Flows",
    "abstract": "In non-degenerate integrable Hamiltonian systems, invariant tori can be parameterized equivalently by action variables or by their fundamental frequencies. We introduce an invariant-flow formulation for extracting fundamental frequencies of integrable Hamiltonian systems. By treating invariants as generators of commuting Hamiltonian flows, the frequencies are obtained from time-of-flight parameters along these flows, providing a direct alternative to action-angle constructions and spectral methods based on long time series. The approach yields an explicit numerical procedure that extends naturally to systems with multiple degrees of freedom. Its effectiveness is demonstrated using the McMillan map, where machine-precision accuracy is achieved.",
    "authors": [
      "Derong Xu",
      "Yongjun Li",
      "Yue Hao",
      "Sergei Nagaitsev"
    ],
    "published": "2025-12-18T01:00:58Z",
    "updated": "2025-12-18T01:00:58Z",
    "categories": [
      "nlin.SI",
      "physics.acc-ph"
    ],
    "primary_category": "nlin.SI"
  },
  {
    "arxiv_id": "2512.16028v1",
    "url": "https://arxiv.org/abs/2512.16028v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16028v1.pdf",
    "title": "Direct calculation of steady-state hydrodynamic solar wind solutions with newtonian viscosity",
    "abstract": "Steady-state solutions to the Navier-Stokes equations are known to admit solutions that are singular at the sonic point. Consequently, inviscid solar wind models require special treatment of the solution near the sonic points, and this has proven to be a significant impediment to efficient modeling of the solar wind. In this paper we revisit the governing hydrodynamic equations for the expanding solar wind, with the inclusion of the classical (Newtonian) viscous stress , and we show how this inclusion eliminates the singularities that emerge from the inviscid equations. This result has been previously reported and used to generate solar wind profiles from initial conditions in the asymptotic limit; however, those studies did not include realistic treatments of the inner corona, and generally rejected the prospect of extrapolating solutions outward from the Sun into the heliosphere. Here, we expand this method to include external heating and optically thin radiative losses and show that solutions can be computed from initial conditions near the solar surface, thereby capturing the entire range of scales from below the transition region to the outer heliosphere in a single solution. Our approach is to cast the steady-state Navier-Stokes equations as a system of five coupled, ordinary differential equations (ODEs), which we solve using conventional methods, without any special treatment of the governing equations in the vicinity of the sonic point. The representative solutions that we present here demonstrate the utility and efficiency of this extrapolation method, which is considerably more realistic than commonly used analytical or empirical models. This method provides a direct approach to generating accurate solar wind profiles subject to observationally motivated initial conditions near the solar surface, at a fraction of the computational cost of comparable relaxation-based models.",
    "authors": [
      "Roger B. Scott",
      "Stephen J. Bradshaw",
      "Mark G. Linton",
      "Chris Lowder",
      "Leonard Strachan"
    ],
    "published": "2025-12-17T23:21:33Z",
    "updated": "2025-12-17T23:21:33Z",
    "categories": [
      "astro-ph.SR",
      "physics.flu-dyn",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR",
    "doi": "10.1051/0004-6361/202555327"
  },
  {
    "arxiv_id": "2510.09579v2",
    "url": "https://arxiv.org/abs/2510.09579v2",
    "pdf_url": "https://arxiv.org/pdf/2510.09579v2.pdf",
    "title": "The impact of plasma turbulence on atomic reaction rates in detached divertors",
    "abstract": "Numerical modeling of the edge and scrape-off layer (SOL) must account for atomic processes such as hydrogenic ionization and recombination, charge-exchange, and line radiation. Their reaction rates depend non-linearly on density and temperature and are thus sensitive to turbulent fluctuations, whose inclusion/omission may significantly affect model outcomes. We quantify the impact of fluctuations by studying global turbulence simulations of the edge and SOL of ASDEX-Upgrade in both attached and detached conditions. While the effect of fluctuations is minimal for the attached state, pronounced discrepancies emerge in colder, detached conditions. When accounting for turbulent fluctuations, ionization and radiation rates at the detachment front are reduced by a factor of 2 when compared to mean-field calculations. The effect arises from fluctuations crossing below the ionization temperature threshold, facilitated by low mean temperature and increased fluctuation amplitudes at the detachment front. The rate reduction (rather than rate increase) is explained by the character of divertor fluctuations (negative density-temperature correlation, i.e. cold and dense blobs), notably distinct from characteristic fluctuations found at the outboard-midplane (positive correlation, i.e. hot and dense blobs). Furthermore, the cold and dense fluctuations enable efficient plasma recombination even at average temperatures above the recombination threshold. In detached conditions, the combined plasma particle source from ionization and recombination is therefore effectively reduced by at least 50% when compared to the standard mean-field source.",
    "authors": [
      "Konrad Eder",
      "Wladimir Zholobenko",
      "Andreas Stegmeir",
      "Kaiyu Zhang",
      "Frank Jenko"
    ],
    "published": "2025-10-10T17:34:48Z",
    "updated": "2025-12-17T22:37:28Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.15968v1",
    "url": "https://arxiv.org/abs/2512.15968v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15968v1.pdf",
    "title": "Measurement of Light Yield Response of Gd-compatible Water-based Liquid Scintillator with the Brookhaven 1-ton testbed",
    "abstract": "The Water-based Liquid Scintillator (WbLS) enables hybrid detection by combining scintillation and Cherenkov signals, providing superior event reconstruction capabilities compared to conventional neutrino detectors. We measured the light yield of Gd-compatible WbLS at varying concentrations from 0.35\\% to 1\\% by mass, using cosmic-ray muons in a 1-ton scale detector at BNL. The light yield is measured as (69.16 $\\pm$ 6.92) ph / MeV at 0.35\\% concentration, which increased to (87.32 $\\pm$ 8.73) ph / MeV at 1\\%. These results establish a quantitative basis for optimizing future WbLS-based detectors in neutrino physics.",
    "authors": [
      "S. Gwon",
      "M. Askins",
      "D. M. Asner",
      "A. Baldoni",
      "D. F. Cowen",
      "R. Diaz Prerez",
      "M. V. Diwan",
      "S. Gokhale",
      "S. Hans",
      "P. Kumar",
      "G. Lawley",
      "S. Linden",
      "G. D. Orebi Gann",
      "J. Park",
      "C. Reyes",
      "R. Rosero",
      "K. Siyeon",
      "M. Smiley",
      "J. J. Wang",
      "M. Wilking",
      "G. Yang",
      "M. Yeh"
    ],
    "published": "2025-12-17T20:58:03Z",
    "updated": "2025-12-17T20:58:03Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.15924v1",
    "url": "https://arxiv.org/abs/2512.15924v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15924v1.pdf",
    "title": "Tensor network approaches for plasma dynamics",
    "abstract": "The dynamics of plasmas are governed by a set of non-linear differential equations which remain challenging to solve directly for large 2D and 3D problems. Here we investigate how tensor networks could be applied to plasmas described by the Vlasov-Maxwell system of equations and investigate parameter regimes which show promise for efficient simulations. We show for low-dimensional problems that the simplest form of tensor networks known as a Matrix Product State performs sufficiently well, however in regimes with a strong permanent magnetic field or high-dimensional problems one may need to consider alternative tensor network geometries. We conclude the study of the Vlasov-Maxwell system with the application of tensor networks to an industrially relevant test case and validate our results against state of the art plasma solvers based on Particle-In-Cell codes. We also extend the application of tensor networks to the alternative plasma description of Magnetohydrodynamics and outline how this can be encoded using Matrix Product States.",
    "authors": [
      "Ryan J. J. Connor",
      "Preetma Soin",
      "Callum W. Duncan",
      "Andrew J. Daley"
    ],
    "published": "2025-12-17T19:39:44Z",
    "updated": "2025-12-17T19:39:44Z",
    "categories": [
      "physics.plasm-ph",
      "quant-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.15847v1",
    "url": "https://arxiv.org/abs/2512.15847v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15847v1.pdf",
    "title": "Self-confinement of relativistic pair beams in magnetized interstellar plasmas: the case of pulsar X-ray filaments",
    "abstract": "The observation of filamentary X-ray structures near bow-shock pulsar wind nebulae (PWNe) -- such as the Guitar, Lighthouse, and PSR J2030$+$4415 nebulae -- and of slow-diffusion regions around pulsars like Geminga, Monogem, and PSR J0622$+$3749, challenges the standard picture of cosmic-ray transport in the interstellar medium, implying a diffusion coefficient two orders of magnitude smaller than the Galactic average. The suppressed diffusion can be attributed to self-generated magnetic turbulence, driven -- via the non-resonant streaming instability -- by electron--positron pairs escaping the PWNe. This instability requires a net current, yet the beam of escaping pairs is expected to be charge-neutral. We show that a charge-neutral pair beam propagating through an electron--proton plasma can spontaneously generate a net current. Using fully kinetic two- and three-dimensional particle-in-cell simulations with realistic mass ratio, we find that beam electrons get focused into self-generated magnetic filaments produced by the nonlinear evolution of the Weibel instability, while beam positrons remain unconfined. The resulting net (positron) current drives the non-resonant streaming instability, further amplifying the magnetic field. This mechanism provides a pathway for the onset of charge asymmetries in initially charge-neutral pair beams and for the growth of magnetic fluctuations that efficiently scatter the beam particles, with implications for the formation of X-ray filaments and, more broadly, for particle self-confinement in TeV halos around PWNe.",
    "authors": [
      "Luca Orusa",
      "Lorenzo Sironi"
    ],
    "published": "2025-12-17T19:00:00Z",
    "updated": "2025-12-17T19:00:00Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2508.09895v2",
    "url": "https://arxiv.org/abs/2508.09895v2",
    "pdf_url": "https://arxiv.org/pdf/2508.09895v2.pdf",
    "title": "Exploring the Physics of the Plasma Liner Experiment: A Multi-dimensional Study with FLASH, OSIRIS, and HELIOS",
    "abstract": "The Plasma Liner Experiment (PLX) at Los Alamos National Laboratory (LANL) is a platform that seeks to achieve fusion via the Plasma-Jet-Driven Magneto-Inertial Fusion (PJMIF) concept. The experiment utilizes a constellation of plasma guns to generate fusion-relevant conditions and consists of three main phases: (1) target formation, in which up to four plasma guns shoot magnetized hydrogen or deuterium-tritium jets to form a quasi-spherical target, (2) liner formation, in which a 36 guns fire high-atomic-number (e.g., xenon) jets to form a liner shell, and (3) target compression, in which the formed liner implodes the pre-formed target. Each phase of the PLX operates in different plasma regimes, with different physics at play, thus each phase must be simulated separately with appropriate codes. In this study we highlight 1-, 2-, and 3-D simulation results of all three phases using the FLASH, OSIRIS, and HELIOS codes. Some of the key physical processes involved include shock dynamics, kinetic effects, anisotropic thermal conduction, resistive magnetic diffusion, radiation transport, and magnetized jet dynamics. The simulations show that the PLX can form a preheated ($\\sim$40 eV), magnetized (electron Hall parameter $>$1) target plasma, and a quasi-collisional liner shell, which can subsequently compress the target to fusion-relevant conditions, reaching temperatures in excess of 1 keV.",
    "authors": [
      "E. C. Hansen",
      "P. Farmakis",
      "D. Michta",
      "C. Ren",
      "H. Wen",
      "S. Langendorf",
      "F. Chu",
      "P. Tzeferacos"
    ],
    "published": "2025-08-13T15:55:14Z",
    "updated": "2025-12-17T18:37:01Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2501.00091v3",
    "url": "https://arxiv.org/abs/2501.00091v3",
    "pdf_url": "https://arxiv.org/pdf/2501.00091v3.pdf",
    "title": "Deep learning optimal molecular scintillators for dark matter direct detection",
    "abstract": "Direct searches for sub-GeV dark matter are limited by the intrinsic quantum properties of the target material. In this proof-of-concept study, we argue that this problem is particularly well suited for machine learning. We demonstrate that a simple neural architecture consisting of a variational autoencoder and a multi-layer perceptron can efficiently generate unique molecules with desired properties. In specific, the energy threshold and signal (quantum) efficiency determine the minimum mass and cross section to which a detector can be sensitive. Organic molecules present a particularly interesting class of materials with intrinsically anisotropic electronic responses and $\\mathcal{O}$(few) eV excitation energies. However, the space of possible organic compounds is intractably large, which makes traditional database screening challenging. We adopt excitation energies and proxy transition matrix elements as target properties learned by our network. Our model is able to generate molecules that are not in even the most expansive quantum chemistry databases and predict their relevant properties for high-throughput and efficient screening. Following a massive generation of novel molecules, we use clustering analysis to identify some of the most promising molecular structures that optimise the desired molecular properties for dark matter detection.",
    "authors": [
      "Cameron Cook",
      "Carlos Blanco",
      "Juri Smirnov"
    ],
    "published": "2024-12-30T19:00:00Z",
    "updated": "2025-12-17T17:23:29Z",
    "categories": [
      "hep-ph",
      "cond-mat.mtrl-sci",
      "hep-ex",
      "hep-th",
      "physics.ins-det"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2504.03862v2",
    "url": "https://arxiv.org/abs/2504.03862v2",
    "pdf_url": "https://arxiv.org/pdf/2504.03862v2.pdf",
    "title": "Probing the Firn Refractive Index Profile Using Antenna Response",
    "abstract": "The Radio Neutrino Observatory-Greenland (RNO-G, at Summit Station) experiment comprises an extensive fat-dipole antenna array deployed into ice boreholes over an eventual area of approximately 35 ${\\rm km}^2$. Since the RNO-G experimental sensitivity depends on the radio-frequency properties of the firn, which are known to vary laterally on sub-km distance scales and vertically on sub-meter distance scales, a technique for quickly extracting information on firn ice properties with depth ($n(z)$) during drilling and deployment is desirable. Given that a dipole's resonant wavelength is fixed by geometry, the resonant frequency $f_{res}$ (measured as an S-parameter reflection coefficient [`$S_{11}$'] minimum) scales inversely with the local refractive index, allowing a translation of a depth-dependent $S_{11}$(z) profile into $n(z)$. $S_{11}$(z) data were initially taken in August, 2024 using a dipole lowered into a newly-drilled $98\\pm 1$-mm diameter, 350-m deep borehole at Summit Station, Greenland, approximately 1 km from the site of the original GISP-2 core; improved measurements were subsequently made in May, 2025. We conclude that $S_{11}$(z) data can be used to estimate \\RIP, on 50 cm vertical scales, at the per-cent level of accuracy required by experiments such as RN0-G.",
    "authors": [
      "S. Agarwal",
      "J. A. Aguilar",
      "N. Alden",
      "S. Ali",
      "P. Allison",
      "M. Betts",
      "D. Besson",
      "A. Bishop",
      "O. Botner",
      "S. Bouma",
      "S. Buitink",
      "R. Camphyn",
      "S. Chiche",
      "B. A. Clark",
      "A. Coleman",
      "K. Couberly",
      "S. de Kockere",
      "K. D. de Vries",
      "C. Deaconu",
      "P. Giri",
      "C. Glaser",
      "T. Glusenkamp",
      "A. Hallgren",
      "S. Hallmann",
      "J. C. Hanson",
      "B. Hendricks",
      "J. Henrichs",
      "N. Heyer",
      "C. Hornhuber",
      "E. Huesca Santiago",
      "K. Hughes",
      "T. Karg",
      "A. Karle",
      "J. L. Kelley",
      "M. Korntheuer",
      "M. Kowalski",
      "I. Kravchenko",
      "R. Krebs",
      "R. Lahmann",
      "C. H. Liu",
      "M. J. Marsee",
      "C. McLennan",
      "M. Mikhailova",
      "K. Mulrey",
      "M. Muzio",
      "A. Nelles",
      "A. Novikov",
      "A. Nozdrina",
      "E. Oberla",
      "B. Oeyen",
      "N. Punsuebsay",
      "L. Pyras",
      "M. Ravn",
      "D. Ryckbosch",
      "F. Schluter",
      "O. Scholten",
      "D. Seckel",
      "M. F. H. Seikh",
      "J. Stachurska",
      "J. Stoffels",
      "S. Toscano",
      "D. Tosi",
      "J. Tutt",
      "D. J. Van Den Broeck",
      "N. van Eijndhoven",
      "A. G. Vieregg",
      "A. Vijai",
      "C. Welling",
      "D. R. Williams",
      "P. Windischhofer",
      "S. Wissel",
      "R. Young",
      "A. Zink"
    ],
    "published": "2025-04-04T18:38:26Z",
    "updated": "2025-12-17T17:07:42Z",
    "categories": [
      "astro-ph.IM",
      "astro-ph.HE",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2512.15588v1",
    "url": "https://arxiv.org/abs/2512.15588v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15588v1.pdf",
    "title": "Impact of magnetic islands on plasma flow and turbulence in W7-X",
    "abstract": "The effect of magnetic islands on plasma flow and turbulence has been experimentally investigated in the stellarator W7-X. Magnetic configurations with the 5/5 magnetic island positioned at the plasma edge, inside the last closed flux surface, are studied. The main diagnostic used in the present work is a V-band Doppler reflectometer that allows the measurement of the perpendicular plasma flow and density fluctuations with good spatial resolution. A characteristic signature of the 5/5 magnetic island is clearly detected in the perpendicular flow profile. The comparison of the experimental flow and the neoclassically driven $E\\times B$ flow indicates that the island contribution to the flow is maximum at the island boundaries and close to zero at the island O-point. Besides, a reduction in the density fluctuation level is found nearby the island O-point. The similarities between these observations and those found in other devices and in gyrokinetic simulations are discussed.",
    "authors": [
      "T. Estrada",
      "E. Maragkoudakis",
      "D. Carralero",
      "T. Windisch",
      "J. L Velasco",
      "C. Killer",
      "T. Andreeva",
      "J. Geiger",
      "A. Dinklage",
      "A. Krämer-Flecken",
      "G. A. Wurden",
      "M. Beurskens",
      "S. Bozhenkov",
      "H. Damm",
      "G. Fuchert",
      "E. Pasch"
    ],
    "published": "2025-12-17T16:48:22Z",
    "updated": "2025-12-17T16:48:22Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1088/1741-4326/ac146f"
  },
  {
    "arxiv_id": "2512.15585v1",
    "url": "https://arxiv.org/abs/2512.15585v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15585v1.pdf",
    "title": "Study of a triple-discriminating plastic scintillator detector for fast neutrons, thermal neutrons, and gamma rays",
    "abstract": "Detecting fast and thermal neutrons plays a crucial role in neutrino experiments and reactor physics. In this study, we propose a plastic scintillator detector which demonstrates the ability to clearly distinguish fast neutrons, thermal neutrons, and gamma rays within mixed radiation fields, offering a practical approach for multi-radiation detection. Two plastic scintillator assemblies: EJ200+EJ426 and EJ276+EJ426 were setup, and the system energy response was calibrated using three gamma sources(137Cs, 22Na and 60Co). An Am-Be neutron source was employed, and pulse shape discrimination(PSD) was used to separate fast neutrons, thermal neutrons and gamma rays. Using a three-sigma discrimination criterion, the EJ200+EJ426 configuration was found to reliably distinguish thermal neutrons from gamma rays, while the EJ276+EJ426 configuration can effectively discriminate fast neutrons, thermal neutrons and gamma rays at gamma-equivalent energies above 1 MeV.",
    "authors": [
      "Y. H. Liu",
      "X. S. Zhang",
      "D. X. Lu",
      "W. Wang",
      "G. Luo",
      "F. P. An"
    ],
    "published": "2025-12-17T16:45:13Z",
    "updated": "2025-12-17T16:45:13Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.15576v1",
    "url": "https://arxiv.org/abs/2512.15576v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15576v1.pdf",
    "title": "Radial electric field and density fluctuations measured by Doppler reflectometry during the post-pellet enhanced confinement phase in W7-X",
    "abstract": "Radial profiles of density fluctuations and radial electric field, $E_r$, have been measured using Doppler reflectometry during the post-pellet enhanced confinement phase achieved, under different heating power levels and magnetic configurations, along the 2018 W7-X experimental campaign. A pronounced $E_r$-well is measured with local values as high as -40 kV/m in the radial range $ρ\\sim 0.7-0.8$ during the post-pellet enhanced confinement phase. The maximum $E_r$ intensity scales with both plasma density and Electron Cyclotron Heating (ECH) power level following a similar trend as the plasma energy content. A good agreement is found when the experimental $E_r$ profiles are compared to simulations carried out using the neoclassical codes DKES and KNOSOS. The density fluctuation level decreases from the plasma edge toward the plasma core and the drop is more pronounced in the post-pellet enhanced confinement phase than in reference gas fuelled plasmas. Besides, in the post-pellet phase, the density fluctuation level is lower in the high iota magnetic configuration than in the standard one. In order to discriminate whether this difference is related to the differences in the plasma profiles or in the stability properties of the two configurations, gyrokinetic simulations have been carried out using the codes \\texttt{stella} and EUTERPE. The simulation results point to the plasma profile evolution after the pellet injection and the stabilization effect of the radial electric field profile as the dominant players in the stabilization of the plasma turbulence.",
    "authors": [
      "T. Estrada",
      "D. Carralero",
      "T. Windisch",
      "E. Sánchez",
      "J. M. García-Regaña",
      "J. Martínez-Fernández",
      "A. de la Peña",
      "J. L. Velasco",
      "J. A. Alonso",
      "M. Beurskens",
      "S. Bozhenkov",
      "H. Damm",
      "G. Fuchert",
      "R. Kleiber",
      "N. Pablant",
      "E. Pasch"
    ],
    "published": "2025-12-17T16:34:07Z",
    "updated": "2025-12-17T16:34:07Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1088/1741-4326/abddee"
  },
  {
    "arxiv_id": "2510.14440v2",
    "url": "https://arxiv.org/abs/2510.14440v2",
    "pdf_url": "https://arxiv.org/pdf/2510.14440v2.pdf",
    "title": "Beam Energy Measurement using a Bayesian Approach with the Stacked Foil Method",
    "abstract": "We present a practical method to measure the energy of proton beams at a medical cyclotron using the stacked foil technique in combination with a Bayesian inference method. By measuring the $^{48}$V activity induced in a stack of irradiated titanium foils, the proton energy can be inferred without relying on direct current or charge measurements, making the method suitable even for low-vacuum environments or air-exposed setups. This technique is further extended to configurations where the beam energy is degraded to levels around 8 MeV. A Bayesian fit of the measured activity profile allows not only for a robust energy estimation but also for a consistent treatment of uncertainties and nuisance parameters. Monte Carlo simulations are employed to validate the underlying assumptions, including the impact of energy dispersion or cross-section uncertainties. Our results demonstrate that this method provides accurate beam energy measurements across several typical experimental setups used at the Bern Medical Cyclotron. Additionally, we evaluate the sensitivity of the method to the choice of nuclear cross-section data and assess how the number of foils in the stack affects the uncertainty in the inferred beam energy.",
    "authors": [
      "Alexander Gottstein",
      "Lorenzo Mercolli",
      "Eva Kasanda",
      "Isidre Mateu",
      "Lars Eggimann",
      "Elnaz Zyaee",
      "Gaia Dellepiane",
      "Pierluigi Casolaro",
      "Paola Scampoli",
      "Saverio Braccini"
    ],
    "published": "2025-10-16T08:40:51Z",
    "updated": "2025-12-17T16:00:57Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex",
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.24418v2",
    "url": "https://arxiv.org/abs/2510.24418v2",
    "pdf_url": "https://arxiv.org/pdf/2510.24418v2.pdf",
    "title": "ASTAROTH: A Novel Detector for Dark Matter Direct Detection Using Cryogenic SiPMs",
    "abstract": "The DAMA experiment's long-standing claim of dark matter detection remains a key open issue in astroparticle physics. Independent verification requires NaI(Tl)-based detectors with enhanced low-energy sensitivity. Current detectors rely on photomultiplier tubes (PMTs) which features limited detection efficiency, intrinsic radioactivity, and high noise at keV energies. ASTAROTH is an R&D project that developed a proof of concept NaI(Tl) detector where siliconphotomultipliers (SiPMs) have been used instead of PMTs, offering higher photon detection efficiency, negligible radioactivity, and, most of all, a reduction of two orders of magnitude in the dark noise. The setup includes a custom cryostat operating at approximately 80 K. We report the first characterization of an approximately 360 g NaI(Tl) crystal coupled to a 5 x 5 cm SiPM matrix, yielding 4.5 photoelectrons\\keV after crosstalk correction. This promising result demonstrates the feasibility of SiPM-based readout for NaI(Tl) and paves the way for future large-scale dark matter experiments.",
    "authors": [
      "Edoardo Martinenghi",
      "Valerio Toso",
      "Fabrizio Bruno Armani",
      "Andrea Castoldi",
      "Giuseppe Di Carlo",
      "Luca Frontini",
      "Niccolò Gallice",
      "Chiara Guazzoni",
      "Valentino Liberali",
      "Lorenzo Rutigliani",
      "Alberto Stabile",
      "Krzysztof Szczepaniec",
      "Valeria Trabattoni",
      "Andrea Zani",
      "Davide D'Angelo"
    ],
    "published": "2025-10-28T13:35:01Z",
    "updated": "2025-12-17T15:48:40Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/12/C12019"
  },
  {
    "arxiv_id": "2512.15521v1",
    "url": "https://arxiv.org/abs/2512.15521v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15521v1.pdf",
    "title": "Autonomous Pressure Control in MuVacAS via Deep Reinforcement Learning and Deep Learning Surrogate Models",
    "abstract": "The development of nuclear fusion requires materials that can withstand extreme conditions. The IFMIF-DONES facility, a high-power particle accelerator, is being designed to qualify these materials. A critical testbed for its development is the MuVacAS prototype, which replicates the final segment of the accelerator beamline. Precise regulation of argon gas pressure within its ultra-high vacuum chamber is vital for this task. This work presents a fully data-driven approach for autonomous pressure control. A Deep Learning Surrogate Model, trained on real operational data, emulates the dynamics of the argon injection system. This high-fidelity digital twin then serves as a fast-simulation environment to train a Deep Reinforcement Learning agent. The results demonstrate that the agent successfully learns a control policy that maintains gas pressure within strict operational limits despite dynamic disturbances. This approach marks a significant step toward the intelligent, autonomous control systems required for the demanding next-generation particle accelerator facilities.",
    "authors": [
      "Guillermo Rodriguez-Llorente",
      "Galo Gallardo",
      "Rodrigo Morant Navascués",
      "Nikita Khvatkin Petrovsky",
      "Anderson Sabogal",
      "Roberto Gómez-Espinosa Martín"
    ],
    "published": "2025-12-17T15:19:55Z",
    "updated": "2025-12-17T15:19:55Z",
    "categories": [
      "physics.acc-ph",
      "cs.LG"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.15456v1",
    "url": "https://arxiv.org/abs/2512.15456v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15456v1.pdf",
    "title": "The role of the exchange-Coulomb potential in two-dimensional electron transport",
    "abstract": "We develop a quantum kinetic theory of two-dimensional electron gases in which exchange is treated self-consistently at the Hartree-Fock level and enters as a nonlocal, momentum-dependent field in phase space. By starting from the Coulomb Hamiltonian, we derive a Hartree-Fock-Wigner equation for the electronic Wigner function and obtain a closed fluid model with exchange-corrected pressure, force, and current. For a single layer, we show that exchange renormalizes the Fermi velocity and can drive a long-wavelength plasmonic instability at low densities. In coupled layers, the same framework predicts acoustic-optical mode coupling, and an instability forming long-lived charge-imbalance patterns that are not predicted by classical Vlasov and Boltzmann models. Finally, we apply the kinetic model to the Coulomb drag problem and show how exchange substantially enhances the drag resistivity in dilute GaAs double wells, quantitatively matching experimental observations.",
    "authors": [
      "J. L. Figueiredo",
      "J. T. Mendonça",
      "H. Terças"
    ],
    "published": "2025-12-17T13:56:45Z",
    "updated": "2025-12-17T13:56:45Z",
    "categories": [
      "cond-mat.mes-hall",
      "cond-mat.quant-gas",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.mes-hall"
  },
  {
    "arxiv_id": "2512.15444v1",
    "url": "https://arxiv.org/abs/2512.15444v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15444v1.pdf",
    "title": "A muon scattering tomography system based on high spatial resolution scintillating detector",
    "abstract": "Cosmic ray muon scattering tomography (MST) is an imaging technique that utilizes muon scattering in matter to inspect high-Z materials non-destructively, without requiring an artificial radiation source. This method offers significant potential for applications in border security and long-term monitoring of nuclear materials. In this study, we developed a high-precision plastic-scintillator-based position-sensitive detector with a spatial resolution of 0.09 times the strip pitch. A fully functional, full-scale imaging system was then constructed using four layers of such XY position-sensitive detectors, each with an effective area of 53 cm x 53 cm. This paper details the following key contributions: the Geant4-simulated design and optimization of the imaging system, the fabrication, assembly, and testing of the detectors, and an evaluation of the imaging performance of the completed system.",
    "authors": [
      "Zheng Liang",
      "Zebo Tang",
      "Xin Li",
      "Baiyu Liu",
      "Cheng Li",
      "Jiacheng He",
      "Kun Jiang",
      "Yonggang Wang",
      "Ye Tian",
      "Yishuang Zhang",
      "Zeyu Wang"
    ],
    "published": "2025-12-17T13:41:16Z",
    "updated": "2025-12-17T13:41:16Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.08389v2",
    "url": "https://arxiv.org/abs/2512.08389v2",
    "pdf_url": "https://arxiv.org/pdf/2512.08389v2.pdf",
    "title": "Development & first Performance evaluation of multi-element monolithic HPGe detector for X-ray spectroscopy",
    "abstract": "The first operational prototype of a high-purity Germanium (HPGe) detector developed within the European LEAPS-INNOV project is presented in this work. This prototype features a monolithic, multi-element sensor optimized for high-resolution X-ray spectroscopy in the hard X-ray regime, capable of handling high count rates (20-250 kcps/mm2) across a broad energy range (5-100 keV). We discuss here a complete laboratory-based characterization of the detector's performance, as well as an on-beam evaluation at the BM05 beamline of the ESRF synchrotron facility, using monochromatic X-rays in the 20-50 keV energy range. We provide a detailed performance assessment that also includes a phenomenological defect-depth estimation model.",
    "authors": [
      "N. Goyal",
      "F. J. Iguaz",
      "S. Aplin",
      "A. Balerna",
      "P. Bell",
      "J. Casas",
      "M. Cascella",
      "S. Chatterji",
      "C. Cohen",
      "E. Collet",
      "E. N. Gimenez",
      "H. Graafsma",
      "H. Hirsemann",
      "K. Klementiev",
      "T. Kolodziej",
      "T. Martin",
      "R. H. Menk",
      "C. Menneglier",
      "C. Meraihia",
      "J. R. Murias",
      "M. Porro",
      "M. Quispe",
      "B. Schmitt",
      "S. Scully",
      "M. Turcato",
      "C. Ward",
      "E. Welter"
    ],
    "published": "2025-12-09T09:18:54Z",
    "updated": "2025-12-17T12:52:09Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.15360v1",
    "url": "https://arxiv.org/abs/2512.15360v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15360v1.pdf",
    "title": "First implementation of AXUV-based analysis and macro-instability diagnostics on WHAM",
    "abstract": "Absolute extreme ultraviolet (AXUV) diode arrays are widely used in fusion experiments for time-resolved measurements of plasma radiation. We report the first implementation of an AXUV-based analysis framework on the Wisconsin High-Temperature Superconducting (HTS) Axisymmetric Mirror (WHAM). A single, precisely calibrated 20-channel AXUV assembly measures line-integrated plasma emission with $ 100~\\mathrm{kHz}$ temporal resolution and $\\sim1~\\mathrm{cm}$ spatial accuracy across the mid-plane. The data were processed to obtain plasma's statistical moments, yielding time-resolved measurement of the centroid displacement $Φ(t)$ and effective radius $R(t)$. From the joint covariance of these quantities, we define a macroscopic instability parameter $χ(t)$, that quantifies large-scale plasma motion and profile evolution directly from AXUV observables. The parameter $χ$ serves as a compact indicator of global macroscopic instability, decreasing with increasing end-plate bias and exhibiting strong anti-correlation with diamagnetic flux during confinement transitions. These results demonstrate that a single AXUV array can provide quantitative, real-time assessment of macroscopic plasma instabilities, constituting the first demonstration of such capability in a magnetic mirror plasma. Future extensions to multiple arrays will further enhance spatial coverage and enable full-mode tracking in axisymmetric mirror configurations and related fusion devices.",
    "authors": [
      "K. Shih",
      "D. Endrizzi",
      "D. A. Sutherland",
      "J. Anderson",
      "D. Bindl",
      "E. L. Claveau",
      "C. Everson",
      "J. Eickman",
      "S. J. Frank",
      "E. Marriott",
      "E. Penne",
      "J. Pizzo",
      "T. Qian",
      "J. Viola",
      "C. B. Forest",
      "D. Yakovlev"
    ],
    "published": "2025-12-17T12:06:14Z",
    "updated": "2025-12-17T12:06:14Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.15289v1",
    "url": "https://arxiv.org/abs/2512.15289v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15289v1.pdf",
    "title": "Pixel response characterization of the ARCADIA Fully Depleted MAPS",
    "abstract": "Monolithic Active Pixel Sensors (MAPS) achieved widespread use in several scientific applications, thanks to their properties, such as low material budget and high granularity. The ARCADIA INFN project developed a Fully-Depleted MAPS (FD-MAPS), using a modified LFoundry 110 nm CIS process. This work presents the first laboratory characterization of the ARCADIA MD3 prototype. Measurements include threshold uniformity studies using both test-pulse injection and a $^{55}$Fe source, as well as threshold and noise calibration achieved thanks to monochromatic X-ray sources. Ultimately, charge-collection efficiency is evaluated using an infrared laser setup.",
    "authors": [
      "C. Pantouvakis",
      "M. Rignanese",
      "T. Zenger",
      "S. Ciarlantini",
      "A. Zingaretti",
      "P. Azzi",
      "C. Bonini",
      "D. Chiappara",
      "S. Mattiazzo",
      "D. Pantano",
      "J. Wyss",
      "A. Apresyan",
      "N. Bacchetta",
      "L. Bolla",
      "A. Hayrapetyan",
      "C. Pena",
      "N. Salvador",
      "S. Xie",
      "I. Zoi",
      "D. Falchieri",
      "S. Garbolino",
      "L. Pancheri",
      "A. Paternò",
      "A. Rivetti",
      "M. Rolo",
      "R. Santoro",
      "P. Giubilato"
    ],
    "published": "2025-12-17T10:41:33Z",
    "updated": "2025-12-17T10:41:33Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.15271v1",
    "url": "https://arxiv.org/abs/2512.15271v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15271v1.pdf",
    "title": "MHD Simulation Study on Impurity Assimilation Efficiency and Disruption Dynamics during Shattered Pellet Injection",
    "abstract": "Shattered Pellet Injection (SPI) has become a critical technique for mitigating plasma disruptions in fusion devices, yet optimizing its efficiency demands a proper understanding of the interaction between impurity dynamics and MHD response. We perform 3D nonlinear MHD simulations of SPI-induced disruption in a J-TEXT-like tokamak using the NIMROD code, systematically examining key parameters: fragment velocity and fineness, injection quantity, impurity composition, injection location and multiple injectors, resistivity, and parallel thermal conductivity. We find that slower fragment velocity enhances impurity assimilation and amplifies MHD activity. Finer fragments significantly increase impurity ablation and cooling efficiency. Mixed deuterium-neon pellets effectively elevate electron density without compromising radiative cooling efficiency. Plasma poloidal rotation affects ablation and cooling efficiency, whereas toroidally uniform multi-pellet injection enhances impurity ablation by nearly a factor equal to the number of pellets and lowers radiation asymmetry. Higher plasma parallel thermal conductivity results in higher radiation cooling efficiency in parallel directions, enhances impurity transport, and reduces toroidal peaking factor (TPF) of radiation. Variations in resistivity significantly influence Ohmic heating, impurity deposition and current dynamics after TQ, with higher resistivity leading to stronger magnetic perturbations and more pronounced current spikes. These findings provide physical bases for optimizing SPI schemes in future tokamak devices.",
    "authors": [
      "Jinqiang Mao",
      "Ping Zhu",
      "Shiyong Zeng"
    ],
    "published": "2025-12-17T10:25:25Z",
    "updated": "2025-12-17T10:25:25Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.15264v1",
    "url": "https://arxiv.org/abs/2512.15264v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15264v1.pdf",
    "title": "Channel-Level Calibration Methods of Silicon Photomultiplier for JUNO-TAO Central Detector",
    "abstract": "The Taishan Antineutrino Observatory (TAO or JUNO-TAO) is a satellite observatory for the Jiangmen Underground Neutrino Observatory (JUNO), located 44 meters away from the No.1 reactor of the Taishan Nuclear Power Plant. TAO can measure the reactor antineutrino energy spectrum with excellent energy resolution (better than 2\\% at 1 MeV) using state-of-the-art Silicon Photomultipliers (SiPMs) operated at low temperature. To achieve this goal, the SiPMs (together with their readout electronics) must be well calibrated. This paper presents the channel-level calibration methods for the dark count rate (DCR), relative photon detection efficiency (PDE), time offset, gain, and internal optical crosstalk (IOCT) of the SiPMs based on charge and time information of the collected events. For the calibration of the external optical crosstalk (EOCT), in terms of its rate and emission angle distribution, a novel method is proposed by switching on and off different groups of SiPMs with an LED placed in the detector. Using one million simulated events, the expected calibration biases are evaluated for all the aforementioned parameters: relative PDE (2.1\\%), IOCT (1.4\\%), DCR (0.4\\%), EOCT Rate ($<0.1\\%$), gain ($<0.1\\%$), time offset (0.027 ns). The emission angle distribution of the EOCT photons could be measured with a bias of less than 4\\% in main angular range.",
    "authors": [
      "Jiayang Xu",
      "Yichen Li",
      "Zhan Liang",
      "Guofu Cao",
      "Zelin Chen"
    ],
    "published": "2025-12-17T10:13:18Z",
    "updated": "2025-12-17T10:13:18Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.15239v1",
    "url": "https://arxiv.org/abs/2512.15239v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15239v1.pdf",
    "title": "Magnetised turbulent plasmas as high-energy particle accelerators",
    "abstract": "This proceedings paper reports on the theoretical modelling of particle acceleration in magnetised turbulent plasmas. It briefly reviews some recent findings obtained from fully kinetic numerical simulations of large-amplitude, semi to fully relativistic turbulence. The paper then argues that these findings can be understood within the framework of a ``generalised Fermi'' picture of stochastic acceleration, which it summarises. The dominant contributions to acceleration appear to arise from particle interactions with sharp, dynamic bends of the magnetic field lines and regions of velocity compression. Interestingly, the acceleration rate is spatially inhomogeneous and its probability distribution follows a broken power law extending up to large values. This makes relativistic, large-amplitude turbulence an extreme particle accelerator. Some implications for particle transport and the shape of the particle energy spectrum in the presence of radiative losses and over long timescales are also discussed.",
    "authors": [
      "M. Lemoine"
    ],
    "published": "2025-12-17T09:40:01Z",
    "updated": "2025-12-17T09:40:01Z",
    "categories": [
      "astro-ph.HE",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2512.15230v1",
    "url": "https://arxiv.org/abs/2512.15230v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15230v1.pdf",
    "title": "ColliderML: The First Release of an OpenDataDetector High-Luminosity Physics Benchmark Dataset",
    "abstract": "We introduce ColliderML - a large, open, experiment-agnostic dataset of fully simulated and digitised proton-proton collisions in High-Luminosity Large Hadron Collider conditions ($\\sqrt{s}=14$ TeV, mean pile-up $μ= 200$). ColliderML provides one million events across ten Standard Model and Beyond Standard Model processes, plus extensive single-particle samples, all produced with modern next-to-leading order matrix element calculation and showering, realistic per-event pile-up overlay, a validated OpenDataDetector geometry, and standard reconstructions. The release fills a major gap for machine learning (ML) research on detector-level data, provided on the ML-friendly Hugging Face platform. We present physics coverage and the generation, simulation, digitisation and reconstruction pipeline, describe format and access, and initial collider physics benchmarks.",
    "authors": [
      "Doğa Elitez",
      "Paul Gessinger",
      "Daniel Murnane",
      "Marcus Selchou Raaholt",
      "Andreas Salzburger",
      "Stine Kofoed Skov",
      "Andreas Stefl",
      "Anna Zaborowska"
    ],
    "published": "2025-12-17T09:30:44Z",
    "updated": "2025-12-17T09:30:44Z",
    "categories": [
      "hep-ex",
      "cs.LG",
      "physics.data-an",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2512.09777v2",
    "url": "https://arxiv.org/abs/2512.09777v2",
    "pdf_url": "https://arxiv.org/pdf/2512.09777v2.pdf",
    "title": "Machine Learning Optimization of BEGe Detector Event Selection in the VIP Experiment",
    "abstract": "The VIP collaboration operates a Broad Energy Germanium detector at the Gran Sasso National Laboratory to measure radiation in the few keV to 100 keV range, aiming to search for spontaneous collapse induced radiation and atomic transitions that violate the Pauli Exclusion Principle. Here we present a machine learning based upgrade for the BEGe detector using an event selection strategy aimed at improving the efficiency in detecting low energy events down to 10 keV. The method employs a denoising autoencoder to suppress electronic and microphonic noises and to reconstruct pulse shapes, followed by a convolutional neural network that classifies waveforms as normal single site or events with anomalies. The workflow was validated on a dataset comprising more than 20000 waveforms recorded in 2021. The classifier achieves a receiver operating characteristic curve with an area under the curve of 0.99 and an accuracy of 95 percent. Applying this procedure lowers the minimum detectable energy of the final spectrum to approximately 10 keV. It also yields a measurable enhancement in spectral quality, including an improvement of about 14 percent in the signal to background ratio and a reduction of the energy resolution for the characteristic Pb and Bi gamma lines. These developments enhance the sensitivity of the BEGe detector to rare low energy signals and provide a scalable framework for future precision tests of quantum foundations in low background environments.",
    "authors": [
      "Simone Manti",
      "Jason Yip",
      "Massimiliano Bazzi",
      "Nicola Bortolotti",
      "Mario Bragadireanu",
      "Ivan Carnevali",
      "Alberto Clozza",
      "Luca De Paolis",
      "Raffaele Del Grande",
      "Carlo Guaraldo",
      "Mihai Antoniu Iliescu",
      "Matthias Laubenstein",
      "Johan Marton",
      "Fabrizio Napolitano",
      "Federico Nola",
      "Kristian Pischicchia",
      "Alessio Porcelli",
      "Alessandro Scordo",
      "Francesco Sgaramella",
      "Diana Sirghi",
      "Florin Sirghi",
      "Johann Zmeskal",
      "Catalina Curceanu"
    ],
    "published": "2025-12-10T15:56:35Z",
    "updated": "2025-12-17T09:05:04Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.15172v1",
    "url": "https://arxiv.org/abs/2512.15172v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15172v1.pdf",
    "title": "Characterising injection signatures in Jupiter's ultraviolet aurora using Juno observations",
    "abstract": "Discrete features in Jupiter's ultraviolet aurora have been interpreted as signatures of plasma injections in the middle magnetosphere. There exists some ambiguity whether magnetodisc scattering or high-latitude Alfvenic acceleration best describes the observed properties of these injection signatures, and also to what extent arcs in the outer emission are related to injections. Many injection signatures are the result of the evolution of dawn storms; there is, however, limited evidence that non-dawn-storm injection signatures are sometimes present in the aurora. We use automatic detection of these discrete features, alongside data from Juno-UVS and in-situ measurements by other Juno instruments, to show that scattering likely accounts for most of the electron precipitation associated with injection signatures. Additionally, there is evidence that injection signatures can be classified into two types: dawn-storm and non-dawn-storm. Arc-like features in the outer emission show very similar properties to traditional blob-like injection signatures and may consist of sequences of injection signatures that have broadened into an arc via energy-dependent electron drift.",
    "authors": [
      "Linus Head",
      "Denis Grodent",
      "Bertrand Bonfond",
      "Alessandro Moirano",
      "Guillaume Sicorello",
      "Julie Vinesse",
      "Alyssa Mouton",
      "Maïté Dumont",
      "Thomas Greathouse",
      "Vincent Hue",
      "Ali Sulaiman",
      "Barry Mauk",
      "Zhonghua Yao",
      "Ruilong Guo",
      "Jinyan Zhao"
    ],
    "published": "2025-12-17T08:09:04Z",
    "updated": "2025-12-17T08:09:04Z",
    "categories": [
      "astro-ph.EP",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.EP"
  },
  {
    "arxiv_id": "2512.15159v1",
    "url": "https://arxiv.org/abs/2512.15159v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15159v1.pdf",
    "title": "Discussion on the vanishment of solar atmospheric structures during magnetic reconnection",
    "abstract": "In solar atmosphere, magnetic reconnection alters the topological connectivity, and magnetic energy is released. However, the length change of the reconnecting structures has rarely been reported. To identify the evolution of the topological structures, we search for reconnection events which should satisfy 3 criteria. (1) Each event displays an explicit X-type configuration, and the configuration consists of two sets of independent atmospheric structures, (2) the reconnection process is clearly observed, and (3) the topological connectivity of the structures can be tracked from at least 5 minutes prior to the occurrence of magnetic reconnection to 5 minutes after the reconnection. In this work, 3 events are selected and studied. During the reconnection moment, the total length of the two topological structures in each event shortens suddenly, and the decrements for events 1--3 are 47 Mm, 3.7 Mm, and 8.2 Mm, respectively, implying that partial structures vanish observationally during magnetic reconnection process. Several possibilities about the vanishment, e.g. the shrinkage of the reconnecting structures due to magnetic tension, the bizarre change in the third dimension, and magnetic field annihilation, have been discussed.",
    "authors": [
      "Jun Zhang",
      "Tao Ding",
      "Yulei Wang"
    ],
    "published": "2025-12-17T07:50:03Z",
    "updated": "2025-12-17T07:50:03Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2512.14033v2",
    "url": "https://arxiv.org/abs/2512.14033v2",
    "pdf_url": "https://arxiv.org/pdf/2512.14033v2.pdf",
    "title": "Liquid Handling of the JUNO Experiment",
    "abstract": "The Filling, Overflow, and Circulation (FOC) system is a critical subsystem of the Jiangmen Underground Neutrino Observatory (JUNO), responsible for the safe handling of the Liquid Scintillator (LS) and water throughout the detector's commissioning and operational lifetime. This paper details the design and operation of the FOC system, which accomplished the filling of the world's largest LS detector--taking 45 days for water (6.4*10^4 m^3) and 200 days for LS (2.3*10^4 m^3). Throughout water filling, the liquid level difference between the Central Detector and Water Pool was rigorously maintained within safety limits. During LS filling, level control achieved +/-2 cm precision with flow regulation within +/-0.5% of setpoints. An automated control system based on Programmable Logic Controllers and the Experimental Physics and Industrial Control System framework ensured reliable operation. The system preserved LS radiopurity, maintaining 222Rn below 1 mBq/m^3 during filling and achieving 238U/232Th concentrations below 10^-16 g/g. The successful commissioning and operation of the FOC system have established it as an indispensable foundation for the stable long-term operation of the JUNO detector.",
    "authors": [
      "Jiajun Li",
      "Yuekun Heng",
      "Jiajie Ling",
      "Zhi Wu",
      "Xiao Tang",
      "Cong Guo",
      "Jinchang Liu",
      "Xiaolan Luo",
      "Xiao Cai",
      "Chengfeng Yang",
      "Xiaoyan Ma",
      "Xiaohui Qian",
      "Tao Huang",
      "Bi Wu",
      "Pengfei Yang",
      "Shiqi Zhang",
      "Baobiao Yue",
      "Shuaijie Li",
      "Lei Yang",
      "Mei Ye",
      "Shenghui Liu"
    ],
    "published": "2025-12-16T02:57:17Z",
    "updated": "2025-12-17T07:35:23Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.13692v2",
    "url": "https://arxiv.org/abs/2507.13692v2",
    "pdf_url": "https://arxiv.org/pdf/2507.13692v2.pdf",
    "title": "Energy exchange between electrons and ions driven by ITG-TEM turbulence",
    "abstract": "In this study, the energy exchange between electrons and ions in ITG TEM turbulence is investigated using gyrokinetic simulations. The energy exchange in TEM turbulence is primarily composed of the cooling of electrons associated with perpendicular drift and the heating of ions moving parallel to magnetic field lines. TEM turbulence facilitates energy transfer from electrons to ions, which is opposite to the direction observed in ITG turbulence. In mixed ITG TEM turbulence, the relative magnitudes of parallel heating and perpendicular cooling for each species determine the overall direction and magnitude of energy exchange. From the viewpoint of entropy balance, it is further confirmed that energy flows from the species with larger entropy production, caused by particle and heat fluxes, to the other species in ITG TEM turbulence. The predictability of turbulent energy exchange in ITG-TEM turbulence by the quasilinear model is examined. In addition, an alternative method based on the correlation between energy flux and energy exchange is developed, and its validity is demonstrated.",
    "authors": [
      "T. Kato",
      "H. Sugama",
      "T. -H. Watanabe"
    ],
    "published": "2025-07-18T06:48:19Z",
    "updated": "2025-12-17T07:08:48Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.15025v1",
    "url": "https://arxiv.org/abs/2512.15025v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15025v1.pdf",
    "title": "Effects of Unequal Electron-Ion Plasma Beta on Pressure-Strain Interaction in Turbulent Plasmas",
    "abstract": "A common occurrence in weakly collisional space plasmas is the unequal electron-ion temperatures. The pressure-strain interaction provides a mechanism-agnostic pathway for increasing plasma internal energy through spatiotemporally local isotropic compression and volume preserving deformation, yet its behavior under thermal disequilibrium is largely unexplored. We investigate this using five fully kinetic two-dimensional particle-in-cell simulations of undriven decaying turbulence by varying the initial electron-to-ion temperature ratio. By analyzing the species' internal energy density alongside a decomposition of the pressure-strain term, with a focus on the volume-preserving deformation that contains normal and shear contributions, we quantify how the initial temperature imbalance modifies the channels through which turbulence increases each species' internal energy density. The cumulative pressure-strain interaction tracks the change in internal energy for both electrons and ions, with the total deformation channel of energy conversion dominating. We discover that local changes to electron internal energy density are governed primarily by the shear deformation power density, concentrated in electron-scale current sheets, while the ion shear and normal deformation components cancel, yielding a much smaller net deformation power density that peaks around, rather than within, those electron-scale current structures. We find that the amplitudes and localization of deformation change, but preserve these qualitative trends. Together, these results show how thermal disequilibrium could shape species-dependent turbulent \"heating rate\", measured via pressure-strain interaction and approximated via only its shear deformation part, and provide a framework for interpreting energy evolution and conversion in space plasmas where unequal species temperature is the norm.",
    "authors": [
      "M. Hasan Barbhuiya",
      "Subash Adhikari"
    ],
    "published": "2025-12-17T02:30:12Z",
    "updated": "2025-12-17T02:30:12Z",
    "categories": [
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.15022v1",
    "url": "https://arxiv.org/abs/2512.15022v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15022v1.pdf",
    "title": "Machine learning-based prediction of magnet errors in storage ring light sources",
    "abstract": "Magnet errors in storage rings significantly degrade beam performance, impacting the brightness and stability of the light source. Therefore, beam-based correction is crucial for the safe operation of machines and the stability of radiated photons. Unlike traditional correction methods such as linear optics from closed orbit, this paper proposes a machine learning (ML) framework to directly predict quadrupole/sextupole gradient errors and misalignment from beam position monitor-measured optics functions and closed-orbit distortion data. Based on a four-bend achromat storage ring lattice, we generate training datasets through ELEGANT numerical simulations and compare regression performance of Linear Regression, Support Vector Machine, Radial Basis Function Neural Network and Densely Connected Convolutional Network. Results demonstrate that ML models can effectively predict magnet errors and reconstruct ideal optics. This approach offers a novel strategy for accelerating storage ring commissioning and optimization, online diagnostics, and dynamic compensation for next-generation diffraction-limited rings.",
    "authors": [
      "Jianhao Xu"
    ],
    "published": "2025-12-17T02:21:45Z",
    "updated": "2025-12-17T02:21:45Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.15014v1",
    "url": "https://arxiv.org/abs/2512.15014v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15014v1.pdf",
    "title": "X-ray detected ferromagnetic resonance spectrometer with an out-of-vacuum photodetector",
    "abstract": "X-ray detected ferromagnetic resonance (XFMR) spectroscopy is an experimental technique for element-specific spin dynamics in the GHz regime and has been utilized to study spintronic materials. The XFMR signal is usually obtained by detecting X-ray excited optical luminescence (XEOL) emitted from a sample substrate. Here, we report the development of an XFMR spectrometer that is designed to place a photodetector for XEOL detection outside an ultra-high-vacuum chamber. This configuration allows for the easy replacement of detectors, such as photodiodes, CCD cameras, and spectrometers, depending on the experimental requirements. We demonstrated the measurement of XEOL spectra from MgO using a visible light spectrometer as well as the detection of XFMR signals originating from the spin precession of a permalloy (Ni80Fe20) thin film using a photodiode detector. The XFMR spectrometer with an out-of-vacuum photodetector expands possibilities for advanced measurements such as XFMR microscopy.",
    "authors": [
      "Tetsuro Ueno",
      "Yasuo Takeichi",
      "Masaki Mizuguchi",
      "Hideaki Iwasawa",
      "Yoshiyuki Ohtsubo",
      "Kanta Ono",
      "Hiroyuki Okazaki",
      "Songtian Li",
      "Seiji Sakai",
      "Tetsuya Yamaki",
      "Tetsu Watanuki",
      "Yoshinori Katayama",
      "Chiharu Mitsumata"
    ],
    "published": "2025-12-17T02:09:52Z",
    "updated": "2025-12-17T02:09:52Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  }
]