{
  "arxiv_id": "2601.15971v1",
  "url": "https://arxiv.org/abs/2601.15971v1",
  "pdf_url": "https://arxiv.org/pdf/2601.15971v1.pdf",
  "title": "Reaching the intrinsic performance limits of superconducting strip photon detectors up to 0.1 mm wide",
  "abstract": "Superconducting nanowire single-photon detectors (SNSPDs) have emerged as the highest performing photon-counting detectors, making them a critical technology in quantum photonics and photon-starved optical sensing. However, the performance of SNSPDs is limited not by the intrinsic properties of the superconducting film, but by edge-induced current crowding. Despite extensive materials optimization and increasingly demanding fabrication strategies aimed at mitigating this edge-limited behavior, the device edges continue to limit the maximum device operating current, thereby degrading key performance metrics. Here, we demonstrate for the first time in situ tuning of a detector from an edge-limited to a bulk-limited regime, allowing the device to reach its intrinsic performance limit. Our approach is based on current-biased superconducting \"rails\" placed on either side of the detector to suppress current crowding at the edges. We show that activation of the rails reduces the dark count rate by nine orders of magnitude and extends the photon detection plateau at 1550 nm by more than 40%. These results are demonstrated on detectors up to 0.1 mm wide, establishing an entirely new class of ultra-wide strip detectors that we call superconducting strip photon detectors (SSPD). Moreover, the ability to suppress edge current crowding using the rails provides a pathway toward SSPDs with strip widths extending into the mm-scale. Such devices will enable large-area, high efficiency SSPD arrays with infrared sensitivity and open new opportunities in applications ranging from biomedical imaging to deep space optical communication.",
  "authors": [
    "Kristen M. Parzuchowski",
    "Eli Mueller",
    "Bakhrom G. Oripov",
    "Benedikt Hampel",
    "Ravin A. Chowdhury",
    "Sahil R. Patel",
    "Daniel Kuznesof",
    "Emma K. Batson",
    "Ryan Morgenstern",
    "Robert H. Hadfield",
    "Varun B. Verma",
    "Matthew D. Shaw",
    "Jason P. Allmaras",
    "Martin J. Stevens",
    "Alex Gurevich",
    "Adam N. McCaughan"
  ],
  "published": "2026-01-22T13:51:49Z",
  "updated": "2026-01-22T13:51:49Z",
  "categories": [
    "cond-mat.supr-con",
    "physics.app-ph",
    "physics.ins-det",
    "physics.optics",
    "quant-ph"
  ],
  "primary_category": "cond-mat.supr-con"
}