{
  "arxiv_id": "2503.14670v3",
  "url": "https://arxiv.org/abs/2503.14670v3",
  "pdf_url": "https://arxiv.org/pdf/2503.14670v3.pdf",
  "title": "Enhanced UV Detection in GaN-Based Photodetectors through InN/AlN   Heterostructure Integration and Doping-Engineered PIN Architecture",
  "abstract": "This study presents a comprehensive simulation-based optimization of gallium nitride (GaN)-based metal-semiconductor-metal (MSM) photodetectors designed for ultraviolet (UV) applications. The proposed device architecture incorporates a novel indium nitride/gallium nitride/aluminum nitride (InN/GaN/AlN) heterostructure integrated on a sapphire substrate, combined with refined doping strategies and interdigitated electrode geometry. By systematically analyzing the effects of mesa layer thickness, buffer layers, substrate type, and doping concentrations, we demonstrate significant enhancements in photocurrent generation, photoabsorption rate, and spectral responsivity. Notably, replacing the conventional sapphire substrate with silicon carbide (SiC) and introducing low-level p-type and n-type (p-n) doping into the GaN region enables p-i-n diode-like behavior, contributing to reduced dark current and improved UV selectivity. Building upon these structural enhancements, the final geometric optimization of the nickel/gold (Ni/Au) electrode fingers led to an approximately eight-fold increase in photocurrent compared to the initial design, representing the most significant contribution to the improvement in absorption efficiency. These findings offer an effective route for designing next-generation MSM photodetectors with improved sensitivity, noise performance, and thermal compatibility, suitable for high-performance ultraviolet detection applications.",
  "authors": [
    "M. Kilin",
    "O. Tanriverdi",
    "B. Karahan",
    "F. Yasar"
  ],
  "published": "2025-03-18T19:23:20Z",
  "updated": "2025-08-09T08:32:32Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}