{
  "arxiv_id": "2504.16177v2",
  "url": "https://arxiv.org/abs/2504.16177v2",
  "pdf_url": "https://arxiv.org/pdf/2504.16177v2.pdf",
  "title": "Turbulent heating in collisionless low-beta plasmas: imbalance, Landau   damping, and electron-ion energy partition",
  "abstract": "An understanding of how turbulent energy is partitioned between ions and electrons in weakly collisional plasmas is crucial for modelling many astrophysical systems. Using theory and simulations of a four-dimensional reduced model of low-beta gyrokinetics (the `Kinetic Reduced Electron Heating Model'), we investigate the dependence of collisionless heating processes on plasma beta and imbalance (normalised cross-helicity). These parameters are important because they control the helicity barrier, the formation of which divides the parameter space into two distinct regimes with remarkably different properties. In the first, at lower beta and/or imbalance, the absence of a helicity barrier allows the cascade of injected power to proceed to small (perpendicular) scales, but its slow cascade rate makes it susceptible to significant electron Landau damping, in some cases leading to a marked steepening of the magnetic spectra on scales above the ion Larmor radius. In the second, at higher beta and/or imbalance, the helicity barrier halts the cascade, confining electron Landau damping to scales above the steep `transition-range' spectral break, resulting in dominant ion heating. We formulate quantitative models of these processes that compare well to simulations in each regime, and combine them with results of previous studies to construct a simple formula for the electron-ion heating ratio as a function of beta and imbalance. This model predicts a `winner takes all' picture of low-beta plasma heating, where a small change in the fluctuations' properties at large scales (the imbalance) can cause a sudden switch between electron and ion heating.",
  "authors": [
    "T. Adkins",
    "R. Meyrand",
    "J. Squire"
  ],
  "published": "2025-04-22T18:06:20Z",
  "updated": "2025-08-12T13:17:24Z",
  "categories": [
    "physics.plasm-ph",
    "astro-ph.SR"
  ],
  "primary_category": "physics.plasm-ph"
}