{
  "arxiv_id": "2507.04483v2",
  "url": "https://arxiv.org/abs/2507.04483v2",
  "pdf_url": "https://arxiv.org/pdf/2507.04483v2.pdf",
  "title": "Analytical and Numerical Studies of Dark Current in Radiofrequency   Structures for Short-Pulse High-Gradient Acceleration",
  "abstract": "High-gradient acceleration is a key research area that could enable compact linear accelerators for future colliders, light sources, and other applications. In the pursuit of high-gradient operation, RF breakdown limits the attainable accelerating gradient in normal-conducting RF structures. Recent experiments at the Argonne Wakefield Accelerator suggest a promising approach: using short RF pulses with durations of a few nanoseconds. Experimental studies show that these O(1 ns) RF pulses can mitigate breakdown limitations, resulting in higher gradients. For example, an electric field of nearly 400 MV/m was achieved in an X-band photoemission gun driven by 6-ns-long RF pulses, with rapid RF conditioning and low dark current observed. Despite these promising results, the short-pulse regime remains an under-explored parameter space, and RF breakdown physics under nanosecond-long pulses requires further investigation. In this paper, we present analytical and numerical simulations of dark current dynamics in accelerating cavities operating in the short-pulse regime. We study breakdown-associated processes spanning different time scales, including field emission, multipacting, and plasma formation, using simulations of the X-band photogun cavities. The results reveal the advantages of using short RF pulses to reduce dark current and mitigate RF breakdown, offering a path toward a new class of compact accelerators with enhanced performance and reduced susceptibility to breakdown.",
  "authors": [
    "Gaurab Rijal",
    "Michael Shapiro",
    "Xueying Lu"
  ],
  "published": "2025-07-06T17:44:35Z",
  "updated": "2025-08-10T01:37:29Z",
  "categories": [
    "physics.acc-ph"
  ],
  "primary_category": "physics.acc-ph"
}