{
  "arxiv_id": "2406.14234v2",
  "url": "https://arxiv.org/abs/2406.14234v2",
  "pdf_url": "https://arxiv.org/pdf/2406.14234v2.pdf",
  "title": "Feed-forward active magnetic shielding",
  "abstract": "Magnetic fields from the brain are tiny relative to ambient fields which therefore need to be suppressed. The common solution of passive shielding is expensive, bulky and insufficiently effective, thus motivating research into the alternative of active shielding which comes in two flavours: feed-back and feed-forward. In feed-back designs (the most common), corrective fields are created by coils driven from sensors within the area that they correct, for example from the main sensors of an MEG device. In feed-forward designs (less common), corrective fields are driven from dedicated reference sensors outside the area they correct. Feed-forward can achieve better performance than feed-back, in principle, however its implementation is hobbled by an unavoidable coupling between coils and reference sensors, which reduces the effectiveness of the shielding and may affect stability, complicating the design. This paper suggests a solution that relies on a ``decoupling matrix,\" inserted in the signal pathway between sensors and corrective coils, to counteract the spurious coupling. This allows feed-forward shielding do reduce the ambient field to zero across the full frequency range, in principle, although performance may be limited by other factors such as current noise. The solution, which is fully data-driven and does not require geometric calculations, high-tolerance fabrication, or physical calibration, has been evaluated by simulation, but not implemented in hardware. It might contribute to the deployment of a new generation of measurement systems based on optically-pumped magnetometers (OPM). The lower cost and reduced constraints of those systems are a strong incentive to likewise reduce the cost and constraints of the shielding required to operate them, hence the appeal of active shielding.",
  "authors": [
    "Alain de Cheveigné"
  ],
  "published": "2024-06-20T11:57:11Z",
  "updated": "2025-10-24T08:17:43Z",
  "categories": [
    "physics.med-ph",
    "cs.HC",
    "eess.SP",
    "physics.ins-det",
    "q-bio.NC"
  ],
  "primary_category": "physics.med-ph"
}