{
  "arxiv_id": "2504.19236v2",
  "url": "https://arxiv.org/abs/2504.19236v2",
  "pdf_url": "https://arxiv.org/pdf/2504.19236v2.pdf",
  "title": "Neutron source-based event reconstruction algorithm in large liquid   scintillator detectors",
  "abstract": "We developed an event reconstruction algorithm, applicable to large liquid scintillator detectors, built primarily upon neutron calibration data. We employ a likelihood method using photon detection time and charge information from individual photomultiplier tubes. Detector response tables in the likelihood function were derived from americium-carbon neutron source events, 2.2~MeV $\\gamma$-ray events from cosmic-ray muon spallation neutrons, and laser calibration events. This algorithm can reconstruct the event position, energy, and also has capability to differentiate particle types for events within the energy range of reactor neutrinos. Using the detector simulation of the Jiangmen Underground Neutrino Observatory (JUNO) experiment as a large liquid scintillator detector example, we demonstrate that the presented reconstruction algorithm has a reconstructed position accuracy within $\\pm$4~cm, and a reconstructed energy non-uniformity under 0.5\\% throughout the central detector volume. The vertex resolution for positron events at 1~MeV is estimated to be around 9~cm, and the energy resolution is confirmed to be comparable to that in the JUNO official publication. Furthermore, the algorithm can eliminate 80\\% (45\\%) of $\\alpha$-particle (fast-neutron) events while maintaining a positron event selection efficiency of approximately 99\\%.",
  "authors": [
    "Akira Takenaka",
    "Zhangming Chen",
    "Arran Freegard",
    "Junting Huang",
    "Jiaqi Hui",
    "Haojing Lai",
    "Rui Li",
    "Yilin Liao",
    "Jianglai Liu",
    "Yue Meng",
    "Iwan Morton-Blake",
    "Ziqian Xiang",
    "Ping Zhang"
  ],
  "published": "2025-04-27T13:39:02Z",
  "updated": "2025-10-24T07:11:39Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.1140/epjc/s10052-025-14808-4"
}