{
  "arxiv_id": "2509.23172v2",
  "url": "https://arxiv.org/abs/2509.23172v2",
  "pdf_url": "https://arxiv.org/pdf/2509.23172v2.pdf",
  "title": "CHRONOS: Cryogenic sub-Hz cROss torsion bar detector with quantum   NOn-demolition Speed meter",
  "abstract": "We propose a next-generation ground-based gravitational-wave detector, the Cryogenic sub-Hz cROss torsion-bar detector with quantum NOn-demolition Speed meter (CHRONOS), optimized for the unexplored 0.1-10Hz band bridging the gap between the space-based LISA and future ground-based detectors such as Cosmic Explorer and the Einstein Telescope. CHRONOS combines a ring-cavity Sagnac interferometer with torsion-bar test masses to realize the first quantum nondemolition (QND) measurement of angular momentum in a macroscopic system. By implementing a speed-meter readout in the rotational degree of freedom, CHRONOS coherently cancels quantum radiation-pressure noise and enables sub-Hz observations. We show that detuned power recycling and cavity-length optimization can simultaneously relax technical requirements on both torsion bars and speed meters. Assuming a realistic optical design with a 1m torsion bar, we estimate strain sensitivities of $h \\simeq 1 \\times 10^{-18}\\mathrm{Hz}^{-1/2}$ at 1Hz for detectors with arm lengths of 2.5m, 40m, and 300m. These sensitivities enable (i) direct detection of intermediate-mass black hole binaries up to 380Mpc with ${\\rm SNR}=3$, (ii) probing stochastic gravitational-wave backgrounds down to $\\Omega_{\\rm GW} \\sim 3.2 \\times 10^{-9}$ at 0.2Hz with 5yr accumulation. Furthermore, CHRONOS enables prompt detection of gravity-gradient signals from magnitude-5.5 earthquakes even with a 2.5m prototype. CHRONOS thus opens new opportunities for quantum-limited geophysical observation and multi-band, multi-messenger gravitational-wave astronomy.",
  "authors": [
    "Yuki Inoue",
    "Hsiang-Chieh Hsu",
    "Hsiang-Yu Huang",
    "M. Afif Ismail",
    "Vivek Kumar",
    "Miftahul Ma'arif",
    "Avani Patel",
    "Daiki Tanabe",
    "Henry Tsz-King Wong",
    "Ta-Chun Yu"
  ],
  "published": "2025-09-27T08:04:34Z",
  "updated": "2025-10-25T13:47:30Z",
  "categories": [
    "astro-ph.IM",
    "gr-qc",
    "physics.ins-det"
  ],
  "primary_category": "astro-ph.IM"
}