{
  "arxiv_id": "2510.21261v1",
  "url": "https://arxiv.org/abs/2510.21261v1",
  "pdf_url": "https://arxiv.org/pdf/2510.21261v1.pdf",
  "title": "Benchmark for two-dimensional large scale coherent structures in   partially magnetized ExB plasmas -- Community collaboration & lessons learned",
  "abstract": "Low-temperature plasmas are essential to both fundamental scientific research and critical industrial applications. As in many areas of science, numerical simulations have become a vital tool for uncovering new physical phenomena and guiding technological development. Code benchmarking remains crucial for verifying implementations and evaluating performance. This work continues the Landmark benchmark initiative, a series specifically designed to support the verification of low-temperature plasma codes. In this study, seventeen simulation codes from a collaborative community of nineteen international institutions modeled a partially magnetized ExB Penning discharge. The emergence of large scale coherent structures, or rotating plasma spokes, endows this configuration with an enormous range of time scales, making it particularly challenging to simulate. The codes showed excellent agreement on the rotation frequency of the spoke as well as key plasma properties, including time-averaged ion density, plasma potential, and electron temperature profiles. Achieving this level of agreement came with challenges, and we share lessons learned on how to conduct future benchmarking campaigns. Comparing code implementations, computational hardware, and simulation runtimes also revealed interesting trends, which are summarized with the aim of guiding future plasma simulation software development.",
  "authors": [
    "Andrew T. Powis",
    "Eduardo Ahedo",
    "Alejandro Álvarez Laguna",
    "Nicolas Barléon",
    "Enrique Bello-Benítez",
    "Lucas Beving",
    "Jean-Pierre Boeuf",
    "Guillaume Bogopolsky",
    "Anne Bourdon",
    "Filippo Cichocki",
    "Bénédicte Cuenot",
    "Andrew Denig",
    "Zoltán Donkó",
    "Paul-Quentin Elias",
    "Miguel P. Encinar",
    "Denis Eremin",
    "Pablo Fajardo",
    "Farbod Faraji",
    "Gwenael Fubiani",
    "Laurent Garrigues",
    "Kentaro Hara",
    "Peter Hartmann",
    "Matthew Hopkins",
    "Igor D. Kaganovich",
    "Aaron Knoll",
    "Giovanni Lapenta",
    "Thierry E. Magin",
    "Alberto Marín-Cebrián",
    "Mario Merino",
    "Pierpaolo Minelli",
    "Mina Papahn Zadeh",
    "Pietro Parodi",
    "Federico Petronio",
    "Maryam Reza",
    "Andrei I. Smolyakov",
    "Dmytro Sydorenko",
    "Francesco Taccogna",
    "Miles M. Turner",
    "Olivier Vermorel",
    "Willca Villafana",
    "Liang Xu"
  ],
  "published": "2025-10-24T08:47:57Z",
  "updated": "2025-10-24T08:47:57Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}