{
  "arxiv_id": "2510.21187v1",
  "url": "https://arxiv.org/abs/2510.21187v1",
  "pdf_url": "https://arxiv.org/pdf/2510.21187v1.pdf",
  "title": "Dissipation and particle acceleration at intermittent structures with   velocity and magnetic shear: Interaction of Kelvin-Helmholtz and Drift-Kink   instabilities",
  "abstract": "We present two-dimensional (2D) particle-in-cell simulations of a magnetized, collisionless, relativistic pair plasma subjected to combined velocity and magnetic-field shear, a scenario typical at intermittent structures in plasma turbulence. We create conditions where only the Kelvin-Helmholtz (KH) and Drift-Kink (DK) instabilities can develop, while tearing modes are forbidden. The interaction of DKI and KHI generates qualitatively new structures, marked by a thickened shear layer with very weak electromagnetic field, modulated by KH vortices. Over a range of moderately strong velocity shears explored, the interaction of DKI and KHI results in a significant enhancement of dissipation over cases with only velocity shear or only magnetic shear. Moreover, we observe a new and efficient way of particle acceleration where particles are stochastically accelerated by the motional electric field exterior to the shear layer as they meander in an S-shaped pattern in and out of it. This process takes advantage of the bent geometry of the shear layer caused by the DK-KHI interaction and is responsible for most of the highest-energy particles produced in our simulations. These results further our understanding of dissipation and particle acceleration at intermittent structures, which are present in plasma turbulence across a wide range of astrophysical contexts such as in AGN jet sheaths, potentially relevant to limb-brightened emission, etc., and highlight the sensitivity of dissipation to multiple interacting instabilities, thus providing a strong motivation for further studies of their nonlinear interaction at the kinetic level.",
  "authors": [
    "Tsun Hin Navin Tsung",
    "Gregory R. Werner",
    "Dmitri A. Uzdensky",
    "Mitchell C. Begelman"
  ],
  "published": "2025-10-24T06:32:30Z",
  "updated": "2025-10-24T06:32:30Z",
  "categories": [
    "astro-ph.HE",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.HE"
}