{
  "arxiv_id": "2510.22061v1",
  "url": "https://arxiv.org/abs/2510.22061v1",
  "pdf_url": "https://arxiv.org/pdf/2510.22061v1.pdf",
  "title": "Quasi-Biennial Oscillations and Rieger-type Periodicities in a   Babcock-Leighton Solar Dynamo",
  "abstract": "The Sun's magnetic field shows the 11-year solar cycle and shorter periodicities, popularly known as the quasi-biennial oscillations (QBOs) and Rieger-type periods, or ``season of the Sun.\" Although several theories have been proposed to explain the origin of QBOs and Rieger-type periods, no single theory has widespread acceptance. We explore whether the \\bl\\ dynamo can produce Rieger-type periodicity and QBOs and investigate their underlying physical mechanisms. We use the observationally guided three-dimensional kinematic \\bl\\ dynamo model, which has emerged as a successful model for reproducing many characteristic features of the solar cycle. We use Morlet wavelet and global wavelet power spectrum techniques to analyze the data obtained from the model. In our model, we report QBOs and Rieger-type periods for the first time. Further, we investigate the individual \\bl\\ parameters (fluctuations in flux, latitude, time delay and tilt scatter) role in the occurrence of QBOs and Rieger-type periods. We find that while fluctuations in the individual parameters of the \\bl\\ process can produce QBOs and Rieger-type periodicity, their occurrence probability is enhanced when we consider combined fluctuations of all parameters in the \\bl\\ process. Finally, we find that with the increase of dynamo supercriticality, the model tends to suppress the generation of Rieger-type periodicity. Thus, this result supports earlier studies that suggest the solar dynamo is not highly supercritical.",
  "authors": [
    "Pawan Kumar",
    "Belur Ravindra",
    "Partha Chowdhury",
    "Bidya Binay Karak"
  ],
  "published": "2025-10-24T22:52:03Z",
  "updated": "2025-10-24T22:52:03Z",
  "categories": [
    "astro-ph.SR",
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.SR"
}