[
  {
    "arxiv_id": "2510.21239v2",
    "url": "https://arxiv.org/abs/2510.21239v2",
    "pdf_url": "https://arxiv.org/pdf/2510.21239v2.pdf",
    "title": "Laboratory formation of scaled astrophysical outflows",
    "abstract": "Astrophysical systems exhibit a rich diversity of outflow morphologies, yet their mechanisms and existence conditions remain among the most persistent puzzles in the field. Here we present scaled laboratory experiments based on laser-driven plasma outflow into magnetized ambient gas, which mimic five basic astrophysical outflows regulated by interstellar medium, namely collimated jets, blocked jets, elliptical bubbles, as well as spherical winds and bubbles. Their morphologies and existence conditions are found to be uniquely determined by the external Alfvenic and sonic Mach numbers Me-a and Me-s, i.e. the relative strengths of the outflow ram pressure against the magnetic/thermal pressures in the interstellar medium, with transitions occurring at Me-a ~ 2 and 0.5, as well as Me-s ~ 1. These results are confirmed by magnetohydrodynamics simulations and should also be verifiable from existing and future astronomical observations. Our findings provide a quantitative framework for understanding astrophysical outflows.",
    "authors": [
      "Shun-yi Yang",
      "Tao Tao",
      "Guang-yue Hu",
      "Chao Xiong",
      "Tian-yi Li",
      "Xue-cheng Li",
      "Hui-bo Tang",
      "Shuo-ting Shao",
      "Xiang Lv",
      "Chen Zhang",
      "Ming-yang Yu"
    ],
    "published": "2025-10-24T08:20:07Z",
    "updated": "2025-10-28T03:46:55Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.21036v2",
    "url": "https://arxiv.org/abs/2510.21036v2",
    "pdf_url": "https://arxiv.org/pdf/2510.21036v2.pdf",
    "title": "LLRF System Analysis for the Fermilab PIP-II Superconducting LINAC",
    "abstract": "PIP-II is a superconducting linac that is in the initial acceleration chain for the Fermilab accelerator complex. The RF system consists of a warm front-end with an RFQ and buncher cavities along with 25 superconducting cryo-modules comprised of cavities with five different acceleration \\(\\beta\\). The LLRF system for the linac has to provide field and resonance control for a total of 125 RF cavities. Various components of the LLRF system have been tested with and without beam at the PIP-II test stands. The LLRF system design is derived from the LCLS-II project with its self-excited loop architecture used in the majority of the cryo-modules. The PIP-II beam loading at 2 mA is much higher than the LCLS-II linac. The control system architecture is analyzed and evaluated for the operational limits of feedback gains and their ability to meet the project regulation requirements for cavity field amplitude and phase regulation.",
    "authors": [
      "P. Varghese",
      "S. Raman",
      "M. Guran",
      "L. Reyes",
      "L. Doolittle",
      "Q. Du",
      "S. Murthy"
    ],
    "published": "2025-10-23T22:40:26Z",
    "updated": "2025-10-27T22:26:35Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.23562v1",
    "url": "https://arxiv.org/abs/2510.23562v1",
    "pdf_url": "https://arxiv.org/pdf/2510.23562v1.pdf",
    "title": "Design of Backscatter Tailored Optical Fibers for distributed magnetic   field sensing using Fiber Optic Pulsed Polarimetry",
    "abstract": "Fiber optic pulsed polarimetry is a LIDAR-like fiber sensing technique that uses a backscatter enhanced single mode backscatter-tailored optical fiber(BTOF) to measure the distributed B fields on all Magnetic Fusion Energy devices. The BTOF has a series of wavelength resonant reflection fiber Bragg gratings written uniformly along its length. The fiber's Verdet constant determines the strength of the Faraday effect which effectuates the measurement of local B along the fiber placed intimately next to or within a magnetized plasma volume. A robust measurement of the field distribution along the fiber is obtained at high rep rates, 5 MHz, high spatial resolution(1-10cm), high B field accuracy(<1%) and temporal response (ns). Multipathing in the BTOF produces 3rd order reflections that contaminate the LIDAR signal. Algorithms are given for calculating the level of contamination for uniform and flat reflection designs, in particular and any reflection series in general. The contamination is bracketed giving confidence in designing and implementing a BTOF. Applications include magnetic fusion devices, rail guns, high temperature superconducting magnets and magnetized target fusion research.",
    "authors": [
      "Roger J Smith"
    ],
    "published": "2025-10-27T17:33:05Z",
    "updated": "2025-10-27T17:33:05Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.23417v1",
    "url": "https://arxiv.org/abs/2510.23417v1",
    "pdf_url": "https://arxiv.org/pdf/2510.23417v1.pdf",
    "title": "Filling the Gap: Atom Probe Tomography of Porous Structures Enabled by   Site Specific SEMGlu Curing",
    "abstract": "Porous microstructures, while central to many functional materials, remain difficult to characterize quantitatively by atom probe tomography (APT). Although several strategies have been proposed over the past decade, most remain constrained by significant practical or technical limitations. Here, we introduce an in situ pore filling approach that integrates seamlessly into conventional specimen preparation workflows. The method employs a vacuum compatible resin that is rapidly cured by the electron beam during standard ion beam based preparation, eliminating the need for additional instrumentation or extensive sample handling. We demonstrate the effectiveness of this approach using a porous SnSe + MXene electrode, a material system otherwise difficult to analyze via APT characterisation. This method offers a robust, accessible solution for extending APT analysis to porous materials",
    "authors": [
      "Lukas Worch",
      "James O. Douglas",
      "Kavin Arunasalam",
      "Baptiste Gault",
      "Valeria Nicolosi",
      "Michele Shelly Conroy"
    ],
    "published": "2025-10-27T15:22:09Z",
    "updated": "2025-10-27T15:22:09Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.23229v1",
    "url": "https://arxiv.org/abs/2510.23229v1",
    "pdf_url": "https://arxiv.org/pdf/2510.23229v1.pdf",
    "title": "Validation of field cage and cathode for low radioactivity operation   with the CYGNO experiment",
    "abstract": "Dark matter, which is considered to account for approximately the 27% of the Universe's energy-mass content, remains an open issue in modern particle physics along with its composition. The CYGNO Experiment aims to exploit an innovative approach applied to the direct detection search of low energy nuclear recoils possibly induced by cold particle-like dark matter candidates. CYGNO employs a directional detector based on a Time Projection Chamber (TPC) filled with a He:CF$_{4}$ gas mixture and equipped with an optical readout. Currently, the CYGNO Collaboration is constructing the detector demonstrator, CYGNO-04, in Hall F at Laboratori Nazionali del Gran Sasso (LNGS). This 0.4 m$^3$ detector has the goal of proving the scalability of the technology and assessing the physics and radiopurity capabilities. Given the low radioactivity requirements, especially in internal components such as field cage and cathode, the reduction of material while keeping the correct electrical behavior is paramount. In this paper, we present the validation of several internal components, mainly focusing on the field cage material and support structure. The tests included geometrical asymmetries in the electric field response, collection efficiency as well as measurement of known physical quantities. A preferred configuration is found with a structure based on Nylon material which supports a PET or Kapton sheet with copper strips deposited on.",
    "authors": [
      "F. D. Amaro",
      "R. Antonietti",
      "E. Baracchini",
      "L. Benussi",
      "S. Bianco",
      "A. Biondi",
      "C. Capoccia",
      "M. Caponero",
      "L. G. M. de Carvalho",
      "G. Cavoto",
      "I. A. Costa",
      "A. Croce",
      "M. D'Astolfo",
      "G. D'Imperio",
      "E. Danè",
      "G. Dho",
      "E. Di Marco",
      "J. M. F. dos Santos",
      "D. Fiorina",
      "F. Iacoangeli",
      "Z. Islam",
      "E. Kemp",
      "H. P. Lima Jr",
      "G. Maccarrone",
      "R. D. P. Mano",
      "D. J. G. Marques",
      "G. Mazzitelli",
      "A. G. McLean",
      "P. Meloni",
      "A. Messina",
      "C. M. B. Monteiro",
      "R. A. Nobrega",
      "I. F. Pains",
      "E. Paoletti",
      "L. Passamonti",
      "F. Petrucci",
      "S. Piacentini",
      "D. Piccolo",
      "D. Pierluigi",
      "D. Pinci",
      "A. Prajapati",
      "F. Renga",
      "F. Rosatelli",
      "A. Russo",
      "G. Saviano",
      "P. A. O. C. Silva",
      "N. J. Spooner",
      "R. Tesauro",
      "S. Tomassini",
      "S. Torelli",
      "D. Tozzi"
    ],
    "published": "2025-10-27T11:28:41Z",
    "updated": "2025-10-27T11:28:41Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.23134v1",
    "url": "https://arxiv.org/abs/2510.23134v1",
    "pdf_url": "https://arxiv.org/pdf/2510.23134v1.pdf",
    "title": "THz mixing of high-order harmonics using $YBa_2Cu_3O_{7-δ}$   nanobridges",
    "abstract": "Superconducting materials are a key for technologies enabling a large number of devices including THz wave mixers and single photon detectors, though limited at very low temperatures for conventional superconductors. High temperature operation could in principle be offered using cuprate superconductors. However, the complexity of the material in thin film form, the extremely short coherence length and material stability, have hindered the realization of THz devices working at liquid nitrogen temperatures. $YBa_2Cu_3O_{7-{\\delta}}$ (YBCO) nanodevices have demonstrated non-linear properties typical of Josephson-like behavior, which have the potential for the mixing of AC signals in the THz range due to the large superconducting energy gap. Here, we present AC Josephson functionalities for terahertz waves utilizing Abrikosov vortex motion in nanoscale-confined fully planar YBCO thin film bridges. We observe Shapiro step-like features in the current voltage characteristics when irradiating the device with monochromatic sub-THz waves (100 GHz to 215 GHz) at 77 K. We further explore these nonlinear effects by detecting THz high-order harmonic mixing for signals from 200 GHz up to 1.4 THz using a local oscillator at 100 GHz. Our results open a path to an easy-fabricated HTS nonlinear nanodevice based on dimensional confinement suitable for terahertz applications.",
    "authors": [
      "Núria Alcalde-Herraiz",
      "Alessia Garibaldi",
      "Karn Rongrueangkul",
      "Alexei Kalaboukhov",
      "Floriana Lombardi",
      "Sergey Cherednichenko",
      "Thilo Bauch"
    ],
    "published": "2025-10-27T09:15:02Z",
    "updated": "2025-10-27T09:15:02Z",
    "categories": [
      "cond-mat.supr-con",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.supr-con"
  },
  {
    "arxiv_id": "2509.21417v2",
    "url": "https://arxiv.org/abs/2509.21417v2",
    "pdf_url": "https://arxiv.org/pdf/2509.21417v2.pdf",
    "title": "Coherently Enhanced Axion-Photon Conversion via Seeded Photons for   Short-Pulse Axion Detection",
    "abstract": "We propose a seeded axion-photon conversion scheme to enhance the sensitivity of light-shining-through-a-wall (LSW) experiments for axion detection, where the axions are generated from short pulse lasers and the usual resonant cavity is not applicable. By injecting a weak, coherent seed electromagnetic (EM) field into the axion-photon conversion region, the axion-induced EM field can constructively interfere with the seed field, amplifying the number of regenerated photons to a level exceeding that of the unseeded scenario. We evaluate the expected signal enhancement, statistical limits from Poisson counting with seed fluctuations and background, and the potential improvement in coupling sensitivity. Compared to a standard LSW setup, the seeded scheme can achieve orders-of-magnitude higher photon yield per axion, potentially surpassing resonance-enhanced experiments in certain parameter regimes. This approach presents a promising pathway to extend the reach of laboratory axion searches, particularly in scenarios where the resonant cavities are impractical.",
    "authors": [
      "Xiangyan An",
      "Min Chen",
      "Jianglai Liu",
      "Yipeng Wu",
      "Peng Yuan",
      "Wenchao Yan",
      "Boyuan Li",
      "Feng Liu",
      "Zhengming Sheng",
      "Jie Zhang"
    ],
    "published": "2025-09-25T05:39:59Z",
    "updated": "2025-10-27T08:50:13Z",
    "categories": [
      "hep-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2510.21288v2",
    "url": "https://arxiv.org/abs/2510.21288v2",
    "pdf_url": "https://arxiv.org/pdf/2510.21288v2.pdf",
    "title": "Bayesian approach for spatial super-resolution of heterodyne wind lidars",
    "abstract": "Wind speed measurements using heterodyne lidars are limited in spatial resolution because of the current signal processing methods. This limit is equal to c $\\tau$ ( c is the speed of light and $\\tau$ is the laser pulse duration) corresponding to the length of the atmosphere contributing to the wind speed measurement at one distance. To go beyond this limit, we use an inverse problem approach based on a model of the spectrogram (concatenation of periodograms of each range) and prior distributions on our unknowns: backscattering amplitude and wind speed at each range. We apply our inversion method to simulated and experimental spectrograms, demonstrating a gain in resolution by a factor of 2 to 2.5 depending on the signal-to-noise ratio.",
    "authors": [
      "Theo Martin",
      "Laurent Mugnier",
      "Matthieu Valla",
      "Pierre Etienne Allain",
      "David Tomline Michel"
    ],
    "published": "2025-10-24T09:37:42Z",
    "updated": "2025-10-27T08:29:54Z",
    "categories": [
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.23088v1",
    "url": "https://arxiv.org/abs/2510.23088v1",
    "pdf_url": "https://arxiv.org/pdf/2510.23088v1.pdf",
    "title": "Machine Learning approach to modeling of neutral particles transport in   plasma",
    "abstract": "A propagator-based approach is investigated for Monte-Carlo (MC) modeling of neutral particles transport in fusion boundary plasmas. The propagator is essentially a Green function for the neutral kinetic equation, which depends on the plasma profiles. A Neural Network (NN) based model for the propagator provides a fast and accurate solution for the neutral distribution function in plasma. Furthermore, continuous and smooth dependence of NN-based reconstruction of the propagator on the plasma parameters opens the possibility for using this approach with Jacobian-based methods for time-integration and root finding. Initial results from a small 1D test problem look promising; however, important research questions are concerned with the scaling of the algorithm to larger systems.",
    "authors": [
      "M. V. Umansky",
      "G. J. Parker",
      "R. D. Smirnov"
    ],
    "published": "2025-10-27T07:51:04Z",
    "updated": "2025-10-27T07:51:04Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2412.01724v3",
    "url": "https://arxiv.org/abs/2412.01724v3",
    "pdf_url": "https://arxiv.org/pdf/2412.01724v3.pdf",
    "title": "Spectrally accurate, reverse-mode differentiable bounce-averaging   algorithm and its applications",
    "abstract": "We present a fast, spectrally accurate, automatically differentiable bounce-averaging algorithm implemented in the DESC stellarator optimization suite. Using this algorithm, we can perform efficient optimization of many objectives to improve stellarator performance, such as the $\\epsilon_{\\mathrm{eff}}^{3/2}$ proxy for the neoclassical transport coefficient in the $1/\\nu$ (banana) regime. By employing this differentiable approximation, for the first time, we optimize a finite-beta stellarator to directly reduce neoclassical ripple transport using reverse-mode differentiation. This ensures the cost of differentiation is independent of the number of controllable parameters.",
    "authors": [
      "Kaya E. Unalmis",
      "Rahul Gaur",
      "Rory Conlin",
      "Dario Panici",
      "Egemen Kolemen"
    ],
    "published": "2024-12-02T17:13:46Z",
    "updated": "2025-10-27T06:59:57Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.23001v1",
    "url": "https://arxiv.org/abs/2510.23001v1",
    "pdf_url": "https://arxiv.org/pdf/2510.23001v1.pdf",
    "title": "Search for Invisible Decay Modes in Nuclear Gamma Cascades of a   ${}^{46}$Sc Source Using a CsI (Tl) Detector",
    "abstract": "Dark matter remains one of the most compelling open questions in modern physics, motivating extensive searches for new light, weakly coupled particles beyond the Standard Model. Numerous experiments have probed a variety of dark matter candidates using diverse detector technologies, yet large regions of parameter space remain unexplored. In this work, we present a novel high-statistics search for invisible decay modes in nuclear $\\gamma$ cascades, employing approximately 100~kg of CsI(Tl) scintillators at Texas A\\&M University. The key feature of this experiment is the use of a high-activity ${}^{46}$Sc radioactive source combined with a \"missing gamma\" technique, in which the absence of a photon in a well-identified cascade serves as a signature of new physics. Unlike appearance--disappearance experiments, this approach requires only a single photon conversion into a dark-sector particle, thereby enabling sensitivity to weaker couplings. With approximately 1000~hours of data collected using the current setup, no statistically significant excess was observed, consistent with existing constraints on dark-sector candidates such as axions and axion-like particles (ALPs), dark scalars, and dark photons in the sub-MeV mass range. This result highlights the sensitivity of the missing-gamma technique and motivates the development of a larger-scale detector with improved systematic control to extend dark-sector searches into previously unexplored regions of parameter space.",
    "authors": [
      "Sharada Sahoo",
      "Jing-han Chen",
      "Mahdi Mirzakhani",
      "Harikrishnan Ramani",
      "Rupak Mahapatra",
      "Surjeet Rajendran"
    ],
    "published": "2025-10-27T04:37:35Z",
    "updated": "2025-10-27T04:37:35Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.22965v1",
    "url": "https://arxiv.org/abs/2510.22965v1",
    "pdf_url": "https://arxiv.org/pdf/2510.22965v1.pdf",
    "title": "Neutron capture measurement of the 165Ho at the CSNS Backn facility in   the resonance energy region",
    "abstract": "The neutron capture yield of 165Ho have been measured at the Back-streaming White neutron beam line (Back-n) of the China Spallation Neutron Source (CSNS) using a 4{\\pi} BaF2 Gamma Total Absorption Facility (GTAF). The resonance shapes in the 1eV to 1.0keV region were analyzed with the Bayesian R-matrix code SAMMY. For 18 s-wave resonances below 100eV, the resonance energy ER, neutron width {\\Gamma}n, and radiative width {\\Gamma}{\\gamma} were extracted. The statistical analyses of the resonance parameters show that the nearest-neighbour level-spacing distribution follows a Wigner-Dyson form with mean spacing D0 = 4.53(3)eV,indicating chaotic compound-nucleus behaviour; Using the extracted parameters, the s-wave neutron strength function for 165Ho was derived to be 10-4S0 = 2.01(1), in excellent agreement with the values reported in both the Atlas of Neutron Resonances and ENDF/B-VIII.0 data.",
    "authors": [
      "De-Xin Wang",
      "Su-Ya-La-Tu Zhang",
      "Wei Jiang",
      "Rui-Rui Fan",
      "Qi-Wei Zhang",
      "Jie Ren",
      "Jin-Cheng Wang",
      "Guang-Yuan Luan",
      "Xiao-Guang Wu",
      "Bao-Hua Sun",
      "Zhen-Xiang Zhou",
      "Hong-Yi Wu",
      "Zhi-Yang He",
      "Cong-Bo Li",
      "Qi Sun",
      "Xuan Pang",
      "Mei-Rong Huang",
      "Guo Li",
      "Gerile Bao",
      "Xi-Chao Ruan"
    ],
    "published": "2025-10-27T03:40:57Z",
    "updated": "2025-10-27T03:40:57Z",
    "categories": [
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "nucl-ex"
  },
  {
    "arxiv_id": "2506.12948v2",
    "url": "https://arxiv.org/abs/2506.12948v2",
    "pdf_url": "https://arxiv.org/pdf/2506.12948v2.pdf",
    "title": "Global linear drift-wave eigenmode structures on flux surfaces in   stellarators: ion temperature gradient mode",
    "abstract": "Turbulent transport greatly impacts the performance of stellarator magnetic confinement devices. While significant progress has been made on the numerical front, theoretical understanding of turbulence in stellarators is still lacking. In particular, due to nonaxisymmetry, different field lines couple within flux surfaces, the effects from which have yet to be adequately studied. In this work, we numerically simulate the linear electrostatic ion-temperature-gradient modes in stellarators using the global gyrokinetic particle-in-cell code GTC. We find that the linear eigenmode structures are nonuniform across field lines on flux surfaces and are localized at the downstream of the ion diamagnetic drift. Based on a simple model from Zocco et al. [Phys. Plasmas 23, 082516 (2016); 27, 022507 (2020)], we show that the localization can be explained from the nonzero imaginary part of the binormal wavenumber. We further demonstrate that a localized surface-global eigenmode can be constructed from local gyrokinetic codes stella and GX, only if we first solve the local dispersion relation with real wavenumbers on each field line, and then do an analytic continuation to the complex-wavenumber plane. These results suggest that the complex-wavenumber spectra from surface-global effects are required to understand the linear drift-wave eigenmode structures in stellarators.",
    "authors": [
      "Hongxuan Zhu",
      "H. Chen",
      "Z. Lin",
      "A. Bhattacharjee"
    ],
    "published": "2025-06-15T19:19:41Z",
    "updated": "2025-10-27T03:08:24Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1088/1741-4326/ae151a"
  },
  {
    "arxiv_id": "2510.22806v1",
    "url": "https://arxiv.org/abs/2510.22806v1",
    "pdf_url": "https://arxiv.org/pdf/2510.22806v1.pdf",
    "title": "Photon-starved imaging through turbulence at the diffraction limit",
    "abstract": "Achieving diffraction-limited resolution through atmospheric turbulence is a fundamental challenge for ground-based imaging systems, especially in the photon-starved regime. Conventional methods, such as adaptive optics and speckle imaging, struggle to achieve optimal performance when turbulence is severe and photons are limited. We present Turbulence-Aware Poisson Blind Deconvolution (TAP-BD), a framework designed for robust image recovery in these extreme conditions. TAP-BD exploits phase modulations on the incoming photons coupled with physics-informed optimization to extract more information from the available signal than traditional methods. Experimentally, our approach achieves a target PSNR of 24 dB with just tens of noisy measurements, under severe turbulence up to D/r0~24. This robust performance in photon-starved conditions unlocks new capabilities in space situational awareness and remote sensing.",
    "authors": [
      "Seungman Choi",
      "Peter Menart",
      "Andrew Schramka",
      "Shubhankar Jape",
      "Leif Bauer",
      "In-Yong Park",
      "Zubin Jacob"
    ],
    "published": "2025-10-26T19:36:28Z",
    "updated": "2025-10-26T19:36:28Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2508.01023v5",
    "url": "https://arxiv.org/abs/2508.01023v5",
    "pdf_url": "https://arxiv.org/pdf/2508.01023v5.pdf",
    "title": "Electron Emissions and Hot spots in Dual-Phase LXe TPCs",
    "abstract": "Persistent photon and single-electron emissions - in the form of \"electron trains\" and localized \"hot spots\" - have been observed in multiple dual-phase liquid xenon (LXe) time projection chambers (TPCs), often persisting long after ionizing events. We show that these phenomena are naturally explained by photon-triggered single-electron emission from resistive mixed-oxide films on stainless-steel wires, which behave as leaky capacitors with long RC time constants at LXe temperature. Positive ions landing on these oxides can further enhance local fields and drive Malter-like electron emission. We outline the materials physics (Cr2O3 / Cr2O3-x / Cr(OH)3 mosaics), quantify expected time scales (~1 second under illumination), and demonstrate how small damaged regions with enhanced QE can produce persistent hot spots.",
    "authors": [
      "J. Va'vra"
    ],
    "published": "2025-08-01T18:48:59Z",
    "updated": "2025-10-26T17:42:04Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.22746v1",
    "url": "https://arxiv.org/abs/2510.22746v1",
    "pdf_url": "https://arxiv.org/pdf/2510.22746v1.pdf",
    "title": "Scintillation of liquid nitrogen",
    "abstract": "Liquid nitrogen is commonly used in cryogenic applications and is a promising medium for the direct immersion cooling of sensors used for nuclear and particle physics experiments. The scintillation properties of gaseous nitrogen are well-documented, but little is known about the scintillation of liquid nitrogen. If present, scintillation light from interactions of ambient radioactivity could produce backgrounds for rare event searches such as the direct detection of dark matter. Using a coincidence-tagged alpha decay, we demonstrate that liquid nitrogen exhibits measurable, albeit very faint, scintillation. Assuming the same scintillation wavelength spectrum as gaseous nitrogen, we estimate a relative scintillation yield of $Y_{\\text{LN}}/Y^{\\text{STP}}_{\\text{GN}} = 0.0142 \\pm 0.0005\\text{(stat)} \\pm 0.0030\\text{(sys)}$ with respect to gaseous nitrogen at standard temperature and pressure. Considering the average scintillation yield from alpha decays in gaseous nitrogen, this implies a scintillation yield for alpha decays in liquid nitrogen of $Y_{\\text{LN}} = 2.39 \\pm 0.56$ photons per MeV. To our knowledge this is the first measurement of scintillation in liquid nitrogen.",
    "authors": [
      "L. Pagani",
      "R. Saldanha",
      "B. M. Loer",
      "G. S. Ortega",
      "R. A. Bunker",
      "B. T. Foust"
    ],
    "published": "2025-10-26T16:48:04Z",
    "updated": "2025-10-26T16:48:04Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2504.16849v4",
    "url": "https://arxiv.org/abs/2504.16849v4",
    "pdf_url": "https://arxiv.org/pdf/2504.16849v4.pdf",
    "title": "Magnetorotational instability in a solar near-surface mean-field dynamo",
    "abstract": "We address the question whether the magnetorotational instability (MRI) can operate in the near-surface shear layer (NSSL) of the Sun and how it affects the interaction with the dynamo process. Using hydromagnetic mean-field simulations of $\\alpha\\Omega$-type dynamos in rotating shearing-periodic boxes, we show that for negative shear, the MRI can operate above a certain critical shear parameter. This parameter scales inversely with the equipartition magnetic field strength above which $\\alpha$ quenching set in. Like the usual $\\Omega$ effect, the MRI produces toroidal magnetic field when the field is sufficiently strong. The work done by the Lorentz force is positive, so the magnetic field drives kinetic energy and not the other way around, as in a turbulent dynamo. This results in strong kinetic energy production and dissipation, which occurs at the expense of the magnetic energy. In view of the application to the solar NSSL, we conclude that the turbulent magnetic diffusivity may be too large for the MRI to be excited and that therefore only the standard $\\Omega$ effect is expected to operate.",
    "authors": [
      "Axel Brandenburg",
      "Gustav Larsson",
      "Fabio Del Sordo",
      "Petri J. Käpylä"
    ],
    "published": "2025-04-23T16:10:59Z",
    "updated": "2025-10-26T06:04:34Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR",
    "doi": "10.3847/1538-4357/ae03c4"
  },
  {
    "arxiv_id": "2510.22499v1",
    "url": "https://arxiv.org/abs/2510.22499v1",
    "pdf_url": "https://arxiv.org/pdf/2510.22499v1.pdf",
    "title": "Dynamic Digital Synthetic Wavelength Optical Absolute Ranging",
    "abstract": "Measurements of optical range and time-of-flight are crucial for a variety of high-precision technologies. Competitive optical measurement techniques have been developed that balance precision with accuracy and system complexity. Here, we present a continuous-wave synthetic wavelength interferometry technique that employs digitally tunable electro-optic frequency combs. With a software-defined radio, our approach can dynamically sweep the synthetic wavelength and measure absolute optical range. We demonstrate this digital approach over a free-space optical delay line of 1 m and over an 40 km fiber link. The best obtained precision over the delay line is better than 60 nm (0.2 fs). Through a 40 km fiber spool, this precision degrades to 15 um (50 fs), which is a fractional error on the order of 2e-10 m/m. Our design is simple to implement, and only relies on continuous-wave interference, decreasing system complexity.",
    "authors": [
      "Shawn M. P. McSorley",
      "Benjamin P. Dix-Matthews",
      "Andrew M. Lance",
      "David R. Gozzard",
      "Sascha W. Schediwy"
    ],
    "published": "2025-10-26T02:34:56Z",
    "updated": "2025-10-26T02:34:56Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2509.23172v2",
    "url": "https://arxiv.org/abs/2509.23172v2",
    "pdf_url": "https://arxiv.org/pdf/2509.23172v2.pdf",
    "title": "CHRONOS: Cryogenic sub-Hz cROss torsion bar detector with quantum   NOn-demolition Speed meter",
    "abstract": "We propose a next-generation ground-based gravitational-wave detector, the Cryogenic sub-Hz cROss torsion-bar detector with quantum NOn-demolition Speed meter (CHRONOS), optimized for the unexplored 0.1-10Hz band bridging the gap between the space-based LISA and future ground-based detectors such as Cosmic Explorer and the Einstein Telescope. CHRONOS combines a ring-cavity Sagnac interferometer with torsion-bar test masses to realize the first quantum nondemolition (QND) measurement of angular momentum in a macroscopic system. By implementing a speed-meter readout in the rotational degree of freedom, CHRONOS coherently cancels quantum radiation-pressure noise and enables sub-Hz observations. We show that detuned power recycling and cavity-length optimization can simultaneously relax technical requirements on both torsion bars and speed meters. Assuming a realistic optical design with a 1m torsion bar, we estimate strain sensitivities of $h \\simeq 1 \\times 10^{-18}\\mathrm{Hz}^{-1/2}$ at 1Hz for detectors with arm lengths of 2.5m, 40m, and 300m. These sensitivities enable (i) direct detection of intermediate-mass black hole binaries up to 380Mpc with ${\\rm SNR}=3$, (ii) probing stochastic gravitational-wave backgrounds down to $\\Omega_{\\rm GW} \\sim 3.2 \\times 10^{-9}$ at 0.2Hz with 5yr accumulation. Furthermore, CHRONOS enables prompt detection of gravity-gradient signals from magnitude-5.5 earthquakes even with a 2.5m prototype. CHRONOS thus opens new opportunities for quantum-limited geophysical observation and multi-band, multi-messenger gravitational-wave astronomy.",
    "authors": [
      "Yuki Inoue",
      "Hsiang-Chieh Hsu",
      "Hsiang-Yu Huang",
      "M. Afif Ismail",
      "Vivek Kumar",
      "Miftahul Ma'arif",
      "Avani Patel",
      "Daiki Tanabe",
      "Henry Tsz-King Wong",
      "Ta-Chun Yu"
    ],
    "published": "2025-09-27T08:04:34Z",
    "updated": "2025-10-25T13:47:30Z",
    "categories": [
      "astro-ph.IM",
      "gr-qc",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2510.22226v1",
    "url": "https://arxiv.org/abs/2510.22226v1",
    "pdf_url": "https://arxiv.org/pdf/2510.22226v1.pdf",
    "title": "A DSMC-PIC coupling method for the Vlasov-Maxwell-Landau system",
    "abstract": "We present a numerical framework for the simulation of collisional plasma dynamics, based on a coupling between Direct Simulation Monte Carlo (DSMC) and Particle-in-Cell (PIC) methods for the Vlasov-Maxwell-Landau system. The approach extends previously developed DSMC techniques for the homogeneous Landau equation to the fully inhomogeneous, electromagnetic regime. The Landau collision operator is treated through a stochastic particle formulation inspired by the grazing-collision limit of the Boltzmann equation, which enables an efficient and physically consistent representation of Coulomb interactions without relying on the full Boltzmann structure. The resulting collisional solver is combined, via operator splitting, with standard PIC schemes for the Vlasov-Maxwell dynamics, providing flexibility in the choice of field discretisation and time integration. The overall method preserves the main physical invariants of the system while maintaining computational efficiency and simplicity of implementation. Numerical experiments on benchmark problems demonstrate the accuracy, robustness, and effectiveness of the coupled DSMC-PIC approach across a wide range of collisional regimes.",
    "authors": [
      "Andrea Medaglia",
      "Lorenzo Pareschi",
      "Mattia Zanella"
    ],
    "published": "2025-10-25T09:14:49Z",
    "updated": "2025-10-25T09:14:49Z",
    "categories": [
      "physics.comp-ph",
      "cs.NA",
      "math.NA",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.comp-ph"
  },
  {
    "arxiv_id": "2510.22203v1",
    "url": "https://arxiv.org/abs/2510.22203v1",
    "pdf_url": "https://arxiv.org/pdf/2510.22203v1.pdf",
    "title": "Revealing Liquid-Gas Transitions with Finite-Size Scaling in Confined   Systems",
    "abstract": "The application of an external field often renders empirical criteria for identifying liquid-gas phase transitions ambiguous. Here, we demonstrate that the finite-size scaling of the density profile provides a definitive criterion to distinguish liquid-gas coexistence from a single fluid phase in field-confined systems. Our scaling method collapses the density profiles of different system sizes onto a single master curve for a one-phase system, while causing the profiles to intersect at the interface in a two-phase system. We validate this theoretical proposal through experiments and simulations of two model systems: colloidal suspensions under gravity and/or two-dimensional complex plasmas confined by a central potential. Our method is broadly applicable for detecting liquid-gas phase transitions in laboratory systems where external fields are inherent.",
    "authors": [
      "Chong Zha",
      "Yanshuang Chen",
      "Cheng-Ran Du",
      "Peng Tan",
      "Yuliang Jin"
    ],
    "published": "2025-10-25T08:05:26Z",
    "updated": "2025-10-25T08:05:26Z",
    "categories": [
      "cond-mat.stat-mech",
      "cond-mat.soft",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.stat-mech"
  },
  {
    "arxiv_id": "2510.22091v1",
    "url": "https://arxiv.org/abs/2510.22091v1",
    "pdf_url": "https://arxiv.org/pdf/2510.22091v1.pdf",
    "title": "High-Harmonic Optical Vortex Generation from a Plasma Aperture",
    "abstract": "When a high-power, femtosecond, circularly polarized (CP) laser pulse is incident on a micrometer-scale aperture in a solid foil target, it drives surface plasma oscillation, generating high-order harmonic vortices in the diffracted light. However, this mechanism has so far only been studied theoretically under ideal conditions. In this work, we perform numerical studies on more realistic situations. In particular, we focus on a scenario where the laser is obliquely incident on the target surface to avoid the potential damage of the optics by the reflected light. We demonstrate that increasing oblique incidence angle, reducing target thickness, and improving laser contrast can enhance the harmonic conversion efficiency. However, the generated harmonic beams may contain both Laguerre-Gaussian (LG) (vortex) and non-LG components under non-ideal conditions. We show that they can be separated by their divergence, as the vortex components has smaller diverging angle. In addition, we have performed computational analyses on the harmonic divergence angles and topological charge spectra of vortex high-order harmonics under different conditions. These high-order harmonic pure LG modes can potentially be filtered out for wide range of fundamental and applied physics researches. This study provides valuable insights for the design and implementation of future experiments.",
    "authors": [
      "Runze Li",
      "Wenchao Yan",
      "Longqing Yi"
    ],
    "published": "2025-10-25T00:11:57Z",
    "updated": "2025-10-25T00:11:57Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.22061v1",
    "url": "https://arxiv.org/abs/2510.22061v1",
    "pdf_url": "https://arxiv.org/pdf/2510.22061v1.pdf",
    "title": "Quasi-Biennial Oscillations and Rieger-type Periodicities in a   Babcock-Leighton Solar Dynamo",
    "abstract": "The Sun's magnetic field shows the 11-year solar cycle and shorter periodicities, popularly known as the quasi-biennial oscillations (QBOs) and Rieger-type periods, or ``season of the Sun.\" Although several theories have been proposed to explain the origin of QBOs and Rieger-type periods, no single theory has widespread acceptance. We explore whether the \\bl\\ dynamo can produce Rieger-type periodicity and QBOs and investigate their underlying physical mechanisms. We use the observationally guided three-dimensional kinematic \\bl\\ dynamo model, which has emerged as a successful model for reproducing many characteristic features of the solar cycle. We use Morlet wavelet and global wavelet power spectrum techniques to analyze the data obtained from the model. In our model, we report QBOs and Rieger-type periods for the first time. Further, we investigate the individual \\bl\\ parameters (fluctuations in flux, latitude, time delay and tilt scatter) role in the occurrence of QBOs and Rieger-type periods. We find that while fluctuations in the individual parameters of the \\bl\\ process can produce QBOs and Rieger-type periodicity, their occurrence probability is enhanced when we consider combined fluctuations of all parameters in the \\bl\\ process. Finally, we find that with the increase of dynamo supercriticality, the model tends to suppress the generation of Rieger-type periodicity. Thus, this result supports earlier studies that suggest the solar dynamo is not highly supercritical.",
    "authors": [
      "Pawan Kumar",
      "Belur Ravindra",
      "Partha Chowdhury",
      "Bidya Binay Karak"
    ],
    "published": "2025-10-24T22:52:03Z",
    "updated": "2025-10-24T22:52:03Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2510.16159v2",
    "url": "https://arxiv.org/abs/2510.16159v2",
    "pdf_url": "https://arxiv.org/pdf/2510.16159v2.pdf",
    "title": "Light shift suppression in a CPT magnetometer using linear polarization   and double frequency interrogation",
    "abstract": "We demonstrate a suppression of the light shift in a Coherent-Population-Trapping (CPT) atomic magnetometer by using linearly polarized light and a differential measurement between magnetic resonances. The radio frequency that creates the optical sidebands for CPT quickly switches between two magnetic sensitive transitions and the magnetic field is extrapolated from the difference of the center frequencies of the magnetic resonances. Light shifts and common drifts like collisional shifts can be suppressed through careful choice of measured resonances and we show the light shift reduction by more than a factor of 20 compared to excitation with circular polarized light. Various limitations to the method are discussed.",
    "authors": [
      "M. A. Maldonado",
      "Yang Li",
      "James A. McKelvy",
      "Andrey Matsko",
      "Irina Novikova",
      "Eugeniy E. Mikhailov",
      "John Kitching",
      "Ying-Ju Wang"
    ],
    "published": "2025-10-17T19:04:07Z",
    "updated": "2025-10-24T18:18:13Z",
    "categories": [
      "physics.atom-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2507.03757v2",
    "url": "https://arxiv.org/abs/2507.03757v2",
    "pdf_url": "https://arxiv.org/pdf/2507.03757v2.pdf",
    "title": "Kappa distributions in the framework of superstatistics",
    "abstract": "The kappa distribution of velocities appears routinely in the study of collisionless plasmas present in Earth's magnetosphere, the solar wind among other contexts where particles are unable to reach thermal equilibrium. Originally justified through the use of Tsallis' non-extensive statistics, nowadays there are alternative frameworks that provide insight into these distributions, such as superstatistics. In this work we review the derivation of the multi-particle and single-particle kappa distributions for collisionless plasmas within the framework of superstatistics, as an alternative to the use of non-extensive statistics. We also show the utility of the superstatistical framework in the computation of expectation values under kappa distributions. Some consequences of the superstatistical formalism regarding correlations, temperature and entropy of kappa-distributed plasmas are also discussed.",
    "authors": [
      "Sergio Davis",
      "Biswajit Bora",
      "Cristian Pavez",
      "Leopoldo Soto"
    ],
    "published": "2025-07-04T18:08:48Z",
    "updated": "2025-10-24T18:12:20Z",
    "categories": [
      "cond-mat.stat-mech",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.stat-mech"
  },
  {
    "arxiv_id": "2510.21676v1",
    "url": "https://arxiv.org/abs/2510.21676v1",
    "pdf_url": "https://arxiv.org/pdf/2510.21676v1.pdf",
    "title": "Constructing Field Aligned Coordinate Systems for Gyrokinetic   Simulations of Tokamaks in X-point Geometries",
    "abstract": "Structures in tokamak plasmas are elongated along the direction of the magnetic field and short in the directions perpendicular to the magnetic field. Many tokamak simulation codes take advantage of this by using a field aligned coordinate system. However, field aligned coordinate systems have a coordinate singularity at magnetic X-points where the poloidal magnetic field vanishes, which makes it difficult to use field aligned coordinate systems when simulating the core and scrape-off layer (SOL) simultaneously. Here we present an algorithm for computing geometric quantities in a standard field aligned coordinate system that avoids the singularity and allows one to conduct 2D axisymmetric simulations in X-point geometries. We demonstrate the efficacy of this algorithm with an example simulation of the Spherical Tokamak for Energy Production (STEP).",
    "authors": [
      "Akash Shukla",
      "Ammar Hakim",
      "James Juno",
      "Gregory Hammett",
      "Manaure Francisquez"
    ],
    "published": "2025-10-24T17:31:59Z",
    "updated": "2025-10-24T17:31:59Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.21675v1",
    "url": "https://arxiv.org/abs/2510.21675v1",
    "pdf_url": "https://arxiv.org/pdf/2510.21675v1.pdf",
    "title": "Counter-Streaming Beams in Collisionless Pair Plasma Instability Systems   III: Collisionless Heating, Acceleration, and Radiation",
    "abstract": "Energetic astrophysical phenomena, such as $\\gamma$-ray bursts and supernova explosion-driven shocks in collisionless plasmas, involve various plasma kinetic instabilities, such as the Weibel instability. These systems support various types of particle acceleration and radiation through a variety of mechanisms. In this paper, we explore the energy transformations and dynamical effects of violent filament mergers seen between the large current filaments formed by the Weibel instability. The radiative processes involved in the Weibel instability filament building are also discussed in relation to jitter and synchrotron radiation.",
    "authors": [
      "Michael C. Sitarz"
    ],
    "published": "2025-10-24T17:30:14Z",
    "updated": "2025-10-24T17:30:14Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.21666v1",
    "url": "https://arxiv.org/abs/2510.21666v1",
    "pdf_url": "https://arxiv.org/pdf/2510.21666v1.pdf",
    "title": "Counter-Streaming Beams in Collisionless Pair Plasma Instability Systems   II: Spectral Cone and Spectral Wave Mode Analysis",
    "abstract": "Energetic astrophysical phenomena, such as $\\gamma$-ray bursts, supernova explosions, and magnetar flares occur in collisionless plasmas and involve various plasma kinetic and magnetohydrodynamic instabilities. In this paper, we explore the spectral trends of the Weibel instability using spectral analysis of particle-in-cell simulations. Power dependence on viewing angle and frequency are explored and the relation to the results of the first paper in this series is discussed.",
    "authors": [
      "Michael C. Sitarz"
    ],
    "published": "2025-10-24T17:24:02Z",
    "updated": "2025-10-24T17:24:02Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.21907v1",
    "url": "https://arxiv.org/abs/2510.21907v1",
    "pdf_url": "https://arxiv.org/pdf/2510.21907v1.pdf",
    "title": "Evaluation of SiC detector performances for energy and timing   measurements",
    "abstract": "The development of new detectors based on Silicon Carbide (SiC) is currently a topic of interest within the scientific community. The significant features of SiC make it highly promising for detecting charged particles, neutrons, and $\\gamma$/X radiation. In this framework, within the SAMOTHRACE (Sicilian Micro and Nano Technology Research and Innovation Center) ecosystem, an array of new-generation SiC detectors is under development, specifically designed for nuclear and medical investigations using radioactive ion beams. This paper describes the results obtained in the characterization of SiC prototypes regarding energy and timing measurements. A new method, based on coincidence data analysis, is employed to evaluate the timing performances of SiC detectors. The obtained results have been compared with tests performed using a micro-channel plate as a start detector reference for timing measurements.",
    "authors": [
      "N. S. Martorana",
      "G. D'Agata",
      "A. Barbon",
      "G. Cardella",
      "E. De Filippo",
      "E. Geraci",
      "C. Guazzoni",
      "L. Acosta",
      "C. Altana",
      "A. Castoldi",
      "A. Composto",
      "S. De Luca",
      "P. Figuera",
      "B. Gnoffo",
      "F. La Via",
      "C. Maiolino",
      "E. V. Pagano",
      "S. Pirrone",
      "G. Politi",
      "L. Quattrocchi",
      "F. Risitano",
      "F. Rizzo",
      "P. Russotto",
      "G. Sapienza",
      "M. Trimarchi",
      "S. Tudisco",
      "C. Zagami"
    ],
    "published": "2025-10-24T17:00:20Z",
    "updated": "2025-10-24T17:00:20Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.19568v2",
    "url": "https://arxiv.org/abs/2508.19568v2",
    "pdf_url": "https://arxiv.org/pdf/2508.19568v2.pdf",
    "title": "Molecular structure, electric property, and scintillation and quenching   of liquid scintillators",
    "abstract": "Liquid scintillators are widely used in particle and nuclear physics. Understanding the scintillation and quenching mechanisms is a fundamental issue in designing a high-light-yield liquid scintillator. In this work, the basic scintillation process for two-component liquid scintillators is reviewed, highlighting the processes of excitation, ionization, anion-cation recombination, and electric dipole-dipole energy transfer. A molecule's polar group, polarization characteristics, and the corresponding material's dielectric constant are found to be correlated with a liquid scintillator's scintillation efficiency. Polar groups and high relative dielectric constant (permittivity) can cause severe quenching and should be avoided. The tellurium loading scheme in the liquid scintillator of the SNO+ experiment, TeBD, is discussed. The hydroxyl groups introduce polar structures in the TeBD, and the relative dielectric constant of our reproduced sample is measured to be $17\\pm2$. These discussions explain part of the quenching of the TeBD liquid scintillator.",
    "authors": [
      "Zhe Wang",
      "Ye Liang",
      "Haozhe Sun"
    ],
    "published": "2025-08-27T04:55:20Z",
    "updated": "2025-10-24T16:18:27Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.21534v1",
    "url": "https://arxiv.org/abs/2510.21534v1",
    "pdf_url": "https://arxiv.org/pdf/2510.21534v1.pdf",
    "title": "TES Proton Irradiation Result Analysis for Future Space Applications",
    "abstract": "As observed on the signal of the Planck-HFI highly sensitive bolometers, the effect of cosmic rays on detectors is a major concern for future similar space missions. Their instruments will have a larger detection surface, increased sensitivity, and more stringent requirements on the suppression of systematic effects. To study the impact of cosmic rays on detector prototypes in operational conditions, IAS has designed a state-of-the-art cryogenic system to irradiate particles by coupling this facility to particle accelerators. An irradiation campaign has been carried out on LiteBIRD-HFT TES prototypes to study their response to particle hits. In this article, we present the results and the analysis of this first test campaign.",
    "authors": [
      "A. Besnard",
      "V. Sauvage",
      "S. L. Stever",
      "B. Maffei",
      "P. dal Bo",
      "T. Lari",
      "M. de Lucia",
      "A. Tartari",
      "G. Signorelli",
      "J. Hubmayr",
      "G. Jaehnig"
    ],
    "published": "2025-10-24T15:01:02Z",
    "updated": "2025-10-24T15:01:02Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.20517v2",
    "url": "https://arxiv.org/abs/2510.20517v2",
    "pdf_url": "https://arxiv.org/pdf/2510.20517v2.pdf",
    "title": "Basic considerations in the design of an electrostatic electron   monochromator",
    "abstract": "Monochromators are an essential component in electron microscopy and spectroscopy for enhancing the spatial and energy resolution. However, its adoption in scanning electron microscopes remains limited because of its high cost and operational complexity. Through a thin-deflector analysis of an electrostatic homogeneous-field deflector, the extreme sensitivity of current monochromators to power supply drift and mechanical imperfections is demonstrated. These stringent alignment requirements for achieving optimal energy resolution often necessitate the use of additional correcting elements, adding to both cost and complexity. We demonstrate that the fringe-field deflector is instead less sensitive to these issues. Hence, a cost effective and simple monochromator design approach based on pure fringe fields is proposed. This monochromator does not need extra correcting elements and its optimal energy resolution is achieved by including momentary deceleration lenses surrounding the main deflector. This fully electrostatic design could be realized using MEMS technology, offering a simpler and more accessible approach for filtering beam energies.",
    "authors": [
      "M. J. Adriaans",
      "J. P. Hoogenboom",
      "A. Mohammadi-Gheidari"
    ],
    "published": "2025-10-23T13:00:31Z",
    "updated": "2025-10-24T14:34:06Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.21458v1",
    "url": "https://arxiv.org/abs/2510.21458v1",
    "pdf_url": "https://arxiv.org/pdf/2510.21458v1.pdf",
    "title": "Constraints on ultra-heavy dark matter from the CDEX-10 experiment at   the China Jinping Underground Laboratory",
    "abstract": "We report a search for ultra-heavy dark matter (UHDM) with the CDEX-10 experiment at the China Jinping Underground Laboratory (CJPL). Using a Monte Carlo framework that incorporates Earth shielding effects, we simulated UHDM propagation and energy deposition in p-type point-contact germanium detectors ($p$PCGe). Analysis of 205.4 kg$\\cdot$day exposure in the 0.16-4.16 keVee range showed no excess above background. Our results exclude the spin-independent UHDM-nucleon scattering with two cross section scales, with the UHDM mass from $10^6$ GeV to $10^{11}$ GeV, and provide the most stringent constraints with solid-state detectors below $10^8$ GeV.",
    "authors": [
      "Y. F. Wang",
      "L. T. Yang",
      "Q. Yue",
      "K. J. Kang",
      "Y. J. Li",
      "H. P. An",
      "Greeshma C.",
      "J. P. Chang",
      "H. Chen",
      "Y. H. Chen",
      "J. P. Cheng",
      "J. Y. Cui",
      "W. H. Dai",
      "Z. Deng",
      "Y. X. Dong",
      "C. H. Fang",
      "H. Gong",
      "Q. J. Guo",
      "T. Guo",
      "X. Y. Guo",
      "L. He",
      "J. R. He",
      "H. X. Huang",
      "T. C. Huang",
      "S. Karmakar",
      "Y. S. Lan",
      "H. B. Li",
      "H. Y. Li",
      "J. M. Li",
      "J. Li",
      "M. C. Li",
      "Q. Y. Li",
      "R. M. J. Li",
      "X. Q. Li",
      "Y. L. Li",
      "Y. F. Liang",
      "B. Liao",
      "F. K. Lin",
      "S. T. Lin",
      "J. X. Liu",
      "R. Z. Liu",
      "S. K. Liu",
      "Y. D. Liu",
      "Y. Liu",
      "Y. Y. Liu",
      "H. Ma",
      "Y. C. Mao",
      "A. Mureed",
      "H. Pan",
      "N. C. Qi",
      "J. Ren",
      "X. C. Ruan",
      "M. B. Shen",
      "H. Y. Shi",
      "M. K. Singh",
      "T. X. Sun",
      "W. L. Sun",
      "C. J. Tang",
      "Y. Tian",
      "H. F. Wan",
      "G. F. Wang",
      "J. Z. Wang",
      "L. Wang",
      "Q. Wang",
      "Q. Wang",
      "Y. X. Wang",
      "H. T. Wong",
      "Y. C. Wu",
      "H. Y. Xing",
      "K. Z. Xiong",
      "R. Xu",
      "Y. Xu",
      "T. Xue",
      "Y. L. Yan",
      "N. Yi",
      "C. X. Yu",
      "H. J. Yu",
      "X. Yu",
      "M. Zeng",
      "Z. Zeng",
      "F. S. Zhang",
      "P. Zhang",
      "P. Zhang",
      "Z. Y. Zhang",
      "M. G. Zhao",
      "J. F. Zhou",
      "Z. Y. Zhou",
      "J. J. Zhu"
    ],
    "published": "2025-10-24T13:38:21Z",
    "updated": "2025-10-24T13:38:21Z",
    "categories": [
      "hep-ex",
      "hep-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2510.21375v1",
    "url": "https://arxiv.org/abs/2510.21375v1",
    "pdf_url": "https://arxiv.org/pdf/2510.21375v1.pdf",
    "title": "Picosecond Precision Heavy Ion Detector for Λ hypernuclei   lifetimes studies",
    "abstract": "In this paper, we present the design and preliminary performance evaluation of a new heavy ion detector for direct measurements of heavy {\\Lambda} hypernuclei lifetimes. The detector employs the previously developed 10 picosecond resolution Radio Frequency (RF) Timer, which converts the temporal information of incident particles into spatial coordinates of secondary or photoelectrons on a position-sensitive detector by means of circular RF scanning in the 500-1000 MHz range. Here, we report the detector design to achieve efficient suppression of accidental background and effective separation of prompt reaction products and delayed events from {\\Lambda} hypernuclei decays, results of test studies carried out with RF synchronized laser as well as preliminary results obtained by using alpha particles. Dedicated Monte-Carlo simulations have been performed to estimate the detector's performance under realistic experimental conditions at RF-driven electron, photon, or proton beams. The results confirm the feasibility of the proposed design and provide a basis for upcoming experimental measurements, based on the delayed fission detection.",
    "authors": [
      "Simon Zhamkochyan",
      "Sergey Abrahamyan",
      "Amur Margaryan",
      "Hayk Elbakyan",
      "Aram Kakoyan",
      "Samvel Mayilyan",
      "Artashes Papyan",
      "Hasmik Rostomyan",
      "Anna Safaryan",
      "Gagik Sughyan",
      "Narek Margaryan",
      "Garnik Ayvazyan",
      "John Annand",
      "Kenneth Livingston",
      "Rachel Montgomery",
      "Patrick Achenbach",
      "Josef Pochodzalla",
      "Dimiter Balabanski",
      "Satoshi Nakamura",
      "Ani Aprahamian",
      "Vanik Kakoyan"
    ],
    "published": "2025-10-24T11:58:51Z",
    "updated": "2025-10-24T11:58:51Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.21261v1",
    "url": "https://arxiv.org/abs/2510.21261v1",
    "pdf_url": "https://arxiv.org/pdf/2510.21261v1.pdf",
    "title": "Benchmark for two-dimensional large scale coherent structures in   partially magnetized ExB plasmas -- Community collaboration & lessons learned",
    "abstract": "Low-temperature plasmas are essential to both fundamental scientific research and critical industrial applications. As in many areas of science, numerical simulations have become a vital tool for uncovering new physical phenomena and guiding technological development. Code benchmarking remains crucial for verifying implementations and evaluating performance. This work continues the Landmark benchmark initiative, a series specifically designed to support the verification of low-temperature plasma codes. In this study, seventeen simulation codes from a collaborative community of nineteen international institutions modeled a partially magnetized ExB Penning discharge. The emergence of large scale coherent structures, or rotating plasma spokes, endows this configuration with an enormous range of time scales, making it particularly challenging to simulate. The codes showed excellent agreement on the rotation frequency of the spoke as well as key plasma properties, including time-averaged ion density, plasma potential, and electron temperature profiles. Achieving this level of agreement came with challenges, and we share lessons learned on how to conduct future benchmarking campaigns. Comparing code implementations, computational hardware, and simulation runtimes also revealed interesting trends, which are summarized with the aim of guiding future plasma simulation software development.",
    "authors": [
      "Andrew T. Powis",
      "Eduardo Ahedo",
      "Alejandro Álvarez Laguna",
      "Nicolas Barléon",
      "Enrique Bello-Benítez",
      "Lucas Beving",
      "Jean-Pierre Boeuf",
      "Guillaume Bogopolsky",
      "Anne Bourdon",
      "Filippo Cichocki",
      "Bénédicte Cuenot",
      "Andrew Denig",
      "Zoltán Donkó",
      "Paul-Quentin Elias",
      "Miguel P. Encinar",
      "Denis Eremin",
      "Pablo Fajardo",
      "Farbod Faraji",
      "Gwenael Fubiani",
      "Laurent Garrigues",
      "Kentaro Hara",
      "Peter Hartmann",
      "Matthew Hopkins",
      "Igor D. Kaganovich",
      "Aaron Knoll",
      "Giovanni Lapenta",
      "Thierry E. Magin",
      "Alberto Marín-Cebrián",
      "Mario Merino",
      "Pierpaolo Minelli",
      "Mina Papahn Zadeh",
      "Pietro Parodi",
      "Federico Petronio",
      "Maryam Reza",
      "Andrei I. Smolyakov",
      "Dmytro Sydorenko",
      "Francesco Taccogna",
      "Miles M. Turner",
      "Olivier Vermorel",
      "Willca Villafana",
      "Liang Xu"
    ],
    "published": "2025-10-24T08:47:57Z",
    "updated": "2025-10-24T08:47:57Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.20728v2",
    "url": "https://arxiv.org/abs/2508.20728v2",
    "pdf_url": "https://arxiv.org/pdf/2508.20728v2.pdf",
    "title": "Photon reconstruction using the Hough transform in imaging calorimeters",
    "abstract": "Photon reconstruction in calorimeters represents a crucial challenge in particle physics experiments, especially in high-density environments where shower overlapping probabilities become significant. We present an energy-core-based photon reconstruction method. It is achieved through extending the application of the Hough transform to exploit the energy-core structure of photon showers. The method, validated through simulations of the CEPC crystal electromagnetic calorimeter, demonstrates outstanding performance. It achieves a reconstruction efficiency of nearly 100% for photons with energies exceeding 2 GeV and a separation efficiency approaching 100% for two 5 GeV photons, when the distance between them reaches the granularity limit of the calorimeter. This energy-core-based photon reconstruction method, integrated with an energy splitting technique, enhances the performance of photon measurement and provides a promising tool for imaging calorimeters, particularly those requiring high precision in photon detection in complex event topologies with high multiplicity.",
    "authors": [
      "Yang Zhang",
      "Shengsen Sun",
      "Weizheng Song",
      "Fangyi Guo",
      "Yuanzhan Wang",
      "Linghui Wu",
      "Yifang Wang"
    ],
    "published": "2025-08-28T12:50:29Z",
    "updated": "2025-10-24T08:33:46Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2406.14234v2",
    "url": "https://arxiv.org/abs/2406.14234v2",
    "pdf_url": "https://arxiv.org/pdf/2406.14234v2.pdf",
    "title": "Feed-forward active magnetic shielding",
    "abstract": "Magnetic fields from the brain are tiny relative to ambient fields which therefore need to be suppressed. The common solution of passive shielding is expensive, bulky and insufficiently effective, thus motivating research into the alternative of active shielding which comes in two flavours: feed-back and feed-forward. In feed-back designs (the most common), corrective fields are created by coils driven from sensors within the area that they correct, for example from the main sensors of an MEG device. In feed-forward designs (less common), corrective fields are driven from dedicated reference sensors outside the area they correct. Feed-forward can achieve better performance than feed-back, in principle, however its implementation is hobbled by an unavoidable coupling between coils and reference sensors, which reduces the effectiveness of the shielding and may affect stability, complicating the design. This paper suggests a solution that relies on a ``decoupling matrix,\" inserted in the signal pathway between sensors and corrective coils, to counteract the spurious coupling. This allows feed-forward shielding do reduce the ambient field to zero across the full frequency range, in principle, although performance may be limited by other factors such as current noise. The solution, which is fully data-driven and does not require geometric calculations, high-tolerance fabrication, or physical calibration, has been evaluated by simulation, but not implemented in hardware. It might contribute to the deployment of a new generation of measurement systems based on optically-pumped magnetometers (OPM). The lower cost and reduced constraints of those systems are a strong incentive to likewise reduce the cost and constraints of the shielding required to operate them, hence the appeal of active shielding.",
    "authors": [
      "Alain de Cheveigné"
    ],
    "published": "2024-06-20T11:57:11Z",
    "updated": "2025-10-24T08:17:43Z",
    "categories": [
      "physics.med-ph",
      "cs.HC",
      "eess.SP",
      "physics.ins-det",
      "q-bio.NC"
    ],
    "primary_category": "physics.med-ph"
  },
  {
    "arxiv_id": "2504.19236v2",
    "url": "https://arxiv.org/abs/2504.19236v2",
    "pdf_url": "https://arxiv.org/pdf/2504.19236v2.pdf",
    "title": "Neutron source-based event reconstruction algorithm in large liquid   scintillator detectors",
    "abstract": "We developed an event reconstruction algorithm, applicable to large liquid scintillator detectors, built primarily upon neutron calibration data. We employ a likelihood method using photon detection time and charge information from individual photomultiplier tubes. Detector response tables in the likelihood function were derived from americium-carbon neutron source events, 2.2~MeV $\\gamma$-ray events from cosmic-ray muon spallation neutrons, and laser calibration events. This algorithm can reconstruct the event position, energy, and also has capability to differentiate particle types for events within the energy range of reactor neutrinos. Using the detector simulation of the Jiangmen Underground Neutrino Observatory (JUNO) experiment as a large liquid scintillator detector example, we demonstrate that the presented reconstruction algorithm has a reconstructed position accuracy within $\\pm$4~cm, and a reconstructed energy non-uniformity under 0.5\\% throughout the central detector volume. The vertex resolution for positron events at 1~MeV is estimated to be around 9~cm, and the energy resolution is confirmed to be comparable to that in the JUNO official publication. Furthermore, the algorithm can eliminate 80\\% (45\\%) of $\\alpha$-particle (fast-neutron) events while maintaining a positron event selection efficiency of approximately 99\\%.",
    "authors": [
      "Akira Takenaka",
      "Zhangming Chen",
      "Arran Freegard",
      "Junting Huang",
      "Jiaqi Hui",
      "Haojing Lai",
      "Rui Li",
      "Yilin Liao",
      "Jianglai Liu",
      "Yue Meng",
      "Iwan Morton-Blake",
      "Ziqian Xiang",
      "Ping Zhang"
    ],
    "published": "2025-04-27T13:39:02Z",
    "updated": "2025-10-24T07:11:39Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1140/epjc/s10052-025-14808-4"
  },
  {
    "arxiv_id": "2510.16936v2",
    "url": "https://arxiv.org/abs/2510.16936v2",
    "pdf_url": "https://arxiv.org/pdf/2510.16936v2.pdf",
    "title": "Ionization quenching factors and W-values of low-energy H$_2^+$ and   He$^+$ ions in Ar gas at low pressure measured with a bulk resistive   MICROMEGAS",
    "abstract": "The ionization quenching factor, the fraction of an ion's initial kinetic energy lost through ionization in a medium, was measured for H$_2^+$ and He$^+$ ions within the 2.5-5 keV energy range in an Ar/CO$_2$ gas mixture at pressures between 75 and 150 mbar. The mixture was contained in the active volume of a MICROMEGAS type Micro Pattern Gaseous Detector (MPGD), which was connected to an ion source via a high vacuum system. The results showed a significant decrease in ionization as the ion energy decreased, although no dependence on gas pressure was observed within the low pressure range studied. Additionally, significant deviations from the predictions of SRIM (Stopping and Range of Ions in Matter) simulations were found. These measurements also allowed the first determination of $W$ values (the average energy required to create an electron-ion pair in the gas) for H$_2^+$ and He$^+$ ions in Ar at this particular energy range, which had not been previously explored for these projectile-target combinations. These findings are essential for accurate ion energy reconstruction in low-pressure MPGDs, with particular relevance for space-based energetic neutral atom detection, as proposed by the Italian Space Agency's SWEATERS project.",
    "authors": [
      "A. Foresi",
      "G. Antonelli",
      "C. Avanzini",
      "G. Balestri",
      "G. Bigongiari",
      "E. Bossini",
      "M. G. Callaini",
      "R. Carosi",
      "E. De Angelis",
      "F. Frasconi",
      "P. Maestro",
      "F. Morsani",
      "A. Mura",
      "L. Orsini",
      "G. Petragnani",
      "F. Pilo",
      "R. Rispoli",
      "G. Terreni"
    ],
    "published": "2025-10-19T17:15:49Z",
    "updated": "2025-10-24T06:46:05Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1016/j.nima.2025.171066"
  },
  {
    "arxiv_id": "2510.21187v1",
    "url": "https://arxiv.org/abs/2510.21187v1",
    "pdf_url": "https://arxiv.org/pdf/2510.21187v1.pdf",
    "title": "Dissipation and particle acceleration at intermittent structures with   velocity and magnetic shear: Interaction of Kelvin-Helmholtz and Drift-Kink   instabilities",
    "abstract": "We present two-dimensional (2D) particle-in-cell simulations of a magnetized, collisionless, relativistic pair plasma subjected to combined velocity and magnetic-field shear, a scenario typical at intermittent structures in plasma turbulence. We create conditions where only the Kelvin-Helmholtz (KH) and Drift-Kink (DK) instabilities can develop, while tearing modes are forbidden. The interaction of DKI and KHI generates qualitatively new structures, marked by a thickened shear layer with very weak electromagnetic field, modulated by KH vortices. Over a range of moderately strong velocity shears explored, the interaction of DKI and KHI results in a significant enhancement of dissipation over cases with only velocity shear or only magnetic shear. Moreover, we observe a new and efficient way of particle acceleration where particles are stochastically accelerated by the motional electric field exterior to the shear layer as they meander in an S-shaped pattern in and out of it. This process takes advantage of the bent geometry of the shear layer caused by the DK-KHI interaction and is responsible for most of the highest-energy particles produced in our simulations. These results further our understanding of dissipation and particle acceleration at intermittent structures, which are present in plasma turbulence across a wide range of astrophysical contexts such as in AGN jet sheaths, potentially relevant to limb-brightened emission, etc., and highlight the sensitivity of dissipation to multiple interacting instabilities, thus providing a strong motivation for further studies of their nonlinear interaction at the kinetic level.",
    "authors": [
      "Tsun Hin Navin Tsung",
      "Gregory R. Werner",
      "Dmitri A. Uzdensky",
      "Mitchell C. Begelman"
    ],
    "published": "2025-10-24T06:32:30Z",
    "updated": "2025-10-24T06:32:30Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2510.21170v1",
    "url": "https://arxiv.org/abs/2510.21170v1",
    "pdf_url": "https://arxiv.org/pdf/2510.21170v1.pdf",
    "title": "Inhomogeneous mixing: From microscopic dynamics to mesoscopic staircases",
    "abstract": "Inhomogeneous mixing and the consequent mesoscopic layered structure have been observed in many physical systems, including magnetically confined fusion plasmas. Especially, in plasmas, mixing can be enhanced through turbulence spreading by intermittent coherent structures (blobs/voids), or suppressed due to the formation of transport barriers (sheared zonal flows). Interestingly, blobs/voids and zonal flows are not independent, and they can co-exist in a state of inhomogeneous mixing, often called the E x B staircase. In this paper, we first introduce recent experimental progress on the physics of blobs/voids: how turbulence spreading by blobs/voids occurs, the consequences of enhanced turbulence spreading for the power decay length, and the interaction between blobs/voids and zonal flows. Then, we provide a brief review of experimental results on staircases, or more generally layered mesoscopic transport barriers. Staircases are often elusive and different complementary methods have been utilized to identify them, but our understanding is still incomplete. This paper serves as an initial step toward applying insights gained from inhomogeneous mixing due to blobs/voids to the understanding of a staircase.",
    "authors": [
      "T. Long",
      "M. J. Choi",
      "P. H. Diamond"
    ],
    "published": "2025-10-24T05:50:33Z",
    "updated": "2025-10-24T05:50:33Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.04232v2",
    "url": "https://arxiv.org/abs/2508.04232v2",
    "pdf_url": "https://arxiv.org/pdf/2508.04232v2.pdf",
    "title": "Enhanced sensitivity to trace $^{238}$U impurity of sapphire via   coincidence neutron activation analysis",
    "abstract": "Sapphire has mechanical and electrical properties that are advantageous for the construction of internal components of radiation detectors such as time projection chambers and bolometers. However, it has proved difficult to assess its $\\rm ^{232}Th$ and $\\rm ^{238}U$ content down to the picogram per gram level. This work reports an experimental verification of a computational study that demonstrates $\\gamma\\gamma$ coincidence counting, coupled with neutron activation analysis (NAA), can reach ppt sensitivities. Combining results from $\\gamma\\gamma$ coincidence counting with those of earlier single-$\\gamma$ counting based NAA shows that a sample of Saint Gobain sapphire has $\\rm ^{232}Th$ and $\\rm ^{238}U$ concentrations of $<0.26$ ppt and $<2.3$ ppt, respectively; the best constraints on the radiopurity of sapphire.",
    "authors": [
      "D. Chernyak",
      "I. J. Arnquist",
      "T. Daniels",
      "S. W. Finch",
      "L. Hissong",
      "M. Hughes",
      "R. MacLellan",
      "A. Piepke",
      "A. Pocar",
      "R. Roshong",
      "R. Saldanha",
      "R. H. M. Tsang"
    ],
    "published": "2025-08-06T09:15:19Z",
    "updated": "2025-10-24T02:29:29Z",
    "categories": [
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "nucl-ex",
    "doi": "10.1103/zgzm-w5f4"
  },
  {
    "arxiv_id": "2510.21064v1",
    "url": "https://arxiv.org/abs/2510.21064v1",
    "pdf_url": "https://arxiv.org/pdf/2510.21064v1.pdf",
    "title": "Efficient Water-Cooled Bitter-Type Electromagnet for Zeeman Slowing in   Cold-Atom Experiments",
    "abstract": "We describe the design, construction, and characterization of a Bitter-type electromagnet that produces a spatially-dependent magnetic field used for Zeeman slowing in cold-atom experiments. The coil consists of stacked copper arcs separated by PTFE spacers of varying thicknesses, generating a near-optimal field profile using a single power supply. With an electrical resistance of $26.5(3)$~m$\\Omega$ and self-inductance of $19.1(1)$~$\\mu$H, our design achieves a fast electrical switching time of $\\tau \\approx 180$~$\\mu$s in a compact, 30-cm-long package. Water circulating helically through holes in the copper and channels in the spacers ensures efficient thermal management, limiting the temperature rise to $\\sim 5^\\circ$~C over $36$~s of continuous operation at $200$~A.",
    "authors": [
      "Rishav Koirala",
      "Ben A. Olsen"
    ],
    "published": "2025-10-24T00:36:17Z",
    "updated": "2025-10-24T00:36:17Z",
    "categories": [
      "physics.atom-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2506.12550v2",
    "url": "https://arxiv.org/abs/2506.12550v2",
    "pdf_url": "https://arxiv.org/pdf/2506.12550v2.pdf",
    "title": "Emission Properties of a Hybrid Metallized Diamond(001) Photocathode",
    "abstract": "The spectral emission characteristics of a proof-of-concept hybrid metallized diamond(001) photocathode are presented. The quantum efficiency (QE) is shown to be determined by the photo-injection efficiency across the ohmic contact at the back metallized face, whereas the mean transverse energy (MTE) of the photoemitted electrons is consistent with a (optical)phonon-assisted and momentum-resonant Franck-Condon mechanism [Phys. Rev. Applied 23, 054065 (2025)] following electron drift transport to the untreated diamond(001) front emission face. Emission is observed from both the lower and upper conduction bands of diamond with positive and negative electron affinity respectively. A potential route to the realization of a red-visible photocathode based on this concept with a sub-50meV MTE and a QE greater than 0.1% is discussed.",
    "authors": [
      "Louis A. Angeloni",
      "Ir-Jene Shan",
      "W. Andreas Schroeder"
    ],
    "published": "2025-06-14T15:48:21Z",
    "updated": "2025-10-23T23:49:02Z",
    "categories": [
      "physics.acc-ph",
      "cond-mat.mtrl-sci",
      "cond-mat.other"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.20980v1",
    "url": "https://arxiv.org/abs/2510.20980v1",
    "pdf_url": "https://arxiv.org/pdf/2510.20980v1.pdf",
    "title": "Grain Boundary Diffusion in Yukawa Crystals",
    "abstract": "We present calculations of diffusion coefficients in grain boundaries in Yukawa crystals for astrophysics. Our methods follow from our recent work calculating diffusion coefficients in perfect body-centered cubic crystals. These diffusion coefficients show only a weak dependence on the crystal orientations at the grain boundary and are consistent with those expected for a supercooled liquid scaled down by one to two orders of magnitude. We argue that the local disorder at the grain boundary produces a landscape of potential barriers similar to that of an amorphous liquid thin film, significantly reducing activation barriers to diffusive hops relative to the bulk solid. This also introduces a screening dependence, such that boundary diffusion does not exhibit the same universality as the bulk crystal. These diffusion coefficients suggest that grain boundaries may be a dominant source of viscous dissipation in neutron star crusts.",
    "authors": [
      "Matthew E. Caplan",
      "Nevin T. Smith",
      "Dany Yaacoub",
      "Roberto F. Serrano",
      "Elias Taira",
      "Ashley Bransgrove"
    ],
    "published": "2025-10-23T20:17:51Z",
    "updated": "2025-10-23T20:17:51Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.20977v1",
    "url": "https://arxiv.org/abs/2510.20977v1",
    "pdf_url": "https://arxiv.org/pdf/2510.20977v1.pdf",
    "title": "Significant Amplification of Turbulent Energy Dissipation through the   Shock Transition at Mars",
    "abstract": "Turbulence is fundamental to energy transfer across scales in space and astrophysical plasmas. Bow shock interactions have long been hypothesized to significantly modify turbulence in planetary environments, yet the quantification of such effects and their parametric dependencies remain largely unaddressed. Using in situ long-term high-time resolution measurements from NASA's MAVEN mission, we report the first observational characterization of the evolution and parametric dependence of the turbulence energy cascade rate $\\varepsilon_C$ at magnetohydrodynamic (MHD) scales. Key findings reveal an averaged three-order-of-magnitude enhancement in $\\varepsilon_C$ when transitioning from the solar wind to the magnetosheath. Notably, downstream measurements of oblique and quasi-perpendicular shocks exhibit higher energy dissipation rates than those of quasi-parallel configurations. These results provide the first direct evidence linking shock obliquity to turbulence amplification, offering key insights into shock-mediated turbulence in similar but inaccessible systems.",
    "authors": [
      "Wence Jiang",
      "Hui Li",
      "Nahuel Andrés",
      "Lina Hadid",
      "Daniel Verscharen",
      "Chi Wang"
    ],
    "published": "2025-10-23T20:14:41Z",
    "updated": "2025-10-23T20:14:41Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.20924v1",
    "url": "https://arxiv.org/abs/2510.20924v1",
    "pdf_url": "https://arxiv.org/pdf/2510.20924v1.pdf",
    "title": "Boron Nitride Coatings for the Enhanced Detection of Neutrons in CR-39",
    "abstract": "The neutron detection efficiency of Columbia Resin 39 (CR-39) nuclear track detectors was assessed for AmBe, 252Cf, and D-T (14 MeV) neutron source spectra. A boron nitride (BN) coating for CR-39 was developed to enhance the neutron detection efficiency by converting neutrons into energetic alpha particles through the well-known 10B(n,a)7Li reaction. Separate partially coated CR-39 pieces were exposed to each neutron source and subsequently analyzed under optical microscope and through large-area Scanning Electron Microscopy (SEM) imaging over the irradiated area. The detection efficiency (tracks per neutron) was evaluated for each source spectra under optical and scanning electron microscopes and with or without BN coating. This resulted in a comprehensive guide to neutron detection with various sources using CR-39.",
    "authors": [
      "Noah DAmico",
      "Sandeep Puri",
      "Ian Jones",
      "Andrew Gillespie",
      "Cuikun Lin",
      "Bo Zhao",
      "R. V. Duncan"
    ],
    "published": "2025-10-23T18:22:52Z",
    "updated": "2025-10-23T18:22:52Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2502.04808v2",
    "url": "https://arxiv.org/abs/2502.04808v2",
    "pdf_url": "https://arxiv.org/pdf/2502.04808v2.pdf",
    "title": "Tracking electron capture processes in classical molecular dynamics   simulations for spectral line broadening in plasmas",
    "abstract": "Plasma spectroscopy is a fundamental tool for diagnosing laboratory and astrophysical plasmas. Accurate interpretation of spectra depends upon precise modeling and comprehension of Stark broadening and other mechanisms affecting spectral lines. In this context, computer simulations have emerged as valuable tools, offering idealized experiments with well-defined conditions. Molecular dynamics simulations, in particular, excel at replicating the particle interactions within the plasma and their impact on the state of a radiating atom or ion. However, these simulations present challenges in tracking electron capture processes, since setting an unambiguous criterion to distinguish between bound and free electrons is not trivial. In this paper we introduce a new algorithm that, within a classical framework, precisely identifies the scenario in which an electron is captured by an ion and then follows a stable orbit around it. The algorithm's applicability extends to emitters with charges Z >= 1. The procedure enables the correct identification of valid time-histories of the electric microfield perturbing the emitting ion, which will be used for subsequent line shape calculations. The ionization balance results obtained from the application of this algorithm are compared with an additional method based on the potential energy of the particles in the simulations, finding good agreement, therefore validating the use of this approach.",
    "authors": [
      "D. González-Herrero",
      "G. Pérez-Callejo",
      "R. Florido",
      "M. A. Gigosos"
    ],
    "published": "2025-02-07T10:23:32Z",
    "updated": "2025-10-23T17:52:01Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.IM",
      "physics.atom-ph",
      "physics.comp-ph",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.20775v1",
    "url": "https://arxiv.org/abs/2510.20775v1",
    "pdf_url": "https://arxiv.org/pdf/2510.20775v1.pdf",
    "title": "The Opacity Project: R-Matrix Calculations for Opacities of   High-Energy-Density Astrophysical and Laboratory Plasmas",
    "abstract": "Accurate determination of opacity is critical for understanding radiation transport in both astrophysical and laboratory plasmas. We employ atomic data from R-Matrix calculations to investigate radiative properties in high-energy-density (HED) plasma sources. Specifically, we analyze environments such as the base of the convective zone (BCZ) of the Sun 2 x 10^6$ K, N_e = 10^{23}/cc and the inertial confinement fusion (ICF) device at the Sandia Z facility 2.11 x 10^6 K, N_e = 3.16 x 10^{22}/cc. We calculate Rosseland Mean Opacities (RMO) within a range of temperatures and densities and analyze how they vary under different plasma conditions. In this study, we specifically focus on electron collisional and Stark ion microfield broadening effects on autoionizing resonances in photoabsorption cross sections. Our results are relevant to astrophysical models, particularly in the context of the solar opacity problem, and provide insights into discrepancies between theoretical calculations and experimental measurements. In addition, we investigate the equation-of-state (EOS) and its impact on opacities. In addition, we examine the equation-of-state (EOS) and its impact on opacities of the \"chemical picture\" Mihalas-Hummer-Dappen EOS with respect to level populations of excited levels included in the R-matrix calculations. This study should contribute to improving opacity models of HED sources such as stellar interiors adn laboratory fusion plasma experiments.",
    "authors": [
      "Anil K. Pradhan",
      "Sultana N. Nahar"
    ],
    "published": "2025-10-23T17:47:36Z",
    "updated": "2025-10-23T17:47:36Z",
    "categories": [
      "astro-ph.HE",
      "astro-ph.SR",
      "physics.atom-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE",
    "doi": "10.3390/atoms13100085"
  },
  {
    "arxiv_id": "2508.12111v2",
    "url": "https://arxiv.org/abs/2508.12111v2",
    "pdf_url": "https://arxiv.org/pdf/2508.12111v2.pdf",
    "title": "CosmicWatch: The Desktop Muon Detector(v3X)",
    "abstract": "The CosmicWatch Desktop Muon Detector (v3X) is a compact, low-cost, and portable device designed for detecting ionizing radiation, including cosmic-ray muons. Building on previous iterations, the v3X introduces significant hardware and firmware improvements that enhance sensitivity, usability, and data acquisition capabilities. The detector integrates a plastic scintillator and silicon photomultiplier (SiPM), custom designed electronics for signal processing, onboard data storage, OLED display, environmental sensors, and USB connectivity. With a total component cost under \\$100 and a build time suitable for high school students, the v3X is ideal for education, outreach, and introductory research applications in particle and astroparticle physics. This paper details the design, performance, and potential use cases of the v3X, supported by example measurements demonstrating its functionality.",
    "authors": [
      "Spencer Axani",
      "Masooma Sarfraz",
      "Miles Garcia",
      "Collin Owens",
      "Katarzyna Frankiewicz",
      "Janet M. Conrad"
    ],
    "published": "2025-08-16T17:32:22Z",
    "updated": "2025-10-23T17:07:53Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/10/P10040"
  }
]