{
  "arxiv_id": "2602.16896v1",
  "url": "https://arxiv.org/abs/2602.16896v1",
  "pdf_url": "https://arxiv.org/pdf/2602.16896v1.pdf",
  "title": "Numerical study of electron acceleration by microwave-driven plasma wakefields in rectangular waveguides",
  "abstract": "Plasma-based acceleration schemes have attracted sustained interest as a pathway toward compact particle accelerators, owing to the large electric fields supported by plasmas. Although recent studies have demonstrated the excitation of plasma wakefields using high-power microwave pulses in plasma-filled waveguides, the conditions required for efficient electron acceleration in such configurations remain insufficiently characterized. In this work, we investigate the acceleration of externally injected electrons by microwave-driven plasma wakefields in rectangular waveguides filled with low-density plasma. Three-dimensional particle-in-cell simulations are employed to analyze the dynamics of electron injection and energy gain under both reduced and fully self-consistent numerical models. The results show that electron acceleration is strongly dependent on the injection phase and initial velocity. Optimal acceleration is achieved when electrons are pre-accelerated to velocities close to the group velocity of the driving microwave pulse. For the parameters considered, energy gains of the order of $10^2 \\mathrm{keV}$ are obtained over interaction lengths of the order of meters, while maintaining a quasi-monoenergetic energy distribution under suitable injection conditions. The influence of transverse dynamics and space-charge effects is also examined, revealing additional constraints on acceleration efficiency associated with the transverse electromagnetic field of the driving microwave pulse. These results provide a quantitative assessment of the acceleration stage in microwave-driven plasma wakefield schemes and support their evaluation as a viable platform for compact plasma-based accelerators.",
  "authors": [
    "Jesús E. López",
    "Eduardo A. Orozco-Ospino"
  ],
  "published": "2026-02-18T21:27:00Z",
  "updated": "2026-02-18T21:27:00Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}