{
  "arxiv_id": "2602.17429v2",
  "url": "https://arxiv.org/abs/2602.17429v2",
  "pdf_url": "https://arxiv.org/pdf/2602.17429v2.pdf",
  "title": "Self-Consistent Dynamics of Electron Radiation Reaction via Structure-Preserving Geometric Algorithms for Coupled Schrödinger-Maxwell Systems",
  "abstract": "Classically, a charged particle in a magnetic field emits radiation, losing momentum and experiencing the Abraham-Lorentz (AL) / Landau-Lifshitz (LL) radiation reaction (RR) force. However, at atomic scales and outside the range of their applicability, the AL/LL equations fail and RR destroys the coherent state of an electron-undermining the very concept of a RR force. This process can be described by the coupled Schrödinger-Maxwell (SM) system under appropriate limits, but the system's nonlinear complexity has long limited purely analytical studies. We present geometric structure-preserving algorithms for the SM system that preserve gauge invariance, symplecticity, and unitarity on the discrete space-time lattice, which are implemented in our Structure-Preserving scHrodINger maXwell (SPHINX) code. By constructing coherent states from the Landau levels, SPHINX simulates the fully-coupled nonlinear dynamics of an electron coherent state, the energy partition evolution, and decoherence/relaxation of the electron wave packet in time due to RR. These simulations indicate that, in an external magnetic field, an electron prepared in an atomic-scale coherent state can radiate strongly, rapidly losing coherence and dispersing into a decoherent wave packet. Additionally, we also present the fully-coupled nonlinear evolution of the non-degenerate ground- and first-excited Landau levels themselves to understand how the coupled SM system modifies the well-known ideal (i.e., Schrödinger-only) dynamics of the Landau Levels. With appropriate boundary conditions, simulations show that the Landau levels are renormalized into stationary dressed eigenstates with constant electromagnetic and kinetic energies. This opens a new computational window into RR physics and advances modeling of extreme-field phenomena in fusion plasmas, astrophysics, and next-generation laser experiments",
  "authors": [
    "Jacob Matthew Molina",
    "Hong Qin"
  ],
  "published": "2026-02-19T14:59:05Z",
  "updated": "2026-02-20T11:25:54Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}