[
  {
    "arxiv_id": "2509.16401v3",
    "url": "https://arxiv.org/abs/2509.16401v3",
    "pdf_url": "https://arxiv.org/pdf/2509.16401v3.pdf",
    "title": "Quantifying the Effects of Parameters in Widespread SEP Events with EPREM",
    "abstract": "The Energetic Particle Radiation Environment Model (EPREM) solves the focused transport equation (FTE) on a Lagrangian grid in a frame co-moving with the solar wind plasma and simulates the acceleration and transport of solar energetic particles (SEP) in the heliosphere. When not coupled to an external magnetohydrodynamic model, EPREM functions in an uncoupled mode where an ideal cone-shock is injected into a homogeneous background solar wind. We carried out an analysis of the effects of multiple physical parameters in producing widespread SEP events simulated by the uncoupled EPREM using a relatively simple model of a strong magnetized shock propagating radially outward through the inner heliosphere to produce the requisite MHD quantities for EPREM's sophisticated model of proton acceleration and transport. We compared a baseline simulation with seven variations in which the value of a single parameter differed from its baseline value. All simulations exhibit complex profiles of SEP flux as a function of time and energy, with clear dependence on parameters related to diffusion, mean free path, and shock profile. Moreover, while all simulations exhibit significant longitudinal spread in SEP flux, for certain parameter values there exists a decrease or absence in SEP flux at observers located $\\geq 90^\\circ$ from the shock origin. Relating the differences in SEP flux to the specific values of each parameter in the simulations provides insight into the morphology of observed SEP events and the state of the solar wind through which the driving CME propagates.",
    "authors": [
      "Matthew A. Young",
      "Bala Poduval"
    ],
    "published": "2025-09-19T20:23:20Z",
    "updated": "2026-02-20T18:37:12Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2602.17429v2",
    "url": "https://arxiv.org/abs/2602.17429v2",
    "pdf_url": "https://arxiv.org/pdf/2602.17429v2.pdf",
    "title": "Self-Consistent Dynamics of Electron Radiation Reaction via Structure-Preserving Geometric Algorithms for Coupled Schrödinger-Maxwell Systems",
    "abstract": "Classically, a charged particle in a magnetic field emits radiation, losing momentum and experiencing the Abraham-Lorentz (AL) / Landau-Lifshitz (LL) radiation reaction (RR) force. However, at atomic scales and outside the range of their applicability, the AL/LL equations fail and RR destroys the coherent state of an electron-undermining the very concept of a RR force. This process can be described by the coupled Schrödinger-Maxwell (SM) system under appropriate limits, but the system's nonlinear complexity has long limited purely analytical studies. We present geometric structure-preserving algorithms for the SM system that preserve gauge invariance, symplecticity, and unitarity on the discrete space-time lattice, which are implemented in our Structure-Preserving scHrodINger maXwell (SPHINX) code. By constructing coherent states from the Landau levels, SPHINX simulates the fully-coupled nonlinear dynamics of an electron coherent state, the energy partition evolution, and decoherence/relaxation of the electron wave packet in time due to RR. These simulations indicate that, in an external magnetic field, an electron prepared in an atomic-scale coherent state can radiate strongly, rapidly losing coherence and dispersing into a decoherent wave packet. Additionally, we also present the fully-coupled nonlinear evolution of the non-degenerate ground- and first-excited Landau levels themselves to understand how the coupled SM system modifies the well-known ideal (i.e., Schrödinger-only) dynamics of the Landau Levels. With appropriate boundary conditions, simulations show that the Landau levels are renormalized into stationary dressed eigenstates with constant electromagnetic and kinetic energies. This opens a new computational window into RR physics and advances modeling of extreme-field phenomena in fusion plasmas, astrophysics, and next-generation laser experiments",
    "authors": [
      "Jacob Matthew Molina",
      "Hong Qin"
    ],
    "published": "2026-02-19T14:59:05Z",
    "updated": "2026-02-20T11:25:54Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.17964v1",
    "url": "https://arxiv.org/abs/2602.17964v1",
    "pdf_url": "https://arxiv.org/pdf/2602.17964v1.pdf",
    "title": "Nonlinear Saturation of Ballooning Modes in Stellarators",
    "abstract": "Ballooning mode saturation is investigated in realistic stellarator configurations using the flux tube approach of Ham et. al. [1] [2]. The method is adapted to account for the lack of exact force balance in stellarator equilibrium solvers that assume existence of nested flux surfaces. A variational approach for calculating flux tube energy is developed to overcome this force error problem in stellarator numerical equilibria. Saturated (equilibrium) flux tube states that cross 10-20% of the plasma minor radius are shown to exist for linearly ballooning unstable profiles. It is shown that several features of the displaced flux tube structure in a full nonlinear MHD simulation of Wendelstein 7X are reproduced by our model. Saturated states are found in a compact stellarator equilibrium close but below the marginal ballooning linear instability, i.e. the unperturbed equilibrium is metastable. This suggests that Edge-Localized-Mode-like explosive MHD behavior may be possible in stellarators.",
    "authors": [
      "X. Chu",
      "S. C. Cowley",
      "N. Ferraro",
      "Y. Zhou",
      "F. I. Parra"
    ],
    "published": "2026-02-20T03:48:37Z",
    "updated": "2026-02-20T03:48:37Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.05507v3",
    "url": "https://arxiv.org/abs/2510.05507v3",
    "pdf_url": "https://arxiv.org/pdf/2510.05507v3.pdf",
    "title": "Prediction of Spallation Induced Transmutation Rates For Long Lived Fission Products via Proton Accelerator",
    "abstract": "Long lived fission products represent a major challenge in nuclear waste management due to persistent radiotoxicity over very long timescales. This study focuses on six of these fission products: Se-79, Zr-93, Tc-99, Sn-126, I-127, Cs-135. This study investigates the feasibility of spallation driven transmutation, in which a high energy proton beam strikes a heavy spallation target to generate neutrons that induce transmutation in the fission products surrounding the target. Lead and depleted uranium are identified as the principal spallation target candidates, reflecting contrasting trade offs in neutron yield, secondary reactions, and heat generation. Simulations assess nuclide specific behavior under reactor scale inventories and practical geometric constraints. Results demonstrate that technetium, iodine, and selenium are strong candidates for transmutation using this pathway, while tin shows partial resistance but benefits from thermal flux. By contrast, zirconium is neutron transparent and inefficient to transmute, and cesium suffers from low net reduction due to competition with lighter isotopes. Cost effectiveness is highly isotope dependent: technetium is most favorable, whereas cesium and zirconium remain expensive. These findings highlight the advantages and limitations of spallation driven systems and motivate strategies with optimized target-blanket designs.",
    "authors": [
      "Grigor Tukharyan",
      "William Reed Kendrick",
      "Areg Danagoulian",
      "Benoit Forget"
    ],
    "published": "2025-10-07T01:51:34Z",
    "updated": "2026-02-19T21:31:15Z",
    "categories": [
      "physics.acc-ph",
      "nucl-ex"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.1038/s41598-026-38736-9"
  },
  {
    "arxiv_id": "2602.16074v2",
    "url": "https://arxiv.org/abs/2602.16074v2",
    "pdf_url": "https://arxiv.org/pdf/2602.16074v2.pdf",
    "title": "Melting Coulomb clusters through nonreciprocity-enhanced parametric pumping",
    "abstract": "Complex systems out of equilibrium often experience intermittent oscillations between quiescent and highly dynamic states. The type of intermittency depends on how energy is pumped into the system, and how it is dissipated. While intermittency is usually driven by stochastic noise or external forcing, energy can also be sourced from field-mediated interactions between particles, which are often nonreciprocal and effectively violate Newton's 3rd law. Here we demonstrate how nonreciprocal interactions produce intermittency in clusters of charged micron-sized particles confined in a plasma sheath. Through three-dimensional particle tracking, we observe that vertical oscillations, induced by fluctuations of the plasma environment, can be parametrically coupled to the horizontal modes. Experiments and simulations show that nonreciprocal interactions strongly amplify this parametric coupling, creating a positive feedback loop that drives explosive growth of both the horizontal and vertical modes. This mechanism triggers abrupt melting transitions from an ordered cluster to an ergodic gas-like state, and leads to intermittent switching between states over long time scales. Overall, our work identifies nonreciprocal interactions as a key mechanism through which strongly coupled finite systems transform interaction-mediated activity into dynamical nonequilibrium states.",
    "authors": [
      "Zhicheng Shu",
      "Wei-Chih Li",
      "Wentao Yu",
      "Justin C. Burton"
    ],
    "published": "2026-02-17T22:57:46Z",
    "updated": "2026-02-19T19:57:30Z",
    "categories": [
      "cond-mat.soft",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.soft"
  },
  {
    "arxiv_id": "2602.17606v1",
    "url": "https://arxiv.org/abs/2602.17606v1",
    "pdf_url": "https://arxiv.org/pdf/2602.17606v1.pdf",
    "title": "Characterization of compressible fluctuations in solar wind streams dominated by balanced and imbalanced turbulence: Parker Solar Probe, Solar Orbiter and Wind observations",
    "abstract": "Characterizing compressible fluctuations in the solar wind is essential for understanding their role in solar wind acceleration and heating, yet their origin and evolution across different turbulence regimes remain poorly understood. In this study, we carry out a statistical analysis of the properties of compressible fluctuations in solar wind dominated by balanced and imbalanced turbulence. Using in-situ measurements from Wind, Solar Orbiter, and Parker Solar Probe, we investigate the scale dependence of density and magnetic field fluctuations and their correlations with plasma beta and radial distance. Our results indicate that solar wind compressibility is likely affected by both expansion effects and compressible dynamics governed by local plasma conditions. The non-Alfvenic wind is dominated by anti-correlated fluctuations, whereas the Alfvenic wind contains a mixture of correlated and anti-correlated fluctuations, though the latter remain prevalent. While the anti-correlated component is consistent with MHD slow magnetosonic modes, the correlated (fast mode-like) component is not reproduced by predictions from either linear MHD theory or nonlinear models of forced compressible fluctuations. Nevertheless, the dominant slow mode component explains the observed dependence on beta and the enhanced density fluctuations measured by Parker Solar Probe. This further suggests that slow mode waves contribute significantly to the compressible energy budget near the Sun and may play an important role in solar wind heating and acceleration close to the Sun.",
    "authors": [
      "C. A. Gonzalez",
      "C. Gonzalez",
      "A. Tenerani"
    ],
    "published": "2026-02-19T18:31:00Z",
    "updated": "2026-02-19T18:31:00Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "1201.1154v2",
    "url": "https://arxiv.org/abs/1201.1154v2",
    "pdf_url": "https://arxiv.org/pdf/1201.1154v2.pdf",
    "title": "Magnetic Alloy/Ferrite cavities",
    "abstract": "RF cavities loaded with magnetic alloy (MA) or ferrite ring cores are used in synchrotrons and storage rings if the maximum RF frequency is in the order of a few MHz. A simple model for the description of cavities of this type is derived. The most important parameters are defined, and some properties of the material and of the cavity are summarized. Different cavity configurations, development aspects, and several practical topics are covered. A few specific ferrite- and MA-loaded cavity systems are discussed as examples.",
    "authors": [
      "Harald Klingbeil"
    ],
    "published": "2012-01-05T12:50:29Z",
    "updated": "2026-02-19T17:07:41Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.17536v1",
    "url": "https://arxiv.org/abs/2602.17536v1",
    "pdf_url": "https://arxiv.org/pdf/2602.17536v1.pdf",
    "title": "Toward a Fully Autonomous, AI-Native Particle Accelerator",
    "abstract": "This position paper presents a vision for self-driving particle accelerators that operate autonomously with minimal human intervention. We propose that future facilities be designed through artificial intelligence (AI) co-design, where AI jointly optimizes the accelerator lattice, diagnostics, and science application from inception to maximize performance while enabling autonomous operation. Rather than retrofitting AI onto human-centric systems, we envision facilities designed from the ground up as AI-native platforms. We outline nine critical research thrusts spanning agentic control architectures, knowledge integration, adaptive learning, digital twins, health monitoring, safety frameworks, modular hardware design, multimodal data fusion, and cross-domain collaboration. This roadmap aims to guide the accelerator community toward a future where AI-driven design and operation deliver unprecedented science output and reliability.",
    "authors": [
      "Chris Tennant"
    ],
    "published": "2026-02-19T16:49:36Z",
    "updated": "2026-02-19T16:49:36Z",
    "categories": [
      "physics.acc-ph",
      "cs.AI"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.17514v1",
    "url": "https://arxiv.org/abs/2602.17514v1",
    "pdf_url": "https://arxiv.org/pdf/2602.17514v1.pdf",
    "title": "A Kinetic Route to Helicity-Constrained Decay",
    "abstract": "Through 2D3V PIC simulations of freely decaying sub-ion turbulence, intermittent localized regions with $\\mathbf{E} \\cdot \\mathbf{B} \\neq 0$ are found to be statistically associated with reductions in the magnitude of magnetic helicity while evolving in the early electron-scale interaction phase. Motivated by this behavior, we propose a source-compensated, history-dependent helicity density that satisfies an exact local balance identity by construction, enabling Saffman-type two-point correlation integrals which, under standard flux-decorrelation assumptions, can exhibit intermediate-scale plateaus that are roughly time-independent. In our simulations we demonstrate such plateaus to remain approximately invariant even as the usual Saffman helicity integral plateau value $I_H$ evolves during the early kinetic stage. Under approximate single-scale self-similarity, the plateau behavior of the magnetic integral is consistent with the 2D decay constraint $BL \\sim \\text{const}$. For initially net-helical configurations, we observe rapid development of mixed-signed magnetic helicity patches and a decrease of the global fractional helicity, such that the decay over the kinetic interval is again most consistent with the cancellation-dominated scaling constraint.",
    "authors": [
      "Dion Li"
    ],
    "published": "2026-02-19T16:25:22Z",
    "updated": "2026-02-19T16:25:22Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE",
      "astro-ph.SR",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.17487v1",
    "url": "https://arxiv.org/abs/2602.17487v1",
    "pdf_url": "https://arxiv.org/pdf/2602.17487v1.pdf",
    "title": "Modeling of Relativistic Plasmas with a Conservative Discontinuous Galerkin Method",
    "abstract": "We present a new method for solving the relativistic Vlasov--Maxwell system of equations, applicable to a wide range of extreme high-energy-density astrophysical and laboratory environments. The method directly discretizes the kinetic equation on a high-dimensional phase-space grid using a discontinuous Galerkin finite element approach, yielding a high-order, conservative numerical scheme that is free from the Poisson noise inherent to traditional Monte-Carlo methods. A novel and flexible velocity-space mapping technique enables the efficient treatment of the wide range of energy scales characteristic of relativistic plasmas, including QED pair-production discharges, instabilities in strongly magnetized plasmas surrounding neutron stars, and relativistic magnetic reconnection. Our noise-free approach is capable of providing unique insight into plasma dynamics, enabling detailed analysis of electromagnetic emission and fine-scale phase-space structure.",
    "authors": [
      "James Juno",
      "Grant Johnson",
      "Alexander Philippov",
      "Ammar Hakim",
      "Alexander Chernoglazov",
      "Shuzhe Zeng"
    ],
    "published": "2026-02-19T15:57:32Z",
    "updated": "2026-02-19T15:57:32Z",
    "categories": [
      "astro-ph.HE",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2602.17468v1",
    "url": "https://arxiv.org/abs/2602.17468v1",
    "pdf_url": "https://arxiv.org/pdf/2602.17468v1.pdf",
    "title": "Tolerances to driver-witness misalignment in a quasilinear plasma wakefield accelerator",
    "abstract": "Plasma-based accelerators offer high accelerating gradients and scalability through staging or long plasma sources, which makes them good candidates for future accelerator and collider concepts. Proton-driven accelerators in particular have the potential to bring particles to high energy in a single stage. In the quasilinear regime - where the plasma wake is only partially evacuated - a witness bunch of electrons drives a cavitated wake, which acts to preserve the emittance of the portion of the witness inside this self-blowout. In the case of a misalignment between the driver and witness, this behaviour can persist, but its effectiveness is reduced. In this paper, we study transverse witness dynamics in this regime, and develop analytical models to describe the witness motion, and develop a metric to estimate emittance preservation based on a single parameter which estimates the density of the witness after phase mixing. Particle in cell simulations using the AWAKE Run 2c baseline parameters show excellent agreement with the predictive models developed. This work allows alignment constraints to be set both for the AWAKE experiment and other wakefield acceleration schemes operating in the quasilinear regime.",
    "authors": [
      "T. C. Wilson",
      "J. Farmer",
      "K. Lotov",
      "A. Pukhov"
    ],
    "published": "2026-02-19T15:34:28Z",
    "updated": "2026-02-19T15:34:28Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.17404v1",
    "url": "https://arxiv.org/abs/2602.17404v1",
    "pdf_url": "https://arxiv.org/pdf/2602.17404v1.pdf",
    "title": "Plasma Mixing in Collisionless Kelvin-Helmholtz Dynamics",
    "abstract": "Simulations and observations of the low-latitude magnetosphere-magnetosheath boundary layer indicate that the Kelvin-Helmholtz instability (KHI) drives vortex structures that enhance plasma mixing and magnetic reconnection, influencing transport and particle acceleration. We investigate the efficiency and physical mechanisms of plasma mixing driven by the nonlinear evolution of the KHI. We perform high-resolution two-dimensional Particle-In-Cell (PIC) simulations using a finite-Larmor-radius shear-flow initial configuration. Plasma mixing is quantified using particle tracking, passive tracers, and diagnostics of magnetic reconnection. Mixing across the shear layer is present but localized, occurring mainly in narrow interface regions and plasma structures. Ions mix more effectively than electrons, which remain largely frozen to field lines. Enhanced mixing correlates with localized reconnection within and between KH vortices. Cross-boundary transport driven by the kinetic KHI is highly localized and mediated by vortex advection and reconnection. Electron mixing is strongly constrained, providing an upper bound on kinetic-scale transport across collisionless shear layers.",
    "authors": [
      "Silvia Ferro",
      "Fabio Bacchini",
      "Giuseppe Arrò",
      "Francesco Pucci",
      "Pierre Henri"
    ],
    "published": "2026-02-19T14:29:51Z",
    "updated": "2026-02-19T14:29:51Z",
    "categories": [
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.17400v1",
    "url": "https://arxiv.org/abs/2602.17400v1",
    "pdf_url": "https://arxiv.org/pdf/2602.17400v1.pdf",
    "title": "Resistive instabilities of current sheets in stratified plasmas with a gravitational field",
    "abstract": "Magnetic reconnection can develop spontaneously via the tearing instability, often invoked to explain disruptive instabilities in fusion devices, solar flares, the generation of periodic density disturbances at the tip of helmet streamers, and flux transfer events at the Earth's dayside magnetopause. However, in many such environments the presence of gravity, magnetic field curvature or other forms of acceleration often result in situations of a heavy-over-light plasma in an effective gravitational field with an embedded current sheet. This paper studies the linear stability of a slab current sheet with respect to reconnecting modes in the presence of a density gradient under the effect of a constant gravitational acceleration. We show that the presence of stratification and gravity modify the properties of the tearing mode instability both in the case of favorable and unfavorable stratification. Favorable stratification suppresses reconnection while unfavorable stratification strongly destabilizes the tearing mode. Furthermore, we show that the classical constant-ψ regime effectively does not exist, even for weak unfavorable stratification, for S>>1. Instead, the gravity-modified tearing progressively transitions into the G-mode, which is a gravity-driven reconnecting mode with a growth rate scaling as S^-1/3. As a consequence, unfavorable stratification only permits rapidly reconnecting modes.",
    "authors": [
      "Faisal Sayed",
      "Anna Tenerani",
      "Richard Fitzpatrick"
    ],
    "published": "2026-02-19T14:27:56Z",
    "updated": "2026-02-19T14:27:56Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.17173v1",
    "url": "https://arxiv.org/abs/2602.17173v1",
    "pdf_url": "https://arxiv.org/pdf/2602.17173v1.pdf",
    "title": "Standards and Safety: an Overview",
    "abstract": "This note is intended to provide an overview of the implications of regulations and standards on the safety of mechanical equipment, with a focus on accelerator components. Each research facility has different internal rules and standards which are applicable to specific cases; however, the main reference legal frame in Europe is everywhere based on the applicable European Directives. After a brief introduction to the 'safety' for mechanical systems, the process of 'risk analysis' will be introduced. The majority of this note will then deal with regulations and standards for pressure and cryogenic equipment. The European Pressure Equipment Directive (PED) will be briefly described, together with the concept of 'harmonized standards' and their implications on the entire lifecycle of a pressure equipment, with some hints at the peculiarities of accelerator components. In the second part of this note, regulations and standards for machinery, load-lifting accessories and buildings will be briefly mentioned to complete the picture of the most common cases in an accelerator facility.",
    "authors": [
      "Luca Dassa"
    ],
    "published": "2026-02-19T08:39:35Z",
    "updated": "2026-02-19T08:39:35Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.17000v1",
    "url": "https://arxiv.org/abs/2602.17000v1",
    "pdf_url": "https://arxiv.org/pdf/2602.17000v1.pdf",
    "title": "Power attenuation in millimeter-wave and terahertz superconducting rectangular waveguides: linear response, TLS loss, and Higgs-mode nonlinearity",
    "abstract": "Superconducting waveguides are a promising platform for ultralow-loss transmission in the millimeter-wave to terahertz band under cryogenic conditions, with potential applications in astronomical instrumentation and emerging quantum technologies. We develop a framework, based on microscopic superconductivity theory, to evaluate the power-flow attenuation constant $α$ of superconducting rectangular waveguides in the $100~\\mathrm{GHz}$--THz range, applicable to arbitrary electronic mean free paths $\\ell$ from the dirty limit $\\ell\\llξ_0$ to the clean limit $\\ell\\ggξ_0$. We also derive an analytical expression for two-level-system (TLS)-induced attenuation $α_{\\rm TLS}$ in thin native oxide layers within the standard TLS model. Using this framework, we perform numerical evaluations of $α$ for representative materials over standard waveguide sizes from WR15 to WR1. In the high-frequency regime $f \\gtrsim 0.5 Δ/h$, low attenuation favors the clean regime $\\ell\\gtrsimξ_0$, indicating that high-purity materials can achieve very low attenuation below their gap frequency. For the TLS contribution, using parameter values representative of native Nb oxides, we find that $α_{\\rm TLS}$ can become relevant at sufficiently low temperatures $T/T_c\\lesssim 0.1$-0.2, where quasiparticle dissipation is exponentially suppressed. Finally, we extend the discussion to the strong-excitation regime using a recently developed nonlinear-response theory within the Keldysh--Usadel framework of nonequilibrium superconductivity and show that nonlinear dissipation produces a Higgs-mode peak in $α$ near $f\\simeq Δ/h$ via a Kerr-type nonlinearity of the dissipative conductivity. This peak provides a distinct hallmark of the Higgs mode that has been largely overlooked so far.",
    "authors": [
      "Takayuki Kubo"
    ],
    "published": "2026-02-19T01:49:24Z",
    "updated": "2026-02-19T01:49:24Z",
    "categories": [
      "cond-mat.supr-con",
      "physics.acc-ph",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "cond-mat.supr-con"
  },
  {
    "arxiv_id": "2602.16960v1",
    "url": "https://arxiv.org/abs/2602.16960v1",
    "pdf_url": "https://arxiv.org/pdf/2602.16960v1.pdf",
    "title": "Capturing Secondary Kinetic Instabilities in Three-Dimensional Dayside Reconnection Using an Improved Gradient-Based Closure",
    "abstract": "Magnetic reconnection is a highly dynamic process that excites a wide variety of kinetic waves and instabilities. Transverse current sheet instabilities such as the lower-hybrid drift and secondary drift-kink instabilities in particular have been shown by kinetic simulations to modify the reconnection and introduce significant turbulence and mixing to the reconnection layer. Past studies using the ten-moment fluid model to capture important kinetic physics such as the electron inertia and full representation of the pressure tensor proved advantageous to a two-fluid representation of reconnection, but the model struggled when using a local relaxation closure for the heat flux to replicate the current sheet instabilities and subsequent mixing seen in kinetic simulations. This work uses the \\texttt{Gkeyll} software framework to perform simulations of asymmetric reconnection based on the 16 October 2015 MMS crossing of a diffusion region, the Burch event. An improved gradient-based heat flux closure is implemented, showing significant improvement in secondary kinetic instabilities that grow in the current sheet. These instabilities generate turbulence which leads to growth of secondary magnetic islands and flux ropes.",
    "authors": [
      "Kolter Bradshaw",
      "Ammar Hakim",
      "James Juno",
      "Joshua Pawlak",
      "Jason TenBarge",
      "Amitava Bhattacharjee"
    ],
    "published": "2026-02-18T23:54:09Z",
    "updated": "2026-02-18T23:54:09Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.16955v1",
    "url": "https://arxiv.org/abs/2602.16955v1",
    "pdf_url": "https://arxiv.org/pdf/2602.16955v1.pdf",
    "title": "Theory of striped dynamic spectra of the Crab pulsar high-frequency interpulse",
    "abstract": "A theory of the spectral \"zebra\" pattern of the Crab pulsar's high-frequency interpulse (HFIP) radio emission is developed. The observed emission bands are interference maxima caused by multiple ray propagation through the pulsar magnetosphere. The high-contrast interference pattern is the combined effect of gravitational lensing and plasma de-lensing of light rays. The model enables space-resolved tomography of the pulsar magnetosphere, yielding a radial plasma density profile of $n_{e}\\propto r^{-3}$, which agrees with theoretical insights. We predict the zebra pattern trend to change at a higher frequency when the ray separation becomes smaller than the pulsar size. This frequency is predicted to be in the range between 42 GHz and 650 GHz, which is within the reach of existing facilities like ALMA and SMA. These observations hold significant importance and would contribute to our understanding of the magnetosphere. Furthermore, they offer the potential to investigate gravity in the strong field regime near the star's surface.",
    "authors": [
      "Mikhail V. Medvedev"
    ],
    "published": "2026-02-18T23:37:47Z",
    "updated": "2026-02-18T23:37:47Z",
    "categories": [
      "astro-ph.HE",
      "gr-qc",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2510.16542v2",
    "url": "https://arxiv.org/abs/2510.16542v2",
    "pdf_url": "https://arxiv.org/pdf/2510.16542v2.pdf",
    "title": "Extended phase-space symplectic integration for electron dynamics",
    "abstract": "We investigate the use of extended phase-space symplectic integration for simulating two different classes of electron dynamics. The first one, with one and a half degrees of freedom, comes from plasma physics and describes the classical dynamics of a charged particle in a strong, constant, and uniform magnetic field perturbed by a turbulent electrostatic potential. The second one, with an infinite number of degrees of freedom, comes from physical chemistry and corresponds to Kohn-Sham time-dependent density-functional theory. For both we lay out the extension procedure and stability condition for numerical integration of the dynamics using high-order symplectic split-operator schemes. We also identify a computationally inexpensive metric that can be used for on-the-fly estimation of the accuracy of simulations. Our work paves the way for broad application of symplectic split-operator integration of classical and quantum Hamiltonian systems with finite and infinite number of degrees of freedom by comparing different modes of implementation of extended phase space integration.",
    "authors": [
      "Francois Mauger",
      "Cristel Chandre"
    ],
    "published": "2025-10-18T15:36:22Z",
    "updated": "2026-02-18T22:56:36Z",
    "categories": [
      "physics.comp-ph",
      "physics.chem-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.comp-ph"
  },
  {
    "arxiv_id": "2602.16896v1",
    "url": "https://arxiv.org/abs/2602.16896v1",
    "pdf_url": "https://arxiv.org/pdf/2602.16896v1.pdf",
    "title": "Numerical study of electron acceleration by microwave-driven plasma wakefields in rectangular waveguides",
    "abstract": "Plasma-based acceleration schemes have attracted sustained interest as a pathway toward compact particle accelerators, owing to the large electric fields supported by plasmas. Although recent studies have demonstrated the excitation of plasma wakefields using high-power microwave pulses in plasma-filled waveguides, the conditions required for efficient electron acceleration in such configurations remain insufficiently characterized. In this work, we investigate the acceleration of externally injected electrons by microwave-driven plasma wakefields in rectangular waveguides filled with low-density plasma. Three-dimensional particle-in-cell simulations are employed to analyze the dynamics of electron injection and energy gain under both reduced and fully self-consistent numerical models. The results show that electron acceleration is strongly dependent on the injection phase and initial velocity. Optimal acceleration is achieved when electrons are pre-accelerated to velocities close to the group velocity of the driving microwave pulse. For the parameters considered, energy gains of the order of $10^2 \\mathrm{keV}$ are obtained over interaction lengths of the order of meters, while maintaining a quasi-monoenergetic energy distribution under suitable injection conditions. The influence of transverse dynamics and space-charge effects is also examined, revealing additional constraints on acceleration efficiency associated with the transverse electromagnetic field of the driving microwave pulse. These results provide a quantitative assessment of the acceleration stage in microwave-driven plasma wakefield schemes and support their evaluation as a viable platform for compact plasma-based accelerators.",
    "authors": [
      "Jesús E. López",
      "Eduardo A. Orozco-Ospino"
    ],
    "published": "2026-02-18T21:27:00Z",
    "updated": "2026-02-18T21:27:00Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.16884v1",
    "url": "https://arxiv.org/abs/2602.16884v1",
    "pdf_url": "https://arxiv.org/pdf/2602.16884v1.pdf",
    "title": "Enhanced Hot Electron Preheat Observed in Magnetized Laser Direct-Drive Implosions",
    "abstract": "Hard x-ray emission, associated with hot electron preheat, in direct-drive implosions was observed to be enhanced by a factor of $1.5\\pm0.1$ by application of a $10$ T magnetic field. The applied magnetic field reaches a quasi steady-state aligned with the ablation flow prior to the onset of laser-plasma instabilities in the corona. Hot electrons that would otherwise escape the corona and lead to capsule charging in unmagnetized implosions are confined in a mirror-mode of the magnetic field in magnetized implosions. These hot electrons are shown to subsequently pitch-angle scatter from the mirror onto the capsule, thereby leading to the observed hard x-ray generation in magnetized implosions. Consequently, the energy of charged-fusion products, associated with the capsule charging, are observed to decrease when the implosion is magnetized. These results intensify the need to mitigate laser-plasma instabilities -- particularly for magnetized implosions -- to maximize fusion gain and implosion efficiency.",
    "authors": [
      "M. Cufari",
      "M. Gatu Johnson",
      "C. K. Li",
      "J. A. Frenje",
      "P. W. Moloney",
      "A. J. Crilly",
      "P. V. Heuer",
      "J. R. Davies"
    ],
    "published": "2026-02-18T21:11:09Z",
    "updated": "2026-02-18T21:11:09Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.21122v3",
    "url": "https://arxiv.org/abs/2512.21122v3",
    "pdf_url": "https://arxiv.org/pdf/2512.21122v3.pdf",
    "title": "Coherent-state boundary conditions as the first-principles origin of background fields in QED",
    "abstract": "QED formulated in prescribed classical background electromagnetic fields is a standard framework for strong-field and laser\\textendash matter interactions. It is usually treated as a theory modified by externally imposed fields, obscuring its precise relation to full QED and, in particular, the role of asymptotic boundary conditions for the gauge field. Starting from an operator-based formulation, we show that QED with background fields is not a distinct theory but arises as a well-defined boundary-condition limit of full QED, in which the classical background field emerges from coherent-state boundary conditions on the quantized electromagnetic field. In this limit, the conventional generating functional used in calculations with prescribed background fields is recovered naturally, while relaxing the boundary conditions allows depletion and backreaction effects to be incorporated within the same framework. The central new result is a rigorous operator-level proof of the equivalence between the fixed background-field approximation and coherent-state asymptotic boundary conditions\\textemdash a formulation that, to our knowledge, has not been made explicit in previous approaches. We further demonstrate that the apparent time dependence of background fields does not originate from an explicitly time-dependent Hamiltonian, but instead reflects the choice of picture\\textemdash Schrödinger versus Heisenberg\\textemdash in the underlying quantum theory. Rather than introducing new properties of coherent states, our analysis provides a first-principles reinterpretation of the fixed background-field approximation as a controlled and picture-dependent limit of full QED.",
    "authors": [
      "Keita Seto"
    ],
    "published": "2025-12-24T11:49:53Z",
    "updated": "2026-02-18T18:16:47Z",
    "categories": [
      "physics.plasm-ph",
      "hep-ph",
      "physics.optics",
      "quant-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.16672v1",
    "url": "https://arxiv.org/abs/2602.16672v1",
    "pdf_url": "https://arxiv.org/pdf/2602.16672v1.pdf",
    "title": "FLUKA-Based Optimization of Muon Production Target Design for a Muon Collider Demonstrator",
    "abstract": "This study investigates how target geometry and material influence pion and muon production from an 8 GeV proton beam, in support of target-system design for a muon collider demonstrator. A 2 m long, 0.7 m radius solenoid with a 5 T peak magnetic field is used to capture secondary particles, with the target positioned at its center. We examine how variations in target radius, length, and material affect secondary-beam yield and emittance at the solenoid exit. In parallel, we evaluate temperature rise within the target to assess material limitations and guide future work on thermal and structural survivability. The results provide initial intuition for optimizing both particle yield and target durability in muon collider front-end systems.",
    "authors": [
      "Ruaa Al-Harthy"
    ],
    "published": "2026-02-18T18:09:08Z",
    "updated": "2026-02-18T18:09:08Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.16652v1",
    "url": "https://arxiv.org/abs/2602.16652v1",
    "pdf_url": "https://arxiv.org/pdf/2602.16652v1.pdf",
    "title": "Nonlinear Frequency Shifts due to Phase Coherent Interactions in Incompressible Hall MHD Turbulence",
    "abstract": "Turbulence in the magnetized plasma is well understood to be the consequence of wave interactions. When the Hall effect is added to the minimum magnetohydrodynamics (MHD), the MHD waves become dispersive and different nonlinear interactions are expected. The emergent turbulent state will thus be expected to be different. For incompressible Hall MHD we develop a reduced model for wave-wave interactions concentrating on those processes that will lead to phase coherent modifications to the linear dispersion of a given wave. We show that these special interactions provide an amplitude-dependent contribution to the linear dispersion relation, which yields nonlinear frequency shifts. The resonance-driven frequency shifts are dominant and add damping or growth to the linear dispersion. The damping/growth rates represent the nonlinear time scales for energy redistribution and can be used in conjunction with a conjecture like the \"critical balance\" to estimate the energy spectral content.",
    "authors": [
      "Erik C. Hansen",
      "Prerana Sharma",
      "Swadesh M. Mahajan"
    ],
    "published": "2026-02-18T17:47:34Z",
    "updated": "2026-02-18T17:47:34Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.16765v1",
    "url": "https://arxiv.org/abs/2602.16765v1",
    "pdf_url": "https://arxiv.org/pdf/2602.16765v1.pdf",
    "title": "Operational measurement of relativistic equilibrium from stochastic fields alone",
    "abstract": "Relativistic equilibrium is described by the inverse-temperature four-vector $β^μ= u^μ/(k_B T_0)$ rather than by a frame-dependent scalar temperature. We show that $β^μ$ can be reconstructed directly from electromagnetic fluctuations emitted by a drifting medium, without external probes, spectral lines, or absolute intensity calibration. A Lorentz boost converts isotropic rest-frame noise into correlated electric and magnetic fields, producing a gain-independent fluctuation observable that yields the drift velocity purely from stochastic data. Combined with angle-resolved noise spectra governed by the covariant fluctuation--dissipation theorem, this enables full reconstruction of $β^μ$ using electromagnetic measurements alone. Monte Carlo analysis demonstrates percent-level accuracy at realistic signal-to-noise ratios, and feasibility estimates indicate sub-microsecond integration times for laboratory plasmas. To our knowledge, this constitutes the first method that reconstructs the covariant thermal state $β^μ$ of a relativistic medium from passive stochastic fields alone, without absolute calibration, spectral lines, or external probes. These results establish vacuum electromagnetic fluctuations as a direct operational probe of relativistic equilibrium.",
    "authors": [
      "Ira Wolfson"
    ],
    "published": "2026-02-18T17:30:50Z",
    "updated": "2026-02-18T17:30:50Z",
    "categories": [
      "physics.plasm-ph",
      "cond-mat.stat-mech",
      "gr-qc"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.16624v1",
    "url": "https://arxiv.org/abs/2602.16624v1",
    "pdf_url": "https://arxiv.org/pdf/2602.16624v1.pdf",
    "title": "Measurement of the Saturation Length of the Self-Modulation Instability",
    "abstract": "The self-modulation (SM) instability transforms a long charged particle bunch traveling in plasma into a train of microbunches that resonantly drives large-amplitude wakefields. We present the first determination of the saturation length of SM using experimental and numerical results. The saturation length is the distance over which wakefields reach their maximum amplitude along the plasma. By varying the plasma length and measuring the radius of the transverse distribution of the bunch, we find that the saturation length of SM decreases with plasma density and initial field amplitude, e.g., when seeding. The saturation length is a fundamental parameter of the instability, and these results are key for understanding SM and designing plasma wakefield accelerators driven by long bunches, such as AWAKE, or by long laser pulses for radiation production.",
    "authors": [
      "A. Clairembaud",
      "M. Turner",
      "M. Bergamaschi",
      "L. Ranc",
      "F. Pannell",
      "J. Mezger",
      "H. Jaworska",
      "N. van Gils",
      "J. Farmer",
      "P. Muggli",
      "the AWAKE Collaboration"
    ],
    "published": "2026-02-18T17:18:25Z",
    "updated": "2026-02-18T17:18:25Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.16542v1",
    "url": "https://arxiv.org/abs/2602.16542v1",
    "pdf_url": "https://arxiv.org/pdf/2602.16542v1.pdf",
    "title": "Laboratory observation of collective beam-plasma instabilities in a relativistic pair jet",
    "abstract": "We report on a measurement of collective behavior in a relativistic electron-positron pair plasma produced in the laboratory. Using the Fireball platform at CERN's HiRadMat facility, 440 GeV protons were used to generate an ultra-relativistic, charge-neutral electron-positron pair beam that propagated through an ambient RF discharge plasma. Magnetic-field amplification due to a beam-plasma instability was diagnosed using a high-sensitivity Faraday-rotation probe, supported by detailed characterization of the diagnostic impulse response. The measured path-integrated magnetic field agrees quantitatively with predictions from particle-in-cell simulations. The results provide a critical benchmark for models of relativistic beam-plasma interactions in astrophysical contexts such as blazar jets and pulsar-wind nebulae.",
    "authors": [
      "J W D Halliday",
      "C D Arrowsmith",
      "A M Goillot",
      "P J Bilbao",
      "P Simon",
      "V Stergiou",
      "S Zhang",
      "P Alexaki",
      "M Bochmann",
      "A F A Bott",
      "S Burger",
      "H Chen",
      "F D Cruz",
      "T Davenne",
      "A Dyson",
      "A Ebn Rahmoun",
      "I Efthymiopoulos",
      "D H Froula",
      "J T Gudmundsson",
      "D Haberberger",
      "T Hodge",
      "S Iaquinta",
      "E E Los",
      "G Marshall",
      "F Miniati",
      "S Parker",
      "B Reville",
      "P Rousiadou",
      "S Sarkar",
      "A A Schekochihin",
      "K G Schlesinger",
      "L O Silva",
      "T Silva",
      "R Simpson",
      "E Soria",
      "R M G M Trines",
      "T Vieu",
      "N Charitonidis",
      "R Bingham",
      "G Gregori"
    ],
    "published": "2026-02-18T15:42:34Z",
    "updated": "2026-02-18T15:42:34Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.16529v1",
    "url": "https://arxiv.org/abs/2602.16529v1",
    "pdf_url": "https://arxiv.org/pdf/2602.16529v1.pdf",
    "title": "Thermal Decoherence and Population Transfer of MeV Channeling Electrons in Diamond",
    "abstract": "Channeling radiation in oriented crystals arises from transitions between quantized transverse bound states in the MeV regime and is strongly affected by thermal diffuse scattering through population transfer and decoherence. A frozen-phonon multislice propagation framework is developed to track a reduced transverse Hilbert space spanned by selected bound-state manifolds using configuration-resolved projection amplitudes. Beyond reproducing transition energies, the method yields reduced manifold density matrices, thermal population kinetics, and depth-resolved coherence metrics. Applied to axial electron channeling in $\\langle100\\rangle$ diamond at 16.9 MeV, the results show approximately exponential population loss with strongly state-dependent feeding among low-lying manifolds. For an initial coherent superposition in the degenerate 2p manifold, the intra-manifold purity relaxes toward the maximally mixed limit, consistent with thermally induced random basis rotations. Under 1s initial excitation, population transferred into the 2p and 3d manifolds remains close to maximally mixed, while weak cross-manifold coherences persist. The framework enables quantitative analysis of thermal population dynamics, decoherence, and their links to spontaneous and coherently driven emission observables across a broad range of crystal structures.",
    "authors": [
      "Tadas Paulauskas"
    ],
    "published": "2026-02-18T15:17:12Z",
    "updated": "2026-02-18T15:17:12Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.acc-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2512.16630v5",
    "url": "https://arxiv.org/abs/2512.16630v5",
    "pdf_url": "https://arxiv.org/pdf/2512.16630v5.pdf",
    "title": "Photon Accelerator in Magnetized Electron-Ion Plasma",
    "abstract": "Strong magnetic fields and plasmas are intrinsically linked in both terrestrial laboratory experiments and in space phenomena. One of the most profound consequences of that is the change in relationship between the frequency and the wave number of electromagnetic waves propagating in plasma in the presence of such magnetic fields when compared to the case without these fields. Furthermore, magnetic fields alter electromagnetic wave interaction with relativistic plasma waves, resulting in different outcomes for particle and radiation generation. For a relativistic plasma wave-based photon acceleration this leads to an increased frequency gain, and, thus, potentially to higher efficiency. The influence of a magnetic field leads to quantitative and qualitative change in the properties of photon acceleration, amplifying the increase in the electromagnetic wave frequency.",
    "authors": [
      "Sergei Bulanov",
      "Stepan Bulanov",
      "Timur Esirkepov",
      "Gianluca Gregori",
      "Gabriele Grittani",
      "Marcel Lamač",
      "Brandon Russell",
      "Alec Thomas",
      "Petr Valenta"
    ],
    "published": "2025-12-18T15:06:33Z",
    "updated": "2026-02-18T12:28:02Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.16221v1",
    "url": "https://arxiv.org/abs/2602.16221v1",
    "pdf_url": "https://arxiv.org/pdf/2602.16221v1.pdf",
    "title": "Reinterpreting the sunward electron deficit: Implications for solar wind acceleration and core population formation",
    "abstract": "This paper re-evaluates the relationship between the observed sunward electron cutoff energy and the depth of the Sun's global electrostatic potential. It investigates whether taking into account the effects of local traps formed by magnetic fluctuations provides an alternative explanation for the observed electron deficit. The fluctuations of the highly variable interplanetary magnetic field form a series of shallow magnetic mirror traps that move at approximately the speed of the solar wind. The study investigates the dynamics of electrons as they move outward against an attractive solar electrostatic potential and interact with these traps. By following the motion of the electrons using first-principles calculations, we assess the effect of the traps on the velocity distribution of the particles. Electrons that escape the local trap continue to lose energy as they move outward until they are eventually captured by subsequent traps, preventing them from returning to the observer as sunward-moving particles. We derive a mathematical expression for the cutoff velocity, defined as the limit beyond which particles can no longer overtake the outer endpoint of a local trap. It turns out that the observed cutoff energy characterizes only the local potential drop within a trap, rather than the total depth of the Sun's potential well. The true potential well can be significantly deeper, scaled by the ratio of the radial distance from the Sun to the trap size. Furthermore, electrons captured by these moving traps contribute to the formation of the solar wind core population. The Sun's electrostatic potential is a more significant factor in solar wind acceleration than previously interpreted from cutoff data. The interaction between electrostatic deceleration and moving magnetic traps provides a new framework for understanding the origin and behavior of the solar wind core electrons.",
    "authors": [
      "Zoltan Nemeth"
    ],
    "published": "2026-02-18T06:56:38Z",
    "updated": "2026-02-18T06:56:38Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2602.15992v1",
    "url": "https://arxiv.org/abs/2602.15992v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15992v1.pdf",
    "title": "Properties of a compact neutron supermirror transmission polarizer with an electromagnetic system",
    "abstract": "The paper will present SVAROG, a compact neutron supermirror transmission multichannel polarizer with an electromagnetic system. The basic properties of this polarizer will be considered. Variants for using this polarizer in experimenrtla facilities of the PIK research reactor (Petersburg Nuclear Physics Institute of National Research Centre «Kurchatov Institute» (NRC «Kurchatov Institute» - PNPI)) will be discussed and a comparison of the considered polarizer with known neutron transmission polarizers will be carried out.",
    "authors": [
      "V. G. Syromyatnikov",
      "S. Yu. Semenikhin",
      "M. V. Lasitsa"
    ],
    "published": "2026-02-17T20:29:09Z",
    "updated": "2026-02-17T20:29:09Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex",
      "physics.acc-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.05331v2",
    "url": "https://arxiv.org/abs/2601.05331v2",
    "pdf_url": "https://arxiv.org/pdf/2601.05331v2.pdf",
    "title": "Directed Nano-antennas for Laser Fusion",
    "abstract": "Why do we use nano-antennas for fusion? In three sentences: The present laser induced fusion plans use extreme mechanical shock compression to get one hotspot and then ignition. Still fusion burning spreads slower than expansion, and mechanical instabilities may also develop. With nano-antennas in radiation dominated systems, simultaneous ignition can be achieved in the whole target volume and there is no time left for mechanical instabilities. Ignition is achieved with protons accelerated in the direction of the nanoantennas that are orthogonal to the direction of laser irradiation.   Present laser fusion methods are based on extreme and slow mechanical compression with an ablator surface on the fuel target pellet to increase compression and eliminate penetration of laser electromagnetic energy into the target. This arises from a mistaken assumption, [1] that the detonation normal 4-vector should have vanishing time-like component, and this assumption eliminates the possibility to rapid or even simultaneous, radiation dominated detonations, (which are well known in the burning (or hadronization) of Quark Gluon Plasma).",
    "authors": [
      "FUSENOW",
      "NAPLIFE Collaborations",
      ":",
      "Zsuzsanna Márton",
      "Imene Benabdelghani",
      "Márk Aladi",
      "Judit Budai",
      "Aldo Bonasera",
      "Attila Bonyár",
      "Mária Csete",
      "Tibor Gilinger",
      "Martin Greve",
      "Jan-Petter Hansen",
      "Gergely Hegedűs",
      "Ádám Inger",
      "Miklos Kedves",
      "Károly Osvay",
      "István Papp",
      "Péter Rácz",
      "András Szenes",
      "Ágnes Szokol",
      "Dávid Vass",
      "Parvin Varmazyar",
      "Miklós Veres",
      "Konstantin Zsukovszki",
      "Tamás S. Bíró",
      "Norbert Kroó",
      "Laszlo P. Csernai"
    ],
    "published": "2026-01-08T19:20:01Z",
    "updated": "2026-02-17T19:03:35Z",
    "categories": [
      "physics.plasm-ph",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.15939v1",
    "url": "https://arxiv.org/abs/2602.15939v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15939v1.pdf",
    "title": "Particle-in-Cell Methods for Simulations of Sheared, Expanding, or Escaping Astrophysical Plasma",
    "abstract": "Particle-in-Cell (PIC) methods have achieved widespread recognition as simple and flexible approaches to model collisionless plasma physics in fully kinetic simulations of astrophysical environments. However, in many situations the standard PIC algorithm must be extended to include macroscopic effects in microscale simulations. For plasmas subjected to shearing or expansion, shearing-box and expanding-box methods can be incorporated into PIC to account for these global effects. For plasmas subjected to local acceleration in confined regions of space, a leaky-box method can allow closed-box PIC simulations to account for particle escape from the accelerator region. In this work, we review and improve methods to include shearing, expansion, and escape in PIC simulations. We provide the numerical details of how Maxwell's equations and the particle equations of motion are solved in each case, and introduce generalized Boris-like particle pushers to solve the momentum equation in the presence of extra forces. This work is intended to serve as a comprehensive reference for the implementation of shearing-box, expanding-box, and leaky-box algorithms in PIC.",
    "authors": [
      "Fabio Bacchini",
      "Evgeny A. Gorbunov",
      "Maximilien Péters de Bonhome",
      "Paul Els",
      "Konstantinos-Xanthos Argyropoulos",
      "Minh Nhat Ly",
      "Daniel Grošelj"
    ],
    "published": "2026-02-17T19:00:19Z",
    "updated": "2026-02-17T19:00:19Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.15777v1",
    "url": "https://arxiv.org/abs/2602.15777v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15777v1.pdf",
    "title": "New Challenges in Plasma Accelerators: Final Focusing for Wakefield Colliders",
    "abstract": "The focusing of particle beams for collider experiments is crucial for maximizing the luminosity and thus the discovery potential of these machines. In recent years, plasma wakefield acceleration has emerged as a leading candidate for achieving higher energy collisions with smaller facility footprints due to the large accelerating gradients in the plasma. This higher beam energy poses significant challenges for the final focusing system of the collider. Here, we discuss the various challenges of final focusing for TeV-scale plasma accelerators and propose possible solutions. Finally, we present the first design of a final focusing system for a 10 TeV linear wakefield collider, evaluate its performance, and discuss its shortcomings as well as improvements for future designs.",
    "authors": [
      "Keegan Downham",
      "Spencer Gessner",
      "Lewis Kennedy",
      "Rogelio Tomás",
      "Andrei Seryi"
    ],
    "published": "2026-02-17T18:06:54Z",
    "updated": "2026-02-17T18:06:54Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2502.04374v2",
    "url": "https://arxiv.org/abs/2502.04374v2",
    "pdf_url": "https://arxiv.org/pdf/2502.04374v2.pdf",
    "title": "The Numerics of VMEC++",
    "abstract": "VMEC++ is a Python-friendly, from-scratch reimplementation in C++ of the Variational Moments Equilibrium Code (VMEC), a fixed- and free-boundary ideal-MHD equilibrium solver for stellarators and tokamaks. The first VMEC implementation was written by Steven P. Hirshman and colleagues in the 1980s and 1990s and its latest Fortran incarnation (PARVMEC, https://github.com/ORNL-Fusion/PARVMEC) is widely used in stellarator optimization systems. Our work improves on previous implementations with regard to various critical aspects: special care has been put in providing an idiomatic Python experience, from installation to actual usage; VMEC++ has a zero-crash policy; it supports inputs in the classic INDATA format as well as friendlier JSON files. VMEC++ execution times are typically less than or equal to previous implementations, and time to convergence can be decreased dramatically by leveraging its hot-restart feature: by providing the output of a VMEC++ run as initial state for a subsequent one, VMEC++ is initialized using the previously converged equilibrium. This can dramatically decrease runtimes when running on many similar magnetic configurations as it typically happens in stellarator optimization pipelines. On the flip side, some features of the original Fortran VMEC implementation are not yet available in VMEC++, such as support for non-stellarator-symmetric configurations. This contribution presents the internal numerics of the open-source VMEC++ package publicly for the first time.",
    "authors": [
      "Jonathan Schilling"
    ],
    "published": "2025-02-05T14:02:06Z",
    "updated": "2026-02-17T11:25:46Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.IM"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.15500v1",
    "url": "https://arxiv.org/abs/2602.15500v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15500v1.pdf",
    "title": "From Coils to Surface Recession: Fully Coupled Simulation of Ablation in ICP Wind Tunnels",
    "abstract": "This work presents a fully coupled, multiphysics computational framework for predicting the thermo-chemical material response of thermal protection systems in inductively coupled plasma (ICP) wind tunnels. The framework integrates a high-fidelity Navier-Stokes plasma solver, an electromagnetic field solver, and a discontinuous-Galerkin material response solver using a partitioned coupling strategy. This enables an ab initio, end-to-end simulation of the 350 kW Plasmatron X facility at the University of Illinois Urbana-Champaign (UIUC), including plasma generation, electromagnetic heating, near-wall thermochemistry, and time-accurate material ablation. The model captures key ICP physics such as vortex-mode recirculation, Joule-heating-driven plasma formation, and Lorentz-force-induced flow confinement, and accurately predicts the transition from subsonic to supersonic jet behavior at low pressures. Validation against cold-wall calorimetry and graphite ablation experiments shows that predicted stagnation-point heat fluxes fall well within experimental uncertainty, while fully coupled simulations accurately reproduce measured stagnation temperature histories and recession rates with errors below 12% and 10%, respectively. Remaining discrepancies during early transient heating are attributed to uncertainties in power-coupling efficiency, equilibrium ablation modeling, and material property datasets. Overall, the framework demonstrates strong predictive capability for ICP wind tunnel environments and provides a foundation for improved design, interpretation, and planning of hypersonic material testing campaigns.",
    "authors": [
      "Sanjeev Kumar",
      "Alessandro Munafo",
      "Blaine Vollmer",
      "Daniel J. Bodony",
      "Gregory S. Elliott",
      "Kelly A. Stephani",
      "Sean Kearney",
      "Marco Panesi"
    ],
    "published": "2026-02-17T11:13:00Z",
    "updated": "2026-02-17T11:13:00Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.09491v4",
    "url": "https://arxiv.org/abs/2510.09491v4",
    "pdf_url": "https://arxiv.org/pdf/2510.09491v4.pdf",
    "title": "Investigating Solid-Fluid Phase Coexistence in DC Plasma Bilayer Crystals: The Role of Particle Pairing and Mode Coupling",
    "abstract": "This article presents a detailed investigation of solid-fluid phase coexistence in a bilayer dusty plasma crystal subjected to varying confinement ring bias voltages in a DC glow discharge argon plasma. Melamine formaldehyde particles were employed to form a stable, hexagonally ordered bilayer crystal within a confinement ring electrically isolated from the grounded cathode. By systematically adjusting the confinement ring bias, a distinct phase coexistence emerged characterized by a fluid-like melted core surrounded by a solid crystalline periphery. Crucially, analysis of the phonon spectra revealed frequency shifts that deviate significantly from the predictions of classical monolayer Mode-Coupling Instability (MCI) theory. Stability analysis further demonstrated that dynamic interlayer particle pairing and the associated increase in non-reciprocal interaction strength are strongly correlated with the onset of structural destabilization. These findings highlight previously underappreciated mechanisms driving the melting transition in bilayer dusty plasmas, offering a more comprehensive understanding of phase behavior in complex plasma systems. The results underscore the importance of interlayer coupling and confinement effects in tuning structural transitions.",
    "authors": [
      "Siddhartha Mangamuri",
      "Lénaïc Couëdel",
      "Surabhi Jaiswal"
    ],
    "published": "2025-10-10T15:52:47Z",
    "updated": "2026-02-17T10:06:26Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1103/nxt3-qwj6"
  },
  {
    "arxiv_id": "2602.15431v1",
    "url": "https://arxiv.org/abs/2602.15431v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15431v1.pdf",
    "title": "Flux pumping and bifurcated relaxations of helical core in 3D magnetohydrodynamic modelling of ASDEX Upgrade plasmas",
    "abstract": "Flux pumping was achieved in recent hybrid scenario experiments in the ASDEX Upgrade (AUG) tokamak, which is characterized by a sawtooth-free helical quiescent state and the anomalous radial redistribution of toroidal current density and poloidal magnetic flux. In this article, the self-regulation mechanism of the AUG core plasma during flux pumping is investigated at realistic parameters using the JOREK code based on the two-temperature, nonlinear, full magnetohydrodynamic (MHD) model. A key milestone in AUG flux pumping modelling is achieved by quantitatively reproducing the clamped current density and safety factor profiles in the plasma core, demonstrating the effectiveness of the dynamo effect in sustaining the flux pumping state. The dynamo term, that is of particular interest, is primarily generated by the pressure-gradient driven m/n = 1/1 quasi-interchange-like MHD instability. The work systematically extrapolates the parameter regimes of flux pumping from the above AUG base case by scanning dissipation coefficients and plasma beta. The simulation results reveal bifurcated plasma behaviours at different Hartmann numbers, including distinct states such as flux pumping (helical core with a flat current density), sawteeth (periodic kink-cycling), single crash (without subsequent cycle), and quasi-stationary magnetic island (peaked current density). Transitions from marginal flux pumping state to sawteeth are observed in long-term simulations. The relationships between system dissipation, plasma beta, and different plasma states are carefully analyzed. For practical purposes, the potential operational window for flux pumping, as determined by plasma density and temperature, is estimated. The modelling efforts advance the understanding of flux pumping and facilitate the development of a fast surrogate model for efficient evaluation of flux pumping.",
    "authors": [
      "H. Zhang",
      "M. Hoelzl",
      "I. Krebs",
      "A. Burckhart",
      "A. Bock",
      "S. Guenter",
      "V. Igochine",
      "K. Lackner",
      "D. Bonfiglio",
      "E. Fable",
      "F. Stefanelli",
      "R. Ramasamy",
      "H. Zohm",
      "JOREK TEAM",
      "ASDEX UPGRADE TEAM"
    ],
    "published": "2026-02-17T08:52:36Z",
    "updated": "2026-02-17T08:52:36Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.18532v3",
    "url": "https://arxiv.org/abs/2509.18532v3",
    "pdf_url": "https://arxiv.org/pdf/2509.18532v3.pdf",
    "title": "A Doppler backscattering diagnostic for the EXL-50U spherical tokamak: plasma considerations and preliminary quasioptical design",
    "abstract": "The EXL-50U spherical tokamak was built by Energy iNNovation to develop technologies for proton-boron fusion in spherical tokamaks (Liu et al., Phys. Plasmas 2024). We present a conceptual design of the Doppler backscattering (DBS) diagnostic for the EXL-50U spherical tokamak. DBS is a diagnostic capable of measuring plasma turbulence, which is especially important for transport in tokamaks. Starting from a set of physical design constraints, such as port window availability and in-vessel space, we used SCOTTY (Hall-Chen et al., PPCF 2022), an in-house beam tracing code, to predict the location of the cutoffs and the corresponding scattering wavenumbers for several EXL-50U plasma scenarios. We find that we are able to measure scattering locations of 0.15 $<$ $ρ$ $<$ 1, with corresponding turbulent wavenumbers of 2.47 cm$^{-1}$$<$ $k_{\\perp}$ $<$ 9.49 cm$^{-1}$. Here, $ρ$ is the normalised radial coordinate of the scattering location, and $k_{\\perp}$ is the corresponding turbulent wavenumber. We then determine the optimal toroidal launch angles to ensure that the probe beam's wavevector is perpendicular to the magnetic field at the cutoff location, thereby maximising the backscattered signal. This matching is crucial due to the EXL-50U's high magnetic pitch angle, $\\sim35^{\\circ}$ at the outboard midplane. Given our results, we propose the use of toroidal steering and tunable frequency channels to ensure beams are well-matched with the magnetic pitch angle. We propose a quasioptical system that covers the U-band range (40--60 GHz).",
    "authors": [
      "Ying Hao Matthew Liang",
      "Valerian Hongjie Hall-Chen",
      "Terry L. Rhodes",
      "Yumin Wang",
      "Yihang Zhao"
    ],
    "published": "2025-09-23T01:54:04Z",
    "updated": "2026-02-17T00:50:37Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.25423v2",
    "url": "https://arxiv.org/abs/2509.25423v2",
    "pdf_url": "https://arxiv.org/pdf/2509.25423v2.pdf",
    "title": "Electropolishing-Induced Topographic Defects in Niobium: Insights and Implications for Superconducting Radio Frequency Applications",
    "abstract": "Electropolishing is the premier surface preparation method for high-Q, high-gradient superconducting RF cavities made of Nb. This leaves behind an apparently smooth surface, yet the achievable peak magnetic fields fall well below the superheating field of Nb, in most cases. In this work, the ultimate surface finish of electropolishing was investigated by studying its effect on highly polished Nb samples. Electropolishing introduces high slope angle sloped-steps at grain boundaries. The magnetic field enhancement and superheating field suppression factors associated with such a geometry are calculated in the London theory. Despite the by-eye smoothness of electropolished Nb, such defects compromise the stability of the low-loss Meissner state, likely limiting the achievable peak accelerating fields in superconducting RF cavities. Finally, the impact of surface roughness on impurity diffusion is investigated which can link surface roughness to the effectiveness of heat treatments like low-temperature baking or nitrogen infusion in the vortex nucleation or hydride hypotheses. Surface roughness tends to decrease the effective dose of impurities as a result of the expansion of impurities into regions with greater internal angle. The effective dose of impurities can be protected by minimizing slope angles and step heights, ensuring uniformity.",
    "authors": [
      "Oleksandr Hryhorenko",
      "Anne-Marie Valente-Feliciano",
      "Eric M. Lechner"
    ],
    "published": "2025-09-29T19:31:12Z",
    "updated": "2026-02-16T22:54:04Z",
    "categories": [
      "cond-mat.supr-con",
      "cond-mat.mtrl-sci",
      "physics.acc-ph",
      "physics.app-ph"
    ],
    "primary_category": "cond-mat.supr-con",
    "doi": "10.1088/1361-6668/ae40a3"
  },
  {
    "arxiv_id": "2602.15205v1",
    "url": "https://arxiv.org/abs/2602.15205v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15205v1.pdf",
    "title": "Basics of RF Electronics",
    "abstract": "The focus of this educational text is selected examples of high-frequency electronic circuits and their components employed for the accurate phasing and synchronisation of accelerator cavities. Examples have been chosen to describe the basics of RF electronics. The starting point is transmission lines, connectors, discontinuities, and the handling of reflection. The application of simple surface mount components is discussed. The use of the Kuroda identities for converting lumped circuit designs to printed circuit designs is demonstrated. The accelerator example used to demonstrate the use of components is a circuit designed for the synchronisation of the CLIC crab cavities. This example employs co-planar waveguide, SMA connectors, Wilkinson splitters, and surface-mount double-balanced mixers. For the control of cavity phase and amplitude, the benefit of I&Q controllers will be explained. The text will then discuss the operation and use of I&Q modulators and VCOs.",
    "authors": [
      "Amos Christopher Dexter"
    ],
    "published": "2026-02-16T21:35:42Z",
    "updated": "2026-02-16T21:35:42Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.15130v1",
    "url": "https://arxiv.org/abs/2602.15130v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15130v1.pdf",
    "title": "Code-Verification Techniques for Particle-in-Cell Simulations with Direct Simulation Monte Carlo Collisions",
    "abstract": "Particle-in-cell methods with stochastic collision models are commonly used to simulate collisional plasma dynamics, with applications ranging from hypersonic flight to semiconductor manufacturing. Code verification of such methods is challenging due to the interaction between the spatial- and temporal-discretization errors, the statistical sampling noise, and the stochastic nature of the collision algorithm. In this paper, we introduce our code-verification approaches to apply the method of manufactured solutions to plasma dynamics, and we derive expected convergence rates for the different sources of discretization and statistical error. For the particles, we incorporate the method of manufactured solutions into the equations of motion. We manufacture the particle distribution function and inversely query the cumulative distribution function to obtain known particle positions and velocities at each time step. In doing so, we avoid modifying the particle weights, eliminating risks from potentially negative weights or modifications to weight-dependent collision algorithms. For the collision algorithm, we average independent outcomes at each time step and we derive a corresponding manufactured source term for the velocity change for each particle. By having known solutions for the particle positions and velocities, we are able to compute the error in these quantities directly instead of attempting to compute differences in distribution functions. These approaches are equally valid for particle-in-cell simulations with Monte Carlo collisions and direct simulation Monte Carlo simulations of neutral gas flows. We demonstrate the effectiveness of our approaches in three dimensions for different couplings between the particles and field, with and without binary elastic collisions, and with and without coding errors.",
    "authors": [
      "Brian A. Freno",
      "William J. McDoniel",
      "Christopher H. Moore",
      "Neil R. Matula"
    ],
    "published": "2026-02-16T19:19:34Z",
    "updated": "2026-02-16T19:19:34Z",
    "categories": [
      "physics.comp-ph",
      "math.NA",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.comp-ph"
  },
  {
    "arxiv_id": "2508.15879v2",
    "url": "https://arxiv.org/abs/2508.15879v2",
    "pdf_url": "https://arxiv.org/pdf/2508.15879v2.pdf",
    "title": "Hypothesis of a bi-isotropic-like plasma permeating the interstellar space",
    "abstract": "In this work, we study the propagation of electromagnetic waves in a magnetized chiral plasma that pervades the interstellar space. The Maxwell equations, supplemented by bi-isotropic-like constitutive relations, are rewritten to describe a cold, uniform, and collisionless plasma model that yields new collective electromagnetic modes for distinct pairs of refractive indices associated with right- and left-handed circularly polarized waves. We have investigated the optical behavior through the rotatory power (RP) and dichroism coefficient, reporting that the finite chiral parameter induces double RP sign reversal, an exotic optical signature that takes place in chiral dielectrics and rotating plasmas. In the low-frequency regime, a modified propagating helicon with right-handed circular polarization is obtained. Next, supposing that the interstellar medium behaves as a chiral bi-isotropic-like cold plasma, we employ Astrophysical data of radio pulsars to achieve upper limits on the magnetoelectric parameters magnitude. In particular, by using dispersion measure and rotation measure data from five pulsars, we constrain the magnitude of the chiral parameter to the order of $10^{-16}$ and $10^{-22}$, respectively.",
    "authors": [
      "Filipe S. Ribeiro",
      "Pedro D. S. Silva",
      "Rodolfo Casana",
      "Manoel M. Ferreira"
    ],
    "published": "2025-08-21T14:38:46Z",
    "updated": "2026-02-16T17:18:54Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE",
    "doi": "10.1103/47sj-7m3c"
  },
  {
    "arxiv_id": "2602.14918v1",
    "url": "https://arxiv.org/abs/2602.14918v1",
    "pdf_url": "https://arxiv.org/pdf/2602.14918v1.pdf",
    "title": "Data-driven modeling of shock physics by physics-informed MeshGraphNets",
    "abstract": "High-resolution fluid simulations for plasma physics and astrophysics rely on Particle in cell (PIC) and hydrodynamic solvers (e.g., FLASH) to resolve shock dominated, multiscale phenomena, but their high computational cost severely limits scalability. This motivates the development of learning based surrogate models, which offer a promising route to accelerate these simulations while preserving physical fidelity. In this work, we study the Sedov Taylor shock propagation problem using a physics informed graph based surrogate model, Physics Informed MeshGraphNet (PhyMGN), designed for grid-based hydrodynamics. By incorporating weak physics constraints derived from the Euler equations using finite difference method, the model captures the self similar shock evolution and associated flow structures without explicitly solving the full hydrodynamic equations at each timestep. Comparing to the baseline MeshGraphNet model, PhyMGN is able to generalize beyond the training regime with a higher accuracy and preserves differentiability in parameter space while achieving a substantial reduction in computational cost relative to conventional numerical solvers.",
    "authors": [
      "S. Zhang",
      "M. Mallon",
      "M. Luo",
      "J. Thiyagalingam",
      "P. Tzeferacos",
      "R. Bingham",
      "G. Gregori"
    ],
    "published": "2026-02-16T16:53:51Z",
    "updated": "2026-02-16T16:53:51Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.14870v1",
    "url": "https://arxiv.org/abs/2602.14870v1",
    "pdf_url": "https://arxiv.org/pdf/2602.14870v1.pdf",
    "title": "Application of RFSoC Technology for Beam Position Monitors at the SuperKEKB Storage Rings Injection Points",
    "abstract": "In order to achieve its ambitious luminosity target, the SuperKEKB collider must achieve and sustain high beam currents on the order of Ampere in its storage rings. This requires continuous top-up injection and operation with a two-bunch injection scheme, injecting two 96 ns spaced bunches in a single injection cycle. An important input for tuning the injection beam is the position reading from a dedicated beam position monitor (BPM), located after the septum magnets, slightly upstream of where the injected and stored beams converge. Previously, the readout electronics used for these special BPMs were not capable of independent measurement of both bunches in the two-bunch injection mode and modification of the concerned devices and their firmware was not feasible. The opportunity was taken to develop a new readout device based on the AMD/Xilinx RF System on a Chip (RFSoC) platform with the goal of not only providing a sufficiently flexible and performant readout solution for the concerned BPMs, but also to evaluate and gain experience with the platform for beam monitor electronics applications. This paper is concerned with the details of this development as well as evaluation and operation of the developed device.",
    "authors": [
      "B. Urbschat",
      "G. Mitsuka",
      "L. Ruckman"
    ],
    "published": "2026-02-16T16:02:20Z",
    "updated": "2026-02-16T16:02:20Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.14836v1",
    "url": "https://arxiv.org/abs/2602.14836v1",
    "pdf_url": "https://arxiv.org/pdf/2602.14836v1.pdf",
    "title": "Asymmetry in laser wakefields driven by intense pulses",
    "abstract": "Laser wakefield theories rely on the laser envelope function, which is radially symmetric, and predict zero transverse momentum for the electrons along the propagation axis. Exact description of laser wakefields, beyond the envelope approximation, requires a more general formula for the Lorentz force acting on the electrons. Here we present a fundamental approach to express the transverse momentum of an electron crossing the laser pulse, and we show that an exact analytical formula can be derived for the non-zero transverse momentum of electrons initially lying along the axis of symmetry. The results outlined here shed light on the details of the electron motion inside an intense laser pulse and explain the strong wakefield asymmetry observed in simulations.",
    "authors": [
      "Zsolt Lécz",
      "Szilárd Majorosi"
    ],
    "published": "2026-02-16T15:27:15Z",
    "updated": "2026-02-16T15:27:15Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.14824v1",
    "url": "https://arxiv.org/abs/2602.14824v1",
    "pdf_url": "https://arxiv.org/pdf/2602.14824v1.pdf",
    "title": "Experimental Validation of HomHBFEM Simulations of Fast Corrector Magnets for PETRA IV",
    "abstract": "This paper presents experimental validation of the homogenized harmonic balance finite element method (HomHBFEM), which we have developed as a dedicated simulation technique for magnets with fast excitation cycles, in particular the fast corrector (FC) magnets for PETRA IV at DESY. The HomHBFEM allows efficient three-dimensional nonlinear eddy-current simulations of laminated magnets at elevated frequencies with a relatively coarse finite element (FE) mesh and without computationally expensive time-stepping. This is achieved by combining a frequency-domain-based homogenization technique with the harmonic balance FE method. The simulation results for the magnetic flux density along the axis of the FC magnets as a function of frequency and the resulting integrated transfer function (ITF) are compared to Hall probe and search coil measurements of the first prototype FC magnet for PETRA IV. A good agreement between simulated and measured ITFs is achieved for excitation frequencies from 10 Hz to 10 kHz.",
    "authors": [
      "Jan-Magnus Christmann",
      "Laura Anna Maria D'Angelo",
      "Herbert De Gersem",
      "Sven Pfeiffer",
      "Sajjad Hussain Mirza",
      "Adeel Amjad",
      "Lucas Rousselange",
      "Matthias Thede"
    ],
    "published": "2026-02-16T15:16:14Z",
    "updated": "2026-02-16T15:16:14Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.01875v3",
    "url": "https://arxiv.org/abs/2510.01875v3",
    "pdf_url": "https://arxiv.org/pdf/2510.01875v3.pdf",
    "title": "Enhancing the Efficiency of Time-Dependent Density Functional Theory Calculations of Dynamic Response Properties",
    "abstract": "X-ray Thomson scattering (XRTS) constitutes an essential technique for diagnosing material properties under extreme conditions, such as high pressures and intense laser heating. Time-dependent density functional theory (TDDFT) is one of the most accurate available ab initio methods for modeling XRTS spectra, as well as a host of other dynamic material properties. However, strong thermal excitations, along with the need to account for variations in temperature and density as well as the finite size of the detector significantly increase the computational cost of TDDFT simulations compared to ambient conditions. In this work, we present a broadly applicable method for optimizing and enhancing the efficiency of TDDFT calculations. Our approach is based on a one-to-one mapping between the dynamic structure factor and the imaginary time density--density correlation function, which naturally emerges in Feynman's path integral formulation of quantum many-body theory. Specifically, we combine rigorous convergence tests in the imaginary time domain with a constraints-based attenuation of narrow-band fluctuations to improve the efficiency of TDDFT modeling without the introduction of any significant bias. As a result, we can report a speed-up by up to an order of magnitude, thus substantially reducing the burden of computational cost required for XRTS analysis.",
    "authors": [
      "Zhandos A. Moldabekov",
      "Sebastian Schwalbe",
      "Uwe Hernandez Acosta",
      "Thomas Gawne",
      "Jan Vorberger",
      "Michele Pavanello",
      "Tobias Dornheim"
    ],
    "published": "2025-10-02T10:31:46Z",
    "updated": "2026-02-16T15:00:09Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.chem-ph",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2602.14734v1",
    "url": "https://arxiv.org/abs/2602.14734v1",
    "pdf_url": "https://arxiv.org/pdf/2602.14734v1.pdf",
    "title": "An x-ray regenerative amplifier free-electron laser with a step-tapered-undulator",
    "abstract": "Regenerative amplifier x-ray free-electron lasers constitute alternative configurations for fourth generation light sources which are typically operated in self-amplified spontaneous emission (SASE) mode. However, SASE exhibits relatively large fluctuations in the power and spectral properties from shot to shot, whereas XRAFELs provide a much more stable source of hard x-ray photons. Here, we study the performance of an x-ray cavity under consideration at the Stanford Linear Accelerator Facility using both uniform and step-tapered undulators with either transmissive or hole out-coupling.",
    "authors": [
      "Henry P. Freund",
      "P. J. M. van der Slot",
      "P. G. O'Shea"
    ],
    "published": "2026-02-16T13:24:55Z",
    "updated": "2026-02-16T13:24:55Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.15084v1",
    "url": "https://arxiv.org/abs/2602.15084v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15084v1.pdf",
    "title": "TokaMind: A Multi-Modal Transformer Foundation Model for Tokamak Plasma Dynamics",
    "abstract": "We present TokaMind, an open-source foundation model framework for fusion plasma modeling, based on a Multi-Modal Transformer (MMT) and trained on heterogeneous tokamak diagnostics from the publicly available MAST dataset. TokaMind supports multiple data modalities (time-series, 2D profiles, and videos) with different sampling rates, robust missing-signal handling, and efficient task adaptation via selectively loading and freezing four model components. To represent multi-modal signals, we use a training-free Discrete Cosine Transform embedding (DCT3D) and provide a clean interface for alternative embeddings (e.g., Variational Autoencoders - VAEs). We evaluate TokaMind on the recently introduced MAST benchmark TokaMark, comparing training and embedding strategies. Our results show that fine-tuned TokaMind outperforms the benchmark baseline on all but one task, and that, for several tasks, lightweight fine-tuning yields better performance than training the same architecture from scratch under a matched epoch budget. These findings highlight the benefits of multi-modal pretraining for tokamak plasma dynamics and provide a practical, extensible foundation for future fusion modeling tasks. Training code and model weights will be made publicly available.",
    "authors": [
      "Tobia Boschi",
      "Andrea Loreti",
      "Nicola C. Amorisco",
      "Rodrigo H. Ordonez-Hurtado",
      "Cécile Rousseau",
      "George K. Holt",
      "Eszter Székely",
      "Alexander Whittle",
      "Samuel Jackson",
      "Adriano Agnello",
      "Stanislas Pamela",
      "Alessandra Pascale",
      "Robert Akers",
      "Juan Bernabe Moreno",
      "Vassil Alexandrov",
      "Mykhaylo Zayats"
    ],
    "published": "2026-02-16T12:26:07Z",
    "updated": "2026-02-16T12:26:07Z",
    "categories": [
      "physics.plasm-ph",
      "cs.AI",
      "cs.LG"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.12969v2",
    "url": "https://arxiv.org/abs/2602.12969v2",
    "pdf_url": "https://arxiv.org/pdf/2602.12969v2.pdf",
    "title": "Role of the radial electric field in the confinement of energetic ions in the Wendelstein 7-X stellarator",
    "abstract": "Good fast-ion confinement is an essential requirement for a fusion reactor. The magnetic configuration of the Wendelstein 7-X (W7-X) stellarator is partially optimized in this regard in a reactor-relevant scenario: it is expected to show improved fast-ion confinement when $β$ is high and the effect of the radial electric field is negligible. The experimental validation of this optimization is difficult since, with the available power, achieving high $β$ under appropriate conditions for the validation is challenging and the effect of the radial electric field is inevitable. In this work, the confinement of fast ions in W7-X has been studied numerically for a variety of scenarios via the ASCOT5 code. The effect of the radial electric field on fast-ion losses is confirmed to be equivalent to the one produced by $β$, and this is characterized by means of scans on both parameters. Through a preliminary study with experimentally-based profiles, a viable scenario is identified that takes advantage of this effect for the experimental validation of the optimization strategy of W7-X.",
    "authors": [
      "M. Arranz",
      "J. L. Velasco",
      "I. Calvo",
      "D. Carralero"
    ],
    "published": "2026-02-13T14:43:01Z",
    "updated": "2026-02-16T10:24:27Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  }
]