{
  "arxiv_id": "2512.23682v1",
  "url": "https://arxiv.org/abs/2512.23682v1",
  "pdf_url": "https://arxiv.org/pdf/2512.23682v1.pdf",
  "title": "Predicting core transport in ITER baseline discharges with neon injections",
  "abstract": "Achieving self-consistent performance predictions for ITER requires integrated modeling of core transport and divertor power exhaust under realistic impurity conditions. We present results from the first systematic power-flow and impurity-content study for the ITER 15 MA baseline scenario constrained directly by existing SOLPS-ITER neon-seeded divertor solutions. Using the OMFIT STEP workflow, stationary temperature and density profiles are predicted with TGYRO for $1.5 \\le Z_{\\rm eff} \\le 2.5$, and the corresponding power crossing the separatrix $P_{\\rm sep}$ is evaluated. We find that $P_{\\rm sep}$ varies by more than a factor of 1.7 across this scan and matches the $\\sim 100$~MW SOLPS-ITER prediction when $Z_{\\rm eff} \\simeq 1.6$ or when auxiliary heating is reduced to $\\sim 75\\%$ of nominal. Rotation-sensitivity studies show that plausible variations in toroidal flow magnitude modify $P_{\\rm sep}$ by $\\lesssim 20\\%$, while AURORA modeling confirms that charge-exchange radiation inside the separatrix is dynamically negligible under predicted ITER neutral densities. These results identify a restricted compatibility window, $Z_{\\rm eff} \\approx 1.6$--1.75 and $0.75 \\lesssim f_{P_{\\rm aux}} \\le 1.0$, in which core transport predictions remain aligned with neon-seeded divertor protection targets. This self-consistent, model-constrained framework provides actionable guidance for impurity control and auxiliary-heating scheduling in early ITER operation and supports future whole-device scenario optimization.",
  "authors": [
    "Dmitri M Orlov",
    "Joseph McClenaghan",
    "Jeff Candy",
    "Jeremy D Lore",
    "Nathan T Howard",
    "Francesco Sciortino",
    "Christopher Holland"
  ],
  "published": "2025-12-29T18:40:00Z",
  "updated": "2025-12-29T18:40:00Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}