{
  "arxiv_id": "2509.24075v1",
  "url": "https://arxiv.org/abs/2509.24075v1",
  "pdf_url": "https://arxiv.org/pdf/2509.24075v1.pdf",
  "title": "Wafer-Level Prototyping Tools for CMOS Bioelectronic Sensors",
  "abstract": "Integrating biology with complementary metal-oxide-semiconductor (CMOS) sensors can enable highly parallel measurements with minimal parasitic effects, significantly enhancing sensitivity. However, realizing this potential often requires overcoming substantial barriers related to design, fabrication, and heterogeneous integration. In this context, we present a comprehensive suite of tools and methods designed for wafer-scale biosensor prototyping that is sensitive, highly parallelizable, and manufacturable. A central component of our approach is a new initiative that allows for open-source multi-project wafers (MPW), giving all participants access to the designs submitted by others. We demonstrate that this strategy not only promotes design reuse but also facilitates advanced back-end-of-line (BEOL) fabrication techniques, improving the manufacturability and process yield of CMOS biosensors. Developing CMOS-based biosensors also involves the challenge of heterogeneous integration, which includes external electrical, mechanical, and fluid layers. We demonstrate simple modular designs that enable such integration for sample delivery and signal readout. Finally, we showcase the effectiveness of our approach in measuring the hybridization of DNA molecules by focusing on data acquisition and machine learning (ML) methods that leverage the parallelism of the sensors to enable robust classification of desirable analyte interactions.",
  "authors": [
    "Advait Madhavan",
    "Ruohong Shi",
    "Alokik Kanwal",
    "Glenn Holland",
    "Jacob M. Majikes",
    "Paul N. Patrone",
    "Anthony J. Kearsley",
    "Arvind Balijepalli"
  ],
  "published": "2025-09-28T21:21:29Z",
  "updated": "2025-09-28T21:21:29Z",
  "categories": [
    "physics.ins-det",
    "physics.bio-ph"
  ],
  "primary_category": "physics.ins-det"
}