{
  "arxiv_id": "2509.25544v1",
  "url": "https://arxiv.org/abs/2509.25544v1",
  "pdf_url": "https://arxiv.org/pdf/2509.25544v1.pdf",
  "title": "Development Status of the KIPM Detector Consortium",
  "abstract": "A Kinetic Inductance Phonon-Mediated Detector is a calorimeter that uses kinetic inductance detectors to read out phonon signals from the device substrate. We have established a consortium comprising university and national lab groups dedicated to advancing the state of the art in these detectors, with the ultimate goal of designing a detector sub-eV threshold on energy deposited in the substrate, enabling searches for both light dark matter and low-energy neutrino interactions. This consortium brings together experts in kinetic inductance detector design, phonon and quasiparticle dynamics, and noise modeling, along with specialized fabrication facilities, test platforms, and unique calibration capabilities. Recently, our consortium has demonstrated a resolution on energy absorbed by the sensor of 2.1 eV, the current record for such devices. The current focus of the consortium is modeling and improving the phonon collection efficiency and implementing low-$\\boldsymbol{T_c}$ superconductors, both of which serve to improve the overall energy resolution and threshold of the detectors.",
  "authors": [
    "Dylan J Temples",
    "Zoë J. Smith",
    "Selby Q Dang",
    "Taylor Aralis",
    "Chi Cap",
    "Clarence Chang",
    "Yen-Yung Chang",
    "Maurice Garcia-Sciveres",
    "Sunil Golwala",
    "William Ho",
    "Noah Kurinsky",
    "Kungang Li",
    "Xinran Li",
    "Marharyta Lisovenko",
    "Elizabeth Panner",
    "Karthik Ramanathan",
    "Shilin Ray",
    "Brandon Sandoval",
    "Aritoki Suzuki",
    "Gensheng Wang",
    "Osmond Wen",
    "Michael Williams",
    "Junwen Robin Xiong",
    "Volodymyr Yefremenko"
  ],
  "published": "2025-09-29T22:04:06Z",
  "updated": "2025-09-29T22:04:06Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}