{
  "arxiv_id": "2509.26174v1",
  "url": "https://arxiv.org/abs/2509.26174v1",
  "pdf_url": "https://arxiv.org/pdf/2509.26174v1.pdf",
  "title": "BABY 1L: First Tritium Breeding Campaign Results",
  "abstract": "Achieving tritium self-sufficiency is a critical challenge for future fusion power plants. The BABY 1L experiment, part of the LIBRA project at MIT, aims to benchmark tritium breeding and release in molten salt breeder systems under deuterium-tritium (DT) neutron irradiation. Building on the initial \\SI{100}{mL} campaign, BABY 1L introduces a tenfold increase in breeder volume, improved thermal and gas handling systems, and enhanced neutron diagnostics, including a proton recoil telescope. We report on results from four irradiation experiments using sealed-tube DT neutron generators, with tritium collected by water bubblers measured via liquid scintillation counting. Experimentally determined Tritium Breeding Ratios (TBRs) were compared to OpenMC neutronics simulations, showing very good agreement. The measured TBR values demonstrate a six-fold improvement over the \\SI{100}{mL} experiments, largely attributed to the increased solid angle and improved measurement fidelity. We also investigate tritium release dynamics and identify diffusion-limited transport as the dominant regime in the salt volume in the temperature range 630-750 \\si{\\celsius}. Additionally, we observe that the introduction of hydrogen in the helium carrier gas significantly accelerates tritium release, consistent with an isotopic exchange mechanism. All analysis is conducted through the open-source \\texttt{libra-toolbox} \\cite{libra-toolbox}, which streamlines simulation, data processing, and validation across experimental campaigns. These results provide critical insights into the design and operation of future liquid breeder systems and demonstrate the maturity of the BABY platform as a testbed for tritium breeding studies.",
  "authors": [
    "Rémi Delaporte-Mathurin",
    "Nikola Goles",
    "Collin Dunn",
    "Emily Edwards",
    "Sara Ferry",
    "Ross MacDonald",
    "Ethan Peterson",
    "Davide Pettinari",
    "Stefano Segantin",
    "Weiyue Zhou",
    "Kevin B. Woller"
  ],
  "published": "2025-09-30T12:30:12Z",
  "updated": "2025-09-30T12:30:12Z",
  "categories": [
    "physics.ins-det",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.ins-det"
}