{
  "arxiv_id": "2506.04973v2",
  "url": "https://arxiv.org/abs/2506.04973v2",
  "pdf_url": "https://arxiv.org/pdf/2506.04973v2.pdf",
  "title": "Bayesian network 3D event reconstruction in the Cygno optical TPC for dark matter direct detection",
  "abstract": "The CYGNO experiment is developing a high-resolution gaseous Time Projection Chamber with optical readout for directional dark matter searches. The detector uses a helium-tetrafluoromethane (He:CF$_4$ 60:40) gas mixture at atmospheric pressure and a triple Gas Electron Multiplier amplification stage, coupled with a scientific camera for high-resolution 2D imaging and fast photomultipliers for time-resolved scintillation light detection. This setup enables 3D event reconstruction: photomultipliers signals provide depth information, while the camera delivers high-precision transverse resolution. In this work, we present a Bayesian Network-based algorithm designed to reconstruct the events using only the photomultipliers signals, yielding a full 3D description of the particle trajectories. The algorithm models the light collection process probabilistically and estimates spatial and intensity parameters on the Gas Electron Multiplier plane, where light emission occurs. It is implemented within the Bayesian Analysis Toolkit and uses Markov Chain Monte Carlo sampling for posterior inference. Validation using data from the CYGNO LIME prototype shows accurate reconstruction of localized and extended tracks. Results demonstrate that the Bayesian approach enables robust 3D description and, when combined with camera data, further improves the precision of track reconstruction. This methodology represents a significant step forward in directional dark matter detection, enhancing the identification of nuclear recoil tracks with high spatial resolution.",
  "authors": [
    "Fernando Domingues Amaro",
    "Rita Antonietti",
    "Elisabetta Baracchini",
    "Luigi Benussi",
    "Stefano Bianco",
    "Francesco Borra",
    "Cesidio Capoccia",
    "Michele Caponero",
    "Gianluca Cavoto",
    "Igor Abritta Costa",
    "Antonio Croce",
    "Emiliano Dané",
    "Melba D'Astolfo",
    "Giorgio Dho",
    "Flaminia Di Giambattista",
    "Emanuele Di Marco",
    "Giulia D'Imperio",
    "Matteo Folcarelli",
    "Joaquim Marques Ferreira dos Santos",
    "Davide Fiorina",
    "Francesco Iacoangeli",
    "Zahoor Ul Islam",
    "Herman Pessoa Lima Júnior",
    "Ernesto Kemp",
    "Giovanni Maccarrone",
    "Rui Daniel Passos Mano",
    "David José Gaspar Marques",
    "Luan Gomes Mattosinhos de Carvalhoand Giovanni Mazzitelli",
    "Alasdair Gregor McLean",
    "Pietro Meloni",
    "Andrea Messina",
    "Cristina Maria Bernardes Monteiro",
    "Rafael Antunes Nobrega",
    "Igor Fonseca Pains",
    "Emiliano Paoletti",
    "Luciano Passamonti",
    "Fabrizio Petrucci",
    "Stefano Piacentini",
    "Davide Piccolo",
    "Daniele Pierluigi",
    "Davide Pinci",
    "Atul Prajapati",
    "Francesco Renga",
    "Rita Joana Cruz Roque",
    "Filippo Rosatelli",
    "Alessandro Russo",
    "Giovanna Saviano",
    "Pedro Alberto Oliveira Costa Silva",
    "Neil John Curwen Spooner",
    "Roberto Tesauro",
    "Sandro Tomassini",
    "Samuele Torelli",
    "Donatella Tozzi"
  ],
  "published": "2025-06-05T12:44:52Z",
  "updated": "2025-11-11T19:43:13Z",
  "categories": [
    "physics.ins-det",
    "astro-ph.IM",
    "hep-ex",
    "physics.data-an"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.1140/epjc/s10052-025-14965-6"
}