{
  "arxiv_id": "2511.10127v1",
  "url": "https://arxiv.org/abs/2511.10127v1",
  "pdf_url": "https://arxiv.org/pdf/2511.10127v1.pdf",
  "title": "Microscopy X-ray Imaging enriched with Small Angle X-ray Scattering for few nanometer resolution reveals shock waves and compression in intense short pulse laser irradiation of solids",
  "abstract": "Understanding how laser pulses compress solids into high-energy-density states requires diagnostics that simultaneously resolve macroscopic geometry and nanometer-scale structure. Here we present a combined X-ray imaging (XRM) and small-angle X-ray scattering (SAXS) approach that bridges this diagnostic gap. Using the Matter in Extreme Conditions end station at LCLS, we irradiated 25-micrometer copper wires with 45-fs, 0.9-J, 800-nm pulses at 3.5e19 W/cm2 while probing with 8.2-keV XFEL pulses. XRM visualizes the evolution of ablation, compression, and inward-propagating fronts with about 200-nm resolution, while SAXS quantifies their nanometer-scale sharpness through the time-resolved evolution of scattering streaks. The joint analysis reveals that an initially smooth compression steepens into a nanometer-sharp shock front after roughly 18 ps, consistent with an analytical steepening model and hydrodynamic simulations. The front reaches a velocity of about 25 km/s and a lateral width of several tens of micrometers, demonstrating for the first time the direct observation of shock formation and decay at solid density with few-nanometer precision. This integrated XRM-SAXS method establishes a quantitative, multiscale diagnostic of laser-driven shocks in dense plasmas relevant to inertial confinement fusion, warm dense matter, and planetary physics.",
  "authors": [
    "Thomas Kluge",
    "Arthur Hirsch-Passicos",
    "Jannis Schulz",
    "Mungo Frost",
    "Eric Galtier",
    "Maxence Gauthier",
    "Jörg Grenzer",
    "Christian Gutt",
    "Lingen Huang",
    "Uwe Hübner",
    "Megan Ikeya",
    "Hae Ja Lee",
    "Dimitri Khaghani",
    "Willow Moon Martin",
    "Brian Edward Marré",
    "Motoaki Nakatsutsumi",
    "Paweł Ordyna",
    "Franziska-Luise Paschke-Brühl",
    "Alexander Pelka",
    "Lisa Randolph",
    "Hans-Peter Schlenvoigt",
    "Christopher Schoenwaelder",
    "Michal Šmíd",
    "Long Yang",
    "Ulrich Schramm",
    "Thomas E. Cowan"
  ],
  "published": "2025-11-13T09:33:58Z",
  "updated": "2025-11-13T09:33:58Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}