{
  "arxiv_id": "2511.09863v1",
  "url": "https://arxiv.org/abs/2511.09863v1",
  "pdf_url": "https://arxiv.org/pdf/2511.09863v1.pdf",
  "title": "Topmetal-L: A Low Noise Charge-Sensitive Pixel Sensor for POLAR2/LPD",
  "abstract": "POLAR-2 is a next-generation space astronomy platform led by China, with its core scientific objective focused on high-precision polarization measurements of gamma-ray bursts. As one of its key payloads, the Low-energy Polarization Detector (LPD) is designed to perform wide-field surveys to capture X-ray polarization information from gamma-ray bursts in the 2-10 keV energy range. This paper presents Topmetal-L, a dedicated charge-sensitive pixel sensor developed for the LPD prototype upgrade. Fabricated in a 130 nm CMOS process in 2024, the chip integrates a 356 $\\times$ 512 pixel array with a pixel pitch of 45 $μ$m. Each pixel incorporates a 26 $\\times$ 26 $μ$m^2 charge-collecting electrode window and is capable of simultaneously outputting both energy and position information of deposited charges. Topmetal-L has been systematically optimized for power consumption, noise performance, and readout efficiency. It exhibits an input dynamic range of 0-4 ke-, a typical charge-to-voltage conversion gain of 76.04 $μ$V/e-, an average equivalent noise charge of approximately 22.8 e-, a sensitive area exceeding 3.6 cm^2, and a total power consumption of 720 mW per chip. To meet the requirements of large-area, high-frame-rate readout for gas-based polarization detectors, a sentinel-scanning readout scheme is proposed, reducing the full-frame readout time to 730 $μ$s. A prototype Topmetal-L-based gas polarization detection system was evaluated across key energies: it exhibited a residual modulation of 0.26% $\\pm$ 0.45% at 5.90 keV, a modulation factor of 66.67% $\\pm$ 0.45% for a linearly polarized 8.0 keV source, and a counting rate saturated at 15 k counts/(cm^2$\\cdot$s) when tested at 5.4 keV.",
  "authors": [
    "Li-rong Xie",
    "Shi-Qiang Zhou",
    "Di-Fan Yi",
    "Huan-Bo Feng",
    "Zhu-Ke Feng",
    "Dong Wang",
    "Chao-song Gao",
    "En-Wei Liang",
    "Xiang-Ming Sun",
    "Hong-Bang Liu"
  ],
  "published": "2025-11-13T01:43:37Z",
  "updated": "2025-11-13T01:43:37Z",
  "categories": [
    "astro-ph.IM",
    "nucl-ex",
    "physics.ins-det"
  ],
  "primary_category": "astro-ph.IM"
}