{
  "arxiv_id": "2511.09543v1",
  "url": "https://arxiv.org/abs/2511.09543v1",
  "pdf_url": "https://arxiv.org/pdf/2511.09543v1.pdf",
  "title": "Conservation of magnetic-helicity fluctuations due to spatial decorrelation of fluxes in decaying MHD turbulence",
  "abstract": "Hosking & Schekochihin (2021, Phys. Rev. X 11, 041005) have proposed that statistically isotropic decaying MHD turbulence without net magnetic helicity conserves the mean square fluctuation level of magnetic helicity in large volumes -- or, equivalently, the integral over space of the two-point correlation function of the magnetic-helicity density, denoted $I_H$. Formally, the conservation and gauge invariance of $I_H$ require the vanishing of certain boundary terms related to the strength of long-range spatial correlations. These boundary terms represent the ability (or otherwise) of the turbulence to organise fluxes over arbitrarily large distances to deplete or enhance fluctuations of magnetic helicity. In this work, we present a theory of these boundary terms, employing a methodology analogous to that of Batchelor & Proudman (1956, Philos. Trans. R. Soc. A 248, 369) to determine the relevant asymptotic forms of correlation functions. We find that long-range correlations of sufficient strength to violate the conservation of $I_H$ cannot develop dynamically if the evolution equation for the magnetic vector potential is chosen to be local in space. Likewise, we find that such correlations cannot develop for a wide class of gauge choices that make this equation non-local (including the Coulomb gauge). Nonetheless, we also identify a class of non-local gauge choices for which correlations that are sufficiently strong to violate the conservation of $I_H$ do appear possible. We verify our theoretical predictions for the case of the Coulomb gauge with measurements of correlation functions in a high-resolution numerical simulation.",
  "authors": [
    "Justin Kin Jun Hew",
    "David N. Hosking",
    "Christoph Federrath",
    "James R. Beattie",
    "Neco Kriel"
  ],
  "published": "2025-11-12T18:45:42Z",
  "updated": "2025-11-12T18:45:42Z",
  "categories": [
    "physics.flu-dyn",
    "astro-ph.CO",
    "astro-ph.HE",
    "astro-ph.SR",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.flu-dyn"
}