{
  "arxiv_id": "2511.10096v1",
  "url": "https://arxiv.org/abs/2511.10096v1",
  "pdf_url": "https://arxiv.org/pdf/2511.10096v1.pdf",
  "title": "Tailored Three Dimensional Betatron Dynamics in UltraStable Hybrid Laser Plasma RF Accelerators",
  "abstract": "The detailed theoretical and numerical investigation of hybrid laser plasma RF accelerators, elucidating the mechanisms governing transverse beam dynamics, betatron polarization, and radiation reaction in ultra-relativistic electron bunches is presented. This framework combines analytical models of spatiotemporal plasma wakefield modulation, phase-dependent RF-driven oscillations, and quantum-corrected Landau Lifshitz radiation reaction with fully self-consistent 3D particle in cell simulations using EPOCH. The results demonstrate that RF amplitude, frequency, and phase enable precise control over transverse focusing strengths, betatron oscillation amplitudes, and polarization states. Resonant alignment between RF fields and natural betatron frequencies amplifies transverse excursions while damping parasitic oscillations through enhanced focusing gradients and radiation reaction, yielding reductions in emittance and mitigation of synchrotron-like energy losses. Stability maps and 3D force landscapes reveal strong phase sensitivity, where initial conditions and RF component ratios govern the temporal evolution of betatron amplitudes, and longitudinal field gradients modulate γ growth rates. These findings provide a comprehensive picture of nonlinear, resonant, and damping phenomena in hybrid laser plasma RF systems, highlighting the full spectrum of controllable transverse, longitudinal, and polarization dynamics in ultra relativistic electron beams.",
  "authors": [
    "A. A. Molavi Choobini",
    "M. Shahmansouri"
  ],
  "published": "2025-11-13T08:55:18Z",
  "updated": "2025-11-13T08:55:18Z",
  "categories": [
    "physics.plasm-ph",
    "physics.acc-ph",
    "physics.comp-ph"
  ],
  "primary_category": "physics.plasm-ph"
}