{
  "arxiv_id": "2511.09725v1",
  "url": "https://arxiv.org/abs/2511.09725v1",
  "pdf_url": "https://arxiv.org/pdf/2511.09725v1.pdf",
  "title": "The Data Fusion Labeler (dFL): Challenges and Solutions to Data Harmonization, Labeling, and Provenance in Fusion Energy",
  "abstract": "Fusion energy research increasingly depends on the ability to integrate heterogeneous, multimodal datasets from high-resolution diagnostics, control systems, and multiscale simulations. The sheer volume and complexity of these datasets demand the development of new tools capable of systematically harmonizing and extracting knowledge across diverse modalities. The Data Fusion Labeler (dFL) is introduced as a unified workflow instrument that performs uncertainty-aware data harmonization, schema-compliant data fusion, and provenance-rich manual and automated labeling at scale. By embedding alignment, normalization, and labeling within a reproducible, operator-order-aware framework, dFL reduces time-to-analysis by greater than 50X (e.g., enabling >200 shots/hour to be consistently labeled rather than a handful per day), enhances label (and subsequently training) quality, and enables cross-device comparability. Case studies from DIII-D demonstrate its application to automated ELM detection and confinement regime classification, illustrating its potential as a core component of data-driven discovery, model validation, and real-time control in future burning plasma devices.",
  "authors": [
    "Craig Michoski",
    "Matthew Waller",
    "Brian Sammuli",
    "Zeyu Li",
    "Tapan Ganatma Nakkina",
    "Raffi Nazikian",
    "Sterling Smith",
    "David Orozco",
    "Dongyang Kuang",
    "Martin Foltin",
    "Erik Olofsson",
    "Mike Fredrickson",
    "Jerry Louis-Jeune",
    "David R. Hatch",
    "Todd A. Oliver",
    "Mitchell Clark",
    "Steph-Yves Louis"
  ],
  "published": "2025-11-12T20:33:40Z",
  "updated": "2025-11-12T20:33:40Z",
  "categories": [
    "physics.plasm-ph",
    "cs.LG",
    "physics.data-an"
  ],
  "primary_category": "physics.plasm-ph"
}