{
  "arxiv_id": "2511.09075v1",
  "url": "https://arxiv.org/abs/2511.09075v1",
  "pdf_url": "https://arxiv.org/pdf/2511.09075v1.pdf",
  "title": "PIC analysis of spatiotemporal THz emission from radial and longitudinal wakefields via copropagating chirped lasers in magnetized rippled plasma",
  "abstract": "The excitation of radial and longitudinal wake-fields by two co-propagating chirped laser pulses in a rippled, magnetized plasma has been examined. This study aimed to clarify the spatiotemporal evolution of wake structures and assess their role in the generation of THz radiation. A Fourier-Bessel Particle-In-Cell (FBPIC) simulation framework, optimized for cylindrical geometries, has been employed to model the relativistic dynamics of plasma electrons under the combined influence of laser-induced ponderomotive forces and an external magnetic field. It has been shown that the beat frequency between the pulses modulates the ponderomotive force, driving nonlinear wake-field structures sustained by electron oscillations. Simulations performed with high spatial resolution have revealed that wake-field amplitude and coherence are strongly influenced by laser chirp, pulse duration, and plasma density. Distinct THz peaks have been identified in the Fourier-transformed spectra, with their amplitudes enhanced by resonant coupling between wake-field harmonics and the laser frequency modulation. Moreover, electron motion has been confined by the magnetic field, leading to improved energy gain and shaping of angular radiation patterns. These findings suggest that tailored laser and plasma configurations can be used to optimize energy transfer mechanisms, paving the way for more efficient wake-field usage and THz generation.",
  "authors": [
    "A. A. Molavi Choobini",
    "F. M. Aghamir"
  ],
  "published": "2025-11-12T07:49:24Z",
  "updated": "2025-11-12T07:49:24Z",
  "categories": [
    "physics.plasm-ph",
    "physics.acc-ph",
    "physics.comp-ph",
    "physics.optics"
  ],
  "primary_category": "physics.plasm-ph"
}