{
  "arxiv_id": "2511.08959v1",
  "url": "https://arxiv.org/abs/2511.08959v1",
  "pdf_url": "https://arxiv.org/pdf/2511.08959v1.pdf",
  "title": "Improved Modeling of Quasi-Static Thermal and Optical Response of Lumped-Element Aluminum Manganese KIDs",
  "abstract": "We report on the optical characterization of the AlMn kinetic inductance detectors (KIDs) in development for use in the Next-generation Extended Wavelength-MUltiband Sub/millimeter Inductance Camera (NEW-MUSIC) on the Leighton Chajnantor Telescope (LCT). NEW-MUSIC will cover 80-420 GHz, split into six spectral bands, with polarimetry. This broad spectral coverage will enable study of a range of scientific topics such as the accretion and feedback in galaxies and galaxy cluster evolution via the Sunyaev-Zeldovich effect, the transient synchrotron emission from the explosive deaths of massive stars and other time-domain phenomena, and dusty sources from low to high redshift (with polarization). Al KIDs have already been demonstrated for bands 2-5. AlMn KIDs will be used for the 90~GHz band, as Al's pair-breaking energy is too high. However, AlMn has only barely been explored as a KID material. To this end, we first improved the modeling techniques used for Al KIDs within BCS theory by eliminating the use of analytical approximations for the expressions of the complex conductivity and found these changes reduced fit parameter degeneracy in the analysis of AlMn. Then, we tested the addition of a gap smearing parameter, a standard extension to BCS theory in use for high kinetic inductance materials, and found it did not improve the fits.",
  "authors": [
    "Adriana Gavidia",
    "Sunil Golwala",
    "Andrew D. Beyer",
    "Daniel Cunnane",
    "Peter K. Day",
    "Fabien Defrance",
    "Clifford F. Frez",
    "Xiaolan Huang",
    "Junhan Kim",
    "Jean-Marc Martin",
    "Jack Sayers",
    "Shibo Shu",
    "Shiling Yu",
    "Yann Sadou"
  ],
  "published": "2025-11-12T04:03:59Z",
  "updated": "2025-11-12T04:03:59Z",
  "categories": [
    "astro-ph.IM",
    "physics.ins-det"
  ],
  "primary_category": "astro-ph.IM"
}