[
  {
    "arxiv_id": "2511.10540v1",
    "url": "https://arxiv.org/abs/2511.10540v1",
    "pdf_url": "https://arxiv.org/pdf/2511.10540v1.pdf",
    "title": "Edge Machine Learning for Cluster Counting in Next-Generation Drift Chambers",
    "abstract": "Drift chambers have long been central to collider tracking, but future machines like a Higgs factory motivate higher granularity and cluster counting for particle ID, posing new data processing challenges. Machine learning (ML) at the \"edge\", or in cell-level readout, can dramatically reduce the off-detector data rate for high-granularity drift chambers by performing cluster counting at-source. We present machine learning algorithms for cluster counting in real-time readout of future drift chambers. These algorithms outperform traditional derivative-based techniques based on achievable pion-kaon separation. When synthesized to FPGA resources, they can achieve latencies consistent with real-time operation in a future Higgs factory scenario, thus advancing both R&D for future collider detectors as well as hardware-based ML for edge applications in high energy physics.",
    "authors": [
      "Deniz Yilmaz",
      "Liangyu Wu",
      "Julia Gonski"
    ],
    "published": "2025-11-13T17:39:22Z",
    "updated": "2025-11-13T17:39:22Z",
    "categories": [
      "physics.ins-det",
      "cs.LG"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.13831v2",
    "url": "https://arxiv.org/abs/2509.13831v2",
    "pdf_url": "https://arxiv.org/pdf/2509.13831v2.pdf",
    "title": "Signal Processing and Machine Learning Algorithms for Precise Timing with PICOSEC Micromegas Detectors",
    "abstract": "High particle rates in current and future experiments make pile-up phenomena a critical issue for extracting useful information. In this context, timing can be important as the 4$^{\\mathrm{th}}$ dimension parameter for triggering or event reconstruction. The PICOSEC-Micromegas detector has been shown to offer precise timing of the order of tens of\\,ps. In this work, novel signal processing algorithms are being developed and evaluated to demonstrate the technology's ability for online precise timing. We propose, an algorithm based on Artificial Neural Networks (ANN). This algorithm uses a model to train the ANN. The performance of the different algorithms is evaluated using experimental data, resulting in a timing resolution of 18.3 $\\pm$ 0.6\\,ps, comparable to the standard analysis based on the Constant Fraction Discrimination technique. Additionally, an alternative algorithm using the charge of the pulse exceeding a threshold as a parameter to correct for systematic effects is reported.",
    "authors": [
      "A. Kallitsopoulou",
      "I. Maniatis",
      "I. Manthos",
      "T. Papaevangelou",
      "L. Sohl",
      "A. Tsiamis",
      "S. E. Tzamarias"
    ],
    "published": "2025-09-17T08:56:21Z",
    "updated": "2025-11-13T17:18:01Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.10476v1",
    "url": "https://arxiv.org/abs/2511.10476v1",
    "pdf_url": "https://arxiv.org/pdf/2511.10476v1.pdf",
    "title": "Collisional and magnetic effects on the polarization of the solar oxygen infrared triplet",
    "abstract": "Context: The scattering polarization of the infrared (IR) triplet of neutral oxygen (O\\,\\textsc{i}) near 777\\,nm provides a powerful diagnostic of solar atmospheric conditions. However, interpreting such polarization requires a rigorous treatment of isotropic depolarizing collisions between O\\,\\textsc{i} atoms and neutral hydrogen.   Aims: We aim to investigate the combined effects of collisional and magnetic depolarization in shaping the alignment of O\\,\\textsc{i} levels (and thus the polarization of the O\\,\\textsc{i} IR triplet).   Methods: We compute, for the first time, a comprehensive set of collisional depolarization and polarization transfer rates for the relevant O\\,\\textsc{i} energy levels. These rates are incorporated into a multi-level atomic model, and the statistical equilibrium equations (SEE) are solved to quantify the impact of collisions and magnetic fields on atomic alignment.   Results: Our calculations indicate that elastic collisions with neutral hydrogen, together with the Hanle effect of turbulent magnetic fields stronger than about 20 G, efficiently suppress the bulk of the atomic alignment in deep photospheric conditions where hydrogen densities exceed $n_{\\mathrm{H}} \\sim 10^{16}$ cm$^{-3}$. In the chromosphere, however, the lower hydrogen density weakens collisional depolarization, allowing polarization to persist.   Conclusions: Our results are consistent with a chromospheric origin for the linear polarization signals of the O I IR triplet. Future studies should combine accurate non-LTE radiative transfer with reliable collisional rates in order to achieve fully consistent modeling.",
    "authors": [
      "Moncef Derouich",
      "Saleh Qutub"
    ],
    "published": "2025-11-13T16:41:39Z",
    "updated": "2025-11-13T16:41:39Z",
    "categories": [
      "astro-ph.SR",
      "physics.atom-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2511.10438v1",
    "url": "https://arxiv.org/abs/2511.10438v1",
    "pdf_url": "https://arxiv.org/pdf/2511.10438v1.pdf",
    "title": "Self-organisation through layering of $β$-plane like turbulence in plasmas and geophysical fluids",
    "abstract": "Staircase formation and layering is studied in simplified, potential vorticity conserving models of plasmas and geophysical fluids, by investigating turbulent self-organisation and nonlinear saturation with different mechanisms of free energy production -- forcing or linear instability -- and with standard or modified zonal flow responses. To this end, staircase formation in both the standard and modified Charney-Hasegawa-Mima equations with stochastic forcing, along with two different simple instability driven models -- one from a plasma and from a geophysical context -- are studied and compared. In these studies, it is observed that $β$-plane turbulence that does not distinguish between zonal and non-zonal perturbations (i.e., standard zonal response) gradually forms large-scale, elliptic zonal structures that merge progressively, regardless of whether it is driven by forcing (though it should be slow enough to allow wave couplings) or by the baroclinic instability, using for example a two-layer model. Conversely, the plasma system, with its modified zonal response, can rapidly form straight, stationary jets of well-defined size, again regardless of the way it is driven: by stochastic forcing or by the dissipative drift instability. Furthermore, the instability-driven plasma system exhibits a phase transition between a zonal flow dominated state and an eddy dominated state. In both states, saturation is possible without large-scale friction.",
    "authors": [
      "P. L. Guillon",
      "G. Dif-Pradalier",
      "Y. Sarazin",
      "D. W. Hughes",
      "Ö. D. Gürcan"
    ],
    "published": "2025-11-13T16:00:45Z",
    "updated": "2025-11-13T16:00:45Z",
    "categories": [
      "physics.plasm-ph",
      "physics.flu-dyn"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.10377v1",
    "url": "https://arxiv.org/abs/2511.10377v1",
    "pdf_url": "https://arxiv.org/pdf/2511.10377v1.pdf",
    "title": "Development of the CEPC analog hadron calorimeter prototype",
    "abstract": "The Circular Electron Positron Collider (CEPC) is a next-generation electron$-$positron collider proposed for the precise measurement of the properties of the Higgs boson. To emphasize boson separation and jet reconstruction, the baseline design of the CEPC detector was guided by the particle flow algorithm (PFA) concept. As one of the calorimeter options, the analogue hadron calorimeter (AHCAL) was proposed. The CEPC AHCAL comprises a 40-layer sandwich structure using steel plates as absorbers and scintillator tiles coupled with silicon photomultipliers (SiPM) as sensitive units. To validate the feasibility of the AHCAL option, a series of studies were conducted to develop a prototype. This AHCAL prototype underwent an electronic test and a cosmic ray test to assess its performance and ensure it was ready for three beam tests performed in 2022 and 2023. The test beam data is currently under analysis, and the results are expected to deepen our understanding of hadron showers, validate the concept of Particle Flow Algorithm (PFA), and ultimately refine the design of the CEPC detector.",
    "authors": [
      "Yukun Shi",
      "Anshun Zhou",
      "Hao Liu",
      "Jiechen Jiang",
      "Yanyun Duan",
      "Yunlong Zhang",
      "Zhongtao Shen",
      "Jianbei Liu",
      "Boxiang Yu",
      "Shu Li",
      "Haijun Yang",
      "Yong Liu",
      "Liang Li",
      "Zhen Wang",
      "Siyuan Song",
      "Dejing Du",
      "Jiaxuan Wang",
      "Junsong Zhang",
      "Quan Ji"
    ],
    "published": "2025-11-13T14:51:34Z",
    "updated": "2025-11-13T14:51:34Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.09442v2",
    "url": "https://arxiv.org/abs/2511.09442v2",
    "pdf_url": "https://arxiv.org/pdf/2511.09442v2.pdf",
    "title": "An ultrafast plenoptic-camera system for high-resolution 3D particle tracking in unsegmented scintillators",
    "abstract": "Detectors deployed in high-resolution neutrino experiments, particle calorimetry, or dark matter candidate searches require dense and massive active materials and, in some cases, extremely fine segmentation. This is essential for achieving precise three-dimensional tracking of the interaction products and enabling accurate particle-flow reconstruction. Organic scintillator detectors, for example, in the form of scintillating fibres, offer sub-millimetre spatial and sub-nanosecond temporal resolution. However, such systems introduce significant challenges in construction and demand a large number of readout electronics channels, leading to extremely high costs that are difficult to mitigate. In this article, we propose a paradigm shift in the detection of elementary particles that leads to ultrafast three-dimensional high-resolution imaging in large volumes of unsegmented scintillator. The key enabling technologies are plenoptic systems and time-resolving single-photon avalanche diode (SPAD) array imaging sensors. Together, they allow us, for the first time ever with a plenoptic camera, the reconstruction of the origin of single photons in the scintillator, thereby facilitating an event-by-event analysis. A case study focused on neutrino detection demonstrates the unique potential of this approach, achieving full event reconstruction with a spatial resolution on the order of two hundred micrometres. This work paves the way for a new class of particle scintillator-based detectors, whose capabilities should be further enhanced through future developments and expanded to Cherenkov light detection and calorimetry at collider neutrino experiments, searches for neutrinoless double beta decay, as well as applications such as medical imaging and fast neutron detection.",
    "authors": [
      "Till Dieminger",
      "Saúl Alonso-Monsalve",
      "Christoph Alt",
      "Claudio Bruschini",
      "Noemi Bührer",
      "Edoardo Charbon",
      "Kodai Kaneyasu",
      "Tim Weber",
      "Davide Sgalaberna"
    ],
    "published": "2025-11-12T15:56:55Z",
    "updated": "2025-11-13T14:35:03Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.10228v2",
    "url": "https://arxiv.org/abs/2510.10228v2",
    "pdf_url": "https://arxiv.org/pdf/2510.10228v2.pdf",
    "title": "Performance of heavy-flavour jet identification in Lorentz-boosted topologies in proton-proton collisions at $\\sqrt{s}$ = 13 TeV",
    "abstract": "Measurements in the highly Lorentz-boosted regime provoke increased interest in probing the Higgs boson properties and in searching for particles beyond the standard model at the LHC. In the CMS Collaboration, various boosted-object tagging algorithms, designed to identify hadronic jets originating from a massive particle decaying to $\\mathrm{b\\overline{b}}$ or $\\mathrm{c\\overline{c}}$, have been developed and deployed across a range of physics analyses. This paper highlights their performance on simulated events, and summarizes novel calibration techniques using proton-proton collision data collected at $\\sqrt{s}$ = 13 TeV during the 2016$-$2018 LHC data-taking period. Three dedicated methods are used for the calibration in multijet events, leveraging either machine learning techniques, the presence of muons within energetic boosted jets, or the reconstruction of hadronically decaying high-energy Z bosons. The calibration results, obtained through a combination of these approaches, are presented and discussed.",
    "authors": [
      "CMS Collaboration"
    ],
    "published": "2025-10-11T14:04:45Z",
    "updated": "2025-11-13T14:18:10Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/11/P11006"
  },
  {
    "arxiv_id": "2508.05853v2",
    "url": "https://arxiv.org/abs/2508.05853v2",
    "pdf_url": "https://arxiv.org/pdf/2508.05853v2.pdf",
    "title": "A flexible test facility for liquid xenon detector development",
    "abstract": "As liquid xenon time projection chambers scale to ever-larger sizes, so too do the engineering challenges they pose. We describe a large, flexible, multipurpose test facility capable of supporting the development of a number of key aspects of liquid xenon detector systems. Example applications of this facility include characterization of large-area light and charge sensor arrays, tests of xenon purification techniques and materials compatibility, and investigations into high-voltage phenomena. This facility uses an automated and remotely monitored cryo-cooling system based on immersion of the test chamber in a liquid bath rather than conductive coupling, leading to advantages in temperature and pressure stability, as well as increasing required response times in the case of cooling-power loss. Design advantages, operational procedures, and performance of the facility are described, as well as five examples of liquid xenon test chambers that use the facility.",
    "authors": [
      "Evan Angelico",
      "Jacopo Dalmasson",
      "Ralph DeVoe",
      "Giorgio Gratta",
      "Clarke A. Hardy",
      "Brian Lenardo",
      "Lin Si",
      "Marie Vidal",
      "Shuoxing Wu"
    ],
    "published": "2025-08-07T21:05:00Z",
    "updated": "2025-11-13T14:13:10Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/11/P11005"
  },
  {
    "arxiv_id": "2511.10311v1",
    "url": "https://arxiv.org/abs/2511.10311v1",
    "pdf_url": "https://arxiv.org/pdf/2511.10311v1.pdf",
    "title": "Time resolution of the ALICE Time-Of-Flight detector with the first Run 3 pp collisions at ${\\bf \\sqrt{\\textit{s}} = 13.6}$ TeV",
    "abstract": "Particle identification (PID) is a fundamental aspect of the ALICE detector system, central to its heavy-ion and proton-proton physics programs. Among the different PID strategies, ALICE uses the Time-Of-Flight (TOF) detector to identify particles at intermediate momenta ($0.5 < p_{\\rm T} < 4$ GeV/$c$). The ALICE TOF detector performed successfully during the first ten years of LHC operations. During the Long Shutdown 2, many ALICE sub-detectors, including TOF, were upgraded to fully leverage the targeted 50 kHz interaction rate of Pb-Pb collisions, which required the implementation of a continuous readout scheme. The TOF detector electronics were upgraded and refurbished, while processing algorithms for data quality control, reconstruction, calibration, and analysis were rewritten. This paper presents the upgraded TOF detector operation and calibration procedures and its performance in terms of timing resolution, a key factor for particle separation in ALICE analyses. Using 2022 pp collision data at $\\sqrt{s} = 13.6$ TeV from Run 3, the time resolution of the detector was estimated with two independent methods, both yielding consistent results, better than 80 ps. Despite the excellent performance already achieved, further improvements are expected after additional detector commissioning and refined calibration procedures, thus enhancing the ALICE PID capabilities for Run 3 and beyond.",
    "authors": [
      "ALICE Collaboration"
    ],
    "published": "2025-11-13T13:48:55Z",
    "updated": "2025-11-13T13:48:55Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.10275v1",
    "url": "https://arxiv.org/abs/2511.10275v1",
    "pdf_url": "https://arxiv.org/pdf/2511.10275v1.pdf",
    "title": "Electron Heat Flux and Whistler Instability in the Earth's Magnetosheath",
    "abstract": "Despite heat flux's role in regulating energy conversion in collisionless plasmas, its properties and evolution in the magnetosheath downstream of the Earth's bow shock are scarcely explored. We use MMS in situ measurements to quantify and characterize the electron heat flux in the magnetosheath. We find that the heat flux is shaped by the magnetosheath magnetic field as it drapes around the magnetosphere. While it is affected by solar wind upstream conditions and increases with magnetic field strength, it is not substantially changed by local magnetosheath processes. Also, the heat flux is limited by whistler instability thresholds.",
    "authors": [
      "Ida Svenningsson",
      "Emiliya Yordanova",
      "Yuri V. Khotyaintsev",
      "Mats André",
      "Giulia Cozzani",
      "Alexandros Chasapis",
      "Steven J. Schwartz"
    ],
    "published": "2025-11-13T13:01:41Z",
    "updated": "2025-11-13T13:01:41Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.EP",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2511.10174v1",
    "url": "https://arxiv.org/abs/2511.10174v1",
    "pdf_url": "https://arxiv.org/pdf/2511.10174v1.pdf",
    "title": "M3Scope a 3D multimode multiplane microscope for imaging nanoscale dynamics in soft matter",
    "abstract": "Fast, volumetric imaging that integrates multiple imaging modalities is essential for probing dynamic, heterogeneous soft and biological matter. Here, we present the M3Scope, a simple yet versatile multiplane microscope that extends widefield detection with a modular multimode cube to enable dual color fluorescence, polarization-resolved, and correlative brightfield fluorescence imaging while (i) preserving simultaneous 3D acquisition at high frame rates (100 fps) and (ii) requiring minimal realignment. We demonstrate its potential by investigating polymer dynamics across multiple spatial and temporal scales. In an acrylamide type polymerizing network, dual color tracking of 100 nm and 300 nm fluorescent probes revealed size dependent viscosities diverging from 15 mPa.s to 40 mPa.s after gelation. Polarization resolved rotational tracking of gold bipyramids yielded viscosities within 10 percent of theoretical values in 80 to 95 percent glycerol and remained accurate in the high-viscosity regime (bigger than 400 mPa.s) where translational motion is undetectable. Fluorescence brightfield imaging correlated structural changes during poly(isopropyl acrylamide) (pNIPAM) phase separation as well as variations in tracer diffusivity, linking morphology and dynamics in 3D. Taken together, these results show that the M3Scope delivers high speed volumetric imaging with flexible modality switching, providing a powerful platform for studying dynamic, heterogeneous systems across disciplines, from polymer physics to cell mechanobiology.",
    "authors": [
      "Steven Huysecom",
      "Francisco Bevilacqua",
      "Roger Bresoli Obach",
      "Sudipta Seth",
      "Luis M. Liz-Marzan",
      "Dagmar R. D hooge",
      "Johan Hofkens",
      "Susana Rocha",
      "Boris Louis"
    ],
    "published": "2025-11-13T10:38:42Z",
    "updated": "2025-11-13T10:38:42Z",
    "categories": [
      "physics.optics",
      "cond-mat.soft",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2511.10147v1",
    "url": "https://arxiv.org/abs/2511.10147v1",
    "pdf_url": "https://arxiv.org/pdf/2511.10147v1.pdf",
    "title": "Data-driven multi-species heat flux closures for two-stream-unstable plasmas with nonlinear sparse regression",
    "abstract": "The dual aims of accuracy and computational efficiency in computational plasma physics lend themselves well to the use of fluid models. The first of these goals, however, is only satisfied for such models insofar as the utilized closure can capture the neglected kinetic physics -- something which has proven challenging for multi-scale collisionless processes. In a recent article [E. R. Ingelsten et al. (2025) J. Plasma Phys. 91 E64], we used the data-driven method of sparse regression to discover a novel heat flux closure for electrostatic phenomena. Here, we generalize the six-term closure model found in that work from single- to multi-species modeling. Using data from OSIRIS particle-in-cell simulations over a range of initial conditions, we then demonstrate how the unknown coefficients in front of the three most important terms in the closure can be estimated from box-averaged fluid quantities. Both neural networks and a newly developed framework for nonlinear sparse regression are showcased. The resulting models predict the heat flux for each species with a typical accuracy of 80-90 % and regularly account for 85-95 % of the rate of change in the pressure. The models are also compared with results from multi-species linear collisionless theory.",
    "authors": [
      "Emil R. Ingelsten",
      "Madox C. McGrae-Menge",
      "E. Paulo Alves",
      "Istvan Pusztai"
    ],
    "published": "2025-11-13T10:03:00Z",
    "updated": "2025-11-13T10:03:00Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.10127v1",
    "url": "https://arxiv.org/abs/2511.10127v1",
    "pdf_url": "https://arxiv.org/pdf/2511.10127v1.pdf",
    "title": "Microscopy X-ray Imaging enriched with Small Angle X-ray Scattering for few nanometer resolution reveals shock waves and compression in intense short pulse laser irradiation of solids",
    "abstract": "Understanding how laser pulses compress solids into high-energy-density states requires diagnostics that simultaneously resolve macroscopic geometry and nanometer-scale structure. Here we present a combined X-ray imaging (XRM) and small-angle X-ray scattering (SAXS) approach that bridges this diagnostic gap. Using the Matter in Extreme Conditions end station at LCLS, we irradiated 25-micrometer copper wires with 45-fs, 0.9-J, 800-nm pulses at 3.5e19 W/cm2 while probing with 8.2-keV XFEL pulses. XRM visualizes the evolution of ablation, compression, and inward-propagating fronts with about 200-nm resolution, while SAXS quantifies their nanometer-scale sharpness through the time-resolved evolution of scattering streaks. The joint analysis reveals that an initially smooth compression steepens into a nanometer-sharp shock front after roughly 18 ps, consistent with an analytical steepening model and hydrodynamic simulations. The front reaches a velocity of about 25 km/s and a lateral width of several tens of micrometers, demonstrating for the first time the direct observation of shock formation and decay at solid density with few-nanometer precision. This integrated XRM-SAXS method establishes a quantitative, multiscale diagnostic of laser-driven shocks in dense plasmas relevant to inertial confinement fusion, warm dense matter, and planetary physics.",
    "authors": [
      "Thomas Kluge",
      "Arthur Hirsch-Passicos",
      "Jannis Schulz",
      "Mungo Frost",
      "Eric Galtier",
      "Maxence Gauthier",
      "Jörg Grenzer",
      "Christian Gutt",
      "Lingen Huang",
      "Uwe Hübner",
      "Megan Ikeya",
      "Hae Ja Lee",
      "Dimitri Khaghani",
      "Willow Moon Martin",
      "Brian Edward Marré",
      "Motoaki Nakatsutsumi",
      "Paweł Ordyna",
      "Franziska-Luise Paschke-Brühl",
      "Alexander Pelka",
      "Lisa Randolph",
      "Hans-Peter Schlenvoigt",
      "Christopher Schoenwaelder",
      "Michal Šmíd",
      "Long Yang",
      "Ulrich Schramm",
      "Thomas E. Cowan"
    ],
    "published": "2025-11-13T09:33:58Z",
    "updated": "2025-11-13T09:33:58Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.10096v1",
    "url": "https://arxiv.org/abs/2511.10096v1",
    "pdf_url": "https://arxiv.org/pdf/2511.10096v1.pdf",
    "title": "Tailored Three Dimensional Betatron Dynamics in UltraStable Hybrid Laser Plasma RF Accelerators",
    "abstract": "The detailed theoretical and numerical investigation of hybrid laser plasma RF accelerators, elucidating the mechanisms governing transverse beam dynamics, betatron polarization, and radiation reaction in ultra-relativistic electron bunches is presented. This framework combines analytical models of spatiotemporal plasma wakefield modulation, phase-dependent RF-driven oscillations, and quantum-corrected Landau Lifshitz radiation reaction with fully self-consistent 3D particle in cell simulations using EPOCH. The results demonstrate that RF amplitude, frequency, and phase enable precise control over transverse focusing strengths, betatron oscillation amplitudes, and polarization states. Resonant alignment between RF fields and natural betatron frequencies amplifies transverse excursions while damping parasitic oscillations through enhanced focusing gradients and radiation reaction, yielding reductions in emittance and mitigation of synchrotron-like energy losses. Stability maps and 3D force landscapes reveal strong phase sensitivity, where initial conditions and RF component ratios govern the temporal evolution of betatron amplitudes, and longitudinal field gradients modulate γ growth rates. These findings provide a comprehensive picture of nonlinear, resonant, and damping phenomena in hybrid laser plasma RF systems, highlighting the full spectrum of controllable transverse, longitudinal, and polarization dynamics in ultra relativistic electron beams.",
    "authors": [
      "A. A. Molavi Choobini",
      "M. Shahmansouri"
    ],
    "published": "2025-11-13T08:55:18Z",
    "updated": "2025-11-13T08:55:18Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2410.21611v2",
    "url": "https://arxiv.org/abs/2410.21611v2",
    "pdf_url": "https://arxiv.org/pdf/2410.21611v2.pdf",
    "title": "CaloChallenge 2022: A Community Challenge for Fast Calorimeter Simulation",
    "abstract": "We present the results of the \"Fast Calorimeter Simulation Challenge 2022\" - the CaloChallenge. We study state-of-the-art generative models on four calorimeter shower datasets of increasing dimensionality, ranging from a few hundred voxels to a few tens of thousand voxels. The 31 individual submissions span a wide range of current popular generative architectures, including Variational AutoEncoders (VAEs), Generative Adversarial Networks (GANs), Normalizing Flows, Diffusion models, and models based on Conditional Flow Matching. We compare all submissions in terms of quality of generated calorimeter showers, as well as shower generation time and model size. To assess the quality we use a broad range of different metrics including differences in 1-dimensional histograms of observables, KPD/FPD scores, AUCs of binary classifiers, and the log-posterior of a multiclass classifier. The results of the CaloChallenge provide the most complete and comprehensive survey of cutting-edge approaches to calorimeter fast simulation to date. In addition, our work provides a uniquely detailed perspective on the important problem of how to evaluate generative models. As such, the results presented here should be applicable for other domains that use generative AI and require fast and faithful generation of samples in a large phase space.",
    "authors": [
      "Claudius Krause",
      "Michele Faucci Giannelli",
      "Gregor Kasieczka",
      "Benjamin Nachman",
      "Dalila Salamani",
      "David Shih",
      "Anna Zaborowska",
      "Oz Amram",
      "Kerstin Borras",
      "Matthew R. Buckley",
      "Erik Buhmann",
      "Thorsten Buss",
      "Renato Paulo Da Costa Cardoso",
      "Anthony L. Caterini",
      "Nadezda Chernyavskaya",
      "Federico A. G. Corchia",
      "Jesse C. Cresswell",
      "Sascha Diefenbacher",
      "Etienne Dreyer",
      "Vijay Ekambaram",
      "Engin Eren",
      "Florian Ernst",
      "Luigi Favaro",
      "Matteo Franchini",
      "Frank Gaede",
      "Eilam Gross",
      "Shih-Chieh Hsu",
      "Kristina Jaruskova",
      "Benno Käch",
      "Jayant Kalagnanam",
      "Raghav Kansal",
      "Taewoo Kim",
      "Dmitrii Kobylianskii",
      "Anatolii Korol",
      "William Korcari",
      "Dirk Krücker",
      "Katja Krüger",
      "Marco Letizia",
      "Shu Li",
      "Qibin Liu",
      "Xiulong Liu",
      "Gabriel Loaiza-Ganem",
      "Thandikire Madula",
      "Peter McKeown",
      "Isabell-A. Melzer-Pellmann",
      "Vinicius Mikuni",
      "Nam Nguyen",
      "Ayodele Ore",
      "Sofia Palacios Schweitzer",
      "Ian Pang",
      "Kevin Pedro",
      "Tilman Plehn",
      "Witold Pokorski",
      "Huilin Qu",
      "Piyush Raikwar",
      "John A. Raine",
      "Humberto Reyes-Gonzalez",
      "Lorenzo Rinaldi",
      "Brendan Leigh Ross",
      "Moritz A. W. Scham",
      "Simon Schnake",
      "Chase Shimmin",
      "Eli Shlizerman",
      "Nathalie Soybelman",
      "Mudhakar Srivatsa",
      "Kalliopi Tsolaki",
      "Sofia Vallecorsa",
      "Kyongmin Yeo",
      "Rui Zhang"
    ],
    "published": "2024-10-28T23:28:07Z",
    "updated": "2025-11-13T08:43:36Z",
    "categories": [
      "physics.ins-det",
      "cs.LG",
      "hep-ex",
      "hep-ph"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1361-6633/ae1304"
  },
  {
    "arxiv_id": "2511.10041v1",
    "url": "https://arxiv.org/abs/2511.10041v1",
    "pdf_url": "https://arxiv.org/pdf/2511.10041v1.pdf",
    "title": "Temperature Dependence of the Time Resolution in a SiPM-Readout Plastic Scintillator for Cosmic-Ray Applications",
    "abstract": "Balloon- and space-borne cosmic-ray experiments employ plastic scintillators read out by silicon photomultipliers (SiPMs) to achieve picosecond-level time resolutions for triggering and particle identification. The performance of these systems can be affected by temperature variations encountered in flight. In this work, a time-of-flight (TOF) prototype consisting of a BC418 plastic scintillator bar coupled to Onsemi MICROFC-30050 SiPMs was constructed and tested under a controlled thermal environment between -20 and 20$^{\\circ}$C. Electrons from a $^{90}\\text{Sr}$ source were used as a beam, and a dedicated differential preamplifier and coincidence triggering were implemented to study the detector response. A minimum time resolution of 160ps was achieved at an overvoltage of 3V, remaining stable across the tested temperature range and uniform along the scintillator bar.",
    "authors": [
      "José Reyes Castillo",
      "Saúl Aguilar Salazar",
      "Diego Mauricio Gomez Coral"
    ],
    "published": "2025-11-13T07:36:27Z",
    "updated": "2025-11-13T07:36:27Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2504.02405v3",
    "url": "https://arxiv.org/abs/2504.02405v3",
    "pdf_url": "https://arxiv.org/pdf/2504.02405v3.pdf",
    "title": "Impact of helium ion irradiation on the thermal properties of superconducting nanowire single-photon detectors",
    "abstract": "SNSPDs are indispensable for applications ranging from quantum information processing to deep-space optical communications, owing to their high detection efficiency, low dark counts, and excellent timing resolution. However, further improving the intrinsic detection efficiency (IDE) remains crucial for optimizing SNSPD performance. Ion irradiation has recently emerged as a powerful post-fabrication method to enhance SNSPD characteristics. Here, we studied the effects of He-ion irradiation on the thermal properties of NbN SNSPDs. We systematically examine the evolution of thermal boundary conductance as a function of ion fluence (0-1.1E17 ions/cm2), observing a 57% decrease from 127 to 54 W/m^2K^4 with increasing fluence, followed by saturation at approximately 9E16 ions/cm2. At this fluence, the minimum hotspot relaxation time measurements indicate a 41% increase, rising from 17 to 24 ps,while the electron-phonon interaction time decreases, with the magnitude of change depending on temperature and sample batch.TEM reveals defect formation at the NbN/SiO2 interface (6-8 nm) and He-bubble formation within the SiO2 layer (30-260 nm), contributing to the extended thermal relaxation time. These irradiation-induced modifications play a key role in enhancing the IDE of the treated devices. We further demonstrate a post-irradiation SNSPD showing a saturated IDE plateau at 2000 nm from 2.7 K to 28 mK, enabled by thermal modifications and a weakly wavelength-dependent avalanche-assisted mechanism. Our findings highlight ion irradiation as a valuable tool for thermal tailoring in SNSPDs and advance the understanding of detection physics and defect engineering in superconducting optoelectronics.",
    "authors": [
      "Yi-Yu Hong",
      "Yu-Ze Wang",
      "Wei-Jun Zhang",
      "Jia-Hao Hu",
      "Jia-Min Xiong",
      "Dong-Wei Chu",
      "Xin Ou",
      "Wen-Tao Wu",
      "Xiao-Fu Zhang",
      "Hui-Qin Yu",
      "Pu-Sheng Yuan",
      "Hao Li",
      "Ling Wu",
      "Zhen Wang",
      "Li-Xing You"
    ],
    "published": "2025-04-03T08:54:30Z",
    "updated": "2025-11-13T06:23:48Z",
    "categories": [
      "physics.app-ph",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "physics.app-ph"
  },
  {
    "arxiv_id": "2511.09975v1",
    "url": "https://arxiv.org/abs/2511.09975v1",
    "pdf_url": "https://arxiv.org/pdf/2511.09975v1.pdf",
    "title": "Autonomous X-ray Fluorescence Mapping of Chemically Heterogeneous Systems via a Correlative Feature Detection Framework",
    "abstract": "We present X-AutoMap, a modular framework for autonomous X-ray fluorescence (XRF) mapping that enables chemically informed targeting of regions of interest through a correlative feature detection strategy. The system integrates classical computer vision and rule-based logic to identify features based on spatial relationships across multiple elemental maps, rather than relying solely on intensity or morphology. Tight integration with the Bluesky control infrastructure at the NSLS-II Hard X-ray Nanoprobe (HXN) beamline enables real-time, closed-loop scan orchestration. Applied to a chemically heterogeneous urban PM2.5 sample, X-AutoMap reduced high-resolution acquisition time from over 44 hours to approximately 10 hours by targeting compositionally significant features identified from coarse scans. High-resolution results revealed diverse particle types, including fully mixed, partially overlapping, and spatially distinct multi-element structures, demonstrating the ability of the framework to isolate chemically relevant features with minimal user intervention. The framework supports interactive and autonomous modes, operates within hardware constraints via grid-based scanning, and is robust across varying sample conditions. Future extensions will incorporate machine learning and probabilistic sampling to further improve detection sensitivity and scan efficiency. X-AutoMap is currently in active use at HXN and provides a flexible foundation for scalable, intelligent imaging workflows at synchrotron beamlines.",
    "authors": [
      "Carlos Deleon",
      "Dmitri Gavrilov",
      "Peggy ODay",
      "Ajith Pattammattel"
    ],
    "published": "2025-11-13T05:12:46Z",
    "updated": "2025-11-13T05:12:46Z",
    "categories": [
      "physics.ins-det",
      "cs.HC"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.09960v1",
    "url": "https://arxiv.org/abs/2511.09960v1",
    "pdf_url": "https://arxiv.org/pdf/2511.09960v1.pdf",
    "title": "High-throughput Parasitic-independent Probe Thermal Resistance Calibration for Robust Thermal Mapping with Scanning Thermal Micrsocopy",
    "abstract": "Nanostructured materials, critical for thermal management in semiconductor devices, exhibit a strong size dependence in thermal transport. Specifically, studying the variation of thermal resistance across grain boundaries is of critical importance in designing effective thermal interface materials for heterogeneous integration. Frequency-domain Thermoreflectance (FDTR)-based techniques can provide thermal resistance mapping at the micrometer length scale. Scanning Thermal Microscopy (SThM) has the potential for quantifying local thermal transport with orders of magnitude higher spatial resolution (<100 nm). However, challenges in accurately converting the raw signal to thermal conductivity and accounting for surface sensitivity limit its widespread adoption as a characterization standard for understanding nanoscale heat transport and defect-mediated modulation of thermal properties in nanostructured films. Here, we introduce a circuit-based probe thermal resistance (Rp) calibration technique that is independent of parasitic heat transport pathways; this calibration enables accurate measurement of the heat dissipated from the SThM probe and the resulting tip temperature change to extract the thermal resistance of the film (Rth). Following calibration, SThM achieved sub-100 nm spatial resolution in mapping thermal resistance across a 15 nm-thick Al film deposited by e-beam evaporation on a SiO2 substrate. Finally, the thermal resistance mapping is converted to thermal conductivity using a finite-element-modeling-based calibration approach, where the average of the pixel-level Rth values yields an effective thermal conductivity of 2.87 +/- 0.18 W m^-1 K^-1, in good agreement with published theoretical frameworks describing heat transport in ultrathin Al.",
    "authors": [
      "Ram Munde",
      "Heng-Ray Chuang",
      "Raisul Islam"
    ],
    "published": "2025-11-13T04:42:28Z",
    "updated": "2025-11-13T04:42:28Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.09950v1",
    "url": "https://arxiv.org/abs/2511.09950v1",
    "pdf_url": "https://arxiv.org/pdf/2511.09950v1.pdf",
    "title": "$π$-PIC: a framework for modular particle-in-cell developments and simulations",
    "abstract": "Recently proposed modifications of the standard particle-in-cell (PIC) method resolve long-standing limitations such as exact preservation of physically conserved quantities and unbiased ensemble down-sampling. Such advances pave the way for next-generation PIC codes capable of using lower resolution and fewer particles per cell, enabling interactive studies on personal computers and facilitating large-scale parameter scans on supercomputers. Here, we present a Python-controlled framework designed to stimulate the dissemination and adoption of novel PIC developments by providing unified interfaces for accommodation, cross-testing, and comparison of PIC solvers and extensions written in Python or low-level languages like C++ and Fortran. To demonstrate flexibility of proposed interfaces we present and test implementations of several PIC solvers, as well as of extensions that is capable of managing QED processes, moving-window, and tight focusing of laser pulses.",
    "authors": [
      "Frida Brogren",
      "Christoffer Olofsson",
      "Joel Magnusson",
      "Arkady Gonoskov"
    ],
    "published": "2025-11-13T04:29:26Z",
    "updated": "2025-11-13T04:29:26Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.22821v2",
    "url": "https://arxiv.org/abs/2507.22821v2",
    "pdf_url": "https://arxiv.org/pdf/2507.22821v2.pdf",
    "title": "Axisymmetric Gyrokinetic Simulation of ASDEX-Upgrade Scrape-off Layer Using a Conservative Implicit BGK Collision Operator",
    "abstract": "Collisions play an important role in turbulence and transport of fusion plasmas. For kinetic simulations, as the collisionality increases in the domain of interest, the size of the time step to resolve the collisional physics can become overly restrictive in an explicit time integration scheme, leading to high computational cost. With the aim of overcoming such restriction, we have implemented an implicit Bhatnagar-Gross-Krook (BGK) collision operator for use in the discontinuous Galerkin (DG) full-f gyrokinetic solver within the Gkeyll framework, which, when combined with Gkeyll's traditional explicit time integrator for collisionless advection, can significantly increase the time step in gyrokinetic simulations of highly collisional regimes. To ensure conservation of density, momentum, and energy, we utilize an iterative scheme to correct the discretized approximation to the equilibrium Maxwellian distribution to which the BGK collision operator relaxes. We have further generalized the BGK infrastructure, both the implicit scheme and the correction routine, to handle cross species collisions. This improved implicit and conservative BGK operator is benchmarked against the more accurate but more computationally expensive Lenard-Bernstein-Dougherty (LBD) operator which has been utilized in prior studies with Gkeyll. The implicit BGK operator enables 2D axisymmetric simulations of the ASDEX-Upgrade scrape-off layer to run 56 times faster to completion than the simulations with the LBD operator, because the BGK operator is more robust and converges at a lower resolution than is required by the LBD operator. Additionally, in this more collisional limit, we demonstrate that the results of our simulations utilizing the implicit BGK operator agreed well with simulations utilizing the more computationally expensive LBD operator.",
    "authors": [
      "D. Liu",
      "J. Juno",
      "G. W. Hammett",
      "A. Hakim",
      "A. Shukla",
      "M. Francisquez"
    ],
    "published": "2025-07-30T16:36:30Z",
    "updated": "2025-11-13T04:28:30Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.18893v2",
    "url": "https://arxiv.org/abs/2507.18893v2",
    "pdf_url": "https://arxiv.org/pdf/2507.18893v2.pdf",
    "title": "Development and performance evaluation of a water-based liquid scintillator tracking detector with wavelength-shifting fiber readout",
    "abstract": "We have developed a novel tracking detector utilizing a water-based liquid scintillator (WbLS) for the accurate characterization of neutrino interactions on a water target. In this detector, the WbLS is optically segmented into small cells by reflective separators, and the scintillation light is read out in three directions using wavelength-shifting fibers coupled to silicon photomultipliers. We developed and optimized WbLS samples for this application and measured their light yield using cosmic-ray muons. Subsequently, we constructed a prototype of the WbLS tracking detector and evaluated its performance with a positron beam. The beam test demonstrated good tracking performance, although the light yield was lower than required. The result prompted a review of the surfactant used in the WbLS and the material of the optical separators, leading to a significant improvement in light yield. In this paper, we report on a design of the WbLS tracking detector, the development of the WbLS, the results of the beam test, and subsequent improvements to the WbLS and optical separators.",
    "authors": [
      "Naoto Onda",
      "Yuka Asano",
      "Takashi Iida",
      "Tatsuya Kikawa",
      "Tsuyoshi Nakaya",
      "Atsushi Tokiyasu",
      "Daiki Wakabayashi"
    ],
    "published": "2025-07-25T02:25:47Z",
    "updated": "2025-11-13T02:22:21Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.09863v1",
    "url": "https://arxiv.org/abs/2511.09863v1",
    "pdf_url": "https://arxiv.org/pdf/2511.09863v1.pdf",
    "title": "Topmetal-L: A Low Noise Charge-Sensitive Pixel Sensor for POLAR2/LPD",
    "abstract": "POLAR-2 is a next-generation space astronomy platform led by China, with its core scientific objective focused on high-precision polarization measurements of gamma-ray bursts. As one of its key payloads, the Low-energy Polarization Detector (LPD) is designed to perform wide-field surveys to capture X-ray polarization information from gamma-ray bursts in the 2-10 keV energy range. This paper presents Topmetal-L, a dedicated charge-sensitive pixel sensor developed for the LPD prototype upgrade. Fabricated in a 130 nm CMOS process in 2024, the chip integrates a 356 $\\times$ 512 pixel array with a pixel pitch of 45 $μ$m. Each pixel incorporates a 26 $\\times$ 26 $μ$m^2 charge-collecting electrode window and is capable of simultaneously outputting both energy and position information of deposited charges. Topmetal-L has been systematically optimized for power consumption, noise performance, and readout efficiency. It exhibits an input dynamic range of 0-4 ke-, a typical charge-to-voltage conversion gain of 76.04 $μ$V/e-, an average equivalent noise charge of approximately 22.8 e-, a sensitive area exceeding 3.6 cm^2, and a total power consumption of 720 mW per chip. To meet the requirements of large-area, high-frame-rate readout for gas-based polarization detectors, a sentinel-scanning readout scheme is proposed, reducing the full-frame readout time to 730 $μ$s. A prototype Topmetal-L-based gas polarization detection system was evaluated across key energies: it exhibited a residual modulation of 0.26% $\\pm$ 0.45% at 5.90 keV, a modulation factor of 66.67% $\\pm$ 0.45% for a linearly polarized 8.0 keV source, and a counting rate saturated at 15 k counts/(cm^2$\\cdot$s) when tested at 5.4 keV.",
    "authors": [
      "Li-rong Xie",
      "Shi-Qiang Zhou",
      "Di-Fan Yi",
      "Huan-Bo Feng",
      "Zhu-Ke Feng",
      "Dong Wang",
      "Chao-song Gao",
      "En-Wei Liang",
      "Xiang-Ming Sun",
      "Hong-Bang Liu"
    ],
    "published": "2025-11-13T01:43:37Z",
    "updated": "2025-11-13T01:43:37Z",
    "categories": [
      "astro-ph.IM",
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2504.06995v2",
    "url": "https://arxiv.org/abs/2504.06995v2",
    "pdf_url": "https://arxiv.org/pdf/2504.06995v2.pdf",
    "title": "Broadband Optical Modulation and Control at Millikelvin Temperatures",
    "abstract": "A universal experimental challenge when studying radiation effects on cryogenic devices is to precisely and accurately characterize the position-dependent device response very near the energy detection threshold. We have developed a compact cryogenic optical beam steering system that can be used to generate O(μs) pulses of small numbers of photons over the energy range of 1.2 - 4.5eV at room temperature, and deliver those photons via fiber optic to any specified location on the surface of a detector operating at cryogenic temperatures. This new system will allow for robust calibration of any photon-sensitive detector, including supercondcting devices. The system can be used efficiently to explore the physics of target materials, quantify the position sensitivity of different sensor designs, measure phonon transport, and study the effects of quasiparticle poisoning on detector operation. We describe the design of this pulsed calibration method and present first results obtained with a second-generation system operated at room temperature and sub-Kelvin temperatures.",
    "authors": [
      "N. Tabassum",
      "T. Aralis",
      "J. Anczarski",
      "D. Baxter",
      "B. Cabrera",
      "R. Chapla",
      "N. Entin",
      "L. Hsu",
      "H. W. Magoon",
      "A. Nunez",
      "J. L. Ryan",
      "M. Salatino",
      "A. Simchony",
      "Z. J. Smith",
      "S. Stevens",
      "G. Pérez",
      "H. Stueber",
      "B. A. Young",
      "N. A. Kurinsky",
      "K. Stifter"
    ],
    "published": "2025-04-09T16:08:39Z",
    "updated": "2025-11-12T23:36:50Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "hep-ex",
      "nucl-ex",
      "physics.app-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.20628v3",
    "url": "https://arxiv.org/abs/2510.20628v3",
    "pdf_url": "https://arxiv.org/pdf/2510.20628v3.pdf",
    "title": "Magnetic Field-Line Curvature and Its Role in Particle Acceleration by Magnetically Dominated Turbulence",
    "abstract": "We employ first-principles, fully kinetic particle-in-cell simulations to investigate magnetic field-line curvature in magnetically dominated turbulent plasmas and its role in particle acceleration through curvature-drift motion along the motional electric field. By varying the fluctuation-to-mean magnetic-field ratio $δB_0/B_0$, we examine curvature $κ$ statistics and their connection to particle acceleration. The curvature probability densities display broad power-law wings, scaling linearly in $κ$ below the peak and developing hard high-$κ$ tails for $δB_0/B_0 \\gtrsim 1$. As the mean field strengthens, the high-$κ$ tails steepen, and large-curvature events are suppressed when $δB_0/B_0 \\ll 1$. The probability density functions of magnetic field-line contraction, ${\\bf v}_E \\cdot {\\bf κ}$, with ${\\bf v}_E$ the field-line velocity, develop power-law tails well described by a symmetric Pareto distribution, characteristic of stochastic energy exchanges, with the tails becoming harder as $δB_0/B_0$ increases. Our guiding-center analysis shows that curvature-drift acceleration accounts for a substantial fraction of the energization via the motional electric field, and that it strengthens with increasing $δB_0/B_0$. For well-magnetized particles, curvature-drift acceleration typically exceeds ${\\bf\\nabla}B$ drift, polarization drift, and betatron contributions. These results identify curvature-drift acceleration as a principal pathway through which magnetized turbulence transfers energy to nonthermal particles in astrophysical plasmas.",
    "authors": [
      "Samuel Sebastian",
      "Luca Comisso"
    ],
    "published": "2025-10-23T15:02:34Z",
    "updated": "2025-11-12T22:42:45Z",
    "categories": [
      "astro-ph.HE",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE",
    "doi": "10.3847/2041-8213/ae1696"
  },
  {
    "arxiv_id": "2511.09787v1",
    "url": "https://arxiv.org/abs/2511.09787v1",
    "pdf_url": "https://arxiv.org/pdf/2511.09787v1.pdf",
    "title": "Molecular Dynamics Simulation of Hydrodynamic Transport Coefficients in Plasmas",
    "abstract": "Molecular dynamics (MD) simulations are used to calculate transport coefficients in a two-component plasma interacting through a repulsive Coulomb potential. The thermal conductivity, electrical conductivity, electrothermal coefficient, thermoelectric coefficient, and shear viscosity are computed using the Green-Kubo formalism over a broad range of Coulomb coupling strength, $0.01 \\leq Γ\\leq 140$. Emphasis is placed on testing standard results of the Chapman-Enskog solution in the weakly coupled regime ($Γ\\ll 1$) using these first-principles simulations. As expected, the results show good agreement for $Γ\\lesssim 0.1$. However, this agreement is only possible if careful attention is paid to the definitions of linear constitutive relations in each of the theoretical models, a point that is often overlooked. For example, the standard Green-Kubo expression for thermal conductivity is a linear combination of thermal conductivity, electrothermal and thermoelectric coefficients computed in the Chapman-Enskog formalism. Meaningful results for electrical conductivity are obtained over the full range of coupling strengths explored, but it is shown that potential and virial components of the other transport coefficients diverge in the strongly coupled regime ($Γ\\gg 1$). In this regime, only the kinetic components of the transport coefficients are meaningful for a classical plasma.",
    "authors": [
      "Briggs Damman",
      "Jarett LeVan",
      "Scott Baalrud"
    ],
    "published": "2025-11-12T22:37:53Z",
    "updated": "2025-11-12T22:37:53Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.09786v1",
    "url": "https://arxiv.org/abs/2511.09786v1",
    "pdf_url": "https://arxiv.org/pdf/2511.09786v1.pdf",
    "title": "Plasma hydrodynamics from mean force kinetic theory",
    "abstract": "Mean force kinetic theory is used to evaluate the electrical conductivity, thermal conductivity, electrothermal coefficient, thermoelectric coefficient, and shear viscosity of a two-component (ion-electron) plasma. Results are compared with molecular dynamics simulations. These simulations are made possible by assuming a repulsive Coulomb force for all interactions. Good agreement is found for all coefficients up to a Coulomb coupling strength of $Γ\\approx 20$. This is over 100-times larger than the coupling strength at which traditional theories break down. It is concluded that mean force kinetic theory provides a means to extend hydrodynamics to dense plasmas.",
    "authors": [
      "Jarett LeVan",
      "Scott D. Baalrud"
    ],
    "published": "2025-11-12T22:37:09Z",
    "updated": "2025-11-12T22:37:09Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2505.08987v2",
    "url": "https://arxiv.org/abs/2505.08987v2",
    "pdf_url": "https://arxiv.org/pdf/2505.08987v2.pdf",
    "title": "A Formalism for the Transport and Matching of Coupled Beams in Accelerators",
    "abstract": "Understanding transverse coupling dynamics is crucial for beam physics, accelerator design, and operations. Currently, most accelerators are designed for uncoupled beams, and coupling is treated as an error or perturbation. Many transverse ($x$-$y$) coupling parametrizations exist: Edward-Teng, Mais-Ripken, Levedev-Bogacz, and others. Here, we present an explicit and complete formalism for transporting coupled beam optics functions based on Mais-Ripken and Lebedev-Bogacz parametrizations. The formalism allows for matching generally coupled beam optics functions but applies to uncoupled optics as well. A complete transformation method for coupled optics provides easy matching routines that can be added to known beam optics codes that lack this feature. For fully coupled lattices, we present methods for extracting eigenmode emittances and other beam parameters from observables that can be measured, which is essential to diagnose and characterize the beam in a real machine. We express the linear difference resonance in terms of coupled optics functions and relate it to the coupling strength parameter with explicit emittance exchange formalism realized from the generating functions discussed here.",
    "authors": [
      "Onur Gilanliogullari",
      "Brahim Mustapha",
      "Pavel Snopok"
    ],
    "published": "2025-05-13T21:57:59Z",
    "updated": "2025-11-12T20:51:55Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.09725v1",
    "url": "https://arxiv.org/abs/2511.09725v1",
    "pdf_url": "https://arxiv.org/pdf/2511.09725v1.pdf",
    "title": "The Data Fusion Labeler (dFL): Challenges and Solutions to Data Harmonization, Labeling, and Provenance in Fusion Energy",
    "abstract": "Fusion energy research increasingly depends on the ability to integrate heterogeneous, multimodal datasets from high-resolution diagnostics, control systems, and multiscale simulations. The sheer volume and complexity of these datasets demand the development of new tools capable of systematically harmonizing and extracting knowledge across diverse modalities. The Data Fusion Labeler (dFL) is introduced as a unified workflow instrument that performs uncertainty-aware data harmonization, schema-compliant data fusion, and provenance-rich manual and automated labeling at scale. By embedding alignment, normalization, and labeling within a reproducible, operator-order-aware framework, dFL reduces time-to-analysis by greater than 50X (e.g., enabling >200 shots/hour to be consistently labeled rather than a handful per day), enhances label (and subsequently training) quality, and enables cross-device comparability. Case studies from DIII-D demonstrate its application to automated ELM detection and confinement regime classification, illustrating its potential as a core component of data-driven discovery, model validation, and real-time control in future burning plasma devices.",
    "authors": [
      "Craig Michoski",
      "Matthew Waller",
      "Brian Sammuli",
      "Zeyu Li",
      "Tapan Ganatma Nakkina",
      "Raffi Nazikian",
      "Sterling Smith",
      "David Orozco",
      "Dongyang Kuang",
      "Martin Foltin",
      "Erik Olofsson",
      "Mike Fredrickson",
      "Jerry Louis-Jeune",
      "David R. Hatch",
      "Todd A. Oliver",
      "Mitchell Clark",
      "Steph-Yves Louis"
    ],
    "published": "2025-11-12T20:33:40Z",
    "updated": "2025-11-12T20:33:40Z",
    "categories": [
      "physics.plasm-ph",
      "cs.LG",
      "physics.data-an"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.09689v1",
    "url": "https://arxiv.org/abs/2511.09689v1",
    "pdf_url": "https://arxiv.org/pdf/2511.09689v1.pdf",
    "title": "An ASME-Compliant Helium-4 Evaporation Refrigerator for the SpinQuest Experiment",
    "abstract": "This paper presents the design, safety basis, and commissioning results of a 1 K liquid helium-4 (4He) evaporation refrigerator developed for the Fermilab SpinQuest Experiment (E1039). The system represents the first high power helium evaporation refrigerator operated in a fixed target scattering experiment at Fermilab and was engineered to comply with the Fermilab ES\\&H Manual (FESHM) requirements governing pressure vessels, piping, cryogenic systems, and vacuum vessels. The design is mapped to ASME B31.3 (Process Piping) and the ASME Boiler and Pressure Vessel Code (BPVC) for pressure boundary integrity and overpressure protection, with documented compliance to FESHM Chapters 5031 (Pressure Vessels), 5031.1 (Piping Systems), and 5033 (Vacuum Vessels). This work documents the methodology used to reach compliance and approval for the 4He evaporation refrigerator at Fermilab which the field lacks. Design considerations specific to the high radiation target-cave environment including remotely located instrumentation approximately 20 m from the cryostat are summarized, together with the relief-system sizing methodology used to accommodate transient heat loads from dynamic nuclear polarization microwaves and the high-intensity proton beam. Commissioning data from July 2024 confirms that the system satisfies all thermal performance and safety objectives.",
    "authors": [
      "Jordan D. Roberts",
      "Vibodha Bandara",
      "Kenichi Nakano",
      "Dustin Keller"
    ],
    "published": "2025-11-12T19:45:47Z",
    "updated": "2025-11-12T19:45:47Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.09543v1",
    "url": "https://arxiv.org/abs/2511.09543v1",
    "pdf_url": "https://arxiv.org/pdf/2511.09543v1.pdf",
    "title": "Conservation of magnetic-helicity fluctuations due to spatial decorrelation of fluxes in decaying MHD turbulence",
    "abstract": "Hosking & Schekochihin (2021, Phys. Rev. X 11, 041005) have proposed that statistically isotropic decaying MHD turbulence without net magnetic helicity conserves the mean square fluctuation level of magnetic helicity in large volumes -- or, equivalently, the integral over space of the two-point correlation function of the magnetic-helicity density, denoted $I_H$. Formally, the conservation and gauge invariance of $I_H$ require the vanishing of certain boundary terms related to the strength of long-range spatial correlations. These boundary terms represent the ability (or otherwise) of the turbulence to organise fluxes over arbitrarily large distances to deplete or enhance fluctuations of magnetic helicity. In this work, we present a theory of these boundary terms, employing a methodology analogous to that of Batchelor & Proudman (1956, Philos. Trans. R. Soc. A 248, 369) to determine the relevant asymptotic forms of correlation functions. We find that long-range correlations of sufficient strength to violate the conservation of $I_H$ cannot develop dynamically if the evolution equation for the magnetic vector potential is chosen to be local in space. Likewise, we find that such correlations cannot develop for a wide class of gauge choices that make this equation non-local (including the Coulomb gauge). Nonetheless, we also identify a class of non-local gauge choices for which correlations that are sufficiently strong to violate the conservation of $I_H$ do appear possible. We verify our theoretical predictions for the case of the Coulomb gauge with measurements of correlation functions in a high-resolution numerical simulation.",
    "authors": [
      "Justin Kin Jun Hew",
      "David N. Hosking",
      "Christoph Federrath",
      "James R. Beattie",
      "Neco Kriel"
    ],
    "published": "2025-11-12T18:45:42Z",
    "updated": "2025-11-12T18:45:42Z",
    "categories": [
      "physics.flu-dyn",
      "astro-ph.CO",
      "astro-ph.HE",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.flu-dyn"
  },
  {
    "arxiv_id": "2511.09532v1",
    "url": "https://arxiv.org/abs/2511.09532v1",
    "pdf_url": "https://arxiv.org/pdf/2511.09532v1.pdf",
    "title": "Restoring momentum conservation to magnetized quasilinear diffusion",
    "abstract": "Wave interactions with magnetized particles underly many plasma heating and current drive technologies. Typically, these interactions are modeled by bounce-averaging the quasilinear Kennel-Engelmann diffusion tensor over the particle orbit. However, as an object derived in a two-dimensional space, the Kennel-Engelmann tensor does not fully respect the conservation of four-momentum required by the action conservation theorem, since it neglects the absorption of perpendicular momentum. This defect leads to incorrect predictions for the wave-induced cross-field particle transport. Here, we show how this defect can easily be fixed, by extending the tensor from two to four dimensions and matching the form required by four-momentum conservation. The resulting extended tensor, when bounce-averaged, recovers the form of the diffusion paths required by action-angle Hamiltonian theory. Importantly, the extended tensor should be easily implementable in Fokker-Planck codes through a mild modification of the existing Kennel-Engelmann tensor.",
    "authors": [
      "I. E. Ochs"
    ],
    "published": "2025-11-12T18:29:56Z",
    "updated": "2025-11-12T18:29:56Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.09498v1",
    "url": "https://arxiv.org/abs/2511.09498v1",
    "pdf_url": "https://arxiv.org/pdf/2511.09498v1.pdf",
    "title": "Photothermal resistivity alignment of optical fibers to SNSPD",
    "abstract": "We demonstrate a straightforward optoelectronic fiber alignment technique for superconducting nanowire single-photon detectors (SNSPDs) that exploits the temperature-dependent resistance of the nanowire under optical absorption. The target nanowire is illuminated via the fiber, and the local absorption of light heats the wire, causing a change in its resistivity. Scanning the fiber over the nanowire, the change in its resistivity is monitored by lock-in amplifier, mapping the spatial photothermal response correlated to absorption and coupling efficiency. The maximum of the response corresponds to optimal fiber-SNSPD alignment. This method allows for aligning the fiber to the center of the meander with sub-micron precision. The response is robust to variations in the angle and height of the fiber, providing an alternative or complement to fiber-to-chip alignment methods based on the back-reflection or transmission measurement.",
    "authors": [
      "Martin Baránek",
      "Dušan Lorenc",
      "Tomáš Ščepka",
      "Ján Šoltýs",
      "Iuliia Vetrova",
      "Štefan Haščík",
      "Miroslav Grajcar",
      "Pavol Neilinger"
    ],
    "published": "2025-11-12T17:17:50Z",
    "updated": "2025-11-12T17:17:50Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.supr-con",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.09462v1",
    "url": "https://arxiv.org/abs/2511.09462v1",
    "pdf_url": "https://arxiv.org/pdf/2511.09462v1.pdf",
    "title": "Depth-enhanced molecular imaging with two-photon oblique plane microscopy",
    "abstract": "High-numerical-aperture (NA) oblique plane microscopy enables noninvasive fluorescence imaging of subcellular dynamics without requiring radical sample modification. However, performance degrades at depth in multicellular specimens as scattering and refractive-index heterogeneity raise out-of-focus background. We report a two-photon oblique plane microscope that improves resolution at depth by combining high-NA single-objective detection with multiphoton plane illumination. The microscope achieves $\\sim\\!300$ nm lateral and $\\sim\\!650$ nm axial resolution, with single-molecule sensitivity in vivo. Compared with two-photon point scanning, the lower illumination NA delivers an order of magnitude lower peak intensity, enabling $>\\!5\\times$ faster volumetric acquisition (up to $3.25 \\times 10^6$ voxels s$^{-1}$) with reduced photodamage. In multicellular contexts, near-infrared nonlinear excitation enhances contrast throughout the illumination depth by $\\sim\\!2\\times$ and restores volumetric resolving power by $>\\!2\\times$ relative to linear excitation. We demonstrate these capabilities through molecular imaging of epithelial tissue, stem-cell-derived gastruloids, and living fruit fly embryos, including multicolor transcription-factor dynamics, optogenetic subcellular control, and single-mRNA tracking, all using standard glass-based mounting.",
    "authors": [
      "Kevin Keomanee-Dizon",
      "Yaakov Clenman",
      "Alejandra Duran",
      "Sergey Ryabichko",
      "Pauline Hansen",
      "Tohn Borjigin",
      "Richard Thornton",
      "Jared E. Toettcher",
      "Harold M. McNamara"
    ],
    "published": "2025-11-12T16:27:30Z",
    "updated": "2025-11-12T16:27:30Z",
    "categories": [
      "physics.optics",
      "physics.bio-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2511.09437v1",
    "url": "https://arxiv.org/abs/2511.09437v1",
    "pdf_url": "https://arxiv.org/pdf/2511.09437v1.pdf",
    "title": "Gyrokinetic Simulations of a Low Recycling Scrape-off Layer without a Lithium Target",
    "abstract": "Low-recycling regimes are appealing because they entail a high edge temperature and low edge density which are good for core confinement. However, due to considerably enhanced heat flux, the exhaust problems become severe. In addition, in the low-recycling regime, the conventional fluid simulations may not capture the physics of the Scrape-Off Layer (SOL) plasma that lies in the long mean free path regime; kinetic calculations become necessary. In this paper, by performing both Kinetic and fluid simulations, we explore the feasibility of a low-recycling regime in the magnetic geometry of the Spherical Tokamak for Energy Production (STEP); kinetic effects come out to be crucial determinants of the SOL dynamics. The simulation results indicate that a high SOL temperature and low SOL density could be achieved even when the divertor target is not made of a low recycling material. This can be done by using a low recycling material as a wall material. This is an important step towards demonstrating the feasibility of a low-recycling scenario. Lithium, a commonly used low recycling material, tends to evaporate at high heat fluxes which counteracts the desired high temperature, low density regime, and materials that can handle high heat fluxes are generally high recycling. Comparisons of gyrokinetic and fluid simulation results indicate that one can take advantage of kinetic effects to address some of the issues associated with a low-recycling SOL. Specifically, kinetic simulations show better confinement of impurities to the divertor region and greater broadening of the heat flux width due to drifts when compared with fluid simulations. Impurity confinement would help prevent core contamination from sputtering, and a broader heat flux width would help reduce the peak heat load at the target in the absence of detachment.",
    "authors": [
      "Akash Shukla",
      "Jonathan Roeltgen",
      "Michael Kotschenreuther",
      "David R. Hatch",
      "Manaure Francisquez",
      "James Juno",
      "Tess N. Bernard",
      "Ammar Hakim",
      "Gregory W. Hammett",
      "Swadesh M. Mahajan"
    ],
    "published": "2025-11-12T15:53:40Z",
    "updated": "2025-11-12T15:53:40Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2502.12880v2",
    "url": "https://arxiv.org/abs/2502.12880v2",
    "pdf_url": "https://arxiv.org/pdf/2502.12880v2.pdf",
    "title": "Plasma rotation driven by lasers with zero angular momentum",
    "abstract": "We present a novel mechanism in which plasma electrons and ions optically acquire angular momentum during local pump depletion of an azimuthally polarized laser, despite the laser carrying none. Using theoretical considerations and multi-dimensional particle-in-cell simulations, we find that this process is enabled by a strong frequency downshift at the gradually eroding laser pulse front. We further show that the angular momentum gained by the plasma electrons is compensated by the ions and by the combined electromagnetic fields of the laser and nonlinear plasma wave. By varying key laser parameters such as phase, frequency, and polarization, we demonstrate that the transverse momentum of high-energy electrons can be effectively controlled.",
    "authors": [
      "Camilla Willim",
      "Thales Silva",
      "Luís Oliveira Silva",
      "Jorge Vieira"
    ],
    "published": "2025-02-18T14:09:08Z",
    "updated": "2025-11-12T15:29:53Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.09110v1",
    "url": "https://arxiv.org/abs/2511.09110v1",
    "pdf_url": "https://arxiv.org/pdf/2511.09110v1.pdf",
    "title": "Towards low-cost lead screening with transmission XRF",
    "abstract": "Human exposure to lead (Pb) is a global health concern, yet existing technologies for detecting lead in our environment remain prohibitively expensive for widespread deployment. Here we present a new concept towards lead screening using X-ray fluorescence (XRF) in an unconventional geometry we coin transmission XRF in which the sample is placed between the source and detector. For cost reduction, we then show that $^{241}$Am found in ionizing smoke detectors is spectrally suitable for Pb L-shell XRF generation and can thus replace X-ray tubes used in conventional XRF devices. Exploring soil screening as the first application, we demonstrate with Monte Carlo simulations that a configuration with 7$\\times$ $^{241}$Am sources and a standard silicon drift detector can enable screening-relevant detection limits (100 ppm Pb) in soil within practical measurement times (<30 min). We believe this concept opens a route toward low-cost and scalable XRF instrumentation for democratizing lead screening across a wide range of samples.",
    "authors": [
      "Christoph Gaßner",
      "Juliane Reisewitz",
      "Jenna E. Forsyth",
      "Kian Shaker"
    ],
    "published": "2025-11-12T08:31:37Z",
    "updated": "2025-11-12T08:31:37Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.09083v1",
    "url": "https://arxiv.org/abs/2511.09083v1",
    "pdf_url": "https://arxiv.org/pdf/2511.09083v1.pdf",
    "title": "Hydrodynamic PIC analysis of THz generation by two color laser in various plasma gases",
    "abstract": "In the present study, a theoretical and PIC numerical investigation of THz emission driven by two color femtosecond laser fields in gaseous plasmas is conducted. The model is formulated in cylindrical coordinates to capture the inherent radial symmetry of laser plasma interactions. Starting from a hydrodynamic description of plasma electrons coupled with Maxwells equations, the nonlinear photocurrent dynamics that underpin the emission process is derived. The results reveal that the asymmetry induced by the superposition of the fundamental and second-harmonic fields plays a central role in breaking inversion symmetry, thereby generating a net directional current that radiates in the THz regime. Systematic analysis demonstrates that gas composition, ionization fraction, and the intensity ratio of the two fields strongly influence both the spectral characteristics and efficiency of THz radiation.",
    "authors": [
      "A. A. Molavi Choobini",
      "S. S. Ghaffari-Oskooei"
    ],
    "published": "2025-11-12T08:00:42Z",
    "updated": "2025-11-12T08:00:42Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.09079v1",
    "url": "https://arxiv.org/abs/2511.09079v1",
    "pdf_url": "https://arxiv.org/pdf/2511.09079v1.pdf",
    "title": "3D PIC simulation and theoretical modeling of RF Laser pulse in magnetized plasma for the generation of multidimensional relativistic Wakefields",
    "abstract": "The present study, investigates the modulation of plasma wakefields in dense magnetized plasma driven by relativistic electron beams under transverse RF excitation. A self consistent theoretical framework, comprising the RF vector potential, Maxwells equations, and relativistic electron motion, is extended through full 3D electromagnetic particle in cell simulations. The results reveal systematic amplification and reshaping of wakefields under the combined action of external magnetic fields and RF drivers. Variations in the cyclotron to plasma frequency ratio dictate the radial positioning and gyromotion of plasma electrons, sharpening transverse confinement and stabilizing blowout structures. The RF amplitude introduces progressive modulation of radial excursions and transverse forces, enhancing wakefield symmetry and depth. Current density distributions confirm the nonlinear scaling with RF strength, evolving from weak perturbations into sharply structured ion channels. Scalar potentials and longitudinal fields exhibit pronounced sensitivity to pulse shape, polarization angle, frequency ratio, and driver density, each parameter producing distinct oscillatory features and confinement regimes. Plasma density sets the field strength and radial localization, while the modulation parameter governs the emergence of fine scale oscillatory bands, producing smooth to multiband transitions in longitudinal electric fields. Across all conditions, simulations confirm the reinforcement of ponderomotive force, resulting in controlled narrowing of electron sheaths, sharper scalar potential gradients, and extended acceleration zones.",
    "authors": [
      "A. A. Molavi Choobini",
      "M. Shahmansouri"
    ],
    "published": "2025-11-12T07:56:11Z",
    "updated": "2025-11-12T07:56:11Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.09075v1",
    "url": "https://arxiv.org/abs/2511.09075v1",
    "pdf_url": "https://arxiv.org/pdf/2511.09075v1.pdf",
    "title": "PIC analysis of spatiotemporal THz emission from radial and longitudinal wakefields via copropagating chirped lasers in magnetized rippled plasma",
    "abstract": "The excitation of radial and longitudinal wake-fields by two co-propagating chirped laser pulses in a rippled, magnetized plasma has been examined. This study aimed to clarify the spatiotemporal evolution of wake structures and assess their role in the generation of THz radiation. A Fourier-Bessel Particle-In-Cell (FBPIC) simulation framework, optimized for cylindrical geometries, has been employed to model the relativistic dynamics of plasma electrons under the combined influence of laser-induced ponderomotive forces and an external magnetic field. It has been shown that the beat frequency between the pulses modulates the ponderomotive force, driving nonlinear wake-field structures sustained by electron oscillations. Simulations performed with high spatial resolution have revealed that wake-field amplitude and coherence are strongly influenced by laser chirp, pulse duration, and plasma density. Distinct THz peaks have been identified in the Fourier-transformed spectra, with their amplitudes enhanced by resonant coupling between wake-field harmonics and the laser frequency modulation. Moreover, electron motion has been confined by the magnetic field, leading to improved energy gain and shaping of angular radiation patterns. These findings suggest that tailored laser and plasma configurations can be used to optimize energy transfer mechanisms, paving the way for more efficient wake-field usage and THz generation.",
    "authors": [
      "A. A. Molavi Choobini",
      "F. M. Aghamir"
    ],
    "published": "2025-11-12T07:49:24Z",
    "updated": "2025-11-12T07:49:24Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph",
      "physics.comp-ph",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.08990v1",
    "url": "https://arxiv.org/abs/2511.08990v1",
    "pdf_url": "https://arxiv.org/pdf/2511.08990v1.pdf",
    "title": "Design of a Six-band, 2.4-Octave (80--420 GHz) Hierarchically Summed Phased-Array Slot-Dipole Antenna Array for NEW-MUSIC",
    "abstract": "The Next-generation Extended Wavelength Multi-band Sub/millimeter Inductance Camera (NEW-MUSIC), located on the Leighton Chajnantor Telescope (LCT), will be the first six-band trans-millimeter wave polarimeter. This paper proposes a broadband, hierarchical phased-array antenna with integrated band-defining filters necessary to realize NEW-MUSIC. It covers a spectral bandwidth of 2.4 octaves from 80~GHz to 420~GHz, a frequency range ideal for studying trans-millimeter emission from a range of time-domain sources, using the Sunyaev-Zeldovich effects to study hot plasmas in galaxy clusters and galaxies, and to observe dusty sources, from star-forming regions in our galaxy to high-redshift dusty, star-forming galaxies. To achieve these goals, three groups of superconducting lumped-element on-chip low-pass/band-pass filter-banks were designed to hierarchically sum the superconducting, broadband, non-resonant, slot-dipole antenna arrays and band-pass filter the trans-mm light before outputting it on microstripline to detectors (KIDs in the case of NEW-MUSIC).",
    "authors": [
      "Xiaolan Huang",
      "Shibo Shu",
      "Miao Li",
      "Sunil R. Golwala",
      "Feng Liu"
    ],
    "published": "2025-11-12T05:15:29Z",
    "updated": "2025-11-12T05:15:29Z",
    "categories": [
      "astro-ph.IM",
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2511.08959v1",
    "url": "https://arxiv.org/abs/2511.08959v1",
    "pdf_url": "https://arxiv.org/pdf/2511.08959v1.pdf",
    "title": "Improved Modeling of Quasi-Static Thermal and Optical Response of Lumped-Element Aluminum Manganese KIDs",
    "abstract": "We report on the optical characterization of the AlMn kinetic inductance detectors (KIDs) in development for use in the Next-generation Extended Wavelength-MUltiband Sub/millimeter Inductance Camera (NEW-MUSIC) on the Leighton Chajnantor Telescope (LCT). NEW-MUSIC will cover 80-420 GHz, split into six spectral bands, with polarimetry. This broad spectral coverage will enable study of a range of scientific topics such as the accretion and feedback in galaxies and galaxy cluster evolution via the Sunyaev-Zeldovich effect, the transient synchrotron emission from the explosive deaths of massive stars and other time-domain phenomena, and dusty sources from low to high redshift (with polarization). Al KIDs have already been demonstrated for bands 2-5. AlMn KIDs will be used for the 90~GHz band, as Al's pair-breaking energy is too high. However, AlMn has only barely been explored as a KID material. To this end, we first improved the modeling techniques used for Al KIDs within BCS theory by eliminating the use of analytical approximations for the expressions of the complex conductivity and found these changes reduced fit parameter degeneracy in the analysis of AlMn. Then, we tested the addition of a gap smearing parameter, a standard extension to BCS theory in use for high kinetic inductance materials, and found it did not improve the fits.",
    "authors": [
      "Adriana Gavidia",
      "Sunil Golwala",
      "Andrew D. Beyer",
      "Daniel Cunnane",
      "Peter K. Day",
      "Fabien Defrance",
      "Clifford F. Frez",
      "Xiaolan Huang",
      "Junhan Kim",
      "Jean-Marc Martin",
      "Jack Sayers",
      "Shibo Shu",
      "Shiling Yu",
      "Yann Sadou"
    ],
    "published": "2025-11-12T04:03:59Z",
    "updated": "2025-11-12T04:03:59Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2511.08954v1",
    "url": "https://arxiv.org/abs/2511.08954v1",
    "pdf_url": "https://arxiv.org/pdf/2511.08954v1.pdf",
    "title": "Progress on the ALETHEIA project and new approaches to events overlap mitigation",
    "abstract": "The ALETHEIA project aims to search for low-mass dark matter using liquid helium (LHe)-filled time projection chambers (TPCs). While liquid argon and liquid xenon TPCs have been extensively employed in the field of direct dark matter detection, successful development of LHe TPCs has not yet been achieved. Launched in 2020, our project has made significant progress since then. These advancements have convinced us that a single-phase LHe TPC is technologically feasible. Compared to liquid xenon and liquid argon TPCs, one of the unique challenges for LHe TPCs is event overlap caused by the 13-second lifetime scintillation. We will demonstrate that this overlap can be entirely mitigated when the LHe temperature is maintained near 1.0 K. At this temperature, electron mobility is three orders of magnitude higher than at approximately 4.0 K, which is the temperature we initially proposed for the LHe TPC.",
    "authors": [
      "Junhui Liao"
    ],
    "published": "2025-11-12T03:59:38Z",
    "updated": "2025-11-12T03:59:38Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.08929v1",
    "url": "https://arxiv.org/abs/2511.08929v1",
    "pdf_url": "https://arxiv.org/pdf/2511.08929v1.pdf",
    "title": "A Fully Spin and Polarization Resolved Strong Field QED Algorithm for Particle-in-Cell Codes",
    "abstract": "Modern ultra-intense laser facilities can generate electromagnetic fields strong enough to accelerate particles to near-light speeds over micron-scale distances and also approach the QED critical field, resulting in highly nonlinear and relativistic quantum phenomena. For such conditions, ab-initio modeling techniques are required that capture the electromagnetic, relativistic particle, and quantum emission processes in the plasma. One such technique is particle-in-cell (PIC) simulation. In this paper, we describe the underlying theory for and development, validation, and verification of an extension to standard QED-PIC in the OSIRIS framework to include spin- and polarization-resolved QED processes central to next-generation laser-plasma experiments. This code can advance the current understanding of spin- and polarization-dependent QED phenomena in ultra-intense laser-plasma interactions.",
    "authors": [
      "Q. Qian",
      "D. Seipt",
      "M. Vranic",
      "T. Grismayer",
      "C. P. Ridgers",
      "A. G. R. Thomas"
    ],
    "published": "2025-11-12T03:10:56Z",
    "updated": "2025-11-12T03:10:56Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.08881v1",
    "url": "https://arxiv.org/abs/2511.08881v1",
    "pdf_url": "https://arxiv.org/pdf/2511.08881v1.pdf",
    "title": "Commissioning the Resonance ionization Spectroscopy Experiment at FRIB",
    "abstract": "This manuscript reports on the commissioning of the Resonance ionization Spectroscopy Experiment (RISE) at the BECOLA facility at FRIB. The new instrument implements the collinear resonance ionization spectroscopy technique for sensitive measurements of isotope shifts and hyperfine structure of short-lived isotopes produced at FRIB. The existing BECOLA beamline was extended to integrate an electrostatic ion-beam bender and an ion detector at ultra-high vacuum. An injection-seeded Ti:Sapphire laser, as well as a multi-harmonic pulsed Nd:YAG laser were installed to perform resonant excitation and selective ionization. Commissioning tests were performed to demonstrate the capabilities of the new instrument by measuring the hyperfine structure of stable $^{27}$Al produced in an offline ion source. The RISE instrument is ready and operational for future studies of short-lived isotopes at FRIB.",
    "authors": [
      "A. J. Brinson",
      "B. J. Rickey",
      "J. M. Allmond",
      "A. Dockery",
      "A. Fernandez Chiu",
      "R. F. Garcia Ruiz",
      "T. J. Gray",
      "J. Karthein",
      "T. T. King",
      "K. Minamisono",
      "A. Ortiz-Cortes",
      "S. V. Pineda",
      "M. Reponen",
      "B. C. Rasco",
      "S. M. Udrescu",
      "A. R. Vernon",
      "S. G. Wilkins"
    ],
    "published": "2025-11-12T01:35:09Z",
    "updated": "2025-11-12T01:35:09Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.08849v1",
    "url": "https://arxiv.org/abs/2511.08849v1",
    "pdf_url": "https://arxiv.org/pdf/2511.08849v1.pdf",
    "title": "Molecular Dynamics Simulations of Temperature Relaxation in Non-Neutral Plasmas Relevant to Antimatter Experiments",
    "abstract": "An important process for antimatter experiments is the cooling of particles in a Penning-Malmberg trap to experimentally useful temperatures. A non-neutral plasma of one species (e.g. antiprotons) can be collisionally cooled on another colder species (e.g. electrons). Modeling temperature relaxation in these devices is challenging from a plasma physics perspective because the particles are strongly magnetized (the gyrofrequency exceeds the plasma frequency). Recently, a theoretical model was proposed to describe the temperature evolution in these conditions, predicting a multistep relaxation process where temperatures parallel to the magnetic field relax much faster than perpendicular to it. Here, this model is tested using molecular dynamics simulations. Two analysis methods are applied: one based on an imposed temperature difference, and the other based on a Green-Kubo relation. The results of the simulations support the theoretical predictions. This work extends previous studies of temperature anisotropy relaxation in one-component non-neutral plasmas to the two-component systems relevant to trapped antimatter experiments.",
    "authors": [
      "James C. Welch",
      "Louis Jose",
      "Timothy D. Tharp",
      "Scott D. Baalrud"
    ],
    "published": "2025-11-12T00:05:23Z",
    "updated": "2025-11-12T00:05:23Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.08835v2",
    "url": "https://arxiv.org/abs/2510.08835v2",
    "pdf_url": "https://arxiv.org/pdf/2510.08835v2.pdf",
    "title": "Burnup Measurement using Bent Crystal Diffraction Spectrometers for Pebble Bed Reactors",
    "abstract": "Burnup measurement is essential for monitoring and controlling pebble bed reactors (PBRs), where fuel pebbles circulate rapidly through the core. However, conventional gamma spectroscopy using high purity germanium (HPGe) detectors is difficult due to high activity levels in discharge pebbles, leading to excessive dead time and Compton scattering. This study explores the use of bent crystal diffraction (BCD) spectrometers to filter the emitted gamma spectrum and isolate key peaks for improved measurement accuracy and speed. Pebble wise depletion calculations were performed and the resulting spectra were analyzed using ray tracing (SHADOW3) and gamma response modeling (GADRAS). Key isotopes, $^{137m}$Ba/$^{137}$Cs, $^{239}$Pu, $^{144}$Ce, $^{148m}$Pm, and $^{140}$La, were found to strongly correlate with burnup, residence time, core passes, plutonium production, and fluence. Machine learning regression models applied to simulated spectra achieved a coefficient of determination ($R^2$) as high as 0.995 for burnup prediction. Among various BCD configurations, mosaic silicon crystals in the (440) orientation combined with an HPGe detector provided optimal performance for $^{137m}$Ba, while (220) and (440) configurations paired with scintillators were effective for the remaining isotopes.",
    "authors": [
      "Ian Kolaja",
      "Lee Bernstein",
      "Ludovic Jantzen",
      "Eleanor Tubman",
      "Tatiana Siaraferas",
      "Massimiliano Fratoni"
    ],
    "published": "2025-10-09T21:48:20Z",
    "updated": "2025-11-11T23:51:44Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.08818v1",
    "url": "https://arxiv.org/abs/2511.08818v1",
    "pdf_url": "https://arxiv.org/pdf/2511.08818v1.pdf",
    "title": "Enabling Integrated AI Control on DIII-D: A Control System Design with State-of-the-art Experiments",
    "abstract": "We present the design and application of a general algorithm for Prediction And Control using MAchiNe learning (PACMAN) in DIII-D. Machine learing (ML)-based predictors and controllers have shown great promise in achieving regimes in which traditional controllers fail, such as tearing mode free scenarios, ELM-free scenarios and stable advanced tokamak conditions. The architecture presented here was deployed on DIII-D to facilitate the end-to-end implementation of advanced control experiments, from diagnostic processing to final actuation commands. This paper describes the detailed design of the algorithm and explains the motivation behind each design point. We also describe several successful ML control experiments in DIII-D using this algorithm, including a reinforcement learning controller targeting advanced non-inductive plasmas, a wide-pedestal quiescent H-mode ELM predictor, an Alfvén Eigenmode controller, a Model Predictive Control plasma profile controller and a state-machine Tearing Mode predictor-controller. There is also discussion on guiding principles for real-time machine learning controller design and implementation.",
    "authors": [
      "Andrew Rothstein",
      "Hiro Joseph Farre-Kaga",
      "Jalal Butt",
      "Ricardo Shousha",
      "Keith Erickson",
      "Takuma Wakatsuki",
      "Azarakhsh Jalalvand",
      "Peter Steiner",
      "Sangkyeun Kim",
      "Egemen Kolemen"
    ],
    "published": "2025-11-11T22:35:26Z",
    "updated": "2025-11-11T22:35:26Z",
    "categories": [
      "physics.plasm-ph",
      "eess.SY"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.04973v2",
    "url": "https://arxiv.org/abs/2506.04973v2",
    "pdf_url": "https://arxiv.org/pdf/2506.04973v2.pdf",
    "title": "Bayesian network 3D event reconstruction in the Cygno optical TPC for dark matter direct detection",
    "abstract": "The CYGNO experiment is developing a high-resolution gaseous Time Projection Chamber with optical readout for directional dark matter searches. The detector uses a helium-tetrafluoromethane (He:CF$_4$ 60:40) gas mixture at atmospheric pressure and a triple Gas Electron Multiplier amplification stage, coupled with a scientific camera for high-resolution 2D imaging and fast photomultipliers for time-resolved scintillation light detection. This setup enables 3D event reconstruction: photomultipliers signals provide depth information, while the camera delivers high-precision transverse resolution. In this work, we present a Bayesian Network-based algorithm designed to reconstruct the events using only the photomultipliers signals, yielding a full 3D description of the particle trajectories. The algorithm models the light collection process probabilistically and estimates spatial and intensity parameters on the Gas Electron Multiplier plane, where light emission occurs. It is implemented within the Bayesian Analysis Toolkit and uses Markov Chain Monte Carlo sampling for posterior inference. Validation using data from the CYGNO LIME prototype shows accurate reconstruction of localized and extended tracks. Results demonstrate that the Bayesian approach enables robust 3D description and, when combined with camera data, further improves the precision of track reconstruction. This methodology represents a significant step forward in directional dark matter detection, enhancing the identification of nuclear recoil tracks with high spatial resolution.",
    "authors": [
      "Fernando Domingues Amaro",
      "Rita Antonietti",
      "Elisabetta Baracchini",
      "Luigi Benussi",
      "Stefano Bianco",
      "Francesco Borra",
      "Cesidio Capoccia",
      "Michele Caponero",
      "Gianluca Cavoto",
      "Igor Abritta Costa",
      "Antonio Croce",
      "Emiliano Dané",
      "Melba D'Astolfo",
      "Giorgio Dho",
      "Flaminia Di Giambattista",
      "Emanuele Di Marco",
      "Giulia D'Imperio",
      "Matteo Folcarelli",
      "Joaquim Marques Ferreira dos Santos",
      "Davide Fiorina",
      "Francesco Iacoangeli",
      "Zahoor Ul Islam",
      "Herman Pessoa Lima Júnior",
      "Ernesto Kemp",
      "Giovanni Maccarrone",
      "Rui Daniel Passos Mano",
      "David José Gaspar Marques",
      "Luan Gomes Mattosinhos de Carvalhoand Giovanni Mazzitelli",
      "Alasdair Gregor McLean",
      "Pietro Meloni",
      "Andrea Messina",
      "Cristina Maria Bernardes Monteiro",
      "Rafael Antunes Nobrega",
      "Igor Fonseca Pains",
      "Emiliano Paoletti",
      "Luciano Passamonti",
      "Fabrizio Petrucci",
      "Stefano Piacentini",
      "Davide Piccolo",
      "Daniele Pierluigi",
      "Davide Pinci",
      "Atul Prajapati",
      "Francesco Renga",
      "Rita Joana Cruz Roque",
      "Filippo Rosatelli",
      "Alessandro Russo",
      "Giovanna Saviano",
      "Pedro Alberto Oliveira Costa Silva",
      "Neil John Curwen Spooner",
      "Roberto Tesauro",
      "Sandro Tomassini",
      "Samuele Torelli",
      "Donatella Tozzi"
    ],
    "published": "2025-06-05T12:44:52Z",
    "updated": "2025-11-11T19:43:13Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "hep-ex",
      "physics.data-an"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1140/epjc/s10052-025-14965-6"
  },
  {
    "arxiv_id": "2511.08714v1",
    "url": "https://arxiv.org/abs/2511.08714v1",
    "pdf_url": "https://arxiv.org/pdf/2511.08714v1.pdf",
    "title": "Collisional stopping power of ions in warm dense matter",
    "abstract": "A model for the collisional stopping of ions on free electrons in warm dense matter is developed and explored. It is based on plasma kinetic theory, but with modifications to address the warm dense matter regime. Specifically, it uses the Boltzmann-Uehling-Uhlenbeck kinetic equation to incorporate effects of Fermi degeneracy of electrons. The cross section is computed from quantum scattering of electrons and ions occuring via the potential of mean force derived from an average atom model, which incorporates effects of strong Coulomb correlations. Predictions from this model show comparable accuracy to results from time-dependent density functional theory calculations for deuterium near solid density and a temperature of several electronvolts, at a fraction of the computational cost. Further, the model captures the transition of a plasma from the classical limit to the degenerate limit, including qualitative behaviors of solid state theory.",
    "authors": [
      "Lucas Babati",
      "Shane Rightley",
      "Nathaniel Shaffer",
      "Scott Baalrud"
    ],
    "published": "2025-11-11T19:22:16Z",
    "updated": "2025-11-11T19:22:16Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  }
]