{
  "arxiv_id": "2508.18219v1",
  "url": "https://arxiv.org/abs/2508.18219v1",
  "pdf_url": "https://arxiv.org/pdf/2508.18219v1.pdf",
  "title": "Three-dimensional hyperspectral imaging with optical microcombs",
  "abstract": "Optical frequency combs have revolutionised time and frequency metrology [1, 2]. The advent of microresonator-based frequency combs ('microcombs' [3-5]) is set to lead to the miniaturisation of devices that are ideally suited to a wide range of applications, including microwave generation [6, 7], ranging [8-10], the precise calibration of astronomical spectrographs [11], neuromorphic computing [12, 13], high-bandwidth data communications[14], and quantum-optics [15, 16] platforms. Here, we introduce a new microcomb application for three-dimensional imaging. Our method can simultaneously determine the chemical identity and full three-dimensional geometry, including size, shape, depth, and spatial coordinates, of particulate matter ranging from micrometres to millimetres in size across nearly $10^5$ distinct image pixels. We demonstrate our technique using millimetre-sized plastic specimens (i.e. microplastics measuring less than 5 mm). We combine amplitude and phase analysis and achieve a throughput exceeding $1.2~10^6$ pixels per second with micrometre-scale precision. Our method leverages the defining feature of microcombs - their large line spacing - to enable precise spectral diagnostics using microcombs with a repetition frequency of 1 THz. Our results suggest scalable operation over several million pixels and nanometre-scale axial resolution. Coupled with its high-speed, label-free and multiplexed capabilities, our approach provides a promising basis for environmental sensing, particularly for the real-time detection and characterisation of microplastic pollutants in aquatic ecosystems [17].",
  "authors": [
    "Stephan Amann",
    "Edoardo Vicentini",
    "Bingxin Xu",
    "Weiqiang Xie",
    "Yang He",
    "Qiang Lin",
    "John Bowers",
    "Theodor W. Hänsch",
    "Kerry Vahala",
    "Nathalie Picqué"
  ],
  "published": "2025-08-25T17:19:04Z",
  "updated": "2025-08-25T17:19:04Z",
  "categories": [
    "physics.optics",
    "physics.app-ph",
    "physics.chem-ph",
    "physics.ins-det"
  ],
  "primary_category": "physics.optics"
}