{
  "arxiv_id": "2508.18015v1",
  "url": "https://arxiv.org/abs/2508.18015v1",
  "pdf_url": "https://arxiv.org/pdf/2508.18015v1.pdf",
  "title": "First stave results towards mitigating sensor fracturing with   interposers in the ATLAS ITk strips barrel",
  "abstract": "At the conclusion of Run 3 of the Large Hadron Collider (LHC) at CERN, the accelerator complex will be upgraded to the High-Luminosity LHC (HL-LHC), allowing it to increase the dataset sizes of LHC experiments by about a factor of 20. This significant increase in dataset size will improve the sensitivity and precision of all physics analyses from LHC experiments, but will come with a more challenging data-taking environment. In order to handle this, the ATLAS detector will undergo a substantial upgrade, including an upgrade of its inner tracker to an all-silicon tracker called the Inner Tracker (ITk), made of pixel and strip sub-detectors. During the pre-production phase of the ITk strips, it was discovered that thermally cycling modules loaded onto local support structures led to physical fractures in silicon sensors due to the induced thermal stress. This is understood to be the result of several factors, including the difference in coefficients of thermal expansion between the different module layers, and the close proximity of the module electrical components. Several mitigation strategies were tested to reduce the rate of module fracturing. This paper describes the assembly setup, testing setups, and electrical testing results of ITk strips barrel modules loaded onto local support structures. 69 of 70 modules with an in-built additional kapton layer were found to survive testing down to -70{\\deg}C.",
  "authors": [
    "G. D'Amen",
    "D. Dewhurst",
    "E. Dibley",
    "J. Dopke",
    "E. Duden",
    "G. Hawker",
    "B. Gallop",
    "N. Ghorbanian",
    "P. Jacobson",
    "M. Kurth",
    "A. Li",
    "D. Lynn",
    "A. Petersen",
    "P. Phillips",
    "D. Russell",
    "C. Sawyer",
    "C. Solaz",
    "W. Sorger",
    "S. Stucci",
    "A. Tishelman-Charny",
    "A. Tricoli",
    "G. van Nieuwenhuizen"
  ],
  "published": "2025-08-25T13:31:12Z",
  "updated": "2025-08-25T13:31:12Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}