{
  "arxiv_id": "2508.15513v1",
  "url": "https://arxiv.org/abs/2508.15513v1",
  "pdf_url": "https://arxiv.org/pdf/2508.15513v1.pdf",
  "title": "Modeling of Light Production in Inorganic Scintillators",
  "abstract": "In recent experiments, inorganic scintillators have been used to study the decays of exotic nuclei, providing an alternative to silicon detectors and enabling measurements that were previously impossible. However, proper use of these materials requires us to understand and quantify the scintillation process. In this work, we propose a framework based on that of Birks [Proc. Phys. Soc. A 64, 874] and Meyer and Murray [Phys. Rev. 128, 98] to model the light output of inorganic scintillators in response to beams of energetic heavy ions over a broad range of energies. Our model suggests that, for sufficiently heavy ions at high energies, the majority of the light output is associated with the creation of delta electrons, which are induced by the passage of the beam through the material. These delta electrons dramatically impact the response of detection systems when subject to ions with velocities typical of beams in modern fragmentation facilities. We test the accuracy of our model with data from Lutetium Yttrium Orthosilicate (LYSO:Ce), a common inorganic scintillator. We compare calculated light production and quenching factors with experimental data for heavy ions of varying mass and energy as well as make a quantitative estimate of the effects of delta rays on overall light output. The model presented herein will serve as a basic framework for further studies of scintillator response to heavy ions. Our results are crucial in planning future experiments where relativistic exotic nuclei are interacting with scintillator detectors.",
  "authors": [
    "B. Kreider",
    "I. Cox",
    "R. Grzywacz",
    "J. M. Allmond",
    "A. Augustyn",
    "N. Braukman",
    "P. Brionnet",
    "A. Esmaylzadeh",
    "J. Fischer",
    "N. Fukuda",
    "G. Garcia De Lorenzo",
    "S. Go",
    "S. Hanai",
    "D. Hoskins",
    "N. Imai",
    "T. T. King",
    "N. Kitamura",
    "K. Kolos",
    "A. Korgul",
    "C. Mazzocchi",
    "S. Nishimura",
    "K. Nishio",
    "V. Phong",
    "T. Ruland",
    "K. P. Rykaczewski",
    "A. Skruch",
    "Z. Y. Xu",
    "R. Yokoyama"
  ],
  "published": "2025-08-21T12:38:53Z",
  "updated": "2025-08-21T12:38:53Z",
  "categories": [
    "physics.ins-det",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det"
}