[
  {
    "arxiv_id": "2508.13858v2",
    "url": "https://arxiv.org/abs/2508.13858v2",
    "pdf_url": "https://arxiv.org/pdf/2508.13858v2.pdf",
    "title": "Numerical simulations of a RF-RF hybrid plasma torch with argon at   atmospheric pressure",
    "abstract": "We report numerical results regarding the minimum sustaining coil excitation current for a RF-RF hybrid torch operating at two different frequencies. The first coil is excited at a high-frequency, while the second coil is set at a medium frequency. The filling gas is argon, at atmospheric pressure. We use the modeling software COMSOL Multiphysics to describe the evolution of key parameters when: (i) the distance between the two coils changes, (ii) the power of the high frequency coil changes. We discuss the radial temperature profiles, the axial velocities and the heat convected at the end of the medium-frequency coil. The latter is compared with the total heat conduction to the plasma confinement tube wall.",
    "authors": [
      "Loann Terraz",
      "Biruk Alemu",
      "Santiago Eizaguirre"
    ],
    "published": "2025-08-19T14:17:59Z",
    "updated": "2025-08-26T08:02:11Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.13372v2",
    "url": "https://arxiv.org/abs/2508.13372v2",
    "pdf_url": "https://arxiv.org/pdf/2508.13372v2.pdf",
    "title": "Free electron charging of microdroplets in a plasma at atmospheric   pressure",
    "abstract": "Gas phase microdroplets have recently demonstrated exceptional chemical properties via suspected mechanisms such as contact electrification and surface charge pinning leading, in turn, to high electric fields at the surface. In this work, microdroplets are injected into a low temperature flowing gas plasma at atmospheric pressure and during flight they are subject to an excess free electron flux. We report the first measurements of particle charge acquired in a fully collisional plasma with average values up to $2.5 \\times 10^{5}$ electrons, dependent on absorbed power, for droplets with an average diameter of $15~\\mu\\mathrm{m}$. Simulations indicate that for similar plasma conditions, the acquired charge on solid particles would be $\\sim40\\%$ lower, at $1.5 \\times 10^{5}$ electrons, with the difference likely due in part to low mobility water cluster ion formation around the evaporating droplet. Simulations also indicate surface electric fields up to $1 \\times 10^{7}\\,\\mathrm{V\\,m^{-1}}$ for the smallest droplets ($3~\\mu\\mathrm{m}$). The formation of H$_2$O$_2$ was observed in the liquid with measured values up to 33 mM, equivalent to a remarkable generation rate of over $275~\\mathrm{M\\,s^{-1}}$. The microdroplet system involves a complex interplay of various potential mechanisms, yet to be elucidated. The inclusion of a controlled plasma environment offers the capability for creating known charge levels and defined exposure times to allow more systematic study as well as enhancing their already exceptional characteristics.",
    "authors": [
      "Nourhan Hendawy",
      "Harold McQuaid",
      "Somhairle Mag Uidhir",
      "David Rutherford",
      "Declan Diver",
      "Davide Mariotti",
      "Paul Maguire"
    ],
    "published": "2025-08-18T21:27:54Z",
    "updated": "2025-08-26T02:02:19Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.18219v1",
    "url": "https://arxiv.org/abs/2508.18219v1",
    "pdf_url": "https://arxiv.org/pdf/2508.18219v1.pdf",
    "title": "Three-dimensional hyperspectral imaging with optical microcombs",
    "abstract": "Optical frequency combs have revolutionised time and frequency metrology [1, 2]. The advent of microresonator-based frequency combs ('microcombs' [3-5]) is set to lead to the miniaturisation of devices that are ideally suited to a wide range of applications, including microwave generation [6, 7], ranging [8-10], the precise calibration of astronomical spectrographs [11], neuromorphic computing [12, 13], high-bandwidth data communications[14], and quantum-optics [15, 16] platforms. Here, we introduce a new microcomb application for three-dimensional imaging. Our method can simultaneously determine the chemical identity and full three-dimensional geometry, including size, shape, depth, and spatial coordinates, of particulate matter ranging from micrometres to millimetres in size across nearly $10^5$ distinct image pixels. We demonstrate our technique using millimetre-sized plastic specimens (i.e. microplastics measuring less than 5 mm). We combine amplitude and phase analysis and achieve a throughput exceeding $1.2~10^6$ pixels per second with micrometre-scale precision. Our method leverages the defining feature of microcombs - their large line spacing - to enable precise spectral diagnostics using microcombs with a repetition frequency of 1 THz. Our results suggest scalable operation over several million pixels and nanometre-scale axial resolution. Coupled with its high-speed, label-free and multiplexed capabilities, our approach provides a promising basis for environmental sensing, particularly for the real-time detection and characterisation of microplastic pollutants in aquatic ecosystems [17].",
    "authors": [
      "Stephan Amann",
      "Edoardo Vicentini",
      "Bingxin Xu",
      "Weiqiang Xie",
      "Yang He",
      "Qiang Lin",
      "John Bowers",
      "Theodor W. Hänsch",
      "Kerry Vahala",
      "Nathalie Picqué"
    ],
    "published": "2025-08-25T17:19:04Z",
    "updated": "2025-08-25T17:19:04Z",
    "categories": [
      "physics.optics",
      "physics.app-ph",
      "physics.chem-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2508.18145v1",
    "url": "https://arxiv.org/abs/2508.18145v1",
    "pdf_url": "https://arxiv.org/pdf/2508.18145v1.pdf",
    "title": "Spiral Tuning of Wire-metamaterial Cavity for Plasma Haloscope",
    "abstract": "Axions are hypothetical particles that provide a compelling solution to two major mysteries in modern physics: the strong CP problem and the nature of dark matter. The plasma haloscope has been proposed as a promising approach for probing the higher-mass regime for dark matter axions by employing a periodic arrangement of conducting wires. In this study, we present a novel tuning mechanism for such wire-based structures by bundling the wires into a spiral configuration. This design enables continuous frequency tuning of approximately 25% with a single central rotation while maintaining the form factor. To validate this concept, we fabricated a prototype cavity comprising six spiral arms and experimentally demonstrated its feasibility, achieving results in good agreement with numerical simulations.",
    "authors": [
      "Jacob Lindahl",
      "Rustam Balafendiev",
      "Gagandeep Kaur",
      "Gaganpreet Singh",
      "Andrea Gallo Rosso",
      "Jan Conrad",
      "Jon Gudmundsson",
      "Junu Jeong"
    ],
    "published": "2025-08-25T15:53:53Z",
    "updated": "2025-08-25T15:53:53Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2508.06560v2",
    "url": "https://arxiv.org/abs/2508.06560v2",
    "pdf_url": "https://arxiv.org/pdf/2508.06560v2.pdf",
    "title": "Experimental plasmonic sensing of malaria using an aluminum metasurface",
    "abstract": "A wide range of methods currently exist for testing the presence of malaria, each with its own advantages and disadvantages. New technologies are urgently needed to develop more effective diagnosis tools to fight and eradicate malaria. Optical biosensors that employ surface plasmon resonance (SPR) techniques are a promising category of devices for detecting malaria biomarkers. One such biomarker is plasmodium lactate dehydrogenase (pLDH), a protein produced during the life cycle of the malaria parasite, which is a metabolic enzyme found in all plasmodium species, including the most widespread falciparum. This work reports on the design, probing, and experimental performance of an optical biosensor for detecting pLDH based on SPR and extraordinary optical transmission. The biosensor is composed of an aluminum metasurface made from an array of nanoholes. The sensor operates in the visible spectral region and achieves label-free sensing of plasmodium falciparum LDH (pfLDH) spiked in phosphate-buffered saline. The sensor has a spectral sensitivity of 360 nm/RIU and an LOD of 1.3 nM, equivalent to 45.6 ng/mL of pfLDH. This type of optical biosensor may offer a cost-effective and high sensitivity method for active infection diagnosis.",
    "authors": [
      "A. S. Kiyumbi",
      "M. S. Tame"
    ],
    "published": "2025-08-06T15:30:35Z",
    "updated": "2025-08-25T15:30:11Z",
    "categories": [
      "physics.med-ph",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "physics.med-ph"
  },
  {
    "arxiv_id": "2502.08761v2",
    "url": "https://arxiv.org/abs/2502.08761v2",
    "pdf_url": "https://arxiv.org/pdf/2502.08761v2.pdf",
    "title": "A unified model of feed rotation in radio telescopes and GNSS antennas",
    "abstract": "We describe a model that accounts for the phase rotation that occurs when a receiver or transmitter changes orientation while observing or emitting circularly polarized electromagnetic waves. This model extends work detailing Global Navigation Satellite Systems (GNSS) carrier phase wind-up to allow us to describe the interaction of changing satellite orientation with phase rotation in observing radio telescopes. This development is motivated by, and a critical requirement of, unifying GNSS and Very Long Baseline Interferometry (VLBI) measurements at the observation level. The model can be used for either stationary choke ring antennas or steerable radio telescopes observing either natural radio sources or satellites. Simulations and experimental data are used to validate the model and to illustrate its importance. In addition, we rigorously lay out the feed rotation correction for radio telescopes with beam waveguide and full Nasmyth focuses and validate the correction by observing the effect with dual polarization observations. Using this feed rotation model for beam waveguide telescopes, we produce the first phase delay solution for the VLBI baseline WARK30M-WARK12M. We provide a practical guide to using the feed rotation model in Appendix D.",
    "authors": [
      "Joe Skeens",
      "Johnathan York",
      "Leonid Petrov",
      "Kyle Herrity",
      "Richard Ji-Cathriner",
      "Srinivas Bettadpur"
    ],
    "published": "2025-02-12T20:08:34Z",
    "updated": "2025-08-25T15:29:40Z",
    "categories": [
      "astro-ph.IM",
      "physics.geo-ph",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM",
    "doi": "10.1007/s00190-025-01993-z"
  },
  {
    "arxiv_id": "2412.15823v3",
    "url": "https://arxiv.org/abs/2412.15823v3",
    "pdf_url": "https://arxiv.org/pdf/2412.15823v3.pdf",
    "title": "3D non-linear MHD simulations of core density collapse event in LHD   plasma",
    "abstract": "A new three-dimensional, non-linear Magnetohydrodynamics (MHD) model has been extended in MIPS code, incorporating parallel heat diffusivity. The model has been benchmarked against the former MHD model used in MIPS code. A preliminary study of the core density collapse event (CDC) observed in the Large Helical Device (LHD) plasma has been performed using the developed model. The equilibrium has been constructed using HINT code for a typical super dense core discharge in LHD, with vacuum magnetic axis configuration RaxV = 3.85 m and magnetic axis beta \\beta0 = 4% plasma. This configuration corresponds to a plasma with a steep pressure gradient and strong Shafranov shift, which makes the plasma potentially unstable in the LHD. The model shows preliminary characteristics of the CDC event. The plasma is destabilized by high-n ballooning modes in the low-field side region during the linear regime, eventually leading to the collapse of the pressure and density profiles, together with the stochastization of the magnetic field and a shift to low-n modes centered at the core of the plasma after the non-linear coupling at the relaxation regime.",
    "authors": [
      "A. Civit-Bertran",
      "S. Futatani",
      "Y. Suzuki",
      "J. Dominguez-Palacios"
    ],
    "published": "2024-12-20T12:04:21Z",
    "updated": "2025-08-25T15:05:53Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.18015v1",
    "url": "https://arxiv.org/abs/2508.18015v1",
    "pdf_url": "https://arxiv.org/pdf/2508.18015v1.pdf",
    "title": "First stave results towards mitigating sensor fracturing with   interposers in the ATLAS ITk strips barrel",
    "abstract": "At the conclusion of Run 3 of the Large Hadron Collider (LHC) at CERN, the accelerator complex will be upgraded to the High-Luminosity LHC (HL-LHC), allowing it to increase the dataset sizes of LHC experiments by about a factor of 20. This significant increase in dataset size will improve the sensitivity and precision of all physics analyses from LHC experiments, but will come with a more challenging data-taking environment. In order to handle this, the ATLAS detector will undergo a substantial upgrade, including an upgrade of its inner tracker to an all-silicon tracker called the Inner Tracker (ITk), made of pixel and strip sub-detectors. During the pre-production phase of the ITk strips, it was discovered that thermally cycling modules loaded onto local support structures led to physical fractures in silicon sensors due to the induced thermal stress. This is understood to be the result of several factors, including the difference in coefficients of thermal expansion between the different module layers, and the close proximity of the module electrical components. Several mitigation strategies were tested to reduce the rate of module fracturing. This paper describes the assembly setup, testing setups, and electrical testing results of ITk strips barrel modules loaded onto local support structures. 69 of 70 modules with an in-built additional kapton layer were found to survive testing down to -70{\\deg}C.",
    "authors": [
      "G. D'Amen",
      "D. Dewhurst",
      "E. Dibley",
      "J. Dopke",
      "E. Duden",
      "G. Hawker",
      "B. Gallop",
      "N. Ghorbanian",
      "P. Jacobson",
      "M. Kurth",
      "A. Li",
      "D. Lynn",
      "A. Petersen",
      "P. Phillips",
      "D. Russell",
      "C. Sawyer",
      "C. Solaz",
      "W. Sorger",
      "S. Stucci",
      "A. Tishelman-Charny",
      "A. Tricoli",
      "G. van Nieuwenhuizen"
    ],
    "published": "2025-08-25T13:31:12Z",
    "updated": "2025-08-25T13:31:12Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2504.07311v4",
    "url": "https://arxiv.org/abs/2504.07311v4",
    "pdf_url": "https://arxiv.org/pdf/2504.07311v4.pdf",
    "title": "Scenarios for magnetic X-point collapse in 2D incompressible   dissipationless extended magnetohydrodynamics",
    "abstract": "The equations of 2D incompressible dissipationless extended magnetohydrodynamics (XMHD) extend the equations of incompressible Hall MHD (HMHD) by retaining finite-electron inertia. These XMHD equations couple the fluid velocity ${\\bf V} = \\wh{\\sf z}\\btimes\\nabla\\phi + V_{z}\\,\\wh{\\sf z}$ with the magnetic field ${\\bf B} = \\nabla\\psi\\btimes\\wh{\\sf z} + B_{z}\\,\\wh{\\sf z}$ in a process that is known to support dissipationless solutions that exhibit finite-time singularities associated with magnetic X-point collapse in the magnetic plane $(B_{x} = \\partial\\psi/\\partial y, B_{y} = -\\,\\partial\\psi/\\partial x)$. Here, by adopting a 2D self-similar model for the four XMHD fields $(\\phi,\\psi,V_{z},B_{z})$, we obtain five coupled ordinary differential equations that are solved in terms of the Jacobi elliptic functions based on an orbital classification associated with particle motion in a quartic potential. Excellent agreement is found when these analytical solutions are compared with numerical solutions, including the precise time of a magnetic X-point collapse.",
    "authors": [
      "Alain J. Brizard"
    ],
    "published": "2025-04-09T22:25:59Z",
    "updated": "2025-08-25T13:04:27Z",
    "categories": [
      "physics.plasm-ph",
      "math-ph",
      "math.MP"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.17963v1",
    "url": "https://arxiv.org/abs/2508.17963v1",
    "pdf_url": "https://arxiv.org/pdf/2508.17963v1.pdf",
    "title": "Enhanced Terahertz Generation via Oblique Incidence of Unipolar Laser   Pulses on Plasma",
    "abstract": "We investigate terahertz (THz) radiation generation at the vacuum-plasma interface driven by the oblique incidence of s-polarized Gaussian laser pulse(s) on a semi-infinite underdense plasma.~Extending beyond the conventional single-frequency bipolar pulse (B-pulse), this work focuses on leveraging two-color mixed-frequency pulse-- (M-pulse) excitation to enhance THz performance in terms of strength and broadening that can be tuned through controlled amplitude and phase of the constituent pulses of the M-pulse. A new expression for the ponderomotive force (PF) -- which acts as the main driver of THz radiation at the vacuum-plasma boundary -- is derived to capture the hitherto unexplored effects of phase asymmetry intrinsic to the M-pulse, in contrast to a single B-pulse where its phase is irrelevant. This PF formulation captures the underlying cycle-to-cycle symmetry-breaking for the M-pulse field, responsible for efficient THz emission. We demonstrate analytically that such M-pulses of the same total energy as a B-pulse may generate significantly enhanced PF, leading to THz yields several orders of magnitude higher. With a judicious choice of low-frequency to high-frequency ratio, the M-pulse configuration is shown to emerge as a highly efficient, phase-controllable driver of   THz radiation and offers a promising route for optimizing THz source design via tailored two-color laser-plasma interactions.",
    "authors": [
      "Anjana K P",
      "Rohit Kumar Srivastav",
      "Mrityunjay Kundu"
    ],
    "published": "2025-08-25T12:23:41Z",
    "updated": "2025-08-25T12:23:41Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.17195v2",
    "url": "https://arxiv.org/abs/2506.17195v2",
    "pdf_url": "https://arxiv.org/pdf/2506.17195v2.pdf",
    "title": "Operation and performance of the CMS silicon strip tracker with   proton-proton collisions at the CERN LHC",
    "abstract": "Salient aspects of the commissioning, calibration, and performance of the CMS silicon strip tracker are discussed, drawing on experience during operation with proton-proton collisions delivered by the CERN LHC. The data were obtained with a variety of luminosities. The operating temperature of the strip tracker was changed several times during this period and results are shown as a function of temperature in several cases. Details of the system performance are presented, including occupancy, signal-to-noise ratio, Lorentz angle, and single-hit spatial resolution. Saturation effects in the APV25 readout chip preamplifier observed during early Run 2 are presented, showing the effect on various observables and the subsequent remedy. Studies of radiation effects on the strip tracker are presented both for the optical readout links and the silicon sensors. The observed effects are compared to simulation, where available, and they generally agree well with expectations.",
    "authors": [
      "CMS Collaboration"
    ],
    "published": "2025-06-20T17:47:11Z",
    "updated": "2025-08-25T12:01:49Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/08/P08027"
  },
  {
    "arxiv_id": "2508.15691v2",
    "url": "https://arxiv.org/abs/2508.15691v2",
    "pdf_url": "https://arxiv.org/pdf/2508.15691v2.pdf",
    "title": "Trotter-based quantum algorithm for solving transport equations with   exponentially fewer time-steps",
    "abstract": "The extent to which quantum computers can simulate physical phenomena and solve the partial differential equations (PDEs) that govern them remains a central open question. In this work, one of the most fundamental PDEs is addressed: the multidimensional transport equation with space- and time-dependent coefficients. We present a quantum numerical scheme based on three steps: quantum state preparation, evolution, and measurement of relevant observables. The evolution step combines a high-order centered finite difference with a time-splitting scheme based on product formula approximations, also known as Trotterization. We introduce novel vector-norm analysis and prove that the number of time-steps can be reduced by a factor exponential in the number of qubits compared to previously established operator-norm analysis, thereby significantly lowering the projected computational resources. We also present efficient quantum circuits and numerical simulations that confirm the predicted vector-norm scaling. We report results on real quantum hardware for the one-dimensional convection equation, and solve a non-linear ordinary differential equation via its associated Liouville equation, a particular case of transport equations. This work provides a practical framework for efficiently simulating transport phenomena on quantum computers, with potential applications in plasma physics, molecular gas dynamics and non-linear dynamical systems, including chaotic systems.",
    "authors": [
      "Julien Zylberman",
      "Thibault Fredon",
      "Nuno F. Loureiro",
      "Fabrice Debbasch"
    ],
    "published": "2025-08-21T16:14:05Z",
    "updated": "2025-08-25T12:00:54Z",
    "categories": [
      "quant-ph",
      "math-ph",
      "math.MP",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2508.17810v1",
    "url": "https://arxiv.org/abs/2508.17810v1",
    "pdf_url": "https://arxiv.org/pdf/2508.17810v1.pdf",
    "title": "Kinetic contribution to the arbitrary order odd frequency moments of the   dynamic structure factor",
    "abstract": "An exact expression is derived for the kinetic contribution to the odd (arbitrary order) frequency moments of the dynamic structure factor via a finite summation that features averages of even (all lower orders) powers of the momentum over the exact momentum distribution. The derivation is carried out for the non-interacting Fermi gas and generalized to the interacting case based on the conjecture that averages over the Fermi distribution can be substituted with averages over the exact distribution. The expression is validated against known results (first, third frequency moments) and new explicit calculations (fifth, seventh frequency moments).",
    "authors": [
      "Panagiotis Tolias",
      "Tobias Dornheim",
      "Jan Vorberger"
    ],
    "published": "2025-08-25T08:58:27Z",
    "updated": "2025-08-25T08:58:27Z",
    "categories": [
      "cond-mat.quant-gas",
      "cond-mat.str-el",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.quant-gas"
  },
  {
    "arxiv_id": "2507.11593v2",
    "url": "https://arxiv.org/abs/2507.11593v2",
    "pdf_url": "https://arxiv.org/pdf/2507.11593v2.pdf",
    "title": "Characterizing the Delivered Spill Structure of Medical Proton and   Carbon-Ion Beams at MedAustron using a High Frequency Silicon Carbide Readout",
    "abstract": "Medical synchrotrons are often used for testing instrumentation in high-energy physics or non-clinical research in medical physics. In many applications of medical synchrotrons, such as microdosimetry and ion imaging, precise knowledge of the spill structure and instantaneous particle rate is crucial. Conventional ionization chambers, while omnipresent in clinical settings, suffer from limitations in charge resolution and integration time, making single-particle detection at high dose rates unfeasible. To address these limitations, we present a beam detection setup based on a silicon carbide (SiC) sensor and a monolithic microwave integrated circuit (MMIC), capable of detecting single particles with a full width at half maximum (FWHM) pulse duration of 500 ps. At the MedAustron ion therapy center, we characterized the spill structure of proton and carbon-ion beams delivered to the irradiation room beyond the timescale of the maximum ion revolution frequency in the synchrotron. The resulting data offer valuable insights into the beam intensity at small time scales and demonstrate the capabilities of SiC-based systems for high-flux beam monitoring.",
    "authors": [
      "Matthias Knopf",
      "Andreas Gsponer",
      "Matthias Kausel",
      "Simon Waid",
      "Sebastian Onder",
      "Stefan Gundacker",
      "Daniel Radmanovac",
      "Giulio Magrin",
      "Thomas Bergauer",
      "Albert Hirt"
    ],
    "published": "2025-07-15T16:21:23Z",
    "updated": "2025-08-25T08:54:15Z",
    "categories": [
      "physics.ins-det",
      "physics.med-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.17691v1",
    "url": "https://arxiv.org/abs/2508.17691v1",
    "pdf_url": "https://arxiv.org/pdf/2508.17691v1.pdf",
    "title": "Design and initial results from the \"Junior\" Levitated Dipole Experiment",
    "abstract": "OpenStar Technologies is a private fusion company exploring the levitated dipole concept for commercial fusion energy production. OpenStar has manufactured a new generation of levitated dipole experiment, called \"Junior\", leveraging recent advances made in high-temperature superconducting magnet technologies. Junior houses a ~5.6 T REBCO high-temperature superconducting magnet in a 5.2 m vacuum chamber, with plasma heating achieved via < 50 kW of electron cyclotron resonance heating power. Importantly, this experiment integrates novel high temperature superconductor power supply technology on board the dipole magnet. Recently OpenStar has completed first experimental campaigns with the Junior experiment, achieving first plasmas in late 2024. Experiments conducted with the full levitated system are planned for 2025. This article provides an overview of the main results from these experiments and details improvements planned for future campaigns.",
    "authors": [
      "Craig S. Chisholm",
      "Thomas Berry",
      "Darren T. Garnier",
      "Rodney A. Badcock",
      "Gabriel Bioletti",
      "Konstantinos Bouloukakis",
      "Emily-Kei Brewerton",
      "Mike A. Buchanan",
      "Pierce J. Burt",
      "Eleanor V. W. Chambers",
      "Kris B. Chappell",
      "Patrick Coulson",
      "Ryan J. Davidson",
      "Josh P. M. Ellingham",
      "Piet Geursen",
      "Kent Hamilton",
      "Raymond Hu",
      "Emily Hunter",
      "Joseph P. Jones",
      "Plaso Kusay",
      "Zvonko Lazić",
      "Bradley Leuw",
      "Matthew Lynch",
      "Ratu Mataira",
      "Mick McCrohon",
      "Les Meadows",
      "Jack R. Morris",
      "Ryan Nowacki",
      "Jack V. Purvis",
      "James H. P. Rice",
      "Michael Rutten",
      "Samuel Schimanski",
      "Aaryan Sharma",
      "Mohammad Siamaki",
      "Alex Simpson",
      "Thomas Simpson",
      "Benjamin Smith",
      "Eric Stiers",
      "Emerson Swanson-Dobbs",
      "Joe Todd",
      "Eddyn O. P. Treacher",
      "Jared D. Tyler",
      "Sriharsha Venturumilli",
      "Hubertus W. Weijers",
      "Theodore Wordsworth",
      "Nancy Zhou"
    ],
    "published": "2025-08-25T05:58:23Z",
    "updated": "2025-08-25T05:58:23Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.17443v1",
    "url": "https://arxiv.org/abs/2508.17443v1",
    "pdf_url": "https://arxiv.org/pdf/2508.17443v1.pdf",
    "title": "Pulsed laser synthesis of mesoporous metal chalcogenide thin films",
    "abstract": "Mesoporous films of the metal chalcogenide $\\beta$-FeSe were grown on MgO substrates by KrF pulsed laser deposition (PLD) in an argon background. At 100 mTorr, gated intensified charge-coupled device imaging and ion probe measurements showed that the plasma plume responsible for crystal growth initially comprised three components, with distinct expansion velocities. Plume interactions with the substrate heater and ablation target gave rise to complex dynamics, including collisions between the charged leading edge -- rebounding between the substrate and the target -- and slower-moving species in the plume interior. Film growth was dominated by species with kinetic energies $\\le$0.5 eV/atom. X-ray reflectivity and atomic force microscopy revealed that films grown in this environment -- with a substrate temperature of 350$^\\circ$C, a laser fluence of 1.0 J cm$^{-2}$, and a 7.5 mm$^2$ spot area -- formed a porous framework with 15% porosity and pore sizes below 100 nm. X-ray diffraction indicated that the porous films were epitaxial with respect to the substrate and likely grew by oriented-attachment of gas-phase molecular clusters or very small nanoparticles, in contrast to the conventional epitaxy of vacuum films from atomic constituents. The in-plane orientation of the mesoporous films was $\\beta$-FeSe[100]$\\parallel$[110]MgO, attributed to the soft landing of pre-formed crystallites on the MgO substrates, where protruding Se rows of $\\beta$-FeSe aligned with corrugations of the MgO surface. This work implies that growth of candidate electrocatalyst materials by PLD in inert gas background may allow mesoporous frameworks with a single crystallographic orientation that expose specific crystal facets for electrochemical reactions and active site engineering.",
    "authors": [
      "Dorien E. Carpenter",
      "Zahra Nasiri",
      "Nithesh R. Palagiri",
      "Kamron L. Strickland",
      "Sumner B. Harris",
      "David B. Geohegan",
      "Renato P. Camata"
    ],
    "published": "2025-08-24T16:46:39Z",
    "updated": "2025-08-24T16:46:39Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2508.17420v1",
    "url": "https://arxiv.org/abs/2508.17420v1",
    "pdf_url": "https://arxiv.org/pdf/2508.17420v1.pdf",
    "title": "Landau damping and the long-time collisionless limit of the   Vlasov-Poisson-Landau Equation",
    "abstract": "In this paper, we study the Vlasov-Poisson-Landau Equations on $\\mathbb{T}^3\\times \\mathbb{R}^3$ with small collision frequency $\\nu\\ll 1$. We prove that for $\\nu$-independent perturbations of the global Maxwellians in Gevrey-$2_-$, solutions display uniform-in-$\\nu$ Landau damping and enhanced dissipation. Moreover, the collisionless limit holds, that is, as $\\nu\\to 0_+$ for $0<t\\ll \\nu^{-\\frac{1}{3}}$, the $\\nu > 0$ solutions converge uniformly (and in much stronger norms) to the solution of the Vlasov-Poisson equation with the same initial data. To our knowledge, this work is hence the first justification that the collisionless prediction matches those of collisional plasmas in the nonlinear equations.   The interaction between Landau damping and collisions requires several new ideas:   (1) an infinite-regularity commuting vector field method, merged with Guo's weighted energy methods for the Landau operator and hypocoercivity to extract the enhanced dissipation;   (2) A novel nearly-physical side treatment of the collisionless Vlasov echoes;   (3) A new set of decomposition methods to treat the effects of the nonlinear collisions in the Volterra equation for the density (i.e., the ``collisional echoes'')   (4) A new quasi-linearization method for treating the effect of the slowly evolving homogeneous modes over long times.   As a side result, we also prove Landau damping and enhanced dissipation of $O(\\epsilon\\nu^{1/3})$ Sobolev-space perturbations of homogeneous distributions that are only $O(\\epsilon)$ perturbations of global Maxwellians, generalizing the recent results of Chaturvedi, Luk, and Nguyen. As another side result, our methods also provide a nearly-completely physical-side proof of Mouhot and Villani's theorem in the full range of Gevrey-$3_-$.",
    "authors": [
      "Jacob Bedrossian",
      "Weiren Zhao",
      "Ruizhao Zi"
    ],
    "published": "2025-08-24T15:54:11Z",
    "updated": "2025-08-24T15:54:11Z",
    "categories": [
      "math.AP",
      "physics.plasm-ph"
    ],
    "primary_category": "math.AP"
  },
  {
    "arxiv_id": "2508.17309v1",
    "url": "https://arxiv.org/abs/2508.17309v1",
    "pdf_url": "https://arxiv.org/pdf/2508.17309v1.pdf",
    "title": "An improved nonlocal electron heat transport model for magnetized   plasmas",
    "abstract": "Distortions in the electron distribution function driven by intense temperature gradients critically influence the generation and evolution of heat flux and magnetic fields in plasmas under the condition of inertial confinement fusion. Describing such kinetic behaviors at large spatiotemporal scales typically requires multigroup models based on simplified Vlasov-Fokker-Planck equations. However, the accuracy of existing multigroup models remains uncertain, without a well-defined methodology for implementing nonlocal magnetic field corrections. This paper develops an improved nonlocal multigroup model for magnetized plasmas. The advancements comprise: (i) a revised source term in the diffusion equations, (ii) a Biermann-producing electric field equation incorporating the density perturbation, and (iii) a nonlocal correction method for the Nernst velocity. The numerical method for the anisotropic heat conduction equation is analyzed, and three test cases demonstrate that the model accurately predicts the key phenomena arising from nonlocal effects in magnetized plasmas.",
    "authors": [
      "Z. H. Chen",
      "Z. Q. Zhao",
      "X. H. Yang",
      "L. R. Li",
      "B. Zeng",
      "Z. Li",
      "B. H. Xu",
      "G. B. Zhang",
      "H. H. Ma",
      "M. Tang",
      "Y. Y. Ma",
      "H. Xu",
      "F. Q. Shao",
      "J. Zhang"
    ],
    "published": "2025-08-24T11:29:11Z",
    "updated": "2025-08-24T11:29:11Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2412.17887v3",
    "url": "https://arxiv.org/abs/2412.17887v3",
    "pdf_url": "https://arxiv.org/pdf/2412.17887v3.pdf",
    "title": "Detectors for next-generation quasi-free scattering experiments at the   RIBF",
    "abstract": "The advent of high-intensity radioactive ion beams has opened new avenues for nuclear structure research. By studying exotic ions, phenomena such as shell evolution, halos, and the limits of stability have been studied. In particular, Quasi-Free Scattering (QFS) experiments on hydrogen targets have proven to be a valuable tool to investigate the structure of exotic ions. Recently, a series of QFS experiments were performed at the Radioactive Isotope Beam Factory (RIBF) of the RIKEN Nishina Center employing the MINOS liquid hydrogen system. A fundamental part of the success of these experiments was the use of dedicated devices to measure the gamma-rays, charged particles, and neutrons emitted in the reactions. The experience gained during the past campaigns, as well as the upcoming upgrade of the RIBF facility call for improvements on the existing devices, as well as for the development of new detection systems. Here we review the main detection devices used at the RIBF for QFS experiments, and give an overview of the ongoing and upcoming developments.",
    "authors": [
      "Junki Tanaka",
      "Martha Liliana Cortés",
      "Hongna Liu",
      "Ryo Taniuchi"
    ],
    "published": "2024-12-23T10:55:42Z",
    "updated": "2025-08-24T07:44:53Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.17080v1",
    "url": "https://arxiv.org/abs/2508.17080v1",
    "pdf_url": "https://arxiv.org/pdf/2508.17080v1.pdf",
    "title": "Terahertz-Driven Nano-tip Field-Emission Electron Gun and Cascaded   Acceleration",
    "abstract": "This paper reports two versions of terahertz (THz)-driven nanotip field-emission electron guns: single-layer reflective guns (SLRGs) and double-layer reflective guns (DLRGs). Both guns use nanotip emitters and accelerate electrons through the electric field of the THz wave. SLRGs employ a reflective structure to superimpose the initial and subsequent half-cycles of the THz electric field, enhancing the field amplitude and acceleration efficiency. Experiments have demonstrated that SLRGs achieve higher acceleration efficiency than single-layer nonreflective guns (SLNRGs) for identical THz input energies. This constitutes direct experimental verification of the efficacy of the reflective structure. Theoretically, SLRGs operating in single-feed mode can match the acceleration efficiency of dual-feed SLNRGs while reducing operational complexity. DLRGs demonstrate THz-driven cascaded electron acceleration through precise scanning of the delay between two incident THz beams. This represents a direct experimental demonstration of cascaded acceleration in THz-driven electron sources. The experimental results of DLRGs align closely with the results of electron dynamics predicted by simulations. This establishes the foundation for developing multilayer high-acceleration-efficiency THz-driven high-energy electron guns. The ability to manipulate the THz for each layer individually holds promising potential for improving the beam quality of THz electron guns.",
    "authors": [
      "Wentao Yu",
      "Nongchao Tan",
      "Kai Peng",
      "Sijie Fan",
      "Yixiao Fu",
      "Kai Jiang",
      "Zhao Yun",
      "Longding Wang",
      "Renkai Li",
      "Yingchao Du",
      "Lixin Yan",
      "Chuanxiang Tang",
      "Wenhui Huang"
    ],
    "published": "2025-08-23T16:36:04Z",
    "updated": "2025-08-23T16:36:04Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2501.11761v2",
    "url": "https://arxiv.org/abs/2501.11761v2",
    "pdf_url": "https://arxiv.org/pdf/2501.11761v2.pdf",
    "title": "Strong and weak dynamo regimes in Taylor-Couette flows",
    "abstract": "We reveal a nonlinear magnetic dynamo in a Taylor-Couette flow at small magnetic Prandtl numbers $Pm\\leq 1$, which has been previously believed to exist only at higher $Pm\\gtrsim 10$ in this flow. The amplitude of initial perturbations, $Pm$ and domain aspect ratio play a key role in the onset and evolution of the dynamo. It exists in two main states -- a weak state dominated by large-scale modes and a strong, turbulent state with higher amplitude dominated by small-scale modes. These findings can be important for dynamo processes in various astrophysical objects with small $Pm$.",
    "authors": [
      "A. Mishra",
      "G. Mamatsashvili",
      "F. Stefani"
    ],
    "published": "2025-01-20T21:45:27Z",
    "updated": "2025-08-23T15:18:27Z",
    "categories": [
      "physics.flu-dyn",
      "astro-ph.EP",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.flu-dyn"
  },
  {
    "arxiv_id": "2508.16953v1",
    "url": "https://arxiv.org/abs/2508.16953v1",
    "pdf_url": "https://arxiv.org/pdf/2508.16953v1.pdf",
    "title": "Optics for broadband x-ray ptychography",
    "abstract": "In conventional x-ray ptychography, diffraction data is collected by scanning a sample through a monochromatic, and spatially coherent, x-ray beam. A high-resolution image is then retrieved using an iterative algorithm. Combined with a scan of the incident photon energy, it is also possible to access chemical and elemental information. Although powerful, the high brilliance required currently constrains the method to 3rd and 4th generation synchrotron sources and long scanning times. An alternative approach is to use a broadband illumination in combination with an energy resolving detector. These detectors record the data in a series of energy channels simultaneously, creating a stack of coherent data suitable for a ptychographic reconstruction. This approach promises to unlock the full power of the radiation source and provide spectral imaging at a higher rate and in a single acquisition. However, these detectors currently saturate well below reaching the flux rates produced at synchrotrons, which is preventing the uptake of this approach. Furthermore, current monochromatic synchrotron setups typically employ Fresnel zone plates for pre-sample focusing due to their stability, flexibility, and affordability, but these diffractive optics limit the spectral bandwidth that the setup can accept. In this article, we analyze the problem and consider alternative optics that can both maximize the total photon detection rates and broaden the tolerable bandwidth. Broadband x-ray ptychography has the potential to dramatically reduce data collection times at synchrotron sources, but also to harness the full power of lower brilliance sources and transition x-ray ptychography into a laboratory technique.",
    "authors": [
      "Wiebe Stolp",
      "Silvia Cipiccia",
      "Darren Batey",
      "Matthieu Boone"
    ],
    "published": "2025-08-23T08:56:00Z",
    "updated": "2025-08-23T08:56:00Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics",
    "doi": "10.1063/5.0274044"
  },
  {
    "arxiv_id": "2508.14362v2",
    "url": "https://arxiv.org/abs/2508.14362v2",
    "pdf_url": "https://arxiv.org/pdf/2508.14362v2.pdf",
    "title": "Suppression of two stream instability in relativistic electron-ion   plasmas",
    "abstract": "This paper investigates the suppression of two stream instabilities in electron ion plasmas when the individual species attain relativistic velocities. This suppression of the growth rate of two stream instability is consistent even when the ions form a neutralizing background. It is found that the parameter space of the growth rate reasonably squeezes for relativistic electrons at higher plasma frequencies. We further report the suppression of the growth rate of the said instability as the ion electron mass ratio reaches the realistic limit. Our results have implications for high-energy plasmas, laser-plasma interactions, and relativistic particle beam physics, providing insights into the complex interplay of linear and nonlinear processes governing the two-stream instability. Our unified four-regime analysis extends previous understanding of how realistic mass ratios fundamentally modify relativistic suppression effects, providing essential scaling laws for high-energy plasma applications.",
    "authors": [
      "Vivek Shrivastav",
      "Mani K Chettri",
      "Hemam D Singh",
      "Rupak Mukherjee"
    ],
    "published": "2025-08-20T02:22:46Z",
    "updated": "2025-08-23T04:44:17Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.16864v1",
    "url": "https://arxiv.org/abs/2508.16864v1",
    "pdf_url": "https://arxiv.org/pdf/2508.16864v1.pdf",
    "title": "Precision alignment and tolerance of a plasma wakefield accelerator in a   laser-ionized plasma source",
    "abstract": "We present a novel method for aligning a laser ionized plasma source to a pair of ultra-relativistic electron beams that comprise a plasma wakefield accelerator (PWFA). We achieve alignment by analyzing the plasma afterglow light observed at two longitudinal locations as the plasma column is scanned across the electron beam. By analyzing the relative plasma light intensity at the two locations, we aligned an 85-cm plasma source to a 10 GeV, 1.6 nC electron beam to within 10 um offset, 10 urad tilt. The alignment is verified by analyzing the drive beam energy loss, energy transfer efficiency, and the witness beam energy gain as a function of the misalignment between the beams and the plasma. From this measurement, we extract the alignment tolerance required between the laser-ionized plasma source and electron beams, an important metric necessary for collider design studies or light source applications based on a laser-ionized plasma source.",
    "authors": [
      "Valentina Lee",
      "Robert Ariniello",
      "Douglas Storey",
      "Sebastien Corde",
      "Claudio Emma",
      "Spencer Gessner",
      "Mark Hogan",
      "Alexander Knetsch",
      "Nathan Majernik",
      "Brendan O'Shea",
      "Ivan Rajkovic",
      "Michael Litos"
    ],
    "published": "2025-08-23T01:21:54Z",
    "updated": "2025-08-23T01:21:54Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2504.08931v2",
    "url": "https://arxiv.org/abs/2504.08931v2",
    "pdf_url": "https://arxiv.org/pdf/2504.08931v2.pdf",
    "title": "Heatpipe-cooled in-vacuum electromagnet for quantum science experiment",
    "abstract": "Quantum inertial sensors test general relativity, measure fundamental constants, and probe dark matter and dark energy in the laboratory with outstanding accuracy. Their precision relies heavily on carefully choreographed quantum control of the atomic states with a collection of lasers, microwaves, electric and magnetic fields. Making this technology available outside of the laboratory would unlock many applications, such as geophysics, geodesy and inertial navigation. However, this requires an apparatus of reduced size, weight, power use and increased robustness, modularity and ease-of-use. Here, we describe the design and implementation of an in-vacuum electromagnet able to create the magnetic fields necessary for various quantum control operations, such as magneto-optical trapping or magnetic levitation to assist evaporative cooling. Placing the electromagnet inside the vacuum chamber has significant advantages, such as fast switching times that are not limited by induced current inside the vacuum chamber metal, reduced size, weight and power usage. However, dissipating the heat produced typically requires complex designs that include bulky metal heatsinks or cooling using water or cryogens. Our design implements heatpipes in a compact, low-vibration and robust apparatus, which use a phase transition in the working fluid to achieve thermal conductivity that is more than one hundred times larger than that of typical bulk metal. We show that the setup can conduct more than 50 W of thermal power in a configuration that provides ample optical access and is compatible with the ultra-high vacuum requirements of atomic and molecular experiments.",
    "authors": [
      "Kenneth Nakasone",
      "Paola Luna",
      "Andrei Zhukov",
      "Matthew Tao",
      "Garrett Louie",
      "Cristian D. Panda"
    ],
    "published": "2025-04-11T19:19:10Z",
    "updated": "2025-08-22T17:33:56Z",
    "categories": [
      "physics.atom-ph",
      "physics.ins-det",
      "physics.optics",
      "quant-ph"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2508.16533v1",
    "url": "https://arxiv.org/abs/2508.16533v1",
    "pdf_url": "https://arxiv.org/pdf/2508.16533v1.pdf",
    "title": "Bayesian Optimisation of Breit-Wheeler Pair Production in Simulated   Laser Experiments",
    "abstract": "High laser intensities enable the production of electron-positron pairs from bright gamma rays passing through strong fields. Potentially the most promising approach for all-optical experiments in the near term uses dense but higher divergence electron beams from laser wakefield acceleration to produce gamma rays through inverse Compton scattering. Achieving many-photon collisions between these gamma rays and the high intensity laser pulse in practice is extremely difficult, however, due to significant shot-to-shot jitter in laser pointing and timing.   We model these practical difficulties using simulated Monte-Carlo experiments. By using a more efficient algorithm for sampling infrequent pair production with particle splitting, we enable the exploration of a multi-dimensional parameter space. Using Gaussian Process Regression we then efficiently find optimal conditions for maximising pair production by changing the laser spot size, the energy in the colliding beam, and the stand-off distance between the laser wakefield accelerator and the focus of the colliding laser pulse. We find that the optimal stand-off distance increases with the degree of laser jitter and that the best conditions for producing electron-positron pairs are not the same as the best conditions for maximising the energy in the gamma rays. With \\unit[100]{J} of laser energy, we estimate rates of pair production of around 1 pair per 100 electrons are achievable even with jitter of 10s of microns and 10s of femtoseconds.",
    "authors": [
      "Christopher Arran",
      "Stuart Morris",
      "Christopher P. Ridgers"
    ],
    "published": "2025-08-22T16:55:11Z",
    "updated": "2025-08-22T16:55:11Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.08663v2",
    "url": "https://arxiv.org/abs/2507.08663v2",
    "pdf_url": "https://arxiv.org/pdf/2507.08663v2.pdf",
    "title": "A Neutron Sensitive Detector Using 3D-Printed Scintillators",
    "abstract": "This work reports on the performance of a novel neutron-sensitive scintillating detector fabricated using Fused-Deposition Modelling (FDM) additive manufacturing. FDM is a cost-effective 3D-printing method employing flexible plastic filaments to create custom-shaped components. Scintillating filaments, based on polystyrene doped with \\emph{p}-terphenyl and 1,4-bis (5-phenyloxazol-2-yl) benzene, and enriched with $^6$LiF to enable neutron sensitivity were manufactured in house and achieved visible scintillation with a light output of 30$\\pm$5~photons per MeV. Printed scintillators were then integrated into a detector system consisting of an image intensified TimePix3 camera, offering high spatial and temporal resolution. The detector performance was compared with Geant4 simulations of the scintillating sensor's response to electrons, gamma-rays, and thermal neutrons. A novel event discrimination algorithm, using the properties of the TimePix3 camera, enabled the separation of neutron signatures from the gamma-ray background.",
    "authors": [
      "Adam Barr",
      "Cinzia da Vià",
      "Mosst Tasnim Binte Shawkat",
      "Stephen Watts",
      "John Allison",
      "Gabriele D'Amen"
    ],
    "published": "2025-07-11T15:03:12Z",
    "updated": "2025-08-22T14:59:47Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.16407v1",
    "url": "https://arxiv.org/abs/2508.16407v1",
    "pdf_url": "https://arxiv.org/pdf/2508.16407v1.pdf",
    "title": "Trapping of electrons and $^{40}\\textrm{Ca}^+$ ions in a dual-frequency   Paul trap",
    "abstract": "We demonstrate the operation of a dual-frequency Paul trap and characterize its performance by storing either electrons or calcium ions while applying two quadrupole fields simultaneously which oscillate at $\\Omega_\\textrm{fast} = 2\\pi \\times 1.6$ GHz and $\\Omega_\\textrm{slow} = 2\\pi \\times 2$ MHz. The particles are loaded and stored in the trap under various conditions followed by detection employing an electron multiplier tube. We find that tens of electrons or ions can be trapped for up to ten milliseconds and a small fraction remains trapped even after hundreds of milliseconds. During dual-frequency operation we find that while the number of trapped electrons rapidly decreases with increase of the $\\Omega_\\textrm{slow}$ field amplitude, the number of trapped ions shows no dependence on the $\\Omega_\\textrm{fast}$ field amplitude as supported by our extensive numerical simulations. We aim to use a similar trap for synthesising antihydrogen from antiprotons and positrons. Accordingly, we discuss open challenges such as the co-trapping of oppositely charged species and particle trap duration.",
    "authors": [
      "Vladimir Mikhailovskii",
      "Natalija Sheth",
      "Guofeng Qu",
      "Michal Hejduk",
      "Niklas Vilhelm Lausti",
      "K. T. Satyajith",
      "Christian Smorra",
      "Günther Werth",
      "Neha Yadav",
      "Qian Yu",
      "Clemens Matthiesen",
      "Hartmut Häffner",
      "Ferdinand Schmidt-Kaler",
      "Hendrik Bekker",
      "Dmitry Budker"
    ],
    "published": "2025-08-22T14:14:17Z",
    "updated": "2025-08-22T14:14:17Z",
    "categories": [
      "physics.atom-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2508.16358v1",
    "url": "https://arxiv.org/abs/2508.16358v1",
    "pdf_url": "https://arxiv.org/pdf/2508.16358v1.pdf",
    "title": "Detectability of Covert Fissile Material Production in Nuclear Fusion   Reactors via Antineutrino Emissions",
    "abstract": "Fusion power systems can in principle be used to make significant amounts of fissile material. To do so, an operator would have to introduce fertile material, such as uranium-238, in a suitable region of the reactor where it is exposed to an intense neutron flux. The possibility of using a fusion reactor for this purpose has raised the question of how these facilities can be monitored to ensure their peaceful use. This study examines whether covert production of fissile material in a declared fusion plant could be detected with an onsite antineutrino detector. We find that even a relatively small detector should be able to confirm production rates of a few kilograms of plutonium over 30 days, despite the cosmogenic background and the antineutrino emissions associated with neutron activation of reactor components.",
    "authors": [
      "Alexander Glaser",
      "Robert J. Goldston",
      "Patrick Huber"
    ],
    "published": "2025-08-22T13:05:02Z",
    "updated": "2025-08-22T13:05:02Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.16349v1",
    "url": "https://arxiv.org/abs/2508.16349v1",
    "pdf_url": "https://arxiv.org/pdf/2508.16349v1.pdf",
    "title": "Identification of Nonlinear Damping of Transverse Loop Oscillations by   KHI-induced Turbulence",
    "abstract": "Kink oscillations in coronal loops have been extensively studied for their potential contributions to coronal heating and their role in plasma diagnostics through coronal seismology. A key focus is the strong damping of large-amplitude kink oscillations, which observational evidence suggests is nonlinear. However, directly identifying the nonlinearity is a challenge. This work presents an analytic formula describing nonlinear standing kink oscillations dissipated by turbulence, characterised by a time-varying damping rate and period drift. We investigate how the damping behaviour depends on the driving amplitude and loop properties, showing that the initial damping time $\\tau$ is inversely proportional to the velocity disturbance over the loop radius, $V_i/R$. Using MCMC fitting with Bayesian inference, the nonlinear function better fits an observed decaying kink oscillation than traditional linear models, including exponential damping, suggesting its nonlinear nature. By applying a Bayesian model comparison, we establish regimes in which nonlinear and linear resonant absorption mechanisms dominate based on the relationship between the damping rate $\\tau/P$ and $V_i/R$. Additionally, analysis of two specific events reveals that while one favours the nonlinear model, the other is better explained by the linear model. Our results suggest that this analytical approximation of nonlinear damping due to turbulence provides a valid and reliable description of large-amplitude decaying kink oscillations in coronal loops.",
    "authors": [
      "Sihui Zhong",
      "Andrew Hillier",
      "Iñigo Arregui"
    ],
    "published": "2025-08-22T12:41:55Z",
    "updated": "2025-08-22T12:41:55Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR",
    "doi": "10.3847/1538-4357/adfd5c"
  },
  {
    "arxiv_id": "2508.16324v1",
    "url": "https://arxiv.org/abs/2508.16324v1",
    "pdf_url": "https://arxiv.org/pdf/2508.16324v1.pdf",
    "title": "A two-prong Approach to the Simulation of DC-RSD: TCAD and Spice",
    "abstract": "The DC-coupled Resistive Silicon Detectors (DCRSD) are the evolution of the AC-coupled RSD (RSD) design, both based on the Low-Gain Avalanche Diode (LGAD) technology. The DC-RSD design concept intends to address a few known issues present in RSDs (e.g., baseline fluctuation, long tail-bipolar signals) while maintaining their advantages (e.g., signal spreading, 100% fill factor). The simulation of DC-RSD presents several unique challenges linked to the complex nature of its design and the large pixel size. The defining feature of DC-RSD, charge sharing over distances that can be as large as a millimeter, represents a formidable challenge for Technology-CAD (TCAD), the standard simulation tool. To circumvent this problem, we have developed a mixed-mode approach to the DC-RSD simulation, which exploits a combination of two simulation tools: TCAD and Spice. Thanks to this hybrid approach, it has been possible to demonstrate that, according to the simulation, the key features of the RSD, excellent timing and spatial resolutions (few tens of picoseconds and few microns), are maintained in the DC-RSD design. In this work, we present the developed models and methodology, mainly showing the results of device-level numerical simulation, which have been obtained with the state-of-the-art Synopsys Sentaurus TCAD suite of tools. Such results will provide all the necessary information for the first batch of DC-RSD produced by Fondazione Bruno Kessler (FBK) foundry in Trento, Italy.",
    "authors": [
      "T. Croci",
      "L. Menzio",
      "R. Arcidiacono",
      "M. Arneodo",
      "P. Asenov",
      "N. Cartiglia",
      "M. Ferrero",
      "A. Fondacci",
      "V. Monaco",
      "A. Morozzi",
      "F. Moscatelli",
      "R. Mulargia",
      "E. Robutti",
      "V. Sola",
      "D. Passeri"
    ],
    "published": "2025-08-22T12:12:35Z",
    "updated": "2025-08-22T12:12:35Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2504.04282v2",
    "url": "https://arxiv.org/abs/2504.04282v2",
    "pdf_url": "https://arxiv.org/pdf/2504.04282v2.pdf",
    "title": "Semi-Lagrangian methods for a plasma hybrid model with multi-species   kinetic ions and massless electrons",
    "abstract": "The semi-Lagrangian methods with the improved number of one-dimensional advections are proposed for a plasma hybrid model with kinetic ions and mass-less electrons. Two subsystems with mass, momentum, and energy conservation are obtained by a Poisson bracket-based splitting method. For the subsystem in which the distribution functions and the fields are coupled, the second order and reversible modified implicit mid-point rule is used in time with the specially designed mean velocity. The distribution functions are not involved in the iterations and are solved by exact splittings with only one dimensional advections, which makes the proposed schemes efficient. The cancellation problem is overcome by the numerical schemes constructed. Moreover, for the case with a periodic boundary condition, the magnetic field obtained is divergence free, mass, momentum, and energy are conserved. The methods can be extended to cases with multiple ion species.",
    "authors": [
      "Yingzhe Li",
      "Philip J. Morrison",
      "Eric Sonnendrücker"
    ],
    "published": "2025-04-05T21:06:03Z",
    "updated": "2025-08-22T10:10:33Z",
    "categories": [
      "math.NA",
      "cs.NA",
      "physics.plasm-ph",
      "65M25, 85-08, 86-08, 35Q83"
    ],
    "primary_category": "math.NA"
  },
  {
    "arxiv_id": "2508.16248v1",
    "url": "https://arxiv.org/abs/2508.16248v1",
    "pdf_url": "https://arxiv.org/pdf/2508.16248v1.pdf",
    "title": "A rigorous study on the longitudinal beam coupling impedance of a   cylindrical lossy pipe in normal and anomalous regimes",
    "abstract": "One of the primary issues in designing particle accelerators is the effect of energy losses and collective instabilities caused by the conductivity of the vacuum chamber. Due to its relevance, many authors have long focused on studying the coupling impedance of lossy pipes with various geometries and metals. Most studies were developed for relativistic beams and room-temperature conductivity. In recent years, there has been increasing interest in the high-frequency impedance behavior of ultra-short bunches, as in the case of FELs, and in the anomalous conductivity at cryogenic temperatures of the vacuum chambers. This work introduces a new unifying theoretical framework for analyzing electromagnetic interactions in cylindrical pipes excited by charged particles traveling on the axis. In this context, a key achievement is the derivation of a rigorous expression for the electric conductivity, based on the Boltzmann theory of a Fermi gas, which forms the foundation for subsequent developments. New formulas for the surface impedance of cylindrical pipes are presented, from which a more general impedance expression is derived. Our approach captures the system's behavior across various energy and frequency regimes. Eventually, the anomalous regime is studied rigorously, providing analytical solutions for the electromagnetic field at cryogenic temperatures. Indeed, new and exact expressions for the anomalous surface impedance for carriers' reflection coefficients p = 0 and p = 1 are obtained, offering deeper insight into the electromagnetic properties of such systems under extreme conditions.",
    "authors": [
      "A. Curcio",
      "M. Migliorati",
      "A. Mostacci",
      "L. Palumbo"
    ],
    "published": "2025-08-22T09:29:51Z",
    "updated": "2025-08-22T09:29:51Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.16220v1",
    "url": "https://arxiv.org/abs/2508.16220v1",
    "pdf_url": "https://arxiv.org/pdf/2508.16220v1.pdf",
    "title": "Generating Cylindrical Vector γ Rays via Beam-Target   Interactions: Towards Structured Light at High Energies",
    "abstract": "Structured {\\gamma} rays, particularly cylindrical vector {\\gamma} rays, offer promising tools for sub-nuclear imaging and polarization-sensitive probes in fundamental research and applications, but conventional optical methods face great challenges at such photon energy. Here, we put forward a novel method generating such {\\gamma} rays through relativistic beam-target interactions. For instance, radially polarized {\\gamma} rays can be generated by using a dense electron beam striking a multifoil target. We find that the radial polarization is transferred from the generated coherent transition radiation (CTR) fields to $\\gamma$ photons through nonlinear Compton scattering, with the high polarization preserved by phase matching. Three-dimensional spin-resolved simulations demonstrate radial polarization degrees approaching 60\\%. Furthermore, these {\\gamma} rays can decay into azimuthally spin-polarized positrons via the nonlinear Breit-Wheeler process, with their spins aligning along the CTR magnetic field. Our work extends the concept of structured light into the {\\gamma}-ray regime, offering new prospects for broad fields such as nuclear structure probing, fundamental symmetries tests, polarization-sensitive studies in extreme conditions, and laboratory astrophysical observations.",
    "authors": [
      "Yue Cao",
      "Kun Xue",
      "Si-Man Liu",
      "Zhong-Peng Li",
      "Li-Xiang Hu",
      "Xin-Yu Liu",
      "Zhen-Ke Dou",
      "Feng Wan",
      "Qian Zhao",
      "Tong-Pu Yu",
      "Jian-Xing Li"
    ],
    "published": "2025-08-22T08:44:55Z",
    "updated": "2025-08-22T08:44:55Z",
    "categories": [
      "physics.optics",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2508.16208v1",
    "url": "https://arxiv.org/abs/2508.16208v1",
    "pdf_url": "https://arxiv.org/pdf/2508.16208v1.pdf",
    "title": "Resonantly Driven Electron Bernstein Waves in Magnetized Low-Pressure   Capacitive Discharges",
    "abstract": "The physics of capacitively coupled plasma (CCP) discharges is investigated in a mildly magnetized regime, defined by $1 \\le f_{ce}/f_{rf} < 2$, where $f_{ce}$ and $f_{rf}$ denote the electron cyclotron frequency and the applied radio-frequency (RF), respectively. A distinctive feature of this regime is the excitation of electron Bernstein waves (EBWs) that propagate into the bulk plasma. As the applied magnetic field increases, notable changes in the discharge characteristics occur, with EBWs observed to propagate along the plasma density gradient inside the bulk. The underlying physics of CCP operation in this regime is analyzed in detail using particle-in-cell Monte Carlo collisions (PIC-MCC) simulations.",
    "authors": [
      "Deepak Gautam",
      "Sarveshwar Sharma",
      "Igor Kaganovich",
      "Bhooshan Paradkar"
    ],
    "published": "2025-08-22T08:28:56Z",
    "updated": "2025-08-22T08:28:56Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.16197v1",
    "url": "https://arxiv.org/abs/2508.16197v1",
    "pdf_url": "https://arxiv.org/pdf/2508.16197v1.pdf",
    "title": "On the nature and charge state of the X-Defect, a radiation-induced   Silicon defect with field-enhanced charge carrier emission",
    "abstract": "The elusive X-Defect, a defect found in low-resistivity $p$-type Silicon after irradiation, observed as a low-temperature shoulder of the $\\mathrm{B}_\\mathrm{i}\\mathrm{O}_\\mathrm{i}$ defect (Boron-interstitial-Oxygen-interstitial complex) in Thermally Stimulated Current (TSC) measurements, was investigated to determine its properties, matching them with those of a previously identified defect. Through a combination of TSC, Deep-Level Transient Spectroscopy (DLTS), Difference-DLTS (DDLTS), numerical simulations of field-enhanced charge carrier emissions in TSC measurements and a comparison to literature, the X-Defect was identified as the singly positively charged Silicon di-vacancy $\\mathrm{V}_2(+/0)$. This assignment is supported by an agreement in activation energy, capture cross-section, trap type and charge emission process, as well as simulations comparing the effects of phonon-assisted tunnelling (PAT) and Poole-Frenkel (PF) mechanisms on TSC spectra. DDTLS measurements revealed a quadratic dependence of the activation energy on the electric field strength, confirming PAT as the prevailing mechanism over PF in the case of the radiation-induced X-Defect. Assigning the X-Defect to an electrically neutral defect in the space charge region resolves previous contradictions regarding its deficiency in impacting on the effective doping concentration.",
    "authors": [
      "Niels Sorgenfrei",
      "Yana Gurimskaya",
      "Anja Himmerlich",
      "Michael Moll",
      "Ulrich Parzefall",
      "Ioana Pintilie",
      "Joern Schwandt"
    ],
    "published": "2025-08-22T08:15:29Z",
    "updated": "2025-08-22T08:15:29Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2508.13494v2",
    "url": "https://arxiv.org/abs/2508.13494v2",
    "pdf_url": "https://arxiv.org/pdf/2508.13494v2.pdf",
    "title": "A Monte Carlo simulation on the scattering coefficients of solar radio   wave propagation",
    "abstract": "Radio waves undergo scattering by small-scale density fluctuations during propagation through the solar-terrestrial environment, substantially affecting the observed characteristics of solar radio bursts. This scattering process can be effectively modeled as photon diffusion in phase space. In this study, we present a comprehensive comparison between the quasilinear diffusion coefficients and those calculated by ray-tracing the photon trajectories in numerically generated, broadband, isotropic density fluctuation fields in both two-dimensional (2D) and three-dimensional (3D) configurations. The comparative analysis demonstrates that for weak scattering, the simulated diffusion coefficients agree well with the quasilinear theoretical predictions. However, when the radio frequency approaches the electron plasma frequency and/or the density fluctuation amplitude becomes significant, photons experience strong scattering. Under such conditions, the quasilinear theory tends to underestimate the scattering strength of photons induced by 2D density fluctuations while overestimating the scattering strength in 3D cases. Furthermore, we implement a group velocity correction to the theoretical diffusion coefficients, based on the effective propagation speed averaged over all test photons. The corrected coefficients provide an accurate quantification of the scattering strength for radio waves propagating through 3D density fluctuations. The physical mechanisms underlying these phenomena are elucidated in the discussion.",
    "authors": [
      "Jiazhen Gan",
      "Chuanbing Wang"
    ],
    "published": "2025-08-19T04:04:18Z",
    "updated": "2025-08-22T03:26:00Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2508.16005v1",
    "url": "https://arxiv.org/abs/2508.16005v1",
    "pdf_url": "https://arxiv.org/pdf/2508.16005v1.pdf",
    "title": "Mapping the Photon Detection Efficiency of VUV Sensitive SiPMs from the   Ultra-Violet to the Near Infra-Red",
    "abstract": "We present a flexible analytic model describing the Photo-Detection Efficiency (PDE) for P-on-N silicon photomultipliers. This model can be used for device characterization, PDE extrapolation from limited data or design optimization. The model uses six device specific parameters to describe PDE for a large range of wavelengths, angles of incidence, voltages and temperatures. Refractive index data taken from literature are inputs to the model, which also allows the prediction of PDE for devices operated in dense media. We present the measurement of the absolute PDE from 350-830~nm at 163~K for two UV sensitive devices: Hamamatsu VUV4 and the Fondazione Bruno Kessler VUV-HD3. Additional measurements of relative PDE versus angle are performed. We successfully fit the model to the data and show its predictive power, extrapolating the PDE to new wavelengths and to operation in liquid argon and xenon. Lastly we investigate optimizing efficiency for specific applications in astroparticle physics and quantum computing.",
    "authors": [
      "Austin de St Croix",
      "Harry Lewis",
      "Kurtis Raymond",
      "Fabrice Retière",
      "Maia Henriksson-Ward",
      "Giacomo Gallina",
      "Nicholas Morrison",
      "Aileen Zhang"
    ],
    "published": "2025-08-21T23:44:27Z",
    "updated": "2025-08-21T23:44:27Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.15984v1",
    "url": "https://arxiv.org/abs/2508.15984v1",
    "pdf_url": "https://arxiv.org/pdf/2508.15984v1.pdf",
    "title": "QED cascade initiation via reflection of a multipetawatt laser pulse   from a self-organized parabolic plasma mirror",
    "abstract": "The self-sustained or avalanche-type cascade is an intriguing prediction of strong-field quantum electrodynamics (QED) that has yet to be observed in laboratories. It is accompanied by the conversion of electromagnetic energy into gamma photons and electron-positron ($e^-e^+$) pairs, whose number increases exponentially over time. We investigate a simple configuration to initiate a QED cascades: it is based on the superposition of an incident multipetawatt laser pulse and its reflection from a solid target. The incident laser pulse <<deforms>> the initially flat target surface, creating a parabolic mirror that focuses the reflected radiation. For the considered setup the threshold laser power is about $7\\,\\text{PW}$. With a $27\\,\\text{PW}$ laser pulse, positron production exhibits clear signatures of an avalanche-type cascade, including exponential growth and more than 15 positron generations with similar energy spectra. Therefore, observing an avalanche-type QED cascade does not require the use of multiple laser channels with precise spatio-temporal synchronization, as previously supposed.",
    "authors": [
      "M. A. Serebryakov",
      "E. N. Nerush",
      "L. Ji",
      "X. Geng",
      "I. Yu. Kostyukov"
    ],
    "published": "2025-08-21T21:59:13Z",
    "updated": "2025-08-21T21:59:13Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.15975v1",
    "url": "https://arxiv.org/abs/2508.15975v1",
    "pdf_url": "https://arxiv.org/pdf/2508.15975v1.pdf",
    "title": "Moderator Simulation for the Compact Positron Source at NLCTA",
    "abstract": "Positron moderation is a key part of the production of slow positrons. This paper examines G4beamline simulations of various moderator designs and the addition of a radiofrequency cavity to increase the efficiency of the moderator. A setup consisting of a 100 MeV electron beam incident on a 7 mm tungsten target, a 5 T adiabatic matching device, a 5-cell L-band RF cavity, and a single-crystal tungsten moderator leads to a 39.3x improvement in the number of positrons moderated over a common thin-foil polycrystalline moderator without the AMD and cavity. We also present a novel calculation method for determining the stopping distribution of low-energy positrons in a thin foil, modifying the Makhovian distribution with an exponential ramp to account for edge effects.",
    "authors": [
      "Ryland Goldman",
      "Sophie Crisp",
      "Spencer Gessner"
    ],
    "published": "2025-08-21T21:35:50Z",
    "updated": "2025-08-21T21:35:50Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.15963v1",
    "url": "https://arxiv.org/abs/2508.15963v1",
    "pdf_url": "https://arxiv.org/pdf/2508.15963v1.pdf",
    "title": "Advancing rail safety: An onboard measurement system of rolling stock   wheel flange wear based on dynamic machine learning algorithms",
    "abstract": "Rail and wheel interaction functionality is pivotal to the railway system safety, requiring accurate measurement systems for optimal safety monitoring operation. This paper introduces an innovative onboard measurement system for monitoring wheel flange wear depth, utilizing displacement and temperature sensors. Laboratory experiments are conducted to emulate wheel flange wear depth and surrounding temperature fluctuations in different periods of time. Employing collected data, the training of machine learning algorithms that are based on regression models, is dynamically automated. Further experimentation results, using standards procedures, validate the system's efficacy. To enhance accuracy, an infinite impulse response filter (IIR) that mitigates vehicle dynamics and sensor noise is designed. Filter parameters were computed based on specifications derived from a Fast Fourier Transform analysis of locomotive simulations and emulation experiments data. The results show that the dynamic machine learning algorithm effectively counter sensor nonlinear response to temperature effects, achieving an accuracy of 96.5 %, with a minimal runtime. The real-time noise reduction via IIR filter enhances the accuracy up to 98.2 %. Integrated with railway communication embedded systems such as Internet of Things devices, this advanced monitoring system offers unparalleled real-time insights into wheel flange wear and track irregular conditions that cause it, ensuring heightened safety and efficiency in railway systems operations.",
    "authors": [
      "Celestin Nkundineza",
      "James Ndodana Njaji",
      "Samrawit Abubeker",
      "Omar Gatera",
      "Damien Hanyurwimfura"
    ],
    "published": "2025-08-21T21:12:48Z",
    "updated": "2025-08-21T21:12:48Z",
    "categories": [
      "cs.LG",
      "cs.CE",
      "cs.SY",
      "eess.SP",
      "eess.SY",
      "physics.ins-det"
    ],
    "primary_category": "cs.LG",
    "doi": "10.1177/03611981251330887"
  },
  {
    "arxiv_id": "2507.03119v3",
    "url": "https://arxiv.org/abs/2507.03119v3",
    "pdf_url": "https://arxiv.org/pdf/2507.03119v3.pdf",
    "title": "Neural-Network solver of ideal MHD equilibria",
    "abstract": "We present a novel approach to compute three-dimensional Magnetohydrodynamic equilibria by parametrizing Fourier modes with artificial neural networks and compare it to equilibria computed by conventional solvers. The full nonlinear global force residual across the volume in real space is then minimized with first order optimizers. Already,we observe competitive computational cost to arrive at the same minimum residuals computed by existing codes. With increased computational cost,lower minima of the residual are achieved by the neural networks,establishing a new lower bound for the force residual. We use minimally complex neural networks,and we expect significant improvements for solving not only single equilibria with neural networks,but also for computing neural network models valid over continuous distributions of equilibria.",
    "authors": [
      "Timo Thun",
      "Andrea Merlo",
      "Rory Conlin",
      "Dario Panici",
      "Daniel Böckenhoff"
    ],
    "published": "2025-07-03T18:56:37Z",
    "updated": "2025-08-21T20:53:43Z",
    "categories": [
      "cs.LG",
      "cs.AI",
      "physics.plasm-ph"
    ],
    "primary_category": "cs.LG"
  },
  {
    "arxiv_id": "2508.15879v1",
    "url": "https://arxiv.org/abs/2508.15879v1",
    "pdf_url": "https://arxiv.org/pdf/2508.15879v1.pdf",
    "title": "On the hypothesis of a bi-isotropic plasma permeating the interstellar   space",
    "abstract": "In this work, we study the propagation of electromagnetic waves in a magnetized chiral plasma that pervades the interstellar space. The Maxwell equations, supplemented by bi-isotropic constitutive relations, are rewritten to describe a cold, uniform, and collisionless plasma model that yields new collective electromagnetic modes for distinct pairs of refractive indices associated with right- and left-handed circularly polarized waves. We have investigated the optical behavior through the rotatory power (RP) and dichroism coefficient, reporting that the finite chiral parameter induces double RP sign reversal, an exotic optical signature that takes place in chiral dielectrics and rotating plasmas. In the low-frequency regime, a modified propagating helicon with right-handed circular polarization is obtained. Next, supposing that the interstellar medium behaves as a bi-isotropic cold plasma, we employ Astrophysical data of radio pulsars to achieve upper limits on the magnetoelectric parameters magnitude. In particular, by using dispersion measure and rotation measure data from five pulsars, we constrain the magnitude of the chiral parameter to the order of $10^{-16}$ and $10^{-22}$, respectively.",
    "authors": [
      "Filipe S. Ribeiro",
      "Pedro D. S. Silva",
      "Rodolfo Casana",
      "Manoel M. Ferreira Jr"
    ],
    "published": "2025-08-21T14:38:46Z",
    "updated": "2025-08-21T14:38:46Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2508.15605v1",
    "url": "https://arxiv.org/abs/2508.15605v1",
    "pdf_url": "https://arxiv.org/pdf/2508.15605v1.pdf",
    "title": "Continuous coupling of electron beam to a thin dielectric slab waveguide   yields monochromatic Cherenkov diffraction radiation",
    "abstract": "A scheme for generation of monochromatic Cherenkov radiation in a thin dielectric layer is proposed. The electrons travel in vacuum parallel to a dielectric, exciting a single synchronous electromagnetic waveguide mode. The proposed scheme is studied quantitatively for near-infrared radiation in silicon induced by a 100-keV electron beam, using time-domain and frequency-domain numerical simulations, with material absorption and dispersion taken into account. This method of radiation generation can be scaled from ultraviolet to terahertz radiation by changing the thickness of the dielectric layer and choosing a material with low loss at the desired wavelength. Comparison with conventional Cherenkov Radiation and Cherenkov Diffraction Radiation is also presented.",
    "authors": [
      "Andrzej Szczepkowicz",
      "Po-Wei Kuo",
      "Yen-Cheh Huang"
    ],
    "published": "2025-08-21T14:30:16Z",
    "updated": "2025-08-21T14:30:16Z",
    "categories": [
      "physics.optics",
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2410.21162v2",
    "url": "https://arxiv.org/abs/2410.21162v2",
    "pdf_url": "https://arxiv.org/pdf/2410.21162v2.pdf",
    "title": "Phase space compression of a positive muon beam in two spatial   dimensions",
    "abstract": "We present the first demonstration of simultaneous phase space compression in two spatial dimensions of a positive muon beam, the first stage of the novel high-brightness muon beam under development by the muCool collaboration at the Paul Scherrer Institute. The keV-energy, sub-mm size beam would enable a factor 10$^5$ improvement in brightness for precision muSR, and atomic and particle physics measurements with positive muons. This compression is achieved within a cryogenic helium gas target with a strong density gradient, placed in a homogeneous magnetic field, under the influence of a complex electric field. In the next phase, the muon beam will be extracted into vacuum.",
    "authors": [
      "A. Antognini",
      "N. J. Ayres",
      "I. Belosevic",
      "V. Bondar",
      "A. Eggenberger",
      "M. Hildebrandt",
      "R. Iwai",
      "K. Kirch",
      "A. Knecht",
      "G. Lospalluto",
      "J. Nuber",
      "A. Papa",
      "M. Sakurai",
      "I. Solovyev",
      "D. Taqqu",
      "T. Yan"
    ],
    "published": "2024-10-28T16:03:41Z",
    "updated": "2025-08-21T14:17:17Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.15530v1",
    "url": "https://arxiv.org/abs/2508.15530v1",
    "pdf_url": "https://arxiv.org/pdf/2508.15530v1.pdf",
    "title": "Self-supervised physics-informed generative networks for phase retrieval   from a single X-ray hologram",
    "abstract": "X-ray phase contrast imaging significantly improves the visualization of structures with weak or uniform absorption, broadening its applications across a wide range of scientific disciplines. Propagation-based phase contrast is particularly suitable for time- or dose-critical in vivo/in situ/operando (tomography) experiments because it requires only a single intensity measurement. However, the phase information of the wave field is lost during the measurement and must be recovered. Conventional algebraic and iterative methods often rely on specific approximations or boundary conditions that may not be met by many samples or experimental setups. In addition, they require manual tuning of reconstruction parameters by experts, making them less adaptable for complex or variable conditions. Here we present a self-learning approach for solving the inverse problem of phase retrieval in the near-field regime of Fresnel theory using a single intensity measurement (hologram). A physics-informed generative adversarial network is employed to reconstruct both the phase and absorbance of the unpropagated wave field in the sample plane from a single hologram. Unlike most deep learning approaches for phase retrieval, our approach does not require paired, unpaired, or simulated training data. This significantly broadens the applicability of our approach, as acquiring or generating suitable training data remains a major challenge due to the wide variability in sample types and experimental configurations. The algorithm demonstrates robust and consistent performance across diverse imaging conditions and sample types, delivering quantitative, high-quality reconstructions for both simulated data and experimental datasets acquired at beamline P05 at PETRA III (DESY, Hamburg), operated by Helmholtz-Zentrum Hereon. Furthermore, it enables the simultaneous retrieval of both phase and absorption information.",
    "authors": [
      "Xiaogang Yang",
      "Dawit Hailu",
      "Vojtěch Kulvait",
      "Thomas Jentschke",
      "Silja Flenner",
      "Imke Greving",
      "Stuart I. Campbell",
      "Johannes Hagemann",
      "Christian G. Schroer",
      "Tak Ming Wong",
      "Julian Moosmann"
    ],
    "published": "2025-08-21T13:06:06Z",
    "updated": "2025-08-21T13:06:06Z",
    "categories": [
      "physics.optics",
      "cs.CV",
      "eess.IV",
      "physics.comp-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics",
    "doi": "10.1364/OE.569216"
  },
  {
    "arxiv_id": "2508.15513v1",
    "url": "https://arxiv.org/abs/2508.15513v1",
    "pdf_url": "https://arxiv.org/pdf/2508.15513v1.pdf",
    "title": "Modeling of Light Production in Inorganic Scintillators",
    "abstract": "In recent experiments, inorganic scintillators have been used to study the decays of exotic nuclei, providing an alternative to silicon detectors and enabling measurements that were previously impossible. However, proper use of these materials requires us to understand and quantify the scintillation process. In this work, we propose a framework based on that of Birks [Proc. Phys. Soc. A 64, 874] and Meyer and Murray [Phys. Rev. 128, 98] to model the light output of inorganic scintillators in response to beams of energetic heavy ions over a broad range of energies. Our model suggests that, for sufficiently heavy ions at high energies, the majority of the light output is associated with the creation of delta electrons, which are induced by the passage of the beam through the material. These delta electrons dramatically impact the response of detection systems when subject to ions with velocities typical of beams in modern fragmentation facilities. We test the accuracy of our model with data from Lutetium Yttrium Orthosilicate (LYSO:Ce), a common inorganic scintillator. We compare calculated light production and quenching factors with experimental data for heavy ions of varying mass and energy as well as make a quantitative estimate of the effects of delta rays on overall light output. The model presented herein will serve as a basic framework for further studies of scintillator response to heavy ions. Our results are crucial in planning future experiments where relativistic exotic nuclei are interacting with scintillator detectors.",
    "authors": [
      "B. Kreider",
      "I. Cox",
      "R. Grzywacz",
      "J. M. Allmond",
      "A. Augustyn",
      "N. Braukman",
      "P. Brionnet",
      "A. Esmaylzadeh",
      "J. Fischer",
      "N. Fukuda",
      "G. Garcia De Lorenzo",
      "S. Go",
      "S. Hanai",
      "D. Hoskins",
      "N. Imai",
      "T. T. King",
      "N. Kitamura",
      "K. Kolos",
      "A. Korgul",
      "C. Mazzocchi",
      "S. Nishimura",
      "K. Nishio",
      "V. Phong",
      "T. Ruland",
      "K. P. Rykaczewski",
      "A. Skruch",
      "Z. Y. Xu",
      "R. Yokoyama"
    ],
    "published": "2025-08-21T12:38:53Z",
    "updated": "2025-08-21T12:38:53Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.15465v1",
    "url": "https://arxiv.org/abs/2508.15465v1",
    "pdf_url": "https://arxiv.org/pdf/2508.15465v1.pdf",
    "title": "Direct Neutron Reactions in Storage Rings Utilizing a Supercompact   Cyclotron Neutron Target",
    "abstract": "We propose a new approach for a high-density free-neutron target, primarily aimed at nuclear astrophysics reaction studies in inverse kinematics with radioactive ions circulating in a storage ring. The target concept integrates four key subsystems: a neutron production source driven by a supercompact cyclotron utilizing $^9$Be($p,xn$) reactions, an optimized moderator/reflector assembly using either heavy-water or beryllium oxide with a graphite reflector shell to thermalize fast neutrons, a cryogenic liquid hydrogen moderator to maximize thermal neutron density in the interaction region, and beam pipe geometries that enable neutron-ion interactions while maintaining vacuum conditions for ion circulation. This integrated approach focuses on feasibility by incorporating readily available technology. Using a commercial supercompact cyclotron delivering 130 $\\mu$A, the design achieves thermal neutron areal densities of $\\sim3.4\\times10^{6}$ n/cm$^2$ for a proof-of-concept demonstrator at the CRYRING ion-storage ring at GSI. This autonomous accelerator-target assembly design enables deployment at both in-flight and ISOL facilities to exploit their complementary production yields.   Potential upgrades based on higher-energy and/or higher-current isochronous cyclotrons should enable an increase in areal density to $\\sim$10$^9$ n/cm$^2$. In combination with a customized low-energy storage ring and a radioactive ion-beam facility, the proposed solution could deliver luminosities above 10$^{23}$ cm$^{-2}$ s$^{-1}$, thereby enabling neutron capture measurements of $\\sim$mb cross sections within a few days of experiment. The proposed system represents a significant milestone towards enabling large neutron-capture surveys on exotic nuclei, thereby opening a new avenue for understanding the synthesis of heavy elements in our universe.",
    "authors": [
      "Ariel Tarifeño-Saldivia",
      "César Domingo-Pardo",
      "Iris Dillmann",
      "Yuri A. Litvinov"
    ],
    "published": "2025-08-21T11:37:07Z",
    "updated": "2025-08-21T11:37:07Z",
    "categories": [
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "nucl-ex"
  },
  {
    "arxiv_id": "2503.03012v2",
    "url": "https://arxiv.org/abs/2503.03012v2",
    "pdf_url": "https://arxiv.org/pdf/2503.03012v2.pdf",
    "title": "Impact of trace amounts of water on the stability of Micro-Pattern   Gaseous Detectors measured in Ar-CO$_2$ (90-10)",
    "abstract": "In this study, we investigate the influence of humidity on the performance of various non-resistive Micro Pattern Gaseous Detectors, such as GEM, Thick-GEM, and Micromegas, operated with \\ArCOtwo gas mixture. The water content is introduced in a range of \\SIrange[range-units=single]{0}{5000}{\\ppmV}. It is observed that the presence of increased humidity does not significantly degrade any of the studied performance criteria. On the contrary, our measurements suggest an improvement in discharge stability with increasing humidity levels at the highest gains and fields. No significant difference is observed at the lower gains, indicating that humidity helps to reduce the rate of spurious discharges related to electrode defects or charging-up of the insulating layers. We conclude that adding a small amount of water to the gas mixture may be beneficial for the stable operation of an MPGD.",
    "authors": [
      "H. Fribert",
      "L. Fabbietti",
      "P. Gasik",
      "B. Ulukutlu"
    ],
    "published": "2025-03-04T21:15:05Z",
    "updated": "2025-08-21T11:36:30Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1016/j.nima.2025.170912"
  },
  {
    "arxiv_id": "2508.15462v1",
    "url": "https://arxiv.org/abs/2508.15462v1",
    "pdf_url": "https://arxiv.org/pdf/2508.15462v1.pdf",
    "title": "THz emission from multiple ionized plasma",
    "abstract": "Studies employing nonlinear interactions of THz pulses are nowadays a promising scientific research field. To capture these phenomena, THz pulses with energy ranging from hundreds of \\muJ to the mJ level are necessary. However, techniques that provide pulses with such energy levels are still not widely established. Upscaling methods of laser-solid interaction is limited by the damage threshold of materials, while the mechanism of THz generation from high intensity laser-gas interactions is not fully understood yet. Here, we establish the photocurrent model of laser-driven plasma THz generation in the high-intensity regime by accounting for high-ionization states of the target gas. Our model shows excellent agreement with experimental observations, provides a clear explanation of phenomena in both spectral and temporal domains, and explains the high conversion efficiency from laser to THz. In the experiments, we achieved a generation of 0.2 mJ THz pulses, driven by a Ti:sapphire laser with a conversion efficiency exceeding 1 %.",
    "authors": [
      "Lucie Jurkovičová",
      "David Štok",
      "Caroline Juliano",
      "Matyáš Staněk",
      "Jaroslav Nejdl",
      "Ondřej Hort"
    ],
    "published": "2025-08-21T11:33:27Z",
    "updated": "2025-08-21T11:33:27Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  }
]