{
  "arxiv_id": "2507.11952v2",
  "url": "https://arxiv.org/abs/2507.11952v2",
  "pdf_url": "https://arxiv.org/pdf/2507.11952v2.pdf",
  "title": "Multi-directional investigations on quiet time suprathermal ions   measured by ASPEX-STEPS on-board Aditya L1",
  "abstract": "The origin, acceleration and anisotropy of suprathermal ions in the interplanetary medium during quiet periods have remained poorly understood issues in solar wind physics. To address these aspects, we derive the spectral indices for the quiet time suprathermal ions based on the measurements by the four directionally separated sensors that are part of the Supra-Thermal and Energetic Particle Spectrometer (STEPS) of Aditya Solar Wind Particle EXperiment (ASPEX) on-board Aditya L1 spacecraft. Three out of four STEPS sensors Parker Spiral (PS), Inter-Mediate (IM), Earth Pointing (EP) are in one plane (nearly aligned with the ecliptic plane) while the fourth sensor North Pointing (NP) is in a mutually orthogonal plane. The energy ranges covered by the PS, IM, EP and NP sensors are 0.36-1.32 MeV, 0.14-1.22 MeV, 0.39-1.33 MeV and 0.12-1.23 MeV respectively. The quiet intervals are identified during January November, 2024 and the derived spectral indices (differential directional flux versus energy) are found to be in the range of 2.0 for all directions in the time scale of a few days revealing isotropic nature of their distribution. Further analysis of elemental abundance ratios (3He/4He, Fe/O, and C/O) during the same quiet intervals obtained from the Ultra-Low Energy Isotope Spectrometer (ULEIS) on board the Advanced Composition Explorer (ACE) spacecraft suggests possible contributions from the leftover ions from the previous impulsive (Solar flares) and gradual events (CMEs) in the quiet time suprathermal ion pool.",
  "authors": [
    "Aakash Gupta",
    "Dibyendu Chakrabarty",
    "Santosh Vadawale",
    "Aveek Sarkar",
    "Bijoy Dalal",
    "Shiv Kumar Goyal",
    "Jacob Sebastian",
    "P. Janardhan",
    "Nandita Srivastava",
    "M. Shanmugam",
    "Neeraj Kumar Tiwari",
    "Aaditya Sarda",
    "Piyush Sharma",
    "Anil Bhardwaj",
    "Prashant Kumar",
    "Manan S. Shah",
    "Bhas Bapat",
    "Pranav R. Adhyaru",
    "Arpit R. Patel",
    "Hitesh Kumar Adalja",
    "Abhishek Kumar",
    "Tinkal Ladiya",
    "Sushil Kumar",
    "Nishant Singh",
    "Deepak Kumar Painkra",
    "Abhishek J. Verma",
    "Swaroop Banerjee",
    "K. P. Subramanian",
    "M. B. Dadhania"
  ],
  "published": "2025-07-16T06:38:52Z",
  "updated": "2025-10-01T06:42:38Z",
  "categories": [
    "physics.space-ph",
    "astro-ph.EP",
    "astro-ph.SR",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.space-ph"
}