{
  "arxiv_id": "2509.26390v2",
  "url": "https://arxiv.org/abs/2509.26390v2",
  "pdf_url": "https://arxiv.org/pdf/2509.26390v2.pdf",
  "title": "Precision measurement and modelling of the threshold-free 210Pb β   spectrum",
  "abstract": "Beta decay is a fundamental process that governs nuclear stability and serves as a sensitive probe of the weak interaction and possible physics beyond the Standard Model of particle physics. However, precise measurements of complete $\\beta$ decay spectra, particularly at low energies, remain experimentally and theoretically challenging. Here we report a high-precision, threshold-free measurement of the full $\\beta$ decay spectrum of 210Pb to excited states of 210Bi, using a transition-edge sensor (TES)-based micro-calorimeter. This approach enables the detection of $\\beta$ particle energies from 0 keV up to their endpoint by coincidence summing with subsequent de-excitation energy, thereby eliminating reconstruction artifacts near zero energy that have traditionally limited low-energy spectral accuracy. To our knowledge, this is the first complete, high-precision $\\beta$ decay spectrum from 0 keV. The data resolve theoretical uncertainties associated with the atomic quantum exchange (AQE) effect. An accompanying ab initio theoretical framework, incorporating atomic, leptonic, and nuclear components, predicts a statistically significant (7.2 {$\\sigma$}) enhancement in $\\beta$ emission probability near zero energy, in agreement with the measurement and in contrast to models that omit AQE corrections. These results provide a new benchmark for $\\beta$ decay theory at low energies, deepen our understanding of the weak interaction, and establish a critical foundation for searches for new physics, including dark matter interactions and precision studies of neutrinos.",
  "authors": [
    "Shuo Zhang",
    "Hao-Ran Liu",
    "Ke Han",
    "Xavier Mougeot",
    "Paul-Antoine Hervieux",
    "Tao Sun",
    "Wen-Tao Wu",
    "Robin Cantor",
    "Jing-Kai Xia",
    "Zhi Liu",
    "Jun-Cheng Liang",
    "Fu-You Fan",
    "Le Zhang",
    "Ming-Yu Ge",
    "Xiao-Peng Zhou",
    "Adrien Andoche"
  ],
  "published": "2025-09-30T15:25:13Z",
  "updated": "2025-10-01T04:52:36Z",
  "categories": [
    "nucl-ex",
    "nucl-th",
    "physics.ins-det"
  ],
  "primary_category": "nucl-ex"
}