[
  {
    "arxiv_id": "2510.00273v2",
    "url": "https://arxiv.org/abs/2510.00273v2",
    "pdf_url": "https://arxiv.org/pdf/2510.00273v2.pdf",
    "title": "Physical Thickness Characterization of the FRIB Production Targets",
    "abstract": "The FRIB heavy-ion accelerator, commissioned in 2022, is a leading facility   for producing rare isotope beams (RIBs) and exploring nuclei beyond the limits of stability.   These RIBs are produced via reactions between stable primary beams and a graphite target.   Approximately 20-40 \\% of the primary beam power is deposited in the target,   requiring efficient thermal dissipation.   Currently, FRIB operates with a primary beam power of up to 20 kW. To enhance thermal dissipation efficiency,   a single-slice rotating graphite target with a diameter of approximately 30 cm is employed.   The effective target region is a 1 cm-wide outer rim of the graphite disc.   To achieve high RIB production rates, the areal thickness variation must be constrained within 2 \\%.   This paper presents physical thickness characterizations of FRIB production targets with various nominal thicknesses,   measured using a custom-built non-contact thickness measurement apparatus.",
    "authors": [
      "D. J. Lee",
      "M. Reaume",
      "W. Franklin",
      "J. Song"
    ],
    "published": "2025-09-30T20:52:04Z",
    "updated": "2025-10-03T12:04:22Z",
    "categories": [
      "physics.acc-ph",
      "nucl-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.17934v2",
    "url": "https://arxiv.org/abs/2509.17934v2",
    "pdf_url": "https://arxiv.org/pdf/2509.17934v2.pdf",
    "title": "Superconducting Low-beta Nb$_3$Sn Cavity for ATLAS and Future Ion   Accelerators",
    "abstract": "We report on a Nb$_3$Sn-coated low-beta superconducting radio frequency (SRF) cavity intended for accelerating ions. We aim to apply the cavity in ATLAS, our Argonne National Laboratory user facility for nuclear physics studies with ion beams in the energy range of 5-20 MeV/u. The Nb$_3$Sn-coated cavity, a 145 MHz quarter-wave optimized for ions moving with velocity $\\beta$=v/c=0.08 exhibits an order-of-magnitude reduction in radiofrequency (RF) losses into helium at $4.4\\,\\mathrm{K}$ compared to a superconducting niobium (Nb) cavity at the same frequency and temperature. Experimentally measured fields are among the highest to date for any Nb$_3$Sn-coated cavity, reaching a peak surface magnetic field of 105 mT. We also present a practical solution to the problem of cavity frequency tuning. Tuning by mechanical deformation has been a challenge with Nb3Sn due to its brittle nature, however, using a set of techniques tailored to the properties of thin-film Nb$_3$Sn on Nb, we can repeatably tune the cavity to the ATLAS master clock frequency after it is cooled, while maintaining the excellent performance characteristics. The same Nb$_3$Sn cavity technology offers broad benefits for future ion accelerators.",
    "authors": [
      "T. Petersen",
      "G. Eremeev",
      "B. Tennis",
      "N. Tagdulang",
      "Y. Zhou",
      "M. Kedzie",
      "B. Guilfoyle",
      "Y. Xu",
      "S. V. Kutsaev",
      "R. Agustsson",
      "E. Spranza",
      "P. Davis",
      "G. P. Zinkann",
      "T. Reid",
      "S. Posen",
      "M. P. Kelly"
    ],
    "published": "2025-09-22T15:54:44Z",
    "updated": "2025-10-03T10:56:41Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.01819v2",
    "url": "https://arxiv.org/abs/2510.01819v2",
    "pdf_url": "https://arxiv.org/pdf/2510.01819v2.pdf",
    "title": "Three-Dimensional Niobium Coaxial Cavity with $\\sim0.1\\,$second Lifetime",
    "abstract": "We report on the internal quality factor of a three-dimensional niobium quarter-wave coaxial cavity, with mid-temperature annealing, exhibiting $Q_{\\rm int} \\gtrsim 3\\times10^9$ at the single-photon level below 20\\,mK, which corresponds to an internal photon lifetime of $\\tau_{\\rm int}\\sim90\\,\\mathrm{ms}$. Moreover, $Q_{\\rm int}$ of the mid-temperature annealed cavities remains almost unchanged even after several cooldown cycles and air exposure. These results suggest that stable low-loss niobium oxides might be formed by mid-temperature annealing on the surface of three-dimensional niobium cavity. This surface treatment could be applicable to the fabrication of 2D superconducting circuits and help improve the lifetime of Nb-based superconducting qubits.",
    "authors": [
      "Takaaki Takenaka",
      "Takayuki Kubo",
      "Imran Mahboob",
      "Kosuke Mizuno",
      "Hitoshi Inoue",
      "Takayuki Saeki",
      "Shiro Saito"
    ],
    "published": "2025-10-02T09:05:52Z",
    "updated": "2025-10-03T00:56:20Z",
    "categories": [
      "quant-ph",
      "cond-mat.supr-con",
      "physics.acc-ph"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2510.02301v1",
    "url": "https://arxiv.org/abs/2510.02301v1",
    "pdf_url": "https://arxiv.org/pdf/2510.02301v1.pdf",
    "title": "Relativistic Jets and Winds in Radio-Identified Supermassive Black Hole   Binary Candidates",
    "abstract": "Supermassive black hole binary systems (SMBHBs) are thought to emit the recently discovered nHz gravitational wave background; however, not a single individual nHz source has been confirmed to date. Long-term radio-monitoring at the Owens Valley Radio Observatory has revealed two potential SMBHB candidates: blazars PKS 2131-021 and PKS J0805-0111. These sources show periodic flux density variations across the electromagnetic spectrum, signaling the presence of a good clock. To explain the emission, we propose a generalizable jet model, where a mildly relativistic wind creates an outward-moving helical channel, along which the ultra-relativistic jet propagates. The observed flux variation from the jet is mostly due to aberration. The emission at lower frequency arises at larger radius and its variation is consequently delayed, as observed. Our model reproduces the main observable features of both sources and can be applied to other sources as they are discovered. We make predictions for radio polarization, direct imaging, and emission line variation, which can be tested with forthcoming observations. Our results motivate future numerical simulations of jetted SMBHB systems and have implications for the fueling, structure, and evolution of blazar jets.",
    "authors": [
      "Andrew G. Sullivan",
      "Roger D. Blandford",
      "Anna Synani",
      "Philipe V. de la Parra",
      "Noémie Globus",
      "Mitchell C. Begelman",
      "Anthony C. S. Readhead"
    ],
    "published": "2025-10-02T17:59:08Z",
    "updated": "2025-10-02T17:59:08Z",
    "categories": [
      "astro-ph.HE",
      "astro-ph.GA",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2510.02261v1",
    "url": "https://arxiv.org/abs/2510.02261v1",
    "pdf_url": "https://arxiv.org/pdf/2510.02261v1.pdf",
    "title": "Gas Electroluminescence in a Dual Phase Xenon-Doped Argon Detector",
    "abstract": "Noble element detectors using argon or xenon as the detection medium are widely used in the searches for rare neutrino and dark matter interactions. Xenon doping in liquid argon can preserve attractive properties of an argon target while enhancing the detectable signals with properties of xenon. In this work, we deployed a dual-phase liquid argon detector with up to 4% xenon doping in the liquid and studied its gas electroluminescence properties as a function of xenon concentration. At $\\sim$2% xenon doping in liquid argon, we measured $\\sim$34 ppm of xenon in the gas and observed $\\sim$2.5 times larger electroluminescence signals in the detector than those in pure argon. By analyzing signals recorded by photosensors of different wavelength sensitivities, we confirm that the argon gas electroluminescence process is strongly affected by the addition of xenon. We propose an analytical model to describe the underlying energy transfer mechanism in argon-xenon gas mixtures. Lastly, the implications of this measurement for low energy ionization signal detection will be discussed.",
    "authors": [
      "James W. Kingston",
      "Jianyang Qi",
      "Jingke Xu",
      "Ethan P. Bernard",
      "Adam D. Tidball",
      "Alec W. Peck",
      "Nathaniel S. Bowden",
      "Mani Tripathi",
      "Kaixuan Ni",
      "Shawn Westerdale"
    ],
    "published": "2025-10-02T17:42:42Z",
    "updated": "2025-10-02T17:42:42Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.02258v1",
    "url": "https://arxiv.org/abs/2510.02258v1",
    "pdf_url": "https://arxiv.org/pdf/2510.02258v1.pdf",
    "title": "Predicting the single-site and multi-site event discrimination power of   dual-phase time projection chambers",
    "abstract": "Dual-phase xenon time projection chambers (TPCs) are widely used in searches for rare dark matter and neutrino interactions, in part because of their excellent position reconstruction capability in 3D. Despite their millimeter-scale resolution along the charge drift axis, xenon TPCs face challenges in resolving single-site (SS) and multi-site (MS) interactions in the transverse plane. In this paper, we build a generic TPC model with an idealized light-based signal readout, and use Fisher Information (FI) to study its theoretical capability of differentiating SS and MS events. We also demonstrate via simulation that this limit can be approached with conventional reconstruction algorithms like maximum likelihood estimation, and with a convolutional neural network classifier. The implications of this study on future TPC experiments will be discussed.",
    "authors": [
      "A. B. M. R. Sazzad",
      "C. A. Hardy",
      "X. Dai",
      "J. Xu",
      "B. Lenardo",
      "F. Sutanto",
      "N. Antipa",
      "J. Koertzen",
      "P. John",
      "A. Akinin",
      "T. Pershing"
    ],
    "published": "2025-10-02T17:41:15Z",
    "updated": "2025-10-02T17:41:15Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2510.02088v1",
    "url": "https://arxiv.org/abs/2510.02088v1",
    "pdf_url": "https://arxiv.org/pdf/2510.02088v1.pdf",
    "title": "A neural network approach to kinetic Mie polarimetry for particle size   diagnostics in nanodusty plasmas",
    "abstract": "The analysis of the size of nanoparticles is an essential task in plasma technology and dusty plasmas. Light scattering techniques, based on Mie theory, can be used as a non-invasive and in-situ diagnostic tool for this purpose. However, the standard back-calculation methods require expertise from the user. To address this, we introduce a neural network that performs the same task. We discuss how we set up and trained the network to analyze the size of plasma-grown amorphous carbon nanoparticles (a:C-H) with a refractive index n in the range of real(n) = 1.4-2.2 and imag(n) = 0.04i-0.1i and a radius of up to several hundred nanometers, depending on the used wavelength. The diagnostic approach is kinetic, which means that the particles need to change in size due to growth or etching. An uncertainty analysis as well as a test with experimental data are presented. Our neural network achieves results that agree with those of prior fitting algorithms while offering higher methodical stability. The model also holds a major advantage in terms of computing speed and automation.",
    "authors": [
      "Alexander Schmitz",
      "Andreas Petersen",
      "Franko Greiner"
    ],
    "published": "2025-10-02T14:55:05Z",
    "updated": "2025-10-02T14:55:05Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1088/1361-6463/aceb71"
  },
  {
    "arxiv_id": "2510.02058v1",
    "url": "https://arxiv.org/abs/2510.02058v1",
    "pdf_url": "https://arxiv.org/pdf/2510.02058v1.pdf",
    "title": "Accurate Modelling of Intrabeam Scattering and its Impact on   Photoinjectors for Free-Electron Lasers",
    "abstract": "Intrabeam scattering (IBS) is a fundamental effect that can limit the performance of high-brightness electron machines, yet it has so far been neglected in standard modelling of RF photoinjectors. Recent measurements at SwissFEL reveal that the slice energy spread (SES) in the injector is significantly underestimated by conventional tracking codes. In this work, we present a dedicated Monte Carlo simulation model that accurately predicts the IBS-induced SES growth in the photoinjector of an X-ray free-electron laser. The simulations are benchmarked against SES measurements at the SwissFEL as well as theoretically supported by a new analytical model. The results demonstrate that IBS-induced SES growth occurs throughout the injector, most prominently in the electron source, and must be taken into account when assessing photoinjector performance. We further show that while the 5D brightness is largely conserved, the 6D brightness undergoes notable degradation with propagation, underscoring the need to include IBS in the accurate design and optimization of photoinjectors.",
    "authors": [
      "Thomas Geoffrey Lucas",
      "Paolo Craievich",
      "Eduard Prat",
      "Sven Reiche",
      "Erion Gjonaj"
    ],
    "published": "2025-10-02T14:26:39Z",
    "updated": "2025-10-02T14:26:39Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.02018v1",
    "url": "https://arxiv.org/abs/2510.02018v1",
    "pdf_url": "https://arxiv.org/pdf/2510.02018v1.pdf",
    "title": "An electro-optical bunch profile monitor for FCC-ee",
    "abstract": "The Future Circular Lepton Collider (FCC-ee) presents challenges for a longitudinal bunch profile monitor due to its wide range of bunch lengths and charge densities across its four distinct operational modes. For commissioning, monitoring the top-up injection, and energy calibration, the FCC-ee requires non-destructive, single-shot measurements of the bunch length and profile. This contribution proposes an in-vacuum electro-optical (EO) longitudinal bunch profile monitor for single-shot measurements at high repetition rates, building on the successful EO monitor at the Karlsruhe Research Accelerator (KARA) at the Karlsruhe Institute of Technology. A novel single-pass conceptual design for the in-vacuum holder of the electro-optical crystal is presented, utilizing prisms instead of a mirror to guide the laser through the crystal, which additionally allows measurements of the long bunches foreseen for FCC-ee operation mode at the Z-pole energy. A first prototype has been constructed and tested at the in-air test stand of the CERN Linear Electron Accelerator for Research (CLEAR). Results from the prototype tests are presented, demonstrating the proof of principle for the single-pass prism-based EO monitor design for FCC-ee.",
    "authors": [
      "M. Reissig",
      "E. Bründermann",
      "S. Funkner",
      "L. L. Grimm",
      "B. Härer",
      "G. Niehues",
      "J. L. Steinmann",
      "A. -S. Müller",
      "R. Corsini",
      "A. Gilardi",
      "S. Mazzoni",
      "C. Pakuza",
      "A. Schloegelhofer",
      "T. Lefevre",
      "P. Korysko"
    ],
    "published": "2025-10-02T13:45:29Z",
    "updated": "2025-10-02T13:45:29Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.01981v1",
    "url": "https://arxiv.org/abs/2510.01981v1",
    "pdf_url": "https://arxiv.org/pdf/2510.01981v1.pdf",
    "title": "The Application of VMM3A Readout for Multi-Grid Neutron Detectors",
    "abstract": "The T-REX neutron spectrometer at the European Spallation Source will use Multi-Grid Technology, which is a voxelised proportional counter relying on\\mathrm{^{10}B_{4}C} coatings to detect the scattered neutrons. Measurements of the position dependence of pulse-height and relative detection efficiency of a Multi-Grid prototype of the T-REX spectrometer are presented for two different schemes of signal-processing electronics based on the VMM3A ASIC and CREMAT technology. These measurements, intended to test the suitability of VMM3A for readout of the T-REX Multi-Grid, are compared with Monte Carlo simulations based on the Garfield++ and Geant4 tool kits.",
    "authors": [
      "A. Backis",
      "F. Piscitelli",
      "D. Pfeiffer",
      "J. R. M. Annand",
      "M. Aouane",
      "K. G. Fissum",
      "K. Livingston",
      "G. Mauri",
      "D. Raspino"
    ],
    "published": "2025-10-02T12:56:22Z",
    "updated": "2025-10-02T12:56:22Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.01977v1",
    "url": "https://arxiv.org/abs/2510.01977v1",
    "pdf_url": "https://arxiv.org/pdf/2510.01977v1.pdf",
    "title": "Accelerating kinetic plasma simulations with machine learning generated   initial conditions",
    "abstract": "Computer aided engineering of multi-time-scale plasma systems which exhibit a quasi-steady state solution are challenging due to the large number of time steps required to reach convergence. Machine learning techniques combined with traditional first-principles simulations and high-performance computing offer many interesting pathways towards resolving this challenge. We consider acceleration of kinetic plasma simulations via machine learning generated initial conditions. The approach is demonstrated through modeling of capacitively coupled plasma discharges relevant to the microelectronics industry. Three models are trained on simulations across a parameter space of device driving frequency and operating pressure. The models incorporate elements of a multi-layer perceptron, principal component analysis, and convolutional neural networks to predict the final time-averaged profiles of ion-density and velocity distribution functions. These data-driven initial condition generators (ICGs) provide a mean speedup of 17.1x in convergence time, when measured using an offline procedure, or a 4.4x speedup with an online procedure, with convolutional neural networks leading to the best performance. The paper also outlines a workflow for continuous data-driven model improvement and simulation speedup, with the aim of generating sufficient data for full device digital twins.",
    "authors": [
      "Andrew T. Powis",
      "Domenica Corona Rivera",
      "Alexander Khrabry",
      "Igor D. Kaganovich"
    ],
    "published": "2025-10-02T12:53:26Z",
    "updated": "2025-10-02T12:53:26Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.01957v1",
    "url": "https://arxiv.org/abs/2510.01957v1",
    "pdf_url": "https://arxiv.org/pdf/2510.01957v1.pdf",
    "title": "Numerical tests of formulae for volume enclosed by flux surfaces of   integrable magnetic fields",
    "abstract": "Numerical tests of volume formulae are presented to compute efficiently the volume enclosed between flux surfaces for integrable 3D vector fields with various degrees of symmetry. In the process, a new case is proposed and tested.",
    "authors": [
      "David Martinez-del-Rio",
      "Robert S. MacKay"
    ],
    "published": "2025-10-02T12:24:41Z",
    "updated": "2025-10-02T12:24:41Z",
    "categories": [
      "math.DS",
      "physics.plasm-ph"
    ],
    "primary_category": "math.DS"
  },
  {
    "arxiv_id": "2510.01913v1",
    "url": "https://arxiv.org/abs/2510.01913v1",
    "pdf_url": "https://arxiv.org/pdf/2510.01913v1.pdf",
    "title": "Dark characterization of Ti/Al LEKIDs for the search of axions in the   W-band",
    "abstract": "We report the electrical (dark) characterization of lumped-element kinetic inductance detectors (LEKIDs) fabricated from a Titanium/Aluminum bilayer and designed for broadband absorption in the W-band (75-110 GHz). These detectors are prototypes for future QCD axion search experiments within the Canfranc Axion Detection Experiment (CADEx), which demand sub 1e-19 W/Hz^0.5 sensitivities under low optical backgrounds. We combine a Mattis-Bardeen analysis to the temperature dependence of the detector parameters with noise spectroscopy to determine the electrical noise equivalent power (NEP). The minimum measured value for the electrical NEP is 3e-19 W/Hz0.5. Across the measured temperature range, we find that quasiparticle lifetime deviates from the expected BCS recombination law. Our analysis suggests that non-equilibrium relaxation is governed by spatial inhomogeneities in the superconducting gap and phonon diffusion effects. This work sets the road-map to achieve suitable and ultra-sensitive detectors in the W-band for dark matter axion search experiments.",
    "authors": [
      "Victor Rollano",
      "Alejandro Pascual Laguna",
      "David Rodriguez",
      "Martino Calvo",
      "Maria Teresa Magaz",
      "Daniel Granados",
      "Alessandro Monfardini",
      "Alicia Gomez"
    ],
    "published": "2025-10-02T11:32:43Z",
    "updated": "2025-10-02T11:32:43Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.01882v1",
    "url": "https://arxiv.org/abs/2510.01882v1",
    "pdf_url": "https://arxiv.org/pdf/2510.01882v1.pdf",
    "title": "Cross-Polarization Reduction in Kinetic Inductance Detectors Based on   Quasi-Lumped Resonators",
    "abstract": "Kinetic Inductance Detectors (KIDs) have emerged as a leading technology for millimeter- and submillimeter-wave astronomy due to their high sensitivity, natural multiplexing capabilities and scalable fabrication. In polarization-sensitive applications-such as Cosmic Microwave Background (CMB) studies-cross-polarization, or unintended response to the orthogonal polarization, poses a significant limitation to measurement fidelity. This work investigates the origin of cross-polarization in meandered Lumped Element KIDs (LEKIDs), with particular emphasis on the role of parasitic currents in the interdigitated capacitor. A comparative study between conventional LEKIDs and a quasi-lumped resonator design is presented, demonstrating that removing the capacitive element may improve cross-polarization discrimination, confirming the capacitor's contribution to polarization leakage.",
    "authors": [
      "Victor Rollano",
      "Martino Calvo",
      "Alejandro Pascual Laguna",
      "David Rodriguez",
      "Maria Teresa Magaz",
      "Beatriz Aja",
      "Luisa de la Fuente",
      "Daniel Granados",
      "Alessandro Monfardini",
      "Alicia Gomez"
    ],
    "published": "2025-10-02T10:48:04Z",
    "updated": "2025-10-02T10:48:04Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2510.01875v1",
    "url": "https://arxiv.org/abs/2510.01875v1",
    "pdf_url": "https://arxiv.org/pdf/2510.01875v1.pdf",
    "title": "Enhancing the Efficiency of Time-Dependent Density Functional Theory   Calculations of Dynamic Response Properties",
    "abstract": "X-ray Thomson scattering (XRTS) constitutes an essential technique for diagnosing material properties under extreme conditions, such as high pressures and intense laser heating. Time-dependent density functional theory (TDDFT) is one of the most accurate available ab initio methods for modeling XRTS spectra, as well as a host of other dynamic material properties. However, strong thermal excitations, along with the need to account for variations in temperature and density as well as the finite size of the detector significantly increase the computational cost of TDDFT simulations compared to ambient conditions. In this work, we present a broadly applicable method for optimizing and enhancing the efficiency of TDDFT calculations. Our approach is based on a one-to-one mapping between the dynamic structure factor and the imaginary time density--density correlation function, which naturally emerges in Feynman's path integral formulation of quantum many-body theory. Specifically, we combine rigorous convergence tests in the imaginary time domain with a constraints-based noise attenuation technique to improve the efficiency of TDDFT modeling without the introduction of any significant bias. As a result, we can report a speed-up by up to an order of magnitude, thus potentially saving millions of CPU hours for modeling a single XRTS measurement of matter under extreme conditions.",
    "authors": [
      "Zhandos A. Moldabekov",
      "Sebastian Schwalbe",
      "Uwe Hernandez Acosta",
      "Thomas Gawne",
      "Jan Vorberger",
      "Michele Pavanello",
      "Tobias Dornheim"
    ],
    "published": "2025-10-02T10:31:46Z",
    "updated": "2025-10-02T10:31:46Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.chem-ph",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2510.01866v1",
    "url": "https://arxiv.org/abs/2510.01866v1",
    "pdf_url": "https://arxiv.org/pdf/2510.01866v1.pdf",
    "title": "In Situ Observation of Proton-Induced DNA Fragmentation in the Bragg   Peak: Evidence for a Protective Role of Water",
    "abstract": "We report in situ single-molecule measurements of proton-induced double-strand breaks (DSBs) in DNA immersed in water, using real-time fluorescence tracking along the entire proton path, including the Bragg peak region. By chemically suppressing radical-mediated processes, we isolate direct DNA damage mechanisms and determine DSB cross sections as a function of depth. Near the Bragg peak, we observe a tenfold reduction in DSB cross sections in aqueous DNA compared to dry DNA, providing quantitative evidence for the protective role of water. These findings highlight the importance of intermolecular energy dissipation in mitigating radiation-induced damage in condensed biological matter, with implications for radiobiology and proton therapy modeling.",
    "authors": [
      "R. Liénard",
      "P. Barberet",
      "K. Chatzipapas",
      "G. Devès",
      "T. Dhôte",
      "T. Guérin",
      "H. Seznec",
      "F. Gobet"
    ],
    "published": "2025-10-02T10:17:46Z",
    "updated": "2025-10-02T10:17:46Z",
    "categories": [
      "physics.bio-ph",
      "cond-mat.soft",
      "physics.ins-det",
      "physics.med-ph"
    ],
    "primary_category": "physics.bio-ph",
    "doi": "10.1103/t6st-wwyt"
  },
  {
    "arxiv_id": "2510.01851v1",
    "url": "https://arxiv.org/abs/2510.01851v1",
    "pdf_url": "https://arxiv.org/pdf/2510.01851v1.pdf",
    "title": "Machine Learning for Event Reconstruction in the CMS Phase-2 High   Granularity Calorimeter Endcap",
    "abstract": "The high-luminosity era of the LHC will offer greatly increased number of events for more precise Standard Model measurements and Beyond Standard Model searches, but will also pose unprecedented challenges to the detectors. To meet these challenges, the CMS detector will undergo several upgrades, including the replacement of the current endcap calorimeters with a novel High-Granularity Calorimeter (HGCAL). To make optimal use of this innovative detector, new and original algorithms are being devised. A dedicated reconstruction framework, The Iterative Clustering (TICL), is being developed within the CMS Software (CMSSW). This new framework is designed to fully exploit the high spatial resolution and precise timing information provided by HGCAL. Several key ingredients of the object reconstruction chain already rely on Machine Learning (ML) techniques and their usage is expected to further develop in the future. The existing reconstruction strategies will be presented stressing the role played by ML techniques to exploit the information provided by the detector. The areas where ML techniques are expected to play a role in the future developments will be also discussed.",
    "authors": [
      "Théo Cuisset"
    ],
    "published": "2025-10-02T09:51:02Z",
    "updated": "2025-10-02T09:51:02Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2510.01834v1",
    "url": "https://arxiv.org/abs/2510.01834v1",
    "pdf_url": "https://arxiv.org/pdf/2510.01834v1.pdf",
    "title": "BabyMOSS stitched sensors: results of characterisation tests for ALICE   ITS3 upgrade",
    "abstract": "During the Long Shutdown 3 (LS3, scheduled 2026-2030), the innermost 3 layers (Inner Barrel, or IB) of the present ALICE ITS2 will be replaced with large-area, flexible, stitched CMOS 65 nm sensors, arranged in 2 half-barrels of 3 half-layers each, in the framework of the ITS3 upgrade project. For the first time in a High Energy Physics experiment, such large-scale sensors will be bent into truly half-cylindrical shaped half-layers, requiring little mechanical support. This will also help lower the material budget: a reduction down to an average of 0.09% X$_{0}$ per layer is expected, benefitting ITS tracking and vertexing capabilities especially at low momenta.   In the wafer yield and stitching assessment stage for ITS3 R&D, test devices from the Engineering Run 1 (ER1) submission were developed, including the MOnolithic Stiched Sensors (MOSS) and smaller variants of them (babyMOSS). In particular, babyMOSS is a single Repeated Sensor Unit (RSU) of a MOSS device: the chip is $\\sim14\\times30$ mm$^{2}$ in size, and consists of 8 digitally read out pixel matrices (regions) arranged in 2 rows, i.e. half-units (HUs).   BabyMOSS chip characterisation tests have been performed in laboratory and test beam environments. Laboratory tests include systematic functional scans to study the behaviour of front-end electronics over a range of different settings, whereas test beam measurements, under high-energy charged particle beams, were used to investigate the detection efficiency and spatial resolution.   In this contribution, we will present the babyMOSS chip characterisation campaign, with a focus on recent test beam results. So far, babyMOSS test beam results have been consistent with full MOSS, and confirmed that babyMOSS devices meet the ITS3 requirements: a detection efficiency $>99\\%$, fake hit rate $<10^{-6}$ hits per pixel and event, and a spatial resolution $<6$ $\\mu$m.",
    "authors": [
      "Alessandro Sturniolo"
    ],
    "published": "2025-10-02T09:30:11Z",
    "updated": "2025-10-02T09:30:11Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.13128v3",
    "url": "https://arxiv.org/abs/2507.13128v3",
    "pdf_url": "https://arxiv.org/pdf/2507.13128v3.pdf",
    "title": "Phase noise measurement of semiconductor optical amplifiers",
    "abstract": "We introduce a novel measurement method for the phase noise measurement of optical amplifiers, topologically similar to the Heterodyne Mach-Zehnder Interferometer but governed by different principles, and we report on the measurement of a fibered amplifier at 1.55 $\\mu\\mathrm{m}$ wavelength. The amplifier under test (DUT) is inserted in one arm of a symmetrical Mach-Zehnder interferometer, with an AOM in the other arm. We measure the phase noise of the RF beat detected at the Mach-Zehnder output. The phase noise floor of the amplifier decreases proportionally to the reciprocal of the laser power at the amplifier input, down to $-125$ $\\mathrm{dBrad^2/Hz}$ at $f=100$ $\\mathrm{kHz}$. The DUT flicker noise cannot be measured because it is lower than the background of the setup. This sets an upper bound of the amplifier noise at $-32$ $\\mathrm{dBrad^2/Hz}$ at $f=1$ $\\mathrm{Hz}$, which corresponds to a frequency stability of $5.2{\\times}10^{-17}/\\tau$ (Allan deviation), where $\\tau$ is the integration time. Such noise level is lower than that of most Fabry-Perot cavity-stabilized lasers. These results are of interest in a wide range of applications including metrology, instrumentation, optical communications, or fiber links.",
    "authors": [
      "Damien Teyssieux",
      "Martin Callejo",
      "Jacques Millo",
      "Enrico Rubiola",
      "Rodolphe Boudot"
    ],
    "published": "2025-07-17T13:45:56Z",
    "updated": "2025-10-02T09:11:14Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2510.00388v2",
    "url": "https://arxiv.org/abs/2510.00388v2",
    "pdf_url": "https://arxiv.org/pdf/2510.00388v2.pdf",
    "title": "A study of the electronic and ionic structure, for co-existing states of   fully and partially ionized hydrogen, using the neutral pseudo-atom method as   well as a classical map for the electron subsystem",
    "abstract": "Prof. Michael Bonitz and his collaborators have made seminal contributions to the study of the uniform electron fluid and the electron-proton fluid, viz., hydrogen, in using {\\it ab initio} simulations. These studies provide essential inputs to astrophysics as well as high-energy density physics. This is reflected in the contributions to this festshrift in his honour. The electron-proton system becomes particularly difficult for theoretical modeling when the temperature becomes comparable to the Fermi energy $E_F$, when the warm-dense matter (WDM) state of hydrogen is reached. In this study we briefly review the theoretical methods available for the study of WDM systems, and use the neutral-pseudo atom (NPA) method, and a classical map for quantum electrons to study fully and partially ionized hydrogen. It is shown that {\\it both} fully and partially ionized states can independently exist at the {\\it same density and temperature} in many cases. Recent studies using path-integral Monte Carlo methods, and $N$-atom Density Functional Theory (DFT) simulations have provided essential structure data including the electron-electron structure factor $S_{ee}(k)$ that enters into interpretation of X-ray Thomson scattering and other diagnostics. We show that these structure data can be rapidly and inexpensively evaluated, with sufficient accuracy, using classical-map schemes for fully ionized plasmas, and more generally, using one-atom (average-atom) DFT methods for partially ionized systems.",
    "authors": [
      "M. W. C. Dharma-wardana"
    ],
    "published": "2025-10-01T01:00:54Z",
    "updated": "2025-10-02T05:23:20Z",
    "categories": [
      "physics.plasm-ph",
      "cond-mat.stat-mech"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2412.05361v2",
    "url": "https://arxiv.org/abs/2412.05361v2",
    "pdf_url": "https://arxiv.org/pdf/2412.05361v2.pdf",
    "title": "Photonic crystal cavities based on suspended yttrium iron garnet   nanobeams",
    "abstract": "We report the fabrication and optical characterization of an air-suspended photonic crystal nanobeam cavity in yttrium-iron-garnet (YIG) realized by focused-ion-beam milling. YIG's combination of low optical loss and ferrimagnetism makes it highly attractive for quantum technologies, yet prior work has largely been focused on millimeter-scale spheres and simple microstructures, hindering true on-chip integration. Demonstrating nanometer-scale patterning in a suspended geometry therefore represents an important advance. Finite-element simulations predict that the same structure supports a flapping-type mechanical mode at $\\Omega / 2\\pi \\approx 1.52 \\,\\text{GHz}$ and a backward-volume spin-wave mode at $\\Omega / 2\\pi = 11.59 \\,\\text{GHz}$ under an in-plane bias field. Although we measure only the photonic resonance (intrinsic $Q \\sim 2 \\times 10^{3}$) in this study, the device lays the groundwork for future exploration of coupled photon-phonon-magnon dynamics once higher optical quality factors are achieved.",
    "authors": [
      "Alireza Rashedi",
      "Mehri Ebrahimi",
      "Yunhu Huang",
      "Matt J. Rudd",
      "V. A. S. V. Bittencourt",
      "John P. Davis"
    ],
    "published": "2024-12-06T19:00:02Z",
    "updated": "2025-10-02T03:49:47Z",
    "categories": [
      "physics.app-ph",
      "cond-mat.mes-hall",
      "physics.ins-det",
      "physics.optics",
      "quant-ph"
    ],
    "primary_category": "physics.app-ph"
  },
  {
    "arxiv_id": "2510.01573v1",
    "url": "https://arxiv.org/abs/2510.01573v1",
    "pdf_url": "https://arxiv.org/pdf/2510.01573v1.pdf",
    "title": "Suppression of inverse magnetic energy transfer in collisionless   marginally magnetized plasmas",
    "abstract": "We investigate the inverse cascade of magnetic energy in decaying, collisionless plasmas with moderate to high-$\\beta$ values via first-principles numerical simulations and analytical theory. We find that pressure-anisotropy-driven instabilities, in particular the firehose instability, suppress reconnection-driven coalescence of magnetic structures (i.e., inverse transfer) by nullifying magnetic tension. This suppression leaves such structures elongated and confined to scales comparable to the Larmor radius of the particles. The presence of a magnetic guide field of sufficient strength, or a greater scale separation between the initial size of the magnetic structures and the Larmor radius, restores the system's ability to inverse transfer magnetic energy. These results reveal that inverse energy transfer in collisionless plasmas is not guaranteed, but instead sensitively depends on magnetization. In the astrophysical context, this identifies a kinetic mechanism by which Weibel-generated seed fields may fail to merge consistently, potentially limiting their role in cosmic magnetogenesis.",
    "authors": [
      "Zhuo Liu",
      "Muni Zhou",
      "Nuno F. G. Loureiro"
    ],
    "published": "2025-10-02T01:43:53Z",
    "updated": "2025-10-02T01:43:53Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.01463v1",
    "url": "https://arxiv.org/abs/2510.01463v1",
    "pdf_url": "https://arxiv.org/pdf/2510.01463v1.pdf",
    "title": "Noise Modeling and Calibration of a Two-Stage Cryogenic Charge Amplifier   for the SPLENDOR Experiment",
    "abstract": "The SPLENDOR Collaboration studies novel narrow-gap semiconductors and engineered a substrate agnostic detector platform to achieve $\\mathcal{O}$(meV) energy sensitivity designed for low mass dark matter searches. This was achieved using low-capacitance and low-noise commercial CryoHEMTs in a split-stage topology integrated throughout a dilution refrigerator. Designed with a source-follower HEMT at the base temperature stage and a voltage amplifier at 4\\,K, this amplifier has input-limited voltage noise of 10 $\\text{nV}/\\sqrt{\\text{Hz}}$ and current noise of 100 $\\text{aA}/\\sqrt{\\text{Hz}}$ at 1kHz. In agreement with this noise level and a photon calibration, this amplifier has a $\\text{19} \\pm \\text{4} $ electron resolution.",
    "authors": [
      "Jadyn Anczarski",
      "Owen Andrews",
      "Taylor Aralis",
      "Caleb Fink",
      "Noah Kurinsky",
      "Arran Phipps",
      "Aditi Pradeep",
      "Betty A. Young"
    ],
    "published": "2025-10-01T21:09:01Z",
    "updated": "2025-10-01T21:09:01Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2506.13665v2",
    "url": "https://arxiv.org/abs/2506.13665v2",
    "pdf_url": "https://arxiv.org/pdf/2506.13665v2.pdf",
    "title": "Impact of embedded $^{163}$Ho on the performance of the transition-edge   sensor microcalorimeters of the HOLMES experiment",
    "abstract": "We present a detailed investigation of the performance of transition-edge sensor (TES) microcalorimeters with $^{163}$Ho atoms embedded by ion implantation, as part of the HOLMES experiment aimed at neutrino mass determination. The inclusion of $^{163}$Ho atoms introduces an excess heat capacity due to a pronounced Schottky anomaly, which can affect the detector's energy resolution, signal height, and response time. We fabricated TES arrays with varying levels of $^{163}$Ho activity and characterized their performance in terms of energy resolution, decay time constants, and heat capacity. The intrinsic energy resolution was found to degrade with increasing $^{163}$Ho activity, consistent with the expected scaling of heat capacity. From the analysis, we determined the specific heat capacity of $^{163}$Ho to be $(2.9 \\pm 0.4 \\mathrm{(stat)} \\pm 0.7 \\mathrm{(sys)})$ J/K/mol at $(94 \\pm 1)$\\,mK, close to the literature values for metallic holmium. No additional long decay time constants correlated with $^{163}$Ho activity were observed, indicating that the excess heat capacity does not introduce weakly coupled thermodynamic systems. These results suggest that our present TES microcalorimeters can tolerate $^{163}$Ho activities up to approximately 5 Bq without significant performance degradation. For higher activities, reducing the TES transition temperature is necessary to maintain energy resolution. These findings provide critical insights for optimizing TES microcalorimeters for future neutrino mass experiments and other applications requiring embedded radioactive sources. The study also highlights the robustness of TES technology in handling implanted radionuclides while maintaining high-resolution performance.",
    "authors": [
      "Douglas Bennett",
      "Matteo Borghesi",
      "Pietro Campana",
      "Rodolfo Carobene",
      "Giancarlo Ceruti",
      "Matteo De Gerone",
      "Marco Faverzani",
      "Lorenzo Ferrari Barusso",
      "Elena Ferri",
      "Joseph Fowler",
      "Sara Gamba",
      "Flavio Gatti",
      "Andrea Giachero",
      "Marco Gobbo",
      "Danilo Labranca",
      "Roberto Moretti",
      "Angelo Nucciotti",
      "Luca Origo",
      "Stefano Ragazzi",
      "Dan Schmidt",
      "Daniel Swetz",
      "Joel Ullom"
    ],
    "published": "2025-06-16T16:23:18Z",
    "updated": "2025-10-01T20:54:24Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1140/epjc/s10052-025-14814-6"
  },
  {
    "arxiv_id": "2510.01417v1",
    "url": "https://arxiv.org/abs/2510.01417v1",
    "pdf_url": "https://arxiv.org/pdf/2510.01417v1.pdf",
    "title": "A Drone-mounted Magnetometer System for Automatic Interference Removal   and Landmine Detection",
    "abstract": "Landmines have been extensively used in conflict zones as an indiscriminate weapon to control military movements, often remaining active long after hostilities have ended. Their presence poses a persistent danger to civilians, hindering post-war recovery efforts, causing injuries or death, and restricting access to essential land for agriculture and infrastructure. Unmanned aerial vehicles (UAV) equipped with magnetometers are commonly used to detect remnant hidden landmines but come with significant technical challenges due to magnetic field interference from UAV electronics such as motors. We propose the use of a frame-mounted UAV-borne two-magnetometer payload to perform a two-step automated interference removal and landmine detection analysis. The first step removes interference via the Wavelet-Adaptive Interference Cancellation for Underdetermined Platform (WAIC-UP) method designed for spaceflight magnetometers. The second method uses the Rapid Unsupervised Detection of Events (RUDE) algorithm to detect landmine signatures. This two-step WAIC-UP/RUDE approach with multiple magnetometers achieves high-fidelity ordinance detection at a low computational cost and simplifies the design of magnetic survey payloads. We validate the method through a Monte Carlo simulation of randomized landmine placements in a 10 x 10 m square grid and drone motor interference. Additionally, we assess the efficacy of the algorithm by varying the drone's altitude, examining its performance at different heights above the ground.",
    "authors": [
      "Alex Paul Hoffmann",
      "Matthew G. Finley",
      "Eftyhia Zesta",
      "Mark B. Moldwin",
      "Lauro V. Ojeda"
    ],
    "published": "2025-10-01T19:54:17Z",
    "updated": "2025-10-01T19:54:17Z",
    "categories": [
      "eess.SP",
      "physics.ins-det"
    ],
    "primary_category": "eess.SP"
  },
  {
    "arxiv_id": "2510.01177v1",
    "url": "https://arxiv.org/abs/2510.01177v1",
    "pdf_url": "https://arxiv.org/pdf/2510.01177v1.pdf",
    "title": "Vanishing Acts: Quantifying Black Hole Formation with the DSNB Signal",
    "abstract": "The diffuse supernova neutrino background (DSNB) created by stellar core-collapses throughout cosmic history is on the verge of discovery, with SK-Gd showing early deviations from the background expectation and JUNO starting to take data. However, the interpretation of early DSNB data will face significant challenges due to degeneracies between astrophysical parameters and uncertainties in supernova neutrino modeling. We explore how complementary astronomical observations can break these degeneracies and, in this context, we investigate whether early DSNB observations can constrain invisible supernovae, which have no optical emission but are powerful neutrino sources before being swallowed by a forming black hole. Leveraging the differences in the spectra between invisible and visible supernovae, we estimate the sensitivity of 1) detecting the existence of invisible supernovae, and 2) determining the fraction of invisible supernovae. Finally, we discuss how these conclusions depend on the spectral parameters of the black hole-forming component.",
    "authors": [
      "Tim Charissé",
      "David Maksimović",
      "George A. Parker",
      "Michael Wurm"
    ],
    "published": "2025-10-01T17:57:17Z",
    "updated": "2025-10-01T17:57:17Z",
    "categories": [
      "astro-ph.HE",
      "hep-ex",
      "hep-ph",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2510.01646v1",
    "url": "https://arxiv.org/abs/2510.01646v1",
    "pdf_url": "https://arxiv.org/pdf/2510.01646v1.pdf",
    "title": "Study of the response of a large volume TPC prototype for the CYGNO   experiment at LNGS",
    "abstract": "Astrophysical and cosmological evidence strongly supports the existence of Dark Matter (DM), yet no candidate particle is predicted by the Standard Model (SM) of particle physics. Among the most studied and hypotheses are Weakly Interacting Massive Particle (WIMPs), which could account for the observed relic DM density through weak interactions in the early Universe. Direct detection experiments aim to observe low-energy nuclear recoils induced by DM interactions, requiring detectors with very low background levels and high sensitivity. The CYGNO project develops large gaseous Time Projection Chambers (TPCs) for directional DM searches. Using a helium- and fluorine-rich gas mixture, a triple GEM amplification system and optical readout via PMTs and scientific CMOS cameras, CYGNO enables 3D track reconstruction and sensitivity to both Spin-Independent and Spin-Dependent interactions. Several prototypes have been built, culminating in the Long Imaging ModulE (LIME), a 50 L active volume TPC. Installed underground at Laboratori Nazionali del Gran Sasso in 2022. LIME represents a milestone toward a full-scale directional DM detector. This thesis reports on the calibration and stability studies of LIME, presenting methods to control environmental effects on detector performance, a novel data equalisation technique and first sensitivity studies for DM detection. The results contribute to validating CYGNO's approach and advancing the roadmap toward large-scale directional Dark Matter searches.",
    "authors": [
      "Rita Antonietti"
    ],
    "published": "2025-10-01T17:50:30Z",
    "updated": "2025-10-01T17:50:30Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.01060v1",
    "url": "https://arxiv.org/abs/2510.01060v1",
    "pdf_url": "https://arxiv.org/pdf/2510.01060v1.pdf",
    "title": "Do plasmoids induce fast magnetic reconnection in well-resolved current   sheets in 2D MHD simulations?",
    "abstract": "We investigate the development of tearing-mode instability using the highest resolution two-dimensional magnetohydrodynamic simulations of reconnecting current sheets on a uniform grid, for Lundquist numbers $10^3 \\le S \\le 2 \\times 10^5$. Although the tearing-mode instability is commonly thought to trigger a plasmoid cascade that enables fast reconnection - i.e., independent of $S$ - our results, in broad agreement with the recent findings of Morillo \\& Alexakis (2025), challenge this belief. We demonstrate a Sweet-Parker scaling of the reconnection rate $V_{\\text{rec}} \\sim S^{-1/2}$ up to Lundquist numbers $S \\sim 10^4$. For larger values, plasmoid formation sets in leading to a slight enhancement of the reconnection rate, $V_{\\text{rec}} \\sim S^{-1/3}$, consistent with the prediction from linear tearing mode induced reconnection, indicating that reconnection remains resistivity dependent, and therefore slow. In our simulations, the plasmoids do not form a cascade of mergers, as they are rapidly advected out of the reconnection layer. Our findings call for the revision of the role of plasmoid formation in 2D high Lundquist number magnetic reconnection. Even if future studies demonstrate that 2D plasmoid-reconnection becomes resistivity-independent at sufficiently large $S$, directly extending those results to 3D astrophysical environments is not justified, as in realistic circumstances, the increase of $S$ also raises the Reynolds number of the outflows, making it essential to account for the dominant role of turbulence.",
    "authors": [
      "G. H. Vicentin",
      "G. Kowal",
      "E. M. de Gouveia Dal Pino",
      "A. Lazarian"
    ],
    "published": "2025-10-01T16:00:23Z",
    "updated": "2025-10-01T16:00:23Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE",
      "hep-th"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2504.18312v3",
    "url": "https://arxiv.org/abs/2504.18312v3",
    "pdf_url": "https://arxiv.org/pdf/2504.18312v3.pdf",
    "title": "A Multispacecraft Analysis and Modeling of Type III Radio Burst Exciter   Deceleration in Inhomogeneous Heliospheric Plasma",
    "abstract": "Electron beams accelerated in solar flares and escaping from the Sun along open magnetic field lines can trigger intense radio emissions known as type III solar radio bursts. Utilizing observations by Parker Solar Probe (PSP), STEREO-A (STA), Solar Orbiter (SolO), and Wind spacecrafts, the speeds and accelerations of type III exciters are derived for simple and isolated type III solar bursts. For the first time, simultaneous four spacecraft observations allow to determine positions, and correct the resulting velocities and accelerations for the location between the spacecraft and the apparent source. We observe velocities and acceleration to change as $u(r) \\propto r^{-0.37 \\pm 0.14}$ and $a(r) \\propto r^{-1.71 \\pm 0.20}$ with radial distance from the Sun $r$. To explain the electron beam deceleration, we develop a simple gas-dynamic description of the electron beam moving through plasma with monotonically decreasing density. The model predicts that the beam velocity decreases as $u(f)\\propto f^{1/4}(r)$, so the acceleration changes $\\propto r^{-1.58}$ (and speed as $\\propto r^{-0.29}$) for the plasma density profile $n(r)\\propto r^{-2.3}$. The deceleration is consistent with the average observation values corrected for the type III source locations. Intriguingly, the observations also show differences in velocity and acceleration of the same type III observed by different spacecrafts. We suggest the difference could be related to the additional time delay caused by radio-wave scattering between the spacecraft and the source.",
    "authors": [
      "Francesco Azzollini",
      "Eduard P. Kontar"
    ],
    "published": "2025-04-25T12:39:29Z",
    "updated": "2025-10-01T15:51:04Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2509.26416v2",
    "url": "https://arxiv.org/abs/2509.26416v2",
    "pdf_url": "https://arxiv.org/pdf/2509.26416v2.pdf",
    "title": "Scintillating properties of Cs${_2}$ZrCl${_6}$ crystals in the   temperature range of 5-300 K",
    "abstract": "A new comprehensive study on the Cs${_2}$ZrCl${_6}$ (CZC) crystal scintillating properties under different types of irradiation was performed over a wide temperature range from 5 to 300 K. The light yield (LY) at room temperature (RT), measured under irradiation by 662 keV $\\gamma$ quanta of $^{137}$Cs, was evaluated to be 53,300$\\pm$4,700 photons/MeV corresponding to approximately 71% of its estimated absolute value. The maximum light emission was observed in the temperature interval 135-165 K, where the LY reached 56,900 photons/MeV and 19,700 photons/MeV for $\\gamma$ quanta and $\\alpha$ particles, respectively. The quenching factor (QF) for $\\alpha$ particles increases smoothly from QF = 0.30 at RT to QF = 0.36 at 135 K. The shape of scintillation pulses induced by $\\alpha$ particles is characterized by three time-constants (0.3, 2.5 and 11.8 $\\mu$s at RT), whereas the average pulse of $\\gamma$ induced events is characterized by two time-constants (1.3 and 11.5 $\\mu$s at RT). At the same time, scintillating properties and pulse-shape discrimination capability of the CZC exhibit an acute deterioration at temperatures below 135 K. The optimal operating conditions to maximize the scintillating performance of undoped CZC crystals are discussed.",
    "authors": [
      "F. Cappella",
      "P. C. F. Di Stefano",
      "E. Ellingwood",
      "J. Hucker",
      "T. Leroy",
      "S. S. Nagorny",
      "V. V. Nahorna",
      "L. Pagnanini",
      "P. Skensved",
      "N. Swidinsky",
      "P. Wang"
    ],
    "published": "2025-09-30T15:40:17Z",
    "updated": "2025-10-01T14:45:34Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.00826v1",
    "url": "https://arxiv.org/abs/2510.00826v1",
    "pdf_url": "https://arxiv.org/pdf/2510.00826v1.pdf",
    "title": "Diffraction by Circular and Triangular Apertures as a Diagnostic Tool of   Twisted Matter Waves",
    "abstract": "We study diffraction of twisted matter waves (electrons and light ions carrying orbital angular momentum $\\ell/\\hbar=0,\\pm1,\\pm2,\\ldots$ by circular and triangular apertures. Within the scalar Kirchhoff-Fresnel framework, circular apertures preserve cylindrical symmetry and produce ringlike far-field profiles whose radii and widths depend on $|\\ell|$ but are insensitive to its sign. In contrast, equilateral triangles break axial symmetry and yield structured patterns that encode both the magnitude and the sign of $\\ell$. A transparent Fraunhofer mapping links detector coordinates to the Fourier plane, explaining the $(|\\ell|+1)$-lobe rule and the sign-dependent rotation of the pattern. We validate these results for both ideal Bessel beams and localized Laguerre-Gaussian packets, and we cross-check them by split-step Fourier propagation of the time-dependent Schr\"odinger equation. From these analyses we extract practical design rules (Fraunhofer distance, lattice pitch, detector sampling) relevant to OAM diagnostics with moderately relativistic electrons with $E_{\\rm kin}\\sim0.1$ to $5$ MeV and light ions with $E_{\\rm kin}\\sim0.1$ to $1$ MeV/u. Our results establish triangular diffraction as a simple, passive, and robust method for reading out the OAM content of structured quantum beams.",
    "authors": [
      "Maksim Maksimov",
      "Nikita Borodin",
      "Daria Kargina",
      "Dmitry Naumov",
      "Dmitry Karlovets"
    ],
    "published": "2025-10-01T12:37:17Z",
    "updated": "2025-10-01T12:37:17Z",
    "categories": [
      "quant-ph",
      "hep-ph",
      "physics.acc-ph"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2510.00749v1",
    "url": "https://arxiv.org/abs/2510.00749v1",
    "pdf_url": "https://arxiv.org/pdf/2510.00749v1.pdf",
    "title": "Effects of Neutron Irradiation on LGADs with Broad Multiplication Layer   and varied Carbon-Enriched Doses: A Study on Timing Performance and Gain   Deterioration",
    "abstract": "In this radiation tolerance study, Low Gain Avalanche Detectors (LGADs) with a carbon-enriched broad and shallow multiplication layer were examined in comparison to identical non-carbonated LGADs. Manufactured at IMB-CNM, the sensors underwent neutron irradiation at the TRIGRA reactor in Ljubljana, reaching a fluence of $2.5 \\times 10^{15}n_{eq}cm^{-2}$. The results revealed a smaller deactivation of Boron and improved resistance to radiation in carbonated LGADs. The study demonstrated the potential benefits of carbon enrichment in mitigating radiation damage effects, particularly the acceptor removal mechanism, reducing the acceptor removal constant by more than a factor of two. Additionally, time resolution and collected charge degradation due to irradiation were observed, with carbonated samples exhibiting better radiation tolerance. A noise analysis focused on baseline noise and thermally generated pulses showed the presence of spurious thermal-generated pulses attributed to a excessive small distance between the gain layer end and the p-stop implant at the periphery of the pad for the characterized LGAD design; however, the operation performance of the devices was unaffected.",
    "authors": [
      "E. Navarrete Ramos",
      "J. Villegas",
      "J. Duarte-Campderros",
      "M. Fernandez",
      "A. Gomez-Carrera",
      "G. Gomez",
      "J. Gonzalez",
      "S. Hidalgo",
      "R. Jaramillo",
      "P. Martinez Ruiz del Arbol",
      "A. Merlos",
      "C. Quintana",
      "I. Vila"
    ],
    "published": "2025-10-01T10:35:21Z",
    "updated": "2025-10-01T10:35:21Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.00714v1",
    "url": "https://arxiv.org/abs/2510.00714v1",
    "pdf_url": "https://arxiv.org/pdf/2510.00714v1.pdf",
    "title": "Practical considerations for assignment of photon numbers with SNSPDs",
    "abstract": "Superconducting nanowire single-photon detectors (SNSPDs) can enable photon-number resolution (PNR) based on accurate measurements of the detector's response time to few-photon optical pulses. In this work we investigate the impact of the optical pulse shape and duration on the accuracy of this method. We find that Gaussian temporal pulse shapes yield cleaner arrival-time histograms, and thus more accurate PNR, compared to bandpass-filtered pulses of equal bandwidth. For low system jitter and an optical pulse duration comparable to the other jitter contributions, photon numbers can be discriminated in our system with a commercial SNSPD. At 60 ps optical pulse duration, photon-number discrimination is significantly reduced. Furthermore, we highlight the importance of using the correct arrival-time histogram model when analyzing photon-number assignment. Using exponentially-modified Gaussian (EMG) distributions, instead of the commonly used Gaussian distributions, we can more accurately determine photon-number misidentification probabilities. Finally, we reconstruct the positive operator-valued measures (POVMs) of the detector, revealing sharp features which indicate the intrinsic PNR capabilities.",
    "authors": [
      "Timon Schapeler",
      "Isabell Mischke",
      "Fabian Schlue",
      "Michael Stefszky",
      "Benjamin Brecht",
      "Christine Silberhorn",
      "Tim J. Bartley"
    ],
    "published": "2025-10-01T09:48:43Z",
    "updated": "2025-10-01T09:48:43Z",
    "categories": [
      "quant-ph",
      "physics.ins-det"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2510.00700v1",
    "url": "https://arxiv.org/abs/2510.00700v1",
    "pdf_url": "https://arxiv.org/pdf/2510.00700v1.pdf",
    "title": "Full-Field Brillouin Microscopy with a Scanning Fabry-Perot   Interferometer",
    "abstract": "Brillouin microscopy is an emerging optical technique for probing mechanical properties with submicron resolution, offering fully non-contact, label-free operation. Despite its unique capabilities, broader adoption has been limited by slow acquisition speeds, particularly in systems based on scanning Fabry-Perot interferometers (FPIs). Based on prior implementations, FPIs have typically been considered too slow for practical imaging, particularly when both spatial and spectral precision are required. Here, we demonstrate that a standard multi-pass tandem FPI can be repurposed for full-field Brillouin imaging when operated in a spectral filtering mode. Combined with light-sheet illumination for uniform, low-dose excitation, this configuration enables rapid, spatially resolved acquisition of Brillouin spectra. By restricting scanning to a narrow frequency range around the Brillouin peak, we acquired a full 2D image within one minute, achieving millisecond-scale single pixel dwell times and micrometer-scale spatial resolution. The system uniquely supports Brillouin emission imaging at selected frequency shifts, a capability not available with other spontaneous Brillouin implementations. Results from synthetic and biological specimens demonstrate how existing FPI-based setups can be extended to full-field imaging and outline a pathway toward future dedicated FPI instruments optimized for high-speed, high-contrast Brillouin microscopy.",
    "authors": [
      "Mikolaj Pochylski"
    ],
    "published": "2025-10-01T09:18:13Z",
    "updated": "2025-10-01T09:18:13Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2510.00642v1",
    "url": "https://arxiv.org/abs/2510.00642v1",
    "pdf_url": "https://arxiv.org/pdf/2510.00642v1.pdf",
    "title": "Fabrication and Characterization of X-ray TES Detectors Based on Annular   AlMn Alloy Films",
    "abstract": "AlMn alloy flms are widely fabricated into superconducting transition edge sensors (TESs) for the detection of cosmic microwave background radiation. However, the application in X-ray or gamma-ray detection based on AlMn TES is rarely reported. In this study, X-ray TES detectors based on unique annular AlMn flms are devel-oped. The fabrication processes of TES detectors are introduced in detail. The char-acteristics of three TES samples are evaluated in a dilution refrigerator. The results demonstrate that the I-V characteristics of the three annular TES detectors are highly consistent. The TES detector with the smallest absorber achieved the best energy resolution of 11.0 eV @ 5.9 keV, which is inferior to the theoretical value. The dis-crepancy is mainly attributed to the larger readout electronics noise than expected.",
    "authors": [
      "Yifei Zhang",
      "Zhengwei Li",
      "Mengxian Zhang",
      "Guofu Liao",
      "Zhouhui Liu",
      "Yu Xu",
      "Nan Li",
      "Liangpeng Xie",
      "Junjie Zhou",
      "Xufang Li",
      "He Gao",
      "Shibo Shu",
      "Yongping Li",
      "Yudong Gu",
      "Daikang Yan",
      "Xuefeng Lu",
      "Hua Feng",
      "Yongjie Zhang",
      "Congzhan Liu"
    ],
    "published": "2025-10-01T08:19:38Z",
    "updated": "2025-10-01T08:19:38Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.00640v1",
    "url": "https://arxiv.org/abs/2510.00640v1",
    "pdf_url": "https://arxiv.org/pdf/2510.00640v1.pdf",
    "title": "Spectral Control of a Cavity-Based X-ray Free-Electron Laser via Active   Mode Locking",
    "abstract": "Precise spectral control in the hard X-ray regime remains a long-standing challenge that limits applications in atomic-scale science and ultrafast spectroscopy. We present an actively mode-locked cavity-based X-ray free-electron laser that achieves deterministic spectral programmability with phase-locked pulse trains and comb-like spectra, by coherently modulating the electron-beam energy. Three-dimensional time-dependent simulations predict \\SI{700}{\\micro\\joule} total energy, \\SI{30}{\\giga\\watt} peak power, and frequency-comb spacing of \\SI{1.55}{\\electronvolt} set by the modulation frequency. We further develop selective single-line amplification via undulator tapering and absolute frequency positioning through modulation-laser tuning with better than $2 \\times 10^{-5}$ relative precision. Importantly, stable mode-locked operation persists under >80\\% peak-to-peak cavity-reflectivity variations, substantially relaxing requirements on X-ray optics. These results establish active mode locking as a practical route to fully coherent, spectrally agile hard X-ray sources and enable new opportunities in time-resolved core-level spectroscopy, X-ray quantum optics, and precision metrology.",
    "authors": [
      "Nanshun Huang",
      "Hanxiang Yang",
      "Haixiao Deng"
    ],
    "published": "2025-10-01T08:16:23Z",
    "updated": "2025-10-01T08:16:23Z",
    "categories": [
      "physics.acc-ph",
      "physics.optics"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.25952v2",
    "url": "https://arxiv.org/abs/2509.25952v2",
    "pdf_url": "https://arxiv.org/pdf/2509.25952v2.pdf",
    "title": "Gravitational wave experiments: achievements and plans",
    "abstract": "Gravitational wave (GW) experiments have transformed our understanding of the Universe by enabling direct observations of compact object mergers and other astrophysical phenomena. This chapter reviews the concepts of GW detectors, such as LIGO, Virgo, and KAGRA, and describes their operating principles, data acquisition and analysis techniques, and some of the methods used to extract source properties. The scientific impact of GW observations is discussed as well, including contributions to astrophysics, tests of general relativity, and cosmology. We also examine the role of multimessenger astronomy and the complementarity between different GW detectors and with other astroparticle experiments. Finally, we outline future prospects with next-generation detectors, like the Einstein Telescope and Cosmic Explorer, and space-based missions.",
    "authors": [
      "Elisa Bigongiari",
      "Matteo Di Giovanni",
      "Giovanni Losurdo"
    ],
    "published": "2025-09-30T08:47:01Z",
    "updated": "2025-10-01T07:52:38Z",
    "categories": [
      "gr-qc",
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "gr-qc"
  },
  {
    "arxiv_id": "2507.11952v2",
    "url": "https://arxiv.org/abs/2507.11952v2",
    "pdf_url": "https://arxiv.org/pdf/2507.11952v2.pdf",
    "title": "Multi-directional investigations on quiet time suprathermal ions   measured by ASPEX-STEPS on-board Aditya L1",
    "abstract": "The origin, acceleration and anisotropy of suprathermal ions in the interplanetary medium during quiet periods have remained poorly understood issues in solar wind physics. To address these aspects, we derive the spectral indices for the quiet time suprathermal ions based on the measurements by the four directionally separated sensors that are part of the Supra-Thermal and Energetic Particle Spectrometer (STEPS) of Aditya Solar Wind Particle EXperiment (ASPEX) on-board Aditya L1 spacecraft. Three out of four STEPS sensors Parker Spiral (PS), Inter-Mediate (IM), Earth Pointing (EP) are in one plane (nearly aligned with the ecliptic plane) while the fourth sensor North Pointing (NP) is in a mutually orthogonal plane. The energy ranges covered by the PS, IM, EP and NP sensors are 0.36-1.32 MeV, 0.14-1.22 MeV, 0.39-1.33 MeV and 0.12-1.23 MeV respectively. The quiet intervals are identified during January November, 2024 and the derived spectral indices (differential directional flux versus energy) are found to be in the range of 2.0 for all directions in the time scale of a few days revealing isotropic nature of their distribution. Further analysis of elemental abundance ratios (3He/4He, Fe/O, and C/O) during the same quiet intervals obtained from the Ultra-Low Energy Isotope Spectrometer (ULEIS) on board the Advanced Composition Explorer (ACE) spacecraft suggests possible contributions from the leftover ions from the previous impulsive (Solar flares) and gradual events (CMEs) in the quiet time suprathermal ion pool.",
    "authors": [
      "Aakash Gupta",
      "Dibyendu Chakrabarty",
      "Santosh Vadawale",
      "Aveek Sarkar",
      "Bijoy Dalal",
      "Shiv Kumar Goyal",
      "Jacob Sebastian",
      "P. Janardhan",
      "Nandita Srivastava",
      "M. Shanmugam",
      "Neeraj Kumar Tiwari",
      "Aaditya Sarda",
      "Piyush Sharma",
      "Anil Bhardwaj",
      "Prashant Kumar",
      "Manan S. Shah",
      "Bhas Bapat",
      "Pranav R. Adhyaru",
      "Arpit R. Patel",
      "Hitesh Kumar Adalja",
      "Abhishek Kumar",
      "Tinkal Ladiya",
      "Sushil Kumar",
      "Nishant Singh",
      "Deepak Kumar Painkra",
      "Abhishek J. Verma",
      "Swaroop Banerjee",
      "K. P. Subramanian",
      "M. B. Dadhania"
    ],
    "published": "2025-07-16T06:38:52Z",
    "updated": "2025-10-01T06:42:38Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.EP",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2509.26390v2",
    "url": "https://arxiv.org/abs/2509.26390v2",
    "pdf_url": "https://arxiv.org/pdf/2509.26390v2.pdf",
    "title": "Precision measurement and modelling of the threshold-free 210Pb β   spectrum",
    "abstract": "Beta decay is a fundamental process that governs nuclear stability and serves as a sensitive probe of the weak interaction and possible physics beyond the Standard Model of particle physics. However, precise measurements of complete $\\beta$ decay spectra, particularly at low energies, remain experimentally and theoretically challenging. Here we report a high-precision, threshold-free measurement of the full $\\beta$ decay spectrum of 210Pb to excited states of 210Bi, using a transition-edge sensor (TES)-based micro-calorimeter. This approach enables the detection of $\\beta$ particle energies from 0 keV up to their endpoint by coincidence summing with subsequent de-excitation energy, thereby eliminating reconstruction artifacts near zero energy that have traditionally limited low-energy spectral accuracy. To our knowledge, this is the first complete, high-precision $\\beta$ decay spectrum from 0 keV. The data resolve theoretical uncertainties associated with the atomic quantum exchange (AQE) effect. An accompanying ab initio theoretical framework, incorporating atomic, leptonic, and nuclear components, predicts a statistically significant (7.2 {$\\sigma$}) enhancement in $\\beta$ emission probability near zero energy, in agreement with the measurement and in contrast to models that omit AQE corrections. These results provide a new benchmark for $\\beta$ decay theory at low energies, deepen our understanding of the weak interaction, and establish a critical foundation for searches for new physics, including dark matter interactions and precision studies of neutrinos.",
    "authors": [
      "Shuo Zhang",
      "Hao-Ran Liu",
      "Ke Han",
      "Xavier Mougeot",
      "Paul-Antoine Hervieux",
      "Tao Sun",
      "Wen-Tao Wu",
      "Robin Cantor",
      "Jing-Kai Xia",
      "Zhi Liu",
      "Jun-Cheng Liang",
      "Fu-You Fan",
      "Le Zhang",
      "Ming-Yu Ge",
      "Xiao-Peng Zhou",
      "Adrien Andoche"
    ],
    "published": "2025-09-30T15:25:13Z",
    "updated": "2025-10-01T04:52:36Z",
    "categories": [
      "nucl-ex",
      "nucl-th",
      "physics.ins-det"
    ],
    "primary_category": "nucl-ex"
  },
  {
    "arxiv_id": "2510.00493v1",
    "url": "https://arxiv.org/abs/2510.00493v1",
    "pdf_url": "https://arxiv.org/pdf/2510.00493v1.pdf",
    "title": "Correlation function metrology for warm dense matter: Recent   developments and practical guidelines",
    "abstract": "X-ray Thomson scattering (XRTS) has emerged as a valuable diagnostic for matter under extreme conditions, as it captures the intricate many-body physics of the probed sample. Recent advances, such as the model-free temperature diagnostic of Dornheim et al. [Nat.Commun. 13, 7911 (2022)], have demonstrated how much information can be extracted directly within the imaginary-time formalism. However, since the imaginary-time formalism is a concept often difficult to grasp, we provide here a systematic overview of its theoretical foundations and explicitly demonstrate its practical applications to temperature inference, including relevant subtleties. Furthermore, we present recent developments that enable the determination of the absolute normalization, Rayleigh weight, and density from XRTS measurements without reliance on uncontrolled model assumptions. Finally, we outline a unified workflow that guides the extraction of these key observables, offering a practical framework for applying the method to interpret experimental measurements.",
    "authors": [
      "Maximilian Peter Böhme",
      "Willow Martin",
      "Hannah Bellenbaum",
      "Magaret Berrens",
      "Jan Vorberger",
      "Sebastian Schwalbe",
      "Zhandos Moldabekov",
      "Thomas Gawne",
      "Sebastien Hamel",
      "Brianna Aguilar-Solis",
      "Abhiraj Sharma",
      "Frank Graziani",
      "Tilo Döppner",
      "Siegfried Glenzer",
      "Tobias Dornheim",
      "David Bishel"
    ],
    "published": "2025-10-01T04:22:31Z",
    "updated": "2025-10-01T04:22:31Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.01289v1",
    "url": "https://arxiv.org/abs/2510.01289v1",
    "pdf_url": "https://arxiv.org/pdf/2510.01289v1.pdf",
    "title": "Detailed Derivation of the Scalar Explicit Expressions Governing the   Electric Field, Current Density, and Volumetric Power Density in the Four   Types of Linear Divergent MHD Channels Under a Unidirectional Applied   Magnetic Field",
    "abstract": "The current study belongs to the field of applied mathematics in plasma physics and electric power, where mathematical analysis of the algebraic equations governing the electric field vector, and the electric-current density field vector within a Magnetohydrodynamic (MHD) linear two-dimensional divergent supersonic channel is utilized to derive analytical expressions for these important fields, as well as closed-form equations for the volumetric power density (output electric power per unit volume of the plasma channel). The expressions presented here describe analytically the operation of the MHD channel as an electric power source within an Open-Cycle Magnetohydrodynamic (OCMHD) generator. The four common types of the MHD linear channels are covered here: namely, (1) continuous-electrode Faraday channel, (2) linear Hall channel, (3) segmented-electrode Faraday channel, and (4) diagonal-electrode channel. The mathematical results, their detailed derivation, and the companion graphical illustrations aid in making a proper decision regarding which channel type is the most suitable for a given application.Under typical operational conditions of 5 S/m plasma electric conductivity, 5 T magnetic field, and 2,000 m/s plasma speed, as well as an optimized load factor of 0.5, we estimate the following numerical values (unsigned magnitudes) for the continuous-electrode Faraday channel (with a Hall parameter of 1): useful electric field (across the external electric load): 5 kV/m, useful electric current-density (between the terminal electrodes within the channel): 12.5 kA/m2 , volumetric power density (dissipated by the load per unit volume of plasma): 62.5 MW/m3 , and electric efficiency (for the electric field or voltage): 50%. For the Halllinear channel (with a Hall parameter of 5), these quantitative performance values become25 kV/m, 4.808 kA/m2, 120.19 MW/m3, and 46.30%.",
    "authors": [
      "Osama A. Marzouk"
    ],
    "published": "2025-10-01T02:56:59Z",
    "updated": "2025-10-01T02:56:59Z",
    "categories": [
      "physics.plasm-ph",
      "00A79, 03H10"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.37256/cm.6420256918"
  },
  {
    "arxiv_id": "2510.00282v1",
    "url": "https://arxiv.org/abs/2510.00282v1",
    "pdf_url": "https://arxiv.org/pdf/2510.00282v1.pdf",
    "title": "Electron neural closure for turbulent magnetosheath simulations: energy   channels",
    "abstract": "In this work, we introduce a non-local five-moment electron pressure tensor closure parametrized by a Fully Convolutional Neural Network (FCNN). Electron pressure plays an important role in generalized Ohm's law, competing with electron inertia. This model is used in the development of a surrogate model for a fully kinetic energy-conserving semi-implicit Particle-in-Cell simulation of decaying magnetosheath turbulence. We achieve this by training FCNN on a representative set of simulations with a smaller number of particles per cell and showing that our results generalise to a simulation with a large number of particles per cell. We evaluate the statistical properties of the learned equation of state, with a focus on pressure-strain interaction, which is crucial for understanding energy channels in turbulent plasmas. The resulting equation of state learned via FCNN significantly outperforms local closures, such as those learned by Multi-Layer Perceptron (MLP) or double adiabatic expressions. We report that the overall spatial distribution of pressure-strain and its conditional averages are reconstructed well. However, some small-scale features are missed, especially for the off-diagonal components of the pressure tensor. Nevertheless, the results are substantially improved with more training data, indicating favorable scaling and potential for improvement, which will be addressed in future work.",
    "authors": [
      "George Miloshevich",
      "Luka Vranckx",
      "Felipe Nathan de Oliveira Lopes",
      "Pietro Dazzi",
      "Giuseppe Arrò",
      "Giovanni Lapenta"
    ],
    "published": "2025-09-30T21:00:50Z",
    "updated": "2025-09-30T21:00:50Z",
    "categories": [
      "physics.plasm-ph",
      "cs.LG",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.00176v1",
    "url": "https://arxiv.org/abs/2510.00176v1",
    "pdf_url": "https://arxiv.org/pdf/2510.00176v1.pdf",
    "title": "The Simons Observatory: Characterization of All DC/RF Routing Wafers for   Detector Modules",
    "abstract": "The Simons Observatory (SO) is a cosmic microwave background experiment with over 67,000 polarization-sensitive transition-edge sensor (TES) detectors currently installed for use in observations and plans to increase the total detector count to ${\\sim}$98,000 detectors with the Advanced SO upgrade. The TES arrays are packaged into Universal Focal-Plane Modules (UFMs), which also contain the multiplexing readout circuit. Within a readout module, a DC/RF routing wafer provides a cold interface between the detectors and the readout multiplexing chips. Each routing wafer hosts twelve bias lines, which contain the ${\\sim}$400 ${\\mu}{\\Omega}$ shunt resistors that are part of the TES bias circuitry. More than 70 routing wafers have been fabricated and tested both at room temperature and 100 mK before integration into UFMs. The lab measurements for all screened wafers have been compiled to show the distribution of measured average shunt resistance Rsh for each bias line, both across bias lines on a single routing wafer and across all routing wafers. The mean average shunt resistance for all wafers was found to be 396 ${\\mu}{\\Omega}$ with a standard deviation of 16 ${\\mu}{\\Omega}$, or ${\\sim}$4%. For each wafer, we note good uniformity of average Rsh between bias lines, with a slight downward trend with increasing distance from the center of the wafer. The fabrication data collected at room temperature shows agreement with the cryogenic measurements of Rsh distribution.",
    "authors": [
      "Alicia Middleton",
      "Kyuyoung Bae",
      "Cody J. Duell",
      "Shannon M. Duff",
      "Erin Healy",
      "Zachary B. Huber",
      "Johannes Hubmayr",
      "Ben Keller",
      "Lawrence T. Lin",
      "Michael J. Link",
      "Tammy J. Lucas",
      "Michael D. Niemack",
      "Eve M. Vavagiakis",
      "Yuhan Wang"
    ],
    "published": "2025-09-30T18:54:06Z",
    "updated": "2025-09-30T18:54:06Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2509.26586v1",
    "url": "https://arxiv.org/abs/2509.26586v1",
    "pdf_url": "https://arxiv.org/pdf/2509.26586v1.pdf",
    "title": "Supergranulation and poleward migration of the magnetic field at high   latitudes of the Sun",
    "abstract": "Magnetoconvection at the solar surface governs the dynamics in the upper solar atmosphere and sustains the heliosphere. Properties of this fundamental process are poorly described near the solar poles. Here we report the first out-of-ecliptic remote-sensing observations of the south pole of the Sun from a high-latitude campaign of the Solar Orbiter spacecraft which reveal spatial and temporal evolution of supergranular convective cells. The supergranular cells have spatial scales of 20--40\\,Mm. From eight days of observations starting on 2025 March 16, our analysis shows that the magnetic network migrates poleward, on average, at high latitudes (above 60\\textdegree), with speeds in the range of 10--20\\,m\\,s$^{-1}$, depending on the structures being tracked. These results shed light on the buildup of the polar magnetic field that is central to our understanding of the solar cycle and the heliospheric magnetic field.",
    "authors": [
      "L. P. Chitta",
      "D. Calchetti",
      "J. Hirzberger",
      "G. Valori",
      "E. R. Priest",
      "S. K. Solanki",
      "D. Berghmans",
      "C. Verbeeck",
      "E. Kraaikamp",
      "K. Albert",
      "T. Appourchaux",
      "F. J. Bailén",
      "L. R. Bellot Rubio",
      "J. Blanco Rodríguez",
      "A. Feller",
      "A. Gandorfer",
      "L. Gizon",
      "A. Lagg",
      "A. Moreno Vacas",
      "D. Orozco Suárez",
      "J. Schou",
      "U. Schühle",
      "J. Sinjan",
      "H. Strecker",
      "R. Volkmer",
      "J. Woch",
      "X. Li",
      "T. Oba",
      "A. Ulyanov"
    ],
    "published": "2025-09-30T17:43:25Z",
    "updated": "2025-09-30T17:43:25Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2509.26441v1",
    "url": "https://arxiv.org/abs/2509.26441v1",
    "pdf_url": "https://arxiv.org/pdf/2509.26441v1.pdf",
    "title": "Silicon pinhole strip defects and their impact on ATLAS Inner Tracker HV   current measurement",
    "abstract": "In preparation for the High-Luminsoity LHC (HL-LHC), the ATLAS detector will undergo major detector upgrades, including the replacement of the current Inner Detector with the new all-silicon Inner Tracker (ITk). The ITk consists of a pixel detector close to the beamline surrounded by a large-area strip detector. During detector production, the electrical properties of silicon sensors and readout electronics must be characterized through a series of quality control (QC) and quality assurance tests. These tests ensure any defect is captured at the earliest possible stage. One such defect, called a pinhole, occurs when the strip implant and the metal readout electrode are shorted through the intermediary dielectric layer. Notably, the introduction of pinholes during module assembly and pinhole effects on completed modules, especially on leakage current measurement circuitry, have never been studied. In this paper, we investigate the effect of such connections on the sensor leakage current measurements of completed modules and introduce new ways to locate pinholed strips. With minor modifications to testing procedures, such defects are shown not to impede module testing or performance.",
    "authors": [
      "Anthony Affolder",
      "Kirsten Affolder",
      "Emily Duden",
      "Vitaliy Fadeyev",
      "Cole Helling",
      "David Lynn",
      "Forest Martinez-Mckinney",
      "Peter Phillips",
      "Luise Poley",
      "Tate Sakaguchi",
      "Abdullah Sayed",
      "Stefania Stucci",
      "Alex Wang",
      "Marcus Wong"
    ],
    "published": "2025-09-30T15:58:41Z",
    "updated": "2025-09-30T15:58:41Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.26437v1",
    "url": "https://arxiv.org/abs/2509.26437v1",
    "pdf_url": "https://arxiv.org/pdf/2509.26437v1.pdf",
    "title": "Evaluation of CZT Detector Performance in Alpha and Gamma Spectrometry",
    "abstract": "The present work reports on the performance studies of Cadmium Zinc Telluride (CZT) planar detector structures. To better understand the correlation between the physical properties and the electrical and spectroscopic behavior of the devices, we carried out current-voltage (IV) and capacitance-voltage (CV) measurements, in addition to gamma- and alpha-spectroscopy. For each tested sensor, spectroscopic responses were recorded under varying applied bias voltage. The described suite of measurements provides the parameters needed to evaluate bulk resistivity, signal efficiency, and energy resolution for characteristic peaks at different energies. Readout configurations and data processing are discussed in related sections.",
    "authors": [
      "N. Kramarenko",
      "M. Väänänen",
      "M. Kalliokoski",
      "M. Bezak",
      "R. Turpeinen",
      "A. Winkler"
    ],
    "published": "2025-09-30T15:56:06Z",
    "updated": "2025-09-30T15:56:06Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.26357v1",
    "url": "https://arxiv.org/abs/2509.26357v1",
    "pdf_url": "https://arxiv.org/pdf/2509.26357v1.pdf",
    "title": "Validation of ERMES 20.0 finite element code for MAST Upgrade O-X mode   conversion",
    "abstract": "This study presents the validation of the frequency-domain finite element code ERMES 20.0, benchmarked against Finite Difference Time Domain (FDTD) solvers. The simulations focus on Ordinary-Extraordinary (O-X) mode conversion in the Electron Bernstein Wave (EBW) regime of the MAST Upgrade experiment. Validation is performed in terms of mode conversion efficiency and wave propagation characteristics. Several finite element formulations are tested and compared with the FDTD results. The simulations demonstrate excellent agreement between the different approaches, confirming the accuracy and robustness of ERMES 20.0 for modeling cold plasma wave interactions.",
    "authors": [
      "Ruben Otin",
      "Ying Hao Matthew Liang",
      "Thomas Wilson",
      "Simon Freethy",
      "Valerian Hall-Chen"
    ],
    "published": "2025-09-30T14:57:10Z",
    "updated": "2025-09-30T14:57:10Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.13206v2",
    "url": "https://arxiv.org/abs/2509.13206v2",
    "pdf_url": "https://arxiv.org/pdf/2509.13206v2.pdf",
    "title": "Virtual states and exponential decay in small-scale dynamo",
    "abstract": "We develop the Kazantsev theory of small-scale dynamo generation at small Prandtl numbers near the generation threshold and restore the concordance between the theory and numerical simulations: the theory predicted a power-law decay below the threshold, while simulations demonstrate exponential decay. We show that the exponential decay is temporary and owes its existence to the flattening of the velocity correlator at large scales. This effect corresponds to the existence of a long-living virtual level in the corresponding Schrodinger type equation. We also find the critical Reynolds number and the increment of growth/decay above and under the threshold; we express them in terms of the quantitative characteristic properties of the velocity correlator, which makes it possible to compare the results with the data of different simulations.",
    "authors": [
      "A. V. Kopyev",
      "V. A. Sirota",
      "A. S. Il'yn",
      "K. P. Zybin"
    ],
    "published": "2025-09-16T16:15:04Z",
    "updated": "2025-09-30T14:08:53Z",
    "categories": [
      "physics.flu-dyn",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.flu-dyn"
  },
  {
    "arxiv_id": "2509.26266v1",
    "url": "https://arxiv.org/abs/2509.26266v1",
    "pdf_url": "https://arxiv.org/pdf/2509.26266v1.pdf",
    "title": "Design and Evaluation of CZT-based Micro-activity Dose Calibrator for   TAT Application using Monte Carlo Simulation",
    "abstract": "A novel CZT-based micro-activity dose calibrator has been designed via Monte Carlo simulation (GATE) to accurately measure low-level activity 225Ac for targeted alpha therapy (TAT) application. Because even small overdoses in TAT can induce severe local toxicity, activities in the microcurie down to nanocurie regime are often required, and accurate activity measurement by dose calibrators is a priori to safe and effective treatment. Standard dose calibrators, or high-pressurized gas-filled ionization chambers, are not suitable in this range due to limited sensitivity and lack of energy discrimination. To address this, we designed a CZT-based micro-activity calibrator that (i) adopts a box-shaped well geometry to obtain higher solid-angle coverage and (ii) applies time-coincident pixel-level clustering to recover full-energy-peak net counts otherwise lost to multi-site Compton scattering. Using GATE, serial dilutions from 1.0 uCi down to 1e-6 uCi were simulated, activities were reconstructed from the 218 and 440 keV gamma peaks and performance was compared against a NaI(Tl) well counter, which serves as an alternative to standard dose calibrator. Across six orders of magnitude, the CZT-based micro-activity dose calibrator exhibited near-unity linearity (slope m=0.9934) with percent-level bias, whereas the NaI(Tl) counter showed systematic under-response under identical conditions. These results indicate that a CZT-based approach can provide accurate low-activity quantification for TAT, motivating forthcoming hardware validation.",
    "authors": [
      "Seoyun Jang",
      "Robin Peter",
      "Biswajit Das",
      "Youngho Seo",
      "Gyuseong Cho"
    ],
    "published": "2025-09-30T13:53:00Z",
    "updated": "2025-09-30T13:53:00Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.26252v1",
    "url": "https://arxiv.org/abs/2509.26252v1",
    "pdf_url": "https://arxiv.org/pdf/2509.26252v1.pdf",
    "title": "Comparative study of YSO, GaGG, and BGO scintillators coupled to a SiPM   array for gamma-ray spectroscopy",
    "abstract": "A compact gamma-ray detector module was developed and characterized for spectroscopic applications across a wide energy range. The detector comprises a 4x4 array of silicon photomultipliers (SiPMs, Hamamatsu MPPC S13360-3050) coupled with three different inorganic scintillators (YSO, GaGG, BGO). The performance of the detector was evaluated over an energy range from 32 keV to 2500 keV using various standard gamma-ray point sources ({241}Am, {137}Cs, {22}Na, {60}Co, {228}Th). All three detector configurations demonstrated linearity between pulse height and gamma-ray energy over most of the tested range. GAGG exhibited the most consistent linear behavior up to 2500 keV. YSO with a faster decay constant showed linearity up to ~2000 keV, followed by slight saturation effects likely due to SiPM microcell occupancy limits at higher photon flux. BGO, characterized by a low light output and longer decay time, demonstrated stable linearity up to 2500 keV but reduced sensitivity below 300 keV. The measured energy resolution at 662 keV was 8.17% for GAGG, 9.3% for YSO, and 10.2% for BGO, consistent with their light yield and photon detection efficiency (PDE) - matching characteristics. The obtained results showed the trade-offs between scintillator materials in terms of energy resolution, dynamic range, and linearity, and confirm the suitability of the tested configurations for compact gamma-ray spectroscopy applications across the studied energy range.",
    "authors": [
      "S. Nuruyev",
      "G. Ahmadov",
      "D. Berikov",
      "M. Holik",
      "F. Ahmadov",
      "A. Sadigov",
      "R. Akbarov",
      "J. Naghiyev",
      "I. Nuruyev",
      "A. Mammadli"
    ],
    "published": "2025-09-30T13:42:58Z",
    "updated": "2025-09-30T13:42:58Z",
    "categories": [
      "physics.ins-det",
      "physics.app-ph"
    ],
    "primary_category": "physics.ins-det"
  }
]