{
  "arxiv_id": "2502.00188v2",
  "url": "https://arxiv.org/abs/2502.00188v2",
  "pdf_url": "https://arxiv.org/pdf/2502.00188v2.pdf",
  "title": "Dynamics of Magnetic Evaporative Beamline Cooling for Preparation of   Cold Atomic Beams",
  "abstract": "The most sensitive direct neutrino mass searches today are based on measurement of the endpoint of the beta spectrum of tritium to infer limits on the mass of the unobserved neutrino. To avoid the smearing associated with the distribution of molecular final states in the T-He molecule, the next generation of these experiments will need to employ atomic (T) rather than molecular (T$_{2}$) tritium sources, at currents of at least 10$^{15}$ atoms per second. Following production, atomic T can be trapped in gravitational and/or magnetic bottles for beta spectrum experiments, if and only if it can first be cooled to millikelvin temperatures. Accomplishing this cooling presents substantial technological challenges. The Project 8 collaboration is developing a technique based on magnetic evaporative cooling along a beamline (MECB) for the purpose of cooling T to feed a magneto-gravitational trap that also serves as a cyclotron radiation emission spectroscope. Initial tests of the approach are planned in a pathfinder apparatus using atomic Li. This paper presents a method for analyzing the dynamics of the MECB technique, and applies these calculations to the design of systems for cooling and slowing of atomic Li and T. A scheme is outlined that could provide a current of T at the millikelvin temperatures required for the Project 8 neutrino mass search.",
  "authors": [
    "A. Ashtari Esfahani",
    "S. Bhagvati",
    "S. Böser",
    "M. J. Brandsema",
    "R. Cabral",
    "V. A. Chirayath",
    "C. Claessens",
    "N. Coward",
    "L. de Viveiros",
    "P. J. Doe",
    "M. G. Elliott",
    "S. Enomoto",
    "M. Fertl",
    "J. A. Formaggio",
    "B. T. Foust",
    "J. K. Gaison",
    "P. Harmston",
    "K. M. Heeger",
    "B. J. P. Jones",
    "E. Karim",
    "K. Kazkaz",
    "P. T. Kolbeck",
    "M. Li",
    "A. Lindman",
    "C. Y. Liu",
    "C. Matthé",
    "R. Mohiuddin",
    "B. Monreal",
    "B. Mucogllava",
    "R. Mueller",
    "A. Negi",
    "J. A. Nikkel",
    "E. Novitski",
    "N. S. Oblath",
    "M. Oueslati",
    "J. I. Peña",
    "W. Pettus",
    "V. S. Ranatunga",
    "R. Reimann",
    "A. L. Reine",
    "R. G. H. Robertson",
    "L. Saldaña",
    "P. L. Slocum",
    "F. Spanier",
    "J. Stachurska",
    "K. Stogsdill",
    "Y. H. Sun",
    "P. T. Surukuchi",
    "L. Taylor",
    "A. B. Telles",
    "F. Thomas",
    "L. A. Thorne",
    "T. Thümmler",
    "W. Van De Pontseele",
    "B. A. VanDevender",
    "T. E. Weiss",
    "M. Wynne",
    "A. Ziegler"
  ],
  "published": "2025-01-31T22:06:08Z",
  "updated": "2025-09-04T20:00:35Z",
  "categories": [
    "physics.ins-det",
    "hep-ex",
    "nucl-ex",
    "physics.atom-ph"
  ],
  "primary_category": "physics.ins-det"
}