{
  "arxiv_id": "2503.04437v3",
  "url": "https://arxiv.org/abs/2503.04437v3",
  "pdf_url": "https://arxiv.org/pdf/2503.04437v3.pdf",
  "title": "Single-photon counting pixel detector for soft X-rays",
  "abstract": "Soft X-ray experiments at synchrotron light sources are essential for a wide range of research fields. However, commercially available detectors for this energy range often cannot deliver the necessary combination of quantum efficiency, signal-to-noise ratio, dynamic range, speed, and radiation hardness within a single system. While hybrid detectors have addressed these challenges effectively in the hard X-ray regime, specifically with single photon counting pixel detectors extensively used in high-performance synchrotron applications, similar solutions are desired for energies below 2 keV.   In this work, we introduce the first single-photon-counting hybrid pixel detector capable of detecting X-ray energies as low as 550 eV, utilizing the internal amplification of Low-Gain Avalanche Diode (LGAD) sensors. This detector is thoroughly characterized in terms of Signal-to-Noise Ratio and Detective Quantum Efficiency. We demonstrate its capabilities through ptychographic imaging at MAX IV 4th generation synchrotron light source at the Fe L$_3$-edge (707 eV), showcasing the enhanced detection performance of the system. This development sets a new benchmark for soft X-ray applications at synchrotrons, paving the way for significant advancements in imaging and analysis at lower photon energies.",
  "authors": [
    "Filippo Baruffaldi",
    "Anna Bergamaschi",
    "Maurizio Boscardin",
    "Martin Brueckner",
    "Tim A. Butcher",
    "Maria Carulla",
    "Matteo Centis Vignali",
    "Roberto Dinapoli",
    "Simone Finizio",
    "Erik Froejdh",
    "Dominic Greiffenberg",
    "Aldo Mozzanica",
    "Giovanni Paternoster",
    "Nicholas W. Phillips",
    "Jörg Raabe",
    "Bernd Schmitt",
    "Jiaguo Zhang"
  ],
  "published": "2025-03-06T13:51:58Z",
  "updated": "2025-09-08T10:42:10Z",
  "categories": [
    "physics.ins-det",
    "physics.app-ph"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.1038/s42005-025-02240-9"
}