{
  "arxiv_id": "2506.07808v2",
  "url": "https://arxiv.org/abs/2506.07808v2",
  "pdf_url": "https://arxiv.org/pdf/2506.07808v2.pdf",
  "title": "Thermal Radiation Exchange between Nanoparticles Heated by Arc Discharge",
  "abstract": "The heating of particles by plasma radiation plays a critical role in space science involving dusty plasma as well as in industrial processes such as plasma vapor deposition, microchip production, etching and plasma fusion. Numerical modeling of radiation heat transfer from plasma to nano-scale particles includes exchange of scattered thermal radiation between particles-an effect that was neglected in prior studies in which temperature of particles was estimated. Thermal modeling of gas loaded with nanoparticles differs from a typical multiphase flow, where particles are assumed to be in thermal equilibrium with the surrounding gas. In contrast, the temperature of nanoparticles heated by radiation is significantly higher than the local gas temperature. The nanoparticles volume heating by radiation is markedly different from conventional surface heating experience by macroscale particles. The larger particles are heated to higher temperatures than smaller ones. The study includes numerical modeling of thermal radiation scattered by particles in the Rayleigh regime in where particles radii are much smaller compared to the radiation wavelength and the distance between particles is larger than the dominant radiation wavelength. The study investigates the effects of reduction in conduction heat flux by reducing the gas pressure and using alternating noble gases. Additionally, it investigates the role of enhancement of radiation heat flux from the arc. The computational results show that the re-radiation by larger, heated nanoparticles is important to obtain the accurate temperature of particles. This inter-particle thermal interaction leads to higher temperatures in smaller particles than models assuming thermally isolated particles would predict.",
  "authors": [
    "A. Povitsky",
    "M. N. Shneider"
  ],
  "published": "2025-06-09T14:36:47Z",
  "updated": "2025-09-07T13:39:48Z",
  "categories": [
    "physics.plasm-ph",
    "physics.flu-dyn"
  ],
  "primary_category": "physics.plasm-ph"
}