{
  "arxiv_id": "2509.05455v1",
  "url": "https://arxiv.org/abs/2509.05455v1",
  "pdf_url": "https://arxiv.org/pdf/2509.05455v1.pdf",
  "title": "Room Temperature Single Photon Detection at 1550 nm using van der Waals   Heterojunction",
  "abstract": "Single-photon detectors (SPDs) are crucial in applications ranging from space, biological imaging to quantum communication and information processing. The SPDs that operate at room temperature are of particular interest to broader application space as the energy overhead introduced by the cryogenic cooling can be avoided. Although silicon-based single photon avalanche diodes (SPADs) are well matured and operate at room temperature, the bandgap limitation restricts their operation at telecommunication wavelength (1550 nm) and beyond. InGaAs-based SPADs, on the other hand, are sensitive to 1550 nm photons, but suffer from relatively lower efficiency, high dark count rate, afterpulsing probability, and pose hazards to the environment from the fabrication process. In this work, we demonstrate how we can leverage the properties of nanomaterials to address these challenges and realise a room temperature single-photon detector capable of operating at 1550 nm. We achieve this by coupling a low bandgap ($\\sim 350~meV$) absorber (black phosphorus) to a sensitive van der Waals probe that is capable of detecting discrete electron fluctuation. We optimize the device for operation at $1550~nm$ and demonstrate an overall quantum efficiency of $21.4\\%$ (estimated as $42.8\\%$ for polarized light), and a minimum dark count of $\\sim 720~Hz$ at room temperature.",
  "authors": [
    "Nithin Abraham",
    "Kenji Watanabe",
    "Takashi Taniguchi",
    "Kausik Majumdar"
  ],
  "published": "2025-09-05T19:12:35Z",
  "updated": "2025-09-05T19:12:35Z",
  "categories": [
    "quant-ph",
    "cond-mat.mes-hall",
    "cond-mat.mtrl-sci",
    "physics.app-ph",
    "physics.ins-det"
  ],
  "primary_category": "quant-ph",
  "doi": "10.1002/adfm.202406510"
}