[
  {
    "arxiv_id": "2509.06230v2",
    "url": "https://arxiv.org/abs/2509.06230v2",
    "pdf_url": "https://arxiv.org/pdf/2509.06230v2.pdf",
    "title": "Complete reflection of nonlinear electromagnetic waves in underdense   pair plasmas enabled by dynamically formed Bragg-like structures",
    "abstract": "Using kinetic simulations and theory, we show that nonlinear electromagnetic waves can make even strongly underdense pair plasmas fully reflective. As the wave compresses and accelerates the plasma, weak reflection seeds a periodic train of density spikes that grow rapidly due to mass symmetry. This moving Bragg-like grating increases reflection and momentum transfer, enabling a transition to a regime where the relativistic plasma-vacuum interface sustains complete reflection. Finite temperature raises the full-reflection density threshold, yet the corresponding density can remain underdense.",
    "authors": [
      "Kavin Tangtartharakul",
      "Alexey Arefiev",
      "Maxim Lyutikov"
    ],
    "published": "2025-09-07T22:36:30Z",
    "updated": "2025-09-09T03:57:43Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.06943v1",
    "url": "https://arxiv.org/abs/2509.06943v1",
    "pdf_url": "https://arxiv.org/pdf/2509.06943v1.pdf",
    "title": "First Production of Skipper-CCD Modules for the DAMIC-M Experiment",
    "abstract": "The DAMIC-M experiment will search for sub-GeV dark matter particles with a large array of silicon skipper charge-coupled devices (CCDs) at the Modane Underground Laboratory (LSM) in France. After five years of development, we recently completed the production of 28 CCD modules at the University of Washington, each consisting of four 9-megapixel skipper CCDs. Material screening and background controls were implemented to meet stringent radio-purity targets, while extensive testing was employed to select science-grade CCDs for the modules and confirm their excellent performance after fabrication. Further testing at LSM will select 26 of these modules (${\\sim}$350 g active mass) to be installed and operated in the DAMIC-M detector in early 2026.",
    "authors": [
      "H. Lin",
      "M. Traina",
      "S. Paul",
      "K. Aggarwal",
      "I. Arnquist",
      "N. Castello-Mor",
      "A. E. Chavarria",
      "M. Conde",
      "C. De Dominicis",
      "M. Huehn",
      "S. Hope",
      "T. Hossbach",
      "L. Iddir",
      "I. Lawson",
      "R. Lou",
      "S. Munagavalasa",
      "D. Norcini",
      "P. Privitera",
      "B. Roach",
      "R. Roehnelt",
      "N. Rocco",
      "R. Saldanha",
      "T. Schleider",
      "R. Smida",
      "B. Stillwell",
      "A. Vellozzi",
      "D. Venegas-Vargas",
      "R. Yajur",
      "N. Avalos",
      "X. Bertou",
      "C. Bourgeois",
      "J. Brandt",
      "C. Centeno Lorca",
      "J. Cuevas-Zepeda",
      "A. Dastgheibi-Fard",
      "O. Deligny",
      "R. Desani",
      "M. Dhellot",
      "J. Duarte-Campderros",
      "E. Estrada",
      "D. Florin",
      "N. Gadola",
      "R. Gaior",
      "E. -L. Gkougkousis",
      "J. Gonzalez Sanchez",
      "B. Kavanagh",
      "B. Kilminster",
      "A. Letessier Selvon",
      "P. Loaiza",
      "D. Loeb",
      "A. Lopez-Virto",
      "D. Moya Martin",
      "J. Noonan",
      "X. Ni",
      "M. Perez Martinez",
      "D. Peterson",
      "O. Pochon",
      "D. Reynet",
      "P. Robmann",
      "M. Settimo",
      "S. Smee",
      "T. Van Wechel",
      "R. Vilar",
      "P. Vallerand",
      "A. Vollhardt",
      "D. Wolf",
      "C. Zhu",
      "Y. Zhu"
    ],
    "published": "2025-09-08T17:54:36Z",
    "updated": "2025-09-08T17:54:36Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.CO",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2504.15978v2",
    "url": "https://arxiv.org/abs/2504.15978v2",
    "pdf_url": "https://arxiv.org/pdf/2504.15978v2.pdf",
    "title": "Unveiling the electrodynamic nature of spacetime collisions",
    "abstract": "Gravitational waves from merging binary black holes present exciting opportunities for understanding fundamental aspects of gravity, including nonlinearities in the strong-field regime. One challenge in studying and interpreting the dynamics of binary black hole collisions is the intrinsically geometrical nature of spacetime, which in many ways is unlike that of other classical field theories. By exactly recasting Einstein's equations into a set of coupled nonlinear Maxwell equations closely resembling classical electrodynamics, we visualize the intricate dynamics of gravitational electric and magnetic fields during inspiral, merger and ring-down of a binary black hole collision.",
    "authors": [
      "Siddharth Boyeneni",
      "Jiaxi Wu",
      "Elias R. Most"
    ],
    "published": "2025-04-22T15:27:20Z",
    "updated": "2025-09-08T17:19:48Z",
    "categories": [
      "gr-qc",
      "astro-ph.HE",
      "hep-th",
      "physics.plasm-ph"
    ],
    "primary_category": "gr-qc",
    "doi": "10.1103/995s-wxl7"
  },
  {
    "arxiv_id": "2508.20299v3",
    "url": "https://arxiv.org/abs/2508.20299v3",
    "pdf_url": "https://arxiv.org/pdf/2508.20299v3.pdf",
    "title": "Magnetic Centrifuge Effects in Ultrafast Laser Ablation Plasmas",
    "abstract": "A self-consistent model is developed to explain the anomalously large enrichment of nickel isotopes observed in ablation plumes from ultrafast laser irradiation of solid surfaces. The model is based on the spontaneous creation of a magnetic centrifuge in the ablation plume and the associated cyclotron rotation of plasma ions with rotation rates on the order of 10^9 radians per second. Mass separation occurs around the radial coordinate of cylindrical symmetry with longitudinal axis normal to the ablating surface. A Gaussian shaped radial magnetic field distribution is extracted for Ni isotopes with peak field of 53 Megagauss and average field of 20 Megagauss. In addition to cyclotron rotation of ions, a rigid rotor model is also presented that is associated with the hydrodynamic rotation of the entire plasma and is shown to be of little consequence for the isotope enrichment. Cyclotron rotations dominate the process. A profound resonance of enrichment is observed for specific cyclotron charge states and is shown to be associated with Ion Bernstein Wave (IBW) coupling that provides electrostatic acceleration to these resonant orbits.",
    "authors": [
      "Peter P. Pronko",
      "Paul A. Van Rompay"
    ],
    "published": "2025-08-27T22:10:22Z",
    "updated": "2025-09-08T17:07:25Z",
    "categories": [
      "physics.plasm-ph",
      "physics.app-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.06519v2",
    "url": "https://arxiv.org/abs/2508.06519v2",
    "pdf_url": "https://arxiv.org/pdf/2508.06519v2.pdf",
    "title": "Comparative Simulation of CEvNS Recoil Observables in Geant4 Using   Germanium, Argon, and Xenon Targets",
    "abstract": "We present a Geant4-based simulation study of Coherent Elastic Neutrino-Nucleus Scattering (CEvNS) for three commonly used detector targets: Germanium, Argon, and Xenon. A custom CEvNS model was implemented, including differential cross sections and Helm form factors. Recoil energy spectra, angular distributions, and form factor effects were analyzed using ROOT. The results reveal expected trends: heavier nuclei lead to lower recoil energies and increased form factor suppression. This work provides a simulation framework to support future theoretical and experimental studies in neutrino physics and dark matter searches.",
    "authors": [
      "Yusuf Havvat"
    ],
    "published": "2025-07-31T10:14:47Z",
    "updated": "2025-09-08T15:05:09Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "81V35",
      "F.2.2"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.04279v2",
    "url": "https://arxiv.org/abs/2509.04279v2",
    "pdf_url": "https://arxiv.org/pdf/2509.04279v2.pdf",
    "title": "Energy Confinement Time Scaling Law Derived from Paz-Soldan NF 2024",
    "abstract": "Results from C. Paz-Soldan et al 2024 Nucl. Fusion 64 094002 demonstrate encouraging energy confinement properties for the negative triangularity scenario, similar to or exceeding the scaling of the IPB98(y,2) law. This work describes the procedure with which a new scaling law was regressed specifically from the data from the aforementioned article. Given the relatively small size of the single-machine dataset, kernel density estimation was employed to minimize sampling bias and bootstrapping was used to give a realistic estimate of the large uncertainties from the regression. The resulting power law shows a robustly stronger dependence on plasma current and more severe power degradation as compared to the H-mode scaling law.",
    "authors": [
      "P. Lunia",
      "A. O. Nelson",
      "C. Paz-Soldan"
    ],
    "published": "2025-09-04T14:55:46Z",
    "updated": "2025-09-08T14:12:09Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.12586v2",
    "url": "https://arxiv.org/abs/2507.12586v2",
    "pdf_url": "https://arxiv.org/pdf/2507.12586v2.pdf",
    "title": "Extended thermal cycling of ATLAS ITk strip modules with and without   stress mitigating interposers",
    "abstract": "This paper investigates critical mechanical failures during stand-alone thermocycling of ATLAS Inner Tracker strip pre-production modules. Five modules undergo extended thermocycling after adequately levelling thermal chucks and introducing interlocks for unattended operation. Module bow evolution is tracked via regular sensor metrology. All five modules exhibit bow increases with a mean of $146\\pm 27~\\mu$m when raising maximum cycling temperatures from $20^\\circ$C to $40^\\circ$C. Four such modules exhibit sensor fractures when cycled to $-44^\\circ$C. A stress-mitigating layer of silicone gel and Kapton film interposer is introduced to three further modules, with detailed quality control data establishing electromechanical viability. No significant bow change of $1\\pm 10~\\mu$m is observed after ten cycles between $[+40, -44]^\\circ$C relative to $[+20, -44]^\\circ$C. Two interposer modules undergo 200 thermocycles up to $[+56, -44]^\\circ$C without fracturing. This decreased sensor deformation and fracturing is interpreted as evidence for reduced thermal stress.",
    "authors": [
      "Nikolai Fomin",
      "Bart Hommels",
      "Thomas Ivison",
      "Kosala Kariyapperuma",
      "Jesse Liu"
    ],
    "published": "2025-07-16T19:13:40Z",
    "updated": "2025-09-08T13:24:15Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.06659v1",
    "url": "https://arxiv.org/abs/2509.06659v1",
    "pdf_url": "https://arxiv.org/pdf/2509.06659v1.pdf",
    "title": "Optically interrogated liquid crystal-based, charge-mode accelerometer   telemetry",
    "abstract": "A hybrid optoelectronic vibration sensing system is presented, combining a conventional charge-mode piezoelectric accelerometer with an optical fiber interface via a liquid crystal-based electrical-to-optical transducer. This configuration allows the accelerometer's electrical output to be converted into an optical signal, enabling remote signal transmission over optical fiber. The same fiber could also be used to supply power to the system, offering a compact and interference-resistant solution suitable for challenging environments such as those with high voltages or explosive risks. Experimental results demonstrate a displacement resolution ranging from \\Delta z = 0.015 nm at 0.160 nm displacement, up to \\Delta z = 0.720 nm at 351 nm displacement, or equivalently, from \\alpha = 0.0005 m/s2 to 0.057 m/s2 in acceleration. Despite undergoing electrical-to-optical and optical-to-electrical signal conversion, the system maintains high sensitivity, low noise levels, and signal integrity. This proof-of-concept optically interrogated accelerometer highlights a path toward reducing sensor infrastructure requirements by eliminating the need for conventional power supplies and electromagnetic shielding, which are typically required in fully electrical accelerometer systems.",
    "authors": [
      "Zourab Brodzeli",
      "Can Nerse",
      "Benjamin Halkon",
      "John Canning",
      "Sebastian Oberst"
    ],
    "published": "2025-09-08T13:17:03Z",
    "updated": "2025-09-08T13:17:03Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2506.18688v2",
    "url": "https://arxiv.org/abs/2506.18688v2",
    "pdf_url": "https://arxiv.org/pdf/2506.18688v2.pdf",
    "title": "Prism-based compensation of group delay dispersion in the components of   a femtosecond laser resonator and analysis of the influence of prism   configuration on laser radiation parameters",
    "abstract": "A mathematical algorithm is described for calculating the minimum distance between prisms and the allowable prism insertion depth into the laser beam when solving the general problem of intracavity group delay dispersion (GDD) compensation. GDD is caused by the optical elements of the master oscillator in a femtosecond laser system. The calculation was carried out using analytical and geometrical methods. The influence of changing the distance between the prisms and the depth of their insertion into the laser beam on the GDD compensation has been investigated. Under experimental conditions, this changes the Q-factor of the laser resonator, which determines the central wavelength of the radiation and its spectral width in a titanium-sapphire laser.",
    "authors": [
      "I. V. Beznosenko",
      "A. V. Vasyliev",
      "A. I. Povrozin",
      "V. P. Leshchenko",
      "O. O. Svystunov",
      "G. V. Sotnikov"
    ],
    "published": "2025-06-23T14:28:29Z",
    "updated": "2025-09-08T13:12:46Z",
    "categories": [
      "physics.optics",
      "physics.acc-ph",
      "78A05, 78A60",
      "F.0; F.m"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2502.13330v2",
    "url": "https://arxiv.org/abs/2502.13330v2",
    "pdf_url": "https://arxiv.org/pdf/2502.13330v2.pdf",
    "title": "Timing characterization of MALTA and MALTA2 pixel detectors using Micro   X-ray source",
    "abstract": "The MALTA monolithic active pixel detector is developed to address some of the challenges anticipated in future high-energy physics detectors. As part of its characterization, we conducted timing studies necessary to provide a figure of merit for this family of monolithic pixel detectors. MALTA has a metal layer in front-end electronics, and the conventional laser technique is not suitable for timing studies due to the reflection of the laser from the metallic surface. X-rays have been employed as a more effective alternative for penetration through these layers. The triggered X-ray set-up is designed to study timing measurements of monolithic detectors. The timing response of the X-ray set-up is characterized using an LGAD. The timing response of the MALTA and MALTA2 pixel detectors is studied, and the best response time of MALTA2 pixel detectors is measured at about 2.6 ns.",
    "authors": [
      "G. Dash",
      "P. Allport",
      "I. Asensi Tortajada",
      "P. Behera",
      "D. V. Berlea",
      "D. Bortoletto",
      "C. Buttar",
      "V. Dao",
      "L. Fasselt",
      "L. Flores Sanz de Acedo",
      "M. Gazi",
      "L. Gonella",
      "V. Gonzalez",
      "G. Gustavino",
      "S. Haberl",
      "T. Inada",
      "P. Jana",
      "L. Li",
      "H. Pernegger",
      "P. Riedler",
      "W. Snoeys",
      "C. A Solans Sanchez",
      "M. van Rijnbach",
      "M. Vazquez Nunez",
      "A. Vijay",
      "J. Weick",
      "S. Worm"
    ],
    "published": "2025-02-18T23:24:22Z",
    "updated": "2025-09-08T12:27:58Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "J.2"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2506.07213v2",
    "url": "https://arxiv.org/abs/2506.07213v2",
    "pdf_url": "https://arxiv.org/pdf/2506.07213v2.pdf",
    "title": "AttoSHINE: Generation of continuous-wave terawatt-scale attosecond X-ray   pulses at SHINE",
    "abstract": "Attosecond X-ray pulses are a critical tool for tracking ultrafast electron dynamics in condensed matter, molecular systems, and strongly correlated materials. Recent breakthroughs have pushed X-ray free electron lasers (XFELs) into the attosecond domain, significantly surpassing their previous femtosecond capabilities. Building on these advancements, this work investigates the potential of the Shanghai High Repetition Rate XFEL and Extreme Light Facility (SHINE), China's first continuous-wave (CW) XFEL, to generate intense attosecond X-ray pulses, thereby offering transformative capabilities for X-ray science. Through comprehensive start-to-end simulations, we show that SHINE is capable of producing hard X-ray pulses with peak powers reaching the terawatt-scale and average pulse durations of approximately 300 as. This is achieved using a self-chirping scheme within the existing machine configuration, requiring no additional hardware. Our findings demonstrate that CW XFELs can generate intense attosecond X-ray pulses at megahertz repetition rates, opening new opportunities for real-time studies of electronic dynamics in complex systems.",
    "authors": [
      "Bingyang Yan",
      "Chenzhi Xu",
      "Si Chen",
      "Duan Gu",
      "Ye Chen",
      "Jiawei Yan",
      "Haixiao Deng"
    ],
    "published": "2025-06-08T16:32:35Z",
    "updated": "2025-09-08T11:58:34Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.06581v1",
    "url": "https://arxiv.org/abs/2509.06581v1",
    "pdf_url": "https://arxiv.org/pdf/2509.06581v1.pdf",
    "title": "Express Diagnostic of Intense Laser-driven MeV Radiation Source using   Copper Isotopes",
    "abstract": "We explored the generation and diagnosis of high-brightness MeV bremsstrahlung radiation caused by intense beam of relativistic electrons propagating in a tantalum converter. The intense electron beam was produced through direct laser acceleration mechanism in the interaction of relativistic high-power sub-ps laser pulse with near critical density plasma. We propose to detect the divergence angle and photon fluence of high-brightness and high-energy gamma radiation source based on the nuclear activation method. The radioactive 62^Cu was generated through photonuclear reactions 63^Cu(gamma,n) 62^Cu and the subsequent beta^+ decay of 62^Cu was measured to derive characteristics of the gamma radiation source. This method provides an express approach to diagnose the laser-driven MeV radiation source and a potential efficient way to produce 62^Cu isotopes.",
    "authors": [
      "Mingzhe Yang",
      "Ziyao wang",
      "Jieru Ren",
      "Wenqing Wei",
      "Benzheng Chen",
      "Bubo Ma",
      "Shizheng Zhang",
      "Lirong Liu",
      "Fangfang Li",
      "Jie Xiong",
      "Hongwei Yue",
      "Zeyu Lai",
      "Wenxuan Li",
      "Dietter. H. H. Hoffmann",
      "Olga N. Rosmej",
      "Parysatis Tavana",
      "Nikolay. E Andreev",
      "Iskander. R. Umarov",
      "Zhigang Deng",
      "Wei Qi",
      "Shaoyi Wang",
      "Quanping Fan",
      "Zongqiang Yuan",
      "Weiwu Wang",
      "Bo Cui",
      "Xiaohui Zhang",
      "Yuchi Wu",
      "Weimin Zhou",
      "Jingqin Su",
      "Rui Cheng",
      "Yongtao Zhao"
    ],
    "published": "2025-09-08T11:53:08Z",
    "updated": "2025-09-08T11:53:08Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.06537v1",
    "url": "https://arxiv.org/abs/2509.06537v1",
    "pdf_url": "https://arxiv.org/pdf/2509.06537v1.pdf",
    "title": "3D-printed components for electron-ion trapping: Tests of functionality   and ultra-high vacuum compatibility",
    "abstract": "We demonstrate the ultra-high vacuum compatibility of a microwave-driven electron trap and an atomic oven (for atomic beam generation) fabricated through 3D printing via Laser Powder Bed Fusion (L-PBF). The trap integrates into a coaxial microwave cavity, enabling stable, narrow-band, high-amplitude oscillations of the electric field at the electrodes. The design also supports simultaneous trapping of ions. The oven performs well in ultrahigh vacuum (UHV) environments without significant outgassing. In addition to achieving the UHV regime for 3D-printed components, pressure variations and their potential impact on electron-ion trapping experiments were investigated over a month. Our results show that experiments with electrons photodetached from trapped and laser-cooled ions are feasible with the trap and oven manufactured by the L-PBF method. These findings establish a foundation for future experiments in microwave detection and the study of low-energy ion-electron interactions at room temperature.",
    "authors": [
      "Vineet Kumar",
      "Niklas V. Lausti",
      "Jiří Hajnyš",
      "Ivan Hudák",
      "David Motyčka",
      "Adam Jelínek",
      "Michal Hejduk"
    ],
    "published": "2025-09-08T10:43:39Z",
    "updated": "2025-09-08T10:43:39Z",
    "categories": [
      "physics.atom-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2503.04437v3",
    "url": "https://arxiv.org/abs/2503.04437v3",
    "pdf_url": "https://arxiv.org/pdf/2503.04437v3.pdf",
    "title": "Single-photon counting pixel detector for soft X-rays",
    "abstract": "Soft X-ray experiments at synchrotron light sources are essential for a wide range of research fields. However, commercially available detectors for this energy range often cannot deliver the necessary combination of quantum efficiency, signal-to-noise ratio, dynamic range, speed, and radiation hardness within a single system. While hybrid detectors have addressed these challenges effectively in the hard X-ray regime, specifically with single photon counting pixel detectors extensively used in high-performance synchrotron applications, similar solutions are desired for energies below 2 keV.   In this work, we introduce the first single-photon-counting hybrid pixel detector capable of detecting X-ray energies as low as 550 eV, utilizing the internal amplification of Low-Gain Avalanche Diode (LGAD) sensors. This detector is thoroughly characterized in terms of Signal-to-Noise Ratio and Detective Quantum Efficiency. We demonstrate its capabilities through ptychographic imaging at MAX IV 4th generation synchrotron light source at the Fe L$_3$-edge (707 eV), showcasing the enhanced detection performance of the system. This development sets a new benchmark for soft X-ray applications at synchrotrons, paving the way for significant advancements in imaging and analysis at lower photon energies.",
    "authors": [
      "Filippo Baruffaldi",
      "Anna Bergamaschi",
      "Maurizio Boscardin",
      "Martin Brueckner",
      "Tim A. Butcher",
      "Maria Carulla",
      "Matteo Centis Vignali",
      "Roberto Dinapoli",
      "Simone Finizio",
      "Erik Froejdh",
      "Dominic Greiffenberg",
      "Aldo Mozzanica",
      "Giovanni Paternoster",
      "Nicholas W. Phillips",
      "Jörg Raabe",
      "Bernd Schmitt",
      "Jiaguo Zhang"
    ],
    "published": "2025-03-06T13:51:58Z",
    "updated": "2025-09-08T10:42:10Z",
    "categories": [
      "physics.ins-det",
      "physics.app-ph"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1038/s42005-025-02240-9"
  },
  {
    "arxiv_id": "2507.11593v3",
    "url": "https://arxiv.org/abs/2507.11593v3",
    "pdf_url": "https://arxiv.org/pdf/2507.11593v3.pdf",
    "title": "Characterizing the Delivered Spill Structure of Medical Proton and   Carbon-Ion Beams at MedAustron using a High Frequency Silicon Carbide Readout",
    "abstract": "Medical synchrotrons are often used for testing instrumentation in high-energy physics or non-clinical research in medical physics. In many applications of medical synchrotrons, such as microdosimetry and ion imaging, precise knowledge of the spill structure and instantaneous particle rate is crucial. Conventional ionization chambers, while omnipresent in clinical settings, suffer from limitations in charge resolution and integration time, making single-particle detection at high dose rates unfeasible. To address these limitations, we present a beam detection setup based on a silicon carbide (SiC) sensor and a monolithic microwave integrated circuit (MMIC), capable of detecting single particles with a full width at half maximum (FWHM) pulse duration of 500 ps. At the MedAustron ion therapy center, we characterized the spill structure of proton and carbon-ion beams delivered to the irradiation room beyond the timescale of the maximum ion revolution frequency in the synchrotron. The resulting data offer valuable insights into the beam intensity at small time scales and demonstrate the capabilities of SiC-based systems for high-flux beam monitoring.",
    "authors": [
      "Matthias Knopf",
      "Andreas Gsponer",
      "Matthias Kausel",
      "Simon Waid",
      "Sebastian Onder",
      "Stefan Gundacker",
      "Daniel Radmanovac",
      "Giulio Magrin",
      "Thomas Bergauer",
      "Albert Hirtl"
    ],
    "published": "2025-07-15T16:21:23Z",
    "updated": "2025-09-08T10:21:48Z",
    "categories": [
      "physics.ins-det",
      "physics.med-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2505.17686v2",
    "url": "https://arxiv.org/abs/2505.17686v2",
    "pdf_url": "https://arxiv.org/pdf/2505.17686v2.pdf",
    "title": "Sub-keV Electron Recoil Calibration for Macroscopic Cryogenic   Calorimeters using a Novel X-ray Fluorescence Source",
    "abstract": "Percent-level calibration of cryogenic macro-calorimeters with energy thresholds below 100~eV are crucial for light Dark Matter (DM) searches and reactor neutrino studies based on coherent elastic neutrino-nucleus scattering (CEvNS). This paper presents a novel calibration source based on X-ray fluorescence (XRF) of light elements. It uses a $^{55}$Fe source to irradiate a two-staged target arrangement, emitting characteristic emission lines from 677\\,eV to 6.5\\,keV. We demonstrate the potential of this new XRF source to calibrate a 0.75 gram CaWO$_4$ crystal of the NUCLEUS and CRAB experiments. Additionally, we introduce CryoLab, an advanced analysis tool for cryogenic detector data, featuring robust methods for data processing, calibration, and high-level analysis, implemented in MATLAB and HDF5. We also present a phenomenological model for energy resolution, which incorporates statistical contributions, systematic effects, and baseline noise, enabling a novel approach to evaluating athermal phonon collection efficiency in macro-calorimeters based on transition edge sensors (TES).",
    "authors": [
      "H. Abele",
      "G. Angloher",
      "B. Arnold",
      "M. Atzori Corona",
      "A. Bento",
      "E. Bossio",
      "J. Burkhart",
      "F. Cappella",
      "M. Cappelli",
      "N. Casali",
      "R. Cerulli",
      "A. Cruciani",
      "G. Del Castello",
      "M. del Gallo Roccagiovine",
      "S. Dorer",
      "A. Erhart",
      "M. Friedl",
      "S. Fichtinger",
      "V. M. Ghete",
      "M. Giammei",
      "C. Goupy",
      "D. Hauff",
      "F. Jeanneau",
      "E. Jericha",
      "M. Kaznacheeva",
      "A. Kinast",
      "H. Kluck",
      "A. Langenkämper",
      "T. Lasserre",
      "D. Lhuillier",
      "M. Mancuso",
      "R. Martin",
      "B. Mauri",
      "A. Mazzolari",
      "L. McCallin",
      "H. Neyrial",
      "C. Nones",
      "L. Oberauer",
      "T. Ortmann",
      "L. Pattavina",
      "L. Peters",
      "F. Petricca",
      "W. Potzel",
      "F. Pröbst",
      "F. Pucci",
      "F. Reindl",
      "M. Romagnoni",
      "J. Rothe",
      "N. Schermer",
      "J. Schieck",
      "S. Schönert",
      "C. Schwertner",
      "L. Scola",
      "G. Soum-Sidikov",
      "L. Stodolsky",
      "R. Strauss",
      "M. Tamisari",
      "R. Thalmeier",
      "C. Tomei",
      "M. Vignati",
      "M. Vivier",
      "A. Wex",
      "K. v. Mirbach",
      "V. Wagner"
    ],
    "published": "2025-05-23T09:56:01Z",
    "updated": "2025-09-08T08:40:19Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1007/s10909-025-03330-2"
  },
  {
    "arxiv_id": "2509.06437v1",
    "url": "https://arxiv.org/abs/2509.06437v1",
    "pdf_url": "https://arxiv.org/pdf/2509.06437v1.pdf",
    "title": "Particle acceleration up to the synchrotron burn-off limit in   relativistic magnetized turbulence",
    "abstract": "In high-energy astrophysics, interpreting observed spectra hinges on understanding the competition between energy gains and radiative losses. To progress along these lines, we report on particle-in-cell simulations of particle acceleration in relativistic, magnetized turbulent pair plasmas including synchrotron radiative losses. Our key finding is that the particle energy spectrum does not terminate at this maximal energy but extends beyond with a steepened spectrum, up to the synchrotron burn-off limit where particles cool within a gyrotime. For our adopted parameters (magnetization $\\sigma \\approx 1 $ and amplitude $\\delta B/B_0\\simeq 1$), the particle distribution follows ${\\rm d}n/{\\rm d}\\gamma\\propto \\gamma^{-s}$ with $s\\simeq 3$ below the predicted maximal energy, then steepens to $s\\simeq 4$ above. The particle distribution and the radiated synchrotron spectra display strong variability near the cutoff energy down to timescales well below the largest eddy turn-around time. We substantiate our results by demonstrating that the acceleration rate itself displays a broken powerlaw-like distribution whose maximal value is the gyrofrequency. The highest energy particles are accelerated by a generalized Fermi process in ideal electric fields, driven by a gradient of the $4$--velocity field $u_E$ of the magnetic field lines of relativistic amplitude, $\\delta u_E \\gtrsim c$, ordered on a scale comparable to the particle gyroradius. We contend that this is a generic feature of relativistic, large-amplitude turbulence. Lastly, we apply our results to the Crab nebula, which exhibits a hierarchy of characteristic Lorentz factors similar to that studied here. We conclude that stochastic acceleration in this environment is a promising mechanism for explaining the highest-energy part of the synchrotron spectral energy distribution, and its variability. [Abridged]",
    "authors": [
      "M. Lemoine",
      "V. Bresci",
      "L. Gremillet"
    ],
    "published": "2025-09-08T08:34:10Z",
    "updated": "2025-09-08T08:34:10Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2509.06432v1",
    "url": "https://arxiv.org/abs/2509.06432v1",
    "pdf_url": "https://arxiv.org/pdf/2509.06432v1.pdf",
    "title": "Study of a coaxial vacuum arc thruster plume and its interaction with   applied magnetic field",
    "abstract": "A hybrid model where ions are treated as particles and electrons with fluid equations for magnetized electron flux is adapted in order to simulate a vacuum arc source. This source is a candidate for solid propellant propulsion system of micro- and nano-satellites. We show preliminary results of the plume and interelectrode region properties with and without the influence of an imposed magnetic field. We compare the results with experimental data, and we find that the magnetic collimation is overestimated in the simulation",
    "authors": [
      "M Jimenez Diaz",
      "L Garrigues",
      "G J M Hagelaar",
      "F Gaboriau",
      "L Liard",
      "L Herrero",
      "A Blanchet"
    ],
    "published": "2025-09-08T08:26:12Z",
    "updated": "2025-09-08T08:26:12Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.06366v1",
    "url": "https://arxiv.org/abs/2509.06366v1",
    "pdf_url": "https://arxiv.org/pdf/2509.06366v1.pdf",
    "title": "Effect of superthermal electrons on the Quantum electron acoustic double   layers in dense astrophysical plasmas",
    "abstract": "Electron acoustic double layers (EADLs) have been investigated in four component unmagnetized dense quantum plasmas consisting of stationary background ions and two electron populations, cold and hot, with the superthermal kappa distributed electrons. Using the quantum hydrodynamic (QHD) model and the reductive perturbation technique, a generalized Korteweg de Vries (KdV) equation was derived, and stationary analytical solutions were obtained. The analysis revealed that superthermal electrons substantially influence the amplitude, width, and polarity of EADLs. Numerical results indicated that decreasing the spectral index kappa or increasing the relative density of kappa electrons to hot electrons intensifies nonlinear effects, producing stronger compressive and rarefactive structures. It is also found that kappa plays a more dominant role than the density ratio in controlling EADL properties in dense astrophysical environments.",
    "authors": [
      "Aakanksha Singh",
      "Punit Kumar"
    ],
    "published": "2025-09-08T06:44:14Z",
    "updated": "2025-09-08T06:44:14Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.06276v1",
    "url": "https://arxiv.org/abs/2509.06276v1",
    "pdf_url": "https://arxiv.org/pdf/2509.06276v1.pdf",
    "title": "A Compact Two-Dimensional Radiation Detector for Educational   Applications",
    "abstract": "Recent advances in low-cost, portable cosmic-ray detectors have broadened citizen-science engagement in particle physics studies. Imaging applications such as muography, however, remain largely inaccessible because existing detectors typically require tens to hundreds of sensors, making them costly and complex. This gap underscores the need for a compact imaging detector.   In this study, we developed SAKURA, a palm-sized two-dimensional muon scintillation detector that uses only four silicon photomultipliers (SiPMs) and can be built for less than 1,000 USD. Its spatial resolution was evaluated using a 5 GeV/c muon beam at CERN's T10 beamline in September 2024, yielding 13.4 mm along the x-axis and 7.48 mm along the y-axis. The entire study, including designing and testing the detector, and analysing data, was undertaken by high school students, demonstrating that SAKURA makes radiation imaging accessible and practical even for non-specialists with the help of some professional scientists.",
    "authors": [
      "Chiori Matsushita",
      "Mihiro Nukiwa",
      "Aoi Atobe",
      "Yuzuka Sasaki",
      "Manami Sawai",
      "Rikako Kono",
      "Seyma Esen",
      "Martin Schwinzerl",
      "Kazuo S. Tanaka"
    ],
    "published": "2025-09-08T01:56:01Z",
    "updated": "2025-09-08T01:56:01Z",
    "categories": [
      "physics.ins-det",
      "physics.ed-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.05456v4",
    "url": "https://arxiv.org/abs/2507.05456v4",
    "pdf_url": "https://arxiv.org/pdf/2507.05456v4.pdf",
    "title": "Constraints on the magnetic field evolution in tokamak power plants",
    "abstract": "Issues of tokamak power plants, such as maximum possible length of a pulse of fusion power and the evolution of the current profile towards disruptive states, are tightly constrained by the evolution equation for the magnetic field. This equation follows from Faraday's Law and the purely mathematical relation between the magnetic and the electric fields. The validity of detailed simulations is tested by consistency with Faraday's Law, not the other way around. The high sensitivity of tokamaks to variations in the radial profile of the loop voltage make them disruption prone on a shorter timescale than the time that they can be maintained by a solenoid. The frequency of disruptions and the temporal decay of $n\\tau_ET$ in high performance tokamak experiments show the importance of careful profile control. Feasible computational simulations from startup to shutdown for prototype plasmas could greatly clarify these constraints and the feasibility of their avoidance. Clarification could also be obtained by operating existing experiments in a way that simulates power-plant constraints. This paper has two purposes: (1) Illustrate issues on which research should be focused for the credibility tokamak power plants. (2) Encourage thought on the allocation of resources among the various fusion concepts to minimize the time and the cost to the achievement of practical fusion power.",
    "authors": [
      "Allen H Boozer"
    ],
    "published": "2025-07-07T20:17:20Z",
    "updated": "2025-09-07T20:27:58Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.06186v1",
    "url": "https://arxiv.org/abs/2509.06186v1",
    "pdf_url": "https://arxiv.org/pdf/2509.06186v1.pdf",
    "title": "Implementation of Prototype Permanent Microundulators",
    "abstract": "We report the implementation of two types of helical microundulators with a 6 mm period, built from axially magnetized helices fabricated from a single piece of rare-earth magnet. The first device, composed of two oppositely magnetized longitudinal helices, produces a transverse on-axis field exceeding 0.93 T. The second, a hybrid design with two oppositely longitudinally pre-magnetized rare-earth helices alternating with two unmagnetized steel helices, reaches about 1.5 T on axis. Both devices have a 1 mm bore, which required dedicated field-measurement techniques. When used in compact FELs from terahertz to X-ray, such microundulators can provide higher electron oscillation amplitude and radiated power than planar microundulators of similar period. As an illustrative case, we present an ultra-compact SASE XFEL concept in which the studied hybrid helical microundulator can provide approximately 48 GW of radiation power at a wavelength of about 5 angstrom.",
    "authors": [
      "Eyal Magory",
      "Vladimir L. Bratman",
      "Ahiya Steiner",
      "Nezah Balal"
    ],
    "published": "2025-09-07T19:35:24Z",
    "updated": "2025-09-07T19:35:24Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.06088v1",
    "url": "https://arxiv.org/abs/2509.06088v1",
    "pdf_url": "https://arxiv.org/pdf/2509.06088v1.pdf",
    "title": "Time-Embedded Convolutional Neural Networks for Modeling Plasma Heat   Transport",
    "abstract": "We introduce a time-embedded convolutional neural network (TCNN) for modeling spatiotemporal heat transport in plasmas, particularly under strongly nonlocal conditions. In our earlier work, the LMV-Informed Neural Network (LINN) (Luo et al., arXiv:2506.16619) combined prior knowledge from the LMV model with kinetic Particle-in-Cell (PIC) data to improve kernel-based heat-flux predictions. While effective under moderately nonlocal conditions, LINN produced physically inconsistent kernels in strongly time-dependent regimes due to its reliance on the quasi-stationary LMV formulation. To overcome this limitation, TCNN is designed to capture the coupled evolution of both the normalized heat flux and the characteristic nonlocality parameter using a unified neural architecture informed by underlying physical principles. Trained on fully kinetic PIC simulations, TCNN accurately reproduces nonlocal dynamics across a broad range of collisionalities. Our results demonstrate that the combination of time modulation, coupled prediction, and convolutional depth significantly enhances predictive performance, offering a data-driven yet physically consistent framework for multiscale plasma transport problems.",
    "authors": [
      "Mufei Luo",
      "Charles Heaton",
      "Yizhen Wang",
      "Daniel Plummer",
      "Mila Fitzgerald",
      "Francesco Miniati",
      "Sam M. Vinko",
      "Gianluca Gregori"
    ],
    "published": "2025-09-07T15:04:39Z",
    "updated": "2025-09-07T15:04:39Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.07808v2",
    "url": "https://arxiv.org/abs/2506.07808v2",
    "pdf_url": "https://arxiv.org/pdf/2506.07808v2.pdf",
    "title": "Thermal Radiation Exchange between Nanoparticles Heated by Arc Discharge",
    "abstract": "The heating of particles by plasma radiation plays a critical role in space science involving dusty plasma as well as in industrial processes such as plasma vapor deposition, microchip production, etching and plasma fusion. Numerical modeling of radiation heat transfer from plasma to nano-scale particles includes exchange of scattered thermal radiation between particles-an effect that was neglected in prior studies in which temperature of particles was estimated. Thermal modeling of gas loaded with nanoparticles differs from a typical multiphase flow, where particles are assumed to be in thermal equilibrium with the surrounding gas. In contrast, the temperature of nanoparticles heated by radiation is significantly higher than the local gas temperature. The nanoparticles volume heating by radiation is markedly different from conventional surface heating experience by macroscale particles. The larger particles are heated to higher temperatures than smaller ones. The study includes numerical modeling of thermal radiation scattered by particles in the Rayleigh regime in where particles radii are much smaller compared to the radiation wavelength and the distance between particles is larger than the dominant radiation wavelength. The study investigates the effects of reduction in conduction heat flux by reducing the gas pressure and using alternating noble gases. Additionally, it investigates the role of enhancement of radiation heat flux from the arc. The computational results show that the re-radiation by larger, heated nanoparticles is important to obtain the accurate temperature of particles. This inter-particle thermal interaction leads to higher temperatures in smaller particles than models assuming thermally isolated particles would predict.",
    "authors": [
      "A. Povitsky",
      "M. N. Shneider"
    ],
    "published": "2025-06-09T14:36:47Z",
    "updated": "2025-09-07T13:39:48Z",
    "categories": [
      "physics.plasm-ph",
      "physics.flu-dyn"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.06021v1",
    "url": "https://arxiv.org/abs/2509.06021v1",
    "pdf_url": "https://arxiv.org/pdf/2509.06021v1.pdf",
    "title": "Resonance density range of absolute two-plasmon decay instability",
    "abstract": "We present a new insight into absolute two-plasmon decay (TPD) instability in nonuniform plasmas by identifying the resonance density range as the key parameter governing the growth of the resonant absolute modes. This range is defined as the density interval within which these resonant modes still exhibit growth in homogeneous plasmas. This range properly characterizes the spatial growth region of the resonant absolute modes in a series of linear fluid simulations across broad parameter spaces. Building on this insight, we investigate the absolute growth of TPD modes driven by laser pulses with intensity modulations, a common feature in broadband lasers used to suppress laser plasma instabilities. We establish the relationship between the resonance density range and the threshold time interval between intensity peaks, beyond which absolute growth is suppressed.",
    "authors": [
      "C. Yao",
      "J. Li",
      "L. Hao",
      "R. Yan",
      "Q. Jia",
      "Y-K. Ding",
      "J. Zheng"
    ],
    "published": "2025-09-07T11:35:09Z",
    "updated": "2025-09-07T11:35:09Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.18145v2",
    "url": "https://arxiv.org/abs/2508.18145v2",
    "pdf_url": "https://arxiv.org/pdf/2508.18145v2.pdf",
    "title": "Spiral Tuning of Wire-metamaterial Cavity for Plasma Haloscope",
    "abstract": "Axions are hypothetical particles that provide a compelling solution to two major mysteries in modern physics: the strong CP problem and the nature of dark matter. The plasma haloscope has been proposed as a promising approach for probing the higher-mass regime for dark matter axions by employing a periodic arrangement of conducting wires. In this work, we introduce a novel tuning mechanism for such wire-based structures by arranging the wires into a spiral configuration. This design enables continuous frequency tuning of 25% with a single central rotation while maintaining the form factor. It also achieves scanning speeds several times faster than traditional tuning approaches, primarily due to the circular perimeter geometry, making it well suited for solenoidal magnet bores. To validate the concept, we fabricated a prototype cavity with six spiral arms and experimentally demonstrated its feasibility, obtaining frequency tuning in close agreement with numerical simulations.",
    "authors": [
      "Jacob Lindahl",
      "Rustam Balafendiev",
      "Gagandeep Kaur",
      "Gaganpreet Singh",
      "Andrea Gallo Rosso",
      "Jan Conrad",
      "Jon E. Gudmundsson",
      "Junu Jeong"
    ],
    "published": "2025-08-25T15:53:53Z",
    "updated": "2025-09-07T07:56:31Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2509.05948v1",
    "url": "https://arxiv.org/abs/2509.05948v1",
    "pdf_url": "https://arxiv.org/pdf/2509.05948v1.pdf",
    "title": "Upgrades of the ATLAS Zero Degree Calorimeter System for Run 3 at the   Large Hadron Collider",
    "abstract": "Experimental studies of ultra-relativistic heavy ion collisions at the Large Hadron Collider (LHC) depend crucially on Zero Degree Calorimeters (ZDCs) that measure neutrons produced at near-beam rapidity in nucleus-nucleus collisions. In hadronic nuclear collisions these neutrons are mainly spectator neutrons, those that do not scatter from opposing nucleons during the collision. As a result, the ZDCs provide a vital probe of heavy ion collision geometry. The ZDCs are also essential in the study of ultra-peripheral collisions that are initiated by photons associated with the electric fields of one or both nuclei. Coherent photon emission typically leaves the photon emitter intact, making the observation of no ZDC signal, on one or both sides, a tag of such processes. The ATLAS ZDCs, built prior to Run 1 were substantially upgraded for LHC Run 3. The primary upgrades included replacement of the quartz Cherenkov radiator with $\\text{H}_2$-doped fused silica rods; installation of fast air-core signal cables between the ZDC and the ATLAS USA15 cavern; new LED-based calibration system; and new electronics implemented for readout and fully-digital triggering. The ZDCs were also augmented with new \"Reaction Plane Detectors\" (RPDs) designed to measure the transverse centroid of multi-neutron showers to allow event-by-event reconstruction of the directed-flow plane in nuclear collisions. The Run~3 ZDC detectors, including the RPDs, are described in detail with emphasis on aspects that are new for Run~3.",
    "authors": [
      "Giulio Avoni",
      "Marco Bruschi",
      "Gianluca Canale",
      "Zvi Citron",
      "Brian Cole",
      "Eitan Dahle",
      "Bartosz Dziedzic",
      "Bar Glik",
      "Matthias Grosse-Perdekamp",
      "Yhan Guo",
      "Krzysztof Korcy",
      "Matthew Hoppesch",
      "Mason Housenga",
      "Chad Lantz",
      "Yi Liu",
      "Riccardo Longo",
      "Samantha Lund",
      "Daniel MacLean",
      "Stefano Meneghini",
      "Marco Milovanovic",
      "Goran Mladenovic",
      "Soumya Mohapatra",
      "Farah Mohammed Rafee",
      "Yftach Moyal",
      "Carla Sbarra",
      "Antonio Sbrizzi",
      "Blair Seidlitz",
      "Shir Shenkar",
      "Peter Steinberg",
      "Lion Sudit",
      "Daniel Valuch",
      "Kristopher Young"
    ],
    "published": "2025-09-07T06:59:03Z",
    "updated": "2025-09-07T06:59:03Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.05859v1",
    "url": "https://arxiv.org/abs/2509.05859v1",
    "pdf_url": "https://arxiv.org/pdf/2509.05859v1.pdf",
    "title": "Dissociative recombination of NeH+ with low-energy electrons:   Multichannel quantum defect theory including non-adiabatic couplings",
    "abstract": "Theoretical investigation of the dissociative recombination (DR) of NeH+ with low-energy electrons in the regime where the process occurs without direct potential energy curve crossings is presented. The calculations are performed using multichannel quantum defect theory, incorporating non-adiabatic couplings between electronic states. Unlike the previous treatment of the DR of HeH+, where only first-order radial couplings A(R) were considered, our formulation also incorporates the second-order terms B(R), together with a radial density of states \\b{eta}{\\nu} (R) to describe the transition into the ionization continuum. This development uses a large number of potential energy curves and non-adiabatic couplings of NeH characterized by us previously, enabling a consistent modeling of the DR process. The resulting cross sections show good agreement with the available experimental data and fill a gap in theoretical data below 4.5 eV, where no detailed quantum calculations are currently available.",
    "authors": [
      "Riyad Hassaine",
      "Janos Zsolt Mezei",
      "Dahbia Talbi",
      "Jonathan Tennyson",
      "Ioan F. Schneider"
    ],
    "published": "2025-09-06T22:54:12Z",
    "updated": "2025-09-06T22:54:12Z",
    "categories": [
      "physics.atm-clus",
      "astro-ph.IM",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.atm-clus"
  },
  {
    "arxiv_id": "2509.05799v1",
    "url": "https://arxiv.org/abs/2509.05799v1",
    "pdf_url": "https://arxiv.org/pdf/2509.05799v1.pdf",
    "title": "Hybrid Fourier Neural Operator-Plasma Fluid Model for Fast and Accurate   Multiscale Simulations of High Power Microwave Breakdown",
    "abstract": "Modeling and simulation of High Power Microwave (HPM) breakdown, a multiscale phenomenon, is computationally expensive and requires solving Maxwell's equations (EM solver) coupled with a plasma continuity equation (plasma solver). In this work, we present a hybrid modeling approach that combines the accuracy of a differential equation-based plasma fluid solver with the computational efficiency of FNO (Fourier Neural Operator) based EM solver. Trained on data from an in-house FDTD-based plasma-fluid solver, the FNO replaces computationally expensive EM field updates, while the plasma solver governs the dynamic plasma response. The hybrid model is validated on microwave streamer formation, due to diffusion ionization mechanism, in a 2D scenario for unseen incident electric fields corresponding to entirely new plasma streamer simulations not included in model training, showing excellent agreement with FDTD based fluid simulations in terms of streamer shape, velocity, and temporal evolution. This hybrid FNO based strategy delivers significant acceleration of the order of 60X compared to traditional simulations for the specified problem size and offers an efficient alternative for computationally demanding multiscale and multiphysics simulations involved in HPM breakdown. Our work also demonstrate how such hybrid pipelines can be used to seamlessly to integrate existing C-based simulation codes with Python-based machine learning frameworks for simulations of plasma science and engineering problems.",
    "authors": [
      "Kalp Pandya",
      "Pratik Ghosh",
      "Ajeya Mandikal",
      "Shivam Gandha",
      "Bhaskar Chaudhury"
    ],
    "published": "2025-09-06T18:24:33Z",
    "updated": "2025-09-06T18:24:33Z",
    "categories": [
      "physics.plasm-ph",
      "cs.AI",
      "cs.LG",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.05791v1",
    "url": "https://arxiv.org/abs/2509.05791v1",
    "pdf_url": "https://arxiv.org/pdf/2509.05791v1.pdf",
    "title": "Energy partitioning in electrostatic discharge with variable series load   resistor",
    "abstract": "This paper presents an experimental investigation into the energy partitioning of quasi-static electrostatic discharge (ESD) events in air, a scenario in which the discharge occurs across a fixed gap. We systematically characterize the energy transferred to a series victim load across a broad range of resistances (0.1 to 10,000Ohm) and circuit parameters, including capacitance and gap length. Our results show that the fraction of stored energy delivered to the victim load is largely independent of gap length. We demonstrate that the classic Rompe-Weizel spark resistance model effectively predicts the scaling of this energy transfer, establishing a clear link between spark resistance and energy partitioning. These findings provide a valuable, predictive framework for guiding safety requirements for sensitive electronic components and energetic materials and will inform the development of more accurate circuit models for ESD events.",
    "authors": [
      "Claudia A. M. Schrama",
      "Calvin Bavor",
      "P. David Flammer",
      "Charles G. Durfee"
    ],
    "published": "2025-09-06T17:59:03Z",
    "updated": "2025-09-06T17:59:03Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.05649v1",
    "url": "https://arxiv.org/abs/2509.05649v1",
    "pdf_url": "https://arxiv.org/pdf/2509.05649v1.pdf",
    "title": "Hanbury Brown-Twiss interference with massively parallel spectral   multiplexing for broadband light",
    "abstract": "Two-photon interference in the spectral domain is a powerful resource for quantum technologies, enabling both precision measurements and scalable entanglement distribution. Here, we report the first demonstration of massively parallel, wavelength-resolved photon bunching, revealing Hanbury Brown-Twiss correlations across 100 independent spectral channels. These observations are enabled by a fast, data-driven single-photon spectrometer that achieves 40 pm spectral and 40 ps temporal resolution over a 10 nm bandwidth, allowing simultaneous access to spectro-temporal photon correlations without the need for narrowband filtering. This approach preserves photon flux while enabling high-dimensional quantum interference measurements across a broad spectrum. Our results establish frequency-multiplexed two-photon interference as a scalable and throughput-efficient platform for quantum-enhanced photonic technologies, with applications ranging from stellar intensity interferometry to broadband entanglement swapping in quantum networks.",
    "authors": [
      "Sergei Kulkov",
      "Ondrej Matousek",
      "Lou-Ann Pestana De Sousa",
      "Lada Radmacherova",
      "Dmitrij Sevaev",
      "Yuri Kurochkin",
      "Stephen Vintskevich",
      "Ermanno Bernasconi",
      "Claudio Bruschini",
      "Tommaso Milanese",
      "Edoardo Charbon",
      "Peter Svihra",
      "Andrei Nomerotski"
    ],
    "published": "2025-09-06T09:00:49Z",
    "updated": "2025-09-06T09:00:49Z",
    "categories": [
      "quant-ph",
      "physics.ins-det"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2509.05528v1",
    "url": "https://arxiv.org/abs/2509.05528v1",
    "pdf_url": "https://arxiv.org/pdf/2509.05528v1.pdf",
    "title": "Reconstruction of cosmic-ray muon events with CUORE",
    "abstract": "We report the in-situ 3D reconstruction of through-going muons in the CUORE experiment, a cryogenic calorimeter array searching for neutrinoless double beta ($0\\nu\\beta\\beta$) decay, leveraging the segmentation of the detector. Due to the slow time response of the detector, time-of-flight estimation is not feasible. Therefore, the track reconstruction is performed using a multi-objective optimization algorithm that relies on geometrical information from the detector as a whole. We measure the integral flux of cosmic-ray muons underground at the {\\it Laboratori Nazionali del Gran Sasso}, and find our value to be in good agreement with other experiments that have performed a similar measurement. To our knowledge, this work represents the first demonstration of 3D particle tracking and reconstruction of through-going muons with per-event angular determination in a millikelvin cryogenic detector array. The analysis performed for this work will be critical for validating the muon-related background in CUPID, a next-generation $0\\nu\\beta\\beta$ experiment, and for follow-up studies on detector response and on delayed products induced by cosmic-ray muons.",
    "authors": [
      "CUORE Collaboration",
      "D. Q. Adams",
      "C. Alduino",
      "K. Alfonso",
      "A. Armatol",
      "F. T. Avignone III",
      "O. Azzolini",
      "G. Bari",
      "F. Bellini",
      "G. Benato",
      "M. Beretta",
      "M. Biassoni",
      "A. Branca",
      "D. Brandani",
      "C. Brofferio",
      "C. Bucci",
      "J. Camilleri",
      "A. Caminata",
      "A. Campani",
      "J. Cao",
      "S. Capelli",
      "L. Cappelli",
      "L. Cardani",
      "P. Carniti",
      "N. Casali",
      "D. Chiesa",
      "Y. Chu",
      "M. Clemenza",
      "S. Copello",
      "O. Cremonesi",
      "R. J. Creswick",
      "A. D'Addabbo",
      "I. Dafinei",
      "S. Dell'Oro",
      "S. Di Domizio",
      "S. Di Lorenzo",
      "T. Dixon",
      "D. Q. Fang",
      "M. Faverzani",
      "E. Ferri",
      "F. Ferroni",
      "E. Fiorini",
      "M. A. Franceschi",
      "S. J. Freedman",
      "S. H. Fu",
      "B. K. Fujikawa",
      "S. Ghislandi",
      "A. Giachero",
      "M. Girola",
      "L. Gironi",
      "A. Giuliani",
      "P. Gorla",
      "C. Gotti",
      "P. V. Guillaumon",
      "T. D. Gutierrez",
      "K. Han",
      "E. V. Hansen",
      "K. M. Heeger",
      "D. L. Helis",
      "H. Z. Huang",
      "M. T. Hurst",
      "G. Keppel",
      "Yu. G. Kolomensky",
      "R. Kowalski",
      "R. Liu",
      "L. Ma",
      "Y. G. Ma",
      "L. Marini",
      "R. H. Maruyama",
      "D. Mayer",
      "M. N. Moore",
      "T. Napolitano",
      "M. Nastasi",
      "C. Nones",
      "E. B. Norman",
      "A. Nucciotti",
      "I. Nutini",
      "T. O'Donnell",
      "M. Olmi",
      "S. Pagan",
      "C. E. Pagliarone",
      "L. Pagnanini",
      "M. Pallavicini",
      "L. Pattavina",
      "M. Pavan",
      "G. Pessina",
      "V. Pettinacci",
      "C. Pira",
      "S. Pirro",
      "E. G. Pottebaum",
      "S. Pozzi",
      "E. Previtali",
      "A. Puiu",
      "S. Puranam",
      "S. Quitadamo",
      "A. Ressa",
      "C. Rosenfeld",
      "B. Schmidt",
      "R. Serino",
      "A. Shaikina",
      "V. Sharma",
      "V. Singh",
      "M. Sisti",
      "D. Speller",
      "P. T. Surukuchi",
      "L. Taffarello",
      "C. Tomei",
      "A. Torres",
      "J. A. Torres",
      "K. J. Vetter",
      "M. Vignati",
      "S. L. Wagaarachchi",
      "R. Wang",
      "B. Welliver",
      "J. Wilson",
      "K. Wilson",
      "L. A. Winslow",
      "F. Xie",
      "T. Zhu",
      "S. Zimmermann",
      "S. Zucchelli"
    ],
    "published": "2025-09-05T22:40:57Z",
    "updated": "2025-09-05T22:40:57Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.05518v1",
    "url": "https://arxiv.org/abs/2509.05518v1",
    "pdf_url": "https://arxiv.org/pdf/2509.05518v1.pdf",
    "title": "Perpendicular ion heating in turbulence and reconnection: magnetic   moment breaking by coherent fluctuations",
    "abstract": "We study the interaction of an ion with a fluctuation in the electromagnetic fields that is localized in both space and time. We study the scale-dependence of the interaction in both space and time, deriving a generic form for the ion's energy change, which involves an exponential cutoff based on the characteristic timescale of the electromagnetic fluctuation. This leads to diffusion in energy in both $v_\\perp$ and $v_\\parallel$. We show how to apply our results to general plasma physics phenomena, and specifically to Alfv\\'enic turbulence and to reconnection. Our theory can be viewed as a unification of previous models of stochastic ion heating, cyclotron heating, and reconnection heating in a single theoretical framework.",
    "authors": [
      "Alfred Mallet",
      "Kristopher G. Klein",
      "Benjamin D. G. Chandran",
      "Tamar Ervin",
      "Trevor A. Bowen"
    ],
    "published": "2025-09-05T22:01:10Z",
    "updated": "2025-09-05T22:01:10Z",
    "categories": [
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2411.05737v3",
    "url": "https://arxiv.org/abs/2411.05737v3",
    "pdf_url": "https://arxiv.org/pdf/2411.05737v3.pdf",
    "title": "Accurate Unsupervised Photon Counting from Transition Edge Sensor   Signals",
    "abstract": "We compare methods for signal classification applied to voltage traces from transition-edge sensors (TES) which are photon-number resolving detectors fundamental for accessing quantum advantages in information processing, communication and metrology. We quantify the impact of numerical analysis on the distinction of such signals. Furthermore, we explore dimensionality reduction techniques to create interpretable and precise photon-number embeddings. We demonstrate that the preservation of local data structures of some nonlinear methods is an accurate way to achieve unsupervised classification of TES traces. We do so by considering a confidence metric that quantifies the overlap of the photon-number clusters inside a latent space. Furthermore, we demonstrate that for our dataset previous methods such as the signal's area and principal component analysis can resolve up to 16 photons with confidence above $90\\%$ while nonlinear techniques can resolve up to 21 with the same confidence threshold. Also, we showcase implementations of neural networks to leverage information within local structures, aiming to increase confidence in assigning photon numbers. Finally, we demonstrate the advantage of some nonlinear methods to detect and remove outlier signals.",
    "authors": [
      "Nicolas Dalbec-Constant",
      "Guillaume Thekkadath",
      "Duncan England",
      "Benjamin Sussman",
      "Thomas Gerrits",
      "Nicolás Quesada"
    ],
    "published": "2024-11-08T17:53:27Z",
    "updated": "2025-09-05T19:45:55Z",
    "categories": [
      "physics.ins-det",
      "physics.optics",
      "quant-ph"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1103/c11p-d13h"
  },
  {
    "arxiv_id": "2509.05455v1",
    "url": "https://arxiv.org/abs/2509.05455v1",
    "pdf_url": "https://arxiv.org/pdf/2509.05455v1.pdf",
    "title": "Room Temperature Single Photon Detection at 1550 nm using van der Waals   Heterojunction",
    "abstract": "Single-photon detectors (SPDs) are crucial in applications ranging from space, biological imaging to quantum communication and information processing. The SPDs that operate at room temperature are of particular interest to broader application space as the energy overhead introduced by the cryogenic cooling can be avoided. Although silicon-based single photon avalanche diodes (SPADs) are well matured and operate at room temperature, the bandgap limitation restricts their operation at telecommunication wavelength (1550 nm) and beyond. InGaAs-based SPADs, on the other hand, are sensitive to 1550 nm photons, but suffer from relatively lower efficiency, high dark count rate, afterpulsing probability, and pose hazards to the environment from the fabrication process. In this work, we demonstrate how we can leverage the properties of nanomaterials to address these challenges and realise a room temperature single-photon detector capable of operating at 1550 nm. We achieve this by coupling a low bandgap ($\\sim 350~meV$) absorber (black phosphorus) to a sensitive van der Waals probe that is capable of detecting discrete electron fluctuation. We optimize the device for operation at $1550~nm$ and demonstrate an overall quantum efficiency of $21.4\\%$ (estimated as $42.8\\%$ for polarized light), and a minimum dark count of $\\sim 720~Hz$ at room temperature.",
    "authors": [
      "Nithin Abraham",
      "Kenji Watanabe",
      "Takashi Taniguchi",
      "Kausik Majumdar"
    ],
    "published": "2025-09-05T19:12:35Z",
    "updated": "2025-09-05T19:12:35Z",
    "categories": [
      "quant-ph",
      "cond-mat.mes-hall",
      "cond-mat.mtrl-sci",
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "quant-ph",
    "doi": "10.1002/adfm.202406510"
  },
  {
    "arxiv_id": "2509.05450v1",
    "url": "https://arxiv.org/abs/2509.05450v1",
    "pdf_url": "https://arxiv.org/pdf/2509.05450v1.pdf",
    "title": "Mechanisms of Internal Crosstalk in Silicon Photomultipliers",
    "abstract": "Silicon Photomultipliers (SiPMs) have been widely adopted for photon detection in next-generation dark matter and neutrino detection experiments. Internal crosstalk, resulting from secondary photons produced during charge avalanches, is a significant noise mechanism in SiPMs and is likely to impact the performance of physics detectors. This work presents experimental data for trends in crosstalk probability with temperature and overvoltage for two different SiPM devices, and demonstrates a novel method for identifying the source mechanisms of crosstalk avalanches. This is done by using measurements of avalanche triggering probabilities for different charge carrier types to identify the device regions in which crosstalk avalanches are produced. This is possible because crosstalk photons absorbed in n-doped regions will produce hole-triggered avalanches, and those absorbed in p-doped regions will produce electron-triggered avalanches. Thus crosstalk probability can be related to device structure to assess the effectiveness of existing crosstalk mitigation methods. We identify optical reflections from the device surface as a significant source of crosstalk, likely to dominate in devices with effective crosstalk mitigation in bulk. Lastly, a diagnostic technique is presented to identify and reduce crosstalk in novel SiPM structures.",
    "authors": [
      "L. Wang",
      "H. Lewis",
      "F. Retière",
      "A. de St Croix"
    ],
    "published": "2025-09-05T19:08:55Z",
    "updated": "2025-09-05T19:08:55Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.05430v1",
    "url": "https://arxiv.org/abs/2509.05430v1",
    "pdf_url": "https://arxiv.org/pdf/2509.05430v1.pdf",
    "title": "Site Evaluation and Cost Estimation for Cosmic Explorer",
    "abstract": "Cosmic Explorer (CE) is a proposed next generation gravitational-wave observatory that would be sited in the United States. As of 2025, CE is in its design phase, with plans to begin operations in the 2030s together with the Einstein Telescope in Europe. CE's reference design consists of two widely separated L-shaped detectors, one with 20km arms and one with 40km arms, each based on technology proven by the National Science Foundation's highly successful Laser Interferometer Gravitational Wave Observatory (LIGO). There are unique challenges associated with identifying locations suitable for hosting Cosmic Explorer in the conterminous United States, not least of which is the order of magnitude upscaling of the observatory with respect to the 4km LIGO observatories. Cosmic Explorer's approach to site evaluation integrates physical, social and cultural criteria. Here we present improvements to the Cosmic Explorer Location Search (CELS) code used to identify and assess locations where CE would have low construction costs incurred by the geology, geography and topography of the land. We also report on efforts to integrate astrophysical requirements established by the Cosmic Explorer Science Traceability Matrix into the site evaluation process. National-level results are presented and combined with results from a related National Suitability Analysis to provide a list of locations that are preliminarily promising for a 40km CE.",
    "authors": [
      "Laurence Datrier",
      "Geoffrey Lovelace",
      "Joshua R. Smith",
      "Andrew Saenz",
      "Amber Romero"
    ],
    "published": "2025-09-05T18:23:00Z",
    "updated": "2025-09-05T18:23:00Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.05228v1",
    "url": "https://arxiv.org/abs/2509.05228v1",
    "pdf_url": "https://arxiv.org/pdf/2509.05228v1.pdf",
    "title": "Design of a High-Average-Power Ferroelectric Phase Shifter",
    "abstract": "This paper describes performance of a voltage controlled phase shifter designed for a high average power and a high figure of merit. The device is a reflection-type, resonant phase shifter that utilizes ferroelectric capacitors and impedance matching to the port impedance. With state-of-the-art ferroelectric materials, the device achieves a high Figure of Merit of nearly a thousand degrees phase shift per dB insertion loss at 800 MHz, along with sub-microsecond response. This phase shifter is capable of handling average power up to a megawatt. Its application is expected to enhance the electrical efficiency of particle accelerators, reducing both capital and operating costs.",
    "authors": [
      "Ilan Ben-Zvi",
      "Alick Macpherson",
      "Samuel Smith"
    ],
    "published": "2025-09-05T16:45:20Z",
    "updated": "2025-09-05T16:45:20Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.05108v1",
    "url": "https://arxiv.org/abs/2509.05108v1",
    "pdf_url": "https://arxiv.org/pdf/2509.05108v1.pdf",
    "title": "LEMURS dataset: Large-scale multi-detector ElectroMagnetic Universal   Representation of Showers",
    "abstract": "We present LEMURS: an extensive dataset of simulated calorimeter showers designed to support the development and benchmarking of fast simulation methods in high-energy physics, most notably providing a step towards the development of foundation models. This new dataset is more robust than the well-established CaloChallenge dataset 2, featuring substantially greater statistics, a wider range of incident angles in the detector, and most crucially multiple detector geometries (including more realistic calorimeters). The dataset is provided in HDF5 format, with a file structure inspired by the CaloChallenge shower representation while also including more variables. LEMURS scale and diversity make it particularly suitable for development of foundation models and has been used in the CaloDiT-2 model, a pre-trained model released in the community standard simulation toolkit Geant4 (version 11.4.beta). All data and code for generation and analysis are openly accessible, facilitating reproducibility and reuse across the community.",
    "authors": [
      "Peter McKeown",
      "Piyush Raikwar",
      "Anna Zaborowska"
    ],
    "published": "2025-09-05T13:47:39Z",
    "updated": "2025-09-05T13:47:39Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "physics.comp-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2503.06128v3",
    "url": "https://arxiv.org/abs/2503.06128v3",
    "pdf_url": "https://arxiv.org/pdf/2503.06128v3.pdf",
    "title": "R&D of KLM Upgrade for Direct Measurement of Neutral Hadron Momentum via   Time-of-Flight in Belle II",
    "abstract": "Accurate momentum determination of a neutral hadron, such as a KL meson or a neutron, remains a significant challenge in particle physics and nuclear physics experiments. The Belle II experiment presents an opportunity to address this challenge through an upgrade incorporating Time-of-Flight (TOF) capability for its large KL and Muon Detector (KLM). We investigate the feasibility of momentum determination via TOF measurement. To achieve high time resolution for the KLM upgrade, we conduct research and development of cost-effective plastic scintillators in collaboration with GaoNengKeDi Company, and technology utilizing silicon photomultipliers(SiPMs) arrays. A bulk attenuation length of 120 \\pm 7 cm has been achieved with a 135 cm-long sample, along with a time resolution of 70 \\pm 7 ps at its midpoint. A 50 cm-long scintillator demonstrates an exceptional time resolution of 47 \\pm 2 ps. These results highlight the potential of the proposed technology for improving neutral hadron momentum measurements in an upgraded Belle II KLM detector.",
    "authors": [
      "Xiyang Wang",
      "Hongyu Zhang",
      "Shiming Zou",
      "Zibing Bai",
      "Deqing Fang",
      "Kairui Huang",
      "Ziyu Liu",
      "Yugang Ma",
      "Weiqi Meng",
      "Ting Wang",
      "Xiaolong Wang",
      "Shiqing Xie",
      "Mingjie Yang",
      "Junhao Yin",
      "Mingkuan Yuan",
      "Wanyi Zhuang"
    ],
    "published": "2025-03-08T08:45:37Z",
    "updated": "2025-09-05T13:38:53Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.03641v2",
    "url": "https://arxiv.org/abs/2509.03641v2",
    "pdf_url": "https://arxiv.org/pdf/2509.03641v2.pdf",
    "title": "Is There an Exact Magnetic-Moment for Charged Particle Motion in a   Homogeneous, Time-Dependent Magnetic Field?",
    "abstract": "The nonperturbative guiding-center model provides an exact alternative to full-orbit simulations of charged particle dynamics in situations where traditional guiding-center theory may fail. We demonstrate that the charged particle motion in a homogeneous, time-varying magnetic field is a solvable example of the nonperturbative guiding-center model. This entails showing that the exact magnetic moment of Qin and Davidson can be constructed to be asymptotic to the adiabatic invariant series of Kruskal. In contrast to the perturbative invariant, the exact invariant contains information about parametric resonances. These resonances destroy the conservation of the usual magnetic moment over very long times. This refutes some previous claims about the all-time invariance of the magnetic moment.",
    "authors": [
      "Michael Updike",
      "Joshua Burby"
    ],
    "published": "2025-09-03T18:48:10Z",
    "updated": "2025-09-05T11:36:28Z",
    "categories": [
      "physics.plasm-ph",
      "math-ph",
      "math.MP"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.04829v1",
    "url": "https://arxiv.org/abs/2509.04829v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04829v1.pdf",
    "title": "Preparation and measurement of an $\\rm ^{37}$Ar source for liquid xenon   detector calibration",
    "abstract": "We present the preparation and measurement of the radioactive isotope $\\rm ^{37}Ar$, which was produced using thermal neutrons from a reactor, as a calibration source for liquid xenon time projection chambers. $\\rm ^{37}Ar$ is a low-energy calibration source with a half-life of 35.01 days, making it suitable for calibration in the low-energy region of liquid xenon dark-matter experiments. Radioactive isotope $\\rm ^{37}Ar$ was produced by irradiating $\\rm ^{36}Ar$ with thermal neutrons. It was subsequently measured in a gaseous xenon time projection chamber (GXe TPC) to validate its radioactivity. Our results demonstrate that $\\rm ^{37}Ar$ is an effective and viable calibration source that offers precise calibration capabilities in the low-energy domain of xenon-based detectors.",
    "authors": [
      "Xu-Nan Guo",
      "Chang Cai",
      "Fei Gao",
      "Yang Lei",
      "Kai-Hang Li",
      "Chun-Lei Su",
      "Ze-Peng Wu",
      "Xiang Xiao",
      "Ling-Feng Xie",
      "Yi-Fei Zhao",
      "Xiao-Peng Zhou"
    ],
    "published": "2025-09-05T06:01:18Z",
    "updated": "2025-09-05T06:01:18Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2503.17557v2",
    "url": "https://arxiv.org/abs/2503.17557v2",
    "pdf_url": "https://arxiv.org/pdf/2503.17557v2.pdf",
    "title": "Aligning Thermal and Current Quenches with a High Density Low-Z   Injection",
    "abstract": "The conventional approach for thermal quench mitigation in a tokamak disruption is through a high-Z impurity injection that radiates away the plasma's thermal energy before it reaches the wall. The downside is a robust Ohmic-to-runaway current conversion due to the radiatively clamped low post-thermal-quench electron temperature. An alternative approach is to deploy a low-Z (either deuterium or hydrogen) injection that aims to slow down the thermal quench, and ideally aligns it with the current quench. This approach has been investigated here via 3D MHD simulations using the PIXIE3D code. By boosting the hydrogen density, a fusion-grade plasma is dilutionally cooled at approximately the original pressure. Energy loss to the wall is controlled by a Bohm outflow condition at the boundary where the magnetic field intercepts a thin plasma sheath at the wall, in addition to Bremsstrahlung bulk losses. Robust MHD instabilities proceed as usual, while the collisionality of the plasma has been greatly increased and parallel transport is now in the Braginskii regime. The main conclusion of this study is that the decreased transport loss along open field lines due to a sufficient low-Z injection slows down the thermal quench rate to the order of 20 ms, aligned with the current quench timescale for a 15 MA ITER plasma.",
    "authors": [
      "Jason Hamilton",
      "Luis Chacon",
      "Giannis Keramidas",
      "Xianzhu Tang"
    ],
    "published": "2025-03-21T22:15:33Z",
    "updated": "2025-09-05T05:48:58Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.00164v4",
    "url": "https://arxiv.org/abs/2509.00164v4",
    "pdf_url": "https://arxiv.org/pdf/2509.00164v4.pdf",
    "title": "The potential applications of muography to revealing sea shipwrecks",
    "abstract": "Muon imaging, a non-invasive technique leveraging naturally occurring cosmic muons, has emerged as a promising tool for exploring underwater objects, including shipwrecks. This article examines the potential of muon imaging to investigate the contents of wrecked ships in the Baltic Sea and other marine environments. By analyzing the principles of muon tomography, its applications in underwater archaeology, and its advantages over traditional methods, we highlight its potential to reveal hidden details within shipwrecks while addressing challenges posed by the marine environment. These wrecks pose significant environmental risks due to their hazardous contents, such as explosives and crude oil products, making their detection and monitoring a matter of environmental and safety concern. Accurate modeling and imaging of such wrecks are therefore crucial for assessing potential dangers and mitigating environmental impacts. In this work, we adopted an approach similar to that used in underground muon experiments. Muon propagation through 50 meters of seawater was simulated using GEANT4, with muons transported to a depth of 35 meters and recorded in a virtual detector. The saved distributions of particle type, kinetic energy, interaction position, and angular directions were then used as tabulated input to the PrimaryGeneratorAction module. This approach enabled the generation of a realistic underwater muon flux over a 20 m x 20 m surface at 35 meters depth, which was subsequently employed to simulate different shipwreck filling scenarios. Assuming an exposure time of one week for a wreck located at a depth of 50 meters, our simulations demonstrate that muon imaging can resolve density contrasts sufficiently to distinguish between water, oil, and high-density materials, underscoring its feasibility as a practical tool for underwater hazard assessment.",
    "authors": [
      "Anzori Sh. Georgadze"
    ],
    "published": "2025-08-29T18:05:45Z",
    "updated": "2025-09-05T05:40:11Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.04730v1",
    "url": "https://arxiv.org/abs/2509.04730v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04730v1.pdf",
    "title": "GEMINI: The First Underground Testbed for Seismic Isolation and   Interplatform Control in Next-Generation Gravitational-Wave Detectors",
    "abstract": "GEMINI is an underground research and development facility dedicated to advancing seismic isolation and control technologies for future gravitational-wave observatories, including the Einstein Telescope (ET) and the Lunar Gravitational-Wave Antenna (LGWA). This paper presents the technical design and theoretical framework of GEMINI's active seismic isolation platforms, including detailed noise budget analyses, performance predictions, and residual platform motion evaluations. The GEMINI platforms are designed to achieve unprecedented vibration isolation, targeting motion suppression across the 10 mHz to 10 Hz frequency band, and with the goal to make them the quietest platforms of their kind. In the context of ET, GEMINI will enable the development and validation of inter-platform control strategies essential for the stabilization of auxiliary degrees of freedom of its interferometers. GEMINI will also support the testing of cryogenic payloads and ultra-sensitive inertial sensors required for LGWA. By integrating advanced cryogenic systems, precision inertial sensors, and state-of-the-art vibration isolation technologies, GEMINI will serve as a versatile testbed for next-generation ground-based gravitational-wave detectors and lunar seismometry missions.",
    "authors": [
      "Tomislav Andric",
      "Jan Harms",
      "Ilaria Caravella",
      "Michele Angiolilli",
      "Daniele Cortis",
      "Nicola D'Ambrosio",
      "Massimiliano De Deo",
      "Marco D'Incecco",
      "Antonio Di Ludovico",
      "Oliver Gerberding",
      "Alessandro Lalli",
      "Brian Lantz",
      "Laura Leonzi",
      "Carla Macolino",
      "Richard Mittleman",
      "Conor Mow-Lowry",
      "Donato Orlandi",
      "Stefano Pirro",
      "Marco Ricci",
      "Jamie Rollins",
      "Jim Warner"
    ],
    "published": "2025-09-05T01:03:25Z",
    "updated": "2025-09-05T01:03:25Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.04728v1",
    "url": "https://arxiv.org/abs/2509.04728v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04728v1.pdf",
    "title": "Discharge structure hierarchy of highly electronegative plasma at low   pressure and quasi-cold ion approximation",
    "abstract": "In this paper, the discharge structure of an Ar and SF inductively coupled plasma at the low pressure is investigated by mean of a fluid simulation at the quasi cold ion approximation with the room temperature magnitude.",
    "authors": [
      "Rui-Ji Tang",
      "Shu-Xia Zhao",
      "Yu Tian"
    ],
    "published": "2025-09-05T01:00:56Z",
    "updated": "2025-09-05T01:00:56Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.04689v1",
    "url": "https://arxiv.org/abs/2509.04689v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04689v1.pdf",
    "title": "First demonstration of coherent radiation imaging for bunch-by-bunch   longitudinal compression monitoring",
    "abstract": "Longitudinal bunch profile monitoring is a crucial diagnostic requirement in most accelerator facilities. This is particularly true in modern free-electron lasers and novel acceleration schemes, where bunch lengths are often <100 fs and standard instrumentation is invasive or lacks the required resolution. This paper proposes a new monitoring method in this challenging parameter space. Initial proof of principle results for relative compression monitoring via broadband imaging of coherent THz radiation are presented. The technique can utilize more conventional intensity monitoring or novel spatial distribution variation. Both techniques have been demonstrated using both invasive and non-invasive coherent radiation sources. These results pave the way for a future non-invasive longitudinal bunch profile monitor.",
    "authors": [
      "Joseph Wolfenden",
      "Ana Guisao-Betancur",
      "Carsten Welsch",
      "Billy Kyle",
      "Thomas Pacey",
      "Erik Mansten",
      "Sara Thorin",
      "Mathias Brandin"
    ],
    "published": "2025-09-04T22:37:47Z",
    "updated": "2025-09-04T22:37:47Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.04675v1",
    "url": "https://arxiv.org/abs/2509.04675v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04675v1.pdf",
    "title": "Detecting and Correcting Gain Jumps in TES Microcalorimeters",
    "abstract": "Arrays of microcalorimeters based on transition-edge sensors (TESs) are being actively deployed to laboratories all over the world. A TES microcalorimeter array produces very large quantities of data and users of these devices have varying levels of experience, so it is important to provide robust software for data acquisition and analysis that can function with minimal user supervision. This software should be capable of addressing common phenomena that can adversely affect spectrum quality. Gain jumping is one such phenomenon that is characterized by abrupt changes in the gain of a device. Left unaddressed, gain jumps can degrade spectra by introducing false peaks. We are not aware of any previously published methods for resetting gain jumps during data acquisition or existing algorithms for correcting data that is degraded by gain jumps. We have developed automated methods for detecting and correcting gain jumps in gamma-ray TES microcalorimeters. We present a procedure for resetting gain jumps during a live data acquisition that involves briefly driving the TES into its normal state using the bias current. We also describe an algorithm for locating gain jumps and identifying unique gain states within existing microcalorimeter data. Finally, we provide a possible approach for correcting gain jumps after they have been identified.",
    "authors": [
      "Thomas A. Baker",
      "Daniel T. Becker",
      "Joseph W. Fowler",
      "Mark W. Keller",
      "Daniel S. Swetz",
      "Joel N. Ullom"
    ],
    "published": "2025-09-04T21:39:17Z",
    "updated": "2025-09-04T21:39:17Z",
    "categories": [
      "physics.ins-det",
      "physics.data-an"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1109/TASC.2024.3517565"
  },
  {
    "arxiv_id": "2507.05151v2",
    "url": "https://arxiv.org/abs/2507.05151v2",
    "pdf_url": "https://arxiv.org/pdf/2507.05151v2.pdf",
    "title": "Quantum Inspiration, Classical Advantage: Dequantized particle algorithm   for the nonlinear Vlasov-Poisson system",
    "abstract": "We present a dequantization algorithm for the Vlasov--Poisson (VP) system, termed the dequantized particle algorithm, by systematically dequantizing the underlying many-body quantum theory. Starting from the second-quantized Hamiltonian description, we derive a finite-dimensional dequantized system and show that it furnishes a structure-preserving discretization of the Schr\\\"odinger--Poisson (SP) equations. Through the Wigner or Husimi transformations, this discretization provides an efficient approximation of the VP system when quantum effects are negligible. Unlike conventional structure-preserving algorithms formulated in 6D phase space, this dequantized particle algorithm operates in 3D configuration space, potentially offering more compact and efficient representations of physical information under appropriate conditions. A numerical example of the classical nonlinear two-stream instability, simulated using merely 97 dequantized particles, demonstrates the efficiency, accuracy, and conservation properties of the algorithm and confirms its potential as a foundation for developing quantum and quantum-inspired classical algorithms for kinetic plasma dynamics.",
    "authors": [
      "Hong Qin",
      "Michael Q. May",
      "Jacob Molina"
    ],
    "published": "2025-07-07T16:01:37Z",
    "updated": "2025-09-04T20:12:33Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph",
      "quant-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2502.00188v2",
    "url": "https://arxiv.org/abs/2502.00188v2",
    "pdf_url": "https://arxiv.org/pdf/2502.00188v2.pdf",
    "title": "Dynamics of Magnetic Evaporative Beamline Cooling for Preparation of   Cold Atomic Beams",
    "abstract": "The most sensitive direct neutrino mass searches today are based on measurement of the endpoint of the beta spectrum of tritium to infer limits on the mass of the unobserved neutrino. To avoid the smearing associated with the distribution of molecular final states in the T-He molecule, the next generation of these experiments will need to employ atomic (T) rather than molecular (T$_{2}$) tritium sources, at currents of at least 10$^{15}$ atoms per second. Following production, atomic T can be trapped in gravitational and/or magnetic bottles for beta spectrum experiments, if and only if it can first be cooled to millikelvin temperatures. Accomplishing this cooling presents substantial technological challenges. The Project 8 collaboration is developing a technique based on magnetic evaporative cooling along a beamline (MECB) for the purpose of cooling T to feed a magneto-gravitational trap that also serves as a cyclotron radiation emission spectroscope. Initial tests of the approach are planned in a pathfinder apparatus using atomic Li. This paper presents a method for analyzing the dynamics of the MECB technique, and applies these calculations to the design of systems for cooling and slowing of atomic Li and T. A scheme is outlined that could provide a current of T at the millikelvin temperatures required for the Project 8 neutrino mass search.",
    "authors": [
      "A. Ashtari Esfahani",
      "S. Bhagvati",
      "S. Böser",
      "M. J. Brandsema",
      "R. Cabral",
      "V. A. Chirayath",
      "C. Claessens",
      "N. Coward",
      "L. de Viveiros",
      "P. J. Doe",
      "M. G. Elliott",
      "S. Enomoto",
      "M. Fertl",
      "J. A. Formaggio",
      "B. T. Foust",
      "J. K. Gaison",
      "P. Harmston",
      "K. M. Heeger",
      "B. J. P. Jones",
      "E. Karim",
      "K. Kazkaz",
      "P. T. Kolbeck",
      "M. Li",
      "A. Lindman",
      "C. Y. Liu",
      "C. Matthé",
      "R. Mohiuddin",
      "B. Monreal",
      "B. Mucogllava",
      "R. Mueller",
      "A. Negi",
      "J. A. Nikkel",
      "E. Novitski",
      "N. S. Oblath",
      "M. Oueslati",
      "J. I. Peña",
      "W. Pettus",
      "V. S. Ranatunga",
      "R. Reimann",
      "A. L. Reine",
      "R. G. H. Robertson",
      "L. Saldaña",
      "P. L. Slocum",
      "F. Spanier",
      "J. Stachurska",
      "K. Stogsdill",
      "Y. H. Sun",
      "P. T. Surukuchi",
      "L. Taylor",
      "A. B. Telles",
      "F. Thomas",
      "L. A. Thorne",
      "T. Thümmler",
      "W. Van De Pontseele",
      "B. A. VanDevender",
      "T. E. Weiss",
      "M. Wynne",
      "A. Ziegler"
    ],
    "published": "2025-01-31T22:06:08Z",
    "updated": "2025-09-04T20:00:35Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex",
      "physics.atom-ph"
    ],
    "primary_category": "physics.ins-det"
  }
]