{
  "arxiv_id": "2512.08442v1",
  "url": "https://arxiv.org/abs/2512.08442v1",
  "pdf_url": "https://arxiv.org/pdf/2512.08442v1.pdf",
  "title": "High-OAM Deep Ultraviolet Twisted Light Generation for RF-Photoinjector Applications",
  "abstract": "We report on the generation and characterization of ultraviolet (wavelength 266 nm) twisted light with high orbital angular momentum (OAM) using three types of fabricated diffractive optical elements (DOEs): a reflective fork grating, a high-charge spiral phase plate (SPP), and binary axicons. All elements were integrated into a drive-laser beamline of an electron RF-photoinjector, enabling direct evaluation under accelerator-relevant conditions.   The SPP produced a high-purity Laguerre-Gaussian mode with OAM l = 64 and a measured conversion efficiency of approximately 80\\%. Binary axicons generated quasi-Bessel twisted light with topological charges up to m = 10, exhibiting low divergence and stable multi-lobe ring structures. The fork grating reliably produced lower-order modes, l = 2-8, with good agreement between simulations and cylindrical-lens diagnostics.   These results constitute, to our knowledge, the first comprehensive experimental demonstration of deep-UV high-OAM beams generated with fabricated DOEs and validated through mode-conversion measurements. The demonstrated techniques are compatible with high-power UV laser systems used in RF-photoinjectors and offer a practical route toward structured photocathode illumination and the generation of relativistic vortex electrons at a particle accelerator facility.",
  "authors": [
    "A. S. Dyatlov",
    "D. M. Dolgintsev",
    "V. V. Gerasimov",
    "V. V. Kobets",
    "V. P. Nazmov",
    "M. A. Nozdrin",
    "A. N. Sergeev",
    "D. S. Shokin",
    "K. E. Yunenko",
    "D. V. Karlovets"
  ],
  "published": "2025-12-09T10:15:02Z",
  "updated": "2025-12-09T10:15:02Z",
  "categories": [
    "quant-ph",
    "physics.acc-ph",
    "physics.optics"
  ],
  "primary_category": "quant-ph"
}