{
  "arxiv_id": "2512.08259v1",
  "url": "https://arxiv.org/abs/2512.08259v1",
  "pdf_url": "https://arxiv.org/pdf/2512.08259v1.pdf",
  "title": "Ion-beam driven dust-cyclotron and dust-lower-hybrid instabilities in nonthermal dusty magnetoplasmas with dust-charge fluctuation",
  "abstract": "We reveal a new dispersive dust-lower-hybrid (DLH)-like mode that can couple to modified dust-cyclotron (DC) waves in a dusty magnetoplasma by the influence of a streaming ion beam. Previous studies have overlooked such hybrid modes and the coupling in the study of resonant cyclotron instabilities in dusty magnetoplasmas. Using two-fluid models for positive ion beams and charged dust grains, nonthermal $κ$-density distributions for electrons and positive ions, and orbital motion limited (OML) models for dust-charge fluctuations, we derive a general linear dispersion relation for the coupled DLH and DC modes in the limit of when the hydrodynamic time scale is much longer than the dust-charging time scale. The hybrid mode propagates with a frequency lower than the typical dust-lower-hybrid frequency, $\\widetildeω_{\\rm{dl}}\\equivω_{\\rm{pd}}Ω_d/\\sqrt{ω^2_{\\rm{pd}}+Ω^2_d}$, where $ω_{\\rm{pd}}$ is the dust-plasma oscillation frequency and $Ω_d$ is the dust-cyclotron frequency. We obtain the growth rates of instabilities due to Cerenkov and cyclotron interactions and analyze them, taking into account the influences of the static magnetic field, ion-to-electron temperature ratio, electron-to-dust number density ratio, dust-charge fluctuation, and superthermal electrons and ions. We find that the maximum growth rates tend to increase but reach steady states as the wave number increases. The instabilities reported here could be relevant to various plasma environments, including space plasmas (e.g., Earth's magnetosphere) and laboratory dusty plasma experiments.",
  "authors": [
    "A. P. Misra",
    "N. P. Acharya",
    "S. Basnet",
    "R. Khanal"
  ],
  "published": "2025-12-09T05:34:49Z",
  "updated": "2025-12-09T05:34:49Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": "10.1088/1402-4896/ae296d"
}