{
  "arxiv_id": "2512.08549v1",
  "url": "https://arxiv.org/abs/2512.08549v1",
  "pdf_url": "https://arxiv.org/pdf/2512.08549v1.pdf",
  "title": "A journey to ITACA",
  "abstract": "A unique feature of gas xenon electroluminescent time projection chambers (GXeEL TPCs) in $0νββ$ searches is their ability to reconstruct event topology, in particular to distinguish \"single-electron\" from \"double-electron\" tracks, the latter being the signature of a $0νββ$ decay near the decay endpoint $Q_{ββ}$. Together with excellent energy resolution and the t$_0$ provided by primary scintillation, this topological information is key to suppressing backgrounds. Preserving EL, however, requires operating in pure xenon (with helium as the only benign additive), and in pure xenon the diffusion of drifting electrons is large. As a result, the fidelity of reconstructed tracks is limited both by diffusion and by the intrinsic blurring of EL amplification.   We propose augmenting the detector with the ability to image not only the electron track but also the corresponding mirror ion track. Introducing trace amounts of NH$_3$ ($\\sim$100 ppb) converts Xe$^+$ ions into NH$_4^+$ while leaving EL unaffected. For events in the region-of-interest, an ion sensor positioned near the cathode at the projected barycenter captures the NH$_4^+$ ions. Electrons drift rapidly to the anode, producing the standard EL image, whereas the NH$_4^+$ ions drift slowly toward the cathode. Their slow drift provides time to determine the event energy and barycenter. Laser interrogation of the sensor's molecular layer then reveals an ion-track image with sub-millimeter diffusion and no EL-induced smearing.   The combined electron-ion imaging substantially strengthens topological discrimination, improving background rejection by about an order of magnitude and significantly extending the discovery potential of GXeEL TPCs for very long $0νββ$ lifetimes.",
  "authors": [
    "J. J. Gómez-Cadenas",
    "L. Arazi",
    "M. Elorza",
    "Z. Freixa",
    "F. Monrabal",
    "A. Pazos",
    "J. Renner",
    "S. R. Soleti",
    "S. Torelli"
  ],
  "published": "2025-12-09T12:46:14Z",
  "updated": "2025-12-09T12:46:14Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}