{
  "arxiv_id": "2512.07446v1",
  "url": "https://arxiv.org/abs/2512.07446v1",
  "pdf_url": "https://arxiv.org/pdf/2512.07446v1.pdf",
  "title": "The influence of Parker spiral on the reflection-driven turbulence",
  "abstract": "The solar wind is observed to undergo substantial heating as it expands through the heliosphere, with measured temperature profiles exceeding those expected from adiabatic cooling. A plausible source of this heating is reflection-driven turbulence (RDT), in which gradients in the background Alfvén speed partially reflect outward-propagating Alfvén waves, seeding counter-propagating fluctuations that interact and dissipate via turbulence. Previous RDT models assume a radial background magnetic field, but at larger radii the interplanetary field is known to be twisted into the Parker Spiral (PS). Here, we generalize RDT phenomenology to include a PS, using three-dimensional expanding-box magnetohydrodynamic (MHD) simulations to test the ideas and compare the resulting turbulence to the radial-background-field case. We argue that the underlying RDT dynamics remain broadly similar with a PS, but the controlling scales change: as the azimuthal field grows it \"cuts across\" perpendicularly stretched, pancake-like eddies, producing outer scales perpendicular to the magnetic field that are much smaller than in the radial-background case. Consequently, the outer-scale nonlinear turnover time increases more slowly with heliocentric distance in PS geometry, weakening the tendency (seen in radial-background models) for the cascade to 'freeze' into quasi-static, magnetically dominated structures. This allows the system to dissipate a larger fraction of the fluctuation energy as heat, also implying that the turbulence remains strongly imbalanced (with high normalized cross-helicity) out to larger heliocentric distances. We complement our heating results with a detailed characterization of the turbulence (e.g., spectra, switchbacks, and compressive fractions) providing a set of concrete predictions for comparison with spacecraft observations.",
  "authors": [
    "Khurram Abbas",
    "Jonathan Squire"
  ],
  "published": "2025-12-08T11:20:23Z",
  "updated": "2025-12-08T11:20:23Z",
  "categories": [
    "astro-ph.SR",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.SR"
}