{
  "arxiv_id": "2512.07559v1",
  "url": "https://arxiv.org/abs/2512.07559v1",
  "pdf_url": "https://arxiv.org/pdf/2512.07559v1.pdf",
  "title": "Spin-Texture Spin-valve with a van der Waals Magnet",
  "abstract": "All-electrical methods for nucleating, detecting, and manipulating spin textures in two-dimensional (2D) van der Waals (vdW) magnets can serve as fundamental building blocks for multi-state spintronic memory, logic, and neuromorphic computing applications. Unlike conventional ferromagnets, vdW ferromagnets such as Fe5GeTe2 with strong Dzyaloshinskii-Moriya interactions stabilize nanoscale chiral spin textures, including skyrmions and stripe domains. However, the sub-100 nm size of these spin textures has limited their study to sophisticated microscopy techniques. Here, we demonstrate all-electrical detection of spin textures in vdW itinerant ferromagnet Fe5GeTe2 using pure spin transport in a lateral graphene spin-valve device at room temperature. By engineering nanoscale constrictions or notches in Fe5GeTe2, we create spin textures that inject distinct spin polarizations into the graphene channel, where they are nonlocally sensed by a reference conventional ferromagnetic detector at room temperature. This enables the observation of anomalous multi-level spin-valve switching and Hanle spin precession signals, which are due to unique spin textures in Fe5GeTe2 and in sharp contrast to single-domains and conventional magnet-based devices. This all-electrical approach can provide direct access to the spin textures on an integrated 2D spintronic circuit without the need for ex-situ microscopic characterizations.",
  "authors": [
    "Bing Zhao",
    "Roselle Ngaloy",
    "Lars Sjöström",
    "Saroj P. Dash"
  ],
  "published": "2025-12-08T13:49:12Z",
  "updated": "2025-12-08T13:49:12Z",
  "categories": [
    "cond-mat.mes-hall",
    "cond-mat.mtrl-sci",
    "cond-mat.str-el",
    "physics.app-ph",
    "physics.ins-det"
  ],
  "primary_category": "cond-mat.mes-hall"
}