{
  "arxiv_id": "2402.19372v4",
  "url": "https://arxiv.org/abs/2402.19372v4",
  "pdf_url": "https://arxiv.org/pdf/2402.19372v4.pdf",
  "title": "Miniaturized magnetic-field sensor based on nitrogen-vacancy centers",
  "abstract": "The nitrogen-vacancy (NV) center in diamond is a prime candidate for quantum sensing technologies. Here, we present a fully integrated and mechanically robust fiber-based endoscopic sensor with a tip diameter of $1.25 \\mathrm{mm}$. On its tip, a direct laser writing process is used to fixate a diamond containing NV centers above the fiber's core inside a polymer structure. Additionally, a metallic direct laser-written antenna structure next to the fiber facet allows efficient microwave manipulation of NV center spins. The sensor achieves a shot-noise-limited magnetic-field sensitivity of $5.9 \\mathrm{nT}/\\sqrt{\\mathrm{Hz}}$ using a $15 \\mathrm{\\mu m}$-sized microdiamond at a microwave power of $50 \\mathrm{mW}$ and optical power of $2.15 \\mathrm{mW}$. Using lock-in techniques, we measure a sensitivity of $51.8 \\mathrm{nT}/\\sqrt{\\mathrm{Hz}}$. Furthermore, we introduce a dual-fiber concept that enables, in combination with a direct laser-written structure, independent guiding of excitation and fluorescence light and thus reduces background autofluorescence. Moreover, controlled guiding of excitation light to the diamond while avoiding sample illumination may enable operation in light-sensitive environments such as biological tissue. While the demonstrated sensitivity is achieved using a single-fiber configuration, the dual-fiber approach provides a path towards integrating smaller diamonds, where autofluorescence would otherwise limit performance. We demonstrate the capability of vector magnetic field measurements in a magnetic field as used in state-of-the-art ultracold quantum gas experiments, opening a potential field in which high resolution and high sensitivity are necessary.",
  "authors": [
    "Stefan Johansson",
    "Dennis Lönard",
    "Isabel Cardoso Barbosa",
    "Jonas Gutsche",
    "Jonas Witzenrath",
    "Artur Widera"
  ],
  "published": "2024-02-29T17:20:13Z",
  "updated": "2025-10-28T13:44:22Z",
  "categories": [
    "physics.app-ph",
    "physics.ins-det",
    "quant-ph"
  ],
  "primary_category": "physics.app-ph"
}