{
  "arxiv_id": "2510.23229v1",
  "url": "https://arxiv.org/abs/2510.23229v1",
  "pdf_url": "https://arxiv.org/pdf/2510.23229v1.pdf",
  "title": "Validation of field cage and cathode for low radioactivity operation   with the CYGNO experiment",
  "abstract": "Dark matter, which is considered to account for approximately the 27% of the Universe's energy-mass content, remains an open issue in modern particle physics along with its composition. The CYGNO Experiment aims to exploit an innovative approach applied to the direct detection search of low energy nuclear recoils possibly induced by cold particle-like dark matter candidates. CYGNO employs a directional detector based on a Time Projection Chamber (TPC) filled with a He:CF$_{4}$ gas mixture and equipped with an optical readout. Currently, the CYGNO Collaboration is constructing the detector demonstrator, CYGNO-04, in Hall F at Laboratori Nazionali del Gran Sasso (LNGS). This 0.4 m$^3$ detector has the goal of proving the scalability of the technology and assessing the physics and radiopurity capabilities. Given the low radioactivity requirements, especially in internal components such as field cage and cathode, the reduction of material while keeping the correct electrical behavior is paramount. In this paper, we present the validation of several internal components, mainly focusing on the field cage material and support structure. The tests included geometrical asymmetries in the electric field response, collection efficiency as well as measurement of known physical quantities. A preferred configuration is found with a structure based on Nylon material which supports a PET or Kapton sheet with copper strips deposited on.",
  "authors": [
    "F. D. Amaro",
    "R. Antonietti",
    "E. Baracchini",
    "L. Benussi",
    "S. Bianco",
    "A. Biondi",
    "C. Capoccia",
    "M. Caponero",
    "L. G. M. de Carvalho",
    "G. Cavoto",
    "I. A. Costa",
    "A. Croce",
    "M. D'Astolfo",
    "G. D'Imperio",
    "E. Danè",
    "G. Dho",
    "E. Di Marco",
    "J. M. F. dos Santos",
    "D. Fiorina",
    "F. Iacoangeli",
    "Z. Islam",
    "E. Kemp",
    "H. P. Lima Jr",
    "G. Maccarrone",
    "R. D. P. Mano",
    "D. J. G. Marques",
    "G. Mazzitelli",
    "A. G. McLean",
    "P. Meloni",
    "A. Messina",
    "C. M. B. Monteiro",
    "R. A. Nobrega",
    "I. F. Pains",
    "E. Paoletti",
    "L. Passamonti",
    "F. Petrucci",
    "S. Piacentini",
    "D. Piccolo",
    "D. Pierluigi",
    "D. Pinci",
    "A. Prajapati",
    "F. Renga",
    "F. Rosatelli",
    "A. Russo",
    "G. Saviano",
    "P. A. O. C. Silva",
    "N. J. Spooner",
    "R. Tesauro",
    "S. Tomassini",
    "S. Torelli",
    "D. Tozzi"
  ],
  "published": "2025-10-27T11:28:41Z",
  "updated": "2025-10-27T11:28:41Z",
  "categories": [
    "physics.ins-det",
    "astro-ph.IM",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}