{
  "arxiv_id": "2510.23690v1",
  "url": "https://arxiv.org/abs/2510.23690v1",
  "pdf_url": "https://arxiv.org/pdf/2510.23690v1.pdf",
  "title": "Quantum Kinetic Modeling of KEEN waves in a Warm-Dense Regime",
  "abstract": "We report a fully kinetic, quantum study of Kinetic Electrostatic Electron Nonlinear (KEEN) waves, showing that quantum diffraction systematically erodes the classical trapping mechanism, narrow harmonic locking to the fundamental, and hasten post-drive decay. Electrons are evolved with a second-order Strang-split 1D1V Wigner-Poisson solver that couples conservative semi-Lagrangian WENO advection to an analytic Fourier space update for the non-local Wigner term, while ions remain classical. Short, frequency-tuned ponderomotive pulses drive KEEN formation in a uniform Maxwellian plasma; as the dimensionless quantum parameter H rises from the classical limit to values relevant to warm-dense matter, doped semiconductors, and 2D electron systems, the drive threshold increases, higher harmonics are damped, trapped electron vortices diffuse, and the subplasma electrostatic energy relaxes to a lower stationary level, as confirmed by continuous wavelet analysis. These microscopic changes carry macroscopic weight. Ignition-scale capsules now compress matter to regimes where the electron de Broglie wavelength rivals the Debye length, making classical kinetic descriptions insufficient. By extending KEEN physics into this quantum domain, our results offer a potential diagnostic of nonequilibrium electron dynamics for next-generation inertial-confinement designs and high-energy-density platforms, indicating that predictive fusion modeling may benefit from the integration of kinetic fidelity with quantum effects.",
  "authors": [
    "F. Alejandro Padilla-Gomez",
    "Sining Gong",
    "Michael S. Murillo",
    "F. R. Graziani",
    "Andrew J. Christlieb"
  ],
  "published": "2025-10-27T17:34:42Z",
  "updated": "2025-10-27T17:34:42Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}