{
  "arxiv_id": "2510.24245v1",
  "url": "https://arxiv.org/abs/2510.24245v1",
  "pdf_url": "https://arxiv.org/pdf/2510.24245v1.pdf",
  "title": "Development and Flight Trial of a UAV-based Gamma Ray and Neutron   Detection System for Large-Area Radioactivity Mapping and Source Activity   Estimation",
  "abstract": "Advances in scintillation crystal and Silicon PhotoMultiplier (SiPM) technologies have enabled the development of compact, lightweight, and low-power radiation detectors that are suitable for integration with Unmanned Aerial Vehicles (UAVs). This integration enables efficient and cost-effective large-area radiation monitoring while minimising occupational exposure. In this work, a SiPM-based NaIL scintillation detection payload was developed, characterised, and mounted on a multirotor UAV for gamma ray and neutron source localisation and activity estimation applications. To support these capabilities, an analytic radionuclide detection efficiency model was developed and used to estimate radioactivity on the ground from aerial energy spectrum measurements. The analytic expression for the detection efficiency incorporated physical phenomena, including the branching ratio, detector solid angle, air attenuation, and intrinsic peak efficiency, leading to agreement within 10% of experimental radionuclide detection efficiencies. The UAV-based radiation detection system was physically validated through a controlled indoor live radioactive source demonstration at 1.5 m, 3 m, and 4.5 m flight heights. Using the developed ground-level radioactivity estimation method, Cs-137 and Co-60 sources were successfully localised within 0.5 m, and their activities were estimated with errors on the order of 10% or less.",
  "authors": [
    "Lysander Miller",
    "Airlie Chapman",
    "James Kennedy",
    "Richard Hebden",
    "Jeremy M. C. Brown"
  ],
  "published": "2025-10-28T09:55:07Z",
  "updated": "2025-10-28T09:55:07Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}