{
  "arxiv_id": "2509.20594v2",
  "url": "https://arxiv.org/abs/2509.20594v2",
  "pdf_url": "https://arxiv.org/pdf/2509.20594v2.pdf",
  "title": "Anderson self-localization of light in pair plasmas",
  "abstract": "We demonstrate that in pair plasma weakly nonlinear electromagnetic waves, $a_0 \\leq 1$, experience Anderson self-localization. The beat between the driver and a back-scattered wave creates charge-neutral, large random density fluctuations $δn/n_0 \\gg 1$, and corresponding fluctuations of the dielectric permittivity $ε$ (random plasma density grating). Propagating in quasi-1D, waves in a medium with spatially random self-created fluctuations of dielectric permeability experience localization. {In the linear regime, the instability can be classified as Induced Brillouin Scattering; it is described by the parameter $ρ_L = \\left( a_0 { ω_{p}/ }ω\\right)^{2/3} \\leq 1 $, related to the Pierce parameter of Free Electron Lasers. In the cold case, the growth rate is $Γ\\approx ρ_{L} ω$ ($a_0 $ is laser nonlinearity parameter, $ω_p$ is plasma frequency, $ω$ is the laser frequency). } Anderson self-localization of light leads to (i) reflection of EM waves by the under-dense pair plasma; (ii) a wave already present inside the plasma separates into bright trapped pockets and dark regions. Mild initial thermal spread with $Θ\\equiv k_B T/(m_e c^2) \\approx a_0^2$, restores wave propagation by suppressing the seeds of parametrically unstable density fluctuations. A circularly polarized driver produces linearly polarized structures, with position angle varying randomly between the bright pulses. Time-variability of the resulting density structures does not suppress localization due to remaining corrections (not white noise). We discuss possible applications to astrophysical Fast Radio Bursts.",
  "authors": [
    "Maxim Lyutikov",
    "Victor Gurarie"
  ],
  "published": "2025-09-24T22:25:27Z",
  "updated": "2026-01-19T16:19:52Z",
  "categories": [
    "physics.plasm-ph",
    "astro-ph.HE",
    "cond-mat.dis-nn"
  ],
  "primary_category": "physics.plasm-ph"
}