{
  "arxiv_id": "2601.15613v1",
  "url": "https://arxiv.org/abs/2601.15613v1",
  "pdf_url": "https://arxiv.org/pdf/2601.15613v1.pdf",
  "title": "A kinetic-moment framework for electron energy dynamics in capacitively coupled plasmas: absorption, conversion, transport, and dissipation",
  "abstract": "Understanding electron energy dynamics in low-temperature plasmas such as capacitively coupled plasmas (CCPs), including energy absorption, conversion, transport, and dissipation, is essential for interpreting discharge physics and process applications. We propose a kinetic-moment framework based on particle-in-cell/Monte Carlo collision (PIC/MCC) simulations. The framework reconstructs the first three velocity moments of the Boltzmann equation directly from PIC/MCC data and enables a quantitative, self-consistent description of electron energy dynamics in low-pressure CCPs. To clarify energy conversion among electromagnetic energy, electron fluid kinetic (mechanical) energy, and electron thermal (internal) energy, we further separate the total energy transport equation into kinetic- and thermal-energy equations. We find that, at low pressure, electrons gain directed kinetic energy in the sheath and convert it locally into thermal energy through pressure-strain interaction and collisions. Thermal energy is then transported into the bulk and is dissipated mainly by inelastic electron-neutral collisions. We further decompose pressure-strain interaction into reversible pressure dilatation and irreversible viscous-like dissipation, which correspond to conversion driven by volumetric compression or expansion and by shear deformation, respectively. This decomposition reveals a significant thermalization channel beyond collisions. More broadly, the results show coexistence of localized kinetic-to-thermal conversion near the sheath and nonlocal energy transport from the sheath to the bulk dominated by microscopic heat flux. The heat flux deviates strongly from Fourier's law based on local temperature gradients. This framework provides a clear fluid description with kinetic fidelity and offers a practical tool for analyzing energy evolution in nonequilibrium plasmas.",
  "authors": [
    "Jianxiong Yao",
    "Zeduan Zhang",
    "Feng He",
    "Jinsong Miao",
    "Jiting Ouyang",
    "Bocong Zheng"
  ],
  "published": "2026-01-22T03:29:10Z",
  "updated": "2026-01-22T03:29:10Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}