{
  "arxiv_id": "2508.04210v1",
  "url": "https://arxiv.org/abs/2508.04210v1",
  "pdf_url": "https://arxiv.org/pdf/2508.04210v1.pdf",
  "title": "Stabilization and Re-excitation of Sawtooth Oscillations due to   Energetic Particles in Tokamaks",
  "abstract": "Sawtooth oscillations, driven by internal kink modes (IKMs), are fundamental phenomena in tokamak plasmas. They can be classified into different types, including normal sawteeth, small sawteeth, and in some cases, evolving into the steady-island state, each having a different impact on energy confinement in fusion reactors. This study investigates the interaction between sawtooth oscillations and energetic particles (EPs) using the initial-value MHD-kinetic hybrid code CLT-K, which can perform long-term self-consistent nonlinear simulations. We analyze the redistribution of EPs caused by sawtooth crashes and the effect of EPs on sawtooth behavior and type transitions. The results show that co-passing EPs tend to re-excite sawtooth oscillations, extending their period, while counter-passing EPs promote the system evolution toward small sawteeth, potentially leading to the steady-island state. Additionally, we provide a physical picture of how EPs influence sawtooth type through the mechanism of magnetic flux pumping. We demonstrate that the radial residual flow in the core plays a crucial role in determining the reconnection rate and sawtooth type. Moreover, we observe new phenomena about couplings of various instabilities, such as the excitation of global multi-mode toroidal Alfv\\'en eigenmodes (TAEs) due to EP redistribution following a sawtooth crash and the excitation of the resonant tearing mode (r-TM) when injecting counter-passing EPs. The study also explores the impact of EP energy and the safety factor profile on the development of stochastic magnetic fields and EP transport. These findings emphasize the necessity of multi-mode simulations in capturing the complexity of EP-sawtooth interactions and provide insights for optimizing sawtooth control in future reactors such as ITER.",
  "authors": [
    "H. X. Zhang",
    "H. W. Zhang",
    "Z. W. Ma",
    "J. X. Huang",
    "W. Zhang"
  ],
  "published": "2025-08-06T08:46:07Z",
  "updated": "2025-08-06T08:46:07Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}