[
  {
    "arxiv_id": "2508.05490v1",
    "url": "https://arxiv.org/abs/2508.05490v1",
    "pdf_url": "https://arxiv.org/pdf/2508.05490v1.pdf",
    "title": "Phonon-blocked junction calorimeter",
    "abstract": "This study introduces a cold-electron microcalorimeter based on phonon-blocked junctions, integrating on-chip electron cooling and boundary phonon isolation to achieve exceptional energy resolution and rapid thermal response. A general theoretical framework is presented, along with derived approximate analytical expressions for key performance metrics, including cooling efficiency, thermal time constant, and energy resolution. The work examines the influence of device parameters, including non-ideal effects such as subgap tunneling and heat backflow, and offers insights into optimizing detector performance. The findings highlight the potential of phonon-blocked junction microcalorimeters to rival or outperform the state-of-art technologies, such as transition-edge sensors, paving the way for applications requiring precise and fast energy detection.",
    "authors": [
      "Zhuoran Geng",
      "Joel Hätinen",
      "Emma Mykkänen",
      "Mika Prunnila",
      "Ilari J. Maasilta"
    ],
    "published": "2025-08-07T15:25:45Z",
    "updated": "2025-08-07T15:25:45Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.11368v3",
    "url": "https://arxiv.org/abs/2507.11368v3",
    "pdf_url": "https://arxiv.org/pdf/2507.11368v3.pdf",
    "title": "Community Report from the 2025 SNOLAB Future Projects Workshop",
    "abstract": "SNOLAB hosts a biannual Future Projects Workshop (FPW) with the goal of encouraging future project stakeholders to present ideas, concepts, and needs for experiments or programs that could one day be hosted at SNOLAB. The 2025 FPW was held in the larger context of a 15-year planning exercise requested by the Canada Foundation for Innovation. This report collects input from the community, including both contributions to the workshop and contributions that could not be scheduled in the workshop but nonetheless are important to the community.",
    "authors": [
      "M. D. Diamond",
      "P. Abbamonte",
      "A. Arvanitaki",
      "D. M. Asner",
      "D. Balut",
      "D. Baxter",
      "C. Blanco",
      "D. Boreham",
      "M. Boulay",
      "B. Broerman",
      "T. Brunner",
      "E. Caden",
      "A. Chavarria",
      "M. Chen",
      "J. P. Davis",
      "A. Drlica-Wagner",
      "J. Estrada",
      "N. Fatemighomi",
      "J. Foster",
      "D. Freedman",
      "C. Gao",
      "J. Hall",
      "S. Hall",
      "W. Halperin",
      "M. Hirschel",
      "N. Hoch",
      "Z. Hong",
      "A. Ianni",
      "C. Jillings",
      "D. Johnson",
      "Y. Kahn",
      "C. B. Krauss",
      "T. Laframboise",
      "M. Lai",
      "M. R. Lapointe",
      "B. Lillard",
      "W. H. Lippincott",
      "H. Ma",
      "E. Marrufo Villalpando",
      "K. Mistry",
      "M. Nguyen",
      "J. Oh",
      "A. Radick",
      "H. Reaume",
      "B. Roach",
      "J. Schütte-Engel",
      "S. Scorza",
      "J. W. Scott",
      "S. J. Sekula",
      "D. Sinclair",
      "C. Thome",
      "L. Thompson",
      "J. Tiffenberg",
      "K. J. Vetter",
      "A. Williams",
      "L. A. Winslow",
      "M. Wurm"
    ],
    "published": "2025-07-15T14:39:47Z",
    "updated": "2025-08-07T13:28:09Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2508.05183v1",
    "url": "https://arxiv.org/abs/2508.05183v1",
    "pdf_url": "https://arxiv.org/pdf/2508.05183v1.pdf",
    "title": "FEL performance and tolerance studies of the EuPRAXIA@SPARC_LAB beamline   AQUA",
    "abstract": "The AQUA beamline of the EuPRAXIA@SPARC_LAB facility is a SASE free-electron laser designed to operate in the water window, in the 3-4 nm wavelength range. The electron beam driving this source is accelerated up to about 1-1.2 GeV by an X-band normal conducting linear accelerator, followed by a plasma wakefield acceleration stage. The main radiator consists of an array of ten APPLE-X permanent magnet undulator modules, each 2 m long and with a period length of 18 mm. Tolerance analyses against resistive wall wakefields and injection misalignments at undulator entrance are performed, and the related effects on the laser yield performance are evaluated and discussed.",
    "authors": [
      "Federico Nguyen",
      "Luca Giannessi",
      "Michele Opromolla",
      "Alberto Petralia"
    ],
    "published": "2025-08-07T09:18:46Z",
    "updated": "2025-08-07T09:18:46Z",
    "categories": [
      "physics.acc-ph",
      "physics.optics"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.1016/j.nima.2025.170291"
  },
  {
    "arxiv_id": "2508.05139v1",
    "url": "https://arxiv.org/abs/2508.05139v1",
    "pdf_url": "https://arxiv.org/pdf/2508.05139v1.pdf",
    "title": "Frobenius-Perron Operator Approach to the Beam-Beam Interaction in   Circular Colliders",
    "abstract": "Unlike most publications devoted to the application of the self-consistent method of the nonlinear Vlasov-Poisson system to the study of beam-beam interaction, in this article an alternative strategy using the elegant approach of the Frobenius-Perron operator for symplectic twist maps has been developed. A detailed analysis of the establishment of an equilibrium density distribution in phase space, as well as the behavior of the perturbed distribution function with respect to the coherent stability of the two beams, has been carried out.   Using the Renormalization Group technique for the reduction of the Frobenius-Perron operator, the case where the unperturbed rotation frequency (unperturbed betatron tune) of the map is far from any structural resonance driven by the beam-beam kick perturbation has been analyzed in detail. It has been shown that up to second order in the beam-beam parameter, the renormalized map propagator with nonlinear stabilization describes a random walk of the angle variable, implying that there exists an equilibrium distribution function depending only on the action variable.   The linearized Frobenius-Perron operators for each beam imply a discrete form of the linearized Vlasov equations, which essentially comprises a new method for calculating coherent beam-beam instabilities using a matrix mapping technique. In the special case of an isolated coherent beam-beam resonance, a stability criterion for coherent beam-beam resonances has been found in closed form.   An intriguing particular concerning the effect of repeated beam-beam collisions on collider luminosity has been derived explicitly. An addition of luminosity per kick (small though, of the order of the beam-beam parameter) in the course of successive beam-beam collisions could be achieved.",
    "authors": [
      "Stephan I. Tzenov"
    ],
    "published": "2025-08-07T08:16:57Z",
    "updated": "2025-08-07T08:16:57Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.05127v1",
    "url": "https://arxiv.org/abs/2508.05127v1",
    "pdf_url": "https://arxiv.org/pdf/2508.05127v1.pdf",
    "title": "Information Propagation in Predator-Prey Dynamics of Turbulent Plasma",
    "abstract": "Magnetically confined fusion plasmas exhibit predator-prey-like cyclic oscillations through the self-regulating interaction between drift-wave turbulence and zonal flow. To elucidate the detailed mechanism and causality underlying this phenomenon, we construct a simple stochastic predator-prey model that incorporates intrinsic fluctuations and analyze its statistical properties from an information-theoretic perspective. We first show that the model exhibits persistent fluctuating cyclic oscillations called quasi-cycles due to amplification of intrinsic noise. This result suggests the possibility that the previously observed periodic oscillations in a toroidal plasma are not limit cycles but quasi-cycles, and that such quasi-cycles may be widely observed under various conditions. For this model, we further prove that information of zonal flow is propagated to turbulence. This information-theoretic analysis may provide a theoretical basis for regulating turbulence by controlling zonal flow.",
    "authors": [
      "Tomohiro Tanogami",
      "Makoto Sasaki",
      "Tatsuya Kobayashi"
    ],
    "published": "2025-08-07T08:07:45Z",
    "updated": "2025-08-07T08:07:45Z",
    "categories": [
      "physics.plasm-ph",
      "cond-mat.stat-mech",
      "physics.flu-dyn"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.05096v1",
    "url": "https://arxiv.org/abs/2508.05096v1",
    "pdf_url": "https://arxiv.org/pdf/2508.05096v1.pdf",
    "title": "A mobile high spatial-resolution Muography hodoscope based on large-area   Micromegas detectors",
    "abstract": "Muon radiography is an imaging technique based on muon absorption in matter that allows measurement of internal details in hidden objects or structures. This technique relies on measuring cosmic-ray muons tracks accurately, which reflects the incoming muon flux from both the target object and the open sky. In this paper, we report on the construction of a high spatial resolution muography hodoscope based on Micromegas detectors. Using four layers of 40cm {\\times} 40 cm Micromegas detectors, channel multiplexing circuits, and the versatile readout system, a moveable muography hodoscope named {\\mu}STC-R400 was designed and constructed. Results show that the channel multiplexing circuits can resolve hit positions correctly, and the spatial resolution of the detector is approximately 190 {\\mu}m. Experiments were conducted at an under-construction subway tunnel and outdoors near a mountain, demonstrating the {\\mu}STC-R400's ability to maintain high spatial resolution outside the laboratory and its robustness in harsh environments.",
    "authors": [
      "Yu Wang",
      "Shubin Liu",
      "Zhihang Yao",
      "Yulin Liu",
      "Zhiyong Zhang",
      "Zhengyang He",
      "Ziwen Pan",
      "Changqing Feng"
    ],
    "published": "2025-08-07T07:34:36Z",
    "updated": "2025-08-07T07:34:36Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.01023v2",
    "url": "https://arxiv.org/abs/2508.01023v2",
    "pdf_url": "https://arxiv.org/pdf/2508.01023v2.pdf",
    "title": "Malter-Driven Electron Emission as a Source of Noise in LXe TPCs",
    "abstract": "Persistent single-electron emission (\"hot spots\") has been observed in multiple liquid xenon (LXe) time projection chambers (TPCs), often persisting long after ionizing events. Although typically discussed in operational terms, the behavior is consistent with Malter-type emission triggered by ion accumulation on resistive oxide surfaces. In this note, we discuss such effects and recommend material choices and design strategies to mitigate them in future detectors. This mechanism is especially relevant to experiments targeting ultra-low energy thresholds, where even small background emissions can limit sensitivity.",
    "authors": [
      "J. Va'vra"
    ],
    "published": "2025-08-01T18:48:59Z",
    "updated": "2025-08-07T02:54:36Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.04881v1",
    "url": "https://arxiv.org/abs/2508.04881v1",
    "pdf_url": "https://arxiv.org/pdf/2508.04881v1.pdf",
    "title": "Magnetic shear effects on ballooning turbulence in the boundary of   fusion devices",
    "abstract": "The effect of magnetic shear on ballooning-driven plasma edge turbulence is studied through nonlinear simulations complemented by linear numerical and analytical investigations. Nonlinear, 3D, global, flux-driven simulations using the GBS code show that the scale separation between radial, x, and poloidal, y, size of turbulent eddies, kx << ky , considered by Ricci et al. (2008) and extensively used to predict pressure gradient lengths, SOL width, particle and heat fluxes, is observed with high magnetic shear. In contrast, for low magnetic shear, kx ~ ky is observed, with fluctuation properties resembling those shown by recent low-shear stellarator simulations reported in Coelho et al. (2024a). Global linear investigations of the ballooning mode qualitatively captures the transition in mode structure with varying magnetic shear, showing that kx << ky is achieved with sufficiently strong poloidal mode coupling enhanced by increasing magnetic shear, resistivity, toroidal mode number, and equilibrium gradient scale length. This is confirmed by an analytical study considering a dominant poloidal mode and its sidebands, which highlights that the poloidal mode structure is determined by curvature and k parallel effects",
    "authors": [
      "Z. Tecchiolli",
      "A. J. Coelho",
      "J. Loizu",
      "B. De Lucca",
      "P. Ricci"
    ],
    "published": "2025-08-06T21:09:44Z",
    "updated": "2025-08-06T21:09:44Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2403.03156v5",
    "url": "https://arxiv.org/abs/2403.03156v5",
    "pdf_url": "https://arxiv.org/pdf/2403.03156v5.pdf",
    "title": "The Fast Stochastic Matching Pursuit for Neutrino and Dark Matter   Experiments",
    "abstract": "Photomultiplier tubes (PMTs) are widely deployed at neutrino and dark matter experiments for photon counting. When multiple photons hit a PMT consecutively, their photo-electron (PE) pulses pile up to hinder the precise measurements of the count and timings. We introduce Fast Stochastic Matching Pursuit (FSMP) to analyze the PMT signal waveforms into individual PEs with the strategy of reversible-jump Markov-chain Monte Carlo. We demonstrate that FSMP improves the energy and time resolution of PMT-based experiments and gains acceleration on GPUs. It is suitable for dynode PMTs, and is extensible to microchannel-plate (MCP) PMTs. In the condition of our laboratory characterization of 8-inch MCP-PMTs, FSMP improves the energy resolution by up to 10% from the conventional method of waveform integration.",
    "authors": [
      "Yuyi Wang",
      "Aiqiang Zhang",
      "Yiyang Wu",
      "Benda Xu",
      "Xuewei Liu",
      "Jiajie Chen",
      "Zhe Wang",
      "Shaomin Chen"
    ],
    "published": "2024-03-05T17:49:06Z",
    "updated": "2025-08-06T20:01:24Z",
    "categories": [
      "hep-ex",
      "physics.data-an",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2508.04807v1",
    "url": "https://arxiv.org/abs/2508.04807v1",
    "pdf_url": "https://arxiv.org/pdf/2508.04807v1.pdf",
    "title": "Detection of New Auroral Emissions at Io and Implications for Its   Interaction with the Plasma Torus",
    "abstract": "We observed Io's optical aurora in eclipse on six nights between 2022 and 2024 using Keck I/HIRES. Spectra revealed 13 new auroral emissions not identified previously, tripling the total number of optical emissions lines detected at Io. These included the O I lines at 777.4 and 844.6 nm, the Na I lines at 818.3 and 819.5 nm, the [S I] lines at 458.9 and 772.5 nm, the S I triplet at 922.3 nm, the [O II] lines at 732.0 and 733.0 nm and the [S II] lines at 406.9, 407.6, 671.6 and 673.1 nm. We leveraged these new detections by comparing with imaging data from the 2001 Cassini flyby to better understand the distribution of atmospheric species and their contribution to the observed auroral brightnesses. Our auroral emission model showed that the observed 557.7, 777.4 and 844.6 nm oxygen emission line brightnesses could be explained by excitation by electron impact of canonical 5 eV torus electrons on an atmosphere composed of O, SO2 and an isoelectronic proxy for SO. The SO2 emission did not decrease immediately after eclipse ingress, suggesting the emitting column may be restricted to higher altitudes. The derived O/SO2 mixing ratio was typically about 10%, but it also exhibited order-of-magnitude variance during some observations. Io's 630.0 nm [O I] brightness did not strongly vary with plasma sheet distance, suggesting electron flux at Io varies substantially beyond model predictions.",
    "authors": [
      "Zachariah Milby",
      "Katherine de Kleer",
      "Carl Schmidt"
    ],
    "published": "2025-08-06T18:34:26Z",
    "updated": "2025-08-06T18:34:26Z",
    "categories": [
      "astro-ph.EP",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.EP",
    "doi": "10.3847/PSJ/ade0b1"
  },
  {
    "arxiv_id": "2508.04806v1",
    "url": "https://arxiv.org/abs/2508.04806v1",
    "pdf_url": "https://arxiv.org/pdf/2508.04806v1.pdf",
    "title": "Electrodeless Magnetohydrodynamic Local Force Generator for Aerocapture",
    "abstract": "This paper presents a novel magnetohydrodynamics (MHD) system for planetary entry aerocapture. The system is advantaged over previous approaches by having the following two characteristics: (i) it can be deployed locally to one or various flow regions, and (ii) it does not make use of electrodes. Previous MHD systems for planetary entry were either electrodeless global systems or two-electrode local systems. The proposed novel MHD system employs two magnets to establish a current loop resulting in a Faraday electromotive force (EMF). The first magnet is positioned to ensure the magnetic field faces outward from the shell, while the second magnet is oriented to ensure the magnetic field faces inward toward the shell. Preliminary findings demonstrate that when located on the surface of an Earth entry capsule at a flight Mach number of 35, the novel electrodeless MHD system can generate forces several times greater than a two-electrode system while utilizing the same magnetic field strength. The study is conducted entirely through numerical simulation using CFDWARP, a computational fluid dynamics (CFD) code that employs advanced numerical methods allowing for the full coupling between aerodynamics, magnetohydrodynamics, and non-neutral plasma sheaths. The physical model includes an 11-species finite-rate chemical solver including real gas effects, the drift-diffusion model for all charged species, along with an electric field potential equation that satisfies Gauss's law.",
    "authors": [
      "Bernard Parent",
      "Felipe Martin Rodriguez Fuentes",
      "Spencer LaFoley"
    ],
    "published": "2025-08-06T18:33:01Z",
    "updated": "2025-08-06T18:33:01Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.2514/1.J064125"
  },
  {
    "arxiv_id": "2508.04621v1",
    "url": "https://arxiv.org/abs/2508.04621v1",
    "pdf_url": "https://arxiv.org/pdf/2508.04621v1.pdf",
    "title": "Controlling the electric force on a dust particle during the afterglow   of a plasma at a higher gas pressure",
    "abstract": "When dust particles are immersed in a plasma, and the power that sustains a plasma is terminated, the charge of dust particles will change in the early afterglow, as electrons and ions gradually diminish in number. The possibility of controlling this charge, along with the electric force acting on the particles in the late afterglow, has earlier been demonstrated at a low gas pressure of 8 mTorr. Here, it is confirmed experimentally that controlling particles is possible also at a higher gas pressure of 90 mTorr, in a capacitively coupled radio-frequency plasma (CCP). A timed application of a DC electric field during the afterglow is a key element of this control scheme. Analyzing the experimental results, the electric force in the late afterglow was determined by comparing measurements of particle velocity to a prediction made by integrating the equation of motion, taking into account gas friction. In addition to applying friction to dust particles, gas also slows the drifting motion of electrons and ions, reducing their energy during the afterglow, but nevertheless we find that dust particles become charged in the afterglow so that one can apply an electric force to them that is comparable to the gravitational force, even at a higher pressure than had previously been demonstrated. This result extends the parameter range for which it is expected that particle contamination in semiconductor manufacturing can be mitigated by controlling charge and forces during the afterglow. Because of the way that forces scale with particle size, it is expected that submicron particles can be controlled even more easily than the larger spheres in the present experiment.",
    "authors": [
      "Neeraj Chaubey",
      "J. Goree"
    ],
    "published": "2025-08-06T16:48:33Z",
    "updated": "2025-08-06T16:48:33Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2505.02546v3",
    "url": "https://arxiv.org/abs/2505.02546v3",
    "pdf_url": "https://arxiv.org/pdf/2505.02546v3.pdf",
    "title": "Piecewise omnigenous stellarators with zero bootstrap current",
    "abstract": "Until now, quasi-isodynamic magnetic fields have been the only known stellarator configurations that, at low collisionality, give small radial neoclassical transport and zero bootstrap current for arbitrary plasma profiles, the latter facilitating control of the magnetic configuration. The recently introduced notion of piecewise omnigenous fields has enormously broadened the space of stellarator configurations with small radial neoclassical transport. In this Letter, the existence of piecewise omnigenous fields that give zero bootstrap current is proven analytically and confirmed numerically. These results establish piecewise omnigenity as an alternative approach to stellarator reactor design.",
    "authors": [
      "Ivan Calvo",
      "Jose Luis Velasco",
      "Per Helander",
      "Felix I. Parra"
    ],
    "published": "2025-05-05T10:32:52Z",
    "updated": "2025-08-06T14:49:41Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1103/tnh1-mq88"
  },
  {
    "arxiv_id": "2411.18474v4",
    "url": "https://arxiv.org/abs/2411.18474v4",
    "pdf_url": "https://arxiv.org/pdf/2411.18474v4.pdf",
    "title": "Uniform Field in Microwave Cavities Through the Use of Effective   Magnetic Walls",
    "abstract": "Wire media (WM) resonators have emerged as promising realization for plasma haloscopes -- devices designed to detect axions, a potential component of dark matter. Key factors influencing the detection probability include cavity volume, resonance quality factor, and form factor. While the form factor has been explored for resonant frequency tuning, its optimization for axion detection remains unexplored. In this work, we present a novel approach to significantly enhance the form factor of WM plasma haloscopes. By shifting the metal walls of the resonator by a quarter wavelength, we effectively convert an electric wall boundary condition into a magnetic wall one, allowing for an almost uniform mode. Theoretical analysis and numerical simulations confirm that this modification improves the electric field profile and boosts the form factor. We validate these findings through experimental results from two prototype resonators: one with a standard geometry and another with a quarter-wave air gap between the WM and the walls. Additionally, our method provides a simple way to control the field profile within WM cavities, which can be explored for further applications.",
    "authors": [
      "Jim A. Enriquez",
      "Rustam Balafendiev",
      "Alexander J. Millar",
      "Constantin Simovski",
      "Pavel Belov"
    ],
    "published": "2024-11-27T16:09:35Z",
    "updated": "2025-08-06T14:08:43Z",
    "categories": [
      "physics.ins-det",
      "physics.app-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1103/PhysRevApplied.23.054053"
  },
  {
    "arxiv_id": "2508.04434v1",
    "url": "https://arxiv.org/abs/2508.04434v1",
    "pdf_url": "https://arxiv.org/pdf/2508.04434v1.pdf",
    "title": "Explanation of the seasonal variation of cosmic multiple muon events   observed with the NOvA Near Detector",
    "abstract": "The flux of cosmic ray muons at the Earth's surface exhibits seasonal variations due to changes in the temperature of the atmosphere affecting the production and decay of mesons in the upper atmosphere. Using data collected by the NOvA Near Detector during 2018--2022, we studied the seasonal pattern in the multiple-muon event rate. The data confirm an anticorrelation between the multiple-muon event rate and effective atmospheric temperature, consistent across all the years of data. Previous analyses from MINOS and NOvA saw a similar anticorrelation but did not include an explanation. We find that this anticorrelation is driven by altitude--geometry effects as the average muon production height changes with the season. This has been checked with a CORSIKA cosmic ray simulation package by varying atmospheric parameters, and provides an explanation to a longstanding discrepancy between the seasonal phases of single and multiple-muon events.",
    "authors": [
      "The NOvA Collaboration"
    ],
    "published": "2025-08-06T13:21:45Z",
    "updated": "2025-08-06T13:21:45Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2508.04300v1",
    "url": "https://arxiv.org/abs/2508.04300v1",
    "pdf_url": "https://arxiv.org/pdf/2508.04300v1.pdf",
    "title": "Mathematical formulation of mode-to-mode energy transfers and energy   fluxes in compressible turbulence",
    "abstract": "Understanding compressible turbulence is critical for modeling atmospheric, astrophysical, and engineering flows. However, compressible turbulence poses a more significant challenge than incompressible turbulence. We present a novel mathematical framework to compute \\textit{mode-to-mode energy transfer rates} and energy fluxes for compressible flows. The formalism captures detailed energy conservation within triads and allows decomposition of transfers into rotational, compressive, and mixed components, providing a clear picture of energy exchange among velocity and internal energy modes. We also establish analogies with incompressible hydrodynamic and magnetohydrodynamic flows, highlighting the framework's universality in studying energy transfers.",
    "authors": [
      "Dhananjay Singh",
      "Harshit Tiwari",
      "Lekha Sharma",
      "Mahendra K. Verma"
    ],
    "published": "2025-08-06T10:35:06Z",
    "updated": "2025-08-06T10:35:06Z",
    "categories": [
      "physics.flu-dyn",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.flu-dyn"
  },
  {
    "arxiv_id": "2508.04294v1",
    "url": "https://arxiv.org/abs/2508.04294v1",
    "pdf_url": "https://arxiv.org/pdf/2508.04294v1.pdf",
    "title": "Open Gas-Cell Transmission Electron Microscopy at 50 pm Resolution",
    "abstract": "Transmission electron microscopy (TEM) has reached ~ 50 picometer resolution in a high vacuum, enabling single-atom sensitive imaging of nanomaterials. Extending this capability to gaseous environments would allow for similar visualizations of nanomaterial dynamics under chemically reactive conditions. Here, we examine a new TEM system that maintains 50 pm resolution at pressures up to 1 mbar, demonstrated using nanocrystalline Au immersed in N2. The system features an open gas-cell with a four-stage differential pumping system, a 5th order aberration corrector for broad-beam TEM, a monochromatized electron beam, an ultra-stable microscope platform, Nelsonian low electron dose-rate illumination, and direct electron detection. Young fringe experiments and exit wave phase imaging confirm the atomic resolution and indicate location-dependent vibrational blur at surface terminations. Thus, this platform advances in situ and operando TEM studies of gas-surface interactions in diverse fields, including catalysis, corrosion, and crystal growth.",
    "authors": [
      "Idan Biran",
      "Frederik Dam",
      "Sophie Kargo Kaptain",
      "Ruben Bueno Villoro",
      "Maarten Wirix",
      "Christian Kisielowski",
      "Peter C. K. Vesborg",
      "Jakob Kibsgaard",
      "Thomas Bligaard",
      "Christian D. Damsgaard",
      "Joerg R. Jinschek",
      "Stig Helveg"
    ],
    "published": "2025-08-06T10:30:28Z",
    "updated": "2025-08-06T10:30:28Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2508.04232v1",
    "url": "https://arxiv.org/abs/2508.04232v1",
    "pdf_url": "https://arxiv.org/pdf/2508.04232v1.pdf",
    "title": "Enhanced sensitivity to trace $^{238}$U impurity of sapphire via   coincidence neutron activation analysis",
    "abstract": "Sapphire has mechanical and electrical properties that are advantageous for the construction of internal components of radiation detectors such as time projection chambers and bolometers. However, it has proved difficult to assess its $\\rm ^{232}Th$ and $\\rm ^{238}U$ content down to the picogram per gram level. This work reports an experimental verification of a computational study that demonstrates $\\gamma\\gamma$ coincidence counting, coupled with neutron activation analysis (NAA), can reach ppt sensitivities. Combining results from $\\gamma\\gamma$ coincidence counting with those of earlier single-$\\gamma$ counting based NAA shows that a sample of Saint Gobain sapphire has $\\rm ^{232}Th$ and $\\rm ^{238}U$ concentrations of $<0.26$ ppt and $<2.3$ ppt, respectively; the best constraints on the radiopurity of sapphire.",
    "authors": [
      "D. Chernyak",
      "I. J. Arnquist",
      "T. Daniels",
      "S. W. Finch",
      "L. Hissong",
      "M. Hughes",
      "R. MacLellan",
      "A. Piepke",
      "A. Pocar",
      "R. Roshong",
      "R. Saldanha",
      "R. H. M. Tsang"
    ],
    "published": "2025-08-06T09:15:19Z",
    "updated": "2025-08-06T09:15:19Z",
    "categories": [
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "nucl-ex"
  },
  {
    "arxiv_id": "2508.04210v1",
    "url": "https://arxiv.org/abs/2508.04210v1",
    "pdf_url": "https://arxiv.org/pdf/2508.04210v1.pdf",
    "title": "Stabilization and Re-excitation of Sawtooth Oscillations due to   Energetic Particles in Tokamaks",
    "abstract": "Sawtooth oscillations, driven by internal kink modes (IKMs), are fundamental phenomena in tokamak plasmas. They can be classified into different types, including normal sawteeth, small sawteeth, and in some cases, evolving into the steady-island state, each having a different impact on energy confinement in fusion reactors. This study investigates the interaction between sawtooth oscillations and energetic particles (EPs) using the initial-value MHD-kinetic hybrid code CLT-K, which can perform long-term self-consistent nonlinear simulations. We analyze the redistribution of EPs caused by sawtooth crashes and the effect of EPs on sawtooth behavior and type transitions. The results show that co-passing EPs tend to re-excite sawtooth oscillations, extending their period, while counter-passing EPs promote the system evolution toward small sawteeth, potentially leading to the steady-island state. Additionally, we provide a physical picture of how EPs influence sawtooth type through the mechanism of magnetic flux pumping. We demonstrate that the radial residual flow in the core plays a crucial role in determining the reconnection rate and sawtooth type. Moreover, we observe new phenomena about couplings of various instabilities, such as the excitation of global multi-mode toroidal Alfv\\'en eigenmodes (TAEs) due to EP redistribution following a sawtooth crash and the excitation of the resonant tearing mode (r-TM) when injecting counter-passing EPs. The study also explores the impact of EP energy and the safety factor profile on the development of stochastic magnetic fields and EP transport. These findings emphasize the necessity of multi-mode simulations in capturing the complexity of EP-sawtooth interactions and provide insights for optimizing sawtooth control in future reactors such as ITER.",
    "authors": [
      "H. X. Zhang",
      "H. W. Zhang",
      "Z. W. Ma",
      "J. X. Huang",
      "W. Zhang"
    ],
    "published": "2025-08-06T08:46:07Z",
    "updated": "2025-08-06T08:46:07Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.04121v1",
    "url": "https://arxiv.org/abs/2508.04121v1",
    "pdf_url": "https://arxiv.org/pdf/2508.04121v1.pdf",
    "title": "Stimulated Brillouin Amplification with Flying Focus",
    "abstract": "Material damage thresholds pose a fundamental limit to chirped pulse amplification (CPA) in high-power laser systems. Plasma-based amplification via stimulated Brillouin scattering (SBS) offers a damage-free alternative, yet its effectiveness has been hindered by instabilities that constrain interaction length. In this study, we report the first experimental demonstration of SBS amplification driven by a flying focus in a 3-mm plasma channel. The flying focus is generated using chromatic aberration from spherical lenses, with its velocity precisely measured by an interferometric ionization method achieving 6.6 fs timing resolution. At a focus velocity near -c, SBS amplification is realized at pump and seed intensities more than two orders of magnitude lower than in conventional setups, yielding a conversion efficiency of 14.5%. These results validate flying focus as a powerful tool for extending interaction lengths and enabling efficient plasma-based laser amplification at reduced intensities.",
    "authors": [
      "Zhaohui Wu",
      "Xiaoming Zeng",
      "Zhaoli Li",
      "Xiaodong Wang",
      "Xiao Wang",
      "Jie Mu",
      "Yanlei Zuo",
      "Kainan Zhou",
      "Hao Peng",
      "C. Riconda",
      "S. Weber"
    ],
    "published": "2025-08-06T06:37:02Z",
    "updated": "2025-08-06T06:37:02Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.04103v1",
    "url": "https://arxiv.org/abs/2508.04103v1",
    "pdf_url": "https://arxiv.org/pdf/2508.04103v1.pdf",
    "title": "Compact and robust optical frequency reference module based on   reproducible and redistributable optical design",
    "abstract": "Stabilized optical frequency references (OFRs) are indispensable for atom-based quantum technologies, optical communications, and precision metrology. As these systems become more sophisticated, demands for compactness, robustness, and straightforward reproduction have grown. In this work, we present a robust 19-inch rack-mountable OFR module designed via a web-based CAD workflow that allows straightforward redistribution and reproduction. Its optical subsystem, designed based on a modeled laser beam path, places optical elements with sub-millimeter accuracy on a custom-machined aluminum plate, allowing straightforward assembly without extensive alignment and providing high mechanical stability. The module maintains frequency-stable operation for several months without user intervention and exhibits high robustness to mechanical vibrations up to 4g. All design files, including mechanical and optical metadata, are openly shared for straightforward reproduction and adaptation.",
    "authors": [
      "Jiwon Wi",
      "Taehee Kim",
      "Junki Kim"
    ],
    "published": "2025-08-06T05:46:12Z",
    "updated": "2025-08-06T05:46:12Z",
    "categories": [
      "physics.atom-ph",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2508.04093v1",
    "url": "https://arxiv.org/abs/2508.04093v1",
    "pdf_url": "https://arxiv.org/pdf/2508.04093v1.pdf",
    "title": "Trapping an Atomic Ion without Dedicated Digital-to-analog Converters",
    "abstract": "Independent control of numerous electrodes in quantum charge-coupled device architectures presents a significant challenge for wiring and hardware scalability. To address this issue, we demonstrate a voltage control method based on time-division multiplexing (TDM). This approach utilizes a single high-update-rate digital-to-analog converter (DAC) to sequentially generate control signals for multiple electrodes, thereby reducing both the number of required DACs and associated wiring. We experimentally validate this concept by developing a 10-channel system that operates with only two DACs. The developed TDM-based voltage control system is applied to a surface-electrode trap, where we successfully trap a single $^{40}\\mathrm{Ca}^+$ ion. This approach offers a resource-efficient and scalable solution for advanced quantum computing systems based on trapped ions.",
    "authors": [
      "Ryutaro Ohira",
      "Masanari Miyamoto",
      "Shinichi Morisaka",
      "Ippei Nakamura",
      "Atsushi Noguchi",
      "Utako Tanaka",
      "Takefumi Miyoshi"
    ],
    "published": "2025-08-06T05:21:24Z",
    "updated": "2025-08-06T05:21:24Z",
    "categories": [
      "quant-ph",
      "physics.ins-det"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2501.12722v2",
    "url": "https://arxiv.org/abs/2501.12722v2",
    "pdf_url": "https://arxiv.org/pdf/2501.12722v2.pdf",
    "title": "Zonal flow suppression of turbulent transport in the optimized   stellarators W7-X and QSTK",
    "abstract": "We present a comparative study of transport in two optimized stellarator configurations: Wendelstein 7-X (W7-X) and a recent design called Quasi-Symmetric Turbulence Konzept (QSTK). Using global Gyrokinetic Toroidal Code (GTC), we explore the role of zonal flows (ZFs) in suppressing electrostatic Ion Temperature Gradient (ITG) driven turbulence in both configurations. The simulations reveal that ZFs significantly reduce ion heat transport in both W7-X and QSTK, with a lower value of heat flux on the latter configuration, as suggested by the apparently higher linear threshold (''critical'') gradients for ITG modes. The study also highlights that both stellarators exhibit similar mode structures. The results support the notion that linear stability measures, in combination with nonlinear stabilization by zonal flows, can play an important role in the suppression of nonlinear heat fluxes.",
    "authors": [
      "Abhishek Tiwari",
      "Joydeep Das",
      "Jaya Kumar Alageshan",
      "Gareth Roberg-Clark",
      "Gabriel Plunk",
      "Pavlos Xanthopoulos",
      "Sarveshwar Sharma",
      "Zhihong Lin",
      "Animesh Kuley"
    ],
    "published": "2025-01-22T08:51:03Z",
    "updated": "2025-08-06T05:15:49Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.00322v2",
    "url": "https://arxiv.org/abs/2508.00322v2",
    "pdf_url": "https://arxiv.org/pdf/2508.00322v2.pdf",
    "title": "Development of Space Qualified Signal Processing Readout Electronics for   HabWorlds and Origins Space Telescope Detector and Arrays",
    "abstract": "The Habitable Worlds Observatory (HWO) -- a flagship ultraviolet/optical/infrared space telescope recommended by the National Academies' Pathways to Discovery in Astronomy and Astrophysics -- will require detector technologies capable of supporting significantly larger pixel-count arrays than previous missions. Microwave Kinetic Inductance Detectors (MKIDs), naturally suited to microwave multiplexing readout, are already in use across several balloon-borne missions with FPGA based systems. To transition this capability to space, we are developing a radiation-hardened detector readout system that builds directly on the technical and environmental requirements defined by the PRIMA mission. PRIMA serves as a critical pathfinder, informing the radiation tolerance, resource constraints, and on-board processing capabilities needed for HWO. In this work, we present our current results on algorithm implementation, hardware architecture, and firmware development using the radiation-hardened AMD Kintex Ultrascale FPGA, aligning with PRIMA's stringent specifications to ensure compatibility with future space-based observatories like HWO.",
    "authors": [
      "Tracee Jamison-Hooks",
      "Lynn Miles",
      "Sanetra Newman-Bailey",
      "Oketa Basha",
      "Abarna Karthikeyan",
      "Sarah E. Kay",
      "Sean Bryan",
      "Philip Mauskopf",
      "Thomas Essinger-Hileman",
      "Jason Glen",
      "Sumit Dahal",
      "Adrian Sinclair",
      "Kathryn Chamberlain"
    ],
    "published": "2025-08-01T05:11:53Z",
    "updated": "2025-08-06T03:13:17Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2508.03975v1",
    "url": "https://arxiv.org/abs/2508.03975v1",
    "pdf_url": "https://arxiv.org/pdf/2508.03975v1.pdf",
    "title": "Theory uncertainties in predictions of strong-field QED",
    "abstract": "Experiments using high-power lasers and relativistic electron beams will soon be capable of precision testing of the theory of strong-field quantum electrodynamics. The comparison between experiment and theory always occurs via numerical simulations, but the lack of quantitative uncertainty bounds for the latter means that the origin of any discrepancies cannot be identified conclusively. Here I present a simulation framework that can place meaningful bounds on the theory uncertainties inherent to its operation. This work shows that the use of the locally constant field approximation leads to a theory uncertainty of a few per cent in the signals of quantum radiation reaction expected in near-term experiments.",
    "authors": [
      "T. G. Blackburn"
    ],
    "published": "2025-08-05T23:59:09Z",
    "updated": "2025-08-05T23:59:09Z",
    "categories": [
      "hep-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2508.03946v1",
    "url": "https://arxiv.org/abs/2508.03946v1",
    "pdf_url": "https://arxiv.org/pdf/2508.03946v1.pdf",
    "title": "Sub-5-fs compression and synchronization of relativistic electron   bunches enabled by a high-gradient $α$-magnet and low-jitter   photoinjector",
    "abstract": "Generating high-brightness relativistic electron bunches with few-femtosecond duration, while simultaneously achieving few-fs synchronization with ultrafast lasers, remains an outstanding challenge at the frontier of accelerator physics and ultrafast science. In this Letter, we present the beam physics and experimental demonstration of a new method that, for the first time, enables simultaneous control of bunch duration and synchronization with few-fs precision. Timing stabilization is achieved using a tailored high-gradient $\\alpha$-magnet that optimizes the correlation between time of flight and momentum, together with a photocathode RF gun designed to suppress the effect of RF-to-laser timing jitter. Compression is realized by manipulating the time-momentum correlation in phase space, primarily through space-charge effects. Sub-5-fs rms bunch duration and synchronization are demonstrated. This method establishes a new regime in electron bunch control, unlocking new capabilities for ultrafast beam physics and applications.",
    "authors": [
      "Yining Yang",
      "Zhiyuan Wang",
      "Peng Lv",
      "Baiting Song",
      "Pengwei Huang",
      "Yanqing Jia",
      "Zhuoxuan Liu",
      "Lianmin Zheng",
      "Wenhui Huang",
      "Pietro Musumeci",
      "Chuanxiang Tang",
      "Renkai Li"
    ],
    "published": "2025-08-05T22:28:35Z",
    "updated": "2025-08-05T22:28:35Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2506.20137v2",
    "url": "https://arxiv.org/abs/2506.20137v2",
    "pdf_url": "https://arxiv.org/pdf/2506.20137v2.pdf",
    "title": "Operation of the Trigger System for the ICARUS Detector at Fermilab",
    "abstract": "The ICARUS liquid argon TPC detector is taking data on the Booster (BNB) and Main Injector (NuMI) Neutrino beam lines at Fermilab with a trigger system based on the scintillation light produced by charged particles in coincidence with the proton beam extraction from the accelerators. The architecture and the deployment of the trigger system in the first two runs for physics are presented, as well as the triggered event rates. The event recognition efficiency has been evaluated as a function of the deposited energy and the position of cosmic muons stopping inside the detector.",
    "authors": [
      "ICARUS collaboration",
      "F. Abd Alrahman",
      "P. Abratenko",
      "N. Abrego-Martinez",
      "A. Aduszkiewicz",
      "F. Akbar",
      "L. Aliaga Soplin",
      "M. Artero Pons",
      "J. Asaadi",
      "W. F. Badgett",
      "B. Baibussinov",
      "F. Battisti",
      "V. Bellini",
      "R. Benocci",
      "J. Berger",
      "S. Berkman",
      "S. Bertolucci",
      "M. Betancourt",
      "A. Blanchet",
      "F. Boffelli",
      "M. Bonesini",
      "T. Boone",
      "B. Bottino",
      "A. Braggiotti",
      "D. Brailsford",
      "S. J. Brice",
      "V. Brio",
      "C. Brizzolari",
      "H. S. Budd",
      "A. Campani",
      "A. Campos",
      "D. Carber",
      "M. Carneiro",
      "I. Caro Terrazas",
      "H. Carranza",
      "F. Castillo Fernandez",
      "S. Centro",
      "G. Cerati",
      "A. Chatterjee",
      "D. Cherdack",
      "S. Cherubini",
      "N. Chithirasreemadam",
      "M. Cicerchia",
      "T. E. Coan",
      "A. Cocco",
      "M. R. Convery",
      "L. Cooper-Troendle",
      "S. Copello",
      "H. Da Motta",
      "M. Dallolio",
      "A. A. Dange",
      "A. de Roeck",
      "S. Di Domizio",
      "D. Di Ferdinando",
      "L. Di Noto",
      "M. Diwan",
      "S. Dolan",
      "L. Domine",
      "S. Donati",
      "F. Drielsma",
      "J. Dyer",
      "S. Dytman",
      "A. Falcone",
      "C. Farnese",
      "A. Fava",
      "N. Gallice",
      "F. G. Garcia",
      "C. Gatto",
      "D. Gibin",
      "A. Gioiosa",
      "W. Gu",
      "A. Guglielmi",
      "G. Gurung",
      "K. Hassinin",
      "H. Hausner",
      "A. Heggestuen",
      "B. Howard",
      "R. Howell",
      "Z. Hulcher",
      "I. Ingratta",
      "C. James",
      "W. Jang",
      "Y. -J. Jwa",
      "L. Kashur",
      "W. Ketchum",
      "J. S. Kim",
      "D. -H. Koh",
      "T. Krishnan",
      "J. Larkin",
      "Y. Li",
      "C. Mariani",
      "C. M. Marshall",
      "S. Martynenko",
      "N. Mauri",
      "K. S. McFarland",
      "A. Menegolli",
      "G. Meng",
      "O. G. Miranda",
      "A. Mogan",
      "N. Moggi",
      "E. Montagna",
      "A. Montanari",
      "C. Montanari",
      "M. Mooney",
      "G. Moreno-Granados",
      "J. Mueller",
      "M. Murphy",
      "D. P. Méndez",
      "D. Naples",
      "S. Palestini",
      "M. Pallavicini",
      "V. Paolone",
      "L. Pasqualini",
      "L. Patrizii",
      "L. Paudel",
      "G. Petrillo",
      "C. Petta",
      "V. Pia",
      "F. Pietropaolo",
      "F. Poppi",
      "M. Pozzato",
      "M. L. Pumo",
      "G. Putnam",
      "X. Qian",
      "A. Rappoldi",
      "G. L. Raselli",
      "S. Repetto",
      "F. Resnati",
      "A. M. Ricci",
      "E. Richards",
      "M. Rosenberg",
      "M. Rossella",
      "N. Rowe",
      "P. Roy",
      "C. Rubbia",
      "M. Saad",
      "S. Saha",
      "G. Salmoria",
      "S. Samanta",
      "A. Scaramelli",
      "D. Schmitz",
      "A. Schukraft",
      "D. Senadheera",
      "S-H. Seo",
      "F. Sergiampietri",
      "G. Sirri",
      "J. S. Smedley",
      "J. Smith",
      "M. Sotgia",
      "L. Stanco",
      "J. Stewart",
      "H. A. Tanaka",
      "M. Tenti",
      "K. Terao",
      "F. Terranova",
      "V. Togo",
      "D. Torretta",
      "M. Torti",
      "F. Tortorici",
      "D. Totani",
      "R. Triozzi",
      "Y. -T. Tsai",
      "K. V. Tsang",
      "T. Usher",
      "F. Varanini",
      "N. Vardy",
      "S. Ventura",
      "M. Vicenzi",
      "C. Vignoli",
      "B. Viren",
      "F. A. Wieler",
      "Z. Williams",
      "P. Wilson",
      "R. J. Wilson",
      "J. Wolfs",
      "T. Wongjirad",
      "A. Wood",
      "E. Worcester",
      "M. Worcester",
      "M. Wospakrik",
      "J. Xia",
      "S. Yadav",
      "H. Yu",
      "J. Yu",
      "A. Zani",
      "J. Zennamo",
      "J. Zettlemoyer",
      "C. Zhang",
      "S. Zucchelli"
    ],
    "published": "2025-06-25T05:11:50Z",
    "updated": "2025-08-05T21:48:48Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2508.03911v1",
    "url": "https://arxiv.org/abs/2508.03911v1",
    "pdf_url": "https://arxiv.org/pdf/2508.03911v1.pdf",
    "title": "Holovibes: real-time ultrahigh-speed digital hologram rendering and   short-time analysis",
    "abstract": "Real-time ultrahigh-speed rendering of digital holograms from high-bitrate interferogram streams demands robust parallel computing and efficient data handling with minimal latency. We present Holovibes, a high-performance software engine that enables real-time holographic image reconstruction and short-time analysis at unprecedented throughput. Holovibes integrates spatial demodulation techniques, such as Fresnel transformations and angular spectrum propagation, with temporal analysis methods including short-time Fourier transform (STFT) and principal component analysis (PCA) in a unified pipeline. By leveraging CUDA-based GPU acceleration, multithreaded parallelism, and efficient buffering, the system achieves high-throughput, low-latency processing suitable for demanding computational imaging applications. We demonstrate sustained real-time hologram rendering of 256x256-pixel from interferograms acquired by a streaming camera at 71,400 frames per second on commodity hardware with no frame loss, while maintaining an end-to-end latency of 30 ms. The engine also supports simultaneous recording of raw or processed data, enabling high-speed acquisition workflows essential for experimental applications. This work represents a significant advance over prior digital holography systems and provides a versatile platform for ultra-high-speed, real-time computational imaging.",
    "authors": [
      "Marius Dubosc",
      "Maxime Boy-Arnould",
      "Jules Guillou",
      "Titouan Gragnic",
      "Arthur Courselle",
      "Gustave Hervé",
      "Alexis Pinson",
      "Etienne Senigout",
      "Bastien Gaulier",
      "Simon Riou",
      "Chloé Magnier",
      "Noé Topeza",
      "Oscar Morand",
      "Thomas Xu",
      "Samuel Goncalves",
      "Edgar Delaporte",
      "Adrien Langou",
      "Paul Duhot",
      "Julien Nicolle",
      "Sacha Bellier",
      "David Chemaly",
      "Damien Didier",
      "Philippe Bernet",
      "Eliott Bouhana",
      "Fabien Colmagro",
      "Guillaume Poisson",
      "Anthony Strazzella",
      "Ilan Guenet",
      "Nicolas Blin",
      "Quentin Kaci",
      "Theo Lepage",
      "Loïc Bellonnet-Mottet",
      "Antoine Martin",
      "François Te",
      "Ellena Davoine",
      "Clement Fang",
      "Danae Marmai",
      "Hugo Verjus",
      "Eloi Charpentier",
      "Julien Gautier",
      "Florian Lapeyre",
      "Thomas Jarrossay",
      "Alexandre Bartz",
      "Cyril Cêtre",
      "Clement Ledant",
      "Eric Delanghe",
      "Arnaud Gaillard",
      "Geoffrey Le Gourrierec",
      "Jeffrey Bencteux",
      "Thomas Kostas",
      "Pierre Pagnoux",
      "Antoine Dillée",
      "Romain Cancillière",
      "Michael Atlan"
    ],
    "published": "2025-08-05T20:55:55Z",
    "updated": "2025-08-05T20:55:55Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2508.04728v1",
    "url": "https://arxiv.org/abs/2508.04728v1",
    "pdf_url": "https://arxiv.org/pdf/2508.04728v1.pdf",
    "title": "Neural Field-Based 3D Surface Reconstruction of Microstructures from   Multi-Detector Signals in Scanning Electron Microscopy",
    "abstract": "The scanning electron microscope (SEM) is a widely used imaging device in scientific research and industrial applications. Conventional two-dimensional (2D) SEM images do not directly reveal the three-dimensional (3D) topography of micro samples, motivating the development of SEM 3D surface reconstruction methods. However, reconstruction of complex microstructures remains challenging for existing methods due to the limitations of discrete 3D representations, the need for calibration with reference samples, and shadow-induced gradient errors. Here, we introduce NFH-SEM, a neural field-based hybrid SEM 3D reconstruction method that takes multi-view, multi-detector 2D SEM images as input and fuses geometric and photometric information into a continuous neural field representation. NFH-SEM eliminates the manual calibration procedures through end-to-end self-calibration and automatically disentangles shadows from SEM images during training, enabling accurate reconstruction of intricate microstructures. We validate the effectiveness of NFH-SEM on real and simulated datasets. Our experiments show high-fidelity reconstructions of diverse, challenging samples, including two-photon lithography microstructures, peach pollen, and silicon carbide particle surfaces, demonstrating precise detail and broad applicability.",
    "authors": [
      "Shuo Chen",
      "Yijin Li",
      "Xi Zheng",
      "Guofeng Zhang"
    ],
    "published": "2025-08-05T20:00:57Z",
    "updated": "2025-08-05T20:00:57Z",
    "categories": [
      "eess.IV",
      "cs.CV",
      "physics.ins-det"
    ],
    "primary_category": "eess.IV"
  },
  {
    "arxiv_id": "2412.01796v2",
    "url": "https://arxiv.org/abs/2412.01796v2",
    "pdf_url": "https://arxiv.org/pdf/2412.01796v2.pdf",
    "title": "Suppression of the collisionless tearing mode by flow shear:   implications for reconnection onset in the Alfvénic solar wind",
    "abstract": "We analyse the collisionless tearing mode instability of a current sheet with a strong shear flow across the layer. The growth rate decreases with increasing shear flow, and is completely stabilized as the shear flow becomes Alfv\\'enic. We also show that in the presence of strong flow shear, the tearing mode growth rate decreases with increasing background ion-to-electron temperature ratio, the opposite behaviour to the tearing mode without flow shear. We find that even a relatively small flow shear is enough to dramatically alter the scaling behaviour of the mode, because the growth rate is small compared to the shear flow across the ion scales (but large compared to shear flow across the electron scales). Our results may explain the relative absence of reconnection events in the near-Sun Alfv\\'enic solar wind observed recently by NASA's Parker Solar Probe.",
    "authors": [
      "A. Mallet",
      "S. Eriksson",
      "M. Swisdak",
      "J. Juno"
    ],
    "published": "2024-12-02T18:41:30Z",
    "updated": "2025-08-05T19:26:14Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph",
    "doi": "10.1017/S002237782500025X"
  },
  {
    "arxiv_id": "2503.09868v2",
    "url": "https://arxiv.org/abs/2503.09868v2",
    "pdf_url": "https://arxiv.org/pdf/2503.09868v2.pdf",
    "title": "Machine-learned trends in mirror configurations in the Large Plasma   Device",
    "abstract": "This study demonstrates the efficacy of ML-based trend inference using data from the Large Plasma Device (LAPD). The LAPD is a flexible basic plasma science device with a high discharge repetition rate (0.25-1 Hz) and reproducible plasmas capable of collecting high-spatial-resolution probe measurements. A diverse dataset is collected through random sampling of LAPD operational parameters, including the magnetic field strength and profile, fueling settings, and the discharge voltage. NN ensembles with uncertainty quantification are trained to predict time-averaged ion saturation current ($I_\\text{sat}$ -- proportional to density and the square root of electron temperature) at any position within the dataset domain. Model-inferred trends, such as the effects of introducing mirrors or changing the discharge voltage, are consistent with current understanding. In addition, axial variation is optimized via comprehensive search over $I_\\text{sat}$ predictions. Experimental validation of these optimized machine parameters demonstrate qualitative agreement, with quantitative differences attributable to Langmuir probe variation and cathode conditions. This investigation demonstrates, using ML techniques, a new way of extracting insight from experiments and novel optimization of plasmas. The code and data used in this study are made freely available.",
    "authors": [
      "Phil Travis",
      "Jacob Bortnik",
      "Troy Carter"
    ],
    "published": "2025-03-12T22:00:48Z",
    "updated": "2025-08-05T18:34:38Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1063/5.0270755"
  },
  {
    "arxiv_id": "2508.03822v1",
    "url": "https://arxiv.org/abs/2508.03822v1",
    "pdf_url": "https://arxiv.org/pdf/2508.03822v1.pdf",
    "title": "The LED calibration systems for the mDOM and D-Egg sensor modules of the   IceCube Upgrade",
    "abstract": "The IceCube Neutrino Observatory, instrumenting about 1 km$^3$ of deep, glacial ice at the geographic South Pole, is due to be enhanced with the IceCube Upgrade. The IceCube Upgrade, to be deployed during the 2025/26 Antarctic summer season, will consist of seven new strings of photosensors, densely embedded near the bottom center of the existing array. Aside from a world-leading sensitivity to neutrino oscillations, a primary goal is the improvement of the calibration of the optical properties of the instrumented ice. These will be applied to the entire archive of IceCube data, improving the angular and energy resolution of the detected neutrino events. For this purpose, the Upgrade strings include a host of new calibration devices. Aside from dedicated calibration modules, several thousand LED flashers have been incorporated into the photosensor modules. We describe the design, production, and testing of these LED flashers before their integration into the sensor modules as well as the use of the LED flashers during lab testing of assembled sensor modules.",
    "authors": [
      "R. Abbasi",
      "M. Ackermann",
      "J. Adams",
      "S. K. Agarwalla",
      "J. A. Aguilar",
      "M. Ahlers",
      "J. M. Alameddine",
      "S. Ali",
      "N. M. Amin",
      "K. Andeen",
      "C. Argüelles",
      "Y. Ashida",
      "S. Athanasiadou",
      "S. N. Axani",
      "R. Babu",
      "X. Bai",
      "J. Baines-Holmes",
      "A. Balagopal V.",
      "S. W. Barwick",
      "S. Bash",
      "V. Basu",
      "R. Bay",
      "J. J. Beatty",
      "J. Becker Tjus",
      "P. Behrens",
      "J. Beise",
      "C. Bellenghi",
      "B. Benkel",
      "S. BenZvi",
      "D. Berley",
      "E. Bernardini",
      "D. Z. Besson",
      "E. Blaufuss",
      "L. Bloom",
      "S. Blot",
      "I. Bodo",
      "F. Bontempo",
      "J. Y. Book Motzkin",
      "C. Boscolo Meneguolo",
      "S. Böser",
      "O. Botner",
      "J. Böttcher",
      "J. Braun",
      "B. Brinson",
      "Z. Brisson-Tsavoussis",
      "R. T. Burley",
      "D. Butterfield",
      "M. A. Campana",
      "K. Carloni",
      "J. Carpio",
      "S. Chattopadhyay",
      "N. Chau",
      "Z. Chen",
      "D. Chirkin",
      "S. Choi",
      "B. A. Clark",
      "A. Coleman",
      "P. Coleman",
      "G. H. Collin",
      "D. A. Coloma Borja",
      "A. Connolly",
      "J. M. Conrad",
      "R. Corley",
      "D. F. Cowen",
      "C. De Clercq",
      "J. J. DeLaunay",
      "D. Delgado",
      "T. Delmeulle",
      "S. Deng",
      "P. Desiati",
      "K. D. de Vries",
      "G. de Wasseige",
      "T. DeYoung",
      "J. C. Díaz-Vélez",
      "S. DiKerby",
      "M. Dittmer",
      "A. Domi",
      "L. Draper",
      "L. Dueser",
      "D. Durnford",
      "K. Dutta",
      "M. A. DuVernois",
      "T. Ehrhardt",
      "L. Eidenschink",
      "A. Eimer",
      "P. Eller",
      "E. Ellinger",
      "D. Elsässer",
      "R. Engel",
      "H. Erpenbeck",
      "W. Esmail",
      "S. Eulig",
      "J. Evans",
      "P. A. Evenson",
      "K. L. Fan",
      "K. Fang",
      "K. Farrag",
      "A. R. Fazely",
      "A. Fedynitch",
      "N. Feigl",
      "C. Finley",
      "L. Fischer",
      "D. Fox",
      "A. Franckowiak",
      "S. Fukami",
      "P. Fürst",
      "J. Gallagher",
      "E. Ganster",
      "A. Garcia",
      "M. Garcia",
      "G. Garg",
      "E. Genton",
      "L. Gerhardt",
      "A. Ghadimi",
      "C. Glaser",
      "T. Glüsenkamp",
      "J. G. Gonzalez",
      "S. Goswami",
      "A. Granados",
      "D. Grant",
      "S. J. Gray",
      "M. Gravois",
      "S. Griffin",
      "S. Griswold",
      "K. M. Groth",
      "D. Guevel",
      "C. Günther",
      "P. Gutjahr",
      "C. Ha",
      "C. Haack",
      "A. Hallgren",
      "L. Halve",
      "F. Halzen",
      "L. Hamacher",
      "M. Ha Minh",
      "M. Handt",
      "K. Hanson",
      "J. Hardin",
      "A. A. Harnisch",
      "P. Hatch",
      "A. Haungs",
      "J. Häußler",
      "K. Helbing",
      "J. Hellrung",
      "B. Henke",
      "L. Hennig",
      "F. Henningsen",
      "L. Heuermann",
      "R. Hewett",
      "N. Heyer",
      "S. Hickford",
      "A. Hidvegi",
      "C. Hill",
      "G. C. Hill",
      "R. Hmaid",
      "K. D. Hoffman",
      "D. Hooper",
      "S. Hori",
      "K. Hoshina",
      "M. Hostert",
      "W. Hou",
      "T. Huber",
      "K. Hultqvist",
      "K. Hymon",
      "A. Ishihara",
      "W. Iwakiri",
      "M. Jacquart",
      "S. Jain",
      "O. Janik",
      "M. Jansson",
      "M. Jeong",
      "M. Jin",
      "N. Kamp",
      "D. Kang",
      "W. Kang",
      "X. Kang",
      "A. Kappes",
      "L. Kardum",
      "T. Karg",
      "M. Karl",
      "A. Karle",
      "A. Katil",
      "M. Kauer",
      "J. L. Kelley",
      "M. Khanal",
      "A. Khatee Zathul",
      "A. Kheirandish",
      "H. Kimku",
      "J. Kiryluk",
      "C. Klein",
      "S. R. Klein",
      "Y. Kobayashi",
      "A. Kochocki",
      "R. Koirala",
      "H. Kolanoski",
      "T. Kontrimas",
      "L. Köpke",
      "C. Kopper",
      "D. J. Koskinen",
      "P. Koundal",
      "M. Kowalski",
      "T. Kozynets",
      "N. Krieger",
      "J. Krishnamoorthi",
      "T. Krishnan",
      "K. Kruiswijk",
      "E. Krupczak",
      "A. Kumar",
      "E. Kun",
      "N. Kurahashi",
      "E. A. Kurt",
      "N. Lad",
      "C. Lagunas Gualda",
      "L. Lallement Arnaud",
      "M. Lamoureux",
      "M. J. Larson",
      "F. Lauber",
      "J. P. Lazar",
      "K. Leonard DeHolton",
      "A. Leszczyńska",
      "J. Liao",
      "C. Lin",
      "Y. T. Liu",
      "M. Liubarska",
      "C. Love",
      "L. Lu",
      "F. Lucarelli",
      "W. Luszczak",
      "Y. Lyu",
      "J. Madsen",
      "E. Magnus",
      "Y. Makino",
      "E. Manao",
      "S. Mancina",
      "A. Mand",
      "I. C. Mariş",
      "S. Marka",
      "Z. Marka",
      "L. Marten",
      "I. Martinez-Soler",
      "R. Maruyama",
      "J. Mauro",
      "F. Mayhew",
      "F. McNally",
      "J. V. Mead",
      "K. Meagher",
      "S. Mechbal",
      "A. Medina",
      "M. Meier",
      "Y. Merckx",
      "L. Merten",
      "T. Meures",
      "J. Mitchell",
      "L. Molchany",
      "T. Montaruli",
      "R. W. Moore",
      "Y. Morii",
      "A. Mosbrugger",
      "M. Moulai",
      "D. Mousadi",
      "E. Moyaux",
      "T. Mukherjee",
      "R. Naab",
      "M. Nakos",
      "U. Naumann",
      "J. Necker",
      "L. Neste",
      "M. Neumann",
      "H. Niederhausen",
      "M. U. Nisa",
      "K. Noda",
      "A. Noell",
      "A. Novikov",
      "A. Obertacke Pollmann",
      "V. O'Dell",
      "A. Olivas",
      "R. Orsoe",
      "J. Osborn",
      "E. O'Sullivan",
      "V. Palusova",
      "H. Pandya",
      "A. Pare<nti",
      "N. Park",
      "V. Parrish",
      "E. N. Paudel",
      "L. Paul",
      "C. Pérez de los Heros",
      "T. Pernice",
      "J. Peterson",
      "M. Plum",
      "A. Pontén",
      "V. Poojyam",
      "Y. Popovych",
      "M. Prado Rodriguez",
      "B. Pries",
      "R. Procter-Murphy",
      "G. T. Przybylski",
      "L. Pyras",
      "C. Raab",
      "J. Rack-Helleis",
      "N. Rad",
      "M. Ravn",
      "K. Rawlins",
      "Z. Rechav",
      "A. Rehman",
      "I. Reistroffer",
      "E. Resconi",
      "S. Reusch",
      "C. D. Rho",
      "W. Rhode",
      "L. Ricca",
      "B. Riedel",
      "A. Rifaie",
      "E. J. Roberts",
      "S. Robertson",
      "M. Rongen",
      "A. Rosted",
      "C. Rott",
      "T. Ruhe",
      "L. Ruohan",
      "D. Ryckbosch",
      "J. Saffer",
      "D. Salazar-Gallegos",
      "P. Sampathkumar",
      "A. Sandrock",
      "P. Sandstrom",
      "G. Sanger-Johnson",
      "M. Santander",
      "S. Sarkar",
      "J. Savelberg",
      "M. Scarnera",
      "P. Schaile",
      "M. Schaufel",
      "H. Schieler",
      "S. Schindler",
      "L. Schlickmann",
      "B. Schlüter",
      "F. Schlüter",
      "N. Schmeisser",
      "T. Schmidt",
      "F. G. Schröder",
      "L. Schumacher",
      "K. Schunter",
      "S. Schwirn",
      "S. Sclafani",
      "D. Seckel",
      "L. Seen",
      "M. Seikh",
      "S. Seunarine",
      "P. A. Sevle Myhr",
      "R. Shah",
      "S. Shefali",
      "N. Shimizu",
      "B. Skrzypek",
      "R. Snihur",
      "J. Soedingrekso",
      "A. Søgaard",
      "D. Soldin",
      "P. Soldin",
      "G. Sommani",
      "C. Spannfellner",
      "G. M. Spiczak",
      "C. Spiering",
      "J. Stachurska",
      "M. Stamatikos",
      "T. Stanev",
      "T. Stezelberger",
      "T. Stürwald",
      "T. Stuttard",
      "K. -H. Sulanke",
      "G. W. Sullivan",
      "I. Taboada",
      "S. Ter-Antonyan",
      "A. Terliuk",
      "A. Thakuri",
      "P. Theobald",
      "M. Thiesmeyer",
      "W. G. Thompson",
      "J. Thwaites",
      "S. Tilav",
      "K. Tollefson",
      "S. Toscano",
      "D. Tosi",
      "P. Trevarrow",
      "A. Trettin",
      "A. K. Upadhyay",
      "K. Upshaw",
      "A. Vaidyanathan",
      "N. Valtonen-Mattila",
      "J. Valverde",
      "J. Vandenbroucke",
      "T. Van Eeden",
      "N. van Eijndhoven",
      "L. Van Rootselaar",
      "J. van Santen",
      "J. Vara",
      "F. Varsi",
      "M. Venugopal",
      "M. Vereecken",
      "S. Vergara Carrasco",
      "S. Verpoest",
      "D. Veske",
      "A. Vijai",
      "J. Villarreal",
      "C. Walck",
      "A. Wang",
      "E. H. S. Warrick",
      "C. Weaver",
      "P. Weigel",
      "A. Weindl",
      "J. Weldert",
      "A. Y. Wen",
      "C. Wendt",
      "J. Werthebach",
      "M. Weyrauch",
      "N. Whitehorn",
      "C. H. Wiebusch",
      "D. R. Williams",
      "L. Witthaus",
      "M. Wolf",
      "G. Wrede",
      "X. W. Xu",
      "J. P. Yanez",
      "Y. Yao",
      "E. Yildizci",
      "S. Yoshida",
      "R. Young",
      "F. Yu",
      "S. Yu",
      "T. Yuan",
      "A. Zegarelli",
      "S. Zhang",
      "Z. Zhang",
      "P. Zhelnin",
      "P. Zilberman"
    ],
    "published": "2025-08-05T18:10:47Z",
    "updated": "2025-08-05T18:10:47Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2312.03984v4",
    "url": "https://arxiv.org/abs/2312.03984v4",
    "pdf_url": "https://arxiv.org/pdf/2312.03984v4.pdf",
    "title": "Taking control of compressible modes: bulk viscosity and the turbulent   dynamo",
    "abstract": "Many polyatomic astrophysical plasmas are compressible and out of chemical and thermal equilibrium, introducing a bulk viscosity into the plasma via the internal degrees of freedom of the molecular composition, directly impacting the decay of compressible modes, $\\mathbf{v}_{\\parallel}(\\mathbf{k})$. This is especially important for small-scale, turbulent dynamo processes in the interstellar medium, which are known to be sensitive to the effects of compression. To control the viscous properties of $\\mathbf{v}_{\\parallel}(\\mathbf{k})$, we perform trans-sonic, visco-resistive dynamo simulations with additional bulk viscosity $\\nu_{\\rm bulk}$, deriving a new $\\nu_{\\rm bulk}$ Reynolds number $\\rm{Re}_{\\rm bulk}$, and viscous Prandtl number $\\rm{P}\\nu \\equiv \\rm{Re}_{\\rm bulk} / \\rm{Re}_{\\rm shear}$, where $\\rm{Re}_{\\rm shear}$ is the shear viscosity Reynolds number. We derive a framework for decomposing $E_{\\rm mag}$ growth rates into incompressible and compressible terms via orthogonal tensor decompositions of $\\nabla\\otimes\\mathbf{v}$, where $\\mathbf{v}$ is the fluid velocity. We find that $\\mathbf{v}_{\\parallel}(\\mathbf{k})$ play a dual role, growing and decaying $E_{\\rm mag}$, and that field-line stretching is the main driver of growth, even in compressible dynamos. In the absence of $\\nu_{\\rm bulk}$ ($\\rm{P}\\nu \\to \\infty$), $\\mathbf{v}_{\\parallel}(\\mathbf{k})$ pile up on small-scales, creating a spectral bottleneck, which disappears for $\\rm{P}\\nu \\approx 1$. (abridged). We emphasize the importance of further understanding the role of $\\nu_{\\rm bulk}$ in compressible astrophysical plasmas, which we estimate could be as strong as the shear viscosity in the cold ISM, and highlight that compressible direct numerical simulations without bulk viscosity have unresolved compressible mode dissipation scales.",
    "authors": [
      "James R. Beattie",
      "Christoph Federrath",
      "Neco Kriel",
      "Justin Kin Jun Hew",
      "Amitava Bhattacharjee"
    ],
    "published": "2023-12-07T02:03:51Z",
    "updated": "2025-08-05T17:20:38Z",
    "categories": [
      "astro-ph.GA",
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.GA"
  },
  {
    "arxiv_id": "2508.00720v2",
    "url": "https://arxiv.org/abs/2508.00720v2",
    "pdf_url": "https://arxiv.org/pdf/2508.00720v2.pdf",
    "title": "Continuum damping of topologically-protected edge modes at the boundary   of non-uniformly magnetized cylindrical plasmas",
    "abstract": "We present an extension of recently discovered collisionlessly damped yet topologically protected surface plasma waves (TSPWs), from a simplified slab geometry to a cylindrical plasma-vacuum interface. A distinctive feature of these modes-emerging above the electron cyclotron frequency-is their collisionless damping, which arises from resonant coupling to a continuum of upper-hybrid modes localized within a smooth plasma-vacuum transition layer. We demonstrate both temporal and spatial damping of TSPWs at the boundary of a cylindrical magnetized plasma. Furthermore, we show that in the presence of a non-uniform magnetic field, the TSPW exhibits a smooth and continuous transition, highlighting its topological robustness under magnetic inhomogeneity.",
    "authors": [
      "Roopendra Singh Rajawat",
      "Gennady Shvets"
    ],
    "published": "2025-08-01T15:40:33Z",
    "updated": "2025-08-05T15:59:41Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.03592v1",
    "url": "https://arxiv.org/abs/2508.03592v1",
    "pdf_url": "https://arxiv.org/pdf/2508.03592v1.pdf",
    "title": "Frequency conversion in topological plasmonic THz photo-mixer",
    "abstract": "We propose an alternative explanation for the observed coherent down-conversion in a laser-enabled plasmonic photo-mixer involving infrared, millimeter-wave, microwave photons. We will offer a path toward full experimental characterization of the device.",
    "authors": [
      "Hamid Javadi"
    ],
    "published": "2025-08-05T15:57:51Z",
    "updated": "2025-08-05T15:57:51Z",
    "categories": [
      "physics.optics",
      "cond-mat.mtrl-sci",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2508.03561v1",
    "url": "https://arxiv.org/abs/2508.03561v1",
    "pdf_url": "https://arxiv.org/pdf/2508.03561v1.pdf",
    "title": "A Simple Model of Current Ramp-Up and Ramp-Down in Tokamaks",
    "abstract": "A simple model of the ramp-up and ramp-down of the toroidal current in a tokamak plasma is developed. Faraday's law of electric induction is found to limit how rapidly the current can be safety ramped up or down. It is estimated that the minimum safe ramp-up/down times for the JET, SPARC, and ITER tokamaks are 4.2, 2.0, and 14.7 seconds, respectively. The JET ramp rate is in accordance with operational experience. The SPARC and ITER minimum safe ramp rates are less than the ramp rates in the respective designs. Hence, there is no indication that the design ramp rates are infeasible, as was recently suggested in arXiv:2507.05456 (2025). The typical ratios of the inductive electric field to the Connor-Hastie field in SPARC and ITER are found to be less than those in JET. Thus, the fact that the JET tokamak was able to operate successfully without encountering runaway electron problems during current ramps suggests that the future SPARC and ITER tokamaks should also be able to avoid such problems.",
    "authors": [
      "R. Fitzpatrick"
    ],
    "published": "2025-08-05T15:28:56Z",
    "updated": "2025-08-05T15:28:56Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.08156v2",
    "url": "https://arxiv.org/abs/2507.08156v2",
    "pdf_url": "https://arxiv.org/pdf/2507.08156v2.pdf",
    "title": "Volume-Preserving Deformation of Honeycomb Wire Media Enables Broad   Plasma Frequency Tunability",
    "abstract": "We demonstrate tunability of the plasma frequency in a wire medium by mechanically deforming a lattice of parallel metallic wires arranged at the nodes of a honeycomb structure. Numerical simulations predict up to 78% tunability and a proof-of-concept experiment confirms 64%.",
    "authors": [
      "Denis Sakhno",
      "Jim A. Enriquez",
      "Pavel A. Belov"
    ],
    "published": "2025-07-10T20:31:38Z",
    "updated": "2025-08-05T15:14:42Z",
    "categories": [
      "physics.plasm-ph",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.03537v1",
    "url": "https://arxiv.org/abs/2508.03537v1",
    "pdf_url": "https://arxiv.org/pdf/2508.03537v1.pdf",
    "title": "The High Level Trigger and Express Data Production at STAR",
    "abstract": "The STAR experiment at the Relativistic Heavy Ion Collider (RHIC) has developed and deployed a high-performance High Level Trigger (HLT) and Express Data Production system to enable real-time event processing during the Beam Energy Scan phase-II (BES-II) program. Designed to meet the demands of high event rates and complex final states, the HLT performs online tracking, event reconstruction, and physics object selection using parallelized algorithms including the Cellular Automaton Track Finder and the KF Particle Finder, optimized for identifying both long- and short-lived particles.   Tightly integrated with the STAR data acquisition (DAQ) and detector control systems, the HLT employs a dedicated computing cluster to perform near real-time calibration, vertexing, and event filtering. The Express Data Production pipeline runs concurrently, enabling fast reconstruction and immediate physics analysis. This architecture allows for real-time monitoring of data quality, detector performance, and beam conditions, supporting dynamic feedback during operations.   This framework has been instrumental in enabling prompt identification of rare signals such as hyperons and hypernuclei. Notably, it enabled the first real-time reconstruction of ${}^5_{\\Lambda}\\mathrm{He}$ hypernuclei with high statistical significance, as well as efficient processing of hundreds of millions of heavy-ion collision events during BES-II.   The successful operation of this real-time system demonstrates its effectiveness in handling high data volumes while maintaining stringent physics quality standards. It establishes a scalable and modular model for future high-luminosity experiments requiring integrated online tracking, event selection, and rapid offline-quality reconstruction within hours of data taking.",
    "authors": [
      "Wayne Betts",
      "Jinhui Chen",
      "Yuri Fisyak",
      "Hongwei Ke",
      "Ivan Kisel",
      "Pavel Kisel",
      "Grigory Kozlov",
      "Jeffery Landgraf",
      "Jerome Lauret",
      "Tonko Ljubicic",
      "Yugang Ma",
      "Spyridon Margetis",
      "Hao Qiu",
      "Diyu Shen",
      "Qiye Shou",
      "Xiangming Sun",
      "Aihong Tang",
      "Gene Van Buren",
      "Iouri Vassiliev",
      "Baoshan Xi",
      "Zhenyu Ye",
      "Zhengqiao Zhang",
      "Maksym Zyzak"
    ],
    "published": "2025-08-05T15:05:34Z",
    "updated": "2025-08-05T15:05:34Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2404.07835v4",
    "url": "https://arxiv.org/abs/2404.07835v4",
    "pdf_url": "https://arxiv.org/pdf/2404.07835v4.pdf",
    "title": "Towards a realistic noise modelling of quantum sensors for future   satellite gravity missions",
    "abstract": "Mapping the Earth's gravity field from space offers valuable insights into climate change, hydro- and biosphere evolution, and seismic activity. Current satellite gravimetry missions have demonstrated the utility of gravity data in understanding global mass transport phenomena, climate dynamics, and geological processes. However, state-of-the-art measurement techniques face noise and long-term drift limitations, which propagate into the recovery of Earth's time-varying gravity field. Quantum sensors, particularly Cold Atom Interferometry (CAI), offer promise for improving the accuracy and stability of space-based gravity measurements. Therefore, CAI has emerged as a promising measurement technique for future gravimetric satellite missions due to their potential for measuring gravitational forces and gradients with high precision and accuracy, particularly at low frequencies (sub-mHz). This study explores the sensitivity of CAI accelerometers and gradiometers to the errors in measuring the satellite's attitude. We explore the low-low satellite-to-satellite and gravity gradiometry concepts and build the respective analytical models of measurements and associated errors. We selected an ambitious scenario for CAI parameters that illustrates a potential path for increasing instrument accuracies and capabilities for space gravimetry. Two operational modes, concurrent (where a new cloud is generated while another is moved to the interferometric chamber) and sequential (where cloud generation and interferometry happen in the same place), are compared to mitigate the effects of inaccurately known attitude rates on Coriolis accelerations. The sequential mode shows the potential to reduce these effects since the atom cloud has an initial zero velocity. [...]",
    "authors": [
      "Joao Encarnacao",
      "Christian Siemes",
      "Ilias Daras",
      "Olivier Carraz",
      "Aaron Strangfeld",
      "Philipp Zingerle",
      "Roland Pail"
    ],
    "published": "2024-04-11T15:19:46Z",
    "updated": "2025-08-05T14:56:58Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.03491v1",
    "url": "https://arxiv.org/abs/2508.03491v1",
    "pdf_url": "https://arxiv.org/pdf/2508.03491v1.pdf",
    "title": "AION-10: Technical Design Report for a 10m Atom Interferometer in Oxford",
    "abstract": "This Technical Design Report presents AION-10, a 10-meter atom interferometer to be located at Oxford University using ultracold strontium atoms to make precision measurements of fundamental physics. AION-10 serves as both a prototype for future larger-scale experiments and a versatile scientific instrument capable of conducting its own diverse physics programme.   The design features a 10-meter vertical tower housing two atom interferometer sources in an ultra-high vacuum environment. Key engineering challenges include achieving nanometer-level vibrational stability and precise magnetic field control. Solutions include active vibration isolation, specialized magnetic shielding, and a modular assembly approach using professional lifting equipment.   Detailed analysis confirms the design meets all performance requirements, with critical optical components remaining within our specifications 97% of the time under realistic operating conditions. Vacuum and vibration measurements in the host building validate that the instrument will achieve the precision needed for quantum sensing applications.   This work establishes the technical foundation for scaling atom interferometry to longer baselines while creating a cutting-edge facility for precision measurements that could advance our understanding of fundamental physics.",
    "authors": [
      "K. Bongs",
      "A. Brzakalik",
      "U. Chauhan",
      "S. Dey",
      "O. Ennis",
      "S. Hedges",
      "T. Hird",
      "M. Holynski",
      "S. Lellouch",
      "M. Langlois",
      "B. Stray",
      "B. Bostwick",
      "J. Chen",
      "Z. Eyler",
      "V. Gibson",
      "T. L. Harte",
      "C. C. Hsu",
      "M. Karzazi",
      "C. Lu",
      "B. Millward",
      "J. Mitchell",
      "N. Mouelle",
      "B. Panchumarthi",
      "J. Scheper",
      "U. Schneider",
      "X. Su",
      "Y. Tang",
      "K. Tkalčec",
      "M. Zeuner",
      "S. Zhang",
      "Y. Zhi",
      "K. Clarke",
      "A. Vick",
      "C. F. A. Baynham",
      "O. Buchmüller",
      "D. Evans",
      "L. Hawkins",
      "R. Hobson",
      "L. Iannizzotto-Venezze",
      "A. Josset",
      "D. Lee",
      "E. Pasatembou",
      "B. E. Sauer",
      "M. R. Tarbutt",
      "T. Walker",
      "L. Badurina",
      "A. Beniwal",
      "D. Blas",
      "J. Carlton",
      "J. Ellis",
      "C. McCabe",
      "G. Parish",
      "D. Pathak Govardhan",
      "V. Vaskonen",
      "T. Bowcock",
      "K. Bridges",
      "A. Carroll",
      "J. Coleman",
      "G. Elertas",
      "S. Hindley",
      "C. Metelko",
      "H. Throssell",
      "J. N. Tinsley",
      "E. Bentine",
      "M. Booth",
      "D. Bortoletto",
      "C. Foot",
      "N. Callaghan",
      "C. Gomez-Monedero",
      "K. Hughes",
      "A. James",
      "T. Leese",
      "A. Lowe",
      "J. March-Russell",
      "J. Sander",
      "J. Schelfhout",
      "I. Shipsey",
      "D. Weatherill",
      "D. Wood",
      "S. N. Balashov",
      "M. G. Bason",
      "K. Hussain",
      "H. Labiad",
      "P. Majewski",
      "A. L. Marchant",
      "D. Newbold",
      "Z. Pan",
      "Z. Tam",
      "T. C. Thornton",
      "T. Valenzuela",
      "M. G. D. van der Grinten",
      "I. Wilmut"
    ],
    "published": "2025-08-05T14:20:34Z",
    "updated": "2025-08-05T14:20:34Z",
    "categories": [
      "physics.atom-ph",
      "astro-ph.IM",
      "hep-ex",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2508.03478v1",
    "url": "https://arxiv.org/abs/2508.03478v1",
    "pdf_url": "https://arxiv.org/pdf/2508.03478v1.pdf",
    "title": "Stationary Power-Law Solutions of Kinetic-Alfvénic Turbulence",
    "abstract": "The wave-kinetic description of weak kinetic-Alfv\\'{e}nic turbulence based on the gyrokinetic theoretical framework is proposed. The wave kinetic equation describing kinetic Alfv\\'{e}n wave spectral cascading via resonant three-wave interactions is derived, and the stationary spectra are analytically obtained using the Zakharov transformation in both the long-wavelength limit and the short-wavelength limit, for both counter-propagating and co-propagating cases. The cascade directions of stationary solutions are identified and their existence is further verified by numerical solution of the wave kinetic equation. A brief discussion on the relevance of such predictions to the solar wind turbulence and helical kinetic-Alfv\\'{e}nic turbulence is presented.",
    "authors": [
      "Kexun Shen",
      "Zhiwen Cheng",
      "Zhiyong Qiu"
    ],
    "published": "2025-08-05T14:11:18Z",
    "updated": "2025-08-05T14:11:18Z",
    "categories": [
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.03468v1",
    "url": "https://arxiv.org/abs/2508.03468v1",
    "pdf_url": "https://arxiv.org/pdf/2508.03468v1.pdf",
    "title": "Mechanical Characterisation of Silicon for the ETpathfinder Test Masses",
    "abstract": "The next generation of gravitational-wave detectors, such as the Einstein Telescope, is designed to reduce noise in a wide band of frequencies compared to the current generation, through the use of new technologies. ETpathfinder, designed as an R&D facility for these technologies, is a prototype for which the mirrors were chosen to be made of crystalline silicon, produced by the Leibniz-Institut f\\\"ur Kristallz\\\"uchtung. This material choice was made to pave the way for a low thermal noise level at cryogenic temperatures in the Einstein Telescope. This paper shows the mechanical loss of silicon designated to become the test masses for ETpathfinder in the range between room temperature and 53K. In addition, the effect of the anisotropic nature of silicon on the measurement procedure is addressed. Predictions are made of the contribution of the mirror substrate material to the overall ETpathfinder noise budget.",
    "authors": [
      "Guido Alex Iandolo",
      "Alex Amato",
      "Gianpietro Cagnoli",
      "Alessandro Delmonte",
      "Jan-Simon Hennig",
      "Margot Hennig",
      "Sebastian Steinlechner",
      "Janis Wöhler",
      "Stefan Hild",
      "Jessica Steinlechner"
    ],
    "published": "2025-08-05T14:04:57Z",
    "updated": "2025-08-05T14:04:57Z",
    "categories": [
      "physics.ins-det",
      "gr-qc"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1103/xzbl-3snb"
  },
  {
    "arxiv_id": "2508.03443v1",
    "url": "https://arxiv.org/abs/2508.03443v1",
    "pdf_url": "https://arxiv.org/pdf/2508.03443v1.pdf",
    "title": "Energy Cascade and Damping in Fast-Mode Compressible Turbulence",
    "abstract": "This letter presents hybrid and fully kinetic particle-in-cell simulations of fast-mode compressible turbulence. Turbulence damping at magnetohydrodynamic (MHD) scales closely follows linear transit-time damping theory. Despite strong phase steepening, turbulence sustains robust cross-scale energy cascading. These findings resolve the long-standing question about the validity of classical wave theories in strongly nonlinear regimes and overturn the common presumption that wave steepening disrupts compressible turbulence cascade, thereby providing a more complete picture of MHD turbulence.",
    "authors": [
      "Chuanpeng Hou",
      "Huirong Yan",
      "Siqi Zhao",
      "Parth Pavaskar"
    ],
    "published": "2025-08-05T13:41:18Z",
    "updated": "2025-08-05T13:41:18Z",
    "categories": [
      "astro-ph.SR",
      "astro-ph.HE",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2508.03330v1",
    "url": "https://arxiv.org/abs/2508.03330v1",
    "pdf_url": "https://arxiv.org/pdf/2508.03330v1.pdf",
    "title": "Status and prospects of Muon g-2 experiment",
    "abstract": "This article reviews the muon g-2 experiment, a cornerstone in precision tests of the Standard Model of particle physics. The experiment measures the anomalous magnetic moment of the muon with unprecedented accuracy, seeking potential discrepancies between theoretical predictions and experimental results that might indicate physics beyond the Standard Model. We trace the evolution of this measurement from its beginnings at CERN in the 1960s to the current state-of-the-art experiment at Fermilab, highlighting the remarkable engineering achievements required to achieve parts-per-billion precision. Recent results from Runs 1-3 have achieved a systematic uncertainty of 70 ppb, exceeding design goals, while ongoing theoretical calculations continue to refine predictions. Despite these advances, the analysis remains statistics-limited, with continued data collection and novel experimental approaches at MUonE and J-PARC promising further insights into this fundamental physical quantity.",
    "authors": [
      "Marin Karuza"
    ],
    "published": "2025-08-05T11:15:58Z",
    "updated": "2025-08-05T11:15:58Z",
    "categories": [
      "hep-ex",
      "physics.acc-ph"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2508.03312v1",
    "url": "https://arxiv.org/abs/2508.03312v1",
    "pdf_url": "https://arxiv.org/pdf/2508.03312v1.pdf",
    "title": "A Simulation of the Fermilab Main Injector Dual Power Amplifier Cavities",
    "abstract": "The Fermilab Main Injector accelerating cavities have sparking issues when they are run at voltages higher than those required by the PIP-II project. This is a problem Fermilab is working on as planning begins for the next upgrade to the accelerator complex. One of the methods being used to address the issue is the development of a CST Microwave Studio simulation to accurately model the PIP-II dual power amplifier cavities and identify which part(s) of the cavity is causing sparking to develop. The model will also be used to determine if changes to the cavity geometry may allow the cavity to be used at higher voltages before sparking occurs.",
    "authors": [
      "Susanna Stevenson"
    ],
    "published": "2025-08-05T10:46:45Z",
    "updated": "2025-08-05T10:46:45Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.03309v1",
    "url": "https://arxiv.org/abs/2508.03309v1",
    "pdf_url": "https://arxiv.org/pdf/2508.03309v1.pdf",
    "title": "Characterization of a laser filament-induced plasma in air at 10 kHz   using optical emission spectroscopy",
    "abstract": "The increasing availability of high-power Yb-based ultrafast laser-amplifier systems has opened the possibility of air filamentation at high repetition rates >1 kHz. In this new regime, accumulation effects cannot be ruled out, therefore, characterizing the plasma parameters and afterglow plasma-chemical kinetics becomes increasingly relevant. In this work, we use optical emission spectroscopy to measure nanosecond dynamics of gas temperature and electron temperature, species-specific decay times, and electron density of an atmospheric air laser filament produced by high average power femtosecond laser at a high repetition rate of 10 kHz. The molecular excitation mechanisms behind the nitrogen photoemissions are derived from vibrational distributions and temporal behavior of the studied emission bands. The presented diagnostic technique offers a complementary but more holistic measurement approach to optical probe schemes to characterize the laser-filament-induced plasma wake for high repetition rate filaments.",
    "authors": [
      "Malte C. Schroeder",
      "Robin Löscher",
      "Nikita Bibinov",
      "Ihor Korolov",
      "Peter Awakowicz",
      "Thomas Mussenbrock",
      "Clara J. Saraceno"
    ],
    "published": "2025-08-05T10:39:43Z",
    "updated": "2025-08-05T10:39:43Z",
    "categories": [
      "physics.plasm-ph",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.03152v1",
    "url": "https://arxiv.org/abs/2508.03152v1",
    "pdf_url": "https://arxiv.org/pdf/2508.03152v1.pdf",
    "title": "Control of cross-beam energy transfer through laser-plasma parameter   adjustment",
    "abstract": "Cross-beam energy transfer (CBET) between two lasers is investigated through both analytical theory and two-dimensional simulations, with particular attention to its linear and nonlinear evolution under various laser-plasma conditions over timescales from several hundred picoseconds to one nanosecond. Based on the dispersion relation of stimulated Brillouin scattering driven by two laser beams, we obtain a laser frequency difference range within which CBET occurs. In the nonlinear regime, high harmonic of ion acoustic wave (IAW) leads to the reduction of saturation level at high laser intensities ($I\\gtrsim 10^{15}\\,\\mathrm{W/cm^2}$). The wave breaking of harmonic IAW causes the second growth and final saturation of CBET. At low intensities, the linear saturation level slowly varies over time. Compared to Gaussian beams, smoothed lasers with speckles can mitigate CBET saturation level by reducing the effective overlap region. The maximum energy transfer is found at a frequency difference slightly smaller than the linear matching condition due to the reduction of IAW frequency induced by ion trapping. We find that the nonlinear behavior is sensitive to laser intensity, frequency difference, electron density, and ion temperature. The total energy transfer rate increases approximately linearly with laser intensity, underscoring its critical role in CBET control.",
    "authors": [
      "Yilin Xu",
      "Yao Zhao",
      "Hongwei Yin",
      "Zhuwen Lin",
      "Yan Yin",
      "Liang Hao",
      "Yaozhi Yi",
      "Hongyu Zhou",
      "Jinlong Jiao",
      "Anle Lei"
    ],
    "published": "2025-08-05T06:57:24Z",
    "updated": "2025-08-05T06:57:24Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.03770v1",
    "url": "https://arxiv.org/abs/2508.03770v1",
    "pdf_url": "https://arxiv.org/pdf/2508.03770v1.pdf",
    "title": "Description of CRESST-III lithium aluminate data",
    "abstract": "Two detector modules with lithium aluminate targets were operated in the CRESST underground setup between February and June 2021. The data collected in this period was used to set the currently strongest cross-section upper limits on the spin-dependent interaction of dark matter (DM) with protons and neutrons for the mass region between 0.25 and 1.5 GeV/c$^2$. The data are available online. In this document, we describe how the data set should be used to reproduce our dark matter results.",
    "authors": [
      "G. Angloher",
      "S. Banik",
      "G. Benato",
      "A. Bento",
      "A. Bertolini",
      "R. Breier",
      "C. Bucci",
      "J. Burkhart",
      "L. Canonica",
      "A. D'Addabbo",
      "S. Di Lorenzo",
      "L. Einfalt",
      "A. Erb",
      "F. v. Feilitzsch",
      "N. Ferreiro Iachellini",
      "S. Fichtinger",
      "D. Fuchs",
      "A. Fuss",
      "A. Garai",
      "V. M. Ghete",
      "P. Gorla",
      "P. V. Guillaumon",
      "S. Gupta",
      "D. Hauff",
      "M. Ješkovský",
      "J. Jochum",
      "M. Kaznacheeva",
      "A. Kinast",
      "H. Kluck",
      "S. Kuckuk",
      "H. Kraus",
      "A. Langenkämper",
      "M. Mancuso",
      "L. Marini",
      "L. Meyer",
      "V. Mokina",
      "A. Nilima",
      "M. Olmi",
      "T. Ortmann",
      "C. Pagliarone",
      "L. Pattavina",
      "F. Petricca",
      "W. Potzel",
      "P. Povinec",
      "F. Pröbst",
      "F. Pucci",
      "F. Reindl",
      "J. Rothe",
      "K. Schäffner",
      "J. Schieck",
      "D. Schmiedmayer",
      "S. Schönert",
      "C. Schwertner",
      "M. Stahlberg",
      "L. Stodolsky",
      "C. Strandhagen",
      "R. Strauss",
      "I. Usherov",
      "F. Wagner",
      "M. Willers",
      "V. Zema"
    ],
    "published": "2025-08-05T04:52:36Z",
    "updated": "2025-08-05T04:52:36Z",
    "categories": [
      "hep-ex",
      "astro-ph.CO",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2508.03078v1",
    "url": "https://arxiv.org/abs/2508.03078v1",
    "pdf_url": "https://arxiv.org/pdf/2508.03078v1.pdf",
    "title": "Description of CRESST-II and CRESST-III pulse shape data",
    "abstract": "A set of data from 68 cryogenic detectors operated in the CRESST dark matter search experiment between 2013 and 2019 was collected and labeled to train binary classifiers for data cleaning. Here, we describe the data set and how the trained models can be applied to new data. The data and models are available online.",
    "authors": [
      "G. Angloher",
      "S. Banik",
      "D. Bartolot",
      "G. Benato",
      "A. Bento",
      "A. Bertolini",
      "R. Breier",
      "C. Bucci",
      "J. Burkhart",
      "L. Canonica",
      "A. D'Addabbo",
      "S. Di Lorenzo",
      "L. Einfalt",
      "A. Erb",
      "F. v. Feilitzsch",
      "N. Ferreiro Iachellini",
      "S. Fichtinger",
      "D. Fuchs",
      "A. Fuss",
      "A. Garai",
      "V. M. Ghete",
      "P. Gorla",
      "P. V. Guillaumon",
      "S. Gupta",
      "D. Hauff",
      "M. Ješkovský",
      "J. Jochum",
      "M. Kaznacheeva",
      "A. Kinast",
      "H. Kluck",
      "S. Kuckuk",
      "H. Kraus",
      "M. Lackner",
      "A. Langenkämper",
      "M. Mancuso",
      "L. Marini",
      "L. Meyer",
      "V. Mokina",
      "P. Murali",
      "A. Nilima",
      "M. Olmi",
      "T. Ortmann",
      "C. Pagliarone",
      "L. Pattavina",
      "F. Petricca",
      "W. Potzel",
      "P. Povinec",
      "F. Pröbst",
      "F. Pucci",
      "F. Reindl",
      "D. Rizvanovic",
      "J. Rothe",
      "K. Schäffner",
      "J. Schieck",
      "D. Schmiedmayer",
      "S. Schönert",
      "C. Schwertner",
      "M. Stahlberg",
      "L. Stodolsky",
      "C. Strandhagen",
      "R. Strauss",
      "I. Usherov",
      "F. Wagner",
      "M. Willers",
      "V. Zema"
    ],
    "published": "2025-08-05T04:50:30Z",
    "updated": "2025-08-05T04:50:30Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.CO"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2503.22554v2",
    "url": "https://arxiv.org/abs/2503.22554v2",
    "pdf_url": "https://arxiv.org/pdf/2503.22554v2.pdf",
    "title": "Fast Magnetic Coil Controller for Cold Atom Experiments",
    "abstract": "Cold atoms experiments employ magnetic fields, commonly generated by coils, as an essential tool to control and manipulate atomic samples. In these experiments, it is often necessary to rapidly switch the magnetic field between two values. However, typical power supplies have a limited switching time for the current flowing through the coil. We present a control scheme implemented as an electronic circuit that overcomes this limitation. A faster control is achieved by momentarily applying an on-demand high voltage when the control signal variation surpasses the limits that the conventional power supply can follow, allowing a faster current flow into the magnetic coil. In our specific application, a coil with inductance of 491 ${\\mu}H$ and resistance of 0.26 ${\\Omega}$, corresponding to a time constant of ~1.9 ms, is driven so that its current faithfully follows the control signals from -1A to +1A. Capable of completing a full-scale transition in just ~31 ${\\mu}s$, with an effective bandwidth of 15.2 kHz. This corresponds to an improvement by a factor of more than 20 in both bandwidth and switching speed over a conventional power supply. By appropriately selecting the components of the circuit, both the bandwidth and the switching time can be tuned to match specific needs within a wide range of inductive and power requirements.",
    "authors": [
      "L. Uhthoff-Rodríguez",
      "A. Hernández-López",
      "E. G. Alonso-Torres",
      "E. Esquivel-Ramírez",
      "G. Carmona-Torres",
      "C. Gardea-Flores",
      "J. A. Seman",
      "A. Paris-Mandoki"
    ],
    "published": "2025-03-28T15:54:44Z",
    "updated": "2025-08-05T02:39:25Z",
    "categories": [
      "physics.ins-det",
      "physics.atom-ph"
    ],
    "primary_category": "physics.ins-det"
  }
]