{
  "arxiv_id": "2407.12071v2",
  "url": "https://arxiv.org/abs/2407.12071v2",
  "pdf_url": "https://arxiv.org/pdf/2407.12071v2.pdf",
  "title": "Observation of quantum effects on radiation reaction in strong fields",
  "abstract": "Radiation reaction, the force experienced by an accelerated charge due to radiation emission, has long been the subject of extensive theoretical and experimental research. Experimental verification of a quantum, strong-field description of radiation reaction is fundamentally important, and has wide-ranging implications for astrophysics, laser-driven particle acceleration, next-generation particle colliders and inverse-Compton photon sources for medical and industrial applications. However, the difficulty of accessing regimes where strong field and quantum effects dominate inhibited previous efforts to observe quantum radiation reaction in charged particle dynamics with high significance. We report the first high significance (> 5σ) observation of strong-field radiation reaction on electron spectra where quantum effects are substantial. We obtain the first, quantitative, strong evidence favouring the quantum-continuous and quantum-stochastic models over the classical model; the quantum models perform comparably. The lower electron energy losses predicted by the quantum models accounts for their improved performance. Model comparison was performed using a novel Bayesian framework which has widespread utility for laser-particle collision experiments, including those utilising conventional accelerators, where some collision parameters cannot be measured directly.",
  "authors": [
    "Eva E. Los",
    "Elias Gerstmayr",
    "Christopher Arran",
    "Matthew J. V. Streeter",
    "Cary Colgan",
    "Claudia C. Cobo",
    "Brendan Kettle",
    "Thomas G. Blackburn",
    "Nicolas Bourgeois",
    "Luke Calvin",
    "Jason Carderelli",
    "Niall Cavanagh",
    "Stephen J. D. Dann",
    "Antonino Di Piazza",
    "Rebecca Fitzgarrald",
    "Anton Ilderton",
    "Christoph H. Keitel",
    "Mattias Marklund",
    "Paul McKenna",
    "Christopher D. Murphy",
    "Zulfikar Najmudin",
    "Peter Parsons",
    "Rajeev Pattathil",
    "Daniel R. Symes",
    "Matteo Tamburini",
    "Alexander G. R. Thomas",
    "Jonathan C. Wood",
    "Matthew Zepf",
    "Gianluca Sarri",
    "Christopher P. Ridgers",
    "Stuart P. D Mangles"
  ],
  "published": "2024-07-16T12:53:04Z",
  "updated": "2025-11-18T14:14:38Z",
  "categories": [
    "hep-ph",
    "physics.plasm-ph"
  ],
  "primary_category": "hep-ph"
}