{
  "arxiv_id": "2511.15912v1",
  "url": "https://arxiv.org/abs/2511.15912v1",
  "pdf_url": "https://arxiv.org/pdf/2511.15912v1.pdf",
  "title": "Characterization of Low-energy Ionization Signals in Silicon Detectors for the Nab Experiment",
  "abstract": "The Nab (Neutron a b) experiment is designed to measure the beta-antineutrino angular correlation in free neutron $β$ decay with an ultimate precision goal of 0.1%, providing input for tests of Cabibbo-Kobayashi-Maskawa (CKM) matrix unitarity. This measurement is performed via detection of electrons and protons in delayed coincidence using custom large-area segmented silicon drift detectors. We present the characterization of one such detector system to establish the proton energy and timing response, using a dedicated proton accelerator. The detected proton peak was studied for 25 keV, 30 keV, and 35 keV incident protons on a set of detector segments and multiple cooling cycles over a one year period. Ionization losses were consistent with models of the detector dead layer with thicknesses less than 100nm. The detected proton peak was stable within the uncertainty from energy calibration (0.2 keV). The rise times of detector pulses from $^{109}$Cd and $^{113}$Sn conversion electron sources were used to extract the impurity density profile and establish a precise model for the detector timing response. The observed impurity density profile varied from $(2 \\pm 2) \\times 10^9$ cm$^{-3}$ at the center to $(26 \\pm 2) \\times 10^9$ cm$^{-3}$ at the edge. This impurity density profile was then used to characterize systematic effects in proton time-of-flight measurements due to detector pulse-shape effects; the resultant proton timing systematic uncertainties were below 0.3 ns, which is sufficient for the Nab experiment.",
  "authors": [
    "R. J. Taylor",
    "August Mendelsohn",
    "Arlee Shelby",
    "W. C. McCray",
    "Jin Ha Choi",
    "Nicholas Macsai",
    "Grant Riley",
    "Erick Smith",
    "Stefan Baeßler",
    "Leah J. Broussard",
    "Christopher B. Crawford",
    "Michael Gericke",
    "Francisco M. Gonzalez",
    "David Harrison",
    "Leendert Hayen",
    "Mark Makela",
    "R. R. Mammei",
    "D. G. Mathews",
    "D. D. Počanić",
    "Glenn Randall",
    "Americo Salas-Bacci",
    "W. S. Wilburn",
    "A. R. Young"
  ],
  "published": "2025-11-19T22:34:10Z",
  "updated": "2025-11-19T22:34:10Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}