{
  "arxiv_id": "2502.04808v2",
  "url": "https://arxiv.org/abs/2502.04808v2",
  "pdf_url": "https://arxiv.org/pdf/2502.04808v2.pdf",
  "title": "Tracking electron capture processes in classical molecular dynamics   simulations for spectral line broadening in plasmas",
  "abstract": "Plasma spectroscopy is a fundamental tool for diagnosing laboratory and astrophysical plasmas. Accurate interpretation of spectra depends upon precise modeling and comprehension of Stark broadening and other mechanisms affecting spectral lines. In this context, computer simulations have emerged as valuable tools, offering idealized experiments with well-defined conditions. Molecular dynamics simulations, in particular, excel at replicating the particle interactions within the plasma and their impact on the state of a radiating atom or ion. However, these simulations present challenges in tracking electron capture processes, since setting an unambiguous criterion to distinguish between bound and free electrons is not trivial. In this paper we introduce a new algorithm that, within a classical framework, precisely identifies the scenario in which an electron is captured by an ion and then follows a stable orbit around it. The algorithm's applicability extends to emitters with charges Z >= 1. The procedure enables the correct identification of valid time-histories of the electric microfield perturbing the emitting ion, which will be used for subsequent line shape calculations. The ionization balance results obtained from the application of this algorithm are compared with an additional method based on the potential energy of the particles in the simulations, finding good agreement, therefore validating the use of this approach.",
  "authors": [
    "D. González-Herrero",
    "G. Pérez-Callejo",
    "R. Florido",
    "M. A. Gigosos"
  ],
  "published": "2025-02-07T10:23:32Z",
  "updated": "2025-10-23T17:52:01Z",
  "categories": [
    "physics.plasm-ph",
    "astro-ph.IM",
    "physics.atom-ph",
    "physics.comp-ph",
    "physics.optics"
  ],
  "primary_category": "physics.plasm-ph"
}