{
  "arxiv_id": "2507.18369v2",
  "url": "https://arxiv.org/abs/2507.18369v2",
  "pdf_url": "https://arxiv.org/pdf/2507.18369v2.pdf",
  "title": "Reducing suspension control noise with interferometric sensors -- an   experimental concept",
  "abstract": "One of the limiting noise sources of ground-based gravitational wave detectors at frequencies below 30 Hz is control-induced displacement noise. Compact laser interferometric sensors are a prime candidate for improved local displacement sensing. In this paper we present the design of an experiment that aims to demonstrate the advantages of interferometric sensors over shadow sensors. We focus on the compact balanced readout interferometer (COBRI) - a sensor currently in development that is based on deep frequency modulation. We mount COBRIs on two HAM Relay Triple Suspension (HRTS) systems that suspend two mirrors forming an optical cavity. By measuring the length stability of this cavity relative to a stable reference we aim to probe the direct motion reduction when using COBRIs for active damping and we aim to investigate their behavior and auxiliary functions, such as absolute ranging, in the context of the 6 degree-of-freedom controls of the suspensions. Here we describe the design of the experiment and simulations of the achievable noise levels that were obtained using mechanical models of the HRTS suspensions. We discuss all relevant noise sources, the modeled influence of the interferometric sensor damping and the current limitations and necessary improvements of our testing facility in terms of seismic pre-isolation to achieve a shadow sensor limited noise at around 5 Hz, where, according to our simulations, we can demonstrate superior performance for COBRIs in the longitudinal degree of freedom.",
  "authors": [
    "Nils Leander Weickhardt",
    "Artem Basalaev",
    "Oliver Gerberding"
  ],
  "published": "2025-07-24T12:47:51Z",
  "updated": "2025-10-23T15:41:50Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}