{
  "arxiv_id": "2510.19469v1",
  "url": "https://arxiv.org/abs/2510.19469v1",
  "pdf_url": "https://arxiv.org/pdf/2510.19469v1.pdf",
  "title": "Advances in detector response and background modelling in the ANAIS-112   experiment for annual modulation and other rare event searches",
  "abstract": "Numerous astronomical and cosmological observations point to the existence of dark matter, which constitutes about 27% of the Universe. Despite extensive efforts, only the DAMA/LIBRA experiment, using NaI(Tl) detectors at Gran Sasso National Laboratory, has reported a positive dark matter signal. To independently verify this result, using the same NaI target is essential. This is the goal of ANAIS-112, operating with 112.5 kg of NaI(Tl) scintillators since 2017 at the Canfranc Underground Laboratory (LSC). This thesis presents work within ANAIS-112, focusing on data analysis and the development of Geant4-based simulations to reduce systematics and increase sensitivity. Efforts have focused on understanding the ANAIS-112 crystals' response to nuclear recoils. Systematic uncertainties related to the scintillation quenching factors (QFs) of sodium and iodine recoiling in NaI(Tl) must be addressed to ensure reliable comparisons with DAMA/LIBRA and other experiments. For that purpose, onsite neutron calibrations in ANAIS-112 have been performed since 2021 at LSC using 252Cf sources. This work has compared calibration data with Geant4-based neutron simulations, which has revealed Geant4 deficiencies in certain decay processes and cross sections in some versions. The simulations have proven highly sensitive to the QF used, favouring models in which the QF increases with energy and disfavouring DAMA values. In parallel, this thesis has contributed to improving the ANAIS-112 background model through a multiparametric fit of its background components. New physics searches have been conducted using ANAIS-112 data, including a reanalysis of the annual modulation signal and a search for solar axions using six years of exposure. Finally, this thesis also includes work within the COSINUS experiment, focused on background modelling and the impact of internal backgrounds on the experiment's sensitivity.",
  "authors": [
    "Tamara Pardo Yanguas"
  ],
  "published": "2025-10-22T11:04:14Z",
  "updated": "2025-10-22T11:04:14Z",
  "categories": [
    "astro-ph.IM",
    "physics.ins-det"
  ],
  "primary_category": "astro-ph.IM"
}