{
  "arxiv_id": "2510.19228v1",
  "url": "https://arxiv.org/abs/2510.19228v1",
  "pdf_url": "https://arxiv.org/pdf/2510.19228v1.pdf",
  "title": "Laser fabrication of Ti stent and facile MEMS flow sensor integration   for implantable respiration monitoring",
  "abstract": "Animal experiments play a vital role in drug discovery and development by providing essential data on a drug's efficacy, safety, and physiological effects before advancing to human clinical trials. In this study, we propose a stent-based flow sensor designed to measure airflow in the airways of laboratory animals. The stent was fabricated from biocompatible Ti using a combination of fiber laser digital processing and an origami-inspired folding technique. The sensing structure was developed through standard micro-electromechanical systems (MEMS) microfabrication technology. To integrate the sensing structure with the metallic stent, a facile insertion process was employed, where the sensor film was positioned at the stent's center using its natural buckling mechanism. Once fabricated, the stent implant was expanded and installed within an airway-mimicking tube to validate its functionality. A proof-of-concept trial using an artificial ventilator successfully demonstrated real-time respiration monitoring, confirming the feasibility of the proposed system for airflow measurement in preclinical studies. This stent-based sensor offers a promising approach for enhancing respiratory assessments in laboratory animals, potentially improving the accuracy of drug evaluations and respiratory disease research.",
  "authors": [
    "Muhammad Salman Al Farisi",
    "Takuya Kawata",
    "Yoshihiro Hasegawa",
    "Mohammad Nizar Mohamed Zukri",
    "Miyoko Matsushima",
    "Tsutomu Kawabe",
    "Mitsuhiro Shikida"
  ],
  "published": "2025-10-22T04:27:42Z",
  "updated": "2025-10-22T04:27:42Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.1016/j.sna.2025.117083"
}