{
  "arxiv_id": "2510.19115v1",
  "url": "https://arxiv.org/abs/2510.19115v1",
  "pdf_url": "https://arxiv.org/pdf/2510.19115v1.pdf",
  "title": "Quantitative measurement of magnetic dichroic signals at sub-nanometer   to atomic scale resolution conditions",
  "abstract": "When aiming for atomic resolution electron magnetic circular dichroism (EMCD) in STEM mode, the high convergence angle of the electron probe can lead to unforeseen artefacts and strong reductions of the signal to noise ratio (SNR) in the measurement of magnetic magnitudes. In this work, the EMCD signal is measured in STEM mode at semi-convergence angles ranging from \\alpha=\\ 2-10\\ mrad\\ using iron samples with high structural perfection. We observe that the relative EMCD signal remains very similar for all convergence angles, which is in good agreement with simulations. The improvement in the signal-to-noise ratio as compared to earlier works is due to better crystalline quality of the Fe sample, high control of the sample orientation, better control over sample thickness, and factors such as higher beam current and the use of a fast and sensitive hybrid-pixel electron detector. One of the key factors to remove experimental ambivalences is the use of an acquisition geometry where the two conjugate EMCD spectra are acquired simultaneously. Furthermore the high crystalline quality Fe sample enables the acquisition of statistical entities of spectra at the same sample orientation, which in turn results in high SNR EMCD signals. We obtain high SNR EMCD signals for all semi convergence angles and could measure the orbital to spin magnetic moment ratio ml/ms with high precision. We observed that at high convergence angles, the ml/ms ratio gets sensitive to minute changes in sample orientation.",
  "authors": [
    "Sharath Kumar Manjeshwar Sathyanath",
    "Anna L. Ravensburg",
    "Vassilios Kapaklis",
    "Jan Rusz",
    "Björgvin Hjörvarsson",
    "Klaus Leifer"
  ],
  "published": "2025-10-21T22:21:49Z",
  "updated": "2025-10-21T22:21:49Z",
  "categories": [
    "physics.ins-det",
    "cond-mat.mtrl-sci"
  ],
  "primary_category": "physics.ins-det"
}