{
  "arxiv_id": "2510.20775v1",
  "url": "https://arxiv.org/abs/2510.20775v1",
  "pdf_url": "https://arxiv.org/pdf/2510.20775v1.pdf",
  "title": "The Opacity Project: R-Matrix Calculations for Opacities of   High-Energy-Density Astrophysical and Laboratory Plasmas",
  "abstract": "Accurate determination of opacity is critical for understanding radiation transport in both astrophysical and laboratory plasmas. We employ atomic data from R-Matrix calculations to investigate radiative properties in high-energy-density (HED) plasma sources. Specifically, we analyze environments such as the base of the convective zone (BCZ) of the Sun 2 x 10^6$ K, N_e = 10^{23}/cc and the inertial confinement fusion (ICF) device at the Sandia Z facility 2.11 x 10^6 K, N_e = 3.16 x 10^{22}/cc. We calculate Rosseland Mean Opacities (RMO) within a range of temperatures and densities and analyze how they vary under different plasma conditions. In this study, we specifically focus on electron collisional and Stark ion microfield broadening effects on autoionizing resonances in photoabsorption cross sections. Our results are relevant to astrophysical models, particularly in the context of the solar opacity problem, and provide insights into discrepancies between theoretical calculations and experimental measurements. In addition, we investigate the equation-of-state (EOS) and its impact on opacities. In addition, we examine the equation-of-state (EOS) and its impact on opacities of the \"chemical picture\" Mihalas-Hummer-Dappen EOS with respect to level populations of excited levels included in the R-matrix calculations. This study should contribute to improving opacity models of HED sources such as stellar interiors adn laboratory fusion plasma experiments.",
  "authors": [
    "Anil K. Pradhan",
    "Sultana N. Nahar"
  ],
  "published": "2025-10-23T17:47:36Z",
  "updated": "2025-10-23T17:47:36Z",
  "categories": [
    "astro-ph.HE",
    "astro-ph.SR",
    "physics.atom-ph",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.HE",
  "doi": "10.3390/atoms13100085"
}