{
  "arxiv_id": "2504.10192v3",
  "url": "https://arxiv.org/abs/2504.10192v3",
  "pdf_url": "https://arxiv.org/pdf/2504.10192v3.pdf",
  "title": "Picogram-Level Nanoplastic Analysis with Nanoelectromechanical System Fourier Transform Infrared Spectroscopy: NEMS-FTIR",
  "abstract": "We present a photothermal infrared spectroscopy-based approach for the chemical characterization and quantification of nanoplastics. By combining the high sensitivity of nanoelectromechanical systems (NEMS) with the wide spectral range and ubiquity of commercially available Fourier transform infrared (FTIR) spectrometers, NEMS-FTIR offers a time-efficient and cryogen-free option for the rapid, routine analysis of nanoplastics in aqueous samples. Polypropylene, polystyrene, and polyvinyl chloride nanoplastics with nominal diameters ranging from 54 to 262 nm were analyzed by NEMS-FTIR with limits of detection ranging from 101 pg to 353 pg, one order of magnitude lower than values reported for pyrolysis-gas chromatography-mass spectrometry of nanoplastics. The absorptance measured by NEMS-FTIR could be further converted to absolute sample mass using the attenuation coefficient, as demonstrated for polystyrene. Thanks to the wide spectral range of NEMS-FTIR, nanoplastic particles from different polymers could be readily identified, even when present in a mixture. The potential of NEMS-FTIR for the analysis of real samples was demonstrated by identifying the presence of nanoplastics released in water during tea brewing. Polyamide leachates in the form of fragments and smaller oligomers could be identified in the brewing water without sample pre-concentration, even in the presence of an organic matrix. Accelerated aging of the nylon teabags under elevated temperature and UV radiation showed further release of polyamide over time.",
  "authors": [
    "Jelena Timarac-Popović",
    "Johannes Hiesberger",
    "Eldira Šesto",
    "Niklas Luhmann",
    "Ariane Giesriegl",
    "Hajrudin Bešić",
    "Josiane P. Lafleur",
    "Silvan Schmid"
  ],
  "published": "2025-04-14T12:53:59Z",
  "updated": "2026-01-21T19:20:21Z",
  "categories": [
    "physics.ins-det",
    "physics.app-ph",
    "physics.atm-clus",
    "physics.chem-ph",
    "physics.optics"
  ],
  "primary_category": "physics.ins-det"
}