{
  "arxiv_id": "2601.16049v1",
  "url": "https://arxiv.org/abs/2601.16049v1",
  "pdf_url": "https://arxiv.org/pdf/2601.16049v1.pdf",
  "title": "Gain-Layer Project",
  "abstract": "Gain-layer degradation from exposure to radiation limits the use of Low-Gain Avalanche Diodes (LGADs) in high energy particle physics detector experiments. Proper understanding of how the gain-layer is destroyed is not available on a defect level. Only measurements for materials with much lower effective doping concentrations are available. The direct study of the gain-layer is not possible with typical defect spectroscopy measurements like Thermally Stimulated Currents (TSC) and Deep-Level Transient Spectroscopy (DLTS). To combat this problem and gain a better understanding of the processes which degrade LGADs, the Gain-Layer Project was started.   This project produced 19050 diodes with various Boron, Phosphorus, Oxygen and Carbon concentrations. The material used is low-resistivity p-type Silicon. The effective doping concentrations are in the order of a LGAD gain-layer. These diodes will serve the defect community in the coming years for various studies. This article introduces this project with detailed descriptions of the diodes, their flavours and their processing, and reports on results from I-V, C-V, SIMS and DLTS measurements on unirradiated diodes.",
  "authors": [
    "Niels G. Sorgenfrei",
    "Anna Rita Altamura",
    "Cristina Besleaga",
    "Georgia Andra Boni",
    "Tomas Ceponis",
    "Paul Erberk",
    "Eckhart Fretwurst",
    "Yana Gurimskaya",
    "Kevin Lauer",
    "Ludovico Massaccesi",
    "Luca Menzio",
    "Michael Moll",
    "Marie Muehlnikel",
    "Andrei Nitescu",
    "Ulrich Parzefall",
    "Roxana-Elena Patru",
    "Jevgenij Pavlov",
    "Ioana Pintilie",
    "Stephanie Reiss",
    "Joern Schwandt",
    "Valentina Sola"
  ],
  "published": "2026-01-22T15:28:55Z",
  "updated": "2026-01-22T15:28:55Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}