{
  "arxiv_id": "2506.13665v2",
  "url": "https://arxiv.org/abs/2506.13665v2",
  "pdf_url": "https://arxiv.org/pdf/2506.13665v2.pdf",
  "title": "Impact of embedded $^{163}$Ho on the performance of the transition-edge   sensor microcalorimeters of the HOLMES experiment",
  "abstract": "We present a detailed investigation of the performance of transition-edge sensor (TES) microcalorimeters with $^{163}$Ho atoms embedded by ion implantation, as part of the HOLMES experiment aimed at neutrino mass determination. The inclusion of $^{163}$Ho atoms introduces an excess heat capacity due to a pronounced Schottky anomaly, which can affect the detector's energy resolution, signal height, and response time. We fabricated TES arrays with varying levels of $^{163}$Ho activity and characterized their performance in terms of energy resolution, decay time constants, and heat capacity. The intrinsic energy resolution was found to degrade with increasing $^{163}$Ho activity, consistent with the expected scaling of heat capacity. From the analysis, we determined the specific heat capacity of $^{163}$Ho to be $(2.9 \\pm 0.4 \\mathrm{(stat)} \\pm 0.7 \\mathrm{(sys)})$ J/K/mol at $(94 \\pm 1)$\\,mK, close to the literature values for metallic holmium. No additional long decay time constants correlated with $^{163}$Ho activity were observed, indicating that the excess heat capacity does not introduce weakly coupled thermodynamic systems. These results suggest that our present TES microcalorimeters can tolerate $^{163}$Ho activities up to approximately 5 Bq without significant performance degradation. For higher activities, reducing the TES transition temperature is necessary to maintain energy resolution. These findings provide critical insights for optimizing TES microcalorimeters for future neutrino mass experiments and other applications requiring embedded radioactive sources. The study also highlights the robustness of TES technology in handling implanted radionuclides while maintaining high-resolution performance.",
  "authors": [
    "Douglas Bennett",
    "Matteo Borghesi",
    "Pietro Campana",
    "Rodolfo Carobene",
    "Giancarlo Ceruti",
    "Matteo De Gerone",
    "Marco Faverzani",
    "Lorenzo Ferrari Barusso",
    "Elena Ferri",
    "Joseph Fowler",
    "Sara Gamba",
    "Flavio Gatti",
    "Andrea Giachero",
    "Marco Gobbo",
    "Danilo Labranca",
    "Roberto Moretti",
    "Angelo Nucciotti",
    "Luca Origo",
    "Stefano Ragazzi",
    "Dan Schmidt",
    "Daniel Swetz",
    "Joel Ullom"
  ],
  "published": "2025-06-16T16:23:18Z",
  "updated": "2025-10-01T20:54:24Z",
  "categories": [
    "physics.ins-det",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.1140/epjc/s10052-025-14814-6"
}