{
  "arxiv_id": "2512.08549v2",
  "url": "https://arxiv.org/abs/2512.08549v2",
  "pdf_url": "https://arxiv.org/pdf/2512.08549v2.pdf",
  "title": "A journey to ITACA: Ion Tracking with Ammonium Cations Apparatus",
  "abstract": "A unique feature of gas xenon electroluminescent time projection chambers (GXeEL TPCs) in $0νββ$ searches is their ability to reconstruct event topology, in particular to distinguish \"single-electron\" from \"double-electron\" tracks, the latter being the signature of a $0νββ$ decay near the decay endpoint $Q_{ββ}$. Together with excellent energy resolution and the t$_0$ provided by primary scintillation, this topological information is key to suppressing backgrounds. Preserving EL, however, requires operation in pure xenon (with helium as the only benign additive), where electron diffusion is large. Consequently, reconstructed track fidelity is limited by diffusion and intrinsic EL blurring. We propose augmenting the detector with the ability to image not only the electron track but also the corresponding mirror ion track. Introducing trace amounts of NH$_3$ ($\\sim$100 ppb) converts primary xenon ions into ammonium ions, NH$_4^+$, via a fast two-step ion-molecule process involving charge transfer followed by proton transfer, while leaving EL unaffected. Electrons drift rapidly to the anode, producing the standard EL image, whereas NH$_4^+$ ions drift slowly toward the cathode, allowing time to determine the event energy and barycenter. For events in the region of interest, an ion sensor near the cathode at the projected barycenter captures the ions. Laser interrogation of the sensor's molecular layer then reveals an ion-track image with sub-millimeter diffusion and no EL-induced smearing. Combined electron-ion imaging strengthens topological discrimination, improving background rejection by about an order of magnitude and significantly extending the discovery potential of GXeEL TPCs for very long $0νββ$ lifetimes.",
  "authors": [
    "J. J. Gómez-Cadenas",
    "L. Arazi",
    "M. Elorza",
    "Z. Freixa",
    "F. Monrabal",
    "A. Pazos",
    "J. Renner",
    "S. R. Soleti",
    "S. Torelli"
  ],
  "published": "2025-12-09T12:46:14Z",
  "updated": "2026-02-17T15:37:16Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}