{
  "arxiv_id": "2602.17000v1",
  "url": "https://arxiv.org/abs/2602.17000v1",
  "pdf_url": "https://arxiv.org/pdf/2602.17000v1.pdf",
  "title": "Power attenuation in millimeter-wave and terahertz superconducting rectangular waveguides: linear response, TLS loss, and Higgs-mode nonlinearity",
  "abstract": "Superconducting waveguides are a promising platform for ultralow-loss transmission in the millimeter-wave to terahertz band under cryogenic conditions, with potential applications in astronomical instrumentation and emerging quantum technologies. We develop a framework, based on microscopic superconductivity theory, to evaluate the power-flow attenuation constant $α$ of superconducting rectangular waveguides in the $100~\\mathrm{GHz}$--THz range, applicable to arbitrary electronic mean free paths $\\ell$ from the dirty limit $\\ell\\llξ_0$ to the clean limit $\\ell\\ggξ_0$. We also derive an analytical expression for two-level-system (TLS)-induced attenuation $α_{\\rm TLS}$ in thin native oxide layers within the standard TLS model. Using this framework, we perform numerical evaluations of $α$ for representative materials over standard waveguide sizes from WR15 to WR1. In the high-frequency regime $f \\gtrsim 0.5 Δ/h$, low attenuation favors the clean regime $\\ell\\gtrsimξ_0$, indicating that high-purity materials can achieve very low attenuation below their gap frequency. For the TLS contribution, using parameter values representative of native Nb oxides, we find that $α_{\\rm TLS}$ can become relevant at sufficiently low temperatures $T/T_c\\lesssim 0.1$-0.2, where quasiparticle dissipation is exponentially suppressed. Finally, we extend the discussion to the strong-excitation regime using a recently developed nonlinear-response theory within the Keldysh--Usadel framework of nonequilibrium superconductivity and show that nonlinear dissipation produces a Higgs-mode peak in $α$ near $f\\simeq Δ/h$ via a Kerr-type nonlinearity of the dissipative conductivity. This peak provides a distinct hallmark of the Higgs mode that has been largely overlooked so far.",
  "authors": [
    "Takayuki Kubo"
  ],
  "published": "2026-02-19T01:49:24Z",
  "updated": "2026-02-19T01:49:24Z",
  "categories": [
    "cond-mat.supr-con",
    "physics.acc-ph",
    "physics.ins-det",
    "quant-ph"
  ],
  "primary_category": "cond-mat.supr-con"
}