{
  "arxiv_id": "2602.17396v1",
  "url": "https://arxiv.org/abs/2602.17396v1",
  "pdf_url": "https://arxiv.org/pdf/2602.17396v1.pdf",
  "title": "Prospects for Direct Electron Detectors in Ultrafast Electron Scattering Experiments",
  "abstract": "Ultrafast electron diffraction and phonon-diffuse scattering (UED(S)) experiments make use of photo-induced changes to electron scattering intensity across 2D detectors to report on a very wide range of dynamic structural phenomena in molecules and materials. Compared to ultrafast spectroscopies, these techniques have very high structural-information content and competitive time-resolution, but sensitivity to relative changes in electron scattering intensity is orders of magnitude lower. Hybrid pixel counting detectors (HPCDs) are a promising technology for improved sensitivity and signal-to-noise in UED(S) experiments, as they offer near-zero readout noise and dark counts with the possibility of new acquisition modalities (e.g. shot-to-shot normalization) due to their high frame rates. However, it is well known that HPCDs suffer from count losses at high electron fluxes even in CW beam applications. How this translates to ultrashort electron pulse exposures has yet to be determined and is critical to understanding the application of this technology to ultrafast electron scattering experiments. Here we show that count losses are exacerbated significantly in ultrafast (pulsed) experiments and that HPCDs require count rates to be kept below $\\approx 2$ electrons per pixel per pulse. This count-rate limitation presents a severe constraint on electron bunch charge when interrogating single crystal samples. A model for the electron counting uncertainties in HPCDs across the entire relevant range of average count rates is proposed, from which we derive experimental strategies to optimize data quality in UEDS using direct electron detectors. Finally, we suggest ways HPCDs could be better adapted to ultrashort pulsed beam experiments.",
  "authors": [
    "Laurenz Kremeyer",
    "David Cai",
    "Malik Lahlou",
    "Sebastian Hammer",
    "Raphael Schwenzer",
    "Bradley J. Siwick"
  ],
  "published": "2026-02-19T14:21:24Z",
  "updated": "2026-02-19T14:21:24Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}