{
  "arxiv_id": "2509.08063v1",
  "url": "https://arxiv.org/abs/2509.08063v1",
  "pdf_url": "https://arxiv.org/pdf/2509.08063v1.pdf",
  "title": "Modeling Low-Temperature Plasmas Simulating Titan's Atmosphere",
  "abstract": "In the study presented here, we model the gas phase chemistry induced by plasma discharge at low temperature (150 K) in the NASA Ames COSmIC Simulation Chamber (COSmIC) using a 1-dimensional multi-fluid plasma model named CO-PRISM (COSmIC Plasma Reactivity and Ionization Simulation Model). Our model incorporates an extensive chemical reaction network to simulate the neutral-neutral and ion-neutral reactions occurring in the COSmIC experiments when using N2-CH4-based gas mixtures relevant to Titan's atmosphere. Our reaction network now includes crucial reactions involving the first electronically-excited state of atomic nitrogen, recent electron collision cross-sections, and radical chemistry. In particular, we have investigated the influence of C2H2 on the gas phase polymeric growth and the elemental composition of the chemical products, and we have compared our findings to recently published solid phase analyses. The modeling results are consistent with experimental measurements of N2-CH4-C2H2 plasmas on COSmIC, showing the production of C6Hx intermediates and precursors of larger organics, as well as methanimine in small concentration. Our numerical results point to cationic pathways enabling efficient intermediate-sized and nitrogen-rich \\ce{C2H2}-driven chemistry driving tholin production. Comparison of the modeled gas phase elemental composition with elemental composition of the solid phase samples produced in COSmIC reveal similar trends, with C/N increasing when C2H2 is present in the gas mixture. Finally, our results demonstrate the importance of such synergistic studies using low-temperature plasma chemistry experiments combined with modeling efforts to improve our understanding of cold planetary environments.",
  "authors": [
    "David Dubois",
    "Alexander W. Raymond",
    "Ella Sciamma-O'Brien",
    "Farid Salama"
  ],
  "published": "2025-09-09T18:04:17Z",
  "updated": "2025-09-09T18:04:17Z",
  "categories": [
    "physics.plasm-ph",
    "astro-ph.EP",
    "astro-ph.IM"
  ],
  "primary_category": "physics.plasm-ph"
}