{
  "arxiv_id": "2509.08098v1",
  "url": "https://arxiv.org/abs/2509.08098v1",
  "pdf_url": "https://arxiv.org/pdf/2509.08098v1.pdf",
  "title": "Geometrical optics in phase space",
  "abstract": "Geometrical optics (GO) is widely used for reduced modeling of waves in plasmas but fails near reflection points, where it predicts a spurious singularity of the wave amplitude. We show how to avoid this singularity by adopting a different representation of the wave equation. Instead of the physical space $x$ and the wavevector $k$, we use the ray time $\\tau$ as the new canonical coordinate and the ray energy $h$ as the associated canonical momentum. To derive the envelope equation in the $\\tau$-representation, we construct the Weyl symbol calculus on the $(\\tau, h)$ space and show that the corresponding Weyl symbols are related to their $(x, k)$ counterparts by the Airy transform. This allows us to express the coefficients in the envelope equation through the known properties of the original dispersion operator. When necessary, solutions of this equation can be mapped to the $x$-space using a generalised metaplectic transform. But the field per se might not even be needed in practice. Instead, knowing the corresponding Wigner function usually suffices for linear and quasilinear calculations. As a Weyl symbol itself, the Wigner function can be mapped analytically, using the aforementioned Airy transform. We show that the standard Airy patterns that form in regions where conventional GO fails are successfully reproduced within MGO simply by remapping the field from the $\\tau$-space to the $x$-space. An extension to mode-converting waves is also presented. This formulation, which we call generalised metaplectic GO (MGO) offers a promising tool, for example, for reduced modeling of the O--X conversion in inhomogeneous plasma near the critical density, an effect that is important for fusion applications and also occurs in the ionosphere. Aside from better handling reflection, MGO is similar to GO and can replace it for any practical purposes.",
  "authors": [
    "I. Y. Dodin",
    "N. A. Lopez",
    "Tingjing Xing",
    "Rune Højlund Marholt",
    "Valerian H. Hall-Chen"
  ],
  "published": "2025-09-09T19:15:56Z",
  "updated": "2025-09-09T19:15:56Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}