{
  "arxiv_id": "2509.01249v2",
  "url": "https://arxiv.org/abs/2509.01249v2",
  "pdf_url": "https://arxiv.org/pdf/2509.01249v2.pdf",
  "title": "An Innovative Photon-Driven Subcritical Reactor Concept Powered by   Synchrotron Radiation Source",
  "abstract": "This paper introduces the conceptual design of a Photon Driven Reactor (PDR), an innovative subcritical reactor designed for energy generation driven by a synchrotron radiation. The PDR concept overcomes key technological challenges of conventional accelerator-driven systems, particularly the target's structural durability and its thermal management, by employing synchrotron photons directly interacting with fissile material to induce photonuclear reactions. Computational analyses involved criticality and fixed-source simulation using MCNPx and SERPENT Monte Carlo codes, providing robust evaluation of the neutron production, moderation, and multiplication mechanisms. The main focus of this study was to evaluate the system's capability to achieve a positive net energy gain, specifically assessing the thermal power output agains the electrical power absorbed from the grid. Furthermore, the adoption of spent nuclear fuel for the subcritical reactor core loading has been investigated, highlighting the sustainability and environmental benefits of the proposed PDR design. The proposed system is able to exploit a modularity feature. For each large synchrotron, up to fifty beam lines may be operated simultaneously, each delivering photons to an independent subcritical reactor core. With a photon flux on the order of $8.8 \\times 10^{17}$ photons per second in each beamline, the results indicate that each individual reactor can achieve a thermal output up to 8 MW, while requiring about 435-660 kW of electrical input from the grid, thereby demonstrating the feasibility of energy amplification in the PDR.",
  "authors": [
    "Antonio Cammi",
    "Lorenzo Loi",
    "Andrea Missaglia",
    "David Alesini",
    "Hans-Heinrich Braun"
  ],
  "published": "2025-09-01T08:41:41Z",
  "updated": "2025-09-10T06:53:36Z",
  "categories": [
    "physics.acc-ph",
    "physics.app-ph"
  ],
  "primary_category": "physics.acc-ph"
}