[
  {
    "arxiv_id": "2505.07979v2",
    "url": "https://arxiv.org/abs/2505.07979v2",
    "pdf_url": "https://arxiv.org/pdf/2505.07979v2.pdf",
    "title": "Demonstration of Efficient Radon Removal by Silver-Zeolite in a Dark Matter Detector",
    "abstract": "We present the performance of an efficient radon trap using silver-zeolite Ag-ETS-10, measured with a spherical proportional counter filled with an argon/methane mixture. Our study compares the radon reduction capabilities of silver-zeolite and the widely used activated charcoal, both at room temperature. We demonstrate that silver-zeolite significantly outperforms activated charcoal by three orders of magnitude in radon capture. Given that radon is a major background contaminant in rare event searches, our findings highlight silver-zeolite as a highly promising adsorbent, offering compelling operational advantages for both current and future dark matter and neutrino physics experiments. Furthermore, this not only offers great promise for developing future radon reduction systems in underground laboratories, but also paves the way for innovative, multidisciplinary advancements with far-reaching implications in science, engineering and environmental health.",
    "authors": [
      "Daniel Durnford",
      "Yuqi Deng",
      "Carter Garrah",
      "Patrick B. O'Brien",
      "Philippe Gros",
      "Michel Gros",
      "José Busto",
      "Steven Kuznicki",
      "Marie-Cécile Piro"
    ],
    "published": "2025-05-12T18:23:21Z",
    "updated": "2025-12-11T17:31:20Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2512.10830v1",
    "url": "https://arxiv.org/abs/2512.10830v1",
    "pdf_url": "https://arxiv.org/pdf/2512.10830v1.pdf",
    "title": "Cosmic Ray Measurements Using Charge and Light Readout in a Pixelated Liquid Argon Time Projection Chamber",
    "abstract": "Liquid argon time projection chambers have emerged as a competitive technology for detecting solar neutrinos. The SoLAr collaboration was formed to explore argon detectors with pixelated light and charge readout, aiming for high detection efficiency and improved energy resolution. Building on the success of an initial prototype, we present results obtained with a second SoLAr prototype (V2), a $30 \\times 30 \\times 30$ cm$^{3}$ time projection chamber operated in a cryostat containing several hundred kilograms of liquid argon. We report measurements of cosmic-ray muons using both tracking and calorimetry from light and charge sensors, and we highlight the improved performance achieved through combined charge and light reconstruction. These results demonstrate the promise of dual-readout detectors and motivate future prototyping efforts toward kiloton-scale facilities.",
    "authors": [
      "SoLAr Collaboration",
      "N. Anfimov",
      "A. Branca",
      "J. Bürgi",
      "L. Calivers",
      "P. Carniti",
      "E. Calvo",
      "E. Cristaldo",
      "C. Cuesta",
      "F. Declich",
      "R. Diurba",
      "P. Dunne",
      "D. A. Dwyer",
      "J. Evans",
      "A. C. Ezeribe",
      "A. Gauch",
      "I. Gil-Botella",
      "C. Gotti",
      "S. Greenberg",
      "D. Guffanti",
      "A. Karcher",
      "J. Kunzmann",
      "N. Lane",
      "S. Manthey Corchado",
      "N. McConkey",
      "A. Minotti",
      "A. Navrer-Agasson",
      "S. Parsa",
      "G. Pessina",
      "G. Ruiz Ferreira",
      "B. Russell",
      "S. Söldner-Rembold",
      "A. M. Szelc",
      "A. Tapper",
      "F. Terranova",
      "C. Tognina",
      "D. Trotta",
      "S. Tufanli",
      "H. Vieira de Souza",
      "G. Vitti Stenico",
      "A. Verdugo",
      "M. Weber",
      "I. Xiotidis"
    ],
    "published": "2025-12-11T17:24:26Z",
    "updated": "2025-12-11T17:24:26Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.10790v1",
    "url": "https://arxiv.org/abs/2512.10790v1",
    "pdf_url": "https://arxiv.org/pdf/2512.10790v1.pdf",
    "title": "Modeling Light Signals Using Data from the First Pulsed Neutron Source Program at the DUNE Vertical Drift ColdBox Test Facility at CERN Neutrino Platform",
    "abstract": "In this paper, we present a first quantitative test of detected light signals produced in a pulsed neutron source run in a small vertical drift LArTPC at the CERN neutrino platform ColdBox test facility. The ColdBox cryostat, detectors, neutron sources, and particle interactions are modeled and simulated using Fluka. A good agreement is found in the detected number of photoelectrons, with values below 650 photoelectrons in both data and simulation, for all four X-ARAPUCA photodetectors on the cathode in the LArTPC. A time constant is also fitted from the neutron-beam-off light signal spectrum and found consistent between data and MC. Several important systematic effects are discussed and serve as guides for future runs at larger LArTPCs.",
    "authors": [
      "A. Paudel",
      "W. Shi",
      "P. Sala",
      "F. Cavanna",
      "W. Johnson",
      "J. Wang",
      "W. Ketchum",
      "F. Resnati",
      "A. Heindel",
      "A. Ashkenazi",
      "E. Bertholet",
      "E. Bertolini",
      "D. A. Martinez Caicedo",
      "E. Calvo",
      "A. Canto",
      "S. Manthey Corchado",
      "C. Cuesta",
      "Z. Djurcic",
      "M. Fani",
      "A. Feld",
      "S. Fogarty",
      "F. Galizzi",
      "S. Gollapinni",
      "Y. Kermaïdic",
      "A. Kish",
      "F. Marinho",
      "D. Torres Muñoz",
      "A. Verdugo de Osa",
      "L. Paulucci",
      "W. Pellico",
      "V. Popov",
      "J. Rodriguez Rondon",
      "D. Leon Silverio",
      "S. Sacerdoti",
      "H. Souza",
      "R. C Svoboda",
      "D. Totani",
      "V. Trabattoni",
      "L. Zambelli"
    ],
    "published": "2025-12-11T16:34:13Z",
    "updated": "2025-12-11T16:34:13Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2512.10771v1",
    "url": "https://arxiv.org/abs/2512.10771v1",
    "pdf_url": "https://arxiv.org/pdf/2512.10771v1.pdf",
    "title": "Accurate laboratory testing of low-frequency triaxial vibration sensors under various environmental conditions",
    "abstract": "Triaxial vibration sensor are widely used used in various application. Recently, low-cost sensors based on micro electro mechanical system (MEMS) technology are also becoming more widely adopted. However, their measurement accuracy can be affected by environmental factors such as temperature. In this study, we developed an environmental testing system integrated with a triaxial vibration exciter. The system can reproduce long-stroke, low-frequency triaxial vibrations -- such as those caused by huge earthquakes -- under temperatures ranging from $-30~^\\circ\\mathrm{C}$ to $+80~^\\circ\\mathrm{C}$. Using this system, the measurement accuracy of vibration sensors can be evaluated under different environmental conditions. The system provides highly accurate reference measurements using a laser interferometer and reference accelerometers that are primarily calibrated within the system. The overall accuracy of the reference vibration measurement is estimated to be approximately 0.23~\\%. Based on these reference measurements, we investigated the accuracy of earthquake observations using a MEMS accelerometer as a demonstration. The system configuration and testing procedures are presented in this paper.",
    "authors": [
      "Tomofumi Shimoda",
      "Wataru Kokuyama",
      "Hideaki Nozato"
    ],
    "published": "2025-12-11T16:08:37Z",
    "updated": "2025-12-11T16:08:37Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.07666v2",
    "url": "https://arxiv.org/abs/2511.07666v2",
    "pdf_url": "https://arxiv.org/pdf/2511.07666v2.pdf",
    "title": "Response of a magnetically diverted tokamak plasma to a resonant magnetic perturbation",
    "abstract": "The safety-factor profile of a magnetically diverted tokamak plasma diverges logarithmically as the magnetic separatrix (a.k.a. the last closed magnetic flux-surface) is approached. At first sight, this suggests that, when determining the response of such a plasma to a static, externally generated, resonant magnetic perturbation (RMP), it is necessary to include an infinite number of rational magnetic flux-surfaces in the calculation, the majority of which lie very close to the separatrix. In fact, when finite plasma resistivity is taken into account, this turns out not to be the case. Instead, it is only necessary to include rational surfaces that lie in the region 0<Psi<Psi_c, where Psi is the normalized poloidal magnetic flux, and Psi_c<1 can be calculated from the edge plasma parameters. It is estimated that Psi_c= 0.9985 for an n=1 RMP, and Psi_c=0.9952 for an n=4 RMP, in a typical JET H-mode plasma.",
    "authors": [
      "R. Fitzpatrick"
    ],
    "published": "2025-11-10T22:22:12Z",
    "updated": "2025-12-11T15:49:07Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2005.07000v3",
    "url": "https://arxiv.org/abs/2005.07000v3",
    "pdf_url": "https://arxiv.org/pdf/2005.07000v3.pdf",
    "title": "A telecommunications system based on axion dark matter coherent transmission",
    "abstract": "In this manuscript we anticipate axion detection in order to theorize on a novel telecommunications system based on the coherent axion-two-photon vertex Primakoff effect conversion and reversion of microwave photons transmitting a modulated signal. We suggest a possible set-up for an experiment or industrial application using state-of-the-art technology and we estimate the output power and photon rate expected to be received as a function of the axion-photon coupling constant $g_{aγγ}$. We find that, although challenging,this system has no physical restriction to render it unfeasible. Finally, we summarize the advantages and disadvantages of a hypothetical axion-based telecommunications system compared to traditional telecommunication systems. We then extend the discussion, noting the more important conclusions.",
    "authors": [
      "Javier De Miguel-Hernández"
    ],
    "published": "2020-05-11T16:37:16Z",
    "updated": "2025-12-11T15:47:53Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.10728v1",
    "url": "https://arxiv.org/abs/2512.10728v1",
    "pdf_url": "https://arxiv.org/pdf/2512.10728v1.pdf",
    "title": "Optimized matching conditions for self-guided laser wakefield accelerators",
    "abstract": "We revisit the matching conditions for self-guided laser pulse propagation in plasma and refine their formulation to maximize the energy of electrons produced via laser wakefield acceleration. Bayesian optimization, combined with particle-in-cell simulations carried out in a quasi-three-dimensional geometry and a Lorentz-boosted frame, is employed. The optimization identifies the maximum electron energy that a self-guided laser wakefield accelerator, driven by a laser of a given energy, can produce, together with the corresponding acceleration distance. Our results further demonstrate that electrons with energies close to the maximum value can be obtained across a relatively wide range of input parameters and without the need for their precise tuning. This provides substantial flexibility for experimental implementation and significantly relaxes the operational constraints associated with self-guided laser wakefield accelerators.",
    "authors": [
      "P. Valenta",
      "K. G. Miller",
      "B. K. Russell",
      "M. Lamač",
      "M. Jech",
      "G. M. Grittani",
      "S. V. Bulanov"
    ],
    "published": "2025-12-11T15:10:31Z",
    "updated": "2025-12-11T15:10:31Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2310.16460v3",
    "url": "https://arxiv.org/abs/2310.16460v3",
    "pdf_url": "https://arxiv.org/pdf/2310.16460v3.pdf",
    "title": "Demonstration and frequency noise characterization of a 17 $μ$m quantum cascade laser",
    "abstract": "We evaluate the spectral performance of a novel continuous-wave room-temperature distributed feedback quantum cascade laser operating at the long wavelength of 17 $μ$m. By demonstrating broadband laser absorption spectroscopy of the $ν$2 fundamental vibrational mode of N2O molecules, we have determined the spectral range and established the spectroscopic potential of this laser. We have characterized the frequency noise and measured the line width of this new device, uncovering a discrepancy with the current consensus on the theoretical modeling of quantum cascade lasers. Our results confirm the potential of such novel narrow-line-width sources for vibrational spectroscopy. Extending laser spectroscopy to longer wavelength is a fascinating prospect that paves the way for a wide range of opportunities from chemical detection, to frequency metrology as well as for exploring light-matter interaction with an extended variety of molecules, from ultra-cold diatomic species to increasingly complex molecular systems.",
    "authors": [
      "M Manceau",
      "T E Wall",
      "H Philip",
      "A N Baranov",
      "Olivier Lopez",
      "M R Tarbutt",
      "R Teissier",
      "B Darquié"
    ],
    "published": "2023-10-25T08:35:51Z",
    "updated": "2025-12-11T15:05:01Z",
    "categories": [
      "physics.atom-ph",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2508.19653v3",
    "url": "https://arxiv.org/abs/2508.19653v3",
    "pdf_url": "https://arxiv.org/pdf/2508.19653v3.pdf",
    "title": "Charting the Luminosity Capabilities of the CERN Large Hadron Collider with Various Nuclear Species",
    "abstract": "The Large Hadron Collider (LHC) at CERN has been instrumental in recent advances in experimental high energy physics by colliding beams of protons and heavier nuclei at unprecedented energies. The present heavy-ion programme is based mainly on colliding lead nuclei. For future ion runs, there is strong interest to achieve a significantly higher integrated nucleon-nucleon luminosity, which might be achieved through collisions of species other than Pb. In this paper, we explore the nucleon-nucleon luminosity projections in the LHC for a selection of ion species ranging from He to Xe, and including Pb as reference. Alternative beam production schemes are investigated as a way to mitigate effects such as space charge that degrade the beam quality in the LHC injectors. In the most optimistic scenarios, we find up to about a factor~4 improvement in integrated nucleon-nucleon luminosity for a typical future one-month run, with respect to the present Pb programme. We also outline a future study programme and experiments to test the assumptions and refine the simulated projections put forward in this article.",
    "authors": [
      "E. Waagaard",
      "R. Bruce",
      "R. Alemany Fernandez",
      "H. Bartosik",
      "J. M. Jowett",
      "N. Triantafyllou"
    ],
    "published": "2025-08-27T08:01:30Z",
    "updated": "2025-12-11T14:48:31Z",
    "categories": [
      "physics.acc-ph",
      "nucl-ex"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.1016/j.nima.2025.171118"
  },
  {
    "arxiv_id": "2501.16950v3",
    "url": "https://arxiv.org/abs/2501.16950v3",
    "pdf_url": "https://arxiv.org/pdf/2501.16950v3.pdf",
    "title": "Generation of Deep Ultraviolet Optical Vortices via Amplitude and Phase Spiral Zone Plates",
    "abstract": "We present the development and experimental implementation of diffractive optical elements designed to generate optical vortices in the deep ultraviolet range (from 260 to 266 nm). These elements, fabricated using advanced lithographic and etching techniques, facilitate the efficient transformation of Gaussian beams into twisted modes carrying orbital angular momentum. Experimental tests conducted using the laser driver of an RF photoinjector at JINR successfully demonstrate the generation of deep-ultraviolet optical vortices with a topological charge of l = 1. These findings underscore the potential of structured light in the deep ultraviolet range for applications in relativistic electron beam studies and beam manipulation technologies.",
    "authors": [
      "A. S. Dyatlov",
      "M. A. Nozdrin",
      "A. N. Sergeev",
      "N. E. Sheremet",
      "S. S. Stafeev",
      "D. V. Karlovets"
    ],
    "published": "2025-01-28T13:47:06Z",
    "updated": "2025-12-11T10:57:36Z",
    "categories": [
      "physics.optics",
      "physics.acc-ph",
      "quant-ph"
    ],
    "primary_category": "physics.optics",
    "doi": "10.1364/AO.578189"
  },
  {
    "arxiv_id": "2510.13173v2",
    "url": "https://arxiv.org/abs/2510.13173v2",
    "pdf_url": "https://arxiv.org/pdf/2510.13173v2.pdf",
    "title": "The BUTTON-30 detector at Boulby",
    "abstract": "The BUTTON-30 detector is a 30-tonne technology demonstrator designed to evaluate the potential of hybrid event detection, simultaneously exploiting both Cherenkov and scintillation light to detect particle produced in neutrino interactions. The detector is installed at a depth of 1.1 km in the Boulby Underground Laboratory allowing to test the performance of this new technology underground in a low background environment. This paper describes the design and construction of the experiment.",
    "authors": [
      "J. Bae",
      "M. Bergevin",
      "E. P. Bernard",
      "D. S. Bhattacharya",
      "J. Boissevain",
      "S. Boyd",
      "K. Bridges",
      "L. Capponi",
      "J. Coleman",
      "D. Costanzo",
      "T. Cunniffe",
      "S. A. Dazeley",
      "M. V. Diwan",
      "S. R. Durham",
      "E. Ellingwood",
      "A. Enqvist",
      "T. Gamble",
      "S. Gokhale",
      "J. Gooding",
      "C. Graham",
      "E. Gunger",
      "J. J. Hecla",
      "W. Hopkins",
      "I. Jovanovic",
      "T. Kaptanoglu",
      "E. Kneale",
      "L. Lebanowski",
      "K. Lester",
      "V. A. Li",
      "M. Malek",
      "C. Mauger",
      "N. McCauley",
      "C. Metelko",
      "R. Mills",
      "A. Morgan",
      "F. Muheim",
      "A. Murphy",
      "M. Needham",
      "K. Ogren",
      "G. D. Orebi Gann",
      "S. M. Paling",
      "A. F. Papatyi",
      "A. Petts",
      "G. Pinkney",
      "J. Puputti",
      "S. Quillin",
      "B. Richards",
      "R. Rosero",
      "A. Scarff",
      "Y. Schnellbach",
      "P. R. Scovell",
      "B. Seitz",
      "L. Sexton",
      "O. Shea",
      "G. D. Smith",
      "R. Svoboda",
      "D. Swinnock",
      "A. Tarrant",
      "F. Thomson",
      "J. N. Tinsley",
      "C. Toth",
      "M. Vagins",
      "G. Yang",
      "M. Yeh",
      "E. Zhemchugov"
    ],
    "published": "2025-10-15T05:57:48Z",
    "updated": "2025-12-11T10:11:31Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2505.12874v3",
    "url": "https://arxiv.org/abs/2505.12874v3",
    "pdf_url": "https://arxiv.org/pdf/2505.12874v3.pdf",
    "title": "Optimization of 3D diamond detectors with graphitized electrodes based on an innovative numerical simulation",
    "abstract": "Future experiments at hadron colliders require an evolution of the tracking sensors to ensure sufficient radiation hardness as well as space and time resolution to handle unprecedented particle fluxes. 3D diamond sensors with laser-graphitized electrodes are promising candidates due to their strong binding energy, small atomic number, and high carrier mobility. However, the high resistance of the engraved electrodes delays the propagation of the induced signals towards the readout electronics, thereby degrading the precision of the timing measurements. So far, this effect has been the dominant factor limiting the time resolution of these devices, with other contributions, such as those due to electric field inhomogeneities or electronic noise, typically neglected. Recent advancements in graphitization technology, however, motivate a renewed effort in modeling signal generation in 3D diamond detectors, to achieve more reliable predictions. To this purpose, we apply an extended version of the Ramo-Shockley theorem, describing the effect of signal propagation as a time-dependent weighting potential, obtained by numerically solving the Maxwell's equations in a quasi-static approximation. We developed a custom spectral method solver and validated it against COMSOL MultiPhysics. The response of the modeled sensor to a beam of particles is then simulated using Garfield++ and is compared to the data acquired in a beam test carried on in 2021 by the TimeSPOT Collaboration at the SPS, at CERN. Based on the results obtained with this simulation workflow, we conclude that reducing the resistivity of the graphitic columns remains the priority for significantly improving the time resolution of 3D diamond detectors. Once achieved, optimization of the detector geometry and readout electronics design will become equally important steps to further enhance the timing performance of these devices.",
    "authors": [
      "Lucio Anderlini",
      "Alessandro Bombini",
      "Clarissa Buti",
      "Djunes Janssens",
      "Stefano Lagomarsino",
      "Giovanni Passaleva",
      "Michele Veltri"
    ],
    "published": "2025-05-19T08:58:39Z",
    "updated": "2025-12-11T10:11:19Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.08442v3",
    "url": "https://arxiv.org/abs/2512.08442v3",
    "pdf_url": "https://arxiv.org/pdf/2512.08442v3.pdf",
    "title": "High-OAM Deep Ultraviolet Twisted Light Generation for RF-Photoinjector Applications",
    "abstract": "We report on the generation and characterization of ultraviolet (wavelength 266 nm) twisted light with high orbital angular momentum (OAM) using three types of fabricated diffractive optical elements (DOEs): a reflective fork grating, a high-charge spiral phase plate (SPP), and binary axicons. All elements were integrated into a drive-laser beamline of an electron RF-photoinjector, enabling direct evaluation under accelerator-relevant conditions. The SPP produced a high-purity Laguerre-Gaussian mode with OAM l = 64 and a measured conversion efficiency of approximately 80%. Binary axicons generated quasi-Bessel twisted light with topological charges up to m = 10, exhibiting low divergence and stable multi-lobe ring structures. The fork grating reliably produced lower-order modes, l = 2-8, with good agreement between simulations and cylindrical-lens diagnostics. These results constitute, to our knowledge, the first comprehensive experimental demonstration of deep-UV high-OAM beams generated with fabricated DOEs and validated through mode-conversion measurements. The demonstrated techniques are compatible with high-power UV laser systems used in RF-photoinjectors and offer a practical route toward structured photocathode illumination and the generation of relativistic vortex electrons at a particle accelerator facility.",
    "authors": [
      "A. S. Dyatlov",
      "D. M. Dolgintsev",
      "V. V. Gerasimov",
      "V. V. Kobets",
      "V. P. Nazmov",
      "M. A. Nozdrin",
      "A. N. Sergeev",
      "D. S. Shokin",
      "K. E. Yunenko",
      "D. V. Karlovets"
    ],
    "published": "2025-12-09T10:15:02Z",
    "updated": "2025-12-11T08:45:42Z",
    "categories": [
      "quant-ph",
      "physics.acc-ph",
      "physics.optics"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2512.10406v1",
    "url": "https://arxiv.org/abs/2512.10406v1",
    "pdf_url": "https://arxiv.org/pdf/2512.10406v1.pdf",
    "title": "Generation of proton beams at switchback boundary-like rotational discontinuities in the solar wind",
    "abstract": "Alfvénic rotational discontinuities (RDs) are abundant in the inner heliosphere and can be used to model the boundary of switchbacks, i.e. Alfvénic magnetic kinks. To investigate the effects of RDs on proton kinetics, we model a pair of switchback-boundary-like RDs with a hybrid Particle-In-Cell (PIC) approach in a 2D system. We find that, at one of the boundary RDs, a significant population of protons remains trapped over long times, creating a secondary beam-like component with temperature anisotropy $T_\\perp/T_\\|\\gtrsim4$ in the proton velocity distribution function that excites ion cyclotron waves within the downstream portion of the transition layer. Further analysis suggests that the static electric field in the vicinity of the RD is the key factor in trapping the protons. This work indicates that switchback boundaries could represent a viable environment for the creation of proton beams in the heliosphere; it also highlights the need to investigate RD sub-structures, especially the embedded current systems of interplanetary RDs. Finally, this paper underscores the importance of high-resolution observations of the solar wind velocity distributions around RDs.",
    "authors": [
      "Rong Lin",
      "Fabio Bacchini",
      "Jiansen He",
      "Luca Pezzini",
      "Jingyu Peng"
    ],
    "published": "2025-12-11T08:16:22Z",
    "updated": "2025-12-11T08:16:22Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2511.08954v2",
    "url": "https://arxiv.org/abs/2511.08954v2",
    "pdf_url": "https://arxiv.org/pdf/2511.08954v2.pdf",
    "title": "Progress on the ALETHEIA project and a new approach to mitigate events overlap",
    "abstract": "The ALETHEIA project aims to search for low-mass dark matter using liquid helium (LHe)-filled time projection chambers (TPCs). While liquid argon and liquid xenon TPCs have been extensively employed in the field of direct dark matter detection, successful development of LHe TPCs has not yet been achieved. Launched in 2020, our project has made significant progress since then. These advancements have convinced us that a single-phase LHe TPC is technologically feasible. Compared to liquid xenon and liquid argon TPCs, one of the unique challenges for LHe TPCs is event overlap caused by the 13-second lifetime scintillation. We will demonstrate that this overlap can be entirely mitigated when the LHe temperature is maintained near 1.0 K. At this temperature, electron mobility is three orders of magnitude higher than at approximately 4.0 K, which is the temperature we initially proposed for the LHe TPC.",
    "authors": [
      "Junhui Liao"
    ],
    "published": "2025-11-12T03:59:38Z",
    "updated": "2025-12-11T07:50:49Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.10259v1",
    "url": "https://arxiv.org/abs/2512.10259v1",
    "pdf_url": "https://arxiv.org/pdf/2512.10259v1.pdf",
    "title": "A DC discharge plasma experiment for undergraduate laboratories",
    "abstract": "Plasma physics offers a wide range of fundamental phenomena, making it an excellent subject for undergraduate laboratory instruction. In this work, we present the design, construction, and characterization of a DC glow-discharge plasma chamber developed for the junior-level curriculum, a project carried out by two undergraduate students. The apparatus consists of a 1-meter-long quartz tube with a movable electrode, enabling systematic exploration of plasma behavior under varying pressure, voltage, and geometry. Using this platform, we characterized the Paschen breakdown relation and the voltage-current characteristics of the plasma. We then developed Langmuir probes to map spatial distributions of electron temperature and density, and used Boltzmann plot spectroscopy to measure excitation temperatures across different plasma regions. Finally, with custom Helmholtz coils, we demonstrated magnetic focusing of electrons. We performed Runge-Kutta simulations of particle trajectories and analyzed the electron drift velocity by comparing the focal lengths. Overall, this plasma chamber provides a versatile platform for investigating fundamental plasma phenomena and offers potential for future studies, including microwave-plasma interactions and other student-driven investigations.",
    "authors": [
      "You-Hsuan Chen",
      "Ting-An Wang",
      "Pisin Chen"
    ],
    "published": "2025-12-11T03:42:33Z",
    "updated": "2025-12-11T03:42:33Z",
    "categories": [
      "physics.plasm-ph",
      "physics.ed-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.03712v2",
    "url": "https://arxiv.org/abs/2506.03712v2",
    "pdf_url": "https://arxiv.org/pdf/2506.03712v2.pdf",
    "title": "Simulation of MAPS and a MAPS-based Inner Tracker for the Super Tau-Charm Facility",
    "abstract": "Monolithic Active Pixel Sensors (MAPS) are a promising detector candidate for the inner tracker of the Super Tau-Charm Facility (STCF). To evaluate the performance of MAPS and the MAPS-based inner tracker, a dedicated simulation workflow has been developed, offering essential insights for detector design and optimization.   The intrinsic characteristics of MAPS, designed using several fabrication processes and pixel geometries, were investigated through a combination of Technology Computer Aided Design (TCAD) and Monte Carlo simulations. Simulations were conducted with both minimum ionizing particles and $^{55}$Fe X-rays to assess critical parameters such as detection efficiency, cluster size, spatial resolution, and charge collection efficiency. Based on these evaluations, a MAPS sensor featuring a strip-like pixel and a high-resistivity epitaxial layer is selected as the baseline sensor design for the STCF inner tracker due to its excellent performance.   Using this optimized MAPS design, a three-layer MAPS-based inner tracker was modeled and simulated. The simulation demonstrated an average detection efficiency exceeding 99%, spatial resolutions of 44.8$\\rm{μm}$ in the $z$ direction and 8.2$\\rm{μm}$ in the $r-φ$ direction, and an intrinsic sensor time resolution of 5.9ns for 1GeV/c $μ^-$ particles originating from the interaction point. These promising results suggest that the MAPS-based inner tracker fulfills the performance requirements of the STCF experiment.",
    "authors": [
      "Ruiyang Zhang",
      "Dongwei Xuan",
      "Jiajun Qin",
      "Lei Zhao",
      "Le Xiao",
      "Xiangming Sun",
      "Lailin Xu",
      "Jianbei Liu"
    ],
    "published": "2025-06-04T08:44:56Z",
    "updated": "2025-12-11T02:55:16Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.04432v2",
    "url": "https://arxiv.org/abs/2512.04432v2",
    "pdf_url": "https://arxiv.org/pdf/2512.04432v2.pdf",
    "title": "Design and Performance Simulation of the Electromagnetic Calorimeter at EicC",
    "abstract": "The electromagnetic calorimeter (ECAL) is a key detector component for precise electron and photon measurements in electron-ion collision experiments. At the Electron-Ion Collider in China (EicC), high-performance calorimetry is essential for exploring the internal structure of nucleons and studying the dynamics of quarks and gluons within quantum chromodynamics (QCD). This paper presents the optimized design and performance simulation of the EicC ECAL system. The ECAL consists of three specialized sections tailored to distinct detection environments: (1) an electron-Endcap employing high-resolution pure Cesium Iodide (pCsI) crystals, (2) a central barrel, and (3) an ion-Endcap, both adopting a cost-effective Shashlik-style sampling calorimeter with improved light yield. Each segment's geometry and material composition have been systematically optimized through Geant4 simulations to achieve excellent energy and position resolutions as well as strong electron-pion discrimination. The simulated performance indicates that the ECAL can achieve energy resolutions of 2 percent divided by sqrt(E) for pCsI crystals and 5 percent divided by sqrt(E) for Shashlik modules, meeting the design goals of the EicC detector.",
    "authors": [
      "Ye Tian",
      "Souvik Maity",
      "Jingyu Li",
      "Yuancai Wu",
      "Shan Sha",
      "Yutie Liang",
      "Aiqiang Guo",
      "Yuxiang Zhao",
      "Dexu Lin"
    ],
    "published": "2025-12-04T03:55:34Z",
    "updated": "2025-12-11T01:41:45Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.10162v1",
    "url": "https://arxiv.org/abs/2512.10162v1",
    "pdf_url": "https://arxiv.org/pdf/2512.10162v1.pdf",
    "title": "Solid-state Laser Cooling",
    "abstract": "Since the first proof-of-concept demonstrations of photoluminescence-based optical refrigeration, solid-state laser cooling has developed into a credible competitor to conventional cryogenic technologies. Solid-state laser cooling continues to advance as new materials push cooling limits. These developments have created a need to consolidate progress made to date as well as standardize critical experimental considerations needed for reliable and verifiable cooling measurements. This primer therefore outlines essential concepts and requirements, which underpin solid-state laser cooling. The primer summarizes key milestones achieved with cooling-grade, rare-earth-doped glasses and crystals as well as with semiconductors. It additionally highlights emerging applications of solid-state optical refrigeration. To strengthen the consistency and reproducibility of cooling results going forward, two reporting checklists are introduced. They cover materials, cooling metrics, and thermometry. This primer is intended to serve as both a tutorial and a practical reference for incoming and existing researchers involved in solid-state laser-cooling.",
    "authors": [
      "Yang Ding",
      "Shenghao Zhang",
      "Alexander R. Albrecht",
      "Zhaojie Feng",
      "Lars Forberger",
      "Hiroki Tanaka",
      "Markus P. Hehlen",
      "Galina Nemova",
      "Peter J. Pauzauskie",
      "Denis V. Seletskiy",
      "Masaru Kuno"
    ],
    "published": "2025-12-10T23:41:01Z",
    "updated": "2025-12-10T23:41:01Z",
    "categories": [
      "physics.optics",
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2512.10137v1",
    "url": "https://arxiv.org/abs/2512.10137v1",
    "pdf_url": "https://arxiv.org/pdf/2512.10137v1.pdf",
    "title": "μRWELL-PICOSEC: Precision Timing with Resistive Micro-Well Detector",
    "abstract": "The PICOSEC detector concept uses a micro-pattern gaseous detector (MPGD) amplification structure combined with a Cerenkov radiator coated with a semi-transparent photocathode to provide below tens of picosecond-level precision timing capabilities with minimum ionizing particles. PICOSEC has triggered interest in the development of time-of-flight detectors for particle identification and timing detectors for track reconstruction in the high rate environment of future nuclear and high energy physics experiments. The PICOSEC Micromegas (or PICOSEC-MM) detector, developed by the CERN-based PICOSEC collaboration, use the Micromegas structure for gaseous amplification and achieve below 20 ps timing resolution. A new type of PICOSEC detector, the μRWELL-PICOSEC based on μRWELL amplification structure, is being investigated at Thomas Jefferson National Accelerator Facility (Jefferson Lab) alongside PICOSEC-MM R&D efforts in Europe. Preliminary results from the two 2024 beam test campaigns at CERN demonstrate a timing performance better than 24 ps is achievable with a single-channel μRWELL-PICOSEC prototype. A vigorous R&D effort is ongoing to improve the timing performance, robustness and operational stability of μRWELL-PICOSEC detectors. Development of a large size μRWELL-PICOSEC is also under consideration for applications in large scale experiments.",
    "authors": [
      "Kondo Gnanvo"
    ],
    "published": "2025-12-10T22:33:38Z",
    "updated": "2025-12-10T22:33:38Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.10119v1",
    "url": "https://arxiv.org/abs/2512.10119v1",
    "pdf_url": "https://arxiv.org/pdf/2512.10119v1.pdf",
    "title": "A Computational Procedure for Assessing I$_c$($\\varepsilon$) in Nb$_3$Sn/Bi-2212 Hybrid Magnets",
    "abstract": "The critical current of superconductors is commonly measured by testing unloaded wires under an external magnetic field. While stressed by intense Lorentz forces, the existing HTS/LTS superconductors are prone to a reduction in critical current before reaching their structural mechanical limit. In this work, the magnetic and mechanical analysis of the FNAL 4-layer Bi-2212/Nb$_3$Sn hybrid dipole magnet is reported, aimed at predicting the critical current degradation for both the superconductors during powering at 16 T. All the Rutherford cables in the coils of the hybrid magnet were modeled at the strand level in Ansys APDL with the heterogeneous cable model. Utilizing this detailed geometry, it was possible to evaluate the effects of strain on the critical current degradation for both the Nb$_3$Sn and Bi-2212 superconductors under the intense Lorentz forces. The analysis presented in this paper integrates strain-dependent critical current laws, with parameters derived from experimental data, to simulate the hybrid magnet's performance for all possible current-powering configurations. The proposed methodology enables a detailed assessment of conductor integrity and I$_C$($\\varepsilon$) reduction in existing hybrid magnet designs, providing a versatile and rigorous framework for optimizing future high-field hybrid magnets.",
    "authors": [
      "A. D'Agliano",
      "A. V. Zlobin",
      "I. Novitski",
      "G. Vallone",
      "P. Ferracin",
      "E. Barzi",
      "S. Donati",
      "V. Giusti"
    ],
    "published": "2025-12-10T22:12:06Z",
    "updated": "2025-12-10T22:12:06Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1109/TASC.2025.3624725"
  },
  {
    "arxiv_id": "2512.10097v1",
    "url": "https://arxiv.org/abs/2512.10097v1",
    "pdf_url": "https://arxiv.org/pdf/2512.10097v1.pdf",
    "title": "Enabling searches for long-lived particles at a future 10 TeV Muon Collider",
    "abstract": "Muon Colliders offer fantastic opportunities to explore new phenomena at the energy frontier. However, beam-induced-backgrounds from muon decays pose significant challenges for detector design, readout, and reconstruction. Previous detector studies have employed stringent hit-timing requirements to reduce occupancy to manageable levels with negligible efficiency loss for prompt Standard Model particles. In the spirit of maximizing discovery potential, we investigate the capability of detecting meta-stable charged long-lived particles at a 10 TeV Muon Collider. As a benchmark, we consider a Gauge Mediated Supersymmetry Breaking (GMSB) model in which the stau is long-lived and can be identified as a high momentum, slowly moving track. We find that nominal hit-timing selections are too restrictive, and investigate the impact of looser requirements. We demonstrate that it is possible to recover sensitivity to particles with masses close to $\\sqrt{s}/2$ by expanding time acceptance, and provide recommendations to further improve tracker design and track reconstruction.",
    "authors": [
      "Mira Littmann",
      "Mark Larson",
      "Benjamin Rosser",
      "Tate Flicker",
      "Kane Huang",
      "Leo Rozanov",
      "Karri Folan Di Petrillo"
    ],
    "published": "2025-12-10T21:39:20Z",
    "updated": "2025-12-10T21:39:20Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2512.08027v2",
    "url": "https://arxiv.org/abs/2512.08027v2",
    "pdf_url": "https://arxiv.org/pdf/2512.08027v2.pdf",
    "title": "Overview of the Helios Design: A Practical Planar Coil Stellarator Fusion Power Plant",
    "abstract": "Thea Energy, Inc. has developed the preconceptual design for \"Helios,\" a fusion power plant based on the planar coil stellarator architecture. In this overview paper, the design is summarized and the reader is referred to the other papers for more detail. The Helios design is based around a two-field-period quasi-axisymmetric (\"QA\") stellarator equilibrium with aspect ratio 4.5 and a novel tokamak-like X-point divertor. The natural stability, low recirculating power, and steady-state capability of the stellarator are leveraged. Stability and transport are calculated using state-of-the-art, high-fidelity codes and grounded in measured performance of existing experiments. The electromagnetic coil set is high-temperature superconducting (\"HTS\") and consists of 12 large, plasma-encircling coils like the toroidal field coils of a tokamak, and 324 smaller, field-shaping coils. All coils are planar and convex. A maximum of 20 T on-coil is enforced, a value which has been achieved in existing large-bore HTS coils. There is a minimum of 1.2 m between plasma and coils, leaving space for tritium breeding blanket and neutron shielding. Because of this thick shielding, all coils have a minimum 40-year operational lifetime, the same minimum lifetime of the power plant system. 1.1 GW of thermal power and 390 MW of net electric power are produced. The shaping coils are individually controllable, enabling a uniquely configurable magnetic field for relaxed manufacturing and assembly tolerances and plasma control. A practical maintenance architecture is a primary driver of the design; maintenance is performed on entire toroidal sectors that are removed from between the encircling coils. A biennial maintenance cycle is estimated to take approximately 84 days, resulting in an 88% capacity factor. Rigorous engineering constraints such as temperature and stress limits are enforced.",
    "authors": [
      "C. P. S. Swanson",
      "S. T. A. Kumar",
      "D. W. Dudt",
      "E. R. Flom",
      "W. B. Kalb",
      "T. G. Kruger",
      "M. F. Martin",
      "J. R. Olatunji",
      "S. Pasmann",
      "L. Z. Tang",
      "J. von der Linden",
      "J. Wasserman",
      "M. Avida",
      "A. S. Basurto",
      "M. Dickerson",
      "N. de Boer",
      "M. J. Donovan",
      "A. H. Doudna Cate",
      "D. Fort",
      "W. Harris",
      "U. Khera",
      "A. Koen",
      "J. A. Labbate",
      "N. Maitra",
      "A. Ottaviano",
      "R. K. Parmar",
      "E. J. Paul",
      "B. Reydel",
      "A. van Riel",
      "P. K. Romano",
      "M. Savastianov",
      "S. Saxena",
      "S. Seethalla",
      "S. Srinivasan",
      "R. H. Wu",
      "D. Nash",
      "J. Priebe",
      "M. Slepchenkov",
      "S. Walsh",
      "B. Berzin",
      "D. A. Gates",
      "the Thea Energy team"
    ],
    "published": "2025-12-08T20:38:49Z",
    "updated": "2025-12-10T21:24:21Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.06150v2",
    "url": "https://arxiv.org/abs/2510.06150v2",
    "pdf_url": "https://arxiv.org/pdf/2510.06150v2.pdf",
    "title": "Simulation of Muon-induced Backgrounds for the Colorado Underground Research Institute (CURIE)",
    "abstract": "We present a comprehensive Monte Carlo simulation of muon-induced backgrounds for the Colorado Underground Research Institute (CURIE), a shallow-underground facility with $\\approx 415$~m.w.e. overburden. Using coupled \\textsc{mute} and \\textsc{geant4} frameworks, we characterize the production and transport of muon-induced secondaries through site-specific rock compositions and geometries, establishing a proof-of-concept for high-precision, end-to-end simulations. Our simulations employ angular-dependent muon energy distributions, which improve secondary flux accuracy. For the Subatomic Particle Hideout and Cryolab I research spaces, we predict total muon-induced neutron fluxes of $(8.52 \\pm 1.30_{\\text{sys}}) \\times 10^{-3}$~m$^{-2}$s$^{-1}$ and $(8.86 \\pm 1.62_{\\text{sys}}) \\times 10^{-3}$~m$^{-2}$s$^{-1}$, respectively. Additionally, we develop a Depth-Intensity Relation (DIR) to predict the muon-induced neutron flux as a function of facility depth, which is consistent with measurements across a broad range of underground depths. These results provide quantitative background predictions for experimental design and sensitivity projections at shallow- and deep-underground facilities. They further demonstrate that local geology and overburden geometry influence muon-induced secondary yields and energy spectra, emphasizing the need for site-specific simulations for accurate underground background characterization. Therefore, the simulation framework has been made publicly available at \\href{https://doi.org/10.5281/zenodo.17196581}{https://doi.org/10.5281/zenodo.17196581}, for the broader low-background physics community to enable meaningful inter-facility comparisons.",
    "authors": [
      "Dakota K. Keblbeck",
      "Eric Mayotte",
      "Uwe Greife",
      "Kyle G. Leach",
      "Wouter Van De Pontseele",
      "Caitlyn Stone-Whitehead",
      "Luke Wanner",
      "Grace Wagner"
    ],
    "published": "2025-10-07T17:21:18Z",
    "updated": "2025-12-10T21:08:32Z",
    "categories": [
      "hep-ex",
      "physics.comp-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2505.18155v3",
    "url": "https://arxiv.org/abs/2505.18155v3",
    "pdf_url": "https://arxiv.org/pdf/2505.18155v3.pdf",
    "title": "Modelling cosmic-ray transport: magnetised versus unmagnetised motion in astrophysical magnetic turbulence",
    "abstract": "Cosmic-ray transport in turbulent astrophysical environments remains a multifaceted problem and, despite decades of study, the impact of complex magnetic field geometry -- evident in simulations and observations -- has only recently received more focussed attention. To understand how ensemble-averaged transport behaviour emerges from the intricate interactions between cosmic rays and structured magnetic turbulence, we run test-particle experiments in snapshots of a strongly turbulent magnetohydrodynamics simulation. We characterise particle-turbulence interactions via the gyro radii of particles and their experienced field-line curvatures, which reveals two distinct transport modes: magnetised motion, where particles are tightly bound to strong coherent flux tubes and undergo large-scale mirroring; and unmagnetised motion, characterised by chaotic scattering through weak and highly tangled regions of the magnetic field. We formulate an effective stochastic process for each mode: compound subdiffusion with long mean free paths for magnetised motion, and a Langevin process with short mean free paths for unmagnetised motion. A combined stochastic walker that alternates between these two modes accurately reproduces the mean squared displacements observed in the test-particle data. Our results emphasise the critical role of coherent magnetic structures in comprehensively understanding cosmic-ray transport and lay a foundation for developing a theory of geometry-mediated transport.",
    "authors": [
      "Jeremiah Lübke",
      "Patrick Reichherzer",
      "Sophie Aerdker",
      "Frederic Effenberger",
      "Mike Wilbert",
      "Horst Fichtner",
      "Rainer Grauer"
    ],
    "published": "2025-05-23T17:59:52Z",
    "updated": "2025-12-10T20:33:22Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1017/S0022377825100883"
  },
  {
    "arxiv_id": "2512.10044v1",
    "url": "https://arxiv.org/abs/2512.10044v1",
    "pdf_url": "https://arxiv.org/pdf/2512.10044v1.pdf",
    "title": "Identifying Neutron Sources using Recoil and Time-of-Flight Spectroscopy",
    "abstract": "Neutron-source identification is central to nuclear physics and its applications, from planetary science to nuclear security, yet direct discrimination from neutron spectra remains fundamentally elusive. Here, we introduce a Bayesian protocol that directly infers source ensembles from measured neutron spectra by combining full-spectrum template matching with probabilistic evidence evaluation. Applying this protocol to recoil and time-of-flight spectroscopy, we recover single- and two-source configurations with strong statistical significance ($>\\!\\!4σ$) at event counts as low as $\\sim\\!\\!10^{3}$. These results demonstrate that neutron spectral signatures can be leveraged for robust source identification, opening a new observational window for both fundamental research and operationally driven applications.",
    "authors": [
      "David Breitenmoser",
      "Ricardo Lopez",
      "Shaun D. Clarke",
      "Sara A. Pozzi"
    ],
    "published": "2025-12-10T19:57:05Z",
    "updated": "2025-12-10T19:57:05Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex",
      "physics.app-ph",
      "physics.data-an"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2412.10205v3",
    "url": "https://arxiv.org/abs/2412.10205v3",
    "pdf_url": "https://arxiv.org/pdf/2412.10205v3.pdf",
    "title": "Partially Coherent X-Ray Oscilex Radiation from a FEL-Modulated Positron Bunch during Its Planar Channeling in a Crystalline Undulator",
    "abstract": "The radiation emitted at zero angle by a microbunched positron bunch undergoing planar channeling in a crystalline undulator (CU) is studied. The bunch energy is assumed to be far above the threshold for radiation generation in the dispersive CU medium. Besides the usual ``hard'' undulator radiation produced by channeling oscillations (channeling undulator radiation) and by the CU bending (crystalline undulator radiation), a ``soft'' medium-polarization component also appears at zero angle due to the oscillations that excite atomic electrons. We refer to this soft component as Oscilex (oscillationally-excited) radiation. Since the two types of oscillations have different frequencies, they yield two distinct frequency components of both undulator and Oscilex radiation. The Oscilex frequencies are set by the plasma frequency and the characteristic oscillation frequency and are, to high accuracy, independent of the positron energy. The CU period is chosen so that the radiation wavelength is not shorter than the microbunch length, ensuring coherent emission from microbunches and partially coherent Oscilex emission from the full bunch. Analytical expressions are obtained for the spectral line shapes and the number of photons of spontaneous Oscilex radiation. For partially coherent emission, Gaussian distributions are used for both the bunch and microbunches. Gain factors for the two Oscilex components, including longitudinal form-factors, and the total number of partially coherent photons are derived. A positron bunch with LCLS parameters, modulated by SASE XFEL, channeling between (1 1 0) planes of a periodically bent diamond crystal is analyzed. The number of spontaneously emitted Oscilex photons exceeds the number of positrons by $1\\text{÷}2$ orders of magnitude, and the gain factors reach $10^3 \\text{÷} 10^4$.",
    "authors": [
      "Hayk L. Gevorgyan",
      "Lekdar A. Gevorgian"
    ],
    "published": "2024-12-13T15:26:33Z",
    "updated": "2025-12-10T19:35:17Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex",
      "hep-ph",
      "physics.class-ph",
      "physics.optics"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.09995v1",
    "url": "https://arxiv.org/abs/2512.09995v1",
    "pdf_url": "https://arxiv.org/pdf/2512.09995v1.pdf",
    "title": "Searches for electroweak states at future plasma wakefield colliders",
    "abstract": "We quantify the discovery potential of future multi-TeV plasma wakefield colliders for new electroweak multiplets. We include beam-beam effects through realistic luminosity spectra, comparing five collider configurations: $e^+e^-$ and $e^-e^-$ machines with round- and flat-beams, and a $γγ$ collider. The beam-beam effects qualitatively change search strategies relative to idealized mono-energetic lepton colliders, highlighting the importance of the low-energy part of the luminosity spectrum and additional beam-induced initial-state channels. Our results have implications for accelerator R&D priorities, since key electroweak targets may remain accessible even if efficient positron acceleration and flat-beam delivery prove technically challenging at the multi-TeV scale.",
    "authors": [
      "So Chigusa",
      "Simon Knapen",
      "Toby Opferkuch",
      "Inbar Savoray",
      "Christiane Scherb",
      "Weishuang Linda Xu"
    ],
    "published": "2025-12-10T19:00:04Z",
    "updated": "2025-12-10T19:00:04Z",
    "categories": [
      "hep-ph",
      "physics.acc-ph"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2512.09921v1",
    "url": "https://arxiv.org/abs/2512.09921v1",
    "pdf_url": "https://arxiv.org/pdf/2512.09921v1.pdf",
    "title": "Photon emission by vortex particles accelerated in a linac",
    "abstract": "We study the photon emission by charged spinless particles with phase vortices and an orbital angular momentum (OAM) projection in longitudinal electric and magnetic fields within the scalar QED. A realistic wave packet of an electron or ion accelerated by a radio-frequency wave locally feels a constant and spatially homogeneous field, which allows us to develop an effective model for losing the angular momentum of the vortex particle due to photon emission. For the fields typical for accelerator facilities, we find that an effective lifetime of the vortex state greatly exceeds the acceleration time. This proves that the acceleration of vortex electrons, ions, muons, and so forth to relativistic energies is possible in conventional linacs, as well as in the wake-field accelerators with higher field gradients, the OAM losses due to the photon emission are mostly negligible, and that the vortex quantum state is highly robust against these losses.",
    "authors": [
      "A. Yu. Murtazin",
      "G. K. Sizykh",
      "D. V. Grosman",
      "U. G. Rybak",
      "A. A. Shchepkin",
      "D. V. Karlovets"
    ],
    "published": "2025-12-10T18:55:52Z",
    "updated": "2025-12-10T18:55:52Z",
    "categories": [
      "hep-ph",
      "physics.acc-ph",
      "quant-ph"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2504.08932v4",
    "url": "https://arxiv.org/abs/2504.08932v4",
    "pdf_url": "https://arxiv.org/pdf/2504.08932v4.pdf",
    "title": "AC-LGADs Fermilab Front-End Electronics Characterization",
    "abstract": "We characterized the front-end electronics used to process high-frequency signals from low-gain avalanche diodes (LGADs) at the Fermilab Test Beam Facility. LGADs are silicon detectors employed for charged particle tracking, offering exceptional spatial and temporal resolution. The purpose of this characterization was to understand how the time resolution is influenced by the front-end electronics. To achieve this, we developed a setup capable of generating input signals with varying amplitudes. The output results demonstrated that signal processing by the front-end electronics plays a crucial role in enhancing time resolution. We showed that the time resolution achieved by the FEE board is better than $2\\: ps$ at the $1σ$ level.",
    "authors": [
      "René Ríos",
      "Esteban Felipe Molina Cardenas",
      "Cristian Peña",
      "Orlando Soto",
      "William Brooks",
      "Artur Apresyan",
      "Sergey Los",
      "Claudio San Martín"
    ],
    "published": "2025-04-11T19:19:11Z",
    "updated": "2025-12-10T18:53:53Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1016/j.nima.2025.171081"
  },
  {
    "arxiv_id": "2512.09917v1",
    "url": "https://arxiv.org/abs/2512.09917v1",
    "pdf_url": "https://arxiv.org/pdf/2512.09917v1.pdf",
    "title": "Evaluating Function-as-a-Service (FaaS) frameworks for the Accelerator Control System",
    "abstract": "As particle accelerator control systems evolve in complexity and scale, the need for responsive, scalable, and cost-effective computational infrastructure becomes increasingly critical. Function-as-a-Service (FaaS) offers an alternative to traditional monolithic architecture by enabling event-driven execution, automatic scaling, and fine-grained resource utilization. This paper explores the applicability and performance of FaaS frameworks in the context of a modern particle accelerator control system, with the objective of evaluating their suitability for short lived and triggered workloads. In this paper, we evaluate prominent open-source FaaS platforms in executing functional logic, triggers, and diagnostics routines. Evaluation metrics consist of cold-start latency, scalability, performance, integration with other open-source tools like Kafka. Experimental workloads were designed to simulate real-world control tasks when implemented as stateless FaaS functions. These workloads were benchmarked under various invocation loads and network conditions. Self-hosted FaaS platforms, when deployed within accelerator networks, offer greater control over execution environment, better integration with legacy systems, and support for real-time guarantees when paired with message queues. Based on lessons learned and evaluation metrics, this paper describes reliability of the FaaS framework for the Accelerator Control Systems (ACS).",
    "authors": [
      "A. Jaikar",
      "J. Diamond",
      "A. Tiradani",
      "B. Harrison"
    ],
    "published": "2025-12-10T18:53:00Z",
    "updated": "2025-12-10T18:53:00Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.18429/JACoW-ICALEPCS2025-THBR003"
  },
  {
    "arxiv_id": "2503.12960v2",
    "url": "https://arxiv.org/abs/2503.12960v2",
    "pdf_url": "https://arxiv.org/pdf/2503.12960v2.pdf",
    "title": "Initial acquisition requirements for optical cavities in the space gravitational wave antennae DECIGO and B-DECIGO",
    "abstract": "DECIGO (DECi-hertz Interferometer Gravitational Wave Observatory) is a space-based gravitational wave antenna concept targeting the 0.1-10 Hz band. It consists of three spacecraft arranged in an equilateral triangle with 1,000 km sides, forming Fabry-Pérot cavities between them. A precursor mission, B-DECIGO, is also planned, featuring a smaller 100 km triangle. Operating these cavities requires ultra-precise formation flying, where inter-mirror distance and alignment must be precisely controlled. Achieving this necessitates a sequential improvement in precision using various sensors and actuators, from the deployment of the spacecraft to laser link acquisition and ultimately to the control of the Fabry-Pérot cavities to maintain resonance. In this paper, we derive the precision requirements at each stage and discuss the feasibility of achieving them. We show that the relative speed between cavity mirrors must be controlled at the sub-micrometer-per-second level and that relative alignment must be maintained at the sub-microradian level to obtain control signals from the Fabry-Pérot cavities of DECIGO and B-DECIGO.",
    "authors": [
      "Yuta Michimura",
      "Koji Nagano",
      "Kentaro Komori",
      "Kiwamu Izumi",
      "Takahiro Ito",
      "Satoshi Ikari",
      "Tomotada Akutsu",
      "Masaki Ando",
      "Isao Kawano",
      "Mitsuru Musha",
      "Shuichi Sato"
    ],
    "published": "2025-03-17T09:15:20Z",
    "updated": "2025-12-10T17:40:01Z",
    "categories": [
      "gr-qc",
      "astro-ph.IM",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "gr-qc",
    "doi": "10.1088/1361-6382/ae1b61"
  },
  {
    "arxiv_id": "2512.09828v1",
    "url": "https://arxiv.org/abs/2512.09828v1",
    "pdf_url": "https://arxiv.org/pdf/2512.09828v1.pdf",
    "title": "Damped Kinetic Alfvén Waves in Earth's Magnetosheath: Numerical Simulations and MMS Observations",
    "abstract": "The Earth's magnetosheath provides a high $β$ (ratio of electron thermal pressure to magnetic pressure) plasma environment where kinetic Alfvén waves (KAWs) strongly influence turbulence and energy dissipation. This study investigates how Landau damping modifies the nonlinear evolution of KAWs by solving a modified nonlinear Schrödinger equation that captures both dispersive and nonlinear effects. Without Landau damping, modulational instability drives rapid self-focusing into intense magnetic filaments, producing a turbulent cascade with $k_\\perp^{-5/3}$ scaling in the inertial range ($k_\\perpρ_i<1$) that transitions to $k_\\perp^{-8/3}$ at sub-ion scales ($k_\\perpρ_i>1$), here $k_\\perp$ is the wavevector component perpendicular to the background magnetic field and $ρ_i$ the ion thermal gyroradius. When Landau damping is included, magnetic structures are significantly suppressed, and the spectrum steepens to $k_\\perp^{-11/3}$ in the sub-ion range while the inertial range maintains $k_\\perp^{-5/3}$ scaling. The damping acts across all scales through resonant wave-particle interactions, efficiently transferring energy from waves to particles. Direct comparison with Magnetospheric Multiscale (MMS) spacecraft observations shows that the observed kinetic range spectral slope falls between our undamped and damped simulation limits, consistent with an intermediate damping regime in magnetosheath turbulence. This agreement confirms that Landau damping is one of the primary mechanisms controlling turbulent energy dissipation at kinetic scales in collisionless plasmas.",
    "authors": [
      "Mani K. Chettri",
      "Hemam D. Singh",
      "Vivek Shrivastav",
      "Britan Singh",
      "Rupak Mukherjee"
    ],
    "published": "2025-12-10T17:06:13Z",
    "updated": "2025-12-10T17:06:13Z",
    "categories": [
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.09820v1",
    "url": "https://arxiv.org/abs/2512.09820v1",
    "pdf_url": "https://arxiv.org/pdf/2512.09820v1.pdf",
    "title": "Scintillation response of cryogenic CsI to few-keV and sub-keV nuclear recoils",
    "abstract": "Monochromatic neutron emissions from photonuclear sources $^{88}$Y/Be and $^{124}$Sb/Be are employed to obtain the response of pure (undoped) cesium iodide at 80 K. The use of a low-noise, high-quantum-efficiency avalanche photodiode in combination with a novel waveshifter results in a 70 eV analysis threshold. This reach allows to observe signals from sub-keV nuclear recoils originating in neutron scattering. The extracted quenching factor drops much faster towards low energy than the extrapolation of a model developed for room-temperature CsI[Na]. We comment on the impact of our measurement on planned use of cryogenic CsI in neutrino physics and dark matter experiments.",
    "authors": [
      "J. I. Collar",
      "C. M. Lewis",
      "A. Simón",
      "S. G. Yoon"
    ],
    "published": "2025-12-10T16:49:01Z",
    "updated": "2025-12-10T16:49:01Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "hep-ph",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.09816v1",
    "url": "https://arxiv.org/abs/2512.09816v1",
    "pdf_url": "https://arxiv.org/pdf/2512.09816v1.pdf",
    "title": "Density of hybrid plasma generated by microwave and laser radiation in the Ar:H2:CH4 mixture",
    "abstract": "The atmospheric-pressure hybrid plasma in the Ar:H2:CH4 mixture, maintained by microwave radiation (2.47 GHz) and CO2 laser radiation (10.6 μm) in the chamber of an experimental plasma-chemical reactor designed to study the synthesis of diamond-like coatings was studied. The electron number density was determined from the Stark broadening of the Hα line shape of atomic hydrogen. It was shown that when laser radiation is focused in the region of a microwave plasma bunch, the Hα line shape in the hybrid plasma spectra has broad wings and is described by a Lorentz function with a two-contour approximation. The complex structure of the Hα line profile of the hybrid plasma indicates its spatiotemporal inhomogeneity. The electron number density corresponding to the contour with a smaller half-width exceeds the electron number density in microwave plasma and lies in the range of (4-8)E15 cm-3, and the electron number density measured by the contour with a larger half-width is (1.5-2)E17 cm-3.",
    "authors": [
      "S. V. Avtaeva",
      "V. B. Dolomanova",
      "P. A. Pinaev",
      "A. E. Medvedev"
    ],
    "published": "2025-12-10T16:36:22Z",
    "updated": "2025-12-10T16:36:22Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.09777v1",
    "url": "https://arxiv.org/abs/2512.09777v1",
    "pdf_url": "https://arxiv.org/pdf/2512.09777v1.pdf",
    "title": "Machine Learning Optimization of BEGe Detector Event Selection in the VIP Experiment",
    "abstract": "The VIP collaboration operates a Broad Energy Germanium detector at the Gran Sasso National Laboratory to measure radiation in the few keV to 100 keV range, aiming to search for spontaneous collapse induced radiation and atomic transitions that violate the Pauli Exclusion Principle. Here we present a machine learning based upgrade for the BEGe detector using an event selection strategy aimed at improving the efficiency in detecting low energy events down to 10 keV. The method employs a denoising autoencoder to suppress electronic and microphonic noises and to reconstruct pulse shapes, followed by a convolutional neural network that classifies waveforms as normal single site or events with anomalies. The workflow was validated on a dataset comprising more than 20000 waveforms recorded in 2021. The classifier achieves a receiver operating characteristic curve with an area under the curve of 0.99 and an accuracy of 95 percent. Applying this procedure lowers the minimum detectable energy of the final spectrum to approximately 10 keV. It also yields a measurable enhancement in spectral quality, including an improvement of about 14 percent in the signal to background ratio and a reduction of the energy resolution for the characteristic Pb and Bi gamma lines. These developments enhance the sensitivity of the BEGe detector to rare low energy signals and provide a scalable framework for future precision tests of quantum foundations in low background environments.",
    "authors": [
      "Simone Manti",
      "Jason Yip",
      "Massimiliano Bazzi",
      "Nicola Bortolotti",
      "Mario Bragadireanu",
      "Ivan Carnevali",
      "Alberto Clozza",
      "Luca De Paolis",
      "Raffaele Del Grande",
      "Carlo Guaraldo",
      "Mihai Antoniu Iliescu",
      "Matthias Laubenstein",
      "Johan Marton",
      "Fabrizio Napolitano",
      "Federico Nola",
      "Kristian Pischicchia",
      "Alessio Porcelli",
      "Alessandro Scordo",
      "Francesco Sgaramella",
      "Diana Sirghi",
      "Florin Sirghi",
      "Johann Zmeskal",
      "Catalina Curceanu"
    ],
    "published": "2025-12-10T15:56:35Z",
    "updated": "2025-12-10T15:56:35Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.09686v1",
    "url": "https://arxiv.org/abs/2512.09686v1",
    "pdf_url": "https://arxiv.org/pdf/2512.09686v1.pdf",
    "title": "Surface Ion-Sound Wave in Magnetic Arch With High Pressure Plasma",
    "abstract": "The work analytically substantiates the parameters of the surface wave found in numerical modelling of the collision of two oncoming supersonic plasma flows inside a magnetic arc in application to the experiment on the laboratory setup ``Solar Wind'' (Inst. Appl. Phys RAS). An ion-acoustic surface wave exists in the regime of dense plasma flows when their dynamic pressure is of the order of the pressure of an undisturbed magnetic field, so that the flows push the initial magnetic field out of their volume. The wave frequency is in the range between the ion gyrofrequencies inside the plasma bundle and in the outer region of the confining magnetic field. In the external rarefied medium, the near-surface structure is a heterogeneous magnetic sound, consistent in pressure and low total polarisation of the medium with the ``isotropic'' ion sound confined from the inside in a dense plasma bundle. The energy of the structure is mainly contained in the kinetic energy of the wave motion of ions inside the tube. At the same time, the electric field strength is sharply increased outside. Firstly, the latter circumstance arises from the need to maintain a uniform electron electric drift velocity inside the transition layer. Secondly, the energetically weak ion sound propagating into the outer environment is close to electrostatic ion oscillations below the ion gyrofrequency in the external region, which are characterised by increased electric field strength across the ambient magnetic field.",
    "authors": [
      "Sergey A. Koryagin",
      "Mikhail E. Viktorov",
      "Artem V. Korzhimanov",
      "Andrey A. Elyasin"
    ],
    "published": "2025-12-10T14:35:16Z",
    "updated": "2025-12-10T14:35:16Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2505.17848v2",
    "url": "https://arxiv.org/abs/2505.17848v2",
    "pdf_url": "https://arxiv.org/pdf/2505.17848v2.pdf",
    "title": "The NEXT-100 Detector",
    "abstract": "The NEXT collaboration is dedicated to the study of double beta decays of $^{136}$Xe using a high-pressure gas electroluminescent time projection chamber. This advanced technology combines exceptional energy resolution ($\\leq 1\\%$ FWHM at the $Q_{ββ}$ value of the neutrinoless double beta decay) and powerful topological event discrimination. Building on the achievements of the NEXT-White detector, the NEXT-100 detector started taking data at the Laboratorio Subterráneo de Canfranc (LSC) in May of 2024. Designed to operate with xenon gas at 13.5 bar, NEXT-100 consists of a time projection chamber where the energy and the spatial pattern of the ionising particles in the detector are precisely retrieved using two sensor planes (one with photo-multiplier tubes and the other with silicon photo-multipliers). The detector has been operating at stable conditions using argon and xenon gases at $\\sim$4 bar and drift fields of 74 V/cm and 118 V/cm, respectively. Alpha decays from the $^{222}$Rn chain have been used to test and monitor the stability of the detector, showing a constant electron lifetime in the drift volume. In this paper, in addition to reporting the results of the commissioning run, we provide a detailed description of the NEXT-100 detector, describe its assembly, and present the current estimation of the radiopurity budget.",
    "authors": [
      "NEXT Collaboration",
      "C. Adams",
      "H. Almazán",
      "V. Álvarez",
      "A. I. Aranburu",
      "L. Arazi",
      "I. J. Arnquist",
      "F. Auria-Luna",
      "S. Ayet",
      "Y. Ayyad",
      "C. D. R. Azevedo",
      "K. Bailey",
      "F. Ballester",
      "J. E. Barcelon",
      "M. del Barrio-Torregrosa",
      "A. Bayo",
      "J. M. Benlloch-Rodríguez",
      "F. I. G. M. Borges",
      "A. Brodoline",
      "N. Byrnes",
      "A. Castillo",
      "E. Church",
      "L. Cid",
      "M. Cid",
      "X. Cid",
      "C. A. N. Conde",
      "C. Cortes-Parra",
      "F. P. Cossío",
      "R. Coupe",
      "E. Dey",
      "P. Dietz",
      "C. Echeverria",
      "M. Elorza",
      "R. Esteve",
      "R. Felkai",
      "L. M. P. Fernandes",
      "P. Ferrario",
      "F. W. Foss",
      "Z. Freixa",
      "J. García-Barrena",
      "J. J. Gómez-Cadenas",
      "J. W. R. Grocott",
      "R. Guenette",
      "J. Hauptman",
      "C. A. O. Henriques",
      "J. A. Hernando Morata",
      "P. Herrero-Gómez",
      "V. Herrero",
      "C. Hervés Carrete",
      "Y. Ifergan",
      "A. F. B. Isabel",
      "B. J. P. Jones",
      "F. Kellerer",
      "L. Larizgoitia",
      "A. Larumbe",
      "P. Lebrun",
      "F. Lopez",
      "N. López-March",
      "R. Madigan",
      "R. D. P. Mano",
      "A. Marauri",
      "A. P. Marques",
      "J. Martín-Albo",
      "A. Martínez",
      "G. Martínez-Lema",
      "M. Martínez-Vara",
      "R. L. Miller",
      "K. Mistry",
      "J. Molina-Canteras",
      "F. Monrabal",
      "C. M. B. Monteiro",
      "F. J. Mora",
      "K. E. Navarro",
      "P. Novella",
      "D. R. Nygren",
      "E. Oblak",
      "I. Osborne",
      "J. Palacio",
      "B. Palmeiro",
      "A. Para",
      "I. Parmaksiz",
      "A. Pazos",
      "J. Pelegrin",
      "M. Pérez Maneiro",
      "M. Querol",
      "J. Renner",
      "I. Rivilla",
      "C. Rogero",
      "L. Rogers",
      "B. Romeo",
      "C. Romo-Luque",
      "E. Ruiz-Chóliz",
      "P. Saharia",
      "F. P. Santos",
      "J. M. F. dos Santos",
      "M. Seemann",
      "I. Shomroni",
      "A. L. M. Silva",
      "P. A. O. C. Silva",
      "A. Simón",
      "S. R. Soleti",
      "M. Sorel",
      "J. Soto-Oton",
      "J. M. R. Teixeira",
      "S. Teruel-Pardo",
      "J. F. Toledo",
      "C. Tonnelé",
      "S. Torelli",
      "J. Torrent",
      "A. Trettin",
      "P. R. G. Valle",
      "M. Vanga",
      "P. Vázquez Cabaleiro",
      "J. F. C. A. Veloso",
      "J. D. Villamil",
      "J. Waiton",
      "A. Yubero-Navarro"
    ],
    "published": "2025-05-23T13:00:57Z",
    "updated": "2025-12-10T14:07:53Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.09647v1",
    "url": "https://arxiv.org/abs/2512.09647v1",
    "pdf_url": "https://arxiv.org/pdf/2512.09647v1.pdf",
    "title": "Time Served",
    "abstract": "The following document provides a comprehensive look into the past, present, and future of Timing at Fermilab. By including historical context with technical implementation, this document seeks to help the reader gain a broader understanding of the facility and the mechanisms that enable the operation of Fermilab's accelerators",
    "authors": [
      "Evan Milton",
      "Mark Austin",
      "Dan McArthur"
    ],
    "published": "2025-12-10T13:40:48Z",
    "updated": "2025-12-10T13:40:48Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.09600v1",
    "url": "https://arxiv.org/abs/2512.09600v1",
    "pdf_url": "https://arxiv.org/pdf/2512.09600v1.pdf",
    "title": "Advanced microwave SQUID multiplexer model incorporating readout power effects and Josephson junction inhomogeneities",
    "abstract": "We present an advanced model for describing the readout power dependence of the resonance characteristics of a microwave SQUID multiplexer. Our model proves valid for SQUID screening parameters up to $β_\\mathrm{L}<1$, hence covering the full range of practically relevant design parameters. We demonstrate that our model significantly improves agreement with experimental data compared to the existing models, thereby enabling optimization beyond the previously accessible parameter space. Moreover, our model supports non-sinusoidal current-phase relations of the rf-SQUID's Josephson junction, allowing, for the first time, for the modeling of devices based on Josephson tunnel junctions with inhomogeneous tunnel barriers. We show that the effects of such inhomogeneities are qualitatively similar to, yet distinct from, those of the screening parameter, making their inclusion essential for accurate characterization. Incorporating these effects yields great improved agreement with measurements, even at readout power conditions well beyond typical operating parameters.",
    "authors": [
      "Martin Neidig",
      "Mathias Wegner",
      "Sebastian Kempf"
    ],
    "published": "2025-12-10T12:48:11Z",
    "updated": "2025-12-10T12:48:11Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.supr-con"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.00826v3",
    "url": "https://arxiv.org/abs/2510.00826v3",
    "pdf_url": "https://arxiv.org/pdf/2510.00826v3.pdf",
    "title": "Diffraction by Circular and Triangular Apertures as a Diagnostic Tool of Twisted Matter Waves",
    "abstract": "We study diffraction of twisted matter waves (electrons and light ions carrying orbital angular momentum $\\ell/\\hbar=0,\\pm1,\\pm2,\\ldots$ by circular and triangular apertures. Within the scalar Kirchhoff-Fresnel framework, circular apertures preserve cylindrical symmetry and produce ringlike far-field profiles whose radii and widths depend on $|\\ell|$ but are insensitive to its sign. In contrast, equilateral triangles break axial symmetry and yield structured patterns that encode both the magnitude and the sign of $\\ell$. A transparent Fraunhofer mapping links detector coordinates to the Fourier plane, explaining the $(|\\ell|+1)$-lobe rule and the sign-dependent rotation of the pattern. We validate these results for both ideal Bessel beams and localized Laguerre-Gaussian packets, and we cross-check them by split-step Fourier propagation of the time-dependent Schr\"odinger equation. From these analyses we extract practical design rules (Fraunhofer distance, lattice pitch, detector sampling) relevant to OAM diagnostics with moderately relativistic electrons with $E_{\\rm kin}\\sim0.1$ to $5$ MeV and light ions with $E_{\\rm kin}\\sim0.1$ to $1$ MeV/u. Our results establish triangular diffraction as a simple, passive, and robust method for reading out the OAM content of structured quantum beams.",
    "authors": [
      "Maksim Maksimov",
      "Nikita Borodin",
      "Daria Kargina",
      "Dmitry Naumov",
      "Dmitry Karlovets"
    ],
    "published": "2025-10-01T12:37:17Z",
    "updated": "2025-12-10T12:01:55Z",
    "categories": [
      "quant-ph",
      "hep-ph",
      "physics.acc-ph"
    ],
    "primary_category": "quant-ph",
    "doi": "10.1103/z2rs-2ryl"
  },
  {
    "arxiv_id": "2512.09536v1",
    "url": "https://arxiv.org/abs/2512.09536v1",
    "pdf_url": "https://arxiv.org/pdf/2512.09536v1.pdf",
    "title": "Ultimate large-$Rm$ regime of the solar dynamo",
    "abstract": "For more than fourty years, the quest to understand how large-scale magnetic fields emerge from turbulent flows in rotating astrophysical systems, such as the Sun, has been a major thread of computational astrophysics research. Using a parameter scan and phenomenological analysis of maximally-simplified three-dimensional cartesian magnetohydrodynamic simulations of large-scale nonlinear helical turbulent dynamos, I present results in this Letter that strongly point to an asymptotic ultimate regime of the large-scale solar dynamo, at large magnetic Reynolds numbers $Rm$, involving helicity fluxes between hemispheres. I obtained corresponding numerical solutions at both $Pm>1$ and $Pm<1$, and show that they can currently only be achieved in clean, simplified numerical setups. The analysis further strongly suggests that all global simulations to date lie in a non-asymptotic turbulent MHD regimes highly sensitive to changes in kinetic and magnetic Reynolds numbers. Ideas are presented to attempt to reach this ultimate regime in such \"realistic\" global spherical models at a reasonable numerical cost. Overall, the results clarify the current state, and some hard limitations of the brute-force numerical modelling approach applied to this, and other similar astrophysical turbulence problems.",
    "authors": [
      "François Rincon"
    ],
    "published": "2025-12-10T11:22:28Z",
    "updated": "2025-12-10T11:22:28Z",
    "categories": [
      "astro-ph.SR",
      "astro-ph.GA",
      "physics.flu-dyn",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2512.09482v1",
    "url": "https://arxiv.org/abs/2512.09482v1",
    "pdf_url": "https://arxiv.org/pdf/2512.09482v1.pdf",
    "title": "Commissioning of a mobile neutron spectrometer for LNGS",
    "abstract": "Environmental neutrons are a source of background for rare event searches in underground laboratories. Since the majority of the neutron background comes from the cavern walls due to the intrinsic radioactivity of concrete and rock, the flux is known to be time and location dependent. Therefore, a precise knowledge of the spectrum and of the total flux is needed to devise shielding and veto mechanisms for rare event searches. Here ALMOND (An LNGS Mobile Neutron Detector) is presented. It is a mobile neutron spectrometer, based on capture-gated spectroscopy and comprised of an array of plastic scintillator bars wrapped with gadolinium foils. The detector has been calibrated with Americium-Beryllium source at Karlsruhe Institute of Technology and with an Americium-Boron source and a D-D generator at ENEA Frascati. The results of the neutron calibration with the time of flight method and the D-D generator are shown here, alongside the first results on capture time profile. Moreover, the first results from the neutron background run in Hall A at LNGS are presented.",
    "authors": [
      "Francesco Pompa",
      "Klaus Eitel",
      "Alfredo Davide Ferella",
      "Felix Kratzmeier",
      "Melih Solmaz",
      "Kathrin Valerius"
    ],
    "published": "2025-12-10T09:59:58Z",
    "updated": "2025-12-10T09:59:58Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.09454v1",
    "url": "https://arxiv.org/abs/2512.09454v1",
    "pdf_url": "https://arxiv.org/pdf/2512.09454v1.pdf",
    "title": "Dynamics of an impulse dielectric barrier discharge in pure ammonia gas using electrical characteristics and imaging analysis",
    "abstract": "A glow nanosecond discharge from a plane-to-plane impulse dielectric barrier discharge (iDBD) with ammonia gas has been characterised by employing fast imaging and electrical diagnostics. More precisely, the aim of this study is to investigate the dynamics of the discharge establishment under various conditions of applied voltage, pressure, and gas gap. The comparison between the current measurements and the image analysis exposes a strong correlation between the fast excitation and ionization wave velocity and the rising current velocity. This correlation has been found only for diffuse mode discharge since a front wave could be clearly defined, denoted as the luminous propagation front (LPF). Furthermore, this correlation is supported by a proportionality factor of 1.5 10$^{-3}$ which is systematic over the studied conditions. Further investigations are considered to evaluate the relevance of such a value over more parameters.",
    "authors": [
      "Ronny Jean-Marie-Desiree",
      "Aymane Najah",
      "Ludovic De Poucques",
      "Stephane Cuynet"
    ],
    "published": "2025-12-10T09:25:53Z",
    "updated": "2025-12-10T09:25:53Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.13946v2",
    "url": "https://arxiv.org/abs/2510.13946v2",
    "pdf_url": "https://arxiv.org/pdf/2510.13946v2.pdf",
    "title": "Bell Instability and Cosmic-Ray Acceleration in AGN Ultrafast Outflow Shocks",
    "abstract": "We investigate magnetic-field amplification driven by the nonresonant hybrid (NRH or Bell) instability and its impact on cosmic-ray (CR) acceleration at reverse shocks of ultrafast outflows (UFOs) from active galactic nuclei (AGN). Previous kinetic studies by particle-in-cell simulations have demonstrated that when maximum CR energy is near the injection scale, NRH instability efficiently amplifies magnetic field up to the saturation level. However, the efficiency of NRH instability goes down as maximum energy increase since CR current is carried by escaping CRs near the maximum energy. We employ a one-dimensional MHD--CR framework solving telegraph-type diffusion--convection equations to trace the coupled evolution of CRs, magnetic fields, and shock dynamics under realistic parameters. We find a distinct transition with magnetic field strength: for weak background fields ($B_{0}\\!\\lesssim\\!10^{-4}\\,\\mathrm{G}$), NRH instability efficiently amplifies upstream turbulence, driving a self-regulated state where $E_{\\max}$ becomes independent of initial strength of magnetic turbulence. In contrast, for stronger background fields ($B_{0}\\!\\gtrsim\\!10^{-3}\\,\\mathrm{G}$), the escaping CR current is too weak to drive NRH instability, and magnetic turbulence further decays through parametric instabilities, potentially reducing the acceleration efficiency. We give the physical interpretation for the transition and discuss conditions for PeV--EeV acceleration at UFO reverse shocks.",
    "authors": [
      "Rei Nishiura",
      "Tsuyoshi Inoue"
    ],
    "published": "2025-10-15T18:00:00Z",
    "updated": "2025-12-10T08:50:43Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2512.04669v2",
    "url": "https://arxiv.org/abs/2512.04669v2",
    "pdf_url": "https://arxiv.org/pdf/2512.04669v2.pdf",
    "title": "Progress towards a microchannel plate detector with AlGaN photocathode and cross-strip anode for ultraviolet astronomy",
    "abstract": "Microchannel plates (MCPs) were the driving detector technology for ultraviolet (UV) astronomy over many years, and still today MCP-based detectors are the baseline for several planned UV instruments. The development of advanced MCP detectors is ongoing and pursues the major goals of maximizing sensitivity, resolution, and lifetime, while at the same time decreasing weight, volume, and power consumption.   Development efforts for an MCP-based detector system for the UV are running at IAAT at the University of Tübingen. In this publication, we present our latest results towards coating aluminum gallium nitride (AlGaN) photocathodes directly on MCPs, to improve quantum detection efficiency in the far- and extreme-UV. Furthermore, we report on the implementation of a non-iterative centroiding algorithm for our coplanar cross-strip anode directly in an FPGA.",
    "authors": [
      "S. Diebold",
      "J. Barnstedt",
      "L. Conti",
      "H. R. Elsener",
      "L. Hanke",
      "M. Höltzli",
      "C. Kalkuhl",
      "D. Rau",
      "D. Schaadt",
      "T. Schanz",
      "B. Stelzer",
      "K. Werner"
    ],
    "published": "2025-12-04T11:03:00Z",
    "updated": "2025-12-10T08:46:15Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM",
    "doi": "10.1117/1.JATIS.11.4.042230"
  },
  {
    "arxiv_id": "2512.09399v1",
    "url": "https://arxiv.org/abs/2512.09399v1",
    "pdf_url": "https://arxiv.org/pdf/2512.09399v1.pdf",
    "title": "Stochastic Cooling Enhanced Steady-State Microbunching",
    "abstract": "In this paper, we propose to combine two promising research topics in accelerator physics, i.e., optical stochastic cooling (OSC) and steady-state microbunching (SSMB). Our study shows that such an OSC-SSMB storage ring with a circumference of 50 m and beam energy of several hundred MeVs using present technology can deliver kilowatt radiation at 100 nm wavelength. A more ambitious application of OSC in an SSMB ring can push the radiation wavelength to an even shorter wavelength, such as EUV and soft X-ray. Such a powerful compact light source could benefit fundamental science research and industry applications.",
    "authors": [
      "Xiujie Deng"
    ],
    "published": "2025-12-10T07:53:28Z",
    "updated": "2025-12-10T07:53:28Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.09334v1",
    "url": "https://arxiv.org/abs/2512.09334v1",
    "pdf_url": "https://arxiv.org/pdf/2512.09334v1.pdf",
    "title": "A Propagator-based Multi-level Monte Carlo Method for Kinetic Neutral Species in Edge Plasmas",
    "abstract": "We propose and investigate a new multi-level Monte Carlo scheme for numerical solutions of the kinetic Boltzmann equation for neutral species in edge plasmas. In particular, this method explicitly exploits a key structural property of neutral particle dynamics: the prevalence of frequent collisions for which the outgoing velocity is determined by local plasma parameters. Using this property, we derive a multi-level algorithm based on collision event propagator and show, both analytically and through numerical experiments, that it reproduces the results of standard Monte Carlo methods. We further demonstrate that, in the context of coupled plasma-neutral edge simulations employing correlated Monte Carlo, the proposed scheme retains trajectory correlation to machine precision as the system evolves, whereas conventional methods exhibit rapid decorrelation. These results indicate that the propagator-based multi-level Monte Carlo scheme is a promising candidate for use in fully implicit Jacobian-free Newton-Krylov (JFNK) solvers for coupled plasma-neutral systems.",
    "authors": [
      "Gregory J. Parker",
      "Maxim V. Umansky",
      "Benjamin D. Dudson"
    ],
    "published": "2025-12-10T05:41:20Z",
    "updated": "2025-12-10T05:41:20Z",
    "categories": [
      "physics.plasm-ph",
      "math.NA",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2504.19789v3",
    "url": "https://arxiv.org/abs/2504.19789v3",
    "pdf_url": "https://arxiv.org/pdf/2504.19789v3.pdf",
    "title": "Quasi-monoenergetic Deuteron Acceleration via Boosted Coulomb Explosion by Reflected Picosecond Laser Pulse",
    "abstract": "Generation of quasi-monoenergetic ions by intense laser is one of long-standing goals in laser-plasma physics. However, existing laser-driven ion acceleration schemes often produce broad energy spectra and limited control over ion species. Here we propose the acceleration mechanism, boosted Coulomb explosion, initiated by a standing wave, which is formed in a pre-expanded plasma by the interference between a continuously incoming main laser pulse and the pulse reflected by a solid target, where the pre-expanded plasma is formed from a thin layer on the solid target by a relatively strong pre-pulse. This mechanism produces a persistent Coulomb field on the target front side with field strengths on the order of TV/m for picoseconds. We experimentally demonstrate generation of quasi-monoenergetic deuterons up to 50 MeV using an in-situ D$_2$O-deposited target. Our results show that the peak energy can be tuned by the laser pulse duration.",
    "authors": [
      "Tianyun Wei",
      "Zechen Lan",
      "Yasunobu Arikawa",
      "Yanjun Gu",
      "Takehito Hayakawa",
      "Alessio Morace",
      "Ryuya Yamada",
      "Kohei Yamanoi",
      "Koichi Honda",
      "Masaki Kando",
      "Nakanii Nobuhiko",
      "Seyed Reza Mirfayzi",
      "Sergei V. Bulanov",
      "Akifumi Yogo"
    ],
    "published": "2025-04-28T13:33:10Z",
    "updated": "2025-12-10T04:38:49Z",
    "categories": [
      "physics.plasm-ph",
      "hep-ex"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.17710v2",
    "url": "https://arxiv.org/abs/2511.17710v2",
    "pdf_url": "https://arxiv.org/pdf/2511.17710v2.pdf",
    "title": "Entity -- Hardware-agnostic Particle-in-Cell Code for Plasma Astrophysics. I: Curvilinear Special Relativistic Module",
    "abstract": "Entity is a new-generation, fully open-source particle-in-cell (PIC) code developed to overcome key limitations in astrophysical plasma modeling, particularly the extreme separation of scales and the performance challenges associated with evolving, GPU-centric computing infrastructures. It achieves hardware-agnostic performance portability across various GPU and CPU architectures using the Kokkos library. Crucially, Entity maintains a high standard for usability, clarity, and customizability, offering a robust and easy-to-use framework for developing new algorithms and grid geometries, which allows extensive control without requiring edits to the core source code. This paper details the core general-coordinate special-relativistic module. Entity is the first PIC code designed to solve the Vlasov-Maxwell system in general coordinates, enabling a coordinate-agnostic framework that provides the foundational structure for straightforward extension to arbitrary coordinate geometries. The core methodology achieves numerical stability by solving particle equations of motion in the global orthonormal Cartesian basis, despite using generalized coordinates like Cartesian, axisymmetric spherical, and quasi-spherical grids. Charge conservation is ensured via a specialized current deposition technique using conformal currents. The code exhibits robust scalability and performance portability on major GPU platforms (AMD MI250X, NVIDIA A100, and Intel Max Series), with the 3D particle pusher and the current deposition operating efficiently at about 2 nanoseconds per particle per timestep. Functionality is validated through a comprehensive suite of standard Cartesian plasma tests and the accurate modeling of relativistic magnetospheres in curvilinear axisymmetric geometries.",
    "authors": [
      "Hayk Hakobyan",
      "Ludwig M. Böss",
      "Yangyang Cai",
      "Alexander Chernoglazov",
      "Alisa Galishnikova",
      "Evgeny A. Gorbunov",
      "Jens F. Mahlmann",
      "Alexander Philippov",
      "Siddhant Solanki",
      "Arno Vanthieghem",
      "Muni Zhou"
    ],
    "published": "2025-11-21T19:01:46Z",
    "updated": "2025-12-10T04:14:39Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  }
]