{
  "arxiv_id": "2507.18226v1",
  "url": "https://arxiv.org/abs/2507.18226v1",
  "pdf_url": "https://arxiv.org/pdf/2507.18226v1.pdf",
  "title": "Advanced Ceramic Plasma Discharge Capillaries for high repetition rate   operation",
  "abstract": "In view of future applications of plasma-based particle accelerators, within the fields of high-energy physics and new light sources, the capability of plasma sources to operate at high repetition rates is crucial. In particular for gas-filled plasma discharge capillaries, which allow direct control over plasma properties, a key aspect is the longevity of the material, subject to erosion due to the heat flux delivered by high voltage plasma discharges. In this regard, we present an innovative design of discharge capillaries based on the use of different ceramic materials, which can sustain high voltage plasma discharges at high repetition rate and, moreover, be easily machined for the complex geometries required for plasma-based accelerators. Experimental campaigns are carried out at 10-150 Hz, assessing the longevity of ceramic capillaries by means of different diagnostic techniques. In addition, numerical simulations are performed to analyze the heat transfer within the whole plasma source. Results from experimental and numerical analysis highlight the capability of ceramic capillaries to preserve plasma properties and the integrity of the source during long-term plasma discharge operation at high repetition rate. In particular, we demonstrated the suitability of the proposed solution for the operative range of 100-400 Hz, foreseen for EuPRAXIA@SPARC_LAB project.",
  "authors": [
    "Lucio Crincoli",
    "Romain Demitra",
    "Valerio Lollo",
    "Donato Pellegrini",
    "Marco Pitti",
    "Lucilla Pronti",
    "Martina Romani",
    "Massimo Ferrario",
    "Angelo Biagioni"
  ],
  "published": "2025-07-24T09:19:16Z",
  "updated": "2025-07-24T09:19:16Z",
  "categories": [
    "physics.acc-ph",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.acc-ph",
  "doi": "10.1038/s41598-025-96882-y"
}