[
  {
    "arxiv_id": "2502.10740v3",
    "url": "https://arxiv.org/abs/2502.10740v3",
    "pdf_url": "https://arxiv.org/pdf/2502.10740v3.pdf",
    "title": "Commissioning of a radiofrequency quadrupole cooler-buncher for   collinear laser spectroscopy",
    "abstract": "A RadioFrequency Quadrupole (RFQ) cooler-buncher system has been developed and implemented in a collinear laser spectroscopy setup. This system is dedicated to convert a continuous ion beam into short bunches, while enhancing beam quality and reducing energy spread. The functionality of the RFQ cooler-buncher has been verified through offline tests with stable rubidium and indium beam, delivered from a surface ion source and a laser ablation ion source, respectively. With a transmission efficiency exceeding 60\\%, bunched ion beams with a full width at half maximum of approximately 2~$\\mu$s in the time-of-flight spectrum have been successfully achieved. The implementation of the RFQ cooler-buncher system also significantly improves the overall transmission efficiency of the collinear laser spectroscopy setup.",
    "authors": [
      "Yin-Shen Liu",
      "Han-Rui Hu",
      "Xiao-Fei Yang",
      "Wen-Cong Mei",
      "Yang-Fan Guo",
      "Zhou Yan",
      "Shao-Jie Chen",
      "Shi-wei Bai",
      "Shu-Jing Wang",
      "Yong-Chao Liu",
      "Peng Zhang",
      "Dong-Yang Chen",
      "Yan-Lin Ye",
      "Qi-Te Li",
      "Jie Yang",
      "Stephan Malbrunot-Ettenauer",
      "Simon Lechner",
      "Carina Kanitz"
    ],
    "published": "2025-02-15T09:45:32Z",
    "updated": "2025-07-24T14:23:01Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex",
      "physics.acc-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.18310v1",
    "url": "https://arxiv.org/abs/2507.18310v1",
    "pdf_url": "https://arxiv.org/pdf/2507.18310v1.pdf",
    "title": "Modelling Tritium Production and Release at High-Energy Proton   Accelerators",
    "abstract": "Tritium is a well-known byproduct of particle accelerator operations. To keep levels of tritium below regulatory limits, tritium production is actively monitored and managed at Fermilab. We plan to study tritium production in the targets, beamline components, and shielding elements of the Fermilab facilities such as NuMI, BNB, and MI-65. To facilitate the analysis, we construct a simple model and use three Monte Carlo radiation codes, FLUKA, MARS, and PHITS, to estimate the amount of tritium produced in these facilities. The analysis could also serve as an intercomparison between these code results related to tritium production. To assess the actual amounts of tritium that would be released from various materials, we employ a semi-empirical diffusion model. The results of this analysis are compared to experimental data whenever possible. This approach also helps to optimize proposed target materials with respect to the tritium production and release.",
    "authors": [
      "Dali Georgobiani",
      "Thomas Ginter",
      "Alajos Makovec",
      "Igor Rakhno",
      "Matthew Strait",
      "Igor Tropin"
    ],
    "published": "2025-07-24T11:27:13Z",
    "updated": "2025-07-24T11:27:13Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.18226v1",
    "url": "https://arxiv.org/abs/2507.18226v1",
    "pdf_url": "https://arxiv.org/pdf/2507.18226v1.pdf",
    "title": "Advanced Ceramic Plasma Discharge Capillaries for high repetition rate   operation",
    "abstract": "In view of future applications of plasma-based particle accelerators, within the fields of high-energy physics and new light sources, the capability of plasma sources to operate at high repetition rates is crucial. In particular for gas-filled plasma discharge capillaries, which allow direct control over plasma properties, a key aspect is the longevity of the material, subject to erosion due to the heat flux delivered by high voltage plasma discharges. In this regard, we present an innovative design of discharge capillaries based on the use of different ceramic materials, which can sustain high voltage plasma discharges at high repetition rate and, moreover, be easily machined for the complex geometries required for plasma-based accelerators. Experimental campaigns are carried out at 10-150 Hz, assessing the longevity of ceramic capillaries by means of different diagnostic techniques. In addition, numerical simulations are performed to analyze the heat transfer within the whole plasma source. Results from experimental and numerical analysis highlight the capability of ceramic capillaries to preserve plasma properties and the integrity of the source during long-term plasma discharge operation at high repetition rate. In particular, we demonstrated the suitability of the proposed solution for the operative range of 100-400 Hz, foreseen for EuPRAXIA@SPARC_LAB project.",
    "authors": [
      "Lucio Crincoli",
      "Romain Demitra",
      "Valerio Lollo",
      "Donato Pellegrini",
      "Marco Pitti",
      "Lucilla Pronti",
      "Martina Romani",
      "Massimo Ferrario",
      "Angelo Biagioni"
    ],
    "published": "2025-07-24T09:19:16Z",
    "updated": "2025-07-24T09:19:16Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.1038/s41598-025-96882-y"
  }
]