{
  "arxiv_id": "2507.12495v2",
  "url": "https://arxiv.org/abs/2507.12495v2",
  "pdf_url": "https://arxiv.org/pdf/2507.12495v2.pdf",
  "title": "Assessing the economic benefits of space weather mitigation investment decisions: Evidence from Aotearoa New Zealand",
  "abstract": "Space weather events pose a growing threat to modern economies, yet their macroeconomic consequences still remain underexplored. This study presents the first dedicated economic assessment of geomagnetic storm impacts on Aotearoa New Zealand, quantifying potential gross domestic product (GDP) losses across seven conservative disruption and mitigation scenarios due to an extreme coronal mass ejection (CME). The primary focus is upon the damaging impacts of geomagnetically induced currents (GICs) on the electrical power transmission network. We support space weather mitigation investments decisions by providing a first-order approximation of their potential economic benefits, using best-in-class scientific models. In the absence of mitigation, a severe but realistic storm could result in up to NZ\\$8.36 billion in lost GDP, with more than half stemming from cascading supply chain effects. Yet, even less severe scenarios incur losses exceeding NZ\\$3 billion. Importantly, even with conservative impact estimates we find that research-led operational strategies, such as optimized switching and islanding, can avoid up to NZ\\$370 million in losses for as little as NZ\\$0.5 million in expenditure, delivering a benefit-cost ratio of 740 to 1. Equally, physical protections such as GIC blocking devices achieve benefit-cost returns up to 80 to 1, highlighting the strong case for investment in space weather mitigation. When also acknowledging additional unmodelled impacts, including multi-billion losses in capital equipment and long-term revenue, the economic rationale for pre-emptive mitigation becomes even more pertinent. Future research needs to integrate the modelling of capital and revenue losses for strategically important industrial facilities.",
  "authors": [
    "Edward J. Oughton",
    "Andrew Renton",
    "Daniel Mac Marnus",
    "Dennies Bor",
    "Craig J. Rodger"
  ],
  "published": "2025-07-15T21:01:40Z",
  "updated": "2025-12-27T15:46:56Z",
  "categories": [
    "physics.geo-ph",
    "eess.SY",
    "physics.plasm-ph",
    "physics.soc-ph",
    "physics.space-ph"
  ],
  "primary_category": "physics.geo-ph"
}