{
  "arxiv_id": "2512.22292v1",
  "url": "https://arxiv.org/abs/2512.22292v1",
  "pdf_url": "https://arxiv.org/pdf/2512.22292v1.pdf",
  "title": "Quantitative acoustic monitoring of ensembles of weakly nonlinear microbubble oscillations in optically inaccessible environments",
  "abstract": "A growing class of ultrasound-mediated diagnostic and therapeutic technologies, including sonoporation and blood-brain barrier modulation, relies on microbubble contrast agents, where precise control of microbubble dynamics governs biological responses, efficiency, and safety. However, quantitative monitoring of microbubble oscillations in the stable, weakly nonlinear regime remains challenging, particularly in optically opaque and deep-tissue environments. Here, we introduce a linear acoustic wave propagation and superposition (LAWPS) framework that reconstructs microbubble radius-time dynamics directly from passively recorded acoustic emissions. By coupling Fourier-series representations of weakly nonlinear oscillations with linear monopole radiation theory, LAWPS extends classical monopole models to establish a reversible relationship between multi-frequency acoustic emissions and underlying radial bubble dynamics. Extending this framework to monodisperse microbubble ensembles, we derive optimal excitation and receive configurations and population-level correction factors that enable quantitative reconstruction of the ensemble-averaged microbubble dynamics. Using simultaneous optical and acoustic measurements, we demonstrate recovery of microbubble oscillations with ~5% relative error for oscillation amplitudes up to ~15% of equilibrium radius. Finally, we show that oscillations within the framework's operating regime (20% oscillation) generate sonoporation-relevant mechanical stress in vesicles as small as 10 micrometers (capillary number > 0.01), under physiologically relevant conditions. Together, this work establishes a quantitative framework for acoustic emission-based monitoring of weakly nonlinear microbubble oscillations in clinically relevant, optically inaccessible environments to enable improved control of emerging ultrasound diagnostic and therapeutic technologies.",
  "authors": [
    "Hohyun Lee",
    "Reza Pakdaman Zangabad",
    "Chulyong Kim",
    "Victor Menezes",
    "Juyoung Park",
    "F. Levent Degertekin",
    "Costas Arvanitis"
  ],
  "published": "2025-12-25T15:57:30Z",
  "updated": "2025-12-25T15:57:30Z",
  "categories": [
    "physics.ins-det",
    "physics.med-ph"
  ],
  "primary_category": "physics.ins-det"
}