{
  "arxiv_id": "2512.20947v1",
  "url": "https://arxiv.org/abs/2512.20947v1",
  "pdf_url": "https://arxiv.org/pdf/2512.20947v1.pdf",
  "title": "The throttling refrigeration system for the large cooling power recovery of the PandaX-xT cryogenic distillation system for radon removal",
  "abstract": "In order to solve the continuous large cooling power supply problem (20 kW) for the radon-removal cryogenic distillation system, which operates at high liquid ffow rate of 856 kg/h (5 LPM) for the dark matter detector PandaX-xT of the next-generation, a throttling refrigeration system based on carbon tetraffuoride (R14) refrigerant for cooling power recovery is designed and developed. According to this system, the cooling power of the liquid xenon in the reboiler of 178K could be transferred to the product xenon cryostat to liquefy the gaseous product xenon by the R14 circulation, thus the liqueffed xenon could return to the detector with the same condition of which extracted from the detector to form a stable cooling cycle and prevent the instability of the detector. A research and development experiment is implemented to validate the feasibility of this large cooling recovery system, using the ethanol to simulate the liquid xenon. Experimental results show that the cooling power recovery of this system could achieve 17 kW with the efffciency of 76.5%, and the R14 ffow rate is 0.16 kg/s. This study realizes the online radon removal distillation with large ffow rate while eliminating the dependence of liquid nitrogen or cryocoolers, which means saving 2414 m3 liquid nitrogen per year or the power consumption of 230 kW. Furthermore, process simulation and optimization of the throttling refrigeration cycle is studied using Aspen Hysys to reveal the inffuences of the key parameters to the system, and the deviation between the simulation and experimental results is < 2.52%.",
  "authors": [
    "Shunyu Yao",
    "Zhou Wang",
    "Kangkang Zhao",
    "Zhi Zheng",
    "Haoyu Wang",
    "Xiangyi Cui",
    "Tao Zhang",
    "Li Zhao",
    "Huaikuang Ding",
    "Wenbing Tao",
    "Xiang Xiao",
    "Shaobo Wang",
    "Yonglin Ju",
    "Jianglai Liu",
    "Xiangdong Ji",
    "Shuaijie Li",
    "Manbin Shen",
    "Chengbo Du"
  ],
  "published": "2025-12-24T05:06:47Z",
  "updated": "2025-12-24T05:06:47Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}