[
  {
    "arxiv_id": "2512.23682v1",
    "url": "https://arxiv.org/abs/2512.23682v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23682v1.pdf",
    "title": "Predicting core transport in ITER baseline discharges with neon injections",
    "abstract": "Achieving self-consistent performance predictions for ITER requires integrated modeling of core transport and divertor power exhaust under realistic impurity conditions. We present results from the first systematic power-flow and impurity-content study for the ITER 15 MA baseline scenario constrained directly by existing SOLPS-ITER neon-seeded divertor solutions. Using the OMFIT STEP workflow, stationary temperature and density profiles are predicted with TGYRO for $1.5 \\le Z_{\\rm eff} \\le 2.5$, and the corresponding power crossing the separatrix $P_{\\rm sep}$ is evaluated. We find that $P_{\\rm sep}$ varies by more than a factor of 1.7 across this scan and matches the $\\sim 100$~MW SOLPS-ITER prediction when $Z_{\\rm eff} \\simeq 1.6$ or when auxiliary heating is reduced to $\\sim 75\\%$ of nominal. Rotation-sensitivity studies show that plausible variations in toroidal flow magnitude modify $P_{\\rm sep}$ by $\\lesssim 20\\%$, while AURORA modeling confirms that charge-exchange radiation inside the separatrix is dynamically negligible under predicted ITER neutral densities. These results identify a restricted compatibility window, $Z_{\\rm eff} \\approx 1.6$--1.75 and $0.75 \\lesssim f_{P_{\\rm aux}} \\le 1.0$, in which core transport predictions remain aligned with neon-seeded divertor protection targets. This self-consistent, model-constrained framework provides actionable guidance for impurity control and auxiliary-heating scheduling in early ITER operation and supports future whole-device scenario optimization.",
    "authors": [
      "Dmitri M Orlov",
      "Joseph McClenaghan",
      "Jeff Candy",
      "Jeremy D Lore",
      "Nathan T Howard",
      "Francesco Sciortino",
      "Christopher Holland"
    ],
    "published": "2025-12-29T18:40:00Z",
    "updated": "2025-12-29T18:40:00Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.23612v1",
    "url": "https://arxiv.org/abs/2512.23612v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23612v1.pdf",
    "title": "High-resolution 3D-printed plastic scintillators with tertiary dye",
    "abstract": "Additive manufacturing offers efficient production of plastic scintillators with nontrivial geometries using vat polymerization, allowing fabrication of geometries which would be difficult or even impossible to produce using conventional subtractive manufacturing. This work presents a novel photocurable scintillator formula that includes coumarin 450 as a tertiary dye to enable high-resolution 3D printing via the manipulation of the 405 nm cure light. Bulk photocured and 3D printed (with and without tertiary dye) samples were compared through observational assessment and spectral response. All samples showed pulse shape discrimination between neutron and gamma events. Inclusion of the tertiary dye has minimal impact on emission spectrum and light output, but significant impact on print resolution as shown by comparison of printed high-complexity geometries and feature resolution test objects. With the use of a cure-limiting dye, unsupported features, such as freestanding pillars, were resolvable down to 0.7 mm. Even finer resolution at or below 0.1 mm was achieved in fully supported, integrated structures printed with off-the-shelf 405 nm desktop 3D printer. Scintillators demonstrated a light output up to 50% of EJ-200 with a PSD figure of merit up to 1.35 at 0.9-1.1 MeVee.",
    "authors": [
      "Chandler Moore",
      "Michael Febbraro",
      "Juan Manfredi",
      "Allen Wood",
      "Daniel Rutstrom",
      "Thomas Ruland",
      "Brennan Hackett",
      "Paul Hausladen"
    ],
    "published": "2025-12-29T17:13:25Z",
    "updated": "2025-12-29T17:13:25Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex",
      "physics.app-ph"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/10/P10043"
  },
  {
    "arxiv_id": "2512.23556v1",
    "url": "https://arxiv.org/abs/2512.23556v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23556v1.pdf",
    "title": "The new generation lunar gravitational wave detectors: sky map resolution and joint analysis",
    "abstract": "Lunar-based gravitational-wave interferometry is a fascinating endeavor, and was proposed as a promising approach to bridge the observational gap between space-borne and ground-based detectors. In this work, we adopt the Fisher-matrix method to examine the angular-resolution performance of the newly proposed Crater Interferometry Gravitational-wave Observatory (CIGO) on the lunar crater rim near the north pole, together with TianQin and LISA, for monochromatic sources in the 0.1-10 Hz band. We find that above 0.1 Hz, CIGO achieves better localization accuracy than the other two space-based missions and dominates the combined detector network's performance, provided that lunar noise mitigation is achieved in the 0.1-2.87 Hz frequency range. We further explore an upgraded Tetrahedron configuration, TCIGO, with a fourth station at the bottom of a crater, which forms a regular tetrahedral constellation on the lunar surface. The result shows that TCIGO yields a five-fold improvement in angular-resolution capability over CIGO and gets better sky coverage across the target frequency band.",
    "authors": [
      "Xiaolin Zhang",
      "Chengye Yu",
      "Haoran Li",
      "Sobhan Kazempour",
      "Mingqiu Li",
      "Sichun Sun"
    ],
    "published": "2025-12-29T15:52:13Z",
    "updated": "2025-12-29T15:52:13Z",
    "categories": [
      "gr-qc",
      "astro-ph.IM",
      "hep-ph",
      "physics.ins-det"
    ],
    "primary_category": "gr-qc"
  },
  {
    "arxiv_id": "2512.23554v1",
    "url": "https://arxiv.org/abs/2512.23554v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23554v1.pdf",
    "title": "An integrated quantitative single-objective light-sheet microscope for subcellular dynamics in embryos and cultured multicellular systems",
    "abstract": "Quantitative imaging of subcellular processes in living embryos, stem-cell systems, and organoid models requires microscopy platforms that combine high spatial resolution, fast volumetric acquisition, long-term stability, and minimal phototoxicity. Single-objective light-sheet approaches based on oblique plane microscopy (OPM) are well suited for live imaging in standard sample geometries, but most existing implementations lack the optical calibration, timing precision, and end-to-end integration required for reproducible quantitative measurements. Here we present a fully integrated and quantitatively characterized OPM platform engineered for dynamic studies of transcription and nuclear organization in embryos, embryonic stem cells, and three-dimensional culture systems. The system combines high numerical aperture remote refocusing with tilt-invariant light-sheet scanning and hardware-timed synchronization of laser excitation, galvo scanning, and camera readout. We provide a comprehensive characterization of the optical performance, including point spread function, sampling geometry, usable field of view, and system stability, establishing a well-defined framework for quantitative volumetric imaging. To support high-throughput operation, we developed a unified acquisition and reconstruction pipeline that enables real time volumetric imaging at hardware-limited rates while preserving deterministic timing and reproducible geometry. Using this platform, we demonstrate quantitative three-dimensional imaging of MS2-labeled transcription sites in living Drosophila embryos, cultured mouse embryonic stem cells, and mESC-derived gastruloids, enabling extraction of transcriptional intensity traces across diverse biological contexts. This work establishes OPM as a robust and quantitatively calibrated single-objective light-sheet platform for transcription imaging in complex living systems.",
    "authors": [
      "Armin Shoushtarizadeh",
      "Michele Cerminara",
      "Corinne Chureau",
      "Leah Friedman",
      "Deepthi Kailash",
      "Thomas Gregor"
    ],
    "published": "2025-12-29T15:50:51Z",
    "updated": "2025-12-29T15:50:51Z",
    "categories": [
      "q-bio.QM",
      "physics.bio-ph",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "q-bio.QM"
  },
  {
    "arxiv_id": "2512.23433v1",
    "url": "https://arxiv.org/abs/2512.23433v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23433v1.pdf",
    "title": "Ab initio recombination in the expanding ultracold plasmas",
    "abstract": "The efficiency of recombination is of crucial importance for the existence of ultracold plasmas, particularly, the ones formed in the magneto-optical traps. Unfortunately, a straightforward simulation of the recombination encounters the problem of huge difference in the spatial and temporal scales for free and bound motion of the electrons. As a result, only the \"virtual\" electron-ion pairs are usually reproduced in such simulations, and it is necessary to employ some additional criteria to identify them with the recombined atoms (this might be a minimal number of revolutions of the electron about the nearest ion or a maximal distance between them). It is the aim of this paper to present the first successful ab initio simulation of the recombination without any auxiliary assumptions. We employed a special algorithm, which was based on: (i) using the \"scalable\" reference frame, co-moving with the expanding plasma, (ii) dynamical choice of the number of \"mirror\" cells, taking into account in calculation of the Coulomb sums, and (iii) accurate treatment of the singular interparticle interactions, without any truncation or \"softening\" of the Coulomb forces. Then, the recombination events are identified by a series of sharp equidistant peaks in the kinetic and/or potential energies for a sample of particles, which are caused by the captured electrons passing near the pericenters of their orbits; and this is confirmed by a detailed inspection of the particle trajectories. Thereby, we were able to trace formation of the real - rather than \"virtual\" - electron-ion pairs. The total efficiency of recombination for the realistic experimental conditions was found to be about 20%, which is in perfect agreement both with the laboratory measurements and with the earlier semi-empirical simulations.",
    "authors": [
      "Yurii V. Dumin",
      "Ludmila M. Svirskaya"
    ],
    "published": "2025-12-29T12:51:53Z",
    "updated": "2025-12-29T12:51:53Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.23230v1",
    "url": "https://arxiv.org/abs/2512.23230v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23230v1.pdf",
    "title": "Axisymmetric magnetic field effects on hollow cathode generated plasma column in APPEL-device",
    "abstract": "An elongated plasma column has been successfully generated and sustained in a linear plasma device using a hollow cathode discharge in the presence of an axisymmetric magnetic field. The confinement of cold energetic electrons produced near the hollow cathode plays a crucial role in guiding the plasma along the device axis. Experimental diagnostics reveal a high concentration of energetic electrons in the peripheral region near the source, which progressively converge toward the axis at a downstream location approximately 3.0 meters from the cathode. The length of the plasma column exhibits an inverse relationship with the electron-neutral collision frequency, indicating the significance of collisional damping in the propagation of energetic electrons. These observations are further supported by fluid simulations performed using COMSOL Multiphysics, which qualitatively reproduce the experimental trends. The results are consistent with a theoretical model previously proposed by the authors, reinforcing the understanding of energetic electron behaviour in magnetically guided plasma columns.",
    "authors": [
      "Y. Patil",
      "S. K. Karkari"
    ],
    "published": "2025-12-29T06:15:40Z",
    "updated": "2025-12-29T06:15:40Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.23114v1",
    "url": "https://arxiv.org/abs/2512.23114v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23114v1.pdf",
    "title": "Breaking seed dormancy in Mediterranean Brassica rapa wild populations: is cold plasma treatment efficient?",
    "abstract": "Turnip (Brassica rapa) is a native species of the Mediterranean area, spread from northwest France to south Algeria. In this study, dormancy and germination traits were assessed for 61 wild Brassica rapa populations collected across the Mediterranean region. Seed dormancy is a key factor influencing germination and seedling establishment. Three dormancy-breaking methods were compared: gibberellic acid, scarification and cold plasma. The efficiency and selectivity were evaluated through germination ability, time to 10% germination (T10), mean germination time and greenhouse emergence. Five days after imbibition, germination was only 18% for the untreated seeds but 60% for the plasma-treated seeds. Germination also began 24 hours earlier and mean germination time was reduced across most populations. However, there was a limited effect on seedling emergence, which remained around 55% for both untreated and treated samples. Comparative analysis indicates that cold plasma was more effective in alleviating embryo dormancy. In addition, histological and scanning electron microscopy showed that the seed coat differed according to the geographical origin of the populations, with a deeper dormancy in seeds from Sicilian populations.",
    "authors": [
      "M. H. Wagner",
      "T. Dufour",
      "A. Geraci",
      "E. Oddo",
      "G. R. Tarantino",
      "F. Scafidi",
      "C. Bailly",
      "H. Hadj Arab",
      "B. Boucenna",
      "M. Tiret",
      "C. Falentin",
      "A. Dupont",
      "S. Ducournau",
      "A. M. Chèvre"
    ],
    "published": "2025-12-28T23:35:41Z",
    "updated": "2025-12-28T23:35:41Z",
    "categories": [
      "physics.plasm-ph",
      "physics.bio-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.15258/sst.2025.53.3.03"
  },
  {
    "arxiv_id": "2512.23072v1",
    "url": "https://arxiv.org/abs/2512.23072v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23072v1.pdf",
    "title": "Thermodynamically Consistent Vibrational-Electron Heating: Generalized Model for Multi-Quantum Transitions",
    "abstract": "Accurate prediction of electron temperature ($T_{\\rm e}$) is critical for non-equilibrium plasma applications ranging from hypersonic flight to plasma-assisted combustion. We recently proposed a thermodynamically consistent model for vibrational-electron heating [Phys. Fluids 37, 096141 (2025)] that enforces the convergence of $T_{\\rm e}$ to the vibrational temperature ($T_{\\rm v}$) at equilibrium. However, the original derivation was restricted to single-quantum transitions, limiting its validity to low-temperature regimes ($T_{\\rm e} \\lesssim 1.5$ eV). In this Letter, we generalize the model to include multi-quantum overtone transitions, extending its applicability to high-energy regimes. We demonstrate that previous models neglecting hot-band transitions incur a systematic heating error of $\\exp(-θ_{\\rm v}/T_{\\rm v})$, where $θ_{\\rm v}$ is the characteristic vibrational temperature. This error exceeds 40\\% when $T_{\\rm v}$ is greater than $θ_{\\rm v}$, effectively preventing thermal relaxation. To correct this, we derive a formulation where the total heating rate is a summation of channel-specific cooling rates $Q_{\\rm e-v}^{(m)}$, each associated with a quantum jump $m$, scaled by a thermodynamic factor $\\exp(mθ_{\\rm v}/T_{\\rm e}-mθ_{\\rm v}/T_{\\rm v})$. This generalized model preserves thermodynamic consistency by ensuring zero net energy transfer at equilibrium.",
    "authors": [
      "Bernard Parent",
      "Felipe Martin Rodriguez Fuented"
    ],
    "published": "2025-12-28T20:34:04Z",
    "updated": "2025-12-28T20:34:04Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.23034v1",
    "url": "https://arxiv.org/abs/2512.23034v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23034v1.pdf",
    "title": "Treatment of sunflower seeds by cold atmospheric plasma enhances their tolerance to water stress during germination and early seedling development",
    "abstract": "The aim of this study was to investigate the impact of ambient air plasma treatment on both sunflower seed germination and early steps of seedling development under water stress. Dry seeds were exposed to a cold atmospheric plasma (CAP) generated in a dielectric barrier device where excited molecular nitrogen and ozone were detected by optical emission spectroscopy and mass spectrometry respectively. Interestingly, we explain the crucial role of gap's accuracy when treating seeds with CAP, especially to improve interaction between seeds and plasma and therefore ensure an efficient treatment. CAP significantly improved the germination rates of seeds of dormant and non-dormant sunflower genotypes under water stress, demonstrating its efficiency in alleviating seed dormancy and in improving germination under suboptimal conditions. Furthermore, greenhouse experiments demonstrated that plasma treatment also stimulated seedling development under water stress conditions. These findings highlight the potential of CAP treatment as an effective approach to promote the whole process of emergence of crop species.",
    "authors": [
      "L. Taras",
      "C. Bailly",
      "T. Dufour"
    ],
    "published": "2025-12-28T18:23:39Z",
    "updated": "2025-12-28T18:23:39Z",
    "categories": [
      "physics.plasm-ph",
      "physics.bio-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1088/1361-6463/ae2ae6"
  },
  {
    "arxiv_id": "2509.14400v4",
    "url": "https://arxiv.org/abs/2509.14400v4",
    "pdf_url": "https://arxiv.org/pdf/2509.14400v4.pdf",
    "title": "Electron Inertia and Magnetic Reconnection",
    "abstract": "When electron inertia is the only non-ideal effect in the evolution of a magnetic field $\\vec{B}$, the field lines of $\\vec{B}$ reconnect, but the lines of a related field $\\vec{\\mathcal{B}}$ do not. $\\vec{\\mathcal{B}} \\equiv \\vec{B} + \\vec{\\nabla}\\times \\left( (c/ω_{pe})^2μ_0\\vec{j} \\right)$ with $ω_{pe}$ the plasma frequency and $\\vec{j}$ the current density. Although a full four-dimensional relativistic calculation of $\\vec{\\mathcal{B}}$ has been made, studies of $\\vec{\\mathcal{B}}$ have been focused on systems that depend on only two spatial coordinates. Three results are given: (1) A relatively simple demonstration in three dimensional space that the lines of $\\vec{\\mathcal{B}}$ do not reconnect when electron inertia is the only non-ideal effect. (2) The guiding center motion of charged particles is modified by a term that is proportional to $(c/ω_{pe})^2$, which is smaller than the drifts proportional to the gyroradius unless the current density is extremely large. (3) In three dimensional space, the evolution velocity of $\\vec{\\mathcal{B}}$ is characteristically chaotic, which means neighboring streamlines separate exponentially on a timescale $τ_u$. $\\vec{\\mathcal{B}}$ undergoes large scale reconnection on a timescale that is only an order of magnitude or two longer than $τ_u$ unless all diffusive non-ideal effects, such as resistivity, are absolutely zero.",
    "authors": [
      "Allen H Boozer"
    ],
    "published": "2025-09-17T20:02:37Z",
    "updated": "2025-12-28T17:01:45Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2503.03103v2",
    "url": "https://arxiv.org/abs/2503.03103v2",
    "pdf_url": "https://arxiv.org/pdf/2503.03103v2.pdf",
    "title": "Fast Jet Tagging with MLP-Mixers on FPGAs",
    "abstract": "We explore the innovative use of MLP-Mixer models for real-time jet tagging and establish their feasibility on resource-constrained hardware like FPGAs. MLP-Mixers excel in processing sequences of jet constituents, achieving state-of-the-art performance on datasets mimicking Large Hadron Collider conditions. By using advanced optimization techniques such as High-Granularity Quantization and Distributed Arithmetic, we achieve unprecedented efficiency. These models match or surpass the accuracy of previous architectures, reduce hardware resource usage by up to 97%, double the throughput, and half the latency. Additionally, non-permutation-invariant architectures enable smart feature prioritization and efficient FPGA deployment, setting a new benchmark for machine learning in real-time data processing at particle colliders.",
    "authors": [
      "Chang Sun",
      "Jennifer Ngadiuba",
      "Maurizio Pierini",
      "Maria Spiropulu"
    ],
    "published": "2025-03-05T01:37:47Z",
    "updated": "2025-12-28T15:01:25Z",
    "categories": [
      "physics.ins-det",
      "cs.LG"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/2632-2153/adf596"
  },
  {
    "arxiv_id": "2512.11290v2",
    "url": "https://arxiv.org/abs/2512.11290v2",
    "pdf_url": "https://arxiv.org/pdf/2512.11290v2.pdf",
    "title": "Charge transport and mode transition in dual-energy electron beam diodes",
    "abstract": "This Letter uncovers five distinct charge transport modes and their transitions in dual-energy electron beam diodes. We via first-principle particle-in-cell (PIC) simulations establish that the specific mode (e.g., space charge oscillations) and the current transport characteristics are essentially governed by the interplay between the electron beam energy and injected current density. A generalized analysis is conducted for n-component electron beams, and a theoretical piecewise function is for the transmitted current density proposed, which agrees well with the PIC results under designed conditions. The discovery provides a mechanistic picture of multiple electron beam transport in diodes, paving the way for novel designs of high-performance modern vacuum electronic devices.",
    "authors": [
      "Chubin Lin",
      "Jiandong Chen",
      "Huihui Wang",
      "Yangyang Fu"
    ],
    "published": "2025-12-12T05:34:30Z",
    "updated": "2025-12-28T11:58:32Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.22811v1",
    "url": "https://arxiv.org/abs/2512.22811v1",
    "pdf_url": "https://arxiv.org/pdf/2512.22811v1.pdf",
    "title": "Plastic inorganic Sn2BiS2I3 semiconductor enabled deformable and flexible electronic tongue for heavy metal detection",
    "abstract": "Deformable and flexible electronics have garnered significant attention due to their distinctive properties; however, their current applications are primarily limited to the thermoelectric domain. Expanding the range of these electronics and their application scope represents a pivotal trend in their development. In this work, a plastic inorganic semiconductor material, Sn2BiS2I3, with a band gap of 1.2 eV was synthesized and fabricated into a three-electrode flexible and portable electronic tongue capable of detecting heavy metal elements. The electronic tongue device exhibits exceptional linearity and demonstrates resistance against interference from impurity ions. The linear regression equation is expressed as Y=0.24+19.06X, yielding a linear coefficient of approximately 0.96, and the detectable limit stands at around 1.1 ppb, surpassing the 2.0 ppb limit of the ICP-AES instrument. Furthermore, mechanical testing reveals the favorable plasticity of Sn2BiS2I3, as evidenced by the absence of cracks during nanoindentation. The indentation hardness of Sn2BiS2I3 is approximately 1.67 GPa, slightly exceeding the hardness of Cu, which is 1.25 GPa. This study expands the repertoire of deformable and flexible electronics, offering a new and exceptional choice for biomimetic tongue sensor materials.",
    "authors": [
      "Qiao Wang",
      "Pengyue Zhao"
    ],
    "published": "2025-12-28T06:49:31Z",
    "updated": "2025-12-28T06:49:31Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2507.19436v3",
    "url": "https://arxiv.org/abs/2507.19436v3",
    "pdf_url": "https://arxiv.org/pdf/2507.19436v3.pdf",
    "title": "Unveiling the Velocity-Space Signature of Ion Cyclotron Damping Using Liouville Mapping",
    "abstract": "Ion cyclotron damping is a key mechanism for the dissipation of electromagnetic wave energy in weakly collisional plasmas. This study presents a combined approach using Liouville mapping and the field-particle correlation technique to investigate qualitatively and quantitatively the velocity-space signature of ion cyclotron damping. Liouville mapping offers a computationally efficient way to predict perturbations to the particle velocity distribution function using single-particle trajectories in prescribed electromagnetic fields. One may apply the field-particle correlation technique to these perturbed velocity distributions to reveal the unique velocity-space signatures of the secular energy transfer rate associated with specific wave-particle interactions. We validate this method by reproducing known Landau damping signatures for kinetic Alfvén waves, and then we apply this method to ion cyclotron waves where ion cyclotron damping dominates. The resulting velocity-space signature reveals distinct energization features of ion cyclotron damping : (i) a quadrupolar pattern in the perpendicular $(v_x, v_y)$ plane; and (ii) a localized energization near the $n = 1$ resonant velocity in gyrotropic $(v_\\parallel, v_\\perp)$ velocity-space. The quantitative patterns remain unchanged as the ion plasma beta $β_i$ is varied, ultimately showing minimal $v_\\perp$ dependence on $β_i$ of the velocity-space signature at the $n = 1$ resonant velocity. This work provides a systematic study of how the ion cyclotron damping signature varies with $β_i$, offering a practical foundation to identify ion cyclotron damping using kinetic simulation data or spacecraft data.",
    "authors": [
      "Rui Huang",
      "Gregory G. Howes"
    ],
    "published": "2025-07-25T17:07:15Z",
    "updated": "2025-12-28T01:22:17Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1063/5.0293700"
  },
  {
    "arxiv_id": "2512.22641v1",
    "url": "https://arxiv.org/abs/2512.22641v1",
    "pdf_url": "https://arxiv.org/pdf/2512.22641v1.pdf",
    "title": "Simultaneous measurement of surface topography and subsurface velocity field in free-surface turbulent flow",
    "abstract": "This work presents a novel combination of two well-established techniques: particle image velocimetry (PIV) and fringe projection profilometry (FPP). Despite seemingly conflicting requirements -- PIV requires a transparent fluid, while FPP requires an opaque surface to project onto -- both requirements are met by adding fluorescein disodium salt, a fluorescent dye, to the water. This dye strongly absorbs the blue light projected onto the surface for FPP while interacting weakly with the green laser light used for PIV, achieving simultaneous opacity and transparency depending on colour. However, this approach presents several challenges, which we are able to solve with a combination of optical filters on the projector and cameras. A series of validation experiments were performed to assess the accuracy of surface elevation measurements at various dye concentrations. The technique was then demonstrated for the case of a vortex street generated by a cylinder interacting with surface waves. Our results show that a dye concentration of 12\\,mg/L, although insufficient to make the water opaque to the projected light, yields a mean absolute error in surface elevation of only 20 micrometres.",
    "authors": [
      "Ali Semati",
      "Adharsh Shankaran",
      "Benjamin K. Smeltzer",
      "Eirik Æsøy",
      "R. Jason Hearst",
      "Simen Å. Ellingsen"
    ],
    "published": "2025-12-27T16:26:30Z",
    "updated": "2025-12-27T16:26:30Z",
    "categories": [
      "physics.flu-dyn",
      "physics.ins-det"
    ],
    "primary_category": "physics.flu-dyn"
  },
  {
    "arxiv_id": "2512.22632v1",
    "url": "https://arxiv.org/abs/2512.22632v1",
    "pdf_url": "https://arxiv.org/pdf/2512.22632v1.pdf",
    "title": "Stringent constraints on non-standard neutrino interactions using high-purity $ν_μ$ CC events in IceCube DeepCore",
    "abstract": "The neutral-current (NC) non-standard interactions (NSI) of neutrinos with fermions can modify the flavor oscillations of atmospheric neutrinos as they propagate through the Earth. We present constraints on the NC-NSI parameters $\\varepsilon_{μτ}$ and $\\varepsilon_{ττ}-\\varepsilon_{μμ}$ (one at a time) using a high-purity sample of $ν_μ$ charged-current (CC) atmospheric neutrino events collected by IceCube DeepCore over 7.5 years of livetime. These two parameters significantly affect the $ν_μ$ disappearance channel for which this golden event sample is optimized by the IceCube Collaboration. The best fit to this dataset is consistent with no NSI hypothesis, and we place the most stringent constraints to date: $-\\,0.0094 < \\varepsilon_{μτ} < 0.0079$ and $-\\,0.030 < \\varepsilon_{ττ}-\\varepsilon_{μμ} < 0.029$ at 90% confidence level.",
    "authors": [
      "J Krishnamoorthi",
      "Anil Kumar",
      "Sanjib Kumar Agarwalla"
    ],
    "published": "2025-12-27T16:09:04Z",
    "updated": "2025-12-27T16:09:04Z",
    "categories": [
      "hep-ph",
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2507.12495v2",
    "url": "https://arxiv.org/abs/2507.12495v2",
    "pdf_url": "https://arxiv.org/pdf/2507.12495v2.pdf",
    "title": "Assessing the economic benefits of space weather mitigation investment decisions: Evidence from Aotearoa New Zealand",
    "abstract": "Space weather events pose a growing threat to modern economies, yet their macroeconomic consequences still remain underexplored. This study presents the first dedicated economic assessment of geomagnetic storm impacts on Aotearoa New Zealand, quantifying potential gross domestic product (GDP) losses across seven conservative disruption and mitigation scenarios due to an extreme coronal mass ejection (CME). The primary focus is upon the damaging impacts of geomagnetically induced currents (GICs) on the electrical power transmission network. We support space weather mitigation investments decisions by providing a first-order approximation of their potential economic benefits, using best-in-class scientific models. In the absence of mitigation, a severe but realistic storm could result in up to NZ\\$8.36 billion in lost GDP, with more than half stemming from cascading supply chain effects. Yet, even less severe scenarios incur losses exceeding NZ\\$3 billion. Importantly, even with conservative impact estimates we find that research-led operational strategies, such as optimized switching and islanding, can avoid up to NZ\\$370 million in losses for as little as NZ\\$0.5 million in expenditure, delivering a benefit-cost ratio of 740 to 1. Equally, physical protections such as GIC blocking devices achieve benefit-cost returns up to 80 to 1, highlighting the strong case for investment in space weather mitigation. When also acknowledging additional unmodelled impacts, including multi-billion losses in capital equipment and long-term revenue, the economic rationale for pre-emptive mitigation becomes even more pertinent. Future research needs to integrate the modelling of capital and revenue losses for strategically important industrial facilities.",
    "authors": [
      "Edward J. Oughton",
      "Andrew Renton",
      "Daniel Mac Marnus",
      "Dennies Bor",
      "Craig J. Rodger"
    ],
    "published": "2025-07-15T21:01:40Z",
    "updated": "2025-12-27T15:46:56Z",
    "categories": [
      "physics.geo-ph",
      "eess.SY",
      "physics.plasm-ph",
      "physics.soc-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.geo-ph"
  },
  {
    "arxiv_id": "2512.22611v1",
    "url": "https://arxiv.org/abs/2512.22611v1",
    "pdf_url": "https://arxiv.org/pdf/2512.22611v1.pdf",
    "title": "Impact of fast ions on turbulent transport in high-\\b{eta} HL-2A scenarios",
    "abstract": "The fast-ion (FI) on turbulent transport is one of the key topics of magnetic confinement fusion. This work focus on the impact of FI pressure gradients on turbulence in a high-\\b{eta} plasma scenario using gyrokinetic simulations. Linear analyses reveal that FIs strongly stabilize ion temperature gradient (ITG) modes via the thermal-ion dilution, while their influence on trapped electron modes (TEMs) is minimal. At elevated FI pressure gradients, a transition to a FI-driven BAE (FI-BAE) regime occurs, as evidenced by mode structure and frequency alignment within the Alfvénic gap. Electron \\b{eta} scans further demonstrate the emergence of kinetic ballooning modes (KBMs) at higher \\b{eta}, whereas an ITG-TEM hybrid turbulence dominates near experimental \\b{eta} values. Nonlinear simulations show that moderate FI pressure suppresses transport via zonal flow (ZF) shear, whereas strong FI drive weakens ZFs and enhances transport by destabilizing FI-BAEs. These results highlight the dual role of FIs in regulating turbulence and offer insight into multiscale transport physics relevant for high-performance plasmas.",
    "authors": [
      "Jingchun Li",
      "Zhaoyang Lu",
      "Jianqiang Xu",
      "Wei Chen",
      "Jiaqi Dong",
      "Jingting Luo",
      "Yong Liu"
    ],
    "published": "2025-12-27T14:38:33Z",
    "updated": "2025-12-27T14:38:33Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.18425v3",
    "url": "https://arxiv.org/abs/2506.18425v3",
    "pdf_url": "https://arxiv.org/pdf/2506.18425v3.pdf",
    "title": "Spatial, Spectral and Temporal Response of High Intensity Laser Plasma Mirrors- Direct Observation of the Ponderomotive Push",
    "abstract": "Plasma-based optics have emerged as a powerful platform for manipulating and amplifying ultra-intense laser pulses. However, the inherently nonlinear and dynamic nature of plasma leads to significant spatial, spectral, and temporal modulations when driven at relativistic intensities. These modifications can dramatically alter the structure of the reflected laser pulses, posing challenges for their use in applications such as vacuum ultraviolet (VUV) and X-ray generation, as well as relativistic particle acceleration. Comprehensive, multidimensional diagnostics are essential to accurately characterize these so-called `plasma mirrors' (PMs). We present a direct, \\textit{in situ} measurement of the three-dimensional plasma surface evolution during femtosecond laser irradiation, achieved through simultaneous analysis of the wavefront, spectrum, and temporal profile of the reflected light. Our measurements reveal surface deformations on the order of a few hundred nanometers at relativistic intensities, in agreement with three-dimensional particle-in-cell (3D-PIC) simulations. Additionally, the PM induces substantial modifications to the pulse spectrum and temporal profile, introducing spatio-temporal couplings.",
    "authors": [
      "Sk Rakeeb",
      "Animesh Sharma",
      "Sagar Dam",
      "Ameya Parab",
      "Amit Lad",
      "Yash. M. Ved",
      "Amita Das",
      "G. Ravindra Kumar"
    ],
    "published": "2025-06-23T09:04:19Z",
    "updated": "2025-12-27T07:24:48Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.27239v3",
    "url": "https://arxiv.org/abs/2510.27239v3",
    "pdf_url": "https://arxiv.org/pdf/2510.27239v3.pdf",
    "title": "Synchronized Catastrophic Collapse and Extreme Intensity Amplification of Ultra-Intense Pulses in Near-Resonance Magnetized Plasma",
    "abstract": "Ultra-high field intensities are essential for developing high-energy-density physics and compact plasma accelerators, but they are essentially constrained by the limitations of focusing distance and nonlinear efficiency. We present a theoretical model for extreme laser energy concentration in under-dense plasma that shows a highly effective, magnetically supported pathway. We demonstrate a fundamental, nonlinear enhancement of the relativistic self-focusing (RSF) mechanism by adjusting an external magnetic field close to the cyclotron resonance (Ce=0.7). Over a remarkably short distance of 1.25 Rayleigh lengths, the pulse is driven into a catastrophic, coupled collapse by this magnetic enhancement. Significant temporal self-compression (0.60) and simultaneous spatial confinement (0.05) are the outcomes of the dynamics. Importantly, this combined confinement results in a localized peak intensity amplification factor greater than 103 compared to the initial state. This work offers a clear, practical blueprint for upcoming laser-plasma experiments and validates a reliable and compact technique for producing petawatt-scale power densities.",
    "authors": [
      "Sintu Kumar",
      "Pratibha Jaiswal",
      "Km. Shivani Bhardwaj",
      "Rajesh Kumar Rai"
    ],
    "published": "2025-10-31T07:07:06Z",
    "updated": "2025-12-27T05:02:59Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.22446v1",
    "url": "https://arxiv.org/abs/2512.22446v1",
    "pdf_url": "https://arxiv.org/pdf/2512.22446v1.pdf",
    "title": "Electrode Geometry Optimization in Vortex-Type Seawater Magnetohydrodynamic Generators",
    "abstract": "Magnetohydrodynamics (MHD) generators present a promising pathway for clean energy conversion by directly transforming conductive fluids' kinetic energy into electricity. This study investigates the impact of electrode geometry modifications on the performance of a vortex-type seawater MHD generator. Three electrode designs, partial, whole-area, and spiral, are analyzed through combined analytical and numerical simulations using COMSOL Multiphysics. The study focuses on internal resistance reduction, current density distribution, and overall power output. The results indicate that electrode area and spacing are critical determinants of performance. The whole-area electrode achieves the highest output, with a 155 percent increase in power compared to the baseline partial electrode. The spiral electrode demonstrates reduced internal resistance and improved current flow but exhibits lower open-circuit voltage due to reduced electrode spacing. The simulations show strong agreement with theoretical models, with deviations of less than 4 percent in open-circuit voltage predictions. These findings highlight the importance of geometric optimization for advancing seawater-based MHD generators as sustainable and efficient energy conversion systems.",
    "authors": [
      "Arleen Natalie",
      "Budiarso",
      "Ridho Irwansyah"
    ],
    "published": "2025-12-27T03:07:35Z",
    "updated": "2025-12-27T03:07:35Z",
    "categories": [
      "physics.flu-dyn",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.flu-dyn"
  },
  {
    "arxiv_id": "2512.14598v2",
    "url": "https://arxiv.org/abs/2512.14598v2",
    "pdf_url": "https://arxiv.org/pdf/2512.14598v2.pdf",
    "title": "Hybrid Machine-Learning Particle Identification for the ePIC Proximity-Focusing RICH",
    "abstract": "We present a machine-learning-based particle-identification study for the proximity-focusing Ring Imaging Cherenkov (pfRICH) detector of the ePIC experiment at the Electron-Ion Collider. Operating in the backward region ($-3.5 \\lesssim η\\lesssim -1.5$), the pfRICH is designed to achieve at least $3σ$ separation among pions, kaons, and protons up to $7,\\mathrm{GeV}/c$ for Semi-Inclusive Deep Inelastic Scattering measurements. Using a standalone Geant4 simulation of the pfRICH, we develop a hybrid machine-learning approach that combines convolutional neural-network-based feature extraction with gradient-boosted decision-tree classifiers. This method significantly enhances Cherenkov-ring pattern recognition and improves particle-separation performance, demonstrating the effectiveness of hybrid machine-learning techniques for next-generation Cherenkov detectors at the EIC.",
    "authors": [
      "D. H. Dongwi",
      "C. -J. Naïm",
      "L. Rhode",
      "A. Deshpande"
    ],
    "published": "2025-12-16T17:07:56Z",
    "updated": "2025-12-27T00:52:13Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.00959v2",
    "url": "https://arxiv.org/abs/2512.00959v2",
    "pdf_url": "https://arxiv.org/pdf/2512.00959v2.pdf",
    "title": "A Bidirectional Diode-Clamp Circuit Paradigm for Time-Resolved Measurement of Electrical Short-Circuits",
    "abstract": "Conventional electrical fault models, which rely on static thresholds and instantaneous trip mechanisms, fail to capture the time-evolving dynamics of real faults, creating vulnerabilities in modern power systems. This paper introduces a diode-clamp circuit architecture that reconceives short-circuits as governed, sustained processes and establishes a physics-consistent, measurement system. An Arduino-based data acquisition system recorded continuous fault evolution across multiple input voltages and durations. Multi-resolution sampling at 10ms, 50ms, and 100ms enabled high-fidelity capture of both transients and sustained-state dynamics. The clamped mechanism constrained the circuit to a bounded regime, enabling repeatable observation. Experiments yielded definitive, measurable minima and maxima for voltage, current, and resistance, empirically refuting the classical assumption of instantaneous, unbounded current. Newly introduced metrics quantify this performance: the Sustained-to-Capacitive Energy Ratio (SCER ~1.53x10^12) proves fault energy originates from sustained dynamics, not transient discharge. The Sustained Fault Efficiency (SFE>1) demonstrates that governed fault power can exceed nominal operating power. This work provides the first fully validated short-circuit quantification system, yielding empirical data for next-generation battery management, adaptive grid protection, and fault-tolerant electronics.",
    "authors": [
      "Alex Mwololo Kimuya",
      "Dickson Mwenda Kinyua"
    ],
    "published": "2025-11-30T16:21:19Z",
    "updated": "2025-12-27T00:13:31Z",
    "categories": [
      "eess.SY",
      "physics.ins-det"
    ],
    "primary_category": "eess.SY"
  },
  {
    "arxiv_id": "2512.18290v2",
    "url": "https://arxiv.org/abs/2512.18290v2",
    "pdf_url": "https://arxiv.org/pdf/2512.18290v2.pdf",
    "title": "Robust and scalable simulation-based inference for gravitational wave signals with gaps",
    "abstract": "The Laser Interferometer Space Antenna (LISA) data stream will inevitably contain gaps due to maintenance and environmental disturbances, introducing nonstationarities and spectral leakage that compromise standard frequency-domain likelihood evaluations. We present a scalable Simulation-Based Inference (SBI) framework capable of robust parameter estimation directly from gapped time-series data. We employ Flow Matching Posterior Estimation (FMPE) conditioned on a learned summary of the data, optimized through an end-to-end training strategy. To address the computational challenges of long-duration signals, we propose a dual-pathway summarizer architecture: a 1D Convolutional Neural Network (CNN) operating on the time domain for high precision, and a novel wavelet-based 2D CNN utilizing asymmetric, dilated kernels to achieve scalability for datasets spanning months. We demonstrate the efficacy of this framework on simulated Galactic Binary-like signals, showing that our joint training approach yields tighter, unbiased posteriors compared to two-stage reconstruction pipelines. Furthermore, we provide the first systematic comparison showing that FMPE offers superior stability and coverage calibration over conventional Normalizing Flows in the presence of severe data artifacts.",
    "authors": [
      "Ruiting Mao",
      "Jeong Eun Lee",
      "Matthew C. Edwards"
    ],
    "published": "2025-12-20T09:30:10Z",
    "updated": "2025-12-26T21:06:49Z",
    "categories": [
      "astro-ph.IM",
      "gr-qc",
      "physics.data-an",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2512.22355v1",
    "url": "https://arxiv.org/abs/2512.22355v1",
    "pdf_url": "https://arxiv.org/pdf/2512.22355v1.pdf",
    "title": "On the accessibility of stable reactor operating regimes in quasi-symmetric stellarators",
    "abstract": "Maximising particle and energy confinement is crucial for achieving the sustained burning plasma conditions necessary to realise fusion energy. For stellarator reactors, one proposed strategy for avoiding destructive instabilities is to operate at high-field but low(er) plasma pressure. In this work, we investigate the accessibility of such a reactor-relevant low-beta regime in a reactor-scale quasi-axisymmetric stellarator using state-of-the-art high-fidelity macro- and microscopic simulation tools. We consider a configuration with a flattened core pressure profile and favourable properties from the macroscopic and neoclassical perspectives. By contrast, linear and nonlinear calculations with the GENE code show an abrupt transition to a regime of highly deleterious transport at low (local) plasma beta. We describe the characterisation of these transport regimes as well as the confinement transition. We discuss the implications broadly for stellarator optimisation and highlight the impact on quasi-symmetric stellarator design strategies.",
    "authors": [
      "Adelle M. Wright",
      "Benjamin J. Faber"
    ],
    "published": "2025-12-26T19:34:20Z",
    "updated": "2025-12-26T19:34:20Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.02845v2",
    "url": "https://arxiv.org/abs/2511.02845v2",
    "pdf_url": "https://arxiv.org/pdf/2511.02845v2.pdf",
    "title": "AI-Enhanced Real-Time Wi-Fi Sensing Through Single Transceiver Pair",
    "abstract": "The advancement of next-generation Wi-Fi technology heavily relies on sensing capabilities, which play a pivotal role in enabling sophisticated applications. In response to the growing demand for large-scale deployments, contemporary Wi-Fi sensing systems strive to achieve high-precision perception while maintaining minimal bandwidth consumption and antenna count requirements. Remarkably, various AI-driven perception technologies have demonstrated the ability to surpass the traditional resolution limitations imposed by radar theory. However, the theoretical underpinnings of this phenomenon have not been thoroughly investigated in existing research. In this study, we found that under hardware-constrained conditions, the performance gains brought by AI to Wi-Fi sensing systems primarily originate from two aspects: prior information and temporal correlation. Prior information enables the AI to generate plausible details based on vague input, while temporal correlation helps reduce the upper bound of sensing error. Building on these insights, we developed a real-time, AI-based Wi-Fi sensing and visualization system using a single transceiver pair, and designed experiments focusing on human pose estimation and indoor localization. The system operates in real time on commodity hardware, and experimental results confirm our theoretical findings.",
    "authors": [
      "Yuxuan Liu",
      "Chiya Zhang",
      "Yifeng Yuan",
      "Chunlong He",
      "Weizheng Zhang",
      "Gaojie Chen"
    ],
    "published": "2025-10-21T07:31:24Z",
    "updated": "2025-12-26T11:22:56Z",
    "categories": [
      "eess.SP",
      "cs.AI",
      "physics.ins-det"
    ],
    "primary_category": "eess.SP"
  },
  {
    "arxiv_id": "2512.21974v1",
    "url": "https://arxiv.org/abs/2512.21974v1",
    "pdf_url": "https://arxiv.org/pdf/2512.21974v1.pdf",
    "title": "Revealing the transient ionization dynamics and mode-coupling mechanisms of helicon discharge through a self-consistent multiphysics model",
    "abstract": "Helicon plasma sources play a central role in applications ranging from material treatment to space propulsion and fusion, yet the physical processes governing their ignition, transient ionization, and mode evolution remain incompletely understood. Here we develop a self-consistent, fully coupled multiphysics framework that integrates Maxwell equations, electron energy transport, drift-diffusion kinetics, and heavy-species chemistry to capture the complete spatiotemporal evolution of helicon discharges. The model reproduces experimental measurements across pressure, magnetic field, and frequency ranges, and reveals a previously unresolved transient ionization stage characterized by a rapid density rise within ~10-4 s, accompanied by a two-peak electron temperature structure that governs the formation of the dense plasma core. By tracking the RF power flow and field topology, we characterize the transient redistribution of RF energy during ignition. A short-lived phase of localized energy deposition accompanies the onset of ionization, followed by an evolution toward helicon-like field characteristics together with rapid density growth and profile restructuring. Systematic parametric scans further reveal the sensitivity of this mode-coupling process to gas pressure, magnetic field strength, and driving frequency. These results provide a unified picture of the ignition and mode-transition physics in helicon plasmas and establish a predictive tool for the design and optimization of RF plasma sources across space propulsion, manufacturing, and fusion technologies.",
    "authors": [
      "Jing-Jing Ma",
      "Lei Chang",
      "Ming-Yang Wu",
      "Hua Zhou",
      "Yi-Wei Zhang",
      "Ilya Zadiriev",
      "Elena Kralkina",
      "Shogo Isayama",
      "Shin-Jae You"
    ],
    "published": "2025-12-26T10:39:23Z",
    "updated": "2025-12-26T10:39:23Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.21949v1",
    "url": "https://arxiv.org/abs/2512.21949v1",
    "pdf_url": "https://arxiv.org/pdf/2512.21949v1.pdf",
    "title": "WST spectroscopic variability alerts: discovery space, data flow system requirements",
    "abstract": "The enormous multiplexity of the WST opens up the possibility to trigger alerts for variable objects - an option that has been reserved so far only for imaging surveys. WST can go further by detecting spectroscopic line profile and line strength variations. I review previous alert-issuing surveys that are limited to imaging, and describe some of the new research possibilities that this feature of the data flow system (DFS) would open up. The latter range from variability of emission line stars, such as Bes, WRs and LBVs to variability of active galaxies and quasars, including the so-called changing look objects that shift between Type 1 and Type 2. Furthermore, I describe the requirements that the WST DFS must meet to make this feasible. The most critical aspect is the rapid data processing for timely follow-up. Next, the alert system is tightly connected with the data reduction and archive, because it will need an extensive and continuously updated spectral reference database. The new spectra will have to be compared against these reference spectra to identify variations. The reference spectra can either be \"native\" from the WST itself or they can originate from other spectroscopic surveys. Two options for the DFS are considered: one is to conduct an automated search of the WST's own archive, and potentially of other spectroscopic archives and a second option is to allow the users to submit reference spectra on their own. The spectroscopic alert system will open up a completely new discovery space that is not accessible to the existing or planned near-future surveys. Finally, I discuss the advantages of moving the variability detection to physical parameters by modeling the observed and reference spectra and comparing the derived fitting parameters. This strategy offers a robust method for alert ranking.",
    "authors": [
      "Valenitn D. Ivanov"
    ],
    "published": "2025-12-26T09:54:33Z",
    "updated": "2025-12-26T09:54:33Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2511.20951v2",
    "url": "https://arxiv.org/abs/2511.20951v2",
    "pdf_url": "https://arxiv.org/pdf/2511.20951v2.pdf",
    "title": "Isotope Production in Muon-Catalyzed-Fusion Systems",
    "abstract": "Producing valuable isotopes with high-flux high-energy neutrons generated by muon-catalyzed fusion ($μ$CF) reactions could substantially improve the economic prospects for muon-catalyzed fusion. Because no external heating is required for $μ$CF, heat flux constraints are significantly relaxed compared with fusion systems requiring external heating. This could allow $μ$CF to attain much higher neutron flux without breaching material heat flux limits. If muon production rates can be increased, $μ$CF systems employing transmutation could be viable well before energy breakeven is possible. For $μ$CF systems transmuting valuable isotopes, the required number of catalyzed fusion events per muon and muon energy generation cost can be relaxed by several orders of magnitude relative to electricity-generating systems, making $μ$CF an attractive high-flux neutron source. We show an example $μ$CF system with a 10 gram ${}^{226}\\mathrm{Ra}$ feedstock and a steady-state muon rate of $10^{12}$ muons / second - roughly half a kilowatt of fusion power - could produce 20 mg of ${}^{225}\\mathrm{Ac}$ per year - comparable to 400 times global supply in 2024. As higher muon rate sources become available, many other radioisotope transmutation pathways become viable. These findings motivate the accelerated development of $μ$CF systems for neutron-driven isotope production far before net energy generation is possible.",
    "authors": [
      "J. F. Parisi",
      "A. Rutkowski"
    ],
    "published": "2025-11-26T01:12:23Z",
    "updated": "2025-12-25T20:13:33Z",
    "categories": [
      "physics.plasm-ph",
      "nucl-ex",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.22292v1",
    "url": "https://arxiv.org/abs/2512.22292v1",
    "pdf_url": "https://arxiv.org/pdf/2512.22292v1.pdf",
    "title": "Quantitative acoustic monitoring of ensembles of weakly nonlinear microbubble oscillations in optically inaccessible environments",
    "abstract": "A growing class of ultrasound-mediated diagnostic and therapeutic technologies, including sonoporation and blood-brain barrier modulation, relies on microbubble contrast agents, where precise control of microbubble dynamics governs biological responses, efficiency, and safety. However, quantitative monitoring of microbubble oscillations in the stable, weakly nonlinear regime remains challenging, particularly in optically opaque and deep-tissue environments. Here, we introduce a linear acoustic wave propagation and superposition (LAWPS) framework that reconstructs microbubble radius-time dynamics directly from passively recorded acoustic emissions. By coupling Fourier-series representations of weakly nonlinear oscillations with linear monopole radiation theory, LAWPS extends classical monopole models to establish a reversible relationship between multi-frequency acoustic emissions and underlying radial bubble dynamics. Extending this framework to monodisperse microbubble ensembles, we derive optimal excitation and receive configurations and population-level correction factors that enable quantitative reconstruction of the ensemble-averaged microbubble dynamics. Using simultaneous optical and acoustic measurements, we demonstrate recovery of microbubble oscillations with ~5% relative error for oscillation amplitudes up to ~15% of equilibrium radius. Finally, we show that oscillations within the framework's operating regime (20% oscillation) generate sonoporation-relevant mechanical stress in vesicles as small as 10 micrometers (capillary number > 0.01), under physiologically relevant conditions. Together, this work establishes a quantitative framework for acoustic emission-based monitoring of weakly nonlinear microbubble oscillations in clinically relevant, optically inaccessible environments to enable improved control of emerging ultrasound diagnostic and therapeutic technologies.",
    "authors": [
      "Hohyun Lee",
      "Reza Pakdaman Zangabad",
      "Chulyong Kim",
      "Victor Menezes",
      "Juyoung Park",
      "F. Levent Degertekin",
      "Costas Arvanitis"
    ],
    "published": "2025-12-25T15:57:30Z",
    "updated": "2025-12-25T15:57:30Z",
    "categories": [
      "physics.ins-det",
      "physics.med-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.21719v1",
    "url": "https://arxiv.org/abs/2512.21719v1",
    "pdf_url": "https://arxiv.org/pdf/2512.21719v1.pdf",
    "title": "SiPM-based photodetectors for spectroscopic measurements in wide dynamic range",
    "abstract": "The results of measurements of the characteristics of photodetectors based on large-area SiPM matrices with a wide dynamic range are presented. The potential application of SiPM-based photodetectors for electromagnetic calorimetry in the energy range from hundreds of keV to tens of GeV is explored. The potential application of SiPM in gamma-spectroscopy is also discussed.",
    "authors": [
      "S. V. Evdokimov",
      "A. M. Gorin",
      "V. I. Izucheev",
      "Yu. V. Kharlov",
      "B. V. Polishchuk",
      "V. I. Rykalin",
      "S. A. Sadovsky",
      "A. A. Shangaraev",
      "N. E. Voronkov",
      "A. A. Zaitsev"
    ],
    "published": "2025-12-25T15:43:46Z",
    "updated": "2025-12-25T15:43:46Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.06651v4",
    "url": "https://arxiv.org/abs/2512.06651v4",
    "pdf_url": "https://arxiv.org/pdf/2512.06651v4.pdf",
    "title": "A Capacitor Model of the Helical Deflector: Revisiting Shamaev's Proposal and the Textbook Model",
    "abstract": "An RF helical deflector is a type of electron and ion optics device that applies a time-dependent rotating transverse electric or magnetic field by means of time-dependent RF voltage applied on two opposite conducting helical structures (wires, ribbons or other) to deflect charged particles (a single, bunch or beam) in a circular or spiral path. It is a perspective indirect timing system being concurrent for reaching picosecond time resolution, and have promise being excellent candidate for high precision time-of-flight detection. As a timing system, it converts the temporal structure of an electron beam into a spatial pattern -- particularly, an ellipse in the case of a single-frequency RF voltage and continuous electron pencil beam.   I propose a capacitor model of an RF helical deflector and compare it with the existing textbook model \\cite{ZhigarevBook, Gevorgian2015}, interpret them and provide understanding of them. Furthermore, I analyze the latter, finding analytical formulas for the applied electric field, ellipse sizes (semi-axes) and rotation angle, lengths of the ellipse line, corresponding to the duration of electron pencil bunches or beams. The present article touches the topics of getting circle on resonance limit and of deflection sensitivity.",
    "authors": [
      "Hayk L. Gevorgyan"
    ],
    "published": "2025-12-07T04:27:08Z",
    "updated": "2025-12-25T14:26:03Z",
    "categories": [
      "physics.acc-ph",
      "physics.app-ph",
      "physics.class-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.21594v1",
    "url": "https://arxiv.org/abs/2512.21594v1",
    "pdf_url": "https://arxiv.org/pdf/2512.21594v1.pdf",
    "title": "Proposal for energy modulation to demodulation in seeded free-electron lasers",
    "abstract": "Laser manipulation plays a critical role in precisely tailoring relativistic electron beams through energy modulation, enabling the generation of coherent, intense, and ultrashort radiation in accelerator-based light sources such as synchrotron radiation facilities and free-electron lasers (FELs). However, laser-induced energy modulation inevitably degrades electron beam quality by increasing energy spread. In this paper, a straightforward yet practical implementation method for verifying the electron beam demodulation process in seeded FELs is proposed. The method employs a dedicated demodulation undulator system, referred to as a demodulator, equipped with a phase shifter. Both one-dimensional analytical models and three-dimensional simulations demonstrate that introducing a $π$ phase shift in the demodulator enables simultaneous energy modulation and demodulation using only a single seed laser. Under optimized conditions with weak initial modulation, simulation results indicate that the energy modulation can be substantially reduced or nearly eliminated. With increasing laser intensity, the modulation amplitude is significantly suppressed by more than an order of magnitude, effectively mitigating energy spread degradation. The residual energy modulation can be characterized using complementary diagnostic techniques: the coherent undulator radiation method combined with the dispersion scan method. The proposed method is expected to enable precise control over electron beam energy modulation, potentially facilitating the development of high-repetition-rate, fully coherent X-ray sources with improved electron beam quality preservation.",
    "authors": [
      "Hanxiang Yang",
      "Nanshun Huang",
      "Zipeng Liu",
      "Shengbin Ye",
      "Wencai Cheng",
      "Shudong Zhou",
      "Cheng Yu",
      "Tao Liu",
      "Haixiao Deng"
    ],
    "published": "2025-12-25T09:19:59Z",
    "updated": "2025-12-25T09:19:59Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.04434v2",
    "url": "https://arxiv.org/abs/2508.04434v2",
    "pdf_url": "https://arxiv.org/pdf/2508.04434v2.pdf",
    "title": "Explanation of the seasonal variation of cosmic multiple muon events observed with the NOvA Near Detector",
    "abstract": "The flux of cosmic ray muons at the Earth's surface exhibits seasonal variations due to changes in the temperature of the atmosphere affecting the production and decay of mesons in the upper atmosphere. Using 1473 live days of data collected by the NuMI Off-axis $ν_e$ Appearance (NOvA) Near Detector during 2018--2022, we studied the seasonal pattern in the multiple-muon event rate. The data confirm an anticorrelation between the multiple-muon event rate and effective atmospheric temperature, consistent across all the years of data. Previous analyses from MINOS and NOvA saw a similar anticorrelation but did not include an explanation. We find that this anticorrelation is driven by altitude--geometry effects as the average muon production height changes with the season. This has been studied with a CORSIKA cosmic ray simulation package by varying atmospheric parameters, and provides an explanation to a longstanding discrepancy between the seasonal phases of single and multiple-muon events.",
    "authors": [
      "The NOvA Collaboration"
    ],
    "published": "2025-08-06T13:21:45Z",
    "updated": "2025-12-25T07:47:10Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2512.21240v2",
    "url": "https://arxiv.org/abs/2512.21240v2",
    "pdf_url": "https://arxiv.org/pdf/2512.21240v2.pdf",
    "title": "Minijets and Broken Stationarity in a Blazar : Novel Insights into the Origin of $γ$-ray Variability in CTA 102",
    "abstract": "High-energy blazar light curves, in X-rays and beyond, have historically preferred a log-normal flux distribution, signifying multiplicative processes either in the jet itself or due to connection(s) with accretion. Here we present 18 year archival Fermi-LAT light curves (0.1-100 GeV) of the flat spectrum radio quasar (FSRQ) CTA 102 from August 2008 to November 2025, which underwent a huge flare in 2017, with a $\\sim$ factor of 100 jump in $γ$-ray flux, along with similar flaring in X-rays. Our statistical analyses confirm that neither the pre nor the post-flare total GeV light curves follow a strictly log-normal distribution. Instead, we observe a statistically significant reduction in skewness from the pre to the post-flare light curves, which implies the blazar transitioned from an energetic state with frequent flaring to a more plateaued state with occasional flaring. We further find that this state transition can be explained through magnetic relaxation, where many reconnection events caused the 2017 flare, after which the magnetic field was ordered and its energy reached a minimum. To explain this further, we use a Monte Carlo simulation of a modified minijets-in-a-jet model where GeV flares are produced only when a maximum number of minijets move toward the broad line region and towards the line of sight, in the context of an external Compton model. The flux distributions (both observed and simulated) could be fit by a modified log-normal power-law distribution, implying our minijets model can reproduce the GeV flares in CTA 102 as well as their flux distributions.",
    "authors": [
      "Agniva Roychowdhury"
    ],
    "published": "2025-12-24T15:33:23Z",
    "updated": "2025-12-25T04:29:07Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2512.21468v1",
    "url": "https://arxiv.org/abs/2512.21468v1",
    "pdf_url": "https://arxiv.org/pdf/2512.21468v1.pdf",
    "title": "Probing Internal Conversion and Dark-Matter-Induced De-excitation of 180mTa with a gamma-ray TES Array",
    "abstract": "We propose and evaluate a source-as-detector search for the de-excitation of the long-lived isomer $^{180\\mathrm{m}}\\mathrm{Ta}$ in natural tantalum (Ta), using a $γ$-ray transition-edge-sensor (TES) array. We exploit two capabilities not available in conventional high-purity germanium (HPGe) searches: (i) near-unity containment of low-energy secondaries (internal-conversion electrons and characteristic X rays), as well as the nuclear recoil, enabling a calorimetric, event-by-event measurement of the total energy deposited in the absorber; and (ii) a delayed-coincidence tag based on the subsequent ${}^{180}$Ta electron-capture (EC) decay to ${}^{180}$Hf. We evaluate the $3σ$ discovery reach for internal conversion (IC) and for dark-matter-induced de-excitation in two benchmark scenarios: a strongly interacting dark-matter (DM) subcomponent and inelastic DM with off-diagonal couplings. Using a background model based on intrinsic radioactivity in the Ta absorber and realistic detector performance, we show that arrays with $N_{\\mathrm{TES}}=256$ and $1{,}000$ pixels can reach the theoretically expected IC half-life within $2.6$~yr and $0.66$~yr, respectively. For an array with $N_{\\mathrm{TES}}=10^4$ and a five-year exposure, the projected sensitivity to DM-induced de-excitation surpasses limits inferred from HPGe non-observations of ${}^{180\\mathrm{m}}$Ta and probes regions of parameter space not covered by current direct-detection experiments.",
    "authors": [
      "A. Gando",
      "K. Ichimura",
      "K. Ishidoshiro",
      "T. Kikuchi",
      "T. Kishimoto",
      "A. Takeuchi",
      "R. Sato",
      "R. Smith"
    ],
    "published": "2025-12-25T02:01:51Z",
    "updated": "2025-12-25T02:01:51Z",
    "categories": [
      "hep-ph",
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2510.25047v2",
    "url": "https://arxiv.org/abs/2510.25047v2",
    "pdf_url": "https://arxiv.org/pdf/2510.25047v2.pdf",
    "title": "Magnetic Field Line Chaos, Cantori, and Turnstiles in Toroidal Plasmas",
    "abstract": "Although magnetic field line chaos, cantori, and turnstiles underlie the physics of tokamak disruptions, runaway electron damage, stellarator non-resonant divertors, and the most important electromagnetic correction to what are called electrostatic micro-instabilities, these concepts are not well known. These concepts will be defined and applications that illustrate their importance will be discussed.",
    "authors": [
      "Allen H Boozer"
    ],
    "published": "2025-10-29T00:16:43Z",
    "updated": "2025-12-24T22:07:21Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.21286v1",
    "url": "https://arxiv.org/abs/2512.21286v1",
    "pdf_url": "https://arxiv.org/pdf/2512.21286v1.pdf",
    "title": "Impurity peaking of SPARC H-modes: a sensitivity study on physics and engineering assumptions",
    "abstract": "In this paper, an overview of the impurity transport for three H-mode plasmas in the upcoming SPARC tokamak has been provided. The simulations have been performed within the ASTRA+STRAHL framework, using FACIT and TGLF-SAT2 to predict, respectively, neoclassical and turbulent core transport, while a neural network trained on EPED simulations has been employed to calculate the pedestal height and width self-consistently. A benchmark with previous simulations at constant impurity fraction has been provided for three H-modes, spanning different plasma current and magnetic field values. For a scenario, additional simulations have been performed to account for uncertainties in the modeling assumptions. The predictions are nearly insensitive to changes in the top of pedestal W concentrations. Varying the Ar pedestal concentration has shown a small effect on the impurity peaking and nearly constant fusion gain values, due to multiple effects on pedestal pressure, main ion dilution and density peaking. The inclusion of rotation in ASTRA simulations has shown minimal impact on confinement and impurity transport predictions. An exploratory study has been provided with a first set of simulations treating D and T separately, experiencing a maximum fusion power at 55-45% DT fuel composition, and an asymmetric distribution with respect to the D concentration. All the results, including sensitivity scans of toroidal velocity and ion temperature and density gradients, highlighted that turbulent impurity transport prevails on the neoclassical component, aligning with previous ITER predictions, and suggesting that next generation devices like SPARC, operating at low collisionality, will experience low W accumulation.",
    "authors": [
      "Marco Muraca",
      "Pablo Rodriguez-Fernandez",
      "Joe Hall",
      "Nathaniel T. Howard",
      "Daniel Fajardo",
      "Giovanni Tardini",
      "Benedikt Zimmermann",
      "Thomas Body"
    ],
    "published": "2025-12-24T17:08:46Z",
    "updated": "2025-12-24T17:08:46Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.21279v1",
    "url": "https://arxiv.org/abs/2512.21279v1",
    "pdf_url": "https://arxiv.org/pdf/2512.21279v1.pdf",
    "title": "Multivariate scaling of proton and ion energies, divergence, and charge states in Target Normal Sheath Acceleration",
    "abstract": "The interaction of an intense laser pulse with a solid target produces energetic proton and ion beams through the Target Normal Sheath Acceleration (TNSA) mechanism. Such beams are under active investigation for applications in proton beam therapy, materials modification, and nuclear and high-energy-density physics. Despite extensive experimental and theoretical effort, predictive correlations between laser and target parameters and the resulting ion-beam properties remain an open research question, owing to the intrinsically multiphysics and strongly coupled nature of laser-plasma interactions. Here, we employ our unified multiphysics model that reproduces laser-solid interaction dynamics with accuracy exceeding 95% over a broad range of short- and ultrashort-pulse conditions. Using this model, we derive statistically validated scaling laws and probability maps that correlate proton, carbon, and oxygen ion cutoff energies, beam divergences, and ionization states to a wide set of laser and target parameters, including pulse duration, laser power, laser beam spot, target thickness, prepulse-main pulse interval, contrast, laser wavelength, and polarization. Continuous beam properties (cutoff energies and beam divergences) are described using multivariate regression with cross-validation, while discrete ionization states are analyzed using classification and regression tree (CART) methods, enabling nonlinear and threshold-dependent behavior to be captured. The resulting scaling relations, contour maps, and box plots elucidate the coupled roles of laser pulse, and target geometry in governing TNSA ion acceleration and charge-state formation. These results provide a predictive and physically interpretable framework for understanding and optimizing laser-driven ion sources across a wide parameter space.",
    "authors": [
      "Vasiliki E. Alexopoulou"
    ],
    "published": "2025-12-24T16:58:25Z",
    "updated": "2025-12-24T16:58:25Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2407.10339v2",
    "url": "https://arxiv.org/abs/2407.10339v2",
    "pdf_url": "https://arxiv.org/pdf/2407.10339v2.pdf",
    "title": "Supernova Pointing Capabilities of DUNE",
    "abstract": "The determination of the direction of a stellar core collapse via its neutrino emission is crucial for the identification of the progenitor for a multimessenger follow-up. A highly effective method of reconstructing supernova directions within the Deep Underground Neutrino Experiment (DUNE) is introduced. The supernova neutrino pointing resolution is studied by simulating and reconstructing electron-neutrino charged-current absorption on 40Ar and elastic scattering of neutrinos on electrons. Procedures to reconstruct individual interactions, including a newly developed technique called ``brems flipping'', as well as the burst direction from an ensemble of interactions are described. Performance of the burst direction reconstruction is evaluated for supernovae happening at a distance of 10 kpc for a specific supernova burst flux model. The pointing resolution is found to be 3.4 degrees at 68% coverage for a perfect interaction-channel classification and a fiducial mass of 40 kton, and 6.6 degrees for a 10 kton fiducial mass respectively. Assuming a 4% rate of charged-current interactions being misidentified as elastic scattering, DUNE's burst pointing resolution is found to be 4.3 degrees (8.7 degrees) at 68% coverage.",
    "authors": [
      "DUNE Collaboration",
      "A. Abed Abud",
      "B. Abi",
      "R. Acciarri",
      "M. A. Acero",
      "M. R. Adames",
      "G. Adamov",
      "M. Adamowski",
      "D. Adams",
      "M. Adinolfi",
      "C. Adriano",
      "A. Aduszkiewicz",
      "J. Aguilar",
      "B. Aimard",
      "F. Akbar",
      "K. Allison",
      "S. Alonso Monsalve",
      "M. Alrashed",
      "A. Alton",
      "R. Alvarez",
      "T. Alves",
      "H. Amar",
      "P. Amedo",
      "J. Anderson",
      "D. A. Andrade",
      "C. Andreopoulos",
      "M. Andreotti",
      "M. P. Andrews",
      "F. Andrianala",
      "S. Andringa",
      "N. Anfimov",
      "A. Ankowski",
      "M. Antoniassi",
      "M. Antonova",
      "A. Antoshkin",
      "A. Aranda-Fernandez",
      "L. Arellano",
      "E. Arrieta Diaz",
      "M. A. Arroyave",
      "J. Asaadi",
      "A. Ashkenazi",
      "D. Asner",
      "L. Asquith",
      "E. Atkin",
      "D. Auguste",
      "A. Aurisano",
      "V. Aushev",
      "D. Autiero",
      "F. Azfar",
      "A. Back",
      "H. Back",
      "J. J. Back",
      "I. Bagaturia",
      "L. Bagby",
      "N. Balashov",
      "S. Balasubramanian",
      "P. Baldi",
      "W. Baldini",
      "J. Baldonedo",
      "B. Baller",
      "B. Bambah",
      "R. Banerjee",
      "F. Barao",
      "G. Barenboim",
      "P. Barham Alzás",
      "G. J. Barker",
      "W. Barkhouse",
      "G. Barr",
      "J. Barranco Monarca",
      "A. Barros",
      "N. Barros",
      "D. Barrow",
      "J. L. Barrow",
      "A. Basharina-Freshville",
      "A. Bashyal",
      "V. Basque",
      "C. Batchelor",
      "L. Bathe-Peters",
      "J. B. R. Battat",
      "F. Battisti",
      "F. Bay",
      "M. C. Q. Bazetto",
      "J. L. L. Bazo Alba",
      "J. F. Beacom",
      "E. Bechetoille",
      "B. Behera",
      "E. Belchior",
      "G. Bell",
      "L. Bellantoni",
      "G. Bellettini",
      "V. Bellini",
      "O. Beltramello",
      "N. Benekos",
      "C. Benitez Montiel",
      "D. Benjamin",
      "F. Bento Neves",
      "J. Berger",
      "S. Berkman",
      "J. Bernal",
      "P. Bernardini",
      "A. Bersani",
      "S. Bertolucci",
      "M. Betancourt",
      "A. Betancur Rodríguez",
      "A. Bevan",
      "Y. Bezawada",
      "A. T. Bezerra",
      "T. J. Bezerra",
      "A. Bhat",
      "V. Bhatnagar",
      "J. Bhatt",
      "M. Bhattacharjee",
      "M. Bhattacharya",
      "S. Bhuller",
      "B. Bhuyan",
      "S. Biagi",
      "J. Bian",
      "K. Biery",
      "B. Bilki",
      "M. Bishai",
      "A. Bitadze",
      "A. Blake",
      "F. D. Blaszczyk",
      "G. C. Blazey",
      "E. Blucher",
      "J. Bogenschuetz",
      "J. Boissevain",
      "S. Bolognesi",
      "T. Bolton",
      "L. Bomben",
      "M. Bonesini",
      "C. Bonilla-Diaz",
      "F. Bonini",
      "A. Booth",
      "F. Boran",
      "S. Bordoni",
      "R. Borges Merlo",
      "A. Borkum",
      "N. Bostan",
      "J. Bracinik",
      "D. Braga",
      "B. Brahma",
      "D. Brailsford",
      "F. Bramati",
      "A. Branca",
      "A. Brandt",
      "J. Bremer",
      "C. Brew",
      "S. J. Brice",
      "V. Brio",
      "C. Brizzolari",
      "C. Bromberg",
      "J. Brooke",
      "A. Bross",
      "G. Brunetti",
      "M. Brunetti",
      "N. Buchanan",
      "H. Budd",
      "J. Buergi",
      "D. Burgardt",
      "S. Butchart",
      "G. Caceres V.",
      "I. Cagnoli",
      "T. Cai",
      "R. Calabrese",
      "J. Calcutt",
      "M. Calin",
      "L. Calivers",
      "E. Calvo",
      "A. Caminata",
      "A. F. Camino",
      "W. Campanelli",
      "A. Campani",
      "A. Campos Benitez",
      "N. Canci",
      "J. Capó",
      "I. Caracas",
      "D. Caratelli",
      "D. Carber",
      "J. M. Carceller",
      "G. Carini",
      "B. Carlus",
      "M. F. Carneiro",
      "P. Carniti",
      "I. Caro Terrazas",
      "H. Carranza",
      "N. Carrara",
      "L. Carroll",
      "T. Carroll",
      "A. Carter",
      "E. Casarejos",
      "D. Casazza",
      "J. F. Castaño Forero",
      "F. A. Castaño",
      "A. Castillo",
      "C. Castromonte",
      "E. Catano-Mur",
      "C. Cattadori",
      "F. Cavalier",
      "F. Cavanna",
      "S. Centro",
      "G. Cerati",
      "C. Cerna",
      "A. Cervelli",
      "A. Cervera Villanueva",
      "K. Chakraborty",
      "S. Chakraborty",
      "M. Chalifour",
      "A. Chappell",
      "N. Charitonidis",
      "A. Chatterjee",
      "H. Chen",
      "M. Chen",
      "W. C. Chen",
      "Y. Chen",
      "Z. Chen-Wishart",
      "D. Cherdack",
      "C. Chi",
      "F. Chiapponi",
      "R. Chirco",
      "N. Chitirasreemadam",
      "K. Cho",
      "S. Choate",
      "D. Chokheli",
      "P. S. Chong",
      "B. Chowdhury",
      "D. Christian",
      "A. Chukanov",
      "M. Chung",
      "E. Church",
      "M. F. Cicala",
      "M. Cicerchia",
      "V. Cicero",
      "R. Ciolini",
      "P. Clarke",
      "G. Cline",
      "T. E. Coan",
      "A. G. Cocco",
      "J. A. B. Coelho",
      "A. Cohen",
      "J. Collazo",
      "J. Collot",
      "E. Conley",
      "J. M. Conrad",
      "M. Convery",
      "S. Copello",
      "P. Cova",
      "C. Cox",
      "L. Cremaldi",
      "L. Cremonesi",
      "J. I. Crespo-Anadón",
      "M. Crisler",
      "E. Cristaldo",
      "J. Crnkovic",
      "G. Crone",
      "R. Cross",
      "A. Cudd",
      "C. Cuesta",
      "Y. Cui",
      "F. Curciarello",
      "D. Cussans",
      "J. Dai",
      "O. Dalager",
      "R. Dallavalle",
      "W. Dallaway",
      "H. da Motta",
      "Z. A. Dar",
      "R. Darby",
      "L. Da Silva Peres",
      "Q. David",
      "G. S. Davies",
      "S. Davini",
      "J. Dawson",
      "R. De Aguiar",
      "P. De Almeida",
      "P. Debbins",
      "I. De Bonis",
      "M. P. Decowski",
      "A. de Gouvêa",
      "P. C. De Holanda",
      "I. L. De Icaza Astiz",
      "P. De Jong",
      "P. Del Amo Sanchez",
      "A. De la Torre",
      "G. De Lauretis",
      "A. Delbart",
      "D. Delepine",
      "M. Delgado",
      "A. Dell'Acqua",
      "G. Delle Monache",
      "N. Delmonte",
      "P. De Lurgio",
      "R. Demario",
      "G. De Matteis",
      "J. R. T. de Mello Neto",
      "D. M. DeMuth",
      "S. Dennis",
      "C. Densham",
      "P. Denton",
      "G. W. Deptuch",
      "A. De Roeck",
      "V. De Romeri",
      "J. P. Detje",
      "J. Devine",
      "R. Dharmapalan",
      "M. Dias",
      "A. Diaz",
      "J. S. Díaz",
      "F. Díaz",
      "F. Di Capua",
      "A. Di Domenico",
      "S. Di Domizio",
      "S. Di Falco",
      "L. Di Giulio",
      "P. Ding",
      "L. Di Noto",
      "E. Diociaiuti",
      "C. Distefano",
      "R. Diurba",
      "M. Diwan",
      "Z. Djurcic",
      "D. Doering",
      "S. Dolan",
      "F. Dolek",
      "M. J. Dolinski",
      "D. Domenici",
      "L. Domine",
      "S. Donati",
      "Y. Donon",
      "S. Doran",
      "D. Douglas",
      "T. A. Doyle",
      "A. Dragone",
      "F. Drielsma",
      "L. Duarte",
      "D. Duchesneau",
      "K. Duffy",
      "K. Dugas",
      "P. Dunne",
      "B. Dutta",
      "H. Duyang",
      "D. A. Dwyer",
      "A. S. Dyshkant",
      "S. Dytman",
      "M. Eads",
      "A. Earle",
      "S. Edayath",
      "D. Edmunds",
      "J. Eisch",
      "P. Englezos",
      "A. Ereditato",
      "T. Erjavec",
      "C. O. Escobar",
      "J. J. Evans",
      "E. Ewart",
      "A. C. Ezeribe",
      "K. Fahey",
      "L. Fajt",
      "A. Falcone",
      "M. Fani'",
      "C. Farnese",
      "S. Farrell",
      "Y. Farzan",
      "D. Fedoseev",
      "J. Felix",
      "Y. Feng",
      "E. Fernandez-Martinez",
      "G. Ferry",
      "L. Fields",
      "P. Filip",
      "A. Filkins",
      "F. Filthaut",
      "R. Fine",
      "G. Fiorillo",
      "M. Fiorini",
      "S. Fogarty",
      "W. Foreman",
      "J. Fowler",
      "J. Franc",
      "K. Francis",
      "D. Franco",
      "J. Franklin",
      "J. Freeman",
      "J. Fried",
      "A. Friedland",
      "S. Fuess",
      "I. K. Furic",
      "K. Furman",
      "A. P. Furmanski",
      "R. Gaba",
      "A. Gabrielli",
      "A. M Gago",
      "F. Galizzi",
      "H. Gallagher",
      "A. Gallas",
      "N. Gallice",
      "V. Galymov",
      "E. Gamberini",
      "T. Gamble",
      "F. Ganacim",
      "R. Gandhi",
      "S. Ganguly",
      "F. Gao",
      "S. Gao",
      "D. Garcia-Gamez",
      "M. Á. García-Peris",
      "F. Gardim",
      "S. Gardiner",
      "D. Gastler",
      "A. Gauch",
      "J. Gauvreau",
      "P. Gauzzi",
      "S. Gazzana",
      "G. Ge",
      "N. Geffroy",
      "B. Gelli",
      "S. Gent",
      "L. Gerlach",
      "Z. Ghorbani-Moghaddam",
      "T. Giammaria",
      "D. Gibin",
      "I. Gil-Botella",
      "S. Gilligan",
      "A. Gioiosa",
      "S. Giovannella",
      "C. Girerd",
      "A. K. Giri",
      "C. Giugliano",
      "V. Giusti",
      "D. Gnani",
      "O. Gogota",
      "S. Gollapinni",
      "K. Gollwitzer",
      "R. A. Gomes",
      "L. V. Gomez Bermeo",
      "L. S. Gomez Fajardo",
      "F. Gonnella",
      "D. Gonzalez-Diaz",
      "M. Gonzalez-Lopez",
      "M. C. Goodman",
      "S. Goswami",
      "C. Gotti",
      "J. Goudeau",
      "E. Goudzovski",
      "C. Grace",
      "E. Gramellini",
      "R. Gran",
      "E. Granados",
      "P. Granger",
      "C. Grant",
      "D. R. Gratieri",
      "G. Grauso",
      "P. Green",
      "S. Greenberg",
      "J. Greer",
      "W. C. Griffith",
      "F. T. Groetschla",
      "K. Grzelak",
      "L. Gu",
      "W. Gu",
      "V. Guarino",
      "M. Guarise",
      "R. Guenette",
      "E. Guerard",
      "M. Guerzoni",
      "D. Guffanti",
      "A. Guglielmi",
      "B. Guo",
      "Y. Guo",
      "A. Gupta",
      "V. Gupta",
      "G. Gurung",
      "D. Gutierrez",
      "P. Guzowski",
      "M. M. Guzzo",
      "S. Gwon",
      "A. Habig",
      "H. Hadavand",
      "L. Haegel",
      "R. Haenni",
      "L. Hagaman",
      "A. Hahn",
      "J. Haiston",
      "J. Hakenmüller",
      "T. Hamernik",
      "P. Hamilton",
      "J. Hancock",
      "F. Happacher",
      "D. A. Harris",
      "J. Hartnell",
      "T. Hartnett",
      "J. Harton",
      "T. Hasegawa",
      "C. Hasnip",
      "R. Hatcher",
      "K. Hayrapetyan",
      "J. Hays",
      "E. Hazen",
      "M. He",
      "A. Heavey",
      "K. M. Heeger",
      "J. Heise",
      "S. Henry",
      "M. A. Hernandez Morquecho",
      "K. Herner",
      "V. Hewes",
      "A. Higuera",
      "C. Hilgenberg",
      "S. J. Hillier",
      "A. Himmel",
      "E. Hinkle",
      "L. R. Hirsch",
      "J. Ho",
      "J. Hoff",
      "A. Holin",
      "T. Holvey",
      "E. Hoppe",
      "S. Horiuchi",
      "G. A. Horton-Smith",
      "M. Hostert",
      "T. Houdy",
      "B. Howard",
      "R. Howell",
      "I. Hristova",
      "M. S. Hronek",
      "J. Huang",
      "R. G. Huang",
      "Z. Hulcher",
      "M. Ibrahim",
      "G. Iles",
      "N. Ilic",
      "A. M. Iliescu",
      "R. Illingworth",
      "G. Ingratta",
      "A. Ioannisian",
      "B. Irwin",
      "L. Isenhower",
      "M. Ismerio Oliveira",
      "R. Itay",
      "C. M. Jackson",
      "V. Jain",
      "E. James",
      "W. Jang",
      "B. Jargowsky",
      "D. Jena",
      "I. Jentz",
      "X. Ji",
      "C. Jiang",
      "J. Jiang",
      "L. Jiang",
      "A. Jipa",
      "F. R. Joaquim",
      "W. Johnson",
      "C. Jollet",
      "B. Jones",
      "R. Jones",
      "D. José Fernández",
      "N. Jovancevic",
      "M. Judah",
      "C. K. Jung",
      "T. Junk",
      "Y. Jwa",
      "M. Kabirnezhad",
      "A. C. Kaboth",
      "I. Kadenko",
      "I. Kakorin",
      "A. Kalitkina",
      "D. Kalra",
      "M. Kandemir",
      "D. M. Kaplan",
      "G. Karagiorgi",
      "G. Karaman",
      "A. Karcher",
      "Y. Karyotakis",
      "S. Kasai",
      "S. P. Kasetti",
      "L. Kashur",
      "I. Katsioulas",
      "A. Kauther",
      "N. Kazaryan",
      "L. Ke",
      "E. Kearns",
      "P. T. Keener",
      "K. J. Kelly",
      "E. Kemp",
      "O. Kemularia",
      "Y. Kermaidic",
      "W. Ketchum",
      "S. H. Kettell",
      "M. Khabibullin",
      "N. Khan",
      "A. Khvedelidze",
      "D. Kim",
      "J. Kim",
      "B. King",
      "B. Kirby",
      "M. Kirby",
      "A. Kish",
      "J. Klein",
      "J. Kleykamp",
      "A. Klustova",
      "T. Kobilarcik",
      "L. Koch",
      "K. Koehler",
      "L. W. Koerner",
      "D. H. Koh",
      "L. Kolupaeva",
      "D. Korablev",
      "M. Kordosky",
      "T. Kosc",
      "U. Kose",
      "V. A. Kostelecký",
      "K. Kothekar",
      "I. Kotler",
      "M. Kovalcuk",
      "V. Kozhukalov",
      "W. Krah",
      "R. Kralik",
      "M. Kramer",
      "L. Kreczko",
      "F. Krennrich",
      "I. Kreslo",
      "T. Kroupova",
      "S. Kubota",
      "M. Kubu",
      "Y. Kudenko",
      "V. A. Kudryavtsev",
      "G. Kufatty",
      "S. Kuhlmann",
      "J. Kumar",
      "P. Kumar",
      "S. Kumaran",
      "P. Kunze",
      "J. Kunzmann",
      "R. Kuravi",
      "N. Kurita",
      "C. Kuruppu",
      "V. Kus",
      "T. Kutter",
      "J. Kvasnicka",
      "T. Labree",
      "T. Lackey",
      "A. Lambert",
      "B. J. Land",
      "C. E. Lane",
      "N. Lane",
      "K. Lang",
      "T. Langford",
      "M. Langstaff",
      "F. Lanni",
      "O. Lantwin",
      "J. Larkin",
      "P. Lasorak",
      "D. Last",
      "A. Laudrain",
      "A. Laundrie",
      "G. Laurenti",
      "E. Lavaut",
      "A. Lawrence",
      "P. Laycock",
      "I. Lazanu",
      "M. Lazzaroni",
      "T. Le",
      "S. Leardini",
      "J. Learned",
      "T. LeCompte",
      "C. Lee",
      "V. Legin",
      "G. Lehmann Miotto",
      "R. Lehnert",
      "M. A. Leigui de Oliveira",
      "M. Leitner",
      "D. Leon Silverio",
      "L. M. Lepin",
      "J. -Y Li",
      "S. W. Li",
      "Y. Li",
      "H. Liao",
      "C. S. Lin",
      "D. Lindebaum",
      "S. Linden",
      "R. A. Lineros",
      "J. Ling",
      "A. Lister",
      "B. R. Littlejohn",
      "H. Liu",
      "J. Liu",
      "Y. Liu",
      "S. Lockwitz",
      "M. Lokajicek",
      "I. Lomidze",
      "K. Long",
      "T. V. Lopes",
      "J. Lopez",
      "I. López de Rego",
      "N. López-March",
      "T. Lord",
      "J. M. LoSecco",
      "W. C. Louis",
      "A. Lozano Sanchez",
      "X. -G. Lu",
      "K. B. Luk",
      "B. Lunday",
      "X. Luo",
      "E. Luppi",
      "J. Maalmi",
      "D. MacFarlane",
      "A. A. Machado",
      "P. Machado",
      "C. T. Macias",
      "J. R. Macier",
      "M. MacMahon",
      "A. Maddalena",
      "A. Madera",
      "P. Madigan",
      "S. Magill",
      "C. Magueur",
      "K. Mahn",
      "A. Maio",
      "A. Major",
      "K. Majumdar",
      "M. Man",
      "R. C. Mandujano",
      "J. Maneira",
      "S. Manly",
      "A. Mann",
      "K. Manolopoulos",
      "M. Manrique Plata",
      "S. Manthey Corchado",
      "V. N. Manyam",
      "M. Marchan",
      "A. Marchionni",
      "W. Marciano",
      "D. Marfatia",
      "C. Mariani",
      "J. Maricic",
      "F. Marinho",
      "A. D. Marino",
      "T. Markiewicz",
      "F. Das Chagas Marques",
      "C. Marquet",
      "D. Marsden",
      "M. Marshak",
      "C. M. Marshall",
      "J. Marshall",
      "L. Martina",
      "J. Martín-Albo",
      "N. Martinez",
      "D. A. Martinez Caicedo",
      "F. Martínez López",
      "P. Martínez Miravé",
      "S. Martynenko",
      "V. Mascagna",
      "C. Massari",
      "A. Mastbaum",
      "F. Matichard",
      "S. Matsuno",
      "G. Matteucci",
      "J. Matthews",
      "C. Mauger",
      "N. Mauri",
      "K. Mavrokoridis",
      "I. Mawby",
      "R. Mazza",
      "A. Mazzacane",
      "T. McAskill",
      "N. McConkey",
      "K. S. McFarland",
      "C. McGrew",
      "A. McNab",
      "L. Meazza",
      "V. C. N. Meddage",
      "B. Mehta",
      "P. Mehta",
      "P. Melas",
      "O. Mena",
      "H. Mendez",
      "P. Mendez",
      "D. P. Méndez",
      "A. Menegolli",
      "G. Meng",
      "A. C. E. A. Mercuri",
      "A. Meregaglia",
      "M. D. Messier",
      "S. Metallo",
      "J. Metcalf",
      "W. Metcalf",
      "M. Mewes",
      "H. Meyer",
      "T. Miao",
      "A. Miccoli",
      "G. Michna",
      "V. Mikola",
      "R. Milincic",
      "F. Miller",
      "G. Miller",
      "W. Miller",
      "O. Mineev",
      "A. Minotti",
      "L. Miralles",
      "O. G. Miranda",
      "C. Mironov",
      "S. Miryala",
      "S. Miscetti",
      "C. S. Mishra",
      "S. R. Mishra",
      "A. Mislivec",
      "M. Mitchell",
      "D. Mladenov",
      "I. Mocioiu",
      "A. Mogan",
      "N. Moggi",
      "R. Mohanta",
      "T. A. Mohayai",
      "N. Mokhov",
      "J. Molina",
      "L. Molina Bueno",
      "E. Montagna",
      "A. Montanari",
      "C. Montanari",
      "D. Montanari",
      "D. Montanino",
      "L. M. Montaño Zetina",
      "M. Mooney",
      "A. F. Moor",
      "Z. Moore",
      "D. Moreno",
      "O. Moreno-Palacios",
      "L. Morescalchi",
      "D. Moretti",
      "R. Moretti",
      "C. Morris",
      "C. Mossey",
      "M. Mote",
      "C. A. Moura",
      "G. Mouster",
      "W. Mu",
      "L. Mualem",
      "J. Mueller",
      "M. Muether",
      "F. Muheim",
      "A. Muir",
      "M. Mulhearn",
      "D. Munford",
      "L. J. Munteanu",
      "H. Muramatsu",
      "J. Muraz",
      "M. Murphy",
      "T. Murphy",
      "J. Muse",
      "A. Mytilinaki",
      "J. Nachtman",
      "Y. Nagai",
      "S. Nagu",
      "R. Nandakumar",
      "D. Naples",
      "S. Narita",
      "A. Nath",
      "A. Navrer-Agasson",
      "N. Nayak",
      "M. Nebot-Guinot",
      "A. Nehm",
      "J. K. Nelson",
      "O. Neogi",
      "J. Nesbit",
      "M. Nessi",
      "D. Newbold",
      "M. Newcomer",
      "R. Nichol",
      "F. Nicolas-Arnaldos",
      "A. Nikolica",
      "J. Nikolov",
      "E. Niner",
      "K. Nishimura",
      "A. Norman",
      "A. Norrick",
      "P. Novella",
      "J. A. Nowak",
      "M. Oberling",
      "J. P. Ochoa-Ricoux",
      "S. Oh",
      "S. B. Oh",
      "A. Olivier",
      "A. Olshevskiy",
      "T. Olson",
      "Y. Onel",
      "Y. Onishchuk",
      "A. Oranday",
      "M. Osbiston",
      "J. A. Osorio Vélez",
      "L. Otiniano Ormachea",
      "J. Ott",
      "L. Pagani",
      "G. Palacio",
      "O. Palamara",
      "S. Palestini",
      "J. M. Paley",
      "M. Pallavicini",
      "C. Palomares",
      "S. Pan",
      "P. Panda",
      "W. Panduro Vazquez",
      "E. Pantic",
      "V. Paolone",
      "V. Papadimitriou",
      "R. Papaleo",
      "A. Papanestis",
      "D. Papoulias",
      "S. Paramesvaran",
      "A. Paris",
      "S. Parke",
      "E. Parozzi",
      "S. Parsa",
      "Z. Parsa",
      "S. Parveen",
      "M. Parvu",
      "D. Pasciuto",
      "S. Pascoli",
      "L. Pasqualini",
      "J. Pasternak",
      "C. Patrick",
      "L. Patrizii",
      "R. B. Patterson",
      "T. Patzak",
      "A. Paudel",
      "L. Paulucci",
      "Z. Pavlovic",
      "G. Pawloski",
      "D. Payne",
      "V. Pec",
      "E. Pedreschi",
      "S. J. M. Peeters",
      "W. Pellico",
      "A. Pena Perez",
      "E. Pennacchio",
      "A. Penzo",
      "O. L. G. Peres",
      "Y. F. Perez Gonzalez",
      "L. Pérez-Molina",
      "C. Pernas",
      "J. Perry",
      "D. Pershey",
      "G. Pessina",
      "G. Petrillo",
      "C. Petta",
      "R. Petti",
      "M. Pfaff",
      "V. Pia",
      "L. Pickering",
      "F. Pietropaolo",
      "V. L. Pimentel",
      "G. Pinaroli",
      "J. Pinchault",
      "K. Pitts",
      "K. Plows",
      "R. Plunkett",
      "C. Pollack",
      "T. Pollman",
      "D. Polo-Toledo",
      "F. Pompa",
      "X. Pons",
      "N. Poonthottathil",
      "V. Popov",
      "F. Poppi",
      "J. Porter",
      "M. Potekhin",
      "R. Potenza",
      "J. Pozimski",
      "M. Pozzato",
      "T. Prakash",
      "C. Pratt",
      "M. Prest",
      "F. Psihas",
      "D. Pugnere",
      "X. Qian",
      "J. Queen",
      "J. L. Raaf",
      "V. Radeka",
      "J. Rademacker",
      "B. Radics",
      "A. Rafique",
      "E. Raguzin",
      "M. Rai",
      "S. Rajagopalan",
      "M. Rajaoalisoa",
      "I. Rakhno",
      "L. Rakotondravohitra",
      "L. Ralte",
      "M. A. Ramirez Delgado",
      "B. Ramson",
      "A. Rappoldi",
      "G. Raselli",
      "P. Ratoff",
      "R. Ray",
      "H. Razafinime",
      "E. M. Rea",
      "J. S. Real",
      "B. Rebel",
      "R. Rechenmacher",
      "M. Reggiani-Guzzo",
      "J. Reichenbacher",
      "S. D. Reitzner",
      "H. Rejeb Sfar",
      "E. Renner",
      "A. Renshaw",
      "S. Rescia",
      "F. Resnati",
      "Diego Restrepo",
      "C. Reynolds",
      "M. Ribas",
      "S. Riboldi",
      "C. Riccio",
      "G. Riccobene",
      "J. S. Ricol",
      "M. Rigan",
      "E. V. Rincón",
      "A. Ritchie-Yates",
      "S. Ritter",
      "D. Rivera",
      "R. Rivera",
      "A. Robert",
      "J. L. Rocabado Rocha",
      "L. Rochester",
      "M. Roda",
      "P. Rodrigues",
      "M. J. Rodriguez Alonso",
      "A. J. Roeth",
      "J. Rodriguez Rondon",
      "S. Rosauro-Alcaraz",
      "P. Rosier",
      "D. Ross",
      "M. Rossella",
      "M. Rossi",
      "M. Ross-Lonergan",
      "N. Roy",
      "P. Roy",
      "C. Rubbia",
      "A. Ruggeri",
      "G. Ruiz Ferreira",
      "B. Russell",
      "D. Ruterbories",
      "A. Rybnikov",
      "A. Saa-Hernandez",
      "R. Saakyan",
      "S. Sacerdoti",
      "S. K. Sahoo",
      "N. Sahu",
      "P. Sala",
      "N. Samios",
      "O. Samoylov",
      "M. C. Sanchez",
      "A. Sánchez Bravo",
      "P. Sanchez-Lucas",
      "V. Sandberg",
      "D. A. Sanders",
      "S. Sanfilippo",
      "D. Sankey",
      "D. Santoro",
      "N. Saoulidou",
      "P. Sapienza",
      "C. Sarasty",
      "I. Sarcevic",
      "I. Sarra",
      "G. Savage",
      "V. Savinov",
      "G. Scanavini",
      "A. Scaramelli",
      "A. Scarff",
      "T. Schefke",
      "H. Schellman",
      "S. Schifano",
      "P. Schlabach",
      "D. Schmitz",
      "A. W. Schneider",
      "K. Scholberg",
      "A. Schukraft",
      "B. Schuld",
      "A. Segade",
      "E. Segreto",
      "A. Selyunin",
      "C. R. Senise",
      "J. Sensenig",
      "M. H. Shaevitz",
      "P. Shanahan",
      "P. Sharma",
      "R. Kumar",
      "K. Shaw",
      "T. Shaw",
      "K. Shchablo",
      "J. Shen",
      "C. Shepherd-Themistocleous",
      "A. Sheshukov",
      "W. Shi",
      "S. Shin",
      "S. Shivakoti",
      "I. Shoemaker",
      "D. Shooltz",
      "R. Shrock",
      "B. Siddi",
      "M. Siden",
      "J. Silber",
      "L. Simard",
      "J. Sinclair",
      "G. Sinev",
      "Jaydip Singh",
      "J. Singh",
      "L. Singh",
      "P. Singh",
      "V. Singh",
      "S. Singh Chauhan",
      "R. Sipos",
      "C. Sironneau",
      "G. Sirri",
      "K. Siyeon",
      "K. Skarpaas",
      "J. Smedley",
      "E. Smith",
      "J. Smith",
      "P. Smith",
      "J. Smolik",
      "M. Smy",
      "M. Snape",
      "E. L. Snider",
      "P. Snopok",
      "D. Snowden-Ifft",
      "M. Soares Nunes",
      "H. Sobel",
      "M. Soderberg",
      "S. Sokolov",
      "C. J. Solano Salinas",
      "S. Söldner-Rembold",
      "S. R. Soleti",
      "N. Solomey",
      "V. Solovov",
      "W. E. Sondheim",
      "M. Sorel",
      "A. Sotnikov",
      "J. Soto-Oton",
      "A. Sousa",
      "K. Soustruznik",
      "F. Spinella",
      "J. Spitz",
      "N. J. C. Spooner",
      "K. Spurgeon",
      "D. Stalder",
      "M. Stancari",
      "L. Stanco",
      "J. Steenis",
      "R. Stein",
      "H. M. Steiner",
      "A. F. Steklain Lisbôa",
      "A. Stepanova",
      "J. Stewart",
      "B. Stillwell",
      "J. Stock",
      "F. Stocker",
      "T. Stokes",
      "M. Strait",
      "T. Strauss",
      "L. Strigari",
      "A. Stuart",
      "J. G. Suarez",
      "J. Subash",
      "A. Surdo",
      "L. Suter",
      "C. M. Sutera",
      "K. Sutton",
      "Y. Suvorov",
      "R. Svoboda",
      "S. K. Swain",
      "B. Szczerbinska",
      "A. M. Szelc",
      "A. Sztuc",
      "A. Taffara",
      "N. Talukdar",
      "J. Tamara",
      "H. A. Tanaka",
      "S. Tang",
      "N. Taniuchi",
      "A. M. Tapia Casanova",
      "B. Tapia Oregui",
      "A. Tapper",
      "S. Tariq",
      "E. Tarpara",
      "E. Tatar",
      "R. Tayloe",
      "D. Tedeschi",
      "A. M. Teklu",
      "J. Tena Vidal",
      "P. Tennessen",
      "M. Tenti",
      "K. Terao",
      "F. Terranova",
      "G. Testera",
      "T. Thakore",
      "A. Thea",
      "A. Thiebault",
      "S. Thomas",
      "A. Thompson",
      "C. Thorn",
      "S. C. Timm",
      "E. Tiras",
      "V. Tishchenko",
      "N. Todorović",
      "L. Tomassetti",
      "A. Tonazzo",
      "D. Torbunov",
      "M. Torti",
      "M. Tortola",
      "F. Tortorici",
      "N. Tosi",
      "D. Totani",
      "M. Toups",
      "C. Touramanis",
      "D. Tran",
      "R. Travaglini",
      "J. Trevor",
      "E. Triller",
      "S. Trilov",
      "J. Truchon",
      "D. Truncali",
      "W. H. Trzaska",
      "Y. Tsai",
      "Y. -T. Tsai",
      "Z. Tsamalaidze",
      "K. V. Tsang",
      "N. Tsverava",
      "S. Z. Tu",
      "S. Tufanli",
      "C. Tunnell",
      "J. Turner",
      "M. Tuzi",
      "J. Tyler",
      "E. Tyley",
      "M. Tzanov",
      "M. A. Uchida",
      "J. Ureña González",
      "J. Urheim",
      "T. Usher",
      "H. Utaegbulam",
      "S. Uzunyan",
      "M. R. Vagins",
      "P. Vahle",
      "S. Valder",
      "G. A. Valdiviesso",
      "E. Valencia",
      "R. Valentim",
      "Z. Vallari",
      "E. Vallazza",
      "J. W. F. Valle",
      "R. Van Berg",
      "R. G. Van de Water",
      "D. V. Forero",
      "A. Vannozzi",
      "M. Van Nuland-Troost",
      "F. Varanini",
      "D. Vargas Oliva",
      "S. Vasina",
      "N. Vaughan",
      "K. Vaziri",
      "A. Vázquez-Ramos",
      "J. Vega",
      "S. Ventura",
      "A. Verdugo",
      "S. Vergani",
      "M. Verzocchi",
      "K. Vetter",
      "M. Vicenzi",
      "H. Vieira de Souza",
      "C. Vignoli",
      "C. Vilela",
      "E. Villa",
      "S. Viola",
      "B. Viren",
      "A. Vizcaya-Hernandez",
      "T. Vrba",
      "Q. Vuong",
      "A. V. Waldron",
      "M. Wallbank",
      "J. Walsh",
      "T. Walton",
      "H. Wang",
      "J. Wang",
      "L. Wang",
      "M. H. L. S. Wang",
      "X. Wang",
      "Y. Wang",
      "K. Warburton",
      "D. Warner",
      "L. Warsame",
      "M. O. Wascko",
      "D. Waters",
      "A. Watson",
      "K. Wawrowska",
      "A. Weber",
      "C. M. Weber",
      "M. Weber",
      "H. Wei",
      "A. Weinstein",
      "H. Wenzel",
      "S. Westerdale",
      "M. Wetstein",
      "K. Whalen",
      "J. Whilhelmi",
      "A. White",
      "A. White",
      "L. H. Whitehead",
      "D. Whittington",
      "M. J. Wilking",
      "A. Wilkinson",
      "C. Wilkinson",
      "F. Wilson",
      "R. J. Wilson",
      "P. Winter",
      "W. Wisniewski",
      "J. Wolcott",
      "J. Wolfs",
      "T. Wongjirad",
      "A. Wood",
      "K. Wood",
      "E. Worcester",
      "M. Worcester",
      "M. Wospakrik",
      "K. Wresilo",
      "C. Wret",
      "S. Wu",
      "W. Wu",
      "W. Wu",
      "M. Wurm",
      "J. Wyenberg",
      "Y. Xiao",
      "I. Xiotidis",
      "B. Yaeggy",
      "N. Yahlali",
      "E. Yandel",
      "K. Yang",
      "T. Yang",
      "A. Yankelevich",
      "N. Yershov",
      "K. Yonehara",
      "T. Young",
      "B. Yu",
      "H. Yu",
      "J. Yu",
      "Y. Yu",
      "W. Yuan",
      "R. Zaki",
      "J. Zalesak",
      "L. Zambelli",
      "B. Zamorano",
      "A. Zani",
      "O. Zapata",
      "L. Zazueta",
      "G. P. Zeller",
      "J. Zennamo",
      "K. Zeug",
      "C. Zhang",
      "S. Zhang",
      "M. Zhao",
      "E. Zhivun",
      "E. D. Zimmerman",
      "S. Zucchelli",
      "J. Zuklin",
      "V. Zutshi",
      "R. Zwaska"
    ],
    "published": "2024-07-14T21:40:45Z",
    "updated": "2025-12-24T16:31:42Z",
    "categories": [
      "hep-ex",
      "astro-ph.HE",
      "astro-ph.IM",
      "astro-ph.SR",
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2511.05468v2",
    "url": "https://arxiv.org/abs/2511.05468v2",
    "pdf_url": "https://arxiv.org/pdf/2511.05468v2.pdf",
    "title": "Identification of tau leptons using a convolutional neural network with domain adaptation",
    "abstract": "A tau lepton identification algorithm, DeepTau, based on convolutional neural network techniques, has been developed in the CMS experiment to discriminate reconstructed hadronic decays of tau leptons ($τ_\\mathrm{h}$) from quark or gluon jets and electrons and muons that are misreconstructed as $τ_\\mathrm{h}$ candidates. The latest version of this algorithm, v2.5, includes domain adaptation by backpropagation, a technique that reduces discrepancies between collision data and simulation in the region with the highest purity of genuine $τ_\\mathrm{h}$ candidates. Additionally, a refined training workflow improves classification performance with respect to the previous version of the algorithm, with a reduction of 30$-$50% in the probability for quark and gluon jets to be misidentified as $τ_\\mathrm{h}$ candidates for given reconstruction and identification efficiencies. This paper presents the novel improvements introduced in the DeepTau algorithm and evaluates its performance in LHC proton-proton collision data at $\\sqrt{s}$ = 13 and 13.6 TeV collected in 2018 and 2022 with integrated luminosities of 60 and 35 fb$^{-1}$, respectively. Techniques to calibrate the performance of the $τ_\\mathrm{h}$ identification algorithm in simulation with respect to its measured performance in real data are presented, together with a subset of results among those measured for use in CMS physics analyses.",
    "authors": [
      "CMS Collaboration"
    ],
    "published": "2025-11-07T18:22:56Z",
    "updated": "2025-12-24T15:03:51Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1088/1748-0221/20/12/P12032"
  },
  {
    "arxiv_id": "2512.21212v1",
    "url": "https://arxiv.org/abs/2512.21212v1",
    "pdf_url": "https://arxiv.org/pdf/2512.21212v1.pdf",
    "title": "Study of laser-beam arrival time synchronization towards sub-picosecond stability level",
    "abstract": "A precise synchronization between laser pulse and electron beam arrival time is essential for achieving sub-picosecond stability in modern accelerator facilities. In this work, a Low-Level RF system architecture combined with White Rabbit based timing system has been tested through a collaboration between KEK (Japan) and CNRS/IN2P3, IJClab (France). The setup combines a frequency standard generator, an IDROGEN carrier board with an embedded White Rabbit node, and SkyWorks synthesizers of different form factors to distribute phase-locked clock signals over telecommunication fiber. Phase noise power spectral density measurements were performed at several RF sub-harmonics to confirm synchronization performance. These results demonstrate the feasibility of implementing the White Rabbit-IDROGEN synchronization scheme for large-scale accelerators, including applications to laser-based diagnostics.",
    "authors": [
      "Konstantin Popov",
      "Hiroshi Kaji",
      "Tetsuya Kobayashi",
      "Aurelien Martens",
      "Daniel Charlet",
      "Cedric Esnault",
      "Antoine Back",
      "Paul-Eric Pottie",
      "Fabian Zomer",
      "Alexander Aryshev"
    ],
    "published": "2025-12-24T14:53:51Z",
    "updated": "2025-12-24T14:53:51Z",
    "categories": [
      "physics.acc-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.21207v1",
    "url": "https://arxiv.org/abs/2512.21207v1",
    "pdf_url": "https://arxiv.org/pdf/2512.21207v1.pdf",
    "title": "Operation of a tunable Power over Fiber system for light detectors down to 4.6 K",
    "abstract": "The Power over Fiber (PoF) technology delivers electrical power by transmitting laser light through a lightweight, non-conductive fiber optic cable to a remote photovoltaic optical converter, which in turn powers sensors or electrical devices. Among the several advantages offered by this solution are spark-free operation in the presence of electric fields, elimination of noise induced by power lines, immunity to electromagnetic interference, and high robustness in hostile environments. The R\\&D for the application of PoF in cryogenic environments started at FNAL and BNL (USA) in 2020 to power the Photon Detection System of the DUNE Vertical Drift module. This paper presents the results obtained in the framework of Cryo-PoF project where we developed a single-laser input line system to power an electronic amplifier and the photosensors at cryogenic temperatures. Unlike the DUNE solution, our system allows tuning of the photosensor bias by adjusting the input laser power. We also demonstrate the operation of the optical converter at temperatures down to 4.6 K, opening the possibility of using this technology in a much broader range of applications.",
    "authors": [
      "A. Andreani",
      "C. Brizzolari",
      "E. J. Cristaldo Morales",
      "M. J. Delgado Gonzales",
      "A. Falcone",
      "N. Gallice",
      "C. Gotti",
      "M. Lazzaroni",
      "L. Meazza",
      "G. Pessina",
      "D. Santoro",
      "F. Terranova",
      "M. Torti",
      "V. Trabattoni"
    ],
    "published": "2025-12-24T14:37:49Z",
    "updated": "2025-12-24T14:37:49Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.21122v1",
    "url": "https://arxiv.org/abs/2512.21122v1",
    "pdf_url": "https://arxiv.org/pdf/2512.21122v1.pdf",
    "title": "Quantum Origin of Classical Background Fields from Coherent States: A First-Principles Formulation in QED",
    "abstract": "Classical background electromagnetic fields are routinely employed in quantum electrodynamics to describe a wide range of physical situations, from laser-matter interactions to strong-field phenomena. In this work, we present a first-principles formulation that clarifies the quantum origin of such classical background fields in QED by systematically deriving them from coherent states of the electromagnetic field.   Abstract Starting from the operator formulation of QED, we show how scattering amplitudes between coherent states naturally lead to an effective description in terms of background fields, while maintaining a clear separation between the coherent laser mode and other quantized photon degrees of freedom. This framework allows one to consistently incorporate effects beyond the fixed background approximation, such as depletion and backreaction, without assuming any particular field strength or intensity regime.   Abstract We further demonstrate how the conventional generating functional with a prescribed background field emerges as a limiting case, corresponding to fixed coherent state boundary conditions. The path integral representation is then obtained as a reformulation of the same underlying Heisenberg picture amplitudes, providing a unified view of operator-based and functional approaches.   Abstract Our results establish a general and intensity-independent foundation for QED with coherent background fields, within which the standard formulations of strong-field QED arise as well-defined special cases.",
    "authors": [
      "Keita Seto"
    ],
    "published": "2025-12-24T11:49:53Z",
    "updated": "2025-12-24T11:49:53Z",
    "categories": [
      "physics.plasm-ph",
      "hep-ph",
      "physics.optics",
      "quant-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.14790v2",
    "url": "https://arxiv.org/abs/2511.14790v2",
    "pdf_url": "https://arxiv.org/pdf/2511.14790v2.pdf",
    "title": "On the Theory of Bulk Viscosity of Cold Plasmas",
    "abstract": "Solving the kinetic equation for ionization-recombination processes in cold plasmas for temperatures much lower than the first ionization potentials, we derive an explicit expression for the bulk viscosity. We obtain that bulk viscosity can be many order of magnitude bigger than the shear viscosity. Our result for the relaxation time reveals that the Mandelstam-Leontovich approximation for the frequency dependence of the bulk viscosity is in practice an exact result for the cold plasmas. The illustrative numerical examples correspond to the plasma cocktail of the solar chromosphere at the height of the minimal polytropic index. The possible application for the acoustic heating of the inner solar atmosphere up to the transition region is shortly discussed together with the evaluation to confirm the theory by laboratory plasmas.",
    "authors": [
      "Albert M. Varonov",
      "Todor M. Mishonov"
    ],
    "published": "2025-11-14T08:58:45Z",
    "updated": "2025-12-24T10:28:49Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR",
      "physics.chem-ph",
      "physics.flu-dyn"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.21082v1",
    "url": "https://arxiv.org/abs/2512.21082v1",
    "pdf_url": "https://arxiv.org/pdf/2512.21082v1.pdf",
    "title": "Electron spectral shape of the third-forbidden $β$-decay of $^{87}$Rb measured using a Rb$_2$ZrCl$_6$ crystal scintillator",
    "abstract": "In recent years, interest in experimental studies of $β$-decay electron spectra -- often referred to as $β$ spectra -- has been growing. This is particularly true for $β$ transitions where the electron spectra are sensitive to the effective value of the weak axial coupling, $g_{\\rm A}$. Such measurements serve as important benchmarks for nuclear physics calculations and can also be used to characterize background in astroparticle physics experiments. In this work, a dedicated experiment has been carried out to investigate the spectral shape of the third-forbidden $^{87}$Rb $β$-decays, with the goal of estimating the effective $g_{\\rm A}$ value for this transition and of deriving the T$_{1/2}$ value. This was done by comparing the experimental spectral shape with the estimates from various phenomenological models. The $^{87}$Rb source was embedded directly within the detector material of a new Rb$_2$ZrCl$_6$ crystal scintillator; the data taking was performed deep underground at Gran Sasso National Laboratory. The obtained experimental half-life value for the studied process is T$_{1/2} = 5.08(13) \\times$ 10$^{10}$ yr; while a $g_{\\rm A}$ value in the range 0.4 to 0.6 is obtained when accounting for uncertainties and depending on the model adopted as discussed in detail in the text.",
    "authors": [
      "P. Belli",
      "R. Bernabei",
      "F. Cappella",
      "V. Caracciolo",
      "R. Cerulli",
      "A. Incicchitti",
      "A. Leoncini",
      "V. Merlo",
      "S. S. Nagorny",
      "V. V. Nahorna",
      "S. Nisi",
      "P. Wang",
      "J. Suhonen",
      "M. Ramalho",
      "J. Kostensalo"
    ],
    "published": "2025-12-24T09:57:42Z",
    "updated": "2025-12-24T09:57:42Z",
    "categories": [
      "nucl-ex",
      "hep-ex",
      "nucl-th",
      "physics.ins-det"
    ],
    "primary_category": "nucl-ex"
  },
  {
    "arxiv_id": "2512.20947v1",
    "url": "https://arxiv.org/abs/2512.20947v1",
    "pdf_url": "https://arxiv.org/pdf/2512.20947v1.pdf",
    "title": "The throttling refrigeration system for the large cooling power recovery of the PandaX-xT cryogenic distillation system for radon removal",
    "abstract": "In order to solve the continuous large cooling power supply problem (20 kW) for the radon-removal cryogenic distillation system, which operates at high liquid ffow rate of 856 kg/h (5 LPM) for the dark matter detector PandaX-xT of the next-generation, a throttling refrigeration system based on carbon tetraffuoride (R14) refrigerant for cooling power recovery is designed and developed. According to this system, the cooling power of the liquid xenon in the reboiler of 178K could be transferred to the product xenon cryostat to liquefy the gaseous product xenon by the R14 circulation, thus the liqueffed xenon could return to the detector with the same condition of which extracted from the detector to form a stable cooling cycle and prevent the instability of the detector. A research and development experiment is implemented to validate the feasibility of this large cooling recovery system, using the ethanol to simulate the liquid xenon. Experimental results show that the cooling power recovery of this system could achieve 17 kW with the efffciency of 76.5%, and the R14 ffow rate is 0.16 kg/s. This study realizes the online radon removal distillation with large ffow rate while eliminating the dependence of liquid nitrogen or cryocoolers, which means saving 2414 m3 liquid nitrogen per year or the power consumption of 230 kW. Furthermore, process simulation and optimization of the throttling refrigeration cycle is studied using Aspen Hysys to reveal the inffuences of the key parameters to the system, and the deviation between the simulation and experimental results is < 2.52%.",
    "authors": [
      "Shunyu Yao",
      "Zhou Wang",
      "Kangkang Zhao",
      "Zhi Zheng",
      "Haoyu Wang",
      "Xiangyi Cui",
      "Tao Zhang",
      "Li Zhao",
      "Huaikuang Ding",
      "Wenbing Tao",
      "Xiang Xiao",
      "Shaobo Wang",
      "Yonglin Ju",
      "Jianglai Liu",
      "Xiangdong Ji",
      "Shuaijie Li",
      "Manbin Shen",
      "Chengbo Du"
    ],
    "published": "2025-12-24T05:06:47Z",
    "updated": "2025-12-24T05:06:47Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.20935v1",
    "url": "https://arxiv.org/abs/2512.20935v1",
    "pdf_url": "https://arxiv.org/pdf/2512.20935v1.pdf",
    "title": "Spectroscopy of VUV luminescence in dual-phase xenon detectors",
    "abstract": "We present spectroscopic measurements of xenon luminescence in a time projection chamber operated in a dual-phase (liquid-gas) configuration. Thorium-228 $α$ decays excited the liquid, resulting in the formation of singlet and triplet excimers that emit vacuum ultraviolet (VUV) scintillation. Ionisation electrons were drifted to the liquid surface and extracted into the vapour, where they produced VUV electroluminescence. A time-resolved photon-counting technique was used to obtain the scintillation spectrum in the liquid, which exhibited a peak wavelength of $177.1\\pm0.1_\\mathrm{stat} \\pm0.1_\\mathrm{sys}\\,\\textrm{nm}$ and a full-width at half maximum (FWHM) of $11.3\\pm0.2_\\mathrm{stat} \\pm0.0_\\mathrm{sys}\\,\\textrm{nm}$. The data were also used to obtain distinct singlet and triplet emission models, with the singlet emission peaking $1.8\\pm0.3_{\\mathrm{stat}}\\pm 0.3_{\\mathrm{sys}}\\,\\textrm{nm}$ shorter than the triplet. The gas electroluminescence spectrum was obtained simultaneously, while under conditions of thermal equilibrium. It remained consistent across vapour pressures of $1.3$-$2.2\\,\\textrm{bar}$, with a peak of $173.28\\pm0.02_\\mathrm{stat} {_{-0.1}^{+0.2}}{}_\\mathrm{sys}\\,\\textrm{nm}$, a FWHM of $10.59\\pm0.03_\\mathrm{stat} {_{-0.2}^{+0.0}}{}_\\mathrm{sys}\\,\\textrm{nm}$, and a small short-wavelength tail that constitutes $(0.6\\pm0.1)$% of the total spectrum. These are the only spectroscopic measurements of liquid scintillation and gas electroluminescence acquired simultaneously to date, and the first such measurements of singlet and triplet emission in the liquid phase. They are important for precisely characterising dual-phase xenon detectors used to search for dark matter particle interactions and other rare events.",
    "authors": [
      "K. C. Oliver-Mallory",
      "A. M. Baker",
      "E. Jacquet",
      "T. J. Sumner",
      "H. M. Araujo"
    ],
    "published": "2025-12-24T04:30:41Z",
    "updated": "2025-12-24T04:30:41Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.20875v1",
    "url": "https://arxiv.org/abs/2512.20875v1",
    "pdf_url": "https://arxiv.org/pdf/2512.20875v1.pdf",
    "title": "On the Relationship Between Nanoflare Energy and Delay in the Closed Solar Corona",
    "abstract": "Determining the relationship between nanoflare energies and their delays is the key for understanding the physical mechanism of the events and the plasma response. Nanoflares analyzed in this study were generated self-consistently via prescribed photospheric motions in a 3D multi-strand simulation of a subset of active region magnetic flux. Energies and durations were quantified using three distinct methods. In this study, we investigated the correlation between nanoflare energies (E) and delays ($τ_D$) using two non-parametric, rank-based statistical tests. Across all methods, results consistently show little to no correlation. This is further supported by the distribution of the exponent $α$ in the assumed relation $E \\propto τ_D^α$, which peaks near zero, and by broad delay distributions within fixed energy bins. These findings are irrespective of whether delays are correlated with the energy of the preceding or subsequent event. They also hold for a subset of high-energy nanoflares. The absence of correlation suggests that nanoflare onset is not solely determined by a critical value of magnetic stress and may involve triggering by other events, perhaps related to a locally complex topology.",
    "authors": [
      "Shanwlee Sow Mondal",
      "James A. Klimchuk",
      "Craig D. Johnston",
      "Lars K. S. Daldorff"
    ],
    "published": "2025-12-24T01:35:52Z",
    "updated": "2025-12-24T01:35:52Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2512.20852v1",
    "url": "https://arxiv.org/abs/2512.20852v1",
    "pdf_url": "https://arxiv.org/pdf/2512.20852v1.pdf",
    "title": "Calibration of an Irradiated Prototype for the EIC Zero-Degree Calorimeter",
    "abstract": "We study the response of a prototype Zero-Degree Calorimeter (ZDC) detector to irradiation equivalent to 10$^{11}$ 1-MeV protons/cm$^2$, which matches the expected exposure after one year of operation at full nominal luminosity at the future Electron-Ion Collider (EIC). The prototype consists of 563 channels and represents about 10 percent of the final ZDC design in terms of both channel count and detector volume. It was irradiated at the NASA Space Radiation Laboratory (NSRL) at Brookhaven National Laboratory (BNL) with a dose equivalent to 10$^{11}$ protons/cm$^2$. We demonstrate that, despite significant radiation damage to the SiPMs and non-uniform degradation across the detector volume, the detector can be successfully calibrated on a channel-by-channel basis using cosmic-ray data. The damage profile, similar to what is expected in the experiment, varies by an order of magnitude or more across the detector. Even for the most heavily damaged channels, the signal-to-noise ratio for a MIP signal remains above 5. This study provides a realistic test of the system's performance under irradiation. It complements previous SiPM-specific irradiation studies and will inform the future operation of the ZDC and other detectors that use SiPM-on-tile technology.",
    "authors": [
      "Weibin Zhang",
      "Xilin Liang",
      "Sean Preins",
      "Miguel Arratia"
    ],
    "published": "2025-12-24T00:13:14Z",
    "updated": "2025-12-24T00:13:14Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  }
]