{
  "arxiv_id": "2601.10694v1",
  "url": "https://arxiv.org/abs/2601.10694v1",
  "pdf_url": "https://arxiv.org/pdf/2601.10694v1.pdf",
  "title": "Increasing the opening speed of the plasma opening switch on an direct action accelerator with an inductive energy storage device",
  "abstract": "To increase the voltage multiplication factor in a small-sized direct-acting electron accelerator DIN-2K with an inductive energy storage and a plasma opening switch, it is necessary to ensure an increase in the rate of change of the current and its amplitude during the POS opening for the purpose of obtaining an explosive electron emission with the formation of an electron beam and a virtual cathode. However, the opening process depends on many electrical parameters of the plant, and it re-quires determining their joint and individual effect on its dynamics. The purpose of this research is to study and determine the effects of electrical parameters, including those of the discharge voltages of the entire electrical circuit of the accelerator on the dynamics of the plasma opening switch, in particular opening speed, current amplitudes, and opening time, as well as to give recommendations on optimizing the operation of accelerators of this type and highlight possible ways to increase the voltage multiplication factor. Methodology. A method for determining the induced voltage according to experimental current oscillograms has been proposed. The methodology was verified by the coincidence of its data with the results of measurements by a capacitive voltage divider with the data spread of less than 20%. Scientific novelty. The rates of change in the current at the plasma switch opening stage were determined depending on the main electrical parameters of the DIN-2K accelerator. The diagnostics of the voltage induced during the POS opening were provided using no capacitive voltage divider in the internal volume of the accelerator, which enabled the removal of some diagnostic tools from the working volume of the chamber. Practical significance.",
  "authors": [
    "D. V. Vinnikov",
    "O. M. Ozerov",
    "V. V. Katrechko",
    "V. I. Tkachov",
    "O. V. Manuilenko",
    "I. N. Onishchenko"
  ],
  "published": "2026-01-15T18:52:26Z",
  "updated": "2026-01-15T18:52:26Z",
  "categories": [
    "physics.acc-ph"
  ],
  "primary_category": "physics.acc-ph"
}