{
  "arxiv_id": "2512.04484v2",
  "url": "https://arxiv.org/abs/2512.04484v2",
  "pdf_url": "https://arxiv.org/pdf/2512.04484v2.pdf",
  "title": "Numerical model for pellet rocket acceleration in PELOTON",
  "abstract": "A direct numerical simulation model for the rocket acceleration of pellets in thermonuclear fusion devices has been developed for PELOTON, a 3D Lagrangian particle pellet code [R. Samulyak et al, Nuclear Fusion 61 (4), 046007 (2021)], and validated using shattered pellet injection (SPI) experiments in JET. The pellet rocket acceleration is driven by grad-B drift of the ablation cloud that creates asymmetry and non-uniform heating of the cloud. The model accounts for non-uniform charging of the ablation cloud by hot plasma electrons as well as local plasma gradients. The increased pressure on the high-field-side compared to the low-field-side leads to pellet (fragment) rocket acceleration. Pure deuterium and deuterium-neon mixture models have been implemented. The background plasma states have been obtained by using a new plasma cooling model for PELOTON. The cooling model distributes the ablated material within the corresponding flux volumes and accounts for ionization and other energy losses, Ohmic heating by toroidal currents, and the energy exchange between ions and electrons. Plasma profiles predicted by PELOTON cooling model have been compared with JOREK and INDEX simulations. PELOTON simulations of rocket acceleration and the corresponding trajectories of deuterium fragments are consistent with experimentally measured trajectories in JET. We show that composite deuterium-neon pellets containing 0.5% of neon experienced smaller deviation of their trajectories compared to the pure deuterium case. We simulate various spatial configurations of pellet fragments and demonstrate the cloud overlap impact on rocket acceleration. Additionally, we demonstrate the effect of plasma state gradients on the rocket acceleration. Future work will focus on the rocket acceleration of SPI in projected ITER plasmas and the development of the corresponding scaling law for the rocket acceleration.",
  "authors": [
    "J. Corbett",
    "R. Samulyak",
    "F. J. Artola",
    "S. Jachmich",
    "M. Kong",
    "E. Nardon"
  ],
  "published": "2025-12-04T05:38:13Z",
  "updated": "2026-02-04T20:34:32Z",
  "categories": [
    "physics.plasm-ph",
    "physics.comp-ph"
  ],
  "primary_category": "physics.plasm-ph"
}