{
  "arxiv_id": "2602.05450v1",
  "url": "https://arxiv.org/abs/2602.05450v1",
  "pdf_url": "https://arxiv.org/pdf/2602.05450v1.pdf",
  "title": "The Correlation Length of Turbulence in Magnetic Clouds",
  "abstract": "The large-scale limit or outer scale of turbulence in the solar wind is associated with the correlation length of the magnetic field. Determining correlation lengths from magnetic field time series in magnetic clouds is complicated by the presence of the global flux rope: without removal of the flux rope trend, correlation length measurements will be sensitive to the flux rope as well as the turbulence, and give overestimates of the outer scale when turbulence amplitudes at the outer scale are small relative to the flux rope amplitude. We have used force-free flux rope fits to detrend magnetic field time series measured by Parker Solar Probe in two magnetic clouds and calculated the turbulence correlation length in the clouds using the detrended data. The detrended correlation length in terms of the proton inertial length, $d_p$, was $2.7\\times10^{4} d_p$ in one cloud (observed at 0.77 au) and $1.6\\times10^{4}d_p$ in the other (observed at 0.39 au), significantly smaller than the values obtained without detrending. Increments in the flux rope fits scaled equivalently to a $k^{-3}$ wavenumber power spectrum; this contribution from the flux rope considerably steepened the total spectrum at the largest scales but had a negligible effect in the inertial range, where scaling in both clouds equivalent to $\\sim$$k^{-5/3}$ was observed. Finally, we discuss the possible relation of turbulence correlation lengths to mesoscale structure in magnetic clouds.",
  "authors": [
    "S. W. Good",
    "J. Lalueza Puértolas",
    "A. -S. M. Jylhä",
    "E. K. J. Kilpua"
  ],
  "published": "2026-02-05T08:49:15Z",
  "updated": "2026-02-05T08:49:15Z",
  "categories": [
    "astro-ph.SR",
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.SR"
}