{
  "arxiv_id": "2602.03494v1",
  "url": "https://arxiv.org/abs/2602.03494v1",
  "pdf_url": "https://arxiv.org/pdf/2602.03494v1.pdf",
  "title": "Collisionless Larmor Coupling and Blob Formation in a Laser-Plasma Expanding into a Magnetized Ambient Plasma",
  "abstract": "Collisionless Larmor coupling is a fundamental process in space and astrophysical plasmas that enables momentum transfer between an expanding plasma and a magnetized ambient medium. In this paper, we report on the laboratory experimental study of Larmor coupling leading to the formation of a plasma blob associated with a laser-driven, super-Alfvénic plasma flow on the Large Plasma Device at the University of California, Los Angeles. The high-repetition rate enables systematic spatial and temporal scans of the plasma evolution using Doppler spectroscopy, as well as measurements of the magnetic field, electrostatic field, and self-emission of both debris and ambient ions using filtered imaging. We observe the self-focusing of the laser-produced plasma and the formation of a secondary diamagnetic cavity associated with a blob composed of background ions. Doppler spectroscopy reveals the transverse velocity distribution of the background ions, providing direct evidence of ion energization via Larmor coupling. The systematic spatial and temporal scans enabled by the high-repetition rate experiment allow for a detailed characterization of the ion dynamics. These experimental observations are supported by numerical simulations that provide more insight into the kinetic-scale physics associated with blob formation as well as the role of the ambient plasma density.",
  "authors": [
    "Lucas Rovige",
    "Robert S. Dorst",
    "Ari Le",
    "Carmen G. Constantin",
    "Haiping Zhang",
    "David J. Larson",
    "Stephen Vincena",
    "Shreekrishna Tripathi",
    "Misa M. Cowee",
    "Derek B. Schaeffer",
    "Christoph Niemann"
  ],
  "published": "2026-02-03T13:10:26Z",
  "updated": "2026-02-03T13:10:26Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}