{
  "arxiv_id": "2602.04710v1",
  "url": "https://arxiv.org/abs/2602.04710v1",
  "pdf_url": "https://arxiv.org/pdf/2602.04710v1.pdf",
  "title": "Nonlinear Saturation of the Acoustic Resonant Drag Instability",
  "abstract": "Resonant drag instabilities (RDIs) are a novel type of dust/fluid instability relevant to a diverse range of astrophysical environments. They are driven by a resonant interaction between streaming dust and waves in a background medium, which results in dust density fluctuations and amplification of the waves. This broad class of instabilities includes recently-proposed modes incorporating acoustic and magnetohydrodynamic waves, as well as the well-studied disk streaming instability. As the study of RDIs is at an early stage, their evolution beyond the linear regime is not well understood. In order to make inroads into the nonlinear theory of RDIs, we performed simulations of the simplest case, the acoustic RDI, in which sound waves in a gas are amplified by interaction with supersonically streaming dust. This particular instability is of interest both due its potential relevance in various poorly ionized environments, and due to its resemblance to the fast magnetosonic RDI. We find that the nonlinear growth and saturation of the instability are characterized by a balance between time scales of instability growth and turbulent eddy turnover. The simulations demonstrate a saturated state possessing an anisotropic outer forcing range in which this balance is maintained, and suggest the presence of an isotropic turbulent inertial range below this scale. By presenting a model for the nonlinear growth and saturated state of the acoustic RDI, this work provides a framework for further study of the nonlinear behavior of this and other RDIs.",
  "authors": [
    "Ben Y. Israeli",
    "Jonathan Squire",
    "Eric Moseley",
    "Amitava Bhattacharjee"
  ],
  "published": "2026-02-04T16:22:01Z",
  "updated": "2026-02-04T16:22:01Z",
  "categories": [
    "astro-ph.GA",
    "astro-ph.SR",
    "physics.flu-dyn",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.GA"
}