{
  "arxiv_id": "2602.05108v1",
  "url": "https://arxiv.org/abs/2602.05108v1",
  "pdf_url": "https://arxiv.org/pdf/2602.05108v1.pdf",
  "title": "Auroral signatures of ballooning instability and plasmoid formation processes in the near-Earth magnetotail",
  "abstract": "The nonlinear development of ballooning instability and the subsequently induced plasmoid formation in the near-Earth magnetotail demonstrated in MHD simulations has been proposed as a potential trigger mechanism for substorm onset over the past decade, and their connections to the in-situ satellite and ground all-sky auroral optical observations have been a subject of continued research. In this work, a set of THEMIS substorm onset events with good conjunction of auroral observations has been selected for comparative simulation study, whose pre-onset magnetotail configuration and conditions are inferred from in-situ data and compared with the onset conditions of ballooning instability obtained in our MHD simulations. The evolution of the near-Earth magnetotail is followed, where the signatures of ballooning instability and the plasmoid formation are extracted from simulations and compared with the magnetic fields and flow patterns within the magnetotail region from observation data. The field-aligned current (FAC) density is evaluated at the Earth side boundary of the magnetotail domain of simulation, which is further mapped along magnetic field lines to the auroral ionosphere and compared with the auroral pattern and evolution there in terms of growth rate, dominant wavenumber, and absolute auroral intensities. Such validation efforts are also the first step towards the development of a self-consistent coupling model that includes the magnetotail-ionosphere interaction in the substorm onset process.",
  "authors": [
    "Ping Zhu",
    "Jun Liang",
    "Jiaxing Liu",
    "Sui Wan",
    "Eric Donovan"
  ],
  "published": "2026-02-04T22:53:16Z",
  "updated": "2026-02-04T22:53:16Z",
  "categories": [
    "physics.space-ph",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.space-ph"
}