{
  "arxiv_id": "2504.13435v2",
  "url": "https://arxiv.org/abs/2504.13435v2",
  "pdf_url": "https://arxiv.org/pdf/2504.13435v2.pdf",
  "title": "A generalized framework for the critical current for a one-dimensional   crossed-field gap in an orthogonal coordinate system",
  "abstract": "Recent studies have applied variational calculus, conformal mapping, and point transformations to extend the one-dimensional SCLC from planar gaps to more complicated geometries. However, introducing a magnetic field orthogonal to the diode's electric field complicates these calculations due to changes in the electron trajectory. This paper extends a recent study that applied variational calculus to determine the SCLC for a cylindrical crossed-field diode to derive an equation that is valid for any orthogonal coordinate system. We then derive equations for the SCLC for crossed-field gaps in spherical, tip-to-tip, and tip-to-plane geometries that can be solved numerically. These calculations exhibit a discontinuity at the Hull cutoff magnetic field $B_H$ corresponding to the transition to magnetic insulation as observed analytically for a planar geometry. The ratio of the crossed-field SCLC to the nonmagnetic SCLC becomes essentially independent of geometry when we fix $\\delta = D/D_M > 0.6$, where $D$ is the canonical gap distance accounting for geometric effects on electric potential and $D_M$ is the effective gap distance that accounts for magnetic field and geometry. The solutions for these geometries overlap as $\\delta \\to 1$ since the geometric corrections for electric potential and magnetic field match. This indicates the possibility of more generally accounting for the combination of geometric and magnetic effects when calculating $B_H$ and SCLC.",
  "authors": [
    "Jack K. Wright",
    "N. R. Sree Harsha",
    "Allen L. Garner"
  ],
  "published": "2025-04-18T03:20:46Z",
  "updated": "2025-07-31T18:32:44Z",
  "categories": [
    "physics.plasm-ph",
    "physics.app-ph"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": "10.1063/5.0276244"
}