{
  "arxiv_id": "2507.22672v1",
  "url": "https://arxiv.org/abs/2507.22672v1",
  "pdf_url": "https://arxiv.org/pdf/2507.22672v1.pdf",
  "title": "A visual approach to global accretion disk instabilities",
  "abstract": "For over 30 years, the Magneto-Rotational Instability has been accepted as the mechanism driving accretion disk turbulence. Its physical basis is well understood, where an interplay between centrifugal forces and magnetic tension transfers angular momentum between oppositely displaced fluid elements. In this work, we revisit this picture in global disk models and various magnetic field topologies and generalise it to non-axisymmetric instabilities like the Super-Alfv\\'enic Rotational Instability (SARI). We use the open-source \\texttt{Legolas} software to quantify all complex-valued linear eigenfunctions for the (near-)eigenmodes and visualise the resulting spatio-temporal variations in real space in a manner that can be compared to direct numerical simulations of disks. The field perturbations are fundamentally different between the (axisymmetric) MRI and the novel, ultra-localised SARI modes, which bear some resemblance to spiral modes in galaxies but differ in important ways. We use a combined numerical-analytical approach to study the polarization of the magnetic and velocity field perturbations. Finally, we compare disks of differing magnetic topology where many linear modes are merely superposed to recreate a visual impression of `turbulent' fields and quantify the resulting stresses. We find that even superposed, still linearly growing SARI modes can already provide the needed effective viscosity-related alpha-values invoked for angular momentum transport. 3D views on the magnetic field perturbations show that SARI modes of opposite azimuthal mode number may naturally introduce plasmoid and toroidal flux-tube like field deformations.",
  "authors": [
    "Nicolas Brughmans",
    "Rony Keppens"
  ],
  "published": "2025-07-30T13:36:12Z",
  "updated": "2025-07-30T13:36:12Z",
  "categories": [
    "astro-ph.GA",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.GA"
}