{
  "arxiv_id": "2508.00455v1",
  "url": "https://arxiv.org/abs/2508.00455v1",
  "pdf_url": "https://arxiv.org/pdf/2508.00455v1.pdf",
  "title": "Tunable, phase-locked hard X-ray pulse sequences generated by a   free-electron laser",
  "abstract": "The ability to arbitrarily dial in amplitudes and phases enables the fundamental quantum state operations pioneered for microwaves and then infrared and visible wavelengths during the second half of the last century. Self-seeded X-ray free-electron lasers (FELs) routinely generate coherent, high-brightness, and ultrafast pulses for a wide range of experiments, but have so far not achieved a comparable level of amplitude and phase control. Here we report the first tunable phase-locked, ultra-fast hard X-ray (PHLUX) pulses by implementing a recently proposed method: A fresh-bunch self-seeded FEL, driven by an electron beam that was shaped with a slotted foil and a corrugated wakefield structure, generates coherent radiation that is intensity-modulated on the femtosecond time scale. We measure phase-locked (to within a shot-to-shot phase jitter corresponding to 0.1 attoseconds) pulse triplets with a photon energy of 9.7 keV, a pulse energy of several tens of microjoules, a freely tunable relative phase, and a pulse delay tunability between 4.5 and 11.9 fs. Such pulse sequences are suitable for a wide range of applications, including coherent spectroscopy, and have amplitudes sufficient to enable hard X-ray quantum optics experiments. More generally, these results represent an important step towards a hard X-ray arbitrary waveform generator.",
  "authors": [
    "Wenxiang Hu",
    "Chi Hyun Shim",
    "Gyujin Kim",
    "Seongyeol Kim",
    "Seong-Hoon Kwon",
    "Chang-Ki Min",
    "Kook-Jin Moon",
    "Donghyun Na",
    "Young Jin Suh",
    "Chang-Kyu Sung",
    "Haeryong Yang",
    "Hoon Heo",
    "Heung-Sik Kang",
    "Inhyuk Nam",
    "Eduard Prat",
    "Simon Gerber",
    "Sven Reiche",
    "Gabriel Aeppli",
    "Myunghoon Cho",
    "Philipp Dijkstal"
  ],
  "published": "2025-08-01T09:26:33Z",
  "updated": "2025-08-01T09:26:33Z",
  "categories": [
    "physics.acc-ph",
    "physics.optics"
  ],
  "primary_category": "physics.acc-ph"
}