[
  {
    "arxiv_id": "2508.00705v2",
    "url": "https://arxiv.org/abs/2508.00705v2",
    "pdf_url": "https://arxiv.org/pdf/2508.00705v2.pdf",
    "title": "An Online Data Analysis Framework for Accelerator-Based Physics   Experiments",
    "abstract": "A robust and flexible architecture capable of providing real-time analysis on diagnostic data is of crucial importance to physics experiments. In this paper, we present such an online framework, used in June 2025 as part of the HRMT-68 experiment, performed at the HiRadMat facility at CERN, using the Super Proton Synchrotron (SPS) beam line. HRMT-68 was a fixed-target laboratory astrophysics experiment aiming to identify plasma instabilities generated by a relativistic electron-positron beam during traversal of an argon plasma. This framework was essential for experimental data acquisition and analysis, and can be adapted for a broad range of experiments with a variety of experimental diagnostics. The framework's modular and customizable design enabled us to rapidly observe and extract emergent features from a diverse range of diagnostic data. Simultaneously, it allowed for both the introduction of new diagnostic devices and the modification of our analysis as features of interest were identified. As a result, we were able to effectively diagnose equipment malfunction, and infer the beam's response to varying bunch duration, beam intensity, and the plasma state without resorting to offline analysis, at which time adjustment or improvement would have been impossible. We present the features of this agile framework, whose codebase we have made publicly available, which can be adapted for future experiments with minimal modification.",
    "authors": [
      "Hayden Ramm",
      "Pascal Simon",
      "Paraskevi Alexaki",
      "Christopher Arran",
      "Robert Bingham",
      "Alice Goillot",
      "Jon Tomas Gudmundsson",
      "Jonathan Halliday",
      "Bryn Lloyd",
      "Eva Los",
      "Vasiliki Stergiou",
      "Sifei Zhang",
      "Gianluca Gregori",
      "Nikolaos Charitonidis"
    ],
    "published": "2025-08-01T15:20:24Z",
    "updated": "2025-08-04T15:52:12Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.00739v1",
    "url": "https://arxiv.org/abs/2508.00739v1",
    "pdf_url": "https://arxiv.org/pdf/2508.00739v1.pdf",
    "title": "Shaping circuit for improving linearity, bandwidth, and dynamic range in   ToT-based detectors",
    "abstract": "The quantitative measurement of energy deposits in particle detectors, particularly in calorimeters, is usually accomplished with the help of Analog-to-Digital converters (ADCs) due to their precision, wide measurement range, and good linearity. However, drawbacks such as power consumption, data volume, and bandwidth limit their use in the next generation of high-energy physics experiments. Time-over-threshold (ToT) systems offer simplicity, low power consumption, easy integrability, and wide bandwidth, but they lack precision, linearity, and dynamic range. In this work, we propose a shaper circuit that improves the weaknesses of ToT systems without sacrificing performance. We simulated and implemented the concept in the readout system of the Ring Imaging Cherenkov detector of the Compressed Baryonic Matter experiment at FAIR.",
    "authors": [
      "J. Peña-Rodríguez",
      "J. Förtsch",
      "C. Pauly",
      "K. -H. Kampert"
    ],
    "published": "2025-08-01T16:10:04Z",
    "updated": "2025-08-01T16:10:04Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2502.01300v3",
    "url": "https://arxiv.org/abs/2502.01300v3",
    "pdf_url": "https://arxiv.org/pdf/2502.01300v3.pdf",
    "title": "Magnetic Field Amplification and Reconstruction in Rotating   Astrophysical Plasmas: Verifying the Roles of $α$ and $β$ in Dynamo   Action",
    "abstract": "We investigated the $\\alpha$ and $\\beta$ effects in a rotating spherical plasma system relevant to astrophysical environments. These coefficients were derived using three different approaches based on the large-scale magnetic field $\\overline{\\mathbf{B}}$, turbulent velocity $\\mathbf{u}$, and turbulent magnetic field $\\mathbf{b}$, yielding $\\alpha_{\\mathrm{EM-HM}}$, $\\beta_{\\mathrm{EM-HM}}$, $\\beta_{\\mathrm{vv-vw}}$, and $\\beta_{\\mathrm{bb+jb}}$. Using raw data from direct numerical simulations (DNS), we constructed the magnetic induction equation incorporating the $\\alpha$ and $\\beta$ coefficients. We then reproduced the $\\overline{\\mathbf{B}}$ field and compared the results with the DNS data. In the kinematic regime, where $\\overline{\\mathbf{B}}$ is weak, all models exhibit good agreement with the DNS results. However, in the nonlinear regime, the $\\overline{\\mathbf{B}}$ field, reproduced using $\\beta_{\\mathrm{vv-vw}}$, deviates from the DNS and exhibits unbounded growth. To address this discrepancy, we added $\\beta_{\\mathrm{bb+jb}}$, which represents the contribution of turbulent magnetic fields, to $\\beta_{\\mathrm{vv-vw}}$. This addition suppresses the divergent growth of $\\overline{\\mathbf{B}}$ in the nonlinear regime. We then assessed the actual influence of $\\alpha$ and $\\beta$ on the evolution of $\\overline{\\mathbf{B}}$ by applying weighted combinations of the two coefficients. Our results show that magnetic $\\beta$ diffusion plays a dominant role throughout the entire process. In contrast, the $\\alpha$ effect is minor in the kinematic regime but becomes essential for sustaining the $\\overline{\\mathbf{B}}$ field in the nonlinear regime. We also discussed the underlying physical mechanism responsible for this behavior.",
    "authors": [
      "Kiwan Park"
    ],
    "published": "2025-02-03T12:20:48Z",
    "updated": "2025-08-01T15:41:55Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.00720v1",
    "url": "https://arxiv.org/abs/2508.00720v1",
    "pdf_url": "https://arxiv.org/pdf/2508.00720v1.pdf",
    "title": "Continuum damping of topologically-protected edge modes at the boundary   of non-uniformly magnetized cylindrical plasmas",
    "abstract": "We present an extension of recently discovered collisionlessly damped yet topologically protected surface plasma waves (TSPWs), from a simplified slab geometry to a cylindrical plasma-vacuum interface. A distinctive feature of these modes-emerging above the electron cyclotron frequency-is their collisionless damping, which arises from resonant coupling to a continuum of upper-hybrid modes localized within a smooth plasma-vacuum transition layer. We demonstrate both temporal and spatial damping of TSPWs at the boundary of a cylindrical magnetized plasma. Furthermore, we show that in the presence of a non-uniform magnetic field, the TSPW exhibits a smooth and continuous transition, highlighting its topological robustness under magnetic inhomogeneity.",
    "authors": [
      "Roopendra Singh Rajawat",
      "Gennady Shvets"
    ],
    "published": "2025-08-01T15:40:33Z",
    "updated": "2025-08-01T15:40:33Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.14425v2",
    "url": "https://arxiv.org/abs/2507.14425v2",
    "pdf_url": "https://arxiv.org/pdf/2507.14425v2.pdf",
    "title": "Evaluation of a Full Field Fluorescence Imager with Synchrotron   Radiation",
    "abstract": "The design and evaluation on the NSLS-II beamline of the 3FI application specific integrated circuit (ASIC) bump-bonded to a simply, planar, two-dimensionally segmented silicon sensor is presented. The ASIC was developed for Full-Field Fluorescence spectral X-ray Imaging (3FI). It is a small-scale prototype that features a square array of 32x32 pixels with a pitch of 100 {\\mu}m. The ASIC was implemented in a 65 nm CMOS process. Each pixel incorporates a charge-sensitive amplifier, shaping filter, discriminator, peak detector, and sample-and-hold circuit, allowing detection of events and storing signal amplitudes. The system operates in an event-driven readout mode, outputting analog values for threshold-triggered events, allowing high-speed multi-element X-ray fluorescence imaging. At power consumption of 200 {\\mu}W per pixel, consisting almost uniquely of power dissipated in analog blocks, 308 eV full width at half maximum (FWHM) energy resolution at 8.04 keV, that corresponds to 30 e- rms equivalent noise charge (ENC) and 138 eV FWHM energy resolution at 3.69 keV (16 e- rms ENC) were obtained, for Cu and Ca K{\\alpha} lines, respectively. Each pixel operates independently, and the detector enables in situ trace element microanalysis in biological and environmental research. Its architecture addresses limitations of X-ray Fluorescence Microscopy (XFM), typically requiring mechanical scanning, by offering frame-lees data acquisition, translating to high-throughput operation. The 3FI ASIC is suitable for example for studies of nutrient cycling in the (mycor)rhizosphere, microbial redox processes, and genotype-phenotype correlations in bio-energy crops. Additional performances, such as enhanced spatial resolution can be further improved with coded-aperture and Wolt, extending the use to environmental, biomedical, and material science studies.",
    "authors": [
      "Piotr Maj",
      "Grzegorz W. Deptuch",
      "Dominik S. Gorni",
      "Giovanni Pinaroli",
      "Gabriella A. Carini",
      "David P. Siddons",
      "Ryan Tappero",
      "Soumyajit Mandal",
      "Donald Pinelli",
      "Timothy Kersten",
      "Nicholas St. John",
      "Abdul K. Rumaiz",
      "Anthony Kuczewski"
    ],
    "published": "2025-07-19T01:02:57Z",
    "updated": "2025-08-01T13:39:45Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2506.16676v5",
    "url": "https://arxiv.org/abs/2506.16676v5",
    "pdf_url": "https://arxiv.org/pdf/2506.16676v5.pdf",
    "title": "Fast solvers for Tokamak fluid models with PETSC",
    "abstract": "This work begins the development of fast, scalable solvers for scientific and engineering-relevant magnetohydrodynamics (MHD) models of tokamaks using multigrid methods. These models are characterized by a distinguished direction following the magnetic field around the torus, which dominates the plasma dynamics. All tokamak models exploit this structure, for example, NIMROD uses 2D, unstructured, high-order finite elements in the poloidal plane with Fourier modes in the toroidal coordinate, and the 3D, extended MHD code M3D-C1 uses 2D, unstructured C1 elements in the poloidal plane with cubic Hermite functions in the toroidal direction and a regular grid that is partially aligned with the magnetic field. This structure suggests addressing the toroidal coordinate first, which NIMROD does at the formulation level, but M3D-C1 uses a full 3D discretization. The resulting algebraic system is solved at each time step in an implicit time integrator. This work addressed the toroidal coordinate in the M3D-C1 velocity solve by adding semi-coarsening multigrid to the existing PETSC - Portable, Extensible Toolkit for Scientific Computation - block Jacobi solver, with the addition of little new code. Competitive performance of this new solver configuration is demonstrated on a self-consistent runaway electron model of a SPARC4 disruption, and the next steps in the development of this solver are outlined.",
    "authors": [
      "Mark F. Adams",
      "Jin Chen",
      "Benjamin Sturdevant"
    ],
    "published": "2025-06-20T01:36:08Z",
    "updated": "2025-08-01T13:20:07Z",
    "categories": [
      "physics.plasm-ph",
      "cs.PF"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.00535v1",
    "url": "https://arxiv.org/abs/2508.00535v1",
    "pdf_url": "https://arxiv.org/pdf/2508.00535v1.pdf",
    "title": "Series Testing and Characterization of 1100 Hamamatsu H12700 Multianode   Photomultiplier Tubes",
    "abstract": "Both the future CBM-RICH and the recently upgraded HADES-RICH use Hamamatsu H12700 Multi-Anode Photomultipliers (MAPMTs) as their photon detectors. To test the MAPMTs thoroughly before using them in the detectors, the photon sensors were qualified well in advance and a test bench was built to efficiently characterize each MAPMT. The test bench measures the single photoelectron gain, dark rate, relative efficiency, and afterpulse probability of each channel. This article describes the operating principle of the test bench and discusses the distributions of each measured quantity over 1,100 MAPMTs. Additionally, the long-term aging effects of the H12700 MAPMT are investigated based on repeated measurements of individual MAPMTs.",
    "authors": [
      "J. Förtsch",
      "K. -H. Kampert",
      "V. Patel",
      "C. Pauly",
      "D. Pfeifer"
    ],
    "published": "2025-08-01T11:20:35Z",
    "updated": "2025-08-01T11:20:35Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.00532v1",
    "url": "https://arxiv.org/abs/2508.00532v1",
    "pdf_url": "https://arxiv.org/pdf/2508.00532v1.pdf",
    "title": "Utilizing Deep Learning for Enhanced Tritium Detection in CCDs",
    "abstract": "This study explores the use of charge-coupled devices (CCDs) for detecting low-energy beta particles from tritium decay - a critical signal for nuclear safety, nuclear nonproliferation, and environmental monitoring. We employ a dual approach utilizing both measured CCD data and detailed Geant4 simulations. Our analysis compares classical techniques with advanced deep learning methods, including convolutional neural networks (CNNs), autoencoders trained exclusively on tritium data, and preliminary studies on boosted decision trees (BDTs). The CNN, trained on mixed signal/background datasets, demonstrates superior classification performance, while the autoencoder shows the potential of unsupervised, background-agnostic strategies. These results highlight the excellent sensitivity achievable thanks to the background rejection made possible by information-rich CCD data, paving the way for improved portable tritium monitoring.",
    "authors": [
      "E. Rofors",
      "R. Heller",
      "R. J. Cooper",
      "J. Estrada",
      "G. Moroni",
      "B. Nachman",
      "K. Spears"
    ],
    "published": "2025-08-01T11:13:30Z",
    "updated": "2025-08-01T11:13:30Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2505.21714v3",
    "url": "https://arxiv.org/abs/2505.21714v3",
    "pdf_url": "https://arxiv.org/pdf/2505.21714v3.pdf",
    "title": "Time-tagging data acquisition system for testing superconducting   electronics based on an RFSoC and custom analog frontend",
    "abstract": "Novel electronic devices can often be operated in a plethora of ways, which makes testing circuits comprised of them difficult. Often, no single tool can simultaneously analyze the operating margins, maximum speed, and failure modes of a circuit, particularly when the intended behavior of subcomponents of the circuit is not standardized. This work demonstrates a cost-effective time-domain data acquisition system for electronic circuits that enables more intricate verification techniques than are practical with conventional experimental setups. We use high-speed digital-to-analog converters and real-time multi-gigasample-per-second waveform processing to push experimental circuits beyond their maximum operating speed. Our custom time-tagging data capture firmware reduces memory requirements and can be used to determine when errors occur. The firmware is combined with a thermal-noise-limited analog frontend with \\ensuremath{{50}\\,\\mathrm{dB}} of dynamic range. Compared to currently available commercial test equipment that is seven times more expensive, this data acquisition system was able to operate a superconducting shift register at a nearly three-times-higher clock frequency (${200}\\,\\mathrm{MHz}$ vs. ${80}\\,\\mathrm{MHz}$)",
    "authors": [
      "Reed A. Foster",
      "Stephen Kandeh",
      "Owen Medeiros",
      "Alejandro Simon",
      "Matteo Castellani",
      "Karl K. Berggren"
    ],
    "published": "2025-05-27T20:00:16Z",
    "updated": "2025-08-01T11:10:45Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.supr-con"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.00503v1",
    "url": "https://arxiv.org/abs/2508.00503v1",
    "pdf_url": "https://arxiv.org/pdf/2508.00503v1.pdf",
    "title": "Using tunable coherence for reaching micrometer coherence lengths and   suppressing stray light in a power-recycled Michelson interferometer",
    "abstract": "By reentering into laser interferometers, scattered or stray light introduces non-linear noise. This is a major limitation of precision interferometers as preventing such parasitic light is nearly impossible. Thus, substantial effort is put into mitigating the reentering of these fields in various ways. Ground-based laser interferometric gravitational wave detectors employ such mitigation techniques to reduce otherwise restrictive stray light noise. However, they are now reaching sensitivities where conventional mitigation techniques reach limitations. Further improvements planed for future observatories are placing even more demanding constraints on tolerable stray light power. We previously presented tunable coherence as a possible technique to ease these constraints and suppress unwanted coherent interference. For these promising demonstrations, the remaining coherence length and achievable suppression in length-constrained layouts was limited, among other things, by the used pseudo-random-noise phase modulation frequency. In this work, we demonstrate stray light suppression and cavity performance at modulation frequencies up to 10 GHz. This reduces the remaining coherence to a few centimeter in an interferometer, and even to the scale of the laser wavelength in a cavity. We further present a first demonstration of tunable coherence in a power-recycled Michelson interferometer, successfully suppressing stray light in a more complex topology.",
    "authors": [
      "Daniel Voigt",
      "Oliver Gerberding"
    ],
    "published": "2025-08-01T10:31:09Z",
    "updated": "2025-08-01T10:31:09Z",
    "categories": [
      "physics.optics",
      "astro-ph.IM",
      "gr-qc",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2410.04125v2",
    "url": "https://arxiv.org/abs/2410.04125v2",
    "pdf_url": "https://arxiv.org/pdf/2410.04125v2.pdf",
    "title": "Transverse beam instabilities in low-emittance booster synchrotrons",
    "abstract": "As the ring-based light source community is moving towards fourth-generation light sources, many facilities plan to upgrade their boosters in parallel to meet the more demanding beam properties for the storage ring, especially in terms of a much lower emittance. Concerns over collective effects have, therefore, risen, particularly in the transverse planes, since the vacuum chamber dimensions tend to be reduced as a way to achieve a stronger focusing force on the beam. In this article, we present numerical studies on transverse beam instabilities, both in the single- and multibunch regimes, in the SOLEIL II booster as an example of a low-emittance booster. We show that Landau damping is an efficient mechanism for suppressing both transverse single-bunch and coupled-bunch instabilities. We also prove that the damping in the longitudinal plane can diffuse to the transverse plane and limit the transverse emittance growth. Moreover, we have discovered that the beam can exhibit sawtooth instability at high energy and that broad-band impedance is one of the key factors in suppressing transverse coupled-bunch instability.",
    "authors": [
      "W. Foosang",
      "A. Gamelin",
      "V. Gubaidulin",
      "R. Nagaoka"
    ],
    "published": "2024-10-05T11:24:31Z",
    "updated": "2025-08-01T09:31:02Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.00455v1",
    "url": "https://arxiv.org/abs/2508.00455v1",
    "pdf_url": "https://arxiv.org/pdf/2508.00455v1.pdf",
    "title": "Tunable, phase-locked hard X-ray pulse sequences generated by a   free-electron laser",
    "abstract": "The ability to arbitrarily dial in amplitudes and phases enables the fundamental quantum state operations pioneered for microwaves and then infrared and visible wavelengths during the second half of the last century. Self-seeded X-ray free-electron lasers (FELs) routinely generate coherent, high-brightness, and ultrafast pulses for a wide range of experiments, but have so far not achieved a comparable level of amplitude and phase control. Here we report the first tunable phase-locked, ultra-fast hard X-ray (PHLUX) pulses by implementing a recently proposed method: A fresh-bunch self-seeded FEL, driven by an electron beam that was shaped with a slotted foil and a corrugated wakefield structure, generates coherent radiation that is intensity-modulated on the femtosecond time scale. We measure phase-locked (to within a shot-to-shot phase jitter corresponding to 0.1 attoseconds) pulse triplets with a photon energy of 9.7 keV, a pulse energy of several tens of microjoules, a freely tunable relative phase, and a pulse delay tunability between 4.5 and 11.9 fs. Such pulse sequences are suitable for a wide range of applications, including coherent spectroscopy, and have amplitudes sufficient to enable hard X-ray quantum optics experiments. More generally, these results represent an important step towards a hard X-ray arbitrary waveform generator.",
    "authors": [
      "Wenxiang Hu",
      "Chi Hyun Shim",
      "Gyujin Kim",
      "Seongyeol Kim",
      "Seong-Hoon Kwon",
      "Chang-Ki Min",
      "Kook-Jin Moon",
      "Donghyun Na",
      "Young Jin Suh",
      "Chang-Kyu Sung",
      "Haeryong Yang",
      "Hoon Heo",
      "Heung-Sik Kang",
      "Inhyuk Nam",
      "Eduard Prat",
      "Simon Gerber",
      "Sven Reiche",
      "Gabriel Aeppli",
      "Myunghoon Cho",
      "Philipp Dijkstal"
    ],
    "published": "2025-08-01T09:26:33Z",
    "updated": "2025-08-01T09:26:33Z",
    "categories": [
      "physics.acc-ph",
      "physics.optics"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2505.00288v5",
    "url": "https://arxiv.org/abs/2505.00288v5",
    "pdf_url": "https://arxiv.org/pdf/2505.00288v5.pdf",
    "title": "Nyström Type Exponential Integrators for Strongly Magnetized Charged   Particle Dynamics",
    "abstract": "Calculating the dynamics of charged particles in electromagnetic fields (i.e. the particle pushing problem) is one of the most computationally intensive components of particle-in-cell (PIC) methods for plasma physics simulations. This task is especially challenging when the plasma is strongly magnetized, since in this case the particle motion consists of a wide range of temporal scales from highly oscillatory fast gyromotion to slow macroscopic behavior and the resulting numerical model is very stiff. Current state-of-the-art time integrators used to simulate particle motion have limitations given the severe numerical stiffness of the problem and more efficient methods are of interest. Recently, exponential integrators have been proposed as a promising new approach for these simulations and shown to offer computational advantages over commonly used schemes. Exponential methods can solve linear problems exactly and are A-stable. In this paper, the standard exponential algorithms framework is extended to derive Nystr\\\"om-type exponential methods that integrate the Newtonian equations of motion as a second-order differential equation. Specific Nystr\\\"om-type schemes of second and third orders are derived and applied to strongly magnetized particle pushing problems. Numerical experiments are presented to demonstrate that the Nystr\\\"om-type exponential integrators can provide significant improvement in computational efficiency over the standard exponential methods.",
    "authors": [
      "Tri P. Nguyen",
      "Ilon Joseph",
      "Mayya Tokman"
    ],
    "published": "2025-05-01T04:22:49Z",
    "updated": "2025-08-01T09:08:16Z",
    "categories": [
      "physics.comp-ph",
      "cs.NA",
      "math.NA",
      "physics.plasm-ph",
      "65L04, 78A35"
    ],
    "primary_category": "physics.comp-ph"
  },
  {
    "arxiv_id": "2508.00417v1",
    "url": "https://arxiv.org/abs/2508.00417v1",
    "pdf_url": "https://arxiv.org/pdf/2508.00417v1.pdf",
    "title": "Collimated QED Cascades with Curved Plasma Mirror",
    "abstract": "Converting light into matter has been a longstanding goal in physics, particularly the creation of electron-positron pairs through quantum electrodynamic (QED) processes. While current approaches using multiple colliding laser pulses can achieve this conversion, they struggle to produce well-collimated particle beams - a crucial requirement for practical applications. Here we demonstrate that a single ultra-intense laser pulse, when reflected from a curved plasma mirror, can generate highly collimated electron-positron pairs with unprecedented efficiency. By focusing the laser to field strengths exceeding $a_0 > 2000$, our method triggers QED cascades that produce tightly focused particle beams, distinctly different from the diffuse plasmas created by conventional multi-laser setups. The technique works even at relatively modest laser powers of 13PW, making it immediately testable at existing facilities. This breakthrough opens new possibilities for studying fundamental QED processes and generating controlled matter-antimatter plasmas.",
    "authors": [
      "Xuesong Geng",
      "M. A. Serebryakov",
      "E. N. Nerush",
      "A. S. Samsonov",
      "I. Y. Kostyukov",
      "Liangliang Ji"
    ],
    "published": "2025-08-01T08:15:02Z",
    "updated": "2025-08-01T08:15:02Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.00375v1",
    "url": "https://arxiv.org/abs/2508.00375v1",
    "pdf_url": "https://arxiv.org/pdf/2508.00375v1.pdf",
    "title": "A COGENT case study: Supporting Applications with Chombo",
    "abstract": "We present a case study of how a software framework (Chombo) supported the specific needs of a scientific application (COGENT). Since its inception in 2000, the Chombo framework has supported various applications. One example of such support has been the collaboration with the Edge Simulation Laboratory to build the COGENT model. The specific needs of the COGENT effort required the design and implementation of a set of new capabilities in the Chombo framework, such as higher-order mapped-multiblock discretizations and multi-dimensional code organization. These capabilities allowed COGENT to develop a unique simulation capability for modeling the edge layers in tokamaks. Once developed, these capabilities were able to support other applications which had similar needs.",
    "authors": [
      "Daniel F. Martin",
      "Milo Dorr",
      "Mikhail Dorf",
      "Lee F. Ricketson"
    ],
    "published": "2025-08-01T07:10:11Z",
    "updated": "2025-08-01T07:10:11Z",
    "categories": [
      "math.NA",
      "cs.NA",
      "physics.plasm-ph"
    ],
    "primary_category": "math.NA"
  },
  {
    "arxiv_id": "2508.00339v1",
    "url": "https://arxiv.org/abs/2508.00339v1",
    "pdf_url": "https://arxiv.org/pdf/2508.00339v1.pdf",
    "title": "Favorable modifications of Scrape-Off Layer (SOL) heat flux width   through pulsed fuelling in ADITYA-U Tokamak",
    "abstract": "Enhancement of the scrape-off layer (SOL) heat flux width has been observed in the ADITYA-U Tokamak following the injection of short fuel gas pulses. A notable reduction in parallel heat flux near the last closed flux surface (LCFS) is observed after each pulse. Comparative analysis indicates that pulsed fuelling is more effective in mitigating heat flux with improved core confinement than continuous gas feeding via real-time density control. Analytical and simulation works are also carried out for validation of experimental results. The analytical model shows that SOL width modification cannot be attributed solely to the decrease of temperature due to gas pulse injection; cross-field plasma diffusion also needs to increase. Simulations with the UEDGE code suggest that an increase in both the cross-field diffusion coefficient and inward pinch velocity is necessary to replicate the experimentally observed broadening of the heat flux SOL width. These findings provide insights into efficient SOL heat flux control strategies for future fusion devices.",
    "authors": [
      "SK Injamul Hoque",
      "Harshita Raj",
      "Ritu Dey",
      "Soumitra Banerjee",
      "Komal",
      "Kaushlender Singh",
      "Suman Dolui",
      "Ankit Kumar",
      "Ashok Kumawat",
      "Bharat Hegde",
      "Sharvil Patel",
      "Kiran Patel",
      "Rohit Kumar",
      "Suman Aich",
      "Pramila Gautam",
      "Umesh Nagora",
      "Asha N Adhiya",
      "K. A. Jadeja",
      "K. M. Patel",
      "Ankit Patel",
      "R. L. Tanna",
      "Joydeep Ghosh"
    ],
    "published": "2025-08-01T05:57:21Z",
    "updated": "2025-08-01T05:57:21Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.00322v1",
    "url": "https://arxiv.org/abs/2508.00322v1",
    "pdf_url": "https://arxiv.org/pdf/2508.00322v1.pdf",
    "title": "Development of Space Qualified Signal Processing Readout Electronics for   HabWorlds and Origins Space Telescope Detector and Arrays",
    "abstract": "The Habitable Worlds Observatory (HWO), a flagship ultraviolet/optical/infrared space telescope recommended by the National Academies' Pathways to Discovery in Astronomy and Astrophysics, will require detector technologies capable of supporting significantly larger pixel-count arrays than previous missions. Microwave Kinetic Inductance Detectors (MKIDs), naturally suited to microwave multiplexing readout, are already in use across several balloon-borne missions with FPGA-based systems. To transition this capability to space, we are developing a radiation-hardened detector readout system that builds directly on the technical and environmental requirements defined by the PRIMA mission. PRIMA serves as a critical pathfinder, informing the radiation tolerance, resource constraints, and on-board processing capabilities needed for HWO. In this work, we present our current results on algorithm implementation, hardware architecture, and firmware development using the radiation-hardened AMD Kintex Ultrascale FPGA, aligning with PRIMA's stringent specifications to ensure compatibility with future space-based observatories like HWO.",
    "authors": [
      "Tracee Jamison-Hooks",
      "Lynn Miles",
      "Sanetra Newman-Bailey",
      "Oketa Basha",
      "Sarah E Kay",
      "Sean Bryan",
      "Philip Mauskopf",
      "Thomas Essinger-Hileman",
      "Jason Glen",
      "Sumit Dahal",
      "Adrian Sinclair",
      "Kathryn Chamberlain"
    ],
    "published": "2025-08-01T05:11:53Z",
    "updated": "2025-08-01T05:11:53Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2505.07464v2",
    "url": "https://arxiv.org/abs/2505.07464v2",
    "pdf_url": "https://arxiv.org/pdf/2505.07464v2.pdf",
    "title": "Development of the Range Counter for the COMET Phase-$α$ Experiment",
    "abstract": "The COMET Phase-$\\alpha$ experiment aims to evaluate the novel muon transport beamline for the muon-to-electron conversion search at J-PARC, Japan. A dedicated Range Counter (RC) was developed to measure the momentum spectrum of transported negative muons with momenta of 30--100 MeV/$c$. The RC consists of graphite momentum degraders, a muon absorber, and plastic scintillation counters ($\\rm T_0$, $\\rm T_1$, and $\\rm T_2$) to detect decay-in-orbit (DIO) electrons from stopped muons. The number of muons stopped in the absorber is reconstructed from the decay time distribution. A copper absorber was selected due to the short lifetime of muonic atoms in copper, which enhances signal separation. The counters' performance was evaluated experimentally. The $\\rm T_0$ Counter, made of a $200\\times 200\\times 0.5~{\\rm mm^3}$ scintillator plate, achieved a muon-trigger efficiency exceeding 99.9%. The $\\rm T_1$ and $\\rm T_2$ Counters also demonstrated high electron-detection efficiencies of $>99$%. Based on these results, simulation studies estimate the acceptance for reconstructing the number of DIO electrons from the absorber to be approximately 47% with a corresponding signal purity of 60% against muon capture-induced backgrounds.",
    "authors": [
      "Kou Oishi",
      "Masaharu Aoki",
      "Shion Kuribayashi",
      "Shunya Ueda",
      "Kazuki Ueno",
      "Nicolas Chadeau",
      "Thomas Clouvel",
      "Yuki Fujii",
      "Yoshinori Fukao",
      "Masaaki Higashide",
      "Youichi Igarashi",
      "Satoshi Mihara",
      "Hajime Nishiguchi",
      "Kenya Okabe",
      "Yoshi Uchida"
    ],
    "published": "2025-05-12T11:53:29Z",
    "updated": "2025-08-01T02:06:36Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.00232v1",
    "url": "https://arxiv.org/abs/2508.00232v1",
    "pdf_url": "https://arxiv.org/pdf/2508.00232v1.pdf",
    "title": "Fabrication and Experimental Study of Prototype NdFeB Helical Undulators",
    "abstract": "An experiment with short prototypes of helical undulators, comprised of longitudinally magnetized helices made from a single piece of a rare-earth magnet, is described. Wire electrical discharge machining (WEDM) in combination with a flat tool and the rotary movement of the workpiece made it possible to achieve high precision in the manufacture of NdFeB helices. An assembly of two oppositely longitudinally magnetized helices with a period of 20 mm and a relatively large inner diameter of 8 mm creates a field of 0.53 T on the axis of the system, which ensures the value of the undulator parameter K close to unity. According to the calculation, Halbach-type helical micro-undulators with periods of (3-6) mm of four helices can provide a field of 1 T and K = 0.28-0.6 at the axis.",
    "authors": [
      "Nezah Balal",
      "Eberhard Bamberg",
      "Vladimir L. Bratman",
      "Eyal Magory"
    ],
    "published": "2025-08-01T00:39:31Z",
    "updated": "2025-08-01T00:39:31Z",
    "categories": [
      "physics.acc-ph",
      "B.4.1; B.7.1"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.1109/TED.2023.3315250"
  },
  {
    "arxiv_id": "2506.15024v2",
    "url": "https://arxiv.org/abs/2506.15024v2",
    "pdf_url": "https://arxiv.org/pdf/2506.15024v2.pdf",
    "title": "The Gardner equation and acoustic solitary waves in plasmas",
    "abstract": "Ion-acoustic waves in a dusty plasma are investigated where it is assumed that the ions follow a Cairns distribution and the electrons are Boltzmann distributed. Two theoretical methods are applied: Sagdeev pseudopotential analysis (SPA) and reductive perturbation theory (RPT). Since SPA incorporates all nonlinearities of the model it is the most accurate but deriving soliton profiles requires numerical integration of Poisson's equation. By contrast, RPT is a perturbation method which at second order yields the Gardner equation incorporating both the quadratic nonlinearity of the KdV equation and the cubic nonlinearity of the modified KdV equation. For consistency with the perturbation scheme the coefficient of the quadratic term needs to be at least an order of magnitude smaller than the coefficient of the cubic term. Solving the Gardner equation yields an analytic expression of the soliton profile. Selecting an appropriate set of compositional parameters, the soliton solutions obtained from SPA and RPT are analyzed and compared.",
    "authors": [
      "Frank Verheest",
      "Willy A. Hereman"
    ],
    "published": "2025-06-17T23:36:09Z",
    "updated": "2025-07-31T21:01:04Z",
    "categories": [
      "physics.plasm-ph",
      "math-ph",
      "math.MP",
      "nlin.SI",
      "PACS numbers: 52.35.Sb, 52.35.Fp, 52.35.Mw, 52.27.Cm"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.00145v1",
    "url": "https://arxiv.org/abs/2508.00145v1",
    "pdf_url": "https://arxiv.org/pdf/2508.00145v1.pdf",
    "title": "Experimental Demonstration of Dephasing Reduction in an Optically Guided   Laser-Plasma Accelerator",
    "abstract": "Laser-plasma accelerators offer a compact means of producing high-energy electron beams, but their performance is fundamentally limited by dephasing between the accelerated electrons and the plasma wave. To overcome this limitation, we investigate the combination of plasma density tapering and optical guiding to extend the effective acceleration length. Using a Joule-class femtosecond laser coupled into an optical-field-ionized plasma waveguide with a controlled density gradient, we experimentally achieve electron beam energies exceeding 1.6 GeV, a 40% increase compared to the constant-density case. Particle-in-cell simulations reproduce the main experimental features and reveal the central roles of delayed injection, nonlinear laser evolution, and self-focusing in enhancing energy gain.",
    "authors": [
      "Ronan Lahaye",
      "Igor A. Andriyash",
      "Julien Gautier",
      "Olena Kononenko",
      "Adrien Leblanc",
      "Jean-Philippe Goddet",
      "Amar Tafzi",
      "Cedric Thaury"
    ],
    "published": "2025-07-31T20:08:34Z",
    "updated": "2025-07-31T20:08:34Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.00119v1",
    "url": "https://arxiv.org/abs/2508.00119v1",
    "pdf_url": "https://arxiv.org/pdf/2508.00119v1.pdf",
    "title": "Probing Proton versus Electron Heating and Energization during Magnetic   Reconnection",
    "abstract": "The mechanisms controlling the relative heating and energization of electrons and protons during magnetic reconnection are explored. Simulations are carried out with the kglobal model, which produces bulk heating and the extended powerlaw distributions of both species that have been documented in observations. The simulations have been carried out with a range of proton-to-electron mass ratios and upstream temperatures to isolate the factors that control energy gain. The simulations reveal that when the upstream temperatures of the two species are equal, the proton heating and energization exceeds that of electrons and that this is a consequence of the much larger energy gain of protons on their first entry into the reconnection exhaust. The effective energy gain of protons on exhaust entry scales as $m_iC_A^2$ since the protons counterstream at the Alfv\\'en speed $C_A$ while the initial electron energy gain is smaller by the factor $(\\beta_{e0}m_e/m_i)^{1/2}$. Since Fermi reflection during flux rope merger dominates energy gain in large-scale reconnecting systems and the rate of energy gain is proportional to energy, protons continue to gain energy faster than electrons for the duration of the simulations, leading to temperature increments of protons exceeding that of electrons and the non-thermal energy content of protons also exceeding that of electrons.",
    "authors": [
      "Zhiyu Yin",
      "James F. Drake",
      "Marc Swisdak"
    ],
    "published": "2025-07-31T19:14:47Z",
    "updated": "2025-07-31T19:14:47Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.00114v1",
    "url": "https://arxiv.org/abs/2508.00114v1",
    "pdf_url": "https://arxiv.org/pdf/2508.00114v1.pdf",
    "title": "Unified Description of Kappa-type velocity distributions",
    "abstract": "An extension of Maxwell's original prescription for an ideal gas is adopted to derive a broad class of Kappa-type velocity distributions, encompassing both fat and short-tailed forms. Within this general framework, a physically consistent fat-tailed Kappa distribution is identified that accurately fits recent suprathermal data. In particular, a kinetic physical temperature $T$ emerges naturally from the model, eliminating the need to invoke an effective temperature $T_{\\kappa\\ell}$, as is commonly done in the literature. Finally, it is argued that only a particular value of $\\ell$ ensures a satisfactory fit to the data when the physical kinetic temperature is employed.",
    "authors": [
      "J. A. S. Lima",
      "M. H. Benetti"
    ],
    "published": "2025-07-31T19:07:18Z",
    "updated": "2025-07-31T19:07:18Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1103/66yl-y4r1"
  },
  {
    "arxiv_id": "2504.13435v2",
    "url": "https://arxiv.org/abs/2504.13435v2",
    "pdf_url": "https://arxiv.org/pdf/2504.13435v2.pdf",
    "title": "A generalized framework for the critical current for a one-dimensional   crossed-field gap in an orthogonal coordinate system",
    "abstract": "Recent studies have applied variational calculus, conformal mapping, and point transformations to extend the one-dimensional SCLC from planar gaps to more complicated geometries. However, introducing a magnetic field orthogonal to the diode's electric field complicates these calculations due to changes in the electron trajectory. This paper extends a recent study that applied variational calculus to determine the SCLC for a cylindrical crossed-field diode to derive an equation that is valid for any orthogonal coordinate system. We then derive equations for the SCLC for crossed-field gaps in spherical, tip-to-tip, and tip-to-plane geometries that can be solved numerically. These calculations exhibit a discontinuity at the Hull cutoff magnetic field $B_H$ corresponding to the transition to magnetic insulation as observed analytically for a planar geometry. The ratio of the crossed-field SCLC to the nonmagnetic SCLC becomes essentially independent of geometry when we fix $\\delta = D/D_M > 0.6$, where $D$ is the canonical gap distance accounting for geometric effects on electric potential and $D_M$ is the effective gap distance that accounts for magnetic field and geometry. The solutions for these geometries overlap as $\\delta \\to 1$ since the geometric corrections for electric potential and magnetic field match. This indicates the possibility of more generally accounting for the combination of geometric and magnetic effects when calculating $B_H$ and SCLC.",
    "authors": [
      "Jack K. Wright",
      "N. R. Sree Harsha",
      "Allen L. Garner"
    ],
    "published": "2025-04-18T03:20:46Z",
    "updated": "2025-07-31T18:32:44Z",
    "categories": [
      "physics.plasm-ph",
      "physics.app-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1063/5.0276244"
  },
  {
    "arxiv_id": "2507.18672v2",
    "url": "https://arxiv.org/abs/2507.18672v2",
    "pdf_url": "https://arxiv.org/pdf/2507.18672v2.pdf",
    "title": "Analysis of RF Surface Loss in a Planar 2D Qubit",
    "abstract": "The Josephson junction and shunt capacitor form a transmon qubit, which is the cornerstone of modern quantum computing platforms. For reliable quantum computing, it is important how long a qubit can remain in a superposition of quantum states, which is determined by the coherence time (T1). The coherence time of a qubit effectively sets the \"lifetime\" of usable quantum information, determining how long quantum computations can be performed before errors occur and information is lost. There are several sources of decoherence in transmon qubits, but the predominant one is generally considered to be dielectric losses in the natural oxide layer formed on the surface of the superconductor. In this paper, we present a numerical study of microwave surface losses in planar superconducting antennas of different transmon qubit designs. An asymptotic method for estimating the energy participation ratio in ultrathin films of nanometer scales is proposed, and estimates are given for the limits of achievable minimum RF losses depending on the electrical properties of the surface oxide and the interface of the qubit with the substrate material.",
    "authors": [
      "Andrei Lunin",
      "Mustafa Bal",
      "Akshay Murthy",
      "Shaojiang Zhu",
      "Anna Grassellino",
      "Alexander Romanenko"
    ],
    "published": "2025-07-24T11:44:16Z",
    "updated": "2025-07-31T15:03:16Z",
    "categories": [
      "quant-ph",
      "physics.acc-ph"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2507.13907v2",
    "url": "https://arxiv.org/abs/2507.13907v2",
    "pdf_url": "https://arxiv.org/pdf/2507.13907v2.pdf",
    "title": "Novel techniques of imaging interferometry analysis to study gas and   plasma density for laser-plasma experiments",
    "abstract": "Laser-plasma based experiments are always more demanding about the plasma features which need to be generated during the interaction. This is valid for laser-plasma acceleration as well as for inertial confinement fusion experiments. Most of these experiments are moving toward high repetition rate operation regimes, making even more demanding the requests on the plasma sources and the diagnostics to be implemented.\\\\ Interferometry is one of the most used methods to characterize these sources, since it allows for non-perturbative, single-shot measurements either of the neutral gas or the plasma density. The design of the interferometric setup is non-trivial and needs to be shaped on the actual conditions of the experiment. Similarly, the analysis of the raw data is a complex task, prone to many sources of error and dependent on the manual inputs.\\\\ In this work, we will present the techniques we are developing for the analysis of the interferograms to measure both the gas and plasma density. We will show the methods, the progress and the problems we encountered in the development of novel routines of analysis based on machine learning. The architectures and the methods to obtain data used for training and testing them will be introduced. The study is ongoing and preliminary results with synthetic data will be presented. The goal is to set up a fast and operator independent diagnostic for the feedback of plasma sources toward high repetition rate experiments.",
    "authors": [
      "F. Filippi",
      "M. Cipriani",
      "S. Mastrostefano",
      "M. Scisciò",
      "F. Consoli"
    ],
    "published": "2025-07-18T13:37:07Z",
    "updated": "2025-07-31T10:59:44Z",
    "categories": [
      "physics.plasm-ph",
      "physics.data-an",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2410.18155v7",
    "url": "https://arxiv.org/abs/2410.18155v7",
    "pdf_url": "https://arxiv.org/pdf/2410.18155v7.pdf",
    "title": "On the Unruh effect for hyperbolic observers in spacetimes of maximal   proper acceleration",
    "abstract": "In this work, the notion of spacetime of maximal proper acceleration is motivated as a weak form to implement general covariance and a generalized form of Einstein's equivalence principle from a physical point of view and the fundamental geometric and kinematic properties of such spaces are discussed. Thereafter the Unruh temperature formula is generalized to the case of hyperbolic observers in spacetimes of maximal proper acceleration. Such a generalization implies the existence of a maximal value for the Unruh temperature. We discuss this result for an electrodynamic model of point charged particles in a spacetime of maximal proper acceleration. It is shown that according to the model, the maximal Unruh temperature must be of order $4.8\\cdot 10^{10}/N$ K for current high acceleration electron laser-plasma acceleration systems, where $N$ is the population of the typical bunch.",
    "authors": [
      "Ricardo Gallego Torromé"
    ],
    "published": "2024-10-23T08:15:03Z",
    "updated": "2025-07-31T10:19:07Z",
    "categories": [
      "gr-qc",
      "hep-th",
      "math-ph",
      "math.MP",
      "physics.acc-ph"
    ],
    "primary_category": "gr-qc",
    "doi": "10.1098/rspa.2024-0931"
  },
  {
    "arxiv_id": "2501.01524v2",
    "url": "https://arxiv.org/abs/2501.01524v2",
    "pdf_url": "https://arxiv.org/pdf/2501.01524v2.pdf",
    "title": "Gravitational Turbulence: the Small-Scale Limit of the Cold-Dark-Matter   Power Spectrum",
    "abstract": "The matter power spectrum, $P(k)$, is one of the fundamental quantities in the study of large-scale structure in cosmology. Here, we study its small-scale asymptotic limit, and show that for cold dark matter in $d$ spatial dimensions, $P(k)$ has a universal $k^{-d}$ asymptotic scaling with the wave-number $k$, for $k \\gg k_{\\rm nl}$, where $k_{\\rm nl}^{-1}$ denotes the length scale at which non-linearities in gravitational interactions become important. We propose a theoretical explanation for this scaling, based on a non-perturbative analysis of the system's phase-space structure. Gravitational collapse is shown to drive a turbulent phase-space flow of the quadratic Casimir invariant, where the linear and non-linear time scales are balanced, and this balance dictates the $k$ dependence of the power spectrum. A parallel is drawn to Batchelor turbulence in hydrodynamics, where large scales mix smaller ones via tidal interactions. The $k^{-d}$ scaling is also derived by expressing $P(k)$ as a phase-space integral in the framework of kinetic field theory, which is analysed by the saddle-point method; the dominant critical points of this integral are precisely those where the time scales are balanced. The coldness of the dark-matter distribution function - its non-vanishing only on a $d$-dimensional sub-manifold of phase-space - underpins both approaches. The theory is accompanied by $1\\mathrm{D}$ Vlasov-Poisson simulations, which confirm it.",
    "authors": [
      "Yonadav Barry Ginat",
      "Michael L. Nastac",
      "Robert J. Ewart",
      "Sara Konrad",
      "Matthias Bartelmann",
      "Alexander A. Schekochihin"
    ],
    "published": "2025-01-02T20:27:49Z",
    "updated": "2025-07-31T10:14:41Z",
    "categories": [
      "astro-ph.CO",
      "astro-ph.GA",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.CO"
  },
  {
    "arxiv_id": "2502.17280v3",
    "url": "https://arxiv.org/abs/2502.17280v3",
    "pdf_url": "https://arxiv.org/pdf/2502.17280v3.pdf",
    "title": "Monitoring the tagging efficiency of the Low-Energy Muon beamline   through background analysis: Insights into the long-term performance of   ultrathin carbon foils",
    "abstract": "The efficient tagging of individual muons, along with the stability of the involved ultrathin carbon foil, is critical for ensuring fast, reliable and reproducible low-energy muon spin rotation (LE-$\\mathrm{\\mu}$SR) measurements. At the Paul Scherrer Institute's Low-Energy Muon (LEM) beamline, we developed a method to monitor the tagging efficiency of the beamline using routinely collected muon decay histograms. This method leverages background comparison before and after the arrival time of the muons at the sample to extract the tagging efficiency, eliminating the need for additional detectors or measurements. By analyzing data collected between 2018 and 2024, we confirm the method's reliability and validate its results using independent reference measurements. Furthermore, we establish a correlation between the tagging efficiency and foil thickness by investigating the impact of contamination and outgassing on the carbon foil, as well as the restoration effects of laser cleaning. The findings underscore the importance of monitoring the carbon foil's condition to maintain consistent beamline performance and reproducibility. This method offers a practical approach for detector efficiency monitoring, applicable to other beamlines employing similar setups.",
    "authors": [
      "Gianluca Janka",
      "Herman Ishchenko",
      "Zaher Salman",
      "Andreas Suter",
      "Thomas Prokscha"
    ],
    "published": "2025-02-24T16:10:19Z",
    "updated": "2025-07-31T09:35:29Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.23368v1",
    "url": "https://arxiv.org/abs/2507.23368v1",
    "pdf_url": "https://arxiv.org/pdf/2507.23368v1.pdf",
    "title": "Preliminary design and simulation for CEPC fast luminosity monitor   detector based on 4H-SiC",
    "abstract": "The Circular Electron-Positron Collider (CEPC), a next-generation high-luminosity collider, employs a crab waist scheme to achieve ultrahigh $5 \\times 10^{34} \\, \\text{cm}^{-2}\\text{s}^{-1}$ luminosity at Higgs mode. Owing to the extremely small beam size, the luminosity is highly sensitive to the stability of final focusing elements, where mechanical vibrations (e.g. ground motion) may induce beam offsets and luminosity degradation. To address this, a luminosity-driven dithering system is implemented for horizontal beam stabilization. In this work, we develop an optimized 4H-SiC fast luminosity detector scheme using an array of radiation detectors with picosecond time resolution positioned at critical locations. By using self-development software RAdiation SEmiconductoR (RASER), we optimize the active area of the detector to achieve 2\\% relative precision at 1~kHz. Furthermore, the Total Sample Current (TSC) exhibits a near-linear correlation with luminosity attenuation, enabling real-time luminosity monitoring.",
    "authors": [
      "Yanpeng Li",
      "Meng Li",
      "Xingrui Wang",
      "Weimin Song",
      "Xiyuan Zhang",
      "Congcong Wang",
      "Suyu Xiao",
      "Haoyu Shi",
      "Dou Wang",
      "Philip Bambade",
      "Xin Shi"
    ],
    "published": "2025-07-31T09:30:14Z",
    "updated": "2025-07-31T09:30:14Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2312.07957v3",
    "url": "https://arxiv.org/abs/2312.07957v3",
    "pdf_url": "https://arxiv.org/pdf/2312.07957v3.pdf",
    "title": "Scintillation characteristics of an undoped CsI crystal at   low-temperature for dark matter search",
    "abstract": "The scintillation characteristics of 1 g undoped CsI crystal were studied by directly coupling two silicon photomultipliers(SiPMs) over a temperature range from room temperature to 86 K. The scintillation decay time and light output were measured using x-ray and gamma-ray peaks from a 109Cd radioactive source. An increase in decay time was observed as the temperature decreased from room temperature to 86 K, ranging from 76 ns to 605 ns. The light output also increased, reaching 26.2 +/- 1.3 photoelectrons per keV electron-equivalent at 86 K. Leveraging the significantly enhanced scintillation light output of the undoped CsI crystal at low temperatures, coupling it with SiPMs results in a promising detector for rare event searches. Both cesium and iodine have an odd number of protons, making them suitable targets for probing dark matter-proton spin-dependent interactions. This study evaluates the sensitivity of the proposed detector to such interactions, incorporating the Migdal effect and assuming 200 kg of undoped CsI crystals for dark matter searches. The results indicate that undoped CsI coupled with SiPM can achieve world-competitive sensitivity for low-mass dark matter detection, particularly in the context of dark matter-proton spin-dependent interactions.",
    "authors": [
      "W. K. Kim",
      "H. Y. Lee",
      "K. W. Kim",
      "Y. J. Ko",
      "J. A. Jeon",
      "H. J. Kim",
      "H. S. Lee"
    ],
    "published": "2023-12-13T08:08:38Z",
    "updated": "2025-07-31T08:50:59Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.23297v1",
    "url": "https://arxiv.org/abs/2507.23297v1",
    "pdf_url": "https://arxiv.org/pdf/2507.23297v1.pdf",
    "title": "Simulation-based inference for Precision Neutrino Physics through Neural   Monte Carlo tuning",
    "abstract": "Precise modeling of detector energy response is crucial for next-generation neutrino experiments which present computational challenges due to lack of analytical likelihoods. We propose a solution using neural likelihood estimation within the simulation-based inference framework. We develop two complementary neural density estimators that model likelihoods of calibration data: conditional normalizing flows and a transformer-based regressor. We adopt JUNO - a large neutrino experiment - as a case study. The energy response of JUNO depends on several parameters, all of which should be tuned, given their non-linear behavior and strong correlations in the calibration data. To this end, we integrate the modeled likelihoods with Bayesian nested sampling for parameter inference, achieving uncertainties limited only by statistics with near-zero systematic biases. The normalizing flows model enables unbinned likelihood analysis, while the transformer provides an efficient binned alternative. By providing both options, our framework offers flexibility to choose the most appropriate method for specific needs. Finally, our approach establishes a template for similar applications across experimental neutrino and broader particle physics.",
    "authors": [
      "A. Gavrikov",
      "A. Serafini",
      "D. Dolzhikov",
      "A. Garfagnini",
      "M. Gonchar",
      "M. Grassi",
      "R. Brugnera",
      "V. Cerrone",
      "L. V. D'Auria",
      "R. M. Guizzetti",
      "L. Lastrucci",
      "G. Andronico",
      "V. Antonelli",
      "A. Barresi",
      "D. Basilico",
      "M. Beretta",
      "A. Bergnoli",
      "M. Borghesi",
      "A. Brigatti",
      "R. Bruno",
      "A. Budano",
      "B. Caccianiga",
      "A. Cammi",
      "R. Caruso",
      "D. Chiesa",
      "C. Clementi",
      "C. Coletta",
      "S. Dusini",
      "A. Fabbri",
      "G. Felici",
      "G. Ferrante",
      "M. G. Giammarchi",
      "N. Giudice",
      "N. Guardone",
      "F. Houria",
      "C. Landini",
      "I. Lippi",
      "L. Loi",
      "P. Lombardi",
      "F. Mantovani",
      "S. M. Mari",
      "A. Martini",
      "L. Miramonti",
      "M. Montuschi",
      "M. Nastasi",
      "D. Orestano",
      "F. Ortica",
      "A. Paoloni",
      "L. Pelicci",
      "E. Percalli",
      "F. Petrucci",
      "E. Previtali",
      "G. Ranucci",
      "A. C. Re",
      "B. Ricci",
      "A. Romani",
      "C. Sirignano",
      "M. Sisti",
      "L. Stanco",
      "E. Stanescu Farilla",
      "V. Strati",
      "M. D. C Torri",
      "C. Tuvè",
      "C. Venettacci",
      "G. Verde",
      "L. Votano"
    ],
    "published": "2025-07-31T07:33:05Z",
    "updated": "2025-07-31T07:33:05Z",
    "categories": [
      "physics.data-an",
      "cs.LG",
      "hep-ex",
      "hep-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.data-an"
  },
  {
    "arxiv_id": "2507.23183v1",
    "url": "https://arxiv.org/abs/2507.23183v1",
    "pdf_url": "https://arxiv.org/pdf/2507.23183v1.pdf",
    "title": "Fundamental Limitations of Absolute Ranging via Deep Frequency   Modulation Interferometry",
    "abstract": "High-precision absolute length metrology using laser interferometry faces inherent challenges from interferometric ambiguity. Deep Frequency Modulation Interferometry (DFMI) addresses this by simultaneously extracting two distinct length-encoding parameters: the precise, ambiguous interferometric phase ($\\Phi$) and the coarser, unambiguous effective modulation depth ($m$). This paper establishes the fundamental statistical and systematic limitations governing the absolute accuracy of DFMI. We detail two primary readout algorithms: a frequency-domain Non-Linear Least Squares (NLS) fit and a time-domain Extended Kalman Filter (EKF). We derive the Cram\\'er-Rao Lower Bound (CRLB) for the estimation of $m$ and $\\Phi$, identifying intrinsic ``dead zones'' where precision degrades, and asymptotic limits as a function of signal quality and integration time, achievable by both NLS and EKF. Critically, we develop analytical models for dominant systematic biases, revealing previously uncharted ``valleys of robustness'' -- specific operating points where errors from modulation non-linearity and residual amplitude modulation are strongly suppressed. This analysis clarifies critical trade-offs between different design parameters, integration time, and total error, informing instrument design and underscoring the necessity of advanced compensation techniques for high-accuracy applications.",
    "authors": [
      "Miguel Dovale-Álvarez"
    ],
    "published": "2025-07-31T01:36:24Z",
    "updated": "2025-07-31T01:36:24Z",
    "categories": [
      "physics.optics",
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2507.23062v1",
    "url": "https://arxiv.org/abs/2507.23062v1",
    "pdf_url": "https://arxiv.org/pdf/2507.23062v1.pdf",
    "title": "Impact of Proton Irradiation on 4H-SiC Low Gain Avalanche Detectors   (LGADs)",
    "abstract": "Silicon carbide (SiC) particle detectors have the potential to provide time resolutions and robust performance in extreme environments which exceed that of silicon detectors. In this work 4H-SiC low gain avalanche detectors (LGADs) and complementary PiN diodes were irradiated with 2.5 GeV protons at fluences up to 3.33$\\times$10$^{14}$ p/cm$^2$. The electrostatic performance of both irradiated and non-irradiated devices was evaluated using current-voltage (I-V) and capacitance-voltage (C-V) measurements. Moreover, charge collection measurements using $\\alpha$ particles were also conducted. SiC LGADs displayed a loss in rectification and gain with increasing proton fluence. Additionally, the reduction in capacitance and OFF-state current pointed to compensation of the gain layer as a gain reducing mechanism. The introduction of radiation induced defects also hinders carrier acceleration reducing impact ionization, leading to further gain reduction. However, despite the reduction in device performance, the demonstration of a measurable signal and gain after irradiation points to the potential of SiC LGAD detectors for future high energy physics applications.",
    "authors": [
      "Yashas Satapathy",
      "Ben J. Sekely",
      "Abraham Tishelman-Charny",
      "Tao Yang",
      "Greg Allion",
      "Gil Atar",
      "Philip Barletta",
      "Carl Haber",
      "Steve E. Holland",
      "John F. Muth",
      "Spyridon Pavlidis",
      "Stefania Stucci"
    ],
    "published": "2025-07-30T19:47:21Z",
    "updated": "2025-07-30T19:47:21Z",
    "categories": [
      "physics.ins-det",
      "physics.app-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.23003v1",
    "url": "https://arxiv.org/abs/2507.23003v1",
    "pdf_url": "https://arxiv.org/pdf/2507.23003v1.pdf",
    "title": "Characterization of spurious-electron signals in the double-phase argon   TPC of the DarkSide-50 experiment",
    "abstract": "Spurious-electron signals in dual-phase noble-liquid time projection chambers have been observed in both xenon and argon Time Projection Chambers (TPCs). This paper presents the first comprehensive study of spurious electrons in argon, using data collected by the DarkSide-50 experiment at the INFN Laboratori Nazionali del Gran Sasso (LNGS). Understanding these events is a key factor in improving the sensitivity of low-mass dark matter searches exploiting ionization signals in dual-phase noble liquid TPCs.   We find that a significant fraction of spurious-electron events, ranging from 30 to 70% across the experiment's lifetime, are caused by electrons captured from impurities and later released with delays of order 5-50 ms. The rate of spurious-electron events is found to correlate with the operational condition of the purification system and the total event rate in the detector. Finally, we present evidence that multi-electron spurious electron events may originate from photo-ionization of the steel grid used to define the electric fields. These observations indicate the possibility of reduction of the background in future experiments and hint at possible spurious electron production mechanisms.",
    "authors": [
      "DarkSide-50 Collaboration",
      ":",
      "P. Agnes",
      "I. F. Albuquerque",
      "T. Alexander",
      "A. K. Alton",
      "M. Ave",
      "H. O. Back",
      "G. Batignani",
      "E. Berzin",
      "K. Biery",
      "V. Bocci",
      "W. M. Bonivento",
      "B. Bottino",
      "S. Bussino",
      "M. Cadeddu",
      "M. Cadoni",
      "F. Calaprice",
      "A. Caminata",
      "M. D. Campos",
      "N. Canci",
      "M. Caravati",
      "N. Cargioli",
      "M. Cariello",
      "M. Carlini",
      "V. Cataudella",
      "P. Cavalcante",
      "S. Cavuoti",
      "S. Chashin",
      "A. Chepurnov",
      "C. Cicalò",
      "G. Covone",
      "D. D'Angelo",
      "S. Davini",
      "A. De Candia",
      "S. De Cecco",
      "G. De Filippis",
      "G. De Rosa",
      "A. V. Derbin",
      "A. Devoto",
      "M. D'Incecco",
      "C. Dionisi",
      "F. Dordei",
      "M. Downing",
      "D. D'Urso",
      "M. Fairbairn",
      "G. Fiorillo",
      "D. Franco",
      "F. Gabriele",
      "C. Galbiati",
      "C. Ghiano",
      "C. Giganti",
      "G. K. Giovanetti",
      "A. M. Goretti",
      "G. Grilli di Cortona",
      "A. Grobov",
      "M. Gromov",
      "M. Guam",
      "M. Gulino",
      "B. R. Hackett",
      "K. Herner",
      "T. Hessel",
      "B. Hosseini",
      "F. Hubaut",
      "T. Hugues",
      "E. V. Hungerford",
      "A. Ianni",
      "V. Ippolito",
      "K. Keeter",
      "C. L. Kendziora",
      "M. Kimura",
      "I. Kochanek",
      "D. Korablev",
      "G. Korga",
      "A. Kubankin",
      "M. Kuss",
      "M. Kuźniak",
      "M. La Commara",
      "M. Lai",
      "X. Li",
      "M. Lissia",
      "G. Longo",
      "O. Lychagina",
      "I. N. Machulin",
      "L. P. Mapelli",
      "S. M. Mari",
      "J. Maricic",
      "A. Messina",
      "R. Milincic",
      "J. Monroe",
      "M. Morrocchi",
      "V. N. Muratova",
      "P. Musico",
      "A. O. Nozdrina",
      "A. Oleinik",
      "F. Ortica",
      "L. Pagani",
      "M. Pallavicini",
      "L. Pandola",
      "E. Pantic",
      "E. Paoloni",
      "K. Pelczar",
      "N. Pelliccia",
      "S. Piacentini",
      "A. Pocar",
      "M. Poehlmann",
      "S. Pordes",
      "S. S. Poudel",
      "P. Pralavorio",
      "D. Price",
      "F. Ragusa",
      "M. Razeti",
      "A. Razeto",
      "A. L. Renshaw",
      "M. Rescigno",
      "J. Rode",
      "A. Romani",
      "D. Sablone",
      "O. Samoylov",
      "E. Sandford",
      "W. Sands",
      "S. Sanfilippo",
      "C. Savarese",
      "B. Schlitzer",
      "D. A. Semenov",
      "A. Shchagin",
      "A. Sheshukov",
      "M. D. Skorokhvatov",
      "O. Smirnov",
      "A. Sotnikov",
      "R. Stefanizzi",
      "S. Stracka",
      "C. Sunny",
      "Y. Suvorov",
      "R. Tartaglia",
      "G. Testera",
      "A. Tonazzo",
      "E. V. Unzhakov",
      "A. Vishneva",
      "R. B. Vogelaar",
      "M. Wada",
      "H. Wang",
      "Y. Wang",
      "S. Westerdale",
      "M. M. Wojcik",
      "X. Xiao",
      "C. Yang",
      "G. Zuzel"
    ],
    "published": "2025-07-30T18:09:21Z",
    "updated": "2025-07-30T18:09:21Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2406.02837v2",
    "url": "https://arxiv.org/abs/2406.02837v2",
    "pdf_url": "https://arxiv.org/pdf/2406.02837v2.pdf",
    "title": "General-Relativistic Gauge-Invariant Magnetic Helicity Transport: Basic   Formulation and Application to Neutron Star Mergers",
    "abstract": "Dynamo processes are ubiquitous in astrophysical systems. In relativistic astrophysical systems, such as accretion disks around black holes or neutron stars, they may critically affect the launching of winds and jets that can power electromagnetic emission. Dynamo processes are governed by several microscopic parameters, one of them being magnetic helicity. As a conserved quantity in nonresistive plasmas, magnetic helicity is transported across the system. One important implication of helicity conservation is, that in the absence of helicity fluxes some mean-field dynamos can be quenched, potentially affecting the large-scale evolution of the magnetic field. One of the major challenges in computing magnetic helicity is the need to fix a meaningful electromagnetic gauge. We here present a fully covariant formulation of magnetic helicity transport in general-relativistic plasmas based on the concept of relative helicity by Berger & Field and Finn & Antonsen. This formulation is separately invariant under gauge-transformation of the Maxwell and Einstein equations. As an application of this new formalism we present the first analysis of magnetic helicity transport in the merger of two neutron stars. We demonstrate the presence of global helicity fluxes into the outer layers of the stellar merger remnant, which may impact subsequent large-scale dynamo amplification in these regions.",
    "authors": [
      "Jiaxi Wu",
      "Elias R. Most"
    ],
    "published": "2024-06-05T01:27:31Z",
    "updated": "2025-07-30T16:40:01Z",
    "categories": [
      "astro-ph.HE",
      "gr-qc",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE",
    "doi": "10.1103/PhysRevD.110.124046"
  },
  {
    "arxiv_id": "2507.22821v1",
    "url": "https://arxiv.org/abs/2507.22821v1",
    "pdf_url": "https://arxiv.org/pdf/2507.22821v1.pdf",
    "title": "Axisymmetric Gyrokinetic Simulation of ASDEX-Upgrade Scrape-off Layer   Using a Conservative Implicit BGK Collision Operator",
    "abstract": "Collisions play an important role in turbulence and transport of fusion plasmas. For kinetic simulations, as the collisionality increases in the domain of interest, the size of the time step to resolve the collisional physics can become overly restrictive in an explicit time integration scheme, leading to high computational cost. With the aim of overcoming such restriction, we have implemented an implicit Bhatnagar-Gross-Krook (BGK) collision operator for use in the discontinuous Galerkin (DG) full-f gyrokinetic solver within the Gkeyll framework, which, when combined with Gkeyll's traditional explicit time integrator for collisionless advection, can significantly increase the time step in gyrokinetic simulations of highly collisional regimes. To ensure conservation of density, momentum, and energy, we utilize an iterative scheme to correct the discretized approximation to the equilibrium Maxwellian distribution to which the BGK collision operator relaxes. We have further generalized the BGK infrastructure, both the implicit scheme and the correction routine, to handle cross species collisions. This improved implicit and conservative BGK operator is benchmarked against the more accurate but more computationally expensive Lenard-Bernstein-Dougherty (LBD) operator which has been utilized in prior studies with Gkeyll. The implicit BGK operator enables 2D axisymmetric simulations of the ASDEX-Upgrade scrape-off layer to run 56 times faster to completion than the simulations with the LBD operator, because the BGK operator is more robust and converges at a lower resolution than is required by the LBD operator. Additionally, in this more collisional limit, we demonstrate that the results of our simulations utilizing the implicit BGK operator agreed well with simulations utilizing the more computationally expensive LBD operator.",
    "authors": [
      "D. Liu",
      "J. Juno",
      "G. W. Hammett",
      "A. Hakim",
      "A. Shukla",
      "M. Francisquez"
    ],
    "published": "2025-07-30T16:36:30Z",
    "updated": "2025-07-30T16:36:30Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.22751v1",
    "url": "https://arxiv.org/abs/2507.22751v1",
    "pdf_url": "https://arxiv.org/pdf/2507.22751v1.pdf",
    "title": "Characterization of mini-CryoCube detectors from the Ricochet experiment   commissioning at the Institut Laue-Langevin",
    "abstract": "The Ricochet experiment aims to measure the coherent elastic neutrino-nucleus scattering process from antineutrinos emitted by a research nuclear reactor operated by the Institut Laue-Langevin (Grenoble, France). This article presents a description of the Ricochet experimental installation and the detector performance achieved during its commissioning with a mini-CryoCube module consisting of three 42-gram germanium cryogenic calorimeters. The baseline resolutions and background levels are reported both during reactor-on and reactor-off periods, and as noise mitigation techniques were improved. A baseline resolution of 40 eV electron equivalent was achieved for the ionization channel after setup improvements, and the phonon channel resolutions ranged from 50 to 80 eV of total phonon energy. In the energy region from 2 to 7 keV, a nuclear recoil rate of 15(2) events/(kg day keV) is measured during the reactor-off period selecting events in coincidence with muon veto signals. This rate is in agreement with the cosmogenic neutron rate calculated from GEANT4 simulations. After the rejection of events in coincidence with signals in the muon veto detectors, a combined 90% C.L. limit on the nuclear recoil background of < 9 events/(kg day keV) is obtained in that energy region during the reactor-on period, which is compatible with our GEANT4 model calculation corresponding to a total rate of 5 events/(kg day keV). The sensitivity of this analysis was however found to be limited by a surface event contamination which is currently being addressed by the Ricochet Collaboration with upgraded detectors.",
    "authors": [
      "Antoine Armatol",
      "Corinne Augier",
      "Louis Bailly-Salins",
      "Guillaume Baulieu",
      "Laurent Bergé",
      "Julien Billard",
      "Juliette Blé",
      "Guillaume Bres",
      "Jean-Louis Bret",
      "Alexandre Broniatowski",
      "Martino Calvo",
      "Antonella Cavanna",
      "Antoine Cazes",
      "Emanuela Celi",
      "David Chaize",
      "Mohammed Chala",
      "Maurice Chappellier",
      "Luke Chaplinsky",
      "Guillaume Chemin",
      "Ran Chen",
      "Jules Colas",
      "Laurent Couraud",
      "Elspeth Cudmore",
      "Maryvonne De Jesus",
      "Nicole Dombrowski",
      "Louis Dumoulin",
      "Alan Durnez",
      "Olivier Exshaw",
      "Sylvain Ferriol",
      "Enectali Figueroa-Feliciano",
      "Joseph A. Formaggio",
      "Stephane Fuard",
      "Jules Gascon",
      "Andrea Giuliani",
      "Corinne Goy",
      "Cyrille Guerin",
      "Elsa Guy",
      "Leïla Haegel",
      "Scott A. Hertel",
      "Christophe Hoarau",
      "Ziqing Hong",
      "Jean-Christophe Ianigro",
      "Yong Jin",
      "Alexandre Juillard",
      "Temirlan Khussainov",
      "Andrew Kubik",
      "Jacob Lamblin",
      "Hugues Lattaud",
      "Tatiana Le-Bellec",
      "Laetitia Leroy",
      "Mingyu Li",
      "Alexey Lubashevskiy",
      "Stefanos Marnieros",
      "Nicolas Martini",
      "Julien Minet",
      "Alessandro Monfardini",
      "Franck Mounier",
      "Valentina Novati",
      "Emiliano Olivieri",
      "Pratyush K. Patel",
      "Eric Perbet",
      "Harold Douglas Pinckney",
      "Denys V. Poda",
      "Dmitrii Ponomarev",
      "Wouter Van De Pontseele",
      "Jean-Sébastien Real",
      "Faith C. Reyes",
      "Alejandro Rodriguez",
      "Murielle Rousseau",
      "Sergey Rozov",
      "Irina Rozova",
      "Brianna Ryan",
      "Deeksha Sabhari",
      "Silvia Scorza",
      "Renaud Serra",
      "Yegor Shevchik",
      "Torsten Soldner",
      "Anne Stutz",
      "Christian Ulysse",
      "Lionel Vagneron",
      "Sergey Vasilyev",
      "Francis Vezzu",
      "Paul Vittaz",
      "Evgeny Yakushev",
      "Jiatong Yang",
      "Daniya Zinatulina"
    ],
    "published": "2025-07-30T15:08:43Z",
    "updated": "2025-07-30T15:08:43Z",
    "categories": [
      "astro-ph.IM",
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2505.06476v2",
    "url": "https://arxiv.org/abs/2505.06476v2",
    "pdf_url": "https://arxiv.org/pdf/2505.06476v2.pdf",
    "title": "A Flare-related Decimetric Type-IV Radio Burst Induced by the X2   Radiation of Electron Cyclotron Maser Emission",
    "abstract": "The radiation mechanism of decimetric wideband and pulsating radio bursts from the Sun (in terms of decimetric type-IV (t-IVdm) burst) and other flaring stars is a long-standing problem. Early investigations were based on the leading-spot hypothesis for the sun and yielded contradictory results. Here, we analyzed the flare-associated t-IVdm burst on 20110924 with medium-strong levels of polarization and from sources near a sunspot. We found that the emission is intermittent and the maximum $T_B$ exceeds 10$^{11}$ K, with well-defined upper and lower frequency cutoffs. The radio sources are left-handed polarized, located above the sunspot with a negative polarity. The sources align well with the sites of the second harmonic of the local electron gyrofrequency. These findings provide essential evidence that the burst is induced by the electron cyclotron maser emission (ECME) in the harmonic X mode. We further modeled the transport of downward-streaming energetic electrons along a coronal loop and found most electrons get mirrored within the specific altitude range of 20-100 Mm. This explains why such bursts tend to have well-defined spectral ranges. We also found the ECME-radiating energetic electrons exhibit a shell-like VDF instead of the generally-presumed loss-cone distribution. The study greatly expands the application of ECME in solar radio astronomy and provides solar samples for similar bursts from other flaring stars.",
    "authors": [
      "Maoshui Lv",
      "Ze Zhong",
      "Xiangliang Kong",
      "Hao Ning",
      "Feiyu Yu",
      "Bing Wang",
      "Baolin Tan",
      "Victor Melnikov",
      "Alexey Kuznetsov",
      "Hongqiang Song",
      "Ruisheng Zheng",
      "Yao Chen"
    ],
    "published": "2025-05-10T00:29:40Z",
    "updated": "2025-07-30T14:39:12Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2507.22672v1",
    "url": "https://arxiv.org/abs/2507.22672v1",
    "pdf_url": "https://arxiv.org/pdf/2507.22672v1.pdf",
    "title": "A visual approach to global accretion disk instabilities",
    "abstract": "For over 30 years, the Magneto-Rotational Instability has been accepted as the mechanism driving accretion disk turbulence. Its physical basis is well understood, where an interplay between centrifugal forces and magnetic tension transfers angular momentum between oppositely displaced fluid elements. In this work, we revisit this picture in global disk models and various magnetic field topologies and generalise it to non-axisymmetric instabilities like the Super-Alfv\\'enic Rotational Instability (SARI). We use the open-source \\texttt{Legolas} software to quantify all complex-valued linear eigenfunctions for the (near-)eigenmodes and visualise the resulting spatio-temporal variations in real space in a manner that can be compared to direct numerical simulations of disks. The field perturbations are fundamentally different between the (axisymmetric) MRI and the novel, ultra-localised SARI modes, which bear some resemblance to spiral modes in galaxies but differ in important ways. We use a combined numerical-analytical approach to study the polarization of the magnetic and velocity field perturbations. Finally, we compare disks of differing magnetic topology where many linear modes are merely superposed to recreate a visual impression of `turbulent' fields and quantify the resulting stresses. We find that even superposed, still linearly growing SARI modes can already provide the needed effective viscosity-related alpha-values invoked for angular momentum transport. 3D views on the magnetic field perturbations show that SARI modes of opposite azimuthal mode number may naturally introduce plasmoid and toroidal flux-tube like field deformations.",
    "authors": [
      "Nicolas Brughmans",
      "Rony Keppens"
    ],
    "published": "2025-07-30T13:36:12Z",
    "updated": "2025-07-30T13:36:12Z",
    "categories": [
      "astro-ph.GA",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.GA"
  },
  {
    "arxiv_id": "2502.01542v2",
    "url": "https://arxiv.org/abs/2502.01542v2",
    "pdf_url": "https://arxiv.org/pdf/2502.01542v2.pdf",
    "title": "Towards a Robust Model-Independent Test of the DAMA/LIBRA Dark Matter   Signal: ANAIS-112 Results with Six Years of Data",
    "abstract": "The nature of dark matter, which constitutes 27% of the Universe's matter-energy content, remains one of the most challenging open questions in physics. Over the past two decades, the DAMA/LIBRA experiment has reported an annual modulation in the detection rate of $\\approx$250 kg of NaI(Tl) detectors operated at the Gran Sasso Laboratory, which the collaboration interprets as evidence of the galactic dark matter detection. However, this claim has not been independently confirmed and is refuted under certain dark matter particle and halo model scenarios. Therefore, it is crucial to perform an experiment with the same target material. The ANAIS experiment uses 112.5 kg of NaI(Tl) detectors at the Canfranc Underground Laboratory and it has been collecting data since August 2017 to model-independently test the DAMA/LIBRA result. This article presents the results of the annual modulation analysis corresponding to six years of ANAIS-112 data. Our results, the most sensitive to date with the same target material, NaI(Tl), are incompatible with the DAMA/LIBRA modulation signal at a 4$\\sigma$ confidence level. Such a discrepancy strongly challenges the DAMA/LIBRA dark matter interpretation and highlights the need to address systematic uncertainties affecting the comparison, particularly those related to the response of detectors to nuclear recoils, which may require further characterization of the DAMA crystals.",
    "authors": [
      "Julio Amaré",
      "Jaime Apilluelo",
      "Susana Cebrián",
      "David Cintas",
      "Iván Coarasa",
      "Eduardo García",
      "María Martínez",
      "Ysrael Ortigoza",
      "Alfonso Ortiz de Solórzano",
      "Tamara Pardo",
      "Jorge Puimedón",
      "María Luisa Sarsa",
      "Carmen Seoane"
    ],
    "published": "2025-02-03T17:22:02Z",
    "updated": "2025-07-30T11:18:17Z",
    "categories": [
      "astro-ph.IM",
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2507.22561v1",
    "url": "https://arxiv.org/abs/2507.22561v1",
    "pdf_url": "https://arxiv.org/pdf/2507.22561v1.pdf",
    "title": "Filamentation of the electromagnetic precursor in relativistic   quasi-perpendicular electron-positron shocks",
    "abstract": "We present a scenario that could explain non-thermal particle acceleration in relativistic quasi-perpendicular electron-positron shocks, such as the termination shock of pulsar wind nebulae. The shock produces a strong electromagnetic precursor that propagates into the upstream plasma, which is initially threaded by a uniform background magnetic field. We show that the filamentation instability breaks the precursor into radiation filaments parallel to the shock normal. The transverse scale of the filaments is of the order of a few plasma skin depths. In the shock frame, the bulk Lorentz factor of the upstream plasma is significantly reduced inside the radiation filaments. Then, the instability produces a relativistic shear flow with strong velocity gradients on kinetic scales. The velocity gradients distort the background magnetic field lines, and generate a magnetic field component parallel to the shock normal that reverses across each radiation filament, a configuration that could trigger magnetic reconnection in the upstream plasma. These effects may accelerate particles before the plasma enters the shock.",
    "authors": [
      "Emanuele Sobacchi",
      "Yuri Lyubarsky",
      "Lorenzo Sironi",
      "Masanori Iwamoto"
    ],
    "published": "2025-07-30T10:36:30Z",
    "updated": "2025-07-30T10:36:30Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2507.22560v1",
    "url": "https://arxiv.org/abs/2507.22560v1",
    "pdf_url": "https://arxiv.org/pdf/2507.22560v1.pdf",
    "title": "Use of solid fused silica etalon with broadband metallic coatings for   calibration of high-resolution optical spectrograph",
    "abstract": "Wavelength calibration is a key factor for high-resolution spectroscopic measurements for precision radial velocities. Hollow-cathode lamps (e.g., ThAr), absorption cells (e.g., iodine cell), dielectric coated Fabry-P\\'erot etalons and laser frequency combs have been implemented over the years for precise wavelength calibration and wavelength drift measurements. However, due to their various impediments as wavelength calibrators, investigations of alternative methods remain of prime interest. In this paper, we examined the feasibility of low-cost (~ $1000) commercially available solid fused silica etalon with a broadband metallic coating as a calibrator. We studied the behaviour for two cavity spacings (free spectral range of 1/cm and 0.5/cm) with temperature from theoretical derivation and experimental data. Our setup had a temperature stability of 0.8 mK for a calibrator system using an off-the-shelf dewar flask with active stabilisation. Our result from radial velocity drift measurements demonstrated that such a calibration system is capable of providing higher signal-to-noise calibration and better nightly drift measurement relative to ThAr in the wavelength range between 470 nm and 780 nm. A similar result has been previously found for Fabry-P\\'erot etalons, and although the metalon solution lacks the efficiency of an etalon, it does offers a cost-effective broadband solution, which should be less prone to aging relative to complex dielectric mirror coatings. Nonetheless, long-term monitoring is required to understand the metalon behaviour in detail.",
    "authors": [
      "Supriyo Ghosh",
      "William Martin",
      "Kajal Kunverji",
      "Hugh R. A. Jones"
    ],
    "published": "2025-07-30T10:35:53Z",
    "updated": "2025-07-30T10:35:53Z",
    "categories": [
      "astro-ph.IM",
      "astro-ph.EP",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2507.22516v1",
    "url": "https://arxiv.org/abs/2507.22516v1",
    "pdf_url": "https://arxiv.org/pdf/2507.22516v1.pdf",
    "title": "Manufacturing Tolerances of Non-Planar Coils for an Optimized Tabletop   Stellarator",
    "abstract": "Stellarator coils are known for their complexity and departure from planarity, along with tight manufacturing tolerances in order to achieve the target magnetic field accuracy. These requirements can lead to increased costs and delays in assembly; failure to meet them can compromise the stellarator's performance. Small-scale experiments offer opportunities to develop and benchmark stellarator coil design and evaluation methods more quickly and at lower budget. In this work, we analyze precise 3D scans of the manufacturing deviations of two 3D-printed coil frames (steel, Ti alloy) and one CNC-machined coil frame (Al alloy), as part of assessing these approaches to fabricating high-temperature superconducting (HTS) coils for a tabletop stellarator. The deviations are measured along the coil length, then modeled using Gaussian processes to extract characteristic length scales. Finally a statistical study of field accuracy is performed using relevant experimental parameters. We conclude that the manufacturing perturbations along the winding path from CNC-machining are almost an order of magnitude lower than those from Additive Manufacturing. Together with high overall fabrication accuracy, this allows for higher magnetic field precision and an improved assembly process.",
    "authors": [
      "Pedro F. Gil",
      "Vitali Brack",
      "Tristan Schuler",
      "Paul Huslage",
      "E. V. Stenson"
    ],
    "published": "2025-07-30T09:40:00Z",
    "updated": "2025-07-30T09:40:00Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2502.16392v4",
    "url": "https://arxiv.org/abs/2502.16392v4",
    "pdf_url": "https://arxiv.org/pdf/2502.16392v4.pdf",
    "title": "femto-PIXAR: a neural network method for reconstruction of femtosecond   X-ray free electron laser pulse energy",
    "abstract": "X-ray Free Electron Lasers (X\\nobreakdash-FELs) operate in a wide range of lasing configurations for a broad variety of scientific applications at ultrafast time-scales such as structural biology, materials science, and atomic and molecular physics. Shot-by-shot characterization of the X-FEL pulses is crucial for analysis of many experiments as well as tuning the X-FEL performance. However, for the weak pulses found in advanced configurations, e.g. those needed for coherent, two-pulse studies of quantum materials, there is no current method for reliably resolving pulse profiles. Here we show that a physics-based U-net model can reconstruct the individual pulse power profiles for sub-picosecond pulse separation without the need for simulations. Using experimental data from weak X-FEL pulse pairs, we demonstrate we can learn the pulse characteristics on a shot-by-shot basis when conventional methods fail.",
    "authors": [
      "Gesa Goetzke",
      "Rajan Plumley",
      "Gregor Hartmann",
      "Tim Maxwell",
      "Franz-Josef Decker",
      "Alberto Lutman",
      "Mike Dunne",
      "Daniel Ratner",
      "Joshua J. Turner"
    ],
    "published": "2025-02-23T01:00:16Z",
    "updated": "2025-07-30T09:22:05Z",
    "categories": [
      "physics.acc-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.1364/OE.562798"
  },
  {
    "arxiv_id": "2507.22392v1",
    "url": "https://arxiv.org/abs/2507.22392v1",
    "pdf_url": "https://arxiv.org/pdf/2507.22392v1.pdf",
    "title": "Impact of coherent wiggler radiation impedance in Tau-Charm factories",
    "abstract": "Coherent synchrotron radiation (CSR) has long been recognized as a significant source of longitudinal impedance driving microwave instability in electron storage rings. In the pursuit of higher luminosity, next-generation circular $e^+e^-$ colliders operating in the few-GeV energy range, such as B-factories and Tau-Charm factories, are being designed with low-emittance beams and high beam currents. Damping wigglers are commonly introduced to reduce damping times and control beam emittance. In this study, we systematically investigate the impact of coherent wiggler radiation (CWR), a specific form of CSR generated within wigglers, on beam stability in Tau-Charm factories. We revisit the threshold conditions for CWR-induced microwave instability and evaluate its effects under realistic lattice configurations of collider rings. Furthermore, we examine theoretical models of longitudinal CWR impedance and identify improved formulations that better capture its influence. As an illustrative example, the developed CWR impedance models are applied to simulate beam stability in the Super Tau-Charm Facility currently under design in China.",
    "authors": [
      "Tianlong He",
      "Ye Zou",
      "Demin Zhou",
      "Hao Zhou",
      "Hangzhou Li",
      "Linhao Zhang",
      "Tao Liu",
      "Weiwei Li",
      "Jingyu Tang"
    ],
    "published": "2025-07-30T05:27:17Z",
    "updated": "2025-07-30T05:27:17Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.11755v2",
    "url": "https://arxiv.org/abs/2507.11755v2",
    "pdf_url": "https://arxiv.org/pdf/2507.11755v2.pdf",
    "title": "The Origin of Structure in the Auroral Ionosphere",
    "abstract": "The auroral ionosphere presents a paradox: turbulence often thrives in a conductive layer that should suppress the growth rates of plasma instabilities. Using a novel composite power spectrum from coherent radar and GPS data, we show that turbulence on a wide range of scales stem not from local instabilities. Instead, its spectrum is a structural imprint of field-aligned electrical currents, and its dissipative character is governed by the flux of precipitating particles. Our measurements provide a clear geophysical example of a driven, emergent system of self-organized dissipative structures.",
    "authors": [
      "Magnus F Ivarsen",
      "Kaili Song",
      "Luca Spogli",
      "Jean-Pierre St-Maurice",
      "Brian Pitzel",
      "Saif Marei",
      "Devin R Huyghebaert",
      "Satoshi Kasahara",
      "Kunihiro Keika",
      "Yoshizumi Miyoshi",
      "Yoichi Kazama",
      "Shiang-Yu Wang",
      "Ayako Matsuoka",
      "Iku Shinohara",
      "Shoichiro Yokota",
      "P. T. Jayachandran",
      "Glenn C Hussey"
    ],
    "published": "2025-07-15T21:33:42Z",
    "updated": "2025-07-30T04:48:16Z",
    "categories": [
      "physics.space-ph",
      "nlin.AO",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2507.22376v1",
    "url": "https://arxiv.org/abs/2507.22376v1",
    "pdf_url": "https://arxiv.org/pdf/2507.22376v1.pdf",
    "title": "RENE experiment for the sterile neutrino search using reactor neutrinos",
    "abstract": "This paper summarizes the details of the Reactor Experiment for Neutrinos and Exotics (RENE) experiment. It covers the detector construction, Monte Carlo (MC) simulation study, and physics expectations. The primary goal of the RENE project is to investigate the sterile neutrino oscillation at $\\Delta{m}^{2}_{41}\\sim 2\\,{\\rm{eV}^{2}}$. which overlap with the allowed region predicted by the Reactor Antineutrino Anomaly (RAA). On the other hand, the STEREO and PROSPECT experiments have excluded certain regions of the parameter space with 95 \\% confidence level (C.L.), while the joint study conducted by RENO and NEOS suggests possible indications of sterile neutrinos at $\\Delta{m}^{2}_{41}\\sim2.4\\,{\\rm{eV}^{2}}$ and $\\sim{1.7}{\\,\\rm{eV}^{2}}$ with sin$^{2}\\theta_{41} < 0.01$. Accordingly, a more meticulous investigation of these remaining regions continues to be a scientifically valuable endeavor. This paper reports the technical details of the detector and physics objectives.",
    "authors": [
      "Byeongsu Yang",
      "Da Eun Jung",
      "Dong Ho Moon",
      "Eungyu Yun",
      "HyeonWoo Park",
      "Jae Sik Lee",
      "Jisu Park",
      "Ji Young Choi",
      "Junkyo Oh",
      "Kyung Kwang Joo",
      "Ryeong Gyoon Park",
      "Sang Yong Kim",
      "Sunkyu Lee",
      "Insung Yeo",
      "Myoung Youl Pac",
      "Jee-Seung Jang",
      "Eun-Joo Kim",
      "Hyunho Hwang",
      "Junghwan Goh",
      "Wonsang Hwang",
      "Jiwon Ryu",
      "Jungsic Park",
      "Kyu Jung Bae",
      "Mingi Choe",
      "SeoBeom Hong",
      "Jubin Park",
      "Myung-Ki Cheoun",
      "Hyunsoo Kim",
      "Han Il Jang",
      "Dojin Kim",
      "Jonghee Yoo",
      "Seok-Gyeong Yoon",
      "Wonjun Lee",
      "Intae Yu"
    ],
    "published": "2025-07-30T04:36:01Z",
    "updated": "2025-07-30T04:36:01Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2502.01006v3",
    "url": "https://arxiv.org/abs/2502.01006v3",
    "pdf_url": "https://arxiv.org/pdf/2502.01006v3.pdf",
    "title": "Imaging simulation of a dual-panel PET geometry with ultrafast TOF   detectors",
    "abstract": "In positron emission tomography (PET), time-of-flight (TOF) information localizes source positions along lines of response. Cherenkov-radiator-integrated microchannel-plate photomultiplier tubes have achieved 30 ps TOF resolution, demonstrating cross-sectional imaging without reconstruction. Such ultrafast TOF detectors would free PET from conventional ring geometries. Therefore, this study aimed at investigating imaging characteristics of a dual-panel PET with ultrafast TOF detectors using Geant4 simulation. Two detector panels ($137 \\times 137~\\text{mm}^2$), which consisted of 5.0 mm-thick bismuth germanate pixelized crystals with a 5.75 mm pitch, were placed face-to-face at a 300 mm distance. Imaging characteristics with various TOF resolutions from 30 to 90 ps were evaluated. Because degraded efficiency may cancel TOF gain in image quality, detection efficiency was also parameterized by reducing coincidence counts. Data acquisitions for a numerical multi-rod and uniform phantom (21 MBq) and a modified NEMA NU2 image quality phantom were simulated for 600 s. Results of the maximum likelihood expectation maximization (MLEM) reconstruction were compared with those of a backprojection (i.e., no reconstruction). The dual-panel PET required a 40 ps TOF resolution to have a similar spatial resolution to that of a non-TOF ring PET (300 mm in diameter) for the same detection efficiency. TOF showed benefit in the reconstruction of image quality phantom with 40% efficiency, and the image noise with 20% efficiency at 30 ps TOF was similar to the complete efficiency at 40 ps TOF. MLEM provided better imaging performance than backprojection, even at 30 ps TOF. The feasibility of the proposed dual-panel PET was shown.",
    "authors": [
      "Taiyo Ishikawa",
      "Go Akamatsu",
      "Hideaki Tashima",
      "Fumihiko Nishikido",
      "Fumio Hashimoto",
      "Ryosuke Ota",
      "Hideaki Haneishi",
      "Sun Il Kwon",
      "Simon R. Cherry",
      "Taiga Yamaya"
    ],
    "published": "2025-02-03T02:58:42Z",
    "updated": "2025-07-30T01:04:53Z",
    "categories": [
      "physics.med-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.med-ph"
  },
  {
    "arxiv_id": "2507.22225v1",
    "url": "https://arxiv.org/abs/2507.22225v1",
    "pdf_url": "https://arxiv.org/pdf/2507.22225v1.pdf",
    "title": "Development of a RPC system with detailed performance simulation",
    "abstract": "Neutrinos, elusive and abundant, interact weakly with matter, making detection challenging. This thesis explores neutrino physics, focusing on mass hierarchy and oscillations, with emphasis on India's upcoming INO facility. The Iron Calorimeter (ICAL) detector, using Resistive Plate Chambers (RPCs) within magnetized iron plates, aims to resolve neutrino mass hierarchy and precisely measure $\\theta_{23}$ and $\\Delta m^2_{32}$, potentially revealing new physics. The study advances RPC development through simulation techniques. A straight-line model calculates space charge effects during avalanche or streamer processes, improving electric field estimation speed and accuracy. Polarization effects in dielectric electrodes are analyzed, elucidating electric field dependence on electrode parameters. A new class, pAvalancheMC, integrated into Garfield++ software, combines straight-line and image charge models to simulate space charge effects. Using OpenMP for parallel computing, it achieves significant speed-ups in electron-ion pair generation and space charge field calculations. Practically, an eight-RPC stack was developed at VECC to measure cosmic muon scattering angles in high-density materials. A testbench evaluates efficiency, crosstalk, and hit uniformity. A reconstruction algorithm, validated with data from the IICHEP stack in Madurai, supports the VECC stack's potential. This work enhances neutrino physics understanding and advances RPC-based detection technologies.",
    "authors": [
      "Tanay Dey"
    ],
    "published": "2025-07-29T20:44:07Z",
    "updated": "2025-07-29T20:44:07Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  }
]