{
  "arxiv_id": "2404.07835v4",
  "url": "https://arxiv.org/abs/2404.07835v4",
  "pdf_url": "https://arxiv.org/pdf/2404.07835v4.pdf",
  "title": "Towards a realistic noise modelling of quantum sensors for future   satellite gravity missions",
  "abstract": "Mapping the Earth's gravity field from space offers valuable insights into climate change, hydro- and biosphere evolution, and seismic activity. Current satellite gravimetry missions have demonstrated the utility of gravity data in understanding global mass transport phenomena, climate dynamics, and geological processes. However, state-of-the-art measurement techniques face noise and long-term drift limitations, which propagate into the recovery of Earth's time-varying gravity field. Quantum sensors, particularly Cold Atom Interferometry (CAI), offer promise for improving the accuracy and stability of space-based gravity measurements. Therefore, CAI has emerged as a promising measurement technique for future gravimetric satellite missions due to their potential for measuring gravitational forces and gradients with high precision and accuracy, particularly at low frequencies (sub-mHz). This study explores the sensitivity of CAI accelerometers and gradiometers to the errors in measuring the satellite's attitude. We explore the low-low satellite-to-satellite and gravity gradiometry concepts and build the respective analytical models of measurements and associated errors. We selected an ambitious scenario for CAI parameters that illustrates a potential path for increasing instrument accuracies and capabilities for space gravimetry. Two operational modes, concurrent (where a new cloud is generated while another is moved to the interferometric chamber) and sequential (where cloud generation and interferometry happen in the same place), are compared to mitigate the effects of inaccurately known attitude rates on Coriolis accelerations. The sequential mode shows the potential to reduce these effects since the atom cloud has an initial zero velocity. [...]",
  "authors": [
    "Joao Encarnacao",
    "Christian Siemes",
    "Ilias Daras",
    "Olivier Carraz",
    "Aaron Strangfeld",
    "Philipp Zingerle",
    "Roland Pail"
  ],
  "published": "2024-04-11T15:19:46Z",
  "updated": "2025-08-05T14:56:58Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}