{
  "arxiv_id": "2412.03112v3",
  "url": "https://arxiv.org/abs/2412.03112v3",
  "pdf_url": "https://arxiv.org/pdf/2412.03112v3.pdf",
  "title": "Non-linear MHD modelling of shattered pellet injection in ASDEX Upgrade",
  "abstract": "Shattered pellet injection (SPI) is selected for the disruption mitigation system in ITER, due to deeper penetration, expected assimilation efficiency and prompt material delivery. This article describes non-linear magnetohydrodynamic (MHD) simulations of SPI in the ASDEX Upgrade tokamak to test the mitigation efficiency of different injection parameters for neon-doped deuterium pellets using the JOREK code. The simulations are executed as fluid simulations, while additional marker particles are used to evolve the charge state distribution and radiation property of impurities based on OpenADAS atomic data, i.e., a collisional-radiative model is used. Neon fraction scans between 0 - 10% are performed. Numerical results show that the thermal quench (TQ) occurs in two stages. In the first stage, approximately half of the thermal energy is abruptly lost, primarily through convective and conductive transport in the stochastic fields. This stage is relatively independent of the neon fraction. In the second stage, where the majority of the remaining thermal energy is lost, radiation plays a dominant role. In case of pure deuterium injection, this second stage may not occur at all. A larger fraction ($\\sim $20%) of the total material in the pellet is assimilated in the plasma for low neon fraction pellets ($\\leq 0.12\\%$) due to the full thermal collapse of the plasma occurring later than in high neon fraction scenarios. Nevertheless, the total number of assimilated neon atoms increases with increasing neon fraction. The effects of fragment size and penetration speed are then numerically studied, showing that slower and smaller fragments promote edge cooling and the formation of a cold front. Faster fragments result in shorter TQ duration and higher assimilation as they reach the hotter plasma regions quicker.",
  "authors": [
    "W. Tang",
    "M. Hoelzl",
    "M. Lehnen",
    "D. Hu",
    "F. J. Artola",
    "P. Halldestam",
    "P. Heinrich",
    "S. Jachmich",
    "E. Nardon",
    "G. Papp",
    "A. Patel",
    "the ASDEX Upgrade Team",
    "the EUROfusion Tokamak Exploitation Team",
    "the JOREK Team"
  ],
  "published": "2024-12-04T08:22:47Z",
  "updated": "2025-08-04T21:44:19Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}