{
  "arxiv_id": "2502.01300v3",
  "url": "https://arxiv.org/abs/2502.01300v3",
  "pdf_url": "https://arxiv.org/pdf/2502.01300v3.pdf",
  "title": "Magnetic Field Amplification and Reconstruction in Rotating   Astrophysical Plasmas: Verifying the Roles of $α$ and $β$ in Dynamo   Action",
  "abstract": "We investigated the $\\alpha$ and $\\beta$ effects in a rotating spherical plasma system relevant to astrophysical environments. These coefficients were derived using three different approaches based on the large-scale magnetic field $\\overline{\\mathbf{B}}$, turbulent velocity $\\mathbf{u}$, and turbulent magnetic field $\\mathbf{b}$, yielding $\\alpha_{\\mathrm{EM-HM}}$, $\\beta_{\\mathrm{EM-HM}}$, $\\beta_{\\mathrm{vv-vw}}$, and $\\beta_{\\mathrm{bb+jb}}$. Using raw data from direct numerical simulations (DNS), we constructed the magnetic induction equation incorporating the $\\alpha$ and $\\beta$ coefficients. We then reproduced the $\\overline{\\mathbf{B}}$ field and compared the results with the DNS data. In the kinematic regime, where $\\overline{\\mathbf{B}}$ is weak, all models exhibit good agreement with the DNS results. However, in the nonlinear regime, the $\\overline{\\mathbf{B}}$ field, reproduced using $\\beta_{\\mathrm{vv-vw}}$, deviates from the DNS and exhibits unbounded growth. To address this discrepancy, we added $\\beta_{\\mathrm{bb+jb}}$, which represents the contribution of turbulent magnetic fields, to $\\beta_{\\mathrm{vv-vw}}$. This addition suppresses the divergent growth of $\\overline{\\mathbf{B}}$ in the nonlinear regime. We then assessed the actual influence of $\\alpha$ and $\\beta$ on the evolution of $\\overline{\\mathbf{B}}$ by applying weighted combinations of the two coefficients. Our results show that magnetic $\\beta$ diffusion plays a dominant role throughout the entire process. In contrast, the $\\alpha$ effect is minor in the kinematic regime but becomes essential for sustaining the $\\overline{\\mathbf{B}}$ field in the nonlinear regime. We also discussed the underlying physical mechanism responsible for this behavior.",
  "authors": [
    "Kiwan Park"
  ],
  "published": "2025-02-03T12:20:48Z",
  "updated": "2025-08-01T15:41:55Z",
  "categories": [
    "physics.plasm-ph",
    "astro-ph.SR",
    "physics.space-ph"
  ],
  "primary_category": "physics.plasm-ph"
}