{
  "arxiv_id": "2504.03079v4",
  "url": "https://arxiv.org/abs/2504.03079v4",
  "pdf_url": "https://arxiv.org/pdf/2504.03079v4.pdf",
  "title": "Evaluation of the Response to Electrons and Pions in the Scintillating   Fiber and Lead Calorimeter for the Future Electron-Ion Collider",
  "abstract": "The performance of the Baby Barrel Electromagnetic Calorimeter (Baby BCAL) - a small-scale lead-scintillating-fiber (Pb/ScFi) prototype of the GlueX Barrel Electromagnetic Calorimeter (BCAL) - was tested in a dedicated beam campaign at the Fermilab Test Beam Facility (FTBF). This study provides a benchmark for the Pb/ScFi component of the future Barrel Imaging Calorimeter (BIC) in the ePIC detector at the Electron-Ion Collider (EIC). The detector response to electrons and pions was studied at beam energies between 4 and 10 GeV, extending previous GlueX tests [NIM A 596 (2008) 327-337 and arXiv:1801.03088] to a higher energy regime.   The calibrated detector exhibits good linearity within uncertainties, and its electron energy resolution meets EIC requirements. The data further constrain the constant term in the energy resolution to below 1.9%, improving upon previous constraints at lower energies. Simulations reproduce key features of the electron and pion data within the limitations of the collected dataset and the FTBF test environment. Electron-pion separation in the test beam setup was analyzed using multiple methods, incorporating varying degrees of beam-related effects. The inclusion of longitudinal shower profile information enhanced the separation performance, underscoring its relevance for the full-scale BIC in ePIC. These results provide essential benchmarks for the Pb/ScFi section of the future BIC, validating detector simulations and guiding optimization strategies for electron-pion discrimination.",
  "authors": [
    "Henry Klest",
    "Maria Żurek",
    "Tegan D. Beattie",
    "Manoj Jadhav",
    "Sylvester Joosten",
    "Maggie Kerr",
    "Bobae Kim",
    "Minho Kim",
    "Jessica Metcalfe",
    "Zisis Papandreou",
    "Jared Richards",
    "Jonathan Zarling"
  ],
  "published": "2025-04-03T22:59:24Z",
  "updated": "2025-08-01T22:52:37Z",
  "categories": [
    "physics.ins-det",
    "hep-ex",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.1088/1748-0221/20/07/P07028"
}