{
  "arxiv_id": "2507.14425v2",
  "url": "https://arxiv.org/abs/2507.14425v2",
  "pdf_url": "https://arxiv.org/pdf/2507.14425v2.pdf",
  "title": "Evaluation of a Full Field Fluorescence Imager with Synchrotron   Radiation",
  "abstract": "The design and evaluation on the NSLS-II beamline of the 3FI application specific integrated circuit (ASIC) bump-bonded to a simply, planar, two-dimensionally segmented silicon sensor is presented. The ASIC was developed for Full-Field Fluorescence spectral X-ray Imaging (3FI). It is a small-scale prototype that features a square array of 32x32 pixels with a pitch of 100 {\\mu}m. The ASIC was implemented in a 65 nm CMOS process. Each pixel incorporates a charge-sensitive amplifier, shaping filter, discriminator, peak detector, and sample-and-hold circuit, allowing detection of events and storing signal amplitudes. The system operates in an event-driven readout mode, outputting analog values for threshold-triggered events, allowing high-speed multi-element X-ray fluorescence imaging. At power consumption of 200 {\\mu}W per pixel, consisting almost uniquely of power dissipated in analog blocks, 308 eV full width at half maximum (FWHM) energy resolution at 8.04 keV, that corresponds to 30 e- rms equivalent noise charge (ENC) and 138 eV FWHM energy resolution at 3.69 keV (16 e- rms ENC) were obtained, for Cu and Ca K{\\alpha} lines, respectively. Each pixel operates independently, and the detector enables in situ trace element microanalysis in biological and environmental research. Its architecture addresses limitations of X-ray Fluorescence Microscopy (XFM), typically requiring mechanical scanning, by offering frame-lees data acquisition, translating to high-throughput operation. The 3FI ASIC is suitable for example for studies of nutrient cycling in the (mycor)rhizosphere, microbial redox processes, and genotype-phenotype correlations in bio-energy crops. Additional performances, such as enhanced spatial resolution can be further improved with coded-aperture and Wolt, extending the use to environmental, biomedical, and material science studies.",
  "authors": [
    "Piotr Maj",
    "Grzegorz W. Deptuch",
    "Dominik S. Gorni",
    "Giovanni Pinaroli",
    "Gabriella A. Carini",
    "David P. Siddons",
    "Ryan Tappero",
    "Soumyajit Mandal",
    "Donald Pinelli",
    "Timothy Kersten",
    "Nicholas St. John",
    "Abdul K. Rumaiz",
    "Anthony Kuczewski"
  ],
  "published": "2025-07-19T01:02:57Z",
  "updated": "2025-08-01T13:39:45Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}