{
  "arxiv_id": "2508.01366v1",
  "url": "https://arxiv.org/abs/2508.01366v1",
  "pdf_url": "https://arxiv.org/pdf/2508.01366v1.pdf",
  "title": "Eliminating beam-induced depolarizing effects in the hydrogen jet target   for high-precision proton beam polarimetry at the Electron-Ion Collider",
  "abstract": "We analyze beam-induced depolarizing effects in the hydrogen jet target (HJET) at the Relativistic Heavy Ion Collider (RHIC) that has been used for absolute hadron beam polarimetry and shall be employed at the Electron-Ion Collider (EIC). The EIC's higher bunch repetition frequencies and shorter bunch durations shift beam harmonics to frequencies that can resonantly drive hyperfine transitions in hydrogen, threatening to depolarize the target atoms. Using frequency-domain analysis of beam harmonics and hyperfine transition frequencies, we establish a photon emission threshold above which beam-induced fields are too weak to cause significant depolarization. For EIC injection (\\SI{23.5}{\\GeV}) and flattop (\\SI{275}{\\GeV}), beam-induced depolarization through the bunch structure renders operation at the current RHIC magnetic guide field at the target of $B_0 = \\SI{120}{\\milli\\tesla}$ untenable. Increasing the magnetic guide field at the target to $B_0 \\approx \\SI{400}{\\milli\\tesla}$ moves all hyperfine transition frequencies to at least three times the cutoff frequency, ensuring reliable absolute beam polarimetry with the required 1\\% precision at the EIC.",
  "authors": [
    "F. Rathmann",
    "A. Nass",
    "K. O. Eyser",
    "V. Shmakova",
    "E. C. Aschenauer",
    "G. Atoian",
    "A. Cannavo",
    "K. Hock",
    "H. Huang",
    "H. Lovelace",
    "G. Mahler",
    "J. Ritter",
    "G. Robert-Demolaize",
    "V. Schoefer",
    "P. Shanmuganathan",
    "E. Shulga",
    "H. Soltner",
    "X. Chu",
    "Z. Zhang"
  ],
  "published": "2025-08-02T13:38:21Z",
  "updated": "2025-08-02T13:38:21Z",
  "categories": [
    "physics.acc-ph",
    "nucl-ex"
  ],
  "primary_category": "physics.acc-ph"
}