{
  "arxiv_id": "2507.14002v2",
  "url": "https://arxiv.org/abs/2507.14002v2",
  "pdf_url": "https://arxiv.org/pdf/2507.14002v2.pdf",
  "title": "Reconnection-driven Flares in M87*: Proton-Synchrotron-powered GeV Emission",
  "abstract": "Magnetic reconnection in current layers that form intermittently in radiatively inefficient accretion flows onto black holes is a promising mechanism for particle acceleration and high-energy emission. It has been recently proposed that such layers, arising during flux eruption events, can power the rapid TeV flares observed from the core of M87. In this scenario, inverse Compton scattering of soft radiation from the accretion flow by energetic electron-positron pairs produced near the reconnection layer was suggested as the primary emission mechanism. However, detailed calculations show that radiation from pairs alone cannot account for the GeV emission detected by the Fermi observatory. In this work, we combine analytic estimates with 3D radiative particle-in-cell simulations of pair-proton plasmas to show that the GeV emission can be naturally explained by synchrotron radiation from protons accelerated in the current sheet. Although the exact proton content of the layer is uncertain, our model remains robust across a broad range of proton-to-pair number density ratios. While protons are subdominant in number compared to pairs, our simulations demonstrate that they can be accelerated more efficiently, leading to a self-regulated steady state in which protons dominate the energy budget. Ultimately, proton synchrotron emission accounts for approximately 5%-20% of the total dissipation power. The majority is radiated as MeV photons via pair synchrotron emission, with a smaller fraction emitted as TeV photons through inverse Compton scattering.",
  "authors": [
    "Hayk Hakobyan",
    "Amir Levinson",
    "Lorenzo Sironi",
    "Alexander Philippov",
    "Bart Ripperda"
  ],
  "published": "2025-07-18T15:15:55Z",
  "updated": "2025-12-21T20:27:32Z",
  "categories": [
    "astro-ph.HE",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.HE",
  "doi": "10.3847/2041-8213/ae286a"
}