{
  "arxiv_id": "2512.19116v1",
  "url": "https://arxiv.org/abs/2512.19116v1",
  "pdf_url": "https://arxiv.org/pdf/2512.19116v1.pdf",
  "title": "Reactive near-field subwavelength microwave imaging with a non-invasive Rydberg probe",
  "abstract": "Non-invasive microwave field imaging--accurately mapping field distributions without perturbing them--is essential in areas such as aerospace engineering, biomedical imaging and integrated-circuit diagnostics. Conventional metal probes, however, inevitably perturb reactive near fields: they act as strong scatterers that drive induced currents and secondary radiation, remap evanescent components and thereby degrade both accuracy and spatial resolution, particularly in the reactive near-field regime that is most relevant to these applications. Here we demonstrate, to our knowledge for the first time, reactive near-field subwavelength imaging of microwave fields using the quantum non-demolition properties of Rydberg atoms, realized with a compact, non-invasive single-ended fibre-integrated Rydberg probe engineered to minimize field disturbance. The probe achieves an imaging resolution of {\\unboldmath$λ/56$}, and the measured field distributions agree with full-wave simulations with structural similarity approaching unity, confirming both its subwavelength spatial resolution and its genuinely non-invasive character compared with conventional metal-based probes. Because the atomic sensor is intrinsically isotropic, the same device can faithfully image multi-dimensional field structures without orientation-dependent calibration. Our results therefore establish a general, non-invasive route to high-accuracy, subwavelength reactive near-field microwave imaging, with particular promise for applications such as chip-defect detection and integrated-circuit diagnostics, where even small perturbations by the probe can mask the underlying physics of interest.",
  "authors": [
    "Chaoyang Hu",
    "Mingyong Jing",
    "Zongkai Liu",
    "Shaoxin Yuan",
    "Bin Wu",
    "Yan Peng",
    "Tingting Li",
    "Wenguang Yang",
    "Junyao Xie",
    "Hao Zhang",
    "Liantuan Xiao",
    "Suotang Jia",
    "Linjie Zhang"
  ],
  "published": "2025-12-22T07:38:17Z",
  "updated": "2025-12-22T07:38:17Z",
  "categories": [
    "quant-ph",
    "physics.app-ph",
    "physics.atom-ph",
    "physics.ins-det",
    "physics.optics"
  ],
  "primary_category": "quant-ph"
}