{
  "arxiv_id": "2512.19120v1",
  "url": "https://arxiv.org/abs/2512.19120v1",
  "pdf_url": "https://arxiv.org/pdf/2512.19120v1.pdf",
  "title": "Design, simulation and performance of the resistive-anode PICOSEC Micromegas detector",
  "abstract": "The PICOSEC Micromegas detector is a Micro-Pattern Gaseous Detector concept developed to achieve tens of picosecond timing resolution for charged particle detection by combining a Cherenkov radiator with a two-stage Micromegas amplification structure. To improve operational robustness, a resistive anode has been implemented using a DLC layer deposited on a Kapton substrate. While this design enhances detector stability, the resistive layer may influence rate capability, signal formation, and detector capacitance, altering timing performance.   This work presents a comprehensive study of a resistive design, including an analytical model and finite-element simulations to quantify rate-dependent gain reduction due to ohmic voltage drop on the resistive layer. An analytical solution for the voltage across a finite-size resistive layer is derived, and a numerical model is developed to evaluate gain suppression under intense particle fluxes. The impact of the resistive layer on signal formation is investigated using time-dependent weighting fields and the Garfield++ simulation framework. The contribution of signal components induced by the resistive layer is quantified, and preservation of the signal leading edge is found for surface resistivities above 100 kohm per square.   Single-channel resistive-anode prototypes were designed, constructed, and experimentally characterized. Laboratory measurements using single photoelectrons and power spectral density analysis show the predicted reduction in signal amplitude while preserving the leading edge. Muon beam tests with CsI and DLC photocathodes demonstrate a time resolution of 11.5 ps for CsI, comparable to 11.9 ps for the metallic-anode device, showing the suitability of the resistive design for precision timing applications.",
  "authors": [
    "Djunes Janssens",
    "Antonija Utrobicic",
    "Marinko Kovacic",
    "Marta Lisowska",
    "Eraldo Oliveri",
    "Florian Brunbauer",
    "Karl Floethner",
    "Hans Muller",
    "Rui De Oliveira",
    "Giorgio Orlandini",
    "Leszek Ropelewski",
    "Lucian Scharenberg",
    "Thomas Schneider",
    "Miranda van Stenis",
    "Rob Veenhof",
    "Thomas Papaevangelou",
    "Roy Aleksan",
    "Stephane Aune",
    "Thomas Gustavsson",
    "Alexandra Kallitsopoulou",
    "Philippe Legou",
    "Michal Pomorski",
    "Emmanuel Scorsone",
    "Lukas Sohl",
    "Mariam Kebbiri",
    "Spyros Tzamarias",
    "Dimos Sampsonidis",
    "Yannis Angelis",
    "Ioannis Maniatis",
    "Ioannis Karakoulias",
    "Jonathan Bortfeldt",
    "Ilaria Vai",
    "Matteo Brunoldi",
    "Davide Fiorina",
    "Paolo Vitulo",
    "Jaydeep Datta",
    "Nathan Shankman",
    "Kondo Gnanvo",
    "Klaus Dehmelt",
    "Brian Kross",
    "Jack McKisson",
    "Akash Pandey",
    "George Fanourakis",
    "Michele Gallinaro",
    "Francisco Garcia",
    "Yi Zhou",
    "Jianbei Liu",
    "Yue Meng",
    "Xu Wang",
    "Zhiyong Zhang",
    "Michael Lupberger",
    "Yorgos Tsipolitis",
    "Maja Mičetić",
    "Krešimir Salamon",
    "Sebastian White"
  ],
  "published": "2025-12-22T07:50:33Z",
  "updated": "2025-12-22T07:50:33Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}