{
  "arxiv_id": "2512.18941v1",
  "url": "https://arxiv.org/abs/2512.18941v1",
  "pdf_url": "https://arxiv.org/pdf/2512.18941v1.pdf",
  "title": "Non-Inductive Current Start-Up Using Multi-Harmonic Electron Cyclotron Wave and Current Ramp-Up Through Combined Electron Cyclotron Wave and Ohmic Heating in EXL-50U Spherical Torus",
  "abstract": "The non-inductive current start-up by multi-harmonic electron cyclotron wave has been systematically investigated in the EXL-50U spherical torus. Significant enhancements of the driven current with increasing number of resonance layers have been demonstrated by variation of the number of harmonic resonance layers of the ECW through adjustment of the magnetic field or plasma cross section. The critical role of multi-harmonic ECW in enhancing the driven current has been experimentally verified for the first time. To explain the related experimental observations, a physical mechanism involving multi-harmonic heating, multiple reflections, and multi-pass absorption - leading to the generation of high-energy electrons via X-mode wave or electron Bernstein wave has been proposed. The current drive capacity of the first harmonic extraordinary mode of the ECW has also been experimentally confirmed for the first time. After the application of Ohmic heating during the current ramp-up phase, the current drive efficiency of ECW is further enhanced. Leveraging the synergistic effect between ECW and Ohmic heating, EXL-50U achieved a plasma current of 1 MA, with the non-inductively driven current fraction reaching 70%.",
  "authors": [
    "Xinchen Jiang",
    "Yuejiang Shi",
    "Yueng-Kay Martin Peng",
    "Shaodong Song",
    "Wenjun Liu",
    "Xianming Song",
    "Xiang Gu",
    "Ji Qi",
    "Dong Guo",
    "Debabrata Banerjee",
    "Lili Dong",
    "Zhenxing Wang",
    "Chunyan Li",
    "Junquan Lin",
    "Pingwei Zheng",
    "Haojie MA",
    "Huasheng Xie",
    "Jiaqi Dong",
    "Qingwei Yang",
    "Yunfeng Liang",
    "Baoshan Yuan",
    "Xianmei Zhang",
    "Minsheng Liu",
    "EXL-50U team"
  ],
  "published": "2025-12-22T01:26:40Z",
  "updated": "2025-12-22T01:26:40Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}