{
  "arxiv_id": "2211.04553v2",
  "url": "https://arxiv.org/abs/2211.04553v2",
  "pdf_url": "https://arxiv.org/pdf/2211.04553v2.pdf",
  "title": "Effective resistivity in relativistic collisionless plasmoid-mediated   reconnection",
  "abstract": "Magnetic reconnection can power spectacular high-energy astrophysical phenomena by producing non-thermal energy distributions in highly magnetized regions around compact objects. By means of two-dimensional fully kinetic particle-in-cell (PIC) simulations we investigate relativistic collisionless plasmoid-mediated reconnection in magnetically dominated pair plasmas with and without guide field. In X-points, where diverging flows result in a non-diagonal thermal pressure tensor, a finite residence time for particles gives rise to a localized collisionless effective resistivity. Here, for the first time for relativistic reconnection in a fully developed plasmoid chain we identify the mechanisms driving the non-ideal electric field using a full Ohm's law by means of a statistical analysis based on our PIC simulations. We show that the non-ideal electric field is predominantly driven by gradients of nongyrotropic thermal pressures. We propose a kinetic physics motivated non-uniform effective resistivity model, which is negligible on global scales and becomes significant only locally in X-points, that captures the properties of collisionless reconnection with the aim of mimicking its essentials in non-ideal magnetohydrodynamic descriptions. This effective resistivity model provides a viable opportunity to design physically grounded global models for reconnection-powered high-energy emission.",
  "authors": [
    "Sebastiaan Selvi",
    "Oliver Porth",
    "Bart Ripperda",
    "Fabio Bacchini",
    "Lorenzo Sironi",
    "Rony Keppens"
  ],
  "published": "2022-11-08T20:55:07Z",
  "updated": "2025-08-26T20:46:48Z",
  "categories": [
    "astro-ph.HE",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.HE",
  "doi": "10.3847/1538-4357/acd0b0"
}