{
  "arxiv_id": "2509.21525v2",
  "url": "https://arxiv.org/abs/2509.21525v2",
  "pdf_url": "https://arxiv.org/pdf/2509.21525v2.pdf",
  "title": "High-accuracy low-noise electrical measurements in a closed-cycle   pulse-tube cryostat",
  "abstract": "A shift of paradigm to obtain (sub-)Kelvin environment is currently on-going with the democratization of cryogen-free cryocoolers, boosted by their easy-to-use and continuous operation without the need of liquid helium whose cost and scarcity globally increase. Thanks to their large sample space and cooling power, they can host a superconducting magnet and are an adapted platform for quantum technologies, material science, low temperature detectors and even medical fields. The drawback is that this type of system is inherently based on gas compression that induces a certain level of vibrations and electromagnetic perturbations, which can potentially prevent the determination of low amplitude signals or spoil their stability. In this paper we demonstrate that pulse-tube based cryocoolers can be used for electrical precision measurements, using a commercial cryomagnetic system combined with our home-made a coaxial cryoprobe. In particular, parts-per-billion level of measurement uncertainties in resistance determination, based on quantum Hall resistance standards, is achievable at the level of state-of-the-art measurements involving conventional cryostats based on liquid helium. We performed an extensive characterization of the cryomagnetic system to determine the level of vibrations and electromagnetic perturbations, and revealed that although the magnetic field has a drastic effect on the noise level, only marginal interplays on the measurement are observed as long as the working frequencies of the instrumentation are not in the vicinity of the ones of the perturbations. The set of characterization measurements presented here are easily implementable in laboratories, which can help to determine the vibrations and electromagnetic pollution generated by any cryocooler.",
  "authors": [
    "Mathieu Taupin",
    "Kamel Dougdag",
    "Djamel Ziane",
    "Francois Couedo"
  ],
  "published": "2025-09-25T20:09:58Z",
  "updated": "2025-10-03T09:13:12Z",
  "categories": [
    "cond-mat.other",
    "physics.ins-det"
  ],
  "primary_category": "cond-mat.other"
}