{
  "arxiv_id": "2510.03414v1",
  "url": "https://arxiv.org/abs/2510.03414v1",
  "pdf_url": "https://arxiv.org/pdf/2510.03414v1.pdf",
  "title": "Spectroscopic measurements of graphite electrode erosion on the ZaP-HD   sheared-flow-stabilized Z-pinch device",
  "abstract": "The ionizations per photon, or S/XB, method uses spectroscopic measurements of radiating impurity ions to determine the influx from a solid surface. It is highly useful as a non-perturbing, in-situ measure of the gross erosion flux of plasma-facing components (PFCs). In sheared-flow-stabilized (SFS) Z-pinch devices, the electrode supplies the plasma current and directly contacts the core Z-pinch plasma. Electrode erosion due to the large particle and heat fluxes affects electrode durability, which is an important factor in existing and future devices. An improved understanding of these plasma-electrode interactions is required, in particular as energy density increases. Experiments on the ZaP-HD device investigate erosion of the graphite electrode by applying the S/XB method for C-III emission at 229.7 nm. The S/XB coefficients are determined from electron density and temperature profiles obtained from Digital Holographic Interferometry (DHI) measurements. An approach for expanding these profiles to represent plasma contacting the electrode is described. In both cases, the measured erosion fluxes are on the order of 10$^{30}$-10$^{31}$ atoms m$^{-2}$s$^{-1}$. These values are significantly larger than the expected erosion flux due to physical sputtering of H$^+$ ions on carbon, but are comparable to theoretical sublimation fluxes. This suggests that the source of carbon erosion flux is primarily from sublimation as opposed to sputtering. The dominance of sublimation over sputtering processes implies a difference in energy of the eroded neutrals which may provide insight on redeposition and net erosion behavior.",
  "authors": [
    "Amierul Aqil Khairi",
    "Elyse Lian",
    "Uri Shumlak"
  ],
  "published": "2025-10-03T18:23:16Z",
  "updated": "2025-10-03T18:23:16Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}