{
  "arxiv_id": "2510.02659v1",
  "url": "https://arxiv.org/abs/2510.02659v1",
  "pdf_url": "https://arxiv.org/pdf/2510.02659v1.pdf",
  "title": "Holographic Gaseous Lenses for High-Power Lasers",
  "abstract": "The capabilities of the world's highest energy and peak-power pulsed lasers are limited by optical damage, and further advances in high-intensity laser science will require optics that are substantially more robust than existing components. We describe here the experimental demonstration of off-axis diffractive gaseous lenses capable of withstanding extreme laser fluence and immune to cumulative damage. We used less than 8 mJ of energy from interfering ultraviolet laser pulses to holographically write millimeter-scale diffractive gas lenses into an ozone, oxygen, and carbon-dioxide gas mixture. These lenses allowed us to focus, defocus, and collimate 532-nm nanosecond laser pulses with up to 210 mJ of energy at efficiencies above 50% and fluences up to 35 J/cm$^2$. We also show that the gas lenses have sufficient bandwidth to efficiently diffract 35-fs 800-nm pulses and that beam pointing, divergence, and diffraction efficiency are stable while operating at 10 Hz. These diffractive lenses are simple holograms, and the principles demonstrated here could be extended to other types of optics, suggesting that gaseous optics may enable arbitrary, damage-resistant manipulation of intense light for next-generation ultra-high-power lasers.",
  "authors": [
    "Devdigvijay Singh",
    "Ke Ou",
    "Sida Cao",
    "Victor M. Perez-Ramirez",
    "Harsha Rajesh",
    "Debolina Chakraborty",
    "Caleb Redshaw",
    "Pelin Dedeler",
    "Albertine Oudin",
    "Michelle M. Wang",
    "Julia M. Mikhailova",
    "Livia Lancia",
    "Caterina Riconda",
    "Pierre Michel",
    "Matthew R. Edwards"
  ],
  "published": "2025-10-03T01:36:53Z",
  "updated": "2025-10-03T01:36:53Z",
  "categories": [
    "physics.optics",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.optics"
}