[
  {
    "arxiv_id": "2510.04777v2",
    "url": "https://arxiv.org/abs/2510.04777v2",
    "pdf_url": "https://arxiv.org/pdf/2510.04777v2.pdf",
    "title": "Performance and long-term aging studies on Eco-Friendly Resistive Plate   Chamber detectors",
    "abstract": "Resistive Plate Chambers detectors are extensively used in several domains of Physics. In High Energy Physics, they are typically operated in avalanche mode with a high-performance gas mixture based on Tetrafluoroethane (C2H2F4), a fluorinated high Global Warming Potential greenhouse gas. The RPC EcoGas@GIF++ Collaboration has pursued an intensive R\\&D activity to search for new gas mixtures with low environmental impact, fulfilling the performance expected for the LHC operations as well as for future and different applications. Here, results obtained with new eco-friendly gas mixtures based on Tetrafluoropropene and carbon dioxide, even under high-irradiation conditions, will be presented. Long-term aging tests carried out at the CERN Gamma Irradiation Facility will be discussed along with their possible limits and future perspectives.",
    "authors": [
      "D. Ahmadi",
      "M. Tytgat"
    ],
    "published": "2025-10-06T12:53:05Z",
    "updated": "2025-10-07T17:37:42Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.02955v2",
    "url": "https://arxiv.org/abs/2510.02955v2",
    "pdf_url": "https://arxiv.org/pdf/2510.02955v2.pdf",
    "title": "On the existence of fibered three-dimensional perfect fluid equilibria   without continuous Euclidean symmetry",
    "abstract": "Following Lortz, we construct a family of smooth steady states of the ideal, incompressible Euler equation in three dimensions that possess no continuous Euclidean symmetry. As in Lortz, they do possess a planar reflection symmetry and, as such, all the orbits of the velocity are closed. Different from Lortz, our construction has a discrete m-fold symmetry and is foliated by invariant cylindrical level sets of a non-degenerate Bernoulli pressure. Such examples narrow the scope of validity of Grad's conjecture that the only solutions with a continuous symmetry can be fibered by pressure surfaces.",
    "authors": [
      "Theodore D. Drivas",
      "Tarek M. Elgindi",
      "Daniel Ginsberg"
    ],
    "published": "2025-10-03T12:47:27Z",
    "updated": "2025-10-07T14:08:44Z",
    "categories": [
      "math.AP",
      "physics.flu-dyn",
      "physics.plasm-ph",
      "35Q31, 76B03, 76W05"
    ],
    "primary_category": "math.AP"
  },
  {
    "arxiv_id": "2510.01875v2",
    "url": "https://arxiv.org/abs/2510.01875v2",
    "pdf_url": "https://arxiv.org/pdf/2510.01875v2.pdf",
    "title": "Enhancing the Efficiency of Time-Dependent Density Functional Theory   Calculations of Dynamic Response Properties",
    "abstract": "X-ray Thomson scattering (XRTS) constitutes an essential technique for diagnosing material properties under extreme conditions, such as high pressures and intense laser heating. Time-dependent density functional theory (TDDFT) is one of the most accurate available ab initio methods for modeling XRTS spectra, as well as a host of other dynamic material properties. However, strong thermal excitations, along with the need to account for variations in temperature and density as well as the finite size of the detector significantly increase the computational cost of TDDFT simulations compared to ambient conditions. In this work, we present a broadly applicable method for optimizing and enhancing the efficiency of TDDFT calculations. Our approach is based on a one-to-one mapping between the dynamic structure factor and the imaginary time density--density correlation function, which naturally emerges in Feynman's path integral formulation of quantum many-body theory. Specifically, we combine rigorous convergence tests in the imaginary time domain with a constraints-based noise attenuation technique to improve the efficiency of TDDFT modeling without the introduction of any significant bias. As a result, we can report a speed-up by up to an order of magnitude, thus potentially saving millions of CPU hours for modeling a single XRTS measurement of matter under extreme conditions.",
    "authors": [
      "Zhandos A. Moldabekov",
      "Sebastian Schwalbe",
      "Uwe Hernandez Acosta",
      "Thomas Gawne",
      "Jan Vorberger",
      "Michele Pavanello",
      "Tobias Dornheim"
    ],
    "published": "2025-10-02T10:31:46Z",
    "updated": "2025-10-07T09:31:17Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.chem-ph",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2510.03653v2",
    "url": "https://arxiv.org/abs/2510.03653v2",
    "pdf_url": "https://arxiv.org/pdf/2510.03653v2.pdf",
    "title": "CCAT: Magnetic Sensitivity Measurements of Kinetic Inductance Detectors",
    "abstract": "The CCAT Observatory is a ground-based submillimeter to millimeter experiment located on Cerro Chajnantor in the Atacama Desert, at an altitude of 5,600 meters. CCAT features the 6-meter Fred Young Submillimeter Telescope (FYST), which will cover frequency bands from 210 GHz to 850 GHz using its first-generation science instrument, Prime-Cam. The detectors used in Prime-Cam are feedhorn-coupled, lumped-element superconducting microwave kinetic inductance detectors (KIDs). The telescope will perform wide-area surveys at speeds on the order of degrees per second. During telescope operation, the KIDs are exposed to changes in the magnetic field caused by the telescope's movement through Earth's magnetic field and internal sources within the telescope. We present and compare measurements of the magnetic sensitivity of three different CCAT KID designs at 100 mK. The measurements are conducted in a dilution refrigerator (DR) with a set of room temperature Helmholtz coils positioned around the DR. We discuss the implications of these results for CCAT field operations.",
    "authors": [
      "Benjamin J. Vaughan",
      "Yuhan Wang",
      "Cody J. Duell",
      "Jason Austermann",
      "James R. Burgoyne",
      "Scott Chapman",
      "Steve K. Choi",
      "Abigail T. Crites",
      "Eliza Gazda",
      "Ben Keller",
      "Michael D. Niemack",
      "Darshan A. Patel",
      "Anna Vaskuri",
      "Eve M. Vavagiakis",
      "Michael Vissers",
      "Samantha Walker",
      "Jordan Wheeler",
      "Ruixuan",
      "Xie"
    ],
    "published": "2025-10-04T03:51:00Z",
    "updated": "2025-10-07T03:17:24Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2510.05100v1",
    "url": "https://arxiv.org/abs/2510.05100v1",
    "pdf_url": "https://arxiv.org/pdf/2510.05100v1.pdf",
    "title": "Rapid event extraction and tensorial event adaption: Libraries for   efficient access and generic reweighting of parton-level events and their   implementation in the MadtRex module",
    "abstract": "We present Rex and teaRex, C++17 libraries for efficient management of parton-level hard scattering event information and completely generic reweighting of such events, respectively. Rex is primarily an interfacing and I/O library for Les Houches Event format files and provides an internal event format designed with data parallelism in mind, and teaRex extends this format to provide full parton-level reweighting functionality with minimal code needing to be written by the end user. These libraries serve as the foundation for the MadtRex reweighting module for MadGraph5_aMC@NLO, extending the functionality of the CUDACPP plugin to allow for data-parallel model-generic leading order parameter reweighting on SIMD-enabled CPUs and SIMT GPUs, speeding up reweighting by more than two orders of magnitude compared to MadGraph5_aMC@NLO running on the exact same hardware while providing trivial scalability to larger and distributed systems.",
    "authors": [
      "Stefan Roiser",
      "Robert Schöfbeck",
      "Zenny Wettersten"
    ],
    "published": "2025-10-06T17:59:19Z",
    "updated": "2025-10-06T17:59:19Z",
    "categories": [
      "hep-ph",
      "hep-ex",
      "physics.acc-ph"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2510.05084v1",
    "url": "https://arxiv.org/abs/2510.05084v1",
    "pdf_url": "https://arxiv.org/pdf/2510.05084v1.pdf",
    "title": "Electrospray Thruster Plume Impingement on CubeSat Solar Arrays: A   Particle-Tracking Study",
    "abstract": "Electrospray thrusters are emerging as a leading propulsion technology for CubeSats, offering high specific impulse ($I_{sp} > 1000$ s) and low power requirements. However, the divergent ion plumes can impinge on spacecraft surfaces, particularly body-mounted solar arrays, causing contamination and thrust efficiency losses. This study presents a validated particle-tracking simulation to quantify the effects of thruster placement on thrust efficiency and surface contamination for 1U, 3U, and 6U CubeSats. The plume model employs a cosine power distribution ($k=1.8$) with half-angle $46^\\circ$, validated against experimental data with errors below 7%. Results show that thrust efficiency ranges from 53.6% for rear-mounted thrusters on 3U body-mounted configurations to 100% for side-mounted configurations with deployable arrays. CubeSat size significantly affects impingement: 3U platforms experience 46.4% contamination with rear-mounted thrusters compared to 16.6% for 1U. Deployable solar arrays reduce contamination by 77% compared to body-mounted arrays, while side-mounted thrusters eliminate impingement entirely at the cost of only 1.6% efficiency loss. Corner-mounted configurations at $30^\\circ$ cant provide intermediate performance with 88.9% efficiency and 11.1% contamination. These quantitative design guidelines enable mission planners to optimize thruster integration based on power budget and propellant mass constraints, with statistical uncertainty below 0.15% across all configurations.",
    "authors": [
      "Ethan Kahn"
    ],
    "published": "2025-10-06T17:51:46Z",
    "updated": "2025-10-06T17:51:46Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.05058v1",
    "url": "https://arxiv.org/abs/2510.05058v1",
    "pdf_url": "https://arxiv.org/pdf/2510.05058v1.pdf",
    "title": "Pushing the Frontiers of Light: Magnetized Plasma Lenses and Chirp   Tailoring for Extreme Intensities",
    "abstract": "In this work, an innovative scheme is proposed that exploits the response of magnetized plasmas to realize a refractive index exceeding unity for right circularly polarized (RCP) waves. Using two- and three-dimensional Particle-in-Cell (PIC) simulations with the OSIRIS 4.0 framework, it is shown that a shaped magnetized plasma lens (MPL) can act as a glass/solid-state-based convex lens, amplifying laser intensity via transverse focusing. Moreover, by integrating three key ingredients, a tailored plasma lens geometry, a spatially structured strong magnetic field, and a suitably chirped laser pulse, simultaneous focusing and compression of the pulse has been achieved. The simulations reveal up to a 100-fold increase in laser intensity, enabled by the combined action of the MPL and the chirped pulse profile. With recent advances in high-field magnet technology, shaped plasma targets, and controlled chirped laser systems, this approach offers a promising pathway toward experimentally reaching extreme intensities.",
    "authors": [
      "Trishul Dhalia",
      "Rohit Juneja",
      "Amita Das"
    ],
    "published": "2025-10-06T17:37:32Z",
    "updated": "2025-10-06T17:37:32Z",
    "categories": [
      "physics.plasm-ph",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.04847v1",
    "url": "https://arxiv.org/abs/2510.04847v1",
    "pdf_url": "https://arxiv.org/pdf/2510.04847v1.pdf",
    "title": "Characterisation of Thick Gaseous Electron Multipliers as charge readout   operated in pure argon",
    "abstract": "The gain measurements of several 1 mm-thick, 10$\\times$10 cm$^2$ Thick Gaseous Electron Multipliers (ThGEMs), operated in pure argon at 3.3 bar and room temperature are presented. Electrostatic simulations, performed with the COMSOL MultiPhysics software, were employed to guide the design of the detectors, and the field configurations are discussed. A modified ThGEM design, incorporating two embedded internal electrodes in addition to the conventional top and bottom electrodes, was developed to mitigate discharge-induced instabilities and to enable operation at higher gains. Several such structures were produced and compared to the standard 1 mm-thick two-electrode ThGEM. Gain measurements were conducted for every design described here over a wide range of applied electric fields and up to large values. The experimental setup and measurement methodology are described, alongside a comparative analysis of the performance of the different detector geometries.",
    "authors": [
      "G. Eurin",
      "A. Delbart",
      "R. De Oliveira",
      "A. Drozd",
      "P. Granger",
      "M. Karolak",
      "B. Mehl"
    ],
    "published": "2025-10-06T14:33:16Z",
    "updated": "2025-10-06T14:33:16Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.04301v2",
    "url": "https://arxiv.org/abs/2507.04301v2",
    "pdf_url": "https://arxiv.org/pdf/2507.04301v2.pdf",
    "title": "Laser Amplification in $e^{-}$-$μ^{-}$-ion Plasmas",
    "abstract": "We investigate laser amplification in $e^{-}$-$\\mu^{-}$-ion plasmas, where negative muons partially replace electrons. Theoretical results reveal a hybrid plasma wave, called $\\mu$-wave that exhibits ion-acoustic behavior in long-wavelength regime and Langmuir-like behavior in short-wavelength regime. Besides, the Landau damping of $\\mu$-wave is smaller than that of Langmuir wave. Particle-in-cell (PIC) simulations confirm the theoretical results of instabilities in$e^{-}$-$\\mu^{-}$-ion plasmas. The $\\mu$-wave enables efficient laser amplification by suppressing pump-driven spontaneous instabilities through enhanced Landau damping of Langmuir waves. Compared to Raman amplification, $\\mu$-wave amplification can maintain the Gaussian waveform of the seed laser, avoiding pulse splitting. Compared to strongcoupling Brillouin amplification, $\\mu$-wave amplification exhibits weaker filamentation instability. Our theoretical model can be generalized to other plasma systems containing two species of negatively charged particles, such as two-temperature electron plasmas and negative-ion plasma. These findings establish $e^{-}$-$\\mu^{-}$-ion plasma as a promising medium for advanced laser amplification schemes.",
    "authors": [
      "Y. Chen",
      "R. Ou",
      "H. Wang",
      "S. J. Chen",
      "Y. X. Zhong",
      "Y. G. Chen",
      "S. Tan",
      "Y. X. Li",
      "C. Y. Zheng",
      "Z. J. Liu",
      "L. H. Cao",
      "M. M. Zhang",
      "D. P. Feng",
      "W. J. Zuo",
      "C. Z. Xiao"
    ],
    "published": "2025-07-06T08:57:25Z",
    "updated": "2025-10-06T14:22:29Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.04820v1",
    "url": "https://arxiv.org/abs/2510.04820v1",
    "pdf_url": "https://arxiv.org/pdf/2510.04820v1.pdf",
    "title": "Lead tungstate calorimeter of the Jefferson Lab Eta Factory experiment",
    "abstract": "A new electromagnetic calorimeter (ECAL) consisting of 1596 lead tungstate PbWO$_{\\rm 4}$ scintillating crystals has been fabricated and installed in the experimental Hall D at Jefferson Lab (JLab). The high-granularity, high-resolution calorimeter is required by the JLab Eta Factory experiment, whose main physics goal is to study rare decays of eta mesons. The ECAL replaced the inner part of the forward lead glass calorimeter of the GlueX detector. Signals from the detector will be digitized using twelve-bit flash analog-to-digital converters operated at a sampling rate of 250 MHz. The ECAL is integrated into the trigger system of the GlueX detector using electronics modules designed at JLab. The ECAL is currently at the commissioning stage and should be ready for the physics run in January 2025. We will give an overview of the JEF experiment, the design and construction of the ECAL, and the integration of the detector and its infrastructure into the Hall D experimental setup.",
    "authors": [
      "Alexander Somov"
    ],
    "published": "2025-10-06T14:04:19Z",
    "updated": "2025-10-06T14:04:19Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1051/epjconf/202532000058"
  },
  {
    "arxiv_id": "2510.04768v1",
    "url": "https://arxiv.org/abs/2510.04768v1",
    "pdf_url": "https://arxiv.org/pdf/2510.04768v1.pdf",
    "title": "Experimental Reconstruction of Source 4D Phase Space Without Prior   Knowledge of Transfer Matrix",
    "abstract": "We experimentally demonstrate a method for reconstructing the transverse 4D phase space of an electron beam at the time of emission from downstream diagnostics of the 4D phase space. This method does not rely on detailed knowledge of the beamline transport, besides assuming that linearity and symplecticity are satisfied. We apply this method to measure the transverse position and momentum phase space of electrons emitted from a spatially-structured alkali-antimonide cathode. This method can uncover local correlations between emission location and momentum spread. We formulate this method analytically and investigate resolution limits.",
    "authors": [
      "Charles Zhang",
      "Elena Echeverria",
      "Abigail Flint",
      "William H Li",
      "Christopher M. Pierce",
      "Alice Galdi",
      "Chad Penningto",
      "Adam Bartnik",
      "Ivan Bazarov",
      "Jared Maxson"
    ],
    "published": "2025-10-06T12:42:12Z",
    "updated": "2025-10-06T12:42:12Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.04743v1",
    "url": "https://arxiv.org/abs/2510.04743v1",
    "pdf_url": "https://arxiv.org/pdf/2510.04743v1.pdf",
    "title": "Low-energy single-electron detector with sub-micron resolution",
    "abstract": "Single-electron detectors are a key component of electron microscopes and advanced electron optics experiments. We present a YAG:Ce scintillator-based single-electron detector with a spatial resolution of 1 micrometer at an electron energy of 17 keV. Single-electron detection events are identified with an efficiency and purity larger than 0.8 at an electron energy of 17 keV, reaching 0.96 at 30 keV. We show that the detector enables electron diffraction studies with a sample-detector distance comparable to the mean free path of electrons at atmospheric pressure, potentially enabling atmospheric electron diffraction studies.",
    "authors": [
      "Luis Alfredo Ixquiac Méndez",
      "Martino Zanetti",
      "Tilman Kraeft",
      "Thomas Juffmann"
    ],
    "published": "2025-10-06T12:16:43Z",
    "updated": "2025-10-06T12:16:43Z",
    "categories": [
      "physics.ins-det",
      "physics.app-ph",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.04729v1",
    "url": "https://arxiv.org/abs/2510.04729v1",
    "pdf_url": "https://arxiv.org/pdf/2510.04729v1.pdf",
    "title": "An Approach for Restoring Magnetic Field Uniformity in Openable   BIPM-Type Kibble Balance Magnets",
    "abstract": "The Kibble balance realizes the kilogram by linking mechanical and electrical quantities via a magnet system. In an improved BIPM-type magnet design by Tsinghua University, an open/close surface was incorporated, facilitating operation. However, an unavoidable mechanical air gap at the splitting plane introduces asymmetry in the magnetic flux density profile, degrading field uniformity. This study proposes a two-step yoke compensation method to restore symmetry by adjusting the upper outer yoke's inner radius and the splitting gap height. Finite element simulations show linear relationships between asymmetry and these parameters, enabling predictive compensation. Experimental results confirm that sequential tuning successfully eliminates asymmetry and recovers the designed uniform field range. The method provides an effective solution for enhancing magnetic field quality in openable Kibble balance magnets.",
    "authors": [
      "Nanjia Li",
      "Weibo Liu",
      "Yongchao Ma",
      "Wei Zhao",
      "Songling Huang",
      "Shisong Li"
    ],
    "published": "2025-10-06T11:50:21Z",
    "updated": "2025-10-06T11:50:21Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2504.15307v3",
    "url": "https://arxiv.org/abs/2504.15307v3",
    "pdf_url": "https://arxiv.org/pdf/2504.15307v3.pdf",
    "title": "Modeling frequency instability in high-quality resonant experiments",
    "abstract": "Modern resonant sensing tools can achieve increasingly high quality factors, which correspond to extremely narrow linewidths. In such systems, time-variation of the resonator's natural frequency can potentially impact its ability to accumulate power and its resulting sensitivity. One such example is the Dark SRF experiment, which utilizes superconducting radio frequency (SRF) cavities with quality factors of $Q\\sim10^{10}$. Microscopic deformations of the cavity lead to stochastic jittering of its resonant frequency with amplitude 20 times its linewidth. Naively, one may expect this to lead to a large suppression in accumulated power. In this work, we study in detail the effects of frequency instability on high-quality resonant systems, utilizing the Dark SRF experiment as a case study. We show that the timescale of jittering is crucial to determining its effect on power accumulation. Namely, when the resonant frequency varies sufficiently quickly, the system accumulates power as if there were no jittering at all. This implies that the sensitivity of a jittering resonator is comparable to that of a stable resonator. In the case of Dark SRF, we find that jittering only induces a $\\sim 10\\%$ loss in power. Our results allow the dark-photon exclusion bound from Dark SRF's pathfinder run to be refined, leading to a constraint that is an order of magnitude stronger than previously reported (corresponding to a signal-to-noise ratio which is four orders of magnitude larger). This result represents the world-leading constraint on dark photons over a wide range of masses below $6\\,\\rm \\mu eV$ and translates to the best laboratory-based limits on the photon mass $m_\\gamma<2.9\\times 10^{-48}\\,\\rm g$.",
    "authors": [
      "Hao-Ran Cui",
      "Saarik Kalia",
      "Zhen Liu"
    ],
    "published": "2025-04-18T19:22:27Z",
    "updated": "2025-10-06T10:47:37Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "hep-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.04658v1",
    "url": "https://arxiv.org/abs/2510.04658v1",
    "pdf_url": "https://arxiv.org/pdf/2510.04658v1.pdf",
    "title": "Numerical Demonstration of Kolmogorov Scaling in Magnetohydrodynamic   Turbulence",
    "abstract": "The two leading models of isotropic magnetohydrodynamic (MHD) turbulence have competing predictions: $k^{-5/3}$ (Kolmogorov) and $k^{-3/2}$ (Iroshnikov-Kraichnan) scalings. This paper identifies the valid MHD turbulence model using high-resolution numerical and diagnostics-structure functions, intermittency exponents, and energy spectra and fluxes of imbalance MHD. The energy spectra of our forced MHD simulations on $8192^2$, $4096^2$, $1024^3$, and $512^3$ support Kolmogorov's k^{-5/3} spectrum over Iroshnikov-Kraichnan's k^{-3/2} spectrum, but the difference in the spectral exponents is small. However, the numerically computed third-order structure functions and intermittency exponents support Kolmogorov scaling in both two and three dimensions. Also, the energy fluxes of the imbalance MHD follow the predictions of Kolmogorov scaling. These results would help in better modelling of solar wind, solar corona, and dynamos.",
    "authors": [
      "Manthan Verma",
      "Abhishek K. Jha",
      "Shashwat Nirgudkar",
      "Mahendra K. Verma"
    ],
    "published": "2025-10-06T10:02:52Z",
    "updated": "2025-10-06T10:02:52Z",
    "categories": [
      "physics.plasm-ph",
      "physics.flu-dyn"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2411.02212v2",
    "url": "https://arxiv.org/abs/2411.02212v2",
    "pdf_url": "https://arxiv.org/pdf/2411.02212v2.pdf",
    "title": "Radiopurity screening of materials for rare event searches by neutron   activation at the TRIGA reactor of Pavia",
    "abstract": "In the framework of physics experiments searching for rare events, the selection of extremely radiopure materials is a challenging task, as the signal of interest is often hidden by instrumental background. Neutron activation is a powerful technique to measure trace contaminants with high sensitivity but, to be properly applied, it requires a good characterization of neutron irradiation and $\\gamma$-spectroscopy facilities. This paper presents the state-of-the-art workflow adopted by the Radioactivity Laboratory of the University of Milano-Bicocca for radiopurity screening of materials by neutron activation performed at the TRIGA reactor in Pavia. The ultimate sensitivity of the described workflow, in the absence of interfering activation products and without the application of radiochemical and/or active background rejection techniques, is $<10^{-14}$ g/g for $^{40}$K, $<10^{-12}$ g/g for $^{238}$U and of the order of $10^{-12}$ g/g for $^{232}$Th contaminations. Further details are here provided to address systematic uncertainties related to neutron irradiation that may bias results. To this aim, a dedicated neutron activation campaign was performed and the data were analyzed exploiting a Monte Carlo simulation model of the reactor and applying an unfolding technique to obtain a comprehensive characterization of the neutron flux in typical irradiation configurations. The results of this work provide a valuable benchmark for the application of neutron activation in future radiopurity screening campaigns.",
    "authors": [
      "G. Baccolo",
      "A. Barresi",
      "D. Chiesa",
      "M. Nastasi",
      "E. Previtali",
      "M. Sisti"
    ],
    "published": "2024-11-04T16:07:50Z",
    "updated": "2025-10-06T08:47:37Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1140/epjp/s13360-025-06232-0"
  },
  {
    "arxiv_id": "2510.04415v1",
    "url": "https://arxiv.org/abs/2510.04415v1",
    "pdf_url": "https://arxiv.org/pdf/2510.04415v1.pdf",
    "title": "Beam-dust interactions in an e$^+$e$^-$ collider",
    "abstract": "In recent electron-positron colliders designed and operated with very low emittance and high current, the energy density of the beam has increased significantly compared to earlier designs. Under these conditions, interactions between the beam and residual materials within the beam pipe exert considerable mutual influence. The residual materials are heated by the beam, leading to evaporation, charging, and possible fission, eventually resulting in a plasma state. Conversely, the beam undergoes emittance growth due to electromagnetic interactions with the resulting plasma. We investigate the effects of such dust-induced plasma on the beam through numerical simulations of these processes.",
    "authors": [
      "Kazuhito Ohmi",
      "Hitoshi Fukuma",
      "Shinji Terui"
    ],
    "published": "2025-10-06T01:01:32Z",
    "updated": "2025-10-06T01:01:32Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.04385v1",
    "url": "https://arxiv.org/abs/2510.04385v1",
    "pdf_url": "https://arxiv.org/pdf/2510.04385v1.pdf",
    "title": "Structure-Preserving MHD-Driftkinetic Discretization for Wave-Particle   Interactions",
    "abstract": "We present a structure-preserving discretization of the hybrid magnetohydrodynamics (MHD)-driftkinetic system for simulations of low-frequency wave-particle interactions. The model equations are derived from a variational principle, assuring energetically consistent couplings between MHD fluids and driftkinetic particles. The spatial discretization is based on a finite-element-exterior-calculus (FEEC) framework for the MHD and a particle-in-cell (PIC) method for the driftkinetic. A key feature of the scheme is the inclusion of the non-quadratic particle magnetic moment energy term in the Hamiltonian, which is introduced by the guiding-center approximation. The resulting discrete Hamiltonian structure naturally organizes the dynamics into skew-symmetric subsystems, enabling balanced energy exchange. To handle the non-quadratic energy term, we develop energy-preserving time integrators based on discrete gradient methods. The algorithm is implemented in the open-source Python package \\texttt{STRUPHY}. Numerical experiments confirm the energy-conserving property of the scheme and demonstrate the capability to simulate energetic particles (EP) induced excitation of toroidal Alfv\\'en eigenmodes (TAE) without artificial dissipation or mode filtering. This capability highlights the potential of structure-preserving schemes for high-fidelity simulations of hybrid systems.",
    "authors": [
      "Byung Kyu Na",
      "Stefan Possanner",
      "Xin Wang"
    ],
    "published": "2025-10-05T22:34:28Z",
    "updated": "2025-10-05T22:34:28Z",
    "categories": [
      "physics.comp-ph",
      "cs.NA",
      "math.NA",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.comp-ph"
  },
  {
    "arxiv_id": "2510.04356v1",
    "url": "https://arxiv.org/abs/2510.04356v1",
    "pdf_url": "https://arxiv.org/pdf/2510.04356v1.pdf",
    "title": "Non-local transport in Radiation-Hydrodynamics codes for ICF by   efficient coupling to an external Vlasov-Fokker-Planck code",
    "abstract": "Accurately incorporating non-local transport into radiation-hydrodynamics codes, and indeed any fluid system, has long been elusive. To date, a simplified and accurate theory that can be easily integrated has not been available. This limitation affects modeling in inertial confinement fusion and magnetic confinement fusion systems, among others, where non-local transport is well-known to be present. Here, we present a coupling methodology between a full Vlasov-Fokker-Planck (VFP) electron kinetic code and radiation-hydrodynamics (rad-hydro) codes. The VFP code is used to adjust native electron transport in the rad-hydro code, thus enabling improved transport without the need to integrate a full electron VFP solver into the rad-hydro code. This approach necessitates only occasional invocation of the VFP code, reducing computational intensity compared to following the dynamic evolution entirely with the VFP code on fluid time scales. We illustrate that the methodology is more accurate than other simplified methods in thermal decay systems relevant to inertial confinement fusion and can replicate standard theoretical results with high accuracy.",
    "authors": [
      "Abetharan Antony",
      "Robert Kingham",
      "Stefan Mijin",
      "Marty Marinak"
    ],
    "published": "2025-10-05T20:46:08Z",
    "updated": "2025-10-05T20:46:08Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.04298v1",
    "url": "https://arxiv.org/abs/2510.04298v1",
    "pdf_url": "https://arxiv.org/pdf/2510.04298v1.pdf",
    "title": "A Particle-in-Cell Simulation Framework for Thomson Scattering Analysis   in Inertial Confinement Fusion",
    "abstract": "In inertial confinement fusion (ICF), Thomson scattering (TS) is a widely used diagnostic technique for probing plasma conditions. We present a first-principles numerical approach to obtaining scattered light signals of ion acoustic features with high resolution in angle and frequency space using particle-in-cell simulations under typical ICF conditions. Our method demonstrates good agreement with existing theories for thermal collective TS. In the super-thermal collective regime, the results align with theory when the driven plasma modes are well-matched in wave vectors to the probe and collecting beams. Moreover, we also find that TS signals can remain significant even under imperfect wave-vector matching-a result that contradicts the conventional expectation that the TS spectrum strictly follows the plasma density spectrum. We attribute this discrepancy to a beating wave mechanism arising from the interaction between the probe beam and driven plasma density modulations. Our work thus provides a practical framework for interpreting TS signals from driven ion modes, a common yet complex feature in ICF plasmas.",
    "authors": [
      "Ziang Zhu",
      "Yifan Liu",
      "Jun Li",
      "Han Wen",
      "Shihui Cao",
      "Yin Shi",
      "Qing Jia",
      "Chaoxin Chen",
      "Yaoyuan Liu",
      "Hang Zhao",
      "Tao Gong",
      "Zhichao Li",
      "Dong Yang",
      "Jian Zheng"
    ],
    "published": "2025-10-05T17:25:25Z",
    "updated": "2025-10-05T17:25:25Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.04036v1",
    "url": "https://arxiv.org/abs/2510.04036v1",
    "pdf_url": "https://arxiv.org/pdf/2510.04036v1.pdf",
    "title": "A borehole muon detector with SiPM-on-tile technology",
    "abstract": "We developed a compact and rugged muon detector designed for deployment in boreholes. The detector uses a SiPM-on-tile approach in which silicon photomultipliers are directly coupled to scintillator tiles, thereby eliminating the need for wavelength-shifting fibers and long scintillator bars. The modular design is based on a 64-channel unit, 140~cm in length and 80~mm in diameter, composed of $5 \\times 5$~cm$^{2}$ scintillator tiles coupled to SiPMs, powered and read out using off-the-shelf electronics. The detector has an average muon detection efficiency above 95\\% and acceptance over 5$^\\circ$--60$^\\circ$ in zenith and 0$^\\circ$--360$^\\circ$ in azimuth. Simulations indicate that reconstruction combining hit positions and energy deposits achieves a zenith resolution of 1.5--4.0$^\\circ$ across most of the zenith range. This work demonstrates a compact, rugged, and cost-effective borehole muon detector based on the SiPM-on-tile approach, offering a new alternative for muon tomography.",
    "authors": [
      "Miguel Arratia",
      "Jiajun Huang",
      "Sean Preins",
      "Sebastian Ritter",
      "Christian P. Romero",
      "Sebastian Tapia"
    ],
    "published": "2025-10-05T05:03:12Z",
    "updated": "2025-10-05T05:03:12Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.04012v1",
    "url": "https://arxiv.org/abs/2510.04012v1",
    "pdf_url": "https://arxiv.org/pdf/2510.04012v1.pdf",
    "title": "The LCLStream Ecosystem for Multi-Institutional Dataset Exploration",
    "abstract": "We describe a new end-to-end experimental data streaming framework designed from the ground up to support new types of applications -- AI training, extremely high-rate X-ray time-of-flight analysis, crystal structure determination with distributed processing, and custom data science applications and visualizers yet to be created. Throughout, we use design choices merging cloud microservices with traditional HPC batch execution models for security and flexibility. This project makes a unique contribution to the DOE Integrated Research Infrastructure (IRI) landscape. By creating a flexible, API-driven data request service, we address a significant need for high-speed data streaming sources for the X-ray science data analysis community. With the combination of data request API, mutual authentication web security framework, job queue system, high-rate data buffer, and complementary nature to facility infrastructure, the LCLStreamer framework has prototyped and implemented several new paradigms critical for future generation experiments.",
    "authors": [
      "David Rogers",
      "Valerio Mariani",
      "Cong Wang",
      "Ryan Coffee",
      "Wilko Kroeger",
      "Murali Shankar",
      "Hans Thorsten Schwander",
      "Tom Beck",
      "Frédéric Poitevin",
      "Jana Thayer"
    ],
    "published": "2025-10-05T03:13:38Z",
    "updated": "2025-10-05T03:13:38Z",
    "categories": [
      "cs.IR",
      "physics.ins-det"
    ],
    "primary_category": "cs.IR"
  },
  {
    "arxiv_id": "2510.03960v1",
    "url": "https://arxiv.org/abs/2510.03960v1",
    "pdf_url": "https://arxiv.org/pdf/2510.03960v1.pdf",
    "title": "An Explicit Energy-Conserving Particle Method for the   Vlasov-Fokker-Planck Equation",
    "abstract": "We propose an explicit particle method for the Vlasov-Fokker-Planck equation that conserves energy at the fully discrete level. The method features two key components: a deterministic and conservative particle discretization for the nonlinear Fokker-Planck operator (also known as the Lenard-Bernstein or Dougherty operator), and a second-order explicit time integrator that ensures energy conservation through an accuracy-justifiable correction. We validate the method on several plasma benchmarks, including collisional Landau damping and two-stream instability, demonstrating its effectiveness.",
    "authors": [
      "Jiyoung Yoo",
      "Jingwei Hu",
      "Lee F. Ricketson"
    ],
    "published": "2025-10-04T22:03:14Z",
    "updated": "2025-10-04T22:03:14Z",
    "categories": [
      "physics.plasm-ph",
      "math-ph",
      "math.MP"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.16490v3",
    "url": "https://arxiv.org/abs/2506.16490v3",
    "pdf_url": "https://arxiv.org/pdf/2506.16490v3.pdf",
    "title": "Evaluation of the absolute single-photon detection efficiency of HRPPD",
    "abstract": "Pixelated High Rate Picosecond Photon Detectors (HRPPDs) by Incom Inc. are promising photosensors for use in Ring Imaging CHerenkov (RICH) detectors, where a high gain, sub-mm position resolution and sub-100ps timing resolution are required in a single photon mode. Quantum Efficiency (QE) has been measured for the first batch of EIC HRPPDs both by Incom and EIC research groups at Jefferson Lab and Brookhaven Lab, with peak values at $\\sim$365 nm typically exceeding 30%. In this study, we present a first direct measurement of Photon Detection Efficiency being equal to (17.1 $\\pm$ 0.1 [stat] $\\pm$ 0.3 [sys])% at 398.6 nm, for a pixel near the center of HRPPD, in a photoelectron pulse counting mode using a picosecond diode laser. HRPPD QE at the same spot and at the same wavelength was evaluated to be (24.4 $\\pm$ 0.1 [stat] $\\pm$ 0.3 [sys])%, leading to a Collection Efficiency estimate of (70.3 $\\pm$ 1.6)%, which is consistent with the expectations.",
    "authors": [
      "Yifan Jin",
      "Alexander Kiselev",
      "Sean Stoll"
    ],
    "published": "2025-06-19T17:37:01Z",
    "updated": "2025-10-04T17:23:04Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2505.03834v5",
    "url": "https://arxiv.org/abs/2505.03834v5",
    "pdf_url": "https://arxiv.org/pdf/2505.03834v5.pdf",
    "title": "Continuing progress toward fusion energy breakeven and gain as measured   against the Lawson criteria",
    "abstract": "This paper is an update to our earlier paper ''Progress toward fusion energy breakeven and gain as measured against the Lawson criterion'' [Phys. Plasmas 29, 062103 (2022)]. Plots of Lawson parameter and triple product vs. ion temperature and triple product vs. date achieved are updated with recently published experimental results. A new plot of scientific energy gain vs. date achieved is included. Additionally, notes on new experimental results, clarifications, and a correction are included.",
    "authors": [
      "Samuel E. Wurzel",
      "Scott C. Hsu"
    ],
    "published": "2025-05-04T17:35:27Z",
    "updated": "2025-10-04T15:39:45Z",
    "categories": [
      "physics.plasm-ph",
      "physics.soc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.03654v1",
    "url": "https://arxiv.org/abs/2510.03654v1",
    "pdf_url": "https://arxiv.org/pdf/2510.03654v1.pdf",
    "title": "A Novel, Steerable, Low-Energy Proton Source for Detector   Characterization",
    "abstract": "We report on the conversion of the Manitoba II mass spectrometer into a versatile proton beam facility. This infrastruc- ture is adaptable to any detector-under-test (DUT), and has proven itself effective with the characterization of silicon detectors used in subatomic beyond-the-Standard-Model (BSM) searches. This work discusses the modifications and subsequent tests to confirm the beam specifications met the demands of the aforementioned detectors.",
    "authors": [
      "Nicholas Macsai",
      "August Mendelsohn",
      "David Harrison",
      "Russell Mammei",
      "Michael Gericke",
      "Leah Broussard",
      "Erick Smith",
      "Grant Riley",
      "Glenn Randall",
      "Mark Makela"
    ],
    "published": "2025-10-04T03:51:54Z",
    "updated": "2025-10-04T03:51:54Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex",
      "physics.acc-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.03556v1",
    "url": "https://arxiv.org/abs/2510.03556v1",
    "pdf_url": "https://arxiv.org/pdf/2510.03556v1.pdf",
    "title": "Next Generation Ta-STJ Sensor Arrays for BSM Physics Searches",
    "abstract": "The Beryllium Electron capture in Superconducting Tunnel junctions (BeEST) experiment uses superconducting tunnel junction (STJ) sensors to search for physics beyond the standard model (BSM) with recoil spectroscopy of the $\\mathbf{^7}$Be EC decay into $\\mathbf{^7}$Li. A pulsed UV laser is used to calibrate the STJs throughout the experiment with $\\sim$20 meV precision. Phase-III of the BeEST experiment revealed a systematic calibration discrepancy between STJs. We found these artifacts to be caused by resistive crosstalk and by intensity variations of the calibration laser. For phase-IV of the BeEST experiment, we have removed the crosstalk by designing the STJ array so that each pixel has its own ground wire. We now also use a more stable UV laser for calibration. The new STJ arrays were fabricated at STAR Cryoelectronics and tested at LLNL and FRIB. They have the same high energy resolution of $\\sim$1\\textendash2~eV in the energy range of interest below 100~eV as before, and they no longer exhibit the earlier calibration artifacts. We discuss the design changes and the STJ array performance for the next phase of the BeEST experiment.",
    "authors": [
      "Joseph P. T. Templet",
      "Spencer Fretwell",
      "Andrew Marino",
      "Robin Cantor",
      "Ad Hall",
      "Connor Bray",
      "Caitlyn Stone-Whitehead",
      "Inwook Kim",
      "Francisco Ponce",
      "Wouter Van De Pontseele",
      "Kyle G. Leach",
      "Stephan Friedrich"
    ],
    "published": "2025-10-03T23:01:58Z",
    "updated": "2025-10-03T23:01:58Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex",
      "quant-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.03539v1",
    "url": "https://arxiv.org/abs/2510.03539v1",
    "pdf_url": "https://arxiv.org/pdf/2510.03539v1.pdf",
    "title": "Rasnik 3-point alignment system: algorithm, control framework, and its   applications",
    "abstract": "Rasnik is a three-point optical displacement sensor originally developed for particle detector alignment in high-energy physics experiments, including the muon chambers of L3 at LEP and ATLAS at the LHC. The system has evolved from four-quadrant photodiodes to CMOS pixel sensors with custom ChessField coded masks, enabling absolute position measurement with no cumulative drift due to absolute value coded. Key advantages include electromagnetic immunity through purely optical measurement principles, working distances from 50 mm to 15 m, and multi-degree-of-freedom sensitivity perpendicular to the optical axis. RasCal, a comprehensive control and analysis software, is presented in this paper and its real-time image processing shows 5 pm/$\\sqrt{\\text{Hz}}$ spatial resolution. With GPU acceleration, 274.5 Hz is achieved during live camera acquisition and 109 Hz on CPU. In maximum-throughput configurations, the processing rates exceed 300 Hz on simple consumer hardware. System performance is demonstrated across diverse applications: 5 pm/$\\sqrt{\\text{Hz}}$ displacement sensitivity is achieved in the VATIGrav setup, dynamic behavior is characterized with a Watt's linkage. In addition, the lack of cumulative drift due to absolute coding with minimal thermal sensitivity under controlled conditions is used for vibration and thermal characterization of photodiode mounts for the LISA space mission. Millisecond-level command latency and thread-safe multi-camera support are provided by the RasCal software, establishing it as a robust and cost-effective precision measurement solution for demanding alignment applications in gravitational-wave detectors and space instrumentation.",
    "authors": [
      "Anoop Nagesh Koushik",
      "Harry van der Graaf",
      "Kevin Ravensberg",
      "Rene M. Wanders",
      "Sena N. Gomashie",
      "Nick van Remortel",
      "Joris van Heijningen"
    ],
    "published": "2025-10-03T22:12:09Z",
    "updated": "2025-10-03T22:12:09Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.03500v1",
    "url": "https://arxiv.org/abs/2510.03500v1",
    "pdf_url": "https://arxiv.org/pdf/2510.03500v1.pdf",
    "title": "Installation and first commissioning results of the JEF lead tungstate   calorimeter",
    "abstract": "The Electromagnetic Calorimeter (ECAL), consisting of 1,596 lead tungstate scintillating crystals, has been recently constructed and installed in Experimental Hall D at Jefferson Lab (JLab). The calorimeter is a key component of the JLab Eta Factory Experiment, whose main goal is to measure the decays of eta and eta prime mesons into multi-photon final states. The ECAL replaces the inner part of the former forward lead-glass calorimeter. Scintillation light from each crystal is detected using Hamamatsu R4125 photomultiplier tubes. Calorimeter modules were fabricated and tested in the lab using light from light-emitting diodes before being installed in the detector frame. The detector is currently undergoing commissioning using the light monitoring system and cosmic rays. We will present an overview of the fabrication and testing of the calorimete modules, along with the first detector commissioning results. The ECAL was ready for data-taking in spring 2025.",
    "authors": [
      "Alexander Somov",
      "Vladimir Berdnikov"
    ],
    "published": "2025-10-03T20:24:45Z",
    "updated": "2025-10-03T20:24:45Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1117/12.3064476"
  },
  {
    "arxiv_id": "2510.03488v1",
    "url": "https://arxiv.org/abs/2510.03488v1",
    "pdf_url": "https://arxiv.org/pdf/2510.03488v1.pdf",
    "title": "Scintillator-integrated microchannel plate photomultiplier tubes for   ultrafast timing over keV-GeV energy scales",
    "abstract": "Precise measurement of radiation has long played a vital role in a wide range of research and industrial fields, from fundamental physics beyond the Standard Model to medical imaging such as time-of-flight positron emission tomography. Developing radiation detectors that achieve high timing precision-on the order of a few tens of picoseconds-and energy measurement capabilities remains indispensable yet challenging. In this study, we developed two types of scintillator-integrated microchannel plate photomultiplier tubes (SCI-IMPs), one incorporating barium fluoride, and the other bismuth germanate, to enable simultaneous high-precision timing and energy measurements. To evaluate their performance over a wide energy range from keV- to GeV-scale, electron-positron annihilation gamma rays and cosmic ray muons were used. For energy measurements, both detectors achieved an energy resolution of approximately 35% at 511 keV. For timing measurements using 511 keV, coincidence time resolutions (CTRs) of approximately 50 ps full width at half maximum (FWHM) were obtained for both detectors. In contrast, for cosmic ray muon experiments where cosmic ray muon energy is typically on the order of GeV, CTRs were measured to be 25.1 and 16.8 ps FWHM for barium fluoride- and bismuth germanate-based detectors, respectively. The versatile scintillator-integration technique established in this study can broaden the applicability of the newly developed SCI-IMPs. In particular, these results demonstrate that the developed detectors push the boundaries of timing performance while retaining energy measurement and hold promise for future applications in fundamental physics experiments and medical imaging.",
    "authors": [
      "Ryosuke Ota",
      "Yuya Onishi",
      "Daehee Lee",
      "Yuki Ichikawa",
      "Koji Kuramoto",
      "Kenshi Shimano",
      "Yutaka Hasegawa",
      "Eric Berg",
      "Takahiro Moriya",
      "Simon R. Cherry",
      "Sun Il Kwon"
    ],
    "published": "2025-10-03T20:08:15Z",
    "updated": "2025-10-03T20:08:15Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "physics.med-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2503.11277v3",
    "url": "https://arxiv.org/abs/2503.11277v3",
    "pdf_url": "https://arxiv.org/pdf/2503.11277v3.pdf",
    "title": "AI-Assisted Object Condensation Clustering for Calorimeter Shower   Reconstruction at CLAS12",
    "abstract": "Several nuclear physics studies using the CLAS12 detector rely on the accurate reconstruction of neutrons and photons from its forward angle calorimeter system. These studies often place restrictive cuts when measuring neutral particles due to an overabundance of false clusters created by the existing calorimeter reconstruction software. In this work, we present a new AI approach to clustering CLAS12 calorimeter hits based on the object condensation framework. The model learns a latent representation of the full detector topology using GravNet layers, serving as the positional encoding for an event's calorimeter hits which are processed by a Transformer encoder. This unique structure allows the model to contextualize local and long range information, improving its performance. Evaluated on one million simulated $e+p$ collision events, our method significantly improves cluster trustworthiness: the fraction of reliable neutron clusters, increasing from 8.88\\% to 30.73\\%, and photon clusters, increasing from 51.07\\% to 64.73\\%. Our study also marks the first application of AI clustering techniques for hodoscopic detectors, showing potential for usage in many other experiments.",
    "authors": [
      "Gregory Matousek",
      "Anselm Vossen"
    ],
    "published": "2025-03-14T10:33:25Z",
    "updated": "2025-10-03T19:46:21Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.01060v2",
    "url": "https://arxiv.org/abs/2510.01060v2",
    "pdf_url": "https://arxiv.org/pdf/2510.01060v2.pdf",
    "title": "Do plasmoids induce fast magnetic reconnection in well-resolved current   sheets in 2D MHD simulations?",
    "abstract": "We investigate the development of tearing-mode instability using the highest resolution two-dimensional magnetohydrodynamic simulations of reconnecting current sheets on a uniform grid, for Lundquist numbers $10^3 \\le S \\le 2 \\times 10^5$. Although the tearing-mode instability is commonly thought to trigger a plasmoid cascade that enables fast reconnection - i.e., independent of $S$ - our results, in broad agreement with the recent findings of Morillo \\& Alexakis (2025), challenge this belief. We demonstrate a Sweet-Parker scaling of the reconnection rate $V_{\\text{rec}} \\sim S^{-1/2}$ up to Lundquist numbers $S \\sim 10^4$. For larger values, plasmoid formation sets in leading to a slight enhancement of the reconnection rate, $V_{\\text{rec}} \\sim S^{-1/3}$, consistent with the prediction from linear tearing mode induced reconnection, indicating that reconnection remains resistivity dependent, and therefore slow. In our simulations, the plasmoids do not form a cascade of mergers, as they are rapidly advected out of the reconnection layer. Our findings call for the revision of the role of plasmoid formation in 2D high Lundquist number magnetic reconnection. Even if future studies demonstrate that 2D plasmoid-reconnection becomes resistivity-independent at sufficiently large $S$, directly extending those results to 3D astrophysical environments is not justified, as in realistic circumstances, the increase of $S$ also raises the Reynolds number of the outflows, making it essential to account for the dominant role of turbulence.",
    "authors": [
      "G. H. Vicentin",
      "G. Kowal",
      "E. M. de Gouveia Dal Pino",
      "A. Lazarian"
    ],
    "published": "2025-10-01T16:00:23Z",
    "updated": "2025-10-03T19:09:52Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE",
      "hep-th"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.03414v1",
    "url": "https://arxiv.org/abs/2510.03414v1",
    "pdf_url": "https://arxiv.org/pdf/2510.03414v1.pdf",
    "title": "Spectroscopic measurements of graphite electrode erosion on the ZaP-HD   sheared-flow-stabilized Z-pinch device",
    "abstract": "The ionizations per photon, or S/XB, method uses spectroscopic measurements of radiating impurity ions to determine the influx from a solid surface. It is highly useful as a non-perturbing, in-situ measure of the gross erosion flux of plasma-facing components (PFCs). In sheared-flow-stabilized (SFS) Z-pinch devices, the electrode supplies the plasma current and directly contacts the core Z-pinch plasma. Electrode erosion due to the large particle and heat fluxes affects electrode durability, which is an important factor in existing and future devices. An improved understanding of these plasma-electrode interactions is required, in particular as energy density increases. Experiments on the ZaP-HD device investigate erosion of the graphite electrode by applying the S/XB method for C-III emission at 229.7 nm. The S/XB coefficients are determined from electron density and temperature profiles obtained from Digital Holographic Interferometry (DHI) measurements. An approach for expanding these profiles to represent plasma contacting the electrode is described. In both cases, the measured erosion fluxes are on the order of 10$^{30}$-10$^{31}$ atoms m$^{-2}$s$^{-1}$. These values are significantly larger than the expected erosion flux due to physical sputtering of H$^+$ ions on carbon, but are comparable to theoretical sublimation fluxes. This suggests that the source of carbon erosion flux is primarily from sublimation as opposed to sputtering. The dominance of sublimation over sputtering processes implies a difference in energy of the eroded neutrals which may provide insight on redeposition and net erosion behavior.",
    "authors": [
      "Amierul Aqil Khairi",
      "Elyse Lian",
      "Uri Shumlak"
    ],
    "published": "2025-10-03T18:23:16Z",
    "updated": "2025-10-03T18:23:16Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.03388v1",
    "url": "https://arxiv.org/abs/2510.03388v1",
    "pdf_url": "https://arxiv.org/pdf/2510.03388v1.pdf",
    "title": "Mixed Stochastic-Deterministic Density Functional Theoretic   Decomposition of Kubo-Greenwood Conductivities in the Projector Augmented   Wave Formalism",
    "abstract": "Pairing the accuracy of Kohn-Sham density-functional framework with the efficiency of a stochastic algorithmic approach, mixed stochastic-deterministic Density Functional Theory (mDFT) achieves a favorable computational scaling with system sizes and electronic temperatures. We employ the recently developed mDFT formalism to investigate the dynamic charge-transport properties of systems in the warm dense matter regime. The optical conductivity spectra are computed for single- and multi- component mixtures of carbon, hydrogen, and beryllium using two complementary approaches: Kubo-Greenwood in the mDFT picture and real-time Time-Dependent mDFT. We further devise a decomposition of the Onsager coefficients leading up to the Kubo-Greenwood spectra to exhibit contributions from the deterministic, stochastic, and mixed electronic state transitions at different incident photon energies.",
    "authors": [
      "Vidushi Sharma",
      "Lee A. Collins",
      "Alexander J. White"
    ],
    "published": "2025-10-03T17:57:29Z",
    "updated": "2025-10-03T17:57:29Z",
    "categories": [
      "physics.chem-ph",
      "astro-ph.HE",
      "cond-mat.mtrl-sci",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.chem-ph"
  },
  {
    "arxiv_id": "2509.21506v2",
    "url": "https://arxiv.org/abs/2509.21506v2",
    "pdf_url": "https://arxiv.org/pdf/2509.21506v2.pdf",
    "title": "Electrostatic waves in astrophysical Druyvesteyn plasmas: I. Langmuir   waves",
    "abstract": "Plasmas in various astrophysical systems are in non-equilibrium states as evidenced by direct in-situ measurements in the solar wind, solar corona and planetary environments as well as by indirect observations of various sources of waves and emissions in astrophysical systems. Specific are non-Maxwellian velocity distributions with suprathermal tails, for whose description the most-used are the Kappa (power-law) distributions. With this paper we introduce a modeling alternative for linear waves in plasmas described by another non-equilibrium model, namely the generalized Druyvesteyn distribution. This can reproduce not only high-energy tails, but also low-energy flat-tops of velocity distributions, like those of electrons associated with the Earth's bow shock and interplanetary shocks or of electrons in the solar transition region. We derive the corresponding dispersion relation for longitudinal waves in terms of the newly introduced Druyvsteyn dispersion function, numerically compute, for the isotropic case, the dispersion curves as well as damping rates, and provide analytical approximation in the limit of weak damping. Thereby, we provide a new modeling tool that facilitates the quantitative treatment of a variety of non-Maxwellian plasmas.",
    "authors": [
      "Simon Tischmann",
      "Rudi Gaelzer",
      "Dustin Schröder",
      "Marian Lazar",
      "Horst Fichtner"
    ],
    "published": "2025-09-25T19:59:11Z",
    "updated": "2025-10-03T16:47:55Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.03141v1",
    "url": "https://arxiv.org/abs/2510.03141v1",
    "pdf_url": "https://arxiv.org/pdf/2510.03141v1.pdf",
    "title": "Nonmodal growth and optimal perturbations in magnetohydrodynamic shear   flows",
    "abstract": "In astrophysical shear flows, the Kelvin-Helmholtz (KH) instability is generally suppressed by magnetic tension provided a sufficiently strong streamwise magnetic field. This is often used to infer upper (or lower) bounds on field strengths in systems where shear-driven fluctuations are (or are not) observed, on the basis that fluctuations cannot grow in the absence of linear instability. On the contrary, by calculating the maximum growth that small-amplitude perturbations can achieve in finite time for such a system, we show that perturbations can grow in energy by orders of magnitude even when the flow is sub-Alfv\\'enic, suggesting that shear-driven turbulence is possible even in the presence of strong magnetic fields, and challenging inferences from the observed presence or absence of shear-driven fluctuations. We further show that magnetic fields introduce additional nonmodal growth mechanisms relative to the hydrodynamic case, and that 2D simulations miss key aspects of these growth mechanisms.",
    "authors": [
      "Adrian E. Fraser",
      "Alexis K. Kaminski",
      "Jeffrey S. Oishi"
    ],
    "published": "2025-10-03T16:11:36Z",
    "updated": "2025-10-03T16:11:36Z",
    "categories": [
      "physics.flu-dyn",
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.flu-dyn"
  },
  {
    "arxiv_id": "2510.03008v1",
    "url": "https://arxiv.org/abs/2510.03008v1",
    "pdf_url": "https://arxiv.org/pdf/2510.03008v1.pdf",
    "title": "Status of the MARS code",
    "abstract": "This report describes major features of the most recent version of the MARS code as well as ongoing developments. The list of features includes various options for geometry models, a beam line builder based on MADX code, import of geometry models in GDML format, use of structured and unstructured meshes for scoring purposes, an update to the recent TENDL library for a number of projectiles at low energies (up to 250 MeV), and a recently implemented method to calculate spatial distribution of residual dose in a single computer run without an intermediate source. Examples of the code application to various projects are presented as well.",
    "authors": [
      "Igor Rakhno",
      "Igor Tropint",
      "Dali Georgobiani",
      "Alajos Makovec"
    ],
    "published": "2025-10-03T13:52:35Z",
    "updated": "2025-10-03T13:52:35Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.02971v1",
    "url": "https://arxiv.org/abs/2510.02971v1",
    "pdf_url": "https://arxiv.org/pdf/2510.02971v1.pdf",
    "title": "Millimeter-Wavelength Dual-Polarized Lens-Absorber-Coupled Ti/Al Kinetic   Inductance Detectors",
    "abstract": "This work presents Ti/Al bi-layer Microwave Kinetic Inductance Detectors (MKIDs) based on lens-coupled spiral absorbers as the quasi-optical coupling mechanism for millimeter-wavelength radiation detection. From simulations, the lens-coupled absorbers provide a 70% lens aperture efficiency in both polarizations over an octave band with a spiral array absorber and over 10% relative bandwidth with a single spiral. We have fabricated and measured two devices with bare Ti/Al MKIDs: a 3x3 cm chip with 9 pixels to characterize the optical response at 85 GHz of the two variations of the absorber; and a large format demonstrator with 253 spiral-array pixels showing potential towards a large format millimeter-wavelength camera. We find a sensitivity of 1 mK/sqrt{Hz} and a detector yield of 95%.",
    "authors": [
      "Alejandro Pascual Laguna",
      "Victor Rollano",
      "Aimar Najarro-Fiandra",
      "David Rodriguez",
      "Maria T. Magaz",
      "Daniel Granados",
      "Alicia Gomez"
    ],
    "published": "2025-10-03T13:03:14Z",
    "updated": "2025-10-03T13:03:14Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2404.06950v2",
    "url": "https://arxiv.org/abs/2404.06950v2",
    "pdf_url": "https://arxiv.org/pdf/2404.06950v2.pdf",
    "title": "Compton Edge Convolutional Model and Algorithm for Energy-channel   Calibration",
    "abstract": "Scintillation detectors are essential tools for radiation measurement, but calibrating them accurately can be challenging, especially when full-energy peaks are not prominent. This is common in detectors like plastic scintillators. Current methods for calibrating these detectors often require manual adjustments. To address this, we propose a new method called the convolution model. This model accurately calibrates the energy-channel relationship of the Compton edge in various detectors. We tested it with plastic scintillator BC408, NaI crystal, and LaBr$_3$ crystal. Using ${}^{137}$Cs radioactive sources, we calibrated NaI and LaBr$_3$ detectors using full-energy peaks, then applied the convolution model to fit the Compton edge. Our results show errors within 1\\% when compared to full-energy peak calibration.",
    "authors": [
      "Yanbiao Zhang",
      "Fanjie Zeng",
      "Dehua Kong",
      "Lian Lei",
      "Zhonghai Wang"
    ],
    "published": "2024-04-10T11:57:36Z",
    "updated": "2025-10-03T12:30:14Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.00273v2",
    "url": "https://arxiv.org/abs/2510.00273v2",
    "pdf_url": "https://arxiv.org/pdf/2510.00273v2.pdf",
    "title": "Physical Thickness Characterization of the FRIB Production Targets",
    "abstract": "The FRIB heavy-ion accelerator, commissioned in 2022, is a leading facility   for producing rare isotope beams (RIBs) and exploring nuclei beyond the limits of stability.   These RIBs are produced via reactions between stable primary beams and a graphite target.   Approximately 20-40 \\% of the primary beam power is deposited in the target,   requiring efficient thermal dissipation.   Currently, FRIB operates with a primary beam power of up to 20 kW. To enhance thermal dissipation efficiency,   a single-slice rotating graphite target with a diameter of approximately 30 cm is employed.   The effective target region is a 1 cm-wide outer rim of the graphite disc.   To achieve high RIB production rates, the areal thickness variation must be constrained within 2 \\%.   This paper presents physical thickness characterizations of FRIB production targets with various nominal thicknesses,   measured using a custom-built non-contact thickness measurement apparatus.",
    "authors": [
      "D. J. Lee",
      "M. Reaume",
      "W. Franklin",
      "J. Song"
    ],
    "published": "2025-09-30T20:52:04Z",
    "updated": "2025-10-03T12:04:22Z",
    "categories": [
      "physics.acc-ph",
      "nucl-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.02920v1",
    "url": "https://arxiv.org/abs/2510.02920v1",
    "pdf_url": "https://arxiv.org/pdf/2510.02920v1.pdf",
    "title": "Measurements of the Birks' coefficient of GAGG:Ce using hard X-rays",
    "abstract": "Inorganic scintillators continue to be widely used within astrophysical X-ray and gamma-ray detectors. This is in part thanks to the development of new scintillators, such as GAGG:Ce, as well as the availability of new scintillator readout sensors such as Silicon Photomultipliers and Silicon Drift Detectors. In order to use such scintillator materials for spectrometry or polarimetry, a detailed understanding of their response is important. One parameter that can affect the scintillator performance, particularly at lower photon energies, is their Birks' coefficienct, which correlates the relative light yield to the ionization energy. While for many high-Z inorganic scintillators this effect can be ignored, for GAGG:Ce this appears to not be the case. Here we provide a measurement of the Birks' coefficient for GAGG:Ce using data from two different detectors irradiated in the 20-80 keV energy range at the LARIX-A X-ray beam in Ferrara, Italy. While the effects due to Birks' law are visible below 30 keV, they also significantly influence the performance of GAGG:Ce performance near one of the K-edges, affecting both the measured gain and the energy resolution. Here, we use beam test data to derive the Birks' coefficient from GAGG:Ce. The results indicate that for usage in hard X-ray and soft gamma-ray missions, this coefficient has a significant effect on the measurements.",
    "authors": [
      "Merlin Kole",
      "Nicolas De Angelis"
    ],
    "published": "2025-10-03T11:46:10Z",
    "updated": "2025-10-03T11:46:10Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2509.17934v2",
    "url": "https://arxiv.org/abs/2509.17934v2",
    "pdf_url": "https://arxiv.org/pdf/2509.17934v2.pdf",
    "title": "Superconducting Low-beta Nb$_3$Sn Cavity for ATLAS and Future Ion   Accelerators",
    "abstract": "We report on a Nb$_3$Sn-coated low-beta superconducting radio frequency (SRF) cavity intended for accelerating ions. We aim to apply the cavity in ATLAS, our Argonne National Laboratory user facility for nuclear physics studies with ion beams in the energy range of 5-20 MeV/u. The Nb$_3$Sn-coated cavity, a 145 MHz quarter-wave optimized for ions moving with velocity $\\beta$=v/c=0.08 exhibits an order-of-magnitude reduction in radiofrequency (RF) losses into helium at $4.4\\,\\mathrm{K}$ compared to a superconducting niobium (Nb) cavity at the same frequency and temperature. Experimentally measured fields are among the highest to date for any Nb$_3$Sn-coated cavity, reaching a peak surface magnetic field of 105 mT. We also present a practical solution to the problem of cavity frequency tuning. Tuning by mechanical deformation has been a challenge with Nb3Sn due to its brittle nature, however, using a set of techniques tailored to the properties of thin-film Nb$_3$Sn on Nb, we can repeatably tune the cavity to the ATLAS master clock frequency after it is cooled, while maintaining the excellent performance characteristics. The same Nb$_3$Sn cavity technology offers broad benefits for future ion accelerators.",
    "authors": [
      "T. Petersen",
      "G. Eremeev",
      "B. Tennis",
      "N. Tagdulang",
      "Y. Zhou",
      "M. Kedzie",
      "B. Guilfoyle",
      "Y. Xu",
      "S. V. Kutsaev",
      "R. Agustsson",
      "E. Spranza",
      "P. Davis",
      "G. P. Zinkann",
      "T. Reid",
      "S. Posen",
      "M. P. Kelly"
    ],
    "published": "2025-09-22T15:54:44Z",
    "updated": "2025-10-03T10:56:41Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2403.07790v2",
    "url": "https://arxiv.org/abs/2403.07790v2",
    "pdf_url": "https://arxiv.org/pdf/2403.07790v2.pdf",
    "title": "RADES axion search results with a High-Temperature Superconducting   cavity in an 11.7 T magnet",
    "abstract": "We describe the results of a haloscope axion search performed with an 11.7 T dipole magnet at CERN. The search used a custom-made radio-frequency cavity coated with high-temperature superconducting tape. A set of 27 h of data at a resonant frequency of around 8.84 GHz was analysed. In the range of axion mass 36.5676 $\\mu$eV to 36.5699 $\\mu$eV, corresponding to a width of 554 kHz, no signal excess hinting at an axion-like particle was found. Correspondingly, in this mass range, a limit on the axion to photon coupling-strength was set in the range between g$_{a\\gamma}\\gtrsim$ 6.2e-13 GeV$^{-1}$ and g$_{a\\gamma}\\gtrsim$ 1.59e-13 GeV$^{-1}$ with a 95% confidence level.",
    "authors": [
      "S. Ahyoune",
      "A. Álvarez Melcón",
      "S. Arguedas Cuendis",
      "S. Calatroni",
      "C. Cogollos",
      "A. Díaz-Morcillo",
      "B. Döbrich",
      "J. D. Gallego",
      "J. M. García-Barceló",
      "B. Gimeno",
      "J. Golm",
      "X. Granados",
      "J. Gutierrez",
      "L. Herwig",
      "I. G. Irastorza",
      "N. Lamas",
      "A. Lozano-Guerrero",
      "W. L. Millar",
      "C. Malbrunot",
      "J. Miralda-Escudé",
      "P. Navarro",
      "J. R. Navarro-Madrid",
      "T. Puig",
      "M. Siodlaczek",
      "G. T. Telles",
      "W. Wuensch"
    ],
    "published": "2024-03-12T16:30:33Z",
    "updated": "2025-10-03T09:52:48Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1007/JHEP04(2025)113"
  },
  {
    "arxiv_id": "2503.09495v2",
    "url": "https://arxiv.org/abs/2503.09495v2",
    "pdf_url": "https://arxiv.org/pdf/2503.09495v2.pdf",
    "title": "Calibration of Solid State Nuclear Track Detectors for Rare Event   Searches",
    "abstract": "The calibration of the CR39 and Makrofol Nuclear Track Detectors of the MoEDAL experiment at the CERN-LHC was performed by exposing stacks of detector foils to heavy ion beams with energies ranging from 340 MeV/nucleon to 150 GeV/nucleon. After chemical etching, the base areas and lengths of etch-pit cones were measured using automatic and manual optical microscopes. The response of the detectors, as measured by the ratio of the track-etching rate over the bulk-etching rate, was determined over a range extending from their threshold at Z/$\\beta\\sim7$ and $\\sim50$ for CR39 and Makrofol, respectively, up to Z/$\\beta\\sim92$",
    "authors": [
      "M. Kalliokoski",
      "G. Levi",
      "A. Maulik",
      "I. Ostrovskiy",
      "L. Patrizii",
      "J. Pinfold",
      "Z. Sahnoun",
      "G. Sirri",
      "R. Soluk",
      "M. Staelens",
      "V. Togo",
      "A. Upreti"
    ],
    "published": "2025-03-12T15:57:48Z",
    "updated": "2025-10-03T09:20:12Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/03/P03014"
  },
  {
    "arxiv_id": "2509.21525v2",
    "url": "https://arxiv.org/abs/2509.21525v2",
    "pdf_url": "https://arxiv.org/pdf/2509.21525v2.pdf",
    "title": "High-accuracy low-noise electrical measurements in a closed-cycle   pulse-tube cryostat",
    "abstract": "A shift of paradigm to obtain (sub-)Kelvin environment is currently on-going with the democratization of cryogen-free cryocoolers, boosted by their easy-to-use and continuous operation without the need of liquid helium whose cost and scarcity globally increase. Thanks to their large sample space and cooling power, they can host a superconducting magnet and are an adapted platform for quantum technologies, material science, low temperature detectors and even medical fields. The drawback is that this type of system is inherently based on gas compression that induces a certain level of vibrations and electromagnetic perturbations, which can potentially prevent the determination of low amplitude signals or spoil their stability. In this paper we demonstrate that pulse-tube based cryocoolers can be used for electrical precision measurements, using a commercial cryomagnetic system combined with our home-made a coaxial cryoprobe. In particular, parts-per-billion level of measurement uncertainties in resistance determination, based on quantum Hall resistance standards, is achievable at the level of state-of-the-art measurements involving conventional cryostats based on liquid helium. We performed an extensive characterization of the cryomagnetic system to determine the level of vibrations and electromagnetic perturbations, and revealed that although the magnetic field has a drastic effect on the noise level, only marginal interplays on the measurement are observed as long as the working frequencies of the instrumentation are not in the vicinity of the ones of the perturbations. The set of characterization measurements presented here are easily implementable in laboratories, which can help to determine the vibrations and electromagnetic pollution generated by any cryocooler.",
    "authors": [
      "Mathieu Taupin",
      "Kamel Dougdag",
      "Djamel Ziane",
      "Francois Couedo"
    ],
    "published": "2025-09-25T20:09:58Z",
    "updated": "2025-10-03T09:13:12Z",
    "categories": [
      "cond-mat.other",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.other"
  },
  {
    "arxiv_id": "2510.02762v1",
    "url": "https://arxiv.org/abs/2510.02762v1",
    "pdf_url": "https://arxiv.org/pdf/2510.02762v1.pdf",
    "title": "Development of Deep Neural Network First-Level Hardware Track Trigger   for the Belle II Experiment",
    "abstract": "The Belle II experiment at the SuperKEKB accelerator is designed to explore physics beyond the Standard Model with unprecedented luminosity. As the beam intensity increased, the experiment faced significant challenges due to higher beam-induced background, leading to a high trigger rate and placing limitations on further luminosity increases. To address this problem, we developed trigger logic for tracking using deep neural network (DNN) technology on an FPGA for the Belle II hardware trigger system, employing high-level synthesis techniques. By leveraging drift time and hit pattern information from the Central Drift Chamber and incorporating a simplified self-attention architecture, the DNN track trigger significantly improves track reconstruction performance at the hardware level. Compared to the existing neural track trigger, our implementation reduces the total track trigger rate by 37% while improving average efficiency for the signal tracks from 96% to 98% for charged tracks with transverse momentum > 0.3 GeV. This upgrade ensures the long-term viability of the Belle II data acquisition system as luminosity continues to increase.",
    "authors": [
      "Y. -X. Liu",
      "T. Koga",
      "H. Bae",
      "Y. Yang",
      "C. Kiesling",
      "F. Meggendorfer",
      "K. Unger",
      "S. Hiesl",
      "T. Forsthofer",
      "A. Ishikawa",
      "Y. Ahn",
      "T. Ferber",
      "I. Haide",
      "G. Heine",
      "C. -L. Hsu",
      "A. Little",
      "H. Nakazawa",
      "M. Neu",
      "L. Reuter",
      "V. Savinov",
      "Y. Unno",
      "J. Yuan",
      "Z. Xu"
    ],
    "published": "2025-10-03T06:49:08Z",
    "updated": "2025-10-03T06:49:08Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.18324v2",
    "url": "https://arxiv.org/abs/2507.18324v2",
    "pdf_url": "https://arxiv.org/pdf/2507.18324v2.pdf",
    "title": "Plasma Position Constrained Free-Boundary MHD Equilibrium in Tokamaks   using pyIPREQ",
    "abstract": "A free-boundary, axisymmetric magnetohydrodynamic (MHD) equilibrium code, pyIPREQ, has been developed for Tokamak plasmas using finite difference and Green's function approach. The code builds upon the foundational frameworks of the PEST and IPREQ codes, introducing several enhancements and new capabilities. Notably, pyIPREQ supports the specification of limiter boundaries and enables the computation of key physical quantities. The code has also been extended to compute equilibria constrained by a prescribed magnetic axis position, which is particularly useful when such information can be inferred from the diagnostics data. In addition, pyIPREQ includes functionality to address vertical instabilities, a requirement for accurately modeling elongated plasma configurations. Benchmarking has been carried out against published results and the original IPREQ code. Applications are demonstrated for ADITYA-U Tokamak experiments, where magnetic axis measurements are available, and predictions are also made for SST-1 and ADITYA-U Tokamaks under various operational scenarios.",
    "authors": [
      "Udaya Maurya",
      "Amit K. Singh",
      "Suman Aich",
      "Jagabandhu Kumar",
      "Rohit Kumar",
      "Daniel Raju"
    ],
    "published": "2025-07-24T11:50:38Z",
    "updated": "2025-10-03T05:33:45Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1063/5.0290301"
  },
  {
    "arxiv_id": "2510.02659v1",
    "url": "https://arxiv.org/abs/2510.02659v1",
    "pdf_url": "https://arxiv.org/pdf/2510.02659v1.pdf",
    "title": "Holographic Gaseous Lenses for High-Power Lasers",
    "abstract": "The capabilities of the world's highest energy and peak-power pulsed lasers are limited by optical damage, and further advances in high-intensity laser science will require optics that are substantially more robust than existing components. We describe here the experimental demonstration of off-axis diffractive gaseous lenses capable of withstanding extreme laser fluence and immune to cumulative damage. We used less than 8 mJ of energy from interfering ultraviolet laser pulses to holographically write millimeter-scale diffractive gas lenses into an ozone, oxygen, and carbon-dioxide gas mixture. These lenses allowed us to focus, defocus, and collimate 532-nm nanosecond laser pulses with up to 210 mJ of energy at efficiencies above 50% and fluences up to 35 J/cm$^2$. We also show that the gas lenses have sufficient bandwidth to efficiently diffract 35-fs 800-nm pulses and that beam pointing, divergence, and diffraction efficiency are stable while operating at 10 Hz. These diffractive lenses are simple holograms, and the principles demonstrated here could be extended to other types of optics, suggesting that gaseous optics may enable arbitrary, damage-resistant manipulation of intense light for next-generation ultra-high-power lasers.",
    "authors": [
      "Devdigvijay Singh",
      "Ke Ou",
      "Sida Cao",
      "Victor M. Perez-Ramirez",
      "Harsha Rajesh",
      "Debolina Chakraborty",
      "Caleb Redshaw",
      "Pelin Dedeler",
      "Albertine Oudin",
      "Michelle M. Wang",
      "Julia M. Mikhailova",
      "Livia Lancia",
      "Caterina Riconda",
      "Pierre Michel",
      "Matthew R. Edwards"
    ],
    "published": "2025-10-03T01:36:53Z",
    "updated": "2025-10-03T01:36:53Z",
    "categories": [
      "physics.optics",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2510.01819v2",
    "url": "https://arxiv.org/abs/2510.01819v2",
    "pdf_url": "https://arxiv.org/pdf/2510.01819v2.pdf",
    "title": "Three-Dimensional Niobium Coaxial Cavity with $\\sim0.1\\,$second Lifetime",
    "abstract": "We report on the internal quality factor of a three-dimensional niobium quarter-wave coaxial cavity, with mid-temperature annealing, exhibiting $Q_{\\rm int} \\gtrsim 3\\times10^9$ at the single-photon level below 20\\,mK, which corresponds to an internal photon lifetime of $\\tau_{\\rm int}\\sim90\\,\\mathrm{ms}$. Moreover, $Q_{\\rm int}$ of the mid-temperature annealed cavities remains almost unchanged even after several cooldown cycles and air exposure. These results suggest that stable low-loss niobium oxides might be formed by mid-temperature annealing on the surface of three-dimensional niobium cavity. This surface treatment could be applicable to the fabrication of 2D superconducting circuits and help improve the lifetime of Nb-based superconducting qubits.",
    "authors": [
      "Takaaki Takenaka",
      "Takayuki Kubo",
      "Imran Mahboob",
      "Kosuke Mizuno",
      "Hitoshi Inoue",
      "Takayuki Saeki",
      "Shiro Saito"
    ],
    "published": "2025-10-02T09:05:52Z",
    "updated": "2025-10-03T00:56:20Z",
    "categories": [
      "quant-ph",
      "cond-mat.supr-con",
      "physics.acc-ph"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2510.02598v1",
    "url": "https://arxiv.org/abs/2510.02598v1",
    "pdf_url": "https://arxiv.org/pdf/2510.02598v1.pdf",
    "title": "An active Transverse Energy Filter based on microstructured Si-PIN   diodes with an angular-selective detection efficiency",
    "abstract": "Si-PIN detectors can be microstructured to achieve angular-selective particle detection capabilities, which we call active Transverse Energy Filter (aTEF). The microstructuring consists of a honeycomb structure of deep hexagonally-shaped holes with active silicon side walls, while the bottom of the holes is made insensitive to ionizing radiation. The motivation for this kind of detector arises from the need to distinguish background electrons from signal electrons in a spectrometer of MAC-E filter type. We have demonstrated the angular-dependent detection efficiency of self-fabricated aTEF prototypes in a test setup using an angular-selective photoelectron source to illuminate the detector from various incidence angles.",
    "authors": [
      "S. Schneidewind",
      "K. Gauda",
      "K. Blümer",
      "D. Bonaventura",
      "C. Gönner",
      "V. Hannen",
      "H. -W. Ortjohann",
      "W. Pernice",
      "L. Pöllitsch",
      "R. W. J. Salomon",
      "M. Stappers",
      "S. Wein",
      "C. Weinheimer"
    ],
    "published": "2025-10-02T22:12:14Z",
    "updated": "2025-10-02T22:12:14Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  }
]