{
  "arxiv_id": "2507.08113v2",
  "url": "https://arxiv.org/abs/2507.08113v2",
  "pdf_url": "https://arxiv.org/pdf/2507.08113v2.pdf",
  "title": "Uncertainty quantification of a multi-component Hall thruster model at   varying facility pressures",
  "abstract": "Bayesian inference is applied to calibrate and quantify prediction uncertainty in a coupled multi-component Hall thruster model. The model consists of cathode, discharge, and plume sub-models and outputs thruster performance metrics, one-dimensional plasma properties, and the angular distribution of the current density in the plume. The simulated thrusters include a magnetically shielded thruster operating on krypton, the H9, and an unshielded thruster operating on xenon, the SPT-100, at pressures between 4.3--43 $\\mu$Torr-Kr and 1.7--80 $\\mu$Torr-Xe, respectively. After calibration, the model captures key pressure-related trends, including changes in thrust and upstream shifts in the ion acceleration region. Furthermore, the model exhibits predictive accuracy to within 10\\% when evaluated on flow rates and pressures not included in the training data, and can predict some performance characteristics across test facilities to within the same range of conditions. Compared to a previous model calibrated on some of the same data [Eckels et al. 2024], the model reduced predictive errors in thrust and discharge current by greater than 50%. An extrapolation to on-orbit performance is performed with an error of 9%, capturing trends in discharge current but not thrust. These findings are discussed in the context of using data for predictive Hall thruster modeling in the presence of facility effects.",
  "authors": [
    "Thomas A. Marks",
    "Joshua D. Eckels",
    "Gabriel E. Mora",
    "Alex A. Gorodetsky"
  ],
  "published": "2025-07-10T18:53:51Z",
  "updated": "2025-10-21T13:02:48Z",
  "categories": [
    "stat.AP",
    "physics.comp-ph",
    "physics.plasm-ph",
    "stat.ML",
    "G.3; J.2"
  ],
  "primary_category": "stat.AP",
  "doi": "10.1063/5.0283796"
}