{
  "arxiv_id": "2508.11832v2",
  "url": "https://arxiv.org/abs/2508.11832v2",
  "pdf_url": "https://arxiv.org/pdf/2508.11832v2.pdf",
  "title": "Controlling the recovery time of the superconducting nanowire   single-photon detector with a voltage-controlled cryogenic tunable resistor",
  "abstract": "Superconducting nanowire single-photon detectors (SNSPD), owing to their unique performance, are currently the standard detector in most demanding single-photon experiments. One important metric for any single-photon detector is the deadtime (or recovery time), defined as the minimum temporal separation between consecutive detection events. In SNSPDs, the recovery time is more subtle, as the detection efficiency does not abruptly drop to zero when the temporal separation between detection events gets smaller, instead, it increases gradually as the SNSPD current recovers. SNSPD's recovery time is dominated by its kinetic inductance, the readout impedance, and the degree of saturation of internal efficiency. Decreasing the kinetic inductance or increasing the readout impedance can accelerate the recovery process. Significant reduction of the SNSPD recovery time, by, for example, adding a series resistor in the readout circuitry, is possible but can lead to detector latching which hinders further detector operation or enforces underbiasing and hence a reduction in detection efficiency. Previous research has demonstrated passive resistive networks for the reduction of recovery time that rely on trial and error to find the appropriate resistance values. Here we show, using a novel, cryogenically compatible, and tunable resistor technology, one can find the optimized impedance values, delivering fast SNSPD recovery time, while maintaining maximum internal detection efficiency. Here we show an increase of more than 2 folds in both maximum achievable detection rates and the achievable detection efficiency at high photon fluxes, demonstrating detection rates as high as 120 Mcps with no loss of internal detection efficiency.",
  "authors": [
    "Hui Wang",
    "Nikita Dmitrievic Orlov",
    "Niels Noordzij",
    "Thomas Descamps",
    "J. W. Niels Los",
    "Val Zwiller",
    "Iman Esmaeil Zadeh"
  ],
  "published": "2025-08-15T22:43:48Z",
  "updated": "2025-10-21T12:33:31Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}