{
  "arxiv_id": "2510.17682v1",
  "url": "https://arxiv.org/abs/2510.17682v1",
  "pdf_url": "https://arxiv.org/pdf/2510.17682v1.pdf",
  "title": "Real-Time Readout System Design for the BULLKID-DM Experiment: Enhancing   Dark Matter Search Capabilities",
  "abstract": "The BULLKID-DM experiment aims to detect WIMP-like potential Dark Matter particles with masses below 1 GeV/c^2. Sensing these particles is challenging, as it requires nuclear recoil detectors characterized by high exposure and an energy threshold in the order of 100 eV, thus exceeding the capabilities of conventional semiconductor detectors. BULLKID-DM intends to tackle this challenge by using cryogenic Kinetic Inductance Detectors (MKIDs) with exceptional energy thresholds to sense a target with a total mass of 800 g across 16 wafers, divided into over 2000 individually instrumented silicon dice. The MKIDs on each wafer are coupled to a single transmission line and read using a frequency division multiplexing approach by the room-temperature data acquisition.   In this contribution, we describe and assess the design of the room-temperature readout electronics system, including the selected hardware components and the FPGA firmware which contains the real-time signal processing stages for tone generation, frequency demultiplexing, and event triggering. We evaluate the system on the ZCU216 board, a commercial evaluation card built around a Radio-Frequency System-on-Chip (RFSoC) with integrated high-speed DACs and ADCs, and connected it to a custom-designed analog front-end for signal conditioning.",
  "authors": [
    "T. Muscheid",
    "R. Gartmann",
    "L. E. Ardila-Perez",
    "A. Acevedo-Rentería",
    "L. Bandiera",
    "M. Calvo",
    "M. Cappelli",
    "R. Caravita",
    "F. Carillo",
    "U. Chowdhury",
    "D. Crovo",
    "A. Cruciani",
    "A. D'Addabbo",
    "M. De Lucia",
    "G. Del Castello",
    "M. del Gallo Roccagiovine",
    "D. Delicato",
    "F. Ferraro",
    "M. Folcarelli",
    "S. Fu",
    "M. Grassi",
    "V. Guidi",
    "D. Helis",
    "T. Lari",
    "L. Malagutti",
    "A. Mazzolari",
    "A. Monfardini",
    "D. Nicolò",
    "F. Paolucci",
    "D. Pasciuto",
    "L. Pesce",
    "V. Pettinacci",
    "C. Puglia",
    "D. Quaranta",
    "C. M. A. Roda",
    "S. Roddaro",
    "M. Romagnoni",
    "G. Signorelli",
    "F. Simon",
    "M. Tamisari",
    "A. Tartari",
    "E. Vázquez-Jáuregui",
    "M. Vignati",
    "K. Zhao"
  ],
  "published": "2025-10-20T15:56:20Z",
  "updated": "2025-10-20T15:56:20Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}