{
  "arxiv_id": "2510.17912v1",
  "url": "https://arxiv.org/abs/2510.17912v1",
  "pdf_url": "https://arxiv.org/pdf/2510.17912v1.pdf",
  "title": "Space charge and ion transport in aerosol neutralization: Toward a   concentration-dependent alternative to the $N_it$ product",
  "abstract": "In this study, we quantify how charged particle concentration affects the neutralization rate of aerosol particles, focusing on the role of ion dynamics shaped by internal electric fields arising from net space charge. Conventional neutralizer performance is typically evaluated using the $N_it$ product, which assumes quasi-neutral conditions and neglects electric fields from small charge imbalances. We demonstrate that internal electric fields become increasingly important at high aerosol concentrations and significantly influence neutralization dynamics. We develop a coupled ion--aerosol transport model in a two-dimensional axisymmetric geometry that includes ion generation, convection, diffusion, recombination, attachment to aerosols, and wall loss, with self-consistent electric fields obtained from the Poisson equation. Results show that even small net charges generate electric fields that enhance ion drift and accelerate neutralization, effects not captured by traditional $N_it$-based approaches. Using a neutralization time metric, we find that neutralization becomes slower with increasing aerosol number concentration $N_p$, higher initial particle charge $q_0$, and smaller particle diameter $d_p$ when space charge is absent. When space charge is included, the influence of $q_0$ and $d_p$ diminishes, while $N_p$ becomes the dominant factor governing neutralization behavior. Accordingly, we propose a concentration-dependent analytical expression for mean charge relaxation that captures coupled ion--aerosol transport and space charge effects. The modeling framework presented here is applicable to laboratory instruments, industrial processes, and atmospheric environments where electrostatic interactions govern aerosol behavior.",
  "authors": [
    "Kunal. Ghosh",
    "Gargi Sengupta",
    "Rukhsar Parveen",
    "Y. S. Mayya"
  ],
  "published": "2025-10-19T21:27:27Z",
  "updated": "2025-10-19T21:27:27Z",
  "categories": [
    "physics.chem-ph",
    "physics.ao-ph",
    "physics.flu-dyn",
    "physics.ins-det"
  ],
  "primary_category": "physics.chem-ph"
}