{
  "arxiv_id": "2510.18487v1",
  "url": "https://arxiv.org/abs/2510.18487v1",
  "pdf_url": "https://arxiv.org/pdf/2510.18487v1.pdf",
  "title": "Experimental and numerical investigation of suprathermal electron   dynamics using vertical electron cyclotron emission",
  "abstract": "The Tokamak \\`a Configuration Variable (TCV) is equipped with an advanced set of diagnostics for studying suprathermal electron dynamics. Among these, the vertical electron cyclotron emission (VECE) diagnostic offers valuable insights into the electron energy distribution by measuring electron cyclotron emission (ECE) along a vertical line-of-sight. However, reconstructing the electron distribution from ECE measurements is inherently challenging due to harmonic overlap and thermal radiation noise. A more practical approach leverages forward modeling of ECE based on kinetic simulations. To this end, we introduce YODA, a novel synthetic ECE diagnostic framework that simulates emission and (re)absorption of electron cyclotron radiation for arbitrary electron distributions and antenna geometries. The framework is validated against the well-established synthetic ECE code SPECE, using an ohmic TCV discharge as a reference case. In this study, the 3D bounce-averaged Fokker-Planck code LUKE is used to model electron distributions in two electron cyclotron current drive (ECCD) experiments. The synthetic spectra generated using the combined LUKE-YODA framework successfully reproduce the main features of the experimental VECE measurements in both simulated discharges. The combination of kinetic and synthetic ECE simulations allow the identification of the features in the electron distribution function which give rise to certain signatures in the VECE signal.",
  "authors": [
    "L. Votta",
    "M. Hoppe",
    "J. Decker",
    "E. Devlaminck",
    "A. S. Tema Biwolé",
    "L. Porte",
    "J. Cazabonne",
    "Y. Savoye-Peysson",
    "the TCV team"
  ],
  "published": "2025-10-21T10:07:58Z",
  "updated": "2025-10-21T10:07:58Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}