{
  "arxiv_id": "2510.17082v1",
  "url": "https://arxiv.org/abs/2510.17082v1",
  "pdf_url": "https://arxiv.org/pdf/2510.17082v1.pdf",
  "title": "Measurement of radon concentration in the output water of the 100~t/h   ultrapure water system at the Jiangmen Underground Neutrino Observatory",
  "abstract": "The Jiangmen Underground Neutrino Observatory (JUNO), a 20 kton multi-purpose low background liquid scintillator detector, was proposed primarily to determine the neutrino mass ordering. To mitigate radioactivity from surrounding rock and enable cosmic muon tagging, its central detector is immersed in a Water Cherenkov Detector (WCD) containing 40~ktons of ultrapure water instrumented with 2400 20-inch micro-channel plate photomultiplier tubes. Stringent radiopurity requirements mandate a radon concentration below 10 ~mBq/m$^3$ in the WCD. To achieve this, we developed a two-stage (ground and underground) ultrapure water system with 100~t/h production capacity, integrating a five-stage degassing membrane for radon removal. A novel microbubble technique was implemented to optimize the degassing membranes' radon removal efficiency. The synergistic combination of the microbubble technology and the multistage degassing membranes achieved a radon removal efficiency exceeding 99.9\\%, reducing the system's output to 0.61 $\\pm$ 0.50~mBq/m$^3$ in recirculation mode, surpassing design specifications and establishing world-leading performance standards. This paper details the ultrapure system architecture, quantifies the radon contributions of each device, and presents a comprehensive study on microbubble-augmented membrane degassing for low radon ultra-pure water production in a 100~t/h water system.",
  "authors": [
    "C. B. Z. Luo",
    "Q. Tang",
    "C. Guo",
    "B. Wang",
    "J. C. Liu",
    "Y. P. Zhang",
    "L. D. Lv",
    "L. P. Xiang",
    "C. G. Yang",
    "B. Xiao"
  ],
  "published": "2025-10-20T01:27:39Z",
  "updated": "2025-10-20T01:27:39Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}