{
  "arxiv_id": "2510.16936v1",
  "url": "https://arxiv.org/abs/2510.16936v1",
  "pdf_url": "https://arxiv.org/pdf/2510.16936v1.pdf",
  "title": "Ionization quenching factors and W-values of low-energy H_2^+ and He^+   ions in Ar gas at low pressure measured with a bulk resistive MICROMEGAS",
  "abstract": "The ionization quenching factor, the fraction of an ion's initial kinetic energy lost through ionization in a medium, was measured for H$_2^+$ and He$^+$ ions within the 2.5-5 keV energy range in an Ar/CO$_2$ gas mixture at pressures between 75 and 150 mbar. The mixture was contained in the active volume of a MICROMEGAS type Micro Pattern Gaseous Detector (MPGD), which was connected to an ion source via a high vacuum system. The results showed a significant decrease in ionization as the ion energy decreased, although no dependence on gas pressure was observed within the low pressure range studied. Additionally, significant deviations from the predictions of SRIM (Stopping and Range of Ions in Matter) simulations were found. These measurements also allowed the first determination of $W$ values (the average energy required to create an electron-ion pair in the gas) for H$_2^+$ and He$^+$ ions in Ar at this particular energy range, which had not been previously explored for these projectile-target combinations. These findings are essential for accurate ion energy reconstruction in low-pressure MPGDs, with particular relevance for space-based energetic neutral atom detection, as proposed by the Italian Space Agency's SWEATERS project.",
  "authors": [
    "A. Foresi",
    "G. Antonelli",
    "C. Avanzini",
    "G. Balestri",
    "G. Bigongiari",
    "E. Bossini",
    "M. G. Callaini",
    "R. Carosi",
    "E. De Angelis",
    "F. Frasconi",
    "P. Maestro",
    "F. Morsani",
    "A. Mura",
    "L. Orsini",
    "G. Petragnani",
    "F. Pilo",
    "R. Rispoli",
    "G. Terreni"
  ],
  "published": "2025-10-19T17:15:49Z",
  "updated": "2025-10-19T17:15:49Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.1016/j.nima.2025.171066"
}