{
  "arxiv_id": "2510.18182v1",
  "url": "https://arxiv.org/abs/2510.18182v1",
  "pdf_url": "https://arxiv.org/pdf/2510.18182v1.pdf",
  "title": "Electron Acceleration via Lower-Hybrid Drift Instability in   Astrophysical Plasmas: Dependence on Plasma Beta and Suprathermal Electron   Distributions",
  "abstract": "Density inhomogeneities are ubiquitous in space and astrophysical plasmas, particularly at magnetic reconnection sites, shock fronts, and within compressible turbulence. The gradients associated with these inhomogeneous plasma regions serve as free energy sources that can drive plasma instabilities, including the lower-hybrid drift instability (LHDI). Notably, lower-hybrid waves are frequently observed in magnetized space plasma environments, such as Earth's magnetotail and magnetopause. Previous studies have primarily focused on modeling particle acceleration via LHDI in these regions using a quasilinear approach. This study expands the investigation of LHDI to a broader range of environments, spanning weakly to strongly magnetized media, including interplanetary, interstellar, intergalactic, and intracluster plasmas. To explore the applicability of LHDI in various astrophysical settings, we employ two key parameters: (1) plasma magnetization, characterized by the plasma beta parameter, and (2) the spectral slope of suprathermal electrons following a power-law distribution. Using a quasilinear model, we determine the critical values of plasma beta and spectral slope that enable efficient electron acceleration via LHDI by comparing the rate of growth of instability and the damping rate of the resulting fluctuations. We further analyze the time evolution of the electron distribution function to confirm these critical conditions. Our results indicate that electron acceleration is generally most efficient in low-beta plasmas ($\\beta < 1$). However, the presence of suprathermal electrons significantly enhances electron acceleration via LHDI, even in high-beta plasmas ($\\beta > 1$). Finally, we discuss the astrophysical implications of our findings, highlighting the role of LHDI in electron acceleration across diverse plasma environments.",
  "authors": [
    "Ji-Hoon Ha",
    "Elena S. Volnova"
  ],
  "published": "2025-10-21T00:12:10Z",
  "updated": "2025-10-21T00:12:10Z",
  "categories": [
    "astro-ph.HE",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.HE"
}