{
  "arxiv_id": "2506.21141v2",
  "url": "https://arxiv.org/abs/2506.21141v2",
  "pdf_url": "https://arxiv.org/pdf/2506.21141v2.pdf",
  "title": "Enhancement of Mid-/High-Z Impurity Transport by Continuous Li-granule Dropping in a Stellarator Plasma",
  "abstract": "An enhancement of core impurity transport is observed in high-density plasmas of the stellarator LHD heated by neutral beam injection when continuous lithium (Li) granule dropping is performed. In the experiments reported here, in which the TESPEL is employed to inject trace amounts of titanium (Ti) and molybdenum (Mo) into the plasma core, confinement times for these impurities are seen to reduce significantly when Li dropping is applied, this reduction being more notable for Mo. In order to gain some initial insight into these observations, simulations are performed using the drift-kinetic transport code SFINCS for the Mo case. These simulations indicate that, while neoclassical transport prevails for the main plasma components (electrons, majority ions and low Z impurities), the classical contribution seems to be dominant for transporting Mo impurities. In summary, this work reports the first experimental observation of the degradation of mid-Z and high-Z impurity confinement induced by the continuous dropping of Li granules into a high-density stellarator plasma. In the case of the Mo impurity, simulations suggest that classical transport is the key mechanism underlying the enhanced impurity transport.",
  "authors": [
    "Daniel Medina-Roque",
    "Isabel García-Cortés",
    "Naoki Tamura",
    "Kieran J. McCarthy",
    "Federico Nespoli",
    "Kenji Tanaka",
    "Mamoru Shoji",
    "Suguru Masuzaki",
    "Hisamichi Funaba",
    "Chihiro Suzuki",
    "Albert Mollen",
    "Robert Lunsford",
    "Katsumi Ida",
    "Mikiro Yoshinuma",
    "Motoshi Goto",
    "Yasuko Kawamoto",
    "Tomoko Kawate",
    "Tokihiko Tokuzawa",
    "Ichihiro Yamada"
  ],
  "published": "2025-06-26T10:55:55Z",
  "updated": "2026-02-10T08:23:02Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}