{
  "arxiv_id": "2507.11755v4",
  "url": "https://arxiv.org/abs/2507.11755v4",
  "pdf_url": "https://arxiv.org/pdf/2507.11755v4.pdf",
  "title": "Kinetic renormalization of auroral turbulence",
  "abstract": "Driven-dissipative systems often exhibit self-organization in the form of coherent dissipative structures. However, observing such critical states in natural plasmas remains elusive, leading to the traditional view that the fine structure of Earth's auroral ionosphere is shaped by local turbulent flows. Here we report the discovery of a self-organizing regime in Earth's ionosphere. We identify this by modeling the sum of saturation electric fields in the turbulent auroral electrojets as a stochastic variable that renormalizes into noise-enabled transport, via explicitly derived Bohm diffusion. This constitutes an effective field-theory for Farley-Buneman turbulence in the Martin-Siggia-Rose formalism for renormalization group theory, for which we provide strong empirical evidence. Using a composite radar-GPS power spectrum of plasma turbulence, we resolve a scale-invariant cascade that exhibits a characteristic kinetic Alfvén $k^{-8/3}$-signature across four orders of magnitude in $k$. What is more, a large statistical analysis of how the turbulence responds to magnetospheric driving reveals a clear tendency for the observed number density of turbulent waves to scale linearly with driving power, matching the predictions made by our field theory's overdamped equations of motion, which offer closed-form calculations of macroscopic transport relations that are uniquely suitable for sub-grid parameterization in space weather modeling. This establishes geospace storms as opportunities to observe non-equilibrium phase transitions imposing global constraints on collision-dominated systems.",
  "authors": [
    "Magnus F Ivarsen",
    "Kaili Song",
    "Luca Spogli",
    "Jean-Pierre St-Maurice",
    "Brian Pitzel",
    "Saif Marei",
    "Devin R Huyghebaert",
    "Satoshi Kasahara",
    "Kunihiro Keika",
    "Yoshizumi Miyoshi",
    "Tomo Hori",
    "David R Themens",
    "Yoichi Kazama",
    "Shiang-Yu Wang",
    "Ayako Matsuoka",
    "Iku Shinohara",
    "Atsuki Shinbori",
    "Kazuhiro Yamamoto",
    "Takefumi Mitani",
    "Shoichiro Yokota",
    "P. T. Jayachandran",
    "Glenn C Hussey"
  ],
  "published": "2025-07-15T21:33:42Z",
  "updated": "2026-02-11T12:07:13Z",
  "categories": [
    "physics.space-ph",
    "nlin.AO",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.space-ph"
}