{
  "arxiv_id": "2512.04842v2",
  "url": "https://arxiv.org/abs/2512.04842v2",
  "pdf_url": "https://arxiv.org/pdf/2512.04842v2.pdf",
  "title": "Performance Optimization and Characterization of 7-pad Resistive PICOSEC Micromegas Detectors",
  "abstract": "We present a comprehensive characterization of resistive PICOSEC Micromegas detector prototypes, tested under identical conditions, constant drift gap, field configurations, and photocathode at the CERN SPS H4 beam line. This work provides a proof of concept for the use of resistive layer technology in gaseous timing detectors, demonstrating that robustness can be improved without compromising the excellent timing performance of PICOSEC Micromegas. Different resistive architectures and values were explored to optimize stability and ensure reliable long-term operation in challenging experimental environments. The prototype with a 10MΩ resistive layer achieved the best overall performance, with a timing resolution of 22.900 {\\pm} 0.002 ps and a spatial resolution of 1.190 {\\pm} 0.003 mm, while charge sharing across multiple pads enabled combined timing resolutions below 28 ps. A lower-resistivity (200kΩ) configuration exhibited enhanced charge spread, leading to minor systematic offsets in reconstructed pad centers, yet maintained robust timing and spatial performance. Capacitive charge-sharing architectures improved spatial resolution in some regions but suffered from signal attenuation and nonuniform charge distributions, resulting in slightly degraded timing (33.300 {\\pm} 0.002 ps) and complex localization patterns. Mechanical precision, particularly readout planarity and photocathode alignment, was identified as critical for uniform detector response. These studies benchmark the potential of resistive layers for gaseous timing detectors and provide a foundation for scalable designs with optimized timing and spatial resolution across diverse experimental applications.",
  "authors": [
    "A. Kallitsopoulou",
    "R. Aleksan",
    "S. Aune",
    "J. Bortfeldt",
    "F. Brunbauer",
    "M. Brunoldi",
    "J. Datta",
    "D. Desforge",
    "G. Fanourakis",
    "D. Fiorina",
    "K. J. Floethner",
    "M. Gallinaro",
    "F. Garcia",
    "I. Giomataris",
    "K. Gnanvo",
    "F. J. Iguaz",
    "D. Janssens",
    "F. Jeanneau",
    "M. Kovacic",
    "B. Kross",
    "P. Legou",
    "M. Lisowska",
    "J. Liu",
    "M. Lupberger",
    "I. Maniatis",
    "J. McKisson",
    "Y. Meng",
    "H. Muller",
    "E. Oliveri",
    "G. Orlandini",
    "A. Pandey",
    "T. Papaevangelou",
    "M. Pomorski",
    "E. Ferrer-Ribas",
    "L. Ropelewski",
    "D. Sampsonidis",
    "L. Scharenberg",
    "T. Schneider",
    "E. Scorsone",
    "L. Sohl",
    "M. van Stenis",
    "Y. Tsipolitis",
    "S. E. Tzamarias",
    "A. Utrobicic",
    "I. Vai",
    "R. Veenhof",
    "P. Vitulo",
    "X. Wang",
    "S. White",
    "W. Xi",
    "Z. Zhang",
    "Y. Zhou"
  ],
  "published": "2025-12-04T14:27:08Z",
  "updated": "2026-02-10T15:09:14Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}