{
  "arxiv_id": "2602.10681v1",
  "url": "https://arxiv.org/abs/2602.10681v1",
  "pdf_url": "https://arxiv.org/pdf/2602.10681v1.pdf",
  "title": "High-voltage generation system for a traveling-wave Stark decelerator",
  "abstract": "In this paper we describe the high-voltage generation system we have developed for a traveling-wave Stark decelerator (TWSD). The TWSD can reduce the forward velocity of a molecular beam of heavy neutral polar molecules such as strontium monofluoride (SrF) and barium monofluoride (BaF) from $\\sim$ 200 m/s down to $\\sim$ 6 m/s. The main motivation for the development of this device is the increased sensitivity from precision spectroscopy of the decelerated molecules to test fundamental physics. The high-voltage generation system can produce eight pulsed sinusoidal waveforms with a maximum amplitude of 10 kV and a linear frequency sweep from 16.7 kHz down to 500 Hz over the span of 40 ms at a repetition rate of 10 Hz. The eight waveforms are phase-offset to each other by 45 degrees. To slow down the heavy molecules, the decelerator is required to have a length of $\\sim$ 4 m, which results in a significant capacitive coupling between adjacent channels of $\\sim$ 160 pF. As a consequence, the control and stability of the waveforms is extra challenging. We designed a method that compensates for the frequency-dependent coupling between the eight channels. Allowing for amplitude and phase-offsets that do not deviate more than 1% and 2 degrees, respectively, from their design values during the frequency sweep. The system outperforms commercially available options in terms of stability, output voltage amplitude, cost and ease of maintenance. This approach is also relevant for other fields where precise control of high-voltage waveforms is required, such as particle accelerator physics, plasma physics and mass spectroscopy.",
  "authors": [
    "Lucas van Sloten",
    "Leo Huisman",
    "Steven Hoekstra"
  ],
  "published": "2026-02-11T09:32:47Z",
  "updated": "2026-02-11T09:32:47Z",
  "categories": [
    "physics.atom-ph",
    "physics.ins-det"
  ],
  "primary_category": "physics.atom-ph"
}