[
  {
    "arxiv_id": "2602.12090v1",
    "url": "https://arxiv.org/abs/2602.12090v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12090v1.pdf",
    "title": "Unconditional full vector magnetometry using spin selectivity in Nitrogen Vacancy centers in diamond",
    "abstract": "Quantum sensors based on nitrogen vacancy (NV) centers in diamond have been a central topic in the sensing community for more than a decade. The extraordinary properties at room temperature of the spin system in diamond have made it one of the most prominent quantum platforms for the development of commercial quantum sensors. In particular, the sensitivity of the electronic spin in NV centers has made diamond-based magnetic sensors of special interest for their potential application in medical, industrial or navigation solutions. However, the use of these sensors for universal vector magnetometry was constrained by the need for previous knowledge on the field being measured to fully exploit their benefits. In this work, we show a method to perform unconditional vector magnetometry without the need of external information on the magnetic field, based only on the spatial arrangement of the diamond and the microwave antenna combination. While previous NV-based vector magnetometry methods require partial knowledge of the magnetic field (e.g. a calibrated bias field), we exploit the possibilities of selecting particular directions of the spins in the diamond with elliptically polarized microwave fields. We prove that our method allows to estimate both magnitude and direction of external magnetic fields without further assumptions or constraints.",
    "authors": [
      "Asier Mongelos-Martinez",
      "Jason Tarunesh Francis",
      "Julia Bertero-DiTella",
      "Geza Giedke",
      "Gabriel Molina-Terriza",
      "Ruben Pellicer-Guridi"
    ],
    "published": "2026-02-12T15:42:31Z",
    "updated": "2026-02-12T15:42:31Z",
    "categories": [
      "quant-ph",
      "physics.app-ph",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2602.12086v1",
    "url": "https://arxiv.org/abs/2602.12086v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12086v1.pdf",
    "title": "Solvothermal vapor annealing and environmental control setup with adjustable magnetic field module for GISAXS studies",
    "abstract": "A compact, modular environmental control and solvothermal vapor annealing chamber designed for maintaining a controlled atmosphere with regard to solvent humidity and temperature is presented. The setup allows ex situ and in situ grazing incidence small-angle X-ray scattering (GISAXS) investigations of thin film self-assembly and reorganization. Its modular slotting system enables stable reconfiguration, including the integration of an adjustable magnetic field module. The temperature is maintained via a water-based heating and cooling loop supplemented by resistive elements, and the solvent vapor environment is regulated using a commercial controlled mixing and evaporation unit. The performance of the setup is validated through measurements of fill and quench times together with magnetic field mapping with Gauss meter measurements and finite element simulations. Further, the versatility of the setup is demonstrated with four research examples using the chamber for solvothermal vapor annealing of block copolymer thin films together with lab-based ex situ and in situ GISAXS measurements. The portable new design offers robust environmental control and flexibility for advanced thin film investigations both in the lab and at large scale facilities. The design can be adapted for grazing incidence small-angle neutron scattering, GISANS.",
    "authors": [
      "Christian Kjeldbjerg",
      "Bo Jakobsen",
      "Miriam Varón",
      "Kim Lefmann",
      "Cathrine Frandsen",
      "Dorthe Posselt"
    ],
    "published": "2026-02-12T15:40:38Z",
    "updated": "2026-02-12T15:40:38Z",
    "categories": [
      "cond-mat.soft",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.soft"
  },
  {
    "arxiv_id": "2602.12052v1",
    "url": "https://arxiv.org/abs/2602.12052v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12052v1.pdf",
    "title": "GPU-Accelerated Analytic Simulation of Sparse Signals in Pixelated Time Projection Detector",
    "abstract": "This paper presents a GPU-accelerated simulation package,   TRED, for next-generation neutrino detectors with pixelated   charge readout, leveraging community-driven software ecosystems to   ensure sustainability and extensibility. We introduce two generic   contributions: (i) an effective-charge calculation based on Gaussian   quadrature rules for numerical integration, and (ii) a sparse,   block-binned tensor representation that enables efficient FFT-based   computation of induced signals on readout electrodes for sparsely   activated detector volumes. The former captures sub-grid structure   without requiring dense sampling, while the latter achieves low   memory usage and scalable runtime, as demonstrated in benchmark   studies. The underlying data representation is applicable to   large-scale detectors and to other computational problems involving   sparse activity.",
    "authors": [
      "Yousen Zhang",
      "Brett Viren",
      "Mary Bishai",
      "Sergey Martynenko",
      "Xin Qian",
      "Rado Razakamiandra",
      "Brooke Russell"
    ],
    "published": "2026-02-12T15:17:57Z",
    "updated": "2026-02-12T15:17:57Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.11970v1",
    "url": "https://arxiv.org/abs/2602.11970v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11970v1.pdf",
    "title": "Tuning Optical Properties of FTO via Carbonaceous Al2O3 Microdot Deposition by DC plasma sputtering",
    "abstract": "Fluorine-doped tin oxide (FTO) is a key transparent conductive oxide for photovoltaic and optoelectronic devices, yet its high reflectance limits light-trapping efficiency. This work demonstrates a simple DC plasma sputtering approach to deposit carbonaceous Al2O3 microdots on FTO under controlled Ar, O2, and Ar-O2 atmospheres. For plasma discharge in the normal mode, with plasma density 10^-9 cm^-3 and temperature of 2 eV, Volmer-Weber growth produced discrete microdots whose size and distribution were tuned by gas composition: dense, uniform dots in Ar (approximately 0.89 um radius), agglomerated structures in O2, and intermediate morphologies in mixed atmospheres. Structural analysis confirmed gamma-Al2O3 formation with carbon incorporation, while SEM revealed morphology-driven optical behavior. UV-Vis measurements showed that Ar-O2 coatings achieved the lowest reflectance across the visible range, outperforming bare FTO and other conditions. These findings establish a clear link between sputtering parameters, surface morphology, and optical performance, offering a scalable route to anti-reflective, light-trapping coatings for next-generation solar cells and optoelectronic devices.",
    "authors": [
      "Sarah Salah",
      "Ahmed Atlam",
      "Nagat Elkahwagy",
      "Abdelhamid Elshaer",
      "Mohammed Shihab"
    ],
    "published": "2026-02-12T14:02:41Z",
    "updated": "2026-02-12T14:02:41Z",
    "categories": [
      "physics.plasm-ph",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.11952v1",
    "url": "https://arxiv.org/abs/2602.11952v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11952v1.pdf",
    "title": "Intrabeam Scattering",
    "abstract": "Intrabeam scattering refers to the effects of the Coulomb interaction acting between pairs of charged particles within a bunch in an accelerator. One of the main consequences of intrabeam scattering is a change in the emittances of a bunch: in some circumstances (in particular, in hadron storage rings operating above transition), the transverse and longitudinal emittances may grow over time without limit. This may restrict the performance of machines for which maintaining low beam emittance is an important requirement. In this note, we describe some of the models used to analyse the effects of intrabeam scattering, and present in particular the Piwinski formulae for the emittance growth rates. We compare the predicted changes in emittance with measurements in a number of machines operating in different parameter regimes.",
    "authors": [
      "Andrzej Wolski"
    ],
    "published": "2026-02-12T13:47:22Z",
    "updated": "2026-02-12T13:47:22Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.11884v1",
    "url": "https://arxiv.org/abs/2602.11884v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11884v1.pdf",
    "title": "Signatures of Damping Nonlinear Oscillations by KHI-induced Turbulence in Synthetic Observations",
    "abstract": "Large-amplitude decaying kink oscillations of coronal loops are strongly influenced by nonlinear processes, such as Kelvin-Helmholtz instability (KHI) and turbulence, though comprehensive theory and observational confirmation remain limited. Building on the recently developed theory on nonlinear damping by KHI-induced turbulence in impulsively driven transverse loop oscillations, we investigate its observational signatures using 3D magnetohydrodynamic simulations and forward-modelled EUV images. The simulated oscillations exhibit time-varying frequency shifts and damping rates, which are broadly consistent with nonlinear turbulence-damping theory. Additionally, they exhibit excitation of higher-order modes, slightly increased periods relative to the linear kink period, and reduced displacement amplitudes. These features are generally preserved in synthetic observations, though resolving higher-order modes requires higher spatial resolution than currently available. For loops embedded in a hotter background, hotter channels (e.g., 193 Angstroms) are more sensitive to boundary dynamics, thus their oscillations decay faster with smaller displacements and larger phase shifts than those in cooler channels (e.g., 171 Angstroms). Comparisons of simulated and synthetic oscillations show close agreement at the early stage. At later times, synthetic oscillations exhibit smaller displacements and larger phase shifts, due to turbulence-induced asymmetry in the loop cross-section. Bayesian fitting shows that the initial oscillation amplitude and kink period are robustly constrained, whereas parameters controlling the damping profile are degenerate, indicating that additional observables would aid reliable seismological inference. These results provide a quantitative basis for identifying nonlinear damping and detecting KHI-driven turbulence in transverse loop oscillations.",
    "authors": [
      "Sihui Zhong",
      "Andrew Hillier",
      "Iñigo Arregui"
    ],
    "published": "2026-02-12T12:34:14Z",
    "updated": "2026-02-12T12:34:14Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR",
    "doi": "10.3847/1538-4357/ae4223"
  },
  {
    "arxiv_id": "2602.10132v2",
    "url": "https://arxiv.org/abs/2602.10132v2",
    "pdf_url": "https://arxiv.org/pdf/2602.10132v2.pdf",
    "title": "TokaMark: A Comprehensive Benchmark for MAST Tokamak Plasma Models",
    "abstract": "Development and operation of commercially viable fusion energy reactors such as tokamaks require accurate predictions of plasma dynamics from sparse, noisy, and incomplete sensors readings. The complexity of the underlying physics and the heterogeneity of experimental data pose formidable challenges for conventional numerical methods, while simultaneously highlight the promise of modern data-native AI approaches. A major obstacle in realizing this potential is, however, the lack of curated, openly available datasets and standardized benchmarks. Existing fusion datasets are scarce, fragmented across institutions, facility-specific, and inconsistently annotated, which limits reproducibility and prevents a fair and scalable comparison of AI approaches. In this paper, we introduce TokaMark, a structured benchmark to evaluate AI models on real experimental data collected from the Mega Ampere Spherical Tokamak (MAST). TokaMark provides a comprehensive suite of tools designed to (i) unify access to multi-modal heterogeneous fusion data, and (ii) harmonize formats, metadata, temporal alignment and evaluation protocols to enable consistent cross-model and cross-task comparisons. The benchmark includes a curated list of 14 tasks spanning a range of physical mechanisms, exploiting a variety of diagnostics and covering multiple operational use cases. A baseline model is provided to facilitate transparent comparison and validation within a unified framework. By establishing a unified benchmark for both the fusion and AI-for-science communities, TokaMark aims to accelerate progress in data-driven AI-based plasma modeling, contributing to the broader goal of achieving sustainable and stable fusion energy. The benchmark, documentation, and tooling will be fully open sourced upon acceptance to encourage community adoption and contribution.",
    "authors": [
      "Cécile Rousseau",
      "Samuel Jackson",
      "Rodrigo H. Ordonez-Hurtado",
      "Nicola C. Amorisco",
      "Tobia Boschi",
      "George K. Holt",
      "Andrea Loreti",
      "Eszter Székely",
      "Alexander Whittle",
      "Adriano Agnello",
      "Stanislas Pamela",
      "Alessandra Pascale",
      "Robert Akers",
      "Juan Bernabe Moreno",
      "Sue Thorne",
      "Mykhaylo Zayats"
    ],
    "published": "2026-02-05T16:49:44Z",
    "updated": "2026-02-12T09:55:27Z",
    "categories": [
      "physics.plasm-ph",
      "cs.AI"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.11763v1",
    "url": "https://arxiv.org/abs/2602.11763v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11763v1.pdf",
    "title": "Phase-Space Topology and Spectral Flow in Screened Magnetized Plasmas",
    "abstract": "Topological wave phenomena in continuous media are fundamentally challenged by unbounded spectra and the absence of a compact Brillouin zone, which obstruct conventional bulk--interface formulations. We develop a unified phase-space framework for screened magnetized plasma based on a pseudo-Hermitian formulation with a positive-definite metric, enabling a generalized Schrödinger description and a Weyl-symbol analysis of the bulk generator. We show that the bulk symbol hosts isolated band degeneracies acting as Berry--Chern monopoles, including a higher-order spin-1 degeneracy with topological charge $+2$ that generically splits into two spin-$\\tfrac{1}{2}$ Weyl points under symmetry breaking. To characterize topology in this noncompact setting, we introduce a strip-gap Chern number associated with finite real-frequency strips of the bulk spectrum, extending band Chern topology to continuum systems. This invariant governs the spectral flow of interface modes induced by spatial variations of the magnetic field and establishes a bulk--interface correspondence at the level of phase-space symbols. By solving the interface eigenvalue problem, we demonstrate that the net spectral flow across the strip gap is determined by the enclosed monopole charge. We further show that this correspondence persists under collisional damping, provided that a finite strip gap remains and no exceptional points enter it. Our results provide a systematic phase-space framework for topological wave transport in continuous media beyond compact-band and idealized Hermitian settings.",
    "authors": [
      "Xianhao Rao",
      "Adil Yolbarsop",
      "Hong Li",
      "Wandong Liu"
    ],
    "published": "2026-02-12T09:43:30Z",
    "updated": "2026-02-12T09:43:30Z",
    "categories": [
      "cond-mat.mes-hall",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.mes-hall"
  },
  {
    "arxiv_id": "2507.15323v2",
    "url": "https://arxiv.org/abs/2507.15323v2",
    "pdf_url": "https://arxiv.org/pdf/2507.15323v2.pdf",
    "title": "Improving terahertz-detection sensitivity of 8x8 FET arrays through liquid-nitrogen cooling in a compact low-noise cryostat",
    "abstract": "We show that the sensitivity of antenna-coupled field-effect transistors (FETs) to terahertz (THz) radiation improves continuously with decreasing temperature. The noise-equivalent power (NEP) of 540 GHz patch-antenna-coupled FETs decreases as temperature reduces to 20 K. We project NEP values approaching 1 to 2 pW/sqrt(Hz) under efficient power coupling conditions (e.g., using a superstrate Si-lens), which is comparable to superconducting niobium transition-edge sensors (TESs) at 4 K. Building on these findings, a compact, low-noise, liquid-nitrogen-cooled (77 K) FET-based direct (incoherent) THz-power sensing system} for spectroscopy applications was realized. Here, an 8x8 pixel-binned detector array fabricated in a commercial 65-nm Si-CMOS process, was optimized for operation in the 2.85 to 3.4 THz band. Characterization was performed in the focal plane of a 2.85-THz quantum-cascade laser delivering approx. 2~mW of THz power. A linear dynamic range exceeding 67 dB was achieved without saturation (for 1~Hz-detection bandwidth). The system provides a -3 dB readout bandwidth of 5 MHz, exceeding that of conventional thermal detectors (typically 1 kHz). Combined with its broad temperature operability 20 K to 300 K and compact design, the system is particularly well suited for space- and payload-constrained platforms such as balloon- and satellite-based missions, where deep cryogenic cooling is impractical.",
    "authors": [
      "Jakob Holstein",
      "Nicholas K. North",
      "Arne Hof",
      "Sanchit Kondawar",
      "Dmytro B. But",
      "Mohammed Salih",
      "Lianhe Li",
      "Edmund H. Linfield",
      "A. Giles Davies",
      "Joshua R. Freeman",
      "Alexander Valavanis",
      "Alvydas Lisauskas",
      "Hartmut G. Roskos"
    ],
    "published": "2025-07-21T07:29:06Z",
    "updated": "2026-02-12T09:15:18Z",
    "categories": [
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.app-ph"
  },
  {
    "arxiv_id": "2602.11728v1",
    "url": "https://arxiv.org/abs/2602.11728v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11728v1.pdf",
    "title": "Beyond One-Thousandth Energy Resolution with an AlMn TES Detector",
    "abstract": "The superconducting Transition-Edge Sensor (TES) is a critical technology for next-generation X-ray spectrometers, known for its exceptional energy resolution. In the last decade, TESs based on AlMn alloy films have been extensively used in several cosmic microwave background (CMB) experiments. The advantages of simple fabrication process and easily tunable critical temperature make them an alternative to bilayer TESs. However, they have rarely been applied to X-ray detection until now. We developed an annular AlMn TES for X-ray detection and tested it in a dilution refrigerator with a Superconducting Quantum Interference Device (SQUID) amplifier, achieving an Full Width at Half Maximum (FWHM) of 12.1 +- 0.3 eV at 17.48 keV. To the best of our knowledge, this is the first demonstration of an AlMn TES achieving an energy resolution below 0.1%, highlighting its potential for high-resolution X-ray detection.",
    "authors": [
      "Liangpeng Xie",
      "Yifei Zhang",
      "Zhengwei Li",
      "Zhouhui Liu",
      "Shibo Shu",
      "Junjie Zhou",
      "Xufang Li",
      "Haoyu Li",
      "He Gao",
      "Yudong Gu",
      "Xuefeng Lu",
      "Yong Zhao",
      "Congzhan Liu"
    ],
    "published": "2026-02-12T08:52:29Z",
    "updated": "2026-02-12T08:52:29Z",
    "categories": [
      "astro-ph.IM",
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2601.19865v2",
    "url": "https://arxiv.org/abs/2601.19865v2",
    "pdf_url": "https://arxiv.org/pdf/2601.19865v2.pdf",
    "title": "Laboratory Tests of Laser Control of Electron Beams for Future Colliders",
    "abstract": "Laser-driven Compton backscattering (CBS) has been proposed as method for controlling the intensity of colliding bunches in the FCC-ee so as to avoid the flip-flop instability caused by intensity asymmetry in colliding bunches. Laser-based collimation has also been proposed as an indestructible collimator for high-intensity electron beams. We have initiated a laboratory-based test program of these concepts with the E344 experiment at FACET-II. In this paper, we describe simulations of laser-beam interactions at FACET-II and the relevant scaling for FCC-ee. We also describe the experimental setup and diagnostics that will be used to make the measurements at FACET-II.",
    "authors": [
      "Claire Munting",
      "Peter Kicsiny",
      "Edoardo Barbi",
      "Noe Gonzalez",
      "Spencer Gessner",
      "Illya Drebot"
    ],
    "published": "2026-01-27T18:23:38Z",
    "updated": "2026-02-12T07:11:24Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.11597v1",
    "url": "https://arxiv.org/abs/2602.11597v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11597v1.pdf",
    "title": "Performance and pulse shape discrimination of glass scintillator SG101 for neutron detection",
    "abstract": "We present a detailed characterization of the thermal neutron sensitive transparent glass scintillator SG101, benchmarked against the conventional LiF ZnS(Ag)based scintillator EJ426. The detection efficiency, energy resolution, and pulse shape discrimination (PSD) performance ofSG101 were evaluated under AmBe neutron irradiation. When coupled with organic scintillators(EJ200 or EJ276),the SG101 EJ200 system achieves a figure of merit (FOM) of 3.81 for thermal neutron/gamma separation, while the SG101 EJ276 configuration resolves three distinct particle populations gamma rays, fast neutrons, and thermal neutrons with FOM values of 3.46 and2.21, respectively. Correlation analysis reveals that the number of fast thermal neutron coincidence events significantly exceeds the accidental background, and the count of gamma fast thermal neutron triple-coincidence events is also far higher than the expected accidental rate, confirming significant physical correlations for both event types within a 100 us time window. These results demonstrate that SG101 is a promising candidate for applications requiring high-efficiency thermal neutron detection and precise event tagging coupling with a scintillator with PSD approach",
    "authors": [
      "Yuhang Liu",
      "Fengpeng An",
      "Guang Luo",
      "Wei Wang",
      "Wei Wei",
      "Xuesong Zhang",
      "Dixiao Lu",
      "Xiaohao Yin"
    ],
    "published": "2026-02-12T05:28:06Z",
    "updated": "2026-02-12T05:28:06Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2505.11361v4",
    "url": "https://arxiv.org/abs/2505.11361v4",
    "pdf_url": "https://arxiv.org/pdf/2505.11361v4.pdf",
    "title": "Magnetic dipole-dipole transition for scintillation quenching",
    "abstract": "A magnetic dipole-dipole interaction is proposed as a scintillation quenching mechanism. The interaction rate follows $R^{-6}$ as the electric dipole-dipole interaction in F$\\mathrm{\\ddot{o}}$ster resonance energy transfer theory. The proposed mechanism causes a long-range resonance energy transfer, and the resonance condition is that the spins of donor and acceptor electrons both flip, and the energy level differences are the same. The new mechanism is distinct to the known spin-orbit coupling induced intersystem crossing, and it can enhance the overall intersystem crossing rate. When oxygen or organic molecules including heavy elements are dissolved in a liquid scintillator, these requirements are possible to be satisfied. The proposal in the paper adds a new approach for scintillation quenching in liquid scintillators.",
    "authors": [
      "Zhe Wang"
    ],
    "published": "2025-05-16T15:28:56Z",
    "updated": "2026-02-12T02:15:11Z",
    "categories": [
      "physics.ins-det",
      "physics.chem-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.11422v1",
    "url": "https://arxiv.org/abs/2602.11422v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11422v1.pdf",
    "title": "Investigation of Toroidal Rotation Effects on Spherical Torus Equilibria using the Fast Spectral Solver VEQ-R",
    "abstract": "Standard reduced models often fail to adequately describe the complex geometric response of tokamak plasmas to strong toroidal rotation. In this work, we present VEQ-R, a computationally efficient spectral solver designed to calculate fixed-boundary equilibria with arbitrary toroidal flow. In contrast to computationally intensive grid-based codes, our model employs a 12-parameter shifted Chebyshev spectral expansion to explicitly resolve radial variations in high-order shaping profiles--such as dynamic elongation and triangularity. This capability allows the solver to accurately capture differential flux surface distortions (non-rigid effects) even in challenging sonic regimes ($M \\sim 1.0$). By synergizing this compact variational formulation with a novel ``Matrix-Kernel'' acceleration technique, we transform the problem into pre-computed algebraic matrix operations. This approach achieves convergence in approximately 5 ms, maintaining exceptional geometric fidelity compared to high-resolution benchmarks while balancing speed and accuracy. Our analysis reveals that rotation-induced flux compression leads to a monotonic decrease in the core safety factor $q_0$, pushing it dangerously close to unity--a structural deformation mechanism effectively captured by this approximate yet robust solver.",
    "authors": [
      "Xingyu Li",
      "Huasheng Xie",
      "Lai Wei",
      "Zhengxiong Wang"
    ],
    "published": "2026-02-11T22:50:25Z",
    "updated": "2026-02-11T22:50:25Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.11415v1",
    "url": "https://arxiv.org/abs/2602.11415v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11415v1.pdf",
    "title": "Fermilab PIP II machine protection system digitized data noise elimination scheme and its FPGA implementation",
    "abstract": "In Fermilab's PIP-II machine protection system, beam loss signals from various detectors are digitized at 125 MS/s. Noise from both high-frequency sources and low-frequency 60 Hz AC power equipment can contaminate the data. To suppress noise across these ranges especially 60 Hz and its harmonics, which overlap with beam loss signal frequencies advanced digital processing beyond standard filtering is required. Several real-time functional blocks were simulated and tested on an FPGA: (1) a dual time-constant discharging integrator filter, (2) a de-ripple baseline extraction and storage block, and (3) a fast-recovery discharging integrator. The nonlinear IIR integrator filter removes high-frequency noise and feeds into the baseline extractor. Upon detecting abrupt beam loss, it switches to a longer time constant to prevent baseline distortion. The de-ripple block calculates a valid baseline by averaging over multiple 60 Hz periods, storing results in a 4096-word FPGA RAM. This baseline is subtracted from raw data before integration by the fast-recovery block, which resets quickly after use. All blocks achieved expected performance.",
    "authors": [
      "J. Wu",
      "A. Warner"
    ],
    "published": "2026-02-11T22:36:36Z",
    "updated": "2026-02-11T22:36:36Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "0.18429/JACoW-IBIC2025-MOPMO45"
  },
  {
    "arxiv_id": "2602.11375v1",
    "url": "https://arxiv.org/abs/2602.11375v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11375v1.pdf",
    "title": "Using a 4-megapixel hybrid photon counting detector for fast, lab-based nanoscale x-ray tomography",
    "abstract": "Hybrid photon counting detectors (HPCDs) have unlocked new capabilities for x-ray-based measurements at synchrotrons around the world in the last 30 years. By leveraging independently optimized sensor and readout layers, they offer high quantum efficiency ($> 80 \\%$), ultra-low dark counts, sub-pixel point-spread function, and high count rates ($> 10^{6}$ counts per pixel per second). Furthermore, their small pixel size and large active area endow them with excellent coverage and resolution for both real-space and reciprocal space imaging. Here, we demonstrate that HPCDs are also well-suited for laboratory-based nanoscale x-ray tomography (nano-xCT). We perform nano-xCT on an integrated circuit fabricated at the 130-nm node and produce a 3D reconstruction with 40 times more photons collected 20 times faster than in this group's previous work, for an overall speedup of 800$\\times$. We review the technical considerations of using an HPCD for tabletop tomography. We quantify our reconstruction image quality using well-established metrics, including the modulation transfer function (MTF), Fourier shell correlation (FSC), and contrast-to-noise (CNR), to validate our choice of experimental parameters that provide sufficient resolution and imaging speed. Using these metrics, we determine that even under current experimental conditions, 160 nm wiring features are reconstructed at 75-80 nm spatial resolution.",
    "authors": [
      "Jordan Fonseca",
      "Zachary H. Levine",
      "Joseph W. Fowler",
      "Felix H. Kim",
      "Galen O'Neil",
      "Nathan J. Ortiz",
      "John Henry Scott",
      "Daniel S. Swetz",
      "Paul Szypryt",
      "Andras E. Vladar",
      "Nathan Nakamura"
    ],
    "published": "2026-02-11T21:08:40Z",
    "updated": "2026-02-11T21:08:40Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.11359v1",
    "url": "https://arxiv.org/abs/2602.11359v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11359v1.pdf",
    "title": "High-level hadronic tau lepton triggers of the CMS experiment in proton-proton collisions at $\\sqrt{s}$ = 13.6 TeV",
    "abstract": "The trigger system of the CMS detector is pivotal in the acquisition of data for physics measurements and searches. Studies of final states characterized by hadronic decays of tau leptons require the reconstruction and the identification of genuine tau leptons against quark- and gluon-initiated jets at the trigger level. This is a difficult task, particularly as improvements to the LHC have resulted in an increased number of interactions per bunch crossing in recent years. To address this challenge, a series of machine-learning algorithms with high identification efficiency and low computational cost have been incorporated into the high-level trigger for hadronically decaying tau leptons. In this paper, these developments and the trigger performance are summarized using data collected by the CMS experiment in proton-proton collisions at $\\sqrt{s}$ = 13.6 TeV in 2022$-$2023, corresponding to an integrated luminosity of 62 fb$^{-1}$.",
    "authors": [
      "CMS Collaboration"
    ],
    "published": "2026-02-11T20:46:53Z",
    "updated": "2026-02-11T20:46:53Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.07224v2",
    "url": "https://arxiv.org/abs/2510.07224v2",
    "pdf_url": "https://arxiv.org/pdf/2510.07224v2.pdf",
    "title": "Sextupole reduction via chaos suppression at the National Synchrotron Light Source II",
    "abstract": "We revisit the nonlinear lattice design approach for the National Synchrotron Light Source II (NSLS-II) storage ring. By suppressing chaos, we identify alternative sextupole configurations to the original design, which relied on the conventional strategy of simultaneously minimizing Resonance Driving Terms (RDT) and Amplitude-Dependent Detuning (ADD). These alternatives achieve comparable performance while requiring fewer sextupoles. A detailed comparison of two representative solutions is presented and supported by experimental validation. Our results show that the dynamic aperture correlates more strongly with global chaos than with individual RDTs, and that the importance of minimizing ADD may have been overstated in earlier design strategies.",
    "authors": [
      "Yongjun Li",
      "Minghao Song",
      "Yoshiteru Hidaka",
      "Victor Smaluk",
      "Timur Shaftan"
    ],
    "published": "2025-10-08T16:57:36Z",
    "updated": "2026-02-11T20:13:43Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.04580v2",
    "url": "https://arxiv.org/abs/2602.04580v2",
    "pdf_url": "https://arxiv.org/pdf/2602.04580v2.pdf",
    "title": "Doberman: a modular and distributed slow control system for small- to medium-scale experiments",
    "abstract": "We present Doberman (Detector OBsERving and Monitoring ApplicatioN), a lightweight, modular, and open-source slow control system designed for small-to medium-scale physics experiments. Doberman addresses the gap between heavyweight industrial SCADA frameworks and ad hoc laboratory solutions by providing a flexible software architecture that supports heterogeneous instrumentation, distributed deployment, automated control, and robust alarm handling. The web-based graphical user interface Doberview provides live and continuously updated visualization, configuration, and control of the entire experiment, supporting both routine operation and rapid response to exceptional conditions. Doberman has been deployed and validated in multiple experimental setups, ranging from a remotely operated underground gamma-ray spectrometer to a large, highly instrumented liquid xenon test facility with several hundred monitored quantities.   Doberman and Doberview are released under permissive open-source licenses, and the software, documentation, and example device integrations are publicly available.",
    "authors": [
      "Jaron Grigat",
      "Darryl Masson",
      "Marc Schumann"
    ],
    "published": "2026-02-04T14:06:28Z",
    "updated": "2026-02-11T17:46:09Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.11053v1",
    "url": "https://arxiv.org/abs/2602.11053v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11053v1.pdf",
    "title": "Collisionless relaxation as the origin of the anisotropic, non-thermal, and multi-temperature momentum distributions observed in space plasmas",
    "abstract": "Anisotropic, non-thermal, and multi-temperature distributed particle momenta are commonly observed in collisionless space plasmas, such as the solar wind. Using Liouville's theorem, we argue that anisotropic compression or expansion of the plasma, followed by a relaxation of the resulting anisotropic stress must lead to non-equilibrium states that are either anisotropic, non-thermal distribution functions, different electron and ion temperatures, or a combination of these effects. We present arguments showing that a plasma in thermal equilibrium undergoing anisotropic compression or expansion cannot return to thermal equilibrium in the absence of particle collisions. Since most astrophysical plasmas are practically collisionless and experience significant anisotropic compression or expansion, we expect anisotropic, non-thermal, and multi-temperature particle distributions to be ubiquitous, in agreement with solar wind measurements.",
    "authors": [
      "Torsten Enßlin",
      "Christoph Pfrommer"
    ],
    "published": "2026-02-11T17:20:13Z",
    "updated": "2026-02-11T17:20:13Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.11228v1",
    "url": "https://arxiv.org/abs/2602.11228v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11228v1.pdf",
    "title": "Rotation catalyzed chiral magnetovortical instability",
    "abstract": "We demonstrate that a background rotation significantly catalyzes the chiral magnetovortical instability in chiral magnetohydrodynamics. The rotation splits the linearly polarized Alfven wave into two circularly polarized magneto-Coriolis waves, one of which exhibits a lower frequency than the original Alfven wave. We find that this low-frequency magneto-Coriolis wave is always unstable in the presence of even a weak chiral vortical effect. This instability may enable new dynamo mechanism applicable to various rotating chiral plasmas.",
    "authors": [
      "Shuai Wang",
      "Xu-Guang Huang"
    ],
    "published": "2026-02-11T14:19:31Z",
    "updated": "2026-02-11T14:19:31Z",
    "categories": [
      "nucl-th",
      "astro-ph.HE",
      "hep-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "nucl-th"
  },
  {
    "arxiv_id": "2602.10836v1",
    "url": "https://arxiv.org/abs/2602.10836v1",
    "pdf_url": "https://arxiv.org/pdf/2602.10836v1.pdf",
    "title": "Charged particle motion in a strong magnetic field: The first order expansion",
    "abstract": "We provide a mathematically rigorous derivation of the first order expansion of the motion of a charged particle in a strong magnetic field. In contrast to the derivations that can be found in the physics literature we solely assume throughout that the magnetic field is strong. In particular we do not need to make any structural assumptions on the particle motion, such as the gyroradius being small in comparison to the magnetic length scale. Instead, some of the additional assumptions which are usually made in the physics literature turn out to be an a posteriori consequence in our approach. Our approach further justifies the utilisation of the guiding centre approximation at \"bounce points\" within magnetic mirrors, a situation which violates the usual assumptions which are made in the physics literature when deriving the guiding centre approximation.",
    "authors": [
      "Ugo Boscain",
      "Wadim Gerner"
    ],
    "published": "2026-02-11T13:22:08Z",
    "updated": "2026-02-11T13:22:08Z",
    "categories": [
      "math-ph",
      "math.CA",
      "physics.plasm-ph"
    ],
    "primary_category": "math-ph"
  },
  {
    "arxiv_id": "2602.10828v1",
    "url": "https://arxiv.org/abs/2602.10828v1",
    "pdf_url": "https://arxiv.org/pdf/2602.10828v1.pdf",
    "title": "A Helical-Deflector-Based Radio-Frequency Spiral Scanning System for keV Energy Electrons",
    "abstract": "We present the design, modeling, and experimental validation of a radio-frequency based time-to-position conversion system for keV electrons incorporating a helical deflector operating in the 400-1000 MHz range. The device performs circular deflection of the electrons when driven by a single RF frequency and enables spiral scanning when two phase-locked RF voltages with slightly different frequencies are applied. The superposition of the two phase-locked RF voltages produces an amplitude-beating field whose slowly varying envelope modulates the deflection radius, transforming the circular scan into a controlled spiral on the detector plane. A detailed theoretical model describing the electron dynamics under two phase-locked RF voltages with different frequencies was derived, yielding analytical expressions for the transverse velocity and radius-vector components at the deflector exit. Spiral scanning will allow measurements with picosecond resolution in a time range 1-2 orders of magnitude larger than the period of the circular scanning.",
    "authors": [
      "Vanik Kakoyan",
      "Simon Zhamkochyan",
      "Vardan Bardakhchyan",
      "Sergey Abrahamyan",
      "Amur Margaryan",
      "Aram Kakoyan",
      "Hasmik Rostomyan",
      "Anna Safaryan",
      "Gagik Sughyan",
      "Hayk Gevorgyan",
      "Artashes Papyan",
      "Martin Pinamyan",
      "Mikael Ivanyan",
      "Satoshi N. Nakamura",
      "John Annand",
      "Kenneth Livingston",
      "Rachel Montgomery",
      "Patrick Achenbach",
      "Josef Pochodzalla",
      "Dimiter L. Balabanski",
      "Ani Aprahamian",
      "Viatcheslav Sharyy",
      "Dominique Yvon",
      "Hayk Elbakyan"
    ],
    "published": "2026-02-11T13:15:07Z",
    "updated": "2026-02-11T13:15:07Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.08313v2",
    "url": "https://arxiv.org/abs/2601.08313v2",
    "pdf_url": "https://arxiv.org/pdf/2601.08313v2.pdf",
    "title": "Interstellar Medium Modulation of Nonlinear Kinetic Alfvén Morphology in Structured Galactic Environments",
    "abstract": "We present a spatially dependent framework for the existence and propagation of nonlinear kinetic Alfvén (KA) structures in the interstellar medium (ISM). Using a multi-component analytical model that incorporates the diffuse warm ionized medium together with localized H II regions, supernova remnants (SNR), and stellar-wind bubbles (SWB), we derive location-dependent coefficients governing KA dispersion and nonlinearity. The reductive perturbation method is applied to obtain Korteweg-de Vries (KdV) equations, enabling the characterization of solitons under realistic astrophysical conditions. Numerical analysis demonstrates how superthermality, plasma $β$, temperature, and density gradients modulate soliton amplitude, width, and stability. Our results reveal distinct exclusion zones (EZs) for KA solitons in high-$β$ HII regions and SWB/SNR interiors, as well as ultra low-$β$ regions near central pulsar wind nebulae. While H II regions exhibit simple Gaussian-driven depletions, the complex ``hole-and-shell\" morphologies of SWBs and SNRs imprint sharp spatial variations and discontinuities on soliton properties. This study establishes a direct link between macroscopic ISM morphology, ion-kinetic scale dissipation, and the emergence of coherent Alfvénic activity, with implications for radio scattering, pulsar scintillation, and fine-scale signatures in astrophysical observations.",
    "authors": [
      "Manpreet Singh",
      "Siming Liu",
      "N. S. Saini"
    ],
    "published": "2026-01-13T08:10:48Z",
    "updated": "2026-02-11T12:29:55Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.11755v4",
    "url": "https://arxiv.org/abs/2507.11755v4",
    "pdf_url": "https://arxiv.org/pdf/2507.11755v4.pdf",
    "title": "Kinetic renormalization of auroral turbulence",
    "abstract": "Driven-dissipative systems often exhibit self-organization in the form of coherent dissipative structures. However, observing such critical states in natural plasmas remains elusive, leading to the traditional view that the fine structure of Earth's auroral ionosphere is shaped by local turbulent flows. Here we report the discovery of a self-organizing regime in Earth's ionosphere. We identify this by modeling the sum of saturation electric fields in the turbulent auroral electrojets as a stochastic variable that renormalizes into noise-enabled transport, via explicitly derived Bohm diffusion. This constitutes an effective field-theory for Farley-Buneman turbulence in the Martin-Siggia-Rose formalism for renormalization group theory, for which we provide strong empirical evidence. Using a composite radar-GPS power spectrum of plasma turbulence, we resolve a scale-invariant cascade that exhibits a characteristic kinetic Alfvén $k^{-8/3}$-signature across four orders of magnitude in $k$. What is more, a large statistical analysis of how the turbulence responds to magnetospheric driving reveals a clear tendency for the observed number density of turbulent waves to scale linearly with driving power, matching the predictions made by our field theory's overdamped equations of motion, which offer closed-form calculations of macroscopic transport relations that are uniquely suitable for sub-grid parameterization in space weather modeling. This establishes geospace storms as opportunities to observe non-equilibrium phase transitions imposing global constraints on collision-dominated systems.",
    "authors": [
      "Magnus F Ivarsen",
      "Kaili Song",
      "Luca Spogli",
      "Jean-Pierre St-Maurice",
      "Brian Pitzel",
      "Saif Marei",
      "Devin R Huyghebaert",
      "Satoshi Kasahara",
      "Kunihiro Keika",
      "Yoshizumi Miyoshi",
      "Tomo Hori",
      "David R Themens",
      "Yoichi Kazama",
      "Shiang-Yu Wang",
      "Ayako Matsuoka",
      "Iku Shinohara",
      "Atsuki Shinbori",
      "Kazuhiro Yamamoto",
      "Takefumi Mitani",
      "Shoichiro Yokota",
      "P. T. Jayachandran",
      "Glenn C Hussey"
    ],
    "published": "2025-07-15T21:33:42Z",
    "updated": "2026-02-11T12:07:13Z",
    "categories": [
      "physics.space-ph",
      "nlin.AO",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2602.10759v1",
    "url": "https://arxiv.org/abs/2602.10759v1",
    "pdf_url": "https://arxiv.org/pdf/2602.10759v1.pdf",
    "title": "Application of a high-precision distributed uranium source for determining the effective mass and volume of a HPGe detector",
    "abstract": "A distributed uranium source with the accurately certified activity of 238U has been used to verify the effective mass of the HPGe detector intended for the νGeN neutrino experiment. The source, dissolved in nitric acid, provides homogeneous irradiation of the detector crystal allowing the study of its mass and volume. The experimental spectra obtained with the distributed source have been compared to the detailed Geant4 Monte Carlo simulations. The measured counting rates of several gamma-lines agree with the simulated efficiencies, confirming that the detector mass and volume coincide with the manufacturer specifications. The results demonstrate the applicability of such sources for mass calibration of HPGe detectors.",
    "authors": [
      "A. S. Barabash",
      "S. Evseev",
      "D. Filosofov",
      "V. Kazalov",
      "T. Khussainov",
      "A. Lubashevskiy",
      "N. D. Mokhine",
      "D. Ponomarev",
      "S. Rozov",
      "S. Vasilyev",
      "M. Vorobyeva",
      "E. Yakushev",
      "V. I. Yumatov"
    ],
    "published": "2026-02-11T11:42:01Z",
    "updated": "2026-02-11T11:42:01Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.10709v1",
    "url": "https://arxiv.org/abs/2602.10709v1",
    "pdf_url": "https://arxiv.org/pdf/2602.10709v1.pdf",
    "title": "Generation and control of Doppler harmonics approaching $10^{22}\\textrm{W/cm}^2$ on plasma mirrors",
    "abstract": "In this letter, we report Doppler harmonic generation with a relativistic plasma mirror at unprecedented intensities $>10^{21} ~\\textrm{W/cm}^2$ using a PetaWatt-class laser. We show that beyond a few $10^{21} ~\\textrm{W/cm}^2$ a precise control of the laser contrast at the sub-picosecond time scale becomes essential to drive the efficient generation of high-order harmonics. Such control is paramount for deploying plasma mirrors in high-field applications at PetaWatt-class laser facilities, including, for instance, their use as intensity boosters in the pursuit of the strong-field regime of quantum electrodynamics.",
    "authors": [
      "Baptiste Groussin",
      "Philipp Sikorski",
      "Aodhan McIlvenny",
      "Kosta Oubrerie",
      "Pierre Bartoli",
      "Lieselotte Obst-Huebl",
      "Anthony Vazquez",
      "Lulu Russell",
      "Tirtha Mandal",
      "Kei Nakamura",
      "Anthony J. Gonsalves",
      "Cameron G. R. Geddes",
      "Luca Fedeli",
      "Henri Vincenti",
      "Adrien Leblanc"
    ],
    "published": "2026-02-11T10:11:51Z",
    "updated": "2026-02-11T10:11:51Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.10681v1",
    "url": "https://arxiv.org/abs/2602.10681v1",
    "pdf_url": "https://arxiv.org/pdf/2602.10681v1.pdf",
    "title": "High-voltage generation system for a traveling-wave Stark decelerator",
    "abstract": "In this paper we describe the high-voltage generation system we have developed for a traveling-wave Stark decelerator (TWSD). The TWSD can reduce the forward velocity of a molecular beam of heavy neutral polar molecules such as strontium monofluoride (SrF) and barium monofluoride (BaF) from $\\sim$ 200 m/s down to $\\sim$ 6 m/s. The main motivation for the development of this device is the increased sensitivity from precision spectroscopy of the decelerated molecules to test fundamental physics. The high-voltage generation system can produce eight pulsed sinusoidal waveforms with a maximum amplitude of 10 kV and a linear frequency sweep from 16.7 kHz down to 500 Hz over the span of 40 ms at a repetition rate of 10 Hz. The eight waveforms are phase-offset to each other by 45 degrees. To slow down the heavy molecules, the decelerator is required to have a length of $\\sim$ 4 m, which results in a significant capacitive coupling between adjacent channels of $\\sim$ 160 pF. As a consequence, the control and stability of the waveforms is extra challenging. We designed a method that compensates for the frequency-dependent coupling between the eight channels. Allowing for amplitude and phase-offsets that do not deviate more than 1% and 2 degrees, respectively, from their design values during the frequency sweep. The system outperforms commercially available options in terms of stability, output voltage amplitude, cost and ease of maintenance. This approach is also relevant for other fields where precise control of high-voltage waveforms is required, such as particle accelerator physics, plasma physics and mass spectroscopy.",
    "authors": [
      "Lucas van Sloten",
      "Leo Huisman",
      "Steven Hoekstra"
    ],
    "published": "2026-02-11T09:32:47Z",
    "updated": "2026-02-11T09:32:47Z",
    "categories": [
      "physics.atom-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2602.10642v1",
    "url": "https://arxiv.org/abs/2602.10642v1",
    "pdf_url": "https://arxiv.org/pdf/2602.10642v1.pdf",
    "title": "Fully nonlinear phenomenology of the bump-on-tail (BOT) instability with drag, diffusion and Krook relaxation",
    "abstract": "Energetic-particle-driven modes in magnetically confined fusion plasmas often exhibit nonlinear frequency sweeping, reflecting complex wave-particle interactions near marginal stability. While the bump-on-tail (BOT) instability within the Berk-Breizman framework has served as a canonical model for understanding such phenomena, a unified nonlinear description remains incomplete when drag, diffusion, and Krook relaxation act simultaneously. In this work, we present a comprehensive numerical investigation of the BOT instability that explicitly retains all three collision operators together with external wave damping. Using a validated characteristic-based BOT code, we systematically scan the multi-dimensional collision parameter space and construct nonlinear regime maps and bifurcation diagrams. To organize the rich dynamics, we introduce a two-level categorization that combines global wave-energy evolution with chirping subtypes identified from spectral morphology. We find that diffusion and Krook relaxation regularize the nonlinear dynamics and promote ordered transitions from chaotic behaviors to periodic oscillations and steady saturation as collision strength increases, with the saturation level decreasing approximately exponentially with external damping. In contrast, drag alone does not admit steady solutions and instead drives persistent or chaotic chirping through convective deformation of resonant phase-space structures. When drag is combined with diffusion or Krook relaxation, clear transition sequences emerge: increasing drag breaks hole-clump symmetry, broadens the effective resonance region, and drives systematic transitions from transient to intermittent and persistent chirping.",
    "authors": [
      "Shi-Jie Zhang",
      "Lei Chang",
      "Zhao-Ju Bo",
      "Zhi-Song Qu",
      "Ilya Zadiriev",
      "Elena Kralkina",
      "Shogo Isayama",
      "Sin-Jae You",
      "Zi-Chen Kan",
      "Ji-Kai Sun",
      "Jing-Jing Ma"
    ],
    "published": "2026-02-11T08:43:48Z",
    "updated": "2026-02-11T08:43:48Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.10596v1",
    "url": "https://arxiv.org/abs/2602.10596v1",
    "pdf_url": "https://arxiv.org/pdf/2602.10596v1.pdf",
    "title": "The high speed analog optical readout system designed for low temperature experiments",
    "abstract": "For low-temperature experiments such as liquid xenon dark matter detectors, it is crucial to read out detector signals from cryostats. Traditionally, photoelectrical signals are transmitted from the cryogenic region to the outside using coaxial cables through vacuum feedthroughs on the cryostats. In this paper, we investigate an analog optical transmission method in which the raw electrical signals are converted into optical signals with light intensity linearly proportional to the electrical amplitude, transmitted out of the cryogenic environment through optical fiber, and subsequently converted back into electrical signals by photoelectric devices while preserving the signal waveform. This new approach offers advantages, including low attenuation over long-distance transmission and reduced crosstalk across the feedthroughs. Additionally, the low-temperature optical wavelength multiplexing scheme has been investigated and applied, increasing the transmission capability of a single fiber. At -100 degree Celsius, the proposed analog optical readout system achieves a -3dB bandwidth of larger than 150MHz, a dynamic range of up to 500mV, and a low cryogenic-region power consumption of 70mW per channel, demonstrating its strong potential for low-temperature experiments.",
    "authors": [
      "Z. Zhou",
      "W. Wu",
      "J. Tang",
      "Y. Fu",
      "Y. Guo",
      "Y. Liu",
      "X. Wang",
      "W. Zhi"
    ],
    "published": "2026-02-11T07:41:01Z",
    "updated": "2026-02-11T07:41:01Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.10562v1",
    "url": "https://arxiv.org/abs/2602.10562v1",
    "pdf_url": "https://arxiv.org/pdf/2602.10562v1.pdf",
    "title": "Unidentified falling objects in the LHC as dark matter signals",
    "abstract": "Unidentified Falling Objects (UFOs) refer to sporadic beam losses observed during LHC operation. The prevailing explanation is that micrometer-sized dust particles released from the beam screen produce beam losses through interactions with the protons. However, the release mechanism of these particles remains unknown. We propose that roughly $(1-10)$% of UFOs may be caused by axion quark nuggets (AQNs), macroscopic dark matter (DM) candidates with masses of order $(5-1000)\\,$g. The AQN model naturally relates the dark- and visible-matter abundances ($Ω_\\mathrm{DM}\\simΩ_\\mathrm{visible}$) and provides a mechanism for generating the baryon-antibaryon asymmetry, with DM composed of both matter and antimatter AQNs. When passing underground within approximately 100km of the LHC, an antimatter AQN generates acoustic waves strong enough to trigger multiple UFO events within $2\\,$s. If three correlated UFOs (placed at different locations along the LHC ring) are detected, the signal-to-noise ratio can exceed 5 across the entire allowed AQN mass range for a measurement time of about 360 hours. Practically, the LHC can serve as a large broadband acoustic detector for AQNs.",
    "authors": [
      "Xunyu Liang",
      "Ariel Zhitnitsky"
    ],
    "published": "2026-02-11T06:18:42Z",
    "updated": "2026-02-11T06:18:42Z",
    "categories": [
      "hep-ph",
      "astro-ph.IM",
      "hep-ex",
      "physics.acc-ph"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2510.23001v3",
    "url": "https://arxiv.org/abs/2510.23001v3",
    "pdf_url": "https://arxiv.org/pdf/2510.23001v3.pdf",
    "title": "Search for Dark Matter via Invisible Decays in ${}^{46}$Sc Nuclear Gamma Cascades with a CsI(Tl) Detector",
    "abstract": "Dark matter remains one of the most compelling open problems in modern physics, motivating experimental searches for new light, weakly coupled particles beyond the Standard Model. Despite extensive efforts employing diverse detection strategies, large regions of parameter space remain unexplored. We report a high-statistics laboratory search for invisible decay modes in nuclear $γ$-ray cascades using approximately $100~\\mathrm{kg}$ of CsI(Tl) scintillators operated at Texas A\\&M University. The experiment employs a high-activity ${}^{46}$Sc radioactive source and a ``missing-$γ$'' technique, in which the absence of a photon from a well-identified cascade serves as a signature of new physics. Unlike appearance-disappearance experiments, this approach requires only a single photon conversion into a dark-sector particle, enabling sensitivity to significantly weaker couplings. The setup provides simultaneous sensitivity to a broad class of light dark-sector candidates, including axions and axion-like particles, dark scalars, and dark photons in the $0.1 - 1 \\text{ MeV}$ mass region. Through careful control of detector containment, energy resolution, and environmental backgrounds, we excludes certain regions on the previously explored parameter space. With foreseeable improvements in detector volume and systematic uncertainty control, this technique has the potential to probe currently unexplored parameter space for axion-like particles and light dark scalars.",
    "authors": [
      "Sharada Sahoo",
      "Jing-han Chen",
      "Mahdi Mirzakhani",
      "Harikrishnan Ramani",
      "Rupak Mahapatra",
      "Surjeet Rajendran"
    ],
    "published": "2025-10-27T04:37:35Z",
    "updated": "2026-02-11T04:04:21Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.10447v1",
    "url": "https://arxiv.org/abs/2602.10447v1",
    "pdf_url": "https://arxiv.org/pdf/2602.10447v1.pdf",
    "title": "Bridging the Kinetic-Fluid Gap: Ion-Driven Magnetogenesis to Prime Cosmic Dynamos",
    "abstract": "The origin of cosmic magnetic fields is widely attributed to the amplification of weak seed fields by turbulent dynamos. However, a critical understanding gap remains between the microscopic generation of these seeds and the macroscopic onset of the dynamo. Current kinetic models, often constrained to electron scales, predict premature saturation via magnetic trapping, leaving the generated fields potentially too weak and small-scale to effectively prime magnetohydrodynamic (MHD) processes. Here, using high-resolution kinetic simulations with a realistic mass ratio, we reveal the physics of this unexplored ion-kinetic regime. Under generalized continuous shear driving, used to simulate ubiquitous macroscopic flows, we demonstrate that the saturation of electron instabilities is not the endpoint but a precursor to a distinct, ion-dominated evolution. Massive ions, sustaining the velocity shear, trigger a subsequent filamentation instability that accesses the vast ion kinetic energy reservoir. This mechanism amplifies the magnetic energy by orders of magnitude beyond the electron-saturation limit, expanding the field coherence to ion scales. Our results establish ion kinetics as the essential ''missing link'' that bridges the divide between microscopic plasma instabilities and macroscopic cosmic dynamos.",
    "authors": [
      "X. Liu",
      "D. Wu",
      "J. Zhang"
    ],
    "published": "2026-02-11T02:39:24Z",
    "updated": "2026-02-11T02:39:24Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.GA"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.10279v1",
    "url": "https://arxiv.org/abs/2602.10279v1",
    "pdf_url": "https://arxiv.org/pdf/2602.10279v1.pdf",
    "title": "The MUSE Target Chamber Post Veto",
    "abstract": "The Muon Scattering Experiment (MUSE) was developed to address the proton radius puzzle through simultaneous electron-proton and muon-proton scattering using the Paul Scherrer Institute's PiM1 secondary beamline. MUSE uses a large-solid-angle, non-magnetic spectrometer to detect beam particles scattering from a liquid hydrogen cell contained within a vacuum chamber. Due to the large scattering windows, the structural integrity of the chamber is supported by posts located at small scattering angles. While out of the acceptance, particles in the tails of the beam distribution can strike these posts, causing a significant trigger background. We describe the design and performance of the Target Chamber Post Veto (TCPV) detector installed inside the vacuum chamber to remove these background events at the trigger level.",
    "authors": [
      "R. Ratvasky",
      "T. Rostomyan",
      "M. Ali",
      "H. Atac",
      "F. Barchetti",
      "J. C. Bernauer",
      "W. J. Briscoe",
      "A. Christopher Ndukwe",
      "E. W. Cline",
      "S. Das",
      "K. Deiters",
      "E. J. Downie",
      "Z. Duan",
      "A. Flannery",
      "M. Foster",
      "A. Friebolin",
      "M. Gantert",
      "R. Gilman",
      "A. Golossanov",
      "J. Guo",
      "J. Hirschman",
      "A. Hofer",
      "N. S. Ifat",
      "Y. Ilieva",
      "D. Jayakodige",
      "T. Krahulik",
      "M. Kohl",
      "I. Lavrukhin",
      "W. Lin",
      "W. Lorenzon",
      "P. MohanMurthy",
      "M. Nicol",
      "M. Paolone",
      "T. Patel",
      "A. Prosnyakov",
      "R. D. Ransome",
      "R. Raymond",
      "H. Reid",
      "P. E. Reimer",
      "R. Richards",
      "G. Ron",
      "O. M. Ruimi",
      "K. Salamone",
      "S. Shrestha",
      "N. Sparveris",
      "S. Strauch",
      "N. Wuerfel",
      "D. A. Yaari",
      "C. Zimmerli"
    ],
    "published": "2026-02-10T20:45:25Z",
    "updated": "2026-02-10T20:45:25Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.10041v1",
    "url": "https://arxiv.org/abs/2602.10041v1",
    "pdf_url": "https://arxiv.org/pdf/2602.10041v1.pdf",
    "title": "Design of experiments characterising heat conduction in magnetised, weakly collisional plasma",
    "abstract": "Heat conduction in weakly collisional, magnetised plasma is challenging to model accurately due to multifaceted physics governing heat-carrying electrons, including microinstabilities that scatter electrons and modify heat transport. Capturing these effects requires multidimensional kinetic theory simulations, which are computationally expensive. Experimental constraints overcome this issue, resulting in improved understanding of thermal transport in systems such as the intra-cluster medium of galaxy clusters, and the hot-spot in inertial confinement fusion. In this paper, we present a new experimental platform that produces a weakly collisional high-\\b{eta} plasma expected to be susceptible to the whistler heat-flux instability. This platform, to be fielded on the Orion laser, enables characterisation of whistler-regulated thermal conductivity. The platform design is assessed using radiation-magnetohydrodynamics simulations with the code FLASH. Simulations using three thermal conduction models predict conductivity suppression by over an order of magnitude relative to the Spitzer value at whistler saturation, demonstrating the efficacy of the platform.",
    "authors": [
      "T. A. Vincent",
      "P. Ariyathilaka",
      "L. Creaser",
      "C. Danson",
      "D. Lamb",
      "J. Meinecke",
      "C. A. J. Palmer",
      "S. Pitt",
      "H. Poole",
      "C. Spindloe",
      "P. Thomas",
      "E. Tubman",
      "L. Wilson",
      "W. J. Garbett",
      "G. Gregori",
      "P. Tzeferacos",
      "T. Hodge",
      "A. F. A. Bott"
    ],
    "published": "2026-02-10T18:07:15Z",
    "updated": "2026-02-10T18:07:15Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.09957v1",
    "url": "https://arxiv.org/abs/2602.09957v1",
    "pdf_url": "https://arxiv.org/pdf/2602.09957v1.pdf",
    "title": "Deflation Techniques for Stellarator Equilibrium and Optimization",
    "abstract": "Stellarator optimization is a multi-objective, non-convex problem characterized by a complex objective landscape containing many local minima. The solution resulting from a single optimization is highly sensitive to factors such as the initial guess, objective weights, and the optimization method employed. However, merely varying these factors does not guarantee that a physically distinct minimum will be found; optimizations often fail to converge to good minima or simply return to the same or very similar local minima despite large-scale parameter scans. This paper presents a novel application of deflation methods to effectively explore this landscape. By modifying the objective function to penalize and \"deflate\" away already-found solutions, this technique encourages the optimizer towards attractive, distinct new minima while using a single initial guess and optimization setup. We provide a primer on deflation for nonlinear systems and non-convex optimization before applying it to non-axisymmetric equilibrium and stellarator optimization problems. Key results include the discovery of families of global equilibria with similar core characteristics and the convergence to helical core equilibria without prescient initial guesses. Furthermore, we demonstrate that augmenting stage-one stellarator and stage-two coil optimization with deflation constraints readily produces multiple high-quality, distinct solutions, establishing the method's efficacy and ease of use.",
    "authors": [
      "Dario Panici",
      "Byoungchan Jang",
      "Rory Conlin",
      "Daniel Dudt",
      "Yigit Gunsur Elmacioglu",
      "Egemen Kolemen"
    ],
    "published": "2026-02-10T16:44:08Z",
    "updated": "2026-02-10T16:44:08Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.09941v1",
    "url": "https://arxiv.org/abs/2602.09941v1",
    "pdf_url": "https://arxiv.org/pdf/2602.09941v1.pdf",
    "title": "Probing Internal Dynamics of Spatiotemporal Optical Vortex Strings: Spatiotemporal Attraction and Filament Stretching",
    "abstract": "Vortex dynamics are intriguing and challenging across multiple physics fields. In optics, customized spatiotemporally structured optical fields, especially spatiotemporal optical vortices (STOV), offer the potential to tailor light via coupled space-time degrees of freedom. However, the interaction mechanisms between multiple transverse orbital angular momentum singularities within a single wave packet remain elusive. This study explores the intrinsic dynamics of a STOV with three phase singularities, observing a pronounced vortex singularity oscillation phenomena by tuning the temporal dispersion. We show that these phenomena originate from the counterintuitive spatiotemporal attractive effect between vortices, which is closely related to the singularity distance. Furthermore, the stretching into filaments and annihilation behaviors is observed by introducing antivortex in the center of the wavepacket. Experimentally, we propose a Full Interferometric Retrieval of Spatiotemporal Tomography (FIRST) method that enables the complete, single-shot capture of wave packets, with excellent agreement between theoretical predictions and experimental results. To the best of our knowledge, the dynamics of transverse spatiotemporal singularities within a single wave packet are reported here for the first time. These findings confirm the existence of interesting interactions between STOV singularities, deepen our understanding of photonics and open a new direction for investigating the complex dynamics of vortex singularities in the spatiotemporal domain.",
    "authors": [
      "Xiuyu Yao",
      "Xuechen Gao",
      "Ping Zhu",
      "Jintao Fan",
      "Jingwen Ran",
      "Zezhao Gong",
      "Dongjun Zhang",
      "Xiao Liang",
      "Xuejie Zhang",
      "Meizhi Sun",
      "Qiang Zhang",
      "Lijie Cui",
      "Hailun Zeng",
      "Minglie Hu",
      "Xinglong Xie",
      "Jianqiang Zhu"
    ],
    "published": "2026-02-10T16:25:41Z",
    "updated": "2026-02-10T16:25:41Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2601.16928v2",
    "url": "https://arxiv.org/abs/2601.16928v2",
    "pdf_url": "https://arxiv.org/pdf/2601.16928v2.pdf",
    "title": "Neutron spectrum measurement in the Yemi underground laboratory",
    "abstract": "We report on the measurement of neutron energy spectra at the newly established Yemi Underground Laboratory (Yemilab) in the Republic of Korea, designed to host dark matter and rare-event search experiments. A high-sensitivity neutron spectrometer was employed, consisting of ten cylindrical {}^{3}He proportional counters, eight of which were embedded in cylindrical high-density polyethylene moderators of various sizes. To quantify and mitigate contributions from internal α-backgrounds, each detector underwent a dedicated background measurement using a cadmium-shielded box. These backgrounds, primarily originating from trace amounts of U and Th in the stainless-steel housings, were characterized and subtracted during data analysis. Neutron measurements were carried out at three locations within the Yemilab between March to October 2023. After waveform-based event selection and correction for \\alphasym-backgrounds, neutron count rates were estimated and corresponding energy spectra were reconstructed using the unfolding method. The total neutron fluence rates were measured ranged from (3.24 $\\pm$ 0.11) to (4.01 $\\pm$ 0.10) $\\times~10^{-5}~ {cm}^{-2}~{s}^{-1}$, with thermal and fast neutron components (1 - 10 MeV) ranging from (1.32 $\\pm$ 0.05) to (1.51 $\\pm$ 0.05) $\\times 10^{-5}~{cm}^{-2}~{s}^{-1}$ and (0.27 $\\pm$ 0.03) to (0.34 $\\pm$ 0.10) $\\times~10^{-5}~{cm}^{-2}~{s}^{-1}$, respectively.",
    "authors": [
      "Joong Hyun Kim",
      "Sinchul Kang",
      "HyeoungWoo Park",
      "Jungho Kim",
      "Hyeonseo Park",
      "Young Soo Yoon",
      "Hongjoo Kim",
      "Yeongduk Kim",
      "Jungho So",
      "SungHyun Kim"
    ],
    "published": "2026-01-23T17:40:36Z",
    "updated": "2026-02-10T16:15:14Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1016/j.astropartphys.2026.103215"
  },
  {
    "arxiv_id": "2512.04842v2",
    "url": "https://arxiv.org/abs/2512.04842v2",
    "pdf_url": "https://arxiv.org/pdf/2512.04842v2.pdf",
    "title": "Performance Optimization and Characterization of 7-pad Resistive PICOSEC Micromegas Detectors",
    "abstract": "We present a comprehensive characterization of resistive PICOSEC Micromegas detector prototypes, tested under identical conditions, constant drift gap, field configurations, and photocathode at the CERN SPS H4 beam line. This work provides a proof of concept for the use of resistive layer technology in gaseous timing detectors, demonstrating that robustness can be improved without compromising the excellent timing performance of PICOSEC Micromegas. Different resistive architectures and values were explored to optimize stability and ensure reliable long-term operation in challenging experimental environments. The prototype with a 10MΩ resistive layer achieved the best overall performance, with a timing resolution of 22.900 {\\pm} 0.002 ps and a spatial resolution of 1.190 {\\pm} 0.003 mm, while charge sharing across multiple pads enabled combined timing resolutions below 28 ps. A lower-resistivity (200kΩ) configuration exhibited enhanced charge spread, leading to minor systematic offsets in reconstructed pad centers, yet maintained robust timing and spatial performance. Capacitive charge-sharing architectures improved spatial resolution in some regions but suffered from signal attenuation and nonuniform charge distributions, resulting in slightly degraded timing (33.300 {\\pm} 0.002 ps) and complex localization patterns. Mechanical precision, particularly readout planarity and photocathode alignment, was identified as critical for uniform detector response. These studies benchmark the potential of resistive layers for gaseous timing detectors and provide a foundation for scalable designs with optimized timing and spatial resolution across diverse experimental applications.",
    "authors": [
      "A. Kallitsopoulou",
      "R. Aleksan",
      "S. Aune",
      "J. Bortfeldt",
      "F. Brunbauer",
      "M. Brunoldi",
      "J. Datta",
      "D. Desforge",
      "G. Fanourakis",
      "D. Fiorina",
      "K. J. Floethner",
      "M. Gallinaro",
      "F. Garcia",
      "I. Giomataris",
      "K. Gnanvo",
      "F. J. Iguaz",
      "D. Janssens",
      "F. Jeanneau",
      "M. Kovacic",
      "B. Kross",
      "P. Legou",
      "M. Lisowska",
      "J. Liu",
      "M. Lupberger",
      "I. Maniatis",
      "J. McKisson",
      "Y. Meng",
      "H. Muller",
      "E. Oliveri",
      "G. Orlandini",
      "A. Pandey",
      "T. Papaevangelou",
      "M. Pomorski",
      "E. Ferrer-Ribas",
      "L. Ropelewski",
      "D. Sampsonidis",
      "L. Scharenberg",
      "T. Schneider",
      "E. Scorsone",
      "L. Sohl",
      "M. van Stenis",
      "Y. Tsipolitis",
      "S. E. Tzamarias",
      "A. Utrobicic",
      "I. Vai",
      "R. Veenhof",
      "P. Vitulo",
      "X. Wang",
      "S. White",
      "W. Xi",
      "Z. Zhang",
      "Y. Zhou"
    ],
    "published": "2025-12-04T14:27:08Z",
    "updated": "2026-02-10T15:09:14Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.09836v1",
    "url": "https://arxiv.org/abs/2602.09836v1",
    "pdf_url": "https://arxiv.org/pdf/2602.09836v1.pdf",
    "title": "Conceptual Design of a Novel Highly Granular Crystal Electromagnetic Calorimeter for Future Higgs Factories",
    "abstract": "Next-generation high-energy electron-positron colliders, operating as Higgs factories, require an unprecedented jet energy resolution for precision measurements of Higgs and Z/W bosons. To address this challenge, a conceptual design is presented for a novel high-granularity crystal electromagnetic calorimeter that combines the superior intrinsic energy resolution of a homogeneous calorimeter with the fine segmentation required for particle-flow reconstruction. The crystal electromagnetic calorimeter design is based on orthogonally arranged long scintillating crystal bars read out by silicon photomultipliers (SiPMs) at both ends. Key design specifications were established through comprehensive simulation studies. Critical technical considerations, including crystal choices, photosensors, electronics, mechanical support, and radiation damage, are discussed. A dedicated digitisation framework was developed to realistically model effects from the crystal, SiPMs, and readout electronics. The performance of a single calorimeter module was evaluated using simulated electron showers. Simulation results for a single module demonstrate an excellent electromagnetic energy resolution of $1.12\\%/\\sqrt{E(\\mathrm{GeV})}\\oplus0.24\\%$ and an energy linearity within $\\pm0.5\\%$ for electrons from 3 GeV to 100 GeV. The performance significantly exceeds the design requirement of $\\leq 3\\%/\\sqrt{E(\\mathrm{GeV})}\\oplus1\\%$. The results establish the feasibility of the proposed high-granularity crystal calorimeter concept and point to a promising pathway toward the precision calorimetry required for future high-energy electron-positron collider experiments.",
    "authors": [
      "Baohua Qi",
      "Fangyi Guo",
      "Yong Liu",
      "Manqi Ruan",
      "Weizheng Song",
      "Shengsen Sun",
      "Yifang Wang",
      "Yuexin Wang",
      "Haijun Yang",
      "Yang Zhang",
      "Zhiyu Zhao"
    ],
    "published": "2026-02-10T14:43:18Z",
    "updated": "2026-02-10T14:43:18Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.09827v1",
    "url": "https://arxiv.org/abs/2602.09827v1",
    "pdf_url": "https://arxiv.org/pdf/2602.09827v1.pdf",
    "title": "Scaling laws for the cutoff wavenumber of the short-wavelength ion-temperature-gradient mode in a Z-pinch",
    "abstract": "We use a heuristic fluid model to predict the dependence of the cutoff wave number for the short-wavelength ion temperature gradient (SWITG) mode on ion density gradient, ion temperature gradient (ITG) and ion-electron temperature ratio. In particular, we predict that the cutoff wave number increases linearly with increasing ITG for sufficiently large values of the ITG. Direct numerical solutions of the gyrokinetic dispersion relation using a purpose-built solver confirm the predicted scalings at large ITG values and find a weaker power-law scaling for intermediate ITG values. Combining these wave number scalings with a simple diffusive estimate for turbulent fluxes produces a scaling prediction for the ITG heat flux in SWITG-driven turbulence. Applying the critical balance conjecture additionally provides scalings for the aspect ratio of the SWITG turbulent eddies.",
    "authors": [
      "O. Gupta",
      "M. Barnes",
      "F. I. Parra",
      "L. Podavini",
      "A. Zocco",
      "T. Adkins",
      "P. G. Ivanov"
    ],
    "published": "2026-02-10T14:34:52Z",
    "updated": "2026-02-10T14:34:52Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.09768v1",
    "url": "https://arxiv.org/abs/2602.09768v1",
    "pdf_url": "https://arxiv.org/pdf/2602.09768v1.pdf",
    "title": "A 4D-STEM Tomographic Framework Assisted by Object Tracking for Nanoparticle Structure Solution",
    "abstract": "Three-dimensional electron diffraction (3D ED) has emerged as a powerful method for solving the structures of sub-micron-sized particles down to nanoparticles. However, it faces technical challenges when applied to beam-sensitive samples or conglomerated and agglomerated nanoparticles. This study presents a novel approach that combines 4D-STEM tomography with object tracking and segmentation algorithms to overcome these limitations and achieve single-crystalline 3D ED datasets from nanopowder samples. The method and data quality are assessed on brookite TiO2 nanorods and beam-sensitive CsPbBr3 nanoparticles. To finely sample the reciprocal-space, the data acquisition was automated to acquire hundreds of 4D-STEM scans using a slightly convergent beam and at fine tilt steps. The proposed method provides enhanced signal-to-noise ratio, low illumination time for reducing beam damage, and the ability to analyze multiple particles from a single tomographic dataset. The procedure is optimized to be feasible using commercially available desktops and detectors. This extends the method applicability in the community to the systems and samples that were previously inaccessible for conventional 3D ED methods, particularly breaking the technical challenges for the data acquisition.",
    "authors": [
      "Saleh Gholam",
      "Arno Annys",
      "Irina Skvortsova",
      "Erica Cordero Oyonarte",
      "Amirhossein Hajizadeh",
      "Philippe Boullay",
      "Johan Hofkens",
      "Johan Verbeeck",
      "Joke Hadermann"
    ],
    "published": "2026-02-10T13:28:36Z",
    "updated": "2026-02-10T13:28:36Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.15425v2",
    "url": "https://arxiv.org/abs/2509.15425v2",
    "pdf_url": "https://arxiv.org/pdf/2509.15425v2.pdf",
    "title": "Structure-preserving long-time simulations of turbulence in magnetized ideal fluids",
    "abstract": "We address three two-dimensional magnetohydrodynamics models: reduced magnetohydrodynamics (RMHD), Hazeltine's model, and the Charney--Hasegawa--Mima (CHM) equation. These models are derived to capture the basic features of magnetohydrodynamic turbulence and plasma behaviour. They all possess non-canonical Hamiltonian formulations in terms of Lie--Poisson brackets, which imply an infinite number of conservation laws along with symplecticity of the phase flow. This geometric structure in phase space affects the statistical long-time behaviour. Therefore, to capture the qualitative features in long-time numerical simulations, it is critical to use a discretization that preserves the rich phase space geometry. Here, we use the matrix hydrodynamics approach to achieve structure-preserving discretizations for each model. We furthermore carry out long-time simulations with randomized initial data and a comparison between the models. The study shows consistent behaviour for the magnetic potential: both RMHD and Hazeltine's model produce magnetic dipoles (in CHM, the magnetic potential is prescribed). These results suggest an inverse cascade of magnetic energy and of the mean-square magnetic potential, which is empirically verified via spectral scaling diagrams. On the other hand, the vorticity field dynamics differs between the models: RMHD forms sharp vortex filaments with rapidly growing vorticity values, whereas Hazeltine's model and CHM show only small variation in the vorticity values. Related to this observation, both Hazeltine's model and CHM give spectral scaling diagrams indicating an inverse cascade of kinetic energy not present in RMHD.",
    "authors": [
      "Klas Modin",
      "Michael Roop"
    ],
    "published": "2025-09-18T21:04:46Z",
    "updated": "2026-02-10T13:03:00Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.09672v1",
    "url": "https://arxiv.org/abs/2602.09672v1",
    "pdf_url": "https://arxiv.org/pdf/2602.09672v1.pdf",
    "title": "X-ray reflection: a FLUKA model and its application in the design of synchrotron light beamlines and CERN's Future Circular Collider",
    "abstract": "Relying on atomic scattering factors from evaluated databases, a new model for the reflectivity of x rays on solid surfaces has been developed for FLUKA v4-6.0. This model accounts for the variation of reflectivity as a function of the photon energy, its incidence angle, and linear polarisation; surface roughness effects are also taken into account. FLUKA reflectivities agree well with those obtained from state-of-the-art codes used for the characterization of optical devices, both for homogeneous solids and for multilayer mirrors. This new capability renders FLUKA a nearly one-stop shop for synchrotron radiation simulations: emission from bending magnets and wigglers, photon transport and interaction, electromagnetic (and hadronic when applicable) shower development in complex geometries, as well as x-ray reflection at designated solid surfaces can now be all accounted for in a single FLUKA run. This streamlined FLUKA simulation workflow greatly simplifies the plethora of simulation tools that Monte Carlo practitioners previously needed to rely on. Two application scenarios of this new reflectivity model are showcased: first, the use of a multilayer mirror to deflect x rays from an optical hutch onto an experimental hall at the MINERVA beamline of the ALBA synchrotron and, second, the assessment of the photon flux near the interaction point at the CERN's Future Circular Collider (in its electron-positron stage) as a result of upstream x-ray reflections.",
    "authors": [
      "Giuseppe Mazzola",
      "Sunil Chitra",
      "Arnaud Devienne",
      "Alessandro Frasca",
      "María José García Fusté",
      "Dominique Heinis",
      "Anton Lechner",
      "Giuseppe Lerner",
      "Luca Rebuffi",
      "Manuel Sanchez del Rio",
      "David L. Windt",
      "Eugeni Graugés",
      "Francesc Salvat Pujol"
    ],
    "published": "2026-02-10T11:27:31Z",
    "updated": "2026-02-10T11:27:31Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.16243v2",
    "url": "https://arxiv.org/abs/2509.16243v2",
    "pdf_url": "https://arxiv.org/pdf/2509.16243v2.pdf",
    "title": "Binary Classification of Light and Dark Time Traces of a Transition Edge Sensor Using Convolutional Neural Networks",
    "abstract": "The Any Light Particle Search II (ALPS II) is a light shining through a wall experiment probing the existence of axions and axion-like particles using a 1064 nm laser source. While ALPS II is already taking data using a heterodyne based detection scheme, cryogenic transition edge sensor (TES) based single-photon detectors are planned to expand the detection system for cross-checking the potential signals, for which a sensitivity on the order of $10^{-24}$ W is required. In order to reach this goal, we have investigated the use of convolutional neural networks (CNN) as binary classifiers to distinguish the experimentally measured 1064 nm photon triggered (light) pulses from background (dark) pulses. Despite extensive hyperparameter optimization, the CNN based binary classifier did not outperform our previously optimized cut-based analysis in terms of detection significance. This suggests that the used approach is not generally suitable for background suppression and improving the energy resolution of the TES. We partly attribute this to the training confusion induced by near-1064 nm black-body photon triggers in the background, which we identified as the limiting background source as concluded in our previous works. However, we argue that the problem ultimately lies in the binary classification based approach and believe that regression models would be better suitable for addressing the energy resolution. Unsupervised machine learning models, in particular neural network based autoencoders, should also be considered potential candidates for the suppression of noise in time traces. While the presented results and associated conclusions are obtained for TES designed to be used in the ALPS II experiment, they should hold equivalently well for any device whose output signal can be considered as a univariate time trace.",
    "authors": [
      "Elmeri Rivasto",
      "Katharina-Sophie Isleif",
      "Friederike Januschek",
      "Axel Lindner",
      "Manuel Meyer",
      "Gulden Othman",
      "José Alejandro Rubiera Gimeno",
      "Christina Schwemmbauer"
    ],
    "published": "2025-09-17T06:53:20Z",
    "updated": "2026-02-10T11:23:28Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1038/s41598-025-33353-4"
  },
  {
    "arxiv_id": "2506.21141v2",
    "url": "https://arxiv.org/abs/2506.21141v2",
    "pdf_url": "https://arxiv.org/pdf/2506.21141v2.pdf",
    "title": "Enhancement of Mid-/High-Z Impurity Transport by Continuous Li-granule Dropping in a Stellarator Plasma",
    "abstract": "An enhancement of core impurity transport is observed in high-density plasmas of the stellarator LHD heated by neutral beam injection when continuous lithium (Li) granule dropping is performed. In the experiments reported here, in which the TESPEL is employed to inject trace amounts of titanium (Ti) and molybdenum (Mo) into the plasma core, confinement times for these impurities are seen to reduce significantly when Li dropping is applied, this reduction being more notable for Mo. In order to gain some initial insight into these observations, simulations are performed using the drift-kinetic transport code SFINCS for the Mo case. These simulations indicate that, while neoclassical transport prevails for the main plasma components (electrons, majority ions and low Z impurities), the classical contribution seems to be dominant for transporting Mo impurities. In summary, this work reports the first experimental observation of the degradation of mid-Z and high-Z impurity confinement induced by the continuous dropping of Li granules into a high-density stellarator plasma. In the case of the Mo impurity, simulations suggest that classical transport is the key mechanism underlying the enhanced impurity transport.",
    "authors": [
      "Daniel Medina-Roque",
      "Isabel García-Cortés",
      "Naoki Tamura",
      "Kieran J. McCarthy",
      "Federico Nespoli",
      "Kenji Tanaka",
      "Mamoru Shoji",
      "Suguru Masuzaki",
      "Hisamichi Funaba",
      "Chihiro Suzuki",
      "Albert Mollen",
      "Robert Lunsford",
      "Katsumi Ida",
      "Mikiro Yoshinuma",
      "Motoshi Goto",
      "Yasuko Kawamoto",
      "Tomoko Kawate",
      "Tokihiko Tokuzawa",
      "Ichihiro Yamada"
    ],
    "published": "2025-06-26T10:55:55Z",
    "updated": "2026-02-10T08:23:02Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.09399v1",
    "url": "https://arxiv.org/abs/2602.09399v1",
    "pdf_url": "https://arxiv.org/pdf/2602.09399v1.pdf",
    "title": "Simulation of the Space-Charge-Limited Current Density for Time-Variant Pulsed Injection",
    "abstract": "Space-charge-limited (SCL) current density for time-invariant injection (under long-pulse condition) via the diode cathode is the maximum transportable density, while it can be leveraged higher when the injection pulselength becomes shorter than the transmit time for electrons (i.e., under short-pulse condition). However, both limits mentioned above apply for the time-invariant injection condition and the role of time-varying current density for injection remains elusive. In this paper, we numerically investigate the SCL electron flow with time-variant injection. Using particle-in-cell simulation, four different time-variant profiles for electron injection are enforced, and the maximum current densities are determined resulting from the space charge effect for various pulse lengths. We speculate that the time-variant density of injection via the diode cathode will contribute to transport enhancement in the short-pulse condition.",
    "authors": [
      "H. Huang",
      "Y. Liu"
    ],
    "published": "2026-02-10T04:09:29Z",
    "updated": "2026-02-10T04:09:29Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1109/TPS.2019.2908896"
  },
  {
    "arxiv_id": "2602.00312v5",
    "url": "https://arxiv.org/abs/2602.00312v5",
    "pdf_url": "https://arxiv.org/pdf/2602.00312v5.pdf",
    "title": "Self ordering to imposed ordering of dust -- a continuous spatial phase transition experiment in MDPX",
    "abstract": "Previous experiments conducted in the Magnetized Dusty Plasma eXperiment (MDPX) revealed an intriguing phenomenon first referred to as imposed ordering. This occurs when micron-sized dust particles become aligned with the geometry of a conducting mesh placed above the dust (at a distance much larger than the plasma Debye length or the ion-neutral or electron-neutral mean free paths) in the presence of a strong magnetic field perpendicular to the mesh. In this work, results of a transition experiment are presented wherein starting from a classical two-dimensional Coulomb crystal with hexagonal symmetry in an unmagnetized plasma $(B = 0\\,T)$, dust transitions to a state in which it flows along the geometry of a conducting mesh placed above it, mapping out the 4-fold symmetry of the boundary condition. It is hypothesized that beyond a certain magnetization, elongated electric potential structures emanating from the mesh drive the dust motion to reflect the mesh morphology, transitioning from a 6-fold self ordering to 4-fold imposed ordering. The various dust phases are quantified and a critical value of magnetic field is identified in the transition experiment indicating the onset of imposed ordering.",
    "authors": [
      "Siddharth Bachoti",
      "Saikat Chakraborty Thakur",
      "Rahul Banka",
      "Cameron Royer",
      "Edward Thomas"
    ],
    "published": "2026-01-30T21:03:28Z",
    "updated": "2026-02-10T01:03:28Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.09293v1",
    "url": "https://arxiv.org/abs/2602.09293v1",
    "pdf_url": "https://arxiv.org/pdf/2602.09293v1.pdf",
    "title": "Ions-electrons-states for the two-component Vlasov-Poisson equation",
    "abstract": "We establish both local and global bifurcation results for traveling periodic solutions of the one-dimensional two-species Vlasov-Poisson equation. These solutions consist of strip-like regions of ions and electrons in phase space that propagate coherently and emerge from spatially homogeneous, velocity-dependent equilibrium layers. Depending on the geometry of the underlying equilibrium and on the selected Fourier mode, the bifurcation diagram exhibits either two or four solution branches. In all cases, the bifurcation is of pitchfork type; in symmetric configurations, the local structure near the equilibrium has a hyperbolic geometry. We further show that these locally constructed branches extend globally. This work extends the previous study by the same author of the purely electronic case, where the ions were modeled as an immobile neutralizing background. Allowing both species to evolve dynamically leads to a more intricate, higher-dimensional analysis. Finally, by means of an affine change of variables, we reveal a connection with the one-dimensional two-component Euler-Poisson system, which in turn enables the construction of traveling periodic waves of both small and large amplitude for that model as well.",
    "authors": [
      "Emeric Roulley"
    ],
    "published": "2026-02-10T00:23:18Z",
    "updated": "2026-02-10T00:23:18Z",
    "categories": [
      "math.AP",
      "physics.plasm-ph"
    ],
    "primary_category": "math.AP"
  },
  {
    "arxiv_id": "2602.09205v1",
    "url": "https://arxiv.org/abs/2602.09205v1",
    "pdf_url": "https://arxiv.org/pdf/2602.09205v1.pdf",
    "title": "Development of a Reduced Multi-Fluid Equilibrium Model and Its Application to Proton-Boron Spherical Tokamaks",
    "abstract": "Proton-Boron fusion requires extreme ion temperatures and robust confinement, making Spherical Tokamaks (ST) with high-power neutral beam injection primary candidates. In these devices, strong toroidal rotation and the large mass disparity between protons and boron ions drive complex multi-fluid effects - specifically centrifugal species separation and electrostatic polarization - that standard single-fluid magnetohydrodynamic (MHD) models fail to capture. While comprehensive multi-fluid models are often numerically stiff, we develop a reduced model balancing physical fidelity with computational robustness. By retaining dominant toroidal rotation and self-consistent potential while neglecting poloidal inertia and pressure anisotropy, the model couples a generalized Grad-Shafranov equation with species-specific Bernoulli relations and a quasi-neutrality constraint. The model is applied to two representative p-B ST configurations: the experimental EHL-2 and reactor-scale EHL-3B. Simulation results demonstrate that equilibrium modifications are governed by the ion Mach number ($M$). In the low-rotation regime ($M < 0.5$), multi-fluid effects are weak and solutions approach the single-fluid limit. However, at $M > 2$, strong centrifugal forces drive significant boron accumulation at the low-field side (LFS) and generate an internal electrostatic potential on the order of 10 kV. These findings confirm the necessity of multi-fluid modeling for accurate p-$^{11}$B reactor design and establish a theoretical foundation for future investigations into stability, transport, and free-boundary dynamics.",
    "authors": [
      "Huasheng Xie",
      "Xingyu Li",
      "Jiaqi Dong",
      "Zhiwei Ma",
      "Yunfeng Liang",
      "Yuejiang Shi",
      "Wenjun Liu",
      "Yueng-Kay Martin Peng",
      "Lai Wei",
      "Zhengxiong Wang",
      "Hanyue Zhao"
    ],
    "published": "2026-02-09T21:16:59Z",
    "updated": "2026-02-09T21:16:59Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  }
]