{
  "arxiv_id": "2509.07156v1",
  "url": "https://arxiv.org/abs/2509.07156v1",
  "pdf_url": "https://arxiv.org/pdf/2509.07156v1.pdf",
  "title": "The Integrating Miniature Piggyback for Impulsive Solar Hard X-rays   (IMPISH): a spectrometer for the GRIPS-2 balloon campaign",
  "abstract": "The Integrating Miniature Piggyback for Impulsive Solar Hard X-rays (IMPISH) is a piggyback mission originally designed for the second flight of the Gamma-Ray Imager/Polarimeter for Solar flares (GRIPS-2) Antarctic balloon. IMPISH will take measurements of collimated, full-Sun X-ray spectra with the goal of detecting sub-second variations (order of tens of milliseconds) of nonthermal X-ray emission during the impulsive phase of large solar flares to probe particle acceleration mechanisms driven by magnetic reconnection.   The IMPISH detector system, made up of four identical detectors totaling 64 cm$^2$ effective area, is capable of measuring from ~10 keV to over 200 keV through the use of silicon photomultipliers (SiPMs) and LYSO scintillators. At the stratospheric altitude of GRIPS-2, the effective lower energy limit is ~20-30 keV. The geometry of the LYSO crystal has been optimized to balance the light collection efficiency with the effective area required for stratospheric X-ray measurements. Development of the IMPISH detectors has introduced a path for a low-cost solution to fast solar X-ray measurements across a large energy range utilizing commercially available components. The payload has a 3U form factor and has been designed so that both the electronics and detectors may be easily adaptable for space-based missions.",
  "authors": [
    "Reed B. Masek",
    "William Setterberg",
    "Dorcas Oseni",
    "Lestat Clemmer",
    "Lindsay Glesener",
    "Philip Williams",
    "John G. Sample",
    "Amir Caspi",
    "Demoz Gebre-Egziabher",
    "Pascal Saint-Hilaire",
    "Albert Y. Shih",
    "David M. Smith"
  ],
  "published": "2025-09-08T19:09:19Z",
  "updated": "2025-09-08T19:09:19Z",
  "categories": [
    "physics.ins-det",
    "astro-ph.HE",
    "astro-ph.IM",
    "astro-ph.SR",
    "physics.space-ph"
  ],
  "primary_category": "physics.ins-det"
}