[
  {
    "arxiv_id": "2509.01249v2",
    "url": "https://arxiv.org/abs/2509.01249v2",
    "pdf_url": "https://arxiv.org/pdf/2509.01249v2.pdf",
    "title": "An Innovative Photon-Driven Subcritical Reactor Concept Powered by   Synchrotron Radiation Source",
    "abstract": "This paper introduces the conceptual design of a Photon Driven Reactor (PDR), an innovative subcritical reactor designed for energy generation driven by a synchrotron radiation. The PDR concept overcomes key technological challenges of conventional accelerator-driven systems, particularly the target's structural durability and its thermal management, by employing synchrotron photons directly interacting with fissile material to induce photonuclear reactions. Computational analyses involved criticality and fixed-source simulation using MCNPx and SERPENT Monte Carlo codes, providing robust evaluation of the neutron production, moderation, and multiplication mechanisms. The main focus of this study was to evaluate the system's capability to achieve a positive net energy gain, specifically assessing the thermal power output agains the electrical power absorbed from the grid. Furthermore, the adoption of spent nuclear fuel for the subcritical reactor core loading has been investigated, highlighting the sustainability and environmental benefits of the proposed PDR design. The proposed system is able to exploit a modularity feature. For each large synchrotron, up to fifty beam lines may be operated simultaneously, each delivering photons to an independent subcritical reactor core. With a photon flux on the order of $8.8 \\times 10^{17}$ photons per second in each beamline, the results indicate that each individual reactor can achieve a thermal output up to 8 MW, while requiring about 435-660 kW of electrical input from the grid, thereby demonstrating the feasibility of energy amplification in the PDR.",
    "authors": [
      "Antonio Cammi",
      "Lorenzo Loi",
      "Andrea Missaglia",
      "David Alesini",
      "Hans-Heinrich Braun"
    ],
    "published": "2025-09-01T08:41:41Z",
    "updated": "2025-09-10T06:53:36Z",
    "categories": [
      "physics.acc-ph",
      "physics.app-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.05456v5",
    "url": "https://arxiv.org/abs/2507.05456v5",
    "pdf_url": "https://arxiv.org/pdf/2507.05456v5.pdf",
    "title": "Constraints on the magnetic field evolution in tokamak power plants",
    "abstract": "Tokamaks differ fundamentally from stellarators in the importance of the external coils in determining the magnetic field structure. Tokamak plasmas are in a self-organized state, especially when fusion rather than external heating dominates. Stellarator optimization focuses on the magnetic fields produced by the coils. Tokamak optimization considers plasma profiles, which are not easily controlled. A deviation of the profile of the plasma current over its full stability range produces only a small change, $\\sim 16\\%$, in the poloidal flux produced by the plasma current. This offers a simple explanation of why disruptions in tokamaks are so common, and why current-profile control though difficult seems to be required, especially during shutdown. The rapid temporal decay of $n\\tau_ET$ in high performance tokamak experiments shows the need for the careful control for other profiles. Here the focus is on the implications of Faraday's Law since important but new implications are easily derived. The context of the paper is twofold: (1) Simplified statements of the implications of the laws of physics, in particular Faraday's Law, should be helpful in the design of tokamak power plants. (2) Thoughtful allocation of resources among the various fusion concepts is needed to minimize the time and the cost to the achievement of practical fusion power.",
    "authors": [
      "Allen H Boozer"
    ],
    "published": "2025-07-07T20:17:20Z",
    "updated": "2025-09-09T20:48:03Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.13112v3",
    "url": "https://arxiv.org/abs/2508.13112v3",
    "pdf_url": "https://arxiv.org/pdf/2508.13112v3.pdf",
    "title": "Quantum sensing of electron beams using solid-state spins",
    "abstract": "Scattering experiments with energetic particles, such as free electrons, have been historically used to reveal the quantum structure of matter. However, realizing coherent interactions between free-electron beams and solid-state quantum systems has remained out of reach, owing to their intrinsically weak coupling. Realizing such coherent control would open up opportunities for hybrid quantum platforms combining free electrons and solid-state qubits for coincident quantum information processing and nanoscale sensing. Here, we present a framework that employs negatively charged nitrogen-vacancy centers (NV-) in diamond as quantum sensors of a bunched electron beam. We develop a Lindblad master equation description of the magnetic free-electron--qubit interactions and identify spin relaxometry as a sensitive probe of the interaction. Experimentally, we integrate a confocal fluorescence microscopy setup into a microwave-bunched electron beam line. We monitor charge-state dynamics and assess their impact on key sensing performance metrics (such as spin readout contrast), defining safe operating parameters for quantum sensing experiments. By performing $T_1$ relaxometry under controlled electron beam exposure, we establish an upper bound on the free-electron--spin coupling strength. Our results establish NV- centers as quantitative probes of free electrons, providing a metrological benchmark for free-electron--qubit coupling under realistic conditions, and chart a route toward solid-state quantum control with electron beams.",
    "authors": [
      "Jakob M. Grzesik",
      "Dominic Catanzaro",
      "Charles Roques-Carmes",
      "Eric I. Rosenthal",
      "Guido L. van de Stolpe",
      "Aviv Karnieli",
      "Giovanni Scuri",
      "Souvik Biswas",
      "Kenneth J. Leedle",
      "Dylan S. Black",
      "Robert L. Byer",
      "Ido Kaminer",
      "R. Joel England",
      "Shanhui Fan",
      "Olav Solgaard",
      "Jelena Vučković"
    ],
    "published": "2025-08-18T17:19:12Z",
    "updated": "2025-09-09T20:08:32Z",
    "categories": [
      "quant-ph",
      "physics.acc-ph",
      "physics.optics"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2409.06389v2",
    "url": "https://arxiv.org/abs/2409.06389v2",
    "pdf_url": "https://arxiv.org/pdf/2409.06389v2.pdf",
    "title": "Contemporaneous Appearances of Auroral Spiral and Transpolar Arc: Polar   UVI Observations and Global MHD Simulations",
    "abstract": "A local vortex-structured aurora and a large-scale transpolar arc (TPA) were contemporaneously observed by the Polar ultraviolet imager (UVI) when a substorm almost recovered, and the associated interplanetary magnetic field (IMF)BY and BZ polarities were negative and negative-to-positive. The TPA grew along the dawnside auroral oval from the nightside to the dayside, and an auroral spiral and several spots were located azimuthally near the poleward edge of the nightside auroral oval. Both auroras had tailward elongated source regions with scales of ~30 RE (spiral) and more than ~45 RE (TPA). To examine their magnetospheric and ionospheric field-aligned current (FAC) profiles, we performed global magnetohydrodynamic (MHD) simulations, using two different types of code: Block-Adaptive-Tree Solar-wind Roe Upwind Scheme (BATS-R-US) and improved REProduce Plasma Universe (REPPU). Both MHD simulations reproduced the tailward elongated TPA-associated FAC structures. The spiral-associated FAC intensity was, however, approximately three orders of magnitude weaker than the TPA-associated FAC intensity. Only improved REPPU simulation replicated faint but continuous poleward extending streak-like structures without evident FACs, instead of the auroral spiral. Geomagnetic field measurements showed that the spiral had upward (from the ionosphere to the magnetosphere) FACs, and its appearance might be accompanied by ultra-low-frequency Pc5 waves. Our results suggest that 1) a local-scale spiral might be formed with much weaker magnetotail FACs than global-scale TPA-associated FACs, although the spiral source region is elongated tailward, and 2) a solar wind-magnetosphere-ionosphere coupling system with minimal or no significant substorm effects is required to form the spiral with the weak magnetotail FACs.",
    "authors": [
      "Motoharu Nowada",
      "Yukinaga Miyashita",
      "Aoi Nakamizo",
      "Noora Partamies",
      "Quan-Qi Shi"
    ],
    "published": "2024-09-10T10:11:14Z",
    "updated": "2025-09-09T17:48:57Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2509.07927v1",
    "url": "https://arxiv.org/abs/2509.07927v1",
    "pdf_url": "https://arxiv.org/pdf/2509.07927v1.pdf",
    "title": "Unifying Kappa Distribution Models for Non-Equilibrium Space Plasmas: A   Superstatistical Approach Based on Moments",
    "abstract": "From the perspective of non-equilibrium statistical mechanics, modeling the velocity distribution of particles in non-equilibrium, steady-state plasmas presents a significant challenge. Under this context, a family of kappa distributions has been widely used to capture the high-energy tails in space plasmas. These distributions deviate from the canonical Maxwell-Boltzmann statistics and vary significantly in their interpretation of the temperature of an out-of-equilibrium system. In this letter, we establish the validity of any kappa distribution from the standpoint of superstatistics. This study unifies these models by introducing a new kappa distribution based on superstatistical parameters, providing a more general and fundamental framework to connect these distributions and the superstatistical temperature of a system. We demonstrate that the general distribution depends on the thermal characteristics of the modeled temperature distribution population. Furthermore, we present a moment-based velocity distribution that bypasses the traditional temperature debate, relying on the velocity moments. Our findings enhance the understanding of kappa distributions and offer a robust model for non-equilibrium space plasmas.",
    "authors": [
      "Abiam Tamburrini",
      "Sergio Davis",
      "Pablo S. Moya"
    ],
    "published": "2025-09-09T17:12:43Z",
    "updated": "2025-09-09T17:12:43Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.07910v1",
    "url": "https://arxiv.org/abs/2509.07910v1",
    "pdf_url": "https://arxiv.org/pdf/2509.07910v1.pdf",
    "title": "PWFA linear collider improvements -- from previous concepts to HALHF",
    "abstract": "This note summarizes the major design changes from the plasma wakefield linear collider concept presented at Snowmass 2013 to the most recent HALHF 2.0 baseline.",
    "authors": [
      "Erik Adli",
      "Carl A. Lindstrøm"
    ],
    "published": "2025-09-09T16:53:53Z",
    "updated": "2025-09-09T16:53:53Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.07880v1",
    "url": "https://arxiv.org/abs/2509.07880v1",
    "pdf_url": "https://arxiv.org/pdf/2509.07880v1.pdf",
    "title": "Measurement of ion acceleration and diffusion in a laser-driven   magnetized plasma",
    "abstract": "Here we present results from an experiment performed at the GSI Helmholtz Centre for Heavy Ion Research. A mono-energetic beam of chromium ions with initial energies of $\\sim 450$ MeV was fired through a magnetized interaction region formed by the collision of two counter-propagating laser-ablated plasma jets. While laser interferometry revealed the absence of strong fluid-scale turbulence, acceleration and diffusion of the beam ions was driven by wave-particle interactions. A possible mechanism is particle acceleration by electrostatic, short scale length kinetic turbulence, such as the lower-hybrid drift instability.",
    "authors": [
      "J. T. Y. Chu",
      "J. W. D. Halliday",
      "C. Heaton",
      "K. Moczulski",
      "A. Blazevic",
      "D. Schumacher",
      "M. Metternich",
      "H. Nazary",
      "C. D. Arrowsmith",
      "A. R. Bell",
      "K. A. Beyer",
      "A. F. A. Bott",
      "T. Campbell",
      "E. Hansen",
      "D. Q. Lamb",
      "F. Miniati",
      "P. Neumayer",
      "C. A. J. Palmer",
      "B. Reville",
      "A. Reyes",
      "S. Sarkar",
      "A. Scopatz",
      "C. Spindloe",
      "C. B. Stuart",
      "H. Wen",
      "P. Tzeferacos",
      "R. Bingham",
      "G. Gregori"
    ],
    "published": "2025-09-09T16:00:07Z",
    "updated": "2025-09-09T16:00:07Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2412.14311v2",
    "url": "https://arxiv.org/abs/2412.14311v2",
    "pdf_url": "https://arxiv.org/pdf/2412.14311v2.pdf",
    "title": "Performance envelope of laser wakefield accelerators",
    "abstract": "Laser wakefield accelerator experiments have made enormous progress over the past $\\sim 20$ years, but their promise to revolutionize high-energy particle sources is only beginning to be realized. To make the next step toward engineering LWFAs for different accelerator outcomes, we need more reliable and quantitative models to predict performance. Using the data from $>50$ published experiments, we estimate scalings and the performance envelope. We compare the observed scalings with several models in the literature. We find that the total beam energy (centroid energy times beam charge) scales almost linearly with laser energy, supporting the value of investment in progressively higher energy driver lasers. The dataset includes pulse durations from 8 to 160 fs, but only laser wavelengths of 800 nm and 1 \\si{\\micro\\meter}, meaning we could not check proposed wavelength scalings for alternative laser technologies. As a benchmark next-generation case, the observed scalings suggest that achieving a 100-GeV LWFA stage will require a $\\gtrsim 30$ PW laser operating at electron density $<10^{17}/$cm$^3$.",
    "authors": [
      "Lance Labun",
      "Miguel Gracia-Linares",
      "Ou Z. Labun",
      "Stephen V. Milton"
    ],
    "published": "2024-12-18T20:24:03Z",
    "updated": "2025-09-09T15:53:19Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.1016/j.nima.2025.170468"
  },
  {
    "arxiv_id": "2507.11801v2",
    "url": "https://arxiv.org/abs/2507.11801v2",
    "pdf_url": "https://arxiv.org/pdf/2507.11801v2.pdf",
    "title": "Subspace Approximation to the Focused Transport Equation. II. The   Modified Form",
    "abstract": "The transport of energetic particles in a spatially varying magnetic field is described by the focused transport equation. In the past two versions of this equation were investigated. The more commonly used standard form described a pitch-angle isotropization process but does not conserve the norm. In the current paper we consider the focused transport equation in conservative form also called modified focused transport equation. This equation conserves the norm but does not describe pitch-angle isotropization. We use the previously developed subspace method to solve the focused transport equation analytically and numerically. For a pure analytical treatment we employ the two-dimensional subspace approximation. Furthermore, we consider a higher dimensionality for which one needs to evaluate occurring matrix exponentials numerically. This type of semi-numerical approach is much faster than traditional solvers and, therefore, it is very useful.",
    "authors": [
      "B. Klippenstein",
      "A. Shalchi"
    ],
    "published": "2025-07-15T23:49:51Z",
    "updated": "2025-09-09T15:23:56Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR",
    "doi": "10.33232/001c.144238"
  },
  {
    "arxiv_id": "2509.07700v1",
    "url": "https://arxiv.org/abs/2509.07700v1",
    "pdf_url": "https://arxiv.org/pdf/2509.07700v1.pdf",
    "title": "A Generalisable Generative Model for Multi-Detector Calorimeter   Simulation",
    "abstract": "Collider experiments, such as those at the Large Hadron Collider, use the Geant4 toolkit to simulate particle-detector interactions with high accuracy. However, these experiments increasingly require larger amounts of simulated data, leading to huge computing cost. Generative machine learning methods could offer much faster calorimeter shower simulations by directly emulating detector responses. In this work, we present CaloDiT-2, a diffusion model which uses transformer blocks. As is the case for other models explored for this task, it can be applied to specific geometries, however its true strength lies in its generalisation capabilities. Our approach allows pre-training on multiple detectors and rapid adaptation to new ones, which we demonstrate on the LEMURS dataset. It reduces the effort required to develop accurate models for novel detectors or detectors which are under development and have geometries that are changed frequently, requiring up to 25x less data and 20x less training time. To the best of our knowledge, this is the first pre-trained model to be published that allows adaptation in the context of particle shower simulations, with the model also included in the Geant4 toolkit. We also present results on benchmarks on Dataset-2 from the community-hosted CaloChallenge, showing that our models provide one of the best tradeoffs between accuracy and speed from the published models. Our contributions include a mechanism for the creation of detector-agnostic data representations, architectural modifications suitable for the data modality, a pre-training and adaptation strategy, and publicly released datasets and pre-trained models for broad use.",
    "authors": [
      "Piyush Raikwar",
      "Anna Zaborowska",
      "Peter McKeown",
      "Renato Cardoso",
      "Mikolaj Piorczynski",
      "Kyongmin Yeo"
    ],
    "published": "2025-09-09T13:04:37Z",
    "updated": "2025-09-09T13:04:37Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "physics.comp-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.07694v1",
    "url": "https://arxiv.org/abs/2509.07694v1",
    "pdf_url": "https://arxiv.org/pdf/2509.07694v1.pdf",
    "title": "Avoiding Beam Instabilities and Resonances With Circular Modes",
    "abstract": "Beam instabilities and resonances affect the transverse dynamics in particle accelerators and, when encountered, can trigger emittance growth and beam loss. Resonance lines originate from non linear elements and effects in the lattice, imposing strict constraints on the choice of working points and narrowing the available tune space. Circular modes are round coupled beams with non zero angular momentum, provide an alternative beam motion and dynamics. In this study, we derive the third-order sextupole resonance conditions in the coupled (normal-mode) parametrization and show that, with circular-mode lattice design and beam operation, most of these resonance lines are naturally suppresses due to the inherent flatness of the mode.",
    "authors": [
      "Onur Gilanliogullari",
      "Brahim Mustapha",
      "Pavel Snopok"
    ],
    "published": "2025-09-09T12:57:08Z",
    "updated": "2025-09-09T12:57:08Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.18429/JACoW-HIAT2025-TUP14"
  },
  {
    "arxiv_id": "2509.07671v1",
    "url": "https://arxiv.org/abs/2509.07671v1",
    "pdf_url": "https://arxiv.org/pdf/2509.07671v1.pdf",
    "title": "Full-scale Microwave SQUID Multiplexer Readout System for Magnetic   Microcalorimeters",
    "abstract": "The deployment of large cryogenic detector arrays, comprising hundreds to thousands of individual detectors, is highly beneficial for various cutting-edge applications, requiring large statistics, angular resolution or imaging capabilities. The readout of such arrays, however, presents a major challenge in terms of system complexity, parasitic heat load, and cost, which can be overcome only through multiplexing. Among the various multiplexing approaches, microwave SQUID multiplexing currently represents the state of the art, in particular for magnetic microcalorimeter (MMC) readout. In this work, we demonstrate the successful operation of the latest generation of our microwave SQUID multiplexer-based readout system, based on a SQUID multiplexer tailored for MMC readout and a custom full-scale software-defined radio (SDR) electronics, capable of handling up to 400 channels. The system operates reliably across the entire 4-8 GHz frequency band and achieves sufficiently low flux noise levels in flux-ramp-demodulated readout. Our results confirm that our system is fully functional and provides a scalable path towards future large-scale, high-resolution MMC experiments.",
    "authors": [
      "M. Neidig",
      "T. Muscheid",
      "R. Gartmann",
      "L. E. Ardila Perez",
      "M. Wegner",
      "O. Sander",
      "S. Kempf"
    ],
    "published": "2025-09-09T12:37:07Z",
    "updated": "2025-09-09T12:37:07Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.supr-con"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.07621v1",
    "url": "https://arxiv.org/abs/2509.07621v1",
    "pdf_url": "https://arxiv.org/pdf/2509.07621v1.pdf",
    "title": "Comparing Simulated and Observed Particle Energy Distributions through   Magnetic Reconnection in Earth's Magnetotail",
    "abstract": "Magnetic reconnection is an explosive process that accelerates particles to high energies in Earth's magnetosphere, offering a unique natural laboratory to study this phenomenon. We performed fully kinetic 2D simulations of a reconnection event observed by the Magnetospheric Multiscale mission and compared the resulting ion and electron energy distributions with observations. The simulations capture the overall shape and evolution of non-thermal energy distributions for both species, but generally underestimate the very-high-energy tail of the electron spectrum. Variations in numerical parameters have negligible effects on the resulting spectra, while the initial upstream temperatures instead play a critical role in reproducing the observed distributions. This work presents a novel analysis of particle acceleration in fully kinetic modeling of reconnection directly informed by observed, realistic parameters; highlights the limitations of 2D simulations and underlines the need for more realistic simulations (e.g. employing 3D setups) to capture the observed particle energization more accurately.",
    "authors": [
      "Nadja Reisinger",
      "Fabio Bacchini"
    ],
    "published": "2025-09-09T11:49:33Z",
    "updated": "2025-09-09T11:49:33Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.EP",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2507.12681v2",
    "url": "https://arxiv.org/abs/2507.12681v2",
    "pdf_url": "https://arxiv.org/pdf/2507.12681v2.pdf",
    "title": "Augmented Lagrangian methods produce cutting-edge magnetic coils for   stellarator fusion reactors",
    "abstract": "Finding feasible coils for stellarator fusion devices is a critical challenge of realizing this concept for future power plants. Current design efforts struggle to navigate the highly nonconvex optimization landscape, spend considerable resources scanning the parameter space, and may produce suboptimal coils. In this work, we present an augmented Lagrangian approach to tackle the ill-posed problem of coil optimization. We illustrate its effectiveness and versatility by generating coils for five stellarators with very different symmetries and magnetic field shaping. In all cases, we find Pareto-optimal coil solutions that in various ways outperform published coil sets.",
    "authors": [
      "Pedro F. Gil",
      "Weiping Li",
      "Julianne Stratton",
      "Alan A. Kaptanoglu",
      "Eve V. Stenson"
    ],
    "published": "2025-07-16T23:32:11Z",
    "updated": "2025-09-09T08:24:57Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.07448v1",
    "url": "https://arxiv.org/abs/2509.07448v1",
    "pdf_url": "https://arxiv.org/pdf/2509.07448v1.pdf",
    "title": "On SuperKEKB and Implications for FCC-ee",
    "abstract": "SuperKEKB has achieved significantly higher specific luminosity than its predecessor KEKB, and it has proven a much more sustainable machine. It has successfully demonstrated several key design elements of FCC-ee. The design luminosity has not yet been reached, however. This observation is often (mistakenly) used to put into question the reliability of the FCC-ee design luminosity. In this note we review the accomplishments, challenges and obstacles of SuperKEKB, and compare these with the FCC-ee design.",
    "authors": [
      "Frank Zimmermann"
    ],
    "published": "2025-09-09T07:12:21Z",
    "updated": "2025-09-09T07:12:21Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.07406v1",
    "url": "https://arxiv.org/abs/2509.07406v1",
    "pdf_url": "https://arxiv.org/pdf/2509.07406v1.pdf",
    "title": "Design of high-strength, radiopure, electroformed copper-based alloys   for rare-event searches: Impact of layer configuration on heat treatments",
    "abstract": "State-of-the-art and next-generation rare-event search experiments rely on detector materials with stringent requirements on radiopurity and mechanical performance. Additive-free electroformed copper offers exceptional radiopurity, but is limited in mechanical strength, motivating the exploration of application-specific copper-based alloys. Early investigations, based on direct experimentation, explored the synthesis of CuCr alloys through electrodeposition and thermal processing. Subsequently, modeling tools based on the thermodynamic and kinetic properties of the alloy compositions were employed, which led to specific proposals for improved thermal processing. Moreover, the systematic application of computational thermodynamics to materials design further motivated the investigation of CuCrTi alloys, in addition to CuCr alloys. This materials design approach has shaped a trajectory towards designing high-performance, radiopure copper-based alloys, minimizing lengthy and costly trial-and-error. In this work, we explore the impact of initial layer configuration on the effectiveness of heat treatments, paving the way toward manufacturable, radiopure, multicomponent alloys for future low-background experiments.",
    "authors": [
      "D. Spathara",
      "P. Knights",
      "K. Nikolopoulos"
    ],
    "published": "2025-09-09T05:38:21Z",
    "updated": "2025-09-09T05:38:21Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.06230v2",
    "url": "https://arxiv.org/abs/2509.06230v2",
    "pdf_url": "https://arxiv.org/pdf/2509.06230v2.pdf",
    "title": "Complete reflection of nonlinear electromagnetic waves in underdense   pair plasmas enabled by dynamically formed Bragg-like structures",
    "abstract": "Using kinetic simulations and theory, we show that nonlinear electromagnetic waves can make even strongly underdense pair plasmas fully reflective. As the wave compresses and accelerates the plasma, weak reflection seeds a periodic train of density spikes that grow rapidly due to mass symmetry. This moving Bragg-like grating increases reflection and momentum transfer, enabling a transition to a regime where the relativistic plasma-vacuum interface sustains complete reflection. Finite temperature raises the full-reflection density threshold, yet the corresponding density can remain underdense.",
    "authors": [
      "Kavin Tangtartharakul",
      "Alexey Arefiev",
      "Maxim Lyutikov"
    ],
    "published": "2025-09-07T22:36:30Z",
    "updated": "2025-09-09T03:57:43Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.07223v1",
    "url": "https://arxiv.org/abs/2509.07223v1",
    "pdf_url": "https://arxiv.org/pdf/2509.07223v1.pdf",
    "title": "Readout noise of digital frequency multiplexed TES detectors for CUPID",
    "abstract": "Superconducting transition-edge sensor (TES) detectors have been the standard in Cosmic Microwave Background experiments for almost two decades and are now being adapted for use in nuclear physics, such as neutrinoless double beta decay searches. In this paper we focus on a new high-bandwidth frequency multiplexed TES readout system developed for CUPID, a neutrinoless double beta decay experiment that will replace CUORE. In order to achieve the high energy resolution requirements for CUPID, the readout noise of the system must be kept to a minimum. Low TES operating resistance and long wiring between the readout SQUID and the warm electronics are needed for CUPID, prompting a careful consideration of the design parameters of this application of frequency multiplexing. In this work, we characterize the readout noise of the newly designed frequency multiplexed TES readout system for CUPID and construct a noise model to understand it. We find that current sharing between the SQUID coil impedance and other branches of the circuit, as well as the long output wiring, worsen the readout noise of the system. To meet noise requirements, a SQUID with a low input inductance, high transimpedance and/or low dynamic impedance is needed, and the wiring capacitance should be kept as small as possible. Alternatively, the option of adding a cryogenic low-noise amplifier at the output of the SQUID should be explored.",
    "authors": [
      "Michel Adamič",
      "Joseph Camilleri",
      "Chiara Capelli",
      "Matt Dobbs",
      "Tucker Elleflot",
      "Yury G. Kolomensky",
      "Daniel Mayer",
      "Joshua Montgomery",
      "Valentine Novosad",
      "Vivek Singh",
      "Graeme Smecher",
      "Aritoki Suzuki",
      "Bradford Welliver"
    ],
    "published": "2025-09-08T21:04:31Z",
    "updated": "2025-09-08T21:04:31Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2502.21198v3",
    "url": "https://arxiv.org/abs/2502.21198v3",
    "pdf_url": "https://arxiv.org/pdf/2502.21198v3.pdf",
    "title": "AI-Enhanced Self-Triggering for Extensive Air Showers: Performance and   FPGA Feasibility",
    "abstract": "Autonomous self-triggering for radio detection of extensive air showers remains a long-standing challenge, particularly in environments dominated by strong and variable radio-frequency interference. Current radio arrays usually rely on external particle-detector triggers: while this lowers thresholds for vertical showers, it excludes very inclined events, where radio detection is uniquely powerful because the particle cascade is absorbed while the radio pulse remains measurable. In this work, I present a proof-of-principle study showing that deep-learning-based triggering can overcome these limitations, operating robustly under realistic high-interference conditions and within the strict latency constraints of large-scale observatories. Using measured noise traces combined with simulated cosmic-ray pulses, a fully convolutional network was trained and optimised for MHz-scale trigger-trial rates, and its performance was compared to a simple threshold-based trigger, which proved markedly less efficient at the same false-positive rate. The trained model was then quantised with HLS4ML and synthesised with Vitis HLS for multiple FPGA targets. The quantised implementation preserves the floating-point model performance (AUC_float = 0.997, AUC_quant = 0.996) while achieving microsecond-scale inference latencies.These results show that modern FPGA-based AI inference can provide low-latency, radio-only triggering for next-generation cosmic-ray observatories, particularly in regions with strong and variable radio backgrounds. This capability unlocks access to weak and highly inclined air-shower signals--even in noisy environments--thereby broadening the energy range, extending sky coverage, and opening the path toward ultra-high-energy neutrino detection with ground-based radio arrays.",
    "authors": [
      "Qader Dorosti"
    ],
    "published": "2025-02-28T16:15:20Z",
    "updated": "2025-09-08T19:29:07Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2509.07156v1",
    "url": "https://arxiv.org/abs/2509.07156v1",
    "pdf_url": "https://arxiv.org/pdf/2509.07156v1.pdf",
    "title": "The Integrating Miniature Piggyback for Impulsive Solar Hard X-rays   (IMPISH): a spectrometer for the GRIPS-2 balloon campaign",
    "abstract": "The Integrating Miniature Piggyback for Impulsive Solar Hard X-rays (IMPISH) is a piggyback mission originally designed for the second flight of the Gamma-Ray Imager/Polarimeter for Solar flares (GRIPS-2) Antarctic balloon. IMPISH will take measurements of collimated, full-Sun X-ray spectra with the goal of detecting sub-second variations (order of tens of milliseconds) of nonthermal X-ray emission during the impulsive phase of large solar flares to probe particle acceleration mechanisms driven by magnetic reconnection.   The IMPISH detector system, made up of four identical detectors totaling 64 cm$^2$ effective area, is capable of measuring from ~10 keV to over 200 keV through the use of silicon photomultipliers (SiPMs) and LYSO scintillators. At the stratospheric altitude of GRIPS-2, the effective lower energy limit is ~20-30 keV. The geometry of the LYSO crystal has been optimized to balance the light collection efficiency with the effective area required for stratospheric X-ray measurements. Development of the IMPISH detectors has introduced a path for a low-cost solution to fast solar X-ray measurements across a large energy range utilizing commercially available components. The payload has a 3U form factor and has been designed so that both the electronics and detectors may be easily adaptable for space-based missions.",
    "authors": [
      "Reed B. Masek",
      "William Setterberg",
      "Dorcas Oseni",
      "Lestat Clemmer",
      "Lindsay Glesener",
      "Philip Williams",
      "John G. Sample",
      "Amir Caspi",
      "Demoz Gebre-Egziabher",
      "Pascal Saint-Hilaire",
      "Albert Y. Shih",
      "David M. Smith"
    ],
    "published": "2025-09-08T19:09:19Z",
    "updated": "2025-09-08T19:09:19Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.HE",
      "astro-ph.IM",
      "astro-ph.SR",
      "physics.space-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2501.04731v2",
    "url": "https://arxiv.org/abs/2501.04731v2",
    "pdf_url": "https://arxiv.org/pdf/2501.04731v2.pdf",
    "title": "Kinematics Calibration and Excitation Energy Reconstruction for   Solenoidal Spectrometers",
    "abstract": "This work introduces a novel method for reconstructing excitation energy and center-of-mass scattering angle from energy-position data in solenoidal spectrometers, addressing challenges posed by non-linearities at small scattering angles. The approach employs a robust calibration of experimental energy-position data using known excited states, followed by an analytical inverse transformation based on relativistic kinematics and cyclotron motion. Integrated into the HELIOS online analysis routines, this method enables real-time generation of excitation energy spectra and angular distributions during experiments, improving efficiency and accuracy over traditional projection-based methods. The method's effectiveness is demonstrated using the 25Mg(d,p) reaction, highlighting its ability to handle forward-angle data and produce precise kinematic reconstructions.",
    "authors": [
      "T. L. Tang"
    ],
    "published": "2025-01-06T19:56:21Z",
    "updated": "2025-09-08T18:30:38Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.07116v1",
    "url": "https://arxiv.org/abs/2509.07116v1",
    "pdf_url": "https://arxiv.org/pdf/2509.07116v1.pdf",
    "title": "Imaging and Radio Signatures of Shock-Plasmoid Interaction",
    "abstract": "Understanding how shocks interact with coronal structures is crucial for understanding the mechanisms of particle acceleration in the solar corona and inner heliosphere. Using simultaneous radio and white-light observations, we investigate the interaction between a CME-driven shock and a plasmoid. LASCO and STEREO-A COR-2 white-light images are analyzed to track the evolution of the plasmoid, CME and its associated shock, while the Wind/WAVES and STEREO/WAVES dynamic spectra provide complementary radio signatures of the shock-plasmoid interaction at $\\approx$7 R$_\\odot$. An interplanetary Type II radio burst was detected as the shock propagated through the plasmoid. The merging of the plasmoid into the CME was accompanied by interplanetary Type III radio bursts, suggesting escaping electron beams during the reconnection process. These observations clearly demonstrate that shock-plasmoid interactions can enhance the efficiency of particle acceleration associated with CMEs, with implications for electron acceleration in flare and heliospheric current sheets as well.",
    "authors": [
      "Pankaj Kumar",
      "Judith T. Karpen",
      "P. K. Manoharan",
      "N. Gopalswamy"
    ],
    "published": "2025-09-08T18:14:15Z",
    "updated": "2025-09-08T18:14:15Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2509.07104v1",
    "url": "https://arxiv.org/abs/2509.07104v1",
    "pdf_url": "https://arxiv.org/pdf/2509.07104v1.pdf",
    "title": "Cosmic Rays on Galaxy Scales: Progress and Pitfalls for CR-MHD Dynamical   Models",
    "abstract": "Recent years have seen many arguments for cosmic rays (CRs) as an important influence on galactic and circumgalactic (CGM) physics, star and galaxy formation. We present a pedagogical overview of state-of-the-art modeling of CR-magnetohydrodynamics (CR-MHD) on macro scales (~kpc), highlighting their fundamental dependence on the micro (< au) scales of CR gyro orbits and meso (~pc) scales of CR mean-free-paths, intended to connect the extragalactic, Galactic, and plasma CR transport modeling communities. We note the pitfalls and systematic errors that arise from older assumptions in CR modeling, including: use of a simple Fokker-Planck equation or ad-hoc two-moment formalisms for transport; assumption of leaky boxes or plane-parallel or shear-periodic boundaries for comparison to local interstellar medium (LISM) observations; ignoring detailed LISM constraints on CR spectra (e.g. focusing only on extragalactic observables or spectrally integrated models); assuming CR transport is mediated by classical models of advection, streaming from self-confinement (super-Alfvenic or Alfvenic), or extrinsic turbulence. We emphasize recent progress addressing these: development of rigorously-derived CR-MHD equations; use of global, 3D galaxy+halo models for LISM comparisons; new methods for full-spectrum dynamics; novel models for intermittent scattering and/or new drivers. We compile extragalactic+LISM observations to show how ~GeV CR transport is being rapidly constrained in the CGM, and present phenomenological models which can be used in future simulations. We conclude by highlighting critical open questions for micro, meso, and macro-scale CR-MHD simulations.",
    "authors": [
      "Philip F. Hopkins"
    ],
    "published": "2025-09-08T18:00:40Z",
    "updated": "2025-09-08T18:00:40Z",
    "categories": [
      "astro-ph.GA",
      "astro-ph.CO",
      "astro-ph.HE",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.GA"
  },
  {
    "arxiv_id": "2509.06943v1",
    "url": "https://arxiv.org/abs/2509.06943v1",
    "pdf_url": "https://arxiv.org/pdf/2509.06943v1.pdf",
    "title": "First Production of Skipper-CCD Modules for the DAMIC-M Experiment",
    "abstract": "The DAMIC-M experiment will search for sub-GeV dark matter particles with a large array of silicon skipper charge-coupled devices (CCDs) at the Modane Underground Laboratory (LSM) in France. After five years of development, we recently completed the production of 28 CCD modules at the University of Washington, each consisting of four 9-megapixel skipper CCDs. Material screening and background controls were implemented to meet stringent radio-purity targets, while extensive testing was employed to select science-grade CCDs for the modules and confirm their excellent performance after fabrication. Further testing at LSM will select 26 of these modules (${\\sim}$350 g active mass) to be installed and operated in the DAMIC-M detector in early 2026.",
    "authors": [
      "H. Lin",
      "M. Traina",
      "S. Paul",
      "K. Aggarwal",
      "I. Arnquist",
      "N. Castello-Mor",
      "A. E. Chavarria",
      "M. Conde",
      "C. De Dominicis",
      "M. Huehn",
      "S. Hope",
      "T. Hossbach",
      "L. Iddir",
      "I. Lawson",
      "R. Lou",
      "S. Munagavalasa",
      "D. Norcini",
      "P. Privitera",
      "B. Roach",
      "R. Roehnelt",
      "N. Rocco",
      "R. Saldanha",
      "T. Schleider",
      "R. Smida",
      "B. Stillwell",
      "A. Vellozzi",
      "D. Venegas-Vargas",
      "R. Yajur",
      "N. Avalos",
      "X. Bertou",
      "C. Bourgeois",
      "J. Brandt",
      "C. Centeno Lorca",
      "J. Cuevas-Zepeda",
      "A. Dastgheibi-Fard",
      "O. Deligny",
      "R. Desani",
      "M. Dhellot",
      "J. Duarte-Campderros",
      "E. Estrada",
      "D. Florin",
      "N. Gadola",
      "R. Gaior",
      "E. -L. Gkougkousis",
      "J. Gonzalez Sanchez",
      "B. Kavanagh",
      "B. Kilminster",
      "A. Letessier Selvon",
      "P. Loaiza",
      "D. Loeb",
      "A. Lopez-Virto",
      "D. Moya Martin",
      "J. Noonan",
      "X. Ni",
      "M. Perez Martinez",
      "D. Peterson",
      "O. Pochon",
      "D. Reynet",
      "P. Robmann",
      "M. Settimo",
      "S. Smee",
      "T. Van Wechel",
      "R. Vilar",
      "P. Vallerand",
      "A. Vollhardt",
      "D. Wolf",
      "C. Zhu",
      "Y. Zhu"
    ],
    "published": "2025-09-08T17:54:36Z",
    "updated": "2025-09-08T17:54:36Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.CO",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2504.15978v2",
    "url": "https://arxiv.org/abs/2504.15978v2",
    "pdf_url": "https://arxiv.org/pdf/2504.15978v2.pdf",
    "title": "Unveiling the electrodynamic nature of spacetime collisions",
    "abstract": "Gravitational waves from merging binary black holes present exciting opportunities for understanding fundamental aspects of gravity, including nonlinearities in the strong-field regime. One challenge in studying and interpreting the dynamics of binary black hole collisions is the intrinsically geometrical nature of spacetime, which in many ways is unlike that of other classical field theories. By exactly recasting Einstein's equations into a set of coupled nonlinear Maxwell equations closely resembling classical electrodynamics, we visualize the intricate dynamics of gravitational electric and magnetic fields during inspiral, merger and ring-down of a binary black hole collision.",
    "authors": [
      "Siddharth Boyeneni",
      "Jiaxi Wu",
      "Elias R. Most"
    ],
    "published": "2025-04-22T15:27:20Z",
    "updated": "2025-09-08T17:19:48Z",
    "categories": [
      "gr-qc",
      "astro-ph.HE",
      "hep-th",
      "physics.plasm-ph"
    ],
    "primary_category": "gr-qc",
    "doi": "10.1103/995s-wxl7"
  },
  {
    "arxiv_id": "2508.20299v3",
    "url": "https://arxiv.org/abs/2508.20299v3",
    "pdf_url": "https://arxiv.org/pdf/2508.20299v3.pdf",
    "title": "Magnetic Centrifuge Effects in Ultrafast Laser Ablation Plasmas",
    "abstract": "A self-consistent model is developed to explain the anomalously large enrichment of nickel isotopes observed in ablation plumes from ultrafast laser irradiation of solid surfaces. The model is based on the spontaneous creation of a magnetic centrifuge in the ablation plume and the associated cyclotron rotation of plasma ions with rotation rates on the order of 10^9 radians per second. Mass separation occurs around the radial coordinate of cylindrical symmetry with longitudinal axis normal to the ablating surface. A Gaussian shaped radial magnetic field distribution is extracted for Ni isotopes with peak field of 53 Megagauss and average field of 20 Megagauss. In addition to cyclotron rotation of ions, a rigid rotor model is also presented that is associated with the hydrodynamic rotation of the entire plasma and is shown to be of little consequence for the isotope enrichment. Cyclotron rotations dominate the process. A profound resonance of enrichment is observed for specific cyclotron charge states and is shown to be associated with Ion Bernstein Wave (IBW) coupling that provides electrostatic acceleration to these resonant orbits.",
    "authors": [
      "Peter P. Pronko",
      "Paul A. Van Rompay"
    ],
    "published": "2025-08-27T22:10:22Z",
    "updated": "2025-09-08T17:07:25Z",
    "categories": [
      "physics.plasm-ph",
      "physics.app-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.06519v2",
    "url": "https://arxiv.org/abs/2508.06519v2",
    "pdf_url": "https://arxiv.org/pdf/2508.06519v2.pdf",
    "title": "Comparative Simulation of CEvNS Recoil Observables in Geant4 Using   Germanium, Argon, and Xenon Targets",
    "abstract": "We present a Geant4-based simulation study of Coherent Elastic Neutrino-Nucleus Scattering (CEvNS) for three commonly used detector targets: Germanium, Argon, and Xenon. A custom CEvNS model was implemented, including differential cross sections and Helm form factors. Recoil energy spectra, angular distributions, and form factor effects were analyzed using ROOT. The results reveal expected trends: heavier nuclei lead to lower recoil energies and increased form factor suppression. This work provides a simulation framework to support future theoretical and experimental studies in neutrino physics and dark matter searches.",
    "authors": [
      "Yusuf Havvat"
    ],
    "published": "2025-07-31T10:14:47Z",
    "updated": "2025-09-08T15:05:09Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "81V35",
      "F.2.2"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.04279v2",
    "url": "https://arxiv.org/abs/2509.04279v2",
    "pdf_url": "https://arxiv.org/pdf/2509.04279v2.pdf",
    "title": "Energy Confinement Time Scaling Law Derived from Paz-Soldan NF 2024",
    "abstract": "Results from C. Paz-Soldan et al 2024 Nucl. Fusion 64 094002 demonstrate encouraging energy confinement properties for the negative triangularity scenario, similar to or exceeding the scaling of the IPB98(y,2) law. This work describes the procedure with which a new scaling law was regressed specifically from the data from the aforementioned article. Given the relatively small size of the single-machine dataset, kernel density estimation was employed to minimize sampling bias and bootstrapping was used to give a realistic estimate of the large uncertainties from the regression. The resulting power law shows a robustly stronger dependence on plasma current and more severe power degradation as compared to the H-mode scaling law.",
    "authors": [
      "P. Lunia",
      "A. O. Nelson",
      "C. Paz-Soldan"
    ],
    "published": "2025-09-04T14:55:46Z",
    "updated": "2025-09-08T14:12:09Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.12586v2",
    "url": "https://arxiv.org/abs/2507.12586v2",
    "pdf_url": "https://arxiv.org/pdf/2507.12586v2.pdf",
    "title": "Extended thermal cycling of ATLAS ITk strip modules with and without   stress mitigating interposers",
    "abstract": "This paper investigates critical mechanical failures during stand-alone thermocycling of ATLAS Inner Tracker strip pre-production modules. Five modules undergo extended thermocycling after adequately levelling thermal chucks and introducing interlocks for unattended operation. Module bow evolution is tracked via regular sensor metrology. All five modules exhibit bow increases with a mean of $146\\pm 27~\\mu$m when raising maximum cycling temperatures from $20^\\circ$C to $40^\\circ$C. Four such modules exhibit sensor fractures when cycled to $-44^\\circ$C. A stress-mitigating layer of silicone gel and Kapton film interposer is introduced to three further modules, with detailed quality control data establishing electromechanical viability. No significant bow change of $1\\pm 10~\\mu$m is observed after ten cycles between $[+40, -44]^\\circ$C relative to $[+20, -44]^\\circ$C. Two interposer modules undergo 200 thermocycles up to $[+56, -44]^\\circ$C without fracturing. This decreased sensor deformation and fracturing is interpreted as evidence for reduced thermal stress.",
    "authors": [
      "Nikolai Fomin",
      "Bart Hommels",
      "Thomas Ivison",
      "Kosala Kariyapperuma",
      "Jesse Liu"
    ],
    "published": "2025-07-16T19:13:40Z",
    "updated": "2025-09-08T13:24:15Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.06659v1",
    "url": "https://arxiv.org/abs/2509.06659v1",
    "pdf_url": "https://arxiv.org/pdf/2509.06659v1.pdf",
    "title": "Optically interrogated liquid crystal-based, charge-mode accelerometer   telemetry",
    "abstract": "A hybrid optoelectronic vibration sensing system is presented, combining a conventional charge-mode piezoelectric accelerometer with an optical fiber interface via a liquid crystal-based electrical-to-optical transducer. This configuration allows the accelerometer's electrical output to be converted into an optical signal, enabling remote signal transmission over optical fiber. The same fiber could also be used to supply power to the system, offering a compact and interference-resistant solution suitable for challenging environments such as those with high voltages or explosive risks. Experimental results demonstrate a displacement resolution ranging from \\Delta z = 0.015 nm at 0.160 nm displacement, up to \\Delta z = 0.720 nm at 351 nm displacement, or equivalently, from \\alpha = 0.0005 m/s2 to 0.057 m/s2 in acceleration. Despite undergoing electrical-to-optical and optical-to-electrical signal conversion, the system maintains high sensitivity, low noise levels, and signal integrity. This proof-of-concept optically interrogated accelerometer highlights a path toward reducing sensor infrastructure requirements by eliminating the need for conventional power supplies and electromagnetic shielding, which are typically required in fully electrical accelerometer systems.",
    "authors": [
      "Zourab Brodzeli",
      "Can Nerse",
      "Benjamin Halkon",
      "John Canning",
      "Sebastian Oberst"
    ],
    "published": "2025-09-08T13:17:03Z",
    "updated": "2025-09-08T13:17:03Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2506.18688v2",
    "url": "https://arxiv.org/abs/2506.18688v2",
    "pdf_url": "https://arxiv.org/pdf/2506.18688v2.pdf",
    "title": "Prism-based compensation of group delay dispersion in the components of   a femtosecond laser resonator and analysis of the influence of prism   configuration on laser radiation parameters",
    "abstract": "A mathematical algorithm is described for calculating the minimum distance between prisms and the allowable prism insertion depth into the laser beam when solving the general problem of intracavity group delay dispersion (GDD) compensation. GDD is caused by the optical elements of the master oscillator in a femtosecond laser system. The calculation was carried out using analytical and geometrical methods. The influence of changing the distance between the prisms and the depth of their insertion into the laser beam on the GDD compensation has been investigated. Under experimental conditions, this changes the Q-factor of the laser resonator, which determines the central wavelength of the radiation and its spectral width in a titanium-sapphire laser.",
    "authors": [
      "I. V. Beznosenko",
      "A. V. Vasyliev",
      "A. I. Povrozin",
      "V. P. Leshchenko",
      "O. O. Svystunov",
      "G. V. Sotnikov"
    ],
    "published": "2025-06-23T14:28:29Z",
    "updated": "2025-09-08T13:12:46Z",
    "categories": [
      "physics.optics",
      "physics.acc-ph",
      "78A05, 78A60",
      "F.0; F.m"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2502.13330v2",
    "url": "https://arxiv.org/abs/2502.13330v2",
    "pdf_url": "https://arxiv.org/pdf/2502.13330v2.pdf",
    "title": "Timing characterization of MALTA and MALTA2 pixel detectors using Micro   X-ray source",
    "abstract": "The MALTA monolithic active pixel detector is developed to address some of the challenges anticipated in future high-energy physics detectors. As part of its characterization, we conducted timing studies necessary to provide a figure of merit for this family of monolithic pixel detectors. MALTA has a metal layer in front-end electronics, and the conventional laser technique is not suitable for timing studies due to the reflection of the laser from the metallic surface. X-rays have been employed as a more effective alternative for penetration through these layers. The triggered X-ray set-up is designed to study timing measurements of monolithic detectors. The timing response of the X-ray set-up is characterized using an LGAD. The timing response of the MALTA and MALTA2 pixel detectors is studied, and the best response time of MALTA2 pixel detectors is measured at about 2.6 ns.",
    "authors": [
      "G. Dash",
      "P. Allport",
      "I. Asensi Tortajada",
      "P. Behera",
      "D. V. Berlea",
      "D. Bortoletto",
      "C. Buttar",
      "V. Dao",
      "L. Fasselt",
      "L. Flores Sanz de Acedo",
      "M. Gazi",
      "L. Gonella",
      "V. Gonzalez",
      "G. Gustavino",
      "S. Haberl",
      "T. Inada",
      "P. Jana",
      "L. Li",
      "H. Pernegger",
      "P. Riedler",
      "W. Snoeys",
      "C. A Solans Sanchez",
      "M. van Rijnbach",
      "M. Vazquez Nunez",
      "A. Vijay",
      "J. Weick",
      "S. Worm"
    ],
    "published": "2025-02-18T23:24:22Z",
    "updated": "2025-09-08T12:27:58Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "J.2"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2506.07213v2",
    "url": "https://arxiv.org/abs/2506.07213v2",
    "pdf_url": "https://arxiv.org/pdf/2506.07213v2.pdf",
    "title": "AttoSHINE: Generation of continuous-wave terawatt-scale attosecond X-ray   pulses at SHINE",
    "abstract": "Attosecond X-ray pulses are a critical tool for tracking ultrafast electron dynamics in condensed matter, molecular systems, and strongly correlated materials. Recent breakthroughs have pushed X-ray free electron lasers (XFELs) into the attosecond domain, significantly surpassing their previous femtosecond capabilities. Building on these advancements, this work investigates the potential of the Shanghai High Repetition Rate XFEL and Extreme Light Facility (SHINE), China's first continuous-wave (CW) XFEL, to generate intense attosecond X-ray pulses, thereby offering transformative capabilities for X-ray science. Through comprehensive start-to-end simulations, we show that SHINE is capable of producing hard X-ray pulses with peak powers reaching the terawatt-scale and average pulse durations of approximately 300 as. This is achieved using a self-chirping scheme within the existing machine configuration, requiring no additional hardware. Our findings demonstrate that CW XFELs can generate intense attosecond X-ray pulses at megahertz repetition rates, opening new opportunities for real-time studies of electronic dynamics in complex systems.",
    "authors": [
      "Bingyang Yan",
      "Chenzhi Xu",
      "Si Chen",
      "Duan Gu",
      "Ye Chen",
      "Jiawei Yan",
      "Haixiao Deng"
    ],
    "published": "2025-06-08T16:32:35Z",
    "updated": "2025-09-08T11:58:34Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.06581v1",
    "url": "https://arxiv.org/abs/2509.06581v1",
    "pdf_url": "https://arxiv.org/pdf/2509.06581v1.pdf",
    "title": "Express Diagnostic of Intense Laser-driven MeV Radiation Source using   Copper Isotopes",
    "abstract": "We explored the generation and diagnosis of high-brightness MeV bremsstrahlung radiation caused by intense beam of relativistic electrons propagating in a tantalum converter. The intense electron beam was produced through direct laser acceleration mechanism in the interaction of relativistic high-power sub-ps laser pulse with near critical density plasma. We propose to detect the divergence angle and photon fluence of high-brightness and high-energy gamma radiation source based on the nuclear activation method. The radioactive 62^Cu was generated through photonuclear reactions 63^Cu(gamma,n) 62^Cu and the subsequent beta^+ decay of 62^Cu was measured to derive characteristics of the gamma radiation source. This method provides an express approach to diagnose the laser-driven MeV radiation source and a potential efficient way to produce 62^Cu isotopes.",
    "authors": [
      "Mingzhe Yang",
      "Ziyao wang",
      "Jieru Ren",
      "Wenqing Wei",
      "Benzheng Chen",
      "Bubo Ma",
      "Shizheng Zhang",
      "Lirong Liu",
      "Fangfang Li",
      "Jie Xiong",
      "Hongwei Yue",
      "Zeyu Lai",
      "Wenxuan Li",
      "Dietter. H. H. Hoffmann",
      "Olga N. Rosmej",
      "Parysatis Tavana",
      "Nikolay. E Andreev",
      "Iskander. R. Umarov",
      "Zhigang Deng",
      "Wei Qi",
      "Shaoyi Wang",
      "Quanping Fan",
      "Zongqiang Yuan",
      "Weiwu Wang",
      "Bo Cui",
      "Xiaohui Zhang",
      "Yuchi Wu",
      "Weimin Zhou",
      "Jingqin Su",
      "Rui Cheng",
      "Yongtao Zhao"
    ],
    "published": "2025-09-08T11:53:08Z",
    "updated": "2025-09-08T11:53:08Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.06537v1",
    "url": "https://arxiv.org/abs/2509.06537v1",
    "pdf_url": "https://arxiv.org/pdf/2509.06537v1.pdf",
    "title": "3D-printed components for electron-ion trapping: Tests of functionality   and ultra-high vacuum compatibility",
    "abstract": "We demonstrate the ultra-high vacuum compatibility of a microwave-driven electron trap and an atomic oven (for atomic beam generation) fabricated through 3D printing via Laser Powder Bed Fusion (L-PBF). The trap integrates into a coaxial microwave cavity, enabling stable, narrow-band, high-amplitude oscillations of the electric field at the electrodes. The design also supports simultaneous trapping of ions. The oven performs well in ultrahigh vacuum (UHV) environments without significant outgassing. In addition to achieving the UHV regime for 3D-printed components, pressure variations and their potential impact on electron-ion trapping experiments were investigated over a month. Our results show that experiments with electrons photodetached from trapped and laser-cooled ions are feasible with the trap and oven manufactured by the L-PBF method. These findings establish a foundation for future experiments in microwave detection and the study of low-energy ion-electron interactions at room temperature.",
    "authors": [
      "Vineet Kumar",
      "Niklas V. Lausti",
      "Jiří Hajnyš",
      "Ivan Hudák",
      "David Motyčka",
      "Adam Jelínek",
      "Michal Hejduk"
    ],
    "published": "2025-09-08T10:43:39Z",
    "updated": "2025-09-08T10:43:39Z",
    "categories": [
      "physics.atom-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2503.04437v3",
    "url": "https://arxiv.org/abs/2503.04437v3",
    "pdf_url": "https://arxiv.org/pdf/2503.04437v3.pdf",
    "title": "Single-photon counting pixel detector for soft X-rays",
    "abstract": "Soft X-ray experiments at synchrotron light sources are essential for a wide range of research fields. However, commercially available detectors for this energy range often cannot deliver the necessary combination of quantum efficiency, signal-to-noise ratio, dynamic range, speed, and radiation hardness within a single system. While hybrid detectors have addressed these challenges effectively in the hard X-ray regime, specifically with single photon counting pixel detectors extensively used in high-performance synchrotron applications, similar solutions are desired for energies below 2 keV.   In this work, we introduce the first single-photon-counting hybrid pixel detector capable of detecting X-ray energies as low as 550 eV, utilizing the internal amplification of Low-Gain Avalanche Diode (LGAD) sensors. This detector is thoroughly characterized in terms of Signal-to-Noise Ratio and Detective Quantum Efficiency. We demonstrate its capabilities through ptychographic imaging at MAX IV 4th generation synchrotron light source at the Fe L$_3$-edge (707 eV), showcasing the enhanced detection performance of the system. This development sets a new benchmark for soft X-ray applications at synchrotrons, paving the way for significant advancements in imaging and analysis at lower photon energies.",
    "authors": [
      "Filippo Baruffaldi",
      "Anna Bergamaschi",
      "Maurizio Boscardin",
      "Martin Brueckner",
      "Tim A. Butcher",
      "Maria Carulla",
      "Matteo Centis Vignali",
      "Roberto Dinapoli",
      "Simone Finizio",
      "Erik Froejdh",
      "Dominic Greiffenberg",
      "Aldo Mozzanica",
      "Giovanni Paternoster",
      "Nicholas W. Phillips",
      "Jörg Raabe",
      "Bernd Schmitt",
      "Jiaguo Zhang"
    ],
    "published": "2025-03-06T13:51:58Z",
    "updated": "2025-09-08T10:42:10Z",
    "categories": [
      "physics.ins-det",
      "physics.app-ph"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1038/s42005-025-02240-9"
  },
  {
    "arxiv_id": "2507.11593v3",
    "url": "https://arxiv.org/abs/2507.11593v3",
    "pdf_url": "https://arxiv.org/pdf/2507.11593v3.pdf",
    "title": "Characterizing the Delivered Spill Structure of Medical Proton and   Carbon-Ion Beams at MedAustron using a High Frequency Silicon Carbide Readout",
    "abstract": "Medical synchrotrons are often used for testing instrumentation in high-energy physics or non-clinical research in medical physics. In many applications of medical synchrotrons, such as microdosimetry and ion imaging, precise knowledge of the spill structure and instantaneous particle rate is crucial. Conventional ionization chambers, while omnipresent in clinical settings, suffer from limitations in charge resolution and integration time, making single-particle detection at high dose rates unfeasible. To address these limitations, we present a beam detection setup based on a silicon carbide (SiC) sensor and a monolithic microwave integrated circuit (MMIC), capable of detecting single particles with a full width at half maximum (FWHM) pulse duration of 500 ps. At the MedAustron ion therapy center, we characterized the spill structure of proton and carbon-ion beams delivered to the irradiation room beyond the timescale of the maximum ion revolution frequency in the synchrotron. The resulting data offer valuable insights into the beam intensity at small time scales and demonstrate the capabilities of SiC-based systems for high-flux beam monitoring.",
    "authors": [
      "Matthias Knopf",
      "Andreas Gsponer",
      "Matthias Kausel",
      "Simon Waid",
      "Sebastian Onder",
      "Stefan Gundacker",
      "Daniel Radmanovac",
      "Giulio Magrin",
      "Thomas Bergauer",
      "Albert Hirtl"
    ],
    "published": "2025-07-15T16:21:23Z",
    "updated": "2025-09-08T10:21:48Z",
    "categories": [
      "physics.ins-det",
      "physics.med-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2505.17686v2",
    "url": "https://arxiv.org/abs/2505.17686v2",
    "pdf_url": "https://arxiv.org/pdf/2505.17686v2.pdf",
    "title": "Sub-keV Electron Recoil Calibration for Macroscopic Cryogenic   Calorimeters using a Novel X-ray Fluorescence Source",
    "abstract": "Percent-level calibration of cryogenic macro-calorimeters with energy thresholds below 100~eV are crucial for light Dark Matter (DM) searches and reactor neutrino studies based on coherent elastic neutrino-nucleus scattering (CEvNS). This paper presents a novel calibration source based on X-ray fluorescence (XRF) of light elements. It uses a $^{55}$Fe source to irradiate a two-staged target arrangement, emitting characteristic emission lines from 677\\,eV to 6.5\\,keV. We demonstrate the potential of this new XRF source to calibrate a 0.75 gram CaWO$_4$ crystal of the NUCLEUS and CRAB experiments. Additionally, we introduce CryoLab, an advanced analysis tool for cryogenic detector data, featuring robust methods for data processing, calibration, and high-level analysis, implemented in MATLAB and HDF5. We also present a phenomenological model for energy resolution, which incorporates statistical contributions, systematic effects, and baseline noise, enabling a novel approach to evaluating athermal phonon collection efficiency in macro-calorimeters based on transition edge sensors (TES).",
    "authors": [
      "H. Abele",
      "G. Angloher",
      "B. Arnold",
      "M. Atzori Corona",
      "A. Bento",
      "E. Bossio",
      "J. Burkhart",
      "F. Cappella",
      "M. Cappelli",
      "N. Casali",
      "R. Cerulli",
      "A. Cruciani",
      "G. Del Castello",
      "M. del Gallo Roccagiovine",
      "S. Dorer",
      "A. Erhart",
      "M. Friedl",
      "S. Fichtinger",
      "V. M. Ghete",
      "M. Giammei",
      "C. Goupy",
      "D. Hauff",
      "F. Jeanneau",
      "E. Jericha",
      "M. Kaznacheeva",
      "A. Kinast",
      "H. Kluck",
      "A. Langenkämper",
      "T. Lasserre",
      "D. Lhuillier",
      "M. Mancuso",
      "R. Martin",
      "B. Mauri",
      "A. Mazzolari",
      "L. McCallin",
      "H. Neyrial",
      "C. Nones",
      "L. Oberauer",
      "T. Ortmann",
      "L. Pattavina",
      "L. Peters",
      "F. Petricca",
      "W. Potzel",
      "F. Pröbst",
      "F. Pucci",
      "F. Reindl",
      "M. Romagnoni",
      "J. Rothe",
      "N. Schermer",
      "J. Schieck",
      "S. Schönert",
      "C. Schwertner",
      "L. Scola",
      "G. Soum-Sidikov",
      "L. Stodolsky",
      "R. Strauss",
      "M. Tamisari",
      "R. Thalmeier",
      "C. Tomei",
      "M. Vignati",
      "M. Vivier",
      "A. Wex",
      "K. v. Mirbach",
      "V. Wagner"
    ],
    "published": "2025-05-23T09:56:01Z",
    "updated": "2025-09-08T08:40:19Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1007/s10909-025-03330-2"
  },
  {
    "arxiv_id": "2509.06437v1",
    "url": "https://arxiv.org/abs/2509.06437v1",
    "pdf_url": "https://arxiv.org/pdf/2509.06437v1.pdf",
    "title": "Particle acceleration up to the synchrotron burn-off limit in   relativistic magnetized turbulence",
    "abstract": "In high-energy astrophysics, interpreting observed spectra hinges on understanding the competition between energy gains and radiative losses. To progress along these lines, we report on particle-in-cell simulations of particle acceleration in relativistic, magnetized turbulent pair plasmas including synchrotron radiative losses. Our key finding is that the particle energy spectrum does not terminate at this maximal energy but extends beyond with a steepened spectrum, up to the synchrotron burn-off limit where particles cool within a gyrotime. For our adopted parameters (magnetization $\\sigma \\approx 1 $ and amplitude $\\delta B/B_0\\simeq 1$), the particle distribution follows ${\\rm d}n/{\\rm d}\\gamma\\propto \\gamma^{-s}$ with $s\\simeq 3$ below the predicted maximal energy, then steepens to $s\\simeq 4$ above. The particle distribution and the radiated synchrotron spectra display strong variability near the cutoff energy down to timescales well below the largest eddy turn-around time. We substantiate our results by demonstrating that the acceleration rate itself displays a broken powerlaw-like distribution whose maximal value is the gyrofrequency. The highest energy particles are accelerated by a generalized Fermi process in ideal electric fields, driven by a gradient of the $4$--velocity field $u_E$ of the magnetic field lines of relativistic amplitude, $\\delta u_E \\gtrsim c$, ordered on a scale comparable to the particle gyroradius. We contend that this is a generic feature of relativistic, large-amplitude turbulence. Lastly, we apply our results to the Crab nebula, which exhibits a hierarchy of characteristic Lorentz factors similar to that studied here. We conclude that stochastic acceleration in this environment is a promising mechanism for explaining the highest-energy part of the synchrotron spectral energy distribution, and its variability. [Abridged]",
    "authors": [
      "M. Lemoine",
      "V. Bresci",
      "L. Gremillet"
    ],
    "published": "2025-09-08T08:34:10Z",
    "updated": "2025-09-08T08:34:10Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2509.06432v1",
    "url": "https://arxiv.org/abs/2509.06432v1",
    "pdf_url": "https://arxiv.org/pdf/2509.06432v1.pdf",
    "title": "Study of a coaxial vacuum arc thruster plume and its interaction with   applied magnetic field",
    "abstract": "A hybrid model where ions are treated as particles and electrons with fluid equations for magnetized electron flux is adapted in order to simulate a vacuum arc source. This source is a candidate for solid propellant propulsion system of micro- and nano-satellites. We show preliminary results of the plume and interelectrode region properties with and without the influence of an imposed magnetic field. We compare the results with experimental data, and we find that the magnetic collimation is overestimated in the simulation",
    "authors": [
      "M Jimenez Diaz",
      "L Garrigues",
      "G J M Hagelaar",
      "F Gaboriau",
      "L Liard",
      "L Herrero",
      "A Blanchet"
    ],
    "published": "2025-09-08T08:26:12Z",
    "updated": "2025-09-08T08:26:12Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.06366v1",
    "url": "https://arxiv.org/abs/2509.06366v1",
    "pdf_url": "https://arxiv.org/pdf/2509.06366v1.pdf",
    "title": "Effect of superthermal electrons on the Quantum electron acoustic double   layers in dense astrophysical plasmas",
    "abstract": "Electron acoustic double layers (EADLs) have been investigated in four component unmagnetized dense quantum plasmas consisting of stationary background ions and two electron populations, cold and hot, with the superthermal kappa distributed electrons. Using the quantum hydrodynamic (QHD) model and the reductive perturbation technique, a generalized Korteweg de Vries (KdV) equation was derived, and stationary analytical solutions were obtained. The analysis revealed that superthermal electrons substantially influence the amplitude, width, and polarity of EADLs. Numerical results indicated that decreasing the spectral index kappa or increasing the relative density of kappa electrons to hot electrons intensifies nonlinear effects, producing stronger compressive and rarefactive structures. It is also found that kappa plays a more dominant role than the density ratio in controlling EADL properties in dense astrophysical environments.",
    "authors": [
      "Aakanksha Singh",
      "Punit Kumar"
    ],
    "published": "2025-09-08T06:44:14Z",
    "updated": "2025-09-08T06:44:14Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.06276v1",
    "url": "https://arxiv.org/abs/2509.06276v1",
    "pdf_url": "https://arxiv.org/pdf/2509.06276v1.pdf",
    "title": "A Compact Two-Dimensional Radiation Detector for Educational   Applications",
    "abstract": "Recent advances in low-cost, portable cosmic-ray detectors have broadened citizen-science engagement in particle physics studies. Imaging applications such as muography, however, remain largely inaccessible because existing detectors typically require tens to hundreds of sensors, making them costly and complex. This gap underscores the need for a compact imaging detector.   In this study, we developed SAKURA, a palm-sized two-dimensional muon scintillation detector that uses only four silicon photomultipliers (SiPMs) and can be built for less than 1,000 USD. Its spatial resolution was evaluated using a 5 GeV/c muon beam at CERN's T10 beamline in September 2024, yielding 13.4 mm along the x-axis and 7.48 mm along the y-axis. The entire study, including designing and testing the detector, and analysing data, was undertaken by high school students, demonstrating that SAKURA makes radiation imaging accessible and practical even for non-specialists with the help of some professional scientists.",
    "authors": [
      "Chiori Matsushita",
      "Mihiro Nukiwa",
      "Aoi Atobe",
      "Yuzuka Sasaki",
      "Manami Sawai",
      "Rikako Kono",
      "Seyma Esen",
      "Martin Schwinzerl",
      "Kazuo S. Tanaka"
    ],
    "published": "2025-09-08T01:56:01Z",
    "updated": "2025-09-08T01:56:01Z",
    "categories": [
      "physics.ins-det",
      "physics.ed-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.06186v1",
    "url": "https://arxiv.org/abs/2509.06186v1",
    "pdf_url": "https://arxiv.org/pdf/2509.06186v1.pdf",
    "title": "Implementation of Prototype Permanent Microundulators",
    "abstract": "We report the implementation of two types of helical microundulators with a 6 mm period, built from axially magnetized helices fabricated from a single piece of rare-earth magnet. The first device, composed of two oppositely magnetized longitudinal helices, produces a transverse on-axis field exceeding 0.93 T. The second, a hybrid design with two oppositely longitudinally pre-magnetized rare-earth helices alternating with two unmagnetized steel helices, reaches about 1.5 T on axis. Both devices have a 1 mm bore, which required dedicated field-measurement techniques. When used in compact FELs from terahertz to X-ray, such microundulators can provide higher electron oscillation amplitude and radiated power than planar microundulators of similar period. As an illustrative case, we present an ultra-compact SASE XFEL concept in which the studied hybrid helical microundulator can provide approximately 48 GW of radiation power at a wavelength of about 5 angstrom.",
    "authors": [
      "Eyal Magory",
      "Vladimir L. Bratman",
      "Ahiya Steiner",
      "Nezah Balal"
    ],
    "published": "2025-09-07T19:35:24Z",
    "updated": "2025-09-07T19:35:24Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.06088v1",
    "url": "https://arxiv.org/abs/2509.06088v1",
    "pdf_url": "https://arxiv.org/pdf/2509.06088v1.pdf",
    "title": "Time-Embedded Convolutional Neural Networks for Modeling Plasma Heat   Transport",
    "abstract": "We introduce a time-embedded convolutional neural network (TCNN) for modeling spatiotemporal heat transport in plasmas, particularly under strongly nonlocal conditions. In our earlier work, the LMV-Informed Neural Network (LINN) (Luo et al., arXiv:2506.16619) combined prior knowledge from the LMV model with kinetic Particle-in-Cell (PIC) data to improve kernel-based heat-flux predictions. While effective under moderately nonlocal conditions, LINN produced physically inconsistent kernels in strongly time-dependent regimes due to its reliance on the quasi-stationary LMV formulation. To overcome this limitation, TCNN is designed to capture the coupled evolution of both the normalized heat flux and the characteristic nonlocality parameter using a unified neural architecture informed by underlying physical principles. Trained on fully kinetic PIC simulations, TCNN accurately reproduces nonlocal dynamics across a broad range of collisionalities. Our results demonstrate that the combination of time modulation, coupled prediction, and convolutional depth significantly enhances predictive performance, offering a data-driven yet physically consistent framework for multiscale plasma transport problems.",
    "authors": [
      "Mufei Luo",
      "Charles Heaton",
      "Yizhen Wang",
      "Daniel Plummer",
      "Mila Fitzgerald",
      "Francesco Miniati",
      "Sam M. Vinko",
      "Gianluca Gregori"
    ],
    "published": "2025-09-07T15:04:39Z",
    "updated": "2025-09-07T15:04:39Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.07808v2",
    "url": "https://arxiv.org/abs/2506.07808v2",
    "pdf_url": "https://arxiv.org/pdf/2506.07808v2.pdf",
    "title": "Thermal Radiation Exchange between Nanoparticles Heated by Arc Discharge",
    "abstract": "The heating of particles by plasma radiation plays a critical role in space science involving dusty plasma as well as in industrial processes such as plasma vapor deposition, microchip production, etching and plasma fusion. Numerical modeling of radiation heat transfer from plasma to nano-scale particles includes exchange of scattered thermal radiation between particles-an effect that was neglected in prior studies in which temperature of particles was estimated. Thermal modeling of gas loaded with nanoparticles differs from a typical multiphase flow, where particles are assumed to be in thermal equilibrium with the surrounding gas. In contrast, the temperature of nanoparticles heated by radiation is significantly higher than the local gas temperature. The nanoparticles volume heating by radiation is markedly different from conventional surface heating experience by macroscale particles. The larger particles are heated to higher temperatures than smaller ones. The study includes numerical modeling of thermal radiation scattered by particles in the Rayleigh regime in where particles radii are much smaller compared to the radiation wavelength and the distance between particles is larger than the dominant radiation wavelength. The study investigates the effects of reduction in conduction heat flux by reducing the gas pressure and using alternating noble gases. Additionally, it investigates the role of enhancement of radiation heat flux from the arc. The computational results show that the re-radiation by larger, heated nanoparticles is important to obtain the accurate temperature of particles. This inter-particle thermal interaction leads to higher temperatures in smaller particles than models assuming thermally isolated particles would predict.",
    "authors": [
      "A. Povitsky",
      "M. N. Shneider"
    ],
    "published": "2025-06-09T14:36:47Z",
    "updated": "2025-09-07T13:39:48Z",
    "categories": [
      "physics.plasm-ph",
      "physics.flu-dyn"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.06021v1",
    "url": "https://arxiv.org/abs/2509.06021v1",
    "pdf_url": "https://arxiv.org/pdf/2509.06021v1.pdf",
    "title": "Resonance density range of absolute two-plasmon decay instability",
    "abstract": "We present a new insight into absolute two-plasmon decay (TPD) instability in nonuniform plasmas by identifying the resonance density range as the key parameter governing the growth of the resonant absolute modes. This range is defined as the density interval within which these resonant modes still exhibit growth in homogeneous plasmas. This range properly characterizes the spatial growth region of the resonant absolute modes in a series of linear fluid simulations across broad parameter spaces. Building on this insight, we investigate the absolute growth of TPD modes driven by laser pulses with intensity modulations, a common feature in broadband lasers used to suppress laser plasma instabilities. We establish the relationship between the resonance density range and the threshold time interval between intensity peaks, beyond which absolute growth is suppressed.",
    "authors": [
      "C. Yao",
      "J. Li",
      "L. Hao",
      "R. Yan",
      "Q. Jia",
      "Y-K. Ding",
      "J. Zheng"
    ],
    "published": "2025-09-07T11:35:09Z",
    "updated": "2025-09-07T11:35:09Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.07024v1",
    "url": "https://arxiv.org/abs/2509.07024v1",
    "pdf_url": "https://arxiv.org/pdf/2509.07024v1.pdf",
    "title": "TGLF-SINN: Deep Learning Surrogate Model for Accelerating Turbulent   Transport Modeling in Fusion",
    "abstract": "The Trapped Gyro-Landau Fluid (TGLF) model provides fast, accurate predictions of turbulent transport in tokamaks, but whole device simulations requiring thousands of evaluations remain computationally expensive. Neural network (NN) surrogates offer accelerated inference with fully differentiable approximations that enable gradient-based coupling but typically require large training datasets to capture transport flux variations across plasma conditions, creating significant training burden and limiting applicability to expensive gyrokinetic simulations. We propose \\textbf{TGLF-SINN (Spectra-Informed Neural Network)} with three key innovations: (1) principled feature engineering that reduces target prediction range, simplifying the learning task; (2) physics-guided regularization of transport spectra to improve generalization under sparse data; and (3) Bayesian Active Learning (BAL) to strategically select training samples based on model uncertainty, reducing data requirements while maintaining accuracy. Our approach achieves superior performance with significantly less training data. In offline settings, TGLF-SINN reduces logarithmic root mean squared error (LRMSE) by 12. 4\\% compared to the current baseline \\base. Using only 25\\% of the complete dataset with BAL, we achieve LRMSE only 0.0165 higher than \\base~and 0.0248 higher than our offline model (0.0583). In downstream flux matching applications, our NN surrogate provides 45x speedup over TGLF while maintaining comparable accuracy, demonstrating potential for training efficient surrogates for higher-fidelity models where data acquisition is costly and sparse.",
    "authors": [
      "Yadi Cao",
      "Futian Zhang",
      "Wesley Liu",
      "Tom Neiser",
      "Orso Meneghini",
      "Lawson Fuller",
      "Sterling Smith",
      "Raffi Nazikian",
      "Brian Sammuli",
      "Rose Yu"
    ],
    "published": "2025-09-07T09:36:51Z",
    "updated": "2025-09-07T09:36:51Z",
    "categories": [
      "physics.plasm-ph",
      "cs.LG"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.18145v2",
    "url": "https://arxiv.org/abs/2508.18145v2",
    "pdf_url": "https://arxiv.org/pdf/2508.18145v2.pdf",
    "title": "Spiral Tuning of Wire-metamaterial Cavity for Plasma Haloscope",
    "abstract": "Axions are hypothetical particles that provide a compelling solution to two major mysteries in modern physics: the strong CP problem and the nature of dark matter. The plasma haloscope has been proposed as a promising approach for probing the higher-mass regime for dark matter axions by employing a periodic arrangement of conducting wires. In this work, we introduce a novel tuning mechanism for such wire-based structures by arranging the wires into a spiral configuration. This design enables continuous frequency tuning of 25% with a single central rotation while maintaining the form factor. It also achieves scanning speeds several times faster than traditional tuning approaches, primarily due to the circular perimeter geometry, making it well suited for solenoidal magnet bores. To validate the concept, we fabricated a prototype cavity with six spiral arms and experimentally demonstrated its feasibility, obtaining frequency tuning in close agreement with numerical simulations.",
    "authors": [
      "Jacob Lindahl",
      "Rustam Balafendiev",
      "Gagandeep Kaur",
      "Gaganpreet Singh",
      "Andrea Gallo Rosso",
      "Jan Conrad",
      "Jon E. Gudmundsson",
      "Junu Jeong"
    ],
    "published": "2025-08-25T15:53:53Z",
    "updated": "2025-09-07T07:56:31Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2509.05948v1",
    "url": "https://arxiv.org/abs/2509.05948v1",
    "pdf_url": "https://arxiv.org/pdf/2509.05948v1.pdf",
    "title": "Upgrades of the ATLAS Zero Degree Calorimeter System for Run 3 at the   Large Hadron Collider",
    "abstract": "Experimental studies of ultra-relativistic heavy ion collisions at the Large Hadron Collider (LHC) depend crucially on Zero Degree Calorimeters (ZDCs) that measure neutrons produced at near-beam rapidity in nucleus-nucleus collisions. In hadronic nuclear collisions these neutrons are mainly spectator neutrons, those that do not scatter from opposing nucleons during the collision. As a result, the ZDCs provide a vital probe of heavy ion collision geometry. The ZDCs are also essential in the study of ultra-peripheral collisions that are initiated by photons associated with the electric fields of one or both nuclei. Coherent photon emission typically leaves the photon emitter intact, making the observation of no ZDC signal, on one or both sides, a tag of such processes. The ATLAS ZDCs, built prior to Run 1 were substantially upgraded for LHC Run 3. The primary upgrades included replacement of the quartz Cherenkov radiator with $\\text{H}_2$-doped fused silica rods; installation of fast air-core signal cables between the ZDC and the ATLAS USA15 cavern; new LED-based calibration system; and new electronics implemented for readout and fully-digital triggering. The ZDCs were also augmented with new \"Reaction Plane Detectors\" (RPDs) designed to measure the transverse centroid of multi-neutron showers to allow event-by-event reconstruction of the directed-flow plane in nuclear collisions. The Run~3 ZDC detectors, including the RPDs, are described in detail with emphasis on aspects that are new for Run~3.",
    "authors": [
      "Giulio Avoni",
      "Marco Bruschi",
      "Gianluca Canale",
      "Zvi Citron",
      "Brian Cole",
      "Eitan Dahle",
      "Bartosz Dziedzic",
      "Bar Glik",
      "Matthias Grosse-Perdekamp",
      "Yhan Guo",
      "Krzysztof Korcy",
      "Matthew Hoppesch",
      "Mason Housenga",
      "Chad Lantz",
      "Yi Liu",
      "Riccardo Longo",
      "Samantha Lund",
      "Daniel MacLean",
      "Stefano Meneghini",
      "Marco Milovanovic",
      "Goran Mladenovic",
      "Soumya Mohapatra",
      "Farah Mohammed Rafee",
      "Yftach Moyal",
      "Carla Sbarra",
      "Antonio Sbrizzi",
      "Blair Seidlitz",
      "Shir Shenkar",
      "Peter Steinberg",
      "Lion Sudit",
      "Daniel Valuch",
      "Kristopher Young"
    ],
    "published": "2025-09-07T06:59:03Z",
    "updated": "2025-09-07T06:59:03Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.05859v1",
    "url": "https://arxiv.org/abs/2509.05859v1",
    "pdf_url": "https://arxiv.org/pdf/2509.05859v1.pdf",
    "title": "Dissociative recombination of NeH+ with low-energy electrons:   Multichannel quantum defect theory including non-adiabatic couplings",
    "abstract": "Theoretical investigation of the dissociative recombination (DR) of NeH+ with low-energy electrons in the regime where the process occurs without direct potential energy curve crossings is presented. The calculations are performed using multichannel quantum defect theory, incorporating non-adiabatic couplings between electronic states. Unlike the previous treatment of the DR of HeH+, where only first-order radial couplings A(R) were considered, our formulation also incorporates the second-order terms B(R), together with a radial density of states \\b{eta}{\\nu} (R) to describe the transition into the ionization continuum. This development uses a large number of potential energy curves and non-adiabatic couplings of NeH characterized by us previously, enabling a consistent modeling of the DR process. The resulting cross sections show good agreement with the available experimental data and fill a gap in theoretical data below 4.5 eV, where no detailed quantum calculations are currently available.",
    "authors": [
      "Riyad Hassaine",
      "Janos Zsolt Mezei",
      "Dahbia Talbi",
      "Jonathan Tennyson",
      "Ioan F. Schneider"
    ],
    "published": "2025-09-06T22:54:12Z",
    "updated": "2025-09-06T22:54:12Z",
    "categories": [
      "physics.atm-clus",
      "astro-ph.IM",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.atm-clus"
  }
]