{
  "arxiv_id": "2508.10627v1",
  "url": "https://arxiv.org/abs/2508.10627v1",
  "pdf_url": "https://arxiv.org/pdf/2508.10627v1.pdf",
  "title": "Probing ultrafast heating and ionization dynamics in solid density   plasmas with time-resolved resonant X-ray absorption and emission",
  "abstract": "Heating and ionization are among the most fundamental processes in ultra-short, relativistic laser-solid interactions. However, capturing their spatiotemporal evolution experimentally is challenging due to the inherently transient and non-local thermodynamic equilibrium (NLTE) nature. Here, time-resolved resonant X-ray emission spectroscopy, in conjunction with simultaneous X-ray absorption imaging, is employed to investigate such complex dynamics in a thin copper wire driven by an optical high-intensity laser pulse, with sub-picosecond temporal resolution. The diagnostic leverages the high brightness and narrow spectral bandwidth of an X-ray free-electron laser, to selectively excite resonant transitions of highly charged ions within the hot dense plasma generated by the optical laser. The measurements reveal a distinct rise-and-fall temporal evolution of the resonant X-ray emission yield-and consequently the selected ion population-over a 10 ps timescale, accompanied by an inversely correlated x-ray transmission. In addition, off-resonance emissions with comparable yields on both sides of the XFEL photon energy are clearly observed, indicating balanced ionization and recombination rates. Furthermore, experimental results are compared with comprehensive simulations using atomic collisional-radiative models, PIC, and MHD codes to elucidate the underlying physics. The comparison reveals that typical models overestimate the plasma heating under the extreme conditions achieved in our experiment, highlighting the requirement for improved modeling of NLTE collisional processes for predictive capabilities. These results are of broad interest to the high-energy-density science and inertial fusion energy research, both as an experimental platform for accessing theoretically challenging conditions and as a benchmark for improving models of high-power laser-plasma interactions.",
  "authors": [
    "Lingen Huang",
    "Mikhail Mishchenko",
    "Michal Šmíd",
    "Oliver Humphries",
    "Thomas R. Preston",
    "Xiayun Pan",
    "Long Yang",
    "Johannes Hagemann",
    "Thea Engler",
    "Yangzhe Cui",
    "Thomas Kluge",
    "Carsten Baehtz",
    "Erik Brambrink",
    "Alejandro Laso Garcia",
    "Sebastian Göde",
    "Christian Gutt",
    "Mohamed Hassan",
    "Hauke Höppner",
    "Michaela Kozlova",
    "Josefine Metzkes-Ng",
    "Masruri Masruri",
    "Motoaki Nakatsutsumi",
    "Masato Ota",
    "Özgül Öztürk",
    "Alexander Pelka",
    "Irene Prencipe",
    "Lisa Randolph",
    "Martin Rehwald",
    "Hans-Peter Schlenvoigt",
    "Ulrich Schramm",
    "Jan-Patrick Schwinkendorf",
    "Monika Toncian",
    "Toma Toncian",
    "Jan Vorberger",
    "Karl Zeil",
    "Ulf Zastrau",
    "Thomas E. Cowan"
  ],
  "published": "2025-08-14T13:26:57Z",
  "updated": "2025-08-14T13:26:57Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}