{
  "arxiv_id": "2507.13907v3",
  "url": "https://arxiv.org/abs/2507.13907v3",
  "pdf_url": "https://arxiv.org/pdf/2507.13907v3.pdf",
  "title": "Novel techniques of imaging interferometry analysis to study gas and   plasma density for laser-plasma experiments",
  "abstract": "Laser-plasma based experiments are always more demanding about the plasma features which need to be generated during the interaction. This is valid for laser-plasma acceleration as well as for inertial confinement fusion experiments. Most of these experiments are moving toward high repetition rate operation regimes, making even more demanding the requests on the plasma sources and the diagnostics to be implemented.   Interferometry is one of the most used methods to characterize these sources, since it allows for non-perturbative, single-shot measurements either of the neutral gas or the plasma density. The design of the interferometric setup is non-trivial and needs to be shaped on the actual conditions of the experiment. Similarly, the analysis of the raw data is a complex task, prone to many sources of error and dependent on the manual inputs.   In this work, we will present the techniques we are developing for the analysis of the interferograms to measure both the gas and plasma density. We will show the methods, the progress and the problems we encountered in the development of novel routines of analysis based on machine learning. The architectures and the methods to obtain data used for training and testing them will be introduced. The study is ongoing and preliminary results with synthetic data will be presented. The goal is to set up a fast and operator independent diagnostic for the feedback of plasma sources toward high repetition rate experiments.",
  "authors": [
    "F. Filippi",
    "M. Cipriani",
    "S. Mastrostefano",
    "M. Scisciò",
    "F. Consoli"
  ],
  "published": "2025-07-18T13:37:07Z",
  "updated": "2025-09-02T09:53:19Z",
  "categories": [
    "physics.plasm-ph",
    "physics.data-an",
    "physics.optics"
  ],
  "primary_category": "physics.plasm-ph"
}