{
  "arxiv_id": "2509.02518v1",
  "url": "https://arxiv.org/abs/2509.02518v1",
  "pdf_url": "https://arxiv.org/pdf/2509.02518v1.pdf",
  "title": "The Far-Infrared Enhanced Survey Spectrometer (FIRESS) for PRIMA:   Approach and Estimated Performance",
  "abstract": "We present the architectural concept for the Far-Infrared Enhanced Survey Spectrometer (FIRESS) for the Probe Mission for far-IR Astrophysics (PRIMA). FIRESS spans the 24--235 micron range with four R ~ 100 slit-fed grating modules, each coupling to a 24 (spatial) by 84 (spectral) pixel array of kinetic inductance detectors (KIDs). All four arrays are read out simultaneously, and a point source of interest can be coupled to two of the four bands at a time. A Fourier transform module can be engaged over a portion of the FIRESS slits to create a high-resolution mode in which the light is intercepted, processed by the interferometer then reinserted into the path to the grating modules for detection. We provide a simulation and description of the technique that will be used to obtain high-resolution spectra. We identify the most important system requirements imposed by the detector system, finding that they are met with the existing design. Finally, we present our performance modeling, including both direct estimates given our current design status, as well as durable guidelines for developing general-observer programs.",
  "authors": [
    "C. M.",
    "Bradford",
    "Alan J. Kogut",
    "Dale Fixsen",
    "Klaus Pontoppidan",
    "C. Darren Dowell",
    "Jason Glenn",
    "Thomas Pagano",
    "Joseph Green",
    "Marc Foote",
    "James McGuire",
    "Michael Rodger",
    "Robert Calvet",
    "Hien Nguyen",
    "Steve Hailey-Dunsheath",
    "Logan Foote",
    "Elijah Kane",
    "Reinier M. J. Janssen",
    "Margaret Meixner",
    "Alexandra Pope",
    "Alberto Bolatto",
    "JD Smith"
  ],
  "published": "2025-09-02T17:13:36Z",
  "updated": "2025-09-02T17:13:36Z",
  "categories": [
    "astro-ph.IM",
    "astro-ph.GA",
    "physics.ins-det"
  ],
  "primary_category": "astro-ph.IM"
}