{
  "arxiv_id": "2509.01741v1",
  "url": "https://arxiv.org/abs/2509.01741v1",
  "pdf_url": "https://arxiv.org/pdf/2509.01741v1.pdf",
  "title": "Forward and Backward Electron Acceleration by Radially Polarized   Ultra-Intense Laser Focus Seeded By Field Ionization of High Charge States of   Neon",
  "abstract": "Thanks to the fabrication of large aperture phase optics, ultra-intense relativistic laser plasma interaction (RLPI) experiments with complex polarization states are becoming feasible. In this work, we perform a computational investigation of direct acceleration of electrons produced during ionization of underdense neon gas using a tightly focused and radially polarized Petawatt-class short pulse lasers by numerically solving the relativistically invariant Lorentz equations, incorporating semi-classical tunneling ionization and Monte Carlo type sampling of the focal volume. The accelerated electrons energy gain increases at longer laser wavelengths and GeV energies are reached for electrons ionized from the neon inner shells, which are field ionized near the peak of the pulse. Backward acceleration of electrons is observed for a range of initial positions and phases of ionization of neon charge states. This apparent counterintuitive phenomenon is directly linked to the radial polarization state of the incident laser beam that results in a strong longitudinal electric field Ez when tightly focused, where electrons ionized near the focal center at the phase when Ez is pointed toward the forward propagation direction experiences an initial push in the backward direction. A parametric study of the phenomenon by varying laser parameters is presented, and a 3D particle in cell (PIC) simulation is considered to confirm the existence of this phenomenon.",
  "authors": [
    "Nour El Houda Hissi",
    "Gregory K. Ngirmang",
    "Joseph Smith",
    "Enam A. Chowdhury"
  ],
  "published": "2025-09-01T19:49:01Z",
  "updated": "2025-09-01T19:49:01Z",
  "categories": [
    "physics.plasm-ph",
    "physics.atom-ph"
  ],
  "primary_category": "physics.plasm-ph"
}