{
  "arxiv_id": "2504.02405v3",
  "url": "https://arxiv.org/abs/2504.02405v3",
  "pdf_url": "https://arxiv.org/pdf/2504.02405v3.pdf",
  "title": "Impact of helium ion irradiation on the thermal properties of superconducting nanowire single-photon detectors",
  "abstract": "SNSPDs are indispensable for applications ranging from quantum information processing to deep-space optical communications, owing to their high detection efficiency, low dark counts, and excellent timing resolution. However, further improving the intrinsic detection efficiency (IDE) remains crucial for optimizing SNSPD performance. Ion irradiation has recently emerged as a powerful post-fabrication method to enhance SNSPD characteristics. Here, we studied the effects of He-ion irradiation on the thermal properties of NbN SNSPDs. We systematically examine the evolution of thermal boundary conductance as a function of ion fluence (0-1.1E17 ions/cm2), observing a 57% decrease from 127 to 54 W/m^2K^4 with increasing fluence, followed by saturation at approximately 9E16 ions/cm2. At this fluence, the minimum hotspot relaxation time measurements indicate a 41% increase, rising from 17 to 24 ps,while the electron-phonon interaction time decreases, with the magnitude of change depending on temperature and sample batch.TEM reveals defect formation at the NbN/SiO2 interface (6-8 nm) and He-bubble formation within the SiO2 layer (30-260 nm), contributing to the extended thermal relaxation time. These irradiation-induced modifications play a key role in enhancing the IDE of the treated devices. We further demonstrate a post-irradiation SNSPD showing a saturated IDE plateau at 2000 nm from 2.7 K to 28 mK, enabled by thermal modifications and a weakly wavelength-dependent avalanche-assisted mechanism. Our findings highlight ion irradiation as a valuable tool for thermal tailoring in SNSPDs and advance the understanding of detection physics and defect engineering in superconducting optoelectronics.",
  "authors": [
    "Yi-Yu Hong",
    "Yu-Ze Wang",
    "Wei-Jun Zhang",
    "Jia-Hao Hu",
    "Jia-Min Xiong",
    "Dong-Wei Chu",
    "Xin Ou",
    "Wen-Tao Wu",
    "Xiao-Fu Zhang",
    "Hui-Qin Yu",
    "Pu-Sheng Yuan",
    "Hao Li",
    "Ling Wu",
    "Zhen Wang",
    "Li-Xing You"
  ],
  "published": "2025-04-03T08:54:30Z",
  "updated": "2025-11-13T06:23:48Z",
  "categories": [
    "physics.app-ph",
    "physics.ins-det",
    "quant-ph"
  ],
  "primary_category": "physics.app-ph"
}