{
  "arxiv_id": "2511.10438v1",
  "url": "https://arxiv.org/abs/2511.10438v1",
  "pdf_url": "https://arxiv.org/pdf/2511.10438v1.pdf",
  "title": "Self-organisation through layering of $β$-plane like turbulence in plasmas and geophysical fluids",
  "abstract": "Staircase formation and layering is studied in simplified, potential vorticity conserving models of plasmas and geophysical fluids, by investigating turbulent self-organisation and nonlinear saturation with different mechanisms of free energy production -- forcing or linear instability -- and with standard or modified zonal flow responses. To this end, staircase formation in both the standard and modified Charney-Hasegawa-Mima equations with stochastic forcing, along with two different simple instability driven models -- one from a plasma and from a geophysical context -- are studied and compared. In these studies, it is observed that $β$-plane turbulence that does not distinguish between zonal and non-zonal perturbations (i.e., standard zonal response) gradually forms large-scale, elliptic zonal structures that merge progressively, regardless of whether it is driven by forcing (though it should be slow enough to allow wave couplings) or by the baroclinic instability, using for example a two-layer model. Conversely, the plasma system, with its modified zonal response, can rapidly form straight, stationary jets of well-defined size, again regardless of the way it is driven: by stochastic forcing or by the dissipative drift instability. Furthermore, the instability-driven plasma system exhibits a phase transition between a zonal flow dominated state and an eddy dominated state. In both states, saturation is possible without large-scale friction.",
  "authors": [
    "P. L. Guillon",
    "G. Dif-Pradalier",
    "Y. Sarazin",
    "D. W. Hughes",
    "Ö. D. Gürcan"
  ],
  "published": "2025-11-13T16:00:45Z",
  "updated": "2025-11-13T16:00:45Z",
  "categories": [
    "physics.plasm-ph",
    "physics.flu-dyn"
  ],
  "primary_category": "physics.plasm-ph"
}