{
  "arxiv_id": "2511.09975v1",
  "url": "https://arxiv.org/abs/2511.09975v1",
  "pdf_url": "https://arxiv.org/pdf/2511.09975v1.pdf",
  "title": "Autonomous X-ray Fluorescence Mapping of Chemically Heterogeneous Systems via a Correlative Feature Detection Framework",
  "abstract": "We present X-AutoMap, a modular framework for autonomous X-ray fluorescence (XRF) mapping that enables chemically informed targeting of regions of interest through a correlative feature detection strategy. The system integrates classical computer vision and rule-based logic to identify features based on spatial relationships across multiple elemental maps, rather than relying solely on intensity or morphology. Tight integration with the Bluesky control infrastructure at the NSLS-II Hard X-ray Nanoprobe (HXN) beamline enables real-time, closed-loop scan orchestration. Applied to a chemically heterogeneous urban PM2.5 sample, X-AutoMap reduced high-resolution acquisition time from over 44 hours to approximately 10 hours by targeting compositionally significant features identified from coarse scans. High-resolution results revealed diverse particle types, including fully mixed, partially overlapping, and spatially distinct multi-element structures, demonstrating the ability of the framework to isolate chemically relevant features with minimal user intervention. The framework supports interactive and autonomous modes, operates within hardware constraints via grid-based scanning, and is robust across varying sample conditions. Future extensions will incorporate machine learning and probabilistic sampling to further improve detection sensitivity and scan efficiency. X-AutoMap is currently in active use at HXN and provides a flexible foundation for scalable, intelligent imaging workflows at synchrotron beamlines.",
  "authors": [
    "Carlos Deleon",
    "Dmitri Gavrilov",
    "Peggy ODay",
    "Ajith Pattammattel"
  ],
  "published": "2025-11-13T05:12:46Z",
  "updated": "2025-11-13T05:12:46Z",
  "categories": [
    "physics.ins-det",
    "cs.HC"
  ],
  "primary_category": "physics.ins-det"
}