{
  "arxiv_id": "2511.10476v1",
  "url": "https://arxiv.org/abs/2511.10476v1",
  "pdf_url": "https://arxiv.org/pdf/2511.10476v1.pdf",
  "title": "Collisional and magnetic effects on the polarization of the solar oxygen infrared triplet",
  "abstract": "Context: The scattering polarization of the infrared (IR) triplet of neutral oxygen (O\\,\\textsc{i}) near 777\\,nm provides a powerful diagnostic of solar atmospheric conditions. However, interpreting such polarization requires a rigorous treatment of isotropic depolarizing collisions between O\\,\\textsc{i} atoms and neutral hydrogen.   Aims: We aim to investigate the combined effects of collisional and magnetic depolarization in shaping the alignment of O\\,\\textsc{i} levels (and thus the polarization of the O\\,\\textsc{i} IR triplet).   Methods: We compute, for the first time, a comprehensive set of collisional depolarization and polarization transfer rates for the relevant O\\,\\textsc{i} energy levels. These rates are incorporated into a multi-level atomic model, and the statistical equilibrium equations (SEE) are solved to quantify the impact of collisions and magnetic fields on atomic alignment.   Results: Our calculations indicate that elastic collisions with neutral hydrogen, together with the Hanle effect of turbulent magnetic fields stronger than about 20 G, efficiently suppress the bulk of the atomic alignment in deep photospheric conditions where hydrogen densities exceed $n_{\\mathrm{H}} \\sim 10^{16}$ cm$^{-3}$. In the chromosphere, however, the lower hydrogen density weakens collisional depolarization, allowing polarization to persist.   Conclusions: Our results are consistent with a chromospheric origin for the linear polarization signals of the O I IR triplet. Future studies should combine accurate non-LTE radiative transfer with reliable collisional rates in order to achieve fully consistent modeling.",
  "authors": [
    "Moncef Derouich",
    "Saleh Qutub"
  ],
  "published": "2025-11-13T16:41:39Z",
  "updated": "2025-11-13T16:41:39Z",
  "categories": [
    "astro-ph.SR",
    "physics.atom-ph",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.SR"
}