{
  "arxiv_id": "2508.10459v1",
  "url": "https://arxiv.org/abs/2508.10459v1",
  "pdf_url": "https://arxiv.org/pdf/2508.10459v1.pdf",
  "title": "Multiphysics Simulation and First Prototype Development of a Microwave   Plasma System for Chemical Vapour Deposition (CVD) Applications",
  "abstract": "With the aid of COMSOL multiphysics simulations, a compact microwave plasma reactor operated at 2.45 GHz frequency has been designed for diamond film deposition. The reactor consists of a cylindrical cavity that resonates in the fundamental mode $TM_{01p}$ with a longitudinal field variation (p = 1). Investigations on microwave electric field and hydrogen $(H_{2})$ plasma characteristics inside the microwave plasma cavity have been carried out, which assisted in the resonant cavity optimizations. The new reactor design includes a unique antenna structure which facilitates better thermal management and gas inlet arrangement. Parametric analysis of the effect of increase in microwave power, gas pressure and synergistic effects of power and pressure variations on the $H_{2}$ plasma characteristics such as electron density, gas temperature, and atomic hydrogen density have been performed computationally to estimate the optimize reactor operating conditions. Observations from our simulations indicate that the cavity design is able to operate within a range of microwave power and gas pressure upto $P_{in}=6$ kW and $p_{0}=30$ kPa respectively. Preliminary experimental validation which includes vacuum integrity and $H_{2}$ plasma ignition tests inside the cavity are also reported.",
  "authors": [
    "Akash Akash",
    "Sanjeev Kumar Pandey",
    "Venkata Sai Teja Madana",
    "S. Manikandan",
    "Guhan Gunasekaran",
    "Sundar Ravi",
    "Sethu Narayanana",
    "C. Nikhil",
    "Nishant Sirse",
    "S. Sathyan",
    "N. Arunachalam",
    "M. S Ramachandra Rao"
  ],
  "published": "2025-08-14T08:59:57Z",
  "updated": "2025-08-14T08:59:57Z",
  "categories": [
    "physics.plasm-ph",
    "physics.app-ph"
  ],
  "primary_category": "physics.plasm-ph"
}