{
  "arxiv_id": "2409.07073v4",
  "url": "https://arxiv.org/abs/2409.07073v4",
  "pdf_url": "https://arxiv.org/pdf/2409.07073v4.pdf",
  "title": "Dependence of the Solar Wind Plasma Density on Moderate- and Extremely   High-Geomagnetic Activity Elucidated by Potential Learning",
  "abstract": "The relationship between moderate and extremely high levels of geomagnetic activity, represented by the Kp index (2- to 5+ and 6- to 9), and solar wind conditions during southward IMF intervals was revealed utilizing a newly developed machine learning technique. Potential learning (PL) is a neural network algorithm that emphasizes input parameters with the highest variance during training and identifies the most significant ones influencing the outputs based on a computed metric called \"potentiality\". We focus on the dependence of solar wind plasma density on moderate-geomagnetic conditions. It has been unclear from what stage of geomagnetic activity the solar wind density begins to control the Kp level. Previously, PL extracted solar wind velocity as the predominant parameter at extremely low (0 to 1+) and high-Kp ranges under southward IMF. In this study, the IMF three components, solar wind speed, and plasma density from the OMNI database (1998-2019), covering solar cycle 23 to early 25, were used as inputs. Again, PL selected solar wind velocity as the most significant parameter for moderate and extremely high Kp. The potentiality of solar wind density for these ranges was, however, 3.5 times higher than in the previous study, suggesting its impact on geomagnetic activity cannot be ignored. We statistically investigated the relation between solar wind speed and plasma density used as PL inputs under all Kp levels. Above moderate Kp, geomagnetic conditions become high even under slow solar wind if density is large, suggesting that not only velocity but also density contributes significantly. These PL and statistical investigations show that solar wind density begins to regulate Kp above moderate geomagnetic activity under southward IMF. They also help understand the relationship between solar wind and geomagnetic activity and forecast geomagnetic activity under various IMF conditions.",
  "authors": [
    "Ryozo Kitajima",
    "Motoharu Nowada",
    "Ryotaro Kamimura"
  ],
  "published": "2024-09-11T07:48:27Z",
  "updated": "2025-09-02T12:28:48Z",
  "categories": [
    "physics.space-ph",
    "physics.comp-ph",
    "physics.data-an",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.space-ph"
}