{
  "arxiv_id": "2509.02455v1",
  "url": "https://arxiv.org/abs/2509.02455v1",
  "pdf_url": "https://arxiv.org/pdf/2509.02455v1.pdf",
  "title": "SOLPS-ITER Numerical Simulations of ITER-scale Snowflake Divertors:   Low-Field-Side SF-/SF+ and High-Field-Side SF-/SF+ Configurations",
  "abstract": "With edge plasma code SOLS-ITER, we study four Snowflake (SF) configurations for an ITER-size tokamak, with toroidal magnetic field BT=5T, major radius R=5m and plasma current Ip=10MA. Our aim is to provide insights on SF divertor design for future devices. In this work, the impacts of magnetic geometry and divertor target geometry in the four types of SF configurations on plasma behavior and power exhaust performance are investigated in detail. Low-recycling regime, high-recycling and detachment in the four types of SF divertors are obtained through an upstream density scan. The secondary X-point positions of SF divertors are systematically varied to examine their impact. For Low-Field-Side (LFS) SF- and High-Field-Side (HFS) SF- divertors the observed power splitting, induced by the secondary X-point, is consistent with experimental observations. The effect of target geometry is studied by comparing the flat target plates with the ITER-like divertor shape. The overall simulation results reveal a notable consequence of the LFS SF- divertor: closed structure of the inner target with high inclined plate can compress recycling neutrals originating from the HFS divertor region into the LFS SOL and PFR regions. This results in considerable volumetric dissipation through strong ionization and recombination, causing the connected outer target region to detach. This feature can be considered in the design of the LFS SF- divertor for future devices. For the LFS and HFS SF+ divertors, the region between the two X-points exhibits strong ionization and recombination sources close to the primary X-point. This feature might be beneficial for the formation of an X-point radiator, but would require further impurity seeding simulation study.",
  "authors": [
    "H. S. Wu",
    "F. Subba",
    "M. R. K. Wigram",
    "O. Pan",
    "R. Lo Frano",
    "A. Pucciarelli",
    "R. Zanino"
  ],
  "published": "2025-09-02T16:08:02Z",
  "updated": "2025-09-02T16:08:02Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}