{
  "arxiv_id": "2509.00164v3",
  "url": "https://arxiv.org/abs/2509.00164v3",
  "pdf_url": "https://arxiv.org/pdf/2509.00164v3.pdf",
  "title": "The potential applications of muography to revealing sea shipwrecks",
  "abstract": "Muon imaging, a non-invasive technique leveraging naturally occurring cosmic muons, has emerged as a promising tool for exploring underwater objects, including shipwrecks. This article examines the potential of muon imaging to investigate the contents of wrecked ships in the Baltic Sea and other marine environments. By analyzing the principles of muon tomography, its applications in underwater archaeology, and its advantages over traditional methods, we highlight its potential to reveal hidden details within shipwrecks while addressing challenges posed by the marine environment. These wrecks pose significant environmental risks due to their hazardous contents, such as explosives and crude oil products, making their detection and monitoring a matter of environmental and safety concern. Accurate modeling and imaging of such wrecks are therefore crucial for assessing potential dangers and mitigating environmental impacts. In this work, we adopted an approach similar to that used in underground muon experiments. Muon propagation through 50 meters of seawater was simulated using GEANT4, with muons transported to a depth of 35 meters and recorded in a virtual detector. The saved distributions of particle type, kinetic energy, interaction position, and angular directions were then used as tabulated input to the PrimaryGeneratorAction module. This approach enabled the generation of a realistic underwater muon flux over a 20 m x 20 m surface at 35 meters depth, which was subsequently employed to simulate different shipwreck filling scenarios. Assuming an exposure time of one week for a wreck located at a depth of 50 meters, our simulations demonstrate that muon imaging can resolve density contrasts sufficiently to distinguish between water, oil, and high-density materials, underscoring its feasibility as a practical tool for underwater hazard assessment.",
  "authors": [
    "Anzori Sh. Georgadze"
  ],
  "published": "2025-08-29T18:05:45Z",
  "updated": "2025-09-04T14:00:12Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}