{
  "arxiv_id": "2507.05423v3",
  "url": "https://arxiv.org/abs/2507.05423v3",
  "pdf_url": "https://arxiv.org/pdf/2507.05423v3.pdf",
  "title": "The CMS Phase-2 Fast Beam Condition Monitor prototype test with beam",
  "abstract": "The Fast Beam Condition Monitor (FBCM) is a standalone luminometer for the High Luminosity LHC (HL-LHC) program of the CMS Experiment at CERN. The detector is under development and features a new, radiation-hard, front-end application-specific integrated circuit (ASIC) designed for beam monitoring applications. The achieved timing resolution of a few nanoseconds enables the measurement of both the luminosity and the beam-induced background. The ASIC, called FBCM23, features six channels with adjustable shaping times, enabling in-field fine-tuning. Each ASIC channel outputs a single binary asynchronous signal encoding time of arrival and time over threshold information. The FBCM is based on silicon-pad sensors, with two sensor designs presently being considered. This paper presents the results of tests of the FBCM detector prototype using both types of silicon sensors with hadron, muon, and electron beams. Irradiated FBCM23 ASICs and silicon-pad sensors were also tested to simulate the expected conditions near the end of the detector's lifetime in the HL-LHC radiation environment. Based on test results, direct bonding between the sensor and ASIC was chosen, and an optimal bias voltage and ASIC threshold for FBCM operation were proposed. The current design of the front-end test board was validated following the beam test and is now being used for the first front-end module, which is expected to be produced in summer 2025. These results represent a major step forward in validating the FBCM concept, first version of the firmware and establishing a reliable design path for the final detector.",
  "authors": [
    "G. Auzinger",
    "H. Bakhshiansohi",
    "A. E. Dabrowski",
    "A. G. Delannoy",
    "V. Dalavi",
    "N. Dienemann",
    "M. Dragicevic",
    "M. F. Garcia",
    "M. Guthoff",
    "B. Gyöngyösi",
    "M. Jenihhin",
    "Á. Kadlecsik",
    "J. Kaplon",
    "O. Karacheban",
    "B. Korcsmáros",
    "A. Lokhovitskiy",
    "W. H. Liu",
    "R. Loos",
    "S. Mallows",
    "D. Mihhailov",
    "M. Obradovic",
    "S. Orfanelli",
    "M. Pari",
    "G. Pásztor",
    "F. L. Pereira Carneiro",
    "M. Princova",
    "B. Ristic",
    "C. Romero",
    "J. Schwandt",
    "M. Sedghi",
    "A. Shevelev",
    "K. Shibin",
    "S. Spanier",
    "G. Steinbrueck",
    "D. P. Stickland",
    "A. Tsirou",
    "B. Ujvári",
    "M. Velasco",
    "P. G. Verdini",
    "G. J. Wegrzyn",
    "M. Wiehe",
    "D. Wilbern",
    "P. D. Winney"
  ],
  "published": "2025-07-07T19:11:42Z",
  "updated": "2025-10-08T12:59:39Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}