{
  "arxiv_id": "2510.09437v1",
  "url": "https://arxiv.org/abs/2510.09437v1",
  "pdf_url": "https://arxiv.org/pdf/2510.09437v1.pdf",
  "title": "Long Living Hot and Dense Plasma from Relativistic Laser-Nanowire Array   Interaction",
  "abstract": "Long-living, hot and dense plasmas generated by ultra-intense laser beams are of critical importance for laser-driven nuclear physics, bright hard X-ray sources, and laboratory astrophysics. We report the experimental observation of plasmas with nanosecond-scale lifetimes, near-solid density, and keV-level temperatures, produced by irradiating periodic arrays of composite nanowires with ultra-high contrast, relativistically intense femtosecond laser pulses. Jet-like plasma structures extending up to 1~mm from the nanowire surface were observed, emitting K-shell radiation from He-like Ti$^{20+}$ ions. High-resolution X-ray spectra were analyzed using 3D Particle-in-Cell (PIC) simulations of the laser-plasma interaction combined with collisional--radiative modeling (FLYCHK). The results indicate that the jets consist of plasma with densities of $10^{20}$-$10^{22}$ cm$^{-3}$ and keV-scale temperatures, persisting for several nanoseconds. We attribute the formation of these jets to the generation of kiloTesla-scale global magnetic fields during the laser interaction, as predicted by PIC simulations. These fields may drive long-timescale current instabilities that sustain magnetic fields of several hundred tesla, sufficient to confine hot, dense plasma over nanosecond durations.",
  "authors": [
    "Ehsan Eftekhari-Zadeh",
    "Mikhail Gyrdymov",
    "Parysatis Tavana",
    "Robert Loetzsch",
    "Ingo Uschmann",
    "Thomas Siefke",
    "Thomas Käsebier",
    "Uwe Zeitner",
    "Adriana Szeghalmi",
    "Alexander Pukhov",
    "Dmitri Serebryakov",
    "Evgeni Nerush",
    "Igor Kostyukov",
    "Olga Rosmej",
    "Christian Spielmann",
    "Daniil Kartashov"
  ],
  "published": "2025-10-10T14:47:58Z",
  "updated": "2025-10-10T14:47:58Z",
  "categories": [
    "physics.plasm-ph",
    "hep-ex",
    "physics.optics"
  ],
  "primary_category": "physics.plasm-ph"
}