{
  "arxiv_id": "2510.09126v1",
  "url": "https://arxiv.org/abs/2510.09126v1",
  "pdf_url": "https://arxiv.org/pdf/2510.09126v1.pdf",
  "title": "Statistics of Current and Vorticity Structures in Relativistic   Turbulence",
  "abstract": "Coherent structures created through turbulent cascades play a key role in energy dissipation and particle acceleration. In this work, we investigate both current and vorticity sheets in 3D particle-in-cell simulations of decaying relativistic turbulence in pair plasma by training a self-organizing map to recognize these structures. We subsequently carry out an extensive statistical analysis to reveal their geometric and structural properties. This analysis is systematically applied across a range of magnetizations ($\\sigma$) and fluctuating-to-mean magnetic field strengths ($\\delta B_0/B_0$) to assess how these parameters influence the resulting structures. We find that the structures' geometric properties form power-law distributions in their probability density functions (PDFs), with the exception of the structure width, which generally exhibits an exponential distribution peaking around 2 electron skin depths. The measurements show weak dependence on $\\sigma$ but a strong dependence on $\\delta B_0/B_0$. Finally, we investigate the spatial relationship between current sheets and vorticity sheets. We find that most current sheets are directly associated with at least one vorticity sheet neighbor and are often situated between two vorticity sheets. These findings provide a detailed statistical framework for understanding the formation and organization of coherent structures in relativistic magnetized turbulence, allowing for their incorporation into updated theoretical models for structure-based energy dissipation and particle acceleration processes crucial for interpreting high-energy astrophysical observations.",
  "authors": [
    "Zachary Davis",
    "Luca Comisso",
    "Colby Haggerty",
    "Joonas Nättilä"
  ],
  "published": "2025-10-10T08:26:38Z",
  "updated": "2025-10-10T08:26:38Z",
  "categories": [
    "physics.plasm-ph",
    "astro-ph.HE"
  ],
  "primary_category": "physics.plasm-ph"
}