{
  "arxiv_id": "2510.09579v1",
  "url": "https://arxiv.org/abs/2510.09579v1",
  "pdf_url": "https://arxiv.org/pdf/2510.09579v1.pdf",
  "title": "The impact of plasma turbulence on atomic reaction rates in detached   divertors",
  "abstract": "Numerical plasma models of the edge and scrape-off layer rely on reaction rates to describe key atomic processes such as ionization, recombination, charge-exchange, and line radiation. These rates depend non-linearly on local density and temperature, and are thus sensitive to turbulent fluctuations. We present an analysis of atomic rates and their dependence on turbulent fluctuations, obtained from GRILLIX edge turbulence simulations in detached divertor conditions. Ionization, recombination and radiation rates are evaluated in turbulent and corresponding mean-field states, and their differences are discussed. While the effect is minimal in attached conditions with low fluctuation amplitudes (< 50% of the background), pronounced discrepancies emerge in detached conditions with high fluctuation amplitudes (> 300% of the background). Local ionization and radiation rates obtained from turbulent inputs are up to a factor of ~2 lower than rates obtained from mean-field inputs. The rate reduction is the result of the particular anti-correlation of electron density and temperature in detached conditions. When factoring out correlations, the turbulent rate approximately recovers to the mean-field rate. When arranged to correlate positively, the turbulent ionization rate instead increases by a factor of ~3. Our results demonstrate that the common method of evaluating rates with mean-field plasma inputs can introduce systematic errors to particle and energy balances, particularly in detached conditions.",
  "authors": [
    "Konrad Eder",
    "Wladimir Zholobenko",
    "Andreas Stegmeir",
    "Kaiyu Zhang",
    "Frank Jenko"
  ],
  "published": "2025-10-10T17:34:48Z",
  "updated": "2025-10-10T17:34:48Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}