{
  "arxiv_id": "2510.07042v1",
  "url": "https://arxiv.org/abs/2510.07042v1",
  "pdf_url": "https://arxiv.org/pdf/2510.07042v1.pdf",
  "title": "Experimental Results from Early Non-Planar NI-HTS Magnet Prototypes for   the Columbia Stellarator eXperiment (CSX)",
  "abstract": "The Columbia Stellarator eXperiment (CSX) is an upgrade of the Columbia Non-neutral Torus (CNT) that aims to demonstrate a university-scale, quasi-axisymmetric stellarator using high-temperature superconducting (HTS) technology at an on-axis magnetic field target of 0.5 T. Due to the strain sensitivity of ReBCO (Rare-earth Barium Copper Oxides), adapting it to non-planar stellarator geometries requires new winding, structural, and cooling strategies. We report on the results of a staged prototype program (P1, P2, P3) employing 3D-printed, sectional aluminum coil frames with winding channels, gimballed constant-tension winding mechanics, and solder potting for radial current redistribution and passive quench mitigation. The first prototype, P1 (planar elliptical, double-pancake) tested additive manufacture, sectional joining and baseline winding, achieving predicted fields at 77 K. P2 (non-planar, higher strain) was wound to 42 turns, energized at 30-40 K to produce expected magnetic fields, and studied thermal gradients and resistance at up to 4.5 kAt. Design evolution in P3 introduces concave geometry with dual double-pancakes, 200 turns, and approaches the 70 kAt target at 20 K. In parallel, sub-microhm lap joints have been developed. Together, these results de-risk manufacturing, cooling interfaces, quench management, and diagnostics, paving the way for full-size non-planar HTS stellarator coils for CSX.",
  "authors": [
    "D. Schmeling",
    "M. Russo",
    "B. T. Gebreamlak",
    "T. J. Kiker",
    "A. R. Skrypek",
    "A. R. Hightower",
    "J. Xue",
    "S. Chen",
    "S. Sohaib",
    "C. Martinez",
    "K. F. Richardson",
    "L. Filor",
    "S. Komatsu",
    "L. Liu",
    "C. Paz-Soldan"
  ],
  "published": "2025-10-08T14:08:08Z",
  "updated": "2025-10-08T14:08:08Z",
  "categories": [
    "physics.ins-det",
    "cond-mat.supr-con",
    "physics.app-ph",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.ins-det"
}