{
  "arxiv_id": "2510.07849v1",
  "url": "https://arxiv.org/abs/2510.07849v1",
  "pdf_url": "https://arxiv.org/pdf/2510.07849v1.pdf",
  "title": "Full-wave computation of SUb-atmospheric Radio-frequency Engine (SURE)",
  "abstract": "Near-space, which covers altitudes from 20 to 100 kilometers, has been receiving more and more attention because of its special strategic value. Airships and high-altitude balloons are two common types of low-speed vehicles that operate in this region. They can be used for jobs like monitoring, communication, and remote sensing, but they need efficient propulsion systems to work well. Earlier, we proposed a new type of electric propulsion system that can ionize the surrounding air to create plasma and produce thrust for near-space vehicles. However, in past experiments, not enough was known about how certain parameters affect power absorption and electromagnetic behavior. Therefore, in this study, we used computer simulations to examine how gas pressure (200 to 1000 Pa), input power (200 to 600 W), frequency (13.56 to 52.24 MHz), and different gas types ($Ar$, $N_2$, $H_2$, $He$) influence inductively coupled plasma inside a quartz tube. We especially focused on comparing two antenna designs: one with a single turn and one with five turns. In all the simulations, the single-turn antenna consistently absorbed power better than the five-turns antenna. Higher frequencies significantly influence both plasma power absorption and magnetic field characteristics. The optimal power absorption occurs at a filling gas pressure of 400 Pa. When varying the input power, we observed an initial decrease followed by an increasing trend, which may be related to ionization mechanisms. In comparisons among different gas types, the inelastic collision mechanisms in molecular gases lead to a notable reduction in plasma power absorption efficiency. The results from this work will help guide the design of future experiments for this electric propulsion concept.",
  "authors": [
    "Dingzhou Li",
    "Lei Chang",
    "Ye Tao"
  ],
  "published": "2025-10-09T06:48:28Z",
  "updated": "2025-10-09T06:48:28Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}