{
  "arxiv_id": "2510.07690v1",
  "url": "https://arxiv.org/abs/2510.07690v1",
  "pdf_url": "https://arxiv.org/pdf/2510.07690v1.pdf",
  "title": "Lithographic integration of TES microcalorimeters with SQUID multiplexer   circuits for large format spectrometers",
  "abstract": "Arrays of hundreds or thousands of low temperature detectors have been deployed for many experiments, both bolometers for long wavelength applications and calorimeters for shorter wavelength applications. One challenge that is common to many of these arrays is the efficient use of focal plane area to achieve a large fill fraction of absorbers coupled to detectors. We are developing an integrated fabrication of soft X-ray transition edge sensors (TES) and microwave SQUID multiplexers ($\\mu$MUX) with the goal of maximizing the fill fraction of the focal plane area on a scale of many thousand pixel detectors. We will utilize lithographically defined high density interconnects to circumvent limitations in existing solutions that use wirebonds or flip-chip bonds. Here we report the first demonstration of combining TES and $\\mu$MUX processes into a single TES-System-on-a-Chip (TES-SoC) fabrication on a silicon wafer. The $\\mu$MUX SQUIDs and TES electrothermal feedback circuits are microfabricated first and protected with passivating SiO$_2$, then the TES devices and TES-to-SQUID interconnects are fabricated, and finally the protective layer is removed before the fabrication of the microwave resonators. We show that the microwave SQUIDs are functional and have reasonable yield, and that we are able to read out the transition temperature of the connected TESs using those SQUIDs.",
  "authors": [
    "Robinjeet Singh",
    "Avirup Roy",
    "Daniel Becker",
    "Johnathan D. Gard",
    "Mark W. Keller",
    "John A. B. Mates",
    "Kelsey M. Morgan",
    "Nathan J. Ortiz",
    "Daniel R. Schmidt",
    "Daniel S. Swetz",
    "Joel N. Ullom",
    "Leila R. Vale",
    "Michael Vissers",
    "Galen C. O'Neil",
    "Joel C. Weber"
  ],
  "published": "2025-10-09T02:28:24Z",
  "updated": "2025-10-09T02:28:24Z",
  "categories": [
    "physics.ins-det",
    "cond-mat.supr-con",
    "physics.app-ph",
    "quant-ph"
  ],
  "primary_category": "physics.ins-det"
}