[
  {
    "arxiv_id": "2510.06703v3",
    "url": "https://arxiv.org/abs/2510.06703v3",
    "pdf_url": "https://arxiv.org/pdf/2510.06703v3.pdf",
    "title": "Developing a Cost-Effective Spectrometer: A Practical Approach",
    "abstract": "The paper demonstrates the design and execution of a low-cost optical spectrometer that employs a webcam, diffraction grating & Python (a free, open-source programming language). The device's design prioritized economy and usability, with a black box casing to reduce stray light and increase measurement accuracy. A diffraction grating made from a DVD was used to split light into its constituent wavelengths, which were then collected by the camera. The calibration procedure used a RED TIDE USB650 Fiber Optic Spectrometer to set calibration values for various wavelength ranges, which ensured that the spectrometer's results closely matched those derived from the former, a high-cost industry-standard model. Spectrums of several light sources, such as red, green, blue, yellow, white, magenta, orange, and UV LEDs, as well as a green laser, were studied and compared. The results showed a high level of precision, with minimal divergence from industry-standard spectrometer measurements. This comparison was carried out utilizing Origin software, which allowed for extensive analysis and display of the spectrum data. In addition, the spectrometer captured data in real time, allowing users to watch live spectrum changes and ensure instant accessibility of results. Despite its simplicity and low cost, the spectrometer provides significant value for instructional and practical applications, making it a valuable tool in cost-constrained situations.",
    "authors": [
      "Zafrin Jahan Nikita",
      "Mohammad Tahsin Alam",
      "Yasir Mahmud",
      "Sheikh Hasib Cheragee",
      "Redwanul Talukder Zeem"
    ],
    "published": "2025-10-08T06:58:18Z",
    "updated": "2025-10-12T06:29:31Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2510.09581v1",
    "url": "https://arxiv.org/abs/2510.09581v1",
    "pdf_url": "https://arxiv.org/pdf/2510.09581v1.pdf",
    "title": "Optimal Binning for Small-Angle Neutron Scattering Data Using the   Freedman-Diaconis Rule",
    "abstract": "Small-Angle Neutron Scattering (SANS) data analysis often relies on fixed-width binning schemes that overlook variations in signal strength and structural complexity. We introduce a statistically grounded approach based on the Freedman-Diaconis (FD) rule, which minimizes the mean integrated squared error between the histogram estimate and the true intensity distribution. By deriving the competing scaling relations for counting noise ($\\propto h^{-1}$) and binning distortion ($\\propto h^{2}$), we establish an optimal bin width that balances statistical precision and structural resolution. Application to synthetic data from the Debye scattering function of a Gaussian polymer chain demonstrates that the FD criterion quantitatively determines the most efficient binning, faithfully reproducing the curvature of $I(Q)$ while minimizing random error. The optimal width follows the expected scaling $h_{\\mathrm{opt}} \\propto N_{\\mathrm{total}}^{-1/3}$, delineating the transition between noise- and resolution-limited regimes. This framework provides a unified, physics-informed basis for adaptive, statistically efficient binning in neutron scattering experiments.",
    "authors": [
      "Jessie E. An",
      "Chi-Huan Tung",
      "Changwoo Do",
      "Wei-Ren Chen"
    ],
    "published": "2025-10-10T17:36:15Z",
    "updated": "2025-10-10T17:36:15Z",
    "categories": [
      "physics.data-an",
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.data-an"
  },
  {
    "arxiv_id": "2510.09579v1",
    "url": "https://arxiv.org/abs/2510.09579v1",
    "pdf_url": "https://arxiv.org/pdf/2510.09579v1.pdf",
    "title": "The impact of plasma turbulence on atomic reaction rates in detached   divertors",
    "abstract": "Numerical plasma models of the edge and scrape-off layer rely on reaction rates to describe key atomic processes such as ionization, recombination, charge-exchange, and line radiation. These rates depend non-linearly on local density and temperature, and are thus sensitive to turbulent fluctuations. We present an analysis of atomic rates and their dependence on turbulent fluctuations, obtained from GRILLIX edge turbulence simulations in detached divertor conditions. Ionization, recombination and radiation rates are evaluated in turbulent and corresponding mean-field states, and their differences are discussed. While the effect is minimal in attached conditions with low fluctuation amplitudes (< 50% of the background), pronounced discrepancies emerge in detached conditions with high fluctuation amplitudes (> 300% of the background). Local ionization and radiation rates obtained from turbulent inputs are up to a factor of ~2 lower than rates obtained from mean-field inputs. The rate reduction is the result of the particular anti-correlation of electron density and temperature in detached conditions. When factoring out correlations, the turbulent rate approximately recovers to the mean-field rate. When arranged to correlate positively, the turbulent ionization rate instead increases by a factor of ~3. Our results demonstrate that the common method of evaluating rates with mean-field plasma inputs can introduce systematic errors to particle and energy balances, particularly in detached conditions.",
    "authors": [
      "Konrad Eder",
      "Wladimir Zholobenko",
      "Andreas Stegmeir",
      "Kaiyu Zhang",
      "Frank Jenko"
    ],
    "published": "2025-10-10T17:34:48Z",
    "updated": "2025-10-10T17:34:48Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.09524v1",
    "url": "https://arxiv.org/abs/2510.09524v1",
    "pdf_url": "https://arxiv.org/pdf/2510.09524v1.pdf",
    "title": "Si3N4 membrane as entrance window for plasma-generated vacuum   ultraviolet (VUV) radiation",
    "abstract": "Vacuum ultraviolet (VUV) radiation produced by an atmospheric pressure plasma was successfully measured down to wavelengths of 58.4nm utilizing a 20nm thin Si3N4 membrane to transfer the VUV radiation into a vacuum monochromator. This method allows measurements without disturbing the plasma or the spectra. He2 absorption could be observed by filling the monochromator with He. Transmission of the Si3N4 membrane in the region of the He2 excimer continua (58nm to 100 nm) could indirectly be measured and confirms literature values.",
    "authors": [
      "Luka Hansen",
      "Görkem Bilgin",
      "Jan Benedikt"
    ],
    "published": "2025-10-10T16:36:15Z",
    "updated": "2025-10-10T16:36:15Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.03812v2",
    "url": "https://arxiv.org/abs/2507.03812v2",
    "pdf_url": "https://arxiv.org/pdf/2507.03812v2.pdf",
    "title": "Memory- and compute-optimized geometric multigrid GMGPolar for   curvilinear coordinate representations -- Applications to fusion plasma",
    "abstract": "Tokamak fusion reactors are actively studied as a means of realizing energy production from plasma fusion. However, due to the substantial cost and time required to construct fusion reactors and run physical experiments, numerical experiments are indispensable for understanding plasma physics inside tokamaks, supporting the design and engineering phase, and optimizing future reactor designs. Geometric multigrid methods are optimal solvers for many problems that arise from the discretization of partial differential equations. It has been shown that the multigrid solver GMGPolar solves the 2D gyrokinetic Poisson equation in linear complexity and with only small memory requirements compared to other state-of-the-art solvers. In this paper, we present a completely refactored and object-oriented version of GMGPolar which offers two different matrix-free implementations. Among other things, we leverage the Sherman-Morrison formula to solve cyclic tridiagonal systems from circular line solvers without additional fill-in and we apply reordering to optimize cache access of circular and radial smoothing operations. With the Give approach, memory requirements are further reduced and speedups of four to seven are obtained for usual test cases. For the Take approach, speedups of 16 to 18 can be attained. In an additionally experimental setup of using GMGPolar as a preconditioner for conjugate gradients, this speedup could even be increased to factors between 25 and 37.",
    "authors": [
      "Julian Litz",
      "Philippe Leleux",
      "Carola Kruse",
      "Joscha Gedicke",
      "Martin J. Kühn"
    ],
    "published": "2025-07-04T21:09:51Z",
    "updated": "2025-10-10T16:08:26Z",
    "categories": [
      "cs.MS",
      "physics.plasm-ph",
      "68Q25, 65Y20, 65Y05, 65N55, 65N06, 65B99"
    ],
    "primary_category": "cs.MS"
  },
  {
    "arxiv_id": "2510.09491v1",
    "url": "https://arxiv.org/abs/2510.09491v1",
    "pdf_url": "https://arxiv.org/pdf/2510.09491v1.pdf",
    "title": "Investigating Solid-Fluid Phase Coexistence in DC Plasma Bilayer   Crystals: The Role of Particle Pairing and Mode Coupling",
    "abstract": "This article presents a detailed investigation of solid-fluid phase coexistence in a bilayer dusty plasma crystal subjected to varying confinement ring bias voltages in a DC glow discharge argon plasma. Melamine formaldehyde particles were employed to form a stable, hexagonally ordered bilayer crystal within a confinement ring electrically isolated from the grounded cathode. By systematically adjusting the confinement ring bias, a distinct phase coexistence emerged: it is characterized by a fluid-like melted core surrounded by a solid crystalline periphery. Crucially, analysis of the phonon spectra revealed frequency shifts that deviate significantly from the predictions of classical monolayer Mode-Coupling Instability (MCI) theory. Stability analysis further demonstrated that dynamic interlayer particle pairing and non-reciprocal interactions play a pivotal role in destabilizing the bilayer structure. These findings highlight previously underappreciated mechanisms driving the melting transition in bilayer dusty plasmas, offering a more comprehensive understanding of phase behavior in complex plasma systems. The results underscore the importance of interlayer coupling and confinement effects in tuning structural transitions.",
    "authors": [
      "Siddhartha Mangamuri",
      "Surabhi Jaiswal",
      "Lénaïc Couëdel"
    ],
    "published": "2025-10-10T15:52:47Z",
    "updated": "2025-10-10T15:52:47Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2502.05975v2",
    "url": "https://arxiv.org/abs/2502.05975v2",
    "pdf_url": "https://arxiv.org/pdf/2502.05975v2.pdf",
    "title": "Comparison of the detector response and calibration function of metallic   microcalorimeters for X-ray photons and external electrons",
    "abstract": "Metallic microcalorimeters (MMCs) are cryogenic single-particle detectors that rely on a calorimetric detection principle. Due to their excellent energy resolution, close-to-ideal linear detector response, fast signal rise time and the potential for \\SI{100}{\\%} quantum efficiency, MMCs outperform conventional detectors by several orders of magnitude in resolution. These attributes make them particularly interesting for a broad spectrum of applications, including a next-generation neutrino mass experiment based on the measurement of the tritium beta-decay spectrum, with an objective of achieving a sensitivity surpassing that of the pioneering KATRIN experiment. However, although MMCs have been used in measurements of photons and heavy ions with great success, no information is currently available on the interaction between MMCs and external light charged particles such as electrons. This work aims to provide such missing information and to demonstrate that MMC-based detectors are suitable for high-resolution spectroscopy of external electron sources. Particularly, we present the first-ever measurements of external electrons using a metallic microcalorimeter, comprehensively discuss the characteristics of the signal shape and the calibration function and give a direct comparison between well-defined conversion electron and X-ray photon signals from the same $^{83}$Rb/$^{83m}$Kr source.",
    "authors": [
      "Neven Kovac",
      "Fabienne Adam",
      "Sebastian Kempf",
      "Marie-Christin Langer",
      "Michael Müller",
      "Rudolf Sack",
      "Magnus Schlösser",
      "Markus Steidl",
      "Kathrin Valerius"
    ],
    "published": "2025-02-09T18:05:08Z",
    "updated": "2025-10-10T15:31:54Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1016/j.nima.2025.170662"
  },
  {
    "arxiv_id": "2509.08474v2",
    "url": "https://arxiv.org/abs/2509.08474v2",
    "pdf_url": "https://arxiv.org/pdf/2509.08474v2.pdf",
    "title": "Restarting the Numerical Flow Iteration through low rank tensor   approximations",
    "abstract": "The numerical flow iteration method has recently been proposed as a memory-slim solution method for the Vlasov--Poisson system. It stores the temporal evolution of the electric field and reconstructs the solution in each time step by following the characteristics backwards in time and reconstructing the solution from the initial distribution. If the number of time steps gets large, the computational cost of this reconstruction may get prohibitive. Given a representation of the intermediate solution, the time intervals over which the characteristic curves need to be solved backwards in time can be reduced by restarting the Numerical Flow Iteration (NuFI) after certain time intervals. In this paper, we propose an algorithm that reconstructs a low-rank representation of the solution at the restart times using a randomized singular value decomposition (RSVD) algorithm with lazy evaluation. The proposed algorithm reduces the computational complexity compared to the pure Numerical Flow Iteration from quadratic to linear in the number of times step while still keeping its memory complexity. On the other hand, our numerical results demonstrate that the methods preserves the property of the Numerical Flow Iteration of showing much less dissipation of filaments compared to the semi-Lagrangian method.",
    "authors": [
      "Rostislav-Paul Wilhelm",
      "Katharina Kormann"
    ],
    "published": "2025-09-10T10:27:12Z",
    "updated": "2025-10-10T14:52:49Z",
    "categories": [
      "math.NA",
      "cs.NA",
      "physics.plasm-ph"
    ],
    "primary_category": "math.NA"
  },
  {
    "arxiv_id": "2510.09437v1",
    "url": "https://arxiv.org/abs/2510.09437v1",
    "pdf_url": "https://arxiv.org/pdf/2510.09437v1.pdf",
    "title": "Long Living Hot and Dense Plasma from Relativistic Laser-Nanowire Array   Interaction",
    "abstract": "Long-living, hot and dense plasmas generated by ultra-intense laser beams are of critical importance for laser-driven nuclear physics, bright hard X-ray sources, and laboratory astrophysics. We report the experimental observation of plasmas with nanosecond-scale lifetimes, near-solid density, and keV-level temperatures, produced by irradiating periodic arrays of composite nanowires with ultra-high contrast, relativistically intense femtosecond laser pulses. Jet-like plasma structures extending up to 1~mm from the nanowire surface were observed, emitting K-shell radiation from He-like Ti$^{20+}$ ions. High-resolution X-ray spectra were analyzed using 3D Particle-in-Cell (PIC) simulations of the laser-plasma interaction combined with collisional--radiative modeling (FLYCHK). The results indicate that the jets consist of plasma with densities of $10^{20}$-$10^{22}$ cm$^{-3}$ and keV-scale temperatures, persisting for several nanoseconds. We attribute the formation of these jets to the generation of kiloTesla-scale global magnetic fields during the laser interaction, as predicted by PIC simulations. These fields may drive long-timescale current instabilities that sustain magnetic fields of several hundred tesla, sufficient to confine hot, dense plasma over nanosecond durations.",
    "authors": [
      "Ehsan Eftekhari-Zadeh",
      "Mikhail Gyrdymov",
      "Parysatis Tavana",
      "Robert Loetzsch",
      "Ingo Uschmann",
      "Thomas Siefke",
      "Thomas Käsebier",
      "Uwe Zeitner",
      "Adriana Szeghalmi",
      "Alexander Pukhov",
      "Dmitri Serebryakov",
      "Evgeni Nerush",
      "Igor Kostyukov",
      "Olga Rosmej",
      "Christian Spielmann",
      "Daniil Kartashov"
    ],
    "published": "2025-10-10T14:47:58Z",
    "updated": "2025-10-10T14:47:58Z",
    "categories": [
      "physics.plasm-ph",
      "hep-ex",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2311.16463v2",
    "url": "https://arxiv.org/abs/2311.16463v2",
    "pdf_url": "https://arxiv.org/pdf/2311.16463v2.pdf",
    "title": "Discovery of the Asymmetric Effect in the Response of Photoionization   Gas",
    "abstract": "The variability of quasar radiation provides a powerful probe of the photoionization response of ionized gas, which plays a central role in tracing cosmic evolution and plasma physics under extreme conditions. In this work, we investigate the physical origin of the asymmetric response observed in broad absorption line (BAL) systems and constrain the gas density and spatial scale of quasar outflows. Using time-dependent photoionization simulations and analytical estimates focused on CIV, we quantify the response timescales across different ionization states. Our results show that over 70\\% of BAL gas exhibits a negative response to quasar dimming, indicating a strong asymmetry in ionization behavior. This asymmetry is driven by systematically shorter response timescales in higher ionization states. Given typical observational cadences longer than one day, the observed response pattern requires at least 40% of the BAL gas to have a density below $n_{\\rm H} = 10^6\\ \\cc$, consistent with most measured BAL densities but significantly lower than typical accretion disk winds ($n_{\\rm H} > 10^8\\ \\cc$). These findings suggest that BAL outflows either undergo substantial density evolution as they propagate or originate from larger-scale regions such as the dusty torus. The asymmetric response thus provides new constraints on the physical structure and origin of quasar outflows.",
    "authors": [
      "Zhicheng He",
      "Tinggui Wang"
    ],
    "published": "2023-11-28T03:54:51Z",
    "updated": "2025-10-10T13:49:26Z",
    "categories": [
      "astro-ph.GA",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.GA"
  },
  {
    "arxiv_id": "2510.09376v1",
    "url": "https://arxiv.org/abs/2510.09376v1",
    "pdf_url": "https://arxiv.org/pdf/2510.09376v1.pdf",
    "title": "A Living Review Pipeline for AI/ML Applications in Accelerator Physics",
    "abstract": "We present an open-source pipeline for generating a \\emph{living review} of artificial intelligence (AI) and machine learning (ML) applications in accelerator physics and technologies. Traditional review articles provide static snapshots that are quickly outdated by the rapid pace of research. The presented system automatically harvests publications from multiple bibliographic sources (arXiv, InspireHEP, HAL, OpenAlex, Crossref, and Springer), deduplicates entries, applies semantic filtering to ensure accelerator and ML relevance, and classifies papers into thematic categories. The resulting curated dataset was exported in JSON, HTML, PDF, and Bib\\TeX formats, enabling continuous updates and integration with web frameworks. We describe the methodology, including semantic similarity filtering using sentence-transformer embeddings, threshold calibration, and expert-informed classification. The results demonstrate the robust filtering of $\\sim$12000 raw papers/month into a focused corpus of $\\sim$2\\% relevant works. The pipeline provides the basis for an evolving community-driven review of AI/ML in accelerator science.",
    "authors": [
      "Adnan Ghribi"
    ],
    "published": "2025-10-10T13:31:46Z",
    "updated": "2025-10-10T13:31:46Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.07314v2",
    "url": "https://arxiv.org/abs/2510.07314v2",
    "pdf_url": "https://arxiv.org/pdf/2510.07314v2.pdf",
    "title": "GyroSwin: 5D Surrogates for Gyrokinetic Plasma Turbulence Simulations",
    "abstract": "Nuclear fusion plays a pivotal role in the quest for reliable and sustainable energy production. A major roadblock to viable fusion power is understanding plasma turbulence, which significantly impairs plasma confinement, and is vital for next-generation reactor design. Plasma turbulence is governed by the nonlinear gyrokinetic equation, which evolves a 5D distribution function over time. Due to its high computational cost, reduced-order models are often employed in practice to approximate turbulent transport of energy. However, they omit nonlinear effects unique to the full 5D dynamics. To tackle this, we introduce GyroSwin, the first scalable 5D neural surrogate that can model 5D nonlinear gyrokinetic simulations, thereby capturing the physical phenomena neglected by reduced models, while providing accurate estimates of turbulent heat transport. GyroSwin (i) extends hierarchical Vision Transformers to 5D, (ii) introduces cross-attention and integration modules for latent 3D$\\leftrightarrow$5D interactions between electrostatic potential fields and the distribution function, and (iii) performs channelwise mode separation inspired by nonlinear physics. We demonstrate that GyroSwin outperforms widely used reduced numerics on heat flux prediction, captures the turbulent energy cascade, and reduces the cost of fully resolved nonlinear gyrokinetics by three orders of magnitude while remaining physically verifiable. GyroSwin shows promising scaling laws, tested up to one billion parameters, paving the way for scalable neural surrogates for gyrokinetic simulations of plasma turbulence.",
    "authors": [
      "Fabian Paischer",
      "Gianluca Galletti",
      "William Hornsby",
      "Paul Setinek",
      "Lorenzo Zanisi",
      "Naomi Carey",
      "Stanislas Pamela",
      "Johannes Brandstetter"
    ],
    "published": "2025-10-08T17:59:10Z",
    "updated": "2025-10-10T11:45:38Z",
    "categories": [
      "physics.plasm-ph",
      "cs.AI",
      "stat.ML"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.09198v1",
    "url": "https://arxiv.org/abs/2510.09198v1",
    "pdf_url": "https://arxiv.org/pdf/2510.09198v1.pdf",
    "title": "Crab-waist interaction region design and integration for the Super   Tau-Charm Facility",
    "abstract": "The Super Tau-Charm Facility (STCF) is a new-generation $e^+e^-$ collider proposed in China, designed to operate in the center-of-mass (CoM) energy range of 2-7 GeV. To achieve the design luminosity exceeding 5*10^34 cm^-2s^-1 at the optimal CoM energy of 4 GeV, a large crossing angle combined with the crab-waist correction scheme is adopted. However, this scheme introduces strong nonlinearities in the interaction region (IR) due to the extremely low vertical beta function of beta_y* <=1 mm, which significantly limits dynamic and momentum apertures of the collider ring. This paper presents a comprehensive modular optics design that addresses these challenges through several key features: 1) local chromaticity correction up to third order to enhance momentum bandwidth; 2) exact -I transformation between chromatic sextupole pairs for nonlinear cancellation; 3) minimization of the dispersion invariant along the IR to improve local momentum acceptance; 4) optimized beta functions at crab sextupole locations to reduce strength requirements and associated nonlinearities. Resonance driving terms analysis confirms effective suppression of geometric aberrations while preserving the intended crab-waist effects. When integrated into the collider ring, the design achieves a Touschek lifetime exceeding 300 s at beam energy of 2 GeV, meeting STCF requirements. The impact of fringe fields from superconducting quadrupoles is mitigated using octupole correctors, and detector solenoid effects are fully suppressed via local anti-solenoid compensation. Furthermore, the defined machine-detector interface layout ensures minimal synchrotron radiation background at the IP beryllium chamber, while ultra-high vacuum conditions are required to suppress beam-gas background. This IR design represents the current optimal solution for STCF and has been incorporated into the project's conceptual design report.",
    "authors": [
      "Linhao Zhang",
      "Tao Liu",
      "Ye Zou",
      "Penghui Yang",
      "Demin Zhou",
      "Jiancong Bao",
      "Ze Yu",
      "Yuhan Jin",
      "Yihao Mo",
      "Sangya Li",
      "Tianlong He",
      "Qing Luo",
      "Jingyu Tang"
    ],
    "published": "2025-10-10T09:39:49Z",
    "updated": "2025-10-10T09:39:49Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.09176v1",
    "url": "https://arxiv.org/abs/2510.09176v1",
    "pdf_url": "https://arxiv.org/pdf/2510.09176v1.pdf",
    "title": "Implementation and Deployment of an Injection Tuning Tool Using Bayesian   Optimization at the SuperKEKB Accelerator",
    "abstract": "As of July 2025, the SuperKEKB accelerator, which collides 7 GeV electrons with 4 GeV positrons to abundantly produce particles such as B mesons and tau leptons, holds the world record for the highest instantaneous luminosity. Continuous operation and upgrades are underway to achieve even higher luminosities. Maintaining a high instantaneous luminosity requires sustaining high beam currents in the storage rings, which in turn demands efficient beam injection from the injector. In particular, a high injection efficiency, defined as the ratio of the beam current successfully accumulated in the ring to the current delivered from the beam transport line, must be ensured. In the present study, we developed a tool to automate the injection tuning process using Bayesian optimization, a machine-learning-based technique, in order to improve the injection efficiency. During test operations conducted in November-December 2024, this tool successfully enhanced the injection efficiency by up to 32%.",
    "authors": [
      "Shinnosuke Kato",
      "Gaku Mitsuka"
    ],
    "published": "2025-10-10T09:19:22Z",
    "updated": "2025-10-10T09:19:22Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.09126v1",
    "url": "https://arxiv.org/abs/2510.09126v1",
    "pdf_url": "https://arxiv.org/pdf/2510.09126v1.pdf",
    "title": "Statistics of Current and Vorticity Structures in Relativistic   Turbulence",
    "abstract": "Coherent structures created through turbulent cascades play a key role in energy dissipation and particle acceleration. In this work, we investigate both current and vorticity sheets in 3D particle-in-cell simulations of decaying relativistic turbulence in pair plasma by training a self-organizing map to recognize these structures. We subsequently carry out an extensive statistical analysis to reveal their geometric and structural properties. This analysis is systematically applied across a range of magnetizations ($\\sigma$) and fluctuating-to-mean magnetic field strengths ($\\delta B_0/B_0$) to assess how these parameters influence the resulting structures. We find that the structures' geometric properties form power-law distributions in their probability density functions (PDFs), with the exception of the structure width, which generally exhibits an exponential distribution peaking around 2 electron skin depths. The measurements show weak dependence on $\\sigma$ but a strong dependence on $\\delta B_0/B_0$. Finally, we investigate the spatial relationship between current sheets and vorticity sheets. We find that most current sheets are directly associated with at least one vorticity sheet neighbor and are often situated between two vorticity sheets. These findings provide a detailed statistical framework for understanding the formation and organization of coherent structures in relativistic magnetized turbulence, allowing for their incorporation into updated theoretical models for structure-based energy dissipation and particle acceleration processes crucial for interpreting high-energy astrophysical observations.",
    "authors": [
      "Zachary Davis",
      "Luca Comisso",
      "Colby Haggerty",
      "Joonas Nättilä"
    ],
    "published": "2025-10-10T08:26:38Z",
    "updated": "2025-10-10T08:26:38Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.09122v1",
    "url": "https://arxiv.org/abs/2510.09122v1",
    "pdf_url": "https://arxiv.org/pdf/2510.09122v1.pdf",
    "title": "Simultaneous Multi-Scale Homogeneous H-Phi Thin-Shell Model for   Efficient Simulations of Stacked HTS Coils",
    "abstract": "The simulation of large-scale high-temperature superconducting (HTS) magnets is a computational challenge due to the multiple spatial scales involved, from the magnet to the detailed turn-to-turn geometry. To reduce the computational cost associated with finite-element (FE) simulations of insulated HTS coils, the simultaneous multi-scale homogeneous (SMSH) method can be considered. It combines a macroscopic-scale homogenized magnet model with multiple single-tape models and solves both scales monolithically. In this work, the SMSH method is reformulated using the $h$-$\\phi$ thin-shell (TS) approximation, where analyzed tapes are collapsed into thin surfaces, simplifying mesh generation. Moreover, the magnetic field is expressed as the gradient of the magnetic scalar potential outside the analyzed tapes. The discretized field is then described with nodal functions, further reducing the size of the FE problem compared to standard $h$ formulations. The proposed $h$-$\\phi$ SMSH-TS method is verified against state-of-the-art homogenization methods on a 2-D benchmark problem of stacks of HTS tapes. The results show good agreement in terms of AC losses, turn voltage and local current density, with a significant reduction in simulation time compared to reference models. All models are open-source.",
    "authors": [
      "Louis Denis",
      "Benoît Vanderheyden",
      "Christophe Geuzaine"
    ],
    "published": "2025-10-10T08:23:20Z",
    "updated": "2025-10-10T08:23:20Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.09113v1",
    "url": "https://arxiv.org/abs/2510.09113v1",
    "pdf_url": "https://arxiv.org/pdf/2510.09113v1.pdf",
    "title": "Influence of an external static magnetic field on prebreakdown electron   emission and heating",
    "abstract": "High magnetic fields can increase the occurrence of vacuum arcing, suggesting that both electric and magnetic fields can play a role in the vacuum arcing process. The mechanism of vacuum arcing in high magnetic fields is believed to involve both the cathode and the anode, with the cathode serving as the originator of field-emitting nanoprotrusions or tips, while the anode serves a secondary role. Significant heating of the anode surface can be achieved by magnetic focusing of the emitted electron beam, leading to increased heat flux due to greater current density. We simulated the emitted electron beam in different configurations of the electric and magnetic fields using the particle-in-cell (PIC) and finite element methods (FEM). The heating caused by the impacting electron beam was simulated for magnetic fields ranging from 0 T to 30 T. The directions of the electric and magnetic fields were found to play a major role in the focusing of the electron beam. We found that a sufficient temperature increase on the anode surface for evaporation can be reached at magnetic fields on the order of 10-30 T, suggesting the possibility of plasma initiation on the anode side.",
    "authors": [
      "Roni Koitermaa",
      "Marzhan Toktaganova",
      "Andreas Kyritsakis",
      "Tauno Tiirats",
      "Alexej Grudiev",
      "Veronika Zadin",
      "Flyura Djurabekova"
    ],
    "published": "2025-10-10T08:05:37Z",
    "updated": "2025-10-10T08:05:37Z",
    "categories": [
      "physics.acc-ph",
      "cond-mat.mtrl-sci",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2501.04107v2",
    "url": "https://arxiv.org/abs/2501.04107v2",
    "pdf_url": "https://arxiv.org/pdf/2501.04107v2.pdf",
    "title": "A Characteristic Signature of Magnetospheric Wave-Particle Interactions   Found in the Turbulent E-region",
    "abstract": "Plasma waves in the magnetosphere scatter electrons, causing them to precipitate into Earth's atmosphere, imparting their temporal characteristics to diffuse auroras. In a case study of conjugate radar and satellite observations, we demonstrate a close and unprecedented association between enhanced electrostatic cyclotron harmonic wave activity in the magnetosphere and the appearance of meter-scale plasma turbulence a few seconds later in the lower ionosphere on nearby magnetic field lines. Such direct structuring of the ionosphere carries implications for our understanding of space weather.",
    "authors": [
      "Magnus F Ivarsen",
      "Yukinaga Miyashita",
      "Jean-Pierre St-Maurice",
      "Glenn C Hussey",
      "Brian Pitzel",
      "Draven Galeschuk",
      "Saif Marei",
      "Richard B Horne",
      "Yoshiya Kasahara",
      "Shoya Matsuda",
      "Satoshi Kasahara",
      "Kunihiro Keika",
      "Yoshizumi Miyoshi",
      "Kazuhiro Yamamoto",
      "Atsuki Shinbori",
      "Devin R Huyghebaert",
      "Ayako Matsuoka",
      "Shoichiro Yokota",
      "Fuminori Tsuchiya"
    ],
    "published": "2025-01-07T19:33:37Z",
    "updated": "2025-10-10T07:35:42Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.EP",
      "physics.geo-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph",
    "doi": "10.1103/PhysRevLett.134.145201"
  },
  {
    "arxiv_id": "2510.06665v2",
    "url": "https://arxiv.org/abs/2510.06665v2",
    "pdf_url": "https://arxiv.org/pdf/2510.06665v2.pdf",
    "title": "Doping of a Borexino-like Liquid Scintillator with Tellurium-Diols",
    "abstract": "One of the most promising approaches for future neutrinoless double beta decay searches is to incorporate a candidate isotope into the liquid scintillator of a next-generation neutrino detector. In this study, a sample of the high-performance 1,2,4-Trimethylbenzene-based liquid scintillator from the Borexino detector was loaded with different concentrations of Te-diols. Therefore,a novel and completely water-free synthesis in a non-acidic organic environment at room temperature was used. Key parameters of the loaded samples were analyzed and compared with those of the pure Borexino liquid. Both the emission spectrum and transmission remained nearly unchanged,even at high doping levels. The reduction in light yield was moderate, with approximately 8,400 photons emitted for a 1 MeV energy deposition by an electron at 1$\\%$ tellurium loading. The time profile of the light emission induced by alpha particles was also investigated, revealing that the scintillation response becomes significantly faster with increasing tellurium concentration.",
    "authors": [
      "Hans Th. J. Steiger",
      "Marco Beretta",
      "Manuel Böhles",
      "Alberto Garfagnini",
      "Arsenii Gavrikov",
      "Paolo Lombardi",
      "Kai Loo",
      "Elena Pasini",
      "Benedetta Rasera",
      "Andrea Serafini",
      "Michael Wurm"
    ],
    "published": "2025-10-08T05:32:35Z",
    "updated": "2025-10-10T06:25:10Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.02258v2",
    "url": "https://arxiv.org/abs/2510.02258v2",
    "pdf_url": "https://arxiv.org/pdf/2510.02258v2.pdf",
    "title": "Predicting the single-site and multi-site event discrimination power of   dual-phase time projection chambers",
    "abstract": "Dual-phase xenon time projection chambers (TPCs) are widely used in searches for rare dark matter and neutrino interactions, in part because of their excellent position reconstruction capability in 3D. Despite their millimeter-scale resolution along the charge drift axis, xenon TPCs face challenges in resolving single-site (SS) and multi-site (MS) interactions in the transverse plane. In this paper, we build a generic TPC model with an idealized light-based signal readout, and use Fisher Information (FI) to study its theoretical capability of differentiating SS and MS events. We also demonstrate via simulation that this limit can be approached with conventional reconstruction algorithms like maximum likelihood estimation, and with a convolutional neural network classifier. The implications of this study on future TPC experiments will be discussed.",
    "authors": [
      "A. B. M. Rafi Sazzad",
      "Clarke A. Hardy",
      "Xiang Dai",
      "Jingke Xu",
      "Brian G. Lenardo",
      "Felicia Sutanto",
      "Nicholas A. Antipa",
      "Jeremy D. Koertzen",
      "Prince John",
      "Abraham Akinin",
      "Teal J. Pershing"
    ],
    "published": "2025-10-02T17:41:15Z",
    "updated": "2025-10-09T21:53:53Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2510.08835v1",
    "url": "https://arxiv.org/abs/2510.08835v1",
    "pdf_url": "https://arxiv.org/pdf/2510.08835v1.pdf",
    "title": "Burnup Measurement using Bent Crystal Spectrometer for Pebble Bed   Reactors",
    "abstract": "Burnup measurement is essential for monitoring and controlling pebble bed reactors (PBRs), where fuel pebbles circulate rapidly through the core. However, conventional gamma spectroscopy using high purity germanium (HPGe) detectors is difficult due to high activity levels in discharge pebbles, leading to excessive dead time and Compton scattering. This study explores the use of bent crystal diffraction (BCD) spectrometers to filter the emitted gamma spectrum and isolate key peaks for improved measurement accuracy and speed. Pebble wise depletion calculations were performed and the resulting spectra were analyzed using ray tracing (SHADOW3) and gamma response modeling (GADRAS). Key isotopes, $^{137m}$Ba/$^{137}$Cs, $^{239}$Pu, $^{144}$Ce, $^{148m}$Pm, and $^{140}$La, were found to strongly correlate with burnup, residence time, core passes, plutonium production, and fluence. Machine learning regression models applied to simulated spectra achieved a coefficient of determination ($R^2$) as high as 0.995 for burnup prediction. Among various BCD configurations, mosaic silicon crystals in the (440) orientation combined with an HPGe detector provided optimal performance for $^{137m}$Ba, while (220) and (440) configurations paired with scintillators were effective for the remaining isotopes.",
    "authors": [
      "Ian Kolaja",
      "Lee Bernstein",
      "Ludovic Jantzen",
      "Eleanor Tubman",
      "Tatiana Siaraferas",
      "Massimiliano Fratoni"
    ],
    "published": "2025-10-09T21:48:20Z",
    "updated": "2025-10-09T21:48:20Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.06289v2",
    "url": "https://arxiv.org/abs/2510.06289v2",
    "pdf_url": "https://arxiv.org/pdf/2510.06289v2.pdf",
    "title": "Ultracold Neutron Guide-Coating Facility at U.Winnipeg",
    "abstract": "We report the construction and commissioning of a new ultracold neutron (UCN) guide-coating facility at the University of Winnipeg. The facility employs pulsed laser deposition (PLD) to produce diamond-like carbon (DLC) coatings on cylindrical UCN guides up to 1 m in length with a 200 mm outer diameter. DLC is a promising material for UCN transport and storage due to its high Fermi potential, low neutron absorption, and low depolarization probabilities. First coating attempts on a full length aluminum UCN guide were successfully coated with densities of 2.2-2.3 g/cm$^3$, corresponding to Fermi potentials of 198-207 neV as measured by X-ray reflectometry (XRR). Coating thicknesses were measured to be 90-180 nm with no evidence of delamination. These results establish the coating facility. Ongoing and future work focuses on improving the diamond content of films through plasma plume collimation, substrate biasing, and pre/post treatment methods with the goal of providing high quality DLC UCN guides for the TUCAN experiment at TRIUMF.",
    "authors": [
      "T. Hepworth",
      "A. Zahra",
      "B. Algohi",
      "R. de Vries",
      "S. Pankratz",
      "P. Switzer",
      "T. Reimer",
      "M. McCrea",
      "J. W. Martin",
      "R. Mammei",
      "D. Anthony",
      "L. Barrón-Palos",
      "M. Bossé",
      "M. P. Bradley",
      "A. Brossard",
      "T. Bui",
      "J. Chak",
      "R. Chiba",
      "C. Davis",
      "K. Drury",
      "D. Fujimoto",
      "R. Fujitani",
      "M. Gericke",
      "P. Giampa",
      "C. Gibson",
      "R. Golub",
      "T. Higuchi",
      "G. Ichikawa",
      "I. Ide",
      "S. Imajo",
      "A. Jaison",
      "B. Jamieson",
      "M. Katotoka",
      "S. Kawasaki",
      "M. Kitaguchi",
      "W. Klassen",
      "E. Korkmaz",
      "E. Korobkina",
      "M. Lavvaf",
      "T. Lindner",
      "N. Lo",
      "S. Longo",
      "K. W. Madison",
      "Y. Makida",
      "J. Malcolm",
      "J. Mammei",
      "Z. Mao",
      "C. Marshall",
      "R. Matsumiya",
      "E. Miller",
      "M. Miller",
      "K. Mishima",
      "T. Mohammadi",
      "T. Momose",
      "M. Nalbandian",
      "T. Okamura",
      "R. Patni",
      "R. Picker",
      "K. Qiao",
      "W. D. Ramsay",
      "W. Rathnakela",
      "D. Salazar",
      "J. Sato",
      "W. Schreyer",
      "T. Shima",
      "H. M. Shimizu",
      "S. Sidhu",
      "S. Stargardter",
      "R. Stutters",
      "I. Tanihata",
      "Tushar",
      "W. T. H. van Oers",
      "N. Yazdandoost",
      "Q. Ye",
      "M. Zhao"
    ],
    "published": "2025-10-07T04:53:12Z",
    "updated": "2025-10-09T20:34:51Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2503.10383v3",
    "url": "https://arxiv.org/abs/2503.10383v3",
    "pdf_url": "https://arxiv.org/pdf/2503.10383v3.pdf",
    "title": "Position Reconstruction in the DEAP-3600 Dark Matter Search Experiment",
    "abstract": "In the DEAP-3600 dark matter search experiment, precise reconstruction of the positions of scattering events in liquid argon is key for background rejection and defining a fiducial volume that enhances dark matter candidate events identification. This paper describes three distinct position reconstruction algorithms employed by DEAP-3600, leveraging the spatial and temporal information provided by photomultipliers surrounding a spherical liquid argon vessel. Two of these methods are maximum-likelihood algorithms: the first uses the spatial distribution of detected photoelectrons, while the second incorporates timing information from the detected scintillation light. Additionally, a machine learning approach based on the pattern of photoelectron counts across the photomultipliers is explored.",
    "authors": [
      "The DEAP Collaboration",
      "P. Adhikari",
      "R. Ajaj",
      "M. Alpízar-Venegas",
      "P. -A. Amaudruz",
      "J. Anstey",
      "G. R. Araujo",
      "D. J. Auty",
      "M. Baldwin",
      "M. Batygov",
      "B. Beltran",
      "H. Benmansour",
      "M. A. Bigentini",
      "C. E. Bina",
      "J. Bonatt",
      "W. M. Bonivento",
      "M. G. Boulay",
      "B. Broerman",
      "J. F. Bueno",
      "P. M. Burghardt",
      "A. Butcher",
      "M. Cadeddu",
      "B. Cai",
      "M. Cárdenas-Montes",
      "S. Cavuoti",
      "M. Chen",
      "Y. Chen",
      "S. Choudhary",
      "B. T. Cleveland",
      "J. M. Corning",
      "R. Crampton",
      "D. Cranshaw",
      "S. Daugherty",
      "P. DelGobbo",
      "K. Dering",
      "P. Di Stefano",
      "J. DiGioseffo",
      "G. Dolganov",
      "L. Doria",
      "F. A. Duncan",
      "M. Dunford",
      "E. Ellingwood",
      "A. Erlandson",
      "S. S. Farahani",
      "N. Fatemighomi",
      "G. Fiorillo",
      "S. Florian",
      "A. Flower",
      "R. J. Ford",
      "R. Gagnon",
      "D. Gahan",
      "D. Gallacher",
      "A. Garai",
      "P. García Abia",
      "S. Garg",
      "P. Giampa",
      "A. Giménez-Alcázar",
      "D. Goeldi",
      "V. V. Golovko",
      "P. Gorel",
      "K. Graham",
      "D. R. Grant",
      "A. Grobov",
      "A. L. Hallin",
      "M. Hamstra",
      "P. J. Harvey",
      "S. Haskins",
      "C. Hearns",
      "J. Hu",
      "J. Hucker",
      "T. Hugues",
      "A. Ilyasov",
      "B. Jigmeddorj",
      "C. J. Jillings",
      "A. Joy",
      "O. Kamaev",
      "G. Kaur",
      "A. Kemp",
      "M. Khoshraftar Yazdi",
      "M. Kuźniak",
      "F. La Zia",
      "M. Lai",
      "S. Langrock",
      "B. Lehnert",
      "A. Leonhardt",
      "J. LePage-Bourbonnais",
      "N. Levashko",
      "J. Lidgard",
      "T. Lindner",
      "M. Lissia",
      "J. Lock",
      "L. Luzzi",
      "I. Machulin",
      "P. Majewski",
      "A. Maru",
      "J. Mason",
      "A. B. McDonald",
      "T. McElroy",
      "T. McGinn",
      "J. B. McLaughlin",
      "R. Mehdiyev",
      "C. Mielnichuk",
      "L. Mirasola",
      "A. Moharana",
      "J. Monroe",
      "A. Murray",
      "P. Nadeau",
      "C. Nantais",
      "C. Ng",
      "A. J. Noble",
      "E. O'Dwyer",
      "G. Oliviéro",
      "M. Olszewski",
      "C. Ouellet",
      "S. Pal",
      "D. Papi",
      "B. Park",
      "P. Pasuthip",
      "S. J. M. Peeters",
      "M. Perry",
      "V. Pesudo",
      "E. Picciau",
      "M. -C. Piro",
      "T. R. Pollmann",
      "F. Rad",
      "E. T. Rand",
      "C. Rethmeier",
      "F. Retière",
      "I. Rodríguez García",
      "L. Roszkowski",
      "J. B. Ruhland",
      "R. Santorelli",
      "F. G. Schuckman II",
      "N. Seeburn",
      "S. Seth",
      "V. Shalamova",
      "K. Singhrao",
      "P. Skensved",
      "T. Smirnova",
      "N. J. T. Smith",
      "B. Smith",
      "K. Sobotkiewich",
      "T. Sonley",
      "J. Sosiak",
      "J. Soukup",
      "R. Stainforth",
      "G. Stanic",
      "C. Stone",
      "V. Strickland",
      "M. Stringer",
      "B. Sur",
      "J. Tang",
      "R. Turcotte-Tardif",
      "E. Vázquez-Jáuregui",
      "L. Veloce",
      "S. Viel",
      "B. Vyas",
      "M. Walczak",
      "J. Walding",
      "M. Waqar",
      "M. Ward",
      "S. Westerdale",
      "J. Willis",
      "R. Wormington",
      "A. Zuñiga-Reyes"
    ],
    "published": "2025-03-13T13:57:49Z",
    "updated": "2025-10-09T19:00:51Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/07/P07012"
  },
  {
    "arxiv_id": "2406.18597v3",
    "url": "https://arxiv.org/abs/2406.18597v3",
    "pdf_url": "https://arxiv.org/pdf/2406.18597v3.pdf",
    "title": "Relative Measurement and Extrapolation of the Scintillation Quenching   Factor of $α$-Particles in Liquid Argon using DEAP-3600 Data",
    "abstract": "The knowledge of scintillation quenching of $\\alpha$-particles plays a paramount role in understanding $\\alpha$-induced backgrounds and improving the sensitivity of liquid argon-based direct detection of dark matter experiments. We performed a relative measurement of scintillation quenching in the MeV energy region using radioactive isotopes ($^{222}$Rn, $^{218}$Po and $^{214}$Po isotopes) present in trace amounts in the DEAP-3600 detector and quantified the uncertainty of extrapolating the quenching factor to the low-energy region.",
    "authors": [
      "DEAP Collaboration",
      "P. Adhikari",
      "M. Alpízar-Venegas",
      "P. -A. Amaudruz",
      "J. Anstey",
      "D. J. Auty",
      "M. Batygov",
      "B. Beltran",
      "C. E. Bina",
      "W. Bonivento",
      "M. G. Boulay",
      "J. F. Bueno",
      "B. Cai",
      "M. Cárdenas-Montes",
      "S. Choudhary",
      "B. T. Cleveland",
      "R. Crampton",
      "S. Daugherty",
      "P. DelGobbo",
      "P. Di Stefano",
      "G. Dolganov",
      "L. Doria",
      "F. A. Duncan",
      "M. Dunford",
      "E. Ellingwood",
      "A. Erlandson",
      "S. S. Farahani",
      "N. Fatemighomi",
      "G. Fiorillo",
      "R. J. Ford",
      "D. Gahan",
      "D. Gallacher",
      "P. García Abia",
      "S. Garg",
      "P. Giampa",
      "A. Giménez-Alcázar",
      "D. Goeldi",
      "P. Gorel",
      "K. Graham",
      "A. L. Hallin",
      "M. Hamstra",
      "S. Haskins",
      "J. Hu",
      "J. Hucker",
      "T. Hugues",
      "A. Ilyasov",
      "B. Jigmeddorj",
      "C. J. Jillings",
      "G. Kaur",
      "M. Khoshraftar Yazdi",
      "A. Kemp",
      "M. Kuźniak",
      "F. La Zia",
      "M. Lai",
      "S. Langrock",
      "B. Lehnert",
      "N. Levashko",
      "M. Lissia",
      "L. Luzzi",
      "I. Machulin",
      "A. Maru",
      "J. Mason",
      "A. B. McDonald",
      "T. McElroy",
      "J. B. McLaughlin",
      "C. Mielnichuk",
      "L. Mirasola",
      "A. Moharana",
      "J. Monroe",
      "A. Murray",
      "C. Ng",
      "G. Oliviéro",
      "M. Olszewski",
      "S. Pal",
      "D. Papi",
      "B. Park",
      "M. Perry",
      "V. Pesudo",
      "T. R. Pollmann",
      "F. Rad",
      "C. Rethmeier",
      "F. Retière",
      "L. Roszkowski",
      "R. Santorelli",
      "F. G. Schuckman II",
      "S. Seth",
      "V. Shalamova",
      "P. Skensved",
      "T. Smirnova",
      "K. Sobotkiewich",
      "T. Sonley",
      "J. Sosiak",
      "J. Soukup",
      "R. Stainforth",
      "M. Stringer",
      "J. Tang",
      "E. Vázquez-Jáuregui",
      "S. Viel",
      "B. Vyas",
      "M. Walczak",
      "J. Walding",
      "M. Ward",
      "S. Westerdale",
      "R. Wormington"
    ],
    "published": "2024-06-12T16:57:54Z",
    "updated": "2025-10-09T18:41:47Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1140/epjc/s10052-024-13518-7"
  },
  {
    "arxiv_id": "2510.08735v1",
    "url": "https://arxiv.org/abs/2510.08735v1",
    "pdf_url": "https://arxiv.org/pdf/2510.08735v1.pdf",
    "title": "Emergence of advection-diffusion transport structure and nonlinear   amplitude evolution of strongly driven instabilities",
    "abstract": "Instabilities driven by strong gradients appear in a wide variety of physical systems, including plasmas, neutral fluids, and self-gravitating systems. This work develops an analytic formulation to describe the transport structure and nonlinear amplitude evolution of a discrete, strongly driven instability in the presence of energy sources and sinks. Initially, the mode is found to evolve linearly until the gradient in the distribution has been exhausted. It then transitions to a nonlinear phase governed by a Bernoulli differential equation, for which a closed-form analytic solution is found, and continues to evolve until the energy sources and sinks reach equilibrium. During the nonlinear phase, the leading order distribution function is found to persistently satisfy an advection-diffusion equation in time and energy coordinates. These analytical results are shown to agree closely with nonlinear kinetic simulations and to be readily applicable in the study of resonant transport in plasmas, galaxies and viscous shear flows.",
    "authors": [
      "Emma G. Devin",
      "Vinícius N. Duarte"
    ],
    "published": "2025-10-09T18:40:41Z",
    "updated": "2025-10-09T18:40:41Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.GA",
      "physics.flu-dyn"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.05507v2",
    "url": "https://arxiv.org/abs/2510.05507v2",
    "pdf_url": "https://arxiv.org/pdf/2510.05507v2.pdf",
    "title": "Prediction of Spallation Induced Transmutation Rates For Long Lived   Fission Products via Proton Accelerator",
    "abstract": "Long lived fission products represent a major challenge in nuclear waste management due to persistent radiotoxicity over very long timescales. This study focuses on six of these fission products: Se-79, Zr-93, Tc-99, Sn-126, I-127, Cs-135. This study investigates the feasibility of spallation driven transmutation, in which a high energy proton beam strikes a heavy spallation target to generate neutrons that induce transmutation in the fission products surrounding the target. Lead and depleted uranium are identified as the principal spallation target candidates, reflecting contrasting trade offs in neutron yield, secondary reactions, and heat generation. Simulations assess nuclide specific behavior under reactor scale inventories and practical geometric constraints. Results demonstrate that technetium, iodine, and selenium are strong candidates for transmutation using this pathway, while tin shows partial resistance but benefits from thermal flux. By contrast, zirconium is neutron transparent and inefficient to transmute, and cesium suffers from low net reduction due to competition with lighter isotopes. Cost effectiveness is highly isotope dependent: technetium is most favorable, whereas cesium and zirconium remain expensive. These findings highlight the advantages and limitations of spallation driven systems and motivate strategies with optimized target-blanket designs.",
    "authors": [
      "Grigor Tukharyan",
      "William Reed Kendrick",
      "Areg Danagoulian",
      "Benoit Forget"
    ],
    "published": "2025-10-07T01:51:34Z",
    "updated": "2025-10-09T18:32:39Z",
    "categories": [
      "physics.acc-ph",
      "nucl-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.08441v1",
    "url": "https://arxiv.org/abs/2510.08441v1",
    "pdf_url": "https://arxiv.org/pdf/2510.08441v1.pdf",
    "title": "Silicon Wafer Fracture Stress for Tracking Sensors in Particle Physics   Experiments",
    "abstract": "For the construction of the ATLAS Inner Tracker strip detector, silicon strip sensor modules are glued directly onto carbon fibre support structures using a soft silicone gel. During tests at temperatures below \\unit[-35]{$^{\\circ}$C}, several of the sensors were found to crack due to a mismatch in coefficients of thermal expansion between polyimide circuit boards with copper metal layers (glued onto the sensor) and the silicon sensor itself. While module assembly procedures were developed to minimise variations between modules, cold tests showed a wide range of temperatures at which supposedly comparable modules failed. The observed variance (fracture temperatures between \\unit[-35]{\\textcelsius} and \\unit[-70]{\\textcelsius}) for supposedly comparable modules suggests an undetected variation between modules suspected to be intrinsic to the silicon wafer itself. Therefore, a test programme was developed to investigate the fracture stress of representative sensor wafer cutoffs. This paper presents results for the fracture stress of silicon sensors used in detector modules.",
    "authors": [
      "Haider Abidi",
      "Vitaliy Fadeyev",
      "Tim Jones",
      "Akhil Kumar",
      "Tom Lee",
      "Luise Poley",
      "Craig Sawyer",
      "Giorgio Vallone",
      "Sven Wonsak"
    ],
    "published": "2025-10-09T16:52:31Z",
    "updated": "2025-10-09T16:52:31Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/10/P10020"
  },
  {
    "arxiv_id": "2508.08981v2",
    "url": "https://arxiv.org/abs/2508.08981v2",
    "pdf_url": "https://arxiv.org/pdf/2508.08981v2.pdf",
    "title": "A 28nm Multiply-Accumulate ASIC Architecture for On-Chip Data   Compression in MHz Frame Rate X-ray and Electron Pixel Detectors",
    "abstract": "Modern X-ray detector systems urgently require compact, efficient, and fast data compression schemes to handle the transmission of big data from pixel arrays, enabling frame rates in the MHz regime. In this work, a data compression ASIC that implements a streaming fixed-length lossy compression scheme is introduced and analyzed, proving the feasibility and benefits of on-chip compression. The compression scheme utilizes a vector matrix product logic, which performs a number of floating-point multiplications, additions, and accumulations. The logic is verified, synthesized, and shown to fit in the area resource available for the X-ray detector under study, which comprises 192 x 168 pixels each of 12-bit width, and having a total area of 20 mm x 20 mm, about 2 mm x 20 mm of which are available for the digital logic. Several system architectures, precisions, and compression ratios ranging from 100 to 250 were analyzed to pave the way for on-chip fixed-length compression (e.g., principal component analysis, singular value decomposition) and data reduction (e.g., azimuthal integration) for X-ray and electron detectors.",
    "authors": [
      "Rami Rasheedi",
      "Nicholas Contini",
      "Mohamed Adel Gharib",
      "Sebastian Strempfer",
      "Senthil Gnanasekaran",
      "Salma Abdelzaher",
      "Tejas Guruswamy",
      "Kazutomo Yoshii",
      "Mike Hammer",
      "Henry Shi",
      "Yu-Sheng Chen",
      "Lorenzo Rota",
      "Dionisio Doering",
      "Angelo Dragone",
      "Tao Zhou",
      "Antonino Miceli"
    ],
    "published": "2025-08-12T14:47:43Z",
    "updated": "2025-10-09T15:21:05Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.08285v1",
    "url": "https://arxiv.org/abs/2510.08285v1",
    "pdf_url": "https://arxiv.org/pdf/2510.08285v1.pdf",
    "title": "Simulation of the thermoelectric effect in a multi-metallic   superconducting cavity",
    "abstract": "Superconducting radio frequency accelerating cavities made with different material layers, such as copper, Nb or Nb3Sn, are susceptible to thermoelectric effects due to differences in Seebeck coefficients between the metals. A temperature gradient across the surfaces can drive thermoelectric currents, which may impact the cavity performance. A layered Cu/Nb/Nb3Sn single cell cavity was tested with cryocoolers in 2022. Three heaters were mounted on the cavity surface at different locations and three single axis cryogenic fluxgate magnetometers were attached close to the cavity equator. A linear increase in the magnetic field was measured while increasing the heaters power. The cavity setup was analysed with COMSOL and the results showed a trend similar to that observed in the experiment. This contribution details the approach chosen for the simulation and some of the challenges encountered.",
    "authors": [
      "N. K. Raut",
      "N. Stilin",
      "J. Vennekate",
      "S. Wang",
      "G. Ciovati"
    ],
    "published": "2025-10-09T14:35:16Z",
    "updated": "2025-10-09T14:35:16Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.18429/JACoW-NAPAC2025-THP070"
  },
  {
    "arxiv_id": "2501.01869v2",
    "url": "https://arxiv.org/abs/2501.01869v2",
    "pdf_url": "https://arxiv.org/pdf/2501.01869v2.pdf",
    "title": "Dual formulation of the maximum entropy method applied to analytic   continuation of quantum Monte Carlo data",
    "abstract": "Many fields of physics use quantum Monte Carlo techniques, but struggle to estimate dynamic spectra via the analytic continuation of imaginary-time quantum Monte Carlo data. One of the most ubiquitous approaches to analytic continuation is the maximum entropy method (MEM). We supply a dual Newton optimization algorithm to be used within the MEM and provide analytic bounds for the algorithm's error. The MEM is typically used with Bryan's controversial algorithm [Rothkopf, \"Bryan's Maximum Entropy Method\" Data 5.3 (2020)]. We present new theoretical issues that are not yet in the literature. Our algorithm has all the theoretical benefits of Bryan's algorithm without these theoretical issues. We compare the MEM with Bryan's optimization to the MEM with our dual Newton optimization on test problems from lattice quantum chromodynamics and plasma physics. These comparisons show that in the presence of noise the dual Newton algorithm produces better estimates and error bars; this indicates the limits of Bryan's algorithm's applicability. We use the MEM to investigate authentic quantum Monte Carlo data for the uniform electron gas at warm dense matter conditions and further substantiate the roton-type feature in the dispersion relation.",
    "authors": [
      "Thomas Chuna",
      "Nicholas Barnfield",
      "Tobias Dornheim",
      "Michael P. Friedlander",
      "Tim Hoheisel"
    ],
    "published": "2025-01-03T15:36:35Z",
    "updated": "2025-10-09T13:09:44Z",
    "categories": [
      "physics.comp-ph",
      "hep-lat",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.comp-ph",
    "doi": "10.1088/1751-8121/adf924"
  },
  {
    "arxiv_id": "2503.22220v2",
    "url": "https://arxiv.org/abs/2503.22220v2",
    "pdf_url": "https://arxiv.org/pdf/2503.22220v2.pdf",
    "title": "Machine learning based parametrization of the resolution function for   the first experimental area (EAR1) of the n_TOF facility at CERN",
    "abstract": "This study addresses a challenge of parametrizing a resolution function of the neutron beam from the neutron time of flight facility n_TOF at CERN. A difficulty stems from a fact that a resolution function exhibits rather strong variations in shape, over approximately 10 orders of magnitude in neutron energy. In order to avoid a need for a manual identification of the appropriate analytical forms - hindering past attempts at its parametrization - we take advantage of the versatile machine learning techniques. In particular, we parametrize it by training a multilayer feedforward neural network, relying on a key idea that such networks act as the universal approximators. The proof of concept is presented for a resolution function for the first experimental area of the n_TOF facility, from the third phase of its operation. We propose an optimal network structure for a resolution function in question, which is also expected to be optimal or near-optimal for other experimental areas and for different phases of n_TOF operation. In order to reconstruct several resolution function forms in common use from a single parametrized form, we provide a practical tool in the form of a specialized C++ class encapsulating the computationally efficient procedures suited to the task. Specifically, the class allows an application of a user-specified temporal spread of a primary proton beam (from a neutron production process at n_TOF) to a desired resolution function form.",
    "authors": [
      "Petar Žugec",
      "Marta Sabate Gilarte",
      "Michael Bacak",
      "Vasilis Vlachoudis",
      "Adria Casanovas",
      "Francisco Garcia Infantes"
    ],
    "published": "2025-03-28T08:12:34Z",
    "updated": "2025-10-09T11:32:45Z",
    "categories": [
      "physics.comp-ph",
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "physics.comp-ph",
    "doi": "10.1007/s41365-025-01820-2"
  },
  {
    "arxiv_id": "2507.20523v3",
    "url": "https://arxiv.org/abs/2507.20523v3",
    "pdf_url": "https://arxiv.org/pdf/2507.20523v3.pdf",
    "title": "Multi-Machine Scaling Laws for Fuel and Impurity Puffing Rates   Sufficient for Detachment Access: a Systematic Review of Magnetic Confinement   Fusion Devices",
    "abstract": "An open-source database encompassing 457 experimental and numerical entries from 32 machines among solid-walled tokamaks, stellarators and linear plasma devices is assembled. From there, we derive physics-informed multi-machine scaling laws predictive of fuel and impurity puffing rates sufficient to access plasma detachment -- leading candidate for a reactor-relevant solution to the open issue of plasma-wall interaction. Validation of our laws in up to 40 plasmas in low- and high-confinement mode also featuring advanced configurations demonstrates accuracy within a factor 1.5 in up to 50% of the instances, and within a factor 2 on average. Divertor volume alone is found to correlate to fuelling. The addition of plasma opaqueness leads to the empirically-calibrated law $\\Gamma_{\\text{D}}\\propto [n_{\\text{sep}}\\times a\\times(S_{\\text{div}}/V_{\\text{div}})^{-1.5}]^{1.05}$ valid across all toroidal devices. Its simplification to $\\Gamma_{\\text{D}}^{\\text{HDL}}\\propto 0.43\\times a^{1.58}\\times\\lambda_q^{-0.89}$ avoids a dependence on $n_{\\text{sep}}$ and bears intrinsic significance provided by the H/L density limit and the power fall-off length. Non-linearities of the impurity dynamics manifest in the seeding rate -- which the present work identifies both a generalised formula for, and the Greenwald-Eich-Scarabosio simplification $\\Gamma_{\\text{Z}}^{\\text{GES}}\\propto a^{1.51}\\times\\lambda_q^{-0.27}$. Similar relationships are defined for stellarators, closely following the mainstream but without providing data for validation -- which should stimulate further investigations. In the era of nuclear fusion reactor design, these results find immediate applicability in informing reactor fuel cycle design and edge plasma modelling. More generally, this study demonstrates that physics-based 0D laws able to relate detachment to the engineering actuators exist.",
    "authors": [
      "M. Moscheni",
      "A. Herrmann",
      "R. Kembleton",
      "M. Kryjak",
      "S. Lazerson",
      "F. Levi",
      "M. Siccinio",
      "P. Staniec",
      "T. Giegerich",
      "C. Tantos",
      "the Gauss Fusion GmbH Team"
    ],
    "published": "2025-07-28T05:11:10Z",
    "updated": "2025-10-09T09:40:59Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.07875v1",
    "url": "https://arxiv.org/abs/2510.07875v1",
    "pdf_url": "https://arxiv.org/pdf/2510.07875v1.pdf",
    "title": "Ion Stochastic Heating by Low-frequency Alfvén Wave Spectrum",
    "abstract": "Finite-amplitude low-frequency Alfv\\'en waves are commonly found in plasma environments, such as space plasmas, and play a crucial role in ion heating. The nonlinear interaction between oblique Alfv\\'en wave spectra and ions has been studied. As the number of wave modes increases, ions are more likely to exhibit chaotic motion and experience stochastic heating. The stochastic heating threshold in the parameter space can be characterized by a single parameter, the effective relative curvature radius $P_{{eff.}}$. The results show excellent agreement with the chaotic regions identified through test particle simulations. The anisotropic characteristics of stochastic heating are explained using a uniform solid angle distribution model. The stochastic heating rate $Q=\\dot{T}$ is calculated, and its relationship with wave conditions is expressed as $Q/(\\Omega_i m_i v_A^2) = H(\\alpha) \\tilde{v}^3 \\tilde{B}_w^2 \\tilde{\\omega}_1$, where $\\alpha$ is propagating angle, $\\Omega_i$ is the gyrofrequency, $m_i$ is the ion mass, $v_A$ is the Alfv\\'en speed, $\\tilde{v}$ is the dimensionless speed, $\\tilde{B}_w$ is the dimensionless wave amplitude, and $\\tilde{\\omega}_1$ is the lowest dimensionless wave frequency.",
    "authors": [
      "Jingyu Peng",
      "Jiansen He"
    ],
    "published": "2025-10-09T07:26:29Z",
    "updated": "2025-10-09T07:26:29Z",
    "categories": [
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.07849v1",
    "url": "https://arxiv.org/abs/2510.07849v1",
    "pdf_url": "https://arxiv.org/pdf/2510.07849v1.pdf",
    "title": "Full-wave computation of SUb-atmospheric Radio-frequency Engine (SURE)",
    "abstract": "Near-space, which covers altitudes from 20 to 100 kilometers, has been receiving more and more attention because of its special strategic value. Airships and high-altitude balloons are two common types of low-speed vehicles that operate in this region. They can be used for jobs like monitoring, communication, and remote sensing, but they need efficient propulsion systems to work well. Earlier, we proposed a new type of electric propulsion system that can ionize the surrounding air to create plasma and produce thrust for near-space vehicles. However, in past experiments, not enough was known about how certain parameters affect power absorption and electromagnetic behavior. Therefore, in this study, we used computer simulations to examine how gas pressure (200 to 1000 Pa), input power (200 to 600 W), frequency (13.56 to 52.24 MHz), and different gas types ($Ar$, $N_2$, $H_2$, $He$) influence inductively coupled plasma inside a quartz tube. We especially focused on comparing two antenna designs: one with a single turn and one with five turns. In all the simulations, the single-turn antenna consistently absorbed power better than the five-turns antenna. Higher frequencies significantly influence both plasma power absorption and magnetic field characteristics. The optimal power absorption occurs at a filling gas pressure of 400 Pa. When varying the input power, we observed an initial decrease followed by an increasing trend, which may be related to ionization mechanisms. In comparisons among different gas types, the inelastic collision mechanisms in molecular gases lead to a notable reduction in plasma power absorption efficiency. The results from this work will help guide the design of future experiments for this electric propulsion concept.",
    "authors": [
      "Dingzhou Li",
      "Lei Chang",
      "Ye Tao"
    ],
    "published": "2025-10-09T06:48:28Z",
    "updated": "2025-10-09T06:48:28Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.07800v1",
    "url": "https://arxiv.org/abs/2510.07800v1",
    "pdf_url": "https://arxiv.org/pdf/2510.07800v1.pdf",
    "title": "Constraints on inelastic dark matter from the CDEX-1B experiment",
    "abstract": "We present limits on spin-independent inelastic WIMP-nucleus scattering using the 737.1 kg $\\cdot$ day dataset from the CDEX-1B experiment. Expected nuclear recoil spectra for various inelastic WIMP masses $m_\\chi$ and mass splittings $\\delta$ are calculated under the standard halo model. An accurate background model of CDEX-1B is constructed by simulating all major background sources. The model parameters are then determined through maximum likelihood estimation and Markov Chain Monte Carlo fitting. The resulting 90\\% confidence level upper limits on the WIMP-nucleon cross section $\\sigma_{\\mathrm{n}}$ exclude certain DAMA/LIBRA allowed regions: the $\\chi^2 < 4$ regions for $\\delta < 30$ keV at $m_\\chi = 250$ GeV and the $\\chi^2 < 9$ region for $\\delta < 50$ keV at $m_\\chi = 500$ GeV. The method is applicable to other inelastic dark matter scenarios, and the upcoming CDEX-50 experiment is expected to improve sensitivity by four orders of magnitude.",
    "authors": [
      "Y. F. Liang",
      "L. T. Yang",
      "Q. Yue",
      "K. J. Kang",
      "Y. J. Li",
      "H. P. An",
      "Greeshma C.",
      "J. P. Chang",
      "H. Chen",
      "Y. H. Chen",
      "J. P. Cheng",
      "J. Y. Cui",
      "W. H. Dai",
      "Z. Deng",
      "Y. X. Dong",
      "C. H. Fang",
      "H. Gong",
      "Q. J. Guo",
      "T. Guo",
      "X. Y. Guo",
      "L. He",
      "J. R. He",
      "H. X. Huang",
      "T. C. Huang",
      "S. Karmakar",
      "Y. S. Lan",
      "H. B. Li",
      "H. Y. Li",
      "J. M. Li",
      "J. Li",
      "M. C. Li",
      "Q. Y. Li",
      "R. M. J. Li",
      "X. Q. Li",
      "Y. L. Li",
      "B. Liao",
      "F. K. Lin",
      "S. T. Lin",
      "J. X. Liu",
      "R. Z. Liu",
      "S. K. Liu",
      "Y. D. Liu",
      "Y. Liu",
      "Y. Y. Liu",
      "H. Ma",
      "Y. C. Mao",
      "A. Mureed",
      "H. Pan",
      "N. C. Qi",
      "J. Ren",
      "X. C. Ruan",
      "M. B. Shen",
      "H. Y. Shi",
      "M. K. Singh",
      "T. X. Sun",
      "W. L. Sun",
      "C. J. Tang",
      "Y. Tian",
      "H. F. Wan",
      "G. F. Wang",
      "J. Z. Wang",
      "L. Wang",
      "Q. Wang",
      "Q. Wang",
      "Y. F. Wang",
      "Y. X. Wang",
      "H. T. Wong",
      "Y. C. Wu",
      "H. Y. Xing",
      "K. Z. Xiong",
      "R. Xu",
      "Y. Xu",
      "T. Xue",
      "Y. L. Yan",
      "N. Yi",
      "C. X. Yu",
      "H. J. Yu",
      "X. Yu",
      "M. Zeng",
      "Z. Zeng",
      "F. S. Zhang",
      "P. Zhang",
      "P. Zhang",
      "Z. Y. Zhang",
      "M. G. Zhao",
      "J. F. Zhou",
      "Z. Y. Zhou",
      "J. J. Zhu"
    ],
    "published": "2025-10-09T05:29:23Z",
    "updated": "2025-10-09T05:29:23Z",
    "categories": [
      "hep-ex",
      "hep-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2510.07792v1",
    "url": "https://arxiv.org/abs/2510.07792v1",
    "pdf_url": "https://arxiv.org/pdf/2510.07792v1.pdf",
    "title": "Aluminum-Based Superconducting Tunnel Junction Sensors for Nuclear   Recoil Spectroscopy",
    "abstract": "The BeEST experiment is searching for sub-MeV sterile neutrinos by measuring nuclear recoil energies from the decay of $^7$Be implanted into superconducting tunnel junction (STJ) sensors. The recoil spectra are affected by interactions between the radioactive implants and the sensor materials. We are therefore developing aluminum-based STJs (Al-STJs) as an alternative to existing tantalum devices (Ta-STJs) to investigate how to separate material effects in the recoil spectrum from potential signatures of physics beyond the Standard Model. Three iterations of Al-STJs were fabricated. The first had electrode thicknesses similar to existing Ta-STJs. They had low responsivity and reduced resolution, but were used successfully to measure $^7$Be nuclear recoil spectra. The second iteration had STJs suspended on thin SiN membranes by backside etching. These devices had low leakage current, but also low yield. The final iteration was not backside etched, and the Al-STJs had thinner electrodes and thinner tunnel barriers to increase signal amplitudes. These devices achieved 2.96 eV FWHM energy resolution at 50 eV using a pulsed 355 nm (~3.5 eV) laser. These results establish Al-STJs as viable detectors for systematic material studies in the BeEST experiment.",
    "authors": [
      "Spencer L. Fretwell",
      "Connor Bray",
      "Inwook Kim",
      "Andrew Marino",
      "Benjamin Waters",
      "Robin Cantor",
      "Ad Hall",
      "Pedro Amaro",
      "Adrien Andoche",
      "David Diercks",
      "Abigail Gillespie",
      "Mauro Guerra",
      "Cameron N. Harris",
      "Jackson T. Harris",
      "Leendert M. Hayen",
      "Paul Antoine Hervieux",
      "Geon Bo Kim",
      "Annika Lennarz",
      "Vincenzo Lordi",
      "Jorge Machado",
      "Peter Machule",
      "David McKeen",
      "Xavier Mougeot",
      "Francisco Ponce",
      "Chris Ruiz",
      "Amit Samanta",
      "José Paulo Santos",
      "Joseph Smolsky",
      "Caitlyn Stone-Whitehead",
      "Joseph Templet",
      "William K. Warburton",
      "K. G. Leach",
      "S. Friedrich"
    ],
    "published": "2025-10-09T05:11:47Z",
    "updated": "2025-10-09T05:11:47Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.07690v1",
    "url": "https://arxiv.org/abs/2510.07690v1",
    "pdf_url": "https://arxiv.org/pdf/2510.07690v1.pdf",
    "title": "Lithographic integration of TES microcalorimeters with SQUID multiplexer   circuits for large format spectrometers",
    "abstract": "Arrays of hundreds or thousands of low temperature detectors have been deployed for many experiments, both bolometers for long wavelength applications and calorimeters for shorter wavelength applications. One challenge that is common to many of these arrays is the efficient use of focal plane area to achieve a large fill fraction of absorbers coupled to detectors. We are developing an integrated fabrication of soft X-ray transition edge sensors (TES) and microwave SQUID multiplexers ($\\mu$MUX) with the goal of maximizing the fill fraction of the focal plane area on a scale of many thousand pixel detectors. We will utilize lithographically defined high density interconnects to circumvent limitations in existing solutions that use wirebonds or flip-chip bonds. Here we report the first demonstration of combining TES and $\\mu$MUX processes into a single TES-System-on-a-Chip (TES-SoC) fabrication on a silicon wafer. The $\\mu$MUX SQUIDs and TES electrothermal feedback circuits are microfabricated first and protected with passivating SiO$_2$, then the TES devices and TES-to-SQUID interconnects are fabricated, and finally the protective layer is removed before the fabrication of the microwave resonators. We show that the microwave SQUIDs are functional and have reasonable yield, and that we are able to read out the transition temperature of the connected TESs using those SQUIDs.",
    "authors": [
      "Robinjeet Singh",
      "Avirup Roy",
      "Daniel Becker",
      "Johnathan D. Gard",
      "Mark W. Keller",
      "John A. B. Mates",
      "Kelsey M. Morgan",
      "Nathan J. Ortiz",
      "Daniel R. Schmidt",
      "Daniel S. Swetz",
      "Joel N. Ullom",
      "Leila R. Vale",
      "Michael Vissers",
      "Galen C. O'Neil",
      "Joel C. Weber"
    ],
    "published": "2025-10-09T02:28:24Z",
    "updated": "2025-10-09T02:28:24Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.supr-con",
      "physics.app-ph",
      "quant-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.07603v1",
    "url": "https://arxiv.org/abs/2510.07603v1",
    "pdf_url": "https://arxiv.org/pdf/2510.07603v1.pdf",
    "title": "12th Low-Level RF Workshop (LLRF2025)",
    "abstract": "This volume contains contributions submitted to the 12th Low-Level RF Workshop which will be held in Newport News, Virginia, USA on October 12-16, 2025. This workshop continues the series of successful international workshops held in Newport News, USA (2001), Geneva, Switzerland (2005), Knoxville, USA (2007), Tsukuba, Japan (2009), Hamburg, Germany (2011), Tahoe City, USA (2013), Shanghai, China (2015), Barcelona, Spain (2017), Chicago, USA (2019), Brugg-Windisch, Switzerland (2022), and Gyeongju, South Korea (2023).",
    "authors": [
      "Dmitry Teytelman"
    ],
    "published": "2025-10-08T22:49:38Z",
    "updated": "2025-10-08T22:49:38Z",
    "categories": [
      "physics.acc-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.07510v1",
    "url": "https://arxiv.org/abs/2510.07510v1",
    "pdf_url": "https://arxiv.org/pdf/2510.07510v1.pdf",
    "title": "Efficient Radiofrequency Sensing with Fluorescence Encoding",
    "abstract": "Optically-active spin qubits have emerged as powerful quantum sensors capable of nanoscale magnetometry, yet conventional coherent sensing approaches are ultimately limited by the coherence time of the sensor, typically precluding detection in the sub-MHz regime. We present a broadly applicable fluorescence-encoding method that circumvents coherence-time constraints by transducing time-varying magnetic fields directly into modulated fluorescence signals. Using nitrogen-vacancy centers in diamond as a model system, we demonstrate shot-noise-limited sensitivity for AC magnetic fields spanning near-DC to MHz frequencies, with detection bandwidth tunable via optical excitation power. The technique captures complete spectral information in a single measurement, eliminating the need for point-by-point frequency scanning, and allows phase-sensitive multi-frequency detection with Hz-level resolution. This approach transforms quantum sensors into atomic-scale spectrum analyzers, with immediate applications for low-frequency RF communication, zero-field NMR, and bioelectronic sensing. Our approach is broadly applicable to the expanding class of optically-active spin qubits, including molecular systems and fluorescent proteins, opening new sensing regimes previously inaccessible to coherent techniques",
    "authors": [
      "Nicole Voce",
      "Paul Stevenson"
    ],
    "published": "2025-10-08T20:17:23Z",
    "updated": "2025-10-08T20:17:23Z",
    "categories": [
      "quant-ph",
      "physics.ins-det"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2510.07502v1",
    "url": "https://arxiv.org/abs/2510.07502v1",
    "pdf_url": "https://arxiv.org/pdf/2510.07502v1.pdf",
    "title": "Does Turbulence at the Correlation Scale Regulate the Statistics of   Magnetic Reconnection?",
    "abstract": "We study the statistics of dynamical quantities associated with magnetic reconnection events embedded in a sea of strong background magnetohydrodynamic (MHD) turbulence using direct numerical simulations. We focus on the relationship of the reconnection properties to the statistics of global turbulent fields. For the first time, we show that the distribution in turbulence of reconnection rates (determined by upstream fields) is strongly correlated with the magnitude of the global turbulent magnetic field at the correlation scale. The average reconnection rates, and associated dissipation rates, during turbulence are thus much larger than predicted by using turbulent magnetic field fluctuation amplitudes at the dissipation or kinetic scales. Magnetic reconnection may therefore be playing a major role in energy dissipation in astrophysical and heliospheric turbulence.",
    "authors": [
      "M. B. Khan",
      "M. A. Shay",
      "S. Oughton",
      "W. H. Matthaeus",
      "C. C. Haggerty",
      "S. Adhikari",
      "P. A. Cassak",
      "S. Fordin",
      "D. O'Donnell",
      "Y. Yang",
      "R. Bandyopadhyay",
      "S. Roy"
    ],
    "published": "2025-10-08T19:56:03Z",
    "updated": "2025-10-08T19:56:03Z",
    "categories": [
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.07485v1",
    "url": "https://arxiv.org/abs/2510.07485v1",
    "pdf_url": "https://arxiv.org/pdf/2510.07485v1.pdf",
    "title": "In-pixel integration of signal processing and AI/ML based data filtering   for particle tracking detectors",
    "abstract": "We present the first physical realization of in-pixel signal processing with integrated AI-based data filtering for particle tracking detectors. Building on prior work that demonstrated a physics-motivated edge-AI algorithm suitable for ASIC implementation, this work marks a significant milestone toward intelligent silicon trackers. Our prototype readout chip performs real-time data reduction at the sensor level while meeting stringent requirements on power, area, and latency. The chip is taped-out in 28nm TSMC CMOS bulk process, which has been shown to have sufficient radiation hardness for particle experiments. This development represents a key step toward enabling fully on-detector edge AI, with broad implications for data throughput and discovery potential in high-rate, high-radiation environments such as the High-Luminosity LHC.",
    "authors": [
      "Benjamin Parpillon",
      "Anthony Badea",
      "Danush Shekar",
      "Christian Gingu",
      "Giuseppe Di Guglielmo",
      "Tom Deline",
      "Adam Quinn",
      "Michele Ronchi",
      "Benjamin Weiss",
      "Jennet Dickinson",
      "Jieun Yoo",
      "Corrinne Mills",
      "Daniel Abadjiev",
      "Eric You",
      "Mira Littmann",
      "Karri DiPetrillo",
      "Arghya Ranjan Das",
      "Mia Liu",
      "David Jiang",
      "Mark S. Neubauer",
      "Morris Swartz",
      "Petar Maksimovic",
      "Alice Bean",
      "Chinar Syal",
      "Doug Berry",
      "Nhan Tran",
      "Lindsey Gray",
      "Farah Fahim"
    ],
    "published": "2025-10-08T19:35:15Z",
    "updated": "2025-10-08T19:35:15Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.07224v1",
    "url": "https://arxiv.org/abs/2510.07224v1",
    "pdf_url": "https://arxiv.org/pdf/2510.07224v1.pdf",
    "title": "Sextupole reduction via chaos suppression at the National Synchrotron   Light Source II",
    "abstract": "We revisit the nonlinear lattice design approach for the National Synchrotron Light Source II (NSLS-II) storage ring. By suppressing chaos, we identify alternative sextupole configurations to the original design, which relied on the conventional strategy of simultaneously minimizing Resonance Driving Terms (RDTs) and Amplitude-Dependent Detuning (ADD). These alternatives achieve comparable performance while requiring fewer sextupoles. A detailed comparison of two representative solutions is presented and supported by experimental validation. Our results show that the dynamic aperture correlates more strongly with global chaos than with individual RDTs, and that the importance of minimizing ADD may have been overstated in earlier design strategies.",
    "authors": [
      "Yongjun Li",
      "Minghao Song",
      "Yoshiteru Hidaka",
      "Victor Smaluk",
      "Timur Shaftan"
    ],
    "published": "2025-10-08T16:57:36Z",
    "updated": "2025-10-08T16:57:36Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.04385v2",
    "url": "https://arxiv.org/abs/2510.04385v2",
    "pdf_url": "https://arxiv.org/pdf/2510.04385v2.pdf",
    "title": "Structure-Preserving MHD-Driftkinetic Discretization for Wave-Particle   Interactions",
    "abstract": "We present a structure-preserving discretization of the hybrid magnetohydrodynamics (MHD)-driftkinetic system for simulations of low-frequency wave-particle interactions. The model equations are derived from a variational principle, assuring energetically consistent couplings between MHD fluids and driftkinetic particles. The spatial discretization is based on a finite-element-exterior-calculus (FEEC) framework for the MHD and a particle-in-cell (PIC) method for the driftkinetic. A key feature of the scheme is the inclusion of the non-quadratic particle magnetic moment energy term in the Hamiltonian, which is introduced by the guiding-center approximation. The resulting discrete Hamiltonian structure naturally organizes the dynamics into skew-symmetric subsystems, enabling balanced energy exchange. To handle the non-quadratic energy term, we develop energy-preserving time integrators based on discrete gradient methods. The algorithm is implemented in the open-source Python package $\\texttt{STRUPHY}$. Numerical experiments confirm the energy-conserving property of the scheme and demonstrate the capability to simulate energetic particles (EP) induced excitation of toroidal Alfv\\'en eigenmodes (TAE) without artificial dissipation or mode filtering. This capability highlights the potential of structure-preserving schemes for high-fidelity simulations of hybrid systems.",
    "authors": [
      "Byung Kyu Na",
      "Stefan Possanner",
      "Xin Wang"
    ],
    "published": "2025-10-05T22:34:28Z",
    "updated": "2025-10-08T16:41:00Z",
    "categories": [
      "physics.comp-ph",
      "cs.NA",
      "math.NA",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.comp-ph"
  },
  {
    "arxiv_id": "2510.07144v1",
    "url": "https://arxiv.org/abs/2510.07144v1",
    "pdf_url": "https://arxiv.org/pdf/2510.07144v1.pdf",
    "title": "Chaotic Motion of Ions In Finite-amplitude Low-frequency Alfvén Waves",
    "abstract": "Finite-amplitude low-frequency Alfv\\'en waves (AWs) are commonly found in plasma environments, such as space plasmas, and play a crucial role in ion heating. In this study, we examine the nonlinear interactions between monochromatic AWs and ions. When the wave amplitude and propagation angle lie within certain ranges, particle motion becomes chaotic. We quantify this chaotic behavior using the maximum Lyapunov exponent, $\\lambda_m$, and find that chaos depends on the particles' initial states. To characterize the proportion of chaotic particles across different initial states, we introduce the Chaos Ratio ($CR$). The threshold for the onset of global chaos is calculated as the contour line of $CR=0.01$. We analyze changes in the magnetic moment during particle motion and identify the physical image of chaos as pitch-angle scattering caused by wave-induced field line curvature (WFLC). Consequently, the condition for chaos can be expressed as the effective relative curvature radius $P_{eff.}<C$, with $C$ being a constant. We analytically determine the chaos region in the $(k_x,\\,k_z,\\,B_w)$ parameter space, and the results show excellent agreement with the global chaos threshold given by $CR=0.01$.",
    "authors": [
      "Jingyu Peng",
      "Jiansen He"
    ],
    "published": "2025-10-08T15:45:40Z",
    "updated": "2025-10-08T15:45:40Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2503.12702v3",
    "url": "https://arxiv.org/abs/2503.12702v3",
    "pdf_url": "https://arxiv.org/pdf/2503.12702v3.pdf",
    "title": "Unveiling a New $β$-Scaling of the Tearing Instability in Weakly   Collisional Plasmas",
    "abstract": "We investigate the linear tearing instability in weakly collisional plasmas using a non-ideal gyrotropic-MHD framework, uncovering a previously unknown scaling relation for the instability growth rate in high-$\\beta$ environments. Even starting from an isotropic equilibrium, our analysis reveals a $\\beta$-dependence, with the maximum growth rate scaling as $\\sigma_\\mathrm{max} \\tau_a \\propto \\beta^{-1/4}$, challenging the long-held assumption of $\\beta$-independence inherent in classical MHD formulations. This novel scaling emerges due to self-consistent fluctuations in pressure anisotropy, dynamically induced by perturbations in velocity and magnetic fields. Increasing plasma-$\\beta$ always suppresses the instability, whereas a background pressure anisotropy can either enhance or further suppress it, depending on its sign: for $p_{\\parallel,0} < p_{\\perp,0}$ the instability is strengthened, while for $p_{\\parallel,0} > p_{\\perp,0}$ it is weakened. Importantly, this effect is not limited to low-collisionality plasmas at high $\\beta$; it can also manifest in more collisional environments once the strict assumption of pressure isotropy is relaxed. This finding has profound implications for various astrophysical contexts characterized by high $\\beta$ and varying degrees of collisionality, including the solar corona and heliospheric current sheets, planetary magnetospheres, as probed by space missions, and the intracluster medium, where magnetic reconnection critically impacts magnetic field evolution and cosmic ray transport. Our results therefore question the universality of the widely-accepted plasmoid-mediated fast reconnection paradigm and underscore the necessity of incorporating pressure anisotropy effects into reconnection models for accurate representation of astrophysical plasmas.",
    "authors": [
      "Gabriel L. Ferreira-Santos",
      "Grzegorz Kowal",
      "Diego A. Falceta-Gonçalves"
    ],
    "published": "2025-03-16T23:59:32Z",
    "updated": "2025-10-08T15:16:25Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE",
      "astro-ph.SR"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2504.00913v2",
    "url": "https://arxiv.org/abs/2504.00913v2",
    "pdf_url": "https://arxiv.org/pdf/2504.00913v2.pdf",
    "title": "Determining the 3D Dynamics of Solar Flare Magnetic Reconnection",
    "abstract": "Solar flares are major space weather events that result from the explosive conversion of stored magnetic energy into bulk motion, plasma heating, and particle acceleration. While the standard flare model has proven highly successful in explaining key morphological features of flare observations, many aspects of the energy release are not yet understood. In particular, the turbulent three-dimensional structure of the flare current sheet is thought to play an important role in fast reconnection, particle acceleration, and bursty dynamics. Although direct diagnosis of the magnetic field dynamics in the corona remains highly challenging, rich information may be gleaned from flare ribbons, which represent the chromospheric imprints of reconnection in the corona. Intriguingly, recent solar imaging observations have revealed a diversity of fine structure in flare ribbons that hints at corresponding complexity in the reconnection region. We present high-resolution three-dimensional MHD simulations of an eruptive flare and describe our efforts to interpret fine-scale ribbon features in terms of the current sheet dynamics. In our model, the current sheet is characterized by many coherent magnetic structures known as plasmoids. We derive a model analogue for ribbons by generating a time series of field-line length maps (L-maps) and identifying abrupt shortenings as flare reconnection events. We thereby demonstrate that plasmoids imprint transient 'spirals' along the analogue of the ribbon front, with a morphology consistent with observed fine structure. We discuss the implications of these results for interpreting SolO, IRIS, and DKIST observations of explosive flare energy release.",
    "authors": [
      "Joel T. Dahlin",
      "Spiro K. Antiochos",
      "Peter F. Wyper",
      "Jiong Qiu",
      "C. Richard DeVore"
    ],
    "published": "2025-04-01T15:47:39Z",
    "updated": "2025-10-08T15:12:31Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2510.01221v2",
    "url": "https://arxiv.org/abs/2510.01221v2",
    "pdf_url": "https://arxiv.org/pdf/2510.01221v2.pdf",
    "title": "WISPFI Experiment: Prototype Development",
    "abstract": "Axions and axion-like particles (ALPs) are well-motivated dark matter (DM) candidates that couple to photons in external magnetic fields. The parameter space around $m_a \\sim 50~\\mu$eV remains largely unexplored by haloscope experiments. We present the first prototype of WISP Searches on a Fiber Interferometer (WISPFI), a table-top, model-independent scheme based on resonant photon-axion conversion in a hollow-core photonic crystal fiber (HC-PCF) integrated into a Mach-Zehnder interferometer (MZI). Operating near a dark fringe with active phase-locking, combined with amplitude modulation, the interferometer converts axion-induced photon disappearance into a measurable signal. A 2 W, 1550 nm laser is coupled into a 1 m-long HC-PCF placed inside a 2 T permanent magnet array, probing a fixed axion mass of $m_a \\simeq 49~$meV with a projected sensitivity of $g_{a\\gamma\\gamma} \\gtrsim 1.3 \\times 10^{-9}~\\text{GeV}^{-1}$ for a measurement time of 30 days. Future upgrades, including pressure tuning of the effective refractive index and implementation of a Fabry-P\\'erot cavity, could extend the accessible mass range and improve sensitivity, establishing WISPFI as a scalable platform to explore previously inaccessible regions of the axion parameter space.",
    "authors": [
      "Josep Maria Batllori",
      "Michael Frosz",
      "Dieter Horns",
      "Marios Maroudas"
    ],
    "published": "2025-09-22T08:25:04Z",
    "updated": "2025-10-08T14:43:39Z",
    "categories": [
      "hep-ex",
      "astro-ph.CO",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2510.07042v1",
    "url": "https://arxiv.org/abs/2510.07042v1",
    "pdf_url": "https://arxiv.org/pdf/2510.07042v1.pdf",
    "title": "Experimental Results from Early Non-Planar NI-HTS Magnet Prototypes for   the Columbia Stellarator eXperiment (CSX)",
    "abstract": "The Columbia Stellarator eXperiment (CSX) is an upgrade of the Columbia Non-neutral Torus (CNT) that aims to demonstrate a university-scale, quasi-axisymmetric stellarator using high-temperature superconducting (HTS) technology at an on-axis magnetic field target of 0.5 T. Due to the strain sensitivity of ReBCO (Rare-earth Barium Copper Oxides), adapting it to non-planar stellarator geometries requires new winding, structural, and cooling strategies. We report on the results of a staged prototype program (P1, P2, P3) employing 3D-printed, sectional aluminum coil frames with winding channels, gimballed constant-tension winding mechanics, and solder potting for radial current redistribution and passive quench mitigation. The first prototype, P1 (planar elliptical, double-pancake) tested additive manufacture, sectional joining and baseline winding, achieving predicted fields at 77 K. P2 (non-planar, higher strain) was wound to 42 turns, energized at 30-40 K to produce expected magnetic fields, and studied thermal gradients and resistance at up to 4.5 kAt. Design evolution in P3 introduces concave geometry with dual double-pancakes, 200 turns, and approaches the 70 kAt target at 20 K. In parallel, sub-microhm lap joints have been developed. Together, these results de-risk manufacturing, cooling interfaces, quench management, and diagnostics, paving the way for full-size non-planar HTS stellarator coils for CSX.",
    "authors": [
      "D. Schmeling",
      "M. Russo",
      "B. T. Gebreamlak",
      "T. J. Kiker",
      "A. R. Skrypek",
      "A. R. Hightower",
      "J. Xue",
      "S. Chen",
      "S. Sohaib",
      "C. Martinez",
      "K. F. Richardson",
      "L. Filor",
      "S. Komatsu",
      "L. Liu",
      "C. Paz-Soldan"
    ],
    "published": "2025-10-08T14:08:08Z",
    "updated": "2025-10-08T14:08:08Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.supr-con",
      "physics.app-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.05423v3",
    "url": "https://arxiv.org/abs/2507.05423v3",
    "pdf_url": "https://arxiv.org/pdf/2507.05423v3.pdf",
    "title": "The CMS Phase-2 Fast Beam Condition Monitor prototype test with beam",
    "abstract": "The Fast Beam Condition Monitor (FBCM) is a standalone luminometer for the High Luminosity LHC (HL-LHC) program of the CMS Experiment at CERN. The detector is under development and features a new, radiation-hard, front-end application-specific integrated circuit (ASIC) designed for beam monitoring applications. The achieved timing resolution of a few nanoseconds enables the measurement of both the luminosity and the beam-induced background. The ASIC, called FBCM23, features six channels with adjustable shaping times, enabling in-field fine-tuning. Each ASIC channel outputs a single binary asynchronous signal encoding time of arrival and time over threshold information. The FBCM is based on silicon-pad sensors, with two sensor designs presently being considered. This paper presents the results of tests of the FBCM detector prototype using both types of silicon sensors with hadron, muon, and electron beams. Irradiated FBCM23 ASICs and silicon-pad sensors were also tested to simulate the expected conditions near the end of the detector's lifetime in the HL-LHC radiation environment. Based on test results, direct bonding between the sensor and ASIC was chosen, and an optimal bias voltage and ASIC threshold for FBCM operation were proposed. The current design of the front-end test board was validated following the beam test and is now being used for the first front-end module, which is expected to be produced in summer 2025. These results represent a major step forward in validating the FBCM concept, first version of the firmware and establishing a reliable design path for the final detector.",
    "authors": [
      "G. Auzinger",
      "H. Bakhshiansohi",
      "A. E. Dabrowski",
      "A. G. Delannoy",
      "V. Dalavi",
      "N. Dienemann",
      "M. Dragicevic",
      "M. F. Garcia",
      "M. Guthoff",
      "B. Gyöngyösi",
      "M. Jenihhin",
      "Á. Kadlecsik",
      "J. Kaplon",
      "O. Karacheban",
      "B. Korcsmáros",
      "A. Lokhovitskiy",
      "W. H. Liu",
      "R. Loos",
      "S. Mallows",
      "D. Mihhailov",
      "M. Obradovic",
      "S. Orfanelli",
      "M. Pari",
      "G. Pásztor",
      "F. L. Pereira Carneiro",
      "M. Princova",
      "B. Ristic",
      "C. Romero",
      "J. Schwandt",
      "M. Sedghi",
      "A. Shevelev",
      "K. Shibin",
      "S. Spanier",
      "G. Steinbrueck",
      "D. P. Stickland",
      "A. Tsirou",
      "B. Ujvári",
      "M. Velasco",
      "P. G. Verdini",
      "G. J. Wegrzyn",
      "M. Wiehe",
      "D. Wilbern",
      "P. D. Winney"
    ],
    "published": "2025-07-07T19:11:42Z",
    "updated": "2025-10-08T12:59:39Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.00799v2",
    "url": "https://arxiv.org/abs/2507.00799v2",
    "pdf_url": "https://arxiv.org/pdf/2507.00799v2.pdf",
    "title": "Materials Design for the Synthesis of High Strength Radiopure Copper   Alloys for Rare Event Detection",
    "abstract": "Additive-free electroformed copper has emerged as the material of choice in exceptionally radiopure detectors for rare-event searches, based on its radiopurity, physical properties, and affordability. However, copper is ductile and of limited mechanical strength posing challenges for its use in future experiments. Electroformed copper-based alloys have been identified as a promising solution. However, their synthesis needs refining by exploring a complex parameter space of compositions and strengthening mechanisms. Here we show how a materials design approach may address current challenges and optimize alloy synthesis and processing. Alloy properties are predicted following thermal processing, using computational thermodynamics. The findings suggest a methodology to design high-performance, radiopure copper-based alloys suitable for next-generation rare-event experiments, while minimizing lengthy and expensive trial-and-error approaches. The impact on future experiments is exemplified through case-studies of the DarkSPHERE and XLZD experiments.",
    "authors": [
      "Dimitra Spathara",
      "Patrick Knights",
      "Konstantinos Nikolopoulos"
    ],
    "published": "2025-07-01T14:31:38Z",
    "updated": "2025-10-08T10:17:09Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  }
]