{
  "arxiv_id": "2504.00913v2",
  "url": "https://arxiv.org/abs/2504.00913v2",
  "pdf_url": "https://arxiv.org/pdf/2504.00913v2.pdf",
  "title": "Determining the 3D Dynamics of Solar Flare Magnetic Reconnection",
  "abstract": "Solar flares are major space weather events that result from the explosive conversion of stored magnetic energy into bulk motion, plasma heating, and particle acceleration. While the standard flare model has proven highly successful in explaining key morphological features of flare observations, many aspects of the energy release are not yet understood. In particular, the turbulent three-dimensional structure of the flare current sheet is thought to play an important role in fast reconnection, particle acceleration, and bursty dynamics. Although direct diagnosis of the magnetic field dynamics in the corona remains highly challenging, rich information may be gleaned from flare ribbons, which represent the chromospheric imprints of reconnection in the corona. Intriguingly, recent solar imaging observations have revealed a diversity of fine structure in flare ribbons that hints at corresponding complexity in the reconnection region. We present high-resolution three-dimensional MHD simulations of an eruptive flare and describe our efforts to interpret fine-scale ribbon features in terms of the current sheet dynamics. In our model, the current sheet is characterized by many coherent magnetic structures known as plasmoids. We derive a model analogue for ribbons by generating a time series of field-line length maps (L-maps) and identifying abrupt shortenings as flare reconnection events. We thereby demonstrate that plasmoids imprint transient 'spirals' along the analogue of the ribbon front, with a morphology consistent with observed fine structure. We discuss the implications of these results for interpreting SolO, IRIS, and DKIST observations of explosive flare energy release.",
  "authors": [
    "Joel T. Dahlin",
    "Spiro K. Antiochos",
    "Peter F. Wyper",
    "Jiong Qiu",
    "C. Richard DeVore"
  ],
  "published": "2025-04-01T15:47:39Z",
  "updated": "2025-10-08T15:12:31Z",
  "categories": [
    "astro-ph.SR",
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.SR"
}