{
  "arxiv_id": "2507.20523v3",
  "url": "https://arxiv.org/abs/2507.20523v3",
  "pdf_url": "https://arxiv.org/pdf/2507.20523v3.pdf",
  "title": "Multi-Machine Scaling Laws for Fuel and Impurity Puffing Rates   Sufficient for Detachment Access: a Systematic Review of Magnetic Confinement   Fusion Devices",
  "abstract": "An open-source database encompassing 457 experimental and numerical entries from 32 machines among solid-walled tokamaks, stellarators and linear plasma devices is assembled. From there, we derive physics-informed multi-machine scaling laws predictive of fuel and impurity puffing rates sufficient to access plasma detachment -- leading candidate for a reactor-relevant solution to the open issue of plasma-wall interaction. Validation of our laws in up to 40 plasmas in low- and high-confinement mode also featuring advanced configurations demonstrates accuracy within a factor 1.5 in up to 50% of the instances, and within a factor 2 on average. Divertor volume alone is found to correlate to fuelling. The addition of plasma opaqueness leads to the empirically-calibrated law $\\Gamma_{\\text{D}}\\propto [n_{\\text{sep}}\\times a\\times(S_{\\text{div}}/V_{\\text{div}})^{-1.5}]^{1.05}$ valid across all toroidal devices. Its simplification to $\\Gamma_{\\text{D}}^{\\text{HDL}}\\propto 0.43\\times a^{1.58}\\times\\lambda_q^{-0.89}$ avoids a dependence on $n_{\\text{sep}}$ and bears intrinsic significance provided by the H/L density limit and the power fall-off length. Non-linearities of the impurity dynamics manifest in the seeding rate -- which the present work identifies both a generalised formula for, and the Greenwald-Eich-Scarabosio simplification $\\Gamma_{\\text{Z}}^{\\text{GES}}\\propto a^{1.51}\\times\\lambda_q^{-0.27}$. Similar relationships are defined for stellarators, closely following the mainstream but without providing data for validation -- which should stimulate further investigations. In the era of nuclear fusion reactor design, these results find immediate applicability in informing reactor fuel cycle design and edge plasma modelling. More generally, this study demonstrates that physics-based 0D laws able to relate detachment to the engineering actuators exist.",
  "authors": [
    "M. Moscheni",
    "A. Herrmann",
    "R. Kembleton",
    "M. Kryjak",
    "S. Lazerson",
    "F. Levi",
    "M. Siccinio",
    "P. Staniec",
    "T. Giegerich",
    "C. Tantos",
    "the Gauss Fusion GmbH Team"
  ],
  "published": "2025-07-28T05:11:10Z",
  "updated": "2025-10-09T09:40:59Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}