{
  "arxiv_id": "2509.00164v5",
  "url": "https://arxiv.org/abs/2509.00164v5",
  "pdf_url": "https://arxiv.org/pdf/2509.00164v5.pdf",
  "title": "The potential applications of muography to revealing sea shipwrecks",
  "abstract": "Muon imaging, a non-invasive technique that utilizes naturally occurring cosmic muons, has emerged as a promising tool for exploring underwater objects, including shipwrecks. This study investigates the potential of muon radiography to examine the contents of wrecked ships in the Baltic Sea and other marine environments. These wrecks often pose significant environmental risks due to hazardous contents such as explosives and crude oil, making their detection and monitoring critical for environmental and safety considerations. Accurate modeling and imaging of such wrecks are therefore essential for assessing potential dangers and mitigating environmental impacts.   To model the underwater muon flux in this study, an approach similar to that used in underground muon experiments was adopted. Cosmic muons were propagated through seawater using GEANT4, modeling their energy loss as they traverse water. The muons' kinematics and energy depositions were recorded during this process. The resulting distributions were tabulated and used as input for the primary particle generation module. This method enabled the generation of a realistic underwater muon flux at the desired depth above the shipwreck, allowing us to simulate various shipwreck filling scenarios.   Assuming an exposure time of one week for a wreck located at 50 meters depth, our simulations demonstrate that muon imaging can sufficiently resolve density contrasts to distinguish between water, oil, and high-density materials. These results demonstrate the feasibility of muon radiography as a practical tool for underwater hazard assessment and shipwreck investigation.",
  "authors": [
    "Anzori Sh. Georgadze"
  ],
  "published": "2025-08-29T18:05:45Z",
  "updated": "2025-10-08T06:52:23Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}