{
  "arxiv_id": "2510.06491v1",
  "url": "https://arxiv.org/abs/2510.06491v1",
  "pdf_url": "https://arxiv.org/pdf/2510.06491v1.pdf",
  "title": "CCAT: Readout of over 10,000 280 GHz KIDs in Mod-Cam using RFSoC   Electronics",
  "abstract": "Over the past decade, kinetic inductance detectors (KIDs) have emerged as a viable superconducting technology for astrophysics at millimeter and submillimeter wavelengths. KIDs spanning 210 - 850 GHz across seven instrument modules will be deployed in the Prime-Cam instrument of CCAT Observatory's Fred Young Submillimeter Telescope at an elevation of 5600 m on Cerro Chajnantor in Chile's Atacama Desert. The natural frequency-division multiplexed readout of KIDs allows hundreds of detectors to be coupled to a single radio frequency (RF) transmission line, but requires sophisticated warm readout electronics. The FPGA-based Xilinx ZCU111 radio frequency system on chip (RFSoC) offers a promising and flexible solution to the challenge of warm readout. CCAT uses custom packaged RFSoCs to read out KIDs in the Prime-Cam instrument. Each RFSoC can simultaneously read out four RF channels with up to 1,000 detectors spanning a 512 MHz bandwidth per channel using the current firmware. We use five RFSoCs to read out the >10,000 KIDs in the broadband 280 GHz instrument module inside a testbed receiver. Here, we describe and demonstrate the readout software and pipeline for the RFSoC system. We also present the preliminary averaged spectral responses of the 280 GHz instrument module using KIDs from the TiN array and the first Al array as a demonstration of the end-to-end performance of the readout and optical systems. These measurements demonstrate the foundation that will enable us to simultaneously read out over 10,000 KIDs with the RFSoC and represent a critical step toward reading out the ~100,000 KIDs in Prime-Cam in its future full capacity configuration.",
  "authors": [
    "Darshan A. Patel",
    "Yuhan Wang",
    "Cody J. Duell",
    "Jason E. Austermann",
    "James Beall",
    "James R. Burgoyne",
    "Scott Chapman",
    "Steve K. Choi",
    "Rodrigo G. Freundt",
    "Eliza Gazda",
    "Christopher Groppi",
    "Zachary B. Huber",
    "Johannes Hubmayr",
    "Ben Keller",
    "Lawerence T. Lin",
    "Philip Mauskopf",
    "Alicia Middleton",
    "Michael D. Niemack",
    "Cody Roberson",
    "Adrian K. Sinclair",
    "Ema Smith",
    "Jeff van Lanen",
    "Anna Vaskuri",
    "Benjamin J. Vaughan",
    "Eve M. Vavagiakis",
    "Michael Vissers",
    "Samantha Walker",
    "Jordan Wheeler",
    "Ruixuan",
    "Xie"
  ],
  "published": "2025-10-07T22:08:29Z",
  "updated": "2025-10-07T22:08:29Z",
  "categories": [
    "astro-ph.IM",
    "physics.ins-det"
  ],
  "primary_category": "astro-ph.IM"
}