{
  "arxiv_id": "2510.07792v1",
  "url": "https://arxiv.org/abs/2510.07792v1",
  "pdf_url": "https://arxiv.org/pdf/2510.07792v1.pdf",
  "title": "Aluminum-Based Superconducting Tunnel Junction Sensors for Nuclear   Recoil Spectroscopy",
  "abstract": "The BeEST experiment is searching for sub-MeV sterile neutrinos by measuring nuclear recoil energies from the decay of $^7$Be implanted into superconducting tunnel junction (STJ) sensors. The recoil spectra are affected by interactions between the radioactive implants and the sensor materials. We are therefore developing aluminum-based STJs (Al-STJs) as an alternative to existing tantalum devices (Ta-STJs) to investigate how to separate material effects in the recoil spectrum from potential signatures of physics beyond the Standard Model. Three iterations of Al-STJs were fabricated. The first had electrode thicknesses similar to existing Ta-STJs. They had low responsivity and reduced resolution, but were used successfully to measure $^7$Be nuclear recoil spectra. The second iteration had STJs suspended on thin SiN membranes by backside etching. These devices had low leakage current, but also low yield. The final iteration was not backside etched, and the Al-STJs had thinner electrodes and thinner tunnel barriers to increase signal amplitudes. These devices achieved 2.96 eV FWHM energy resolution at 50 eV using a pulsed 355 nm (~3.5 eV) laser. These results establish Al-STJs as viable detectors for systematic material studies in the BeEST experiment.",
  "authors": [
    "Spencer L. Fretwell",
    "Connor Bray",
    "Inwook Kim",
    "Andrew Marino",
    "Benjamin Waters",
    "Robin Cantor",
    "Ad Hall",
    "Pedro Amaro",
    "Adrien Andoche",
    "David Diercks",
    "Abigail Gillespie",
    "Mauro Guerra",
    "Cameron N. Harris",
    "Jackson T. Harris",
    "Leendert M. Hayen",
    "Paul Antoine Hervieux",
    "Geon Bo Kim",
    "Annika Lennarz",
    "Vincenzo Lordi",
    "Jorge Machado",
    "Peter Machule",
    "David McKeen",
    "Xavier Mougeot",
    "Francisco Ponce",
    "Chris Ruiz",
    "Amit Samanta",
    "José Paulo Santos",
    "Joseph Smolsky",
    "Caitlyn Stone-Whitehead",
    "Joseph Templet",
    "William K. Warburton",
    "K. G. Leach",
    "S. Friedrich"
  ],
  "published": "2025-10-09T05:11:47Z",
  "updated": "2025-10-09T05:11:47Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}