{
  "arxiv_id": "2510.06771v1",
  "url": "https://arxiv.org/abs/2510.06771v1",
  "pdf_url": "https://arxiv.org/pdf/2510.06771v1.pdf",
  "title": "Low-noise Fourier Transform Spectroscopy Enabled by Superconducting   On-Chip Filterbank Spectrometers",
  "abstract": "Historically employed spectroscopic architectures used for large field of view mapping spectroscopy in millimetere and sub-millimetre astronomy suffer from significant drawbacks. On-chip filterbank spectrometers are a promising technology in this respect; however, they must overcome an orders-of-magnitude increase in detector counts, efficiency loss due to dielectric properties, and stringent fabrication tolerances that currently limit scaling to resolutions of order 1000 over a large array. We propose coupling a medium-resolution Fourier transform spectrometer to a low-resolution filterbank spectrometer focal plane, which serves as a post-dispersion element. In this arrangement, medium resolution imaging spectroscopy is provided by the Fourier transform spectrometer, while the low resolution filterbank spectrometer serves to decrease the photon noise inherent in typical broadband Fourier transform spectrometer measurements by over an order of magnitude. This is achieved while maintaining the excellent imaging advantages of both architectures. We present predicted mapping speeds for a filterbank-dispersed Fourier transform spectrometer from a ground-based site and a balloon-borne platform. We also demonstrate the potential that an instrument of this type has for an R~1000 line intensity mapping experiment using the James Clerk Maxwell Telescope as an example platform. We demonstrate that a filterbank-dispersed Fourier transform spectrometer would be capable of R~1000 measurements of CO power spectra with a signal-to-noise ratio of 10--100 with surveys of $10^5$--$10^6$ spectrometer hours.",
  "authors": [
    "Chris S. Benson",
    "Peter S. Barry",
    "Patrick Ashworth",
    "Harry Gordon-Moys",
    "Kirit S. Karkare",
    "Izaak Morris",
    "Gethin Robson"
  ],
  "published": "2025-10-08T08:55:05Z",
  "updated": "2025-10-08T08:55:05Z",
  "categories": [
    "astro-ph.IM",
    "astro-ph.GA",
    "physics.ins-det"
  ],
  "primary_category": "astro-ph.IM"
}