{
  "arxiv_id": "2505.18263v3",
  "url": "https://arxiv.org/abs/2505.18263v3",
  "pdf_url": "https://arxiv.org/pdf/2505.18263v3.pdf",
  "title": "Evidence of Memory Effects in the Dynamics of Two-Level System Defect Ensembles Using Broadband, Cryogenic Transient Dielectric Spectroscopy",
  "abstract": "Two-level system (TLS) defects in dielectrics cause decoherence in superconducting circuits, yet their origin, frequency distribution, and dipole moments remain poorly understood. Current probes, primarily based on qubits or resonators, require complex fabrication and measure defects only within narrow frequency bands and limited mode volumes, restricting insight into TLS behavior in isolated materials and interfaces. We introduce Broadband Cryogenic Transient Dielectric Spectroscopy (BCTDS), a broadband 3D waveguide technique that enables probing of TLS ensembles at cryogenic temperatures. Complementary to the dielectric dipper method, this approach probes a broader spectrum and reveals interference of drive-induced sidebands in TLS ensembles. The broadband, power-tunable nature of BCTDS makes it well suited for studying dressed-state physics in driven TLS ensembles, including multi-photon processes and sideband-resolved dynamics. By analyzing Fourier-transformed time-domain signals, BCTDS reveals eigen-mode frequencies of undriven TLS ensembles through characteristic V-shaped features and uncovers memory effects arising from interactions and broadband excitation. The modular method can be applied throughout device fabrication, informing mitigation strategies and advancing the design of low-loss materials with broad implications for quantum technologies and materials science.",
  "authors": [
    "Qianxu Wang",
    "Sara Magdalena Gómez",
    "Juan S. Salcedo-Gallo",
    "Roy Leibovitz",
    "Jake Freeman",
    "Simon A. Agnew",
    "Salil Bedkihal",
    "William J. Scheideler",
    "Mattias Fitzpatrick"
  ],
  "published": "2025-05-23T18:01:07Z",
  "updated": "2025-11-18T20:10:40Z",
  "categories": [
    "quant-ph",
    "cond-mat.mes-hall",
    "cond-mat.mtrl-sci",
    "physics.ins-det"
  ],
  "primary_category": "quant-ph"
}