{
  "arxiv_id": "2511.17141v1",
  "url": "https://arxiv.org/abs/2511.17141v1",
  "pdf_url": "https://arxiv.org/pdf/2511.17141v1.pdf",
  "title": "Distributed Acoustic Fiber Sensing for Research Campuses and Large Scientific Infrastructures -- The Hamburg WAVE proto-network",
  "abstract": "Here, we demonstrate and investigate how Distributed Acoustic Sensing (DAS) can be utilized on research campuses and in large scientific infrastructures to study environmental vibrations and reduce their impact on high-precision experiments. We first discuss the potential of DAS in the context of particle accelerators, gravitational wave detection experiments and research campuses. Next, we present the results of our seismic measurement campaign conducted with our proto-network, which involved the probing of over 12 km of fiber, in May 2021. This campaign was conducted by the Hamburg WAVE initiative in Science City Hamburg Bahrenfeld and included DESY, the European XFEL, PETRA III and the University of Hamburg. Our proto-network confirms the ability to observe natural, anthropogenic, and infrastructural vibrations and how and where these couple into different parts of the heterogeneously set up fiber network. We also present results on a study of noise and motion coupling aspects of DAS probing double-redundant fiber loops in a unique environment, the European XFEL. Our results show that DAS greatly benefits research campuses and large scientific infrastructures and they highlight the opportunities and challenges of implementing and operating such seismic networks.",
  "authors": [
    "Oliver Bölt",
    "Luigia Cristiano",
    "Sandy Croatto",
    "Dirk Gajewski",
    "Erik Genthe",
    "Oliver Gerberding",
    "Céline Hadziioannou",
    "Conny Hammer",
    "Markus Hoffmann",
    "Katharina-Sophie Isleif",
    "Antonia Kiel",
    "Charlotte M. Krawczyk",
    "Regina Maass",
    "Ingra Barbosa",
    "Norbert Meyners",
    "Reinhardt Rading",
    "Holger Schlarb",
    "Roman Schnabel",
    "Wanda Vossius",
    "Christopher Wollin"
  ],
  "published": "2025-11-21T11:04:48Z",
  "updated": "2025-11-21T11:04:48Z",
  "categories": [
    "physics.ins-det",
    "astro-ph.IM",
    "physics.acc-ph",
    "physics.geo-ph"
  ],
  "primary_category": "physics.ins-det"
}