{
  "arxiv_id": "2511.15641v1",
  "url": "https://arxiv.org/abs/2511.15641v1",
  "pdf_url": "https://arxiv.org/pdf/2511.15641v1.pdf",
  "title": "Characterisation of X- and O-points in Wendelstein 7-X with respect to coil currents",
  "abstract": "This work analyses vacuum magnetic field topology in Wendelstein 7-X (W7-X) with respect to changes in the current in the superconducting coils. We develop a fast automated scheme to locate fixed points (such as X- and O-points) and calculate the trace of the Jacobian of the field line map for them (Tr(M)), which represents several important properties of the fixed point. We perform two sets of coil current scans: (1) scans where each coil current is varied individually, using the \"standard\", \"high iota\" and \"low iota\" configurations as starting points; (2) a scan of over 200,000 magnetic configurations in which the coil currents are randomly sampled. In both cases we constrain the coil currents to the normal range of W7-X. We verify the principal roles of the non-planar, planar and control coils: the non-planar coils establish island chains with a certain phase; the planar coils modify the location of the island chain by both controlling the iota profile and shifting the configuration \"inward\" and \"outward\"; the control coil affects the island size and phase. We also find that |Tr(M)-2| (a quantity closely related to the magnitude of the Greene's residue) tends to increase with the minor radius of the fixed points, and that Tr(M) for X- and O-points can be very differently affected by the control coil current. Finally, we show that |Tr(M)-2| serves as a proxy for island size for internal island chains, which may help identification of suitable experimental candidates.",
  "authors": [
    "Robert Davies",
    "Christopher B. Smiet",
    "Charlotte Batzdorf",
    "J. Geiger",
    "J. Loizu",
    "S. A. Henneberg"
  ],
  "published": "2025-11-19T17:23:05Z",
  "updated": "2025-11-19T17:23:05Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}