{
  "arxiv_id": "2511.15209v1",
  "url": "https://arxiv.org/abs/2511.15209v1",
  "pdf_url": "https://arxiv.org/pdf/2511.15209v1.pdf",
  "title": "Magnetic signal scan imaging system based on giant magnetoimpedance (GMI) differential sensor",
  "abstract": "This paper presents the design and implementation of a magnetic signal scanning and imaging system based on the giant magnetoimpedance (GMI) effect. The system employs a pair of performance-matched GMI sensing elements configured as a differential probe structure. Through co-optimized low-noise electronic and probe design, the system effectively suppresses both intrinsic sensor common-mode drift and external environmental magnetic noise, enabling high signal-to-noise ratio detection of nono-tesla to micro-tesla-level magnetic signals without magnetic shielding. Experimental results demonstrate that the differential system achieves significantly lower noise spectral density in unshielded environments compared to conventional GMI sensors (\\SI{46}{pT}/$\\sqrt{\\text{Hz}}$ versus \\SI{286}{pT}/$\\sqrt{\\text{Hz}}$ at \\SI{1}{Hz}), with a sensitivity of 186,790 V/T and spatial resolution better than 200 micrometers. The system's excellent performance in weak magnetic field detection and spatial resolution was verified through scanning experiments of magnetic ink on US banknotes and magnetic reference samples. Compared to SQUID scanning systems, which requiring liquid helium cooling, this system based on the GMI effect offers advantages of room-temperature operation, compact structure, and low cost. Relative to conventional single-element GMI microscopes, it achieves significant improvements in signal-to-noise ratio and environmental adaptability. This research provides a practical solution for high-resolution magnetic field imaging at room temperature with broad application potential in materials magnetism, biomagnetic imaging, and nanomagnetic detection.",
  "authors": [
    "Tao Yang",
    "Zhoulu Yu",
    "Xuekui Xi",
    "Changjun Jiang",
    "Guozhi Chai"
  ],
  "published": "2025-11-19T08:00:05Z",
  "updated": "2025-11-19T08:00:05Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}