[
  {
    "arxiv_id": "2511.17324v1",
    "url": "https://arxiv.org/abs/2511.17324v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17324v1.pdf",
    "title": "First operation of poly(ethylene naphthalate) enclosures for high-purity germanium detectors in liquid argon for $^{42}$K/$^{42}$Ar mitigation",
    "abstract": "Commercial argon contains cosmogenic $^{42}$Ar whose progeny $^{42}$K is a critical background component for the Large Enriched Germanium Experiment for Neutrinoless $ββ$ Decay (LEGEND). LEGEND operates High-Purity Germanium (HPGe) detectors bare in liquid argon. $^{42}$K is attracted by the HPGe detectors' electric fields, and drifts toward the germanium surface, where it undergoes beta decay. LEGEND-1000 will mitigate $^{42}$K-induced background by using underground-sourced argon, depleted in cosmogenic isotopes. If underground argon is not available, mitigation techniques must be employed. Poly(ethylene naphthalate) (PEN) enclosures were proposed to hinder the ion drift, decrease the beta-particle's energy, and produce scintillation light. In this paper, we report on operating two HPGe detectors, both bare and PEN-enclosed, in $^{42}$Ar-enriched liquid argon, and find no evidence for deterioration of energy stability or resolution due to the enclosures. We monitor the beta and gamma rates of $^{42}$K, find complex time-dependencies extending to roughly 30 days after applying the HPGe detectors' high-voltage, and qualitatively demonstrate the $^{42}$K suppression capabilities of enclosures.",
    "authors": [
      "Christoph Vogl",
      "Tommaso Comellato",
      "Konstantin Gusev",
      "Brennan Hackett",
      "Patrick Krause",
      "Andreas Leonhardt",
      "Bela Majorovits",
      "Niko N. P. N. Lay",
      "Moritz Neuberger",
      "Nadezda Rumyantseva",
      "Mario Schwarz",
      "Michael Willers",
      "Stefan Schönert"
    ],
    "published": "2025-11-21T15:43:52Z",
    "updated": "2025-11-21T15:43:52Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.11255v3",
    "url": "https://arxiv.org/abs/2509.11255v3",
    "pdf_url": "https://arxiv.org/pdf/2509.11255v3.pdf",
    "title": "A Geometrically Consistent Matching Framework for Side-Scan Sonar Mapping",
    "abstract": "Robust matching of side-scan sonar imagery remains a fundamental challenge in seafloor mapping due to view-dependent backscatter, shadows, and geometric distortion. This paper proposes a novel matching framework that combines physical decoupling and geometric consistency to enhance correspondence accuracy and consistency across viewpoints. A multi-branch network, derived from the Lambertian reflection model, decomposes raw sonar images into seabed reflectivity, terrain elevation, and acoustic path loss. The reflectivity map, serving as a stable matching domain, is used in conjunction with a training-free matching pipeline combining SuperPoint and MINIMA-LightGlue. Geometry-aware outlier rejection leverages both terrain elevation and its physically derived shadow map to further remove mismatches in acoustically occluded and topographically inconsistent regions, thereby improving registration accuracy. Quantitative and visual evaluations against traditional, CNN-, and Transformer-based state-of-the-art methods demonstrate that our method achieves lower matching error, higher geometric consistency, and greater robustness to viewpoint variations. The proposed approach provides a data-efficient, physically interpretable solution for high-precision side-scan sonar image matching in complex seafloor environments.",
    "authors": [
      "Can Lei",
      "Hayat Rajani",
      "Nuno Gracias",
      "Rafael Garcia",
      "Huigang Wang"
    ],
    "published": "2025-09-14T12:54:42Z",
    "updated": "2025-11-21T15:36:51Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.17314v1",
    "url": "https://arxiv.org/abs/2511.17314v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17314v1.pdf",
    "title": "Characterisation and mitigation of RF knockout during beam stacking",
    "abstract": "Beam stacking allows a Fixed Field alternating gradient Accelerator (FFA) to increase the extracted beam current whilst also allowing for a flexible time structure making FFAs a promising candidate for future spallation neutron sources and high beam intensity applications. For successful beam stacking, beam loss caused by RF knockout must be avoided. RF knockout can occur during beam stacking because of the finite dispersion function at the RF cavity location, which is unavoidable in a scaling FFA. In this work, the RF knockout resonance is characterised and through a series of experiments at the ISIS Neutron and Muon Source, we show that it is possible to suppress the loss from RF knockout.",
    "authors": [
      "Carl Jolly",
      "David Kelliher",
      "Jean-Baptiste Lagrange",
      "Alan Letchford",
      "Shinji Machida",
      "David Posthuma de Boer",
      "Chris Rogers",
      "Andrew Seville"
    ],
    "published": "2025-11-21T15:32:10Z",
    "updated": "2025-11-21T15:32:10Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.17287v1",
    "url": "https://arxiv.org/abs/2511.17287v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17287v1.pdf",
    "title": "The impact of ionising collisions on channeling and radiation emission for high-energy electrons and positrons",
    "abstract": "This paper presents a quantitative analysis of the impact of inelastic collisions with atoms in a crystalline environment on the channeling efficiency and intensity of the channeling radiation for high-energy electrons and positrons passing through oriented crystalline targets. This analysis is based on numerical simulations of the channeling process, which were performed using the MBN Explorer software package. Ionising collisions are considered random, fast and local events, and are incorporated into the classical relativistic molecular dynamics framework according to the previously described algorithm. The case studies presented refer to 10 GeV electrons and positrons incident on single crystals of diamond and silicon, oriented along the (110) and (111) planes, with thicknesses of up to 1 mm for electrons and 6 mm for positrons. To elucidate the role of ionising collisions, simulations were performed with and without accounting for them. It is shown that, for electrons, both approaches lead to similar results with regard to both the channelling efficiency and the radiation intensity. In practical terms, this means that numerical simulations can be carried out without accounting for ionising collisions, which are much faster yet produce similar results. For positrons, the ionising collisions reduce significantly the channeling efficiency. However, their impact on the radiation intensity strongly depends on the opening angle of the cone within which the radiation emission is collected. A quantitative analysis of this feature is presented in the paper.",
    "authors": [
      "Andrei V. Korol",
      "Andrey V. Solov'yov"
    ],
    "published": "2025-11-21T14:52:56Z",
    "updated": "2025-11-21T14:52:56Z",
    "categories": [
      "physics.acc-ph",
      "physics.atom-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.11463v2",
    "url": "https://arxiv.org/abs/2510.11463v2",
    "pdf_url": "https://arxiv.org/pdf/2510.11463v2.pdf",
    "title": "Characterisation of the first wafer-scale prototype for the ALICE ITS3 upgrade: the monolithic stitched sensor (MOSS)",
    "abstract": "This paper presents the characterisation and testing of the first wafer-scale monolithic stitched sensor (MOSS) prototype developed for the ALICE ITS3 upgrade that is to be installed during the LHC Long Shutdown 3 (2026-2030). The MOSS chip design is driven by the truly cylindrical detector geometry that imposes that each layer is built out of two wafer-sized, bent silicon chips. The stitching technique is employed to fabricate sensors with dimensions of 1.4 $\\times$ 25.9 cm, thinned to 50 $μ$m. The chip architecture, in-pixel front-end, laboratory and in-beam characterisation, susceptibility to single-event effects, and series testing are discussed. The testing campaign validates the design of a wafer-scale stitched sensor and the performance of the pixel matrix to be within the ITS3 requirements. The MOSS chip demonstrates the feasibility of the ITS3 detector concept and provides insights for further optimisation and development.",
    "authors": [
      "Omar Abdelrahman",
      "Gianluca Aglieri Rinella",
      "Luca Aglietta",
      "Giacomo Alocco",
      "Matias Antonelli",
      "Roberto Baccomi",
      "Francesco Barile",
      "Pascal Becht",
      "Franco Benotto",
      "Stefania Maria Beolè",
      "Marcello Borri",
      "Daniela Bortoletto",
      "Naseem Bouchhar",
      "Giuseppe Eugenio Bruno",
      "Matthew Daniel Buckland",
      "Szymon Bugiel",
      "Paolo Camerini",
      "Francesca Carnesecchi",
      "Marielle Chartier",
      "Domenico Colella",
      "Angelo Colelli",
      "Giacomo Contin",
      "Giuseppe De Robertis",
      "Wenjing Deng",
      "Antonello Di Mauro",
      "Vittorio Di Trapani",
      "Maurice Donner",
      "Ana Dorda Martin",
      "Piotr Dorosz",
      "Floarea Dumitrache",
      "Lars Döpper",
      "Gregor Hieronymus Eberwein",
      "Domenico Elia",
      "Simone Emiliani",
      "Laura Fabbietti",
      "Tommaso Fagotto",
      "Xiaochao Fang",
      "Henrik Fribert",
      "Roman Gernhäuser",
      "Piero Giubilato",
      "Laura Gonella",
      "Karl Gran Grodaas",
      "Ola Slettevoll Groettvik",
      "Vladimir Gromov",
      "Malte Grönbeck",
      "Philip Hauer",
      "Hartmut Hillemanns",
      "Guen Hee Hong",
      "Yu Hu",
      "Minyoung Chris Hwang",
      "Marc Alain Imhoff",
      "Barbara Jacak",
      "Daniel Matthew Jones",
      "Antoine Junique",
      "Filip Křížek",
      "Jetnipit Kaewjai",
      "Anouk Kaiser",
      "Jesper Karlsson Gumprecht",
      "Markus Keil",
      "Bernhard Ketzer",
      "Jiyoung Kim",
      "Lena Kirchner",
      "Kritsada Kittimanapun",
      "Alex Kluge",
      "Chinorat Kobdaj",
      "Artem Kotliarov",
      "Thanushan Kugathasan",
      "Marc König",
      "Paola La Rocca",
      "Natthawut Laojamnongwong",
      "Lukas Lautner",
      "Corentin Lemoine",
      "Long Li",
      "Beatrice Eva Liang-Gilman",
      "Francesco Licciulli",
      "Sanghoon Lim",
      "Bong-Hwi Lim",
      "Jian Liu",
      "Flavio Loddo",
      "Matteo Lupi",
      "Magnus Mager",
      "Philipp Mann",
      "Georgios Mantzaridis",
      "Davide Marras",
      "Paolo Martinengo",
      "Silvia Masciocchi",
      "Annalisa Mastroserio",
      "Soniya Mathew",
      "Serena Mattiazzo",
      "Marius Wilm Menzel",
      "Nicola Minafra",
      "Frederic Morel",
      "Alice Mulliri",
      "Anjali Ila Nambrath",
      "Rajendra Nath Patra",
      "Iaroslav Panasenko",
      "Styliani Paniskaki",
      "Caterina Pantouvakis",
      "Cosimo Pastore",
      "Stefania Perciballi",
      "Francesco Piro",
      "Adithya Pulli",
      "Alexander Rachev",
      "Alexander Rachevski",
      "Ivan Ravasenga",
      "Felix Reidt",
      "Michele Rignanese",
      "Giacomo Ripamonti",
      "Isabella Sanna",
      "Valerio Sarritzu",
      "Umberto Savino",
      "Iain Sedgwick",
      "Serhiy Senyukov",
      "Danush Shekar",
      "Sabyasachi Siddhanta",
      "David Silvermyr",
      "Walter Snoeys",
      "Joey Staa",
      "Alessandro Sturniolo",
      "Miljenko Šuljić",
      "Timea Szollosova",
      "Daniel Tapia Takaki",
      "Livia Terlizzi",
      "Nicolas Tiltmann",
      "Antonio Trifirò",
      "Christina Tsolanta",
      "Rosario Turrisi",
      "Berkin Ulukutlu",
      "Gianluca Usai",
      "Isabelle Valin",
      "Giovanni Vecil",
      "Pedro Vicente Leitao",
      "Anna Villani",
      "Chunzheng Wang",
      "Zhenyu Ye",
      "Emma Rose Yeats",
      "Asli Yelkenci",
      "Zijun Zhao",
      "Alessandra Zingaretti"
    ],
    "published": "2025-10-13T14:35:53Z",
    "updated": "2025-11-21T14:42:05Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.17261v1",
    "url": "https://arxiv.org/abs/2511.17261v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17261v1.pdf",
    "title": "Performance of the front-end electronics of the CMS electromagnetic calorimeter barrel for the High-Luminosity LHC",
    "abstract": "The performance of the CMS electromagnetic calorimeter upgraded readout electronics, developed for the High-Luminosity phase of the LHC, is discussed. Data collected in two beam test campaigns conducted in 2018 and 2021 at the H4 and H2 beam lines of the CERN SPS are analyzed. Time and energy resolutions are measured on a $5\\times 5$ matrix of lead tungstate crystals equipped with prototypes of the new front end readout electronics, using electron and pion beams of energies spanning from 25 to 250 GeV. In both campaigns the constant term of the energy resolution is measured to be better than 0.6% and the time resolution for electrons with energies above 50 GeV is measured to be better than 30 ps, fulfilling the design requirements.",
    "authors": [
      "The CMS Electromagnetic Calorimeter Group"
    ],
    "published": "2025-11-21T14:06:54Z",
    "updated": "2025-11-21T14:06:54Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.17222v1",
    "url": "https://arxiv.org/abs/2511.17222v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17222v1.pdf",
    "title": "A Short Introduction to Metal Forming",
    "abstract": "The present paper is a short introduction to metal forming. The paper highlights the different disciplines that should be considered when analyzing metal forming. Hence, mechanical flow, heat flow, mechanical and thermal contact, and microstructure evolution are presented within the perspective of metal forming. For every aspect, well-established knowledge is presented in addition to scientific open questions on which active research is still done.",
    "authors": [
      "Charbel Moussa",
      "Pierre Montmitonnet"
    ],
    "published": "2025-11-21T13:09:00Z",
    "updated": "2025-11-21T13:09:00Z",
    "categories": [
      "physics.acc-ph",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.17141v1",
    "url": "https://arxiv.org/abs/2511.17141v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17141v1.pdf",
    "title": "Distributed Acoustic Fiber Sensing for Research Campuses and Large Scientific Infrastructures -- The Hamburg WAVE proto-network",
    "abstract": "Here, we demonstrate and investigate how Distributed Acoustic Sensing (DAS) can be utilized on research campuses and in large scientific infrastructures to study environmental vibrations and reduce their impact on high-precision experiments. We first discuss the potential of DAS in the context of particle accelerators, gravitational wave detection experiments and research campuses. Next, we present the results of our seismic measurement campaign conducted with our proto-network, which involved the probing of over 12 km of fiber, in May 2021. This campaign was conducted by the Hamburg WAVE initiative in Science City Hamburg Bahrenfeld and included DESY, the European XFEL, PETRA III and the University of Hamburg. Our proto-network confirms the ability to observe natural, anthropogenic, and infrastructural vibrations and how and where these couple into different parts of the heterogeneously set up fiber network. We also present results on a study of noise and motion coupling aspects of DAS probing double-redundant fiber loops in a unique environment, the European XFEL. Our results show that DAS greatly benefits research campuses and large scientific infrastructures and they highlight the opportunities and challenges of implementing and operating such seismic networks.",
    "authors": [
      "Oliver Bölt",
      "Luigia Cristiano",
      "Sandy Croatto",
      "Dirk Gajewski",
      "Erik Genthe",
      "Oliver Gerberding",
      "Céline Hadziioannou",
      "Conny Hammer",
      "Markus Hoffmann",
      "Katharina-Sophie Isleif",
      "Antonia Kiel",
      "Charlotte M. Krawczyk",
      "Regina Maass",
      "Ingra Barbosa",
      "Norbert Meyners",
      "Reinhardt Rading",
      "Holger Schlarb",
      "Roman Schnabel",
      "Wanda Vossius",
      "Christopher Wollin"
    ],
    "published": "2025-11-21T11:04:48Z",
    "updated": "2025-11-21T11:04:48Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "physics.acc-ph",
      "physics.geo-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2410.18817v2",
    "url": "https://arxiv.org/abs/2410.18817v2",
    "pdf_url": "https://arxiv.org/pdf/2410.18817v2.pdf",
    "title": "Conceptual Design of the Muonium-to-Antimuonium Conversion Experiment (MACE)",
    "abstract": "The spontaneous conversion of muonium to antimuonium is one of the interesting charged lepton flavor violation phenomena offering a sensitive probe of potential new physics and serving as a tool to constrain the parameter space beyond the Standard Model. The Muonium-to-Antimuonium Conversion Experiment (MACE) is designed to utilize a high-intensity muon beam, a Michel electron magnetic spectrometer, a positron transport system, and a positron detection system, to either discover or constrain this rare process with a conversion probability of $\\mathcal{O}(10^{-13})$. This article presents an overview of the theoretical framework as well as a detailed description of the experimental design for the search for muonium-to-antimuonium conversion.",
    "authors": [
      "Ai-Yu Bai",
      "Hanjie Cai",
      "Chang-Lin Chen",
      "Siyuan Chen",
      "Xurong Chen",
      "Yu Chen",
      "Weibin Cheng",
      "Ling-Yun Dai",
      "Rui-Rui Fan",
      "Li Gong",
      "Zihao Guo",
      "Yuan He",
      "Zhilong Hou",
      "Yinyuan Huang",
      "Huan Jia",
      "Hao Jiang",
      "Han-Tao Jing",
      "Xiaoshen Kang",
      "Hai-Bo Li",
      "Jincheng Li",
      "Yang Li",
      "Daming Liu",
      "Shulin Liu",
      "Guihao Lu",
      "Han Miao",
      "Yunsong Ning",
      "Jianwei Niu",
      "Huaxing Peng",
      "Alexey A. Petrov",
      "Yuanshuai Qin",
      "Mingchen Sun",
      "Jian Tang",
      "Jing-Yu Tang",
      "Ye Tian",
      "Rong Wang",
      "Xiaodong Wang",
      "Yi Wang",
      "Zhichao Wang",
      "Chen Wu",
      "Tian-Yu Xing",
      "Weizhi Xiong",
      "Yu Xu",
      "Baojun Yan",
      "De-Liang Yao",
      "Tao Yu",
      "Ye Yuan",
      "Yi Yuan",
      "Yao Zhang",
      "Yongchao Zhang",
      "Zhilv Zhang",
      "Guang Zhao",
      "Shihan Zhao"
    ],
    "published": "2024-10-24T15:04:04Z",
    "updated": "2025-11-21T10:56:43Z",
    "categories": [
      "hep-ex",
      "hep-ph",
      "physics.acc-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2511.17018v1",
    "url": "https://arxiv.org/abs/2511.17018v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17018v1.pdf",
    "title": "Improvements of the GPU Processing Framework for ALICE",
    "abstract": "ALICE is the dedicated heavy ion experiment at the LHC at CERN and records lead-lead collisions at a rate of up to 50 kHz. The detector with the highest data rate of up to 3.4 TB/s is the TPC. ALICE performs the full online TPC processing corresponding to more than 95\\% of the total workload on GPUs, and when there is no beam in the LHC, the online computing farm's GPUs are used to speed up the offline processing. After the deployment of the first version of the online TPC processing needed for data taking, ALICE has implemented many improvements to its GPU processing framework. These include a run time compilation mode applying on the fly optimizations, improvements to parallelize / speed up the GPU compilation, debugging modes to guarantee reproducible and deterministic results in concurrent reconstruction, and framework features to leverage common components in the code of different detectors. The proceedings give an overview of the ALICE experience with GPUs in online and offline processing and present the latest GPU processing framework features.",
    "authors": [
      "David Rohr"
    ],
    "published": "2025-11-21T07:45:52Z",
    "updated": "2025-11-21T07:45:52Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1051/epjconf/202533701362"
  },
  {
    "arxiv_id": "2510.15270v2",
    "url": "https://arxiv.org/abs/2510.15270v2",
    "pdf_url": "https://arxiv.org/pdf/2510.15270v2.pdf",
    "title": "In-Situ Performance of FBK VUV-HD3 and HPK VUV4 SiPMs in the LoLX Liquid Xenon Detector",
    "abstract": "Silicon Photomultipliers (SiPMs) are a critical technology for the next generation of rare-event search experiments using liquid xenon (LXe). While two VUV-sensitive SiPMs are available, comprehensive in-situ studies are needed to inform detector design and compare device response. This work presents a direct comparison of Fondazione Bruno Kessler (FBK) VUV-HD3 and Hamamatsu (HPK) VUV4 SiPMs operated simultaneously within the Light-only Liquid Xenon (LoLX) detector. Using data collected with gamma sources placed outside the detector, we characterized the relative performance of these photosensors. Our analysis reveals that under these operating conditions, the HPK SiPMs are 33-38% less efficient than the FBK devices, a larger difference than predicted by standard PDE models in vacuum measurement. We show that this discrepancy is resolved by our angular and wavelength dependent PDE model incorporating surface shadowing effects into our optical simulation, which then accurately reproduces the experimental data. This finding has significant implications for the selection and implementation of photosensors in future large-scale LXe detectors.",
    "authors": [
      "Xiang Li",
      "David Gallacher",
      "Stephanie Bron",
      "Thomas Brunner",
      "Austin de St Croix",
      "Frédéric Girard",
      "Colin Hempel",
      "Mouftahou Bakary Latif",
      "Simon Lavoie",
      "Chloé Malbrunot",
      "Fabrice Retière",
      "Marc-André Tétrault",
      "Lei Wang"
    ],
    "published": "2025-10-17T03:19:23Z",
    "updated": "2025-11-20T20:41:06Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.16491v1",
    "url": "https://arxiv.org/abs/2511.16491v1",
    "pdf_url": "https://arxiv.org/pdf/2511.16491v1.pdf",
    "title": "Efficient and affordable thermoelectric measurement setup using Arduino and LabVIEW for education and research",
    "abstract": "Thermoelectric materials can convert thermal energy into electricity, making them promising candidates for harvesting waste heat, an increasingly important challenge in the energy-intensive modern world. The search for improved thermoelectric materials is therefore an active area of research in materials physics. Despite their fundamental and practical significance, thermoelectric properties - such as the Seebeck coefficient and power factor - are rarely explored in student labs due to the complexity in measurement schemes and requirement for sophisticated equipment. In this work, we present a user-friendly, low-cost and efficient thermoelectric measurement system built with Arduino and LabVIEW, which can simultaneously measure Seebeck coefficients and power factors as a function of temperature. This was made possible by improving the resolution of Arduino over ~1000 times with amplifiers and noise reduction schemes. With a total cost of only ~$100 and simple measurement protocols, this setup is well suited not only for student labs but also for efficient thermoelectric research.",
    "authors": [
      "Alex J. Oh",
      "Colby J. Stoddard",
      "Craig Queenan",
      "Seongshik Oh"
    ],
    "published": "2025-11-20T16:06:14Z",
    "updated": "2025-11-20T16:06:14Z",
    "categories": [
      "physics.ed-ph",
      "cond-mat.mtrl-sci",
      "physics.ins-det"
    ],
    "primary_category": "physics.ed-ph",
    "doi": "10.1119/5.0289649"
  },
  {
    "arxiv_id": "2511.16412v1",
    "url": "https://arxiv.org/abs/2511.16412v1",
    "pdf_url": "https://arxiv.org/pdf/2511.16412v1.pdf",
    "title": "Algorithms and optimizations for global non-linear hybrid fluid-kinetic finite element stellarator simulations",
    "abstract": "Predictive modeling of stellarator plasmas is crucial for advancing nuclear fusion energy, yet it faces unique computational difficulties. One of the main challenges is accurately simulating the dynamics of specific particle species that are not well captured by fluid models, which necessitates the use of hybrid fluid-kinetic models. The non-axisymmetric geometry of stellarators fundamentally couples the toroidal Fourier modes, in contrast to what happens in tokamaks, requiring different numerical and computational treatment.   This work presents a novel, globally coupled projection scheme inside the JOREK finite element framework. The approach ensures a self-consistent and physically accurate transfer of kinetic markers to the fluid grid, effectively handling the complex 3D mesh by constructing and solving a unified linear system that encompasses all toroidal harmonics simultaneously. To manage the computational complexity of this coupling, the construction of the system's matrix is significantly accelerated using the Fast Fourier Transform (FFT). The efficient localization of millions of particles is made possible by implementing a 3D R-Tree spatial index, which supports this projection and ensures computational tractability at scale.   On realistic Wendelstein 7-X stellarator geometries, the fidelity of the framework is rigorously shown. In sharp contrast to the uncoupled approaches' poor performance, quantitative convergence tests verify that the coupled scheme attains the theoretically anticipated spectral convergence.   This study offers a crucial capability for the predictive analysis and optimization of next-generation stellarator designs by developing a validated, high-fidelity computational tool.",
    "authors": [
      "Luca Venerando Greco"
    ],
    "published": "2025-11-20T14:35:04Z",
    "updated": "2025-11-20T14:35:04Z",
    "categories": [
      "physics.plasm-ph",
      "cs.CE",
      "cs.PF",
      "math-ph",
      "math.NA"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.16408v1",
    "url": "https://arxiv.org/abs/2511.16408v1",
    "pdf_url": "https://arxiv.org/pdf/2511.16408v1.pdf",
    "title": "Development & Characterization of Electrodes for large-scale Xenon Time Projection Chambers",
    "abstract": "Dual-phase liquid xenon time projection chambers are the core detector elements of many experiments that conduct searches for Dark Matter and rare events, as well as in neutrino and high-energy physics. As part of this detector technology, high-voltage electrodes are instrumental for the generation of observable signals and their physical interpretation. Thus, electrode design and manufacturing has to fulfill stringent requirements, and their production is associated with significant engineering challenges. In this work we describe the successful development of electrodes on the 1.5 m-scale, from their design and simulation to subsequent assembly and high-voltage testing in a gaseous argon environment. The produced electrodes were recently installed as an anode and a cathode during an upgrade to the XENONnT experiment.",
    "authors": [
      "A. Elykov",
      "S. Vetter",
      "V. H. S. Wu",
      "A. Deisting",
      "K. Eitel",
      "R. Gumbsheimer",
      "M. Kara",
      "S. Lichter",
      "S. Lindemann",
      "T. Luce",
      "J. Müller",
      "K. Müller",
      "U. Oberlack",
      "M. Schumann",
      "K. Valerius"
    ],
    "published": "2025-11-20T14:29:16Z",
    "updated": "2025-11-20T14:29:16Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.04727v2",
    "url": "https://arxiv.org/abs/2507.04727v2",
    "pdf_url": "https://arxiv.org/pdf/2507.04727v2.pdf",
    "title": "On the interpretation of XRISM X-ray measurements of turbulence in the intracluster medium: a comparison with cosmological simulations",
    "abstract": "We investigate whether the properties of turbulent gas motions recently measured via X-ray spectroscopy in the Coma cluster of galaxies by XRISM are in tension with the turbulent picture established by current numerical cosmological simulations. We use a high-resolution simulation of a Coma-like cluster and show that the simulation yields velocity structure functions and X-ray line-widths that are compatible with those measured by the XRISM observations of Coma. In particular, it has been previously suggested that a much steeper turbulence spectrum than the Kolmogorov would be needed to explain the XRISM observations under a homogeneous, cluster volume-filling turbulence model. Our results show that this tension is overcome thanks to the more complicated turbulent picture in cosmological simulations, that indeed shows a patchy distribution of turbulent regions in galaxy clusters, with a spectrum that is generally consistent with a Kolmogorov power-law over a fairly wide range of scales. More generally, our study highlights the fact that the interpretation of XRISM data of galaxy clusters depends on the turbulence model used and the importance of combining data and advanced simulations in the future steps.",
    "authors": [
      "F. Vazza",
      "G. Brunetti"
    ],
    "published": "2025-07-07T07:45:15Z",
    "updated": "2025-11-20T14:23:57Z",
    "categories": [
      "astro-ph.CO",
      "astro-ph.GA",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.CO"
  },
  {
    "arxiv_id": "2503.13088v3",
    "url": "https://arxiv.org/abs/2503.13088v3",
    "pdf_url": "https://arxiv.org/pdf/2503.13088v3.pdf",
    "title": "Orbit-Controlled Generation of Two-color Attosecond Mode-locked Free-electron Lasers",
    "abstract": "The generation of attosecond X-ray pulses has garnered significant attention within the X-ray free-electron laser (FEL) community due to their potential for ultrafast time-resolved studies. Such pulses enable the investigation of electron dynamics with unprecedented temporal resolution, opening new avenues in fields such as quantum control and ultrafast spectroscopy. In an FEL, the mode-locking technique synthesizes a comb of longitudinal modes by applying spatiotemporal shifts between the co-propagating radiation and the electron bunch. Here, we propose a novel scheme for generating two-color attosecond mode-locked FEL pulses via orbit control in two-stage mode-locked undulators. Specifically, a chicane with a wiggler inserted in the middle generates periodic temporal-transverse modulation in the electron beam. In this configuration, the low-energy and high-energy components of the beam lase in separate undulator sections, with each producing attosecond mode-locked FEL pulses. Three-dimensional simulations with realistic parameters confirm that trains of 250-attosecond soft X-ray pulses at the gigawatt level can be independently generated in each undulator section. Furthermore, time delay between the two pulse trains can be adjusted over a range of several hundred femtoseconds.",
    "authors": [
      "Tu Lingjun",
      "Sun Hao",
      "Yi Huaiqian",
      "Zeng Li",
      "Liang Yifan",
      "Yu Yong",
      "Wang Xiaofan",
      "Zhang Weiqing"
    ],
    "published": "2025-03-17T11:50:26Z",
    "updated": "2025-11-20T09:56:18Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.16185v1",
    "url": "https://arxiv.org/abs/2511.16185v1",
    "pdf_url": "https://arxiv.org/pdf/2511.16185v1.pdf",
    "title": "Multiplexed SiPM Readout of Plastic Scintillating Fiber Detector for Muon Tomography",
    "abstract": "Muon tomography is a non-destructive imaging technique that uses cosmic-ray muons to probe dense materials. A plastic scintillating fiber (SciFi) detector with a one-dimensional SiPM array offers a compact, high-resolution solution. However, scaling up the detector area and spatial resolution demands reducing the number of readout channels while maintaining detector performance. To address this challenge, this work presents a multiplexing scheme based on a diode-based symmetric charge division circuit combined with a position-encoding algorithm. Circuit simulations confirm the feasibility of the multiplexing design and guide the selection of suitable diodes to preserve SiPM signal integrity. Electronic tests show that the proposed design exhibits low crosstalk among electronic channels, and preserves linearity over a dynamic range spanning a few to several hundred photoelectrons. Cosmic-ray measurements further demonstrate that the multiplexed SciFi detector achieves a detection efficiency above 95\\% and a spatial resolution of about 0.65~mm, with only minor degradation compared to direct readout. These results verify that the proposed method offers a scalable and cost-effective readout solution for large-area muon tomography systems.",
    "authors": [
      "Chenghan Lv",
      "Kun Hu",
      "Huiling Li",
      "Hui Liang",
      "Cong Liu",
      "Hongbo Wang",
      "Zibing Wu",
      "Weiwei Xu"
    ],
    "published": "2025-11-20T09:50:13Z",
    "updated": "2025-11-20T09:50:13Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.10964v2",
    "url": "https://arxiv.org/abs/2508.10964v2",
    "pdf_url": "https://arxiv.org/pdf/2508.10964v2.pdf",
    "title": "The SND@LHC neutron shielding",
    "abstract": "The design and construction of a neutron shielding for the SND@LHC detector, which utilizes a combination of plexiglass and borated polyethylene, is presented. FLUKA simulations were employed to optimize the shielding configuration and assess its efficiency. Results indicate a significant reduction in neutron flux, ensuring the long-term stability of the emulsion films used in the target of the SND@LHC detector.",
    "authors": [
      "The SND@LHC Collaboration"
    ],
    "published": "2025-08-14T14:16:48Z",
    "updated": "2025-11-20T09:35:04Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.24371v2",
    "url": "https://arxiv.org/abs/2509.24371v2",
    "pdf_url": "https://arxiv.org/pdf/2509.24371v2.pdf",
    "title": "Advancing the CMS Level-1 Trigger: Jet Tagging with DeepSets at the HL-LHC",
    "abstract": "At the High Luminosity LHC, selecting important physics processes such as (di-) Higgs production will be a high priority. The Phase-2 Upgrade of the CMS Level-1 Trigger will reconstruct particle candidates and use pileup mitigation for the 200 simultaneous proton-proton interactions. A fast cone algorithm will reconstruct jets from these particles, providing access to jet constituents for the first time. We introduce a new multi-class jet tagger with a small, quantized DeepSets neural network. The tagger, trained on a mix of simulated CMS events, predicts various hadronic and leptonic classes. We present the tagger, its performance, and its improvements for triggering on (di-) Higgs events.",
    "authors": [
      "Stella Schaefer",
      "Christopher Brown",
      "Duc Hoang",
      "Sioni Summers",
      "Sebastian Wuchterl"
    ],
    "published": "2025-09-29T07:17:12Z",
    "updated": "2025-11-20T08:55:59Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.16125v1",
    "url": "https://arxiv.org/abs/2511.16125v1",
    "pdf_url": "https://arxiv.org/pdf/2511.16125v1.pdf",
    "title": "Characteristics of electromagnetic radiation and the interference protection on a small-sized direct-acting electron accelerator with a plasma opening switch",
    "abstract": "An experimental study of the parameters of electromagnetic and X-ray radiation was carried out on a small-sized direct-acting electron accelerator with inductive storage and a plasma opening switch. Frequency spectra have been determined, and the diagnostics of the power of the microwave component of the spectrum has been tested. An analytical comparison of radiation signals and power signals has been carried out. A method for determining the directivity pattern using a broadband power sensor has been proposed. An anechoic chamber and a reflective screen were used to suppress interference.",
    "authors": [
      "D. V. Vinnikov",
      "O. M. Ozerov",
      "V. V. Katrechko",
      "V. I. Tkachov",
      "S. V. Marchenko",
      "V. V. Ehorenkov",
      "S. A. Petrenko",
      "B. O. Brovkin",
      "O. V. Manuilenko",
      "I. N. Onishchenko"
    ],
    "published": "2025-11-20T07:56:13Z",
    "updated": "2025-11-20T07:56:13Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.15988v1",
    "url": "https://arxiv.org/abs/2511.15988v1",
    "pdf_url": "https://arxiv.org/pdf/2511.15988v1.pdf",
    "title": "Effects of Multi-scale Coupling on Particle Acceleration and Energy Partition in Magnetic Reconnection",
    "abstract": "The interplay between kinetic and macroscopic scales during magnetic reconnection is investigated using particle-in-cell simulations of magnetic island coalescence in the strongly-magnetized, relativistic pair plasma regime. For large system sizes, secondary current sheet formation and downstream turbulence driven by the reconnection outflows dominate the global energy dissipation so that it is causally connected, but spatially and temporally de-coupled from the primary reconnecting current sheet. When compared to simulations of an isolated, force-free current sheet, these dynamics activate additional particle acceleration channels which are responsible for a significant population of the non-thermal particles, modifying the particle energy spectra.",
    "authors": [
      "Alexander Velberg",
      "Adam Stanier",
      "Xiaocan Li",
      "Fan Guo",
      "William Daughton",
      "Nuno F. Loureiro"
    ],
    "published": "2025-11-20T02:39:56Z",
    "updated": "2025-11-20T02:39:56Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.15937v1",
    "url": "https://arxiv.org/abs/2511.15937v1",
    "pdf_url": "https://arxiv.org/pdf/2511.15937v1.pdf",
    "title": "Asymptotic-preserving semi-implicit finite volume scheme for Extended Magnetohydrodynamics",
    "abstract": "A Finite Volume (FV) scheme is developed for solving the extended magnetohydrodynamic (XMHD) equations, yielding accurate results in the ideal, resistive, and Hall MHD limits. This is accomplished by first re-writing the XMHD equations such that it allows the algorithm to retain the use of ideal MHD Riemann solvers and the constrained transport method to preserve divergence-free magnetic fields. Incorporation of electron inertia and displacement current introduces additional numerical stiffness which motivates a semi-implicit FV scheme that re-formulates the XMHD model as a relaxation system. The equations are then advanced in time using an explicit 2nd-order Runge-Kutta scheme with operator splitting applied to the implicit source term updates at each sub-stage. For additional numerical stability, density-dependent slope limiter is implemented to increase flux diffusivity at low density where non-ideal effects become significant. The algorithm is subsequently implemented on Artemis, a multifluid radiation hydrodynamics code built on Parthenon framework for high-performance computing (HPC) and adaptive mesh refinement (AMR) support. As the new algorithm retains many aspects of the ideal MHD formulations, it asymptotes naturally to the ideal MHD limit. Moreover, it shows promising results at the resistive and Hall MHD limits. This is verified against published test problems for ideal, resistive and Hall MHD.",
    "authors": [
      "Yi Han Toh",
      "Joshua Dolence",
      "Karthik Duraisamy"
    ],
    "published": "2025-11-20T00:02:46Z",
    "updated": "2025-11-20T00:02:46Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.15912v1",
    "url": "https://arxiv.org/abs/2511.15912v1",
    "pdf_url": "https://arxiv.org/pdf/2511.15912v1.pdf",
    "title": "Characterization of Low-energy Ionization Signals in Silicon Detectors for the Nab Experiment",
    "abstract": "The Nab (Neutron a b) experiment is designed to measure the beta-antineutrino angular correlation in free neutron $β$ decay with an ultimate precision goal of 0.1%, providing input for tests of Cabibbo-Kobayashi-Maskawa (CKM) matrix unitarity. This measurement is performed via detection of electrons and protons in delayed coincidence using custom large-area segmented silicon drift detectors. We present the characterization of one such detector system to establish the proton energy and timing response, using a dedicated proton accelerator. The detected proton peak was studied for 25 keV, 30 keV, and 35 keV incident protons on a set of detector segments and multiple cooling cycles over a one year period. Ionization losses were consistent with models of the detector dead layer with thicknesses less than 100nm. The detected proton peak was stable within the uncertainty from energy calibration (0.2 keV). The rise times of detector pulses from $^{109}$Cd and $^{113}$Sn conversion electron sources were used to extract the impurity density profile and establish a precise model for the detector timing response. The observed impurity density profile varied from $(2 \\pm 2) \\times 10^9$ cm$^{-3}$ at the center to $(26 \\pm 2) \\times 10^9$ cm$^{-3}$ at the edge. This impurity density profile was then used to characterize systematic effects in proton time-of-flight measurements due to detector pulse-shape effects; the resultant proton timing systematic uncertainties were below 0.3 ns, which is sufficient for the Nab experiment.",
    "authors": [
      "R. J. Taylor",
      "August Mendelsohn",
      "Arlee Shelby",
      "W. C. McCray",
      "Jin Ha Choi",
      "Nicholas Macsai",
      "Grant Riley",
      "Erick Smith",
      "Stefan Baeßler",
      "Leah J. Broussard",
      "Christopher B. Crawford",
      "Michael Gericke",
      "Francisco M. Gonzalez",
      "David Harrison",
      "Leendert Hayen",
      "Mark Makela",
      "R. R. Mammei",
      "D. G. Mathews",
      "D. D. Počanić",
      "Glenn Randall",
      "Americo Salas-Bacci",
      "W. S. Wilburn",
      "A. R. Young"
    ],
    "published": "2025-11-19T22:34:10Z",
    "updated": "2025-11-19T22:34:10Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.15844v1",
    "url": "https://arxiv.org/abs/2511.15844v1",
    "pdf_url": "https://arxiv.org/pdf/2511.15844v1.pdf",
    "title": "Geant4 based library SCoRe4 for Surface Contamination and Roughness Effects simulations in rare event search experiments",
    "abstract": "Surface simulations are important for accurately modeling particle interactions in experiments where background contributions from surface contaminants can significantly affect detector performance. In rare event searches, such as dark matter or neutrinoless double beta decay experiments, standard Geant4 simulations typically assume perfectly smooth surfaces, neglecting the microscopic roughness that exists in real materials. This simplification can lead to inaccurate predictions of energy deposition. To address this limitation, I developed SCoRe4, a Geant4-based library designed to simulate more realistic surface roughness based on experimentally measurable parameters. The code allows users to generate patches of simplified rough surface geometries across a wide range of scales - from square millimeters to square meters - while maintaining computational efficiency. SCoRe4 is open source and can be easily integrated into existing Geant4 setups. This work presents the structure, implementation, and example application of SCoRe4,as well as its potential use in improving the accuracy of background modeling in rare event physics.",
    "authors": [
      "Christoph Grüner"
    ],
    "published": "2025-11-19T20:09:24Z",
    "updated": "2025-11-19T20:09:24Z",
    "categories": [
      "physics.ins-det",
      "physics.comp-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2505.03660v2",
    "url": "https://arxiv.org/abs/2505.03660v2",
    "pdf_url": "https://arxiv.org/pdf/2505.03660v2.pdf",
    "title": "Understanding large-scale dynamos in unstratified rotating shear flows",
    "abstract": "We combine simulations with new analyses that overcome previous pitfalls to explicate how nonhelical mean-field dynamos grow and saturate in unstratified, magnetorotationally driven turbulence. Shear of the mean radial magnetic field amplifies the azimuthal component. Radial fields are regenerated by velocity fluctuations that induce shear of radial magnetic fluctuations, followed by Lorentz and Coriolis forces that source a negative off-diagonal component in the turbulent diffusivity tensor. We present a simple schematic to illustrate this dynamo growth. A different part of the Lorentz force forms a third-order correlator in the mean electromotive force that saturates the dynamo.",
    "authors": [
      "Tushar Mondal",
      "Pallavi Bhat",
      "Fatima Ebrahimi",
      "Eric G. Blackman"
    ],
    "published": "2025-05-06T16:05:05Z",
    "updated": "2025-11-19T18:19:30Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.GA",
      "astro-ph.HE",
      "astro-ph.SR",
      "physics.flu-dyn"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.15651v1",
    "url": "https://arxiv.org/abs/2511.15651v1",
    "pdf_url": "https://arxiv.org/pdf/2511.15651v1.pdf",
    "title": "Material processing by laser-plasma-filament-guided high voltage discharges",
    "abstract": "We investigate ablation experiments performed by laser-plasma-filament guided electrical discharges at high-voltages of up to 145 kV. The guiding was accomplished via fs-laser-generated plasma filaments across a gap of 201 mm of air onto steel 1.3343 samples. This method combines remote material processing and enables the steering and deflection of high voltage discharges with the ease-of-use of remote laser processing technology. We observe an increase of the per-pulse-(and-discharge)-ablated volume by a factor of 1.67 over an ablation regime when the discharges are not present and up to a factor of 12.5 over the case when neither discharges nor plasma filaments, only a loosely focused laser beam, are present.",
    "authors": [
      "Kristian Cvecek",
      "Markus Döring",
      "Alexander Romboy",
      "Johannes Heberle",
      "Michael Schmidt"
    ],
    "published": "2025-11-19T17:39:12Z",
    "updated": "2025-11-19T17:39:12Z",
    "categories": [
      "physics.plasm-ph",
      "physics.app-ph",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.15641v1",
    "url": "https://arxiv.org/abs/2511.15641v1",
    "pdf_url": "https://arxiv.org/pdf/2511.15641v1.pdf",
    "title": "Characterisation of X- and O-points in Wendelstein 7-X with respect to coil currents",
    "abstract": "This work analyses vacuum magnetic field topology in Wendelstein 7-X (W7-X) with respect to changes in the current in the superconducting coils. We develop a fast automated scheme to locate fixed points (such as X- and O-points) and calculate the trace of the Jacobian of the field line map for them (Tr(M)), which represents several important properties of the fixed point. We perform two sets of coil current scans: (1) scans where each coil current is varied individually, using the \"standard\", \"high iota\" and \"low iota\" configurations as starting points; (2) a scan of over 200,000 magnetic configurations in which the coil currents are randomly sampled. In both cases we constrain the coil currents to the normal range of W7-X. We verify the principal roles of the non-planar, planar and control coils: the non-planar coils establish island chains with a certain phase; the planar coils modify the location of the island chain by both controlling the iota profile and shifting the configuration \"inward\" and \"outward\"; the control coil affects the island size and phase. We also find that |Tr(M)-2| (a quantity closely related to the magnitude of the Greene's residue) tends to increase with the minor radius of the fixed points, and that Tr(M) for X- and O-points can be very differently affected by the control coil current. Finally, we show that |Tr(M)-2| serves as a proxy for island size for internal island chains, which may help identification of suitable experimental candidates.",
    "authors": [
      "Robert Davies",
      "Christopher B. Smiet",
      "Charlotte Batzdorf",
      "J. Geiger",
      "J. Loizu",
      "S. A. Henneberg"
    ],
    "published": "2025-11-19T17:23:05Z",
    "updated": "2025-11-19T17:23:05Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.15579v1",
    "url": "https://arxiv.org/abs/2511.15579v1",
    "pdf_url": "https://arxiv.org/pdf/2511.15579v1.pdf",
    "title": "Turbulence in the terrestrial magnetosheath: space-time correlation using the Magnetospheric Multiscale mission",
    "abstract": "Spatiotemporal correlation of magnetic field fluctuations is investigated using the Magnetospheric Multiscale mission in the terrestrial magnetosheath. The first observation of the turbulence propagator in space emerges through analysis of more than a thousand intervals. Results show clear features of spatial and spectral anisotropy, leading to a distinct behavior of relaxation times in the directions parallel and perpendicular to the mean magnetic field. Full space-time investigation of the Taylor hypothesis reveals a scale-dependent anisotropy of magnetosheath fluctuations that can be compared to the effect of flow propagation on spacecraft frame time decorrelation rates as well as with Eulerian estimates. The turbulence propagator reveals that the amplitudes of the perpendicular modes decorrelate according to sweeping or Alfvénic propagation mechanisms. The decorrelation time of parallel modes instead does not depend on the parallel wavenumber, which could be due to resonant interactions. Through direct observation, this study provides unprecedented insight into the space-time structure of turbulent space plasmas, while giving critical constraints for theoretical and numerical models.",
    "authors": [
      "Francesco Pecora",
      "William H. Matthaeus",
      "Antonella Greco",
      "Pablo Dmitruk",
      "Yan Yang",
      "Vincenzo Carbone",
      "Sergio Servidio"
    ],
    "published": "2025-11-19T16:10:16Z",
    "updated": "2025-11-19T16:10:16Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2511.15562v1",
    "url": "https://arxiv.org/abs/2511.15562v1",
    "pdf_url": "https://arxiv.org/pdf/2511.15562v1.pdf",
    "title": "High Density Hybridisation Using ENIG Bumping and Anisotropic Conductive Films",
    "abstract": "Fine-pitch hybridisation processes are essential for next-generation pixel detectors and high-density microelectronic assemblies. Conventional bump-bonding techniques, although reliable, remain costly and difficult to implement for single-die applications.   In this work, we present flip-chip hybridisation results combining Electroless Nickel Immersion Gold (ENIG) bumping with Anisotropic Conductive Film (ACF) bonding, both developed in-house. This method enables fine-pitch interconnections without requiring wafer-level processing.   The feasibility of the ENIG-ACF process for functional devices was demonstrated by hybridising functional Timepix3 ASIC and Ti-LGAD (Trench Isolated Low-Gain Avalanche Detector) sensors with 55 um pitch. The approach was then extended to test structures with 25 um pitch, using aligned-particle ACFs. The analysis revealed that the main limitation originated from the mismatch between ACF thickness and bump height, underlining the importance of interface geometry optimisation. To address this, a dedicated simulation program was developed to model the isotropic growth of ENIG bumps and to determine the optimum bump height as a function of ACF thickness and pixel-matrix geometry.   The results provide valuable guidelines for future high connection density assemblies and demonstrate the potential of the ENIG-ACF process as a scalable, low-cost alternative to conventional bump-bonding techniques.",
    "authors": [
      "Haripriya Bangaru",
      "Giovanni Calderini",
      "Dominik Dannheim",
      "Rui De Oliveira",
      "Ahmet Lale",
      "Moritz Lauser",
      "Mateus Vicente Barreto Pinto",
      "Peter Svihra"
    ],
    "published": "2025-11-19T15:56:03Z",
    "updated": "2025-11-19T15:56:03Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.05340v2",
    "url": "https://arxiv.org/abs/2511.05340v2",
    "pdf_url": "https://arxiv.org/pdf/2511.05340v2.pdf",
    "title": "Modelling the Performance of Tritium Process Monitors from First Principles",
    "abstract": "Ionization chamber-based, in-line tritium process monitors play an important part in determining the behavior of a tritium system. The one-liter detection volume monitor has been characterized well through experiment and to respond linearly to tritium concentrations for the range of $1 μCi/m^3$ to $1 Ci/m^3$. Additionally, it has been shown to behave nonlinearly for low voltage on the central anode and low pressure of the carrier gas. A computational model was developed from first principles that successfully describes the behavior of the one-liter monitor for each of these regimes. Predictions from the model are compared to previously-collected experimental data in order to determine validity and tune the model. The model will be expanded to incorporate additional detector geometries and designs in the future.",
    "authors": [
      "Nicolas J. Sovare",
      "Walter T. Shmayda"
    ],
    "published": "2025-11-07T15:36:29Z",
    "updated": "2025-11-19T14:49:12Z",
    "categories": [
      "physics.ins-det",
      "physics.comp-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2504.04172v2",
    "url": "https://arxiv.org/abs/2504.04172v2",
    "pdf_url": "https://arxiv.org/pdf/2504.04172v2.pdf",
    "title": "Scaling of energy delivered through an electrostatic discharge to a small series load",
    "abstract": "We study the energy delivered through a small-resistance series ``victim'' load during electrostatic discharge events in air. For gap lengths over 1~mm, the fraction of the stored energy delivered is mostly gap-length independent, with a slight decrease at larger gaps due to electrode geometry. The energy to the victim scales linearly with circuit capacitance and victim load resistance but is not strongly dependent on circuit inductance. This scaling leads to a simple approach to predicting the maximum energy that will be delivered to a series resistance for the case where the victim load resistance is lower than the spark resistance.",
    "authors": [
      "Claudia A. M. Schrama",
      "Calvin Bavor",
      "John W. Rose",
      "P. David Flammer",
      "Charles G. Durfee"
    ],
    "published": "2025-04-05T13:27:35Z",
    "updated": "2025-11-19T14:12:17Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1016/j.elstat.2025.104205"
  },
  {
    "arxiv_id": "2511.06466v2",
    "url": "https://arxiv.org/abs/2511.06466v2",
    "pdf_url": "https://arxiv.org/pdf/2511.06466v2.pdf",
    "title": "Kerr Black Hole Shadows in Dispersive Plasma: Frequency-Dependent Geodesics and Shadow Distortions",
    "abstract": "The black hole shadow, a direct probe of the event horizon's gravitational influence, has been observationally confirmed by the Event Horizon Telescope (EHT). While theoretical models of shadows in vacuum are mature, real astrophysical black holes like M87* and Sgr A* are enveloped in plasma, which can alter photon trajectories through dispersion. Current understanding, based on foundational work, indicates that only specific plasma distributions allow for an analytical treatment via the separation of the Hamilton-Jacobi equation. In this work, we build upon this framework to systematically investigate the propagation of light rays in Kerr spacetime surrounded by a pressureless, non-magnetized cold plasma. We explicitly derive the separability condition, identifying the exact class of plasma densities that permit a generalized Carter constant. For these models, we compute the photon regions and shadow boundaries, characterizing how the shadow's size and shape deviate from the vacuum case in a frequency-dependent manner. Our results provide analytical benchmarks for the distortion of shadows in dispersive media and determine the critical plasma frequency beyond which the shadow is erased, offering a direct link between observable shadow features and the properties of the ambient plasma environment and providing a foundation for studying more dynamic, non-separable plasma distributions.",
    "authors": [
      "Sai Karan Mukthapuram",
      "Sandeep Kumar Kataria"
    ],
    "published": "2025-11-09T17:25:14Z",
    "updated": "2025-11-19T13:27:36Z",
    "categories": [
      "astro-ph.HE",
      "gr-qc",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2507.00548v3",
    "url": "https://arxiv.org/abs/2507.00548v3",
    "pdf_url": "https://arxiv.org/pdf/2507.00548v3.pdf",
    "title": "A waveform and time digitization mainboard prototype for the hybrid digital optical module of TRIDENT neutrino experiment",
    "abstract": "The TRIDENT (Tropical Deep-sea Neutrino Telescope) experiment is a next-generation underwater neutrino observatory planned for deployment in the West Pacific Ocean, designed to detect astrophysical neutrinos through Cherenkov radiation. The full-scale detector will consist of approximately 1000 vertical strings, each equipped with 20 hybrid digital optical modules (hDOMs) containing both photomultiplier tubes (PMTs) and silicon photomultipliers (SiPMs) for comprehensive light detection. This paper presents a custom-designed digitization mainboard prototype for the hDOM, featuring simultaneous 32-channel PMT waveform digitization at 125 MS/s using commercial analog-to-digital converters and 56-channel high-precision time measurement through field-programmable gate array -implemented time-to-digital converters. The system demonstrates excellent performance in single photoelectron (PE) detection with clear pedestal separation, maintains linear response up to 240 PEs, and achieves sub-nanosecond timing resolution for PMT or SiPM pulse edges.",
    "authors": [
      "Guangping Zhang",
      "Yong Yang",
      "Donglian Xu"
    ],
    "published": "2025-07-01T08:13:00Z",
    "updated": "2025-11-19T11:07:34Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.HE",
      "astro-ph.IM",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1007/s41605-025-00619-4"
  },
  {
    "arxiv_id": "2508.00503v2",
    "url": "https://arxiv.org/abs/2508.00503v2",
    "pdf_url": "https://arxiv.org/pdf/2508.00503v2.pdf",
    "title": "Using tunable coherence for reaching micrometer coherence lengths and suppressing stray light in a power-recycled Michelson interferometer",
    "abstract": "By reentering into laser interferometers, scattered or stray light introduces non-linear noise. This is a major limitation of precision interferometers as preventing such parasitic light is nearly impossible. Thus, substantial effort is put into mitigating the reentering of these fields in various ways. Ground-based laser interferometric gravitational wave detectors employ such mitigation techniques to reduce otherwise restrictive stray light noise. However, they are now reaching sensitivities where conventional mitigation techniques reach limitations. Further improvements planed for future observatories are placing even more demanding constraints on tolerable stray light power. We previously presented tunable coherence as a possible technique to ease these constraints and suppress unwanted coherent interference. For these promising demonstrations, the remaining coherence length and achievable suppression in length-constrained layouts was limited, among other things, by the used pseudo-random-noise phase modulation frequency. In this work, we demonstrate stray light suppression and cavity performance at modulation frequencies up to 10 GHz. This reduces the remaining coherence to a few centimeter in an interferometer, and even to the scale of the laser wavelength in a cavity. We further present a first demonstration of tunable coherence in a power-recycled Michelson interferometer, successfully suppressing stray light in a more complex topology.",
    "authors": [
      "Daniel Voigt",
      "Oliver Gerberding"
    ],
    "published": "2025-08-01T10:31:09Z",
    "updated": "2025-11-19T08:58:06Z",
    "categories": [
      "physics.optics",
      "astro-ph.IM",
      "gr-qc",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2511.13367v2",
    "url": "https://arxiv.org/abs/2511.13367v2",
    "pdf_url": "https://arxiv.org/pdf/2511.13367v2.pdf",
    "title": "Charge carrier generation in RNDR-DEPFET Detectors",
    "abstract": "Depleted p-channel field effect transistor detectors with repetitive-non-destructive readout (RNDR-DEPFETs) achieve a deep sub-electron noise by averaging several independent measurements of one single event. During the repetitive readout collected electrons are transferred between two readout nodes within each pixel to enable electron number-resolved measurements. The pixels serve as a unit cell of an active pixel sensor to achieve a high level of parallelization and fast readout. These properties are exploited in the DANAE experiment, which aims for the direct detection of light dark matter based with the event signature of electron recoils. We present the experimental characterization of an $64\\times64$ RNDR-DEPFET pixel detector with a focus on the charge carrier generation rate. This technology achieves a high time resolution, which increases its sensitivity on rare events with a signal of two or more electrons due to the Poisson distribution of thermal generated electrons.",
    "authors": [
      "Niels Wernicke",
      "Alexander Bähr",
      "Hannah Danhel",
      "Florian Heinrich",
      "Holger Kluck",
      "Jelena Ninkovic",
      "Jochen Schieck",
      "Wolfgang Treberspurg",
      "Johannes Treis"
    ],
    "published": "2025-11-17T13:41:30Z",
    "updated": "2025-11-19T08:51:20Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.13111v2",
    "url": "https://arxiv.org/abs/2511.13111v2",
    "pdf_url": "https://arxiv.org/pdf/2511.13111v2.pdf",
    "title": "NuBench: An Open Benchmark for Deep Learning-Based Event Reconstruction in Neutrino Telescopes",
    "abstract": "Neutrino telescopes are large-scale detectors designed to observe Cherenkov radiation produced from neutrino interactions in water or ice. They exist to identify extraterrestrial neutrino sources and to probe fundamental questions pertaining to the elusive neutrino itself. A central challenge common across neutrino telescopes is to solve a series of inverse problems known as event reconstruction, which seeks to resolve properties of the incident neutrino, based on the detected Cherenkov light. In recent times, significant efforts have been made in adapting advances from deep learning research to event reconstruction, as such techniques provide several benefits over traditional methods. While a large degree of similarity in reconstruction needs and low-level data exists, cross-experimental collaboration has been hindered by a lack of diverse open-source datasets for comparing methods.   We present NuBench, an open benchmark for deep learning-based event reconstruction in neutrino telescopes. NuBench comprises seven large-scale simulated datasets containing nearly 130 million charged- and neutral-current muon-neutrino interactions spanning 10 GeV to 100 TeV, generated across six detector geometries inspired by existing and proposed experiments. These datasets provide pulse- and event-level information suitable for developing and comparing machine-learning reconstruction methods in both water and ice environments. Using NuBench, we evaluate four reconstruction algorithms - ParticleNeT and DynEdge, both actively used within the KM3NeT and IceCube collaborations, respectively, along with GRIT and DeepIce - on up to five core tasks: energy and direction reconstruction, topology classification, interaction vertex prediction, and inelasticity estimation.",
    "authors": [
      "Rasmus F. Orsoe",
      "Stephan Meighen-Berger",
      "Jeffrey Lazar",
      "Jorge Prado",
      "Ivan Mozun-Mateo",
      "Aske Rosted",
      "Philip Weigel",
      "Arturo Llorente Anaya"
    ],
    "published": "2025-11-17T08:08:01Z",
    "updated": "2025-11-19T08:23:15Z",
    "categories": [
      "hep-ex",
      "cs.AI",
      "cs.LG",
      "physics.data-an",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2511.15209v1",
    "url": "https://arxiv.org/abs/2511.15209v1",
    "pdf_url": "https://arxiv.org/pdf/2511.15209v1.pdf",
    "title": "Magnetic signal scan imaging system based on giant magnetoimpedance (GMI) differential sensor",
    "abstract": "This paper presents the design and implementation of a magnetic signal scanning and imaging system based on the giant magnetoimpedance (GMI) effect. The system employs a pair of performance-matched GMI sensing elements configured as a differential probe structure. Through co-optimized low-noise electronic and probe design, the system effectively suppresses both intrinsic sensor common-mode drift and external environmental magnetic noise, enabling high signal-to-noise ratio detection of nono-tesla to micro-tesla-level magnetic signals without magnetic shielding. Experimental results demonstrate that the differential system achieves significantly lower noise spectral density in unshielded environments compared to conventional GMI sensors (\\SI{46}{pT}/$\\sqrt{\\text{Hz}}$ versus \\SI{286}{pT}/$\\sqrt{\\text{Hz}}$ at \\SI{1}{Hz}), with a sensitivity of 186,790 V/T and spatial resolution better than 200 micrometers. The system's excellent performance in weak magnetic field detection and spatial resolution was verified through scanning experiments of magnetic ink on US banknotes and magnetic reference samples. Compared to SQUID scanning systems, which requiring liquid helium cooling, this system based on the GMI effect offers advantages of room-temperature operation, compact structure, and low cost. Relative to conventional single-element GMI microscopes, it achieves significant improvements in signal-to-noise ratio and environmental adaptability. This research provides a practical solution for high-resolution magnetic field imaging at room temperature with broad application potential in materials magnetism, biomagnetic imaging, and nanomagnetic detection.",
    "authors": [
      "Tao Yang",
      "Zhoulu Yu",
      "Xuekui Xi",
      "Changjun Jiang",
      "Guozhi Chai"
    ],
    "published": "2025-11-19T08:00:05Z",
    "updated": "2025-11-19T08:00:05Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.16704v1",
    "url": "https://arxiv.org/abs/2511.16704v1",
    "pdf_url": "https://arxiv.org/pdf/2511.16704v1.pdf",
    "title": "Ultra-Low background germanium spectrometers at the China Jinping Underground Laboratory",
    "abstract": "Four ultra-low background germanium spectrometers, called GeTHU, have been installed at the first phase of China Jinping Underground Laboratory (CJPL-I), and served for material screening of dark matter and neutrino experiments. Recently, a new multi-detector spectrometer with five germanium detectors has been developed and installed at the second phase of CJPL (CJPL-II) with a minimum detectable activity (MDA) of about 10 μBq/kg. In addition, another fifteen GeTHU-like spectrometers have been installed at CJPL-II with an MDA of about 1 mBq/kg. This paper will introduce the ultra-low background germanium spectrometers including shielding design, background characteristics and application to material screening.",
    "authors": [
      "Jikai Chen",
      "Zhi Zeng",
      "Hao Ma",
      "Jianping Cheng"
    ],
    "published": "2025-11-19T07:16:51Z",
    "updated": "2025-11-19T07:16:51Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.15143v1",
    "url": "https://arxiv.org/abs/2511.15143v1",
    "pdf_url": "https://arxiv.org/pdf/2511.15143v1.pdf",
    "title": "Drive beam depletion with multi-Joule energy transfer in a plasma wakefield accelerator",
    "abstract": "A collider based on beam-driven plasma wakefield acceleration will require the drive beam to transfer 10-100s of Joules to the plasma in each stage, with a drive-to-wake energy transfer efficiency exceeding 70%. Using an all-optical plasma source, we demonstrate significant progress towards these parameters, transferring at least 5.6 J from a 1.52 nC, 10 GeV electron beam to a $4.5\\times 10^{16}\\,\\mathrm{cm^{-3}}$ hydrogen plasma while achieving at least $37\\pm 3\\%$ drive-to-wake energy transfer efficiency. We observe deceleration of some particles to less than 0.93 GeV with up to 90% of the charge participating in the interaction.",
    "authors": [
      "R. Ariniello",
      "V. Lee",
      "D. Storey",
      "C. Emma",
      "S. Gessner",
      "M. J. Hogan",
      "A. Knetsch",
      "M. D. Litos",
      "N. Majernik",
      "B. O'Shea"
    ],
    "published": "2025-11-19T05:49:25Z",
    "updated": "2025-11-19T05:49:25Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.15130v1",
    "url": "https://arxiv.org/abs/2511.15130v1",
    "pdf_url": "https://arxiv.org/pdf/2511.15130v1.pdf",
    "title": "A Novel Pixel-Chip-Based Region-of-Interest Readout Circuit Design",
    "abstract": "This paper presents a novel pixel chip readout scheme: the Region-of-Interest Readout Circuit (ROIRC), which is designed for large area, large array pixel chips and Gas Pixel Detector (GPD). This design employs a sentinel pixel detection strategy, enabling rapid identification and prioritized readout of the pixel regions containing signal events. During the scanning readout of these signal events, ROIRC employs a Block-based readout approach, effectively minimizing the readout of non-signal pixels. The functionality of ROIRC has been successfully implemented on both the ASIC and FPGA platforms. In the tests of the ROIRC, the pixel chip embedded in the GPD is capable of detecting low-energy X-rays in the range of 2-10 keV and supports multiple event readouts, and the pixel chip can read out photo-electron signal events with the count rate up to 15k / (cm2 x s).",
    "authors": [
      "Shi-Qiang Zhou",
      "Li-Rong Xie",
      "Dong Wang",
      "Cheng Lian",
      "Si-Ying Liu",
      "Zi-Yi Zhang",
      "Xiang-Ming Sun",
      "Hong-Bang Liu",
      "Chao-Song Gao",
      "Jun Liu",
      "Huan-Bo Feng",
      "Di-Fan Yi"
    ],
    "published": "2025-11-19T05:15:56Z",
    "updated": "2025-11-19T05:15:56Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.15024v1",
    "url": "https://arxiv.org/abs/2511.15024v1",
    "pdf_url": "https://arxiv.org/pdf/2511.15024v1.pdf",
    "title": "Impact of edge turbulence spreading on broadening the heat flux width with plasma approaching the density limit",
    "abstract": "This paper investigates the impact of edge turbulence spreading on broadening the heat flux width in Ohmic-plasma approaching the density limit of the J-TEXT tokamak. At the plasma edge, the EXB shear flow collapses while turbulence transport and spreading enhances significantly when approaching the density limit. The heat flux width increases with normalized density. An energy production ratio model is used to quantify the contribution of edge turbulence spreading to the origin of the SOL turbulence. Experimental data show that the energy production ratio is much larger than 1, indicating that turbulence spreading at separatrix is the origin of the SOL turbulence. The heat flux widths increase with edge turbulence spreading as well as the energy production ratio. The impact of blob-induced transport on the heat flux width is investigated in detail. Especially, the average blob-induced spreading is about 81% of the total edge spreading in the high-density scenario. Blobs with larger radial scales enhance edge spreading into the SOL, thus dominating the SOL turbulence and consequently broadening the heat flux width. These results suggest that edge turbulence spreading plays a crucial role in broadening the heat flux width as plasma approaches the density limit.",
    "authors": [
      "T. Wu",
      "P. H. Diamond",
      "L. Nie",
      "R. Ke",
      "Z. P. Chen",
      "Q. H. Yang",
      "W. J. Tian",
      "T. Long",
      "Z. J. Yang",
      "Z. Y. Chen",
      "M. Xu"
    ],
    "published": "2025-11-19T01:43:23Z",
    "updated": "2025-11-19T01:43:23Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2504.19429v2",
    "url": "https://arxiv.org/abs/2504.19429v2",
    "pdf_url": "https://arxiv.org/pdf/2504.19429v2.pdf",
    "title": "Wombat, the high intensity diffractometer in operation at the Australian Centre for Neutron Scattering",
    "abstract": "Wombat is the high intensity neutron diffractometer in operation at the Australian Centre for Neutron Scattering. While primarily used as a high-speed powder diffractometer, the high-performance area detector allows both texture characterisation and single-crystal measurements. The instrument can be configured over a large range of operational parameters, which are characterised in this contribution to aid experimental planning. Wombat is particularly optimised for the study of materials in situ and in operando using the wide range of sample environment available at the centre. Over 17 years of operation, Wombat has been used to explore a broad range of materials, including: novel hydrogen-storage materials, negative-thermal-expansion materials, cryogenic minerals, piezoelectrics, high performance battery anodes and cathodes, high strength alloys, multiferroics, superconductors and novel magnetic materials. This paper will highlight the capacity of the instrument, recent comprehensive characterisation measurements, and how the instrument has been utilised by our user community to date.",
    "authors": [
      "Helen E. Maynard-Casely",
      "Siobhan M. Tobin",
      "Chin-Wei Wang",
      "Vanessa K. Peterson",
      "James R. Hester",
      "Andrew J. Studer"
    ],
    "published": "2025-04-28T02:37:15Z",
    "updated": "2025-11-19T01:07:24Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.14987v1",
    "url": "https://arxiv.org/abs/2511.14987v1",
    "pdf_url": "https://arxiv.org/pdf/2511.14987v1.pdf",
    "title": "Field Emission Analysis in SRF Cavities for PIP-II Using GEANT4",
    "abstract": "Field emission (FE) remains a significant hurdle for achieving optimal performance and reliability in super-conducting radiofrequency (SRF) cavities used in accelerator cryomodules. A thorough understanding of the generation and propagation of FE-induced radiation is therefore essential to mitigate this problem. The absence of standardized measurement protocols further complicates the comparison of radiation data across different testing phases and facilities. This highlights the need for a precise quantitative method to diagnose and analyze FE-induced radiation. Such efforts could prove beneficial for improving cavity preparation and cleanroom assembly techniques during the prototype and production stages of Fermilab's Proton Improvement Plan-II (PIP-II) project. This study presents the initial steps of detailed Geant4 simulations aimed at analyzing FE-induced radiation in the low-beta 650 MHz 5-cell elliptical (LB650) cavity. Our goal is to combine these results with radiation diagnostics to enhance diagnostic accuracy and optimize detector positioning. This integrated approach ultimately aims to improve the preparation, assembly, and testing procedures for PIP-II SRF cavities, ensuring the delivery of FE-free cryomodules.",
    "authors": [
      "S. A. K. Wijethunga",
      "A. Sukhanov",
      "O. Napoly",
      "K. McGee"
    ],
    "published": "2025-11-19T00:11:45Z",
    "updated": "2025-11-19T00:11:45Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.14938v1",
    "url": "https://arxiv.org/abs/2511.14938v1",
    "pdf_url": "https://arxiv.org/pdf/2511.14938v1.pdf",
    "title": "Proton specific entropy as a proxy for the $O^{7+}/O^{6+}$ charge state ratio over heliocentric distance",
    "abstract": "While the fast solar wind has well-established origins in coronal holes, the source of the slow solar wind remains uncertain. Compositional metrics, such as heavy ion charge state ratios are set in the lower corona, providing insights into solar wind source regions. However, prior to the launch of Solar Orbiter, in situ measurements of heavy ion charge state were limited to distances of 1 AU and beyond. We investigate proton specific entropy as a proxy for the oxygen charge state ratio ($O^{7+}/O^{6+}$),which generally becomes frozen-in below ~1.8 Rsun, leveraging observations from Solar Orbiter's Heavy Ion Sensor and Proton and Alphas Sensor covering 0.28 to 1 AU. Our analysis confirms a strong anti-correlation between specific entropy and the oxygen charge state ratio that persists over a broad range of distances in the inner heliosphere. We categorize observed solar wind into fast solar wind, slow Alfvenic solar wind, and slow solar wind, identifying clear distinctions in specific entropy values and charge state ratios across these types. The work demonstrates the potential to use proton specific entropy as a classifier of solar wind source regions throughout the heliosphere. By establishing the $S_p$-$O^{7+}/O^{6+}$ relationship and quantifying its radial dependence, the specific entropy can be used as a quantity to identify the solar wind source region in the absence of in-situ charge state measurements. This motivates future studies as to the applicability of this proxy to near-Sun observations (such as Parker Solar Probe) and throughout the inner heliosphere.",
    "authors": [
      "Jack D. Collard",
      "Tamar Ervin",
      "Ryan M. Dewey",
      "Yeimy J. Rivera",
      "Aidan J. Nakhleh",
      "Jean-Baptiste Dakeyo",
      "Samuel T. Badman",
      "Trevor A. Bowen",
      "John W. Bonnell",
      "Nicholeen M. Viall",
      "Susan T. Lepri",
      "Jim M. Raines",
      "Stuart D. Bale"
    ],
    "published": "2025-11-18T21:53:11Z",
    "updated": "2025-11-18T21:53:11Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2511.14894v1",
    "url": "https://arxiv.org/abs/2511.14894v1",
    "pdf_url": "https://arxiv.org/pdf/2511.14894v1.pdf",
    "title": "Redis-Based Streaming Architecture for Accelerator Beam Instrumentation DAQ Systems",
    "abstract": "The Fermilab Acceleraor Division, Beam Instrumentation Department, is always adopting modern and current software methodologies for complex DAQ architectures. This paper highlights the Redis Adapter (RA) as the key software component enabling high performance, modular communication between digitizers and distributed control systems by leveraging Redis and containerization. The RA provides a unified, efficient interface between Redis based data streams and consumer systems. In the legacy architecture, digitized data flowed through the custom, UDP based Distributed Data Communication Protocol in the middle layer. In the current system, DDCP remains the ingestion path, while the RA serves as the decoupling layer. The proposed system replaces old VME digitizers with a SOM-based digitizer that communicates with Redis using the RA. The RA acts as both a performance-critical bridge and a protocol-agnostic adapter, ensuring compatibility with legacy control frameworks while enabling future scalability and modularity. This restructuring of the middle layer also helps the system achieve high throughput, reduce latency, and simplify the data path. Finally, we will demonstrate how RA is utilized in our two core products to deliver both legacy compatibility and future flexibility.",
    "authors": [
      "S. Joshi",
      "D. Steinkamp"
    ],
    "published": "2025-11-18T20:33:32Z",
    "updated": "2025-11-18T20:33:32Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2505.18263v3",
    "url": "https://arxiv.org/abs/2505.18263v3",
    "pdf_url": "https://arxiv.org/pdf/2505.18263v3.pdf",
    "title": "Evidence of Memory Effects in the Dynamics of Two-Level System Defect Ensembles Using Broadband, Cryogenic Transient Dielectric Spectroscopy",
    "abstract": "Two-level system (TLS) defects in dielectrics cause decoherence in superconducting circuits, yet their origin, frequency distribution, and dipole moments remain poorly understood. Current probes, primarily based on qubits or resonators, require complex fabrication and measure defects only within narrow frequency bands and limited mode volumes, restricting insight into TLS behavior in isolated materials and interfaces. We introduce Broadband Cryogenic Transient Dielectric Spectroscopy (BCTDS), a broadband 3D waveguide technique that enables probing of TLS ensembles at cryogenic temperatures. Complementary to the dielectric dipper method, this approach probes a broader spectrum and reveals interference of drive-induced sidebands in TLS ensembles. The broadband, power-tunable nature of BCTDS makes it well suited for studying dressed-state physics in driven TLS ensembles, including multi-photon processes and sideband-resolved dynamics. By analyzing Fourier-transformed time-domain signals, BCTDS reveals eigen-mode frequencies of undriven TLS ensembles through characteristic V-shaped features and uncovers memory effects arising from interactions and broadband excitation. The modular method can be applied throughout device fabrication, informing mitigation strategies and advancing the design of low-loss materials with broad implications for quantum technologies and materials science.",
    "authors": [
      "Qianxu Wang",
      "Sara Magdalena Gómez",
      "Juan S. Salcedo-Gallo",
      "Roy Leibovitz",
      "Jake Freeman",
      "Simon A. Agnew",
      "Salil Bedkihal",
      "William J. Scheideler",
      "Mattias Fitzpatrick"
    ],
    "published": "2025-05-23T18:01:07Z",
    "updated": "2025-11-18T20:10:40Z",
    "categories": [
      "quant-ph",
      "cond-mat.mes-hall",
      "cond-mat.mtrl-sci",
      "physics.ins-det"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2507.12429v2",
    "url": "https://arxiv.org/abs/2507.12429v2",
    "pdf_url": "https://arxiv.org/pdf/2507.12429v2.pdf",
    "title": "Adiabatic Cooling of Planar Motion in a Penning Trap Ion Crystal to Sub-Millikelvin Temperatures",
    "abstract": "Two-dimensional planar ion crystals in a Penning trap are a platform for quantum information science experiments. However, the low-frequency planar modes of these crystals are not efficiently cooled by laser cooling, which can limit the utility of the drumhead modes for quantum information processing. Recently, it has been shown that nonlinear mode coupling can enhance the cooling of the low-frequency planar modes. Here, we demonstrate in numerical simulations that this coupling can be dynamically tuned by adiabatically changing the rotation frequency of the ion crystal during experiments. Furthermore, we show that this technique can, in addition, produce lower temperatures for the low-frequency planar modes via an adiabatic cooling process. This result allows cooling of the planar modes to sub-millikelvin temperatures, resulting in improved spectral resolution of the drumhead modes at experimentally relevant rotation frequencies, which is crucial for quantum information processing applications.",
    "authors": [
      "Wes Johnson",
      "Bryce Bullock",
      "Athreya Shankar",
      "John Zaris",
      "John J. Bollinger",
      "Scott E. Parker"
    ],
    "published": "2025-07-16T17:17:38Z",
    "updated": "2025-11-18T17:34:29Z",
    "categories": [
      "quant-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2511.14643v1",
    "url": "https://arxiv.org/abs/2511.14643v1",
    "pdf_url": "https://arxiv.org/pdf/2511.14643v1.pdf",
    "title": "Real-time time-dependent density functional theory for high-energy density physics",
    "abstract": "Electronic response properties of high-energy density (HED) systems influence planetary structure, drive evolution of fusion targets, and underpin diagnostics in laboratory astrophysics. Real-time time-dependent density functional theory (TDDFT) offers a versatile modeling framework capable of accurately predicting the dynamic response of HED materials -- including free-free, bound-free, and bound-bound contributions without requiring ad hoc state partitioning; capturing both collective and non-collective behavior; and applicable within the linear-response regime and beyond. We review the theoretical formalism of real-time TDDFT as applied to HED systems, provide a practical tutorial for computing relevant response properties (dynamic structure factors, conductivity, and stopping power), and comment on avenues for further development of this powerful computational method in service of HED science.",
    "authors": [
      "Alina Kononov",
      "Minh Nguyen",
      "Andrew D. Baczewski"
    ],
    "published": "2025-11-18T16:33:43Z",
    "updated": "2025-11-18T16:33:43Z",
    "categories": [
      "physics.plasm-ph",
      "cond-mat.mtrl-sci",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.09960v2",
    "url": "https://arxiv.org/abs/2511.09960v2",
    "pdf_url": "https://arxiv.org/pdf/2511.09960v2.pdf",
    "title": "High-throughput Parasitic-independent Probe Thermal Resistance Calibration for Robust Thermal Mapping with Scanning Thermal Microscopy",
    "abstract": "Nanostructured materials, critical for thermal management in semiconductor devices, exhibit a strong size dependence in thermal transport. Specifically, studying the variation of thermal resistance across grain boundaries is of critical importance in designing effective thermal interface materials for heterogeneous integration. Frequency-domain Thermoreflectance (FDTR)-based techniques can provide thermal resistance mapping at the micrometer length scale. Scanning Thermal Microscopy (SThM) has the potential for quantifying local thermal transport with orders of magnitude higher spatial resolution (<100 nm). However, challenges in accurately converting the raw signal to thermal conductivity and accounting for surface sensitivity limit its widespread adoption as a characterization standard for understanding nanoscale heat transport and defect-mediated modulation of thermal properties in nanostructured films. Here, we introduce a circuit-based probe thermal resistance (Rp) calibration technique that is independent of parasitic heat transport pathways; this calibration enables accurate measurement of the heat dissipated from the SThM probe and the resulting tip temperature change to extract the thermal resistance of the film (Rth). Following calibration, SThM achieved sub-100 nm spatial resolution in mapping thermal resistance across a 15 nm-thick Al film deposited by e-beam evaporation on a SiO2 substrate. Finally, the thermal resistance mapping is converted to thermal conductivity using a finite-element-modeling-based calibration approach, where the average of the pixel-level Rth values yields an effective thermal conductivity of 2.87 +/- 0.18 W m^-1 K^-1, in good agreement with published theoretical frameworks describing heat transport in ultrathin Al.",
    "authors": [
      "Ram Munde",
      "Heng-Ray Chuang",
      "Raisul Islam"
    ],
    "published": "2025-11-13T04:42:28Z",
    "updated": "2025-11-18T16:25:52Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.14605v1",
    "url": "https://arxiv.org/abs/2511.14605v1",
    "pdf_url": "https://arxiv.org/pdf/2511.14605v1.pdf",
    "title": "Characterization of a CsI(Tl) Scintillator Coupled to a SiPM at Cryogenic Temperatures",
    "abstract": "We report on the scintillation characterization of a 1 cm^3 CsI(Tl) crystal coupled to a 6 x 6 mm^2 SiPM read out with a custom transimpedance amplifier at cryogenic temperatures. The crystal was prepared with optical-grade surfaces and enclosed in a multi layer shielding system to suppress ambient light and background radiation. The detector response was studied at temperatures ranging from 100 K to room temperature. A figure of merit, defined as the ratio of the 59.5 keV peak position to the baseline resolution, showed a maximum at 175 K, indicating optimal photon detection efficiency. Pulse shape analysis demonstrated temperature-dependent variations in scintillation decay. At 175 K, the baseline resolution was sigma ~ 1 keV, corresponding to an effective threshold of ~ 3 keV. These results confirm the capability of the CsI(Tl) SiPM system to operate at low thresholds for rare-event searches and low-energy particle detection.",
    "authors": [
      "M. Mirzakhani",
      "R. Mahapatra",
      "M. Platt"
    ],
    "published": "2025-11-18T15:55:28Z",
    "updated": "2025-11-18T15:55:28Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  }
]