{
  "arxiv_id": "2502.01542v2",
  "url": "https://arxiv.org/abs/2502.01542v2",
  "pdf_url": "https://arxiv.org/pdf/2502.01542v2.pdf",
  "title": "Towards a Robust Model-Independent Test of the DAMA/LIBRA Dark Matter   Signal: ANAIS-112 Results with Six Years of Data",
  "abstract": "The nature of dark matter, which constitutes 27% of the Universe's matter-energy content, remains one of the most challenging open questions in physics. Over the past two decades, the DAMA/LIBRA experiment has reported an annual modulation in the detection rate of $\\approx$250 kg of NaI(Tl) detectors operated at the Gran Sasso Laboratory, which the collaboration interprets as evidence of the galactic dark matter detection. However, this claim has not been independently confirmed and is refuted under certain dark matter particle and halo model scenarios. Therefore, it is crucial to perform an experiment with the same target material. The ANAIS experiment uses 112.5 kg of NaI(Tl) detectors at the Canfranc Underground Laboratory and it has been collecting data since August 2017 to model-independently test the DAMA/LIBRA result. This article presents the results of the annual modulation analysis corresponding to six years of ANAIS-112 data. Our results, the most sensitive to date with the same target material, NaI(Tl), are incompatible with the DAMA/LIBRA modulation signal at a 4$\\sigma$ confidence level. Such a discrepancy strongly challenges the DAMA/LIBRA dark matter interpretation and highlights the need to address systematic uncertainties affecting the comparison, particularly those related to the response of detectors to nuclear recoils, which may require further characterization of the DAMA crystals.",
  "authors": [
    "Julio Amaré",
    "Jaime Apilluelo",
    "Susana Cebrián",
    "David Cintas",
    "Iván Coarasa",
    "Eduardo García",
    "María Martínez",
    "Ysrael Ortigoza",
    "Alfonso Ortiz de Solórzano",
    "Tamara Pardo",
    "Jorge Puimedón",
    "María Luisa Sarsa",
    "Carmen Seoane"
  ],
  "published": "2025-02-03T17:22:02Z",
  "updated": "2025-07-30T11:18:17Z",
  "categories": [
    "astro-ph.IM",
    "hep-ex",
    "physics.ins-det"
  ],
  "primary_category": "astro-ph.IM"
}