{
  "arxiv_id": "2511.09437v1",
  "url": "https://arxiv.org/abs/2511.09437v1",
  "pdf_url": "https://arxiv.org/pdf/2511.09437v1.pdf",
  "title": "Gyrokinetic Simulations of a Low Recycling Scrape-off Layer without a Lithium Target",
  "abstract": "Low-recycling regimes are appealing because they entail a high edge temperature and low edge density which are good for core confinement. However, due to considerably enhanced heat flux, the exhaust problems become severe. In addition, in the low-recycling regime, the conventional fluid simulations may not capture the physics of the Scrape-Off Layer (SOL) plasma that lies in the long mean free path regime; kinetic calculations become necessary. In this paper, by performing both Kinetic and fluid simulations, we explore the feasibility of a low-recycling regime in the magnetic geometry of the Spherical Tokamak for Energy Production (STEP); kinetic effects come out to be crucial determinants of the SOL dynamics. The simulation results indicate that a high SOL temperature and low SOL density could be achieved even when the divertor target is not made of a low recycling material. This can be done by using a low recycling material as a wall material. This is an important step towards demonstrating the feasibility of a low-recycling scenario. Lithium, a commonly used low recycling material, tends to evaporate at high heat fluxes which counteracts the desired high temperature, low density regime, and materials that can handle high heat fluxes are generally high recycling. Comparisons of gyrokinetic and fluid simulation results indicate that one can take advantage of kinetic effects to address some of the issues associated with a low-recycling SOL. Specifically, kinetic simulations show better confinement of impurities to the divertor region and greater broadening of the heat flux width due to drifts when compared with fluid simulations. Impurity confinement would help prevent core contamination from sputtering, and a broader heat flux width would help reduce the peak heat load at the target in the absence of detachment.",
  "authors": [
    "Akash Shukla",
    "Jonathan Roeltgen",
    "Michael Kotschenreuther",
    "David R. Hatch",
    "Manaure Francisquez",
    "James Juno",
    "Tess N. Bernard",
    "Ammar Hakim",
    "Gregory W. Hammett",
    "Swadesh M. Mahajan"
  ],
  "published": "2025-11-12T15:53:40Z",
  "updated": "2025-11-12T15:53:40Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}