{
  "arxiv_id": "2511.09079v1",
  "url": "https://arxiv.org/abs/2511.09079v1",
  "pdf_url": "https://arxiv.org/pdf/2511.09079v1.pdf",
  "title": "3D PIC simulation and theoretical modeling of RF Laser pulse in magnetized plasma for the generation of multidimensional relativistic Wakefields",
  "abstract": "The present study, investigates the modulation of plasma wakefields in dense magnetized plasma driven by relativistic electron beams under transverse RF excitation. A self consistent theoretical framework, comprising the RF vector potential, Maxwells equations, and relativistic electron motion, is extended through full 3D electromagnetic particle in cell simulations. The results reveal systematic amplification and reshaping of wakefields under the combined action of external magnetic fields and RF drivers. Variations in the cyclotron to plasma frequency ratio dictate the radial positioning and gyromotion of plasma electrons, sharpening transverse confinement and stabilizing blowout structures. The RF amplitude introduces progressive modulation of radial excursions and transverse forces, enhancing wakefield symmetry and depth. Current density distributions confirm the nonlinear scaling with RF strength, evolving from weak perturbations into sharply structured ion channels. Scalar potentials and longitudinal fields exhibit pronounced sensitivity to pulse shape, polarization angle, frequency ratio, and driver density, each parameter producing distinct oscillatory features and confinement regimes. Plasma density sets the field strength and radial localization, while the modulation parameter governs the emergence of fine scale oscillatory bands, producing smooth to multiband transitions in longitudinal electric fields. Across all conditions, simulations confirm the reinforcement of ponderomotive force, resulting in controlled narrowing of electron sheaths, sharper scalar potential gradients, and extended acceleration zones.",
  "authors": [
    "A. A. Molavi Choobini",
    "M. Shahmansouri"
  ],
  "published": "2025-11-12T07:56:11Z",
  "updated": "2025-11-12T07:56:11Z",
  "categories": [
    "physics.plasm-ph",
    "physics.acc-ph",
    "physics.comp-ph"
  ],
  "primary_category": "physics.plasm-ph"
}