{
  "arxiv_id": "2511.10174v1",
  "url": "https://arxiv.org/abs/2511.10174v1",
  "pdf_url": "https://arxiv.org/pdf/2511.10174v1.pdf",
  "title": "M3Scope a 3D multimode multiplane microscope for imaging nanoscale dynamics in soft matter",
  "abstract": "Fast, volumetric imaging that integrates multiple imaging modalities is essential for probing dynamic, heterogeneous soft and biological matter. Here, we present the M3Scope, a simple yet versatile multiplane microscope that extends widefield detection with a modular multimode cube to enable dual color fluorescence, polarization-resolved, and correlative brightfield fluorescence imaging while (i) preserving simultaneous 3D acquisition at high frame rates (100 fps) and (ii) requiring minimal realignment. We demonstrate its potential by investigating polymer dynamics across multiple spatial and temporal scales. In an acrylamide type polymerizing network, dual color tracking of 100 nm and 300 nm fluorescent probes revealed size dependent viscosities diverging from 15 mPa.s to 40 mPa.s after gelation. Polarization resolved rotational tracking of gold bipyramids yielded viscosities within 10 percent of theoretical values in 80 to 95 percent glycerol and remained accurate in the high-viscosity regime (bigger than 400 mPa.s) where translational motion is undetectable. Fluorescence brightfield imaging correlated structural changes during poly(isopropyl acrylamide) (pNIPAM) phase separation as well as variations in tracer diffusivity, linking morphology and dynamics in 3D. Taken together, these results show that the M3Scope delivers high speed volumetric imaging with flexible modality switching, providing a powerful platform for studying dynamic, heterogeneous systems across disciplines, from polymer physics to cell mechanobiology.",
  "authors": [
    "Steven Huysecom",
    "Francisco Bevilacqua",
    "Roger Bresoli Obach",
    "Sudipta Seth",
    "Luis M. Liz-Marzan",
    "Dagmar R. D hooge",
    "Johan Hofkens",
    "Susana Rocha",
    "Boris Louis"
  ],
  "published": "2025-11-13T10:38:42Z",
  "updated": "2025-11-13T10:38:42Z",
  "categories": [
    "physics.optics",
    "cond-mat.soft",
    "physics.ins-det"
  ],
  "primary_category": "physics.optics"
}