{
  "arxiv_id": "2511.09442v2",
  "url": "https://arxiv.org/abs/2511.09442v2",
  "pdf_url": "https://arxiv.org/pdf/2511.09442v2.pdf",
  "title": "An ultrafast plenoptic-camera system for high-resolution 3D particle tracking in unsegmented scintillators",
  "abstract": "Detectors deployed in high-resolution neutrino experiments, particle calorimetry, or dark matter candidate searches require dense and massive active materials and, in some cases, extremely fine segmentation. This is essential for achieving precise three-dimensional tracking of the interaction products and enabling accurate particle-flow reconstruction. Organic scintillator detectors, for example, in the form of scintillating fibres, offer sub-millimetre spatial and sub-nanosecond temporal resolution. However, such systems introduce significant challenges in construction and demand a large number of readout electronics channels, leading to extremely high costs that are difficult to mitigate. In this article, we propose a paradigm shift in the detection of elementary particles that leads to ultrafast three-dimensional high-resolution imaging in large volumes of unsegmented scintillator. The key enabling technologies are plenoptic systems and time-resolving single-photon avalanche diode (SPAD) array imaging sensors. Together, they allow us, for the first time ever with a plenoptic camera, the reconstruction of the origin of single photons in the scintillator, thereby facilitating an event-by-event analysis. A case study focused on neutrino detection demonstrates the unique potential of this approach, achieving full event reconstruction with a spatial resolution on the order of two hundred micrometres. This work paves the way for a new class of particle scintillator-based detectors, whose capabilities should be further enhanced through future developments and expanded to Cherenkov light detection and calorimetry at collider neutrino experiments, searches for neutrinoless double beta decay, as well as applications such as medical imaging and fast neutron detection.",
  "authors": [
    "Till Dieminger",
    "Saúl Alonso-Monsalve",
    "Christoph Alt",
    "Claudio Bruschini",
    "Noemi Bührer",
    "Edoardo Charbon",
    "Kodai Kaneyasu",
    "Tim Weber",
    "Davide Sgalaberna"
  ],
  "published": "2025-11-12T15:56:55Z",
  "updated": "2025-11-13T14:35:03Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}