{
  "arxiv_id": "2504.18312v3",
  "url": "https://arxiv.org/abs/2504.18312v3",
  "pdf_url": "https://arxiv.org/pdf/2504.18312v3.pdf",
  "title": "A Multispacecraft Analysis and Modeling of Type III Radio Burst Exciter   Deceleration in Inhomogeneous Heliospheric Plasma",
  "abstract": "Electron beams accelerated in solar flares and escaping from the Sun along open magnetic field lines can trigger intense radio emissions known as type III solar radio bursts. Utilizing observations by Parker Solar Probe (PSP), STEREO-A (STA), Solar Orbiter (SolO), and Wind spacecrafts, the speeds and accelerations of type III exciters are derived for simple and isolated type III solar bursts. For the first time, simultaneous four spacecraft observations allow to determine positions, and correct the resulting velocities and accelerations for the location between the spacecraft and the apparent source. We observe velocities and acceleration to change as $u(r) \\propto r^{-0.37 \\pm 0.14}$ and $a(r) \\propto r^{-1.71 \\pm 0.20}$ with radial distance from the Sun $r$. To explain the electron beam deceleration, we develop a simple gas-dynamic description of the electron beam moving through plasma with monotonically decreasing density. The model predicts that the beam velocity decreases as $u(f)\\propto f^{1/4}(r)$, so the acceleration changes $\\propto r^{-1.58}$ (and speed as $\\propto r^{-0.29}$) for the plasma density profile $n(r)\\propto r^{-2.3}$. The deceleration is consistent with the average observation values corrected for the type III source locations. Intriguingly, the observations also show differences in velocity and acceleration of the same type III observed by different spacecrafts. We suggest the difference could be related to the additional time delay caused by radio-wave scattering between the spacecraft and the source.",
  "authors": [
    "Francesco Azzollini",
    "Eduard P. Kontar"
  ],
  "published": "2025-04-25T12:39:29Z",
  "updated": "2025-10-01T15:51:04Z",
  "categories": [
    "astro-ph.SR",
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.SR"
}