{
  "arxiv_id": "2509.26266v1",
  "url": "https://arxiv.org/abs/2509.26266v1",
  "pdf_url": "https://arxiv.org/pdf/2509.26266v1.pdf",
  "title": "Design and Evaluation of CZT-based Micro-activity Dose Calibrator for   TAT Application using Monte Carlo Simulation",
  "abstract": "A novel CZT-based micro-activity dose calibrator has been designed via Monte Carlo simulation (GATE) to accurately measure low-level activity 225Ac for targeted alpha therapy (TAT) application. Because even small overdoses in TAT can induce severe local toxicity, activities in the microcurie down to nanocurie regime are often required, and accurate activity measurement by dose calibrators is a priori to safe and effective treatment. Standard dose calibrators, or high-pressurized gas-filled ionization chambers, are not suitable in this range due to limited sensitivity and lack of energy discrimination. To address this, we designed a CZT-based micro-activity calibrator that (i) adopts a box-shaped well geometry to obtain higher solid-angle coverage and (ii) applies time-coincident pixel-level clustering to recover full-energy-peak net counts otherwise lost to multi-site Compton scattering. Using GATE, serial dilutions from 1.0 uCi down to 1e-6 uCi were simulated, activities were reconstructed from the 218 and 440 keV gamma peaks and performance was compared against a NaI(Tl) well counter, which serves as an alternative to standard dose calibrator. Across six orders of magnitude, the CZT-based micro-activity dose calibrator exhibited near-unity linearity (slope m=0.9934) with percent-level bias, whereas the NaI(Tl) counter showed systematic under-response under identical conditions. These results indicate that a CZT-based approach can provide accurate low-activity quantification for TAT, motivating forthcoming hardware validation.",
  "authors": [
    "Seoyun Jang",
    "Robin Peter",
    "Biswajit Das",
    "Youngho Seo",
    "Gyuseong Cho"
  ],
  "published": "2025-09-30T13:53:00Z",
  "updated": "2025-09-30T13:53:00Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}