{
  "arxiv_id": "2510.01060v1",
  "url": "https://arxiv.org/abs/2510.01060v1",
  "pdf_url": "https://arxiv.org/pdf/2510.01060v1.pdf",
  "title": "Do plasmoids induce fast magnetic reconnection in well-resolved current   sheets in 2D MHD simulations?",
  "abstract": "We investigate the development of tearing-mode instability using the highest resolution two-dimensional magnetohydrodynamic simulations of reconnecting current sheets on a uniform grid, for Lundquist numbers $10^3 \\le S \\le 2 \\times 10^5$. Although the tearing-mode instability is commonly thought to trigger a plasmoid cascade that enables fast reconnection - i.e., independent of $S$ - our results, in broad agreement with the recent findings of Morillo \\& Alexakis (2025), challenge this belief. We demonstrate a Sweet-Parker scaling of the reconnection rate $V_{\\text{rec}} \\sim S^{-1/2}$ up to Lundquist numbers $S \\sim 10^4$. For larger values, plasmoid formation sets in leading to a slight enhancement of the reconnection rate, $V_{\\text{rec}} \\sim S^{-1/3}$, consistent with the prediction from linear tearing mode induced reconnection, indicating that reconnection remains resistivity dependent, and therefore slow. In our simulations, the plasmoids do not form a cascade of mergers, as they are rapidly advected out of the reconnection layer. Our findings call for the revision of the role of plasmoid formation in 2D high Lundquist number magnetic reconnection. Even if future studies demonstrate that 2D plasmoid-reconnection becomes resistivity-independent at sufficiently large $S$, directly extending those results to 3D astrophysical environments is not justified, as in realistic circumstances, the increase of $S$ also raises the Reynolds number of the outflows, making it essential to account for the dominant role of turbulence.",
  "authors": [
    "G. H. Vicentin",
    "G. Kowal",
    "E. M. de Gouveia Dal Pino",
    "A. Lazarian"
  ],
  "published": "2025-10-01T16:00:23Z",
  "updated": "2025-10-01T16:00:23Z",
  "categories": [
    "physics.plasm-ph",
    "astro-ph.HE",
    "hep-th"
  ],
  "primary_category": "physics.plasm-ph"
}