{
  "arxiv_id": "2510.00176v1",
  "url": "https://arxiv.org/abs/2510.00176v1",
  "pdf_url": "https://arxiv.org/pdf/2510.00176v1.pdf",
  "title": "The Simons Observatory: Characterization of All DC/RF Routing Wafers for   Detector Modules",
  "abstract": "The Simons Observatory (SO) is a cosmic microwave background experiment with over 67,000 polarization-sensitive transition-edge sensor (TES) detectors currently installed for use in observations and plans to increase the total detector count to ${\\sim}$98,000 detectors with the Advanced SO upgrade. The TES arrays are packaged into Universal Focal-Plane Modules (UFMs), which also contain the multiplexing readout circuit. Within a readout module, a DC/RF routing wafer provides a cold interface between the detectors and the readout multiplexing chips. Each routing wafer hosts twelve bias lines, which contain the ${\\sim}$400 ${\\mu}{\\Omega}$ shunt resistors that are part of the TES bias circuitry. More than 70 routing wafers have been fabricated and tested both at room temperature and 100 mK before integration into UFMs. The lab measurements for all screened wafers have been compiled to show the distribution of measured average shunt resistance Rsh for each bias line, both across bias lines on a single routing wafer and across all routing wafers. The mean average shunt resistance for all wafers was found to be 396 ${\\mu}{\\Omega}$ with a standard deviation of 16 ${\\mu}{\\Omega}$, or ${\\sim}$4%. For each wafer, we note good uniformity of average Rsh between bias lines, with a slight downward trend with increasing distance from the center of the wafer. The fabrication data collected at room temperature shows agreement with the cryogenic measurements of Rsh distribution.",
  "authors": [
    "Alicia Middleton",
    "Kyuyoung Bae",
    "Cody J. Duell",
    "Shannon M. Duff",
    "Erin Healy",
    "Zachary B. Huber",
    "Johannes Hubmayr",
    "Ben Keller",
    "Lawrence T. Lin",
    "Michael J. Link",
    "Tammy J. Lucas",
    "Michael D. Niemack",
    "Eve M. Vavagiakis",
    "Yuhan Wang"
  ],
  "published": "2025-09-30T18:54:06Z",
  "updated": "2025-09-30T18:54:06Z",
  "categories": [
    "astro-ph.IM",
    "physics.ins-det"
  ],
  "primary_category": "astro-ph.IM"
}