{
  "arxiv_id": "2512.21279v1",
  "url": "https://arxiv.org/abs/2512.21279v1",
  "pdf_url": "https://arxiv.org/pdf/2512.21279v1.pdf",
  "title": "Multivariate scaling of proton and ion energies, divergence, and charge states in Target Normal Sheath Acceleration",
  "abstract": "The interaction of an intense laser pulse with a solid target produces energetic proton and ion beams through the Target Normal Sheath Acceleration (TNSA) mechanism. Such beams are under active investigation for applications in proton beam therapy, materials modification, and nuclear and high-energy-density physics. Despite extensive experimental and theoretical effort, predictive correlations between laser and target parameters and the resulting ion-beam properties remain an open research question, owing to the intrinsically multiphysics and strongly coupled nature of laser-plasma interactions. Here, we employ our unified multiphysics model that reproduces laser-solid interaction dynamics with accuracy exceeding 95% over a broad range of short- and ultrashort-pulse conditions. Using this model, we derive statistically validated scaling laws and probability maps that correlate proton, carbon, and oxygen ion cutoff energies, beam divergences, and ionization states to a wide set of laser and target parameters, including pulse duration, laser power, laser beam spot, target thickness, prepulse-main pulse interval, contrast, laser wavelength, and polarization. Continuous beam properties (cutoff energies and beam divergences) are described using multivariate regression with cross-validation, while discrete ionization states are analyzed using classification and regression tree (CART) methods, enabling nonlinear and threshold-dependent behavior to be captured. The resulting scaling relations, contour maps, and box plots elucidate the coupled roles of laser pulse, and target geometry in governing TNSA ion acceleration and charge-state formation. These results provide a predictive and physically interpretable framework for understanding and optimizing laser-driven ion sources across a wide parameter space.",
  "authors": [
    "Vasiliki E. Alexopoulou"
  ],
  "published": "2025-12-24T16:58:25Z",
  "updated": "2025-12-24T16:58:25Z",
  "categories": [
    "physics.plasm-ph",
    "physics.acc-ph",
    "physics.optics"
  ],
  "primary_category": "physics.plasm-ph"
}