{
  "arxiv_id": "2512.21974v1",
  "url": "https://arxiv.org/abs/2512.21974v1",
  "pdf_url": "https://arxiv.org/pdf/2512.21974v1.pdf",
  "title": "Revealing the transient ionization dynamics and mode-coupling mechanisms of helicon discharge through a self-consistent multiphysics model",
  "abstract": "Helicon plasma sources play a central role in applications ranging from material treatment to space propulsion and fusion, yet the physical processes governing their ignition, transient ionization, and mode evolution remain incompletely understood. Here we develop a self-consistent, fully coupled multiphysics framework that integrates Maxwell equations, electron energy transport, drift-diffusion kinetics, and heavy-species chemistry to capture the complete spatiotemporal evolution of helicon discharges. The model reproduces experimental measurements across pressure, magnetic field, and frequency ranges, and reveals a previously unresolved transient ionization stage characterized by a rapid density rise within ~10-4 s, accompanied by a two-peak electron temperature structure that governs the formation of the dense plasma core. By tracking the RF power flow and field topology, we characterize the transient redistribution of RF energy during ignition. A short-lived phase of localized energy deposition accompanies the onset of ionization, followed by an evolution toward helicon-like field characteristics together with rapid density growth and profile restructuring. Systematic parametric scans further reveal the sensitivity of this mode-coupling process to gas pressure, magnetic field strength, and driving frequency. These results provide a unified picture of the ignition and mode-transition physics in helicon plasmas and establish a predictive tool for the design and optimization of RF plasma sources across space propulsion, manufacturing, and fusion technologies.",
  "authors": [
    "Jing-Jing Ma",
    "Lei Chang",
    "Ming-Yang Wu",
    "Hua Zhou",
    "Yi-Wei Zhang",
    "Ilya Zadiriev",
    "Elena Kralkina",
    "Shogo Isayama",
    "Shin-Jae You"
  ],
  "published": "2025-12-26T10:39:23Z",
  "updated": "2025-12-26T10:39:23Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}