{
  "arxiv_id": "2508.16349v1",
  "url": "https://arxiv.org/abs/2508.16349v1",
  "pdf_url": "https://arxiv.org/pdf/2508.16349v1.pdf",
  "title": "Identification of Nonlinear Damping of Transverse Loop Oscillations by   KHI-induced Turbulence",
  "abstract": "Kink oscillations in coronal loops have been extensively studied for their potential contributions to coronal heating and their role in plasma diagnostics through coronal seismology. A key focus is the strong damping of large-amplitude kink oscillations, which observational evidence suggests is nonlinear. However, directly identifying the nonlinearity is a challenge. This work presents an analytic formula describing nonlinear standing kink oscillations dissipated by turbulence, characterised by a time-varying damping rate and period drift. We investigate how the damping behaviour depends on the driving amplitude and loop properties, showing that the initial damping time $\\tau$ is inversely proportional to the velocity disturbance over the loop radius, $V_i/R$. Using MCMC fitting with Bayesian inference, the nonlinear function better fits an observed decaying kink oscillation than traditional linear models, including exponential damping, suggesting its nonlinear nature. By applying a Bayesian model comparison, we establish regimes in which nonlinear and linear resonant absorption mechanisms dominate based on the relationship between the damping rate $\\tau/P$ and $V_i/R$. Additionally, analysis of two specific events reveals that while one favours the nonlinear model, the other is better explained by the linear model. Our results suggest that this analytical approximation of nonlinear damping due to turbulence provides a valid and reliable description of large-amplitude decaying kink oscillations in coronal loops.",
  "authors": [
    "Sihui Zhong",
    "Andrew Hillier",
    "Iñigo Arregui"
  ],
  "published": "2025-08-22T12:41:55Z",
  "updated": "2025-08-22T12:41:55Z",
  "categories": [
    "astro-ph.SR",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.SR",
  "doi": "10.3847/1538-4357/adfd5c"
}