{
  "arxiv_id": "2508.16324v1",
  "url": "https://arxiv.org/abs/2508.16324v1",
  "pdf_url": "https://arxiv.org/pdf/2508.16324v1.pdf",
  "title": "A two-prong Approach to the Simulation of DC-RSD: TCAD and Spice",
  "abstract": "The DC-coupled Resistive Silicon Detectors (DCRSD) are the evolution of the AC-coupled RSD (RSD) design, both based on the Low-Gain Avalanche Diode (LGAD) technology. The DC-RSD design concept intends to address a few known issues present in RSDs (e.g., baseline fluctuation, long tail-bipolar signals) while maintaining their advantages (e.g., signal spreading, 100% fill factor). The simulation of DC-RSD presents several unique challenges linked to the complex nature of its design and the large pixel size. The defining feature of DC-RSD, charge sharing over distances that can be as large as a millimeter, represents a formidable challenge for Technology-CAD (TCAD), the standard simulation tool. To circumvent this problem, we have developed a mixed-mode approach to the DC-RSD simulation, which exploits a combination of two simulation tools: TCAD and Spice. Thanks to this hybrid approach, it has been possible to demonstrate that, according to the simulation, the key features of the RSD, excellent timing and spatial resolutions (few tens of picoseconds and few microns), are maintained in the DC-RSD design. In this work, we present the developed models and methodology, mainly showing the results of device-level numerical simulation, which have been obtained with the state-of-the-art Synopsys Sentaurus TCAD suite of tools. Such results will provide all the necessary information for the first batch of DC-RSD produced by Fondazione Bruno Kessler (FBK) foundry in Trento, Italy.",
  "authors": [
    "T. Croci",
    "L. Menzio",
    "R. Arcidiacono",
    "M. Arneodo",
    "P. Asenov",
    "N. Cartiglia",
    "M. Ferrero",
    "A. Fondacci",
    "V. Monaco",
    "A. Morozzi",
    "F. Moscatelli",
    "R. Mulargia",
    "E. Robutti",
    "V. Sola",
    "D. Passeri"
  ],
  "published": "2025-08-22T12:12:35Z",
  "updated": "2025-08-22T12:12:35Z",
  "categories": [
    "hep-ex",
    "physics.ins-det"
  ],
  "primary_category": "hep-ex"
}