{
  "arxiv_id": "2508.17443v1",
  "url": "https://arxiv.org/abs/2508.17443v1",
  "pdf_url": "https://arxiv.org/pdf/2508.17443v1.pdf",
  "title": "Pulsed laser synthesis of mesoporous metal chalcogenide thin films",
  "abstract": "Mesoporous films of the metal chalcogenide $\\beta$-FeSe were grown on MgO substrates by KrF pulsed laser deposition (PLD) in an argon background. At 100 mTorr, gated intensified charge-coupled device imaging and ion probe measurements showed that the plasma plume responsible for crystal growth initially comprised three components, with distinct expansion velocities. Plume interactions with the substrate heater and ablation target gave rise to complex dynamics, including collisions between the charged leading edge -- rebounding between the substrate and the target -- and slower-moving species in the plume interior. Film growth was dominated by species with kinetic energies $\\le$0.5 eV/atom. X-ray reflectivity and atomic force microscopy revealed that films grown in this environment -- with a substrate temperature of 350$^\\circ$C, a laser fluence of 1.0 J cm$^{-2}$, and a 7.5 mm$^2$ spot area -- formed a porous framework with 15% porosity and pore sizes below 100 nm. X-ray diffraction indicated that the porous films were epitaxial with respect to the substrate and likely grew by oriented-attachment of gas-phase molecular clusters or very small nanoparticles, in contrast to the conventional epitaxy of vacuum films from atomic constituents. The in-plane orientation of the mesoporous films was $\\beta$-FeSe[100]$\\parallel$[110]MgO, attributed to the soft landing of pre-formed crystallites on the MgO substrates, where protruding Se rows of $\\beta$-FeSe aligned with corrugations of the MgO surface. This work implies that growth of candidate electrocatalyst materials by PLD in inert gas background may allow mesoporous frameworks with a single crystallographic orientation that expose specific crystal facets for electrochemical reactions and active site engineering.",
  "authors": [
    "Dorien E. Carpenter",
    "Zahra Nasiri",
    "Nithesh R. Palagiri",
    "Kamron L. Strickland",
    "Sumner B. Harris",
    "David B. Geohegan",
    "Renato P. Camata"
  ],
  "published": "2025-08-24T16:46:39Z",
  "updated": "2025-08-24T16:46:39Z",
  "categories": [
    "cond-mat.mtrl-sci",
    "physics.plasm-ph"
  ],
  "primary_category": "cond-mat.mtrl-sci"
}