{
  "arxiv_id": "2508.16953v1",
  "url": "https://arxiv.org/abs/2508.16953v1",
  "pdf_url": "https://arxiv.org/pdf/2508.16953v1.pdf",
  "title": "Optics for broadband x-ray ptychography",
  "abstract": "In conventional x-ray ptychography, diffraction data is collected by scanning a sample through a monochromatic, and spatially coherent, x-ray beam. A high-resolution image is then retrieved using an iterative algorithm. Combined with a scan of the incident photon energy, it is also possible to access chemical and elemental information. Although powerful, the high brilliance required currently constrains the method to 3rd and 4th generation synchrotron sources and long scanning times. An alternative approach is to use a broadband illumination in combination with an energy resolving detector. These detectors record the data in a series of energy channels simultaneously, creating a stack of coherent data suitable for a ptychographic reconstruction. This approach promises to unlock the full power of the radiation source and provide spectral imaging at a higher rate and in a single acquisition. However, these detectors currently saturate well below reaching the flux rates produced at synchrotrons, which is preventing the uptake of this approach. Furthermore, current monochromatic synchrotron setups typically employ Fresnel zone plates for pre-sample focusing due to their stability, flexibility, and affordability, but these diffractive optics limit the spectral bandwidth that the setup can accept. In this article, we analyze the problem and consider alternative optics that can both maximize the total photon detection rates and broaden the tolerable bandwidth. Broadband x-ray ptychography has the potential to dramatically reduce data collection times at synchrotron sources, but also to harness the full power of lower brilliance sources and transition x-ray ptychography into a laboratory technique.",
  "authors": [
    "Wiebe Stolp",
    "Silvia Cipiccia",
    "Darren Batey",
    "Matthieu Boone"
  ],
  "published": "2025-08-23T08:56:00Z",
  "updated": "2025-08-23T08:56:00Z",
  "categories": [
    "physics.optics",
    "physics.ins-det"
  ],
  "primary_category": "physics.optics",
  "doi": "10.1063/5.0274044"
}