{
  "arxiv_id": "2602.17606v1",
  "url": "https://arxiv.org/abs/2602.17606v1",
  "pdf_url": "https://arxiv.org/pdf/2602.17606v1.pdf",
  "title": "Characterization of compressible fluctuations in solar wind streams dominated by balanced and imbalanced turbulence: Parker Solar Probe, Solar Orbiter and Wind observations",
  "abstract": "Characterizing compressible fluctuations in the solar wind is essential for understanding their role in solar wind acceleration and heating, yet their origin and evolution across different turbulence regimes remain poorly understood. In this study, we carry out a statistical analysis of the properties of compressible fluctuations in solar wind dominated by balanced and imbalanced turbulence. Using in-situ measurements from Wind, Solar Orbiter, and Parker Solar Probe, we investigate the scale dependence of density and magnetic field fluctuations and their correlations with plasma beta and radial distance. Our results indicate that solar wind compressibility is likely affected by both expansion effects and compressible dynamics governed by local plasma conditions. The non-Alfvenic wind is dominated by anti-correlated fluctuations, whereas the Alfvenic wind contains a mixture of correlated and anti-correlated fluctuations, though the latter remain prevalent. While the anti-correlated component is consistent with MHD slow magnetosonic modes, the correlated (fast mode-like) component is not reproduced by predictions from either linear MHD theory or nonlinear models of forced compressible fluctuations. Nevertheless, the dominant slow mode component explains the observed dependence on beta and the enhanced density fluctuations measured by Parker Solar Probe. This further suggests that slow mode waves contribute significantly to the compressible energy budget near the Sun and may play an important role in solar wind heating and acceleration close to the Sun.",
  "authors": [
    "C. A. Gonzalez",
    "C. Gonzalez",
    "A. Tenerani"
  ],
  "published": "2026-02-19T18:31:00Z",
  "updated": "2026-02-19T18:31:00Z",
  "categories": [
    "physics.plasm-ph",
    "astro-ph.SR",
    "physics.space-ph"
  ],
  "primary_category": "physics.plasm-ph"
}