{
  "arxiv_id": "2504.01525v4",
  "url": "https://arxiv.org/abs/2504.01525v4",
  "pdf_url": "https://arxiv.org/pdf/2504.01525v4.pdf",
  "title": "Rapid muon tomography for border security",
  "abstract": "Cosmic-ray muon tomography is a promising technique for border security applications, leveraging highly penetrating cosmic-ray muons and their interactions with various materials to generate 3D images of large and dense objects, such as shipping containers. Using scattering and absorption of muons as they pass through dense cargo materials, muon tomography provides a viable solution for customs and border security by enabling the verification of shipping container declarations and preventing illegal trafficking. In this study, we utilized Monte Carlo simulations to evaluate the effectiveness of muon tomography for cargo characterization and contraband detection in various smuggling scenarios. Our results demonstrate that muon tomography can offers a novel approach to cargo inspection, moving beyond traditional 3D image reconstruction. Instead, it analyzes muon scattering and absorption rates in real time during scanning, enabling the prompt detection of discrepancies between actual cargo contents and declared goods within just 10 to 20 seconds. This method is particularly effective for cargo consisting of uniform loads composed of a single material or product, a common practice in shipping. Unlike traditional X-ray radiography, which analyzes detailed 2D images, muon tomography begins evaluating scatter-absorption rates within the first few seconds of scanning. This early assessment enables cargo evaluation long before a statistically reliable 3D image is formed, significantly improving scanning throughput without disrupting trade flow.",
  "authors": [
    "Anzori Sh. Georgadze"
  ],
  "published": "2025-04-02T09:12:31Z",
  "updated": "2025-09-24T10:16:21Z",
  "categories": [
    "physics.app-ph",
    "physics.ins-det"
  ],
  "primary_category": "physics.app-ph"
}