{
  "arxiv_id": "2509.20094v1",
  "url": "https://arxiv.org/abs/2509.20094v1",
  "pdf_url": "https://arxiv.org/pdf/2509.20094v1.pdf",
  "title": "Studies on Response Uniformity of RPC and Exploring Oscillation Dip and   Valley, Non-Standard Interactions, and Earth's Core using Atmospheric   Neutrinos at ICAL-INO detector",
  "abstract": "In this thesis, experimental and physics simulation studies are performed in the context of the proposed 50 kt Iron Calorimeter (ICAL) detector at the India-based Neutrino Observatory (INO). ICAL would detect atmospheric muon neutrinos and antineutrinos separately in the multi-GeV range of energies over a wide range of baselines. In the experimental part of the thesis, the effect of the non-uniformity of the graphite layer on the detector response of the resistive plate chamber is studied. In the physics simulation part, it is demonstrated for the first time that the neutrino oscillation dip and valley can be observed at ICAL using the up/down ratio of reconstructed muons and antimuons separately. A method is formulated such that the location of the dip and the alignment of the valley can be used to measure an atmospheric oscillation parameter called the mass-squared difference. Further, a new approach is proposed to probe the neutral-current non-standard interactions (NSIs) using the oscillation dip and valley. The opposite shifts in the oscillation dips and the contrast in the curvatures of oscillation valleys for reconstructed muons and antimuons are used to constrain the NSI parameter in two separate ways. While passing through the Earth, the upward-going atmospheric neutrinos experience the matter effects, which modify the neutrino oscillation patterns. These matter effects depend upon the density of electrons inside Earth and can be used to perform the neutrino oscillation tomography of Earth, complementary to gravitational measurements and seismic studies. This work demonstrates that the presence of Earth's core can be validated using the atmospheric neutrinos at ICAL.",
  "authors": [
    "Anil Kumar"
  ],
  "published": "2025-09-24T13:15:33Z",
  "updated": "2025-09-24T13:15:33Z",
  "categories": [
    "hep-ph",
    "hep-ex",
    "physics.ins-det"
  ],
  "primary_category": "hep-ph"
}