{
  "arxiv_id": "2507.19668v3",
  "url": "https://arxiv.org/abs/2507.19668v3",
  "pdf_url": "https://arxiv.org/pdf/2507.19668v3.pdf",
  "title": "Exploring the fusion power plant design space: comparative analysis of positive and negative triangularity tokamaks through optimization",
  "abstract": "The optimal configuration choice between positive triangularity (PT) and negative triangularity (NT) tokamaks for fusion power plants hinges on navigating different operational constraints rather than achieving specific plasma performance metrics. This study presents a systematic comparison using constrained multi-objective optimization with the integrated FUsion Synthesis Engine (FUSE) framework. Over 200,000 integrated design evaluations were performed exploring the trade-offs between capital cost minimization and operational reliability (maximizing $q_{95}$) while satisfying engineering constraints including 250 $\\pm$ 50 MW net electric power, tritium breeding ratio $>$1.1, power exhaust limits and an hour flattop time. Both configurations achieve similar cost-performance Pareto fronts through contrasting design philosophies. PT, while demonstrating resilience to pedestal degradation (compensating for up to 40% reduction), are constrained to larger machines ($R_0$ $>$ 6.5 m) by the narrow operational window between L-H threshold requirements and the research-established power exhaust limit ($P_{sol}/R$ $<$ 15 MW/m). This forces optimization through comparatively reduced magnetic field ($\\sim$8T). NT configurations exploit their freedom from these constraints to access compact, high-field designs ($R_0 \\sim 5.5$ m, $B_0$ $>$ 12 T), creating natural synergy with advancing HTS technology. Sensitivity analyses reveal that PT's economic viability depends critically on uncertainties in L-H threshold scaling and power handling limits. Notably, a 50% variation in either could eliminate viable designs or enable access to the compact design space. These results suggest configuration selection should be risk-informed: PT offers the lowest-cost path when operational constraints can be confidently predicted, while NT is robust to large variations in constraints and physics uncertainties.",
  "authors": [
    "T. Slendebroek",
    "A. O. Nelson",
    "O. M. Meneghini",
    "G. Dose",
    "A. G. Ghiozzi",
    "J. Harvey",
    "B. C. Lyons",
    "J. McClenaghan",
    "T. F. Neiser",
    "D. B. Weisberg",
    "M. G. Yoo",
    "E. Bursch",
    "C. Holland"
  ],
  "published": "2025-07-25T20:46:43Z",
  "updated": "2026-01-06T19:26:10Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": "10.1088/1741-4326/ae27e6"
}