{
  "arxiv_id": "2601.04354v1",
  "url": "https://arxiv.org/abs/2601.04354v1",
  "pdf_url": "https://arxiv.org/pdf/2601.04354v1.pdf",
  "title": "Ultra-sensitive graphene-based electro-optic sensors for optically-multiplexed neural recording",
  "abstract": "Large-scale neural recording with high spatio-temporal resolution is essential for understanding information processing in brain, yet current neural interfaces fall far short of comprehensively capturing brain activity due to extremely high neuronal density and limited scalability. Although recent advances have miniaturized neural probes and increased channel density, fundamental design constraints still prevent dramatic scaling of simultaneously recorded channels. To address this limitation, we introduce a novel electro-optic sensor that directly converts ultra-low-amplitude neural electrical signals into optical signals with high signal-to-noise ratio. By leveraging the ultra-high bandwidth and intrinsic multiplexing capability of light, this approach offers a scalable path toward massively parallel neural recording beyond the limits of traditional electrical interfaces. The sensor integrates an on-chip photonic microresonator with a graphene layer, enabling direct detection of neural signals without genetically encoded optical indicators or tissue modification, making it suitable for human translation. Neural signals are locally transduced into amplified optical modulations and transmitted through on-chip waveguides, enabling interference-free recording without bulky electromagnetic shielding. Arrays of wavelength-selective sensors can be multiplexed on a single bus waveguide using wavelength-division multiplexing (WDM), greatly improving scalability while maintaining a minimal footprint to reduce tissue damage. We demonstrate detection of evoked neural signals as small as 25 $μ$V with 3 dB SNR from mouse brain tissue and show multiplexed recording from 10 sensors on a single waveguide. These results establish a proof-of-concept for optically multiplexed neural recording and point toward scalable, high-density neural interfaces for neurological research and clinical applications.",
  "authors": [
    "Zabir Ahmed",
    "Xiang Li",
    "Kanika Sarna",
    "Harshvardhan Gupta",
    "Vishal Jain",
    "Maysamreza Chamanzar"
  ],
  "published": "2026-01-07T19:39:05Z",
  "updated": "2026-01-07T19:39:05Z",
  "categories": [
    "physics.optics",
    "eess.SY",
    "physics.ins-det"
  ],
  "primary_category": "physics.optics"
}