{
  "arxiv_id": "2601.03818v1",
  "url": "https://arxiv.org/abs/2601.03818v1",
  "pdf_url": "https://arxiv.org/pdf/2601.03818v1.pdf",
  "title": "Modelling spacecraft-emitted electrons measured by SWA-EAS experiment on board Solar Orbiter mission",
  "abstract": "Thermal electron measurements in space plasmas typically suffer at low energies from spacecraft emissions of photo- and secondary electrons and from charging of the spacecraft body. We examine these effects by use of numerical simulations in the context of electron measurements acquired by the Electron Analyser System (SWA-EAS) on board the Solar Orbiter mission. We employed the Spacecraft Plasma Interaction Software to model the interaction of the Solar Orbiter spacecraft with solar wind plasma and we implemented a virtual detector to simulate the measured electron energy spectra as observed in situ by the SWA-EAS experiment. Numerical simulations were set according to the measured plasma conditions at 0.3~AU. We derived the simulated electron energy spectra as detected by the virtual SWA-EAS experiment for different electron populations and compared these with both the initial plasma conditions and the corresponding real SWA-EAS data samples. We found qualitative agreement between the simulated and real data observed in situ by the SWA-EAS detector. Contrary to other space missions, the contamination by cold electrons emitted from the spacecraft is seen well above the spacecraft potential energy threshold. A detailed analysis of the simulated electron energy spectra demonstrates that contamination above the threshold is a result of cold electron fluxes emitted from distant spacecraft surfaces. The relative position of the break in the simulated spectrum with respect to the spacecraft potential slightly deviates from that in the real observations. This may indicate that the real potential of the SWA-EAS detector with respect to ambient plasma differs from the spacecraft potential value measured on board. The overall contamination is shown to be composed of emissions from a number of different sources and their relative contribution varies with the ambient plasma conditions.",
  "authors": [
    "Š. Štverák",
    "D. Herčík",
    "P. Hellinger",
    "M. Popďakunik",
    "G. R. Lewis",
    "G. Nicolaou",
    "C. J. Owen",
    "Yu. V. Khotyaintsev",
    "M. Maksimovic"
  ],
  "published": "2026-01-07T11:22:20Z",
  "updated": "2026-01-07T11:22:20Z",
  "categories": [
    "astro-ph.IM",
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.IM"
}