{
  "arxiv_id": "2601.02262v2",
  "url": "https://arxiv.org/abs/2601.02262v2",
  "pdf_url": "https://arxiv.org/pdf/2601.02262v2.pdf",
  "title": "Variability of MHD Instabilities in Benign Termination of High-Current Runaway Electron Beams in the JET and DIII-D Tokamaks",
  "abstract": "Benign termination, in which magnetohydrodynamic (MHD) instabilities deconfine runaway electrons (REs) following hydrogenic injections, is a promising strategy for mitigating dangerous RE loads after disruptions. Recent experiments on the Joint European Torus (JET) have explored this scenario at higher pre-disruptive plasma currents than are achievable on other devices, revealing challenges in obtaining benign terminations at $I_p \\geq 2.5$ MA. This work analyzes the evolution of these high-current RE beams and their terminating MHD events using fast magnetic sensor measurements and EFIT equilibrium reconstructions for approximately $40$ JET and $20$ DIII-D tokamak discharges. On JET, unsuccessful non-benign terminations occur at low edge safety factor ($q_{\\text{edge}} \\approx 2$), and are preceded by intermittent, non-terminating MHD events at higher rational $q_{\\text{edge}}$. Trends in the internal inductance $l_i$ indicate more peaked RE current profiles in the high-$I_p$ non-benign population, which may hinder successful recombination through re-ionization. In contrast, benign terminations on JET typically occur at higher $q_{\\text{edge}} \\geq 3$ and exhibit less peaked RE current profiles. DIII-D displays a range of terminating edge safety factors, correlated with the measured $l_i$ values. Across both tokamaks, the RE current peaking is therefore found to determine which MHD instability boundary is encountered, confirmed by linear resistive MHD modeling with the CASTOR3D code. Measured growth rates are similar for benign and non-benign cases, indicating that ideal MHD timescales at low density after hydrogenic injection do not alone explain efficient RE deconfinement. Instead, non-benign cases are characterized by their lower MHD perturbation amplitudes $δB$. These observations suggest that the interplay between ideal and resistive dynamics governs the termination process.",
  "authors": [
    "C. F. B. Zimmermann",
    "C. Paz-Soldan",
    "G. Su",
    "C. Reux",
    "A. F. Battey",
    "O. Ficker",
    "S. N. Gerasimov",
    "C. J. Hansen",
    "S. Jachmich",
    "A. Lvovskiy",
    "J. Puchmayr",
    "N. Schoonheere",
    "U. Sheikh",
    "I. G. Stewart",
    "G. Szepesi",
    "JET Contributors",
    "the EUROfusion Tokamak Exploitation Team"
  ],
  "published": "2026-01-05T16:44:23Z",
  "updated": "2026-02-12T23:10:37Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}