{
  "arxiv_id": "2602.13743v1",
  "url": "https://arxiv.org/abs/2602.13743v1",
  "pdf_url": "https://arxiv.org/pdf/2602.13743v1.pdf",
  "title": "Demonstration of High-Gain Harmonic Lasing in a Terahertz Free-Electron Laser",
  "abstract": "Compact Free-Electron Lasers (FELs) offering broad, continuous spectral tunability are traditionally constrained by fixed-parameter magnetic structures and the necessity for high-energy electron beams. High-gain Harmonic Lasing (HL) has long been proposed as a solution to overcome these limitations; however, a robust experimental verification of this principle has remained absent. Here, we report the first experimental demonstration of high-gain HL. By employing a frequency-tunable electron beam density modulation to dominate the fundamental instability, we achieved sustained FEL amplification at the 3rd and 5th harmonics of the wiggler. The HL mode generated output power comparable to conventional fundamental operation with enhanced stability and narrower spectral bandwidth. Notably, we demonstrate that HL extends the spectral coverage by a factor of two under fixed facility constraints, achieving pulse energies up to 540 μJ. These results establish high-gain HL as a versatile mechanism for advancing compact, wavelength-flexible FEL facilities.",
  "authors": [
    "Yin Kang",
    "Cheng Yu",
    "Yue Wang",
    "Weiyi Yin",
    "Zhangfeng Gao",
    "Hanghua Xu",
    "Hang Luo",
    "Jian Chen",
    "Taihe Lan",
    "Xiaoqing Liu",
    "Jinguo Wang",
    "Huan Zhao",
    "Fei Gao",
    "Liping Sun",
    "YanYan Zhu",
    "Yongmei Wen",
    "Chengcheng Xiao",
    "Yongfang Liu",
    "Yixuan Liu",
    "Xingtao Wang",
    "Jiaqiang Xu",
    "Zheng Qi",
    "Tao Liu",
    "Bin Li",
    "Kaiqing Zhang",
    "Zhen Wang",
    "Chao Feng",
    "Bo Liu",
    "Zhentang Zhao"
  ],
  "published": "2026-02-14T12:21:23Z",
  "updated": "2026-02-14T12:21:23Z",
  "categories": [
    "physics.acc-ph",
    "physics.optics"
  ],
  "primary_category": "physics.acc-ph"
}