{
  "arxiv_id": "2602.10132v2",
  "url": "https://arxiv.org/abs/2602.10132v2",
  "pdf_url": "https://arxiv.org/pdf/2602.10132v2.pdf",
  "title": "TokaMark: A Comprehensive Benchmark for MAST Tokamak Plasma Models",
  "abstract": "Development and operation of commercially viable fusion energy reactors such as tokamaks require accurate predictions of plasma dynamics from sparse, noisy, and incomplete sensors readings. The complexity of the underlying physics and the heterogeneity of experimental data pose formidable challenges for conventional numerical methods, while simultaneously highlight the promise of modern data-native AI approaches. A major obstacle in realizing this potential is, however, the lack of curated, openly available datasets and standardized benchmarks. Existing fusion datasets are scarce, fragmented across institutions, facility-specific, and inconsistently annotated, which limits reproducibility and prevents a fair and scalable comparison of AI approaches. In this paper, we introduce TokaMark, a structured benchmark to evaluate AI models on real experimental data collected from the Mega Ampere Spherical Tokamak (MAST). TokaMark provides a comprehensive suite of tools designed to (i) unify access to multi-modal heterogeneous fusion data, and (ii) harmonize formats, metadata, temporal alignment and evaluation protocols to enable consistent cross-model and cross-task comparisons. The benchmark includes a curated list of 14 tasks spanning a range of physical mechanisms, exploiting a variety of diagnostics and covering multiple operational use cases. A baseline model is provided to facilitate transparent comparison and validation within a unified framework. By establishing a unified benchmark for both the fusion and AI-for-science communities, TokaMark aims to accelerate progress in data-driven AI-based plasma modeling, contributing to the broader goal of achieving sustainable and stable fusion energy. The benchmark, documentation, and tooling will be fully open sourced upon acceptance to encourage community adoption and contribution.",
  "authors": [
    "Cécile Rousseau",
    "Samuel Jackson",
    "Rodrigo H. Ordonez-Hurtado",
    "Nicola C. Amorisco",
    "Tobia Boschi",
    "George K. Holt",
    "Andrea Loreti",
    "Eszter Székely",
    "Alexander Whittle",
    "Adriano Agnello",
    "Stanislas Pamela",
    "Alessandra Pascale",
    "Robert Akers",
    "Juan Bernabe Moreno",
    "Sue Thorne",
    "Mykhaylo Zayats"
  ],
  "published": "2026-02-05T16:49:44Z",
  "updated": "2026-02-12T09:55:27Z",
  "categories": [
    "physics.plasm-ph",
    "cs.AI"
  ],
  "primary_category": "physics.plasm-ph"
}