{
  "arxiv_id": "2602.12931v1",
  "url": "https://arxiv.org/abs/2602.12931v1",
  "pdf_url": "https://arxiv.org/pdf/2602.12931v1.pdf",
  "title": "Simulation Study for Particle Identification with the dRICH of the ePIC Experiment at the EIC",
  "abstract": "The dual-radiator Imaging Cherenkov detector (dRICH) is a key component of the forward particle identification system for the ePIC experiment at the Electron-Ion Collider (EIC). This study evaluates the dRICH performance using Geant4 simulations in the context of the global ePIC simulation stack, focusing on the optimization of the aerogel radiator and the impact of sensor noise. We compare two aerogel configurations: the initial design (n=1.019) and the current default (n=1.026). The latter, characterized by improved optical properties and a higher refractive index, demonstrates enhanced $π-K$ separation at high momenta, effectively extending the operational overlap with the $\\mathrm{C_2F_6}$ gas radiator. Additionally, the study investigates the impact of Silicon Photomultiplier (SiPM) dark noise, showing that a 300 kHz noise rate per channel leads to a moderate reduction (approximately 1.5 GeV/c) in the $3σ$ separation threshold. These results validate the current dRICH design and quantify the purity levels achievable for both radiators under expected experimental conditions.",
  "authors": [
    "Tiziano Boasso",
    "Chatterjee Chandradoy",
    "Dalla Torre Silvia",
    "Martin Anna",
    "Tessarotto Fulvio",
    "Agarwala Jinky",
    "Contalbrigo Marco",
    "Polizzi Lorenzo",
    "Occhiuto Luisa",
    "Del Caro Annalisa",
    "Nagorna Tetiana",
    "Osipenko Mikhail",
    "Vallarino Simone",
    "Farokhi Fateme",
    "Kiselev Alexander",
    "Bhadauria Rohit Singh",
    "Ghosh Tapasi",
    "Nunez Cynthia",
    "Pecar Connor",
    "George Nebin",
    "Rajan Adithyan",
    "Samuel Deepak",
    "Jangid Rohit",
    "Kumar Ramandeep",
    "Laishram Girdish",
    "Tanvi Tanya",
    "Thakur Meenu"
  ],
  "published": "2026-02-13T13:40:34Z",
  "updated": "2026-02-13T13:40:34Z",
  "categories": [
    "physics.ins-det",
    "hep-ex",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det"
}