{
  "arxiv_id": "2602.12585v1",
  "url": "https://arxiv.org/abs/2602.12585v1",
  "pdf_url": "https://arxiv.org/pdf/2602.12585v1.pdf",
  "title": "Influence of finite temperature degeneracy and superthermal ions on dust acoustic solitary structures",
  "abstract": "We examine dust acoustic (DA) solitary structures in an unmagnetized, collisionless dusty electron positron ion (epi) plasma in which electrons and positrons are described by finite temperature Fermi Dirac statistics and ions obey a superthermal kappa distribution. A normalized fluid Poisson model is formulated using polylogarithm based expressions for the partially degenerate electrons positrons, while cold negatively charged dust grains provide the inertial response. Linear dispersion analysis yields a modified DA phase speed. Nonlinear solitary structures are investigated using the Sagdeev pseudopotential method. The system is found to support only negative potential (rarefactive) DA solitary waves within a bounded subsonic Mach number interval. The critical Mach number, consequently, the corresponding linear DA speed show an explicit dependence on the degeneracy parameters and the ion spectral index. The amplitude and width of the solitary structures are shown to be highly sensitive to the electron (positron) degeneracy strength, the ion positron concentration ratios, the ion temperature ratio, and the superthermality of the ions. A small amplitude approximation of the pseudopotential reduces the system to the Korteweg de Vries limit, providing closed form expressions for the soliton characteristics, in agreement with the Sagdeev predictions. The results clarify the combined roles of finite temperature degeneracy and superthermal ions in shaping nonlinear DA dynamics in space and astrophysical dusty plasmas.",
  "authors": [
    "Rupak Dey",
    "Gadadhar Banerjee"
  ],
  "published": "2026-02-13T03:54:51Z",
  "updated": "2026-02-13T03:54:51Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}