{
  "arxiv_id": "2602.12647v1",
  "url": "https://arxiv.org/abs/2602.12647v1",
  "pdf_url": "https://arxiv.org/pdf/2602.12647v1.pdf",
  "title": "Ballistic Surfing Acceleration as a Coherent Mechanism for Electron Acceleration in Galaxy Cluster Shocks",
  "abstract": "Radio relics in merging galaxy clusters are widely interpreted as synchrotron emission from relativistic electrons accelerated at large-scale shocks. However, the efficiency of diffusive shock acceleration (DSA) is expected to be reduced in the low-Mach-number, weakly turbulent environments characteristic of cluster merger shocks, and recent results suggest that DSA itself may not constitute a viable physical mechanism. In this work, we investigate ballistic surfing acceleration (BSA) as an electrodynamically grounded mechanism for electron energization that does not rely on prescribed diffusion coefficients. We formulate BSA under typical cluster shock conditions and derive the balance between coherent acceleration by the shock convection electric field and radiative losses due to synchrotron and inverse-Compton cooling. This balance determines both the maximum electron energy and the resulting steady-state spectrum. By forward-modeling the associated synchrotron emission and comparing it with integrated radio observations of the Sausage and Toothbrush relics, we find that the observed spectral curvature and high-frequency steepening can be reproduced when only a very small fraction ($\\sim 10^{-9} - 10^{-8}$) of the available BSA acceleration capacity contributes to systematic electron energization. Despite this extremely small efficiency, it is sufficient to accelerate electrons to Lorentz factors $γ\\sim 10^4 - 10^5$ under cluster conditions. These results suggest that radio relics provide a promising astrophysical laboratory for probing coherent acceleration, and that the BSA framework may account for the production of relativistic electrons in cluster shocks.",
  "authors": [
    "Ji-Hoon Ha",
    "Krzysztof Stasiewicz"
  ],
  "published": "2026-02-13T06:13:34Z",
  "updated": "2026-02-13T06:13:34Z",
  "categories": [
    "astro-ph.HE",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.HE"
}