{
  "arxiv_id": "2602.12813v1",
  "url": "https://arxiv.org/abs/2602.12813v1",
  "pdf_url": "https://arxiv.org/pdf/2602.12813v1.pdf",
  "title": "Quantitative 3D non-linear simulations of shattered pellet injection in ASDEX Upgrade using JOREK",
  "abstract": "Shattered pellet injection (SPI) as primary mitigation method for major disruptions in ITER has a large parameter space available for optimization including the total amount of injected material, the size of the individual pellet fragments, the material composition, and the timing of multiple injections. This flexibility needs to be exploited to simultaneously minimize thermal heat loads, electromagnetic vessel forces, and formation of relativistic electrons and their impacts on plasma facing components. In this article, we apply 3D non-linear magnetohydrodynamic modelling to SPI experiments in the ASDEX Upgrade tokamak, going beyond our previous work [Tang et al Nucl. Fusion 65 116003 (2025)] by resolving some discrepancies between simulations and experiment and thus opening the path to quantitative model validation and experiment interpretation. The key element that enables the transition from merely qualitative comparisons to quantitatively reliable predictions of the thermal quench duration and the radiation fraction is the incorporation of a simplified treatment of parallel heat-flux limiting. The work increases the confidence of matching the key processes of disruption mitigation with this high fidelity modelling in view of predictive studies for ITER.",
  "authors": [
    "W. Tang",
    "M. Hoelzl",
    "P. Heinrich",
    "D. Hu",
    "F. J. Artola",
    "P. de Marne",
    "M. Dibon",
    "M. Dunne",
    "O. Ficker",
    "P. Halldestam",
    "S. Jachmich",
    "M. Lehnen",
    "E. Nardon",
    "G. Papp",
    "A. Patel",
    "U. Sheikh",
    "the ASDEX Upgrade Team",
    "the EUROfusion Tokamak Exploitation Team",
    "the JOREK Team"
  ],
  "published": "2026-02-13T10:49:20Z",
  "updated": "2026-02-13T10:49:20Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}