{
  "arxiv_id": "2602.12773v1",
  "url": "https://arxiv.org/abs/2602.12773v1",
  "pdf_url": "https://arxiv.org/pdf/2602.12773v1.pdf",
  "title": "Design and Operation of Wafer-Scale Packages Containing >500 Superconducting Qubits",
  "abstract": "Packages capable of supporting large arrays of high-coherence superconducting qubits are vital for the realisation of fault-tolerant quantum computers and the necessary high-throughput metrology required to optimise fabrication and manufacturing processes. We present a wafer-scale packaging architecture supporting over 500 qubits on a single 3-inch die. The package is engineered to suppress parasitic RF modes, and to mitigate material loss through simulation-informed design while managing differential thermal contraction to ensure robust operation at millikelvin temperatures. System-level heat-load calculations from a large wiring payload show this package may be operated in commercial dilution refrigerators. Measurements of the qubits loaded into the package show median $T_1$, $T_{2e} \\sim 100~μ$s ($\\sim$100 qubits) alongside readout with median fidelity of 97.5% (54 qubits) and a median qubit temperature of 36 mK (54 qubits). These results validate the performance of these packages and demonstrate that large-scale integration can be achieved without compromising device performance. Finally, we highlight the utility of these packages as a tool for high throughput feedback on qubit figures of merit over large sample sizes, allowing identification of performance outliers in the tails of the coherence distribution, a critical capability for informing fabrication and manufacture of high-quality quantum qubits and quantum processors.",
  "authors": [
    "Oscar W. Kennedy",
    "Waqas Ahmad",
    "Robert Armstrong",
    "Amir Awawdeh",
    "Anirban Bose",
    "Kevin G. Crawford",
    "Sergey Danilin",
    "William D. David",
    "Hamid El Maazouz",
    "Darren J. Hayton",
    "George B. Long",
    "Alexey Lyapin",
    "Scott A. Manifold",
    "Kowsar Shahbazi",
    "Ryan Wesley",
    "Evan Wong",
    "Connor D. Shelly"
  ],
  "published": "2026-02-13T09:58:30Z",
  "updated": "2026-02-13T09:58:30Z",
  "categories": [
    "quant-ph",
    "physics.app-ph",
    "physics.ins-det"
  ],
  "primary_category": "quant-ph"
}