[
  {
    "arxiv_id": "2602.13982v1",
    "url": "https://arxiv.org/abs/2602.13982v1",
    "pdf_url": "https://arxiv.org/pdf/2602.13982v1.pdf",
    "title": "Design and simulation of the High-Energy Proton Beam Telescope",
    "abstract": "A high-resolution beam telescope is essential for the precise characterization of silicon pixel sensors. As part of the CSNS-II upgrade project, a High-Energy Proton Beam Telescope (HEPTel) based on monolithic active pixel sensors (MAPS) has been designed for the forthcoming High-Energy Proton Experimental Station (HPES), which will provide 0.8 to 1.6 GeV single-particle proton beams. HEPTel consists of six ultra-thin telescope modules, with a material budget per module of about 0.061% X0. Simulated with a 1.6 GeV proton beam, the telescope is expected to achieve a resolution of about 1.83 micrometers. Additionally, a dedicated readout electronics system and a Data Acquisition (DAQ) system have been designed for HEPTel, based on which a preliminary test system was established for beam tests. The beam test results with 1.3 GeV electrons demonstrated a single-module resolution of about 5.77 micrometers, an overall telescope resolution of about 2.70 micrometers, and a detection efficiency above 99.5%. These results validate the HEPTel design and confirm its capability for forthcoming proton-beam experiments at HPES.",
    "authors": [
      "Lan-Kun Li",
      "Ze Gao",
      "Ying-Hao Yu",
      "Liang-Cheng-Long Jin",
      "Ming-Yi Dong",
      "Ren-Hong Liu",
      "Hong-Yu Zhang",
      "Chang Xu",
      "Han-Tao Jing",
      "Yu-Hang Guo",
      "Qun Ou-Yang"
    ],
    "published": "2026-02-15T04:13:01Z",
    "updated": "2026-02-15T04:13:01Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.00732v4",
    "url": "https://arxiv.org/abs/2509.00732v4",
    "pdf_url": "https://arxiv.org/pdf/2509.00732v4.pdf",
    "title": "Classical and quantum beam dynamics simulation of the RF photoinjector test bench",
    "abstract": "We present beam-dynamics simulations for an S-band RF photoinjector test bench under development at the Joint Institute for Nuclear Research, aimed at producing high-quality electron beams and enabling future generation of relativistic vortex electrons with a quantized orbital angular momentum (OAM). Simulations of the 1.5-cell photogun are performed assuming an RF gradient of 45 MV/m, which, in accordance with our simulations with CST Studio, corresponds to the currently achieved input RF power of 3 MW. At low charge (Q = 0.63 pC), stable bunch formation is obtained, with weak space-charge effects and transverse emittance dominated by RF-induced correlations. Optimization of the injection phase and cathode solenoid results in a robust emittance-compensated regime with a final normalized emittance of 2.08 pi mm mrad. To assess prospects for accelerating vortex electron beams, we additionally model the quantum evolution of single-electron Laguerre-Gaussian wave packets. The results show that multi-MeV acceleration suppresses free-space spreading of the electron packet and preserves the packet's initial OAM structure, indicating that the test bench provides suitable conditions for forthcoming experimental studies of relativistic vortex electrons.",
    "authors": [
      "A. S. Dyatlov",
      "V. V. Kobets",
      "A. E. Levichev",
      "M. V. Maksimov",
      "D. A. Nikiforov",
      "M. A. Nozdrin",
      "K. Popov",
      "K. A. Sibiryakova",
      "K. E. Yunenko",
      "D. V. Karlovets"
    ],
    "published": "2025-08-31T07:52:04Z",
    "updated": "2026-02-14T15:17:36Z",
    "categories": [
      "physics.acc-ph",
      "physics.atom-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.13743v1",
    "url": "https://arxiv.org/abs/2602.13743v1",
    "pdf_url": "https://arxiv.org/pdf/2602.13743v1.pdf",
    "title": "Demonstration of High-Gain Harmonic Lasing in a Terahertz Free-Electron Laser",
    "abstract": "Compact Free-Electron Lasers (FELs) offering broad, continuous spectral tunability are traditionally constrained by fixed-parameter magnetic structures and the necessity for high-energy electron beams. High-gain Harmonic Lasing (HL) has long been proposed as a solution to overcome these limitations; however, a robust experimental verification of this principle has remained absent. Here, we report the first experimental demonstration of high-gain HL. By employing a frequency-tunable electron beam density modulation to dominate the fundamental instability, we achieved sustained FEL amplification at the 3rd and 5th harmonics of the wiggler. The HL mode generated output power comparable to conventional fundamental operation with enhanced stability and narrower spectral bandwidth. Notably, we demonstrate that HL extends the spectral coverage by a factor of two under fixed facility constraints, achieving pulse energies up to 540 μJ. These results establish high-gain HL as a versatile mechanism for advancing compact, wavelength-flexible FEL facilities.",
    "authors": [
      "Yin Kang",
      "Cheng Yu",
      "Yue Wang",
      "Weiyi Yin",
      "Zhangfeng Gao",
      "Hanghua Xu",
      "Hang Luo",
      "Jian Chen",
      "Taihe Lan",
      "Xiaoqing Liu",
      "Jinguo Wang",
      "Huan Zhao",
      "Fei Gao",
      "Liping Sun",
      "YanYan Zhu",
      "Yongmei Wen",
      "Chengcheng Xiao",
      "Yongfang Liu",
      "Yixuan Liu",
      "Xingtao Wang",
      "Jiaqiang Xu",
      "Zheng Qi",
      "Tao Liu",
      "Bin Li",
      "Kaiqing Zhang",
      "Zhen Wang",
      "Chao Feng",
      "Bo Liu",
      "Zhentang Zhao"
    ],
    "published": "2026-02-14T12:21:23Z",
    "updated": "2026-02-14T12:21:23Z",
    "categories": [
      "physics.acc-ph",
      "physics.optics"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.13408v1",
    "url": "https://arxiv.org/abs/2602.13408v1",
    "pdf_url": "https://arxiv.org/pdf/2602.13408v1.pdf",
    "title": "Measurement of the laser pulse phase velocity in plasma channel for DLA optimization",
    "abstract": "We demonstrate a novel, direct method for measuring the phase velocity $v_φ$ of an intense laser pulse within a plasma channel - the crucial parameter that controls the resonance condition in direct laser acceleration (DLA). The technique exploits the second harmonic (SH) radiation generated at the channel sheath - a phenomenon previously observed in laser-wakefield acceleration experiments. The SH emission angle is governed by a phase-matching condition that directly depends on $v_φ$. Experimental measurements performed using a 1 TW, 10 Hz Ti:Sa laser system yield phase velocities in the range $v_φ=(1.010-1.030)c$ for plasma electron densities in the range $n_e=(0.01-0.06)n_{cr}$. The diagnostic is validated through quasi-3D particle-in-cell (PIC) simulations that reproduce the experimental conditions. This work provides a way to optimize DLA schemes by enabling in-situ measurement of the laser pulse phase velocity in plasma channels.",
    "authors": [
      "E. M. Starodubtseva",
      "I. N. Tsymbalov",
      "D. A. Gorlova",
      "K. A. Ivanov",
      "R. V. Volkov",
      "A. B. Savel'ev"
    ],
    "published": "2026-02-13T19:17:16Z",
    "updated": "2026-02-13T19:17:16Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.13180v1",
    "url": "https://arxiv.org/abs/2602.13180v1",
    "pdf_url": "https://arxiv.org/pdf/2602.13180v1.pdf",
    "title": "Exact moment models for conservation laws in phase space",
    "abstract": "Moment equations offer a compelling alternative to the kinetic description of plasmas, gases, and liquids. Their simulation requires fewer degrees of freedom than phase space models, yet it can still incorporate kinetic effects to a certain extent. To derive moment equations, we use a parameterization of the distribution function using centered moments, as proposed by Burby. This yields moment equations for which the parameterized distribution function exactly solves the hyperbolic conservation law. Similarly, a particle model is derived based on a parametrization of the distribution function using phase space moments. Finally, we present the application of the method to the non-relativistic and relativistic Vlasov--Maxwell equations.",
    "authors": [
      "Tileuzhan Mukhamet",
      "Katharina Kormann"
    ],
    "published": "2026-02-13T18:40:05Z",
    "updated": "2026-02-13T18:40:05Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.13092v1",
    "url": "https://arxiv.org/abs/2602.13092v1",
    "pdf_url": "https://arxiv.org/pdf/2602.13092v1.pdf",
    "title": "Tensor Network Compression for Fully Spectral Vlasov-Poisson Simulation",
    "abstract": "We propose a numerical method for kinetic plasma simulation in which the phase-space distribution function is represented by a low-rank tensor network with an adaptive level of compression. The Vlasov-Poisson system is advanced using Strang splitting, and each substep is treated spectrally in the corresponding variable. By expressing both the distribution function and the Fourier transform as tensor network objects (state and operator representations), spectral transforms are applied directly in compressed form, enabling time stepping without reconstructing the full phase-space grid. The self-consistent electric field is also computed within the tensor formalism. The charge density is obtained by contracting over velocity degrees of freedom and extracting the zero Fourier mode, which provides the source term for a spectral Poisson solver. We validate the approach on standard benchmarks, including Landau damping and the two-stream instability. Finally, we systematically study how compression parameters, including truncation tolerances and internal ranks (bond dimensions), affect momentum and energy conservation, positivity behavior, robustness to filamentation, and computational cost.",
    "authors": [
      "Erik M. Åsgrim",
      "Luca Pennati",
      "Marco Pasquale",
      "Stefano Markidis"
    ],
    "published": "2026-02-13T16:54:31Z",
    "updated": "2026-02-13T16:54:31Z",
    "categories": [
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.comp-ph"
  },
  {
    "arxiv_id": "2602.13068v1",
    "url": "https://arxiv.org/abs/2602.13068v1",
    "pdf_url": "https://arxiv.org/pdf/2602.13068v1.pdf",
    "title": "Structure preservation using discrete gradients in the Vlasov-Poisson-Landau system",
    "abstract": "We present a novel structure-preserving framework for solving the Vlasov-Poisson-Landau system of equations using a particle in cell (PIC) discretization combined with discrete gradient time integrators. The Vlasov-Poisson-Landau system is an accurate model for studying hot plasma dynamics at a kinetic scale where small-angle Coulomb collisions dominate. Our scheme guarantees conservation of mass, momentum and energy as well as preservation of the monotonicity of entropy production in both the time-continuous and discrete systems. We employ the conservative integrator for both the Hamiltonian Vlasov-Poisson equations and the dissipative Landau equation using the PETSc library (www.mcs.anl.gov/petsc) to showcase structure-preserving properties.",
    "authors": [
      "Daniel S. Finn",
      "Joseph V. Pusztay",
      "Matthew G. Knepley",
      "Mark F. Adams"
    ],
    "published": "2026-02-13T16:23:31Z",
    "updated": "2026-02-13T16:23:31Z",
    "categories": [
      "physics.plasm-ph",
      "math-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.13064v1",
    "url": "https://arxiv.org/abs/2602.13064v1",
    "pdf_url": "https://arxiv.org/pdf/2602.13064v1.pdf",
    "title": "Improving the performance of mid-T baked niobium cavities through post-bake surface treatment",
    "abstract": "The Medium temperature (mid-T) baking of niobium superconducting radio-frequency cavities at 300 350&#8239; C in a vacuum furnace is known to enhance the quality factor (Q&#8320;). However, despite this improvement, cavities treated with this process often exhibit premature quench at relatively low accelerating fields. This limitation is suspected to arise from the formation of surface contaminants, such as niobium carbides, during the furnace bake at 350 C for 3 h. To investigate the influence of potential surface contamination, this study applied an ultralight chemical removal to 1.3&#8239;GHz and 650&#8239;MHz single-cell cavities that had undergone medium-temperature baking. The removal of the top RF surface layer led to a notable improvement in the quench field and Q&#8320;, indicating a beneficial effect of eliminating possible surface residues introduced during the bake.",
    "authors": [
      "V. Chouhan",
      "D. Bice",
      "A. Cravatta",
      "B. Guilfoyle",
      "A. Murthy",
      "A. Netepenko",
      "T. Reid",
      "T. Ring",
      "D. Smith",
      "G. Wu"
    ],
    "published": "2026-02-13T16:18:04Z",
    "updated": "2026-02-13T16:18:04Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.13060v1",
    "url": "https://arxiv.org/abs/2602.13060v1",
    "pdf_url": "https://arxiv.org/pdf/2602.13060v1.pdf",
    "title": "Quantitative imaging of Abrikosov vortices by scanning quantum magnetometry",
    "abstract": "Understanding vortex matter in type-II superconductors is central to controlling dissipation and flux pinning in superconducting materials and devices. Here, we use cryogenic scanning nitrogen vacancy magnetometry (NVM) to image Abrikosov vortices in the cuprate superconductors BSCCO-2212 and YBCO under controlled field-cooled conditions. Measurements, which are performed using continuous-wave optically detected magnetic resonance (cw-ODMR) in a closed-cycle cryostat, yield quantitative magnetic-field maps with nanoscale spatial resolution. In BSCCO-2212 at 71 K, we resolve a well-ordered triangular vortex lattice, whose symmetry and spacing are confirmed through 2D Fourier analysis and are consistent with flux quantization. YBCO thin films imaged at 3 K exhibit a more disordered vortex arrangement reflecting stronger pinning, while maintaining quantitative agreement between measured vortex density and the applied magnetic field. These results render our cryogenic scanning NVM a reliable quantitative tool for real-space studies of vortices in high-$T_c$ superconductors, in particular since such a remarkable magnetic resolution has been achieved within relatively short acquisition times of 2 to 4 h.",
    "authors": [
      "Clemens Schäfermeier",
      "Ankit Sharma",
      "Christopher Kelvin von Grundherr",
      "Andrea Morales",
      "Jan Rhensius",
      "Gabriel Puebla-Hellmann",
      "Mirko Bacani"
    ],
    "published": "2026-02-13T16:15:48Z",
    "updated": "2026-02-13T16:15:48Z",
    "categories": [
      "cond-mat.supr-con",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "cond-mat.supr-con"
  },
  {
    "arxiv_id": "2602.12969v1",
    "url": "https://arxiv.org/abs/2602.12969v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12969v1.pdf",
    "title": "Role of the radial electric field in the confinement of energetic ions in the Wendelstein 7-X stellarator",
    "abstract": "Good fast-ion confinement is an essential requirement for a fusion reactor. The magnetic configuration of the Wendelstein 7-X (W7-X) stellarator is partially optimized in this regard in a reactor-relevant scenario: it is expected to show improved fast-ion confinement when $β$ is high and the effect of the radial electric field is negligible. The experimental validation of this optimization is difficult since, with the available power, achieving high $β$ under appropriate conditions for the validation is challenging and the effect of the radial electric field is inevitable. In this work, the confinement of fast ions in W7-X has been studied numerically for a variety of scenarios via the ASCOT5 code. The effect of the radial electric field on fast-ion losses is confirmed to be equivalent to the one produced by $β$, and this is characterized by means of scans on both parameters. Through a preliminary study with experimentally-based profiles, a viable scenario is identified that takes advantage of this effect for the experimental validation of the optimization strategy of W7-X.",
    "authors": [
      "M. Arranz",
      "J. L. Velasco",
      "I. Calvo",
      "D. Carralero"
    ],
    "published": "2026-02-13T14:43:01Z",
    "updated": "2026-02-13T14:43:01Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.12964v1",
    "url": "https://arxiv.org/abs/2602.12964v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12964v1.pdf",
    "title": "High-precision beam profile measurement with a microchannel-plate detector in the high magnetic field of the WISArD experiment",
    "abstract": "We present the development and characterization of a compact low-energy ion beam diagnostic for the WISArD (Weak Interaction Studies with $\\mathrm{^{32}Ar}$ Decay) experiment at ISOLDE/CERN. The microchannel plate (MCP) detector, which is configured in a Z-stack and has a resistive position sensitive anode, was tested with both stable and radioactive beams. This work focuses on the image reconstruction method, which corrects the pincushion distortion inherent to the square-shaped resistive anode, and investigates the influence of the magnetic field on the detector performance. Our results demonstrate that the detector achieves beam profile measurements with sub-millimeter accuracy, while coping with the spatial and high-magnetic field (4 T) constraints of the experiment. These capabilities meet the precision requirements of the WISArD experiment for extracting the modified beta-neutrino angular correlation coefficient, ã$_{βν}$, with an uncertainty of 0.1%.",
    "authors": [
      "S. Lecanuet",
      "X. Fléchard",
      "P. Alfaurt",
      "P. Ascher",
      "D. Atanasov",
      "B. Blank",
      "L. Daudin",
      "H. DePreaumont",
      "M. Gerbaux",
      "J. Giovinazzo",
      "S. Grévy",
      "G. Guignard",
      "J. Ha",
      "C. Knapen",
      "S. Lechner",
      "A. Lépine",
      "J. Lory",
      "J. Perronnel",
      "M. Pomorski",
      "M. Roche",
      "C. Roumegou",
      "N. Severijns",
      "Y. Son",
      "S. Vanlangendonck",
      "M. Versteegen",
      "D. Zakoucky"
    ],
    "published": "2026-02-13T14:30:39Z",
    "updated": "2026-02-13T14:30:39Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.12945v1",
    "url": "https://arxiv.org/abs/2602.12945v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12945v1.pdf",
    "title": "Cross-correlation on a single channel for resistance noise measurements",
    "abstract": "Cross-correlation is an established tool to reduce the background in resistance noise measurements. However, the conventional method requires the amplifier, demodulator and digitizer channels to be duplicated, increasing the cost and complexity of the measurement circuit. We propose an alternating-current technique that allows cross-correlation with only a single channel by modulating the device under test with two carrier frequencies simultaneously. Using multiple software-based demodulators, we show that this method produces accurate amplitude measurements and noise spectra. The signal-to-noise-ratio is improved by 7 dB, and longer measurement durations increase this improvement.",
    "authors": [
      "Tim Thyzel"
    ],
    "published": "2026-02-13T14:07:48Z",
    "updated": "2026-02-13T14:07:48Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.12931v1",
    "url": "https://arxiv.org/abs/2602.12931v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12931v1.pdf",
    "title": "Simulation Study for Particle Identification with the dRICH of the ePIC Experiment at the EIC",
    "abstract": "The dual-radiator Imaging Cherenkov detector (dRICH) is a key component of the forward particle identification system for the ePIC experiment at the Electron-Ion Collider (EIC). This study evaluates the dRICH performance using Geant4 simulations in the context of the global ePIC simulation stack, focusing on the optimization of the aerogel radiator and the impact of sensor noise. We compare two aerogel configurations: the initial design (n=1.019) and the current default (n=1.026). The latter, characterized by improved optical properties and a higher refractive index, demonstrates enhanced $π-K$ separation at high momenta, effectively extending the operational overlap with the $\\mathrm{C_2F_6}$ gas radiator. Additionally, the study investigates the impact of Silicon Photomultiplier (SiPM) dark noise, showing that a 300 kHz noise rate per channel leads to a moderate reduction (approximately 1.5 GeV/c) in the $3σ$ separation threshold. These results validate the current dRICH design and quantify the purity levels achievable for both radiators under expected experimental conditions.",
    "authors": [
      "Tiziano Boasso",
      "Chatterjee Chandradoy",
      "Dalla Torre Silvia",
      "Martin Anna",
      "Tessarotto Fulvio",
      "Agarwala Jinky",
      "Contalbrigo Marco",
      "Polizzi Lorenzo",
      "Occhiuto Luisa",
      "Del Caro Annalisa",
      "Nagorna Tetiana",
      "Osipenko Mikhail",
      "Vallarino Simone",
      "Farokhi Fateme",
      "Kiselev Alexander",
      "Bhadauria Rohit Singh",
      "Ghosh Tapasi",
      "Nunez Cynthia",
      "Pecar Connor",
      "George Nebin",
      "Rajan Adithyan",
      "Samuel Deepak",
      "Jangid Rohit",
      "Kumar Ramandeep",
      "Laishram Girdish",
      "Tanvi Tanya",
      "Thakur Meenu"
    ],
    "published": "2026-02-13T13:40:34Z",
    "updated": "2026-02-13T13:40:34Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.12853v1",
    "url": "https://arxiv.org/abs/2602.12853v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12853v1.pdf",
    "title": "R&D Efforts in Cherenkov Imaging Technologies for Particle Identification in Future Experiments",
    "abstract": "Cherenkov imaging detectors will continue to play a central role for particle identification in future particle and nuclear physics experiments. Growing demands on momentum coverage, timing precision, radiation tolerance, and sustainability have driven extensive R&D in detector concepts, radiator materials, and photon sensors. This article reviews recent efforts, focusing on experiments leading advances in sensor technology, radiator materials, and the exploitation of Cherenkov photon timing to push PID limits, while highlighting synergies across experiments in addressing common challenges.",
    "authors": [
      "Chandradoy Chatterjee"
    ],
    "published": "2026-02-13T11:58:17Z",
    "updated": "2026-02-13T11:58:17Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.12836v1",
    "url": "https://arxiv.org/abs/2602.12836v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12836v1.pdf",
    "title": "Measurements of absolute gamma-ray energies using an ultra-high energy resolution magnetic microcalorimeter",
    "abstract": "We present new measurements of 27 gamma ray energies ranging from 14 keV to 136 keV, obtained using high-energy-resolution magnetic microcalorimeters for energy-dispersive spectrometry. The spectrometer has eight pixels and achieves an energy resolution between 15 and 30 eV across the entire energy range. It faces a cryogenic source sampler with four movable sources. Each source contains a mixture of radionuclides, including Yb-169 and Co-57 used to calibrate the spectrometer and correct its non-linearity. The gamma-ray energies, emitted through the decay of Co-57, Cd-109, Ba-133, Gd-153, Eu-154, Eu-155, Yb-169, Tm-170, Pb-210, Np-239, Am-241 and Am-243, have been reassessed. The lowest absolute uncertainty achieved is 0.13 eV at 105.3 keV, which corresponds to a relative uncertainty of 1.3 ppm. Of the 27 measured gamma rays, the uncertainties of 19 energies were improved with respect to the available literature: 10 by a factor of 5 and 4 by more than one order of magnitude. Good agreement is observed with energies obtained elsewhere by wavelength-dispersive spectrometry. This work significantly improves upon previously reported gamma energies obtained by energy-dispersive spectrometry using semiconductor detectors, thanks to the ultra-high energy resolution of magnetic microcalorimeters.",
    "authors": [
      "Matias Rodrigues",
      "Mostafa L. Zahir",
      "Martin Loidl",
      "Lucille Chambon",
      "Quentin Drenne",
      "Michael Müller",
      "Sebastian Kempf",
      "Etienne Nigron",
      "Ferid Haddad"
    ],
    "published": "2026-02-13T11:41:38Z",
    "updated": "2026-02-13T11:41:38Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.12813v1",
    "url": "https://arxiv.org/abs/2602.12813v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12813v1.pdf",
    "title": "Quantitative 3D non-linear simulations of shattered pellet injection in ASDEX Upgrade using JOREK",
    "abstract": "Shattered pellet injection (SPI) as primary mitigation method for major disruptions in ITER has a large parameter space available for optimization including the total amount of injected material, the size of the individual pellet fragments, the material composition, and the timing of multiple injections. This flexibility needs to be exploited to simultaneously minimize thermal heat loads, electromagnetic vessel forces, and formation of relativistic electrons and their impacts on plasma facing components. In this article, we apply 3D non-linear magnetohydrodynamic modelling to SPI experiments in the ASDEX Upgrade tokamak, going beyond our previous work [Tang et al Nucl. Fusion 65 116003 (2025)] by resolving some discrepancies between simulations and experiment and thus opening the path to quantitative model validation and experiment interpretation. The key element that enables the transition from merely qualitative comparisons to quantitatively reliable predictions of the thermal quench duration and the radiation fraction is the incorporation of a simplified treatment of parallel heat-flux limiting. The work increases the confidence of matching the key processes of disruption mitigation with this high fidelity modelling in view of predictive studies for ITER.",
    "authors": [
      "W. Tang",
      "M. Hoelzl",
      "P. Heinrich",
      "D. Hu",
      "F. J. Artola",
      "P. de Marne",
      "M. Dibon",
      "M. Dunne",
      "O. Ficker",
      "P. Halldestam",
      "S. Jachmich",
      "M. Lehnen",
      "E. Nardon",
      "G. Papp",
      "A. Patel",
      "U. Sheikh",
      "the ASDEX Upgrade Team",
      "the EUROfusion Tokamak Exploitation Team",
      "the JOREK Team"
    ],
    "published": "2026-02-13T10:49:20Z",
    "updated": "2026-02-13T10:49:20Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.12789v1",
    "url": "https://arxiv.org/abs/2602.12789v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12789v1.pdf",
    "title": "Resonant Excitation of Surface Plasmon for Wakefield Acceleration by Beating GW Lasers on Smooth Cylindrical Surface",
    "abstract": "We present a theoretical and numerical study of resonant surface-plasmon (SP) excitation driven by the beating of two co-propagating laser pulses on a smooth cylindrical plasma-vacuum interface. Analytical expressions for the SP dispersion relation, field amplitude, geometric coupling factor, and resonance conditions are derived and validated by fully three-dimensional particle-in-cell simulations. We reveal that curvature-induced geometric effects can substantially modify the SP dispersion and enable resonant matching by laser beat waves. This is inaccessible in planar geometries or with a single laser. Under matched resonance conditions, a high-amplitude SP-based wakefield can be generated by a few gigawatt lasers, placing this mechanism within reach of state-of-the-art fibre lasers. It therefore opens a route toward portable laser-driven plasma wakefield accelerators.",
    "authors": [
      "Bifeng Lei",
      "Hao Zhang",
      "Alexandre Bonatto",
      "Bin Liu",
      "Javier Resta-Lopez",
      "Matt Zepf",
      "Guoxing Xia",
      "Carsten Welsch"
    ],
    "published": "2026-02-13T10:14:36Z",
    "updated": "2026-02-13T10:14:36Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph",
      "physics.class-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.12773v1",
    "url": "https://arxiv.org/abs/2602.12773v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12773v1.pdf",
    "title": "Design and Operation of Wafer-Scale Packages Containing >500 Superconducting Qubits",
    "abstract": "Packages capable of supporting large arrays of high-coherence superconducting qubits are vital for the realisation of fault-tolerant quantum computers and the necessary high-throughput metrology required to optimise fabrication and manufacturing processes. We present a wafer-scale packaging architecture supporting over 500 qubits on a single 3-inch die. The package is engineered to suppress parasitic RF modes, and to mitigate material loss through simulation-informed design while managing differential thermal contraction to ensure robust operation at millikelvin temperatures. System-level heat-load calculations from a large wiring payload show this package may be operated in commercial dilution refrigerators. Measurements of the qubits loaded into the package show median $T_1$, $T_{2e} \\sim 100~μ$s ($\\sim$100 qubits) alongside readout with median fidelity of 97.5% (54 qubits) and a median qubit temperature of 36 mK (54 qubits). These results validate the performance of these packages and demonstrate that large-scale integration can be achieved without compromising device performance. Finally, we highlight the utility of these packages as a tool for high throughput feedback on qubit figures of merit over large sample sizes, allowing identification of performance outliers in the tails of the coherence distribution, a critical capability for informing fabrication and manufacture of high-quality quantum qubits and quantum processors.",
    "authors": [
      "Oscar W. Kennedy",
      "Waqas Ahmad",
      "Robert Armstrong",
      "Amir Awawdeh",
      "Anirban Bose",
      "Kevin G. Crawford",
      "Sergey Danilin",
      "William D. David",
      "Hamid El Maazouz",
      "Darren J. Hayton",
      "George B. Long",
      "Alexey Lyapin",
      "Scott A. Manifold",
      "Kowsar Shahbazi",
      "Ryan Wesley",
      "Evan Wong",
      "Connor D. Shelly"
    ],
    "published": "2026-02-13T09:58:30Z",
    "updated": "2026-02-13T09:58:30Z",
    "categories": [
      "quant-ph",
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2602.12765v1",
    "url": "https://arxiv.org/abs/2602.12765v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12765v1.pdf",
    "title": "Demonstration of ultra-low emittance beams in a kHz laser wakefield accelerator and application to electron diffraction",
    "abstract": "We present a compact, cost-effective method for measuring the emittance of kHz-repetition-rate laser-wakefield accelerated electron beams using a permanent solenoid. The measured normalized emittance, $ε_n = 124\\,\\mathrm{nm \\cdot rad}$ ($\\simeq 0.04 π\\,\\mathrm{mm \\cdot mrad}$) at $2.7\\,$MeV, is comparable to that of ultra-low emittance radiofrequency guns used for electron diffraction. Leveraging this low emittance, we successfully applied the electron beam to electron diffraction. We demonstrate diffraction images obtained from a single crystal Silicon nano-membrane sample, clearly resolving diffraction peaks across multiple orders.",
    "authors": [
      "J. Monzac",
      "S. Smartsev",
      "J. Huijts",
      "A. Vernier",
      "I. A. Andriyash",
      "V. Tomkus",
      "V. Girdauskas",
      "G. Raciukaitis",
      "M. Mackeviciute",
      "V. Stankevic",
      "A. Cavagna",
      "J. Kaur",
      "A. Kalouguine",
      "R. Lopez-Martens",
      "J. Faure"
    ],
    "published": "2026-02-13T09:49:28Z",
    "updated": "2026-02-13T09:49:28Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2505.02494v2",
    "url": "https://arxiv.org/abs/2505.02494v2",
    "pdf_url": "https://arxiv.org/pdf/2505.02494v2.pdf",
    "title": "Roadmap for warm dense matter physics",
    "abstract": "This roadmap presents the state-of-the-art, current challenges and near future developments anticipated in the thriving field of warm dense matter physics. Originating from strongly coupled plasma physics, high pressure physics and high energy density science, the warm dense matter physics community has recently taken a giant leap forward. This is due to spectacular developments in laser technology, diagnostic capabilities, and computer simulation techniques. Only in the last decade has it become possible to perform accurate enough simulations \\& experiments to truly verify theoretical results as well as to reliably design experiments based on predictions. Consequently, this roadmap discusses recent developments and contemporary challenges that are faced by theoretical methods, and experimental techniques needed to create and diagnose warm dense matter. A large part of this roadmap is dedicated to specific warm dense matter systems and applications in astrophysics, inertial confinement fusion and novel material synthesis.",
    "authors": [
      "Jan Vorberger",
      "Frank Graziani",
      "David Riley",
      "Andrew D. Baczewski",
      "Isabelle Baraffe",
      "Mandy Bethkenhagen",
      "Simon Blouin",
      "Maximilian P. Böhme",
      "Michael Bonitz",
      "Michael Bussmann",
      "Alexis Casner",
      "Witold Cayzac",
      "Peter Celliers",
      "Gilles Chabrier",
      "Nicolas Chamel",
      "Dave Chapman",
      "Mohan Chen",
      "Jean Clérouin",
      "Gilbert Collins",
      "Federica Coppari",
      "Tilo Döppner",
      "Tobias Dornheim",
      "Luke B. Fletcher",
      "Dirk O. Gericke",
      "Siegfried Glenzer",
      "Alexander F. Goncharov",
      "Gianluca Gregori",
      "Sebastien Hamel",
      "Stephanie B. Hansen",
      "Nicholas J. Hartley",
      "Suxing Hu",
      "Omar A. Hurricane",
      "Valentin V. Karasiev",
      "Joshua J. Kas",
      "Brendan Kettle",
      "Thomas Kluge",
      "Marcus D. Knudson",
      "Alina Kononov",
      "Zuzana Konôpkov á",
      "Dominik Kraus",
      "Andrea Kritcher",
      "Sophia Malko",
      "Gérard Massacrier",
      "Burkhard Militzer",
      "Zhandos A. Moldabekov",
      "Michael S. Murillo",
      "Bob Nagler",
      "Nadine Nettelmann",
      "Paul Neumayer",
      "Benjamin K. Ofori-Okai",
      "Ivan I. Oleynik",
      "Martin Preising",
      "Aurora Pribram-Jones",
      "Tlekkabul Ramazanov",
      "Alessandra Ravasio",
      "Ronald Redmer",
      "Baerbel Rethfeld",
      "Alex P. L. Robinson",
      "Gerd Röpke",
      "François Soubiran",
      "Charles E. Starrett",
      "Gerd Steinle-Neumann",
      "Phillip A. Sterne",
      "Shigenori Tanaka",
      "Aidan P. Thompson",
      "Samuel B. Trickey",
      "Tommaso Vinci",
      "Sam M. Vinko",
      "Lei Wang",
      "Alexander J. White",
      "Thomas G. White",
      "Ulf Zastrau",
      "Eva Zurek",
      "Panagiotis Tolias"
    ],
    "published": "2025-05-05T09:23:02Z",
    "updated": "2026-02-13T09:30:58Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.11970v2",
    "url": "https://arxiv.org/abs/2602.11970v2",
    "pdf_url": "https://arxiv.org/pdf/2602.11970v2.pdf",
    "title": "Tuning Optical Properties of FTO via Carbonaceous Al2O3 Microdot Deposition by DC plasma sputtering",
    "abstract": "Fluorine-doped tin oxide (FTO) is a key transparent conductive oxide for photovoltaic and optoelectronic devices, yet its high reflectance limits light-trapping efficiency. This work demonstrates a simple DC plasma sputtering approach to deposit carbonaceous Al2O3 microdots on FTO under controlled Ar, O2, and Ar-O2 atmospheres. For plasma discharge in the normal mode, with plasma density 10^9 cm^-3 and temperature of 2 eV, Volmer-Weber growth produced discrete microdots whose size and distribution were tuned by gas composition: dense, uniform dots in Ar (approximately 0.89 um radius), agglomerated structures in O2, and intermediate morphologies in mixed atmospheres. Structural analysis confirmed Al2O3 formation with carbon incorporation, while SEM revealed morphology-driven optical behavior. UV-Vis measurements showed that Ar-O2 coatings achieved the lowest reflectance across the visible range, outperforming bare FTO and other conditions. These findings establish a clear link between sputtering parameters, surface morphology, and optical performance, offering a scalable route to anti-reflective, light-trapping coatings for next-generation solar cells and optoelectronic devices.",
    "authors": [
      "Sarah Salah",
      "Ahmed Atlam",
      "Nagat Elkahwagy",
      "Abdelhamid Elshaer",
      "Mohammed Shihab"
    ],
    "published": "2026-02-12T14:02:41Z",
    "updated": "2026-02-13T09:07:12Z",
    "categories": [
      "physics.plasm-ph",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2503.05426v2",
    "url": "https://arxiv.org/abs/2503.05426v2",
    "pdf_url": "https://arxiv.org/pdf/2503.05426v2.pdf",
    "title": "Geant4 and FLUKA Simulations of a Cyclotron Based 30 MeV Proton-Beryllium Reaction: Benchmarking and Optimization of Neutron Fields",
    "abstract": "For studies where a reliable neutron source/beam is required and a nuclear reactor is not a viable option (considering their high neutron flux supply, which may not be suitable for research concerning low flux operations), alternative approaches may be sought. We present a comprehensive simulation analysis of 30 MeV proton induced ${}^9\\mathrm{Be}\\text{(p,n)}{}^9\\mathrm{B}$ reaction, which can be utilized as an isotropic neutron source. This energy was chosen as it was the maximum allowed limit of protons supplied by IBA's Cyclone 30 XP proton cyclotron. Due to different underlying physics and transport mechanisms, when it comes to numerical calculations, slight variations in findings between different toolkits may occur. Hence it may require one to have a guide at hand to address the differences and interpret the data more accurately before conducting the actual experiment. In this work present the different numerical results of Geant4 and FLUKA. We conducted preliminary Monte Carlo runs to estimate the resulting neutron fluence and prompt gamma dose equivalents, while also assessing the degree of moderation achieved by different thicknesses of high density polyethylene. Furthermore, this work also presents an examplar modular irradiation station designed for target-moderator configurations, with the capability of generating thermal neutron fields.",
    "authors": [
      "Egemen Gover",
      "Doga Veske",
      "M. Bilge Demirkoz"
    ],
    "published": "2025-03-07T13:52:37Z",
    "updated": "2026-02-13T08:53:53Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.12673v1",
    "url": "https://arxiv.org/abs/2602.12673v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12673v1.pdf",
    "title": "Long-Pulse Fast Ignition in MagLIF",
    "abstract": "The fast ignition paradigm for inertial confinement fusion (ICF) allows for extremely high gains but requires fuel to be heated very quickly to outpace hotspot disassembly and energy losses. This demands lasers with high power and intensity, posing engineering challenges that have called into question the fundamental practicality of fast ignition. Magnetized liner inertial fusion (MagLIF) circumvents these problems through its large-aspect-ratio cylindrical geometry and strong axial magnetic fields that allow for ignition at lower areal densities. Furthermore, MagLIF's large aspect ratio and higher yields relax other constraints on energy deposition and repetition rate while its axial magnetic fields can be used to collimate ignitor electrons and thereby increase allowed standoff distance and save on ignitor energy. This tremendous overall relaxation of the engineering constraints that have historically limited the practicality of fast ignition suggests that the paradigm may be considerably more viable in a MagLIF context.",
    "authors": [
      "Benjamin Wang",
      "Henry Fetsch",
      "Nathaniel J. Fisch"
    ],
    "published": "2026-02-13T07:14:33Z",
    "updated": "2026-02-13T07:14:33Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.12658v1",
    "url": "https://arxiv.org/abs/2602.12658v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12658v1.pdf",
    "title": "High Negative Ion Gain MMThGEM-Micromegas Detector for Directional Dark Matter Searches",
    "abstract": "Low pressure gaseous Negative Ion Time Projection Chambers (NITPCs) have been used previously by the DRIFT experiment to search for a directional Dark Matter (DM) signature. The main challenge with using a Negative Ion Drift (NID) gas target is the significantly lower gas gains to which they are typically limited. Recently, a MMThGEM device has been successfully demonstrated as an excellent gain stage device in the NID gas SF$_6$; capable of producing gas gains comparable with the electron drift gas CF$_4$. The next major challenge is to extend this high gain capability to multi-dimensional readout for the purpose of particle track reconstruction. The MMThGEM is therefore ideal for coupling to a strip readout detector like a Micromegas to achieve a high gain multi-dimensional Negative Ion (NI) readout plane, which is potentially suitable for the scale up required by future searches proposed by the CYGNUS consortium. In this paper, the first high gain demonstration of such a MMThGEM-Micromegas detector in low pressure SF$_6$ is described. This includes detector characterisation in a small test vessel resulting in the largest NI gas gain ever reported, 1.22 $\\pm$ 0.08 $\\times$ 10$^5$ , and directionality with alpha particles. Finally, this gain characterisation and tracking capability is leveraged to measure the energy and range of events, and identify those consistent with Nuclear Recoils (NRs), in a large cubic metre scale volume of SF$_6$ for the first time.",
    "authors": [
      "A. G. McLean",
      "S. Higashino",
      "R. R. Marcelo Gregorio",
      "K. Miuchi",
      "N. J. C. Spooner"
    ],
    "published": "2026-02-13T06:39:50Z",
    "updated": "2026-02-13T06:39:50Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.12647v1",
    "url": "https://arxiv.org/abs/2602.12647v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12647v1.pdf",
    "title": "Ballistic Surfing Acceleration as a Coherent Mechanism for Electron Acceleration in Galaxy Cluster Shocks",
    "abstract": "Radio relics in merging galaxy clusters are widely interpreted as synchrotron emission from relativistic electrons accelerated at large-scale shocks. However, the efficiency of diffusive shock acceleration (DSA) is expected to be reduced in the low-Mach-number, weakly turbulent environments characteristic of cluster merger shocks, and recent results suggest that DSA itself may not constitute a viable physical mechanism. In this work, we investigate ballistic surfing acceleration (BSA) as an electrodynamically grounded mechanism for electron energization that does not rely on prescribed diffusion coefficients. We formulate BSA under typical cluster shock conditions and derive the balance between coherent acceleration by the shock convection electric field and radiative losses due to synchrotron and inverse-Compton cooling. This balance determines both the maximum electron energy and the resulting steady-state spectrum. By forward-modeling the associated synchrotron emission and comparing it with integrated radio observations of the Sausage and Toothbrush relics, we find that the observed spectral curvature and high-frequency steepening can be reproduced when only a very small fraction ($\\sim 10^{-9} - 10^{-8}$) of the available BSA acceleration capacity contributes to systematic electron energization. Despite this extremely small efficiency, it is sufficient to accelerate electrons to Lorentz factors $γ\\sim 10^4 - 10^5$ under cluster conditions. These results suggest that radio relics provide a promising astrophysical laboratory for probing coherent acceleration, and that the BSA framework may account for the production of relativistic electrons in cluster shocks.",
    "authors": [
      "Ji-Hoon Ha",
      "Krzysztof Stasiewicz"
    ],
    "published": "2026-02-13T06:13:34Z",
    "updated": "2026-02-13T06:13:34Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2602.12585v1",
    "url": "https://arxiv.org/abs/2602.12585v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12585v1.pdf",
    "title": "Influence of finite temperature degeneracy and superthermal ions on dust acoustic solitary structures",
    "abstract": "We examine dust acoustic (DA) solitary structures in an unmagnetized, collisionless dusty electron positron ion (epi) plasma in which electrons and positrons are described by finite temperature Fermi Dirac statistics and ions obey a superthermal kappa distribution. A normalized fluid Poisson model is formulated using polylogarithm based expressions for the partially degenerate electrons positrons, while cold negatively charged dust grains provide the inertial response. Linear dispersion analysis yields a modified DA phase speed. Nonlinear solitary structures are investigated using the Sagdeev pseudopotential method. The system is found to support only negative potential (rarefactive) DA solitary waves within a bounded subsonic Mach number interval. The critical Mach number, consequently, the corresponding linear DA speed show an explicit dependence on the degeneracy parameters and the ion spectral index. The amplitude and width of the solitary structures are shown to be highly sensitive to the electron (positron) degeneracy strength, the ion positron concentration ratios, the ion temperature ratio, and the superthermality of the ions. A small amplitude approximation of the pseudopotential reduces the system to the Korteweg de Vries limit, providing closed form expressions for the soliton characteristics, in agreement with the Sagdeev predictions. The results clarify the combined roles of finite temperature degeneracy and superthermal ions in shaping nonlinear DA dynamics in space and astrophysical dusty plasmas.",
    "authors": [
      "Rupak Dey",
      "Gadadhar Banerjee"
    ],
    "published": "2026-02-13T03:54:51Z",
    "updated": "2026-02-13T03:54:51Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.02262v2",
    "url": "https://arxiv.org/abs/2601.02262v2",
    "pdf_url": "https://arxiv.org/pdf/2601.02262v2.pdf",
    "title": "Variability of MHD Instabilities in Benign Termination of High-Current Runaway Electron Beams in the JET and DIII-D Tokamaks",
    "abstract": "Benign termination, in which magnetohydrodynamic (MHD) instabilities deconfine runaway electrons (REs) following hydrogenic injections, is a promising strategy for mitigating dangerous RE loads after disruptions. Recent experiments on the Joint European Torus (JET) have explored this scenario at higher pre-disruptive plasma currents than are achievable on other devices, revealing challenges in obtaining benign terminations at $I_p \\geq 2.5$ MA. This work analyzes the evolution of these high-current RE beams and their terminating MHD events using fast magnetic sensor measurements and EFIT equilibrium reconstructions for approximately $40$ JET and $20$ DIII-D tokamak discharges. On JET, unsuccessful non-benign terminations occur at low edge safety factor ($q_{\\text{edge}} \\approx 2$), and are preceded by intermittent, non-terminating MHD events at higher rational $q_{\\text{edge}}$. Trends in the internal inductance $l_i$ indicate more peaked RE current profiles in the high-$I_p$ non-benign population, which may hinder successful recombination through re-ionization. In contrast, benign terminations on JET typically occur at higher $q_{\\text{edge}} \\geq 3$ and exhibit less peaked RE current profiles. DIII-D displays a range of terminating edge safety factors, correlated with the measured $l_i$ values. Across both tokamaks, the RE current peaking is therefore found to determine which MHD instability boundary is encountered, confirmed by linear resistive MHD modeling with the CASTOR3D code. Measured growth rates are similar for benign and non-benign cases, indicating that ideal MHD timescales at low density after hydrogenic injection do not alone explain efficient RE deconfinement. Instead, non-benign cases are characterized by their lower MHD perturbation amplitudes $δB$. These observations suggest that the interplay between ideal and resistive dynamics governs the termination process.",
    "authors": [
      "C. F. B. Zimmermann",
      "C. Paz-Soldan",
      "G. Su",
      "C. Reux",
      "A. F. Battey",
      "O. Ficker",
      "S. N. Gerasimov",
      "C. J. Hansen",
      "S. Jachmich",
      "A. Lvovskiy",
      "J. Puchmayr",
      "N. Schoonheere",
      "U. Sheikh",
      "I. G. Stewart",
      "G. Szepesi",
      "JET Contributors",
      "the EUROfusion Tokamak Exploitation Team"
    ],
    "published": "2026-01-05T16:44:23Z",
    "updated": "2026-02-12T23:10:37Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.16679v2",
    "url": "https://arxiv.org/abs/2511.16679v2",
    "pdf_url": "https://arxiv.org/pdf/2511.16679v2.pdf",
    "title": "On the Measurability of True Coincidence Summing in the GRIFFIN Spectrometer",
    "abstract": "The measurement of gamma-rays from decaying nuclei allow for the investigation into nuclear structure. True coincidence summing occurs when two gamma-rays from a single decay get detected in a single detector and their energies sum together to give false peaks in the energy spectrum. Corrections to this summing effect are crucial for an accurate determination of nuclear decay events. The summing correction formalism of Semkow et al. is generalized here into the \\textit{Semkow matrix formalism} and is extended into a multiplicity expansion. This formalism is used to calculate the matrix probabilities for 180-degree coincidence events as a method for correcting coincidence summing; in doing so, the deviation between the full correction and this 180-degree correction is shown as a function of multiplicity. This formalism is extended to the \\textit{partitioned matrix formalism}, to calculate probabilities for \\textit{gated} gamma rays; where two gamma-rays of interest are taken in multi-detector coincidence. The summing correction probabilities for gated gamma-rays are provided and the deviation is shown in a manner similar to that of the singles. Terms such as measurability, event equivalence, and ontic and epistemic events are defined. It is shown that within these definitions, coincidence summing is not sufficiently measurable, or rather, its sufficient measurability is statistically bounded by the deviations derived.",
    "authors": [
      "Liam Schmidt"
    ],
    "published": "2025-11-10T21:45:04Z",
    "updated": "2026-02-12T22:23:22Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.12420v1",
    "url": "https://arxiv.org/abs/2602.12420v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12420v1.pdf",
    "title": "A Transformer-based Model for Rapid Microstructure Inference from Four-Dimensional Scanning Transmission Electron Microscopy Data",
    "abstract": "Properties of crystalline materials are closely linked to microstructure arising from the spatial arrangement, orientation, and phase of nanocrystals. Rapid characterization of crystalline microstructure can accelerate the identification of these links and the development of materials with desired properties. Here, we combine a machine learning framework with four-dimensional scanning transmission electron microscopy (4D-STEM) to enable fast inference of crystalline microstructure over large fields of view. The framework employs a transformer-based architecture to predict crystallographic orientations and phases from 4D-STEM diffraction patterns, yielding spatially resolved maps of microstructural features at the nanoscale. With this framework, crystallographic orientations are inferred up to two orders of magnitude faster than widely used correlative template-matching approaches. This capability enables high-throughput characterization of complex crystalline materials and facilitates the establishment of structure-property relationships central to materials design and optimization.",
    "authors": [
      "Kwanghwi Je",
      "Ellis R. Kennedy",
      "Sungin Kim",
      "Yao Yang",
      "Erik H. Thiede"
    ],
    "published": "2026-02-12T21:17:58Z",
    "updated": "2026-02-12T21:17:58Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2601.15971v2",
    "url": "https://arxiv.org/abs/2601.15971v2",
    "pdf_url": "https://arxiv.org/pdf/2601.15971v2.pdf",
    "title": "Reaching the intrinsic performance limits of superconducting strip photon detectors up to 0.1 mm wide",
    "abstract": "Single-photon detection underpins a wide range of emerging photonic technologies, from quantum information processing and secure communications to photon-starved biomedical imaging. Among the available detector technologies, superconducting nanowire single-photon detectors (SNSPDs) combine high detection efficiency, low noise, and excellent timing resolution, making them a leading platform for photon-counting applications. However, despite decades of materials and fabrication research, detector performance has never been shown to match theoretical performance expectations. Here, we demonstrate for the first time in situ tuning of a detector from its typical, suboptimal operation, to a regime limited only by material quality, allowing the device to reach its intrinsic performance limit. Our approach is based on current-biased superconducting \"rails\" placed on either side of the detector that redistribute current across its width to achieve its peak performance. This technique not only reduces the dark count rate by ten orders of magnitude, but also enables future detectors to overcome the Pearl limit for device width, paving the way for arbitrarily large detectors. We show operation at this intrinsic performance limit for devices up to 0.1 mm wide, and also demonstrate near-unity internal detection efficiency (IDE) at a wavelength of 4um for a 20um-wide detector--a factor of 20 wider than the current state of the art.",
    "authors": [
      "Kristen M. Parzuchowski",
      "Eli Mueller",
      "Bakhrom G. Oripov",
      "Benedikt Hampel",
      "Ravin A. Chowdhury",
      "Sahil R. Patel",
      "Daniel Kuznesof",
      "Emma K. Batson",
      "Ryan Morgenstern",
      "Robert H. Hadfield",
      "Varun B. Verma",
      "Matthew D. Shaw",
      "Jason P. Allmaras",
      "Martin J. Stevens",
      "Alex Gurevich",
      "Adam N. McCaughan"
    ],
    "published": "2026-01-22T13:51:49Z",
    "updated": "2026-02-12T19:04:28Z",
    "categories": [
      "cond-mat.supr-con",
      "physics.app-ph",
      "physics.ins-det",
      "physics.optics",
      "quant-ph"
    ],
    "primary_category": "cond-mat.supr-con"
  },
  {
    "arxiv_id": "2602.12090v1",
    "url": "https://arxiv.org/abs/2602.12090v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12090v1.pdf",
    "title": "Unconditional full vector magnetometry using spin selectivity in Nitrogen Vacancy centers in diamond",
    "abstract": "Quantum sensors based on nitrogen vacancy (NV) centers in diamond have been a central topic in the sensing community for more than a decade. The extraordinary properties at room temperature of the spin system in diamond have made it one of the most prominent quantum platforms for the development of commercial quantum sensors. In particular, the sensitivity of the electronic spin in NV centers has made diamond-based magnetic sensors of special interest for their potential application in medical, industrial or navigation solutions. However, the use of these sensors for universal vector magnetometry was constrained by the need for previous knowledge on the field being measured to fully exploit their benefits. In this work, we show a method to perform unconditional vector magnetometry without the need of external information on the magnetic field, based only on the spatial arrangement of the diamond and the microwave antenna combination. While previous NV-based vector magnetometry methods require partial knowledge of the magnetic field (e.g. a calibrated bias field), we exploit the possibilities of selecting particular directions of the spins in the diamond with elliptically polarized microwave fields. We prove that our method allows to estimate both magnitude and direction of external magnetic fields without further assumptions or constraints.",
    "authors": [
      "Asier Mongelos-Martinez",
      "Jason Tarunesh Francis",
      "Julia Bertero-DiTella",
      "Geza Giedke",
      "Gabriel Molina-Terriza",
      "Ruben Pellicer-Guridi"
    ],
    "published": "2026-02-12T15:42:31Z",
    "updated": "2026-02-12T15:42:31Z",
    "categories": [
      "quant-ph",
      "physics.app-ph",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2602.12086v1",
    "url": "https://arxiv.org/abs/2602.12086v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12086v1.pdf",
    "title": "Solvothermal vapor annealing and environmental control setup with adjustable magnetic field module for GISAXS studies",
    "abstract": "A compact, modular environmental control and solvothermal vapor annealing chamber designed for maintaining a controlled atmosphere with regard to solvent humidity and temperature is presented. The setup allows ex situ and in situ grazing incidence small-angle X-ray scattering (GISAXS) investigations of thin film self-assembly and reorganization. Its modular slotting system enables stable reconfiguration, including the integration of an adjustable magnetic field module. The temperature is maintained via a water-based heating and cooling loop supplemented by resistive elements, and the solvent vapor environment is regulated using a commercial controlled mixing and evaporation unit. The performance of the setup is validated through measurements of fill and quench times together with magnetic field mapping with Gauss meter measurements and finite element simulations. Further, the versatility of the setup is demonstrated with four research examples using the chamber for solvothermal vapor annealing of block copolymer thin films together with lab-based ex situ and in situ GISAXS measurements. The portable new design offers robust environmental control and flexibility for advanced thin film investigations both in the lab and at large scale facilities. The design can be adapted for grazing incidence small-angle neutron scattering, GISANS.",
    "authors": [
      "Christian Kjeldbjerg",
      "Bo Jakobsen",
      "Miriam Varón",
      "Kim Lefmann",
      "Cathrine Frandsen",
      "Dorthe Posselt"
    ],
    "published": "2026-02-12T15:40:38Z",
    "updated": "2026-02-12T15:40:38Z",
    "categories": [
      "cond-mat.soft",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.soft"
  },
  {
    "arxiv_id": "2602.12052v1",
    "url": "https://arxiv.org/abs/2602.12052v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12052v1.pdf",
    "title": "GPU-Accelerated Analytic Simulation of Sparse Signals in Pixelated Time Projection Detector",
    "abstract": "This paper presents a GPU-accelerated simulation package,   TRED, for next-generation neutrino detectors with pixelated   charge readout, leveraging community-driven software ecosystems to   ensure sustainability and extensibility. We introduce two generic   contributions: (i) an effective-charge calculation based on Gaussian   quadrature rules for numerical integration, and (ii) a sparse,   block-binned tensor representation that enables efficient FFT-based   computation of induced signals on readout electrodes for sparsely   activated detector volumes. The former captures sub-grid structure   without requiring dense sampling, while the latter achieves low   memory usage and scalable runtime, as demonstrated in benchmark   studies. The underlying data representation is applicable to   large-scale detectors and to other computational problems involving   sparse activity.",
    "authors": [
      "Yousen Zhang",
      "Brett Viren",
      "Mary Bishai",
      "Sergey Martynenko",
      "Xin Qian",
      "Rado Razakamiandra",
      "Brooke Russell"
    ],
    "published": "2026-02-12T15:17:57Z",
    "updated": "2026-02-12T15:17:57Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.11952v1",
    "url": "https://arxiv.org/abs/2602.11952v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11952v1.pdf",
    "title": "Intrabeam Scattering",
    "abstract": "Intrabeam scattering refers to the effects of the Coulomb interaction acting between pairs of charged particles within a bunch in an accelerator. One of the main consequences of intrabeam scattering is a change in the emittances of a bunch: in some circumstances (in particular, in hadron storage rings operating above transition), the transverse and longitudinal emittances may grow over time without limit. This may restrict the performance of machines for which maintaining low beam emittance is an important requirement. In this note, we describe some of the models used to analyse the effects of intrabeam scattering, and present in particular the Piwinski formulae for the emittance growth rates. We compare the predicted changes in emittance with measurements in a number of machines operating in different parameter regimes.",
    "authors": [
      "Andrzej Wolski"
    ],
    "published": "2026-02-12T13:47:22Z",
    "updated": "2026-02-12T13:47:22Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.11884v1",
    "url": "https://arxiv.org/abs/2602.11884v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11884v1.pdf",
    "title": "Signatures of Damping Nonlinear Oscillations by KHI-induced Turbulence in Synthetic Observations",
    "abstract": "Large-amplitude decaying kink oscillations of coronal loops are strongly influenced by nonlinear processes, such as Kelvin-Helmholtz instability (KHI) and turbulence, though comprehensive theory and observational confirmation remain limited. Building on the recently developed theory on nonlinear damping by KHI-induced turbulence in impulsively driven transverse loop oscillations, we investigate its observational signatures using 3D magnetohydrodynamic simulations and forward-modelled EUV images. The simulated oscillations exhibit time-varying frequency shifts and damping rates, which are broadly consistent with nonlinear turbulence-damping theory. Additionally, they exhibit excitation of higher-order modes, slightly increased periods relative to the linear kink period, and reduced displacement amplitudes. These features are generally preserved in synthetic observations, though resolving higher-order modes requires higher spatial resolution than currently available. For loops embedded in a hotter background, hotter channels (e.g., 193 Angstroms) are more sensitive to boundary dynamics, thus their oscillations decay faster with smaller displacements and larger phase shifts than those in cooler channels (e.g., 171 Angstroms). Comparisons of simulated and synthetic oscillations show close agreement at the early stage. At later times, synthetic oscillations exhibit smaller displacements and larger phase shifts, due to turbulence-induced asymmetry in the loop cross-section. Bayesian fitting shows that the initial oscillation amplitude and kink period are robustly constrained, whereas parameters controlling the damping profile are degenerate, indicating that additional observables would aid reliable seismological inference. These results provide a quantitative basis for identifying nonlinear damping and detecting KHI-driven turbulence in transverse loop oscillations.",
    "authors": [
      "Sihui Zhong",
      "Andrew Hillier",
      "Iñigo Arregui"
    ],
    "published": "2026-02-12T12:34:14Z",
    "updated": "2026-02-12T12:34:14Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR",
    "doi": "10.3847/1538-4357/ae4223"
  },
  {
    "arxiv_id": "2602.10132v2",
    "url": "https://arxiv.org/abs/2602.10132v2",
    "pdf_url": "https://arxiv.org/pdf/2602.10132v2.pdf",
    "title": "TokaMark: A Comprehensive Benchmark for MAST Tokamak Plasma Models",
    "abstract": "Development and operation of commercially viable fusion energy reactors such as tokamaks require accurate predictions of plasma dynamics from sparse, noisy, and incomplete sensors readings. The complexity of the underlying physics and the heterogeneity of experimental data pose formidable challenges for conventional numerical methods, while simultaneously highlight the promise of modern data-native AI approaches. A major obstacle in realizing this potential is, however, the lack of curated, openly available datasets and standardized benchmarks. Existing fusion datasets are scarce, fragmented across institutions, facility-specific, and inconsistently annotated, which limits reproducibility and prevents a fair and scalable comparison of AI approaches. In this paper, we introduce TokaMark, a structured benchmark to evaluate AI models on real experimental data collected from the Mega Ampere Spherical Tokamak (MAST). TokaMark provides a comprehensive suite of tools designed to (i) unify access to multi-modal heterogeneous fusion data, and (ii) harmonize formats, metadata, temporal alignment and evaluation protocols to enable consistent cross-model and cross-task comparisons. The benchmark includes a curated list of 14 tasks spanning a range of physical mechanisms, exploiting a variety of diagnostics and covering multiple operational use cases. A baseline model is provided to facilitate transparent comparison and validation within a unified framework. By establishing a unified benchmark for both the fusion and AI-for-science communities, TokaMark aims to accelerate progress in data-driven AI-based plasma modeling, contributing to the broader goal of achieving sustainable and stable fusion energy. The benchmark, documentation, and tooling will be fully open sourced upon acceptance to encourage community adoption and contribution.",
    "authors": [
      "Cécile Rousseau",
      "Samuel Jackson",
      "Rodrigo H. Ordonez-Hurtado",
      "Nicola C. Amorisco",
      "Tobia Boschi",
      "George K. Holt",
      "Andrea Loreti",
      "Eszter Székely",
      "Alexander Whittle",
      "Adriano Agnello",
      "Stanislas Pamela",
      "Alessandra Pascale",
      "Robert Akers",
      "Juan Bernabe Moreno",
      "Sue Thorne",
      "Mykhaylo Zayats"
    ],
    "published": "2026-02-05T16:49:44Z",
    "updated": "2026-02-12T09:55:27Z",
    "categories": [
      "physics.plasm-ph",
      "cs.AI"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.11763v1",
    "url": "https://arxiv.org/abs/2602.11763v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11763v1.pdf",
    "title": "Phase-Space Topology and Spectral Flow in Screened Magnetized Plasmas",
    "abstract": "Topological wave phenomena in continuous media are fundamentally challenged by unbounded spectra and the absence of a compact Brillouin zone, which obstruct conventional bulk--interface formulations. We develop a unified phase-space framework for screened magnetized plasma based on a pseudo-Hermitian formulation with a positive-definite metric, enabling a generalized Schrödinger description and a Weyl-symbol analysis of the bulk generator. We show that the bulk symbol hosts isolated band degeneracies acting as Berry--Chern monopoles, including a higher-order spin-1 degeneracy with topological charge $+2$ that generically splits into two spin-$\\tfrac{1}{2}$ Weyl points under symmetry breaking. To characterize topology in this noncompact setting, we introduce a strip-gap Chern number associated with finite real-frequency strips of the bulk spectrum, extending band Chern topology to continuum systems. This invariant governs the spectral flow of interface modes induced by spatial variations of the magnetic field and establishes a bulk--interface correspondence at the level of phase-space symbols. By solving the interface eigenvalue problem, we demonstrate that the net spectral flow across the strip gap is determined by the enclosed monopole charge. We further show that this correspondence persists under collisional damping, provided that a finite strip gap remains and no exceptional points enter it. Our results provide a systematic phase-space framework for topological wave transport in continuous media beyond compact-band and idealized Hermitian settings.",
    "authors": [
      "Xianhao Rao",
      "Adil Yolbarsop",
      "Hong Li",
      "Wandong Liu"
    ],
    "published": "2026-02-12T09:43:30Z",
    "updated": "2026-02-12T09:43:30Z",
    "categories": [
      "cond-mat.mes-hall",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.mes-hall"
  },
  {
    "arxiv_id": "2507.15323v2",
    "url": "https://arxiv.org/abs/2507.15323v2",
    "pdf_url": "https://arxiv.org/pdf/2507.15323v2.pdf",
    "title": "Improving terahertz-detection sensitivity of 8x8 FET arrays through liquid-nitrogen cooling in a compact low-noise cryostat",
    "abstract": "We show that the sensitivity of antenna-coupled field-effect transistors (FETs) to terahertz (THz) radiation improves continuously with decreasing temperature. The noise-equivalent power (NEP) of 540 GHz patch-antenna-coupled FETs decreases as temperature reduces to 20 K. We project NEP values approaching 1 to 2 pW/sqrt(Hz) under efficient power coupling conditions (e.g., using a superstrate Si-lens), which is comparable to superconducting niobium transition-edge sensors (TESs) at 4 K. Building on these findings, a compact, low-noise, liquid-nitrogen-cooled (77 K) FET-based direct (incoherent) THz-power sensing system} for spectroscopy applications was realized. Here, an 8x8 pixel-binned detector array fabricated in a commercial 65-nm Si-CMOS process, was optimized for operation in the 2.85 to 3.4 THz band. Characterization was performed in the focal plane of a 2.85-THz quantum-cascade laser delivering approx. 2~mW of THz power. A linear dynamic range exceeding 67 dB was achieved without saturation (for 1~Hz-detection bandwidth). The system provides a -3 dB readout bandwidth of 5 MHz, exceeding that of conventional thermal detectors (typically 1 kHz). Combined with its broad temperature operability 20 K to 300 K and compact design, the system is particularly well suited for space- and payload-constrained platforms such as balloon- and satellite-based missions, where deep cryogenic cooling is impractical.",
    "authors": [
      "Jakob Holstein",
      "Nicholas K. North",
      "Arne Hof",
      "Sanchit Kondawar",
      "Dmytro B. But",
      "Mohammed Salih",
      "Lianhe Li",
      "Edmund H. Linfield",
      "A. Giles Davies",
      "Joshua R. Freeman",
      "Alexander Valavanis",
      "Alvydas Lisauskas",
      "Hartmut G. Roskos"
    ],
    "published": "2025-07-21T07:29:06Z",
    "updated": "2026-02-12T09:15:18Z",
    "categories": [
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.app-ph"
  },
  {
    "arxiv_id": "2602.11728v1",
    "url": "https://arxiv.org/abs/2602.11728v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11728v1.pdf",
    "title": "Beyond One-Thousandth Energy Resolution with an AlMn TES Detector",
    "abstract": "The superconducting Transition-Edge Sensor (TES) is a critical technology for next-generation X-ray spectrometers, known for its exceptional energy resolution. In the last decade, TESs based on AlMn alloy films have been extensively used in several cosmic microwave background (CMB) experiments. The advantages of simple fabrication process and easily tunable critical temperature make them an alternative to bilayer TESs. However, they have rarely been applied to X-ray detection until now. We developed an annular AlMn TES for X-ray detection and tested it in a dilution refrigerator with a Superconducting Quantum Interference Device (SQUID) amplifier, achieving an Full Width at Half Maximum (FWHM) of 12.1 +- 0.3 eV at 17.48 keV. To the best of our knowledge, this is the first demonstration of an AlMn TES achieving an energy resolution below 0.1%, highlighting its potential for high-resolution X-ray detection.",
    "authors": [
      "Liangpeng Xie",
      "Yifei Zhang",
      "Zhengwei Li",
      "Zhouhui Liu",
      "Shibo Shu",
      "Junjie Zhou",
      "Xufang Li",
      "Haoyu Li",
      "He Gao",
      "Yudong Gu",
      "Xuefeng Lu",
      "Yong Zhao",
      "Congzhan Liu"
    ],
    "published": "2026-02-12T08:52:29Z",
    "updated": "2026-02-12T08:52:29Z",
    "categories": [
      "astro-ph.IM",
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2601.19865v2",
    "url": "https://arxiv.org/abs/2601.19865v2",
    "pdf_url": "https://arxiv.org/pdf/2601.19865v2.pdf",
    "title": "Laboratory Tests of Laser Control of Electron Beams for Future Colliders",
    "abstract": "Laser-driven Compton backscattering (CBS) has been proposed as method for controlling the intensity of colliding bunches in the FCC-ee so as to avoid the flip-flop instability caused by intensity asymmetry in colliding bunches. Laser-based collimation has also been proposed as an indestructible collimator for high-intensity electron beams. We have initiated a laboratory-based test program of these concepts with the E344 experiment at FACET-II. In this paper, we describe simulations of laser-beam interactions at FACET-II and the relevant scaling for FCC-ee. We also describe the experimental setup and diagnostics that will be used to make the measurements at FACET-II.",
    "authors": [
      "Claire Munting",
      "Peter Kicsiny",
      "Edoardo Barbi",
      "Noe Gonzalez",
      "Spencer Gessner",
      "Illya Drebot"
    ],
    "published": "2026-01-27T18:23:38Z",
    "updated": "2026-02-12T07:11:24Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.11597v1",
    "url": "https://arxiv.org/abs/2602.11597v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11597v1.pdf",
    "title": "Performance and pulse shape discrimination of glass scintillator SG101 for neutron detection",
    "abstract": "We present a detailed characterization of the thermal neutron sensitive transparent glass scintillator SG101, benchmarked against the conventional LiF ZnS(Ag)based scintillator EJ426. The detection efficiency, energy resolution, and pulse shape discrimination (PSD) performance ofSG101 were evaluated under AmBe neutron irradiation. When coupled with organic scintillators(EJ200 or EJ276),the SG101 EJ200 system achieves a figure of merit (FOM) of 3.81 for thermal neutron/gamma separation, while the SG101 EJ276 configuration resolves three distinct particle populations gamma rays, fast neutrons, and thermal neutrons with FOM values of 3.46 and2.21, respectively. Correlation analysis reveals that the number of fast thermal neutron coincidence events significantly exceeds the accidental background, and the count of gamma fast thermal neutron triple-coincidence events is also far higher than the expected accidental rate, confirming significant physical correlations for both event types within a 100 us time window. These results demonstrate that SG101 is a promising candidate for applications requiring high-efficiency thermal neutron detection and precise event tagging coupling with a scintillator with PSD approach",
    "authors": [
      "Yuhang Liu",
      "Fengpeng An",
      "Guang Luo",
      "Wei Wang",
      "Wei Wei",
      "Xuesong Zhang",
      "Dixiao Lu",
      "Xiaohao Yin"
    ],
    "published": "2026-02-12T05:28:06Z",
    "updated": "2026-02-12T05:28:06Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2505.11361v4",
    "url": "https://arxiv.org/abs/2505.11361v4",
    "pdf_url": "https://arxiv.org/pdf/2505.11361v4.pdf",
    "title": "Magnetic dipole-dipole transition for scintillation quenching",
    "abstract": "A magnetic dipole-dipole interaction is proposed as a scintillation quenching mechanism. The interaction rate follows $R^{-6}$ as the electric dipole-dipole interaction in F$\\mathrm{\\ddot{o}}$ster resonance energy transfer theory. The proposed mechanism causes a long-range resonance energy transfer, and the resonance condition is that the spins of donor and acceptor electrons both flip, and the energy level differences are the same. The new mechanism is distinct to the known spin-orbit coupling induced intersystem crossing, and it can enhance the overall intersystem crossing rate. When oxygen or organic molecules including heavy elements are dissolved in a liquid scintillator, these requirements are possible to be satisfied. The proposal in the paper adds a new approach for scintillation quenching in liquid scintillators.",
    "authors": [
      "Zhe Wang"
    ],
    "published": "2025-05-16T15:28:56Z",
    "updated": "2026-02-12T02:15:11Z",
    "categories": [
      "physics.ins-det",
      "physics.chem-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.11422v1",
    "url": "https://arxiv.org/abs/2602.11422v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11422v1.pdf",
    "title": "Investigation of Toroidal Rotation Effects on Spherical Torus Equilibria using the Fast Spectral Solver VEQ-R",
    "abstract": "Standard reduced models often fail to adequately describe the complex geometric response of tokamak plasmas to strong toroidal rotation. In this work, we present VEQ-R, a computationally efficient spectral solver designed to calculate fixed-boundary equilibria with arbitrary toroidal flow. In contrast to computationally intensive grid-based codes, our model employs a 12-parameter shifted Chebyshev spectral expansion to explicitly resolve radial variations in high-order shaping profiles--such as dynamic elongation and triangularity. This capability allows the solver to accurately capture differential flux surface distortions (non-rigid effects) even in challenging sonic regimes ($M \\sim 1.0$). By synergizing this compact variational formulation with a novel ``Matrix-Kernel'' acceleration technique, we transform the problem into pre-computed algebraic matrix operations. This approach achieves convergence in approximately 5 ms, maintaining exceptional geometric fidelity compared to high-resolution benchmarks while balancing speed and accuracy. Our analysis reveals that rotation-induced flux compression leads to a monotonic decrease in the core safety factor $q_0$, pushing it dangerously close to unity--a structural deformation mechanism effectively captured by this approximate yet robust solver.",
    "authors": [
      "Xingyu Li",
      "Huasheng Xie",
      "Lai Wei",
      "Zhengxiong Wang"
    ],
    "published": "2026-02-11T22:50:25Z",
    "updated": "2026-02-11T22:50:25Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.11415v1",
    "url": "https://arxiv.org/abs/2602.11415v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11415v1.pdf",
    "title": "Fermilab PIP II machine protection system digitized data noise elimination scheme and its FPGA implementation",
    "abstract": "In Fermilab's PIP-II machine protection system, beam loss signals from various detectors are digitized at 125 MS/s. Noise from both high-frequency sources and low-frequency 60 Hz AC power equipment can contaminate the data. To suppress noise across these ranges especially 60 Hz and its harmonics, which overlap with beam loss signal frequencies advanced digital processing beyond standard filtering is required. Several real-time functional blocks were simulated and tested on an FPGA: (1) a dual time-constant discharging integrator filter, (2) a de-ripple baseline extraction and storage block, and (3) a fast-recovery discharging integrator. The nonlinear IIR integrator filter removes high-frequency noise and feeds into the baseline extractor. Upon detecting abrupt beam loss, it switches to a longer time constant to prevent baseline distortion. The de-ripple block calculates a valid baseline by averaging over multiple 60 Hz periods, storing results in a 4096-word FPGA RAM. This baseline is subtracted from raw data before integration by the fast-recovery block, which resets quickly after use. All blocks achieved expected performance.",
    "authors": [
      "J. Wu",
      "A. Warner"
    ],
    "published": "2026-02-11T22:36:36Z",
    "updated": "2026-02-11T22:36:36Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "0.18429/JACoW-IBIC2025-MOPMO45"
  },
  {
    "arxiv_id": "2602.11375v1",
    "url": "https://arxiv.org/abs/2602.11375v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11375v1.pdf",
    "title": "Using a 4-megapixel hybrid photon counting detector for fast, lab-based nanoscale x-ray tomography",
    "abstract": "Hybrid photon counting detectors (HPCDs) have unlocked new capabilities for x-ray-based measurements at synchrotrons around the world in the last 30 years. By leveraging independently optimized sensor and readout layers, they offer high quantum efficiency ($> 80 \\%$), ultra-low dark counts, sub-pixel point-spread function, and high count rates ($> 10^{6}$ counts per pixel per second). Furthermore, their small pixel size and large active area endow them with excellent coverage and resolution for both real-space and reciprocal space imaging. Here, we demonstrate that HPCDs are also well-suited for laboratory-based nanoscale x-ray tomography (nano-xCT). We perform nano-xCT on an integrated circuit fabricated at the 130-nm node and produce a 3D reconstruction with 40 times more photons collected 20 times faster than in this group's previous work, for an overall speedup of 800$\\times$. We review the technical considerations of using an HPCD for tabletop tomography. We quantify our reconstruction image quality using well-established metrics, including the modulation transfer function (MTF), Fourier shell correlation (FSC), and contrast-to-noise (CNR), to validate our choice of experimental parameters that provide sufficient resolution and imaging speed. Using these metrics, we determine that even under current experimental conditions, 160 nm wiring features are reconstructed at 75-80 nm spatial resolution.",
    "authors": [
      "Jordan Fonseca",
      "Zachary H. Levine",
      "Joseph W. Fowler",
      "Felix H. Kim",
      "Galen O'Neil",
      "Nathan J. Ortiz",
      "John Henry Scott",
      "Daniel S. Swetz",
      "Paul Szypryt",
      "Andras E. Vladar",
      "Nathan Nakamura"
    ],
    "published": "2026-02-11T21:08:40Z",
    "updated": "2026-02-11T21:08:40Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.11359v1",
    "url": "https://arxiv.org/abs/2602.11359v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11359v1.pdf",
    "title": "High-level hadronic tau lepton triggers of the CMS experiment in proton-proton collisions at $\\sqrt{s}$ = 13.6 TeV",
    "abstract": "The trigger system of the CMS detector is pivotal in the acquisition of data for physics measurements and searches. Studies of final states characterized by hadronic decays of tau leptons require the reconstruction and the identification of genuine tau leptons against quark- and gluon-initiated jets at the trigger level. This is a difficult task, particularly as improvements to the LHC have resulted in an increased number of interactions per bunch crossing in recent years. To address this challenge, a series of machine-learning algorithms with high identification efficiency and low computational cost have been incorporated into the high-level trigger for hadronically decaying tau leptons. In this paper, these developments and the trigger performance are summarized using data collected by the CMS experiment in proton-proton collisions at $\\sqrt{s}$ = 13.6 TeV in 2022$-$2023, corresponding to an integrated luminosity of 62 fb$^{-1}$.",
    "authors": [
      "CMS Collaboration"
    ],
    "published": "2026-02-11T20:46:53Z",
    "updated": "2026-02-11T20:46:53Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.07224v2",
    "url": "https://arxiv.org/abs/2510.07224v2",
    "pdf_url": "https://arxiv.org/pdf/2510.07224v2.pdf",
    "title": "Sextupole reduction via chaos suppression at the National Synchrotron Light Source II",
    "abstract": "We revisit the nonlinear lattice design approach for the National Synchrotron Light Source II (NSLS-II) storage ring. By suppressing chaos, we identify alternative sextupole configurations to the original design, which relied on the conventional strategy of simultaneously minimizing Resonance Driving Terms (RDT) and Amplitude-Dependent Detuning (ADD). These alternatives achieve comparable performance while requiring fewer sextupoles. A detailed comparison of two representative solutions is presented and supported by experimental validation. Our results show that the dynamic aperture correlates more strongly with global chaos than with individual RDTs, and that the importance of minimizing ADD may have been overstated in earlier design strategies.",
    "authors": [
      "Yongjun Li",
      "Minghao Song",
      "Yoshiteru Hidaka",
      "Victor Smaluk",
      "Timur Shaftan"
    ],
    "published": "2025-10-08T16:57:36Z",
    "updated": "2026-02-11T20:13:43Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.04580v2",
    "url": "https://arxiv.org/abs/2602.04580v2",
    "pdf_url": "https://arxiv.org/pdf/2602.04580v2.pdf",
    "title": "Doberman: a modular and distributed slow control system for small- to medium-scale experiments",
    "abstract": "We present Doberman (Detector OBsERving and Monitoring ApplicatioN), a lightweight, modular, and open-source slow control system designed for small-to medium-scale physics experiments. Doberman addresses the gap between heavyweight industrial SCADA frameworks and ad hoc laboratory solutions by providing a flexible software architecture that supports heterogeneous instrumentation, distributed deployment, automated control, and robust alarm handling. The web-based graphical user interface Doberview provides live and continuously updated visualization, configuration, and control of the entire experiment, supporting both routine operation and rapid response to exceptional conditions. Doberman has been deployed and validated in multiple experimental setups, ranging from a remotely operated underground gamma-ray spectrometer to a large, highly instrumented liquid xenon test facility with several hundred monitored quantities.   Doberman and Doberview are released under permissive open-source licenses, and the software, documentation, and example device integrations are publicly available.",
    "authors": [
      "Jaron Grigat",
      "Darryl Masson",
      "Marc Schumann"
    ],
    "published": "2026-02-04T14:06:28Z",
    "updated": "2026-02-11T17:46:09Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.11053v1",
    "url": "https://arxiv.org/abs/2602.11053v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11053v1.pdf",
    "title": "Collisionless relaxation as the origin of the anisotropic, non-thermal, and multi-temperature momentum distributions observed in space plasmas",
    "abstract": "Anisotropic, non-thermal, and multi-temperature distributed particle momenta are commonly observed in collisionless space plasmas, such as the solar wind. Using Liouville's theorem, we argue that anisotropic compression or expansion of the plasma, followed by a relaxation of the resulting anisotropic stress must lead to non-equilibrium states that are either anisotropic, non-thermal distribution functions, different electron and ion temperatures, or a combination of these effects. We present arguments showing that a plasma in thermal equilibrium undergoing anisotropic compression or expansion cannot return to thermal equilibrium in the absence of particle collisions. Since most astrophysical plasmas are practically collisionless and experience significant anisotropic compression or expansion, we expect anisotropic, non-thermal, and multi-temperature particle distributions to be ubiquitous, in agreement with solar wind measurements.",
    "authors": [
      "Torsten Enßlin",
      "Christoph Pfrommer"
    ],
    "published": "2026-02-11T17:20:13Z",
    "updated": "2026-02-11T17:20:13Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.11228v1",
    "url": "https://arxiv.org/abs/2602.11228v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11228v1.pdf",
    "title": "Rotation catalyzed chiral magnetovortical instability",
    "abstract": "We demonstrate that a background rotation significantly catalyzes the chiral magnetovortical instability in chiral magnetohydrodynamics. The rotation splits the linearly polarized Alfven wave into two circularly polarized magneto-Coriolis waves, one of which exhibits a lower frequency than the original Alfven wave. We find that this low-frequency magneto-Coriolis wave is always unstable in the presence of even a weak chiral vortical effect. This instability may enable new dynamo mechanism applicable to various rotating chiral plasmas.",
    "authors": [
      "Shuai Wang",
      "Xu-Guang Huang"
    ],
    "published": "2026-02-11T14:19:31Z",
    "updated": "2026-02-11T14:19:31Z",
    "categories": [
      "nucl-th",
      "astro-ph.HE",
      "hep-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "nucl-th"
  }
]