{
  "arxiv_id": "2501.08787v2",
  "url": "https://arxiv.org/abs/2501.08787v2",
  "pdf_url": "https://arxiv.org/pdf/2501.08787v2.pdf",
  "title": "Calibration-free Rydberg Atomic Receiver for Sub-MHz Wireless   Communications and Sensing",
  "abstract": "The exploitation of sub-MHz (\\textless 1 MHz) can be beneficial for a plethora of applications like underwater vehicular communication, subsurface exploration, low-frequency navigation etc. The traditional electrical receivers in this band are either hundreds of meters long or, when miniaturized, inefficient and bandwidth-limited, making them inapplicable for practical underwater implementations. Such obstacles can be circumvented by the emerging Rydberg atomic receiving technology, which is capable of detecting fields from DC up to the terahertz regime with compact structure. Against this background, we propose a method to detect sub-MHz electric fields without further calibration. Specifically, a physics-based model of the combined DC and AC-Stark response is established. Based on the model, we modulate the DC-Stark spectrum with the received signal and extract its amplitude by fitting the cycle-averaged, symmetric Stark-split peaks. Then we map this swing directly to the intrinsic atomic polarizability. By such operations, the proposed method can remove the dependence on electrode spacing or field-amplitude references. For performance evaluation, six-level Lindblad simulations and experiments are conducted at a low-frequency field of 30 kHz demonstrate a minimum detectable field of 5.3 \\text{mV}/\\text{cm}, with stable readout across practical optical-power variations. The approach manages to expand operating range of Rydberg atomic receivers below 1 MHz, and enables compact, calibration-free quantum front ends for underwater and subsurface receivers.",
  "authors": [
    "Minze Chen",
    "Tianqi Mao",
    "Wei Xiao",
    "Zhonghuai Wu",
    "Dapeng Li",
    "Mingyao Cui",
    "Qunsong Zeng",
    "Dezhi Zheng",
    "Kaibin Huang",
    "Zhaocheng Wang"
  ],
  "published": "2025-01-15T13:22:11Z",
  "updated": "2025-10-23T11:30:19Z",
  "categories": [
    "physics.ins-det",
    "physics.atom-ph"
  ],
  "primary_category": "physics.ins-det"
}