{
  "arxiv_id": "2509.11484v3",
  "url": "https://arxiv.org/abs/2509.11484v3",
  "pdf_url": "https://arxiv.org/pdf/2509.11484v3.pdf",
  "title": "The impact of kinetic and global effects on ballooning 2nd stable   pedestals of conventional and low aspect ratio tokamaks",
  "abstract": "The EPED model [P.B. Snyder et al 2011 Nucl. Fusion 51 103016] had success describing the pedestals of the Type-I ELM and QH-mode operations in conventional tokamaks, by combining kinetic ballooning mode (KBM) and peeling-ballooning (PB) constraints. Within EPED, the KBM constraint is usually approximated by the ideal ballooning mode (IBM) stability threshold. It has been noted that quantitative differences between local ideal MHD and gyro-kinetic (GK) ballooning stability can be larger at low aspect ratio. KBM critical pedestals are consistent with observations in initial studies on conventional and spherical tokamaks. In this work, the application of a reduced model for the calculation of the kinetic ballooning stability boundary is presented based on a novel and newly developed Gyro-Fluid System (GFS) code [G.M. Staebler et al 2023 Phys. Plasmas 30 102501]. GFS is observed to capture KBMs in DIII-D as well as the NSTX(-U) pedestals, opening a route integrating this model into EPED. Finally, high-n global ballooning modes are observed to limit the access to the local 2nd stability and thus provide a transport mechanism that constrains the width evolution with beta_p,ped. The high-n global ballooning stability is approximated by its ideal MHD analogue using ELITE. It is shown that nearly local high-n with k_y*rho_s~1/2 modes can provide a proxy for the critical beta_p,ped when a 2nd stable access exists on DIII-D plasmas. The use of GFS and ELITE scaling in EPED provided an improved agreement in comparison to EPED1 with DIII-D pedestal data.",
  "authors": [
    "M. S. Anastopoulos Tzanis",
    "M. Yang",
    "A. Kleiner",
    "J. F. Parisi",
    "G. M. Staebler",
    "P. B. Snyder"
  ],
  "published": "2025-09-15T00:14:56Z",
  "updated": "2025-10-20T23:16:50Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}