{
  "arxiv_id": "2510.17280v2",
  "url": "https://arxiv.org/abs/2510.17280v2",
  "pdf_url": "https://arxiv.org/pdf/2510.17280v2.pdf",
  "title": "Leakage current of high-fluence neutron-irradiated 8\" silicon sensors   for the CMS Endcap Calorimeter Upgrade",
  "abstract": "The HL-LHC will challenge the detectors with a nearly 10-fold increase in integrated luminosity compared to the previous LHC runs combined, thus the CMS detector will be upgraded to face the higher levels of radiation and the larger amounts of collision data to be collected. The High-Granularity Calorimeter will replace the current endcap calorimeters of the CMS detector. It will facilitate the use of particle-flow calorimetry with its unprecedented transverse and longitudinal readout/trigger segmentation, with more than 6M readout channels. The electromagnetic section as well as the high-radiation regions of the hadronic section of the HGCAL (fluences above $10^{14}~n_{eq.}/cm^{2}$) will be equipped with silicon pad sensors, covering a total area of 620 m$^2$. Fluences up to $10^{16}~n_{eq.}/cm^{2}$ and doses up to 1.5 MGy are expected. The sensors are processed on novel 8\" p-type wafers with an active thickness of 300 $\\mu{}m$, 200 $\\mu{}m$ and 120 $\\mu{}m$ and cut into hexagonal shapes for optimal use of the wafer area and tiling. Each sensor contains several hundred individually read out cells of two sizes (around 0.6 cm$^2$ or 1.2 cm$^2$). To investigate the radiation-induced bulk damage, the sensors have been irradiated with neutrons at RINSC to fluences between $6.5 \\times 10^{14}~n_{eq.}/cm^{2}$ and $1.4 \\times 10^{16}~n_{eq.}/cm^{2}$. Electrical characterization results are presented for full sensors, as well as for partial sensors cut from multi-geometry wafers with internal dicing lines on the HV potential within the active sensor area. Leakage current behaviour is investigated for various sensor types and fluence levels, including its temperature dependence. Finally, methods to limit the annealing time of the sensors during irradiation are investigated by analysing the impact of splitting high-fluence irradiations.",
  "authors": [
    "CMS HGCAL collaboration"
  ],
  "published": "2025-10-20T08:12:49Z",
  "updated": "2025-10-22T12:19:02Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}