[
  {
    "arxiv_id": "2510.16936v2",
    "url": "https://arxiv.org/abs/2510.16936v2",
    "pdf_url": "https://arxiv.org/pdf/2510.16936v2.pdf",
    "title": "Ionization quenching factors and W-values of low-energy H$_2^+$ and   He$^+$ ions in Ar gas at low pressure measured with a bulk resistive   MICROMEGAS",
    "abstract": "The ionization quenching factor, the fraction of an ion's initial kinetic energy lost through ionization in a medium, was measured for H$_2^+$ and He$^+$ ions within the 2.5-5 keV energy range in an Ar/CO$_2$ gas mixture at pressures between 75 and 150 mbar. The mixture was contained in the active volume of a MICROMEGAS type Micro Pattern Gaseous Detector (MPGD), which was connected to an ion source via a high vacuum system. The results showed a significant decrease in ionization as the ion energy decreased, although no dependence on gas pressure was observed within the low pressure range studied. Additionally, significant deviations from the predictions of SRIM (Stopping and Range of Ions in Matter) simulations were found. These measurements also allowed the first determination of $W$ values (the average energy required to create an electron-ion pair in the gas) for H$_2^+$ and He$^+$ ions in Ar at this particular energy range, which had not been previously explored for these projectile-target combinations. These findings are essential for accurate ion energy reconstruction in low-pressure MPGDs, with particular relevance for space-based energetic neutral atom detection, as proposed by the Italian Space Agency's SWEATERS project.",
    "authors": [
      "A. Foresi",
      "G. Antonelli",
      "C. Avanzini",
      "G. Balestri",
      "G. Bigongiari",
      "E. Bossini",
      "M. G. Callaini",
      "R. Carosi",
      "E. De Angelis",
      "F. Frasconi",
      "P. Maestro",
      "F. Morsani",
      "A. Mura",
      "L. Orsini",
      "G. Petragnani",
      "F. Pilo",
      "R. Rispoli",
      "G. Terreni"
    ],
    "published": "2025-10-19T17:15:49Z",
    "updated": "2025-10-24T06:46:05Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1016/j.nima.2025.171066"
  },
  {
    "arxiv_id": "2502.04808v2",
    "url": "https://arxiv.org/abs/2502.04808v2",
    "pdf_url": "https://arxiv.org/pdf/2502.04808v2.pdf",
    "title": "Tracking electron capture processes in classical molecular dynamics   simulations for spectral line broadening in plasmas",
    "abstract": "Plasma spectroscopy is a fundamental tool for diagnosing laboratory and astrophysical plasmas. Accurate interpretation of spectra depends upon precise modeling and comprehension of Stark broadening and other mechanisms affecting spectral lines. In this context, computer simulations have emerged as valuable tools, offering idealized experiments with well-defined conditions. Molecular dynamics simulations, in particular, excel at replicating the particle interactions within the plasma and their impact on the state of a radiating atom or ion. However, these simulations present challenges in tracking electron capture processes, since setting an unambiguous criterion to distinguish between bound and free electrons is not trivial. In this paper we introduce a new algorithm that, within a classical framework, precisely identifies the scenario in which an electron is captured by an ion and then follows a stable orbit around it. The algorithm's applicability extends to emitters with charges Z >= 1. The procedure enables the correct identification of valid time-histories of the electric microfield perturbing the emitting ion, which will be used for subsequent line shape calculations. The ionization balance results obtained from the application of this algorithm are compared with an additional method based on the potential energy of the particles in the simulations, finding good agreement, therefore validating the use of this approach.",
    "authors": [
      "D. González-Herrero",
      "G. Pérez-Callejo",
      "R. Florido",
      "M. A. Gigosos"
    ],
    "published": "2025-02-07T10:23:32Z",
    "updated": "2025-10-23T17:52:01Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.IM",
      "physics.atom-ph",
      "physics.comp-ph",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.20775v1",
    "url": "https://arxiv.org/abs/2510.20775v1",
    "pdf_url": "https://arxiv.org/pdf/2510.20775v1.pdf",
    "title": "The Opacity Project: R-Matrix Calculations for Opacities of   High-Energy-Density Astrophysical and Laboratory Plasmas",
    "abstract": "Accurate determination of opacity is critical for understanding radiation transport in both astrophysical and laboratory plasmas. We employ atomic data from R-Matrix calculations to investigate radiative properties in high-energy-density (HED) plasma sources. Specifically, we analyze environments such as the base of the convective zone (BCZ) of the Sun 2 x 10^6$ K, N_e = 10^{23}/cc and the inertial confinement fusion (ICF) device at the Sandia Z facility 2.11 x 10^6 K, N_e = 3.16 x 10^{22}/cc. We calculate Rosseland Mean Opacities (RMO) within a range of temperatures and densities and analyze how they vary under different plasma conditions. In this study, we specifically focus on electron collisional and Stark ion microfield broadening effects on autoionizing resonances in photoabsorption cross sections. Our results are relevant to astrophysical models, particularly in the context of the solar opacity problem, and provide insights into discrepancies between theoretical calculations and experimental measurements. In addition, we investigate the equation-of-state (EOS) and its impact on opacities. In addition, we examine the equation-of-state (EOS) and its impact on opacities of the \"chemical picture\" Mihalas-Hummer-Dappen EOS with respect to level populations of excited levels included in the R-matrix calculations. This study should contribute to improving opacity models of HED sources such as stellar interiors adn laboratory fusion plasma experiments.",
    "authors": [
      "Anil K. Pradhan",
      "Sultana N. Nahar"
    ],
    "published": "2025-10-23T17:47:36Z",
    "updated": "2025-10-23T17:47:36Z",
    "categories": [
      "astro-ph.HE",
      "astro-ph.SR",
      "physics.atom-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE",
    "doi": "10.3390/atoms13100085"
  },
  {
    "arxiv_id": "2508.12111v2",
    "url": "https://arxiv.org/abs/2508.12111v2",
    "pdf_url": "https://arxiv.org/pdf/2508.12111v2.pdf",
    "title": "CosmicWatch: The Desktop Muon Detector(v3X)",
    "abstract": "The CosmicWatch Desktop Muon Detector (v3X) is a compact, low-cost, and portable device designed for detecting ionizing radiation, including cosmic-ray muons. Building on previous iterations, the v3X introduces significant hardware and firmware improvements that enhance sensitivity, usability, and data acquisition capabilities. The detector integrates a plastic scintillator and silicon photomultiplier (SiPM), custom designed electronics for signal processing, onboard data storage, OLED display, environmental sensors, and USB connectivity. With a total component cost under \\$100 and a build time suitable for high school students, the v3X is ideal for education, outreach, and introductory research applications in particle and astroparticle physics. This paper details the design, performance, and potential use cases of the v3X, supported by example measurements demonstrating its functionality.",
    "authors": [
      "Spencer Axani",
      "Masooma Sarfraz",
      "Miles Garcia",
      "Collin Owens",
      "Katarzyna Frankiewicz",
      "Janet M. Conrad"
    ],
    "published": "2025-08-16T17:32:22Z",
    "updated": "2025-10-23T17:07:53Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/10/P10040"
  },
  {
    "arxiv_id": "2503.19657v2",
    "url": "https://arxiv.org/abs/2503.19657v2",
    "pdf_url": "https://arxiv.org/pdf/2503.19657v2.pdf",
    "title": "Homogenized harmonic balance finite element method for nonlinear eddy   current simulations of fast corrector magnets",
    "abstract": "This paper develops a homogenized harmonic balance finite element method (HomHBFEM) to predict the dynamic behavior of magnets with fast excitation cycles, including eddy current and skin effects. A homogenization technique for laminated yokes avoids resolving the individual laminates and the skin depth in the finite element (FE) mesh. Instead, the yoke is represented by a bulk surrogate material with frequency-dependent parameters. The ferromagnetic saturation of the yoke at higher excitation currents is tackled by a harmonic balance method, which accounts for a coupled set of frequency components. Thereby, a computationally expensive time-stepping of the eddy-current field problem and a convolution of the homogenized yoke model are avoided. The HomHBFEM enables, for the first time, to conduct nonlinear simulations of fast corrector magnets, which are embedded in a fast orbit feedback system to counteract orbit disturbances over a broad frequency spectrum, and thus guarantee a stable light-source operation. The results show the impact of the nonlinearity on the phase lag and the field attenuation as well as the eddy current losses at frequencies up to 65 kHz. The numerical validation for a C-dipole magnet example shows that the HomHBFEM achieves a sufficient accuracy at an affordable computational effort, with simulation times of a few hours. In comparison, standard 3D transient FE simulations need to resolve the lamination thickness and the skin depth in space and the largest relevant frequency in time, which leads to a two to three orders of magnitude larger mesh and prohibitive computational effort, with simulation times of a few weeks on a contemporary computer server.",
    "authors": [
      "Jan-Magnus Christmann",
      "Laura Anna Maria D'Angelo",
      "Herbert De Gersem",
      "Sven Pfeiffer",
      "Sajjad Hussain Mirza",
      "Matthias Thede",
      "Alexander Aloev",
      "Holger Schlarb"
    ],
    "published": "2025-03-25T13:44:46Z",
    "updated": "2025-10-23T16:30:18Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.1103/9mnn-w7lj"
  },
  {
    "arxiv_id": "2507.18369v2",
    "url": "https://arxiv.org/abs/2507.18369v2",
    "pdf_url": "https://arxiv.org/pdf/2507.18369v2.pdf",
    "title": "Reducing suspension control noise with interferometric sensors -- an   experimental concept",
    "abstract": "One of the limiting noise sources of ground-based gravitational wave detectors at frequencies below 30 Hz is control-induced displacement noise. Compact laser interferometric sensors are a prime candidate for improved local displacement sensing. In this paper we present the design of an experiment that aims to demonstrate the advantages of interferometric sensors over shadow sensors. We focus on the compact balanced readout interferometer (COBRI) - a sensor currently in development that is based on deep frequency modulation. We mount COBRIs on two HAM Relay Triple Suspension (HRTS) systems that suspend two mirrors forming an optical cavity. By measuring the length stability of this cavity relative to a stable reference we aim to probe the direct motion reduction when using COBRIs for active damping and we aim to investigate their behavior and auxiliary functions, such as absolute ranging, in the context of the 6 degree-of-freedom controls of the suspensions. Here we describe the design of the experiment and simulations of the achievable noise levels that were obtained using mechanical models of the HRTS suspensions. We discuss all relevant noise sources, the modeled influence of the interferometric sensor damping and the current limitations and necessary improvements of our testing facility in terms of seismic pre-isolation to achieve a shadow sensor limited noise at around 5 Hz, where, according to our simulations, we can demonstrate superior performance for COBRIs in the longitudinal degree of freedom.",
    "authors": [
      "Nils Leander Weickhardt",
      "Artem Basalaev",
      "Oliver Gerberding"
    ],
    "published": "2025-07-24T12:47:51Z",
    "updated": "2025-10-23T15:41:50Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.20628v1",
    "url": "https://arxiv.org/abs/2510.20628v1",
    "pdf_url": "https://arxiv.org/pdf/2510.20628v1.pdf",
    "title": "Magnetic Field-Line Curvature and Its Role in Particle Acceleration by   Magnetically Dominated Turbulence",
    "abstract": "We employ first-principles, fully kinetic particle-in-cell simulations to investigate magnetic field-line curvature in magnetically dominated turbulent plasmas and its role in particle acceleration through curvature-drift motion along the motional electric field. By varying the fluctuation-to-mean magnetic-field ratio $\\delta B_0/B_0$, we examine curvature $\\kappa$ statistics and their connection to particle acceleration. The curvature probability densities display broad power-law wings, scaling linearly in $\\kappa$ below the peak and developing hard high-$\\kappa$ tails for $\\delta B_0/B_0 \\gtrsim 1$. As the mean field strengthens, the high-$\\kappa$ tails steepen, and large-curvature events are suppressed when $\\delta B_0/B_0 \\ll 1$. The probability density functions of magnetic field-line contraction, ${\\bf v}_E \\cdot {\\bf \\kappa}$, with ${\\bf v}_E$ the field-line velocity, develop power-law tails well described by a symmetric Pareto distribution, characteristic of stochastic energy exchanges, with the tails becoming harder as $\\delta B_0/B_0$ increases. Our guiding-center analysis shows that curvature-drift acceleration accounts for a substantial fraction of the energization via the motional electric field, and that it strengthens with increasing $\\delta B_0/B_0$. For well-magnetized particles, curvature-drift acceleration typically exceeds ${\\bf\\nabla}B$ drift, polarization drift, and betatron contributions. These results identify curvature-drift acceleration as a principal pathway through which magnetized turbulence transfers energy to nonthermal particles in astrophysical plasmas.",
    "authors": [
      "Samuel Sebastian",
      "Luca Comisso"
    ],
    "published": "2025-10-23T15:02:34Z",
    "updated": "2025-10-23T15:02:34Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2501.08787v2",
    "url": "https://arxiv.org/abs/2501.08787v2",
    "pdf_url": "https://arxiv.org/pdf/2501.08787v2.pdf",
    "title": "Calibration-free Rydberg Atomic Receiver for Sub-MHz Wireless   Communications and Sensing",
    "abstract": "The exploitation of sub-MHz (\\textless 1 MHz) can be beneficial for a plethora of applications like underwater vehicular communication, subsurface exploration, low-frequency navigation etc. The traditional electrical receivers in this band are either hundreds of meters long or, when miniaturized, inefficient and bandwidth-limited, making them inapplicable for practical underwater implementations. Such obstacles can be circumvented by the emerging Rydberg atomic receiving technology, which is capable of detecting fields from DC up to the terahertz regime with compact structure. Against this background, we propose a method to detect sub-MHz electric fields without further calibration. Specifically, a physics-based model of the combined DC and AC-Stark response is established. Based on the model, we modulate the DC-Stark spectrum with the received signal and extract its amplitude by fitting the cycle-averaged, symmetric Stark-split peaks. Then we map this swing directly to the intrinsic atomic polarizability. By such operations, the proposed method can remove the dependence on electrode spacing or field-amplitude references. For performance evaluation, six-level Lindblad simulations and experiments are conducted at a low-frequency field of 30 kHz demonstrate a minimum detectable field of 5.3 \\text{mV}/\\text{cm}, with stable readout across practical optical-power variations. The approach manages to expand operating range of Rydberg atomic receivers below 1 MHz, and enables compact, calibration-free quantum front ends for underwater and subsurface receivers.",
    "authors": [
      "Minze Chen",
      "Tianqi Mao",
      "Wei Xiao",
      "Zhonghuai Wu",
      "Dapeng Li",
      "Mingyao Cui",
      "Qunsong Zeng",
      "Dezhi Zheng",
      "Kaibin Huang",
      "Zhaocheng Wang"
    ],
    "published": "2025-01-15T13:22:11Z",
    "updated": "2025-10-23T11:30:19Z",
    "categories": [
      "physics.ins-det",
      "physics.atom-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2506.18705v2",
    "url": "https://arxiv.org/abs/2506.18705v2",
    "pdf_url": "https://arxiv.org/pdf/2506.18705v2.pdf",
    "title": "Flux-driven turbulent transport using penalisation in the   Hasegawa-Wakatani system",
    "abstract": "First numerical results from the newly-developed pseudo-spectral code P-FLARE (Penalised FLux-driven Algorithm for REduced models) are presented. This flux-driven turbulence/transport code uses a pseudo-spectral formulation with the penalisation method in order to impose radial boundary conditions. Its concise, flexible structure allows implementing various quasi-two dimensional reduced fluid models in flux-driven formulation. Here, results from simulations of the modified Hasegawa-Wakatani system are discussed, where particle transport and zonal flow formation, together with profile relaxation, are studied. It is shown that coupled spreading/profile relaxation that one obtains for this system is consistent with a simple one dimensional model of coupled spreading/transport equations. Then, the effect of a particle source is investigated, which results in the observation of sandpile-like critical behaviour. The model displays profile stiffness for certain parameters, with very different input fluxes resulting in very similar mean density gradients. This is due to different zonal flow levels around the critical value for the control parameter (i.e. the ratio of the adiabaticity parameter to the mean gradient) and the existence for this system of a hysteresis loop for the transition from 2D turbulence to a zonal flow dominated state.",
    "authors": [
      "Pierre L. Guillon",
      "Özgür D. Gürcan",
      "Guilhem Dif-Pradalier",
      "Yanick Sarazin",
      "Nicolas Fedorczak"
    ],
    "published": "2025-06-23T14:44:02Z",
    "updated": "2025-10-23T07:28:17Z",
    "categories": [
      "physics.plasm-ph",
      "physics.flu-dyn"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1017/S0022377825100895"
  },
  {
    "arxiv_id": "2510.20105v1",
    "url": "https://arxiv.org/abs/2510.20105v1",
    "pdf_url": "https://arxiv.org/pdf/2510.20105v1.pdf",
    "title": "High Gain Fusion Target Design using Generative Artificial Intelligence",
    "abstract": "By returning to the topological basics of fusion target design, Generative Artificial Intelligence (genAI) is used to specify how to initially configure and drive the optimally entangled topological state, and stabilize that topological state from disruption. This can be applied to all methods; including tokamaks, laser-driven schemes, and pulsed-power driven schemes. The result is practical, room temperature targets that can yield up to 10 GJ of energy, driven by as little as 3 MJ of absorbed energy. The genAI is based on the concept of Ubuntu that replaces the Deep Convolutional Neural Network approximation of a functional, with the formula for the generating functional of a canonical transformation from the domain of the canonical field momentums and fields, to the domain of the canonical momentums and coordinates, that is the Reduced Order Model. This formula is a logical process of renormalization, enabling Heisenberg's canonical approach to field theory, via calculation of the S-matrix, given observation of the fields. This can be viewed as topological characterization and control of collective, that is complex, systems.",
    "authors": [
      "Michael E. Glinsky"
    ],
    "published": "2025-10-23T01:17:29Z",
    "updated": "2025-10-23T01:17:29Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.09086v3",
    "url": "https://arxiv.org/abs/2507.09086v3",
    "pdf_url": "https://arxiv.org/pdf/2507.09086v3.pdf",
    "title": "Long Term Study of Sedimentation and Biofouling at Cascadia Basin, the   Site of the Pacific Ocean Neutrino Experiment",
    "abstract": "STRings for Absorption Length in Water (STRAW)-a and b were pathfinder instruments deployed to characterize the anticipated site of the Pacific Ocean Neutrino Experiment (P-ONE), which is a future neutrino telescope that will be located in the North Pacific Ocean. Measurements of the evolution of the optical transmission efficiency from STRAW-a showed a decline over the detector's lifetime for the upward-facing modules. Video footage of the pathfinders strongly suggested this decline was caused by biofouling and sedimentation. We measure the effect of biofouling and sedimentation to be a decrease in the transparency of upward-facing optical surfaces over 5 years of operations. A majority of downward-facing optical surfaces, which will dominate P-ONE's sensitivity to astrophysical sources, showed no visible biofouling. Extrapolations motivated by biological growth models estimated that these losses started around 2.5 years after deployment, and suggest a reduction in transparency ranging from 35$\\%$ of the original to complete obscuration for the upward-facing modules. Samples of biofouling were taken in order to identify the microbial diversity of these organisms and inform potential intervention strategies. Results of the microbial samples and a candidate anti-biofouling strategy that will be tested on upcoming P-ONE instruments are discussed.",
    "authors": [
      "O. Aghaei",
      "M. Agostini",
      "S. Agreda",
      "A. Alexander Wight",
      "P. S. Barbeau",
      "A. J. Baron",
      "S. Bash",
      "C. Bellenghi",
      "B. Biffard",
      "M. Boehmer",
      "M. Brandenburg",
      "D. Brussow",
      "N. Cedarblade-Jones",
      "M. Charlton",
      "B. Crudele",
      "M. Danninger",
      "F. C. De Leo",
      "T. DeYoung",
      "F. Fuchs",
      "A. Gärtner",
      "J. Garriz",
      "D. Ghuman",
      "L. Ginzkey",
      "V. Gousy-Leblanc",
      "D. Grant",
      "A. Grimes",
      "C. Haack",
      "R. Halliday",
      "D. Hembroff",
      "F. Henningsen",
      "J. Hutchinson",
      "R. Jenkyns",
      "S. Karanth",
      "T. Kerscher",
      "S. Kershtein",
      "K. Kopański",
      "C. Kopper",
      "P. Krause",
      "C. B. Krauss",
      "I. Kulin",
      "N. Kurahashi",
      "C. Lagunas Gualda",
      "A. Lam",
      "T. Lavallee",
      "K. Leismüller",
      "R. Li",
      "S. Loipolder",
      "A. Magaña Ponce",
      "S. Magel",
      "P. Malecki",
      "G. G. Marshall",
      "T. Martin",
      "S. Mihaly",
      "C. Miller",
      "N. Molberg",
      "R. Moore",
      "B. Nührenbörger",
      "B. Nichol",
      "W. Noga",
      "R. Ørsøe",
      "L. Papp",
      "V. Parrish",
      "M. Paulson",
      "P. Pfahler",
      "B. Pirenne",
      "E. Price",
      "A. Rahlin",
      "M. Rangen",
      "E. Resconi",
      "C. Ridsdale",
      "S. Robertson",
      "A. Round",
      "D. Salazar-Gallegos",
      "A. Scholz",
      "L. Schumacher",
      "S. Sharma",
      "C. Spannfellner",
      "J. Stacho",
      "I. Taboada",
      "A. R. Thurber",
      "M. Tradewell",
      "J. P. Twagirayezu",
      "M. Un Nisa",
      "B. Veenstra",
      "S. Wagner",
      "C. Weaver",
      "N. Whitehorn",
      "L. Winter",
      "M. Wolf",
      "R. Wroński",
      "J. H. Wynne",
      "J. P. Yañez",
      "A. Zaalishvili"
    ],
    "published": "2025-07-12T00:07:18Z",
    "updated": "2025-10-22T22:07:18Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2510.12960v2",
    "url": "https://arxiv.org/abs/2510.12960v2",
    "pdf_url": "https://arxiv.org/pdf/2510.12960v2.pdf",
    "title": "Master Oscillator and Phase Reference Line Design for the PIP-II Linac",
    "abstract": "The phase averaging reference line system provides the RF phase reference, LO and clock signals to the LLRF and other accelerator sub-systems. The PIP-II linac has RF systems at three frequencies - 162.5 MHz, 325 MHz and 650 MHz. A temperature-stabilized, low-phase-noise oscillator is used as the master oscillator. Phase reference signals at 162.5 MHz, 325 MHz, and 650 MHz, along with LO signals at 182.5 MHz, 345 MHz, 670 MHz and LLRF clocks at 1320 MHz and 1300 MHz, are generated in temperature-controlled RF modules at each frequency section. A phase reference from each module travels to the next section, where it is doubled to produce required frequencies. The reference also travels alongside the accelerating cavities in the tunnel, allowing cavity probe and reference cables to temperature track and reduce measurement errors from temperature changes or phase drift.",
    "authors": [
      "A. Syed",
      "B. Vaughn",
      "P. Varghese",
      "E. Cullerton",
      "S. Stevenson",
      "D. Pieper",
      "D. Peterson",
      "J. Holzbauer",
      "R. Madrak",
      "A. Mosher",
      "D. Klepec"
    ],
    "published": "2025-10-14T20:11:32Z",
    "updated": "2025-10-22T21:04:03Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.19786v1",
    "url": "https://arxiv.org/abs/2510.19786v1",
    "pdf_url": "https://arxiv.org/pdf/2510.19786v1.pdf",
    "title": "First Observation of Dispersive Shock Waves in an Electron Beam",
    "abstract": "Dispersive shock waves (DSWs) are expanding nonlinear wave trains that arise when dispersion regularizes a steepening front, a phenomenon observed in fluids, plasmas, optics, and superfluids. Here we report the first experimental observation of DSWs in an intense electron beam, using the University of Maryland Electron Ring (UMER). A localized induction-cell perturbation produced a negative density pulse that evolved into a leading soliton-like peak followed by an expanding train of oscillations. The leading peak satisfied soliton scaling laws for width^2 vs inverse amplitude and velocity vs amplitude, while the total wave-train width increased linearly with time, consistent with Korteweg--de Vries (KdV) predictions. Successive peaks showed decreasing amplitude and velocity toward the trailing edge, in agreement with dispersive shock ordering. These results demonstrate that intense charged particle beams provide a new laboratory platform for studying dispersive hydrodynamics, extending nonlinear wave physics into the high-intensity beam regime.",
    "authors": [
      "H. McCright",
      "I. G. Abel",
      "I. Haber",
      "P. G. O'Shea",
      "B. L. Beaudoin"
    ],
    "published": "2025-10-22T17:21:26Z",
    "updated": "2025-10-22T17:21:26Z",
    "categories": [
      "physics.acc-ph",
      "nlin.PS",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.19729v1",
    "url": "https://arxiv.org/abs/2510.19729v1",
    "pdf_url": "https://arxiv.org/pdf/2510.19729v1.pdf",
    "title": "Coupling of neutrino beam-driven MHD waves and resonant instabilities in   rotating magnetoplasmas with neutrino two-flavor oscillations",
    "abstract": "We present an analysis of neutrino-driven magnetohydrodynamic (MHD) waves and instabilities in a rotating magnetoplasma with weak neutrino interactions. We show, for the first time, that neutrino-driven shear Alfv{\\'e}n and oblique magnetosonic waves can be coupled by the Coriolis force, forming new wave modes affected by this force, as well as neutrino beam and two neutrino flavor oscillations. Our work extends previous theories by demonstrating that shear Alfv{\\'e}n waves are influenced by neutrino effects and by identifying instabilities resulting from resonant interactions with both a streaming neutrino beam and flavor oscillations. We find that the Coriolis force, as well as plasma density and magnetic field strength, have a significant impact on the profiles of the instability growth rates. Our findings may shed new light on the physical mechanisms underlying core-collapse supernovae.",
    "authors": [
      "Jyoti Turi",
      "Amar P. Misra"
    ],
    "published": "2025-10-22T16:17:32Z",
    "updated": "2025-10-22T16:17:32Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2510.19724v1",
    "url": "https://arxiv.org/abs/2510.19724v1",
    "pdf_url": "https://arxiv.org/pdf/2510.19724v1.pdf",
    "title": "Afterpulse prediction for SUBMET experiment",
    "abstract": "The SUB-Millicharge ExperimenT (SUBMET) investigates an unexplored parameter space of millicharged particles with mass $m_\\chi < $ 1.6 GeV/c$^2$ and charge $Q_\\chi < 10^{-3}e$. The detector consists of an Eljen-200 plastic scintillator coupled to a Hamamatsu Photonics R7725 photomultiplier tube (PMT). PMT afterpulses, delayed pulses produced after an energetic pulse, have been observed in the SUBMET readout system, especially following primary pulses with a large area. We present a prediction method for afterpulse rates based on measurable parameters, which reproduces the observed rate with approximately 20\\% precision. This approach enables a better understanding of afterpulse contributions and, consequently, improves the reliability of background predictions.",
    "authors": [
      "Claudio Campagnari",
      "Sungwoong Cho",
      "Suyong Choi",
      "Seokju Chung",
      "Matthew Citron",
      "Ryan De Los Santos",
      "Albert De Roeck",
      "Martin Gastal",
      "Seungkyu Ha",
      "Andy Haas",
      "Christopher Scott Hill",
      "Byeong Jin Hong",
      "Haeyun Hwang",
      "Insung Hwang",
      "Hoyong Jeong",
      "Minseo Kim",
      "Hyunki Moon",
      "Jayashri Padmanaban",
      "Ryan Schmitz",
      "Changhyun Seo",
      "David Stuart",
      "Juan Salvador Tafoya Vargas",
      "Eunil Won",
      "Jae Hyeok Yoo",
      "Jinseok Yoo",
      "Ayman Youssef",
      "Ahmad Zaraket",
      "Haitham Zaraket",
      "Collin Zheng"
    ],
    "published": "2025-10-22T16:08:34Z",
    "updated": "2025-10-22T16:08:34Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.19690v1",
    "url": "https://arxiv.org/abs/2510.19690v1",
    "pdf_url": "https://arxiv.org/pdf/2510.19690v1.pdf",
    "title": "Modification of ion-temperature-gradient turbulence by impurities in   stellarator plasmas",
    "abstract": "Recent nonlinear gyrokinetic simulations have shown that impurities can strongly modify the turbulent heat flux in stellarator plasmas. Here, the ion-temperature-gradient (ITG) dispersion relation in a plasma containing impurities is analytically solved in certain limits and an expression for the modification of the ITG growth rate by impurities is derived. The analytical expression is the sum of three terms corresponding to three different physical causes (impurity density gradient, impurity temperature gradient and dilution) of the change in the growth rate. The scalings predicted analytically for the modification of the growth rate are shown to be reproduced by linear gyrokinetic simulations. The conditions for reduction or increase of the ITG growth by impurities are also correctly predicted by the analytical solution to the dispersion relation. Finally, a remarkable correlation is found between the analytical expression for the modification of the growth rate and the modification of the turbulent heat flux obtained from nonlinear gyrokinetic simulations.",
    "authors": [
      "Ivan Calvo",
      "Felix I. Parra",
      "Hanne Thienpondt",
      "Jose Manuel Garcia-Regaña"
    ],
    "published": "2025-10-22T15:38:02Z",
    "updated": "2025-10-22T15:38:02Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.13192v2",
    "url": "https://arxiv.org/abs/2510.13192v2",
    "pdf_url": "https://arxiv.org/pdf/2510.13192v2.pdf",
    "title": "RFSoC Based LLRF System Design at ALS",
    "abstract": "The Advanced Light Source (ALS) at LBNL is upgrading several LLRF systems for its Linac and Sub-Harmonic Bunchers, where it is desired to have a unified LLRF system design to support various RF frequencies (at 125MHz, 500MHz and 3GHz) and configurations. This paper demonstrates an open-source, direct sampling RFSoC based LLRF system design, featuring: sample-to-sample Multi-Tile Synchronization, deterministic latency, digital up/down conversion, arbitrary waveform generation and acquisition, in-pulse closed loop control, timing and EPICS integration, modular RF frontend and hardware designs. Measured RF characteristics show that the RFSoC based LLRF system is able to meet the system requirements.",
    "authors": [
      "Qiang Du",
      "Shreeharshini Murthy",
      "Victoria Moore",
      "Angel Jurado Lopez",
      "Michael Chin",
      "Shree Subhasish Basak",
      "David Nett",
      "Benjamin Flugstad"
    ],
    "published": "2025-10-15T06:29:08Z",
    "updated": "2025-10-22T14:11:01Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.14657v4",
    "url": "https://arxiv.org/abs/2508.14657v4",
    "pdf_url": "https://arxiv.org/pdf/2508.14657v4.pdf",
    "title": "Phase space transport, quasilinear diffusion and locality in phase   velocity",
    "abstract": "In this paper, we address the motion of charged particles subjected to a discrete spectrum of electrostatic waves. We focus on situations when transport dominates, leading to significant variations in particle velocity. Nonetheless, these velocity changes remain finite due to the presence of KAM tori bounding phase space. We analyze the conditions under which transport can be modeled as a diffusion process and evaluate the relevance of the so-called quasilinear value of the diffusion coefficient. We distinguish between traditional quasilinear diffusion, when wave-particle interaction is perturbative, and the so-called chaotic regime of diffusion, when the particle motion looks erratic. In the perturbative regime, we demonstrate both numerically and theoretically that diffusion occurs only when wave-particle interaction is local in phase velocity; that is, when wave contributions from phase velocities far from the particles instantaneous velocities are negligible. Conversely, numerical results indicate that chaotic diffusion can occur even when wave-particle interaction is not local. However, without locality, the diffusion coefficient is not the quasilinear one. Furthermore, in regimes when quasilinear diffusion is applicable, we introduce a simple analytical expression for the time evolution of the velocity distribution function, that accounts for phase space boundaries.",
    "authors": [
      "Didier Bénisti"
    ],
    "published": "2025-08-20T12:16:51Z",
    "updated": "2025-10-22T13:26:35Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.19543v1",
    "url": "https://arxiv.org/abs/2510.19543v1",
    "pdf_url": "https://arxiv.org/pdf/2510.19543v1.pdf",
    "title": "Microtearing Turbulence and Its Role in High-Density-Gradient Plasmas in   Wendelstein 7-X",
    "abstract": "Gyrokinetic simulations reveal that microtearing mode (MTM) turbulence dominates transport in a Wendelstein 7-X (W7-X) discharge characterized by large density gradients, moderate temperature gradients, and low plasma beta. This conclusion is supported by the close agreement between simulated and experimentally measured heat and particle fluxes. The emergence of MTMs is attributed to the absence of competing instabilities -- such as ion temperature gradient modes and density-gradient-driven trapped-electron modes -- under these plasma conditions, together with the stabilizing influence of the W7-X max-J magnetic configuration. Furthermore, moderate collisionality and low magnetic shear are found to facilitate MTM onset. These findings advance the understanding of high-density-gradient regimes, which are essential for achieving high-performance operation in W7-X plasmas.",
    "authors": [
      "H. Cu-Castillo",
      "A. Bañón Navarro",
      "G. Merlo",
      "F. Reimold",
      "T. Romba",
      "O. Ford",
      "S. Bannmann",
      "L. Vanó",
      "M. Wappl",
      "J. Geiger",
      "A. Zocco",
      "F. Jenko",
      "the W7-X team"
    ],
    "published": "2025-10-22T12:50:15Z",
    "updated": "2025-10-22T12:50:15Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.15738v3",
    "url": "https://arxiv.org/abs/2506.15738v3",
    "pdf_url": "https://arxiv.org/pdf/2506.15738v3.pdf",
    "title": "Simulation studies of the isovector reorientation effect of deuteron   scattering on heavy target",
    "abstract": "The isovector reorientation (IVR) effect of deuteron scattering on heavy target provides a novel means to probe the nuclear isovector potential, which gives rise to the nuclear symmetry energy. The simulation studies on the experimental measurement of IVR effect using the SAMURAI terminal at RIKEN Nishina center have been performed to demonstrate the feasibility of the experiment. By introducing a well-designed polarimeter to detect the $\\mathrm{p}(\\vec{\\mathrm{d}}, \\mathrm{d})\\mathrm{p}$ elastic scattering, monitoring of the tensor polarization of the deuteron beam can be implemented. The protons and neutrons produced by the breakup of polarized deuterons scattering off heavy targets are designed to be measured by proton drift chamber (PDC) combined with the SAMURAI magnet and NEBULA detector, respectively. The detector responses are simulated using Geant4 framework, where the events of the deuteron elastic breakup are generated by an Improved Quantum Molecular Dynamics model. The results of reconstructing the deuteron breakup events demonstrate the feasibility of detecting the IVR effect at SAMURAI with both longitudinal and transverse tensor polarized deuteron beams with a polarization degree of approximately 80\\%.",
    "authors": [
      "Baiting Tian",
      "Boyuan Zhang",
      "Dawei Si",
      "Sheng Xiao",
      "Yijie Wang",
      "Tadaaki Isobe",
      "Hideaki Otsu",
      "Li Ou",
      "Zhigang Xiao"
    ],
    "published": "2025-06-17T08:55:22Z",
    "updated": "2025-10-22T12:33:34Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex",
      "nucl-th"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.17280v2",
    "url": "https://arxiv.org/abs/2510.17280v2",
    "pdf_url": "https://arxiv.org/pdf/2510.17280v2.pdf",
    "title": "Leakage current of high-fluence neutron-irradiated 8\" silicon sensors   for the CMS Endcap Calorimeter Upgrade",
    "abstract": "The HL-LHC will challenge the detectors with a nearly 10-fold increase in integrated luminosity compared to the previous LHC runs combined, thus the CMS detector will be upgraded to face the higher levels of radiation and the larger amounts of collision data to be collected. The High-Granularity Calorimeter will replace the current endcap calorimeters of the CMS detector. It will facilitate the use of particle-flow calorimetry with its unprecedented transverse and longitudinal readout/trigger segmentation, with more than 6M readout channels. The electromagnetic section as well as the high-radiation regions of the hadronic section of the HGCAL (fluences above $10^{14}~n_{eq.}/cm^{2}$) will be equipped with silicon pad sensors, covering a total area of 620 m$^2$. Fluences up to $10^{16}~n_{eq.}/cm^{2}$ and doses up to 1.5 MGy are expected. The sensors are processed on novel 8\" p-type wafers with an active thickness of 300 $\\mu{}m$, 200 $\\mu{}m$ and 120 $\\mu{}m$ and cut into hexagonal shapes for optimal use of the wafer area and tiling. Each sensor contains several hundred individually read out cells of two sizes (around 0.6 cm$^2$ or 1.2 cm$^2$). To investigate the radiation-induced bulk damage, the sensors have been irradiated with neutrons at RINSC to fluences between $6.5 \\times 10^{14}~n_{eq.}/cm^{2}$ and $1.4 \\times 10^{16}~n_{eq.}/cm^{2}$. Electrical characterization results are presented for full sensors, as well as for partial sensors cut from multi-geometry wafers with internal dicing lines on the HV potential within the active sensor area. Leakage current behaviour is investigated for various sensor types and fluence levels, including its temperature dependence. Finally, methods to limit the annealing time of the sensors during irradiation are investigated by analysing the impact of splitting high-fluence irradiations.",
    "authors": [
      "CMS HGCAL collaboration"
    ],
    "published": "2025-10-20T08:12:49Z",
    "updated": "2025-10-22T12:19:02Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.19519v1",
    "url": "https://arxiv.org/abs/2510.19519v1",
    "pdf_url": "https://arxiv.org/pdf/2510.19519v1.pdf",
    "title": "Acceleration gradients in dielectric laser accelerators with   triangular-shaped gratings",
    "abstract": "The study investigated transparent on-chip structures with a rectangular profile and triangular profiles with grating ridge base angles of $\\alpha = 36^\\circ$, $30^\\circ$, and $20^\\circ$. Each triangular structure had both left- and right-handed profile orientations. For all variants, a modified version with a reflective gold coating was additionally considered. The maximum energy gains and accelerating gradients were determined and quantified for all structure classes: transparent and reflective (with both rectangular and triangular profiles).",
    "authors": [
      "O. O. Svystunov",
      "I. V. Beznosenko",
      "A. V. Vasyliev",
      "R. R. Kniaziev",
      "G. V. Sotnikov"
    ],
    "published": "2025-10-22T12:18:21Z",
    "updated": "2025-10-22T12:18:21Z",
    "categories": [
      "physics.optics",
      "physics.acc-ph",
      "physics.comp-ph",
      "78A40, 78A50, 78A60,",
      "I.6.8; J.2; K.8.1"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2510.19469v1",
    "url": "https://arxiv.org/abs/2510.19469v1",
    "pdf_url": "https://arxiv.org/pdf/2510.19469v1.pdf",
    "title": "Advances in detector response and background modelling in the ANAIS-112   experiment for annual modulation and other rare event searches",
    "abstract": "Numerous astronomical and cosmological observations point to the existence of dark matter, which constitutes about 27% of the Universe. Despite extensive efforts, only the DAMA/LIBRA experiment, using NaI(Tl) detectors at Gran Sasso National Laboratory, has reported a positive dark matter signal. To independently verify this result, using the same NaI target is essential. This is the goal of ANAIS-112, operating with 112.5 kg of NaI(Tl) scintillators since 2017 at the Canfranc Underground Laboratory (LSC). This thesis presents work within ANAIS-112, focusing on data analysis and the development of Geant4-based simulations to reduce systematics and increase sensitivity. Efforts have focused on understanding the ANAIS-112 crystals' response to nuclear recoils. Systematic uncertainties related to the scintillation quenching factors (QFs) of sodium and iodine recoiling in NaI(Tl) must be addressed to ensure reliable comparisons with DAMA/LIBRA and other experiments. For that purpose, onsite neutron calibrations in ANAIS-112 have been performed since 2021 at LSC using 252Cf sources. This work has compared calibration data with Geant4-based neutron simulations, which has revealed Geant4 deficiencies in certain decay processes and cross sections in some versions. The simulations have proven highly sensitive to the QF used, favouring models in which the QF increases with energy and disfavouring DAMA values. In parallel, this thesis has contributed to improving the ANAIS-112 background model through a multiparametric fit of its background components. New physics searches have been conducted using ANAIS-112 data, including a reanalysis of the annual modulation signal and a search for solar axions using six years of exposure. Finally, this thesis also includes work within the COSINUS experiment, focused on background modelling and the impact of internal backgrounds on the experiment's sensitivity.",
    "authors": [
      "Tamara Pardo Yanguas"
    ],
    "published": "2025-10-22T11:04:14Z",
    "updated": "2025-10-22T11:04:14Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2404.03580v5",
    "url": "https://arxiv.org/abs/2404.03580v5",
    "pdf_url": "https://arxiv.org/pdf/2404.03580v5.pdf",
    "title": "The CCube reconstruction algorithm for the SoLid experiment",
    "abstract": "The SoLid experiment is a very-short-baseline experiment aimed at searching for nuclear reactor-produced active to sterile antineutrino oscillations. The detection principle is based on the pairing of two types of solid scintillators: polyvinyl toluene and $^6$LiF:ZnS(Ag), which is a new technology used in this field of Physics. In addition to good neutron-gamma discrimination, this setup allows the detector to be highly segmented (the basic detection unit is a 5 cm side cube). High segmentation provides numerous advantages, including the precise location of Inverse Beta Decay (IBD) products, the derivation of the considerate antineutrino energy estimator, and a powerful background reduction tool based on the topological signature of the signal. Finally, the system is read out by a network of wavelength-shifting fibres coupled to a photodetector (MPPC). This paper describes the design of the reconstruction algorithm that allows maximum use of the granularity of the detector. The goal of the algorithm is to convert the output of the optical-fibre readout to the list of the detection units from which it originated. This paper provides a performance comparison for three methods and concludes with a choice of the baseline approach for the experiment.",
    "authors": [
      "The SoLid collaboration"
    ],
    "published": "2024-04-04T16:42:41Z",
    "updated": "2025-10-22T10:44:46Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1016/j.nima.2024.169628"
  },
  {
    "arxiv_id": "2507.05180v4",
    "url": "https://arxiv.org/abs/2507.05180v4",
    "pdf_url": "https://arxiv.org/pdf/2507.05180v4.pdf",
    "title": "Electromagnetic energy calibration of the SoLid detector with horizontal   muons",
    "abstract": "SoLid is a neutrino experiment at very-short baseline searching for active-to-sterile oscillations of reactor antineutrinos. The detection principle is based on the pairing of two types of solid scintillators: polyvinyl toluene and $^6$Li:ZnS(Ag), which is a new technology used in this field of Physics. In addition to good neutron-gamma discrimination, this setup allows the detector to be highly segmented; the basic detection unit is a 5 cm cube. High segmentation provides numerous advantages including precise localisation of the Inverse Beta Decay (IBD) products, the derivation of an antineutrino energy estimator based on the isolated positron energy, and a powerful background reduction tool that relies on the topological signature of the signal. Finally, the system is read out by a network of WLS fibres coupled to photosensors. A relative electromagnetic calibration is performed with horizontal cosmic muons. This source poses the simplest calibration problem in which a single detection unit is involved. In addition, large muon energy deposits allow us to perform a calibration at the most detailed level (i.e. per fibre) and to accurately define the fraction of energy escaping to neighbouring detection cells. A statistical precision at the sub-percent level is reached. The paper also discusses two methods to calibrate the absolute energy scale. The first method relies on horizontal muons, though the precision is limited to around 10\\% because of the uncertainty in the energy distribution of such muons. A novel, alternative method based on the radioactive AmBe source is proposed. It takes advantage of the electron-positron pair-production process and provides a calibration point at 3.4 MeV (i.e. in the core of the IBD positron spectrum). The paper is concluded with various cross-check including a determination of the energy spectrum of the standard cosmogenic background candle: $^{12}$B.",
    "authors": [
      "SoLid collaboration"
    ],
    "published": "2025-07-07T16:35:32Z",
    "updated": "2025-10-22T10:30:41Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/10/P10022"
  },
  {
    "arxiv_id": "2510.09113v2",
    "url": "https://arxiv.org/abs/2510.09113v2",
    "pdf_url": "https://arxiv.org/pdf/2510.09113v2.pdf",
    "title": "Influence of an external static magnetic field on prebreakdown electron   emission and heating",
    "abstract": "High magnetic fields can increase the occurrence of vacuum arcing, suggesting that both electric and magnetic fields can play a role in the vacuum arcing process. The mechanism of vacuum arcing in high magnetic fields is believed to involve both the cathode and the anode, with the cathode serving as the originator of field-emitting nanoprotrusions or tips, while the anode serves a secondary role. Significant heating of the anode surface can be achieved by magnetic focusing of the emitted electron beam, leading to increased heat flux due to greater current density. We simulated the emitted electron beam in different configurations of the electric and magnetic fields using the particle-in-cell (PIC) and finite element methods (FEM). The heating caused by the impacting electron beam was simulated for magnetic fields ranging from 0 T to 30 T. The directions of the electric and magnetic fields were found to play a major role in the focusing of the electron beam. We found that a sufficient temperature increase on the anode surface for evaporation can be reached at magnetic fields on the order of 10-30 T, suggesting the possibility of plasma initiation on the anode side.",
    "authors": [
      "Roni Koitermaa",
      "Marzhan Toktaganova",
      "Andreas Kyritsakis",
      "Tauno Tiirats",
      "Alexej Grudiev",
      "Veronika Zadin",
      "Flyura Djurabekova"
    ],
    "published": "2025-10-10T08:05:37Z",
    "updated": "2025-10-22T09:55:25Z",
    "categories": [
      "physics.acc-ph",
      "cond-mat.mtrl-sci",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.13844v2",
    "url": "https://arxiv.org/abs/2508.13844v2",
    "pdf_url": "https://arxiv.org/pdf/2508.13844v2.pdf",
    "title": "Low-temperature Performance of $\\mathrm{Gd_3(Ga, Al)_5O_{12}}$:Ce   Scintillators",
    "abstract": "The last years have seen the first cryogenic detectors to be proposed for usage on balloon-borne missions. In such missions, the instrument will be exposed to the high radiation environment of the upper atmosphere. This radiation can induce a significant background to the measurements, something which can be mitigated through the use of an anti-coincidence shield. For hard X-ray and gamma-ray detectors such a shield typically consists photomultiplier tubes or, more recently, silicon photomultipliers coupled to scintillators placed around the detector. When using cryogenic detectors, the shield can be placed around the entire cryostat which will make it large, heavy and expensive. For the ASCENT (A SuperConducting ENergetic x-ray Telescope) mission, which uses Transition Edge Detectors, it was therefore considered to instead place the shield inside. This comes with the challenge of operating it at cryogenic temperatures. For this purpose, we tested the performance of 2 different types of GAGG:Ce scintillators down to 15 mK for the first time. Although significant variations of both the decay time and the light yield were found when varying the temperature, at 4 K its performance was found to be similar to that at room temperature. Furthermore, unexpected behavior around 2 K was found for both types of GAGG:Ce, leading to more in depth studies around these temperatures. Overall, the studies show that the combination of materials will allow to produce a functional anti-coincidence shield at several Kelvin.",
    "authors": [
      "Merlin Kole",
      "Kasun Wimalasena",
      "Richard Gorby",
      "Torsten Diesel",
      "Zachary Greenberg",
      "Fabian Kislat"
    ],
    "published": "2025-08-19T14:07:03Z",
    "updated": "2025-10-22T08:32:37Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.05096v2",
    "url": "https://arxiv.org/abs/2508.05096v2",
    "pdf_url": "https://arxiv.org/pdf/2508.05096v2.pdf",
    "title": "A mobile high spatial-resolution Muography instrument based on   large-area Micromegas detectors",
    "abstract": "Muon radiography is an imaging technique based on muon absorption in matter that allows measurement of internal details in hidden objects or structures. This technique relies on measuring cosmic-ray muons tracks accurately, which reflects the incoming muon flux from both the target object and the open sky. In this paper, we report on the construction of a high spatial resolution muography instrument based on Micromegas detectors. Using four layers of 400 mm ${\\times}$ 400 mm Micromegas detectors, channel multiplexing circuits, and the versatile readout system, a moveable muography instrument named $\\mu$STC-R400 was designed and constructed. Results show that the channel multiplexing circuits can resolve hit positions correctly, and the spatial resolution of the detector is approximately 190 ${\\mu}$m. Experiments were conducted at an under-construction subway tunnel and outdoors near a mountain, demonstrating the ${\\mu}$STC-R400's ability to maintain high spatial resolution outside the laboratory and its robustness in harsh environments.",
    "authors": [
      "Yu Wang",
      "Shubin Liu",
      "Zhihang Yao",
      "Yulin Liu",
      "Zhiyong Zhang",
      "Zhengyang He",
      "Ziwen Pan",
      "Changqing Feng"
    ],
    "published": "2025-08-07T07:34:36Z",
    "updated": "2025-10-22T06:29:11Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.06074v2",
    "url": "https://arxiv.org/abs/2507.06074v2",
    "pdf_url": "https://arxiv.org/pdf/2507.06074v2.pdf",
    "title": "Simulation of surface x-ray emission from the ASTERICS ECR ion source",
    "abstract": "The bremsstrahlung x-ray emission induced by the impact of plasma electrons de-confined on the chamber wall of the ASTERICS electron cyclotron resonance ion source is investigated through a suite of two simulation codes. The electron high energy temperature distribution tail at the wall is found to be anisotropic and increases with Bmin. The electrons impinge the walls with broad angular distribution peaking at angles ranging between 5-25{\\deg} with respect to the surface, which has consequences on the x-ray emission directionality and on the yield of electrons bouncing back toward the plasma, reaching up to 50%. The x-ray dose is mapped inside and around the ion source for Bmin = 0.8 T and an electron temperature artificially increased to 120 keV to dimension with margin the cave shielding. The dose without shielding reaches 100 $\\mu$Sv/h per kW of impacting electrons at 5 m. A set of internal and external shielding is presented to attenuate this dose and reduce it to less than 1 $\\mu$Sv/h per kW of electrons. A parametric electron distribution temperature study with Fluka indicates that the deposition of 1 W of heat in the superconducting cold mass per kW of plasma electrons, as reported experimentally, is obtained when the temperature is set to 380 keV. Such a result is compatible with previous experiments achieved on several ion sources showing an x-ray spectral temperature 3 to 4 times higher radially.",
    "authors": [
      "Thomas Thuillier",
      "Andrea Cernuschi",
      "Benjamin Cheymol"
    ],
    "published": "2025-07-08T15:15:39Z",
    "updated": "2025-10-22T05:49:41Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.19228v1",
    "url": "https://arxiv.org/abs/2510.19228v1",
    "pdf_url": "https://arxiv.org/pdf/2510.19228v1.pdf",
    "title": "Laser fabrication of Ti stent and facile MEMS flow sensor integration   for implantable respiration monitoring",
    "abstract": "Animal experiments play a vital role in drug discovery and development by providing essential data on a drug's efficacy, safety, and physiological effects before advancing to human clinical trials. In this study, we propose a stent-based flow sensor designed to measure airflow in the airways of laboratory animals. The stent was fabricated from biocompatible Ti using a combination of fiber laser digital processing and an origami-inspired folding technique. The sensing structure was developed through standard micro-electromechanical systems (MEMS) microfabrication technology. To integrate the sensing structure with the metallic stent, a facile insertion process was employed, where the sensor film was positioned at the stent's center using its natural buckling mechanism. Once fabricated, the stent implant was expanded and installed within an airway-mimicking tube to validate its functionality. A proof-of-concept trial using an artificial ventilator successfully demonstrated real-time respiration monitoring, confirming the feasibility of the proposed system for airflow measurement in preclinical studies. This stent-based sensor offers a promising approach for enhancing respiratory assessments in laboratory animals, potentially improving the accuracy of drug evaluations and respiratory disease research.",
    "authors": [
      "Muhammad Salman Al Farisi",
      "Takuya Kawata",
      "Yoshihiro Hasegawa",
      "Mohammad Nizar Mohamed Zukri",
      "Miyoko Matsushima",
      "Tsutomu Kawabe",
      "Mitsuhiro Shikida"
    ],
    "published": "2025-10-22T04:27:42Z",
    "updated": "2025-10-22T04:27:42Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1016/j.sna.2025.117083"
  },
  {
    "arxiv_id": "2510.19115v1",
    "url": "https://arxiv.org/abs/2510.19115v1",
    "pdf_url": "https://arxiv.org/pdf/2510.19115v1.pdf",
    "title": "Quantitative measurement of magnetic dichroic signals at sub-nanometer   to atomic scale resolution conditions",
    "abstract": "When aiming for atomic resolution electron magnetic circular dichroism (EMCD) in STEM mode, the high convergence angle of the electron probe can lead to unforeseen artefacts and strong reductions of the signal to noise ratio (SNR) in the measurement of magnetic magnitudes. In this work, the EMCD signal is measured in STEM mode at semi-convergence angles ranging from \\alpha=\\ 2-10\\ mrad\\ using iron samples with high structural perfection. We observe that the relative EMCD signal remains very similar for all convergence angles, which is in good agreement with simulations. The improvement in the signal-to-noise ratio as compared to earlier works is due to better crystalline quality of the Fe sample, high control of the sample orientation, better control over sample thickness, and factors such as higher beam current and the use of a fast and sensitive hybrid-pixel electron detector. One of the key factors to remove experimental ambivalences is the use of an acquisition geometry where the two conjugate EMCD spectra are acquired simultaneously. Furthermore the high crystalline quality Fe sample enables the acquisition of statistical entities of spectra at the same sample orientation, which in turn results in high SNR EMCD signals. We obtain high SNR EMCD signals for all semi convergence angles and could measure the orbital to spin magnetic moment ratio ml/ms with high precision. We observed that at high convergence angles, the ml/ms ratio gets sensitive to minute changes in sample orientation.",
    "authors": [
      "Sharath Kumar Manjeshwar Sathyanath",
      "Anna L. Ravensburg",
      "Vassilios Kapaklis",
      "Jan Rusz",
      "Björgvin Hjörvarsson",
      "Klaus Leifer"
    ],
    "published": "2025-10-21T22:21:49Z",
    "updated": "2025-10-21T22:21:49Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.15913v2",
    "url": "https://arxiv.org/abs/2510.15913v2",
    "pdf_url": "https://arxiv.org/pdf/2510.15913v2.pdf",
    "title": "Response of wavelength-shifting and scintillating-wavelength-shifting   fibers to ionizing radiation",
    "abstract": "We report results of characterizing the response and light transport of wavelength-shifting (WLS) and scintillating-wavelength-shifting (Sci-WLS) fibers under irradiation by radioactive $\\alpha$, $\\beta$, and $\\gamma$ sources. Light yield and light transmission were measured for the WLS fiber BCF-91A from Saint-Gobain and for a new Sci-WLS fiber EJ-160 from Eljen Technology.   The two variants with different fluor mixtures, EJ-160I and EJ-160II, exhibited approximately five and seven times higher light yield than BCF-91A, respectively, while their attenuation lengths were 3.80\\,m for BCF-91A, 4.00\\,m for EJ-160I, and 2.50\\,m for EJ-160II.",
    "authors": [
      "W. Bae",
      "J. Cesar",
      "K. Chen",
      "J. Cho",
      "D. Du",
      "J. Edgar",
      "L. Earthman",
      "O. M. Falana",
      "M. Gajda",
      "C. Hurlbut",
      "M. Jackson",
      "K. Lang",
      "C. Lee",
      "J. Y. Lee",
      "E. Liang",
      "J. Liu",
      "C. Maxwell",
      "C. Murthy",
      "D. Myers",
      "S. Nguyen",
      "T. O'Brien",
      "M. Proga",
      "S. Syed",
      "M. Zalikha",
      "J. Zey"
    ],
    "published": "2025-09-26T22:01:11Z",
    "updated": "2025-10-21T22:05:49Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.20390v3",
    "url": "https://arxiv.org/abs/2509.20390v3",
    "pdf_url": "https://arxiv.org/pdf/2509.20390v3.pdf",
    "title": "Optical characterization of wavelength-shifting and   scintillating-wavelength-shifting fibers",
    "abstract": "We report results of optical characterizations of new wavelength-shifting and scintillating-wavelength-shifting fibers EJ-182 and EJ-160 from Eljen Technology and compare them to the wavelength-shifting fiber BCF-91A from Saint-Gobain. The wavelength-dependence of attenuation was derived from spectral measurements confirming that the long attenuation length increases with wavelength, while short attenuation effects become less significant at longer wavelengths. The impact of environmental refractive index was measured by immersing a fiber in water. Immersing the fibers in water reduced the light yield and led to a suppression of the short attenuation length, consistent with the expected decrease in the refractive index contrast.",
    "authors": [
      "W. Bae",
      "J. Cesar",
      "K. Chen",
      "J. Cho",
      "D. Du",
      "J. Edgar",
      "L. Earthman",
      "O. M. Falana",
      "M. Gajda",
      "C. Hurlbut",
      "M. Jackson",
      "K. Lang",
      "C. Lee",
      "J. Y. Lee",
      "E. Liang",
      "J. Liu",
      "C. Maxwell",
      "C. Murthy",
      "D. Myers",
      "S. Nguyen",
      "T. O'Brien",
      "M. Proga",
      "T. Rodriguez",
      "S. Syed",
      "M. Zalikha",
      "J. Zey"
    ],
    "published": "2025-09-22T22:15:06Z",
    "updated": "2025-10-21T21:52:30Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2502.15847v3",
    "url": "https://arxiv.org/abs/2502.15847v3",
    "pdf_url": "https://arxiv.org/pdf/2502.15847v3.pdf",
    "title": "Improving Optics Control and Measurement at RHIC",
    "abstract": "In order to aid in luminosity maximization at the interaction point (IP), the collision location $s_{IP}$ must be equivalent to the location of the minimum value of the beta function $s^*$. Accurate optics measurements and $s^*$ movements are therefore essential to luminosity optimization. However, according to current Relativistic Heavy Ion Collider (RHIC) operations measurements, average horizontal beta beat measurements between operating IPs are around $20\\%$ along with significant variation in $s^*$ measurements. A sensitivity matrix was shown to successfully move $s^*$ and the linear optics to their desired values using power supply currents at the 8 o'clock interaction region (IR8). A method to measure the linear optics using the one-turn map within IRs was explored and compared with other mature methods. An error analysis was also included for all optics measurements methods. Through these methods, a $10\\%$ beat reduction was consistently achieved while moving $s^*_x$ as well significant improvement to variations in $s^*$ measurements. These methods used at the RHIC control room will be updated for future linear optics analysis and control.",
    "authors": [
      "W. Fung",
      "Y. Hao",
      "X. Gu",
      "G. Robert-Demolaize"
    ],
    "published": "2025-02-20T23:06:41Z",
    "updated": "2025-10-21T21:14:07Z",
    "categories": [
      "physics.acc-ph",
      "nucl-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.19076v1",
    "url": "https://arxiv.org/abs/2510.19076v1",
    "pdf_url": "https://arxiv.org/pdf/2510.19076v1.pdf",
    "title": "Improved high-gradient performance for medium-velocity superconducting   half-wave resonators: Surface preparation and trapped flux mitigation",
    "abstract": "A development effort to improve the performance of superconducting radio-frequency half-wave resonators (SRF HWRs) is underway at the Facility for Rare Isotope Beams (FRIB), where 220 such resonators are in operation. Our goal was to achieve an intrinsic quality factor (Q0) of >= 2E10 at an accelerating gradient (Ea) of 12 MV/m. FRIB production resonators were prepared with buffered chemical polishing (BCP). First trials on electropolishing (EP) and post-EP low temperature baking (LTB) of FRIB HWRs allowed us to reach higher gradient (15 MV/m, limited by quench) with a higher quality factor at high gradient, but Q0 was still below our goal. Trapped magnetic flux during the Dewar test was found to be a source of Q0 reduction. Three strategies were used to reduce the trapped flux: (i) adding a local magnetic shield (LMGS) to supplement the ``global'' magnetic shield around the Dewar for reduction of the ambient magnetic field; (ii) performing a ``uniform cool-down'' (UC) to reduce the thermoelectric currents; and (iii) using a compensation coil to further reduce the ambient field with active field cancellation (AFC). The LMGS improved the Q0, but not enough to reach our goal. With UC and AFC, we exceeded our goal, reaching Q0 = 2.8E10 at Ea = 12 MV/m.",
    "authors": [
      "Yuting Wu",
      "Kenji Saito",
      "Alex Taylor",
      "Andrei Ganshyn",
      "Chris Compton",
      "Ethan Metzgar",
      "Kyle Elliott",
      "Laura Popielarski",
      "Sam Miller",
      "Sang-hoon Kim",
      "Spencer Combs",
      "Taro Konomi",
      "Ting Xu",
      "Walter Hartung",
      "Wei Chang",
      "Yoo-Lim Cheon"
    ],
    "published": "2025-10-21T21:04:10Z",
    "updated": "2025-10-21T21:04:10Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.21028v2",
    "url": "https://arxiv.org/abs/2508.21028v2",
    "pdf_url": "https://arxiv.org/pdf/2508.21028v2.pdf",
    "title": "Response of AC-coupled Low Gain Avalanche Detectors to Ionizing and   Non-ionizing Radiation Damage",
    "abstract": "Low gain avalanche diodes with DC- and AC-coupled readout were exposed to ionizing and non-ionizing radiation at levels relevant to future experiments in particle, nuclear, and medical physics and to astrophysics. Damage-related change in their acceptor removal constants and in the resistivity of the region between the guard ring and the active area are reported, as is change in the leakage current and depletion voltages of the active volumes.",
    "authors": [
      "Jiahe Si",
      "Gabriele D'Amen",
      "Mohamed Hijas Mohamed Farook",
      "Gabriele Giacomini",
      "Martin R. Hoeferkamp",
      "Sally Seidel",
      "Alessandro Tricoli"
    ],
    "published": "2025-08-28T17:30:52Z",
    "updated": "2025-10-21T19:36:09Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.18838v1",
    "url": "https://arxiv.org/abs/2510.18838v1",
    "pdf_url": "https://arxiv.org/pdf/2510.18838v1.pdf",
    "title": "PCMS: Parallel Coupler For Multimodel Simulations",
    "abstract": "This paper presents the Parallel Coupler for Multimodel Simulations (PCMS), a new GPU accelerated generalized coupling framework for coupling simulation codes on leadership class supercomputers. PCMS includes distributed control and field mapping methods for up to five dimensions. For field mapping PCMS can utilize discretization and field information to accommodate physics constraints. PCMS is demonstrated with a coupling of the gyrokinetic microturbulence code XGC with a Monte Carlo neutral transport code DEGAS2 and with a 5D distribution function coupling of an energetic particle transport code (GNET) to a gyrokinetic microturbulence code (GTC). Weak scaling is also demonstrated on up to 2,080 GPUs of Frontier with a weak scaling efficiency of 85%.",
    "authors": [
      "Jacob S. Merson",
      "Cameron W. Smith",
      "Mark S. Shephard",
      "Fuad Hasan",
      "Abhiyan Paudel",
      "Angel Castillo-Crooke",
      "Joyal Mathew",
      "Mohammad Elahi"
    ],
    "published": "2025-10-21T17:33:10Z",
    "updated": "2025-10-21T17:33:10Z",
    "categories": [
      "cs.DC",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "cs.DC"
  },
  {
    "arxiv_id": "2510.15062v2",
    "url": "https://arxiv.org/abs/2510.15062v2",
    "pdf_url": "https://arxiv.org/pdf/2510.15062v2.pdf",
    "title": "Geometric scaling of laser-driven proton focusing from hemispherical   foils",
    "abstract": "We systematically characterize the focusing behavior of laser-driven proton beams from hemispherical targets of various diameters using mesh radiography. The proton focal location is inferred to be near the geometrical center for the smallest tested hemisphere ($\\Psi=D_{hemi}/D_{Laser}=6.1$). However, larger hemispheres ($\\Psi=14.6$) degrade the focusing behavior and behave more like flat foils with focal location significantly inside the hemisphere. We also infer a tight virtual focus of $9\\pm3~\\mu$m through a mesh transition analysis.",
    "authors": [
      "Jesse Griff-McMahon",
      "Xavier Vaisseau",
      "William Fox",
      "Kirill Lezhnin",
      "Krish Bhutwala",
      "Ryan Nedbailo",
      "Valeria Opsina-Bohórquez",
      "Timo Karpowski",
      "Pravesh K. Patel",
      "Sophia Malko"
    ],
    "published": "2025-10-16T18:23:18Z",
    "updated": "2025-10-21T13:55:05Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.17716v2",
    "url": "https://arxiv.org/abs/2509.17716v2",
    "pdf_url": "https://arxiv.org/pdf/2509.17716v2.pdf",
    "title": "Experimental and numerical study on Following Streamer mechanism for SF6   breakdown induced by floating linear metal particles",
    "abstract": "A recently proposed Following Streamer mechanism (Feng et al. 2025 Phys. Rev. Applied 23 064039) seeks to explain how floating metal particles induce SF6 streamer breakdown in the combined gap. This mechanism is derived from a 2D axisymmetric fluid model, which has limitations in describing multiple streamer events in real-world 3D scenarios. To validate the Following Streamer mechanism, we experimentally investigate the discharge morphology of SF6 streamers induced by a floating linear metal particle under negative pulsed voltage. The results are then compared with those from 2D axisymmetric fluid simulations. The comparison reveals both consistencies and discrepancies. Regarding consistencies, experimentally observed features-such as streamer inception at both ends of the metal particle and the formation of subsequent following streamers-support the general idea of the Following Streamer mechanism. Regarding discrepancies, the experiments show a larger number of following streamers and off-axis propagation paths, which cannot be described in the 2D simulation. For scientific rigor, an extended physical model was proposed to improve the description of the Following Streamer mechanism.",
    "authors": [
      "Zihao Feng"
    ],
    "published": "2025-09-22T12:51:36Z",
    "updated": "2025-10-21T13:46:41Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.10657v3",
    "url": "https://arxiv.org/abs/2510.10657v3",
    "pdf_url": "https://arxiv.org/pdf/2510.10657v3.pdf",
    "title": "Unlocking New Frontiers: The Versatile Potential of the Brazilian   Multipurpose Reactor",
    "abstract": "The multipurpose nature of nuclear research reactors has been investigated. This class of reactors has gained momentum within the international community, given the multiple benefits of nuclear technology in medicine, agriculture, industry, and the development of new materials, being characterized by the simultaneous use of several applications. In this context, Brazil has recently joined the group of countries with multipurpose reactor projects. The Brazilian Multipurpose Reactor (RMB) will be Brazil's new neutron source, with a thermal power of $30$ $MW$, with a core flux on the order of $\\phi=4\\times 10^{14}$ $n/cm^{2}s$ and a power density of $312.5$ $W/cm^3$, ensuring the production of radioisotopes, material and fuel irradiation testing, and neutron beam applications. In this work, the demand for neutron fluxes in different irradiation targets is investigated by Monte Carlo simulations under a perturbation caused by a highly neutron-absorbing material, the Gadolinium-157 (Gd-157) isotope. The results show that Molybdenum-99 (Mo-99) production is not affected by the Gd-157 target, and the minimum proposed thermal neutron flux for the reactor's activity ($\\phi_{min}=5.1\\times 10^{12}$ $n/cm^{2}s$) is guaranteed even at maximum operational capacity. The potential production of Terbium (Tb) isotopes for nuclear medicine applications in the RMB is briefly discussed.",
    "authors": [
      "Luiz P. de Oliveira",
      "Alexandre P. S. Souza",
      "Carlos G. S. Santos",
      "Iberê R. S. Júnior",
      "Barbara P. G. Silva",
      "Marco A. S. Pereira",
      "Frederico A. Genezini",
      "José A. Perrotta"
    ],
    "published": "2025-10-12T15:25:24Z",
    "updated": "2025-10-21T13:42:11Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.08113v2",
    "url": "https://arxiv.org/abs/2507.08113v2",
    "pdf_url": "https://arxiv.org/pdf/2507.08113v2.pdf",
    "title": "Uncertainty quantification of a multi-component Hall thruster model at   varying facility pressures",
    "abstract": "Bayesian inference is applied to calibrate and quantify prediction uncertainty in a coupled multi-component Hall thruster model. The model consists of cathode, discharge, and plume sub-models and outputs thruster performance metrics, one-dimensional plasma properties, and the angular distribution of the current density in the plume. The simulated thrusters include a magnetically shielded thruster operating on krypton, the H9, and an unshielded thruster operating on xenon, the SPT-100, at pressures between 4.3--43 $\\mu$Torr-Kr and 1.7--80 $\\mu$Torr-Xe, respectively. After calibration, the model captures key pressure-related trends, including changes in thrust and upstream shifts in the ion acceleration region. Furthermore, the model exhibits predictive accuracy to within 10\\% when evaluated on flow rates and pressures not included in the training data, and can predict some performance characteristics across test facilities to within the same range of conditions. Compared to a previous model calibrated on some of the same data [Eckels et al. 2024], the model reduced predictive errors in thrust and discharge current by greater than 50%. An extrapolation to on-orbit performance is performed with an error of 9%, capturing trends in discharge current but not thrust. These findings are discussed in the context of using data for predictive Hall thruster modeling in the presence of facility effects.",
    "authors": [
      "Thomas A. Marks",
      "Joshua D. Eckels",
      "Gabriel E. Mora",
      "Alex A. Gorodetsky"
    ],
    "published": "2025-07-10T18:53:51Z",
    "updated": "2025-10-21T13:02:48Z",
    "categories": [
      "stat.AP",
      "physics.comp-ph",
      "physics.plasm-ph",
      "stat.ML",
      "G.3; J.2"
    ],
    "primary_category": "stat.AP",
    "doi": "10.1063/5.0283796"
  },
  {
    "arxiv_id": "2501.16654v2",
    "url": "https://arxiv.org/abs/2501.16654v2",
    "pdf_url": "https://arxiv.org/pdf/2501.16654v2.pdf",
    "title": "The space charge effects on the intra-bunch motion under large   chromaticity at the Main Ring in the Japan Proton Accelerator Research   Complex",
    "abstract": "In general, optimizing chromaticity and transverse feedback parameters is important in suppressing beam instabilities for stable operation in high-intensity proton machines. Meanwhile, space charge effects impact the intrabunch motion of the proton bunch within a large chromaticity region in the machines, such as the main ring (MR) in the Japan Proton Accelerator Research Complex (J-PARC). To address this issue, the decoherence and recoherence of the transverse motion of the particles comprising the proton bunch are investigated. The analysis reveals that the space charge effects have a significant influence on the recoherence period through the chromaticity. Nevertheless, the relationship between the maximum frequency in the bunch and the chromaticity is not affected by the space charge effects. These findings are demonstrated with particle tracking simulations including the direct and indirect space charge effects, and the impedance source of the J-PARC MR. Furthermore, we illustrate the influence of the indirect space charge effect on particle motion by examining the excitation patterns of radial and head-tail modes.",
    "authors": [
      "Nobuyuki Yoshimura",
      "Takeshi Toyama",
      "Yoshihiro Shobuda"
    ],
    "published": "2025-01-28T02:38:05Z",
    "updated": "2025-10-21T12:39:49Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.11832v2",
    "url": "https://arxiv.org/abs/2508.11832v2",
    "pdf_url": "https://arxiv.org/pdf/2508.11832v2.pdf",
    "title": "Controlling the recovery time of the superconducting nanowire   single-photon detector with a voltage-controlled cryogenic tunable resistor",
    "abstract": "Superconducting nanowire single-photon detectors (SNSPD), owing to their unique performance, are currently the standard detector in most demanding single-photon experiments. One important metric for any single-photon detector is the deadtime (or recovery time), defined as the minimum temporal separation between consecutive detection events. In SNSPDs, the recovery time is more subtle, as the detection efficiency does not abruptly drop to zero when the temporal separation between detection events gets smaller, instead, it increases gradually as the SNSPD current recovers. SNSPD's recovery time is dominated by its kinetic inductance, the readout impedance, and the degree of saturation of internal efficiency. Decreasing the kinetic inductance or increasing the readout impedance can accelerate the recovery process. Significant reduction of the SNSPD recovery time, by, for example, adding a series resistor in the readout circuitry, is possible but can lead to detector latching which hinders further detector operation or enforces underbiasing and hence a reduction in detection efficiency. Previous research has demonstrated passive resistive networks for the reduction of recovery time that rely on trial and error to find the appropriate resistance values. Here we show, using a novel, cryogenically compatible, and tunable resistor technology, one can find the optimized impedance values, delivering fast SNSPD recovery time, while maintaining maximum internal detection efficiency. Here we show an increase of more than 2 folds in both maximum achievable detection rates and the achievable detection efficiency at high photon fluxes, demonstrating detection rates as high as 120 Mcps with no loss of internal detection efficiency.",
    "authors": [
      "Hui Wang",
      "Nikita Dmitrievic Orlov",
      "Niels Noordzij",
      "Thomas Descamps",
      "J. W. Niels Los",
      "Val Zwiller",
      "Iman Esmaeil Zadeh"
    ],
    "published": "2025-08-15T22:43:48Z",
    "updated": "2025-10-21T12:33:31Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.17425v2",
    "url": "https://arxiv.org/abs/2507.17425v2",
    "pdf_url": "https://arxiv.org/pdf/2507.17425v2.pdf",
    "title": "Readout electronics for low occupancy High-Pressure Gas TPCs",
    "abstract": "HPgTPCs have benefits such as low energy threshold, magnetisability, and 4$\\pi$ acceptance, making them ideal for neutrino experiments such as DUNE. We present the design of an FPGA-based solution optimised for ND-GAr, which is part of the Phase-II more capable near detector for DUNE. These electronics reduce the cost significantly compared to using collider readout electronics which are typically designed for much higher occupancy and therefore, for example, need much larger numbers of FPGAs and power per channel. We demonstrate the performance of our electronics with the TOAD at Fermilab in the US at a range of pressures and gas mixtures up to 4.5barA, reading out ~10000 channels from a multi-wire proportional chamber. The operation took place between April and July of 2024. We measure the noise characteristics of the system to be sufficiently low and we identify sources of noise that can be further mitigated in the next iteration. We also note that the cooling scheme used in the test requires improvement before full-scale deployment. Despite these necessary improvements, we show that the system can fulfil the needs of a HPgTPC for a fraction of the price of collider readout electronics.",
    "authors": [
      "N. Khan",
      "Y. Hua",
      "I. Xiotidis",
      "T. Alves",
      "E. Atkin",
      "G. Barker",
      "D. Barrow",
      "A. Booth",
      "J. Borg",
      "A. Bross",
      "M. F. Cicala",
      "L. Cremonesi",
      "A. Deisting",
      "K. Duffy",
      "R. Gran",
      "P. Green",
      "A. Habig",
      "M. Judah",
      "T. Junk",
      "A. Kaboth",
      "A. Klustová",
      "H. LeMoine",
      "A. D. Marino",
      "F. Martínez López",
      "T. Mohayai",
      "D. Naples",
      "R. Nichol",
      "D. Parker",
      "M. Pfaff",
      "J. Raaf",
      "P. Rubinov",
      "P. Singh",
      "A. Srivastava",
      "A. Waldron",
      "L. Warsame",
      "M. Wascko",
      "A. Wilkinson",
      "A. Ritchie-Yates",
      "P. Dunne"
    ],
    "published": "2025-07-23T11:32:28Z",
    "updated": "2025-10-21T12:25:26Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.18487v1",
    "url": "https://arxiv.org/abs/2510.18487v1",
    "pdf_url": "https://arxiv.org/pdf/2510.18487v1.pdf",
    "title": "Experimental and numerical investigation of suprathermal electron   dynamics using vertical electron cyclotron emission",
    "abstract": "The Tokamak \\`a Configuration Variable (TCV) is equipped with an advanced set of diagnostics for studying suprathermal electron dynamics. Among these, the vertical electron cyclotron emission (VECE) diagnostic offers valuable insights into the electron energy distribution by measuring electron cyclotron emission (ECE) along a vertical line-of-sight. However, reconstructing the electron distribution from ECE measurements is inherently challenging due to harmonic overlap and thermal radiation noise. A more practical approach leverages forward modeling of ECE based on kinetic simulations. To this end, we introduce YODA, a novel synthetic ECE diagnostic framework that simulates emission and (re)absorption of electron cyclotron radiation for arbitrary electron distributions and antenna geometries. The framework is validated against the well-established synthetic ECE code SPECE, using an ohmic TCV discharge as a reference case. In this study, the 3D bounce-averaged Fokker-Planck code LUKE is used to model electron distributions in two electron cyclotron current drive (ECCD) experiments. The synthetic spectra generated using the combined LUKE-YODA framework successfully reproduce the main features of the experimental VECE measurements in both simulated discharges. The combination of kinetic and synthetic ECE simulations allow the identification of the features in the electron distribution function which give rise to certain signatures in the VECE signal.",
    "authors": [
      "L. Votta",
      "M. Hoppe",
      "J. Decker",
      "E. Devlaminck",
      "A. S. Tema Biwolé",
      "L. Porte",
      "J. Cazabonne",
      "Y. Savoye-Peysson",
      "the TCV team"
    ],
    "published": "2025-10-21T10:07:58Z",
    "updated": "2025-10-21T10:07:58Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.18411v1",
    "url": "https://arxiv.org/abs/2510.18411v1",
    "pdf_url": "https://arxiv.org/pdf/2510.18411v1.pdf",
    "title": "A machine learning approach to automation and uncertainty evaluation for   self-validating thermocouples",
    "abstract": "Thermocouples are in widespread use in industry, but they are particularly susceptible to calibration drift in harsh environments. Self-validating thermocouples aim to address this issue by using a miniature phase-change cell (fixed-point) in close proximity to the measurement junction (tip) of the thermocouple. The fixed point is a crucible containing an ingot of metal with a known melting temperature. When the process temperature being monitored passes through the melting temperature of the ingot, the thermocouple output exhibits a \"plateau\" during melting. Since the melting temperature of the ingot is known, the thermocouple can be recalibrated in situ. Identifying the melting plateau to determine the onset of melting is reasonably well established but requires manual intervention involving zooming in on the region around the actual melting temperature, a process which can depend on the shape of the melting plateau. For the first time, we present a novel machine learning approach to recognize and identify the characteristic shape of the melting plateau and once identified, to quantity the point at which melting begins, along with its associated uncertainty. This removes the need for human intervention in locating and characterizing the melting point. Results from test data provided by CCPI Europe show 100% accuracy of melting plateau detection. They also show a cross-validated R2 of 0.99 on predictions of calibration drift.",
    "authors": [
      "Samuel Bilson",
      "Andrew Thompson",
      "Declan Tucker",
      "Jonathan Pearce"
    ],
    "published": "2025-10-21T08:38:28Z",
    "updated": "2025-10-21T08:38:28Z",
    "categories": [
      "physics.ins-det",
      "cs.LG"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1063/5.0235318"
  },
  {
    "arxiv_id": "2510.18384v1",
    "url": "https://arxiv.org/abs/2510.18384v1",
    "pdf_url": "https://arxiv.org/pdf/2510.18384v1.pdf",
    "title": "Diagnostics of a Multicusp-Assisted Inductively-Coupled Radio-Frequency   Plasma Source for Plasma Immersion Ion Implantation",
    "abstract": "In this article, we present a detailed characterisation of a multicusp-assisted inductively coupled RF plasma source for plasma immersion ion implantation (PIII). Using laser-induced fluorescence (LIF) and RF-compensated Langmuir probe diagnostics, we measured ion temperature T i and drift velocity v z in argon plasmas near an immersed electrode. The multicusp configuration enhances plasma density at low pressure, enabling stable operation down to 0.8 mTorr. Timeaveraged measurements show no detectable perturbation near the pulsed electrode, indicating full plasma recovery between high-voltage pulses. LIF-derived potential profiles match Riemann's presheath theory, and ion velocity distributions reveal acceleration consistent with sheath dynamics. These results support the use of LIF for steady-state characterisation of the bulk and presheath regions in PIII systems.",
    "authors": [
      "Moreno Joel",
      "Jimenez Marilyn",
      "Okerstrom Daniel",
      "Bradley Michael P.",
      "Couëdel Lénaïc"
    ],
    "published": "2025-10-21T08:03:30Z",
    "updated": "2025-10-21T08:03:30Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2505.17146v3",
    "url": "https://arxiv.org/abs/2505.17146v3",
    "pdf_url": "https://arxiv.org/pdf/2505.17146v3.pdf",
    "title": "Proof-of-Principle Experiment on a Displacement-Noise-Free Neutron   Interferometer for Gravitational Wave Detection",
    "abstract": "The displacement-noise-free interferometer (DFI) is designed to eliminate all displacement-induced noise while retaining sensitivity to gravitational wave (GW) signals. Ground-based DFIs suffer from physical arm-length limitations, resulting in poor sensitivity at frequencies below 1 kHz. To address this, previous research introduced a neutron-based DFI, which replaces laser light with neutrons and achieves exceptional sensitivity down to a few hertz. In this study, we conducted a proof-of-principle experiment using a pulsed neutron source at the Japan Proton Accelerator Research Complex (J- PARC). Despite practical constraints that led to deviations from the ideal experimental design, we optimized the setup and developed a novel analysis method that successfully cancels displacement noise while preserving simulated GW signals. This work presents the first successful demonstration of a neutron DFI and a neutron interferometer for GW detection.",
    "authors": [
      "Shoki Iwaguchi",
      "Takuhiro Fujiie",
      "Taro Nambu",
      "Masaaki Kitaguchi",
      "Yutaka Yamagata",
      "Kenji Mishima",
      "Atsushi Nishizawa",
      "Tomohiro Ishikawa",
      "Kenji Tsuji",
      "Kurumi Umemura",
      "Kazuhiro Kobayashi",
      "Takafumi Onishi",
      "Keiko Kokeyama",
      "Hirohiko Shimizu",
      "Yuta Michimura",
      "Seiji Kawamura"
    ],
    "published": "2025-05-22T07:50:34Z",
    "updated": "2025-10-21T05:03:29Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "gr-qc"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.18182v1",
    "url": "https://arxiv.org/abs/2510.18182v1",
    "pdf_url": "https://arxiv.org/pdf/2510.18182v1.pdf",
    "title": "Electron Acceleration via Lower-Hybrid Drift Instability in   Astrophysical Plasmas: Dependence on Plasma Beta and Suprathermal Electron   Distributions",
    "abstract": "Density inhomogeneities are ubiquitous in space and astrophysical plasmas, particularly at magnetic reconnection sites, shock fronts, and within compressible turbulence. The gradients associated with these inhomogeneous plasma regions serve as free energy sources that can drive plasma instabilities, including the lower-hybrid drift instability (LHDI). Notably, lower-hybrid waves are frequently observed in magnetized space plasma environments, such as Earth's magnetotail and magnetopause. Previous studies have primarily focused on modeling particle acceleration via LHDI in these regions using a quasilinear approach. This study expands the investigation of LHDI to a broader range of environments, spanning weakly to strongly magnetized media, including interplanetary, interstellar, intergalactic, and intracluster plasmas. To explore the applicability of LHDI in various astrophysical settings, we employ two key parameters: (1) plasma magnetization, characterized by the plasma beta parameter, and (2) the spectral slope of suprathermal electrons following a power-law distribution. Using a quasilinear model, we determine the critical values of plasma beta and spectral slope that enable efficient electron acceleration via LHDI by comparing the rate of growth of instability and the damping rate of the resulting fluctuations. We further analyze the time evolution of the electron distribution function to confirm these critical conditions. Our results indicate that electron acceleration is generally most efficient in low-beta plasmas ($\\beta < 1$). However, the presence of suprathermal electrons significantly enhances electron acceleration via LHDI, even in high-beta plasmas ($\\beta > 1$). Finally, we discuss the astrophysical implications of our findings, highlighting the role of LHDI in electron acceleration across diverse plasma environments.",
    "authors": [
      "Ji-Hoon Ha",
      "Elena S. Volnova"
    ],
    "published": "2025-10-21T00:12:10Z",
    "updated": "2025-10-21T00:12:10Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2509.11484v3",
    "url": "https://arxiv.org/abs/2509.11484v3",
    "pdf_url": "https://arxiv.org/pdf/2509.11484v3.pdf",
    "title": "The impact of kinetic and global effects on ballooning 2nd stable   pedestals of conventional and low aspect ratio tokamaks",
    "abstract": "The EPED model [P.B. Snyder et al 2011 Nucl. Fusion 51 103016] had success describing the pedestals of the Type-I ELM and QH-mode operations in conventional tokamaks, by combining kinetic ballooning mode (KBM) and peeling-ballooning (PB) constraints. Within EPED, the KBM constraint is usually approximated by the ideal ballooning mode (IBM) stability threshold. It has been noted that quantitative differences between local ideal MHD and gyro-kinetic (GK) ballooning stability can be larger at low aspect ratio. KBM critical pedestals are consistent with observations in initial studies on conventional and spherical tokamaks. In this work, the application of a reduced model for the calculation of the kinetic ballooning stability boundary is presented based on a novel and newly developed Gyro-Fluid System (GFS) code [G.M. Staebler et al 2023 Phys. Plasmas 30 102501]. GFS is observed to capture KBMs in DIII-D as well as the NSTX(-U) pedestals, opening a route integrating this model into EPED. Finally, high-n global ballooning modes are observed to limit the access to the local 2nd stability and thus provide a transport mechanism that constrains the width evolution with beta_p,ped. The high-n global ballooning stability is approximated by its ideal MHD analogue using ELITE. It is shown that nearly local high-n with k_y*rho_s~1/2 modes can provide a proxy for the critical beta_p,ped when a 2nd stable access exists on DIII-D plasmas. The use of GFS and ELITE scaling in EPED provided an improved agreement in comparison to EPED1 with DIII-D pedestal data.",
    "authors": [
      "M. S. Anastopoulos Tzanis",
      "M. Yang",
      "A. Kleiner",
      "J. F. Parisi",
      "G. M. Staebler",
      "P. B. Snyder"
    ],
    "published": "2025-09-15T00:14:56Z",
    "updated": "2025-10-20T23:16:50Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  }
]