{
  "arxiv_id": "2507.09765v2",
  "url": "https://arxiv.org/abs/2507.09765v2",
  "pdf_url": "https://arxiv.org/pdf/2507.09765v2.pdf",
  "title": "CRYSP: a Total-Body PET based on cryogenic cesium iodide crystals",
  "abstract": "Total Body PET (TBPET) scanners have the potential to substantially reduce both acquisition time and administered radiation dose, owing to their high sensitivity. However, their widespread clinical adoption is hindered by the high cost of currently available systems. This work explores the use of pure cesium iodide (CsI) monolithic crystals operated at cryogenic temperatures as a cost-effective alternative to rare-earth scintillators for TBPET. We investigate the performance of pure CsI crystals operated at cryogenic temperatures ($\\sim$100 K), where they achieve a light yield of approximately $10^5$ photons/MeV. The implications for energy resolution, spatial resolution (including depth-of-interaction capability), and timing performance are assessed, with a view toward their integration into a TBPET system. Cryogenic CsI crystals demonstrated energy resolution below 7% and coincidence time resolution at the nanosecond level, despite their relatively slow scintillation decay time. A Monte Carlo simulation of monolithic CsI crystals shows that a millimeter-scale spatial resolution in all three dimensions can be obtained. These characteristics indicate that high-performance PET imaging is achievable with this technology. A TBPET scanner based on cryogenic CsI monolithic crystals could combine excellent imaging performance with significantly reduced detector costs, enabling broader accessibility and accelerating the adoption of TBPET in both clinical and research settings.",
  "authors": [
    "S. R. Soleti",
    "P. Dietz",
    "R. Esteve",
    "J. Garcìa-Barrena",
    "V. Herrero",
    "F. Lopez",
    "F. Monrabal",
    "L. Navarro-Cozcolluela",
    "E. Oblak",
    "J. Pelegrìn",
    "J. Renner",
    "J. Toledo",
    "S. Torelli",
    "J. J. Gòmez-Cadenas"
  ],
  "published": "2025-07-13T19:48:31Z",
  "updated": "2026-01-02T22:03:26Z",
  "categories": [
    "physics.ins-det",
    "physics.med-ph"
  ],
  "primary_category": "physics.ins-det"
}