{
  "arxiv_id": "2601.00441v1",
  "url": "https://arxiv.org/abs/2601.00441v1",
  "pdf_url": "https://arxiv.org/pdf/2601.00441v1.pdf",
  "title": "Mass-loaded magnetic explosions in the context of Magnetar Giant Flares and Fast Radio Bursts",
  "abstract": "Magnetar flares are highly energetic and rare events where intense high-energy emission is released from strongly magnetised neutron stars. Fast radio bursts are short and intense pulses of coherent radio emission. Their large dispersion measures support an extragalactic origin. While their exact origin still remains elusive, a substantial number of models associates them with strong magnetic field and high-energy relativistic plasma found in the vicinity of magnetars. There is growing evidence that some fast radio bursts are associated to flare-type events from magnetars. We aim to provide a set of configurations describing a relativistic, spherical, mass-loaded, magnetic explosion. We proceed by solving the equations of relativistic magnetohydrodynamics, for a system that expands while maintaining its internal equilibrium. We employ a semi-analytical approach for the solution of the equations of relativistic magnetohydrodynamics. We assume self-similarity in time and radius, axial symmetry, and separation of variables. There exists a dichotomy of solutions that correspond to higher and lower density and thermal pressure compared to the external one. The ratio of the poloidal to toroidal field and the inclusion of pressure and mass density affect the expansion velocity. The classes of these solutions can be applied to magnetar giant flares and fast radio bursts. The ones corresponding to overdensities and higher pressure can be associated to magnetar flares, whereas the ones corresponding to underdensities can be relevant to fast radio bursts corresponding to magnetically dominated events with low mass loading.",
  "authors": [
    "Konstantinos N. Gourgouliatos"
  ],
  "published": "2026-01-01T19:00:14Z",
  "updated": "2026-01-01T19:00:14Z",
  "categories": [
    "astro-ph.HE",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.HE"
}