{
  "arxiv_id": "2601.01435v1",
  "url": "https://arxiv.org/abs/2601.01435v1",
  "pdf_url": "https://arxiv.org/pdf/2601.01435v1.pdf",
  "title": "Simulation of the CYGNO Gaseous TPC Optical Readout",
  "abstract": "Gaseous Time Projection Chambers with Optical Readout are sensitive detectors suitable for 3D measurement of low-energy O(1 keV) particles and are proposed for detecting rare events such as Dark Matter particle interactions. The CYGNO collaboration is developing such a detector with a high spatial and energy resolution, leveraging an innovative optical readout system. A reliable simulation of the detector response is needed to properly assess the physics reach of this technique and to better understand the performance of the detector in the development phase. Such a simulation cannot entirely rely on existing software packages; indeed, none of the available tools is capable of properly and reliably treating the different phenomena occurring in the detector, from the primary interaction in the gas volume throughout the whole detector response model, including charge transport, light production and propagation, and the response of the optical sensors. In this paper, we present a modeling of the detector response tuned on the CYGNO Optical TPC case; a description of the method is reported together with comparisons with experimental data from the LIME prototype to demonstrate the simulation performances.",
  "authors": [
    "F. D. Amaro",
    "R. Antonietti",
    "E. Baracchini",
    "L. Benussi",
    "S. Bianco",
    "C. Capoccia",
    "M. Caponero",
    "L. G. M de Carvalho",
    "G. Cavoto",
    "I. A. Costa",
    "A. Croce",
    "M. D'Astolfo",
    "G. D'Imperio",
    "G. Dho",
    "E. Di Marco",
    "J. M. F. dos Santos",
    "D. Fiorina",
    "F. Iacoangeli",
    "Z. Islam",
    "E. Kemp",
    "H. P. Lima",
    "G. Maccarrone",
    "R. D. P. Mano",
    "D. J. G. Marques",
    "G. Mazzitelli",
    "P. Meloni",
    "A. Messina",
    "C. M. B. Monteiro",
    "R. A. Nobrega",
    "I. F. Pains",
    "E. Paoletti",
    "F. Petrucci",
    "S. Piacentini",
    "D. Pierluigi",
    "D. Pinci",
    "F. Renga",
    "A. Russo",
    "G. Saviano",
    "P. A. O. C. Silva",
    "N. J. C. Spooner",
    "R. Tesauro",
    "S. Tomassini",
    "S. Torelli",
    "D. Tozzi"
  ],
  "published": "2026-01-04T08:42:30Z",
  "updated": "2026-01-04T08:42:30Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}