{
  "arxiv_id": "2601.01367v1",
  "url": "https://arxiv.org/abs/2601.01367v1",
  "pdf_url": "https://arxiv.org/pdf/2601.01367v1.pdf",
  "title": "Overcoming the space-charge dilemma in low-energy heavy ion beams via a multistage acceleration lens system",
  "abstract": "Low-energy heavy-ion beams are fundamentally limited by severe space-charge divergence, which constrains the transportable beam current to a few microamperes in conventional electrostatic accelerators. This limitation is particularly critical for high-mass ions, where the generalized perveance increases rapidly because of their low velocity. Here, we demonstrate that this apparent space-charge limit can be overcome by shaping the electrostatic potential configuration of an existing multistage accelerator, thereby transforming the acceleration column itself into a combined acceleration-focusing column. By optimizing the interstage voltage configuration, a strong electrostatic lens effect is superimposed on the accelerating field to counteract space-charge-driven expansion. We formulate a generalized design framework that quantitatively maps the transport 'design window' in terms of beam current, ion mass, and acceleration voltage. For gold ions at 64 keV, this approach enables stable transport of beam currents exceeding 100 microA, more than an order of magnitude higher than the conventional limit. Numerical phase-space analysis shows that this improvement is achieved by prioritizing envelope control over emittance preservation, a trade-off intrinsic to space-charge-dominated regimes. Our results establish a universal and practical guideline for high-current heavy-ion beam transport, relevant to fusion plasma diagnostics, ion implantation, and massive molecular ion applications.",
  "authors": [
    "M. Nishiura",
    "T. Ido",
    "M. Okamura",
    "K. Ueda",
    "A. Shimizu",
    "H. Takubo"
  ],
  "published": "2026-01-04T04:39:52Z",
  "updated": "2026-01-04T04:39:52Z",
  "categories": [
    "physics.plasm-ph",
    "physics.acc-ph"
  ],
  "primary_category": "physics.plasm-ph"
}