{
  "arxiv_id": "2601.00157v1",
  "url": "https://arxiv.org/abs/2601.00157v1",
  "pdf_url": "https://arxiv.org/pdf/2601.00157v1.pdf",
  "title": "Towards a temperature-insensitive composite diamond clock",
  "abstract": "Frequency references based on solid state spins promise simplicity, compactness, robustness, multifunctionality, ease of integration, and high densities of emitters. Nitrogen-vacancy (NV) centers in diamond are a natural candidate, but the electronic zero-field splitting exhibits a large fractional temperature dependence, which has precluded its use as a stable clock transition. Here we show that this limitation can be overcome by forming a composite frequency reference that combines measurements of the electronic splitting D with the nuclear quadrupole splitting of the $^{14}$N nuclear spin intrinsic to the NV center. We further benchmark this composite approach against alternative strategies for mitigating temperature sensitivity. By implementing a specially designed pulse sequence with an eight-phase control scheme that suppresses pulse imperfections, we interleave measurements of D and Q in a high-density NV ensemble and demonstrate a temperature-compensated composite frequency reference. The stability of this composite diamond clock is characterized over a 10-day period at room temperature through a comparison to a Rb vapor-cell clock, yielding a fractional instability below $5 \\times 10^{-9}$ for an averaging time of $τ= 200$ s and below $1 \\times 10^{-8}$ at $τ= 2 \\times 10^5$ s, corresponding to measured improvements by a factor of 4 and 200, respectively, over a clock based purely on the single frequency D for the same periods. By characterizing the residual sensitivity to magnetic fields, optical power, and radio-frequency drive amplitudes, we find that temperature is no longer the dominant source of instability. These results establish complementary electron- and nuclear-spin transitions in diamond as a viable route to thermally robust frequency metrology, providing a pathway toward compact, multifunctional solid-state clocks and quantum sensors.",
  "authors": [
    "Sean Lourette",
    "Andrey Jarmola",
    "Jabir Chathanathil",
    "Victor M. Acosta",
    "A. Glen Birdwell",
    "Peter Blümler",
    "Dmitry Budker",
    "Sebastián C. Carrasco",
    "Tony G. Ivanov",
    "Shimon Kolkowitz",
    "Vladimir S. Malinovsky"
  ],
  "published": "2026-01-01T01:17:43Z",
  "updated": "2026-01-01T01:17:43Z",
  "categories": [
    "quant-ph",
    "physics.app-ph",
    "physics.atom-ph",
    "physics.ins-det"
  ],
  "primary_category": "quant-ph"
}