{
  "arxiv_id": "2601.00872v1",
  "url": "https://arxiv.org/abs/2601.00872v1",
  "pdf_url": "https://arxiv.org/pdf/2601.00872v1.pdf",
  "title": "Robust Lifetime Estimation from HPGe Radiation-Sensor Time Series Using Pairwise Ratios and MFV Statistics",
  "abstract": "High-purity germanium (HPGe) gamma-ray detectors are core instruments in nuclear physics and astrophysics experiments, where long-term stability and reliable extraction of decay parameters are essential. However, the standard exponential decay analyses of the detector time-series data are often affected by the strong correlations between the fitted parameters and the sensitivity to detector-related fluctuations and outliers. In this study, we present a robust analysis framework for HPGe detector decay data based on pairwise ratios and the Steiner's most frequent value (MFV) statistic. By forming point-to-point ratios of background-subtracted net counts, the dependence on the absolute detector response is eliminated, removing the amplitude-lifetime correlation inherent to conventional regression. The resulting pairwise lifetime estimates exhibit heavy-tailed behavior, which is efficiently summarized using the MFV, a robust estimator designed for such distributions. For the case study, a long and stable dataset from an HPGe detector was used. This data was gathered during a low-temperature nuclear physics experiment focused on observing the 216 keV gamma-ray line in 97-Ru. Using measurements spanning approximately 10 half-lives, we obtain a mean lifetime of tau = 4.0959 +/- 0.0007 (stat) +/- 0.0110 (syst) d, corresponding to a half-life of T1/2 = 2.8391 +/- 0.0005 (stat) +/- 0.0076 (syst) d. These results demonstrate that the pairwise-MFV approach provides a robust and reproducible tool for analyzing long-duration HPGe detector data in nuclear physics and nuclear astrophysics experiments, particularly for precision decay measurements, detector-stability studies, and low-background monitoring.",
  "authors": [
    "Victor V. Golovko"
  ],
  "published": "2025-12-30T18:07:39Z",
  "updated": "2025-12-30T18:07:39Z",
  "categories": [
    "physics.ins-det",
    "physics.data-an"
  ],
  "primary_category": "physics.ins-det"
}