{
  "arxiv_id": "2512.14872v1",
  "url": "https://arxiv.org/abs/2512.14872v1",
  "pdf_url": "https://arxiv.org/pdf/2512.14872v1.pdf",
  "title": "Bridging the Gap Between Modern UX Design and Particle Accelerator Control Room Interfaces",
  "abstract": "Accelerator control systems often represent relatively complex and safety-sensitive human-machine interfaces within process control industries. These systems are technically robust and reflect the cumulative integration of solutions built and adapted across decades. One of the regular, unfortunate casualties of provisional accelerator control system updates is their human-system interfaces (HSIs) which often lag behind modern usability and design standards. An additional challenge is that although there is a multitude of established human factors (HF), and user experience (UX) principles for everyday digital applications, there are very few (if any) established principles for complex and safety-critical applications for an accelerator. This paper argues for the importance of established HF and UX principles (herein referred to as human-centered design principles) into the development of accelerator HSIs, emphasizing the need for clarity, consistency, responsiveness, and cognitive accessibility. Drawing from HF/UX best practices and human-centered design, this paper discusses how these approaches can enhance operator performance, reduce human error, and improve accelerator personnel collaboration. Case studies from Accelerator Control Operations Research Network (ACORN) at Fermilab are explored to demonstrate how interfaces built with human-centered design principles can scale with system complexity while remaining intuitive and efficient for diverse user roles including operators, machine experts, and engineers. By bridging the gap between traditional control system design and modern human-centered design methods, this paper provides a roadmap for evolving accelerator HSIs into more usable, maintainable, and effective tools.",
  "authors": [
    "Rachael Hill",
    "Casey Kovesdi",
    "Torrey Mortenson",
    "Madelyn Polzin",
    "Zachary Spielman",
    "Katya Le Blanc"
  ],
  "published": "2025-12-16T19:35:36Z",
  "updated": "2025-12-16T19:35:36Z",
  "categories": [
    "physics.acc-ph",
    "cs.SE"
  ],
  "primary_category": "physics.acc-ph"
}