{
  "arxiv_id": "2512.14997v1",
  "url": "https://arxiv.org/abs/2512.14997v1",
  "pdf_url": "https://arxiv.org/pdf/2512.14997v1.pdf",
  "title": "Permanent magnet optimization of stellarators with coupling from finite permeability and demagnetization effects",
  "abstract": "Permanent magnets provide an attractive path for shaping university-scale stellarator magnetic fields. Previous work has shown that greedy permanent magnet optimization (GPMO) can produce sparse, grid-aligned arrays that match target surfaces with high accuracy under an ideal rigid-remanence model. Here we extend this approach to a greedy permanent magnet optimization with macromagnetic refinement (GPMOmr) by introducing a block-level macromagnetic model that accounts for magnet-magnet and magnet-coil coupling from finite permeability and demagnetizing interactions, and apply it to the published magnet grid from the MUSE stellarator design. Finite-permeability effects produce degree-scale tilts and few-percent magnitude changes in individual magnets and modify the surface-normal field $\\mathbf B\\cdot\\mathbf n$ only at the percent level, yet for a fixed layout they increase the standard squared-flux objective by more than a factor of two. When the same model is embedded in the greedy loop, GPMOmr achieves $f_B$ histories and final errors within a few percent of classical GPMO while producing visibly more nonuniform magnetization patterns. Our formulation provides a fast and practical tool for quantifying and incorporating finite-permeability effects in permanent-magnet stellarator designs, and offers a framework for extending permanent-magnet optimization to higher field strengths and to materials with stronger macromagnetic coupling.",
  "authors": [
    "Armin Ulrich",
    "Mason Haberle",
    "Alan A. Kaptanoglu"
  ],
  "published": "2025-12-17T01:00:40Z",
  "updated": "2025-12-17T01:00:40Z",
  "categories": [
    "physics.plasm-ph",
    "physics.comp-ph"
  ],
  "primary_category": "physics.plasm-ph"
}