{
  "arxiv_id": "2512.15360v1",
  "url": "https://arxiv.org/abs/2512.15360v1",
  "pdf_url": "https://arxiv.org/pdf/2512.15360v1.pdf",
  "title": "First implementation of AXUV-based analysis and macro-instability diagnostics on WHAM",
  "abstract": "Absolute extreme ultraviolet (AXUV) diode arrays are widely used in fusion experiments for time-resolved measurements of plasma radiation. We report the first implementation of an AXUV-based analysis framework on the Wisconsin High-Temperature Superconducting (HTS) Axisymmetric Mirror (WHAM). A single, precisely calibrated 20-channel AXUV assembly measures line-integrated plasma emission with $ 100~\\mathrm{kHz}$ temporal resolution and $\\sim1~\\mathrm{cm}$ spatial accuracy across the mid-plane. The data were processed to obtain plasma's statistical moments, yielding time-resolved measurement of the centroid displacement $Φ(t)$ and effective radius $R(t)$. From the joint covariance of these quantities, we define a macroscopic instability parameter $χ(t)$, that quantifies large-scale plasma motion and profile evolution directly from AXUV observables. The parameter $χ$ serves as a compact indicator of global macroscopic instability, decreasing with increasing end-plate bias and exhibiting strong anti-correlation with diamagnetic flux during confinement transitions. These results demonstrate that a single AXUV array can provide quantitative, real-time assessment of macroscopic plasma instabilities, constituting the first demonstration of such capability in a magnetic mirror plasma. Future extensions to multiple arrays will further enhance spatial coverage and enable full-mode tracking in axisymmetric mirror configurations and related fusion devices.",
  "authors": [
    "K. Shih",
    "D. Endrizzi",
    "D. A. Sutherland",
    "J. Anderson",
    "D. Bindl",
    "E. L. Claveau",
    "C. Everson",
    "J. Eickman",
    "S. J. Frank",
    "E. Marriott",
    "E. Penne",
    "J. Pizzo",
    "T. Qian",
    "J. Viola",
    "C. B. Forest",
    "D. Yakovlev"
  ],
  "published": "2025-12-17T12:06:14Z",
  "updated": "2025-12-17T12:06:14Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}