[
  {
    "arxiv_id": "2512.16789v1",
    "url": "https://arxiv.org/abs/2512.16789v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16789v1.pdf",
    "title": "Evaluation of a large-area double-sided silicon strip detector for quality assurance in ion-beam radiotherapy",
    "abstract": "Designed to provide quality assurance for ion-beam radiotherapy, the prototype fIVI (filtered Interaction Vertex Imaging) Range Monitoring System is a two-layer tracker which employs double-sided strip-segmented silicon detectors. To meet the high demands of a clinical environment, a large sensitive area is required, along with a fast and compact readout. As this device utilizes sensors and readout electronics adapted from particle physics, where the expected energy and count rate differ significantly from radiotherapy, validation was necessary to ensure that these sensors would function effectively at the order 100 MeV/u energies and order MHz count rates expected during clinical irradiation. Tests were conducted using scattered subclinical 19 MeV protons at high intensity, and clinical 207 MeV/u carbon ions at low intensity to independently validate these variables. The detection system is found to operate at rates up to 1.3 MHz, with a negligible fraction of events being affected by pileup. The efficiency of hit reconstruction is high, with a timestamp resolution of 6.25 ns, and a coincidence window of 31.25 ns, as is required for clinical event rates. With these settings, over 90% of particle interactions are able to reconstruct unique hit positions and contribute to track formation. This device is the first system using large-area, high-resolution detectors which meets the demanding count rate requirements associated with clinical radiotherapy.",
    "authors": [
      "Devin Hymers",
      "Sebastian Schroeder",
      "Olga Bertini",
      "Johann Heuser",
      "Joerg Lehnert",
      "Christian Joachim Schmidt",
      "Dennis Mücher"
    ],
    "published": "2025-12-18T17:24:53Z",
    "updated": "2025-12-18T17:24:53Z",
    "categories": [
      "physics.ins-det",
      "physics.med-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.16769v1",
    "url": "https://arxiv.org/abs/2512.16769v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16769v1.pdf",
    "title": "Operation of silicon photomultipliers in a dilution refrigerator down to 9.4 mK towards a cryogenic cosmic ray muon veto system",
    "abstract": "We report the characterisation of a FBK NUV-HD-cryo silicon photomultiplier (SiPM) sensor operated in an 9.4 $\\pm$ 0.2 mK environment inside a dilution refrigerator, towards the development of a cryogenic cosmic ray muon veto system to be operated internal to a dilution refrigerator required for low background experiments such as the QUEST-DMC dark matter search experiment. We characterise the single photon response and the gain (the charge produced per detected photon), the dark count noise rate, and correlated noise contributions as a function of operating voltage. This paper also reports first proof of concept measurements of using a SiPM directly coupled to scintillator in a 9.4 mK temperature environment, towards detecting candidate cosmic ray muon signals.",
    "authors": [
      "QUEST-DMC Collaboration",
      ":",
      "A. Kemp",
      "S. Autti",
      "E. Bloomfield",
      "A. Casey",
      "N. Darvishi",
      "N. Eng",
      "P. Franchini",
      "R. P. Haley",
      "P. J. Heikkinen",
      "A. Jennings",
      "S. Koulosousas",
      "E. Leason",
      "L. V. Levitin",
      "J. March-Russell",
      "A. Mayer",
      "J. Monroe",
      "D. Münstermann",
      "M. T. Noble",
      "J. R. Prance",
      "X. Rojas",
      "T. Salmon",
      "J. Saunders",
      "J. Smirnov",
      "R. Smith",
      "M. D. Thompson",
      "A. Thomson",
      "A. Ting",
      "V. Tsepelin",
      "S. M. West",
      "L. Whitehead",
      "D. E. Zmeev"
    ],
    "published": "2025-12-18T17:02:51Z",
    "updated": "2025-12-18T17:02:51Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.14649v4",
    "url": "https://arxiv.org/abs/2509.14649v4",
    "pdf_url": "https://arxiv.org/pdf/2509.14649v4.pdf",
    "title": "Intensified optical camera with Timepix4 readout",
    "abstract": "We report the first characterization results of an optical time-stamping camera based on the Timepix4 chip coupled to a fully depleted optical silicon sensor and fast image intensifier, enabling sub-nanosecond scale, time-resolved imaging for single photons. The system achieves an RMS time resolution of 0.3 ns in direct detection mode without the intensifier and from 0.6 to 1.5 ns in the single-photon regime with an intensifier for different amplitude-based signal selections. This shows that Timepix4 provides a significant improvement over previous Timepix3-based cameras in terms of timing precision, and also in pixel count and data throughput. We analyze key factors that affect performance, including sensor bias and timewalk effect, and demonstrate effective correction methods to recover high temporal accuracy. The camera's temporal resolution, event-driven readout and high rate capability make it a scalable platform for a wide range of applications, including quantum optics, ultrafast imaging, and time-correlated photon counting experiments.",
    "authors": [
      "Erik Hogenbirk",
      "Andrei Nomerotski",
      "Bram Bouwens",
      "Gabriel Diaz",
      "Shazia Farooq",
      "Sergei Kulkov",
      "Erik Maddox",
      "Ondrej Matousek",
      "Peter Svihra",
      "Henrique Zanoli"
    ],
    "published": "2025-09-18T06:09:03Z",
    "updated": "2025-12-18T16:48:13Z",
    "categories": [
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.16643v1",
    "url": "https://arxiv.org/abs/2512.16643v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16643v1.pdf",
    "title": "Temperature dependence of the long-term annealing behavior of neutron irradiated diodes from 8-inch p-type silicon wafers",
    "abstract": "To face the higher levels of radiation due to the 10-fold increase in integrated luminosity during the High-Luminosity LHC, the CMS detector will replace the current Calorimeter Endcap (CE) using the High-Granularity Calorimeter (HGCAL) concept. The high-radiation regions of the the CE, where fluences between $1\\cdot10^{14}~n_{eq}/cm^{2}$ and $1\\cdot10^{16}~n_{eq}/cm^{2}$ and doses of up to 2\\,MGy are expected considering an integrated luminosity of $3\\,ab^{-1}$, will be equipped with silicon pad sensors. This includes the entire electromagnetic as well as parts of the hadronic section of the CE. The silicon sensors are processed on 8-inch p-type wafers with an active thickness of 300\\,\\textmu m, 200\\,\\textmu m and 120\\,\\textmu m and cut into hexagonal shapes for optimal use of the full wafer area and tiling. With each main sensor, several small test structures (e.g. pad diodes) are hosted on the wafers, used for quality assurance and radiation hardness tests. In order to investigate the radiation-induced bulk damage, these diodes have been irradiated with reactor neutrons at JSI (Jozef Stefan Institute, Ljubljana, Slovenia) to fluences between $5\\cdot10^{14}~n_{eq}/cm^{2}$ and $1.5\\cdot10^{16}~n_{eq}/cm^{2}$. This study focuses on the isothermal annealing behavior of the bulk material at different temperatures between 5.5°C and 60°C using electrical characterization and charge collection measurements. The results are used to extract the annealing time constants for this material and fluence range based on the Hamburg model approach to allow an estimation of the expected annealing effects in silicon sensors during the year-end technical stops and the long HL-LHC shutdowns. The annealing parameters found will make it possible to model the annealing behavior of p-type silicon detector projects at HL-LHC fluence ranges better than the existing Hamburg model.",
    "authors": [
      "Leena Diehl",
      "Oliwia Kaluzinska",
      "Marie Mühlnikel",
      "Max Andersson",
      "Natalya Gerassyova",
      "Jenan Amer",
      "Eva Sicking",
      "Dana Groner",
      "Jan Kieseler",
      "Matteo Defranchis"
    ],
    "published": "2025-12-18T15:15:21Z",
    "updated": "2025-12-18T15:15:21Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.04205v2",
    "url": "https://arxiv.org/abs/2509.04205v2",
    "pdf_url": "https://arxiv.org/pdf/2509.04205v2.pdf",
    "title": "Toward precision physics tests with future COHERENT detectors",
    "abstract": "We present a comprehensive sensitivity study of future CE$ν$NS detectors, focusing on a cryogenic cesium iodide detector and a tonne-scale liquid argon one, currently being developed by the COHERENT Collaboration. These setups will enable precision measurements of the weak mixing angle at low energies and allow accurate extraction of the neutron nuclear distribution radius. We also demonstrate that next-generation detectors will place constraints on the neutrino charge radius comparable to or better than current global fits. In addition, we explore the sensitivity to non standard neutrino electromagnetic properties, such as magnetic moments and millicharges, as well as new mediators. These findings reinforce the role of CE$ν$NS experiments in the upcoming precision era, with future detectors playing a key role in advancing our understanding of neutrino interactions and electroweak physics at low energies.",
    "authors": [
      "M. Atzori Corona",
      "M. Cadeddu",
      "N. Cargioli",
      "F. Dordei",
      "C. Giunti",
      "R. Pavarani"
    ],
    "published": "2025-09-04T13:31:19Z",
    "updated": "2025-12-18T14:48:12Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "hep-ph"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.3390/universe11120416"
  },
  {
    "arxiv_id": "2510.21375v2",
    "url": "https://arxiv.org/abs/2510.21375v2",
    "pdf_url": "https://arxiv.org/pdf/2510.21375v2.pdf",
    "title": "Picosecond Precision Heavy Ion Detector for Λ Hypernuclei Lifetime Studies",
    "abstract": "In this paper, we present the design and preliminary performance evaluation of a new heavy ion detector for direct measurements of heavy Λ hypernuclei lifetime. The detector employs the previously developed 10 picosecond resolution Radio Frequency (RF) Timer, which converts the temporal information of incident particles into spatial coordinates of secondary or photoelectrons on a position-sensitive detector by means of circular RF scanning in the 500-1000 MHz range. Here, we report the detector design to achieve efficient suppression of accidental background and effective separation of prompt reaction products and delayed events from Λ hypernuclei decays, results of test studies carried out with RF synchronized laser as well as preliminary results obtained by using alpha particles. Dedicated Monte-Carlo simulations have been performed to estimate the detector's performance under realistic experimental conditions at RF-driven electron, photon, or proton beams. The results confirm the feasibility of the proposed design and provide a basis for upcoming experimental measurements, based on the delayed fission detection.",
    "authors": [
      "Simon Zhamkochyan",
      "Sergey Abrahamyan",
      "Amur Margaryan",
      "Hayk Elbakyan",
      "Aram Kakoyan",
      "Samvel Mayilyan",
      "Artashes Papyan",
      "Hasmik Rostomyan",
      "Anna Safaryan",
      "Gagik Sughyan",
      "Narek Margaryan",
      "Garnik Ayvazyan",
      "John Annand",
      "Kenneth Livingston",
      "Rachel Montgomery",
      "Patrick Achenbach",
      "Josef Pochodzalla",
      "Dimiter Balabanski",
      "Satoshi Nakamura",
      "Ani Aprahamian",
      "Vanik Kakoyan"
    ],
    "published": "2025-10-24T11:58:51Z",
    "updated": "2025-12-18T14:24:27Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.16311v1",
    "url": "https://arxiv.org/abs/2512.16311v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16311v1.pdf",
    "title": "Bunch-by-Bunch Prediction of Beam Transverse Position, Phase, and Length in a Storage Ring Using Neural Networks",
    "abstract": "Real-time, bunch-by-bunch monitoring of transverse position, longitudinal phase, and bunch length is crucial for beam control in diffraction-limited storage rings, where complex collective dynamics pose unprecedented diagnostic challenges. This study presents a neural network framework that simultaneously predicts these parameters directly from beam position monitor waveforms. The hybrid architecture integrates specialized Multi-Layer Perceptron (MLP), Convolutional Neural Network (CNN), and Long Short-Term Memory with Attention (LSTM-Attention) sub-networks, overcoming key limitations of traditional methods such as serial processing chains and batch-mode operation. Validated on experimental data from the Shanghai Synchrotron Radiation Facility and Hefei Light Source, the model achieves high prediction accuracy with a sub-millisecond latency of 0.042 ms per bunch. This performance demonstrates its potential as a core tool for real-time, multi-parameter diagnostics and active feedback in next-generation light sources.",
    "authors": [
      "Can Liu",
      "Xing Yang",
      "Youming Deng",
      "Qingqing Duan",
      "Yongbin Leng"
    ],
    "published": "2025-12-18T08:51:01Z",
    "updated": "2025-12-18T08:51:01Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.16196v1",
    "url": "https://arxiv.org/abs/2512.16196v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16196v1.pdf",
    "title": "Toward the Origins of Binding Energy Shifts and Satellites Formation During Plasma-XPS Measurements",
    "abstract": "In plasma X ray photoelectron spectroscopy emerges as a powerful platform for real time, in situ chemical analysis under conditions relevant to semiconductor processing and other plasma enabled technologies. This study investigates the origins of binding energy shifts and satellite peaks formation observed during plasma XPS measurements across conductive, dielectric, and gas phase systems. Using a standard laboratory based ambient pressure XPS apparatus coupled with an alternating current driven capacitively coupled plasma source, we show that metastable surface species, such as transient Au oxides, can be detected during plasma exposure, revealing chemical states hardly accessible using conventional ultrahigh vacuum XPS. In dielectric samples, we observe pressure- and plasma type dependent BE shifts up to 50 eV, attributed to X ray induced and plasma mediated surface charging. These shifts are mitigated at higher pressures plasmas or in electronegative plasmas, the latter due to enhanced charge compensation mechanisms involving slow negative ions. For gas phase species, AC plasma excitation leads to spectral broadening and the emergence of satellite peaks with a few eV energy separations, linked to oscillating local plasma potentials in the probing volume. These findings highlight the important and complex interplay of plasma parameters, surface charging, and local electric fields in shaping XPS spectra. Overall, plasma XPS emerges as a critical metrological tool for probing transient surface chemistry, with implications for semiconductor processing, material synthesis, and plasma diagnostics.",
    "authors": [
      "J. Trey Diulus",
      "Ashley R. Head",
      "Jorge Anibal Boscoboinik",
      "Carles Corbella Roca",
      "Alexander Tselev",
      "Andrei Kolmakov"
    ],
    "published": "2025-12-18T05:37:38Z",
    "updated": "2025-12-18T05:37:38Z",
    "categories": [
      "physics.plasm-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.08421v4",
    "url": "https://arxiv.org/abs/2506.08421v4",
    "pdf_url": "https://arxiv.org/pdf/2506.08421v4.pdf",
    "title": "High-precision Beam Optics Calculation of the HIAF-BRing Using Measured Fields",
    "abstract": "The construction of the High Intensity heavy ion Accelerator Facility (HIAF) has been completed, with current efforts focused on subsystem commissioning. Beam commissioning is scheduled for autumn 2025, marking a critical milestone in the HIAF project. This paper presents high-precision optics calculations for the Booster Ring (BRing) of HIAF, a key component for achieving stable heavy-ion beam acceleration. Leveraging high-precision magnetic field data, each magnet is divided into hundreds of slices, thus establishing a high-precision sliced optics model for BRing. Detailed calculations of BRing's optics are presented in this work. Critical parameters including tunes and betatron functions of the lattice based on the measured magnetic fields and those of the ideal lattice have been compared. The results highlight the impact of realistic magnetic field on beam dynamics and provide essential insights for accelerator tuning and optimization. These findings serve as a fundamental reference for beam commissioning and long-term operation, ensuring beam stability and performance reproducibility in HIAF.",
    "authors": [
      "Ke Wang",
      "Li-Na Sheng",
      "Geng Wang",
      "Wei-Ping Chai",
      "You-Jin Yuan",
      "Jian-Cheng Yang",
      "Guo-Dong Shen",
      "Liang Lu"
    ],
    "published": "2025-06-10T03:47:11Z",
    "updated": "2025-12-18T04:36:49Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.1088/1748-0221/20/08/P08023"
  },
  {
    "arxiv_id": "2512.16060v1",
    "url": "https://arxiv.org/abs/2512.16060v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16060v1.pdf",
    "title": "Frequency Extraction from Invariant Flows",
    "abstract": "In non-degenerate integrable Hamiltonian systems, invariant tori can be parameterized equivalently by action variables or by their fundamental frequencies. We introduce an invariant-flow formulation for extracting fundamental frequencies of integrable Hamiltonian systems. By treating invariants as generators of commuting Hamiltonian flows, the frequencies are obtained from time-of-flight parameters along these flows, providing a direct alternative to action-angle constructions and spectral methods based on long time series. The approach yields an explicit numerical procedure that extends naturally to systems with multiple degrees of freedom. Its effectiveness is demonstrated using the McMillan map, where machine-precision accuracy is achieved.",
    "authors": [
      "Derong Xu",
      "Yongjun Li",
      "Yue Hao",
      "Sergei Nagaitsev"
    ],
    "published": "2025-12-18T01:00:58Z",
    "updated": "2025-12-18T01:00:58Z",
    "categories": [
      "nlin.SI",
      "physics.acc-ph"
    ],
    "primary_category": "nlin.SI"
  },
  {
    "arxiv_id": "2512.15968v1",
    "url": "https://arxiv.org/abs/2512.15968v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15968v1.pdf",
    "title": "Measurement of Light Yield Response of Gd-compatible Water-based Liquid Scintillator with the Brookhaven 1-ton testbed",
    "abstract": "The Water-based Liquid Scintillator (WbLS) enables hybrid detection by combining scintillation and Cherenkov signals, providing superior event reconstruction capabilities compared to conventional neutrino detectors. We measured the light yield of Gd-compatible WbLS at varying concentrations from 0.35\\% to 1\\% by mass, using cosmic-ray muons in a 1-ton scale detector at BNL. The light yield is measured as (69.16 $\\pm$ 6.92) ph / MeV at 0.35\\% concentration, which increased to (87.32 $\\pm$ 8.73) ph / MeV at 1\\%. These results establish a quantitative basis for optimizing future WbLS-based detectors in neutrino physics.",
    "authors": [
      "S. Gwon",
      "M. Askins",
      "D. M. Asner",
      "A. Baldoni",
      "D. F. Cowen",
      "R. Diaz Prerez",
      "M. V. Diwan",
      "S. Gokhale",
      "S. Hans",
      "P. Kumar",
      "G. Lawley",
      "S. Linden",
      "G. D. Orebi Gann",
      "J. Park",
      "C. Reyes",
      "R. Rosero",
      "K. Siyeon",
      "M. Smiley",
      "J. J. Wang",
      "M. Wilking",
      "G. Yang",
      "M. Yeh"
    ],
    "published": "2025-12-17T20:58:03Z",
    "updated": "2025-12-17T20:58:03Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.09895v2",
    "url": "https://arxiv.org/abs/2508.09895v2",
    "pdf_url": "https://arxiv.org/pdf/2508.09895v2.pdf",
    "title": "Exploring the Physics of the Plasma Liner Experiment: A Multi-dimensional Study with FLASH, OSIRIS, and HELIOS",
    "abstract": "The Plasma Liner Experiment (PLX) at Los Alamos National Laboratory (LANL) is a platform that seeks to achieve fusion via the Plasma-Jet-Driven Magneto-Inertial Fusion (PJMIF) concept. The experiment utilizes a constellation of plasma guns to generate fusion-relevant conditions and consists of three main phases: (1) target formation, in which up to four plasma guns shoot magnetized hydrogen or deuterium-tritium jets to form a quasi-spherical target, (2) liner formation, in which a 36 guns fire high-atomic-number (e.g., xenon) jets to form a liner shell, and (3) target compression, in which the formed liner implodes the pre-formed target. Each phase of the PLX operates in different plasma regimes, with different physics at play, thus each phase must be simulated separately with appropriate codes. In this study we highlight 1-, 2-, and 3-D simulation results of all three phases using the FLASH, OSIRIS, and HELIOS codes. Some of the key physical processes involved include shock dynamics, kinetic effects, anisotropic thermal conduction, resistive magnetic diffusion, radiation transport, and magnetized jet dynamics. The simulations show that the PLX can form a preheated ($\\sim$40 eV), magnetized (electron Hall parameter $>$1) target plasma, and a quasi-collisional liner shell, which can subsequently compress the target to fusion-relevant conditions, reaching temperatures in excess of 1 keV.",
    "authors": [
      "E. C. Hansen",
      "P. Farmakis",
      "D. Michta",
      "C. Ren",
      "H. Wen",
      "S. Langendorf",
      "F. Chu",
      "P. Tzeferacos"
    ],
    "published": "2025-08-13T15:55:14Z",
    "updated": "2025-12-17T18:37:01Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2501.00091v3",
    "url": "https://arxiv.org/abs/2501.00091v3",
    "pdf_url": "https://arxiv.org/pdf/2501.00091v3.pdf",
    "title": "Deep learning optimal molecular scintillators for dark matter direct detection",
    "abstract": "Direct searches for sub-GeV dark matter are limited by the intrinsic quantum properties of the target material. In this proof-of-concept study, we argue that this problem is particularly well suited for machine learning. We demonstrate that a simple neural architecture consisting of a variational autoencoder and a multi-layer perceptron can efficiently generate unique molecules with desired properties. In specific, the energy threshold and signal (quantum) efficiency determine the minimum mass and cross section to which a detector can be sensitive. Organic molecules present a particularly interesting class of materials with intrinsically anisotropic electronic responses and $\\mathcal{O}$(few) eV excitation energies. However, the space of possible organic compounds is intractably large, which makes traditional database screening challenging. We adopt excitation energies and proxy transition matrix elements as target properties learned by our network. Our model is able to generate molecules that are not in even the most expansive quantum chemistry databases and predict their relevant properties for high-throughput and efficient screening. Following a massive generation of novel molecules, we use clustering analysis to identify some of the most promising molecular structures that optimise the desired molecular properties for dark matter detection.",
    "authors": [
      "Cameron Cook",
      "Carlos Blanco",
      "Juri Smirnov"
    ],
    "published": "2024-12-30T19:00:00Z",
    "updated": "2025-12-17T17:23:29Z",
    "categories": [
      "hep-ph",
      "cond-mat.mtrl-sci",
      "hep-ex",
      "hep-th",
      "physics.ins-det"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2504.03862v2",
    "url": "https://arxiv.org/abs/2504.03862v2",
    "pdf_url": "https://arxiv.org/pdf/2504.03862v2.pdf",
    "title": "Probing the Firn Refractive Index Profile Using Antenna Response",
    "abstract": "The Radio Neutrino Observatory-Greenland (RNO-G, at Summit Station) experiment comprises an extensive fat-dipole antenna array deployed into ice boreholes over an eventual area of approximately 35 ${\\rm km}^2$. Since the RNO-G experimental sensitivity depends on the radio-frequency properties of the firn, which are known to vary laterally on sub-km distance scales and vertically on sub-meter distance scales, a technique for quickly extracting information on firn ice properties with depth ($n(z)$) during drilling and deployment is desirable. Given that a dipole's resonant wavelength is fixed by geometry, the resonant frequency $f_{res}$ (measured as an S-parameter reflection coefficient [`$S_{11}$'] minimum) scales inversely with the local refractive index, allowing a translation of a depth-dependent $S_{11}$(z) profile into $n(z)$. $S_{11}$(z) data were initially taken in August, 2024 using a dipole lowered into a newly-drilled $98\\pm 1$-mm diameter, 350-m deep borehole at Summit Station, Greenland, approximately 1 km from the site of the original GISP-2 core; improved measurements were subsequently made in May, 2025. We conclude that $S_{11}$(z) data can be used to estimate \\RIP, on 50 cm vertical scales, at the per-cent level of accuracy required by experiments such as RN0-G.",
    "authors": [
      "S. Agarwal",
      "J. A. Aguilar",
      "N. Alden",
      "S. Ali",
      "P. Allison",
      "M. Betts",
      "D. Besson",
      "A. Bishop",
      "O. Botner",
      "S. Bouma",
      "S. Buitink",
      "R. Camphyn",
      "S. Chiche",
      "B. A. Clark",
      "A. Coleman",
      "K. Couberly",
      "S. de Kockere",
      "K. D. de Vries",
      "C. Deaconu",
      "P. Giri",
      "C. Glaser",
      "T. Glusenkamp",
      "A. Hallgren",
      "S. Hallmann",
      "J. C. Hanson",
      "B. Hendricks",
      "J. Henrichs",
      "N. Heyer",
      "C. Hornhuber",
      "E. Huesca Santiago",
      "K. Hughes",
      "T. Karg",
      "A. Karle",
      "J. L. Kelley",
      "M. Korntheuer",
      "M. Kowalski",
      "I. Kravchenko",
      "R. Krebs",
      "R. Lahmann",
      "C. H. Liu",
      "M. J. Marsee",
      "C. McLennan",
      "M. Mikhailova",
      "K. Mulrey",
      "M. Muzio",
      "A. Nelles",
      "A. Novikov",
      "A. Nozdrina",
      "E. Oberla",
      "B. Oeyen",
      "N. Punsuebsay",
      "L. Pyras",
      "M. Ravn",
      "D. Ryckbosch",
      "F. Schluter",
      "O. Scholten",
      "D. Seckel",
      "M. F. H. Seikh",
      "J. Stachurska",
      "J. Stoffels",
      "S. Toscano",
      "D. Tosi",
      "J. Tutt",
      "D. J. Van Den Broeck",
      "N. van Eijndhoven",
      "A. G. Vieregg",
      "A. Vijai",
      "C. Welling",
      "D. R. Williams",
      "P. Windischhofer",
      "S. Wissel",
      "R. Young",
      "A. Zink"
    ],
    "published": "2025-04-04T18:38:26Z",
    "updated": "2025-12-17T17:07:42Z",
    "categories": [
      "astro-ph.IM",
      "astro-ph.HE",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2512.15588v1",
    "url": "https://arxiv.org/abs/2512.15588v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15588v1.pdf",
    "title": "Impact of magnetic islands on plasma flow and turbulence in W7-X",
    "abstract": "The effect of magnetic islands on plasma flow and turbulence has been experimentally investigated in the stellarator W7-X. Magnetic configurations with the 5/5 magnetic island positioned at the plasma edge, inside the last closed flux surface, are studied. The main diagnostic used in the present work is a V-band Doppler reflectometer that allows the measurement of the perpendicular plasma flow and density fluctuations with good spatial resolution. A characteristic signature of the 5/5 magnetic island is clearly detected in the perpendicular flow profile. The comparison of the experimental flow and the neoclassically driven $E\\times B$ flow indicates that the island contribution to the flow is maximum at the island boundaries and close to zero at the island O-point. Besides, a reduction in the density fluctuation level is found nearby the island O-point. The similarities between these observations and those found in other devices and in gyrokinetic simulations are discussed.",
    "authors": [
      "T. Estrada",
      "E. Maragkoudakis",
      "D. Carralero",
      "T. Windisch",
      "J. L Velasco",
      "C. Killer",
      "T. Andreeva",
      "J. Geiger",
      "A. Dinklage",
      "A. Krämer-Flecken",
      "G. A. Wurden",
      "M. Beurskens",
      "S. Bozhenkov",
      "H. Damm",
      "G. Fuchert",
      "E. Pasch"
    ],
    "published": "2025-12-17T16:48:22Z",
    "updated": "2025-12-17T16:48:22Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1088/1741-4326/ac146f"
  },
  {
    "arxiv_id": "2512.15585v1",
    "url": "https://arxiv.org/abs/2512.15585v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15585v1.pdf",
    "title": "Study of a triple-discriminating plastic scintillator detector for fast neutrons, thermal neutrons, and gamma rays",
    "abstract": "Detecting fast and thermal neutrons plays a crucial role in neutrino experiments and reactor physics. In this study, we propose a plastic scintillator detector which demonstrates the ability to clearly distinguish fast neutrons, thermal neutrons, and gamma rays within mixed radiation fields, offering a practical approach for multi-radiation detection. Two plastic scintillator assemblies: EJ200+EJ426 and EJ276+EJ426 were setup, and the system energy response was calibrated using three gamma sources(137Cs, 22Na and 60Co). An Am-Be neutron source was employed, and pulse shape discrimination(PSD) was used to separate fast neutrons, thermal neutrons and gamma rays. Using a three-sigma discrimination criterion, the EJ200+EJ426 configuration was found to reliably distinguish thermal neutrons from gamma rays, while the EJ276+EJ426 configuration can effectively discriminate fast neutrons, thermal neutrons and gamma rays at gamma-equivalent energies above 1 MeV.",
    "authors": [
      "Y. H. Liu",
      "X. S. Zhang",
      "D. X. Lu",
      "W. Wang",
      "G. Luo",
      "F. P. An"
    ],
    "published": "2025-12-17T16:45:13Z",
    "updated": "2025-12-17T16:45:13Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.15576v1",
    "url": "https://arxiv.org/abs/2512.15576v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15576v1.pdf",
    "title": "Radial electric field and density fluctuations measured by Doppler reflectometry during the post-pellet enhanced confinement phase in W7-X",
    "abstract": "Radial profiles of density fluctuations and radial electric field, $E_r$, have been measured using Doppler reflectometry during the post-pellet enhanced confinement phase achieved, under different heating power levels and magnetic configurations, along the 2018 W7-X experimental campaign. A pronounced $E_r$-well is measured with local values as high as -40 kV/m in the radial range $ρ\\sim 0.7-0.8$ during the post-pellet enhanced confinement phase. The maximum $E_r$ intensity scales with both plasma density and Electron Cyclotron Heating (ECH) power level following a similar trend as the plasma energy content. A good agreement is found when the experimental $E_r$ profiles are compared to simulations carried out using the neoclassical codes DKES and KNOSOS. The density fluctuation level decreases from the plasma edge toward the plasma core and the drop is more pronounced in the post-pellet enhanced confinement phase than in reference gas fuelled plasmas. Besides, in the post-pellet phase, the density fluctuation level is lower in the high iota magnetic configuration than in the standard one. In order to discriminate whether this difference is related to the differences in the plasma profiles or in the stability properties of the two configurations, gyrokinetic simulations have been carried out using the codes \\texttt{stella} and EUTERPE. The simulation results point to the plasma profile evolution after the pellet injection and the stabilization effect of the radial electric field profile as the dominant players in the stabilization of the plasma turbulence.",
    "authors": [
      "T. Estrada",
      "D. Carralero",
      "T. Windisch",
      "E. Sánchez",
      "J. M. García-Regaña",
      "J. Martínez-Fernández",
      "A. de la Peña",
      "J. L. Velasco",
      "J. A. Alonso",
      "M. Beurskens",
      "S. Bozhenkov",
      "H. Damm",
      "G. Fuchert",
      "R. Kleiber",
      "N. Pablant",
      "E. Pasch"
    ],
    "published": "2025-12-17T16:34:07Z",
    "updated": "2025-12-17T16:34:07Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1088/1741-4326/abddee"
  },
  {
    "arxiv_id": "2510.14440v2",
    "url": "https://arxiv.org/abs/2510.14440v2",
    "pdf_url": "https://arxiv.org/pdf/2510.14440v2.pdf",
    "title": "Beam Energy Measurement using a Bayesian Approach with the Stacked Foil Method",
    "abstract": "We present a practical method to measure the energy of proton beams at a medical cyclotron using the stacked foil technique in combination with a Bayesian inference method. By measuring the $^{48}$V activity induced in a stack of irradiated titanium foils, the proton energy can be inferred without relying on direct current or charge measurements, making the method suitable even for low-vacuum environments or air-exposed setups. This technique is further extended to configurations where the beam energy is degraded to levels around 8 MeV. A Bayesian fit of the measured activity profile allows not only for a robust energy estimation but also for a consistent treatment of uncertainties and nuisance parameters. Monte Carlo simulations are employed to validate the underlying assumptions, including the impact of energy dispersion or cross-section uncertainties. Our results demonstrate that this method provides accurate beam energy measurements across several typical experimental setups used at the Bern Medical Cyclotron. Additionally, we evaluate the sensitivity of the method to the choice of nuclear cross-section data and assess how the number of foils in the stack affects the uncertainty in the inferred beam energy.",
    "authors": [
      "Alexander Gottstein",
      "Lorenzo Mercolli",
      "Eva Kasanda",
      "Isidre Mateu",
      "Lars Eggimann",
      "Elnaz Zyaee",
      "Gaia Dellepiane",
      "Pierluigi Casolaro",
      "Paola Scampoli",
      "Saverio Braccini"
    ],
    "published": "2025-10-16T08:40:51Z",
    "updated": "2025-12-17T16:00:57Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex",
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.24418v2",
    "url": "https://arxiv.org/abs/2510.24418v2",
    "pdf_url": "https://arxiv.org/pdf/2510.24418v2.pdf",
    "title": "ASTAROTH: A Novel Detector for Dark Matter Direct Detection Using Cryogenic SiPMs",
    "abstract": "The DAMA experiment's long-standing claim of dark matter detection remains a key open issue in astroparticle physics. Independent verification requires NaI(Tl)-based detectors with enhanced low-energy sensitivity. Current detectors rely on photomultiplier tubes (PMTs) which features limited detection efficiency, intrinsic radioactivity, and high noise at keV energies. ASTAROTH is an R&D project that developed a proof of concept NaI(Tl) detector where siliconphotomultipliers (SiPMs) have been used instead of PMTs, offering higher photon detection efficiency, negligible radioactivity, and, most of all, a reduction of two orders of magnitude in the dark noise. The setup includes a custom cryostat operating at approximately 80 K. We report the first characterization of an approximately 360 g NaI(Tl) crystal coupled to a 5 x 5 cm SiPM matrix, yielding 4.5 photoelectrons\\keV after crosstalk correction. This promising result demonstrates the feasibility of SiPM-based readout for NaI(Tl) and paves the way for future large-scale dark matter experiments.",
    "authors": [
      "Edoardo Martinenghi",
      "Valerio Toso",
      "Fabrizio Bruno Armani",
      "Andrea Castoldi",
      "Giuseppe Di Carlo",
      "Luca Frontini",
      "Niccolò Gallice",
      "Chiara Guazzoni",
      "Valentino Liberali",
      "Lorenzo Rutigliani",
      "Alberto Stabile",
      "Krzysztof Szczepaniec",
      "Valeria Trabattoni",
      "Andrea Zani",
      "Davide D'Angelo"
    ],
    "published": "2025-10-28T13:35:01Z",
    "updated": "2025-12-17T15:48:40Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/12/C12019"
  },
  {
    "arxiv_id": "2512.15521v1",
    "url": "https://arxiv.org/abs/2512.15521v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15521v1.pdf",
    "title": "Autonomous Pressure Control in MuVacAS via Deep Reinforcement Learning and Deep Learning Surrogate Models",
    "abstract": "The development of nuclear fusion requires materials that can withstand extreme conditions. The IFMIF-DONES facility, a high-power particle accelerator, is being designed to qualify these materials. A critical testbed for its development is the MuVacAS prototype, which replicates the final segment of the accelerator beamline. Precise regulation of argon gas pressure within its ultra-high vacuum chamber is vital for this task. This work presents a fully data-driven approach for autonomous pressure control. A Deep Learning Surrogate Model, trained on real operational data, emulates the dynamics of the argon injection system. This high-fidelity digital twin then serves as a fast-simulation environment to train a Deep Reinforcement Learning agent. The results demonstrate that the agent successfully learns a control policy that maintains gas pressure within strict operational limits despite dynamic disturbances. This approach marks a significant step toward the intelligent, autonomous control systems required for the demanding next-generation particle accelerator facilities.",
    "authors": [
      "Guillermo Rodriguez-Llorente",
      "Galo Gallardo",
      "Rodrigo Morant Navascués",
      "Nikita Khvatkin Petrovsky",
      "Anderson Sabogal",
      "Roberto Gómez-Espinosa Martín"
    ],
    "published": "2025-12-17T15:19:55Z",
    "updated": "2025-12-17T15:19:55Z",
    "categories": [
      "physics.acc-ph",
      "cs.LG"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.15456v1",
    "url": "https://arxiv.org/abs/2512.15456v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15456v1.pdf",
    "title": "The role of the exchange-Coulomb potential in two-dimensional electron transport",
    "abstract": "We develop a quantum kinetic theory of two-dimensional electron gases in which exchange is treated self-consistently at the Hartree-Fock level and enters as a nonlocal, momentum-dependent field in phase space. By starting from the Coulomb Hamiltonian, we derive a Hartree-Fock-Wigner equation for the electronic Wigner function and obtain a closed fluid model with exchange-corrected pressure, force, and current. For a single layer, we show that exchange renormalizes the Fermi velocity and can drive a long-wavelength plasmonic instability at low densities. In coupled layers, the same framework predicts acoustic-optical mode coupling, and an instability forming long-lived charge-imbalance patterns that are not predicted by classical Vlasov and Boltzmann models. Finally, we apply the kinetic model to the Coulomb drag problem and show how exchange substantially enhances the drag resistivity in dilute GaAs double wells, quantitatively matching experimental observations.",
    "authors": [
      "J. L. Figueiredo",
      "J. T. Mendonça",
      "H. Terças"
    ],
    "published": "2025-12-17T13:56:45Z",
    "updated": "2025-12-17T13:56:45Z",
    "categories": [
      "cond-mat.mes-hall",
      "cond-mat.quant-gas",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.mes-hall"
  },
  {
    "arxiv_id": "2512.15444v1",
    "url": "https://arxiv.org/abs/2512.15444v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15444v1.pdf",
    "title": "A muon scattering tomography system based on high spatial resolution scintillating detector",
    "abstract": "Cosmic ray muon scattering tomography (MST) is an imaging technique that utilizes muon scattering in matter to inspect high-Z materials non-destructively, without requiring an artificial radiation source. This method offers significant potential for applications in border security and long-term monitoring of nuclear materials. In this study, we developed a high-precision plastic-scintillator-based position-sensitive detector with a spatial resolution of 0.09 times the strip pitch. A fully functional, full-scale imaging system was then constructed using four layers of such XY position-sensitive detectors, each with an effective area of 53 cm x 53 cm. This paper details the following key contributions: the Geant4-simulated design and optimization of the imaging system, the fabrication, assembly, and testing of the detectors, and an evaluation of the imaging performance of the completed system.",
    "authors": [
      "Zheng Liang",
      "Zebo Tang",
      "Xin Li",
      "Baiyu Liu",
      "Cheng Li",
      "Jiacheng He",
      "Kun Jiang",
      "Yonggang Wang",
      "Ye Tian",
      "Yishuang Zhang",
      "Zeyu Wang"
    ],
    "published": "2025-12-17T13:41:16Z",
    "updated": "2025-12-17T13:41:16Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.08389v2",
    "url": "https://arxiv.org/abs/2512.08389v2",
    "pdf_url": "https://arxiv.org/pdf/2512.08389v2.pdf",
    "title": "Development & first Performance evaluation of multi-element monolithic HPGe detector for X-ray spectroscopy",
    "abstract": "The first operational prototype of a high-purity Germanium (HPGe) detector developed within the European LEAPS-INNOV project is presented in this work. This prototype features a monolithic, multi-element sensor optimized for high-resolution X-ray spectroscopy in the hard X-ray regime, capable of handling high count rates (20-250 kcps/mm2) across a broad energy range (5-100 keV). We discuss here a complete laboratory-based characterization of the detector's performance, as well as an on-beam evaluation at the BM05 beamline of the ESRF synchrotron facility, using monochromatic X-rays in the 20-50 keV energy range. We provide a detailed performance assessment that also includes a phenomenological defect-depth estimation model.",
    "authors": [
      "N. Goyal",
      "F. J. Iguaz",
      "S. Aplin",
      "A. Balerna",
      "P. Bell",
      "J. Casas",
      "M. Cascella",
      "S. Chatterji",
      "C. Cohen",
      "E. Collet",
      "E. N. Gimenez",
      "H. Graafsma",
      "H. Hirsemann",
      "K. Klementiev",
      "T. Kolodziej",
      "T. Martin",
      "R. H. Menk",
      "C. Menneglier",
      "C. Meraihia",
      "J. R. Murias",
      "M. Porro",
      "M. Quispe",
      "B. Schmitt",
      "S. Scully",
      "M. Turcato",
      "C. Ward",
      "E. Welter"
    ],
    "published": "2025-12-09T09:18:54Z",
    "updated": "2025-12-17T12:52:09Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.15360v1",
    "url": "https://arxiv.org/abs/2512.15360v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15360v1.pdf",
    "title": "First implementation of AXUV-based analysis and macro-instability diagnostics on WHAM",
    "abstract": "Absolute extreme ultraviolet (AXUV) diode arrays are widely used in fusion experiments for time-resolved measurements of plasma radiation. We report the first implementation of an AXUV-based analysis framework on the Wisconsin High-Temperature Superconducting (HTS) Axisymmetric Mirror (WHAM). A single, precisely calibrated 20-channel AXUV assembly measures line-integrated plasma emission with $ 100~\\mathrm{kHz}$ temporal resolution and $\\sim1~\\mathrm{cm}$ spatial accuracy across the mid-plane. The data were processed to obtain plasma's statistical moments, yielding time-resolved measurement of the centroid displacement $Φ(t)$ and effective radius $R(t)$. From the joint covariance of these quantities, we define a macroscopic instability parameter $χ(t)$, that quantifies large-scale plasma motion and profile evolution directly from AXUV observables. The parameter $χ$ serves as a compact indicator of global macroscopic instability, decreasing with increasing end-plate bias and exhibiting strong anti-correlation with diamagnetic flux during confinement transitions. These results demonstrate that a single AXUV array can provide quantitative, real-time assessment of macroscopic plasma instabilities, constituting the first demonstration of such capability in a magnetic mirror plasma. Future extensions to multiple arrays will further enhance spatial coverage and enable full-mode tracking in axisymmetric mirror configurations and related fusion devices.",
    "authors": [
      "K. Shih",
      "D. Endrizzi",
      "D. A. Sutherland",
      "J. Anderson",
      "D. Bindl",
      "E. L. Claveau",
      "C. Everson",
      "J. Eickman",
      "S. J. Frank",
      "E. Marriott",
      "E. Penne",
      "J. Pizzo",
      "T. Qian",
      "J. Viola",
      "C. B. Forest",
      "D. Yakovlev"
    ],
    "published": "2025-12-17T12:06:14Z",
    "updated": "2025-12-17T12:06:14Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.15289v1",
    "url": "https://arxiv.org/abs/2512.15289v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15289v1.pdf",
    "title": "Pixel response characterization of the ARCADIA Fully Depleted MAPS",
    "abstract": "Monolithic Active Pixel Sensors (MAPS) achieved widespread use in several scientific applications, thanks to their properties, such as low material budget and high granularity. The ARCADIA INFN project developed a Fully-Depleted MAPS (FD-MAPS), using a modified LFoundry 110 nm CIS process. This work presents the first laboratory characterization of the ARCADIA MD3 prototype. Measurements include threshold uniformity studies using both test-pulse injection and a $^{55}$Fe source, as well as threshold and noise calibration achieved thanks to monochromatic X-ray sources. Ultimately, charge-collection efficiency is evaluated using an infrared laser setup.",
    "authors": [
      "C. Pantouvakis",
      "M. Rignanese",
      "T. Zenger",
      "S. Ciarlantini",
      "A. Zingaretti",
      "P. Azzi",
      "C. Bonini",
      "D. Chiappara",
      "S. Mattiazzo",
      "D. Pantano",
      "J. Wyss",
      "A. Apresyan",
      "N. Bacchetta",
      "L. Bolla",
      "A. Hayrapetyan",
      "C. Pena",
      "N. Salvador",
      "S. Xie",
      "I. Zoi",
      "D. Falchieri",
      "S. Garbolino",
      "L. Pancheri",
      "A. Paternò",
      "A. Rivetti",
      "M. Rolo",
      "R. Santoro",
      "P. Giubilato"
    ],
    "published": "2025-12-17T10:41:33Z",
    "updated": "2025-12-17T10:41:33Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.15271v1",
    "url": "https://arxiv.org/abs/2512.15271v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15271v1.pdf",
    "title": "MHD Simulation Study on Impurity Assimilation Efficiency and Disruption Dynamics during Shattered Pellet Injection",
    "abstract": "Shattered Pellet Injection (SPI) has become a critical technique for mitigating plasma disruptions in fusion devices, yet optimizing its efficiency demands a proper understanding of the interaction between impurity dynamics and MHD response. We perform 3D nonlinear MHD simulations of SPI-induced disruption in a J-TEXT-like tokamak using the NIMROD code, systematically examining key parameters: fragment velocity and fineness, injection quantity, impurity composition, injection location and multiple injectors, resistivity, and parallel thermal conductivity. We find that slower fragment velocity enhances impurity assimilation and amplifies MHD activity. Finer fragments significantly increase impurity ablation and cooling efficiency. Mixed deuterium-neon pellets effectively elevate electron density without compromising radiative cooling efficiency. Plasma poloidal rotation affects ablation and cooling efficiency, whereas toroidally uniform multi-pellet injection enhances impurity ablation by nearly a factor equal to the number of pellets and lowers radiation asymmetry. Higher plasma parallel thermal conductivity results in higher radiation cooling efficiency in parallel directions, enhances impurity transport, and reduces toroidal peaking factor (TPF) of radiation. Variations in resistivity significantly influence Ohmic heating, impurity deposition and current dynamics after TQ, with higher resistivity leading to stronger magnetic perturbations and more pronounced current spikes. These findings provide physical bases for optimizing SPI schemes in future tokamak devices.",
    "authors": [
      "Jinqiang Mao",
      "Ping Zhu",
      "Shiyong Zeng"
    ],
    "published": "2025-12-17T10:25:25Z",
    "updated": "2025-12-17T10:25:25Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.15264v1",
    "url": "https://arxiv.org/abs/2512.15264v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15264v1.pdf",
    "title": "Channel-Level Calibration Methods of Silicon Photomultiplier for JUNO-TAO Central Detector",
    "abstract": "The Taishan Antineutrino Observatory (TAO or JUNO-TAO) is a satellite observatory for the Jiangmen Underground Neutrino Observatory (JUNO), located 44 meters away from the No.1 reactor of the Taishan Nuclear Power Plant. TAO can measure the reactor antineutrino energy spectrum with excellent energy resolution (better than 2\\% at 1 MeV) using state-of-the-art Silicon Photomultipliers (SiPMs) operated at low temperature. To achieve this goal, the SiPMs (together with their readout electronics) must be well calibrated. This paper presents the channel-level calibration methods for the dark count rate (DCR), relative photon detection efficiency (PDE), time offset, gain, and internal optical crosstalk (IOCT) of the SiPMs based on charge and time information of the collected events. For the calibration of the external optical crosstalk (EOCT), in terms of its rate and emission angle distribution, a novel method is proposed by switching on and off different groups of SiPMs with an LED placed in the detector. Using one million simulated events, the expected calibration biases are evaluated for all the aforementioned parameters: relative PDE (2.1\\%), IOCT (1.4\\%), DCR (0.4\\%), EOCT Rate ($<0.1\\%$), gain ($<0.1\\%$), time offset (0.027 ns). The emission angle distribution of the EOCT photons could be measured with a bias of less than 4\\% in main angular range.",
    "authors": [
      "Jiayang Xu",
      "Yichen Li",
      "Zhan Liang",
      "Guofu Cao",
      "Zelin Chen"
    ],
    "published": "2025-12-17T10:13:18Z",
    "updated": "2025-12-17T10:13:18Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.15239v1",
    "url": "https://arxiv.org/abs/2512.15239v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15239v1.pdf",
    "title": "Magnetised turbulent plasmas as high-energy particle accelerators",
    "abstract": "This proceedings paper reports on the theoretical modelling of particle acceleration in magnetised turbulent plasmas. It briefly reviews some recent findings obtained from fully kinetic numerical simulations of large-amplitude, semi to fully relativistic turbulence. The paper then argues that these findings can be understood within the framework of a ``generalised Fermi'' picture of stochastic acceleration, which it summarises. The dominant contributions to acceleration appear to arise from particle interactions with sharp, dynamic bends of the magnetic field lines and regions of velocity compression. Interestingly, the acceleration rate is spatially inhomogeneous and its probability distribution follows a broken power law extending up to large values. This makes relativistic, large-amplitude turbulence an extreme particle accelerator. Some implications for particle transport and the shape of the particle energy spectrum in the presence of radiative losses and over long timescales are also discussed.",
    "authors": [
      "M. Lemoine"
    ],
    "published": "2025-12-17T09:40:01Z",
    "updated": "2025-12-17T09:40:01Z",
    "categories": [
      "astro-ph.HE",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2512.15230v1",
    "url": "https://arxiv.org/abs/2512.15230v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15230v1.pdf",
    "title": "ColliderML: The First Release of an OpenDataDetector High-Luminosity Physics Benchmark Dataset",
    "abstract": "We introduce ColliderML - a large, open, experiment-agnostic dataset of fully simulated and digitised proton-proton collisions in High-Luminosity Large Hadron Collider conditions ($\\sqrt{s}=14$ TeV, mean pile-up $μ= 200$). ColliderML provides one million events across ten Standard Model and Beyond Standard Model processes, plus extensive single-particle samples, all produced with modern next-to-leading order matrix element calculation and showering, realistic per-event pile-up overlay, a validated OpenDataDetector geometry, and standard reconstructions. The release fills a major gap for machine learning (ML) research on detector-level data, provided on the ML-friendly Hugging Face platform. We present physics coverage and the generation, simulation, digitisation and reconstruction pipeline, describe format and access, and initial collider physics benchmarks.",
    "authors": [
      "Doğa Elitez",
      "Paul Gessinger",
      "Daniel Murnane",
      "Marcus Selchou Raaholt",
      "Andreas Salzburger",
      "Stine Kofoed Skov",
      "Andreas Stefl",
      "Anna Zaborowska"
    ],
    "published": "2025-12-17T09:30:44Z",
    "updated": "2025-12-17T09:30:44Z",
    "categories": [
      "hep-ex",
      "cs.LG",
      "physics.data-an",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2512.09777v2",
    "url": "https://arxiv.org/abs/2512.09777v2",
    "pdf_url": "https://arxiv.org/pdf/2512.09777v2.pdf",
    "title": "Machine Learning Optimization of BEGe Detector Event Selection in the VIP Experiment",
    "abstract": "The VIP collaboration operates a Broad Energy Germanium detector at the Gran Sasso National Laboratory to measure radiation in the few keV to 100 keV range, aiming to search for spontaneous collapse induced radiation and atomic transitions that violate the Pauli Exclusion Principle. Here we present a machine learning based upgrade for the BEGe detector using an event selection strategy aimed at improving the efficiency in detecting low energy events down to 10 keV. The method employs a denoising autoencoder to suppress electronic and microphonic noises and to reconstruct pulse shapes, followed by a convolutional neural network that classifies waveforms as normal single site or events with anomalies. The workflow was validated on a dataset comprising more than 20000 waveforms recorded in 2021. The classifier achieves a receiver operating characteristic curve with an area under the curve of 0.99 and an accuracy of 95 percent. Applying this procedure lowers the minimum detectable energy of the final spectrum to approximately 10 keV. It also yields a measurable enhancement in spectral quality, including an improvement of about 14 percent in the signal to background ratio and a reduction of the energy resolution for the characteristic Pb and Bi gamma lines. These developments enhance the sensitivity of the BEGe detector to rare low energy signals and provide a scalable framework for future precision tests of quantum foundations in low background environments.",
    "authors": [
      "Simone Manti",
      "Jason Yip",
      "Massimiliano Bazzi",
      "Nicola Bortolotti",
      "Mario Bragadireanu",
      "Ivan Carnevali",
      "Alberto Clozza",
      "Luca De Paolis",
      "Raffaele Del Grande",
      "Carlo Guaraldo",
      "Mihai Antoniu Iliescu",
      "Matthias Laubenstein",
      "Johan Marton",
      "Fabrizio Napolitano",
      "Federico Nola",
      "Kristian Pischicchia",
      "Alessio Porcelli",
      "Alessandro Scordo",
      "Francesco Sgaramella",
      "Diana Sirghi",
      "Florin Sirghi",
      "Johann Zmeskal",
      "Catalina Curceanu"
    ],
    "published": "2025-12-10T15:56:35Z",
    "updated": "2025-12-17T09:05:04Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.15172v1",
    "url": "https://arxiv.org/abs/2512.15172v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15172v1.pdf",
    "title": "Characterising injection signatures in Jupiter's ultraviolet aurora using Juno observations",
    "abstract": "Discrete features in Jupiter's ultraviolet aurora have been interpreted as signatures of plasma injections in the middle magnetosphere. There exists some ambiguity whether magnetodisc scattering or high-latitude Alfvenic acceleration best describes the observed properties of these injection signatures, and also to what extent arcs in the outer emission are related to injections. Many injection signatures are the result of the evolution of dawn storms; there is, however, limited evidence that non-dawn-storm injection signatures are sometimes present in the aurora. We use automatic detection of these discrete features, alongside data from Juno-UVS and in-situ measurements by other Juno instruments, to show that scattering likely accounts for most of the electron precipitation associated with injection signatures. Additionally, there is evidence that injection signatures can be classified into two types: dawn-storm and non-dawn-storm. Arc-like features in the outer emission show very similar properties to traditional blob-like injection signatures and may consist of sequences of injection signatures that have broadened into an arc via energy-dependent electron drift.",
    "authors": [
      "Linus Head",
      "Denis Grodent",
      "Bertrand Bonfond",
      "Alessandro Moirano",
      "Guillaume Sicorello",
      "Julie Vinesse",
      "Alyssa Mouton",
      "Maïté Dumont",
      "Thomas Greathouse",
      "Vincent Hue",
      "Ali Sulaiman",
      "Barry Mauk",
      "Zhonghua Yao",
      "Ruilong Guo",
      "Jinyan Zhao"
    ],
    "published": "2025-12-17T08:09:04Z",
    "updated": "2025-12-17T08:09:04Z",
    "categories": [
      "astro-ph.EP",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.EP"
  },
  {
    "arxiv_id": "2512.15159v1",
    "url": "https://arxiv.org/abs/2512.15159v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15159v1.pdf",
    "title": "Discussion on the vanishment of solar atmospheric structures during magnetic reconnection",
    "abstract": "In solar atmosphere, magnetic reconnection alters the topological connectivity, and magnetic energy is released. However, the length change of the reconnecting structures has rarely been reported. To identify the evolution of the topological structures, we search for reconnection events which should satisfy 3 criteria. (1) Each event displays an explicit X-type configuration, and the configuration consists of two sets of independent atmospheric structures, (2) the reconnection process is clearly observed, and (3) the topological connectivity of the structures can be tracked from at least 5 minutes prior to the occurrence of magnetic reconnection to 5 minutes after the reconnection. In this work, 3 events are selected and studied. During the reconnection moment, the total length of the two topological structures in each event shortens suddenly, and the decrements for events 1--3 are 47 Mm, 3.7 Mm, and 8.2 Mm, respectively, implying that partial structures vanish observationally during magnetic reconnection process. Several possibilities about the vanishment, e.g. the shrinkage of the reconnecting structures due to magnetic tension, the bizarre change in the third dimension, and magnetic field annihilation, have been discussed.",
    "authors": [
      "Jun Zhang",
      "Tao Ding",
      "Yulei Wang"
    ],
    "published": "2025-12-17T07:50:03Z",
    "updated": "2025-12-17T07:50:03Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2512.14033v2",
    "url": "https://arxiv.org/abs/2512.14033v2",
    "pdf_url": "https://arxiv.org/pdf/2512.14033v2.pdf",
    "title": "Liquid Handling of the JUNO Experiment",
    "abstract": "The Filling, Overflow, and Circulation (FOC) system is a critical subsystem of the Jiangmen Underground Neutrino Observatory (JUNO), responsible for the safe handling of the Liquid Scintillator (LS) and water throughout the detector's commissioning and operational lifetime. This paper details the design and operation of the FOC system, which accomplished the filling of the world's largest LS detector--taking 45 days for water (6.4*10^4 m^3) and 200 days for LS (2.3*10^4 m^3). Throughout water filling, the liquid level difference between the Central Detector and Water Pool was rigorously maintained within safety limits. During LS filling, level control achieved +/-2 cm precision with flow regulation within +/-0.5% of setpoints. An automated control system based on Programmable Logic Controllers and the Experimental Physics and Industrial Control System framework ensured reliable operation. The system preserved LS radiopurity, maintaining 222Rn below 1 mBq/m^3 during filling and achieving 238U/232Th concentrations below 10^-16 g/g. The successful commissioning and operation of the FOC system have established it as an indispensable foundation for the stable long-term operation of the JUNO detector.",
    "authors": [
      "Jiajun Li",
      "Yuekun Heng",
      "Jiajie Ling",
      "Zhi Wu",
      "Xiao Tang",
      "Cong Guo",
      "Jinchang Liu",
      "Xiaolan Luo",
      "Xiao Cai",
      "Chengfeng Yang",
      "Xiaoyan Ma",
      "Xiaohui Qian",
      "Tao Huang",
      "Bi Wu",
      "Pengfei Yang",
      "Shiqi Zhang",
      "Baobiao Yue",
      "Shuaijie Li",
      "Lei Yang",
      "Mei Ye",
      "Shenghui Liu"
    ],
    "published": "2025-12-16T02:57:17Z",
    "updated": "2025-12-17T07:35:23Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.13692v2",
    "url": "https://arxiv.org/abs/2507.13692v2",
    "pdf_url": "https://arxiv.org/pdf/2507.13692v2.pdf",
    "title": "Energy exchange between electrons and ions driven by ITG-TEM turbulence",
    "abstract": "In this study, the energy exchange between electrons and ions in ITG TEM turbulence is investigated using gyrokinetic simulations. The energy exchange in TEM turbulence is primarily composed of the cooling of electrons associated with perpendicular drift and the heating of ions moving parallel to magnetic field lines. TEM turbulence facilitates energy transfer from electrons to ions, which is opposite to the direction observed in ITG turbulence. In mixed ITG TEM turbulence, the relative magnitudes of parallel heating and perpendicular cooling for each species determine the overall direction and magnitude of energy exchange. From the viewpoint of entropy balance, it is further confirmed that energy flows from the species with larger entropy production, caused by particle and heat fluxes, to the other species in ITG TEM turbulence. The predictability of turbulent energy exchange in ITG-TEM turbulence by the quasilinear model is examined. In addition, an alternative method based on the correlation between energy flux and energy exchange is developed, and its validity is demonstrated.",
    "authors": [
      "T. Kato",
      "H. Sugama",
      "T. -H. Watanabe"
    ],
    "published": "2025-07-18T06:48:19Z",
    "updated": "2025-12-17T07:08:48Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.15025v1",
    "url": "https://arxiv.org/abs/2512.15025v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15025v1.pdf",
    "title": "Effects of Unequal Electron-Ion Plasma Beta on Pressure-Strain Interaction in Turbulent Plasmas",
    "abstract": "A common occurrence in weakly collisional space plasmas is the unequal electron-ion temperatures. The pressure-strain interaction provides a mechanism-agnostic pathway for increasing plasma internal energy through spatiotemporally local isotropic compression and volume preserving deformation, yet its behavior under thermal disequilibrium is largely unexplored. We investigate this using five fully kinetic two-dimensional particle-in-cell simulations of undriven decaying turbulence by varying the initial electron-to-ion temperature ratio. By analyzing the species' internal energy density alongside a decomposition of the pressure-strain term, with a focus on the volume-preserving deformation that contains normal and shear contributions, we quantify how the initial temperature imbalance modifies the channels through which turbulence increases each species' internal energy density. The cumulative pressure-strain interaction tracks the change in internal energy for both electrons and ions, with the total deformation channel of energy conversion dominating. We discover that local changes to electron internal energy density are governed primarily by the shear deformation power density, concentrated in electron-scale current sheets, while the ion shear and normal deformation components cancel, yielding a much smaller net deformation power density that peaks around, rather than within, those electron-scale current structures. We find that the amplitudes and localization of deformation change, but preserve these qualitative trends. Together, these results show how thermal disequilibrium could shape species-dependent turbulent \"heating rate\", measured via pressure-strain interaction and approximated via only its shear deformation part, and provide a framework for interpreting energy evolution and conversion in space plasmas where unequal species temperature is the norm.",
    "authors": [
      "M. Hasan Barbhuiya",
      "Subash Adhikari"
    ],
    "published": "2025-12-17T02:30:12Z",
    "updated": "2025-12-17T02:30:12Z",
    "categories": [
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.15022v1",
    "url": "https://arxiv.org/abs/2512.15022v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15022v1.pdf",
    "title": "Machine learning-based prediction of magnet errors in storage ring light sources",
    "abstract": "Magnet errors in storage rings significantly degrade beam performance, impacting the brightness and stability of the light source. Therefore, beam-based correction is crucial for the safe operation of machines and the stability of radiated photons. Unlike traditional correction methods such as linear optics from closed orbit, this paper proposes a machine learning (ML) framework to directly predict quadrupole/sextupole gradient errors and misalignment from beam position monitor-measured optics functions and closed-orbit distortion data. Based on a four-bend achromat storage ring lattice, we generate training datasets through ELEGANT numerical simulations and compare regression performance of Linear Regression, Support Vector Machine, Radial Basis Function Neural Network and Densely Connected Convolutional Network. Results demonstrate that ML models can effectively predict magnet errors and reconstruct ideal optics. This approach offers a novel strategy for accelerating storage ring commissioning and optimization, online diagnostics, and dynamic compensation for next-generation diffraction-limited rings.",
    "authors": [
      "Jianhao Xu"
    ],
    "published": "2025-12-17T02:21:45Z",
    "updated": "2025-12-17T02:21:45Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.15014v1",
    "url": "https://arxiv.org/abs/2512.15014v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15014v1.pdf",
    "title": "X-ray detected ferromagnetic resonance spectrometer with an out-of-vacuum photodetector",
    "abstract": "X-ray detected ferromagnetic resonance (XFMR) spectroscopy is an experimental technique for element-specific spin dynamics in the GHz regime and has been utilized to study spintronic materials. The XFMR signal is usually obtained by detecting X-ray excited optical luminescence (XEOL) emitted from a sample substrate. Here, we report the development of an XFMR spectrometer that is designed to place a photodetector for XEOL detection outside an ultra-high-vacuum chamber. This configuration allows for the easy replacement of detectors, such as photodiodes, CCD cameras, and spectrometers, depending on the experimental requirements. We demonstrated the measurement of XEOL spectra from MgO using a visible light spectrometer as well as the detection of XFMR signals originating from the spin precession of a permalloy (Ni80Fe20) thin film using a photodiode detector. The XFMR spectrometer with an out-of-vacuum photodetector expands possibilities for advanced measurements such as XFMR microscopy.",
    "authors": [
      "Tetsuro Ueno",
      "Yasuo Takeichi",
      "Masaki Mizuguchi",
      "Hideaki Iwasawa",
      "Yoshiyuki Ohtsubo",
      "Kanta Ono",
      "Hiroyuki Okazaki",
      "Songtian Li",
      "Seiji Sakai",
      "Tetsuya Yamaki",
      "Tetsu Watanuki",
      "Yoshinori Katayama",
      "Chiharu Mitsumata"
    ],
    "published": "2025-12-17T02:09:52Z",
    "updated": "2025-12-17T02:09:52Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2512.14997v1",
    "url": "https://arxiv.org/abs/2512.14997v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14997v1.pdf",
    "title": "Permanent magnet optimization of stellarators with coupling from finite permeability and demagnetization effects",
    "abstract": "Permanent magnets provide an attractive path for shaping university-scale stellarator magnetic fields. Previous work has shown that greedy permanent magnet optimization (GPMO) can produce sparse, grid-aligned arrays that match target surfaces with high accuracy under an ideal rigid-remanence model. Here we extend this approach to a greedy permanent magnet optimization with macromagnetic refinement (GPMOmr) by introducing a block-level macromagnetic model that accounts for magnet-magnet and magnet-coil coupling from finite permeability and demagnetizing interactions, and apply it to the published magnet grid from the MUSE stellarator design. Finite-permeability effects produce degree-scale tilts and few-percent magnitude changes in individual magnets and modify the surface-normal field $\\mathbf B\\cdot\\mathbf n$ only at the percent level, yet for a fixed layout they increase the standard squared-flux objective by more than a factor of two. When the same model is embedded in the greedy loop, GPMOmr achieves $f_B$ histories and final errors within a few percent of classical GPMO while producing visibly more nonuniform magnetization patterns. Our formulation provides a fast and practical tool for quantifying and incorporating finite-permeability effects in permanent-magnet stellarator designs, and offers a framework for extending permanent-magnet optimization to higher field strengths and to materials with stronger macromagnetic coupling.",
    "authors": [
      "Armin Ulrich",
      "Mason Haberle",
      "Alan A. Kaptanoglu"
    ],
    "published": "2025-12-17T01:00:40Z",
    "updated": "2025-12-17T01:00:40Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.14975v1",
    "url": "https://arxiv.org/abs/2512.14975v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14975v1.pdf",
    "title": "High voltage and electrode system for a cryogenic experiment to search for the neutron electric dipole moment",
    "abstract": "The cryogenic approach to the search for the neutron electric dipole moment--performing the experiment in superfluid liquid helium--holds promise for a substantial increase in sensitivity, potentially enabling a sensitivity level of $10^{-28}$ e-cm. A crucial component in realizing such an experiment is the high voltage and electrode system capable of providing an electric field of 75 kV/cm. This, in turn, requires an electric potential of 635 kV to be applied to the high voltage electrode, while simultaneously satisfying other experimental constraints, such as those on heat load and magnetic noise requirements. This paper describes the outcome of a comprehensive development program addressing these challenges. It outlines the system requirements, discusses new insights into relevant physical phenomena, and details selected technical solutions with their corresponding experimental demonstrations and expected performance. The results collectively demonstrate the successful development of the necessary technology for the high-voltage and electrode system for this approach.",
    "authors": [
      "M. A. Blatnik",
      "S. M. Clayton",
      "S. A. Currie",
      "B. W. Filippone",
      "M. Makela",
      "C. M. O'Shaughnessy",
      "N. S. Phan",
      "J. C. Ramsey",
      "G. V. Riley",
      "A. Roberts",
      "T. Sandborn",
      "T. J Schaub",
      "G. M. Seidel",
      "E. Smith",
      "I. L. Smythe",
      "J. Surbrook",
      "W. Wei",
      "W. Yao",
      "T. M. Ito"
    ],
    "published": "2025-12-17T00:04:30Z",
    "updated": "2025-12-17T00:04:30Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "1704.02861v9",
    "url": "https://arxiv.org/abs/1704.02861v9",
    "pdf_url": "https://arxiv.org/pdf/1704.02861v9.pdf",
    "title": "A Numerical Solution of the Time-Dependent Neutron Transport Equation Using the Characteristic Method. Applications to ICF and to Hybrid Fission-Fusion Systems",
    "abstract": "In this work we present a solution of the one-dimensional spherical symmetric time-dependent neutron transport equation (written for a moving system in lagrangian coordinates) by using the characteristic method. One of the objectives is to overcome the negative flux problem that arises when the system is very opaque and the angular neutron flux can become negative when it is extrapolated in spatial meshes -- as, for example, in diamond scheme adopted in many codes. Although there are recipes to overcome this problem, it can completely degrade the numerical solution if repeated many times.   The solution presented here can be easily coupled to radiation-hydrodynamics equations, but it is necessary an additional term to maintain neutron conservation in a moving system in lagrangian coordinates. Energy multigroup method and a former SN method to deal with the angular variable are used, with the assumption of isotropic scattering and the transport cross sections approximation. An artifice is employed for emulating the neutron upscattering when neutron energy is lower than the temperature of the medium. The consistency of the numerical solution is checked by making at each time-step the balance of neutrons in the system.   Two examples of applications are shown using a neutronic-radiation-hydrodynamic code to which the solution here presented was incorporated: one consists of a heterogeneous pellet of DT (deuterium-tritium) tamped by an highly-enriched uranium or plutonium (a symbiotic fusion-fission system); and the other is a very complex and also a symbiotic fission-fusion-fission system composed by layers of the thermonuclear fuels LiDT, LiD and a highly-supercritical fission fuel. The last is considered an extreme case for testing the time-dependent neutron transport solution presented here.",
    "authors": [
      "Dalton Ellery Girao Barroso"
    ],
    "published": "2017-04-10T14:04:22Z",
    "updated": "2025-12-16T23:48:14Z",
    "categories": [
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.comp-ph"
  },
  {
    "arxiv_id": "2512.14962v1",
    "url": "https://arxiv.org/abs/2512.14962v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14962v1.pdf",
    "title": "Adding Radio Frequency Capabilities to a millikelvin Scanning Tunneling Microscope",
    "abstract": "We present a simple home made solution enabling in-situ RF reflectometry measurements with a millikelvin scanning tunneling microscope (mk-STM). The additions described below were made using RF best practices following similar detection schemes commonly employed in the quantum information science (QIS) community. Using a Niobium STM tip to form a superconductor-insulator-normal metal (SIN) tunnel junction, the evolution of coherence peaks at the SC-gap edge are carefully measured to characterize the RF losses and electron temperature. We further identify impedance matching as a crucial factor to achieve high sensitivity in the reflectometry by tuning the tip-sample capacitance as a function of approach distance. As a demonstration of this capability, we measure a 50x50 nm$^2$ area of island features that have been condensed onto the surface of a gold single crystal. Position dependent reflectometry losses allow us to image island sizes down to a total surface area of 5 nm$^2$ given our current sensitivity.",
    "authors": [
      "Jonathan Marbey",
      "Michael Dreyer",
      "R. E. Butera"
    ],
    "published": "2025-12-16T23:03:49Z",
    "updated": "2025-12-16T23:03:49Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.14960v1",
    "url": "https://arxiv.org/abs/2512.14960v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14960v1.pdf",
    "title": "The PANDA Barrel DIRC: From design to assembly",
    "abstract": "The Barrel DIRC counter will serve as the primary particle identification detector in the PANDA experiment, enabling high-precision hadron physics studies through antiproton-proton annihilations across a momentum range of 1.5 GeV/c to 15 GeV/c. It is designed to distinguish charged pions from kaons with a separation of at least 3 standard deviations up to 3.5 GeV/c within polar angles of 22 degrees to 140 degrees. A lens focusing is used the first time in a DIRC detector. After a successful evaluation in particle beams, the key components, i.e. radiator bars and photon sensors, were purchased and tested.",
    "authors": [
      "G. Schepers",
      "A. Belias",
      "R. Dzhygadlo",
      "A. Gerhardt",
      "D. Lehmann",
      "K. Peters",
      "C. Schwarz",
      "J. Schwiening",
      "M. Traxler",
      "Y. Wolf",
      "L. Schmitt",
      "M. Böhm",
      "K. Gumbert",
      "S. Krauss",
      "A. Lehmann",
      "D. Miehling",
      "M. Schmidt",
      "C. Sfienti",
      "A. Ali"
    ],
    "published": "2025-12-16T22:56:25Z",
    "updated": "2025-12-16T22:56:25Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1016/j.nima.2025.171028"
  },
  {
    "arxiv_id": "2512.14923v1",
    "url": "https://arxiv.org/abs/2512.14923v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14923v1.pdf",
    "title": "3D Printing as a Rapid Prototyping Approach for Novel RF Cavity Designs",
    "abstract": "3D-printing of radiofrequency (RF) cavity resonators could provide a cost-effective solution that enables rapid prototyping and design flexibility compared to traditional fabrication of full-metal cavities. In this work, the feasibility of fabrication of a useful multi-mode GHz cavity is explored. Two kinds of plastics, two slicing approaches and two metal coating techniques were used to build a series of clamped cavities with thin inner copper surface on otherwise 3D printed plastic surface. The cavities were then bench-tested to identify spatial field distributions, operating frequencies and quality factors (Q-factor). Pros and cons of the used fabrication approaches were identified and understood, and the performance of longitudinally sliced painted cavity design demonstrated considerable practicality of 3D-printing approach in designing rf systems.",
    "authors": [
      "David Sims",
      "Benjamin Sims",
      "Brian Wright",
      "John W. Lewellen",
      "Sergey V. Baryshev"
    ],
    "published": "2025-12-16T21:21:03Z",
    "updated": "2025-12-16T21:21:03Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2502.18005v2",
    "url": "https://arxiv.org/abs/2502.18005v2",
    "pdf_url": "https://arxiv.org/pdf/2502.18005v2.pdf",
    "title": "WIMP Dark Matter Search using a 3.1 Tonne-Year Exposure of the XENONnT Experiment",
    "abstract": "We report on a search for weakly interacting massive particle (WIMP) dark matter (DM) via elastic DM-xenon-nucleus interactions in the XENONnT experiment. We combine datasets from the first and second science campaigns resulting in a total exposure of 3.1 tonne-years. In a blind analysis of nuclear recoil events with energies above $3.8\\,\\mathrm{keV_{NR}}$, we find no significant excess above background. We set new upper limits on the spin-independent WIMP-nucleon scattering cross section for WIMP masses above $10\\,\\mathrm{GeV}/c^2$ with a minimum of $1.7\\,\\times\\,10^{-47}\\,\\mathrm{cm^2}$ at $90\\,\\%$ confidence level for a WIMP mass of $30\\,\\mathrm{GeV}/c^2$. We achieve a best median sensitivity of $1.4\\,\\times\\,10^{-47}\\,\\mathrm{cm^2}$ for a $41\\,\\mathrm{GeV}/c^2$ WIMP. Compared to the result from the first XENONnT science dataset, we improve our sensitivity by a factor of up to 1.8.",
    "authors": [
      "E. Aprile",
      "J. Aalbers",
      "K. Abe",
      "S. Ahmed Maouloud",
      "L. Althueser",
      "B. Andrieu",
      "E. Angelino",
      "D. Antón Martin",
      "S. R. Armbruster",
      "F. Arneodo",
      "L. Baudis",
      "M. Bazyk",
      "L. Bellagamba",
      "R. Biondi",
      "A. Bismark",
      "K. Boese",
      "A. Brown",
      "G. Bruno",
      "R. Budnik",
      "C. Cai",
      "C. Capelli",
      "J. M. R. Cardoso",
      "A. P. Cimental Chávez",
      "A. P. Colijn",
      "J. Conrad",
      "J. J. Cuenca-García",
      "V. D'Andrea",
      "L. C. Daniel Garcia",
      "M. P. Decowski",
      "A. Deisting",
      "C. Di Donato",
      "P. Di Gangi",
      "S. Diglio",
      "K. Eitel",
      "S. el Morabit",
      "A. Elykov",
      "A. D. Ferella",
      "C. Ferrari",
      "H. Fischer",
      "T. Flehmke",
      "M. Flierman",
      "D. Fuchs",
      "W. Fulgione",
      "C. Fuselli",
      "P. Gaemers",
      "R. Gaior",
      "F. Gao",
      "S. Ghosh",
      "R. Giacomobono",
      "F. Girard",
      "R. Glade-Beucke",
      "L. Grandi",
      "J. Grigat",
      "H. Guan",
      "M. Guida",
      "P. Gyorgy",
      "R. Hammann",
      "A. Higuera",
      "C. Hils",
      "L. Hoetzsch",
      "N. F. Hood",
      "M. Iacovacci",
      "Y. Itow",
      "J. Jakob",
      "F. Joerg",
      "Y. Kaminaga",
      "M. Kara",
      "P. Kavrigin",
      "S. Kazama",
      "P. Kharbanda",
      "M. Kobayashi",
      "D. Koke",
      "K. Kooshkjalali",
      "A. Kopec",
      "H. Landsman",
      "R. F. Lang",
      "L. Levinson",
      "I. Li",
      "S. Li",
      "S. Liang",
      "Z. Liang",
      "Y. -T. Lin",
      "S. Lindemann",
      "M. Lindner",
      "K. Liu",
      "M. Liu",
      "J. Loizeau",
      "F. Lombardi",
      "J. Long",
      "J. A. M. Lopes",
      "G. M. Lucchetti",
      "T. Luce",
      "Y. Ma",
      "C. Macolino",
      "J. Mahlstedt",
      "A. Mancuso",
      "L. Manenti",
      "F. Marignetti",
      "T. Marrodán Undagoitia",
      "K. Martens",
      "J. Masbou",
      "S. Mastroianni",
      "A. Melchiorre",
      "J. Merz",
      "M. Messina",
      "A. Michael",
      "K. Miuchi",
      "A. Molinario",
      "S. Moriyama",
      "K. Morå",
      "Y. Mosbacher",
      "M. Murra",
      "J. Müller",
      "K. Ni",
      "U. Oberlack",
      "B. Paetsch",
      "Y. Pan",
      "Q. Pellegrini",
      "R. Peres",
      "C. Peters",
      "J. Pienaar",
      "M. Pierre",
      "G. Plante",
      "T. R. Pollmann",
      "L. Principe",
      "J. Qi",
      "J. Qin",
      "D. Ramírez García",
      "M. Rajado",
      "A. Ravindran",
      "A. Razeto",
      "R. Singh",
      "L. Sanchez",
      "J. M. F. dos Santos",
      "I. Sarnoff",
      "G. Sartorelli",
      "J. Schreiner",
      "P. Schulte",
      "H. Schulze Eißing",
      "M. Schumann",
      "L. Scotto Lavina",
      "M. Selvi",
      "F. Semeria",
      "P. Shagin",
      "S. Shi",
      "J. Shi",
      "M. Silva",
      "H. Simgen",
      "A. Stevens",
      "C. Szyszka",
      "A. Takeda",
      "Y. Takeuchi",
      "P. -L. Tan",
      "D. Thers",
      "G. Trinchero",
      "C. D. Tunnell",
      "F. Tönnies",
      "K. Valerius",
      "S. Vecchi",
      "S. Vetter",
      "F. I. Villazon Solar",
      "G. Volta",
      "C. Weinheimer",
      "M. Weiss",
      "D. Wenz",
      "C. Wittweg",
      "V. H. S. Wu",
      "Y. Xing",
      "D. Xu",
      "Z. Xu",
      "M. Yamashita",
      "J. Yang",
      "L. Yang",
      "J. Ye",
      "L. Yuan",
      "G. Zavattini",
      "Y. Zhao",
      "M. Zhong"
    ],
    "published": "2025-02-25T09:10:47Z",
    "updated": "2025-12-16T20:11:46Z",
    "categories": [
      "hep-ex",
      "astro-ph.CO",
      "astro-ph.IM",
      "hep-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1103/msw4-t342"
  },
  {
    "arxiv_id": "2512.14872v1",
    "url": "https://arxiv.org/abs/2512.14872v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14872v1.pdf",
    "title": "Bridging the Gap Between Modern UX Design and Particle Accelerator Control Room Interfaces",
    "abstract": "Accelerator control systems often represent relatively complex and safety-sensitive human-machine interfaces within process control industries. These systems are technically robust and reflect the cumulative integration of solutions built and adapted across decades. One of the regular, unfortunate casualties of provisional accelerator control system updates is their human-system interfaces (HSIs) which often lag behind modern usability and design standards. An additional challenge is that although there is a multitude of established human factors (HF), and user experience (UX) principles for everyday digital applications, there are very few (if any) established principles for complex and safety-critical applications for an accelerator. This paper argues for the importance of established HF and UX principles (herein referred to as human-centered design principles) into the development of accelerator HSIs, emphasizing the need for clarity, consistency, responsiveness, and cognitive accessibility. Drawing from HF/UX best practices and human-centered design, this paper discusses how these approaches can enhance operator performance, reduce human error, and improve accelerator personnel collaboration. Case studies from Accelerator Control Operations Research Network (ACORN) at Fermilab are explored to demonstrate how interfaces built with human-centered design principles can scale with system complexity while remaining intuitive and efficient for diverse user roles including operators, machine experts, and engineers. By bridging the gap between traditional control system design and modern human-centered design methods, this paper provides a roadmap for evolving accelerator HSIs into more usable, maintainable, and effective tools.",
    "authors": [
      "Rachael Hill",
      "Casey Kovesdi",
      "Torrey Mortenson",
      "Madelyn Polzin",
      "Zachary Spielman",
      "Katya Le Blanc"
    ],
    "published": "2025-12-16T19:35:36Z",
    "updated": "2025-12-16T19:35:36Z",
    "categories": [
      "physics.acc-ph",
      "cs.SE"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.12163v2",
    "url": "https://arxiv.org/abs/2512.12163v2",
    "pdf_url": "https://arxiv.org/pdf/2512.12163v2.pdf",
    "title": "Large Errors in Kinetic Temperature Measurements Using Particle Tracking Velocimetry",
    "abstract": "We report on random errors in kinetic temperature measurements due to finite spatial resolution in particle tracking velocimetry. Using simulated data, we isolate the error caused by finite spatial resolution from other sources of uncertainty, such as particle acceleration and particle mismatch. A sample of particle velocities is generated from a Maxwellian distribution at a prescribed kinetic temperature. Particle positions are assigned randomly and discretized to match a prescribed spatial resolution. Velocities are reconstructed using the two-frame tracking method, and the resulting kinetic temperature is calculated and compared to the true kinetic temperature. Results show that under typical experimental conditions, the uncertainty in particle positions propagates into large errors in the velocity distribution and the measured kinetic temperature. We find that this might introduce errors ranging from tens of percent at high kinetic temperatures ($\\sim 10$~eV) to thousands of percent at low temperatures ($\\sim 0.1$~eV).",
    "authors": [
      "Anton Kananovich",
      "Parth Mehrotra",
      "Surabhi Jaiswal"
    ],
    "published": "2025-12-13T04:03:18Z",
    "updated": "2025-12-16T19:20:33Z",
    "categories": [
      "physics.plasm-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.14667v1",
    "url": "https://arxiv.org/abs/2512.14667v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14667v1.pdf",
    "title": "Configurable γ Photon Spectrometer to Enable Precision Radioguided Tumor Resection",
    "abstract": "Surgical tumor resection aims to remove all cancer cells in the tumor margin and at centimeter-scale depths below the tissue surface. During surgery, microscopic clusters of disease are intraoperatively difficult to visualize and are often left behind, significantly increasing the risk of cancer recurrence. Radioguided surgery (RGS) has shown the ability to selectively tag cancer cells with gamma (γ) photon emitting radioisotopes to identify them, but require a mm-scale γ photon spectrometer to localize the position of these cells in the tissue margin (i.e., a function of incident γ photon energy) with high specificity. Here we present a 9.9 mm2 integrated circuit (IC)-based γ spectrometer implemented in 180 nm CMOS, to enable the measurement of single γ photons and their incident energy with sub-keV energy resolution. We use small 2 2 um reverse-biased diodes that have low depletion region capacitance, and therefore produce millivolt-scale voltage signals in response to the small charge generated by incident γ photons. A low-power energy spectrometry method is implemented by measuring the decay time it takes for the generated voltage signal to settle back to DC after a γ detection event, instead of measuring the voltage drop directly. This spectrometry method is implemented in three different pixel architectures that allow for configurable pixel sensitivity, energy-resolution, and energy dynamic range based on the widely heterogenous surgical and patient presentation in RGS. The spectrometer was tested with three common γ-emitting radioisotopes (64Cu, 133Ba, 177Lu), and is able to resolve activities down to 1 uCi with sub-keV energy resolution and 1.315 MeV energy dynamic range, using 5-minute acquisitions.",
    "authors": [
      "Rahul Lall",
      "Youngho Seo",
      "Ali M. Niknejad",
      "Mekhail Anwar"
    ],
    "published": "2025-12-16T18:26:47Z",
    "updated": "2025-12-16T18:26:47Z",
    "categories": [
      "eess.IV",
      "eess.SP",
      "physics.ins-det"
    ],
    "primary_category": "eess.IV",
    "doi": "10.1109/TBCAS.2025.3625580"
  },
  {
    "arxiv_id": "2512.14598v1",
    "url": "https://arxiv.org/abs/2512.14598v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14598v1.pdf",
    "title": "Hybrid Machine-Learning Particle Identification for the ePIC Proximity-Focusing RICH",
    "abstract": "We present a machine-learning-based particle-identification study for the proximity-focusing Ring Imaging Cherenkov (pfRICH) detector of the ePIC experiment at the Electron-Ion Collider. Operating in the backward region ($-3.5 \\lesssim η\\lesssim -1.5$), the pfRICH is designed to achieve at least $3σ$ separation among pions, kaons, and protons up to $7,\\mathrm{GeV}/c$ for Semi-Inclusive Deep Inelastic Scattering measurements. Using a standalone Geant4 simulation of the pfRICH, we develop a hybrid machine-learning approach that combines convolutional neural-network-based feature extraction with gradient-boosted decision-tree classifiers. This method significantly enhances Cherenkov-ring pattern recognition and improves particle-separation performance, demonstrating the effectiveness of hybrid machine-learning techniques for next-generation Cherenkov detectors at the EIC.",
    "authors": [
      "D. H. Dongwi",
      "C. -J. Naïm",
      "L. Rhode",
      "A. Deshpande"
    ],
    "published": "2025-12-16T17:07:56Z",
    "updated": "2025-12-16T17:07:56Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.14485v1",
    "url": "https://arxiv.org/abs/2512.14485v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14485v1.pdf",
    "title": "Construction techniques and commissioning of the Three-Backlink Experiment for the LISA mission",
    "abstract": "Designed to detect gravitational waves in the lower-frequency band, the space mission LISA will open a new window to astronomy after its launch in the 2030s. Each LISA spacecraft houses two optical benches that require the exchange of a phase reference between them via an optical connection, called a Backlink. Here we present the construction and commissioning of an ultra-stable quasi-monolithic optical testbed to investigate different Backlink implementations: a direct fiber, a frequency-separated fiber, and a free-beam link, compared in the Three-Backlink Experiment. Dedicated alignment techniques crucial for the construction of these optical benches are presented together with the development of a high-precision beam alignment and measurement tool - a Calibrated Quadrant Photodiode Singleton. An upper limit for the performance of all three investigated Backlink schemes, as determined by initial experiments, can be set at a $15\\text{pm}/\\sqrt{\\text{Hz}}$-equivalent level within the LISA band, spanning 0.1mHz to 1Hz. Our measurements were able to verify the successful construction and commissioning of this very complex interferometer as an interferometric laboratory testbed for LISA. We find no limitations due to the construction on the here reported performance levels. Our results can support the construction of high-precision metrology testbeds for space-based laser interferometry for future gravitational wave or geodesy missions.",
    "authors": [
      "Lea Bischof",
      "Melanie Ast",
      "Jiang Ji Ho-Zhang",
      "Nicole Knust",
      "Daniel Penkert",
      "Daniel Jestrabek",
      "Jens Reiche",
      "Thomas S. Schwarze",
      "Katharina-Sophie Isleif",
      "Oliver Gerberding",
      "Gerhard Heinzel",
      "Stefan Ast",
      "Karsten Danzmann"
    ],
    "published": "2025-12-16T15:16:22Z",
    "updated": "2025-12-16T15:16:22Z",
    "categories": [
      "physics.optics",
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2512.14484v1",
    "url": "https://arxiv.org/abs/2512.14484v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14484v1.pdf",
    "title": "Demonstrating sub-picometer non-reciprocity levels in the Three-Backlink Experiment for LISA",
    "abstract": "The current planned space-based gravitational-wave detectors require a bidirectional optical connection, referred to as Backlink, between two adjacent optical benches to provide a mutual phase reference for the local interferometric measurements. However, if the Backlink shows asymmetry between the two propagation directions, the effective optical pathlengths of the counter-propagating beams can introduce a differential phase noise, called non-reciprocity, into the main interferometric measurement that will limit the achievable accuracy in time-delay interferometry (TDI) post-processing. Hence, it is important to understand the properties of the Backlink to ensure that it will not compromise the interferometric detection. The Three-Backlink Experiment (3BL), which consists of an optical test facility with two rotatable benches, was designed under the Laser Interferometer Space Antenna (LISA) framework to study the performance of three Backlink configurations: two fiber-based and one free-beam scheme. In this paper, we report recent experimental results from the 3BL. We describe the commissioning and the subsequent noise mitigation. We achieve a setup noise floor below $1\\text{ pm}\\sqrt{\\text{Hz}}$ across most of the LISA measurement band, and provide an understanding of the current technical limitations. With this low-noise baseline, we measured the performance of the three Backlink implementations under non-rotational conditions. We show that all three Backlinks reach sub-picometer non-reciprocity levels across most of the frequency band, with the remaining part dominated by the mentioned testbed noise. This enabled us to conduct a preliminary study of the Backlink inherent noise, where we emphasized on the backscatter noise intrinsic to a straightforward fiber-based Backlink, as this is the current baseline for LISA.",
    "authors": [
      "Jiang Ji Ho-Zhang",
      "Melanie Ast",
      "Lea Bischof",
      "Michael Born",
      "Daniel Jestrabek",
      "Stefan Ast",
      "Katharina-Sophie Isleif",
      "Oliver Gerberding",
      "Thomas S. Schwarze",
      "Jens Reiche",
      "Gerhard Heinzel",
      "Karsten Danzmann"
    ],
    "published": "2025-12-16T15:16:21Z",
    "updated": "2025-12-16T15:16:21Z",
    "categories": [
      "physics.optics",
      "astro-ph.IM",
      "gr-qc",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  }
]