{
  "arxiv_id": "2501.11531v3",
  "url": "https://arxiv.org/abs/2501.11531v3",
  "pdf_url": "https://arxiv.org/pdf/2501.11531v3.pdf",
  "title": "Mechanical strength investigations of the APPLE-X undulator using Fiber   Bragg Grating strain measurements",
  "abstract": "The SPARC_LAB facility at the INFN LNF is being upgraded to accommodate a new user facility as part of the SABINA project. It was set up to investigate the feasibility of an ultra-brilliant photoinjector and to perform FEL experiments. The new beamline is equipped with three APPLE-X undulators acting as amplifiers to deliver IR/THz radiation with photon pulses in the ps range, with energy of tens of uJ, and with linear, circular, or elliptical polarization. The APPLE-X guarantees to vary the gap amplitude between the magnets arrays and their relative phase. The entire system has been designed from scratch, and a structural analysis has been carried out. Once they were in Frascati, in collaboration with ENEA, a further investigation campaign was launched on the mechanical, using strain measurements based on optical methods. FBG sensors were suitable for these tests due to their immunity to electromagnetic noise. They consist of a phase grating inscribed in the core of a single-mode fiber, whose Bragg-diffracted light propagates back along the fiber. If bonded to the mechanical structure, they can be used as strain sensors. By following the variations in the scattered spectrum, it is possible to perform strain measurements. Using multiple FBGs applied at selected locations on the undulator, several measurements were while opening and closing the gap or changing the phase, but also by studying the quiescent response as a function of the ambient temperature. The results of these tests show that there is a clear deformation of the structure related to the temperature changes and magnetic forces, but the magnitude of this deformation is well within the tolerances required for the functionality of the undulator since they are compatible or lower with respect to the one calculated with the finite elements methods. The tests confirm the reliability of the mechanical structure.",
  "authors": [
    "I. Balossino",
    "A. Polimadei",
    "M. Del Franco",
    "A. Selce",
    "A. Vannozzi",
    "E. Di Pasquale",
    "L. Giannessi",
    "F. Nguyen",
    "A. Petralia",
    "J. Pockar",
    "U. Primozic",
    "R. Geometrante",
    "M. A. Caponero",
    "L. Sabbatini"
  ],
  "published": "2025-01-20T15:13:46Z",
  "updated": "2025-08-04T08:07:01Z",
  "categories": [
    "hep-ex",
    "physics.ins-det"
  ],
  "primary_category": "hep-ex"
}