[
  {
    "arxiv_id": "2508.00720v2",
    "url": "https://arxiv.org/abs/2508.00720v2",
    "pdf_url": "https://arxiv.org/pdf/2508.00720v2.pdf",
    "title": "Continuum damping of topologically-protected edge modes at the boundary   of non-uniformly magnetized cylindrical plasmas",
    "abstract": "We present an extension of recently discovered collisionlessly damped yet topologically protected surface plasma waves (TSPWs), from a simplified slab geometry to a cylindrical plasma-vacuum interface. A distinctive feature of these modes-emerging above the electron cyclotron frequency-is their collisionless damping, which arises from resonant coupling to a continuum of upper-hybrid modes localized within a smooth plasma-vacuum transition layer. We demonstrate both temporal and spatial damping of TSPWs at the boundary of a cylindrical magnetized plasma. Furthermore, we show that in the presence of a non-uniform magnetic field, the TSPW exhibits a smooth and continuous transition, highlighting its topological robustness under magnetic inhomogeneity.",
    "authors": [
      "Roopendra Singh Rajawat",
      "Gennady Shvets"
    ],
    "published": "2025-08-01T15:40:33Z",
    "updated": "2025-08-05T15:59:41Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.02626v1",
    "url": "https://arxiv.org/abs/2508.02626v1",
    "pdf_url": "https://arxiv.org/pdf/2508.02626v1.pdf",
    "title": "Boosting the Efficiency of the Differential Algebra-based Fast Multipole   Method Using Symbolic Differential Algebra",
    "abstract": "The Fast Multipole Method (FMM) computes pairwise interactions between particles with an efficiency that scales linearly with the number of particles. The method works by grouping particles based on their spatial distribution and approximating interactions with distant regions through series expansions. Differential Algebra (DA), also known as Truncated Power Series Algebra (TPSA), computes the Taylor expansion of a function at a given point and allows users to manipulate Taylor expansions as easily as numerical values in computation. This makes it a convenient and powerful tool for constructing expansions in FMM. However, DA-based FMM operators typically suffer from lower efficiency compared to implementations based on other mathematical frameworks, such as Cartesian tensors or spherical harmonics. To address this, we developed a C++ library for symbolic DA computation, enabling the derivation of explicit expressions for DA-based FMM operators. These symbolic expressions are then used to generate highly optimized code that eliminates the redundant computations inherent in numerical DA packages. For individual FMM operators, this approach achieves a speedup of 20- to 50-fold. We further evaluate the numerical performance of the enhanced DA-FMM and benchmark it against two state-of-the-art FMM implementations, pyfmmlib and the traceless Cartesian tensor-based FMM, for the Coulomb potential. For relative errors on the order of $10^{-7}$ or higher, the enhanced DA-FMM consistently outperforms both alternatives.",
    "authors": [
      "He Zhang"
    ],
    "published": "2025-08-04T17:15:57Z",
    "updated": "2025-08-04T17:15:57Z",
    "categories": [
      "physics.comp-ph",
      "math-ph",
      "math.MP",
      "physics.acc-ph"
    ],
    "primary_category": "physics.comp-ph"
  },
  {
    "arxiv_id": "2508.00705v2",
    "url": "https://arxiv.org/abs/2508.00705v2",
    "pdf_url": "https://arxiv.org/pdf/2508.00705v2.pdf",
    "title": "An Online Data Analysis Framework for Accelerator-Based Physics   Experiments",
    "abstract": "A robust and flexible architecture capable of providing real-time analysis on diagnostic data is of crucial importance to physics experiments. In this paper, we present such an online framework, used in June 2025 as part of the HRMT-68 experiment, performed at the HiRadMat facility at CERN, using the Super Proton Synchrotron (SPS) beam line. HRMT-68 was a fixed-target laboratory astrophysics experiment aiming to identify plasma instabilities generated by a relativistic electron-positron beam during traversal of an argon plasma. This framework was essential for experimental data acquisition and analysis, and can be adapted for a broad range of experiments with a variety of experimental diagnostics. The framework's modular and customizable design enabled us to rapidly observe and extract emergent features from a diverse range of diagnostic data. Simultaneously, it allowed for both the introduction of new diagnostic devices and the modification of our analysis as features of interest were identified. As a result, we were able to effectively diagnose equipment malfunction, and infer the beam's response to varying bunch duration, beam intensity, and the plasma state without resorting to offline analysis, at which time adjustment or improvement would have been impossible. We present the features of this agile framework, whose codebase we have made publicly available, which can be adapted for future experiments with minimal modification.",
    "authors": [
      "Hayden Ramm",
      "Pascal Simon",
      "Paraskevi Alexaki",
      "Christopher Arran",
      "Robert Bingham",
      "Alice Goillot",
      "Jon Tomas Gudmundsson",
      "Jonathan Halliday",
      "Bryn Lloyd",
      "Eva Los",
      "Vasiliki Stergiou",
      "Sifei Zhang",
      "Gianluca Gregori",
      "Nikolaos Charitonidis"
    ],
    "published": "2025-08-01T15:20:24Z",
    "updated": "2025-08-04T15:52:12Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.02519v1",
    "url": "https://arxiv.org/abs/2508.02519v1",
    "pdf_url": "https://arxiv.org/pdf/2508.02519v1.pdf",
    "title": "Influence of finite ion Larmor radius on the dynamics of   weakly-collisional plasma jets colliding in magnetic arch",
    "abstract": "The effect of the finite ion Larmor radius on the dynamics of two counterstreaming weakly collisional plasma flows in a magnetic field of an arch configuration is considered. Hybrid numerical simulations show that in a system whose dimensions are close to the ion Larmor radius, more intense interaction dynamics are observed, the magnetic arch experiences a significant expansion with the formation of a region with an irregular character of magnetic lines, in which magnetic reconnection processes occur. In this case, the generation of a surface wave of the ion-cyclotron range is observed at the boundaries of the arch. An increase in the scale of the system compared to the ion Larmor radius leads to a transition to the ideal MHD regime, in which the evolution of the arch occurs much more slowly, and the development of instabilities is not observed.",
    "authors": [
      "Artem V. Korzhimanov",
      "Roman S. Zemskov",
      "Sergey A. Koryagin",
      "Mikhail E. Viktorov"
    ],
    "published": "2025-08-04T15:29:30Z",
    "updated": "2025-08-04T15:29:30Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.02445v1",
    "url": "https://arxiv.org/abs/2508.02445v1",
    "pdf_url": "https://arxiv.org/pdf/2508.02445v1.pdf",
    "title": "Gyrotropy-Induced Symmetry Breaking of Erosion Hot Spots on Antenna   Limiters during High-Power Tokamak RF Operation: Mechanisms and Mitigation   Strategies",
    "abstract": "Ion Cyclotron Range of Frequencies heating (ICRH) and current drive will be essential for sustaining high-performance plasmas in next-generation fusion devices (e.g. ITER, SPARC). ICRH actuators routinely produce localized hot spots on limiters and nearby components, posing serious risks to antenna reliability, material survivability, and overall plasma performance. Remarkably, these hot spots are often strongly asymmetric, even with nominally symmetric plasma conditions and antenna geometries. We show that such asymmetries exist intrinsically in the wave physics rather than solely being due to misalignment or edge plasma variation. Our results strongly suggest that this asymmetry can be compensated for by using either poloidal phasing control (which e.g. the under construction WEST traveling wave antenna can do) or modified limiter shapes, suppressing peak sputtering by a factor $\\sim$3 and reducing total erosion by a factor of $\\sim$2 compared to state-of-the-art designs. This capability is essential for sustaining high-power, long-duration ICRH operation in reactor-scale devices and other next-generation fusion systems. By distributing heat and particle fluxes more evenly across antenna surfaces, optimized limiter shaping provides a clear pathway to robust, reliable ICRH performance in existing and planned fusion devices.",
    "authors": [
      "W. Tierens",
      "A. Kumar",
      "J. Lore",
      "G. Urbanczyk",
      "R. Diab",
      "The WEST Team"
    ],
    "published": "2025-08-04T14:05:01Z",
    "updated": "2025-08-04T14:05:01Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.02402v1",
    "url": "https://arxiv.org/abs/2508.02402v1",
    "pdf_url": "https://arxiv.org/pdf/2508.02402v1.pdf",
    "title": "Low-Energy Calibration of SuperCDMS HVeV Cryogenic Silicon Calorimeters   Using Compton Steps",
    "abstract": "Cryogenic calorimeters for low-mass dark matter searches have achieved sub-eV energy resolutions, driving advances in both low-energy calibration techniques and our understanding of detector physics. The energy deposition spectrum of gamma rays scattering off target materials exhibits step-like features, known as Compton steps, near the binding energies of atomic electrons. We demonstrate a successful use of Compton steps for sub-keV calibration of cryogenic silicon calorimeters, utilizing four SuperCDMS High-Voltage eV-resolution (HVeV) detectors operated with 0 V bias across the crystal. This new calibration at 0 V is compared with the established high-voltage calibration using optical photons. The comparison indicates that the detector response at 0 V is about 30% weaker than expected, highlighting challenges in detector response modeling for low-mass dark matter searches.",
    "authors": [
      "SuperCDMS Collaboration",
      "M. F. Albakry",
      "I. Alkhatib",
      "D. Alonso-Gonźalez",
      "D. W. P. Amaral",
      "J. Anczarski",
      "T. Aralis",
      "T. Aramaki",
      "I. Ataee Langroudy",
      "C. Bathurst",
      "R. Bhattacharyya",
      "A. J. Biffl",
      "P. L. Brink",
      "M. Buchanan",
      "R. Bunker",
      "B. Cabrera",
      "R. Calkins",
      "R. A. Cameron",
      "C. Cartaro",
      "D. G. Cerdeño",
      "Y. -Y. Chang",
      "M. Chaudhuri",
      "J. -H. Chen",
      "R. Chen",
      "N. Chott",
      "J. Cooley",
      "H. Coombes",
      "P. Cushman",
      "R. Cyna",
      "S. Das",
      "S. Dharani",
      "M. L. di Vacri",
      "M. D. Diamond",
      "M. Elwan",
      "S. Fallows",
      "E. Fascione",
      "E. Figueroa-Feliciano",
      "S. L. Franzen",
      "A. Gevorgian",
      "M. Ghaith",
      "G. Godden",
      "J. Golatkar",
      "S. R. Golwala",
      "R. Gualtieri",
      "J. Hall",
      "S. A. S. Harms",
      "C. Hays",
      "B. A. Hines",
      "Z. Hong",
      "L. Hsu",
      "M. E. Huber",
      "V. Iyer",
      "V. K. S. Kashyap",
      "S. T. D. Keller",
      "M. H. Kelsey",
      "K. T. Kennard",
      "Z. Kromer",
      "A. Kubik",
      "N. A. Kurinsky",
      "M. Lee",
      "J. Leyva",
      "B. Lichtenberg",
      "J. Liu",
      "Y. Liu",
      "E. Lopez Asamar",
      "P. Lukens",
      "R. López Noé",
      "D. B. MacFarlane",
      "R. Mahapatra",
      "J. S. Mammo",
      "N. Mast",
      "A. J. Mayer",
      "P. C. McNamara",
      "H. Meyer zu Theenhausen",
      "É. Michaud",
      "E. Michielin",
      "K. Mickelson",
      "N. Mirabolfathi",
      "M. Mirzakhani",
      "B. Mohanty",
      "D. Mondal",
      "D. Monteiro",
      "J. Nelson",
      "H. Neog",
      "V. Novati",
      "J. L. Orrell",
      "M. D. Osborne",
      "S. M. Oser",
      "L. Pandey",
      "S. Pandey",
      "R. Partridge",
      "P. K. Patel",
      "D. S. Pedreros",
      "W. Peng",
      "W. L. Perry",
      "R. Podviianiuk",
      "M. Potts",
      "S. S. Poudel",
      "A. Pradeep",
      "M. Pyle",
      "W. Rau",
      "E. Reid",
      "R. Ren",
      "T. Reynolds",
      "M. Rios",
      "A. Roberts",
      "A. E. Robinson",
      "L. Rosado Del Rio",
      "J. L. Ryan",
      "T. Saab",
      "D. Sadek",
      "B. Sadoulet",
      "S. P. Sahoo",
      "I. Saikia",
      "S. Salehi",
      "J. Sander",
      "B. Sandoval",
      "A. Sattari",
      "B. Schmidt",
      "R. W. Schnee",
      "B. Serfass",
      "A. E. Sharbaugh",
      "R. S. Shenoy",
      "A. Simchony",
      "P. Sinervo",
      "Z. J. Smith",
      "R. Soni",
      "K. Stifter",
      "J. Street",
      "M. Stukel",
      "H. Sun",
      "E. Tanner",
      "N. Tenpas",
      "D. Toback",
      "A. N. Villano",
      "J. Viol",
      "B. von Krosigk",
      "Y. Wang",
      "O. Wen",
      "Z. Williams",
      "M. J. Wilson",
      "J. Winchell",
      "S. Yellin",
      "B. A. Young",
      "B. Zatschler",
      "S. Zatschler",
      "A. Zaytsev",
      "E. Zhang",
      "L. Zheng",
      "A. Zuniga",
      "M. J. Zurowski"
    ],
    "published": "2025-08-04T13:26:43Z",
    "updated": "2025-08-04T13:26:43Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.02389v1",
    "url": "https://arxiv.org/abs/2508.02389v1",
    "pdf_url": "https://arxiv.org/pdf/2508.02389v1.pdf",
    "title": "Imposing quasineutrality on electrostatic plasmas via the Dirac theory   of constraints",
    "abstract": "We present a method for imposing quasineutrality and, more generally, charge density conservation in the Vlasov-Poisson (VP) and Vlasov-Amp\\`ere (VA) systems, which describe electrostatic plasma dynamics, by applying the Dirac theory of constraints. Leveraging the Hamiltonian field formulations of the VP and VA models, we construct generalized Dirac brackets using the Dirac algorithm. The resulting constrained systems enforce charge density conservation, and consequently quasineutrality, through new advection terms in the Vlasov equations involving generalized-force terms, while the electric field is eliminated from the constrained Vlasov dynamics. To verify charge density conservation we conduct one-dimensional numerical experiments using a semi-Lagrangian method, demonstrating that the enforcement of the quasineutrality constraint significantly modifies the dynamics. This approach enables us to identify the forces required to enforce quasineutrality, offering a systematic way to assess the validity of the quasineutral approximation across different kinetic scales.",
    "authors": [
      "D. A. Kaltsas",
      "J. W. Burby",
      "P. J. Morrison",
      "E. Tassi",
      "G. N. Throumoulopoulos"
    ],
    "published": "2025-08-04T13:13:24Z",
    "updated": "2025-08-04T13:13:24Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2505.14754v2",
    "url": "https://arxiv.org/abs/2505.14754v2",
    "pdf_url": "https://arxiv.org/pdf/2505.14754v2.pdf",
    "title": "Model-Independent Machine Learning Approach for Nanometric Axial   Localization and Tracking",
    "abstract": "Accurately tracking particles and determining their coordinate along the optical axis is a major challenge in optical microscopy, especially when extremely high precision is needed. In this study, we introduce a deep learning approach using convolutional neural networks (CNNs) that can determine axial coordinates from dual-focal-plane images without relying on predefined models. Our method achieves an axial localization precision of 40 nanometers-six times better than traditional single-focal-plane techniques. The model's simple design and strong performance make it suitable for a wide range of uses, including dark matter detection, proton therapy for cancer, and radiation protection in space. It also shows promise in fields like biological imaging, materials science, and environmental monitoring. This work highlights how machine learning can turn complex image data into reliable, precise information, offering a flexible and powerful tool for many scientific applications.",
    "authors": [
      "Andrey Alexandrov",
      "Giovanni Acampora",
      "Giovanni De Lellis",
      "Antonia Di Crescenzo",
      "Chiara Errico",
      "Daria Morozova",
      "Valeri Tioukov",
      "Autilia Vittiello"
    ],
    "published": "2025-05-20T14:55:26Z",
    "updated": "2025-08-04T11:42:09Z",
    "categories": [
      "eess.IV",
      "astro-ph.IM",
      "cs.CV",
      "cs.LG",
      "physics.ins-det"
    ],
    "primary_category": "eess.IV"
  },
  {
    "arxiv_id": "2505.05337v2",
    "url": "https://arxiv.org/abs/2505.05337v2",
    "pdf_url": "https://arxiv.org/pdf/2505.05337v2.pdf",
    "title": "Laguerre-Gaussian pulses for spin-polarized ion beam acceleration",
    "abstract": "Polarized particle sources have a plethora of applications, ranging from deep-inelastic scattering to nuclear fusion. One crucial challenge in laser-plasma interaction is maintaining the initial polarization of the target. Here, we propose the acceleration of spin-polarized Helium-3 from near-critical density targets using high-intensity Laguerre-Gaussian laser pulses. Three-dimensional particle-in-cell simulations show that Magnetic Vortex Acceleration with these modes yields higher polarization on the 90%-level compared to conventional Gaussian laser pulses, while also providing low-divergence beams.",
    "authors": [
      "Lars Reichwein",
      "Tong-Pu Yu",
      "Alexander Pukhov",
      "Markus Büscher"
    ],
    "published": "2025-05-08T15:28:09Z",
    "updated": "2025-08-04T10:22:08Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.02251v1",
    "url": "https://arxiv.org/abs/2508.02251v1",
    "pdf_url": "https://arxiv.org/pdf/2508.02251v1.pdf",
    "title": "Orientational Effects in the Low Pair Continuum of Aluminium",
    "abstract": "We compare the predictions of the dynamic structure factor (DSF) of ambient polycrystalline aluminium from time-dependent density functional theory (TDDFT) in the pair continuum regime to recent ultrahigh resolution x-ray Thomson scattering measurements, collected at the European XFEL. TDDFT predicts strong anisotropy in the DSF at the wavenumber examined here, even with $q$-blurring accounted for. The experimental spectrum has more than sufficient resolution and signal-to-noise levels to resolve these orientation dependencies, and therefore the orientational averaging of the polycrystalline sample is observed rigorously. Once the orientation averaging is accounted for, TDDFT is able to reproduce the experimental spectrum adequately. Finally, comparisons of predicted DSFs from jellium to experiment demonstrates the importance of accounting for lattice effects in modelling the spectrum from a polycrystal.",
    "authors": [
      "Thomas Gawne",
      "Zhandos A Moldabekov",
      "Oliver S Humphries",
      "Motoaki Nakatsutsumi",
      "Sebastian Schwalbe",
      "Jan Vorberger",
      "Ulf Zastrau",
      "Tobias Dornheim",
      "Thomas R Preston"
    ],
    "published": "2025-08-04T09:53:56Z",
    "updated": "2025-08-04T09:53:56Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2501.11531v3",
    "url": "https://arxiv.org/abs/2501.11531v3",
    "pdf_url": "https://arxiv.org/pdf/2501.11531v3.pdf",
    "title": "Mechanical strength investigations of the APPLE-X undulator using Fiber   Bragg Grating strain measurements",
    "abstract": "The SPARC_LAB facility at the INFN LNF is being upgraded to accommodate a new user facility as part of the SABINA project. It was set up to investigate the feasibility of an ultra-brilliant photoinjector and to perform FEL experiments. The new beamline is equipped with three APPLE-X undulators acting as amplifiers to deliver IR/THz radiation with photon pulses in the ps range, with energy of tens of uJ, and with linear, circular, or elliptical polarization. The APPLE-X guarantees to vary the gap amplitude between the magnets arrays and their relative phase. The entire system has been designed from scratch, and a structural analysis has been carried out. Once they were in Frascati, in collaboration with ENEA, a further investigation campaign was launched on the mechanical, using strain measurements based on optical methods. FBG sensors were suitable for these tests due to their immunity to electromagnetic noise. They consist of a phase grating inscribed in the core of a single-mode fiber, whose Bragg-diffracted light propagates back along the fiber. If bonded to the mechanical structure, they can be used as strain sensors. By following the variations in the scattered spectrum, it is possible to perform strain measurements. Using multiple FBGs applied at selected locations on the undulator, several measurements were while opening and closing the gap or changing the phase, but also by studying the quiescent response as a function of the ambient temperature. The results of these tests show that there is a clear deformation of the structure related to the temperature changes and magnetic forces, but the magnitude of this deformation is well within the tolerances required for the functionality of the undulator since they are compatible or lower with respect to the one calculated with the finite elements methods. The tests confirm the reliability of the mechanical structure.",
    "authors": [
      "I. Balossino",
      "A. Polimadei",
      "M. Del Franco",
      "A. Selce",
      "A. Vannozzi",
      "E. Di Pasquale",
      "L. Giannessi",
      "F. Nguyen",
      "A. Petralia",
      "J. Pockar",
      "U. Primozic",
      "R. Geometrante",
      "M. A. Caponero",
      "L. Sabbatini"
    ],
    "published": "2025-01-20T15:13:46Z",
    "updated": "2025-08-04T08:07:01Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2412.09398v3",
    "url": "https://arxiv.org/abs/2412.09398v3",
    "pdf_url": "https://arxiv.org/pdf/2412.09398v3.pdf",
    "title": "Anomalous pinch in electron-electron beam collision",
    "abstract": "We show that an anomalous pinch can occur in ultrarelativistic electron-electron or positron-positron beam interaction, caused by the combined interplay of collective beam motion (disruption) and strong-field quantum electrodynamics (SF-QED). The locally created electron-positron pairs, from SF-QED effects, screen the self-fields of the beams and can invert the polarity of the Lorentz force resulting in a pinch of the beams. A theoretical model predicts the pinch condition and is confirmed by first-principles 3-dimensional particle-in-cell simulations. This anomalous pinch enhances density compression, increases the collision luminosity, and amplifies the local magnetic fields and the quantum parameter of the beam particles by several orders of magnitude.",
    "authors": [
      "W. Zhang",
      "T. Grismayer",
      "L. O. Silva"
    ],
    "published": "2024-12-12T16:03:40Z",
    "updated": "2025-08-04T07:52:19Z",
    "categories": [
      "physics.plasm-ph",
      "hep-ex",
      "physics.acc-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.13461v3",
    "url": "https://arxiv.org/abs/2507.13461v3",
    "pdf_url": "https://arxiv.org/pdf/2507.13461v3.pdf",
    "title": "Scalable Chrysopoeia via $(n, 2n)$ Reactions Driven by Deuterium-Tritium   Fusion Neutrons",
    "abstract": "A scalable approach for chrysopoeia - the transmutation of base metals into gold - has been pursued for millennia. While there have been small-scale demonstrations in particle accelerators and proposals involving thermal neutron capture, no economically attractive approach has yet been identified. We show a new scalable method to synthesize stable gold $\\left( \\mathrm{^{197}Au} \\right)$ from the abundant mercury isotope $\\mathrm{^{198}Hg}$ using $(n, 2n)$ reactions in a specialized neutron multiplier layer of a fusion blanket. Reactions are driven by fast $14\\, \\mathrm{MeV}$ neutrons provided by a deuterium-tritium fusion plasma, which are uniquely capable of enabling the desired reaction pathway at scale. Crucially, the scheme identified here does not negatively impact electricity production, and is also compatible with the challenging tritium breeding requirements of fusion power plant design because $(n, 2n)$ reactions of $\\mathrm{^{198}Hg}$ drive both transmutation and neutron multiplication. Using neutronics simulations, we demonstrate a tokamak with a blanket configuration that can produce $\\mathrm{^{197}Au}$ at a rate of about 2t/$\\mathrm{GW_{th}}$/yr. Implementation of this concept allows fusion power plants to double the revenue generated by the system, dramatically enhancing the economic viability of fusion energy.",
    "authors": [
      "Adam Rutkowski",
      "Jake Harter",
      "Jason Parisi"
    ],
    "published": "2025-07-17T18:13:11Z",
    "updated": "2025-08-03T15:17:02Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.01665v1",
    "url": "https://arxiv.org/abs/2508.01665v1",
    "pdf_url": "https://arxiv.org/pdf/2508.01665v1.pdf",
    "title": "Plasma Dynamics in Higher-Derivative Electrodynamics: A Renormalised   Two-Loop Framework",
    "abstract": "We present a finite-temperature study of Bopp-Podolsky electrodynamics, following electron-proton plasmas through one- and two-loop order with dimensional regularisation and hard-thermal-loop resummation. The higher-derivative operator is found to generate no new ultraviolet divergences; all counter-terms reduce to the single photon wave-function factor of ordinary QED. The static inter-particle force acquires a double-Yukawa profile, the familiar Debye term plus an opposite-signed contribution from the heavy Podolsky pole that removes the Coulomb singularity at sub-femtometre distances, providing an intrinsic ultraviolet completion of electrostatics. Gauge symmetry drives the transverse photon self-energy to zero at vanishing momentum, so no magnetic screening mass appears at any perturbative order. In a covariantly constant background the full two-loop sunset diagram yields a single, dimension-eight operator suppressed by T^2/M^2, implying permille-level shifts in thermodynamic quantities for realistic plasmas. The exact Debye mass and a leading-log calculation show the dc electrical conductivity exceeds its QED value by less than 10^-4. Conditions for observable Podolsky plasmons and cosmological constraints are identified, supplying precise benchmarks for future strong-field, collider and lattice investigations.",
    "authors": [
      "Prabhat Singh",
      "Punit Kumar"
    ],
    "published": "2025-08-03T08:49:35Z",
    "updated": "2025-08-03T08:49:35Z",
    "categories": [
      "hep-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2508.01366v1",
    "url": "https://arxiv.org/abs/2508.01366v1",
    "pdf_url": "https://arxiv.org/pdf/2508.01366v1.pdf",
    "title": "Eliminating beam-induced depolarizing effects in the hydrogen jet target   for high-precision proton beam polarimetry at the Electron-Ion Collider",
    "abstract": "We analyze beam-induced depolarizing effects in the hydrogen jet target (HJET) at the Relativistic Heavy Ion Collider (RHIC) that has been used for absolute hadron beam polarimetry and shall be employed at the Electron-Ion Collider (EIC). The EIC's higher bunch repetition frequencies and shorter bunch durations shift beam harmonics to frequencies that can resonantly drive hyperfine transitions in hydrogen, threatening to depolarize the target atoms. Using frequency-domain analysis of beam harmonics and hyperfine transition frequencies, we establish a photon emission threshold above which beam-induced fields are too weak to cause significant depolarization. For EIC injection (\\SI{23.5}{\\GeV}) and flattop (\\SI{275}{\\GeV}), beam-induced depolarization through the bunch structure renders operation at the current RHIC magnetic guide field at the target of $B_0 = \\SI{120}{\\milli\\tesla}$ untenable. Increasing the magnetic guide field at the target to $B_0 \\approx \\SI{400}{\\milli\\tesla}$ moves all hyperfine transition frequencies to at least three times the cutoff frequency, ensuring reliable absolute beam polarimetry with the required 1\\% precision at the EIC.",
    "authors": [
      "F. Rathmann",
      "A. Nass",
      "K. O. Eyser",
      "V. Shmakova",
      "E. C. Aschenauer",
      "G. Atoian",
      "A. Cannavo",
      "K. Hock",
      "H. Huang",
      "H. Lovelace",
      "G. Mahler",
      "J. Ritter",
      "G. Robert-Demolaize",
      "V. Schoefer",
      "P. Shanmuganathan",
      "E. Shulga",
      "H. Soltner",
      "X. Chu",
      "Z. Zhang"
    ],
    "published": "2025-08-02T13:38:21Z",
    "updated": "2025-08-02T13:38:21Z",
    "categories": [
      "physics.acc-ph",
      "nucl-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.01063v1",
    "url": "https://arxiv.org/abs/2508.01063v1",
    "pdf_url": "https://arxiv.org/pdf/2508.01063v1.pdf",
    "title": "Counting topological interface modes using simplicial characteristic   classes",
    "abstract": "A computational approach for predicting the number of topological interface modes (TIMs) in hermitian systems using the spectral flow - monopole (SFM) correspondence is presented. The number of TIMs is determined by calculating the Chern number of a complex line bundle of local polarisation vectors over a phase space sphere surrounding a Weyl point. The Chern number is computed by constructing the simplicial first Chern class of a discrete vector bundle on a simplicial mesh. This approach is gauge invariant, derivative free, structure preserving, and robust to noise. The algorithm is shown to reproduce the expected number of TIMs for the case of equatorial fluid waves and the topological Langmuir cyclotron wave. The possibility of using this algorithm to analyse experimental measurements of bulk wave polarisations and predict the associated number of TIMs is explored in a synthetic example.",
    "authors": [
      "N. Bohlsen",
      "I. Y. Dodin",
      "H. Qin"
    ],
    "published": "2025-08-01T20:39:12Z",
    "updated": "2025-08-01T20:39:12Z",
    "categories": [
      "physics.comp-ph",
      "math.AT",
      "physics.plasm-ph",
      "57Z05 (Primary) 70S99 (Secondary)"
    ],
    "primary_category": "physics.comp-ph"
  },
  {
    "arxiv_id": "2502.12327v2",
    "url": "https://arxiv.org/abs/2502.12327v2",
    "pdf_url": "https://arxiv.org/pdf/2502.12327v2.pdf",
    "title": "Learning Plasma Dynamics and Robust Rampdown Trajectories with   Predict-First Experiments at TCV",
    "abstract": "The rampdown phase of a tokamak pulse is difficult to simulate and often exacerbates multiple plasma instabilities. To reduce the risk of disrupting operations, we leverage advances in Scientific Machine Learning (SciML) to combine physics with data-driven models, developing a neural state-space model (NSSM) that predicts plasma dynamics during Tokamak \\`a Configuration Variable (TCV) rampdowns. The NSSM efficiently learns dynamics from a modest dataset of 311 pulses with only five pulses in a reactor-relevant high-performance regime. The NSSM is parallelized across uncertainties, and reinforcement learning (RL) is applied to design trajectories that avoid instability limits. High-performance experiments at TCV show statistically significant improvements in relevant metrics. A predict-first experiment, increasing plasma current by 20% from baseline, demonstrates the NSSM's ability to make small extrapolations. The developed approach paves the way for designing tokamak controls with robustness to considerable uncertainty and demonstrates the relevance of SciML for fusion experiments.",
    "authors": [
      "Allen M. Wang",
      "Alessandro Pau",
      "Cristina Rea",
      "Oswin So",
      "Charles Dawson",
      "Olivier Sauter",
      "Mark D. Boyer",
      "Anna Vu",
      "Cristian Galperti",
      "Chuchu Fan",
      "Antoine Merle",
      "Yoeri Poels",
      "Cristina Venturini",
      "Stefano Marchioni",
      "the TCV Team"
    ],
    "published": "2025-02-17T21:19:15Z",
    "updated": "2025-08-01T18:12:00Z",
    "categories": [
      "physics.plasm-ph",
      "cs.AI",
      "cs.LG",
      "cs.SY",
      "eess.SY"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2502.01300v3",
    "url": "https://arxiv.org/abs/2502.01300v3",
    "pdf_url": "https://arxiv.org/pdf/2502.01300v3.pdf",
    "title": "Magnetic Field Amplification and Reconstruction in Rotating   Astrophysical Plasmas: Verifying the Roles of $α$ and $β$ in Dynamo   Action",
    "abstract": "We investigated the $\\alpha$ and $\\beta$ effects in a rotating spherical plasma system relevant to astrophysical environments. These coefficients were derived using three different approaches based on the large-scale magnetic field $\\overline{\\mathbf{B}}$, turbulent velocity $\\mathbf{u}$, and turbulent magnetic field $\\mathbf{b}$, yielding $\\alpha_{\\mathrm{EM-HM}}$, $\\beta_{\\mathrm{EM-HM}}$, $\\beta_{\\mathrm{vv-vw}}$, and $\\beta_{\\mathrm{bb+jb}}$. Using raw data from direct numerical simulations (DNS), we constructed the magnetic induction equation incorporating the $\\alpha$ and $\\beta$ coefficients. We then reproduced the $\\overline{\\mathbf{B}}$ field and compared the results with the DNS data. In the kinematic regime, where $\\overline{\\mathbf{B}}$ is weak, all models exhibit good agreement with the DNS results. However, in the nonlinear regime, the $\\overline{\\mathbf{B}}$ field, reproduced using $\\beta_{\\mathrm{vv-vw}}$, deviates from the DNS and exhibits unbounded growth. To address this discrepancy, we added $\\beta_{\\mathrm{bb+jb}}$, which represents the contribution of turbulent magnetic fields, to $\\beta_{\\mathrm{vv-vw}}$. This addition suppresses the divergent growth of $\\overline{\\mathbf{B}}$ in the nonlinear regime. We then assessed the actual influence of $\\alpha$ and $\\beta$ on the evolution of $\\overline{\\mathbf{B}}$ by applying weighted combinations of the two coefficients. Our results show that magnetic $\\beta$ diffusion plays a dominant role throughout the entire process. In contrast, the $\\alpha$ effect is minor in the kinematic regime but becomes essential for sustaining the $\\overline{\\mathbf{B}}$ field in the nonlinear regime. We also discussed the underlying physical mechanism responsible for this behavior.",
    "authors": [
      "Kiwan Park"
    ],
    "published": "2025-02-03T12:20:48Z",
    "updated": "2025-08-01T15:41:55Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.16676v5",
    "url": "https://arxiv.org/abs/2506.16676v5",
    "pdf_url": "https://arxiv.org/pdf/2506.16676v5.pdf",
    "title": "Fast solvers for Tokamak fluid models with PETSC",
    "abstract": "This work begins the development of fast, scalable solvers for scientific and engineering-relevant magnetohydrodynamics (MHD) models of tokamaks using multigrid methods. These models are characterized by a distinguished direction following the magnetic field around the torus, which dominates the plasma dynamics. All tokamak models exploit this structure, for example, NIMROD uses 2D, unstructured, high-order finite elements in the poloidal plane with Fourier modes in the toroidal coordinate, and the 3D, extended MHD code M3D-C1 uses 2D, unstructured C1 elements in the poloidal plane with cubic Hermite functions in the toroidal direction and a regular grid that is partially aligned with the magnetic field. This structure suggests addressing the toroidal coordinate first, which NIMROD does at the formulation level, but M3D-C1 uses a full 3D discretization. The resulting algebraic system is solved at each time step in an implicit time integrator. This work addressed the toroidal coordinate in the M3D-C1 velocity solve by adding semi-coarsening multigrid to the existing PETSC - Portable, Extensible Toolkit for Scientific Computation - block Jacobi solver, with the addition of little new code. Competitive performance of this new solver configuration is demonstrated on a self-consistent runaway electron model of a SPARC4 disruption, and the next steps in the development of this solver are outlined.",
    "authors": [
      "Mark F. Adams",
      "Jin Chen",
      "Benjamin Sturdevant"
    ],
    "published": "2025-06-20T01:36:08Z",
    "updated": "2025-08-01T13:20:07Z",
    "categories": [
      "physics.plasm-ph",
      "cs.PF"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2410.04125v2",
    "url": "https://arxiv.org/abs/2410.04125v2",
    "pdf_url": "https://arxiv.org/pdf/2410.04125v2.pdf",
    "title": "Transverse beam instabilities in low-emittance booster synchrotrons",
    "abstract": "As the ring-based light source community is moving towards fourth-generation light sources, many facilities plan to upgrade their boosters in parallel to meet the more demanding beam properties for the storage ring, especially in terms of a much lower emittance. Concerns over collective effects have, therefore, risen, particularly in the transverse planes, since the vacuum chamber dimensions tend to be reduced as a way to achieve a stronger focusing force on the beam. In this article, we present numerical studies on transverse beam instabilities, both in the single- and multibunch regimes, in the SOLEIL II booster as an example of a low-emittance booster. We show that Landau damping is an efficient mechanism for suppressing both transverse single-bunch and coupled-bunch instabilities. We also prove that the damping in the longitudinal plane can diffuse to the transverse plane and limit the transverse emittance growth. Moreover, we have discovered that the beam can exhibit sawtooth instability at high energy and that broad-band impedance is one of the key factors in suppressing transverse coupled-bunch instability.",
    "authors": [
      "W. Foosang",
      "A. Gamelin",
      "V. Gubaidulin",
      "R. Nagaoka"
    ],
    "published": "2024-10-05T11:24:31Z",
    "updated": "2025-08-01T09:31:02Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.00455v1",
    "url": "https://arxiv.org/abs/2508.00455v1",
    "pdf_url": "https://arxiv.org/pdf/2508.00455v1.pdf",
    "title": "Tunable, phase-locked hard X-ray pulse sequences generated by a   free-electron laser",
    "abstract": "The ability to arbitrarily dial in amplitudes and phases enables the fundamental quantum state operations pioneered for microwaves and then infrared and visible wavelengths during the second half of the last century. Self-seeded X-ray free-electron lasers (FELs) routinely generate coherent, high-brightness, and ultrafast pulses for a wide range of experiments, but have so far not achieved a comparable level of amplitude and phase control. Here we report the first tunable phase-locked, ultra-fast hard X-ray (PHLUX) pulses by implementing a recently proposed method: A fresh-bunch self-seeded FEL, driven by an electron beam that was shaped with a slotted foil and a corrugated wakefield structure, generates coherent radiation that is intensity-modulated on the femtosecond time scale. We measure phase-locked (to within a shot-to-shot phase jitter corresponding to 0.1 attoseconds) pulse triplets with a photon energy of 9.7 keV, a pulse energy of several tens of microjoules, a freely tunable relative phase, and a pulse delay tunability between 4.5 and 11.9 fs. Such pulse sequences are suitable for a wide range of applications, including coherent spectroscopy, and have amplitudes sufficient to enable hard X-ray quantum optics experiments. More generally, these results represent an important step towards a hard X-ray arbitrary waveform generator.",
    "authors": [
      "Wenxiang Hu",
      "Chi Hyun Shim",
      "Gyujin Kim",
      "Seongyeol Kim",
      "Seong-Hoon Kwon",
      "Chang-Ki Min",
      "Kook-Jin Moon",
      "Donghyun Na",
      "Young Jin Suh",
      "Chang-Kyu Sung",
      "Haeryong Yang",
      "Hoon Heo",
      "Heung-Sik Kang",
      "Inhyuk Nam",
      "Eduard Prat",
      "Simon Gerber",
      "Sven Reiche",
      "Gabriel Aeppli",
      "Myunghoon Cho",
      "Philipp Dijkstal"
    ],
    "published": "2025-08-01T09:26:33Z",
    "updated": "2025-08-01T09:26:33Z",
    "categories": [
      "physics.acc-ph",
      "physics.optics"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2505.00288v5",
    "url": "https://arxiv.org/abs/2505.00288v5",
    "pdf_url": "https://arxiv.org/pdf/2505.00288v5.pdf",
    "title": "Nyström Type Exponential Integrators for Strongly Magnetized Charged   Particle Dynamics",
    "abstract": "Calculating the dynamics of charged particles in electromagnetic fields (i.e. the particle pushing problem) is one of the most computationally intensive components of particle-in-cell (PIC) methods for plasma physics simulations. This task is especially challenging when the plasma is strongly magnetized, since in this case the particle motion consists of a wide range of temporal scales from highly oscillatory fast gyromotion to slow macroscopic behavior and the resulting numerical model is very stiff. Current state-of-the-art time integrators used to simulate particle motion have limitations given the severe numerical stiffness of the problem and more efficient methods are of interest. Recently, exponential integrators have been proposed as a promising new approach for these simulations and shown to offer computational advantages over commonly used schemes. Exponential methods can solve linear problems exactly and are A-stable. In this paper, the standard exponential algorithms framework is extended to derive Nystr\\\"om-type exponential methods that integrate the Newtonian equations of motion as a second-order differential equation. Specific Nystr\\\"om-type schemes of second and third orders are derived and applied to strongly magnetized particle pushing problems. Numerical experiments are presented to demonstrate that the Nystr\\\"om-type exponential integrators can provide significant improvement in computational efficiency over the standard exponential methods.",
    "authors": [
      "Tri P. Nguyen",
      "Ilon Joseph",
      "Mayya Tokman"
    ],
    "published": "2025-05-01T04:22:49Z",
    "updated": "2025-08-01T09:08:16Z",
    "categories": [
      "physics.comp-ph",
      "cs.NA",
      "math.NA",
      "physics.plasm-ph",
      "65L04, 78A35"
    ],
    "primary_category": "physics.comp-ph"
  },
  {
    "arxiv_id": "2508.00417v1",
    "url": "https://arxiv.org/abs/2508.00417v1",
    "pdf_url": "https://arxiv.org/pdf/2508.00417v1.pdf",
    "title": "Collimated QED Cascades with Curved Plasma Mirror",
    "abstract": "Converting light into matter has been a longstanding goal in physics, particularly the creation of electron-positron pairs through quantum electrodynamic (QED) processes. While current approaches using multiple colliding laser pulses can achieve this conversion, they struggle to produce well-collimated particle beams - a crucial requirement for practical applications. Here we demonstrate that a single ultra-intense laser pulse, when reflected from a curved plasma mirror, can generate highly collimated electron-positron pairs with unprecedented efficiency. By focusing the laser to field strengths exceeding $a_0 > 2000$, our method triggers QED cascades that produce tightly focused particle beams, distinctly different from the diffuse plasmas created by conventional multi-laser setups. The technique works even at relatively modest laser powers of 13PW, making it immediately testable at existing facilities. This breakthrough opens new possibilities for studying fundamental QED processes and generating controlled matter-antimatter plasmas.",
    "authors": [
      "Xuesong Geng",
      "M. A. Serebryakov",
      "E. N. Nerush",
      "A. S. Samsonov",
      "I. Y. Kostyukov",
      "Liangliang Ji"
    ],
    "published": "2025-08-01T08:15:02Z",
    "updated": "2025-08-01T08:15:02Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.00375v1",
    "url": "https://arxiv.org/abs/2508.00375v1",
    "pdf_url": "https://arxiv.org/pdf/2508.00375v1.pdf",
    "title": "A COGENT case study: Supporting Applications with Chombo",
    "abstract": "We present a case study of how a software framework (Chombo) supported the specific needs of a scientific application (COGENT). Since its inception in 2000, the Chombo framework has supported various applications. One example of such support has been the collaboration with the Edge Simulation Laboratory to build the COGENT model. The specific needs of the COGENT effort required the design and implementation of a set of new capabilities in the Chombo framework, such as higher-order mapped-multiblock discretizations and multi-dimensional code organization. These capabilities allowed COGENT to develop a unique simulation capability for modeling the edge layers in tokamaks. Once developed, these capabilities were able to support other applications which had similar needs.",
    "authors": [
      "Daniel F. Martin",
      "Milo Dorr",
      "Mikhail Dorf",
      "Lee F. Ricketson"
    ],
    "published": "2025-08-01T07:10:11Z",
    "updated": "2025-08-01T07:10:11Z",
    "categories": [
      "math.NA",
      "cs.NA",
      "physics.plasm-ph"
    ],
    "primary_category": "math.NA"
  },
  {
    "arxiv_id": "2508.00339v1",
    "url": "https://arxiv.org/abs/2508.00339v1",
    "pdf_url": "https://arxiv.org/pdf/2508.00339v1.pdf",
    "title": "Favorable modifications of Scrape-Off Layer (SOL) heat flux width   through pulsed fuelling in ADITYA-U Tokamak",
    "abstract": "Enhancement of the scrape-off layer (SOL) heat flux width has been observed in the ADITYA-U Tokamak following the injection of short fuel gas pulses. A notable reduction in parallel heat flux near the last closed flux surface (LCFS) is observed after each pulse. Comparative analysis indicates that pulsed fuelling is more effective in mitigating heat flux with improved core confinement than continuous gas feeding via real-time density control. Analytical and simulation works are also carried out for validation of experimental results. The analytical model shows that SOL width modification cannot be attributed solely to the decrease of temperature due to gas pulse injection; cross-field plasma diffusion also needs to increase. Simulations with the UEDGE code suggest that an increase in both the cross-field diffusion coefficient and inward pinch velocity is necessary to replicate the experimentally observed broadening of the heat flux SOL width. These findings provide insights into efficient SOL heat flux control strategies for future fusion devices.",
    "authors": [
      "SK Injamul Hoque",
      "Harshita Raj",
      "Ritu Dey",
      "Soumitra Banerjee",
      "Komal",
      "Kaushlender Singh",
      "Suman Dolui",
      "Ankit Kumar",
      "Ashok Kumawat",
      "Bharat Hegde",
      "Sharvil Patel",
      "Kiran Patel",
      "Rohit Kumar",
      "Suman Aich",
      "Pramila Gautam",
      "Umesh Nagora",
      "Asha N Adhiya",
      "K. A. Jadeja",
      "K. M. Patel",
      "Ankit Patel",
      "R. L. Tanna",
      "Joydeep Ghosh"
    ],
    "published": "2025-08-01T05:57:21Z",
    "updated": "2025-08-01T05:57:21Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.00232v1",
    "url": "https://arxiv.org/abs/2508.00232v1",
    "pdf_url": "https://arxiv.org/pdf/2508.00232v1.pdf",
    "title": "Fabrication and Experimental Study of Prototype NdFeB Helical Undulators",
    "abstract": "An experiment with short prototypes of helical undulators, comprised of longitudinally magnetized helices made from a single piece of a rare-earth magnet, is described. Wire electrical discharge machining (WEDM) in combination with a flat tool and the rotary movement of the workpiece made it possible to achieve high precision in the manufacture of NdFeB helices. An assembly of two oppositely longitudinally magnetized helices with a period of 20 mm and a relatively large inner diameter of 8 mm creates a field of 0.53 T on the axis of the system, which ensures the value of the undulator parameter K close to unity. According to the calculation, Halbach-type helical micro-undulators with periods of (3-6) mm of four helices can provide a field of 1 T and K = 0.28-0.6 at the axis.",
    "authors": [
      "Nezah Balal",
      "Eberhard Bamberg",
      "Vladimir L. Bratman",
      "Eyal Magory"
    ],
    "published": "2025-08-01T00:39:31Z",
    "updated": "2025-08-01T00:39:31Z",
    "categories": [
      "physics.acc-ph",
      "B.4.1; B.7.1"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.1109/TED.2023.3315250"
  },
  {
    "arxiv_id": "2506.15024v2",
    "url": "https://arxiv.org/abs/2506.15024v2",
    "pdf_url": "https://arxiv.org/pdf/2506.15024v2.pdf",
    "title": "The Gardner equation and acoustic solitary waves in plasmas",
    "abstract": "Ion-acoustic waves in a dusty plasma are investigated where it is assumed that the ions follow a Cairns distribution and the electrons are Boltzmann distributed. Two theoretical methods are applied: Sagdeev pseudopotential analysis (SPA) and reductive perturbation theory (RPT). Since SPA incorporates all nonlinearities of the model it is the most accurate but deriving soliton profiles requires numerical integration of Poisson's equation. By contrast, RPT is a perturbation method which at second order yields the Gardner equation incorporating both the quadratic nonlinearity of the KdV equation and the cubic nonlinearity of the modified KdV equation. For consistency with the perturbation scheme the coefficient of the quadratic term needs to be at least an order of magnitude smaller than the coefficient of the cubic term. Solving the Gardner equation yields an analytic expression of the soliton profile. Selecting an appropriate set of compositional parameters, the soliton solutions obtained from SPA and RPT are analyzed and compared.",
    "authors": [
      "Frank Verheest",
      "Willy A. Hereman"
    ],
    "published": "2025-06-17T23:36:09Z",
    "updated": "2025-07-31T21:01:04Z",
    "categories": [
      "physics.plasm-ph",
      "math-ph",
      "math.MP",
      "nlin.SI",
      "PACS numbers: 52.35.Sb, 52.35.Fp, 52.35.Mw, 52.27.Cm"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.00145v1",
    "url": "https://arxiv.org/abs/2508.00145v1",
    "pdf_url": "https://arxiv.org/pdf/2508.00145v1.pdf",
    "title": "Experimental Demonstration of Dephasing Reduction in an Optically Guided   Laser-Plasma Accelerator",
    "abstract": "Laser-plasma accelerators offer a compact means of producing high-energy electron beams, but their performance is fundamentally limited by dephasing between the accelerated electrons and the plasma wave. To overcome this limitation, we investigate the combination of plasma density tapering and optical guiding to extend the effective acceleration length. Using a Joule-class femtosecond laser coupled into an optical-field-ionized plasma waveguide with a controlled density gradient, we experimentally achieve electron beam energies exceeding 1.6 GeV, a 40% increase compared to the constant-density case. Particle-in-cell simulations reproduce the main experimental features and reveal the central roles of delayed injection, nonlinear laser evolution, and self-focusing in enhancing energy gain.",
    "authors": [
      "Ronan Lahaye",
      "Igor A. Andriyash",
      "Julien Gautier",
      "Olena Kononenko",
      "Adrien Leblanc",
      "Jean-Philippe Goddet",
      "Amar Tafzi",
      "Cedric Thaury"
    ],
    "published": "2025-07-31T20:08:34Z",
    "updated": "2025-07-31T20:08:34Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.00119v1",
    "url": "https://arxiv.org/abs/2508.00119v1",
    "pdf_url": "https://arxiv.org/pdf/2508.00119v1.pdf",
    "title": "Probing Proton versus Electron Heating and Energization during Magnetic   Reconnection",
    "abstract": "The mechanisms controlling the relative heating and energization of electrons and protons during magnetic reconnection are explored. Simulations are carried out with the kglobal model, which produces bulk heating and the extended powerlaw distributions of both species that have been documented in observations. The simulations have been carried out with a range of proton-to-electron mass ratios and upstream temperatures to isolate the factors that control energy gain. The simulations reveal that when the upstream temperatures of the two species are equal, the proton heating and energization exceeds that of electrons and that this is a consequence of the much larger energy gain of protons on their first entry into the reconnection exhaust. The effective energy gain of protons on exhaust entry scales as $m_iC_A^2$ since the protons counterstream at the Alfv\\'en speed $C_A$ while the initial electron energy gain is smaller by the factor $(\\beta_{e0}m_e/m_i)^{1/2}$. Since Fermi reflection during flux rope merger dominates energy gain in large-scale reconnecting systems and the rate of energy gain is proportional to energy, protons continue to gain energy faster than electrons for the duration of the simulations, leading to temperature increments of protons exceeding that of electrons and the non-thermal energy content of protons also exceeding that of electrons.",
    "authors": [
      "Zhiyu Yin",
      "James F. Drake",
      "Marc Swisdak"
    ],
    "published": "2025-07-31T19:14:47Z",
    "updated": "2025-07-31T19:14:47Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.00114v1",
    "url": "https://arxiv.org/abs/2508.00114v1",
    "pdf_url": "https://arxiv.org/pdf/2508.00114v1.pdf",
    "title": "Unified Description of Kappa-type velocity distributions",
    "abstract": "An extension of Maxwell's original prescription for an ideal gas is adopted to derive a broad class of Kappa-type velocity distributions, encompassing both fat and short-tailed forms. Within this general framework, a physically consistent fat-tailed Kappa distribution is identified that accurately fits recent suprathermal data. In particular, a kinetic physical temperature $T$ emerges naturally from the model, eliminating the need to invoke an effective temperature $T_{\\kappa\\ell}$, as is commonly done in the literature. Finally, it is argued that only a particular value of $\\ell$ ensures a satisfactory fit to the data when the physical kinetic temperature is employed.",
    "authors": [
      "J. A. S. Lima",
      "M. H. Benetti"
    ],
    "published": "2025-07-31T19:07:18Z",
    "updated": "2025-07-31T19:07:18Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1103/66yl-y4r1"
  },
  {
    "arxiv_id": "2504.13435v2",
    "url": "https://arxiv.org/abs/2504.13435v2",
    "pdf_url": "https://arxiv.org/pdf/2504.13435v2.pdf",
    "title": "A generalized framework for the critical current for a one-dimensional   crossed-field gap in an orthogonal coordinate system",
    "abstract": "Recent studies have applied variational calculus, conformal mapping, and point transformations to extend the one-dimensional SCLC from planar gaps to more complicated geometries. However, introducing a magnetic field orthogonal to the diode's electric field complicates these calculations due to changes in the electron trajectory. This paper extends a recent study that applied variational calculus to determine the SCLC for a cylindrical crossed-field diode to derive an equation that is valid for any orthogonal coordinate system. We then derive equations for the SCLC for crossed-field gaps in spherical, tip-to-tip, and tip-to-plane geometries that can be solved numerically. These calculations exhibit a discontinuity at the Hull cutoff magnetic field $B_H$ corresponding to the transition to magnetic insulation as observed analytically for a planar geometry. The ratio of the crossed-field SCLC to the nonmagnetic SCLC becomes essentially independent of geometry when we fix $\\delta = D/D_M > 0.6$, where $D$ is the canonical gap distance accounting for geometric effects on electric potential and $D_M$ is the effective gap distance that accounts for magnetic field and geometry. The solutions for these geometries overlap as $\\delta \\to 1$ since the geometric corrections for electric potential and magnetic field match. This indicates the possibility of more generally accounting for the combination of geometric and magnetic effects when calculating $B_H$ and SCLC.",
    "authors": [
      "Jack K. Wright",
      "N. R. Sree Harsha",
      "Allen L. Garner"
    ],
    "published": "2025-04-18T03:20:46Z",
    "updated": "2025-07-31T18:32:44Z",
    "categories": [
      "physics.plasm-ph",
      "physics.app-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1063/5.0276244"
  },
  {
    "arxiv_id": "2508.00962v1",
    "url": "https://arxiv.org/abs/2508.00962v1",
    "pdf_url": "https://arxiv.org/pdf/2508.00962v1.pdf",
    "title": "EIE calculation and Collisional-Radiative modeling for Na-like Kr and Xe",
    "abstract": "As an extension to our previous work [1], a comprehensive theoretical study for Na-like Krypton and Xenon is carried out. Using MCDHF (Multiconfiguration Dirac-Hartee-Fock) along with RDW (Relativistic distorted wave) theory we calculate key atomic properties, electron-impact excitation (EIE), rate coefficients, and collision strength for these ions. We use these parameters to build a Collisional-Radiative model for Na-like Krypton and Xenon. For Na-like Krypton we compare our computed excitation energy, EIE cross-sections, rate coefficients, emission line intensity with previous work. Additionally we investigate variation of line ratios with temperature. For Na-like Xenon we compared excitation energy for various fine-structure with NIST( [2]) database and then provide our computed results for EIE cross-section,intensity profile, and the temperature dependence of line ratios for Na-like Xenon. Our findings offer atomic data for studies related Na-like ions.",
    "authors": [
      "Ashwini Malviya"
    ],
    "published": "2025-07-31T15:31:34Z",
    "updated": "2025-07-31T15:31:34Z",
    "categories": [
      "physics.atom-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2507.18672v2",
    "url": "https://arxiv.org/abs/2507.18672v2",
    "pdf_url": "https://arxiv.org/pdf/2507.18672v2.pdf",
    "title": "Analysis of RF Surface Loss in a Planar 2D Qubit",
    "abstract": "The Josephson junction and shunt capacitor form a transmon qubit, which is the cornerstone of modern quantum computing platforms. For reliable quantum computing, it is important how long a qubit can remain in a superposition of quantum states, which is determined by the coherence time (T1). The coherence time of a qubit effectively sets the \"lifetime\" of usable quantum information, determining how long quantum computations can be performed before errors occur and information is lost. There are several sources of decoherence in transmon qubits, but the predominant one is generally considered to be dielectric losses in the natural oxide layer formed on the surface of the superconductor. In this paper, we present a numerical study of microwave surface losses in planar superconducting antennas of different transmon qubit designs. An asymptotic method for estimating the energy participation ratio in ultrathin films of nanometer scales is proposed, and estimates are given for the limits of achievable minimum RF losses depending on the electrical properties of the surface oxide and the interface of the qubit with the substrate material.",
    "authors": [
      "Andrei Lunin",
      "Mustafa Bal",
      "Akshay Murthy",
      "Shaojiang Zhu",
      "Anna Grassellino",
      "Alexander Romanenko"
    ],
    "published": "2025-07-24T11:44:16Z",
    "updated": "2025-07-31T15:03:16Z",
    "categories": [
      "quant-ph",
      "physics.acc-ph"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2507.13907v2",
    "url": "https://arxiv.org/abs/2507.13907v2",
    "pdf_url": "https://arxiv.org/pdf/2507.13907v2.pdf",
    "title": "Novel techniques of imaging interferometry analysis to study gas and   plasma density for laser-plasma experiments",
    "abstract": "Laser-plasma based experiments are always more demanding about the plasma features which need to be generated during the interaction. This is valid for laser-plasma acceleration as well as for inertial confinement fusion experiments. Most of these experiments are moving toward high repetition rate operation regimes, making even more demanding the requests on the plasma sources and the diagnostics to be implemented.\\\\ Interferometry is one of the most used methods to characterize these sources, since it allows for non-perturbative, single-shot measurements either of the neutral gas or the plasma density. The design of the interferometric setup is non-trivial and needs to be shaped on the actual conditions of the experiment. Similarly, the analysis of the raw data is a complex task, prone to many sources of error and dependent on the manual inputs.\\\\ In this work, we will present the techniques we are developing for the analysis of the interferograms to measure both the gas and plasma density. We will show the methods, the progress and the problems we encountered in the development of novel routines of analysis based on machine learning. The architectures and the methods to obtain data used for training and testing them will be introduced. The study is ongoing and preliminary results with synthetic data will be presented. The goal is to set up a fast and operator independent diagnostic for the feedback of plasma sources toward high repetition rate experiments.",
    "authors": [
      "F. Filippi",
      "M. Cipriani",
      "S. Mastrostefano",
      "M. Scisciò",
      "F. Consoli"
    ],
    "published": "2025-07-18T13:37:07Z",
    "updated": "2025-07-31T10:59:44Z",
    "categories": [
      "physics.plasm-ph",
      "physics.data-an",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2410.18155v7",
    "url": "https://arxiv.org/abs/2410.18155v7",
    "pdf_url": "https://arxiv.org/pdf/2410.18155v7.pdf",
    "title": "On the Unruh effect for hyperbolic observers in spacetimes of maximal   proper acceleration",
    "abstract": "In this work, the notion of spacetime of maximal proper acceleration is motivated as a weak form to implement general covariance and a generalized form of Einstein's equivalence principle from a physical point of view and the fundamental geometric and kinematic properties of such spaces are discussed. Thereafter the Unruh temperature formula is generalized to the case of hyperbolic observers in spacetimes of maximal proper acceleration. Such a generalization implies the existence of a maximal value for the Unruh temperature. We discuss this result for an electrodynamic model of point charged particles in a spacetime of maximal proper acceleration. It is shown that according to the model, the maximal Unruh temperature must be of order $4.8\\cdot 10^{10}/N$ K for current high acceleration electron laser-plasma acceleration systems, where $N$ is the population of the typical bunch.",
    "authors": [
      "Ricardo Gallego Torromé"
    ],
    "published": "2024-10-23T08:15:03Z",
    "updated": "2025-07-31T10:19:07Z",
    "categories": [
      "gr-qc",
      "hep-th",
      "math-ph",
      "math.MP",
      "physics.acc-ph"
    ],
    "primary_category": "gr-qc",
    "doi": "10.1098/rspa.2024-0931"
  },
  {
    "arxiv_id": "2501.01524v2",
    "url": "https://arxiv.org/abs/2501.01524v2",
    "pdf_url": "https://arxiv.org/pdf/2501.01524v2.pdf",
    "title": "Gravitational Turbulence: the Small-Scale Limit of the Cold-Dark-Matter   Power Spectrum",
    "abstract": "The matter power spectrum, $P(k)$, is one of the fundamental quantities in the study of large-scale structure in cosmology. Here, we study its small-scale asymptotic limit, and show that for cold dark matter in $d$ spatial dimensions, $P(k)$ has a universal $k^{-d}$ asymptotic scaling with the wave-number $k$, for $k \\gg k_{\\rm nl}$, where $k_{\\rm nl}^{-1}$ denotes the length scale at which non-linearities in gravitational interactions become important. We propose a theoretical explanation for this scaling, based on a non-perturbative analysis of the system's phase-space structure. Gravitational collapse is shown to drive a turbulent phase-space flow of the quadratic Casimir invariant, where the linear and non-linear time scales are balanced, and this balance dictates the $k$ dependence of the power spectrum. A parallel is drawn to Batchelor turbulence in hydrodynamics, where large scales mix smaller ones via tidal interactions. The $k^{-d}$ scaling is also derived by expressing $P(k)$ as a phase-space integral in the framework of kinetic field theory, which is analysed by the saddle-point method; the dominant critical points of this integral are precisely those where the time scales are balanced. The coldness of the dark-matter distribution function - its non-vanishing only on a $d$-dimensional sub-manifold of phase-space - underpins both approaches. The theory is accompanied by $1\\mathrm{D}$ Vlasov-Poisson simulations, which confirm it.",
    "authors": [
      "Yonadav Barry Ginat",
      "Michael L. Nastac",
      "Robert J. Ewart",
      "Sara Konrad",
      "Matthias Bartelmann",
      "Alexander A. Schekochihin"
    ],
    "published": "2025-01-02T20:27:49Z",
    "updated": "2025-07-31T10:14:41Z",
    "categories": [
      "astro-ph.CO",
      "astro-ph.GA",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.CO"
  },
  {
    "arxiv_id": "2406.02837v2",
    "url": "https://arxiv.org/abs/2406.02837v2",
    "pdf_url": "https://arxiv.org/pdf/2406.02837v2.pdf",
    "title": "General-Relativistic Gauge-Invariant Magnetic Helicity Transport: Basic   Formulation and Application to Neutron Star Mergers",
    "abstract": "Dynamo processes are ubiquitous in astrophysical systems. In relativistic astrophysical systems, such as accretion disks around black holes or neutron stars, they may critically affect the launching of winds and jets that can power electromagnetic emission. Dynamo processes are governed by several microscopic parameters, one of them being magnetic helicity. As a conserved quantity in nonresistive plasmas, magnetic helicity is transported across the system. One important implication of helicity conservation is, that in the absence of helicity fluxes some mean-field dynamos can be quenched, potentially affecting the large-scale evolution of the magnetic field. One of the major challenges in computing magnetic helicity is the need to fix a meaningful electromagnetic gauge. We here present a fully covariant formulation of magnetic helicity transport in general-relativistic plasmas based on the concept of relative helicity by Berger & Field and Finn & Antonsen. This formulation is separately invariant under gauge-transformation of the Maxwell and Einstein equations. As an application of this new formalism we present the first analysis of magnetic helicity transport in the merger of two neutron stars. We demonstrate the presence of global helicity fluxes into the outer layers of the stellar merger remnant, which may impact subsequent large-scale dynamo amplification in these regions.",
    "authors": [
      "Jiaxi Wu",
      "Elias R. Most"
    ],
    "published": "2024-06-05T01:27:31Z",
    "updated": "2025-07-30T16:40:01Z",
    "categories": [
      "astro-ph.HE",
      "gr-qc",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE",
    "doi": "10.1103/PhysRevD.110.124046"
  },
  {
    "arxiv_id": "2507.22821v1",
    "url": "https://arxiv.org/abs/2507.22821v1",
    "pdf_url": "https://arxiv.org/pdf/2507.22821v1.pdf",
    "title": "Axisymmetric Gyrokinetic Simulation of ASDEX-Upgrade Scrape-off Layer   Using a Conservative Implicit BGK Collision Operator",
    "abstract": "Collisions play an important role in turbulence and transport of fusion plasmas. For kinetic simulations, as the collisionality increases in the domain of interest, the size of the time step to resolve the collisional physics can become overly restrictive in an explicit time integration scheme, leading to high computational cost. With the aim of overcoming such restriction, we have implemented an implicit Bhatnagar-Gross-Krook (BGK) collision operator for use in the discontinuous Galerkin (DG) full-f gyrokinetic solver within the Gkeyll framework, which, when combined with Gkeyll's traditional explicit time integrator for collisionless advection, can significantly increase the time step in gyrokinetic simulations of highly collisional regimes. To ensure conservation of density, momentum, and energy, we utilize an iterative scheme to correct the discretized approximation to the equilibrium Maxwellian distribution to which the BGK collision operator relaxes. We have further generalized the BGK infrastructure, both the implicit scheme and the correction routine, to handle cross species collisions. This improved implicit and conservative BGK operator is benchmarked against the more accurate but more computationally expensive Lenard-Bernstein-Dougherty (LBD) operator which has been utilized in prior studies with Gkeyll. The implicit BGK operator enables 2D axisymmetric simulations of the ASDEX-Upgrade scrape-off layer to run 56 times faster to completion than the simulations with the LBD operator, because the BGK operator is more robust and converges at a lower resolution than is required by the LBD operator. Additionally, in this more collisional limit, we demonstrate that the results of our simulations utilizing the implicit BGK operator agreed well with simulations utilizing the more computationally expensive LBD operator.",
    "authors": [
      "D. Liu",
      "J. Juno",
      "G. W. Hammett",
      "A. Hakim",
      "A. Shukla",
      "M. Francisquez"
    ],
    "published": "2025-07-30T16:36:30Z",
    "updated": "2025-07-30T16:36:30Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2505.06476v2",
    "url": "https://arxiv.org/abs/2505.06476v2",
    "pdf_url": "https://arxiv.org/pdf/2505.06476v2.pdf",
    "title": "A Flare-related Decimetric Type-IV Radio Burst Induced by the X2   Radiation of Electron Cyclotron Maser Emission",
    "abstract": "The radiation mechanism of decimetric wideband and pulsating radio bursts from the Sun (in terms of decimetric type-IV (t-IVdm) burst) and other flaring stars is a long-standing problem. Early investigations were based on the leading-spot hypothesis for the sun and yielded contradictory results. Here, we analyzed the flare-associated t-IVdm burst on 20110924 with medium-strong levels of polarization and from sources near a sunspot. We found that the emission is intermittent and the maximum $T_B$ exceeds 10$^{11}$ K, with well-defined upper and lower frequency cutoffs. The radio sources are left-handed polarized, located above the sunspot with a negative polarity. The sources align well with the sites of the second harmonic of the local electron gyrofrequency. These findings provide essential evidence that the burst is induced by the electron cyclotron maser emission (ECME) in the harmonic X mode. We further modeled the transport of downward-streaming energetic electrons along a coronal loop and found most electrons get mirrored within the specific altitude range of 20-100 Mm. This explains why such bursts tend to have well-defined spectral ranges. We also found the ECME-radiating energetic electrons exhibit a shell-like VDF instead of the generally-presumed loss-cone distribution. The study greatly expands the application of ECME in solar radio astronomy and provides solar samples for similar bursts from other flaring stars.",
    "authors": [
      "Maoshui Lv",
      "Ze Zhong",
      "Xiangliang Kong",
      "Hao Ning",
      "Feiyu Yu",
      "Bing Wang",
      "Baolin Tan",
      "Victor Melnikov",
      "Alexey Kuznetsov",
      "Hongqiang Song",
      "Ruisheng Zheng",
      "Yao Chen"
    ],
    "published": "2025-05-10T00:29:40Z",
    "updated": "2025-07-30T14:39:12Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2507.22672v1",
    "url": "https://arxiv.org/abs/2507.22672v1",
    "pdf_url": "https://arxiv.org/pdf/2507.22672v1.pdf",
    "title": "A visual approach to global accretion disk instabilities",
    "abstract": "For over 30 years, the Magneto-Rotational Instability has been accepted as the mechanism driving accretion disk turbulence. Its physical basis is well understood, where an interplay between centrifugal forces and magnetic tension transfers angular momentum between oppositely displaced fluid elements. In this work, we revisit this picture in global disk models and various magnetic field topologies and generalise it to non-axisymmetric instabilities like the Super-Alfv\\'enic Rotational Instability (SARI). We use the open-source \\texttt{Legolas} software to quantify all complex-valued linear eigenfunctions for the (near-)eigenmodes and visualise the resulting spatio-temporal variations in real space in a manner that can be compared to direct numerical simulations of disks. The field perturbations are fundamentally different between the (axisymmetric) MRI and the novel, ultra-localised SARI modes, which bear some resemblance to spiral modes in galaxies but differ in important ways. We use a combined numerical-analytical approach to study the polarization of the magnetic and velocity field perturbations. Finally, we compare disks of differing magnetic topology where many linear modes are merely superposed to recreate a visual impression of `turbulent' fields and quantify the resulting stresses. We find that even superposed, still linearly growing SARI modes can already provide the needed effective viscosity-related alpha-values invoked for angular momentum transport. 3D views on the magnetic field perturbations show that SARI modes of opposite azimuthal mode number may naturally introduce plasmoid and toroidal flux-tube like field deformations.",
    "authors": [
      "Nicolas Brughmans",
      "Rony Keppens"
    ],
    "published": "2025-07-30T13:36:12Z",
    "updated": "2025-07-30T13:36:12Z",
    "categories": [
      "astro-ph.GA",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.GA"
  },
  {
    "arxiv_id": "2507.22561v1",
    "url": "https://arxiv.org/abs/2507.22561v1",
    "pdf_url": "https://arxiv.org/pdf/2507.22561v1.pdf",
    "title": "Filamentation of the electromagnetic precursor in relativistic   quasi-perpendicular electron-positron shocks",
    "abstract": "We present a scenario that could explain non-thermal particle acceleration in relativistic quasi-perpendicular electron-positron shocks, such as the termination shock of pulsar wind nebulae. The shock produces a strong electromagnetic precursor that propagates into the upstream plasma, which is initially threaded by a uniform background magnetic field. We show that the filamentation instability breaks the precursor into radiation filaments parallel to the shock normal. The transverse scale of the filaments is of the order of a few plasma skin depths. In the shock frame, the bulk Lorentz factor of the upstream plasma is significantly reduced inside the radiation filaments. Then, the instability produces a relativistic shear flow with strong velocity gradients on kinetic scales. The velocity gradients distort the background magnetic field lines, and generate a magnetic field component parallel to the shock normal that reverses across each radiation filament, a configuration that could trigger magnetic reconnection in the upstream plasma. These effects may accelerate particles before the plasma enters the shock.",
    "authors": [
      "Emanuele Sobacchi",
      "Yuri Lyubarsky",
      "Lorenzo Sironi",
      "Masanori Iwamoto"
    ],
    "published": "2025-07-30T10:36:30Z",
    "updated": "2025-07-30T10:36:30Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2502.16392v4",
    "url": "https://arxiv.org/abs/2502.16392v4",
    "pdf_url": "https://arxiv.org/pdf/2502.16392v4.pdf",
    "title": "femto-PIXAR: a neural network method for reconstruction of femtosecond   X-ray free electron laser pulse energy",
    "abstract": "X-ray Free Electron Lasers (X\\nobreakdash-FELs) operate in a wide range of lasing configurations for a broad variety of scientific applications at ultrafast time-scales such as structural biology, materials science, and atomic and molecular physics. Shot-by-shot characterization of the X-FEL pulses is crucial for analysis of many experiments as well as tuning the X-FEL performance. However, for the weak pulses found in advanced configurations, e.g. those needed for coherent, two-pulse studies of quantum materials, there is no current method for reliably resolving pulse profiles. Here we show that a physics-based U-net model can reconstruct the individual pulse power profiles for sub-picosecond pulse separation without the need for simulations. Using experimental data from weak X-FEL pulse pairs, we demonstrate we can learn the pulse characteristics on a shot-by-shot basis when conventional methods fail.",
    "authors": [
      "Gesa Goetzke",
      "Rajan Plumley",
      "Gregor Hartmann",
      "Tim Maxwell",
      "Franz-Josef Decker",
      "Alberto Lutman",
      "Mike Dunne",
      "Daniel Ratner",
      "Joshua J. Turner"
    ],
    "published": "2025-02-23T01:00:16Z",
    "updated": "2025-07-30T09:22:05Z",
    "categories": [
      "physics.acc-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.1364/OE.562798"
  },
  {
    "arxiv_id": "2507.22392v1",
    "url": "https://arxiv.org/abs/2507.22392v1",
    "pdf_url": "https://arxiv.org/pdf/2507.22392v1.pdf",
    "title": "Impact of coherent wiggler radiation impedance in Tau-Charm factories",
    "abstract": "Coherent synchrotron radiation (CSR) has long been recognized as a significant source of longitudinal impedance driving microwave instability in electron storage rings. In the pursuit of higher luminosity, next-generation circular $e^+e^-$ colliders operating in the few-GeV energy range, such as B-factories and Tau-Charm factories, are being designed with low-emittance beams and high beam currents. Damping wigglers are commonly introduced to reduce damping times and control beam emittance. In this study, we systematically investigate the impact of coherent wiggler radiation (CWR), a specific form of CSR generated within wigglers, on beam stability in Tau-Charm factories. We revisit the threshold conditions for CWR-induced microwave instability and evaluate its effects under realistic lattice configurations of collider rings. Furthermore, we examine theoretical models of longitudinal CWR impedance and identify improved formulations that better capture its influence. As an illustrative example, the developed CWR impedance models are applied to simulate beam stability in the Super Tau-Charm Facility currently under design in China.",
    "authors": [
      "Tianlong He",
      "Ye Zou",
      "Demin Zhou",
      "Hao Zhou",
      "Hangzhou Li",
      "Linhao Zhang",
      "Tao Liu",
      "Weiwei Li",
      "Jingyu Tang"
    ],
    "published": "2025-07-30T05:27:17Z",
    "updated": "2025-07-30T05:27:17Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.11755v2",
    "url": "https://arxiv.org/abs/2507.11755v2",
    "pdf_url": "https://arxiv.org/pdf/2507.11755v2.pdf",
    "title": "The Origin of Structure in the Auroral Ionosphere",
    "abstract": "The auroral ionosphere presents a paradox: turbulence often thrives in a conductive layer that should suppress the growth rates of plasma instabilities. Using a novel composite power spectrum from coherent radar and GPS data, we show that turbulence on a wide range of scales stem not from local instabilities. Instead, its spectrum is a structural imprint of field-aligned electrical currents, and its dissipative character is governed by the flux of precipitating particles. Our measurements provide a clear geophysical example of a driven, emergent system of self-organized dissipative structures.",
    "authors": [
      "Magnus F Ivarsen",
      "Kaili Song",
      "Luca Spogli",
      "Jean-Pierre St-Maurice",
      "Brian Pitzel",
      "Saif Marei",
      "Devin R Huyghebaert",
      "Satoshi Kasahara",
      "Kunihiro Keika",
      "Yoshizumi Miyoshi",
      "Yoichi Kazama",
      "Shiang-Yu Wang",
      "Ayako Matsuoka",
      "Iku Shinohara",
      "Shoichiro Yokota",
      "P. T. Jayachandran",
      "Glenn C Hussey"
    ],
    "published": "2025-07-15T21:33:42Z",
    "updated": "2025-07-30T04:48:16Z",
    "categories": [
      "physics.space-ph",
      "nlin.AO",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2507.22215v1",
    "url": "https://arxiv.org/abs/2507.22215v1",
    "pdf_url": "https://arxiv.org/pdf/2507.22215v1.pdf",
    "title": "On operation and control of CW magnetrons for superconducting   accelerators",
    "abstract": "CW magnetrons, developed for industrial RF heaters, were suggested to feed RF cavities of superconducting accelerators due to higher efficiency and lower cost of RF power than provide traditionally used klystrons, IOTs or solid-state amplifiers. RF amplifiers driven by a master oscillator serve as coherent RF sources. CW magnetrons are regenerative RF auto generators with a huge regenerative gain. This causes regenerative instability with a notable noise when a magnetron operates as an auto generator i.e., with the anode voltage above the threshold of self-excitation. Traditionally, an injection locking by a small signal is used for phase stabilization of magnetrons. In this case CW magnetrons with the injection-locked (coherent) oscillations generate a notable level of noise. This may preclude use of CW magnetrons in this mode in the Superconducting RF (SRF) accelerators. This paper reviews PIC modeling and previously obtained experimental results for the operation and control of CW magnetrons, which led to the development of techniques most suitable for various SRF accelerators using forced RF oscillation of magnetrons, when the magnetron is launched by an injected forcing signal, and regenerative noise is suppressed.",
    "authors": [
      "G. Kazakevich",
      "R. P. Johnson",
      "I. Gonin",
      "V. Yakovlev",
      "Ya. Derbenev",
      "H. Wang"
    ],
    "published": "2025-07-29T20:23:47Z",
    "updated": "2025-07-29T20:23:47Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.22175v1",
    "url": "https://arxiv.org/abs/2507.22175v1",
    "pdf_url": "https://arxiv.org/pdf/2507.22175v1.pdf",
    "title": "Formation and Evolution of Pair-Alfvén Shocks with PIC Simulations",
    "abstract": "We consider the recently discovered \\emph{pair-Alfv\\'en shock wave} occurring in collisionless electron-positron plasmas. We perform a series of Particle-In-Cell studies in one and two dimensions in order to determine the stability conditions for such a shock and the mechanisms which sustain its growth. Building on our previous simulations, which established that these shocks are initially mediated by the Weibel instability before becoming Alfv\\'enic, we demonstrate that the shock is sustained by self-generated Alfv\\'en waves overtaking the shock in the upstream plasma. As a result growth is only possible when the guiding magnetic field strength, and hence Alfv\\'en speed, is sufficiently small, $\\omega_c \\lesssim 0.4$ (in normalized units). Furthermore the production of the waves in the upstream is dependent on a resonance between the Alfv\\'en wave mode and the thermal noise in the plasma, which is inhibited at high magnetization. This explains the conditional absence of this type of shock identified previously.",
    "authors": [
      "John Daniel Riordan",
      "Mark E. Dieckmann",
      "Asaf Pe'er"
    ],
    "published": "2025-07-29T19:12:41Z",
    "updated": "2025-07-29T19:12:41Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2507.22055v1",
    "url": "https://arxiv.org/abs/2507.22055v1",
    "pdf_url": "https://arxiv.org/pdf/2507.22055v1.pdf",
    "title": "Quantum and Material Effects in Undulator-Based LSW Searches for Dark   Photons",
    "abstract": "The dark photon is one of the simplest extensions of the Standard Model and provides a minimal laboratory for quantum-mechanical phenomena. Light-shining-through-a-wall (LSW) searches often adopt the dark photon-photon oscillation formula as if the sensitivity were independent of the light source, the wall, and the surrounding medium. In this paper, I revisit an LSW experiment whose light source is an undulator and systematically include various quantum effects: finite wave packets, kinematical suppression due to the microscopic structure of the source, and mixing suppression/enhancement in the wall and the air. We find that the resulting sensitivities deviate significantly from those obtained with the na\\\"{i}ve oscillation formula, especially depending on the mass of the dark photon, relevant to reflective index of the medium or walls, there can be resonance effects enhancing the sensitivity significantly. Accounting for these effects, we show that placing a photon detector outside the shielding along the beamline of a synchrotron facility enables an economical, parasitic LSW search for dark photons.",
    "authors": [
      "Wen Yin"
    ],
    "published": "2025-07-29T17:57:09Z",
    "updated": "2025-07-29T17:57:09Z",
    "categories": [
      "hep-ph",
      "hep-ex",
      "physics.acc-ph"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2507.19436v2",
    "url": "https://arxiv.org/abs/2507.19436v2",
    "pdf_url": "https://arxiv.org/pdf/2507.19436v2.pdf",
    "title": "Unveiling the Velocity-Space Signature of Ion Cyclotron Damping Using   Liouville Mapping",
    "abstract": "Ion cyclotron damping is a key mechanism for the dissipation of electromagnetic wave energy in weakly collisional plasmas. This study presents a combined approach using Liouville mapping and the field-particle correlation technique to investigate qualitatively and quantitatively the velocity-space signature of ion cyclotron damping. Liouville mapping offers a computationally efficient way to predict perturbations to the particle velocity distribution function using single-particle trajectories in prescribed electromagnetic fields. One may apply the field-particle correlation technique to these perturbed velocity distributions to reveal the unique velocity-space signatures of the secular energy transfer rate associated with specific wave-particle interactions. We validate this method by reproducing known Landau damping signatures for kinetic Alfv\\'en waves, and then we apply this method to ion cyclotron waves where ion cyclotron damping dominates. The resulting velocity-space signature reveals distinct energization features of ion cyclotron damping : (i) a quadrupolar pattern in the perpendicular $(v_x, v_y)$ plane; and (ii) a localized energization near the $n = 1$ resonant velocity in gyrotropic $(v_\\parallel, v_\\perp)$ velocity-space. The quantitative patterns remain unchanged as the ion plasma beta $\\beta_i$ is varied, ultimately showing minimal $v_\\perp$ dependence on $\\beta_i$ of the velocity-space signature at the $n = 1$ resonant velocity. This work provides a systematic study of how the ion cyclotron damping signature varies with $\\beta_i$, offering a practical foundation to identify ion cyclotron damping using kinetic simulation data or spacecraft data.",
    "authors": [
      "Rui Huang",
      "Gregory G. Howes"
    ],
    "published": "2025-07-25T17:07:15Z",
    "updated": "2025-07-29T17:57:03Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2502.08498v2",
    "url": "https://arxiv.org/abs/2502.08498v2",
    "pdf_url": "https://arxiv.org/pdf/2502.08498v2.pdf",
    "title": "100s TeV/m-Level Particle Accelerators Driven by High-density Electron   Beams in Micro Structured Carbon Nanotube Forest Channel",
    "abstract": "Solid-state materials, such as carbon nanotubes (CNTs), have the potential to support ultra-high accelerating fields in the TV/m range for charged particle acceleration. In this study, we explore the feasibility of using nanostructured CNTs forest to develop plasma-based accelerators at the 100 TeV/m-level, driven by high-density, ultra-relativistic electron beams, using fully three-dimensional particle-in-cell simulations. Two different acceleration mechanisms are proposed and investigated: the surface plasmon leakage field and the bubble wakefield. The leakage field, driven by a relatively low-density beam, can achieve an acceleration field up to TV/m, capable of accelerating both electron and positron beams. In particular, due to the direct acceleration by the driver beam, the positron acceleration is highly efficient with an average acceleration gradient of 2.3 TeV/m. In contrast, the bubble wakefield mechanism allows significantly higher acceleration fields, e.g. beyond 400 TV/m, with a much higher energy transfer efficiency of $66.7\\%$. In principle, electrons can be accelerated to PeV energies over distances of several meters. If the beam density is sufficiently high, the CNT target will be completely blown out, where no accelerating field is generated. Its threshold has been estimated. Two major challenges in these schemes are recognised and investigated. Leveraging the ultra-high energy and charge pumping rate of the driver beam, the nanostructured CNTs also offer significant potential for a wide range of advanced applications. This work represents a promising avenue for the development of ultra-compact, high-energy particle accelerators. We also outline conceptual experiments using currently available facilities, demonstrating that this approach is experimentally accessible.",
    "authors": [
      "Bifeng Lei",
      "Hao Zhang",
      "Cristian Bontoiu",
      "Alexandre Bonatto",
      "Javier Resta-Lopez",
      "Guoxing Xia",
      "Bin Qiao",
      "Carsten Welsch"
    ],
    "published": "2025-02-12T15:33:48Z",
    "updated": "2025-07-29T14:19:47Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2111.15555v5",
    "url": "https://arxiv.org/abs/2111.15555v5",
    "pdf_url": "https://arxiv.org/pdf/2111.15555v5.pdf",
    "title": "Detuning Properties of RF Phase Modulation in an Electron Storage Ring",
    "abstract": "In electron storage rings, it is possible to increase the bunch length by applying phase modulation to the radio frequency accelerating field by choosing appropriate parameters for the modulation. Such a bunch lengthening effect improves beam parameters such as beam lifetime, which can help us achieve better beam stability. It is well known that the modulation frequency around the double synchrotron frequency is effective in lengthening the bunch. The dependence of bunch lengthening on modulation frequency, the so-called detuning property, has a peak around the double synchrotron frequency with a frequency width that depends on the modulation amplitude. Nonlinear effects due to phase modulation lead to a peak frequency shift in a negative direction from the double synchrotron frequency, accompanied by an asymmetric peak shape. Beam current also affects the properties of the detuning condition of such bunch lengthening. We investigated the detuning property using a theoretical model and systematic measurements at the electron storage ring KARA, and we verified the qualitative agreement between the experiments and the theoretical model. The macro-particle simulations have confirmed the agreement.",
    "authors": [
      "Akira Mochihashi",
      "Sebastian Maier",
      "Edmund Blomley",
      "Marcel Schuh",
      "Erhard Huttel",
      "Tobias Boltz",
      "Benjamin Kehrer",
      "Anke-Susanne Müller",
      "Dmitry Teytelman"
    ],
    "published": "2021-11-30T16:46:04Z",
    "updated": "2025-07-29T13:40:59Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.1103/t3gd-13n4"
  }
]