{
  "arxiv_id": "2508.14463v1",
  "url": "https://arxiv.org/abs/2508.14463v1",
  "pdf_url": "https://arxiv.org/pdf/2508.14463v1.pdf",
  "title": "Enhancing Neutron Measurement Accuracy with Bubble Detectors at   Laser-Driven Neutron Sources",
  "abstract": "Bubble detectors are widely used to measure neutron flux from laser-driven sources employing a pitcher-catcher setup, due to their insensitivity to intense $\\gamma$-ray backgrounds and strong electromagnetic pulses (EMP).\\\\ This paper presents a method to account for the neutron energy-dependent response of bubble detectors, enabling accurate conversion of bubble counts into neutron flux at the detector location. The proposed method is based on the accurate reconstruction of the response function using a surrogate model. The resulting model is convoluted with the (normalized) expected/measured neutron spectrum to obtain an effective measure of the bubble detector's response, herein referred to as effective $c$ or $c_\\text{eff}$. This effective value for the response is energy-independent after the convolution. In this way, our approach includes the spectral distribution of neutrons arriving at the detector to determine the integral neutron flux. Analyzing our experimental results obtained at the DRACO PW laser and comparing the results to previously used methods to obtain neutron fluxes from bubble detectors returns a reduction in neutron flux of up to \\SI{31}{\\%}. Results from the method detailed in this paper agree with in-depth experimental setup Monte Carlo simulations, with deviations of less than \\SI{10}{\\%}. We furthermore discuss the inherent limitations of our method with regard to its uncertainty and highlight the influence of neutron scattering in bubble detector measurements. For our experimental setup at the DRACO laser, up to \\SI{47}{\\%} of the detected neutrons arrive at the detector after undergoing at least one scattering event.",
  "authors": [
    "Stefan Scheuren",
    "Maria Angeles Millán-Callado",
    "Jonas Kohl",
    "Tim T. Jäger",
    "Markus Roth",
    "Christian Rödel",
    "Aaron Alejo",
    "Florian Kroll",
    "Karl Zeil",
    "Arnd Junghans",
    "Carlos Guerrero",
    "Benedikt Schmitz"
  ],
  "published": "2025-08-20T06:35:34Z",
  "updated": "2025-08-20T06:35:34Z",
  "categories": [
    "physics.ins-det",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det"
}