{
  "arxiv_id": "2512.21594v1",
  "url": "https://arxiv.org/abs/2512.21594v1",
  "pdf_url": "https://arxiv.org/pdf/2512.21594v1.pdf",
  "title": "Proposal for energy modulation to demodulation in seeded free-electron lasers",
  "abstract": "Laser manipulation plays a critical role in precisely tailoring relativistic electron beams through energy modulation, enabling the generation of coherent, intense, and ultrashort radiation in accelerator-based light sources such as synchrotron radiation facilities and free-electron lasers (FELs). However, laser-induced energy modulation inevitably degrades electron beam quality by increasing energy spread. In this paper, a straightforward yet practical implementation method for verifying the electron beam demodulation process in seeded FELs is proposed. The method employs a dedicated demodulation undulator system, referred to as a demodulator, equipped with a phase shifter. Both one-dimensional analytical models and three-dimensional simulations demonstrate that introducing a $π$ phase shift in the demodulator enables simultaneous energy modulation and demodulation using only a single seed laser. Under optimized conditions with weak initial modulation, simulation results indicate that the energy modulation can be substantially reduced or nearly eliminated. With increasing laser intensity, the modulation amplitude is significantly suppressed by more than an order of magnitude, effectively mitigating energy spread degradation. The residual energy modulation can be characterized using complementary diagnostic techniques: the coherent undulator radiation method combined with the dispersion scan method. The proposed method is expected to enable precise control over electron beam energy modulation, potentially facilitating the development of high-repetition-rate, fully coherent X-ray sources with improved electron beam quality preservation.",
  "authors": [
    "Hanxiang Yang",
    "Nanshun Huang",
    "Zipeng Liu",
    "Shengbin Ye",
    "Wencai Cheng",
    "Shudong Zhou",
    "Cheng Yu",
    "Tao Liu",
    "Haixiao Deng"
  ],
  "published": "2025-12-25T09:19:59Z",
  "updated": "2025-12-25T09:19:59Z",
  "categories": [
    "physics.acc-ph"
  ],
  "primary_category": "physics.acc-ph"
}