{
  "arxiv_id": "2512.21286v1",
  "url": "https://arxiv.org/abs/2512.21286v1",
  "pdf_url": "https://arxiv.org/pdf/2512.21286v1.pdf",
  "title": "Impurity peaking of SPARC H-modes: a sensitivity study on physics and engineering assumptions",
  "abstract": "In this paper, an overview of the impurity transport for three H-mode plasmas in the upcoming SPARC tokamak has been provided. The simulations have been performed within the ASTRA+STRAHL framework, using FACIT and TGLF-SAT2 to predict, respectively, neoclassical and turbulent core transport, while a neural network trained on EPED simulations has been employed to calculate the pedestal height and width self-consistently. A benchmark with previous simulations at constant impurity fraction has been provided for three H-modes, spanning different plasma current and magnetic field values. For a scenario, additional simulations have been performed to account for uncertainties in the modeling assumptions. The predictions are nearly insensitive to changes in the top of pedestal W concentrations. Varying the Ar pedestal concentration has shown a small effect on the impurity peaking and nearly constant fusion gain values, due to multiple effects on pedestal pressure, main ion dilution and density peaking. The inclusion of rotation in ASTRA simulations has shown minimal impact on confinement and impurity transport predictions. An exploratory study has been provided with a first set of simulations treating D and T separately, experiencing a maximum fusion power at 55-45% DT fuel composition, and an asymmetric distribution with respect to the D concentration. All the results, including sensitivity scans of toroidal velocity and ion temperature and density gradients, highlighted that turbulent impurity transport prevails on the neoclassical component, aligning with previous ITER predictions, and suggesting that next generation devices like SPARC, operating at low collisionality, will experience low W accumulation.",
  "authors": [
    "Marco Muraca",
    "Pablo Rodriguez-Fernandez",
    "Joe Hall",
    "Nathaniel T. Howard",
    "Daniel Fajardo",
    "Giovanni Tardini",
    "Benedikt Zimmermann",
    "Thomas Body"
  ],
  "published": "2025-12-24T17:08:46Z",
  "updated": "2025-12-24T17:08:46Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}