{
  "arxiv_id": "2512.21122v1",
  "url": "https://arxiv.org/abs/2512.21122v1",
  "pdf_url": "https://arxiv.org/pdf/2512.21122v1.pdf",
  "title": "Quantum Origin of Classical Background Fields from Coherent States: A First-Principles Formulation in QED",
  "abstract": "Classical background electromagnetic fields are routinely employed in quantum electrodynamics to describe a wide range of physical situations, from laser-matter interactions to strong-field phenomena. In this work, we present a first-principles formulation that clarifies the quantum origin of such classical background fields in QED by systematically deriving them from coherent states of the electromagnetic field.   Abstract Starting from the operator formulation of QED, we show how scattering amplitudes between coherent states naturally lead to an effective description in terms of background fields, while maintaining a clear separation between the coherent laser mode and other quantized photon degrees of freedom. This framework allows one to consistently incorporate effects beyond the fixed background approximation, such as depletion and backreaction, without assuming any particular field strength or intensity regime.   Abstract We further demonstrate how the conventional generating functional with a prescribed background field emerges as a limiting case, corresponding to fixed coherent state boundary conditions. The path integral representation is then obtained as a reformulation of the same underlying Heisenberg picture amplitudes, providing a unified view of operator-based and functional approaches.   Abstract Our results establish a general and intensity-independent foundation for QED with coherent background fields, within which the standard formulations of strong-field QED arise as well-defined special cases.",
  "authors": [
    "Keita Seto"
  ],
  "published": "2025-12-24T11:49:53Z",
  "updated": "2025-12-24T11:49:53Z",
  "categories": [
    "physics.plasm-ph",
    "hep-ph",
    "physics.optics",
    "quant-ph"
  ],
  "primary_category": "physics.plasm-ph"
}