{
  "arxiv_id": "2602.12090v1",
  "url": "https://arxiv.org/abs/2602.12090v1",
  "pdf_url": "https://arxiv.org/pdf/2602.12090v1.pdf",
  "title": "Unconditional full vector magnetometry using spin selectivity in Nitrogen Vacancy centers in diamond",
  "abstract": "Quantum sensors based on nitrogen vacancy (NV) centers in diamond have been a central topic in the sensing community for more than a decade. The extraordinary properties at room temperature of the spin system in diamond have made it one of the most prominent quantum platforms for the development of commercial quantum sensors. In particular, the sensitivity of the electronic spin in NV centers has made diamond-based magnetic sensors of special interest for their potential application in medical, industrial or navigation solutions. However, the use of these sensors for universal vector magnetometry was constrained by the need for previous knowledge on the field being measured to fully exploit their benefits. In this work, we show a method to perform unconditional vector magnetometry without the need of external information on the magnetic field, based only on the spatial arrangement of the diamond and the microwave antenna combination. While previous NV-based vector magnetometry methods require partial knowledge of the magnetic field (e.g. a calibrated bias field), we exploit the possibilities of selecting particular directions of the spins in the diamond with elliptically polarized microwave fields. We prove that our method allows to estimate both magnitude and direction of external magnetic fields without further assumptions or constraints.",
  "authors": [
    "Asier Mongelos-Martinez",
    "Jason Tarunesh Francis",
    "Julia Bertero-DiTella",
    "Geza Giedke",
    "Gabriel Molina-Terriza",
    "Ruben Pellicer-Guridi"
  ],
  "published": "2026-02-12T15:42:31Z",
  "updated": "2026-02-12T15:42:31Z",
  "categories": [
    "quant-ph",
    "physics.app-ph",
    "physics.ins-det",
    "physics.optics"
  ],
  "primary_category": "quant-ph"
}