{
  "arxiv_id": "2602.09205v1",
  "url": "https://arxiv.org/abs/2602.09205v1",
  "pdf_url": "https://arxiv.org/pdf/2602.09205v1.pdf",
  "title": "Development of a Reduced Multi-Fluid Equilibrium Model and Its Application to Proton-Boron Spherical Tokamaks",
  "abstract": "Proton-Boron fusion requires extreme ion temperatures and robust confinement, making Spherical Tokamaks (ST) with high-power neutral beam injection primary candidates. In these devices, strong toroidal rotation and the large mass disparity between protons and boron ions drive complex multi-fluid effects - specifically centrifugal species separation and electrostatic polarization - that standard single-fluid magnetohydrodynamic (MHD) models fail to capture. While comprehensive multi-fluid models are often numerically stiff, we develop a reduced model balancing physical fidelity with computational robustness. By retaining dominant toroidal rotation and self-consistent potential while neglecting poloidal inertia and pressure anisotropy, the model couples a generalized Grad-Shafranov equation with species-specific Bernoulli relations and a quasi-neutrality constraint. The model is applied to two representative p-B ST configurations: the experimental EHL-2 and reactor-scale EHL-3B. Simulation results demonstrate that equilibrium modifications are governed by the ion Mach number ($M$). In the low-rotation regime ($M < 0.5$), multi-fluid effects are weak and solutions approach the single-fluid limit. However, at $M > 2$, strong centrifugal forces drive significant boron accumulation at the low-field side (LFS) and generate an internal electrostatic potential on the order of 10 kV. These findings confirm the necessity of multi-fluid modeling for accurate p-$^{11}$B reactor design and establish a theoretical foundation for future investigations into stability, transport, and free-boundary dynamics.",
  "authors": [
    "Huasheng Xie",
    "Xingyu Li",
    "Jiaqi Dong",
    "Zhiwei Ma",
    "Yunfeng Liang",
    "Yuejiang Shi",
    "Wenjun Liu",
    "Yueng-Kay Martin Peng",
    "Lai Wei",
    "Zhengxiong Wang",
    "Hanyue Zhao"
  ],
  "published": "2026-02-09T21:16:59Z",
  "updated": "2026-02-09T21:16:59Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}