{
  "arxiv_id": "2602.11375v1",
  "url": "https://arxiv.org/abs/2602.11375v1",
  "pdf_url": "https://arxiv.org/pdf/2602.11375v1.pdf",
  "title": "Using a 4-megapixel hybrid photon counting detector for fast, lab-based nanoscale x-ray tomography",
  "abstract": "Hybrid photon counting detectors (HPCDs) have unlocked new capabilities for x-ray-based measurements at synchrotrons around the world in the last 30 years. By leveraging independently optimized sensor and readout layers, they offer high quantum efficiency ($> 80 \\%$), ultra-low dark counts, sub-pixel point-spread function, and high count rates ($> 10^{6}$ counts per pixel per second). Furthermore, their small pixel size and large active area endow them with excellent coverage and resolution for both real-space and reciprocal space imaging. Here, we demonstrate that HPCDs are also well-suited for laboratory-based nanoscale x-ray tomography (nano-xCT). We perform nano-xCT on an integrated circuit fabricated at the 130-nm node and produce a 3D reconstruction with 40 times more photons collected 20 times faster than in this group's previous work, for an overall speedup of 800$\\times$. We review the technical considerations of using an HPCD for tabletop tomography. We quantify our reconstruction image quality using well-established metrics, including the modulation transfer function (MTF), Fourier shell correlation (FSC), and contrast-to-noise (CNR), to validate our choice of experimental parameters that provide sufficient resolution and imaging speed. Using these metrics, we determine that even under current experimental conditions, 160 nm wiring features are reconstructed at 75-80 nm spatial resolution.",
  "authors": [
    "Jordan Fonseca",
    "Zachary H. Levine",
    "Joseph W. Fowler",
    "Felix H. Kim",
    "Galen O'Neil",
    "Nathan J. Ortiz",
    "John Henry Scott",
    "Daniel S. Swetz",
    "Paul Szypryt",
    "Andras E. Vladar",
    "Nathan Nakamura"
  ],
  "published": "2026-02-11T21:08:40Z",
  "updated": "2026-02-11T21:08:40Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}