{
  "arxiv_id": "2512.19341v4",
  "url": "https://arxiv.org/abs/2512.19341v4",
  "pdf_url": "https://arxiv.org/pdf/2512.19341v4.pdf",
  "title": "Optimization of laser-driven proton acceleration in a near-critical-density plasma",
  "abstract": "Optimizing laser and plasma parameters is crucial for enhancing accelerated proton energy in laser-driven proton acceleration with finite laser energy for applications such as cancer therapy. Tight focusing plays a significant role in improving laser-driven proton acceleration, which is generally believed as a result of the enhancement of laser intensity. However, we find that even at a fixed laser intensity, reducing the focal spot size still enhances the proton energy. Through particle-in-cell simulations and theoretical modeling, we find that at a small spot size (0.8 μm), the maximum proton energy is enhanced by 56.3% compared to that obtained at a conventional spot size (3 μm). This improvement is attributed to the dominance of ponderomotive-force-driven electrons at reduced spot sizes, which generate stronger charge-separation fields that propagate at higher velocities. Furthermore, to optimize proton acceleration, we analytically derive an ideal plasma density profile that promotes phase-stable proton acceleration, yielding an additional energy increase of 61.3% over the case of a tightly focused laser interacting with a planar target of uniform density. These findings remain robust under parameter variations, indicating that advanced focusing techniques combined with optimized plasma profiles could relax the demand for high laser energies, thereby reducing the reliance on large-scale laser facilities in medical and scientific applications.",
  "authors": [
    "Guanqi Qiu",
    "Qianyi Ma",
    "Deji Liu",
    "Dongchi Cai",
    "Zheng Gong",
    "Yinren Shou",
    "Jinqing Yu",
    "Xueqing Yan"
  ],
  "published": "2025-12-22T12:36:48Z",
  "updated": "2026-01-11T03:13:39Z",
  "categories": [
    "physics.plasm-ph",
    "physics.acc-ph"
  ],
  "primary_category": "physics.plasm-ph"
}