{
  "arxiv_id": "2601.05393v1",
  "url": "https://arxiv.org/abs/2601.05393v1",
  "pdf_url": "https://arxiv.org/pdf/2601.05393v1.pdf",
  "title": "Impact of Cold Noise on the tracking performance of ATLAS ITk short strip barrel modules using a charged particle beam",
  "abstract": "The inner tracking system of the ATLAS experiment will be upgraded to a full silicon detector in 2030 for HL-LHC. The new tracking system is called ITk, the Inner Tracker. It is required to be operable with efficiency higher than 99\\% and noise hit occupancy smaller than 0.1\\%. During the pre-production phase of the ITk project, many short-strip modules were observed to exhibit so-called \"Cold Noise (CN)\", wherein clusters of strips displayed very high noise when the modules were operated at temperatures below~$-35\\degree$C. To investigate the CN impact and ensure the quality of module production, huge amount of effort have been put in by the collaboration. This paper focuses on the impact of CN on the tracking performance by examining two short strip modules that exhibit CN: one is non-irradiated, while the other one has been irradiated to the maximum expected end-of-lifetime fluence. For each module, the global and single strip tracking performance are evaluated.",
  "authors": [
    "Tony Affolder",
    "Jan-Hendrik Arling",
    "Sten Astrand",
    "Ilyas Benaoumeur",
    "Jakub Bucko",
    "Sergio Diez Cornell",
    "Bruce Joseph Gallop",
    "Navid Ghorbanian",
    "Yajun He",
    "Cole Michael Helling",
    "Nigel Hessey",
    "Lennart Huth",
    "Callan Jessiman",
    "Christoph Thomas Klein",
    "John Stakely Keller",
    "Jiri Kroll",
    "Jiri Kvasnicka",
    "Konstantin Mauer",
    "Alexandra Murphy",
    "Anne-Luise Poley",
    "Dilia Maria Portillo Quintero",
    "Peter Phillips",
    "Radek Privara",
    "Eduardo Torres Reoyo",
    "Pavel Tuma",
    "Matt Warren"
  ],
  "published": "2026-01-08T21:32:43Z",
  "updated": "2026-01-08T21:32:43Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}