{
  "arxiv_id": "2601.05321v1",
  "url": "https://arxiv.org/abs/2601.05321v1",
  "pdf_url": "https://arxiv.org/pdf/2601.05321v1.pdf",
  "title": "On the gravitational stratification of multi-fluid-multi-species plasma",
  "abstract": "Context. The solar atmosphere is gravitationally stratified and consists of several layers at temperatures different by orders of magnitude. Consequently, the solar atmospheric plasma changes from weakly ionized in the photosphere, partially ionized in the chromosphere, to eventually fully ionized in the corona. However, it is still not trivial to integrate ionization and recombination processes into multi-fluid solar plasma models with gravitational stratification. Aims. We intend to provide a method for constructing multi-fluid-multi-species gravitational stratification that satisfies ionization equilibrium and hydrostatic equilibrium at the same time, avoiding causing non-physical disturbances and numerical instability due to initial in-equilibria. Methods. We assume that collisional interactions between fluids are sufficient for coupling all fluids when there is no high-frequency external driving force imposed. Ionization fractions can be (I) calculated assuming ionization in statistical equilibrium at any given temperature, or (II) extracted from other atmospheric models. A simple numerical integration routine is then designed and used to construct multi-fluid-multi-species gravitational stratifications. Results. A gravitational stratification constructed using the present numerical integration routine can be in hydrostatic equilibrium with any given ionization fractions of multi-species plasmas. Meanwhile, without any dynamic driving force, fluid decoupling appears in the transition region of the constructed stratification, while the total velocity of all fluids remains zero. Conclusions. A gravitational stratification constructed using the present routine can be used in multi-fluid-multi-species models to study specific dynamics without being affected by initial in-equilibria.",
  "authors": [
    "F. Zhang",
    "J. Martínez-Sykora",
    "Q. M. Wargnier",
    "V. H. Hansteen"
  ],
  "published": "2026-01-08T19:00:14Z",
  "updated": "2026-01-08T19:00:14Z",
  "categories": [
    "astro-ph.SR",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.SR"
}