{
  "arxiv_id": "2601.05357v1",
  "url": "https://arxiv.org/abs/2601.05357v1",
  "pdf_url": "https://arxiv.org/pdf/2601.05357v1.pdf",
  "title": "Dispersive Properties of MHD Waves in the Expanding Solar Wind for a Parker Spiral Geometry",
  "abstract": "In this work, we quantify the effects of solar wind expansion on the dispersive properties of the three normal modes of ideal MHD using the Expanding Box Model, under a background magnetic field that follows the Parker spiral geometry. From the linearized MHD-EBM equations, we construct the dispersion tensor and derive analytical expressions for the eigenfrequencies $ω(k,R)$, magnetic compressibility $C_B$, and the ratio of the parallel electric field to the perpendicular magnetic field $|δE_\\parallel|/|δB_\\perp|$ of the magnetosonic modes to quantify how radial solar wind expansion reshapes the character of compressive fluctuations in the solar wind. Magnetic compressibility increases with heliocentric distance, and this trend shows a better alignment with in-situ observations when expansion is included from the MHD-EBM framework. $C_B$ shows a well-defined minimum at small radii and then increases linearly with distance, which naturally reproduces the observed transition from Alfvénic to compressive fluctuations between $\\sim$0.3-1 AU. The ratio $|δE_\\parallel|/|δB_\\perp|$ reveals opposite behaviors for the fast and slow modes: while the fast mode becomes more electrostatic with increasing distance, the slow mode evolves to a more magnetically dominated character. Expansion reduces the growth of their electromagnetic/compressive balance at large radii. Our results demonstrate that solar wind expansion actively redistributes energy between magnetically compressive modes and purely transverse fluctuations with respect to the background magnetic field, playing a major role in shaping the radial evolution of wave dynamics throughout the inner heliosphere.",
  "authors": [
    "Sebastián Saldivia",
    "Felipe Asenjo",
    "Pablo S. Moya"
  ],
  "published": "2026-01-08T20:18:47Z",
  "updated": "2026-01-08T20:18:47Z",
  "categories": [
    "astro-ph.SR",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.SR"
}