{
  "arxiv_id": "2601.05331v1",
  "url": "https://arxiv.org/abs/2601.05331v1",
  "pdf_url": "https://arxiv.org/pdf/2601.05331v1.pdf",
  "title": "Directed Nano-antennas for Laser Fusion",
  "abstract": "Why do we use nano-antennas for fusion? In three sentences: The present laser induced fusion plans use extreme mechanical shock compression to get one hotspot and then ignition. Still fusion burning spreads slower than expansion, and mechanical instabilities may also develop. With nano-antennas in radiation dominated systems, simultaneous ignition can be achieved in the whole target volume and there is no time left for mechanical instabilities. Ignition is achieved with protons accelerated in the direction of the nanoantennas that are orthogonal to the direction of laser irradiation.   Present laser fusion methods are based on extreme and slow mechanical compression with an ablator surface on the fuel target pellet to increase compression and eliminate penetration of laser electromagnetic energy into the target. This arises from a mistaken assumption, [1] that the detonation normal 4-vector should have vanishing time-like component, and this assumption eliminates the possibility to rapid or even simultaneous, radiation dominated detonations, (which are well known in the burning (or hadronization) of Quark Gluon Plasma).",
  "authors": [
    "FUSENOW",
    "NAPLIFE Collaborations",
    ":",
    "Zsuzsanna Márton",
    "Imene Benabdelghani",
    "Márk Aladi",
    "Judit Budai",
    "Aldo Bonasera",
    "Attila Bonyár",
    "Mária Csete",
    "Martin Greve",
    "Jan-Petter Hansen",
    "Gergely Hegedűs",
    "Ádám Inger",
    "Miklos Kedves",
    "István Papp",
    "Péter Rácz",
    "András Szenes",
    "Ágnes Szokol",
    "Dávid Vass",
    "Miklós Veres",
    "Konstantin Zsukovszki",
    "Tamás S. Bíró",
    "Norbert Kroó",
    "Laszlo P. Csernai"
  ],
  "published": "2026-01-08T19:20:01Z",
  "updated": "2026-01-08T19:20:01Z",
  "categories": [
    "physics.plasm-ph",
    "physics.optics"
  ],
  "primary_category": "physics.plasm-ph"
}