{
  "arxiv_id": "2601.05468v1",
  "url": "https://arxiv.org/abs/2601.05468v1",
  "pdf_url": "https://arxiv.org/pdf/2601.05468v1.pdf",
  "title": "Burst Intensification by Singularity Emitting Radiation in Laser Plasma",
  "abstract": "Burst Intensification by Singularity Emitting Radiation (BISER) appears as a bright temporally and spatially coherent Extreme Ultraviolet (XUV) and x-ray source driven by compact multi-terawatt femtosecond lasers in gas targets. There BISER originates from relativistic plasma singularities, so that the emission source size has a nanometer scale. The BISER x-ray yield quadratically depends on the driving laser power. BISER spectra have hundreds of electronvolt (eV) bandwidth embracing the 'water window' region (284 - 543 eV). Simulations predict that BISER pulses have durations close to the transform limit, which promises pulses shorter than the atomic unit of time (24 attoseconds). Based on the BISER brightness at ~20 terawatt laser power and the quadratic scaling, the brightness of BISER driven by petawatt-class lasers is predicted to exceed XUV free electron lasers. The BISER concept creates a new framework for a wide range of media emitting travelling waves capable of constructive interference, including gravitational waves. Here we review the BISER experimental discovery, its explanation based on the relativistic laser plasma simulations and catastrophe theory, experimental validation of the theoretical BISER model, proposal for imaging fast moving singularities, driving laser requirements, and future prospects emphasizing the driving laser wavelength scalability and possibility of terawatt attosecond coherent x-ray pulse generation.",
  "authors": [
    "Alexander S. Pirozhkov",
    "Timur Zh. Esirkepov",
    "Tatiana A. Pikuz",
    "Akito Sagisaka",
    "Koichi Ogura",
    "James K. Koga",
    "Andreas Bierwage",
    "Hiromitsu Kiriyama",
    "Shinichi Namba",
    "Sergei V. Bulanov",
    "Masaki Kando"
  ],
  "published": "2026-01-09T01:51:19Z",
  "updated": "2026-01-09T01:51:19Z",
  "categories": [
    "physics.plasm-ph",
    "physics.optics"
  ],
  "primary_category": "physics.plasm-ph"
}