{
  "arxiv_id": "2601.05397v1",
  "url": "https://arxiv.org/abs/2601.05397v1",
  "pdf_url": "https://arxiv.org/pdf/2601.05397v1.pdf",
  "title": "Enhanced Dark Matter Sensitivity using a Hybrid SiPM-SNSPD-Qubit Detector in Liquid Argon",
  "abstract": "We investigate novel strategies to extend the sensitivity of dark matter direct detection experiments to energy deposits well below the thresholds of conventional detectors. In liquid-argon time-projection chambers equipped with silicon photomultipliers (SiPMs), we show that improved optical readout, combined with a nuclear dielectric constant (NDC) correction to the WIMP nucleus interaction, enhances the response to low-momentum-transfer nuclear recoils. The NDC effectively amplifies the interaction strength at small recoil energies, increasing the expected ionization and scintillation yields without modifying the high-energy behavior constrained by calibration data. When coupled to SiPM based light collection, this mechanism lowers the effective detection threshold to the subKeV regime, significantly improving sensitivity to low-mass WIMPs and other weakly interacting particles. Complementarily, we present the design and projected performance of a qubit-based detector optimized for ultra-low-energy depositions. A novel two-chip architecture is employed to minimize signal dissipation, while quantum parity measurements enable enhanced single-phonon sensitivity. Full simulations of phonon propagation and quasiparticle dynamics demonstrate that energy deposits at the level of $\\gtrsim 30 meV$ can be detected with nearly unit efficiency and high energy resolution. This capability is expected to advance sensitivity to dark-matter scattering for masses $m_χ\\gtrsim 0.01 MeV$ by several orders of magnitude for both light and heavy mediators, and to enable competitive searches for axion and dark-photon absorption in the $0.04 - 0.2 eV$ mass range.",
  "authors": [
    "Faeq Abed",
    "Asmaa AlMellah",
    "Kareem Al-Jubouri",
    "Alex Lumoski"
  ],
  "published": "2026-01-08T21:37:35Z",
  "updated": "2026-01-08T21:37:35Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}