{
  "arxiv_id": "2601.05872v1",
  "url": "https://arxiv.org/abs/2601.05872v1",
  "pdf_url": "https://arxiv.org/pdf/2601.05872v1.pdf",
  "title": "Toward Quantitative Electric-Field Measurements of Inception Clouds in Nanosecond Discharges Using E-FISH Assisted by Machine Learning",
  "abstract": "This study investigates the spatio-temporal evolution of the electric field during the early stages of a nanosecond positive corona discharge in atmospheric-pressure air by combining time-resolved E-FISH measurements, machine-learning-assisted field inversion (based on a recently developed operator-learning model), and iCCD optical emission imaging. The objective is to quantitatively characterize the electric field in the vicinity of the high-voltage electrode during inception and the transition toward streamer formation. By averaging over a large number of discharge events and operating in a regime where the discharge remains statistically axisymmetric, the proposed approach enables reconstruction of the electric-field profiles with nanosecond resolution. The results show a rapid increase of the field during the first nanoseconds, followed by the formation of a shell-like structure exhibiting the highest reduced fields prior to destabilization. The reconstructed reduced electric-field magnitude reaches peak values in the range of approximately 230-270 Td, with an estimated uncertainty of about 20-30% associated with calibration and profile-shape effects. These values correspond to the regime where electron-impact excitation and photoionization processes become highly efficient, consistent with the observed transition from a stable inception cloud to streamer destabilization. After the onset of streamer branching, increasing asymmetry limits the applicability of the inversion, and the reconstructed fields represent averaged contributions rather than the local field at individual streamer heads. The methodology thus identifies the conditions under which quantitative E-field mapping is reliable and establishes a framework for extending electric-field diagnostics to the inception phase of nanosecond atmospheric discharges.",
  "authors": [
    "Mhedine Alicherif",
    "Edwin Sugeng",
    "Zhijan Yang",
    "Deanna A. Lacoste",
    "Tat Loon Chng"
  ],
  "published": "2026-01-09T15:49:13Z",
  "updated": "2026-01-09T15:49:13Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}