{
  "arxiv_id": "2601.05782v1",
  "url": "https://arxiv.org/abs/2601.05782v1",
  "pdf_url": "https://arxiv.org/pdf/2601.05782v1.pdf",
  "title": "Stray Field NMR: a powerful method to measure dynamics at the millisecond scale",
  "abstract": "Transport properties in fluids and confined systems play a central role across a wide range of natural and technological contexts, from geology and environmental sciences to biology, energy storage, and membrane-based separation processes. Nuclear Magnetic Resonance (NMR) provides a unique, non-destructive means to probe these properties through species-selective measurements of self-diffusion coefficients. While pulsed field gradient NMR (PFG-NMR) is routinely used, its access to diffusion times is typically limited to values no shorter than about 10 ms, restricting its applicability to systems with fast dynamics and long relaxation times. Diffusion NMR in a permanent magnetic field gradient (STRAFI) offers a complementary, multiscale approach, enabling diffusion measurements over an extended temporal window, from a few hundred microseconds to several tens of seconds. Despite its strong potential, this technique remains rarely implemented due to experimental and methodological challenges. In this work, we present a robust and versatile STRAFI-based methodology, including a specifically designed experimental setup, optimized pulse sequences, and rigorous data analysis, allowing accurate extraction of self-diffusion coefficients for a broad range of nuclei. The capabilities of the approach are illustrated through diverse applications, including the study of concentrated electrolytes using \"NMR-exotic\" nuclei ($^{35}$Cl, $^{79}$Br/$^{81}$Br, $^{127}$I, $^{17}$O) and the characterization of micrometre-scale porosity in membranes.",
  "authors": [
    "Lafon Suzanne",
    "Vedel Jeanne",
    "Teynier Clara",
    "Raj Mithalal Divyen",
    "Wzietek Pawel",
    "Zeghal Mehdi",
    "Judeinstein Patrick"
  ],
  "published": "2026-01-09T13:20:01Z",
  "updated": "2026-01-09T13:20:01Z",
  "categories": [
    "physics.chem-ph",
    "physics.ins-det"
  ],
  "primary_category": "physics.chem-ph"
}