[
  {
    "arxiv_id": "2508.11111v2",
    "url": "https://arxiv.org/abs/2508.11111v2",
    "pdf_url": "https://arxiv.org/pdf/2508.11111v2.pdf",
    "title": "First Light from Beam Neutrinos on an LAPPD in ANNIE",
    "abstract": "The Accelerator Neutrino Neutron Interaction Experiment (ANNIE) is both a physics experiment and a technology testbed for next-generation light-based neutrino detection. In this paper, we report the first demonstration of a fully integrated Large Area Picosecond Photodetector (LAPPD) operating in a running neutrino beam experiment. Particular focus is given to the design, commissioning, and successful deployment of the Packaged ANNIE LAPPD (PAL), a waterproof, self-triggering module incorporating fast waveform digitization and precision timing synchronized to the ANNIE detector subsystems. We identify beam-correlated LAPPD data frames consistent with charged-current neutrino interactions observed in multiple detector subsystems, establishing the first detection of neutrino-induced Cherenkov light with an LAPPD. These results validate the system-level performance of LAPPDs under realistic experimental conditions-including long-term stability, timing synchronization, and event matching with conventional PMT and muon detector systems-marking a critical step toward their deployment in future large-scale neutrino and particle detectors.",
    "authors": [
      "B. W. Adams",
      "S. Abubakar",
      "D. Ajana",
      "M. A. Aman",
      "M. Ascencio-Sosa",
      "A. Augusthy",
      "Z. Bagdasarian",
      "J. Beacom",
      "M. Bergevin",
      "D. Bick",
      "M. Breisch",
      "E. Brunner-Huber",
      "G. Caceres Vera",
      "S. Dazeley",
      "S. Deng",
      "S. Donnelly",
      "S. Doran",
      "E. Drakopoulou",
      "S. Edayath",
      "R. Edwards",
      "J. Eisch",
      "Y. Feng",
      "V. Fischer",
      "R. Foster",
      "S. Gardiner",
      "N. Goehlke",
      "S. Gokhale",
      "A. Gupta",
      "P. Hackspacher",
      "C. Hagner",
      "J. He",
      "B. Kaiser",
      "M. Kandemir",
      "J. Kautz",
      "F. Krennrich",
      "M. Kumar",
      "T. Lachenmaier",
      "F. Lemmons",
      "M. Lucas",
      "D. Maksimovic",
      "M. Malek",
      "J. Martyn",
      "A. Mastbaum",
      "C. McGivern",
      "J. Minock",
      "M. Nieslony",
      "C. Nguyen",
      "M. O'Flaherty",
      "G. D. Orebi Gann",
      "B. K. Ozdemir",
      "T. Pershing",
      "L. Pickard",
      "N. Poonthottathil",
      "E. Pottebaum",
      "C. Reyes",
      "B. Richards",
      "R. Rosero",
      "M. C. Sanchez",
      "D. T. Schmid",
      "M. Smy",
      "H. Sogarwal",
      "M. Stender",
      "A. Sutton",
      "R. Svoboda",
      "C. Sweeney",
      "E. Tiras",
      "M. Vagins",
      "V. Veeraraghavan",
      "J. Wang",
      "A. Weinstein",
      "M. Wetstein",
      "M. Wurm",
      "M. Yeh",
      "T. Zhang"
    ],
    "published": "2025-08-14T23:33:54Z",
    "updated": "2026-01-11T22:45:22Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2511.09960v3",
    "url": "https://arxiv.org/abs/2511.09960v3",
    "pdf_url": "https://arxiv.org/pdf/2511.09960v3.pdf",
    "title": "High-throughput Parasitic-independent Probe Thermal Resistance Calibration for Robust Thermal Mapping with Scanning Thermal Microscopy",
    "abstract": "Nanostructured materials, critical for thermal management in semiconductor devices, exhibit a strong size dependence in thermal transport. Specifically, studying the variation of thermal resistance across grain boundaries is of critical importance in designing effective thermal interface materials for heterogeneous integration. Frequency-domain Thermoreflectance (FDTR)-based techniques can provide thermal resistance mapping in the micrometer (μm) length scale. Scanning Thermal Microscopy (SThM) has the potential for quantification of local thermal transport with orders of magnitude higher spatial resolution (< 100 nm). However, challenges in the accurate quantification of the raw signal to thermal conductivity and surface sensitivity limit its widespread adoption as a characterization standard for understanding nanoscale heat transport and defect-mediated thermal properties modulation in nanostructured films. Here, we introduce a circuit-based probe thermal resistance (Rp) calibration technique that is independent of any parasitic heat transport pathways; thus, the calibration allows accurate determination of the heat dissipated from the SThM probe and the resulting tip temperature increase, thereby enabling extraction of the local thermal resistance of the film. In this study, SThM achieved sub-100 nm spatial resolution in mapping thermal resistance across a 15 nm-thick Al film deposited via e-beam evaporation on SiO2 substrate. Finally, the thermal resistance mapping is converted to thermal conductivity using the finite element modeling-based calibration technique, where the average of the pixel-level Rc values yields the effective thermal conductivity of 2.87 +/- 0.18 W/m.K, in good agreement with published theoretical frameworks explaining heat transport modes in ultra-thin Al.",
    "authors": [
      "Ram Munde",
      "Heng-Ray Chuang",
      "Raisul Islam"
    ],
    "published": "2025-11-13T04:42:28Z",
    "updated": "2026-01-11T19:54:16Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.07043v1",
    "url": "https://arxiv.org/abs/2601.07043v1",
    "pdf_url": "https://arxiv.org/pdf/2601.07043v1.pdf",
    "title": "PANDA-film: an automated system for electrodeposition of polymer thin films and their wetting analysis",
    "abstract": "Thin polymer films are widely used as functional and protective coatings. However, determining the composition and processing conditions that produce a desired function is a tedious process due to the large number of factors that must be considered and the manual nature of most synthesis and characterization methods. Self-driving labs (SDLs), or robotic systems that prepare and test materials samples, are designed to overcome this bottleneck by enabling the efficient exploration of complex parameter spaces. In this paper, we report the development and testing of the polymer analysis and discovery array (PANDA)-film, a modular SDL for electrochemically synthesizing polymer films and then determining their water contact angle as a measure of surface energy. The system is designed to be highly modular and based upon a lowcost gantry platform to facilitate adoption. In addition to validating fluid handling and electrochemical tasks, we introduce two novel modular capabilities that enable PANDA-film to run sustained campaigns to study the wetting properties of films: (1) an electromagnetic capping/decapping system to mitigate fluid evaporation, and (2) a top-down optical method to determine water contact angle based upon reflectance. These capabilities are validated by depositing and characterizing a poly(allyl methacrylate) (PAMA) film using electrodeposition of polymer networks (EPoN). Comprehensive details for replicating the hardware and software of PANDA-film are included.",
    "authors": [
      "Harley Quinn",
      "Gregory A. Robben",
      "Zhaoyi Zheng",
      "Jin Yan",
      "Yuanzhi Li",
      "Zhaoji Yang",
      "Maria Politi",
      "Nadya Peek",
      "Lilo Pozzo",
      "Jörg G. Werner",
      "Keith A. Brown"
    ],
    "published": "2026-01-11T19:38:17Z",
    "updated": "2026-01-11T19:38:17Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.06978v1",
    "url": "https://arxiv.org/abs/2601.06978v1",
    "pdf_url": "https://arxiv.org/pdf/2601.06978v1.pdf",
    "title": "Benchmarking Autonomy in Scientific Experiments: A Hierarchical Taxonomy for Autonomous Large-Scale Facilities",
    "abstract": "The transition from automated data collection to fully autonomous discovery requires a shared vocabulary to benchmark progress. While the automotive industry relies on the SAE J3016 standard, current taxonomies for autonomous science presuppose an owner-operator model that is incompatible with the operational rigidities of Large-Scale User Facilities. Here, we propose the Benchmarking Autonomy in Scientific Experiments (BASE) Scale, a 6-level taxonomy (Levels 0-5) specifically adapted for these unique constraints. Unlike owner-operator models, User Facilities require zero-shot deployment where agents must operate immediately without extensive training periods. We define the specific technical requirements for each tier, identifying the Inference Barrier (Level 3) as the critical latency threshold where decisions shift from scalar feedback to semantic digital twins. Fundamentally, this level extends the decision manifold from spatial exploration to temporal gating, enabling the agent to synchronise acquisition with the onset of transient physical events. By establishing these operational definitions, the BASE Scale provides facility directors, funding bodies, and beamline scientists with a standardised metric to assess risk, define liability, and quantify the intelligence of experimental workflows.",
    "authors": [
      "James Le Houx"
    ],
    "published": "2026-01-11T16:26:31Z",
    "updated": "2026-01-11T16:26:31Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mtrl-sci",
      "cs.AI",
      "cs.RO"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.06921v1",
    "url": "https://arxiv.org/abs/2601.06921v1",
    "pdf_url": "https://arxiv.org/pdf/2601.06921v1.pdf",
    "title": "Influence of bending parameters on crystalline undulator radiation peak stability for 530 MeV positron channelling",
    "abstract": "We investigate the stability of crystalline undulator radiation (CUR) peaks emitted by 530 MeV positron channelling in periodically bent C(110) crystals with varying bending amplitudes and bending periods. Relativistic molecular dynamics simulations were performed to quantify how these parameters affect the intensity and position of the CUR peak. The continuous potential approximation was used to identify isolines of constant peak energy, providing a reference for regions of spectral stability. MD results show that increasing the bending amplitude shifts the CUR peak to lower photon energies, while decreasing the period shifts it to higher energies, with both trends accompanied by enhanced dechannelling. For crystal parameters similar to recent experiments conducted at the MAinz MIkrotron (MAMI), the simulated CUR peak appears near 0.515 MeV. These results demonstrate that the CUR peak remains stable across a broad range of bending amplitudes and periods, establishing estimates of manufacturing tolerances for the design of gamma-ray crystal-based light sources.",
    "authors": [
      "Matthew D. Dickers",
      "Felipe Fantuzzi",
      "Nigel J. Mason",
      "Andrei V. Korol",
      "Andrey V. Solov'yov"
    ],
    "published": "2026-01-11T14:06:53Z",
    "updated": "2026-01-11T14:06:53Z",
    "categories": [
      "physics.acc-ph",
      "physics.app-ph",
      "physics.atom-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.06784v1",
    "url": "https://arxiv.org/abs/2601.06784v1",
    "pdf_url": "https://arxiv.org/pdf/2601.06784v1.pdf",
    "title": "Performance evaluation of Luxium Solutions BCF-XL wavelength-shifting fibers",
    "abstract": "We evaluate the performance of single-clad wavelength-shifting fibers newly developed by Luxium Solutions, BCF-92XL, BCF-9929AXL, and BCF-9995XL and compare them with the multi-clad Kuraray Y-11 fiber. The BCF-XL fibers exhibit faster decay times (92XL: $2.10\\pm0.01$ ns, 9929AXL: $2.10\\pm0.02$ ns, 9995XL: $2.41\\pm0.03$ ns) than Y-11 ($7.44\\pm0.06$ ns). The attenuation lengths are comparable to that of Y-11 within the measurement range up to 3.2 m. When coupled to an EJ-204 plastic scintillator, the BCF-XL fibers achieve superior time resolution while maintaining light yields comparable to those expected for a single-clad Y-11 fiber.",
    "authors": [
      "Tatsuki Yamazumi",
      "Yota Endo",
      "Shoma Kodama",
      "Kota Nakagiri",
      "Yasuhiro Nakajima",
      "Minoru Sekiyama",
      "Masashi Yokoyama"
    ],
    "published": "2026-01-11T05:51:55Z",
    "updated": "2026-01-11T05:51:55Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.19341v4",
    "url": "https://arxiv.org/abs/2512.19341v4",
    "pdf_url": "https://arxiv.org/pdf/2512.19341v4.pdf",
    "title": "Optimization of laser-driven proton acceleration in a near-critical-density plasma",
    "abstract": "Optimizing laser and plasma parameters is crucial for enhancing accelerated proton energy in laser-driven proton acceleration with finite laser energy for applications such as cancer therapy. Tight focusing plays a significant role in improving laser-driven proton acceleration, which is generally believed as a result of the enhancement of laser intensity. However, we find that even at a fixed laser intensity, reducing the focal spot size still enhances the proton energy. Through particle-in-cell simulations and theoretical modeling, we find that at a small spot size (0.8 μm), the maximum proton energy is enhanced by 56.3% compared to that obtained at a conventional spot size (3 μm). This improvement is attributed to the dominance of ponderomotive-force-driven electrons at reduced spot sizes, which generate stronger charge-separation fields that propagate at higher velocities. Furthermore, to optimize proton acceleration, we analytically derive an ideal plasma density profile that promotes phase-stable proton acceleration, yielding an additional energy increase of 61.3% over the case of a tightly focused laser interacting with a planar target of uniform density. These findings remain robust under parameter variations, indicating that advanced focusing techniques combined with optimized plasma profiles could relax the demand for high laser energies, thereby reducing the reliance on large-scale laser facilities in medical and scientific applications.",
    "authors": [
      "Guanqi Qiu",
      "Qianyi Ma",
      "Deji Liu",
      "Dongchi Cai",
      "Zheng Gong",
      "Yinren Shou",
      "Jinqing Yu",
      "Xueqing Yan"
    ],
    "published": "2025-12-22T12:36:48Z",
    "updated": "2026-01-11T03:13:39Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.06717v1",
    "url": "https://arxiv.org/abs/2601.06717v1",
    "pdf_url": "https://arxiv.org/pdf/2601.06717v1.pdf",
    "title": "Plasma Discharge Undulator: a novel concept for plasma-based radiation sources",
    "abstract": "Plasma discharge devices have recently emerged as compact and versatile tools for particle beam manipulation. Building upon the Active Plasma Lens (APL) and its curved extension, the Active Plasma Bending (ABP), this work introduces the concept of the Plasma Discharge Undulator (PDU). In a PDU, a high-current discharge within a capillary generates an azimuthal magnetic field providing strong linear focusing ($O(1)$ (kT/m)), while a controlled and periodical spatial modulation of the discharge axis acts as a geometric driving term. The resulting beam dynamics can be modeled as a forced harmonic oscillator, yielding a well-defined oscillation at wavelength $λ_{\\mathrm{PDU}}$, distinct from the natural betatron wavelength $λ_β$ related to APL focusing. Proper injection conditions result in the suppression of collective betatron oscillations, significantly reducing the intrinsic undulator strength spread typical of conventional plasma undulators, while allowing for matched beam transport thanks to APL strong focusing. Analytical models for particle trajectories and radiation emission are developed, and the one-dimensional requirements for free-electron laser (FEL) emission are evaluated, providing scaling relations and feasibility criteria for FEL operation in the proposed scheme. Theoretical estimates and multi-particle simulations indicate that the PDU can operate in the short-period regime ($λ_{\\mathrm{PDU}} = $ mm-cm) with tunable undulator strength $K_{\\mathrm{PDU}}$, supporting narrow-band radiation emission. The PDU thus provides a pathway toward miniaturized, tunable, fully-plasma-based light sources with enhanced control over focusing and spectral properties.",
    "authors": [
      "Andrea Frazzitta"
    ],
    "published": "2026-01-10T23:32:44Z",
    "updated": "2026-01-10T23:32:44Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.06494v1",
    "url": "https://arxiv.org/abs/2601.06494v1",
    "pdf_url": "https://arxiv.org/pdf/2601.06494v1.pdf",
    "title": "Constellation: The Autonomous Control and Data Acquisition System for Dynamic Experimental Setups",
    "abstract": "The operation of instruments and detectors in laboratory or beamline environments presents a complex challenge, requiring stable operation of multiple concurrent devices, often controlled by separate hardware and software solutions. These environments frequently undergo modifications, such as the inclusion of different auxiliary devices depending on the experiment or facility, adding further complexity. The successful management of such dynamic configurations demands a flexible and robust system capable of controlling data acquisition, monitoring experimental setups, enabling seamless reconfiguration, and integrating new devices with limited effort.   This paper presents Constellation, a flexible and network-distributed control and data acquisition software framework tailored to laboratory and beamline environments, that addresses the limitations of existing solutions. The framework is designed with a focus on extensibility, providing a streamlined interface for instrument integration. It supports efficient system setup via network discovery mechanisms, promotes stability through autonomous operational features, and provides comprehensive documentation and supporting tools for operators and application developers such as controllers and logging interfaces.   At the core of the architectural design is the autonomy of the individual components, called satellites, which can make independent decisions about their operation and communicate these decisions to other components. This paper introduces the design principles and framework architecture of Constellation, presents the available graphical user interfaces, shares insights from initial successful deployments, and provides an outlook on future developments and applications.",
    "authors": [
      "Simon Spannagel",
      "Stephan Lachnit",
      "Hanno Perrey",
      "Justus Braach",
      "Lene Kristian Bryngemark",
      "Erika Garutti",
      "Adrian Herkert",
      "Finn King",
      "Christoph Krieger",
      "David Leppla-Weber",
      "Linus Ros",
      "Sara Ruiz Daza",
      "Murtaza Safdari",
      "Luis G. Sarmiento",
      "Annika Vauth",
      "Håkan Wennlöf"
    ],
    "published": "2026-01-10T09:04:18Z",
    "updated": "2026-01-10T09:04:18Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1016/j.nima.2026.171279"
  },
  {
    "arxiv_id": "2512.24209v2",
    "url": "https://arxiv.org/abs/2512.24209v2",
    "pdf_url": "https://arxiv.org/pdf/2512.24209v2.pdf",
    "title": "Performance of an LYSO-Based Active Converter for a Photon Pair-Spectrometer aiming for 52.8 MeV photon detection in Future $μ^+ \\to e^+ γ$ Search Experiments",
    "abstract": "For future $μ^+ \\to e^+ γ$ search experiments with a branching-ratio sensitivity of $10^{-15}$, we are developing a photon pair-spectrometer employing an active LYSO converter, aiming at target resolutions of 30 ps in timing and 200 keV in energy measurement for detecting 52.8 MeV photons. The converter generates electron-positron pairs from incident photons while simultaneously measuring their energy deposition and timing. On the basis of simulation studies, we optimized the converter thickness and segment dimensions, and accordingly fabricated prototype LYSO segments. Their single-MIP detection performance was evaluated using an electron beam at the KEK PF-AR test beamline. The prototypes exhibited excellent performance, achieving a time resolution of 25 ps and a light yield of $10^4$ photoelectrons, both substantially surpassing the design requirements.",
    "authors": [
      "Sei Ban",
      "Lukas Gerritzen",
      "Fumihito Ikeda",
      "Toshiyuki Iwamoto",
      "Wataru Ootani",
      "Atsushi Oya",
      "Rei Sakakibara",
      "Rintaro Yokota"
    ],
    "published": "2025-12-30T13:22:15Z",
    "updated": "2026-01-10T07:17:31Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.06449v1",
    "url": "https://arxiv.org/abs/2601.06449v1",
    "pdf_url": "https://arxiv.org/pdf/2601.06449v1.pdf",
    "title": "Optimized Broadband Cryogenic Ferromagnetic Resonance Spectrometer using a Closed Cycle Refrigerator",
    "abstract": "We present a vector network analyzer (VNA) based broadband cryogenic ferromagnetic resonance (FMR) spectrometer, operating up to 20 GHz over a temperature range of 11 to 350 K. A cost effective architecture is implemented through the integration of a closed cycle refrigerator (CCR) and a custom fabricated grounded coplanar waveguide (GCPW), designed for broadband transmission and reliable cryogenic operation. The VNA calibration is performed prior to measurements to account for microwave background and transmission losses, enabling reliable extraction of FMR spectra across the full temperature / frequency range. The sensitivity of the spectrometer is benchmarked using a yttrium iron garnet (YIG) thin film, yielding well resolved resonances with narrow linewidths and high sensitivity.",
    "authors": [
      "Anna Merin Francis",
      "Sunil Nair"
    ],
    "published": "2026-01-10T06:20:29Z",
    "updated": "2026-01-10T06:20:29Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.05996v1",
    "url": "https://arxiv.org/abs/2601.05996v1",
    "pdf_url": "https://arxiv.org/pdf/2601.05996v1.pdf",
    "title": "Self-organization of local streamline structures and energy transfer rate in compressible plasma turbulence",
    "abstract": "We examine how local streamline topology and energy cascade rate self-organize in plasma turbulence for both compressible and incompressible regimes. Using a fully-compressible Hall-magnetohydrodynamic simulation, we quantify the subgrid-scale energy transfer and analyze its relationship to streamline structures by means of grandient tensor geometric invariants of the velocity field. Our results highlight how streamline topology is crucial for diagnosing turbulence: for nearly-incompressible fluctuations the energy is primarily transferred to smaller scales through strain-dominated and stable-vortical structures, while is back-transferred towards larger scales through unstable-vortical structures. Compressible fluctuations, on the contrary, do not show a clear topological selection of the energy transfer since the overall direction of the local cascade rate is found to be determined by the sign of $-\\nabla\\cdot u$ (plasma volumetric compression or expansion).",
    "authors": [
      "Simone Benella",
      "Virgilio Quattrociocchi",
      "Emanuele Papini",
      "Andrea Verdini",
      "Simone Landi",
      "Maria Federica Marcucci",
      "Giuseppe Consolini"
    ],
    "published": "2026-01-09T18:23:00Z",
    "updated": "2026-01-09T18:23:00Z",
    "categories": [
      "physics.space-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2601.05985v1",
    "url": "https://arxiv.org/abs/2601.05985v1",
    "pdf_url": "https://arxiv.org/pdf/2601.05985v1.pdf",
    "title": "Novel High-Radiopurity Doped Amorphous Silicon Resistors for Low-Background Detectors",
    "abstract": "We present the results of a study of lightly doped amorphous silicon used as a resistive medium for high-radiopurity resistors in nuclear and particle physics research instrumentation. Prototypes are produced for a Time Projection Chamber design for the nEXO neutrinoless double-beta decay search experiment that meet requirements for ultra-high radiopurity, good mechanical, cryogenic and high voltage performance, as well as useful vacuum ultraviolet (VUV) reflectivity. Further study is warranted to refine production methods and to confirm that the technology used here is useful for more general applications.",
    "authors": [
      "A. Anker",
      "P. C. Rowson",
      "K. Skarpaas",
      "S. Tsitrin",
      "I. J. Arnquist",
      "L. Kenneth S. Horkley",
      "L. Pagani",
      "T. D. Schlieder",
      "E. van Bruggen",
      "P. Kachru",
      "A. Pocar",
      "N. Yazbek"
    ],
    "published": "2026-01-09T18:06:12Z",
    "updated": "2026-01-09T18:06:12Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.05977v1",
    "url": "https://arxiv.org/abs/2601.05977v1",
    "pdf_url": "https://arxiv.org/pdf/2601.05977v1.pdf",
    "title": "Comment on Nuclear Fusion 66, 016012 (2026) and arXiv:2508.03561 by Richard Fitzpatrick, A Simple Model of Current Ramp-Up and Ramp-Down in Tokamaks",
    "abstract": "The article Nuclear Fusion \\textbf{66}, 016012 (2026) by Richard Fitzpatrick is based on fundamental errors in the physics of the poloidal magnetic flux in tokamaks. His paper was inspired by an article that I posted on arXiv in various versions [arXiv:2507.05456]. The September 9, 2025 version was submitted to the Physics of Plasmas, which flatly rejected the article. Before I can resubmit, the Physics of Plasmas stated that the issues with the Fitzpatrick article must be explained. Not only did Fitzpatrick make numerous fundamental errors in science, he totally misrepresented my views as clearly stated in my article and even more explicitly in email exchanges, called ``private communication\" in his paper. Enquiries were made to the journal Nuclear Fusion staring on November 24, 2025 of the consistency of Fitzpatrick's article with the scientific and ethical standards of the journal. On January 5, 2026, Nuclear Fusion said they had \"no evidence of intentional misrepresentation,\" but others may disagree after reading the emails. Both grants and the publication of an important paper make the public availability of this Comment urgent.",
    "authors": [
      "Allen H Boozer"
    ],
    "published": "2026-01-09T17:53:04Z",
    "updated": "2026-01-09T17:53:04Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.05901v1",
    "url": "https://arxiv.org/abs/2601.05901v1",
    "pdf_url": "https://arxiv.org/pdf/2601.05901v1.pdf",
    "title": "Data acquisition from high-rate detectors at MAX IV",
    "abstract": "At MAX IV pixelated area detectors are operated at high frame rates to take advantage of the X-ray beam properties available from the fourth generation synchrotron in scattering, diffraction and imaging applications. A variety of photon counting and charge integrating detectors and sCMOS cameras have been integrated into a common data acquisition (DAQ) system in which data are streamed to a central Kubernetes cluster, mounting an IBM Storage Scale (GPFS) file system. The DAQ system provides live feedback from the detectors/cameras and extends to enable on-the-fly data processing. Control system integration via Tango provides a standardised single interface for controlling all DAQ components. Starting from an overview of the detector types in use, we describe the design and implementation of the MAX~IV detector-DAQ system and report a quantitative study of its performance in terms of data throughput and detector operating rates.",
    "authors": [
      "Paul Bell",
      "Michele Cascella",
      "Felix Engelmann",
      "Thomas Eriksson",
      "Aleko Lilius",
      "Zdenek Matej",
      "Jeremy Metz",
      "Andrii Salnikov",
      "Clemens Weninger",
      "Meghdad Yazdi"
    ],
    "published": "2026-01-09T16:19:03Z",
    "updated": "2026-01-09T16:19:03Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.05886v1",
    "url": "https://arxiv.org/abs/2601.05886v1",
    "pdf_url": "https://arxiv.org/pdf/2601.05886v1.pdf",
    "title": "Dynamics of ion temperature gradient modes in burning plasma conditions in the presence of energetic particles",
    "abstract": "The interaction between energetic particles (EPs) and ion temperature gradient (ITG) modes is studied using the global particle in cell ORB5 code. In this work, we extend previous studies to a broader range of EP temperatures, including the burning plasma regime and to wider variety of EP distribution functions. Two main stabilization mechanisms are found to be effective in ITG stabilization confirming previous studies: direct dispersion relation modification (DDRM) effective only at intermediate EP temperatures and dilution effect (DE) which is independent of EP temperature and becomes dominant in burning plasma regime ($T_f > 50T_i$). The study is further extended to slowing-down EP distributions which in contrast exhibit no DDRM-related stabilization. The findings are further validated in an ITER pre-fusion operation scenario and additionally compared with electromagnetic effects. In this scenario EP stabilization is found to be weaker than $β$-stabilization. Overall, these results provide better understanding of EP-ITG interactions over a wider range of EP parameters relevant to burning plasma regime which is important for predicting turbulence and confinement in future devices such as ITER.",
    "authors": [
      "Roman Ivanov",
      "Alessandro Biancalani",
      "Alberto Bottino",
      "Didier Gossard",
      "Thomas Hayward-Schneider",
      "Alexey Mishchenko",
      "Ruoyuan Wu"
    ],
    "published": "2026-01-09T16:05:19Z",
    "updated": "2026-01-09T16:05:19Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.05880v1",
    "url": "https://arxiv.org/abs/2601.05880v1",
    "pdf_url": "https://arxiv.org/pdf/2601.05880v1.pdf",
    "title": "Non Destructive Testing",
    "abstract": "The contribution introduces the principles, methods, and applications of non-destructive testing in the context of particle accelerators and related technologies is presented. Both surface inspection methods (visual testing, penetrant testing, magnetic particle testing, eddy current testing) and volumetric methods (radiographic testing, ultrasonic testing) are presented, with examples drawn from CERN projects. Emphasis is placed on the capabilities, limitations, and practical considerations of each technique, highlighting their role in ensuring quality and safety during fabrication, procurement, and in-service inspections. The contribution also addresses standards, codes, and personnel qualification schemes, underlining their regulatory impact in fields such as pressure equipment and industrial piping. Finally, the importance of early integration of NDT into project planning is stressed, not only for compliance but also as a proactive quality and efficiency measure.",
    "authors": [
      "Gonzalo Arnau Izquierdo"
    ],
    "published": "2026-01-09T15:55:43Z",
    "updated": "2026-01-09T15:55:43Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.05872v1",
    "url": "https://arxiv.org/abs/2601.05872v1",
    "pdf_url": "https://arxiv.org/pdf/2601.05872v1.pdf",
    "title": "Toward Quantitative Electric-Field Measurements of Inception Clouds in Nanosecond Discharges Using E-FISH Assisted by Machine Learning",
    "abstract": "This study investigates the spatio-temporal evolution of the electric field during the early stages of a nanosecond positive corona discharge in atmospheric-pressure air by combining time-resolved E-FISH measurements, machine-learning-assisted field inversion (based on a recently developed operator-learning model), and iCCD optical emission imaging. The objective is to quantitatively characterize the electric field in the vicinity of the high-voltage electrode during inception and the transition toward streamer formation. By averaging over a large number of discharge events and operating in a regime where the discharge remains statistically axisymmetric, the proposed approach enables reconstruction of the electric-field profiles with nanosecond resolution. The results show a rapid increase of the field during the first nanoseconds, followed by the formation of a shell-like structure exhibiting the highest reduced fields prior to destabilization. The reconstructed reduced electric-field magnitude reaches peak values in the range of approximately 230-270 Td, with an estimated uncertainty of about 20-30% associated with calibration and profile-shape effects. These values correspond to the regime where electron-impact excitation and photoionization processes become highly efficient, consistent with the observed transition from a stable inception cloud to streamer destabilization. After the onset of streamer branching, increasing asymmetry limits the applicability of the inversion, and the reconstructed fields represent averaged contributions rather than the local field at individual streamer heads. The methodology thus identifies the conditions under which quantitative E-field mapping is reliable and establishes a framework for extending electric-field diagnostics to the inception phase of nanosecond atmospheric discharges.",
    "authors": [
      "Mhedine Alicherif",
      "Edwin Sugeng",
      "Zhijan Yang",
      "Deanna A. Lacoste",
      "Tat Loon Chng"
    ],
    "published": "2026-01-09T15:49:13Z",
    "updated": "2026-01-09T15:49:13Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.05782v1",
    "url": "https://arxiv.org/abs/2601.05782v1",
    "pdf_url": "https://arxiv.org/pdf/2601.05782v1.pdf",
    "title": "Stray Field NMR: a powerful method to measure dynamics at the millisecond scale",
    "abstract": "Transport properties in fluids and confined systems play a central role across a wide range of natural and technological contexts, from geology and environmental sciences to biology, energy storage, and membrane-based separation processes. Nuclear Magnetic Resonance (NMR) provides a unique, non-destructive means to probe these properties through species-selective measurements of self-diffusion coefficients. While pulsed field gradient NMR (PFG-NMR) is routinely used, its access to diffusion times is typically limited to values no shorter than about 10 ms, restricting its applicability to systems with fast dynamics and long relaxation times. Diffusion NMR in a permanent magnetic field gradient (STRAFI) offers a complementary, multiscale approach, enabling diffusion measurements over an extended temporal window, from a few hundred microseconds to several tens of seconds. Despite its strong potential, this technique remains rarely implemented due to experimental and methodological challenges. In this work, we present a robust and versatile STRAFI-based methodology, including a specifically designed experimental setup, optimized pulse sequences, and rigorous data analysis, allowing accurate extraction of self-diffusion coefficients for a broad range of nuclei. The capabilities of the approach are illustrated through diverse applications, including the study of concentrated electrolytes using \"NMR-exotic\" nuclei ($^{35}$Cl, $^{79}$Br/$^{81}$Br, $^{127}$I, $^{17}$O) and the characterization of micrometre-scale porosity in membranes.",
    "authors": [
      "Lafon Suzanne",
      "Vedel Jeanne",
      "Teynier Clara",
      "Raj Mithalal Divyen",
      "Wzietek Pawel",
      "Zeghal Mehdi",
      "Judeinstein Patrick"
    ],
    "published": "2026-01-09T13:20:01Z",
    "updated": "2026-01-09T13:20:01Z",
    "categories": [
      "physics.chem-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.chem-ph"
  },
  {
    "arxiv_id": "2601.05773v1",
    "url": "https://arxiv.org/abs/2601.05773v1",
    "pdf_url": "https://arxiv.org/pdf/2601.05773v1.pdf",
    "title": "Frascati 22 GeV Workshop Summary",
    "abstract": "This document summarizes the outcomes of the \"Science at the Luminosity Frontier: Jefferson Lab at 22 GeV\" workshop, held at the INFN Laboratori Nazionali di Frascati in December 2024. The primary goal of the workshop was to critically assess and refine the scientific case for a proposed energy upgrade of the Continuous Electron Beam Accelerator Facility (CEBAF) to 22 GeV. This document intends to capture the progress on developing the scientific case since the publication of a lengthy \"White Paper\" in summer 2024 signed by about 450 authors.",
    "authors": [
      "A. Accardi",
      "P. Achenbach",
      "A. Afanasev",
      "M. Albrecht",
      "A. C. Alvaro",
      "J. Arrington",
      "H. Avakian",
      "P. Barry",
      "A. Bashir",
      "M. Bashkanov",
      "M. Battaglieri",
      "S. A. Bogacz",
      "M. Boglione",
      "M. Bondi",
      "V. D. Burkert",
      "C. E. Carlson",
      "D. S. Carman",
      "A. Celentano",
      "M. Cerutti",
      "J. -P. Chen",
      "I. Cloet",
      "M. Contalbrigo",
      "A. D'Angelo",
      "L. Darme",
      "E. De Sanctis",
      "R. De Vita",
      "D. J. Dean",
      "F. Delcarro",
      "O. Denisov",
      "A. Deur",
      "P. Di Nezza",
      "C. Dilks",
      "S. Dobbs",
      "R. Dupre",
      "D. Dutta",
      "A. El Alaoui",
      "L. El Fassi",
      "L. Elouadrhiri",
      "A. Filippi",
      "N. Fomin",
      "L. Gan",
      "D. Gaskell",
      "D. I. Glazier",
      "S. Gonzalez-Solis",
      "R. W. Gothe",
      "F. -K. Guo",
      "N. Hammoud",
      "T. B. Hayward",
      "G. M. Huber",
      "N. Husken",
      "N. Kalantarians",
      "W. Y. Ke",
      "C. Keppel",
      "A. Kotzinian",
      "C. H. Leung",
      "S. Li",
      "A. Lung",
      "B. McKinnon",
      "T. Mineeva",
      "M. Mirazita",
      "V. I. Mokeev",
      "G. Montana",
      "R. Montgomery",
      "P. Moran",
      "C. Munoz Camacho",
      "S. Nakamura",
      "G. Niculescu",
      "I. Niculescu",
      "M. Nycz",
      "A. Osmond",
      "M. Ouillon",
      "R. Paremuzyan",
      "B. Parsamyan",
      "L. Pentchev",
      "R. Perrino",
      "A. Pilloni",
      "L. Polizzi",
      "J. W. Qiu",
      "M. Radici",
      "K. Raya",
      "M. Rinaldi",
      "C. D. Roberts",
      "L. Rossi",
      "P. Rossi",
      "N. Santiesteban",
      "M. Sargsian",
      "N. Sato",
      "S. Schadmand",
      "M. R. Shepherd",
      "K. Shirotori",
      "A. Simonelli",
      "M. Spreafico",
      "J. R. Stevens",
      "A. Szczepaniak",
      "H. Szumila-Vance",
      "A. Tadepalli",
      "Y. Tian",
      "A. Tyler",
      "S. Vallarino",
      "T. Vittorini",
      "C. Weiss",
      "D. Winney",
      "Z. Ye",
      "T. Yushkevych",
      "M. Zaccheddu",
      "Y. Zhou"
    ],
    "published": "2026-01-09T12:55:35Z",
    "updated": "2026-01-09T12:55:35Z",
    "categories": [
      "nucl-ex",
      "physics.acc-ph"
    ],
    "primary_category": "nucl-ex"
  },
  {
    "arxiv_id": "2601.05720v1",
    "url": "https://arxiv.org/abs/2601.05720v1",
    "pdf_url": "https://arxiv.org/pdf/2601.05720v1.pdf",
    "title": "Energy Bounds from Relative Magnetic Helicity in Spherical Shells",
    "abstract": "Relative magnetic helicity is commonly used in solar physics to avoid the well known gauge ambiguity of standard magnetic helicity in magnetically open domains. But its physical interpretation is difficult owing to the invocation of a reference field. For the specific case of spherical shell domains (with potential reference field), relative helicity may be written intrinsically in terms of the magnetic field alone, without the need to calculate the reference field or its vector potential. We use this intrinsic expression to prove that non-zero relative helicity implies lower bounds for both magnetic energy and free magnetic energy, generalizing the important Arnol'd inequality known for closed-field magnetic helicity. Further, we derive a stronger energy bound by spatially decomposing the relative helicity over a magnetic partition of the domain to obtain a new ideal invariant which we call unsigned helicity. The bounds are illustrated with analytical linear force-free fields (that maximize relative helicity for given boundary conditions) as well as a non-potential data-driven model of the solar corona. These bounds confirm that both relative helicity and the unsigned helicity can influence the dynamics in the solar corona.",
    "authors": [
      "Anthony R. Yeates",
      "Gunnar Hornig"
    ],
    "published": "2026-01-09T11:04:52Z",
    "updated": "2026-01-09T11:04:52Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR",
    "doi": "10.3847/1538-4357/ae30dd"
  },
  {
    "arxiv_id": "2601.05718v1",
    "url": "https://arxiv.org/abs/2601.05718v1",
    "pdf_url": "https://arxiv.org/pdf/2601.05718v1.pdf",
    "title": "Kineclinic magnetogenesis in relativistic collisionless plasmas",
    "abstract": "The relativistic momentum equation of a collisionless plasma is reformulated to describe the time evolution of canonical vorticity. Compared to the non-relativistic counterpart, an additional source term for canonical vorticity is identified, which embodies the misalignment between the fluid momentum and fluid velocity gradients. This kineclinic term breaks the frozen-in condition of canonical vorticity, thereby enabling generation or dissipation of magnetic fields and vorticity. We verify the role of this effect through particle-in-cell simulations of a modified Beltrami flow. Kineclinicity should be finite for all relativistic plasma systems due to the general lack of a functional relationship between fluid momentum and fluid velocity.",
    "authors": [
      "Modhuchandra Laishram",
      "Suresh Basnet",
      "Young Dae Yoon"
    ],
    "published": "2026-01-09T11:01:59Z",
    "updated": "2026-01-09T11:01:59Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.05704v1",
    "url": "https://arxiv.org/abs/2601.05704v1",
    "pdf_url": "https://arxiv.org/pdf/2601.05704v1.pdf",
    "title": "Conservative formulation of the drift-reduced fluid plasma model",
    "abstract": "A conservative formulation of the drift-reduced fluid plasma model is constructed by analytically inverting the implicit relation defining the polarisation velocity as a function of the time-derivative of the electric field. The obtained model satisfies exact conservation laws for energy, mass, charge and momentum, in arbitrary magnetic geometry, also when electromagnetic fluctuations are included.",
    "authors": [
      "Brenno De Lucca",
      "Paolo Ricci",
      "Micol Bassanini",
      "Sergio García Herreros",
      "Zeno Tecchiolli"
    ],
    "published": "2026-01-09T10:47:24Z",
    "updated": "2026-01-09T10:47:24Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.05855v2",
    "url": "https://arxiv.org/abs/2510.05855v2",
    "pdf_url": "https://arxiv.org/pdf/2510.05855v2.pdf",
    "title": "Studies of ultrafast dynamics in substrate-free nanoparticles at ELI using Timepix3 optical camera",
    "abstract": "We present a novel application of the Timepix3 optical camera (Tpx3Cam) for investigating ultrafast dynamics in substrate-free nanoparticles at the Extreme Light Infrastructure European Research Infrastructure Consortium (ELI ERIC). The camera, integrated into an ion imaging system based on a micro-channel plate (MCP) and a fast P47 scintillator, enables individual time-stamping of incoming ions with nanosecond timing precision and high spatial resolution. The detector successfully captured laser-induced ion events originating from free nanoparticles disintegrated by intense laser pulses. Owing to the broad size distribution of the nanoparticles (10-500 nm) and the variation in laser intensities within the interaction volume, the detected events range in occupancy from near-zero to extremely high, approaching the readout limits of the detector. By combining time-of-flight and velocity map imaging (VMI) techniques, detailed post-processing and analysis were performed. The results presented here focus on the performance of Tpx3Cam under high-occupancy conditions, which are of particular relevance to this study. These conditions approach the limitations imposed by the camera readout capabilities and challenge the effectiveness of standard post-processing algorithms. We investigated these limitations and associated trade-offs, and we present improved methods and algorithms designed to extract the most informative features from the data.",
    "authors": [
      "Dmitrij Ševaev",
      "Andrei Nomerotski",
      "Peter Švihra",
      "Keshav Sishodia",
      "Andreas Hult Roos",
      "Martin Albrecht",
      "Sivarama Krishnan",
      "Jakob Andreasson",
      "Maria Krikunova",
      "Eva Klimešová"
    ],
    "published": "2025-10-07T12:24:18Z",
    "updated": "2026-01-09T10:09:11Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.03264v2",
    "url": "https://arxiv.org/abs/2509.03264v2",
    "pdf_url": "https://arxiv.org/pdf/2509.03264v2.pdf",
    "title": "Universal Analytic Solution for the Quantum Transport of Structured Matter-Waves in Magnetic Optics",
    "abstract": "We present a closed-form analytic solution for the propagation of an arbitrary charged scalar state in a non-uniform magnetic field. The dynamics are governed by classical beam optics parameters (Courant-Snyder parameters), the Twiss functions, and phase advance, revealing a direct map between quantum evolution and its classical counterpart. The solution decomposes into three components, exhibiting a complex rotation dependent on the sign of the orbital angular momentum (OAM) projection, alongside an intrinsic distortion from interference governed by a generalized Gouy phase. For a relevant Glaser-type magnetic field and a half-blocked twisted electron, we demonstrate that asymmetry reveals interference-driven dynamics beyond rigid rotation. Our fully relativistic framework provides a practical tool for predicting beam behavior in particle accelerators and electron microscopes.",
    "authors": [
      "N. V. Filina",
      "S. S. Baturin"
    ],
    "published": "2025-09-03T12:29:08Z",
    "updated": "2026-01-09T09:17:32Z",
    "categories": [
      "quant-ph",
      "physics.acc-ph"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2509.05791v3",
    "url": "https://arxiv.org/abs/2509.05791v3",
    "pdf_url": "https://arxiv.org/pdf/2509.05791v3.pdf",
    "title": "Energy partitioning in electrostatic discharge with variable series load resistor",
    "abstract": "This paper presents an experimental investigation into the energy partitioning of quasi-static electrostatic discharge (ESD) events in air, a scenario in which the discharge occurs across a gap length that can be considered fixed. We systematically characterize the energy transferred to a series victim load across a broad range of resistances (0.1 to 10,000Ohm) and circuit parameters, including capacitance and gap length. Our results show that the fraction of stored energy delivered to the victim load is largely independent of gap length. We demonstrate that our extension of the classic Rompe-Weizel spark resistance model effectively predicts the scaling of this energy transfer, establishing a clear link between spark resistance and energy partitioning. These findings provide a predictive framework that should be valuable for guiding safety requirements for energetic materials and ignition scenarios and will inform the development of more accurate circuit models that can be applied to a wider range of ESD events such as those found in the electronics industry.",
    "authors": [
      "Claudia A. M. Schrama",
      "Calvin Bavor",
      "P. David Flammer",
      "Charles G. Durfee"
    ],
    "published": "2025-09-06T17:59:03Z",
    "updated": "2026-01-09T07:59:38Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.05541v1",
    "url": "https://arxiv.org/abs/2601.05541v1",
    "pdf_url": "https://arxiv.org/pdf/2601.05541v1.pdf",
    "title": "A Realistic Proportional-Integral RF Feedback Model for Longitudinal Beam Dynamics Simulation",
    "abstract": "Modern fourth-generation storage ring light sources predominantly utilize digital I/Q-based proportional-integral (PI) feedback for their radio-frequency (RF) systems. This paper introduces a dedicated PI feedback model implemented in the STABLE tracking code to enable accurate and fast longitudinal beam dynamics simulations. The model's key innovation lies in its treatment of the continuous generator current, which is discretized into electron-bunch-like charge pulses, while the cavity voltage is refreshed on an RF-cycle basis. This methodology offers a more physically accurate model of the beam-cavity-feedback coupling, providing a versatile tool for precise longitudinal beam dynamics studies in single- and multi-rf configurations.",
    "authors": [
      "Tianlong He",
      "Wenshu Liang",
      "Jincheng Xiao",
      "Xin Huang"
    ],
    "published": "2026-01-09T05:50:25Z",
    "updated": "2026-01-09T05:50:25Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.05492v1",
    "url": "https://arxiv.org/abs/2601.05492v1",
    "pdf_url": "https://arxiv.org/pdf/2601.05492v1.pdf",
    "title": "Similarity Theory and Scaling Networks for Electromagnetic Wave-Driven Plasmas",
    "abstract": "We demonstrate the scale-invariant behavior of electromagnetic wave-driven radio-frequency plasmas across different dimensional scales. Using two-dimensional electromagnetic particle-in-cell simulations, we show that plasma uniformity remains the same in similar discharges. Building on the concept of similarity laws, we develop scaling networks that effectively relate plasma parameters across varying operating conditions. These results establish a generalized similarity theory derived from the Boltzmann equation coupled with the full set of Maxwell equations, extending the theoretical framework of similarity laws into electromagnetic regimes.",
    "authors": [
      "Hanyang Li",
      "Yulia Sharova",
      "Denis Eremin",
      "Yangyang Fu"
    ],
    "published": "2026-01-09T02:47:38Z",
    "updated": "2026-01-09T02:47:38Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.05468v1",
    "url": "https://arxiv.org/abs/2601.05468v1",
    "pdf_url": "https://arxiv.org/pdf/2601.05468v1.pdf",
    "title": "Burst Intensification by Singularity Emitting Radiation in Laser Plasma",
    "abstract": "Burst Intensification by Singularity Emitting Radiation (BISER) appears as a bright temporally and spatially coherent Extreme Ultraviolet (XUV) and x-ray source driven by compact multi-terawatt femtosecond lasers in gas targets. There BISER originates from relativistic plasma singularities, so that the emission source size has a nanometer scale. The BISER x-ray yield quadratically depends on the driving laser power. BISER spectra have hundreds of electronvolt (eV) bandwidth embracing the 'water window' region (284 - 543 eV). Simulations predict that BISER pulses have durations close to the transform limit, which promises pulses shorter than the atomic unit of time (24 attoseconds). Based on the BISER brightness at ~20 terawatt laser power and the quadratic scaling, the brightness of BISER driven by petawatt-class lasers is predicted to exceed XUV free electron lasers. The BISER concept creates a new framework for a wide range of media emitting travelling waves capable of constructive interference, including gravitational waves. Here we review the BISER experimental discovery, its explanation based on the relativistic laser plasma simulations and catastrophe theory, experimental validation of the theoretical BISER model, proposal for imaging fast moving singularities, driving laser requirements, and future prospects emphasizing the driving laser wavelength scalability and possibility of terawatt attosecond coherent x-ray pulse generation.",
    "authors": [
      "Alexander S. Pirozhkov",
      "Timur Zh. Esirkepov",
      "Tatiana A. Pikuz",
      "Akito Sagisaka",
      "Koichi Ogura",
      "James K. Koga",
      "Andreas Bierwage",
      "Hiromitsu Kiriyama",
      "Shinichi Namba",
      "Sergei V. Bulanov",
      "Masaki Kando"
    ],
    "published": "2026-01-09T01:51:19Z",
    "updated": "2026-01-09T01:51:19Z",
    "categories": [
      "physics.plasm-ph",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.05447v1",
    "url": "https://arxiv.org/abs/2601.05447v1",
    "pdf_url": "https://arxiv.org/pdf/2601.05447v1.pdf",
    "title": "Robust Bilinear-Noise-Optimal Control for Gravitational-Wave Detectors: A Mixed LQG/$H_\\infty$ Approach",
    "abstract": "At its lowest frequencies, LIGO is limited by noise in its many degrees of freedom of suspended optics, which, in turn, introduce noise in the interferometer through their feedback control systems. Nonlinear interactions are a dominant source of low-frequency noise, mixing noise from multiple degrees of freedom. The lowest-order form is bilinear noise, in which the noise from two feedback-controlled subsystems multiplies to mask gravitational waves. Bilinear couplings require control trade-offs that simultaneously balance high- and low-frequency noise. Currently, there is no known lower limit to bilinear control noise. Here, we develop benchmark cost functions for bilinear noise and associated figures of merit. Linear-quadratic-Gaussian control then establishes aggressive feedback that saturates the lower bounds on the cost functions. We then develop a mixed LQG and $H_\\infty$ approach to directly compute stable, robust, and optimal feedback, using the LIGO's alignment control system as an example. Direct computations are fast while ensuring a global optimum. By calculating optimal robust control, it is possible to construct the lower bound on controls noise along the Pareto front of practical controllers for LIGO. This method can be used to drastically improve controls noise in existing observatories as well as to set subsystem control noise requirements for next-generation detectors with parameterized design.",
    "authors": [
      "Ian A. O. MacMillan",
      "Lee P. McCuller"
    ],
    "published": "2026-01-09T00:28:15Z",
    "updated": "2026-01-09T00:28:15Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "gr-qc"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.05397v1",
    "url": "https://arxiv.org/abs/2601.05397v1",
    "pdf_url": "https://arxiv.org/pdf/2601.05397v1.pdf",
    "title": "Enhanced Dark Matter Sensitivity using a Hybrid SiPM-SNSPD-Qubit Detector in Liquid Argon",
    "abstract": "We investigate novel strategies to extend the sensitivity of dark matter direct detection experiments to energy deposits well below the thresholds of conventional detectors. In liquid-argon time-projection chambers equipped with silicon photomultipliers (SiPMs), we show that improved optical readout, combined with a nuclear dielectric constant (NDC) correction to the WIMP nucleus interaction, enhances the response to low-momentum-transfer nuclear recoils. The NDC effectively amplifies the interaction strength at small recoil energies, increasing the expected ionization and scintillation yields without modifying the high-energy behavior constrained by calibration data. When coupled to SiPM based light collection, this mechanism lowers the effective detection threshold to the subKeV regime, significantly improving sensitivity to low-mass WIMPs and other weakly interacting particles. Complementarily, we present the design and projected performance of a qubit-based detector optimized for ultra-low-energy depositions. A novel two-chip architecture is employed to minimize signal dissipation, while quantum parity measurements enable enhanced single-phonon sensitivity. Full simulations of phonon propagation and quasiparticle dynamics demonstrate that energy deposits at the level of $\\gtrsim 30 meV$ can be detected with nearly unit efficiency and high energy resolution. This capability is expected to advance sensitivity to dark-matter scattering for masses $m_χ\\gtrsim 0.01 MeV$ by several orders of magnitude for both light and heavy mediators, and to enable competitive searches for axion and dark-photon absorption in the $0.04 - 0.2 eV$ mass range.",
    "authors": [
      "Faeq Abed",
      "Asmaa AlMellah",
      "Kareem Al-Jubouri",
      "Alex Lumoski"
    ],
    "published": "2026-01-08T21:37:35Z",
    "updated": "2026-01-08T21:37:35Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.05393v1",
    "url": "https://arxiv.org/abs/2601.05393v1",
    "pdf_url": "https://arxiv.org/pdf/2601.05393v1.pdf",
    "title": "Impact of Cold Noise on the tracking performance of ATLAS ITk short strip barrel modules using a charged particle beam",
    "abstract": "The inner tracking system of the ATLAS experiment will be upgraded to a full silicon detector in 2030 for HL-LHC. The new tracking system is called ITk, the Inner Tracker. It is required to be operable with efficiency higher than 99\\% and noise hit occupancy smaller than 0.1\\%. During the pre-production phase of the ITk project, many short-strip modules were observed to exhibit so-called \"Cold Noise (CN)\", wherein clusters of strips displayed very high noise when the modules were operated at temperatures below~$-35\\degree$C. To investigate the CN impact and ensure the quality of module production, huge amount of effort have been put in by the collaboration. This paper focuses on the impact of CN on the tracking performance by examining two short strip modules that exhibit CN: one is non-irradiated, while the other one has been irradiated to the maximum expected end-of-lifetime fluence. For each module, the global and single strip tracking performance are evaluated.",
    "authors": [
      "Tony Affolder",
      "Jan-Hendrik Arling",
      "Sten Astrand",
      "Ilyas Benaoumeur",
      "Jakub Bucko",
      "Sergio Diez Cornell",
      "Bruce Joseph Gallop",
      "Navid Ghorbanian",
      "Yajun He",
      "Cole Michael Helling",
      "Nigel Hessey",
      "Lennart Huth",
      "Callan Jessiman",
      "Christoph Thomas Klein",
      "John Stakely Keller",
      "Jiri Kroll",
      "Jiri Kvasnicka",
      "Konstantin Mauer",
      "Alexandra Murphy",
      "Anne-Luise Poley",
      "Dilia Maria Portillo Quintero",
      "Peter Phillips",
      "Radek Privara",
      "Eduardo Torres Reoyo",
      "Pavel Tuma",
      "Matt Warren"
    ],
    "published": "2026-01-08T21:32:43Z",
    "updated": "2026-01-08T21:32:43Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.05389v1",
    "url": "https://arxiv.org/abs/2601.05389v1",
    "pdf_url": "https://arxiv.org/pdf/2601.05389v1.pdf",
    "title": "Thermodynamics of driven systems via the Kuramoto-Sivashinsky equation",
    "abstract": "We examine the differences between the driven turbulence described by the Kuramoto-Sivashinsky (KS) equation and the second law of thermodynamics. A general velocity and entropy density system is analyzed with the unified thermodynamic algorithm of metriplectic dynamics, and we show that the positive spectra of the KS equation due to an external energy source prevent its metriplectic description. A variant of the KS equation is produced that monotonically generates an entropy, but the only equilibria of this variant system are spatially constant. Numerical experiments are performed comparing the evolution of the KS equation and its thermodynamic variant. The entropy of this thermodynamic system is increased further by the driving effects of the KS equation, reconciling the generation of entropy with the energy source of the KS equation. Further numerical experiments restrict the positive spectra in the KS equation to determine the effect on the system time evolution. While rescaling the growth rates of instabilities reproduces similar behavior on a slower time scale, introduction of individual positive spectra reproduces the formation of equilibria, relative equilibria, and a transition to chaos.",
    "authors": [
      "E. Hansen",
      "W. Barham",
      "P. J. Morrison"
    ],
    "published": "2026-01-08T21:30:59Z",
    "updated": "2026-01-08T21:30:59Z",
    "categories": [
      "nlin.CD",
      "physics.flu-dyn",
      "physics.plasm-ph"
    ],
    "primary_category": "nlin.CD"
  },
  {
    "arxiv_id": "2512.06122v3",
    "url": "https://arxiv.org/abs/2512.06122v3",
    "pdf_url": "https://arxiv.org/pdf/2512.06122v3.pdf",
    "title": "Using Open Source EDA Tools in ASICs for HEP: A Mixed Comparison",
    "abstract": "This work compares open-source electronic design automation tools with a commercial environment using three representative integrated circuit blocks in the IHP 130 nm open PDK: a common-mode noise filter, a finite-state machine, and a voltage-controlled oscillator. The study reports design effort and quality of results for digital logic, including area, power, and timing closure, and examines analog layout feasibility. For the finite-state machine at 50 MHz, the open-source flow reached 0.029 mm$^2$ (post-layout) and 4.37 mW (estimated) with 828 standard cells, whereas the commercial flow achieved 0.019 mm$^2$ and 2.00 mW with 497 cells, corresponding to increases of 53\\% in area and 118\\% in power. The common-mode noise filter totals 1.879 mm$^2$ with 1703 flip-flops at 50 MHz. The voltage-controlled oscillator occupies 0.0025 mm$^2$ and achieves a simulated maximum oscillation frequency of 2.65 GHz. The contribution is a side-by-side quantification of quality of results across digital and analog blocks in the IHP open PDK. The results indicate that open-source tools are viable for early prototyping, training, and collaboration, while commercial flows retain advantages in automation and quality of results when strict targets on power and area or precision analog layout are required.",
    "authors": [
      "Édney M. V. Freitas",
      "Nicolas Guimarães",
      "Rafael Maria",
      "Felipe Costa",
      "Guilherme Milani",
      "Bruno Sanches",
      "Wilhelmus Van Noije"
    ],
    "published": "2025-12-05T19:57:11Z",
    "updated": "2026-01-08T20:53:27Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/12/P12022"
  },
  {
    "arxiv_id": "2601.06215v1",
    "url": "https://arxiv.org/abs/2601.06215v1",
    "pdf_url": "https://arxiv.org/pdf/2601.06215v1.pdf",
    "title": "Improving TauFinder Reconstruction at a 10 TeV Muon Collider with the MAIA Detector Concept",
    "abstract": "This study aims to improve the TauFinder reconstruction algorithm for the MAIA detector concept. Through this work, we seek to increase the reconstruction efficiency and identification of hadronically decaying tau leptons. Through our work, we introduce a dynamic signal cone, known as a shrinking cone, which adjusts its size based on the transverse momentum of the tau candidate. In addition to the already studied one charged hadron and three charged hadron decay modes we extend TauFinder to include decays that consist of one charged hadron and up to two neutral pions. Furthermore, we have developed a tagger that prevents electrons being misidentified as one-prong tau candidates. Applying this tagger results in near-perfect electron rejection with negligible decrease in one-prong tau reconstruction efficiency.",
    "authors": [
      "Cyrus Kianian",
      "Moses Glassman",
      "Abdollah Mohammadi"
    ],
    "published": "2026-01-08T20:19:28Z",
    "updated": "2026-01-08T20:19:28Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "hep-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.05357v1",
    "url": "https://arxiv.org/abs/2601.05357v1",
    "pdf_url": "https://arxiv.org/pdf/2601.05357v1.pdf",
    "title": "Dispersive Properties of MHD Waves in the Expanding Solar Wind for a Parker Spiral Geometry",
    "abstract": "In this work, we quantify the effects of solar wind expansion on the dispersive properties of the three normal modes of ideal MHD using the Expanding Box Model, under a background magnetic field that follows the Parker spiral geometry. From the linearized MHD-EBM equations, we construct the dispersion tensor and derive analytical expressions for the eigenfrequencies $ω(k,R)$, magnetic compressibility $C_B$, and the ratio of the parallel electric field to the perpendicular magnetic field $|δE_\\parallel|/|δB_\\perp|$ of the magnetosonic modes to quantify how radial solar wind expansion reshapes the character of compressive fluctuations in the solar wind. Magnetic compressibility increases with heliocentric distance, and this trend shows a better alignment with in-situ observations when expansion is included from the MHD-EBM framework. $C_B$ shows a well-defined minimum at small radii and then increases linearly with distance, which naturally reproduces the observed transition from Alfvénic to compressive fluctuations between $\\sim$0.3-1 AU. The ratio $|δE_\\parallel|/|δB_\\perp|$ reveals opposite behaviors for the fast and slow modes: while the fast mode becomes more electrostatic with increasing distance, the slow mode evolves to a more magnetically dominated character. Expansion reduces the growth of their electromagnetic/compressive balance at large radii. Our results demonstrate that solar wind expansion actively redistributes energy between magnetically compressive modes and purely transverse fluctuations with respect to the background magnetic field, playing a major role in shaping the radial evolution of wave dynamics throughout the inner heliosphere.",
    "authors": [
      "Sebastián Saldivia",
      "Felipe Asenjo",
      "Pablo S. Moya"
    ],
    "published": "2026-01-08T20:18:47Z",
    "updated": "2026-01-08T20:18:47Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2601.05342v1",
    "url": "https://arxiv.org/abs/2601.05342v1",
    "pdf_url": "https://arxiv.org/pdf/2601.05342v1.pdf",
    "title": "Development of Design for the STS Extraction Magnet System",
    "abstract": "The Oak Ridge National Laboratory STS Project will enhance the Spallation Neutron Source by adding a new neutron source. The upgrade includes a 30% increase in beam energy and a 50% boost in beam current, doubling the accelerator's power capability to 2.8 MW. The Ring-to-Second-Target Beam Transport (RTST) system is vital in directing high-energy proton beams to the new second target station. New magnets have to fit into a restricted space within the existing beamline to add the new extraction line. New, fast kicker magnets (Pulsed Dipole), a focusing quad with an aperture for both beamlines (Large Quad) and the replacement of existing 21Q40 Quads with 'Narrow Quads' having identical fields as the existing design are Fermilab's responsibility. The design of these magnets poses unique challenges, as in addition to the high requirements on the quality of magnetic fields, they are subject to major restrictions related to their dimensions.",
    "authors": [
      "V. Chernenok",
      "S. Cheban",
      "D. J Harding",
      "V. Kashikhin",
      "T. Strauss",
      "B. Szabo",
      "M. Allitt",
      "L. Boyd"
    ],
    "published": "2026-01-08T19:40:58Z",
    "updated": "2026-01-08T19:40:58Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.05331v1",
    "url": "https://arxiv.org/abs/2601.05331v1",
    "pdf_url": "https://arxiv.org/pdf/2601.05331v1.pdf",
    "title": "Directed Nano-antennas for Laser Fusion",
    "abstract": "Why do we use nano-antennas for fusion? In three sentences: The present laser induced fusion plans use extreme mechanical shock compression to get one hotspot and then ignition. Still fusion burning spreads slower than expansion, and mechanical instabilities may also develop. With nano-antennas in radiation dominated systems, simultaneous ignition can be achieved in the whole target volume and there is no time left for mechanical instabilities. Ignition is achieved with protons accelerated in the direction of the nanoantennas that are orthogonal to the direction of laser irradiation.   Present laser fusion methods are based on extreme and slow mechanical compression with an ablator surface on the fuel target pellet to increase compression and eliminate penetration of laser electromagnetic energy into the target. This arises from a mistaken assumption, [1] that the detonation normal 4-vector should have vanishing time-like component, and this assumption eliminates the possibility to rapid or even simultaneous, radiation dominated detonations, (which are well known in the burning (or hadronization) of Quark Gluon Plasma).",
    "authors": [
      "FUSENOW",
      "NAPLIFE Collaborations",
      ":",
      "Zsuzsanna Márton",
      "Imene Benabdelghani",
      "Márk Aladi",
      "Judit Budai",
      "Aldo Bonasera",
      "Attila Bonyár",
      "Mária Csete",
      "Martin Greve",
      "Jan-Petter Hansen",
      "Gergely Hegedűs",
      "Ádám Inger",
      "Miklos Kedves",
      "István Papp",
      "Péter Rácz",
      "András Szenes",
      "Ágnes Szokol",
      "Dávid Vass",
      "Miklós Veres",
      "Konstantin Zsukovszki",
      "Tamás S. Bíró",
      "Norbert Kroó",
      "Laszlo P. Csernai"
    ],
    "published": "2026-01-08T19:20:01Z",
    "updated": "2026-01-08T19:20:01Z",
    "categories": [
      "physics.plasm-ph",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.01075v2",
    "url": "https://arxiv.org/abs/2511.01075v2",
    "pdf_url": "https://arxiv.org/pdf/2511.01075v2.pdf",
    "title": "Beam-Beam Backgrounds for the Cool Copper Collider",
    "abstract": "In this paper, we present a comprehensive characterization of beam-beam backgrounds for the Cool Copper Collider (C$^3$), a proposed linear $e^{+}e^{-}$ collider designed for precision Higgs studies at center-of-mass energies of 250 and 550 GeV. Using a simulation pipeline based on the Key4hep framework, we evaluate incoherent pair production and hadron photoproduction backgrounds through the SiD detector for baseline, power-efficiency, and high-luminosity C$^3$ operating scenarios. The occupancy induced by the beam-beam background is evaluated for each scenario, validating the compatibility of the existing SiD detector design with operations at C$^3$ without substantial modifications. At the same time, the modular simulation framework and analysis methodology presented in this paper offer a versatile toolkit for background studies in future collider proposals, contributing to a common platform for different machine designs.",
    "authors": [
      "Dimitrios Ntounis",
      "Laith Gordon",
      "Lindsey Gray",
      "Elias Mettner",
      "Tim Barklow",
      "Emilio A. Nanni",
      "Caterina Vernieri"
    ],
    "published": "2025-11-02T20:51:11Z",
    "updated": "2026-01-08T19:00:23Z",
    "categories": [
      "hep-ex",
      "physics.acc-ph"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2601.05321v1",
    "url": "https://arxiv.org/abs/2601.05321v1",
    "pdf_url": "https://arxiv.org/pdf/2601.05321v1.pdf",
    "title": "On the gravitational stratification of multi-fluid-multi-species plasma",
    "abstract": "Context. The solar atmosphere is gravitationally stratified and consists of several layers at temperatures different by orders of magnitude. Consequently, the solar atmospheric plasma changes from weakly ionized in the photosphere, partially ionized in the chromosphere, to eventually fully ionized in the corona. However, it is still not trivial to integrate ionization and recombination processes into multi-fluid solar plasma models with gravitational stratification. Aims. We intend to provide a method for constructing multi-fluid-multi-species gravitational stratification that satisfies ionization equilibrium and hydrostatic equilibrium at the same time, avoiding causing non-physical disturbances and numerical instability due to initial in-equilibria. Methods. We assume that collisional interactions between fluids are sufficient for coupling all fluids when there is no high-frequency external driving force imposed. Ionization fractions can be (I) calculated assuming ionization in statistical equilibrium at any given temperature, or (II) extracted from other atmospheric models. A simple numerical integration routine is then designed and used to construct multi-fluid-multi-species gravitational stratifications. Results. A gravitational stratification constructed using the present numerical integration routine can be in hydrostatic equilibrium with any given ionization fractions of multi-species plasmas. Meanwhile, without any dynamic driving force, fluid decoupling appears in the transition region of the constructed stratification, while the total velocity of all fluids remains zero. Conclusions. A gravitational stratification constructed using the present routine can be used in multi-fluid-multi-species models to study specific dynamics without being affected by initial in-equilibria.",
    "authors": [
      "F. Zhang",
      "J. Martínez-Sykora",
      "Q. M. Wargnier",
      "V. H. Hansteen"
    ],
    "published": "2026-01-08T19:00:14Z",
    "updated": "2026-01-08T19:00:14Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2601.05155v1",
    "url": "https://arxiv.org/abs/2601.05155v1",
    "pdf_url": "https://arxiv.org/pdf/2601.05155v1.pdf",
    "title": "Machine learning for radiative hydrodynamics in astrophysics",
    "abstract": "Radiation hydrodynamics describes the interaction between high-temperature hypersonic plasmas and the radiation they emit or absorb, a coupling that plays a central role in many astrophysical phenomena related to accretion and ejection processes. The HADES code was developed to model such systems by coupling hydrodynamics with M1-gray or M1-multigroup radiative transfer models, which are well suited to optically intermediate media.   Despite its accuracy, radiation hydrodynamics simulations remain extremely demanding in terms of computational cost. Two main limitations are responsible for this. First, the M1-multigroup model relies on a closure relation with no analytic expression, requiring expensive numerical evaluations. Second, the Courant-Friedrichs-Lewy condition strongly restricts the time step of the explicit schemes used in HADES. To overcome these difficulties, two complementary Artificial Intelligence based strategies were developed in this thesis.   The first approach consists in training a Multi-Layer Perceptron to approximate the M1-multigroup closure relation. This method achieves excellent accuracy while reducing the computational cost by a factor of 3000, making it the most efficient approach currently available for this task. This performance gain enables high-fidelity simulations of radiative shocks, in which radiation directly influences the shock structure. In particular, increasing spectral resolution slows down the shock and enlarges the radiative precursor.   The second approach explores the use of Physics-Informed Neural Networks to directly solve the radiation hydrodynamics equations and extrapolate simulations beyond their initial time range. Tests on purely hydrodynamic shocks show accurate handling of discontinuities, but application to radiative shocks remains challenging and requires further investigation.",
    "authors": [
      "Gonzague Radureau"
    ],
    "published": "2026-01-08T17:44:53Z",
    "updated": "2026-01-08T17:44:53Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.IM"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.05115v1",
    "url": "https://arxiv.org/abs/2601.05115v1",
    "pdf_url": "https://arxiv.org/pdf/2601.05115v1.pdf",
    "title": "A gaseous-helium cooling system for silicon detectors in the Nab experiment",
    "abstract": "The Nab experiment aims to extract the neutron beta decay correlation coefficients 'a' and 'b'. This will be accomplished using a 7 m tall electromagnetic spectrometer which measures electron energies and proton momenta. Detection of electrons and protons resulting from neutron beta decay will be carried out using large-area, thick, highly-segmented, single-crystal silicon detectors. These detectors and accompanying electronics will be cooled by a recirculating, gaseous helium cooling system to below 150 K with +/- 0.5 K stability. We will motivate the need for detector cooling in the Nab experiment and discuss design and performance of this cooling system.",
    "authors": [
      "Love Richburg",
      "Noah Birge",
      "Nadia Fomin",
      "Grant Riley",
      "Josh Pierce",
      "John Ramsey",
      "Wolfgang Schreyer",
      "Seppo Penttila",
      "Isaiah Wallace",
      "Di'Arra Mostella",
      "Aaron Jezghani",
      "Alexander Saunders",
      "Americo Salas Bacci",
      "Ariella Atencio",
      "August Mendelsohn",
      "Austin Nelsen",
      "Bryan Zeck",
      "Christopher Crawford",
      "Corey Gilbert",
      "David Mathews",
      "Deion Fellers",
      "Duncan Fuehne",
      "Erick Smith",
      "Francisco Gonzalez",
      "Glenn Randall",
      "Himal Acharya",
      "Huangxing Li",
      "Hunter Presley",
      "Jackie Mirabal",
      "Jason Fry",
      "Jin Ha Choi",
      "Jordan O'Kronley",
      "Josh Hamblen",
      "Leah Broussard",
      "Mark Makela",
      "Nick Macsai",
      "Pat McGaughey",
      "Rebecca Godri",
      "Ricardo Alarcon",
      "Russell Mammei",
      "Sean Hollander",
      "Skylar Clymer",
      "Zachary Garman"
    ],
    "published": "2026-01-08T17:02:27Z",
    "updated": "2026-01-08T17:02:27Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.04985v1",
    "url": "https://arxiv.org/abs/2601.04985v1",
    "pdf_url": "https://arxiv.org/pdf/2601.04985v1.pdf",
    "title": "High Intensity for Accelerator Driven Systems (ADS)",
    "abstract": "Following the motivation for an Accelerator Driven System (ADS), the requirements on the accelerator are derived. Using the MYRRHA project as example, the beam optics/dynamics design and operational concept of such an accelerator are discussed and the main technology choices and challenges are presented.",
    "authors": [
      "Ulrich Dorda"
    ],
    "published": "2026-01-08T14:39:35Z",
    "updated": "2026-01-08T14:39:35Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2005.07027v2",
    "url": "https://arxiv.org/abs/2005.07027v2",
    "pdf_url": "https://arxiv.org/pdf/2005.07027v2.pdf",
    "title": "Beam Halo and Bunch Purity Monitoring",
    "abstract": "Beam halo measurements imply measurements of beam profiles with a very high dynamic range, both in transverse and longitudinal planes. This lesson gives an overview of high dynamic range instruments for beam halo measurements. In addition, halo definitions and quantifications in view of beam instrumentation are discussed.",
    "authors": [
      "Kay Wittenburg"
    ],
    "published": "2020-05-13T12:52:23Z",
    "updated": "2026-01-08T14:27:56Z",
    "categories": [
      "physics.acc-ph",
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.04967v1",
    "url": "https://arxiv.org/abs/2601.04967v1",
    "pdf_url": "https://arxiv.org/pdf/2601.04967v1.pdf",
    "title": "A Comprehensive multi-species comparison of rotational temperature probes in a DC Ar/N$_2$ micro-hollow cathode discharge",
    "abstract": "Accurate gas temperature ($T_{\\rm Gas}$) determination in microplasmas is critical for optimizing their applications, yet isolated diagnostic approaches may yield misleading results, especially under strong non-equilibrium conditions. Here, high resolution rotational spectra of N$_2$(C), OH(A), NH(A) and NO(A), generated in the plasma jet of a DC Ar/N$_2$ microhollow cathode discharge (MHCD), are recorded and their associated rotational temperatures ($T_{\\rm rot}$) are cross compared. A detailed experimental analysis and robust fitting of the rotational spectra are performed, achieving a reliable estimation of $T_{\\rm Gas}$. The dominant formation mechanisms of these species and their corresponding impact on rotational population distributions are also interrogated. Particularly, our findings indicate that the $T_{\\rm rot}$of N$_2$(C) is significantly influenced by energy transfers from argon metastables (Ar$^m$) and spectral interference from NH(A). This makes it unreliable as a thermometric probe in Ar-rich MHCD, unless complex analyses are employed. In contrast, OH(A) rotational population distribution appears to be less sensitive to Ar-induced perturbations across various discharge currents and pressures, providing more straightforward results. For all molecules considered, this study reveals the conditions under which all the measured $T_{\\rm rot}$ can be reliably considered to be in equilibrium with $T_{\\rm Gas}$. This highlights the importance of crossvalidating multiple thermometric probes and investigating relevant excitation kinetics when measuring $T_{\\rm rot}$ in reactive microplasmas.",
    "authors": [
      "Dimitrios Stefas",
      "Belkacem Menacer",
      "Alice Remigy",
      "Nikolaos Chazapis",
      "Guillaume Lombardi",
      "Claudia Lazzaroni",
      "Kristaq Gazeli"
    ],
    "published": "2026-01-08T14:15:13Z",
    "updated": "2026-01-08T14:15:13Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2005.06522v2",
    "url": "https://arxiv.org/abs/2005.06522v2",
    "pdf_url": "https://arxiv.org/pdf/2005.06522v2.pdf",
    "title": "Beam Loss Monitors",
    "abstract": "This lecture covers the fundamental aspects of the measurement of beam losses including their use for beam diagnostic and safety issues. The detailed functionality and detection principle of various common beam loss monitors are also presented, with a focus on their intrinsic sensitivity.",
    "authors": [
      "Kay Wittenburg"
    ],
    "published": "2020-05-13T18:42:56Z",
    "updated": "2026-01-08T13:19:23Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.04903v1",
    "url": "https://arxiv.org/abs/2601.04903v1",
    "pdf_url": "https://arxiv.org/pdf/2601.04903v1.pdf",
    "title": "Wakefield Acceleration in a Layered Plasma Waveguide",
    "abstract": "Plasma wakefield accelerators (PWFA) represent one of the promising new accelerator concepts that are now being developed intensively for future applications in high-energy physics and industry. Among the unresolved problems of practical implementation of PWFA there are maintaining the required quality (emittance, size, energy spread of bunches) and stable transportation of drive and accelerated (witness) bunches over long acceleration distances. For improving the bunch transport, we propose to fill the bunch transport channel with the background plasma, the density of which is lower than the main plasma density building up an accelerating wake wave. We call this waveguide structure a layered plasma waveguide (LPW). The wakefield excitation by a regular sequence of electron bunches in the LPW of cylindrical configuration has been explored both analytically and numerically. The layered plasma has been modeled as a combination of a tubular plasma and a plasma column of significantly different densities. The plasma column has a lower density. The dispersion dependencies of the TM-modes of the LPW was obtained and analyzed, and it was found that there was a single TM wave resonant with the electron bunch. Based on the obtained analytical expressions, the structures of the axial and radial wakefield amplitudes have been numerically investigated for the cases of a single drive bunch and a regular train of bunches. It is shown that for certain density ratios of the outer and inner plasmas, it is possible both to accelerate and focus simultaneously the drive and witness bunches. The 2.5D particle-in-cell code was used to simulate the witness acceleration of an electron bunch by a wakefield created by drive electron bunches in a two-layer plasma wakefield accelerator. The simulation showed good agreement with the results of analytical calculations.",
    "authors": [
      "G. V. Sotnikov",
      "K. V. Galaydych",
      "P. I. Markov"
    ],
    "published": "2026-01-08T12:58:42Z",
    "updated": "2026-01-08T12:58:42Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2309.12079v6",
    "url": "https://arxiv.org/abs/2309.12079v6",
    "pdf_url": "https://arxiv.org/pdf/2309.12079v6.pdf",
    "title": "Pair Production in time-dependent Electric field at Finite times",
    "abstract": "We investigate the finite-time behavior of pair production from the vacuum by a time-dependent Sauter pulsed electric field. By examining the temporal behavior of the single-particle distribution function, we observe oscillatory patterns in the longitudinal momentum spectrum of the particles at finite times. These oscillations arise due to quantum interference effects resulting from the various dynamical processes/channels leading to the creation of the (quasi-)particle of a given momentum. Furthermore, we derive an approximate and simplified analytical expression for the distribution function at finite times, allowing us to explain these oscillations' origin and behavior. The role of the vacuum polarization function and its counterterm are also discussed in this regard. The transverse momentum spectrum peaked at the nonzero value of the transverse momentum at finite times, which indicates the role of multiphoton transitions in the creation of quasiparticles.",
    "authors": [
      "Deepak Sah",
      "Manoranjan P. Singh"
    ],
    "published": "2023-09-21T13:49:43Z",
    "updated": "2026-01-08T12:10:17Z",
    "categories": [
      "hep-ph",
      "cond-mat.other",
      "hep-th",
      "physics.plasm-ph",
      "quant-ph"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2502.12044v3",
    "url": "https://arxiv.org/abs/2502.12044v3",
    "pdf_url": "https://arxiv.org/pdf/2502.12044v3.pdf",
    "title": "A Versatile Three Dimensional Traction Force Microscopy Framework for Uncovering the Mechanics of Bio-Adhesion",
    "abstract": "This study presents a novel, versatile traction force microscopy framework for quantifying three-dimensional (3D) interfacial forces during bio-adhesion by integrating in situ stereo digital image correlation with finite element (FE) simulation. The method enables accurate measurement of microscale displacements and force distributions at the interfaces in both dry and wet environments, addressing limitations of conventional microscopy techniques related to limited measurement scales, restricted fields of view, and surface disturbance from contact or fluorescence. An analytical model was developed to guide the design of a deformable substrate, supporting selection of substrate material and thickness of the substrate. System accuracy was examined through steel ball compression experiments, which were validated against FE simulations. The framework was applied to marine mussel plaque adhesion under 15 directional tension to characterize interfacial traction force distributions. Sensitivity analyses examined the effects of Poisson's ratio, Young's modulus, and constitutive models on the results. This approach offers a versatile platform for investigating interfacial mechanics in adhesives, with broad relevance to bioengineering applications.",
    "authors": [
      "Yingwei Hou",
      "Fusheng Wang",
      "Tao Liu"
    ],
    "published": "2025-02-17T17:12:35Z",
    "updated": "2026-01-08T10:19:25Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mtrl-sci",
      "physics.bio-ph",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1002/advs.202515497"
  },
  {
    "arxiv_id": "2511.01710v3",
    "url": "https://arxiv.org/abs/2511.01710v3",
    "pdf_url": "https://arxiv.org/pdf/2511.01710v3.pdf",
    "title": "First results of the NEXT-100 detector using $^{83m}$Kr decays",
    "abstract": "The NEXT collaboration is investigating the double beta decay of $^{136}$Xe using high-pressure gas electroluminescent time projection chambers, which provide excellent energy resolution together with a robust topological signature. Operating at the Laboratorio Subterráneo de Canfranc (LSC) and building on the success of the NEXT-White detector, the NEXT-100 apparatus began commissioning in May 2024 and started operation with xenon at a pressure of 4 bar in October 2024.   We report here the first results obtained with NEXT-100 using low-energy calibration data from $^{83m}$Kr decays, which allow mapping of the detector response in the active volume and monitoring of its stability over time. After homogenizing the light response, we achieve an energy resolution of 4.37% FWHM at 41.5 keV for $^{83m}$Kr point-like energy deposits contained in a radius of 425 mm. In a fiducial region representing the operating conditions of NEXT-100 at 10 bar we obtain an improved energy resolution of 4.16% FWHM. These results are in good agreement with that obtained in NEXT-White, and an $E^{-1/2}$ extrapolation to $Q_{ββ}$ yields an energy resolution close to 0.5% FWHM, well below the 1% FWHM design target.",
    "authors": [
      "NEXT Collaboration",
      "G. Martínez-Lema",
      "C. Hervés Carrete",
      "S. Torelli",
      "M. Cid Laso",
      "P. Vázquez Cabaleiro",
      "B. Palmeiro",
      "J. A. Hernando Morata",
      "J. J. Gómez-Cadenas",
      "C. Adams",
      "H. Almazán",
      "V. Álvarez",
      "A. I. Aranburu",
      "L. Arazi",
      "I. J. Arnquist",
      "F. Auria-Luna",
      "S. Ayet",
      "Y. Ayyad",
      "C. D. R. Azevedo",
      "K. Bailey",
      "F. Ballester",
      "J. E. Barcelon",
      "M. del Barrio-Torregrosa",
      "A. Bayo",
      "J. M. Benlloch-Rodríguez",
      "F. I. G. M. Borges",
      "A. Brodoline",
      "N. Byrnes",
      "A. Castillo",
      "E. Church",
      "L. Cid",
      "X. Cid",
      "C. A. N. Conde",
      "C. Cortes-Parra",
      "F. P. Cossío",
      "R. Coupe",
      "E. Dey",
      "P. Dietz",
      "C. Echeverria",
      "M. Elorza",
      "R. Esteve",
      "R. Felkai",
      "L. M. P. Fernandes",
      "P. Ferrario",
      "F. W. Foss",
      "Z. Freixa",
      "J. García-Barrena",
      "J. W. R. Grocott",
      "R. Guenette",
      "J. Hauptman",
      "C. A. O. Henriques",
      "P. Herrero-Gómez",
      "V. Herrero",
      "Y. Ifergan",
      "A. F. B. Isabel",
      "B. J. P. Jones",
      "F. Kellerer",
      "L. Larizgoitia",
      "A. Larumbe",
      "P. Lebrun",
      "F. Lopez",
      "N. López-March",
      "R. Madigan",
      "R. D. P. Mano",
      "A. Marauri",
      "A. P. Marques",
      "J. Martín-Albo",
      "A. Martínez",
      "M. Martínez-Vara",
      "R. L. Miller",
      "K. Mistry",
      "J. Molina-Canteras",
      "F. Monrabal",
      "C. M. B. Monteiro",
      "F. J. Mora",
      "K. E. Navarro",
      "P. Novella",
      "D. R. Nygren",
      "E. Oblak",
      "J. Palacio",
      "A. Para",
      "I. Parmaksiz",
      "A. Pazos",
      "J. Pelegrin",
      "M. Pérez Maneiro",
      "M. Querol",
      "J. Renner",
      "I. Rivilla",
      "C. Rogero",
      "L. Rogers",
      "B. Romeo",
      "C. Romo-Luque",
      "E. Ruiz-Chóliz",
      "P. Saharia",
      "F. P. Santos",
      "J. M. F. dos Santos",
      "M. Seemann",
      "I. Shomroni",
      "A. L. M. Silva",
      "P. A. O. C. Silva",
      "A. Simón",
      "S. R. Soleti",
      "M. Sorel",
      "J. Soto-Oton",
      "J. M. R. Teixeira",
      "S. Teruel-Pardo",
      "J. F. Toledo",
      "C. Tonnelé",
      "J. Torrent",
      "A. Trettin",
      "P. R. G. Valle",
      "M. Vanga",
      "J. F. C. A. Veloso",
      "J. D. Villamil",
      "J. Waiton",
      "A. Yubero-Navarro"
    ],
    "published": "2025-11-03T16:19:35Z",
    "updated": "2026-01-08T08:58:31Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  }
]