{
  "arxiv_id": "2509.07223v2",
  "url": "https://arxiv.org/abs/2509.07223v2",
  "pdf_url": "https://arxiv.org/pdf/2509.07223v2.pdf",
  "title": "Readout noise of digital frequency multiplexed TES detectors for CUPID",
  "abstract": "Superconducting transition-edge sensor (TES) detectors have been the standard in Cosmic Microwave Background experiments for almost two decades and are now being adapted for use in nuclear physics, such as neutrinoless double beta decay searches. In this paper we focus on a new high-bandwidth frequency multiplexed TES readout system developed for CUPID, a neutrinoless double beta decay experiment that will replace CUORE. In order to achieve the high energy resolution requirements for CUPID, the readout noise of the system must be kept to a minimum. Low TES operating resistance and long wiring between the readout SQUID and the warm electronics are needed for CUPID, prompting a careful consideration of the design parameters of this application of frequency multiplexing. In this work, we characterize the readout noise of the newly designed frequency multiplexed TES readout system for CUPID and construct a noise model to understand it. We find that current sharing between the SQUID coil impedance and other branches of the circuit, as well as the long output wiring, worsen the readout noise of the system. To meet noise requirements, a SQUID with a low input inductance, high transimpedance and/or low dynamic impedance is needed, and the wiring capacitance should be kept as small as possible. Alternatively, the option of adding a cryogenic low-noise amplifier at the output of the SQUID should be explored.",
  "authors": [
    "Michel Adamič",
    "Joseph Camilleri",
    "Chiara Capelli",
    "Matt Dobbs",
    "Tucker Elleflot",
    "Yury G. Kolomensky",
    "Daniel Mayer",
    "Joshua Montgomery",
    "Valentine Novosad",
    "Vivek Singh",
    "Graeme Smecher",
    "Aritoki Suzuki",
    "Bradford Welliver"
  ],
  "published": "2025-09-08T21:04:31Z",
  "updated": "2025-12-03T06:33:37Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.1109/TNS.2025.3638275"
}