{
  "arxiv_id": "2512.02887v1",
  "url": "https://arxiv.org/abs/2512.02887v1",
  "pdf_url": "https://arxiv.org/pdf/2512.02887v1.pdf",
  "title": "Discovery and rectification of an error in high resistance traceability at NPL: a case study in how metrology works",
  "abstract": "We broach a seldom-discussed topic in precision metrology; how subtle errors in calibration processes are discovered and remedied. We examine a case study at the National Physical Laboratory (NPL), UK, involving the calibration of DC standard resistors of value 100 MOhm and 1 GOhm. Results from the period 2001 to 2015 were in error by approximately 0.7 parts per million (ppm), with quoted uncertainties (k=2) of 0.4 ppm and 1.6 ppm respectively. Inter-comparisons did not detect the error, mainly because the uncertainty due to the transportation drift of the comparison standards was too large to resolve it. Likewise, research into single-electron current standards did not detect the error because at this resistance value it was on the borderline of statistical significance. The key event was a comparison between PTB (Germany) and NPL (UK) of a new small-current measuring instrument, the ultrastable low-noise current amplifier (ULCA). At that time, the transport stability of the ULCA was not well established. Nevertheless, calibrations of the ULCA at NPL using a 100 MOhm resistor were sufficiently discrepant with the PTB calibrations to motivate a thorough investigation into the NPL traceability chain, which uncovered the error. This instructive episode illustrates a positive interplay between calibration and research activities and shows that cutting-edge calibration uncertainties must be supported by a vigorous research programme. It is also important for NMIs to maintain a comfortable buffer (at least a factor of 10) between their claimed uncertainty and the uncertainty that their customers require, so that small errors can be resolved without significant impact on measurement stakeholders.",
  "authors": [
    "Stephen Giblin"
  ],
  "published": "2025-12-02T15:45:06Z",
  "updated": "2025-12-02T15:45:06Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}