{
  "arxiv_id": "2512.02129v1",
  "url": "https://arxiv.org/abs/2512.02129v1",
  "pdf_url": "https://arxiv.org/pdf/2512.02129v1.pdf",
  "title": "Dynamo and Jet interconnections in GRMHD simulations of black hole accretion disks",
  "abstract": "We present global 3D GRMHD simulations of black hole (BH) accretion disks designed to investigate how MRI-driven dynamo action regulates jet formation and evolution. Unlike standard SANE/MAD setups that impose a coherent large-scale poloidal loop, our \"sub-SANE\" initial conditions use multiple same-polarity small-scale magnetic loops. Rapid reconnection erases magnetic memory and enables large-scale dynamo to emerge early from MRI turbulence. We perform two such sub-SANE simulations at different BH spins ($a = 0.5, 0.9375$) and compare them with conventional SANE runs. The sub-SANE disks show regular large-scale dynamo cycles with periods of about ten orbits. Decomposition of the induction equation shows that the turbulent dynamo term is stronger in 3D compared to 2.5D and balances advection in the saturated state, confirming sustained large-scale field generation. These dynamo-generated fields are advected inward with minimal time lag, producing correlated peaks in both poloidal and toroidal field strengths from $r_{\\rm max}$ to the horizon. Early in the evolution, these peaks imprint directly onto the jet's electromagnetic energy flux, indicating that the jet mirrors the dynamo wave. Though jets form at early times, the sub-SANE runs eventually undergo jet shutdown. We show that this occurs when the magnetic field at the horizon loses coherence, as quantified by a decline in the signed-to-unsigned flux ratio $\\mathcal{C}_{\\rm BH}$ below $\\approx 0.6$. In contrast, the SANE reference case with similar accretion rate and horizon magnetic flux maintains high magnetic coherence because its initial large-scale field persists, allowing its jet to survive. Our results show that both dynamo-driven field evolution and horizon magnetic-field coherence critically regulate jet longevity, establishing a direct dynamo-jet connection in GRMHD disks.",
  "authors": [
    "P. S. Santhiya",
    "Pallavi Bhat",
    "Prayush Kumar",
    "Tushar Mondal",
    "Indu K. Dihingia"
  ],
  "published": "2025-12-01T19:00:44Z",
  "updated": "2025-12-01T19:00:44Z",
  "categories": [
    "astro-ph.HE",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.HE"
}