{
  "arxiv_id": "2512.02415v1",
  "url": "https://arxiv.org/abs/2512.02415v1",
  "pdf_url": "https://arxiv.org/pdf/2512.02415v1.pdf",
  "title": "Integrated Sliding-Short/Probe Tuner with Doorknob Transition for High-Q Cavities",
  "abstract": "We present an integrated three-knob tuner that internalizes impedance matching inside the launch adapter of a waveguide-fed, high-$Q$ cavity. The tuner combines a waveguide sliding short, a doorknob transition, and a micrometer-driven adjustable coaxial probe. A transmission-line/ABCD model is derived that maps the three mechanical degrees of freedom to the electrical objectives $Γ\\rightarrow 0$, $β$, and $Q_{\\rm L}$, explicitly including the fused-silica feedthrough capacitance. The model yields closed-form matching conditions and predicts the critical-coupling set. Full-wave FEM simulations and bench measurements validate the approach: with $h \\approx 0.55$~mm and backshort distance $\\approx 0.80$~mm, the return loss reaches $|S_{11}| \\approx -30$~dB near 17.8--18.1~GHz while sustaining peak electric fields of $\\sim 1.8 \\times 10^5$~V/m at the nozzle (normalized to 1~W). The measured through loss of the launch assembly is $|S_{21}| \\approx 0.7$--$0.8$~dB at resonance.   A parametric study shows that backshort lengths $L_{\\rm {bs}} \\geq 0.5 λ_{\\rm g}$ excite a parasitic stub resonance, introducing a second $S_{11}$ minimum and localizing energy behind the doorknob; keeping $L_{\\rm {bs}} \\leq 0.4 λ_g$ avoids this. In helium plasma discharges at $P_{\\rm {in}} = 10$~W, \\textit{in-situ} retuning of the short and probe maintained a favorable match as the plasma impedance evolved, increasing absorbed power from $\\sim 43\\%$ to $\\sim 76\\%$ while increasing helium propellant flow rate from 25 to 351~sccm. The compact tuner eliminates external stub boxes and generalizes to other waveguide-coupled resonators and plasma sources.",
  "authors": [
    "Saptarshi Biswas",
    "Sven G. Bilén"
  ],
  "published": "2025-12-02T04:55:00Z",
  "updated": "2025-12-02T04:55:00Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}