{
  "arxiv_id": "2512.02613v1",
  "url": "https://arxiv.org/abs/2512.02613v1",
  "pdf_url": "https://arxiv.org/pdf/2512.02613v1.pdf",
  "title": "New 1mm thick Silicon Drift Detectors for future researches of Kaonic Atoms and the Pauli Exclusion principle",
  "abstract": "Kaonic atoms, formed when a negatively charged kaon replaces an electron, provide a sensitive probe of the low-energy strong interaction via precision X-ray spectroscopy. The SIDDHARTA-2 experiment at the DA$Φ$NE collider employs high-performance Silicon Drift Detectors (SDDs) optimized for the 4-12 keV range to study light kaonic systems. In preparation for the EXKALIBUR phase, which targets heavier kaonic atoms, new 1 mm-thick SDDs have been developed with Politecnico di Milano and Fondazione Bruno Kessler. Their increased thickness enhances the quantum efficiency by a factor of about two at 30 keV while preserving excellent energy resolution. These detectors are also intended for VIP-3, the next-generation test of the Pauli Exclusion Principle (PEP). Building on VIP-2, which set the most stringent limits on PEP-violating $K_α$ transitions in copper, VIP-3 will extend the search to heavier elements such as Ag, Sn, and Zr. Preliminary measurements demonstrate efficient detection up to 30 keV, supporting future high-precision studies of the kaon-nucleon interaction and PEP in heavier systems.",
  "authors": [
    "F. Clozza",
    "F. Sgaramella",
    "L. Abbene",
    "F. Artibani",
    "M. Bazzi",
    "G. Borghi",
    "D. Bosnar",
    "M. Bragadireanu",
    "A. Buttacavoli",
    "M. Carminati",
    "A. Clozza",
    "R. Del Grande",
    "L. De Paolis",
    "E. Demenev",
    "C. Fiorini",
    "I. Friščić",
    "C. Guaraldo",
    "M. Iliescu",
    "M. Iwasaki",
    "A. Khreptak",
    "S. Manti",
    "J. Marton",
    "P. Moskal",
    "H. Ohnishi",
    "K. Piscicchia",
    "F. Principato",
    "A. Samusenko",
    "A. Scordo",
    "D. Sirghi",
    "F. Sirghi",
    "M. Skurzok",
    "A. Spallone",
    "K. Toho",
    "J. Zmeskal",
    "N. Zorzi",
    "C. Curceanu"
  ],
  "published": "2025-12-02T10:18:31Z",
  "updated": "2025-12-02T10:18:31Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}