{
  "arxiv_id": "2512.01762v1",
  "url": "https://arxiv.org/abs/2512.01762v1",
  "pdf_url": "https://arxiv.org/pdf/2512.01762v1.pdf",
  "title": "Characterization of cutting-edge CMOS Active Pixel sensors within the CYGNO Experiment",
  "abstract": "Time Projection Chambers equipped with Gas Electron Multipliers and optical readout by scientific CMOS cameras are a promising technology for low-energy particle detection, as demonstrated by the CYGNO experiment. To help identify the optimal CYGNO detector configuration, we performed a detailed characterization of two state-of-the-art scientific CMOS sensors, focusing on dark-signal behavior across different exposure times and on detection sensitivity, assessed using the well-defined X-ray emissions from a 55Fe source, which reproduce the low-light conditions expected in CYGNO.   CYGNO currently employs a very low-noise Hamamatsu sensor, the ORCA-Fusion, for testing and validation of its detection system. Hamamatsu has recently introduced two new sensors that may be of interest for future upgrades. The first is an improved version of the current model, the ORCA-Fusion-BT, featuring a back-illuminated design that reaches a quantum efficiency of up to 95% at 550 nm. The second is a next-generation sensor, the ORCA-Quest. Although its peak quantum efficiency is not as high as that of the Fusion-BT, it offers high sensitivity over a broader spectral range, extending into the ultraviolet region, and provides ultra-low readout noise of 0.27 electrons, about 2.6 times lower than that of the Fusion family.   These two sensors therefore represent a significant opportunity to enhance the performance of scientific experiments, including those conducted by the CYGNO collaboration. This document presents a comprehensive characterization of these sensors to evaluate their relevance for experiments operating in photon-limited environments and their suitability for integration into the CYGNO detector system.",
  "authors": [
    "B. D. Almeida",
    "F. D. Amaro",
    "R. Antonietti",
    "E. Baracchini",
    "L. Benussi",
    "S. Bianco",
    "C. Capoccia",
    "M. Caponero",
    "L. G. M. de Carvalho",
    "G. Cavoto",
    "I. A. Costa",
    "A. Croce",
    "M. D'Astolfo",
    "G. D'Imperio",
    "E. Dane",
    "G. Dho",
    "E. Di Marco",
    "J. M. F. Dos Santos",
    "D. Fiorina",
    "F. Iacoangeli",
    "Z. Islam",
    "E. Kemp",
    "H. P. Lima",
    "G. Maccarrone",
    "R. D. P. Mano",
    "D. J. G. Marques",
    "G. Mazzitelli",
    "P. Meloni",
    "A. Messina",
    "C. M. B. Monteiro",
    "R. A. Nobrega",
    "I. F. Pains",
    "E. Paoletti",
    "F. Petrucci",
    "S. Piacentini",
    "D. Pierluigi",
    "D. Pinci",
    "F. Renga",
    "R. J. C. Roque",
    "A. Russo",
    "G. Saviano",
    "P. A. O. C. Silva",
    "N. J. Spooner",
    "R. Tesauro",
    "S. Tomassini",
    "D. Tozzi"
  ],
  "published": "2025-12-01T15:06:24Z",
  "updated": "2025-12-01T15:06:24Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}