[
  {
    "arxiv_id": "2512.03997v1",
    "url": "https://arxiv.org/abs/2512.03997v1",
    "pdf_url": "https://arxiv.org/pdf/2512.03997v1.pdf",
    "title": "Comment on \"Monochromatization interaction region optics design for direct s-channel Higgs production at FCC-ee\"",
    "abstract": "The original article [1] can be logically divided into two parts: 1) the selection of main parameters for monochromatization and 2) interaction region optics design; the comment pertains only to the first part. The authors of [1] state that \"The purpose of this paper is to report on the development of realistic IR optics designs for monochromatization at the FCC-ee\". However, the proposed parameters do not seem very realistic and raise many questions.",
    "authors": [
      "Dmitry Shatilov"
    ],
    "published": "2025-12-03T17:29:11Z",
    "updated": "2025-12-03T17:29:11Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.09010v3",
    "url": "https://arxiv.org/abs/2509.09010v3",
    "pdf_url": "https://arxiv.org/pdf/2509.09010v3.pdf",
    "title": "Cryogenic geometric anti-spring vibration isolation system",
    "abstract": "The combination of low temperature and low vibration levels is key for ultrasensitive sensing applications such as scanning probe microscopy, large-mass quantum mechanics, and gravitational wave detection. Unfortunately, closed-cycle cryostats using pulse tube or GM coolers introduce strong low-frequency vibrations starting at 1 Hz. Mass-spring systems allow passive isolation, but for low-frequency applications the required spring constants and masses become impractical. Blade-based geometric anti-spring systems are compact isolators that operate from sub-Hz frequencies, but have not been demonstrated at cryogenic temperatures. Here, we characterize a geometric anti-spring system tuned to operate at cryogenic temperatures. Our cryogenic filter uses radially arranged titanium blade springs whose effective spring constant can be tuned in-situ using a magnetic actuator. Our system achieves a vertical resonance frequency of 185 mHz at 7K, which allows reduction of vibrations at the problematic 1 Hz cooler frequency by an order of magnitude.",
    "authors": [
      "L. Feenstra",
      "S. Domínguez-Calderón",
      "K. van Oosten",
      "H. S. M. Bohemen",
      "T. Benschop",
      "M. Brinkman",
      "M. Li",
      "E. Hennes",
      "R. Cornelissen",
      "B. J. Hensen",
      "A. Bertolini",
      "M. P. Allan"
    ],
    "published": "2025-09-10T21:13:37Z",
    "updated": "2025-12-03T16:55:11Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.03829v1",
    "url": "https://arxiv.org/abs/2512.03829v1",
    "pdf_url": "https://arxiv.org/pdf/2512.03829v1.pdf",
    "title": "First Experimental Demonstration of Machine Learning-Based Tuning on the PSI Injector 2 Cyclotron",
    "abstract": "Reliable operation of high-power proton cyclotrons is a critical requirement for Accelerator Driven Systems (ADS) and other large-scale applications. Beam tuning in such machines is traditionally performed manually, a process that can be slow, non-optimal, and difficult to execute in the presence of faults or changing conditions. To address this, we developed and deployed a machine learning (ML) based tuning framework on the Injector 2 cyclotron at PSI, chosen as an ideal testbed for high-power operation. The system combined a tailored reinforcement learning algorithm with real-time diagnostics and control, and incorporated accelerator-physics inspired adaptations such as an overshoot strategy that reduced magnetic field settling times by nearly a factor of six. Over an extensive 12-day operational test campaign, relatively long in the context of real-time ML experiments, the ML agent successfully tuned the machine across multiple operating points, achieving convergence within hours and maintaining stable beam extraction with reduced losses. Beyond initial tuning, the system was also operated in evaluation mode overnight, where it autonomously monitored and corrected the machine to compensate for drifts, demonstrating robustness and long-term stability. Crucially, the learned policy generalized reliably from low-current training to higher-current operation, underscoring its scalability. These results constitute the first demonstration of ML-assisted tuning on a high-power cyclotron, with direct relevance to ADS-class drivers.",
    "authors": [
      "M. Haj Tahar",
      "W. Joho",
      "E. Solodko",
      "M. Bocchio",
      "S. Marquie",
      "M. Busch",
      "A. Barchetti",
      "J. Grillenberger",
      "J. Snuverink",
      "M. Schneider"
    ],
    "published": "2025-12-03T14:21:39Z",
    "updated": "2025-12-03T14:21:39Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.03826v1",
    "url": "https://arxiv.org/abs/2512.03826v1",
    "pdf_url": "https://arxiv.org/pdf/2512.03826v1.pdf",
    "title": "Recent Developments of the VOXES Von Hamos X-ray Spectrometer for Laboratory XES and XAS Studies",
    "abstract": "VOXES is a Von Hamos X-ray spectrometer developed at the INFN National Laboratories of Frascati for high-resolution laboratory X-ray spectroscopy in the 5--20~keV range. It uses curved mosaic crystals and motorized positioning stages to perform wavelength-dispersive X-ray fluorescence (WD-XRF) with sub-10~eV tunable resolution for extended and dilute samples. Recent developments include the integration of an energy-dispersive X-ray fluorescence (ED-XRF) line based on a silicon pin-diode detector, which enables flux monitoring and simultaneous ED and WD measurements. In addition, a dedicated liquid-sample holder has been introduced, and a Y-shaped support geometry, crucial for switching to a transmission layout, provides mechanical compatibility with laboratory XAS, now under implementation. These upgrades expand the versatility and automation of VOXES, strengthening its role as a table-top platform for laboratory X-ray spectroscopy.",
    "authors": [
      "Simone Manti",
      "Alberto Clozza",
      "Gabriel Moskal",
      "Kristian Piscicchia",
      "Diana Sirghi",
      "Florin Sirghi",
      "Catalina Curceanu",
      "Alessandro Scordo"
    ],
    "published": "2025-12-03T14:18:44Z",
    "updated": "2025-12-03T14:18:44Z",
    "categories": [
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.app-ph"
  },
  {
    "arxiv_id": "2512.03811v1",
    "url": "https://arxiv.org/abs/2512.03811v1",
    "pdf_url": "https://arxiv.org/pdf/2512.03811v1.pdf",
    "title": "Studying the GRAiNITA concept: first test beam results",
    "abstract": "Data collected over a two-day period in June 2024 at the CERN SPS H9 test beam using a small-scale GRAiNITA prototype have been analyzed to characterize the detector's energy resolution performance. The measurements allow for a first estimate of the constant term associated with detector non-uniformity. Although the evaluation is limited by the small prototype size and the use of pion beams, the results indicate that the non-uniformity-related constant term is significantly below 1%. Furthermore, the test-beam data confirm that the contribution to the energy resolution arising from photo-electron statistics is approximately 1%/sqrt(E). These findings validate the expected calorimetric performance of the GRAiNITA concept and provide important input for the design and optimization of future full-scale detectors.",
    "authors": [
      "Sergey Barsuk",
      "Oleg Bezshyyko",
      "Ianina Boiaryntseva",
      "Andrey Boyarintsev",
      "Dominique Breton",
      "Herve Chanal",
      "Alexander M. Dubovik",
      "Larysa Golinka-Bezshyyko",
      "Carlos Dominguez Goncalves",
      "Yingrui Hou",
      "Giulia Hull",
      "Miktat Imre",
      "Denys Klekots",
      "Jacques Lefrancois",
      "Jihane Maalmi",
      "Magali Magne",
      "Bernard Mathon",
      "Stéphane Monteil",
      "Sebastien Olmo",
      "David Picard",
      "Marie-Helene Schune",
      "Irina Tupitsyna",
      "Mykhailo Yeresko"
    ],
    "published": "2025-12-03T14:00:59Z",
    "updated": "2025-12-03T14:00:59Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.03780v1",
    "url": "https://arxiv.org/abs/2512.03780v1",
    "pdf_url": "https://arxiv.org/pdf/2512.03780v1.pdf",
    "title": "Poly- and single-crystalline diamond nitrogen-induced TLS losses estimation with superconducting lumped elements micro-resonators",
    "abstract": "Research on diamond has intensified due to its exceptional thermal, optical, and mechanical properties, making it a key material in quantum technologies and high-power applications. Diamonds with engineered nitrogen-vacancy (NV) centers represent a very sensitive platform for quantum sensing, while high-optical quality diamond windows represent a fundamental safety component inside Electron Cyclotron Resonance Heating (ECRH) systems in nuclear fusion reactors. A major challenge is the development of ultra-low-loss, high-optical-quality single-crystal diamond substrates to meet growing demands for quantum coherence and power handling. Traditionally, dielectric losses ($\\tan δ$) in diamonds are evaluated using Fabry-Perot microwave resonators, in which the resonance quality factors Q of the cavity with and without the sample are compared. These devices are limited to resolutions around 10$^{-5}$ by the need to keep the resonator dimensions within a reasonable range. In contrast, superconducting thin-film micro-strip resonators, with Q factors exceeding 10$^6$, are stated to provide higher sensitivity for assessing ultra-low-loss materials. This study examines four diamond samples grown through different processes, analyzing their dielectric losses at extreme low temperatures (sub-Kelvin) within the Two-Level System (TLS) framework. Complementary Raman spectroscopy measurements allowed us not only to associate higher nitrogen content with increased losses, but also to investigate how the different growth process influence the way these defects are incorporated in the crystal lattice.",
    "authors": [
      "Francesco Mazzocchi",
      "Martin Neidig",
      "Hideaki Yamada",
      "Sebastian Kempf",
      "Dirk Strauss",
      "Theo Scherer"
    ],
    "published": "2025-12-03T13:32:35Z",
    "updated": "2025-12-03T13:32:35Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2512.03711v1",
    "url": "https://arxiv.org/abs/2512.03711v1",
    "pdf_url": "https://arxiv.org/pdf/2512.03711v1.pdf",
    "title": "Compton suppressed scintillation spectrometer based on a cluster of 9$\\times$CeBr$_{3}$-NaI(Tl) phoswich detectors",
    "abstract": "Measurements of the characteristics of an Compton suppressed spectrometer consisting of 9$\\times$CeBr$_{3}$-NaI(Tl) phoswich detectors surrounded by four CsI(Tl) scintillation detectors intended for suppressing the Compton component of the spectrum have been carried out. Measurements were performed using gamma and neutron radiation sources. Key parameters of the spectrometer have been determined: the suppression factor of the Compton part of the $γ$-spectrum, as well as the dependencies of the neutron detection efficiency on their energy at various detection threshold values.",
    "authors": [
      "Mark Povolotskiy",
      "Yuri Sobolev",
      "Sergei Stukalov"
    ],
    "published": "2025-12-03T12:02:00Z",
    "updated": "2025-12-03T12:02:00Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.21612v3",
    "url": "https://arxiv.org/abs/2507.21612v3",
    "pdf_url": "https://arxiv.org/pdf/2507.21612v3.pdf",
    "title": "First use of large area SiPM matrices coupled with NaI(Tl) scintillating crystal for low energy dark matter search",
    "abstract": "The long-standing claim of dark matter detection by the DAMA experiment remains a crucial open question in astroparticle physics. A key step towards its independent verification is the development of NaI(Tl)-based detectors with improved sensitivity at low energies. The majority of NaI(Tl)-based experiments rely on conventional photomultiplier tubes (PMTs) as single photon detectors, which present technological limitations in terms of light collection, intrinsic radioactivity and a high noise contribution at keV energies. ASTAROTH is an R&D project developing a NaI(Tl)-based detector where the scintillation light is read out by silicon photomultipliers (SiPM) matrices. SiPMs exhibit high photon detection efficiency, negligible radioactivity, and, most importantly, a dark noise nearly two orders of magnitude lower than PMTs, when operated at cryogenic temperature. To this end, ASTAROTH features a custom-designed cryostat based on a bath of cryogenic fluid, able to safely operate the detector and the read-out electronics down to about 80K. We report the first experimental characterization of 360 g NaI(Tl) detector read out by a large area (5 cm x 5 cm) SiPM matrix. The photoelectron yield obtained with a preliminary configuration is 7.2 photoelectrons/keV, which is rather promising, also in light of several planned developments. The signal-to-noise ratio and the energy threshold attainable with SiPMs is expected to improve the sensitivity for dark matter searches beyond the reach of current-generation PMT-based detectors. This result is the first proof of the viability of this technology and sets a milestone toward the design of future large-scale experiments.",
    "authors": [
      "Edoardo Martinenghi",
      "Valerio Toso",
      "Fabrizio Bruno Armani",
      "Andrea Castoldi",
      "Giuseppe di Carlo",
      "Luca Frontini",
      "Niccolò Gallice",
      "Chiara Guazzoni",
      "Valentino Liberali",
      "Alberto Stabile",
      "Valeria Trabattoni",
      "Andrea Zani",
      "Davide D'Angelo"
    ],
    "published": "2025-07-29T09:10:39Z",
    "updated": "2025-12-03T09:38:35Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2404.08459v3",
    "url": "https://arxiv.org/abs/2404.08459v3",
    "pdf_url": "https://arxiv.org/pdf/2404.08459v3.pdf",
    "title": "Observation of Fine Structure in Channeling of Particles in Bent Crystals",
    "abstract": "We observed highly efficient manipulation of the 530 MeV positron beam at Mainz Microtron via bent crystals. The low beam divergence revealed a fine structure in the angular distribution of channeled particles. A compact analytical model, supported by Monte Carlo including multiple scattering, accounts for the measurements. We established a criterion for designing a crystal with reduced angular spread of channeled particles for beam manipulation at any energy. This finding is particularly useful in view of applications of channeling to the highest energies.",
    "authors": [
      "A. Mazzolari",
      "H. Backe",
      "L. Bandiera",
      "N. Canale",
      "D. De Salvador",
      "P. Drexler",
      "V. Guidi",
      "P. Klag",
      "W. Lauth",
      "L. Malagutti",
      "R. Negrello",
      "G. Paternò",
      "M. Romagnoni",
      "F. Sgarbossa",
      "A. Sytov",
      "V. Tikhomirov",
      "D. Valzani"
    ],
    "published": "2024-04-12T13:10:46Z",
    "updated": "2025-12-03T09:15:44Z",
    "categories": [
      "physics.acc-ph",
      "physics.app-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.1103/t4ms-hmdd"
  },
  {
    "arxiv_id": "2509.07223v2",
    "url": "https://arxiv.org/abs/2509.07223v2",
    "pdf_url": "https://arxiv.org/pdf/2509.07223v2.pdf",
    "title": "Readout noise of digital frequency multiplexed TES detectors for CUPID",
    "abstract": "Superconducting transition-edge sensor (TES) detectors have been the standard in Cosmic Microwave Background experiments for almost two decades and are now being adapted for use in nuclear physics, such as neutrinoless double beta decay searches. In this paper we focus on a new high-bandwidth frequency multiplexed TES readout system developed for CUPID, a neutrinoless double beta decay experiment that will replace CUORE. In order to achieve the high energy resolution requirements for CUPID, the readout noise of the system must be kept to a minimum. Low TES operating resistance and long wiring between the readout SQUID and the warm electronics are needed for CUPID, prompting a careful consideration of the design parameters of this application of frequency multiplexing. In this work, we characterize the readout noise of the newly designed frequency multiplexed TES readout system for CUPID and construct a noise model to understand it. We find that current sharing between the SQUID coil impedance and other branches of the circuit, as well as the long output wiring, worsen the readout noise of the system. To meet noise requirements, a SQUID with a low input inductance, high transimpedance and/or low dynamic impedance is needed, and the wiring capacitance should be kept as small as possible. Alternatively, the option of adding a cryogenic low-noise amplifier at the output of the SQUID should be explored.",
    "authors": [
      "Michel Adamič",
      "Joseph Camilleri",
      "Chiara Capelli",
      "Matt Dobbs",
      "Tucker Elleflot",
      "Yury G. Kolomensky",
      "Daniel Mayer",
      "Joshua Montgomery",
      "Valentine Novosad",
      "Vivek Singh",
      "Graeme Smecher",
      "Aritoki Suzuki",
      "Bradford Welliver"
    ],
    "published": "2025-09-08T21:04:31Z",
    "updated": "2025-12-03T06:33:37Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1109/TNS.2025.3638275"
  },
  {
    "arxiv_id": "2408.11709v3",
    "url": "https://arxiv.org/abs/2408.11709v3",
    "pdf_url": "https://arxiv.org/pdf/2408.11709v3.pdf",
    "title": "SynradG4: A Geant4-Based Extension for Synchrotron Radiation Background Studies in the ePIC Detector at the Electron-Ion Collider",
    "abstract": "The Electron-Ion Collider (EIC) will operate at high luminosity with multi-GeV, high-current electron beams, resulting in substantial synchrotron radiation (SR) emission in the electron storage ring (ESR). A detailed understanding of SR photon transport in the complex three-dimensional interaction region (IR) geometry is critical for estimating backgrounds in the ePIC detector and for developing effective shielding and masking strategies.   This paper presents SynradG4, an EIC-specific extension of Geant4 designed for fast photon tracking in vacuum using established SR reflection and rough surface scattering models. SynradG4 integrates the photon reflection models of Synrad+ within the Geant4 geometry and field framework, while disabling all bulk matter interactions to achieve high-statistics transport through the 50-m-long IR vacuum system. Absorbed photon coordinates are then passed to a second-stage DD4hep simulation, where full electromagnetic processes such as photoabsorption, Compton scattering, Rayleigh scattering, and fluorescence are enabled for propagation through the beam pipe and detector materials.   SynradG4 is not intended to replace general SR simulation codes; rather, it complements them by providing the workflow and geometry integration capabilities needed for EIC-specific background studies. Benchmark tests against Synrad+, Synrad3D, and the native Geant4 X-ray reflection model demonstrate excellent agreement for specular and diffuse reflection regimes. Using the full IR geometry and machine lattice, we present the first SR background estimates for the ePIC detector and evaluate the impact of potential SR masks.",
    "authors": [
      "Andrii Natochii"
    ],
    "published": "2024-08-21T15:33:47Z",
    "updated": "2025-12-02T21:41:14Z",
    "categories": [
      "physics.acc-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.03216v1",
    "url": "https://arxiv.org/abs/2512.03216v1",
    "pdf_url": "https://arxiv.org/pdf/2512.03216v1.pdf",
    "title": "Kaleidoscopic Scintillation Event Imaging",
    "abstract": "Scintillators are transparent materials that interact with high-energy particles and emit visible light as a result. They are used in state of the art methods of measuring high-energy particles and radiation sources. Most existing methods use fast single-pixel detectors to detect and time scintillation events. Cameras provide spatial resolution but can only capture an average over many events, making it difficult to image the events associated with an individual particle. Emerging single-photon avalanche diode cameras combine speed and spatial resolution to enable capturing images of individual events. This allows us to use machine vision techniques to analyze events, enabling new types of detectors. The main challenge is the very low brightness of the events. Techniques have to work with a very limited number of photons.   We propose a kaleidoscopic scintillator to increase light collection in a single-photon camera while preserving the event's spatial information. The kaleidoscopic geometry creates mirror reflections of the event in known locations for a given event location that are captured by the camera. We introduce theory for imaging an event in a kaleidoscopic scintillator and an algorithm to estimate the event's 3D position. We find that the kaleidoscopic scintillator design provides sufficient light collection to perform high-resolution event measurements for advanced radiation imaging techniques using a commercial CMOS single-photon camera. Code and data are available at https://github.com/bocchs/kaleidoscopic_scintillator.",
    "authors": [
      "Alex Bocchieri",
      "John Mamish",
      "David Appleyard",
      "Andreas Velten"
    ],
    "published": "2025-12-02T20:39:24Z",
    "updated": "2025-12-02T20:39:24Z",
    "categories": [
      "physics.ins-det",
      "cs.CV",
      "eess.IV"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.03007v1",
    "url": "https://arxiv.org/abs/2512.03007v1",
    "pdf_url": "https://arxiv.org/pdf/2512.03007v1.pdf",
    "title": "Generation of strong ultralow-phase-noise microwave fields with tunable ellipticity for ultracold polar molecules",
    "abstract": "Microwave(MW) fields with strong field strength, ultralow phase-noise and tunable polarization are crucial for stabilizing and manipulating ultracold polar molecules, which have emerged as a promising platform for quantum sciences. In this letter, we present the design, characterization, and performance of a robust MW setup tailored for precise control of molecular states. This setup achieves a high electric field intensity of 6.9 kV/m in the near-field from a dual-feed waveguide antenna, enabling a Rabi frequency as high as 71 MHz for the rotational transition of sodium-potassium molecules. In addition, the low noise signal source and controlled electronics provide ultralow phase-noise and dynamically tunable polarization. Narrow-band filters within the MW circuitry further reduce phase-noise by more than 20 dB at 20 MHz offset frequency, ensuring prolonged one-body molecular lifetimes up to 10 seconds. We also show practical methods to measure the MW field strength and polarization using a simple homemade dipole probe, and to characterize phase-noise down to -170 dBc/Hz with a commercial spectrum analyser and a notch filter. Those capabilities allowed us to evaporatively cool our molecular sample to deep quantum degeneracy. Furthermore, the polarization tunability enabled the observation of field-linked resonances and facilitated the creation of field-linked tetramers.These techniques advance the study of ultracold polar molecules and broaden the potential applications of MW tools in other platforms of quantum sciences.",
    "authors": [
      "Shrestha Biswas",
      "Sebastian Eppelt",
      "Christian Buchberger",
      "Xing-Yan Chen",
      "Andreas Schindewolf",
      "Michael Hani",
      "Erwin Biebl",
      "Immanuel Bloch",
      "Xin-Yu Luo"
    ],
    "published": "2025-12-02T18:32:11Z",
    "updated": "2025-12-02T18:32:11Z",
    "categories": [
      "physics.atom-ph",
      "cond-mat.quant-gas",
      "physics.ins-det"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2512.03002v1",
    "url": "https://arxiv.org/abs/2512.03002v1",
    "pdf_url": "https://arxiv.org/pdf/2512.03002v1.pdf",
    "title": "IOTA Experiment for Proton Pulse Compression at Extreme Space-Charge",
    "abstract": "The longitudinal compression of high-intensity, space-charge-dominated proton bunches is a critical requirement for future proton-driven muon colliders. We propose a proton bunch compression experiment at the Integrable Optics Test Accelerator (IOTA) storage ring at Fermilab to investigate optimal radio-frequency (RF) cavity parameters and lattice configurations. IOTA is a compact, fixed-energy storage ring dedicated to beam physics Research and Development and capable of circulating a 2.5 MeV proton beam under extreme space-charge conditions. Using the ImpactX code with its 3D space-charge solver, simulations indicate that the bunch length can be rapidly reduced by at least a factor of two without appreciable degradation of transverse beam quality--even in the strong space-charge regime. However, longitudinal defocusing due to the space-charge remains a significant challenge in short-pulsed intense proton bunches, and the optimization of compression under these conditions is discussed.",
    "authors": [
      "Benjamin Simons",
      "Nilanjan Banerjee",
      "Jeffrey Eldred",
      "Vladimir Shiltsev"
    ],
    "published": "2025-12-02T18:26:06Z",
    "updated": "2025-12-02T18:26:06Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.02990v1",
    "url": "https://arxiv.org/abs/2512.02990v1",
    "pdf_url": "https://arxiv.org/pdf/2512.02990v1.pdf",
    "title": "Characterisation of the LAPPD, a large area microchannel-plate PMT",
    "abstract": "We present a comprehensive characterization of the LAPPD Gen-II, a large-area microchannel-plate photomultiplier tube (MCP-PMT) equipped with a capacitively coupled sensing (readout) electrode. Two detector variants with different geometries and materials were investigated using a picosecond pulsed laser system. We measured the single-photon timing response and spatial charge distribution on segmented readout electrodes. The prompt timing peak exhibits a resolution of approximately 30 ps, with the overall timing structure explained by photoelectron propagation and back-scattering effects from the MCP input surface. We developed analytical models that describe the propagation of photoelectrons and the induced charge spread on the sensing electrodes, including secondary electron backscattering from the resistive anode. The model accurately reproduces the measured device properties and enables performance extrapolations for various detector geometries and dielectric properties. These results provide a predictive framework for optimizing MCP-PMTs for timing- and imaging-critical applications such as RICH detectors in high-energy physics and TOF-PET systems for medical imaging.",
    "authors": [
      "S. Korpar",
      "R. Dolenec",
      "F. Grijalva",
      "A. Lozar",
      "A. Kodrič",
      "P. Križan",
      "S. Parashari",
      "R. Pestotnik",
      "A. Seljak",
      "D. Žontar"
    ],
    "published": "2025-12-02T18:04:32Z",
    "updated": "2025-12-02T18:04:32Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.02887v1",
    "url": "https://arxiv.org/abs/2512.02887v1",
    "pdf_url": "https://arxiv.org/pdf/2512.02887v1.pdf",
    "title": "Discovery and rectification of an error in high resistance traceability at NPL: a case study in how metrology works",
    "abstract": "We broach a seldom-discussed topic in precision metrology; how subtle errors in calibration processes are discovered and remedied. We examine a case study at the National Physical Laboratory (NPL), UK, involving the calibration of DC standard resistors of value 100 MOhm and 1 GOhm. Results from the period 2001 to 2015 were in error by approximately 0.7 parts per million (ppm), with quoted uncertainties (k=2) of 0.4 ppm and 1.6 ppm respectively. Inter-comparisons did not detect the error, mainly because the uncertainty due to the transportation drift of the comparison standards was too large to resolve it. Likewise, research into single-electron current standards did not detect the error because at this resistance value it was on the borderline of statistical significance. The key event was a comparison between PTB (Germany) and NPL (UK) of a new small-current measuring instrument, the ultrastable low-noise current amplifier (ULCA). At that time, the transport stability of the ULCA was not well established. Nevertheless, calibrations of the ULCA at NPL using a 100 MOhm resistor were sufficiently discrepant with the PTB calibrations to motivate a thorough investigation into the NPL traceability chain, which uncovered the error. This instructive episode illustrates a positive interplay between calibration and research activities and shows that cutting-edge calibration uncertainties must be supported by a vigorous research programme. It is also important for NMIs to maintain a comfortable buffer (at least a factor of 10) between their claimed uncertainty and the uncertainty that their customers require, so that small errors can be resolved without significant impact on measurement stakeholders.",
    "authors": [
      "Stephen Giblin"
    ],
    "published": "2025-12-02T15:45:06Z",
    "updated": "2025-12-02T15:45:06Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2505.01208v2",
    "url": "https://arxiv.org/abs/2505.01208v2",
    "pdf_url": "https://arxiv.org/pdf/2505.01208v2.pdf",
    "title": "Impact of magnetic field gradients on the development of the MRI: Applications to binary neutron star mergers and proto-planetary disks",
    "abstract": "The magneto-rotational instability (MRI) is widely believed to play a central role in generating large-scale, poloidal magnetic fields during binary neutron star mergers. However, the few simulations that begin with a weak seed magnetic field and capture its growth until saturation predominantly show the effects of small-scale turbulence and winding, but lack convincing evidence of MRI activity. In this work, we investigate how the MRI is affected by the complex magnetic field topologies characteristic of the post-merger phase, aiming to assess the actual feasibility of MRI in such environments. We first derive the MRI instability criterion, as well as expressions for the characteristic wavelength and growth timescale of the fastest-growing modes, under conditions that include significant magnetic field gradients. Our analysis reveals that strong radial magnetic field gradients can impact significantly on the MRI, slowing its growth or suppressing it entirely if large enough. We then apply this extended framework to both idealized analytical disk models and data from a numerical relativity simulation of a long-lived neutron star merger remnant. We find that conditions favourable to MRI growth on astrophysically relevant timescales may occur only in limited regions of the post-merger disk, and only at late times $t\\gtrsim 100$ ms after the merger. These results suggest that the MRI plays a limited role in amplifying poloidal magnetic fields in post-merger environments during the first $\\mathcal{O}(100)$ms.",
    "authors": [
      "T. Celora",
      "C. Palenzuela",
      "D. Viganò",
      "R. Aguilera-Miret"
    ],
    "published": "2025-05-02T11:51:35Z",
    "updated": "2025-12-02T15:27:36Z",
    "categories": [
      "astro-ph.HE",
      "gr-qc",
      "physics.flu-dyn",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE",
    "doi": "10.1051/0004-6361/202555395"
  },
  {
    "arxiv_id": "2512.02856v1",
    "url": "https://arxiv.org/abs/2512.02856v1",
    "pdf_url": "https://arxiv.org/pdf/2512.02856v1.pdf",
    "title": "Qubit Lattice Algorithm Simulations of the Scattering of a Bounded Two Dimensional Electromagnetic Pulse from an Infinite Planar Dielectric Interface",
    "abstract": "Qubit lattice algorithm (QLA) simulations are performed for a two-dimensional (2D) spatially bounded pulse propagating onto a plane interface between two dielectric slabs. QLA is an initial value scheme that consists of a sequence of unitary collision and streaming operators, with appropriate potential operators, that recover Maxwell equations in inhomogeneous dielectric media to second order in the lattice discreteness. For the case of total internal reflection, there is transient energy transfer into the second medium due to the evanescent fields as the Poynting unit vector of the pulse is rotated from its incident to reflected direction. Because of the finite spatial extent of the pulse, a self-consistent Goos-Hanchen-type displacement along the interface is found without imposing any explicit interface boundary conditions on the fields. For normal incidence. the standard Fresnel coefficients are recovered for appropriately averaged QLA fields. Energy is conserved at all times to seven significant figures.",
    "authors": [
      "Min Soe",
      "George Vahala",
      "Linda Vahala",
      "Efstratios Koukoutsis",
      "Abhay K. Ram",
      "Kyriakos Hizanidis"
    ],
    "published": "2025-12-02T15:13:33Z",
    "updated": "2025-12-02T15:13:33Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.02771v1",
    "url": "https://arxiv.org/abs/2512.02771v1",
    "pdf_url": "https://arxiv.org/pdf/2512.02771v1.pdf",
    "title": "Position-Sensitive Silicon Photomultiplier Array with Enhanced Position Reconstruction by means of a Deep Neural Network",
    "abstract": "Single-photon sensitive detectors like Silicon Photomultipliers are widely used in many medical imaging applications. By using detectors with position resolutions, it is possible to build compact photodetector readouts with reduced number of channels, but still preserving position resolution and gamma-rays imaging capabilities. In this work, we present the advantage of using a Deep Neural Networks (DNNs) light position reconstruction applied to a 2x2 array of linearly-graded SiPMs (LG-SiPMs), to minimize the distortions on the reconstructed event maps. Our approach significantly enhances both the resolution and linearity of position detection compared to the nominal reconstruction formula based on the device architecture. Remarkably, the DNN-based reconstruction boosts the number of resolved areas (pixels) by a factor of at least 5.7, allowing a higher level of precision and performance in light detection.",
    "authors": [
      "Cyril Alispach",
      "Fabio Acerbi",
      "Hossein Arabi",
      "Domenico della Volpe",
      "Alberto Gola",
      "Aramis Raiola",
      "Habib Zaidi"
    ],
    "published": "2025-12-02T13:50:53Z",
    "updated": "2025-12-02T13:50:53Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "physics.data-an"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.26437v2",
    "url": "https://arxiv.org/abs/2509.26437v2",
    "pdf_url": "https://arxiv.org/pdf/2509.26437v2.pdf",
    "title": "Evaluation of CZT Detector Performance in Alpha and Gamma Spectrometry",
    "abstract": "Presented is a work on the performance studies of Cadmium Zinc Telluride (CZT) planar detector structures. Current-voltage (IV), capacitance-voltage (CV), and gamma- and alpha-spectroscopy measurements were carried out to provide the essential baseline required for forthcoming defect configuration impact studies on the detector spectroscopy performance. For each tested sensor, spectroscopic responses were recorded with several bias voltages applied. The described suite of measurements provides the parameters needed to evaluate, bulk resistivity, signal efficiency, and energy resolution for characteristic peaks at different energies. Readout configurations and data processing are discussed in related sections.",
    "authors": [
      "N. Kramarenko",
      "M. Väänänen",
      "M. Kalliokoski",
      "M. Bezak",
      "R. Turpeinen",
      "A. Winkler"
    ],
    "published": "2025-09-30T15:56:06Z",
    "updated": "2025-12-02T13:35:43Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.02613v1",
    "url": "https://arxiv.org/abs/2512.02613v1",
    "pdf_url": "https://arxiv.org/pdf/2512.02613v1.pdf",
    "title": "New 1mm thick Silicon Drift Detectors for future researches of Kaonic Atoms and the Pauli Exclusion principle",
    "abstract": "Kaonic atoms, formed when a negatively charged kaon replaces an electron, provide a sensitive probe of the low-energy strong interaction via precision X-ray spectroscopy. The SIDDHARTA-2 experiment at the DA$Φ$NE collider employs high-performance Silicon Drift Detectors (SDDs) optimized for the 4-12 keV range to study light kaonic systems. In preparation for the EXKALIBUR phase, which targets heavier kaonic atoms, new 1 mm-thick SDDs have been developed with Politecnico di Milano and Fondazione Bruno Kessler. Their increased thickness enhances the quantum efficiency by a factor of about two at 30 keV while preserving excellent energy resolution. These detectors are also intended for VIP-3, the next-generation test of the Pauli Exclusion Principle (PEP). Building on VIP-2, which set the most stringent limits on PEP-violating $K_α$ transitions in copper, VIP-3 will extend the search to heavier elements such as Ag, Sn, and Zr. Preliminary measurements demonstrate efficient detection up to 30 keV, supporting future high-precision studies of the kaon-nucleon interaction and PEP in heavier systems.",
    "authors": [
      "F. Clozza",
      "F. Sgaramella",
      "L. Abbene",
      "F. Artibani",
      "M. Bazzi",
      "G. Borghi",
      "D. Bosnar",
      "M. Bragadireanu",
      "A. Buttacavoli",
      "M. Carminati",
      "A. Clozza",
      "R. Del Grande",
      "L. De Paolis",
      "E. Demenev",
      "C. Fiorini",
      "I. Friščić",
      "C. Guaraldo",
      "M. Iliescu",
      "M. Iwasaki",
      "A. Khreptak",
      "S. Manti",
      "J. Marton",
      "P. Moskal",
      "H. Ohnishi",
      "K. Piscicchia",
      "F. Principato",
      "A. Samusenko",
      "A. Scordo",
      "D. Sirghi",
      "F. Sirghi",
      "M. Skurzok",
      "A. Spallone",
      "K. Toho",
      "J. Zmeskal",
      "N. Zorzi",
      "C. Curceanu"
    ],
    "published": "2025-12-02T10:18:31Z",
    "updated": "2025-12-02T10:18:31Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.02599v1",
    "url": "https://arxiv.org/abs/2512.02599v1",
    "pdf_url": "https://arxiv.org/pdf/2512.02599v1.pdf",
    "title": "CZT Detectors for kaonic atoms spectroscopy",
    "abstract": "Cadmium zinc telluride (CZT) detectors offer excellent room-temperature energy resolution, making them well suited for X- and $γ$-ray spectroscopy in challenging environments. Within the SIDDHARTA-2 program at the DA$Φ$NE collider, a new CZT-based detection system has been developed to enable precision measurements of kaonic atom transitions in the intermediate mass range. In this work, we report the results of a calibration campaign performed with the collider operating, aimed at assessing the detector performance. A dedicated setup, including an array of quasi-hemispherical CZT sensors and a $^{152}$Eu source, was used to characterize the spectral response. The reconstructed emission lines were fitted with a model accounting for Gaussian response and incomplete charge recollection tails, and the detector linearity was evaluated by comparing the measured peak positions with their nominal energies. The results demonstrate that the CZT detector exhibits excellent linearity and stable operation with the collider on, confirming its suitability for future kaonic-atom spectroscopy at DA$Φ$NE.",
    "authors": [
      "Francesco Artibani",
      "Leonardo Abbene",
      "Antonino Buttacavoli",
      "Manuele Bettelli",
      "Gaetano Gerardi",
      "Fabio Principato",
      "Andrea Zappettini",
      "Massimiliano Bazzi",
      "Giacomo Borghi",
      "Damir Bosnar",
      "Mario Bragadireanu",
      "Marco Carminati",
      "Alberto Clozza",
      "Francesco Clozza",
      "Raffaele Del Grande",
      "Luca De Paolis",
      "Carlo Fiorini",
      "Ivica Friscic",
      "Carlo Guaraldo",
      "Mihail Iliescu",
      "Masahiko Iwasaki",
      "Aleksander Khreptak",
      "Simone Manti",
      "Johann Marton",
      "Pawel Moskal",
      "Fabrizio Napolitano",
      "Hiroaki Ohnishi",
      "Kristian Piscicchia",
      "Francesco Sgaramella",
      "Michal Silarski",
      "Diana Laura Sirghi",
      "Florin Sirghi",
      "Magdalena Skurzok",
      "Antonio Spallone",
      "Kairo Toho",
      "Oton Vazquez Doce",
      "Johann Zmeskal",
      "Catalina Curceanu",
      "Alessandro Scordo"
    ],
    "published": "2025-12-02T10:05:33Z",
    "updated": "2025-12-02T10:05:33Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2505.04216v2",
    "url": "https://arxiv.org/abs/2505.04216v2",
    "pdf_url": "https://arxiv.org/pdf/2505.04216v2.pdf",
    "title": "Computational Model for Photoionization in Pure SF6 Streamer at 1-15 atm",
    "abstract": "Photoionization plays a crucial role in achieving accurate quantitative predictions in SF6 streamer simulations, but accurate models for SF6 photoionization remains limited, motivating this paper. First, we develop a computational model for SF6 photoionization and provide the detailed theoretical modeling process, as well as comparison between experiment and simulation. A concise summary of model parameters within the comprehensive pressure range of 1 - 15 atm is provided for direct reference. Then, we perform comparative studies against simplified approaches. The results demonstrate that the proposed model effectively captures the non-local effects of SF6 photoionization, enhancing both the spatial numerical convergence and the accuracy of the streamer structure. Finally, we perform comparative studies by artificially increasing the photoionization intensity through multiplying the photoionization source term Sph by a factor of 50 (50*Sph) relative to the baseline intensity. Regarding breakdown voltage prediction, 50*Sph leads to a significant underestimation of the breakdown voltage for positive streamers, introducing errors greater than 0.5 kV, while exerting a small impact on negative streamers. Regarding streamer propagation dynamics, the radius of the positive streamer head exhibits pronounced shrinking, and 50*Sph reduces this shrinking and significantly lowers the head field by more than 700 Td. In contrast, 50*Sph has little impact on the morphology of the negative streamers and slightly enhances the head field by less than 30 Td.",
    "authors": [
      "Zihao Feng",
      "Liyang Zhang",
      "Xiaobing Zou",
      "Haiyun Luo"
    ],
    "published": "2025-05-07T08:10:39Z",
    "updated": "2025-12-02T07:05:10Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1088/1361-6595/ae259e"
  },
  {
    "arxiv_id": "2511.10096v2",
    "url": "https://arxiv.org/abs/2511.10096v2",
    "pdf_url": "https://arxiv.org/pdf/2511.10096v2.pdf",
    "title": "Tailored Three Dimensional Betatron Dynamics in UltraStable Hybrid Laser Plasma RF Accelerators",
    "abstract": "The detailed theoretical and numerical investigation of hybrid laser plasma RF accelerators, elucidating the mechanisms governing transverse beam dynamics, betatron polarization, and radiation reaction in ultra-relativistic electron bunches is presented. This framework combines analytical models of spatiotemporal plasma wakefield modulation, phase-dependent RF-driven oscillations, and quantum-corrected Landau Lifshitz radiation reaction with fully self-consistent 3D particle in cell simulations using EPOCH. The results demonstrate that RF amplitude, frequency, and phase enable precise control over transverse focusing strengths, betatron oscillation amplitudes, and polarization states. Resonant alignment between RF fields and natural betatron frequencies amplifies transverse excursions while damping parasitic oscillations through enhanced focusing gradients and radiation reaction, yielding reductions in emittance and mitigation of synchrotron-like energy losses. Stability maps and 3D force landscapes reveal strong phase sensitivity, where initial conditions and RF component ratios govern the temporal evolution of betatron amplitudes, and longitudinal field gradients modulate γ growth rates. These findings provide a comprehensive picture of nonlinear, resonant, and damping phenomena in hybrid laser plasma RF systems, highlighting the full spectrum of controllable transverse, longitudinal, and polarization dynamics in ultra relativistic electron beams.",
    "authors": [
      "A. A. Molavi Choobini",
      "M. Shahmansouri"
    ],
    "published": "2025-11-13T08:55:18Z",
    "updated": "2025-12-02T06:44:10Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.02433v1",
    "url": "https://arxiv.org/abs/2512.02433v1",
    "pdf_url": "https://arxiv.org/pdf/2512.02433v1.pdf",
    "title": "Study of fully coupled 3D envelope instability using automatic differentiation",
    "abstract": "Auto-differentiation is a powerful tool for computing derivatives of simulation results with respect to given parameters. In this letter, we have applied this tool to investigate the instability of a dynamics system that is governed by 21 ordinary differential equations. This second-order instability (named envelope instability) is driven by space-charge effects and has significant impact on the operational regimes of particle accelerators. Our study delves into the three-dimensional envelope instability, incorporating both transverse and longitudinal coupling. Conventionally, analyzing this complex system would necessitate solving 441 ordinary differential equations, which is computationally intractable. However, by employing auto-differentiation, we were able to track only 21 equations. This approach allowed us to uncover an additional instability stopband, which arises from space-charge-induced coupling and has not been reported in previous studies. This research highlights the significant advantages of auto-differentiation in analyzing complicated dynamical systems involving a large number of ordinary differential equations.",
    "authors": [
      "Ji Qiang"
    ],
    "published": "2025-12-02T05:38:07Z",
    "updated": "2025-12-02T05:38:07Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.02426v1",
    "url": "https://arxiv.org/abs/2512.02426v1",
    "pdf_url": "https://arxiv.org/pdf/2512.02426v1.pdf",
    "title": "Progress in relativistic laser-plasma interaction with kilotesla-level applied magnetic fields",
    "abstract": "We report on progress in the understanding of the effects of kilotesla-level applied magnetic fields on relativistic laser-plasma interactions. Ongoing advances in magnetic-field-generation techniques enable new and highly desirable phenomena, including magnetic-field-amplification platforms with reversible sign, focusing ion acceleration, and bulk-relativistic plasma heating. Building on recent advancements in laser-plasma interactions with applied magnetic fields, we introduce simple models for evaluating the effects of applied magnetic fields in magnetic-field amplification, sheath-based ion acceleration, and direct laser acceleration. These models indicate the feasibility of observing beneficial magnetic-field effects under experimentally relevant conditions and offer a starting point for future experimental design.",
    "authors": [
      "K. Weichman",
      "A. P. L. Robinson",
      "M. Murakami",
      "J. J. Santos",
      "S. Fujioka",
      "T. Toncian",
      "J. P. Palastro",
      "A. V. Arefiev"
    ],
    "published": "2025-12-02T05:17:21Z",
    "updated": "2025-12-02T05:17:21Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1063/5.0089781"
  },
  {
    "arxiv_id": "2512.02420v1",
    "url": "https://arxiv.org/abs/2512.02420v1",
    "pdf_url": "https://arxiv.org/pdf/2512.02420v1.pdf",
    "title": "Laser-driven electrodynamic implosion of fast ions in a thin shell",
    "abstract": "Collision of laser-driven subrelativistic high density ion flows provides a way to create extremely compressed ion conglomerates and study their properties. This paper presents a theoretical study of the electrodynamic implosion of ions inside a hollow spherical or cylindrical shell irradiated by femtosecond petawatt laser pulses. We propose to apply a very effective mechanism for ion acceleration in a selfconsistent field with strong charge separation, based on the oscillation of laser accelerated fast electrons in this field near the thin shell. Fast electrons are generated on the outer side of the shell under irradiation by the intense laser pulses. It is shown that ions, in particular protons, may be accelerated at the implosion stage to energies of tens and hundreds of MeV when a sub-micrometer shell is irradiated by femtosecond laser pulses with an intensity of 10^21 - 10^23 W cm^-2. .",
    "authors": [
      "S. Yu. Guskov",
      "Ph. Korneev",
      "M. Murakami"
    ],
    "published": "2025-12-02T05:04:33Z",
    "updated": "2025-12-02T05:04:33Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1063/5.0156113"
  },
  {
    "arxiv_id": "2512.02415v1",
    "url": "https://arxiv.org/abs/2512.02415v1",
    "pdf_url": "https://arxiv.org/pdf/2512.02415v1.pdf",
    "title": "Integrated Sliding-Short/Probe Tuner with Doorknob Transition for High-Q Cavities",
    "abstract": "We present an integrated three-knob tuner that internalizes impedance matching inside the launch adapter of a waveguide-fed, high-$Q$ cavity. The tuner combines a waveguide sliding short, a doorknob transition, and a micrometer-driven adjustable coaxial probe. A transmission-line/ABCD model is derived that maps the three mechanical degrees of freedom to the electrical objectives $Γ\\rightarrow 0$, $β$, and $Q_{\\rm L}$, explicitly including the fused-silica feedthrough capacitance. The model yields closed-form matching conditions and predicts the critical-coupling set. Full-wave FEM simulations and bench measurements validate the approach: with $h \\approx 0.55$~mm and backshort distance $\\approx 0.80$~mm, the return loss reaches $|S_{11}| \\approx -30$~dB near 17.8--18.1~GHz while sustaining peak electric fields of $\\sim 1.8 \\times 10^5$~V/m at the nozzle (normalized to 1~W). The measured through loss of the launch assembly is $|S_{21}| \\approx 0.7$--$0.8$~dB at resonance.   A parametric study shows that backshort lengths $L_{\\rm {bs}} \\geq 0.5 λ_{\\rm g}$ excite a parasitic stub resonance, introducing a second $S_{11}$ minimum and localizing energy behind the doorknob; keeping $L_{\\rm {bs}} \\leq 0.4 λ_g$ avoids this. In helium plasma discharges at $P_{\\rm {in}} = 10$~W, \\textit{in-situ} retuning of the short and probe maintained a favorable match as the plasma impedance evolved, increasing absorbed power from $\\sim 43\\%$ to $\\sim 76\\%$ while increasing helium propellant flow rate from 25 to 351~sccm. The compact tuner eliminates external stub boxes and generalizes to other waveguide-coupled resonators and plasma sources.",
    "authors": [
      "Saptarshi Biswas",
      "Sven G. Bilén"
    ],
    "published": "2025-12-02T04:55:00Z",
    "updated": "2025-12-02T04:55:00Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.01887v2",
    "url": "https://arxiv.org/abs/2511.01887v2",
    "pdf_url": "https://arxiv.org/pdf/2511.01887v2.pdf",
    "title": "Modeling formation and transport of clusters at high temperature and pressure gradients by implying partial chemical equilibrium",
    "abstract": "A theoretical approach to describing transport of an entire ensemble of clusters with different sizes as a single species in gas has been developed. The major assumption is an existence of local partial chemical equilibrium between the clusters. It is shown that thermal diffusion emerges in the collective description as a significant factor even if it is negligible when transport of the original molecular species is considered. Analytical expressions for the effective diffusion and thermal diffusion coefficients at temperature, pressure, and chemical composition gradients have been derived. The theory has been applied to a technology of H2S conversion in a centrifugal plasma-chemical reactor and has made it possible to account for sulfur clusters in numerical process modeling.",
    "authors": [
      "Eugene V. Stepanov",
      "Alexander F. Gutsol"
    ],
    "published": "2025-10-24T20:29:42Z",
    "updated": "2025-12-02T02:35:33Z",
    "categories": [
      "physics.chem-ph",
      "physics.atm-clus",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.chem-ph"
  },
  {
    "arxiv_id": "2512.02317v1",
    "url": "https://arxiv.org/abs/2512.02317v1",
    "pdf_url": "https://arxiv.org/pdf/2512.02317v1.pdf",
    "title": "Rare Event Searches Using Cryogenic Detectors via Direct Detection Methods",
    "abstract": "Cryogenic detectors are at the forefront of rare-event search experiments, including direct detection of dark matter, coherent elastic neutrino-nucleus scattering, neutrinoless double-beta decay, and searches for fractionally charged particles. Their unique ability to achieve ultra-low energy thresholds, typically O(eV-100 eV), together with excellent energy resolution and effective background suppression, makes them sensitive to extremely faint signals from rare interactions. These rare particle interactions produce phonons, ionization, or scintillation, depending on the target medium, which are registered by specialized sensors and converted into measurable signals. This review summarizes the underlying detection principles, surveys major experiments and recent results, examines forthcoming initiatives, and outlines the evolving role of cryogenic detectors in advancing the frontiers of rare-event physics.",
    "authors": [
      "S. Das",
      "R. Dey",
      "V. K. S. Kashyap",
      "B. Mohanty",
      "D. Mondal",
      "S. Banik",
      "M. Chaudhuri",
      "V. Iyer"
    ],
    "published": "2025-12-02T01:21:36Z",
    "updated": "2025-12-02T01:21:36Z",
    "categories": [
      "hep-ex",
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2512.02292v1",
    "url": "https://arxiv.org/abs/2512.02292v1",
    "pdf_url": "https://arxiv.org/pdf/2512.02292v1.pdf",
    "title": "Solitary Alfvén Waves",
    "abstract": "We present a three-dimensional numerical model of a solitary spherically polarized Alfvén wave packet -- an Alfvénon, characterized by open field-line topology and magnetic field reversals, resembling the switchbacks observed by Parker Solar Probe to be a nearly ubiquitous feature of turbulence in the inner heliosphere. Direct magnetohydrodynamic simulations of the constructed Alfvénon demonstrates remarkable stability, confirming its nature as an exact, nonlinear solution of the ideal MHD equations.",
    "authors": [
      "Zesen Huang",
      "Marco Velli",
      "Chen Shi",
      "Yuliang Ding"
    ],
    "published": "2025-12-02T00:15:37Z",
    "updated": "2025-12-02T00:15:37Z",
    "categories": [
      "astro-ph.SR",
      "astro-ph.HE",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2106.11404v16",
    "url": "https://arxiv.org/abs/2106.11404v16",
    "pdf_url": "https://arxiv.org/pdf/2106.11404v16.pdf",
    "title": "Maintaining a discharge using a travelling electromagnetic wave results in a linear decrease in electron density along the plasma column. This distribution corresponds to the power dissipated by the wave to heat electrons in the gas",
    "abstract": "A new category of plasma emerged at the end of the 1970s. It consists of a column of plasma maintained by the electric field component of radiofrequency (RF) and microwave (MW) waves that propagate at the interface between the outer surface of the dielectric tube containing the plasma and the ambient air (vacuum). This plasma column is known as a travelling wave discharge (TWD) and has the property that its length increases with the absorbed RF and MW power. It is also perfectly stable and reproducible. The electron density of this plasma column decreases linearly along its axis until it drops abruptly to a non-zero value, marking the end of wave propagation. The slope of its distribution depends solely on the externally set operating parameters, namely the pressure of the carrier gas, the frequency of the wave and the inner radius of the discharge tube. The model presented in this article is the only one that can reproduce all the experimental data exactly, particularly that relating to the end of the column, a feat that no other published model has achieved. Most publications on TWDs nowadays concern applications, and this field is growing all the time. Interest in TWDs began with the arrival of efficient RF and MW field applicators, which occupy only a few centimetres of the resulting plasma column that can eventually extend to several metres. The Surfatron, Surfaguide, waveguide Surfatron, Ro-Box and TIAGO (plasma in ambient gas) are all devices that are already in widespread use. All these devices have been patented, which testifies to the interest in the potential applications of TWDs. Another outstanding feature is their unrivalled wide range of operating parameters: gas pressure p (from a few mTorr (Pa) to at least twice atmospheric pressure); field frequency f (from a few MHz to at least 10 GHz); and tube inner radius R (from 0.5 mm to at least 150 mm)",
    "authors": [
      "Michel Moisan"
    ],
    "published": "2021-06-21T20:37:34Z",
    "updated": "2025-12-01T23:29:34Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.02244v1",
    "url": "https://arxiv.org/abs/2512.02244v1",
    "pdf_url": "https://arxiv.org/pdf/2512.02244v1.pdf",
    "title": "A novel method for thermal noise reduction, enabling measurements of broadband, low-amplitude electron temperature fluctuations using individual radiometer channels",
    "abstract": "A new analysis method has been developed for measurements of broadband, low-amplitude turbulent electron temperature fluctuations in fusion plasmas using individual radiometer channels of a Correlation Electron Cyclotron Emission (CECE) diagnostic. This method takes advantage of differences in the correlation time of thermal noise compared to the correlation time of plasma fluctuations in fusion reactors. The validation of this single-channel method is demonstrated using comparisons with the standard dual-channel radiometer spectral decorrelation method for measurements of turbulent electron temperature fluctuations in the core and edge of low confinement (L), improved confinement (I), and high confinement (H)-mode plasmas at the ASDEX Upgrade tokamak.",
    "authors": [
      "Christian Yoo",
      "Garrard D. Conway",
      "Jacob Schellpfeffer",
      "Rachel Bielajew",
      "Klara Hoefler",
      "Diego J. Cruz-Zabala",
      "David Cusick",
      "William Burke",
      "Branka Vanovac",
      "Anne E. White",
      "the ASDEX Upgrade Team"
    ],
    "published": "2025-12-01T22:23:40Z",
    "updated": "2025-12-01T22:23:40Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.02205v1",
    "url": "https://arxiv.org/abs/2512.02205v1",
    "pdf_url": "https://arxiv.org/pdf/2512.02205v1.pdf",
    "title": "Proton Dynamics Scenarios in the Integrable Optics Test Accelerator (IOTA) at Fermilab",
    "abstract": "The Integrable Optics Test Accelerator (IOTA) at Fermilab provides a versatile platform for studying the interplay of space-charge, impedance, and non-linear optics in high-intensity hadron beams within synchrotrons and storage rings. This report examines the parameters and dynamics of 2.5~MeV proton beam operations in two configurations of the bare IOTA lattice: one for demonstrating Non-linear Integrable Optics with the Danilov-Nagaitsev magnet, and the other for use with electron cooling. We offer order-of-magnitude estimates of the transverse emittance growth rate as a function of beam intensity, highlighting contributions from residual gas scattering, intra-beam scattering, and space-charge effects. Under nominal conditions, the beam lifetime is projected to be less than 7~minutes at low intensity with the current vacuum quality, and fewer than 100,000~turns at high intensity due to strong space-charge effects. The calculations presented here will guide strategies to mitigate emittance growth and inform future IOTA experiments.",
    "authors": [
      "N. Banerjee",
      "A. Romanov",
      "G. Stancari",
      "M. Wallbank"
    ],
    "published": "2025-12-01T20:52:57Z",
    "updated": "2025-12-01T20:52:57Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.02183v1",
    "url": "https://arxiv.org/abs/2512.02183v1",
    "pdf_url": "https://arxiv.org/pdf/2512.02183v1.pdf",
    "title": "Observation of Electromagnetic Transients in a Nb3Sn 4-layer Dipole Mirror Magnet",
    "abstract": "During testing of the Stress Managed Cosine-Theta dipole mirror magnet SMCTM1, magnet quenches were observed following large voltage spikes in the half-coil voltage taps which preceded normal quench initiation. Following some recent work at CERN measuring power current converter transients in relation to flux jumps, an additional differential current probe was added to the magnet instrumentation. Measurements of this probe, as well as the half coil voltage taps show a fast and substantial current change preceding the quench, hinting at coil motion. A simple model based on relative shift of the inner and outer layer coils was developed which suggests the magnitude of coil shift events is on the estimated relative coil shift from the magnet constraint conditions. The behavior is shown to be reversible and characteristic of stick-slip.",
    "authors": [
      "Steven Krave",
      "Maria Baldini",
      "Igor Novitski"
    ],
    "published": "2025-12-01T20:24:20Z",
    "updated": "2025-12-01T20:24:20Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.1109/TASC.2025.3638293"
  },
  {
    "arxiv_id": "2512.02129v1",
    "url": "https://arxiv.org/abs/2512.02129v1",
    "pdf_url": "https://arxiv.org/pdf/2512.02129v1.pdf",
    "title": "Dynamo and Jet interconnections in GRMHD simulations of black hole accretion disks",
    "abstract": "We present global 3D GRMHD simulations of black hole (BH) accretion disks designed to investigate how MRI-driven dynamo action regulates jet formation and evolution. Unlike standard SANE/MAD setups that impose a coherent large-scale poloidal loop, our \"sub-SANE\" initial conditions use multiple same-polarity small-scale magnetic loops. Rapid reconnection erases magnetic memory and enables large-scale dynamo to emerge early from MRI turbulence. We perform two such sub-SANE simulations at different BH spins ($a = 0.5, 0.9375$) and compare them with conventional SANE runs. The sub-SANE disks show regular large-scale dynamo cycles with periods of about ten orbits. Decomposition of the induction equation shows that the turbulent dynamo term is stronger in 3D compared to 2.5D and balances advection in the saturated state, confirming sustained large-scale field generation. These dynamo-generated fields are advected inward with minimal time lag, producing correlated peaks in both poloidal and toroidal field strengths from $r_{\\rm max}$ to the horizon. Early in the evolution, these peaks imprint directly onto the jet's electromagnetic energy flux, indicating that the jet mirrors the dynamo wave. Though jets form at early times, the sub-SANE runs eventually undergo jet shutdown. We show that this occurs when the magnetic field at the horizon loses coherence, as quantified by a decline in the signed-to-unsigned flux ratio $\\mathcal{C}_{\\rm BH}$ below $\\approx 0.6$. In contrast, the SANE reference case with similar accretion rate and horizon magnetic flux maintains high magnetic coherence because its initial large-scale field persists, allowing its jet to survive. Our results show that both dynamo-driven field evolution and horizon magnetic-field coherence critically regulate jet longevity, establishing a direct dynamo-jet connection in GRMHD disks.",
    "authors": [
      "P. S. Santhiya",
      "Pallavi Bhat",
      "Prayush Kumar",
      "Tushar Mondal",
      "Indu K. Dihingia"
    ],
    "published": "2025-12-01T19:00:44Z",
    "updated": "2025-12-01T19:00:44Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2506.04844v2",
    "url": "https://arxiv.org/abs/2506.04844v2",
    "pdf_url": "https://arxiv.org/pdf/2506.04844v2.pdf",
    "title": "Characterization of the Hamamatsu R12699-406-M4 Photomultiplier Tube in Cold Xenon Environments",
    "abstract": "The Hamamatsu R12699-406-M2 is a $2\\times2$ multi-anode 2-inch photomultiplier tube that offers a compact form factor, low intrinsic radioactivity, and high photocathode coverage. These characteristics make it a promising candidate for next-generation xenon-based direct detection dark matter experiments, such as XLZD and PandaX-xT. We present a detailed characterization of this photosensor operated in cold xenon environments, focusing on its single photoelectron response, dark count rate, light emission, and afterpulsing behavior. The device demonstrated a gain exceeding $2\\cdot 10^6$ at the nominal voltage of -1.0 kV, along with a low dark count rate of $(0.4\\pm0.2)\\;\\text{Hz/cm}^2$. Due to the compact design, afterpulses exhibited short delay times, resulting in some cases in an overlap with the light-induced signal. To evaluate its applicability in a realistic detector environment, two R12699-406-M2 units were deployed in a small-scale dual-phase xenon time projection chamber. The segmented $2\\times2$ anode structure enabled lateral position reconstruction using a single photomultiplier tube, highlighting the potential of the sensor for effective event localization in future detectors.",
    "authors": [
      "M. Adrover",
      "L. Baudis",
      "A. Bismark",
      "A. P. Colijn",
      "J. J. Cuenca-García",
      "M. P. Decowski",
      "M. Flierman",
      "T. den Hollander"
    ],
    "published": "2025-06-05T10:11:04Z",
    "updated": "2025-12-01T17:42:16Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2301.07089v2",
    "url": "https://arxiv.org/abs/2301.07089v2",
    "pdf_url": "https://arxiv.org/pdf/2301.07089v2.pdf",
    "title": "Problems of studying $γγ\\to γγ$ scattering at $e^+e^-$, $e^-e^-$ and $γγ$ colliders",
    "abstract": "The process of elastic scattering of photons (scattering of light by light) has attracted much attention in recent years. It goes through a loop where all the charged particles contribute to the cross section. To date, this $γγ\\to γγ$ process has been experimentally studied in the Delbrück scattering and splitting of photons in the Coulomb field of the nucleus, as well as at the LHC in the scattering of virtual photons in ion-ion collisions. Hopes for further study of this process are associated with high-luminosity $e^+e^-$ colliders (SuperKEKb, FCC, CEPC, ILC, CLIC) and gamma-gamma colliders based on the Compton scattering of laser photons on electrons. In this article, we show that there are some very serious background processes where the annihilation of electrons and positrons (real and virtual) produces a pair of photons flying into the detector, and the the remaining products fly away from the detector at small angles.",
    "authors": [
      "K. I. Beloborodov",
      "T. A. Kharlamova",
      "V. I. Telnov"
    ],
    "published": "2023-01-17T18:54:53Z",
    "updated": "2025-12-01T16:44:34Z",
    "categories": [
      "hep-ph",
      "hep-ex",
      "physics.acc-ph"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2512.01855v1",
    "url": "https://arxiv.org/abs/2512.01855v1",
    "pdf_url": "https://arxiv.org/pdf/2512.01855v1.pdf",
    "title": "Beam-test evaluation of pre-production Low Gain Avalanche Detectors for the ATLAS High Granularity Timing Detector",
    "abstract": "The High Granularity Timing Detector (HGTD) will be installed in the ATLAS experiment as part of the Phase-II upgrade for the High Luminosity-Large Hadron Collider (HL-LHC). It will mitigate pile-up effects in the forward region, and measure per bunch luminosity. The design of HGTD is based on Low Gain Avalanche Detector (LGAD) sensors. This paper presents the results of beam-test campaigns conducted at CERN and DESY in 2023 and 2024 on single LGADs from HGTD pre-production test structures, before and after neutron irradiation up to fluences of $2.5 \\times 10^{15}~\\mathrm{n_{eq}/cm^2}$. The tested LGADs can meet HGTD requirements in terms of charge collection, time resolution, and hit efficiency, even under HL-LHC end-of-life conditions, supporting their deployment in the final detector.",
    "authors": [
      "A. Aboulhorma",
      "M. Ait Tamlihat",
      "H. M. Alfanda",
      "O. Atanova",
      "N. Atanov",
      "I. Azzouzi",
      "J. Barreiro Guimarães da Costa",
      "T. Beau",
      "D. Benchekroun",
      "F. Bendebba",
      "G. Bergamin",
      "Y. Bimgdi",
      "A. Blot",
      "A. Boikov",
      "J. Bonis",
      "D. Boumediene",
      "C. Brito",
      "A. S. Brogna",
      "A. M. Burger",
      "L. Cadamuro",
      "Y. Cai",
      "N. Cartalade",
      "R. Casanova Mohr",
      "R. Cherkaoui El Moursli",
      "Y. Che",
      "X. Chen",
      "E. Y. S. Chow",
      "L. D. Corpe",
      "C. G. Crozatier",
      "L. D'Eramo",
      "S. Dahbi",
      "D. Dannheim",
      "G. Daubard",
      "Y. Davydov",
      "J. Debevc",
      "Y. Degerli",
      "E. Delagnes",
      "F. Deliot",
      "M. Dhellot",
      "P. Dinaucourt",
      "G. Di Gregorio",
      "P. J. Dos Santos De Assis",
      "C. Duan",
      "O. Duarte",
      "F. Dulucq",
      "J. Ehrecke",
      "Y. El Ghazali",
      "A. El Moussaouy",
      "A. Falou",
      "L. Fan",
      "Y. Fan",
      "Z. Fan",
      "K. Farman",
      "F. Fassi",
      "Y. Feng",
      "M. Ferreira",
      "F. Filthaut",
      "F. Fischer",
      "P. Fusté",
      "J. Fu",
      "J. García Rodriquez",
      "G. Gaspar De Andrade",
      "V. Gautam",
      "Z. Ge",
      "R. Gonçalo",
      "M. Gouighri",
      "S. Grinstein",
      "K. Gritsay",
      "F. Guilloux",
      "S. Guindon",
      "A. Haddad",
      "S. E. D. Hammoud",
      "L. Han",
      "A. M. Henriques Correia",
      "M. Hidaoui",
      "B. Hiti",
      "J. Hofner",
      "S. Hou",
      "P. J. Hsu",
      "X. Huang",
      "Y. Huang",
      "K. Hu",
      "C. Insa",
      "J. Jeglot",
      "X. Jia",
      "G. Kramberger",
      "M. Kuriyama",
      "B. Y. Ky",
      "D. Lacour",
      "A. Lafarge",
      "B. Lakssir",
      "A. Lantheaume",
      "D. Laporte",
      "C. de La Taille",
      "M. A. L. Leite",
      "A. Leopold",
      "H. Li",
      "L. Li",
      "M. Li",
      "S. Li",
      "S. Li",
      "Y. Li",
      "Z. Li",
      "S. Liang",
      "Z. Liang",
      "B. Liu",
      "K. Liu",
      "K. Liu",
      "Y. L. Liu",
      "Y. W. Liu",
      "F. L. Lucio Alves",
      "M. Lu",
      "Y. J. Lu",
      "F. Lyu",
      "D. Macina",
      "R. Madar",
      "N. Makovec",
      "S. Malyukov",
      "I. Mandić",
      "T. Manoussos",
      "S. Manzoni",
      "G. Martin-Chassard",
      "F. Martins",
      "L. Masetti",
      "R. Mazini",
      "E. Mazzeo",
      "K. Ma",
      "X. Ma",
      "R. Menegasso",
      "J-P. Meyer",
      "Y. Miao",
      "A. Migayron",
      "M. Mihovilovic",
      "M. Milovanovic",
      "M. Missio",
      "V. Moskalenko",
      "N. Mouadili",
      "A. Moussa",
      "I. Nikolic-Audit",
      "C. C. Ohm",
      "H. Okawa",
      "S. Okkerman",
      "M. Ouchrif",
      "C. Pénélaud",
      "A. Parreira",
      "B. Pascual Dias",
      "R. E. de Paula",
      "J. Pinol Bel",
      "P. -O. Puhl",
      "C. Puigdengoles Olive",
      "M. Puklavec",
      "J. Qin",
      "M. Qi",
      "H. Ren",
      "H. Riani",
      "S. Ridouani",
      "V. Rogozin",
      "L. Royer",
      "F. Rudnyckyj",
      "E. F. Saad",
      "G. T. Saito",
      "A. Salem",
      "H. Santos",
      "S. Scarfi",
      "Ph. Schwemling",
      "N. Seguin-Moreau",
      "L. Serin",
      "R. P. Serrano Fernandez",
      "A. Shaikovskii",
      "Q. Sha",
      "L. Shan",
      "R. Shen",
      "X. Shi",
      "P. Skomina",
      "H. Smitmanns",
      "H. L. Snoek",
      "A. P. Soulier",
      "A. Stein",
      "H. Stenzel",
      "J. Strandberg",
      "W. Sun",
      "X. Sun",
      "Y. Sun",
      "Y. Tan",
      "K. Tariq",
      "Y. Tayalati",
      "S. Terzo",
      "A. Torrento Coello",
      "S. Trincaz-Duvoid",
      "U. M. Vande Voorde",
      "I. Velkovska",
      "R. P. Vieira",
      "L. A. Vieira Lopes",
      "A. Visibile",
      "A. Wang",
      "C. Wang",
      "S. M. Wang",
      "T. Wang",
      "T. Wang",
      "W. Wang",
      "Y. Wang",
      "Y. Wang",
      "J. Wan",
      "Q. Weitzel",
      "J. Wu",
      "M. Wu",
      "W. Wu",
      "Y. Wu",
      "L. Xia",
      "D. Xu",
      "H. Xu",
      "L. Xu",
      "Z. Yan",
      "H. Yang",
      "H. Yang",
      "X. Yang",
      "X. Yang",
      "J. Ye",
      "I. Youbi",
      "J. Yuan",
      "I. Zahir",
      "H. Zeng",
      "D. Zhang",
      "J. Zhang",
      "L. Zhang",
      "Z. Zhang",
      "M. Zhao",
      "Z. Zhao",
      "X. Zheng",
      "Z. Zhou",
      "Y. Zhu",
      "X. Zhuang"
    ],
    "published": "2025-12-01T16:39:31Z",
    "updated": "2025-12-01T16:39:31Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2302.09758v4",
    "url": "https://arxiv.org/abs/2302.09758v4",
    "pdf_url": "https://arxiv.org/pdf/2302.09758v4.pdf",
    "title": "Energy recovery twin linear $e^+e^-$, $e^-e^-$ colliders (ERLC ) with high luminosities and accelerating gradients",
    "abstract": "Recently, the $e^+e^-$ high-energy superconducting linear collider with energy recovery (ERLC) and multiple use of beams has been proposed, using twin RF structures to avoid parasitic collisions in linacs. Such a collider can operate in either pulsed (with duty factor DF) or CW (continuous) mode, if sufficient power is available, with a luminosity of ${\\cal O}(10^{36})$ cm$^{-2}$s$^{-1}$ at $2E_0=$250-500 GeV. In this paper, we point out that the luminosity of the ERLC operating in the pulsed mode does not depend on the accelerating gradient G (for the same total power), allowing the ERLC to operate with the highest available accelerating gradients. This is also true for the CW mode at a power significantly exceeding the threshold power for this mode. The $e^+e^-$ luminosity depends on the quality factor of cavities as $L\\propto Q_0^{1/2}$. We also consider for the first time a twin $e^-e^-$ collider with energy recovery and estimate its achievable luminosity. Such an $e^-e^-$ collider is simpler than an $e^+e^-$ one. It does not require beam recycling since electrons can be produced anew each time. The $e^-e^-$ luminosity depends on the quality factor as $L\\propto Q_0^{1/4}$. RF travelling-wave structures allow higher gradients and reduced thermal loading. It is shown that an ERLC with an accelerating gradient of $G=40$ MeV/m can be operated in CW mode with $L_{e^+e^-} =$ (1-2.5)\\,$10^{36}$ and $L_{e^-e^-} =$ (3-7)$10^{36}$ cm$^{-2}$s$^{-1}$ for reasonable total powers of 150 and 300 MW at $2E_0=250$ and 500 GeV, respectively. Such a machine is a promising candidate for a Higgs factory.",
    "authors": [
      "V. I. Telnov"
    ],
    "published": "2023-02-20T04:49:53Z",
    "updated": "2025-12-01T16:27:05Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex",
      "hep-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.16000v2",
    "url": "https://arxiv.org/abs/2510.16000v2",
    "pdf_url": "https://arxiv.org/pdf/2510.16000v2.pdf",
    "title": "Frequency domain laser ultrasound microscopy for nanometric layer thickness imaging with GHz elastic plate resonances",
    "abstract": "Nanometric layer thickness imaging is crucial for fundamental research and characterization of micro fabricated devices. Here, we assess the potential of a non-contact opto-acoustic frequency domain laser ultrasound (FreDomLUS) microscopy technique for imaging nanometric thickness variations via GHz zero-group velocity (ZGV) elastic plate resonances. The method exploits the ZGV's lateral energy confinement that leads to sharp resonance peaks which can be effectively probed with the FreDomLUS technique at GHz acoustic frequencies. For demonstration purposes we introduced sub-10 nm height variation patterns in the topmost layer of solidly mounted bulk-acoustic wave resonators with a design frequency of around 1.7 GHz. They are raster-scanned to retrieve ZGV-frequencies from local acoustic spectra as a contrast quantity for imaging. We show how to retrieve quantitative height information by numerically calibrating the factor which inversely relates ZGV frequency change with the layer thickness change. Height variations in stacks with nominal thickness changes of 8 nm, 4 nm, and 1 nm can be resolved and indicate sub-nanometer depth resolution capabilities. The lateral resolution is studied by measuring the method's step edge function and it is found to be in the micrometer range. Atomic force microscopy imaging is used to validate the results.",
    "authors": [
      "Martin Ryzy",
      "Guqi Yan",
      "István Veres",
      "Thomas Berer",
      "Ivan Alić",
      "Clemens Grünsteidl",
      "Georg Watzl",
      "Georg Gramse",
      "Susanne Kreuzer"
    ],
    "published": "2025-10-14T09:32:36Z",
    "updated": "2025-12-01T16:16:34Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mtrl-sci",
      "physics.app-ph",
      "physics.class-ph",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.01780v1",
    "url": "https://arxiv.org/abs/2512.01780v1",
    "pdf_url": "https://arxiv.org/pdf/2512.01780v1.pdf",
    "title": "High-beta equilibrium in mirror machine with population of fast sloshing ions",
    "abstract": "A method of constructing the high-beta (diamagnetic-bubble-like) equilibrium with a population of fast sloshing ions is discussed. Fast ions move along betatron orbits; such ions can arise because of off-axis neutral beam injection. Conservation of the adiabatic invariant of these ions is proposed; a simplified expression for the invariant is presented. Numerical examples of equilibrium with sloshing ions are shown and conservation of the invariant is justified by a direct numerical simulation of motion of fast ions even in the case with beta equal to 1.",
    "authors": [
      "Ivan Chernoshtanov"
    ],
    "published": "2025-12-01T15:20:21Z",
    "updated": "2025-12-01T15:20:21Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.01777v1",
    "url": "https://arxiv.org/abs/2512.01777v1",
    "pdf_url": "https://arxiv.org/pdf/2512.01777v1.pdf",
    "title": "Macroscopic Quantum Resonators Path Finder (MAQRO-PF) White Paper",
    "abstract": "Optically levitated particles are used in a wide range of experiments to explore both fundamental physics and to act as sensors to a variety of external forces. One field of particular interest that these particles can be used to investigate is quantum mechanics. Previous research has yet to set an absolute upper bound on the size of objects that can be prepared in a quantum superposition. Exploring this limit involves allowing ever-larger objects to freely and coherently evolve to assess if their behaviour matches quantum or classical theoretical predictions. However, the long free evolution times required for these behaviours to be visible result in the experiments being gravitationally limited. Space based platforms therefore become the next key step in these investigations. In this white paper, we shall discuss our proposal for an optical levitation experiment in space that will explore the fundamental upper size limits of quantum mechanics. We shall cover the scientific motivation behind these investigations, then summarize the current status of our designs for the satellite. We will then review the aspects of the payload that require further development, then summarize the current estimates of the payload's requirements.",
    "authors": [
      "Jack Homans",
      "Laura da Palma Barbara",
      "Jakub Wardak",
      "Elliot Simcox",
      "Tim M. Fuchs",
      "Hendrik Ulbricht"
    ],
    "published": "2025-12-01T15:17:39Z",
    "updated": "2025-12-01T15:17:39Z",
    "categories": [
      "quant-ph",
      "gr-qc",
      "physics.ins-det",
      "physics.space-ph"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2512.01762v1",
    "url": "https://arxiv.org/abs/2512.01762v1",
    "pdf_url": "https://arxiv.org/pdf/2512.01762v1.pdf",
    "title": "Characterization of cutting-edge CMOS Active Pixel sensors within the CYGNO Experiment",
    "abstract": "Time Projection Chambers equipped with Gas Electron Multipliers and optical readout by scientific CMOS cameras are a promising technology for low-energy particle detection, as demonstrated by the CYGNO experiment. To help identify the optimal CYGNO detector configuration, we performed a detailed characterization of two state-of-the-art scientific CMOS sensors, focusing on dark-signal behavior across different exposure times and on detection sensitivity, assessed using the well-defined X-ray emissions from a 55Fe source, which reproduce the low-light conditions expected in CYGNO.   CYGNO currently employs a very low-noise Hamamatsu sensor, the ORCA-Fusion, for testing and validation of its detection system. Hamamatsu has recently introduced two new sensors that may be of interest for future upgrades. The first is an improved version of the current model, the ORCA-Fusion-BT, featuring a back-illuminated design that reaches a quantum efficiency of up to 95% at 550 nm. The second is a next-generation sensor, the ORCA-Quest. Although its peak quantum efficiency is not as high as that of the Fusion-BT, it offers high sensitivity over a broader spectral range, extending into the ultraviolet region, and provides ultra-low readout noise of 0.27 electrons, about 2.6 times lower than that of the Fusion family.   These two sensors therefore represent a significant opportunity to enhance the performance of scientific experiments, including those conducted by the CYGNO collaboration. This document presents a comprehensive characterization of these sensors to evaluate their relevance for experiments operating in photon-limited environments and their suitability for integration into the CYGNO detector system.",
    "authors": [
      "B. D. Almeida",
      "F. D. Amaro",
      "R. Antonietti",
      "E. Baracchini",
      "L. Benussi",
      "S. Bianco",
      "C. Capoccia",
      "M. Caponero",
      "L. G. M. de Carvalho",
      "G. Cavoto",
      "I. A. Costa",
      "A. Croce",
      "M. D'Astolfo",
      "G. D'Imperio",
      "E. Dane",
      "G. Dho",
      "E. Di Marco",
      "J. M. F. Dos Santos",
      "D. Fiorina",
      "F. Iacoangeli",
      "Z. Islam",
      "E. Kemp",
      "H. P. Lima",
      "G. Maccarrone",
      "R. D. P. Mano",
      "D. J. G. Marques",
      "G. Mazzitelli",
      "P. Meloni",
      "A. Messina",
      "C. M. B. Monteiro",
      "R. A. Nobrega",
      "I. F. Pains",
      "E. Paoletti",
      "F. Petrucci",
      "S. Piacentini",
      "D. Pierluigi",
      "D. Pinci",
      "F. Renga",
      "R. J. C. Roque",
      "A. Russo",
      "G. Saviano",
      "P. A. O. C. Silva",
      "N. J. Spooner",
      "R. Tesauro",
      "S. Tomassini",
      "D. Tozzi"
    ],
    "published": "2025-12-01T15:06:24Z",
    "updated": "2025-12-01T15:06:24Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.01757v1",
    "url": "https://arxiv.org/abs/2512.01757v1",
    "pdf_url": "https://arxiv.org/pdf/2512.01757v1.pdf",
    "title": "Evolution of ion distribution functions in ionospheric plasmas perturbed by Alfvén waves",
    "abstract": "This study investigates ion kinetic effects during the parametric decay instability (PDI) of parallel-propagating Alfvén waves under plasma conditions characteristic of the Earth's ionosphere. By using a series of hybrid particle-in-cell simulations, we examine the evolution of ion velocity distribution functions (VDFs) in ultra-low-beta plasmas. Our numerical campaign systematically explores the dependence on key parameters (plasma beta, pump-wave amplitude and polarization, and ion composition). To emphasize the role of kinetic effects, we choose to trigger the PDI with a dispersive mother wave with wavelength comparable to the ion characteristic inertial length. Our results reveal pronounced nonthermal VDF modifications, including parallel heating and the formation of secondary ion beams, linked to the nonlinear evolution of parametric decay instability. By varying the plasma beta and the pump-wave amplitude, we identify a critical regime where rapid and complete broadening of the velocity distribution function is observed, triggering bidirectional ion acceleration. Notably, simulations modeling realistic ionospheric conditions demonstrate that even low-amplitude Alfvénic perturbations can induce significant VDF spreading and ion beam generation, with hydrogen ions exhibiting stronger effects than oxygen. These nonthermal microscopic processes offer a plausible mechanism for particle precipitation in space weather events. This work represents the first comprehensive study with hybrid simulations of PDI-driven ion kinetics in ultra-low-beta plasmas, providing quantitative estimates for the time delay between electromagnetic wave impact and ion VDF modification and new insights into wave-particle interactions that may contribute to ion acceleration, precipitation processes and space plasma dynamics.",
    "authors": [
      "Dario Recchiuti",
      "Luca Franci",
      "Lorenzo Matteini",
      "Emanuele Papini",
      "Roberto Battiston",
      "Mirko Piersanti"
    ],
    "published": "2025-12-01T15:03:06Z",
    "updated": "2025-12-01T15:03:06Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.01752v1",
    "url": "https://arxiv.org/abs/2512.01752v1",
    "pdf_url": "https://arxiv.org/pdf/2512.01752v1.pdf",
    "title": "The effect of Coulomb interactions on relic neutrino detection via beta decaying impurities in (semi)metals",
    "abstract": "Measuring the electron neutrino mass is a long-standing objective and requires a high energy resolution of certain $β$-decay experiments, as well as a visible cosmic neutrino background ($CνB$) spectrum. Many quantum mechanical and chemical effects could potentially impair the required resolution/visibility, e.g., the Coulomb interactions between the electrons in the \\b{eta}-decaying impurity and in the solid-state environment. We analyze the effect when hybridization is suppressed completely using a dielectric spacer, and also when hybridization is present up to the lowest nontrivial order in perturbation theory.",
    "authors": [
      "Karel van der Marck",
      "Vadim Cheianov"
    ],
    "published": "2025-12-01T14:56:49Z",
    "updated": "2025-12-01T14:56:49Z",
    "categories": [
      "hep-ph",
      "cond-mat.mes-hall",
      "cond-mat.other",
      "cond-mat.str-el",
      "physics.ins-det"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2512.01737v1",
    "url": "https://arxiv.org/abs/2512.01737v1",
    "pdf_url": "https://arxiv.org/pdf/2512.01737v1.pdf",
    "title": "Injection and Acceleration of Electrons by Radially Polarized Laser Pulses in a Plasma Channel",
    "abstract": "We consider injection and subsequent acceleration of electrons in narrow plasma channels irradiated by linearly and radially polarized ultraintense laser pulses. Using three-dimensional particle-in-cell simulations, we show that radially polarized beams significantly promote electron release from the channel walls and lead to enhanced injection. We compare an f/10 linearly polarized laser beam with two radially polarized cases: one focused more tightly (f/5) to match peak intensity, and one at equal f/10 to capture polarization effects. The radially polarized f/10 case injects approximately one-third more charge than the linearly polarized case, while the f/5 radially polarized case outperforms the linearly polarized one by about a factor of two in terms of maximum electron energy. These results highlight polarization and focusing geometry as key parameters for optimizing laser-driven electron acceleration setups.",
    "authors": [
      "P. Hadjisolomou",
      "P. Valenta",
      "R. Shaisultanov",
      "T. M. Jeong",
      "D. Gorlova",
      "C. P. Ridgers",
      "S. V. Bulanov"
    ],
    "published": "2025-12-01T14:43:40Z",
    "updated": "2025-12-01T14:43:40Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.01718v1",
    "url": "https://arxiv.org/abs/2512.01718v1",
    "pdf_url": "https://arxiv.org/pdf/2512.01718v1.pdf",
    "title": "Light drag in nonuniformly moving anisotropic media through the lens of gradient-index optics",
    "abstract": "The trajectory of light rays propagating through a nonuniformly moving anisotropic medium is determined by considering the Fresnel drag experienced by the wave at each point along the ray. By showing that symmetries in the velocity field manifest as symmetries in the effective wave index representing the moving medium, methods classically employed to model gradient index media are then used to obtain analytical forms for the ray trajectory. When applied to isotropic media, the results are verified to be consistent with those obtained using an optical (Gordon) metric. The potential of this method to model light rays in anisotropic media is finally demonstrated by considering waves in a nonuniformly moving magnetized plasma, exposing how nonuniform motion and anisotropy can compete with one another.",
    "authors": [
      "Julien Langlois",
      "Renaud Gueroult"
    ],
    "published": "2025-12-01T14:27:27Z",
    "updated": "2025-12-01T14:27:27Z",
    "categories": [
      "physics.plasm-ph",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.01656v1",
    "url": "https://arxiv.org/abs/2512.01656v1",
    "pdf_url": "https://arxiv.org/pdf/2512.01656v1.pdf",
    "title": "Impact of local bunching factors in single-pass THz free electron lasers",
    "abstract": "In simulations for modern free-electron laser (FEL), shot noise plays a crucial role. While it is inversely proportional to the number of electrons, shot noise is typically modeled using macroparticles, whose bunching factors correspond to those of the much larger number of electrons. For short-wavelength FELs, the macroparticles are assumed to be uniform over the scale of the resonant wavelength, since shot noise dominates the initial radiation - for instance, in the self-amplified spontaneous emission (SASE) regime. In this paper, we show that this assumption does not hold at longer wavelengths, particularly in the THz range, where the bunch current profile is not uniform over the scale of the resonant wavelength. Instead, the current profile dominates the initial bunching factors, which can be several orders of magnitude higher than shot noise. The slice-based bunching factors and bunching phases are derived for Gaussian distributions and compared with shot noise under the assumption that the current within each slice remains constant. Using the THz FEL at the photoinjector test facility at DESY in Zeuthen (PITZ) as a case study, the influence of the current profile has been benchmarked through simulations under very low bunch charge, where the real number of electrons can be modeled using the Genesis1.3 code. Additional simulations with the nominal working parameters of PITZ THz FEL have been compared with experimental data, indicating better agreement when the actual current profile is taken into account.",
    "authors": [
      "Xiangkun Li",
      "Mikhail Krasilnikov"
    ],
    "published": "2025-12-01T13:29:53Z",
    "updated": "2025-12-01T13:29:53Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.01619v1",
    "url": "https://arxiv.org/abs/2512.01619v1",
    "pdf_url": "https://arxiv.org/pdf/2512.01619v1.pdf",
    "title": "An Open-Path Eddy-Covariance Laser Spectrometer for Simultaneous Monitoring of CO$_2$, CH$_4$, and H$_2$O",
    "abstract": "We present E-CAHORS $-$ a compact mid-infrared open-path diode-laser spectrometer designed for the simultaneous measurement of carbon dioxide, methane, and water vapor concentrations in the near-surface atmospheric layer. These measurements, combined with simultaneous data from a three-dimensional anemometer, can be used to determine fluxes using the eddy-covariance method. The instrument utilizes two interband cascade lasers operating at 2.78 $μ$m and 3.24 $μ$m within a novel four-pass M-shaped optical cell, which provides high signal power and long-term field operation without requiring active air sampling. Two detection techniques $-$ tunable diode laser absorption spectroscopy (TDLAS) and a simplified wavelength modulation spectroscopy (sWMS) $-$ were implemented and evaluated. Laboratory calibration demonstrated linear responses for all gases (R$^2$ $\\approx$ 0.999) and detection precisions at 10 Hz of 311 ppb for CO$_2$, 8.87 ppb for CH$_4$, and 788 ppb for H$_2$O. Field tests conducted at a grassland site near Moscow showed strong correlations (R = 0.91 for CO$_2$ and H$_2$O, R = 0.67 for CH$_4$) with commercial LI-COR LI-7200 and LI-7700 analyzers. The TDLAS mode demonstrated lower noise and greater stability under outdoor conditions, while sWMS provided baseline-free spectra but was more sensitive to power fluctuations. E-CAHORS combines high precision, multi-species sensing capability with low power consumption (10 W) and a compact design (4.2 kg).",
    "authors": [
      "Viacheslav Meshcherinov",
      "Iskander Gazizov",
      "Bogdan Pravuk",
      "Viktor Kazakov",
      "Sergei Zenevich",
      "Maxim Spiridonov",
      "Shamil Gazizov",
      "Gennady Suvorov",
      "Olga Kuricheva",
      "Yuri Lebedev",
      "Imant Vinogradov",
      "Alexander Rodin"
    ],
    "published": "2025-12-01T12:40:36Z",
    "updated": "2025-12-01T12:40:36Z",
    "categories": [
      "physics.ins-det",
      "physics.app-ph"
    ],
    "primary_category": "physics.ins-det"
  }
]