{
  "arxiv_id": "2411.02321v3",
  "url": "https://arxiv.org/abs/2411.02321v3",
  "pdf_url": "https://arxiv.org/pdf/2411.02321v3.pdf",
  "title": "Measurement of directional muon beams generated at the Berkeley Lab   Laser Accelerator",
  "abstract": "We present the detection of directional muon beams produced using a PW laser at the Lawrence Berkeley National Laboratory. The muon source is a multi-GeV electron beam generated in a 30 cm laser plasma accelerator interacting with a high-Z converter target. The GeV photons resulting from the interaction are converted into a high-flux, directional muon beam via pair production. By employing scintillators to capture delayed events, we were able to identify the produced muons and characterize the source. Using theoretical knowledge of the muon production process combined with simulations that are in excellent agreement with the experiments, we demonstrate that the multi-GeV electron beams produce GeV-scale muons in numbers far exceeding those from cosmic background. Laser-plasma-accelerator-based muon sources can therefore enhance muon imaging applications thanks to their compactness, directionality, and high yields, which reduce the exposure time by orders of magnitude compared to cosmic ray muons. Using the Geant4-based simulation code we developed to gain insight into the experimental results, we can design future experiments and applications based on LPA-generated muons.",
  "authors": [
    "Davide Terzani",
    "Stanimir Kisyov",
    "Stephen Greenberg",
    "Luc Le Pottier",
    "Maria Mironova",
    "Alex Picksley",
    "Joshua Stackhouse",
    "Hai-En Tsai",
    "Raymond Li",
    "Ela Rockafellow",
    "Bo Miao",
    "Jaron Shrock",
    "Timon Heim",
    "Maurice Garcia-Sciveres",
    "Carlo Benedetti",
    "John Valentine",
    "Howard Milchberg",
    "Kei Nakamura",
    "Anthony J. Gonsalves",
    "Jeroen van Tilborg",
    "Carl B. Schroeder",
    "Eric Esarey",
    "Cameron G. R. Geddes"
  ],
  "published": "2024-11-04T17:46:53Z",
  "updated": "2025-08-18T16:40:48Z",
  "categories": [
    "physics.acc-ph",
    "physics.app-ph",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.acc-ph"
}