{
  "arxiv_id": "2509.07104v1",
  "url": "https://arxiv.org/abs/2509.07104v1",
  "pdf_url": "https://arxiv.org/pdf/2509.07104v1.pdf",
  "title": "Cosmic Rays on Galaxy Scales: Progress and Pitfalls for CR-MHD Dynamical   Models",
  "abstract": "Recent years have seen many arguments for cosmic rays (CRs) as an important influence on galactic and circumgalactic (CGM) physics, star and galaxy formation. We present a pedagogical overview of state-of-the-art modeling of CR-magnetohydrodynamics (CR-MHD) on macro scales (~kpc), highlighting their fundamental dependence on the micro (< au) scales of CR gyro orbits and meso (~pc) scales of CR mean-free-paths, intended to connect the extragalactic, Galactic, and plasma CR transport modeling communities. We note the pitfalls and systematic errors that arise from older assumptions in CR modeling, including: use of a simple Fokker-Planck equation or ad-hoc two-moment formalisms for transport; assumption of leaky boxes or plane-parallel or shear-periodic boundaries for comparison to local interstellar medium (LISM) observations; ignoring detailed LISM constraints on CR spectra (e.g. focusing only on extragalactic observables or spectrally integrated models); assuming CR transport is mediated by classical models of advection, streaming from self-confinement (super-Alfvenic or Alfvenic), or extrinsic turbulence. We emphasize recent progress addressing these: development of rigorously-derived CR-MHD equations; use of global, 3D galaxy+halo models for LISM comparisons; new methods for full-spectrum dynamics; novel models for intermittent scattering and/or new drivers. We compile extragalactic+LISM observations to show how ~GeV CR transport is being rapidly constrained in the CGM, and present phenomenological models which can be used in future simulations. We conclude by highlighting critical open questions for micro, meso, and macro-scale CR-MHD simulations.",
  "authors": [
    "Philip F. Hopkins"
  ],
  "published": "2025-09-08T18:00:40Z",
  "updated": "2025-09-08T18:00:40Z",
  "categories": [
    "astro-ph.GA",
    "astro-ph.CO",
    "astro-ph.HE",
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.GA"
}