{
  "arxiv_id": "2508.16248v1",
  "url": "https://arxiv.org/abs/2508.16248v1",
  "pdf_url": "https://arxiv.org/pdf/2508.16248v1.pdf",
  "title": "A rigorous study on the longitudinal beam coupling impedance of a   cylindrical lossy pipe in normal and anomalous regimes",
  "abstract": "One of the primary issues in designing particle accelerators is the effect of energy losses and collective instabilities caused by the conductivity of the vacuum chamber. Due to its relevance, many authors have long focused on studying the coupling impedance of lossy pipes with various geometries and metals. Most studies were developed for relativistic beams and room-temperature conductivity. In recent years, there has been increasing interest in the high-frequency impedance behavior of ultra-short bunches, as in the case of FELs, and in the anomalous conductivity at cryogenic temperatures of the vacuum chambers. This work introduces a new unifying theoretical framework for analyzing electromagnetic interactions in cylindrical pipes excited by charged particles traveling on the axis. In this context, a key achievement is the derivation of a rigorous expression for the electric conductivity, based on the Boltzmann theory of a Fermi gas, which forms the foundation for subsequent developments. New formulas for the surface impedance of cylindrical pipes are presented, from which a more general impedance expression is derived. Our approach captures the system's behavior across various energy and frequency regimes. Eventually, the anomalous regime is studied rigorously, providing analytical solutions for the electromagnetic field at cryogenic temperatures. Indeed, new and exact expressions for the anomalous surface impedance for carriers' reflection coefficients p = 0 and p = 1 are obtained, offering deeper insight into the electromagnetic properties of such systems under extreme conditions.",
  "authors": [
    "A. Curcio",
    "M. Migliorati",
    "A. Mostacci",
    "L. Palumbo"
  ],
  "published": "2025-08-22T09:29:51Z",
  "updated": "2025-08-22T09:29:51Z",
  "categories": [
    "physics.acc-ph"
  ],
  "primary_category": "physics.acc-ph"
}