{
  "arxiv_id": "2508.15963v1",
  "url": "https://arxiv.org/abs/2508.15963v1",
  "pdf_url": "https://arxiv.org/pdf/2508.15963v1.pdf",
  "title": "Advancing rail safety: An onboard measurement system of rolling stock   wheel flange wear based on dynamic machine learning algorithms",
  "abstract": "Rail and wheel interaction functionality is pivotal to the railway system safety, requiring accurate measurement systems for optimal safety monitoring operation. This paper introduces an innovative onboard measurement system for monitoring wheel flange wear depth, utilizing displacement and temperature sensors. Laboratory experiments are conducted to emulate wheel flange wear depth and surrounding temperature fluctuations in different periods of time. Employing collected data, the training of machine learning algorithms that are based on regression models, is dynamically automated. Further experimentation results, using standards procedures, validate the system's efficacy. To enhance accuracy, an infinite impulse response filter (IIR) that mitigates vehicle dynamics and sensor noise is designed. Filter parameters were computed based on specifications derived from a Fast Fourier Transform analysis of locomotive simulations and emulation experiments data. The results show that the dynamic machine learning algorithm effectively counter sensor nonlinear response to temperature effects, achieving an accuracy of 96.5 %, with a minimal runtime. The real-time noise reduction via IIR filter enhances the accuracy up to 98.2 %. Integrated with railway communication embedded systems such as Internet of Things devices, this advanced monitoring system offers unparalleled real-time insights into wheel flange wear and track irregular conditions that cause it, ensuring heightened safety and efficiency in railway systems operations.",
  "authors": [
    "Celestin Nkundineza",
    "James Ndodana Njaji",
    "Samrawit Abubeker",
    "Omar Gatera",
    "Damien Hanyurwimfura"
  ],
  "published": "2025-08-21T21:12:48Z",
  "updated": "2025-08-21T21:12:48Z",
  "categories": [
    "cs.LG",
    "cs.CE",
    "cs.SY",
    "eess.SP",
    "eess.SY",
    "physics.ins-det"
  ],
  "primary_category": "cs.LG",
  "doi": "10.1177/03611981251330887"
}