{
  "arxiv_id": "2504.00582v2",
  "url": "https://arxiv.org/abs/2504.00582v2",
  "pdf_url": "https://arxiv.org/pdf/2504.00582v2.pdf",
  "title": "Towards Non-Invasive Sediment Monitoring Using Muography: A Pilot Run at   the Shanghai Outer Ring Tunnel",
  "abstract": "This study demonstrates the application of cosmic-ray muography as a non-invasive method for monitoring sediment accumulation and tidal influences in the Shanghai Outer Ring Tunnel, an immersed tube tunnel located beneath the Huangpu River in Shanghai, China. A portable, dual-layer plastic scintillator detector was deployed to conduct muon flux scans along the tunnel's length and to continuously monitor muon flux, allowing for the study of tidal effects. Geant4 simulations validated the correlation between muon attenuation and overburden thickness, incorporating sediment, water, and concrete layers. Key findings include a strong anti-correlation between the measured muon flux and the water levels observed at a nearby tide gauge. The results align with geotechnical data and simulations, especially in the region of interest, confirming muography's sensitivity to sediment dynamics. This work establishes muography as a robust tool for long-term, real-time monitoring of submerged infrastructure, offering significant advantages over conventional invasive techniques. The study underscores the potential for integrating muography into civil engineering practices to enhance safety and operational resilience in tidal environments.",
  "authors": [
    "Kim Siang Khaw",
    "Siew Yan Hoh",
    "Tianqi Hu",
    "Xingyun Huang",
    "Jun Kai Ng",
    "Yusuke Takeuchi",
    "Min Yang Tan",
    "Jiangtao Wang",
    "Yinghe Wang",
    "Guan Ming Wong",
    "Mengjie Wu",
    "Ning Yan",
    "Yonghao Zeng",
    "Min Chen",
    "Shunxi Gao",
    "Lei Li",
    "Yujin Shi",
    "Jie Tan",
    "Qinghua Wang",
    "Siping Zeng",
    "Shibin Yao",
    "Yufu Zhang",
    "Gongliang Chen",
    "Houwang Wang",
    "Jinxin Lin",
    "Qing Zhan"
  ],
  "published": "2025-04-01T09:35:54Z",
  "updated": "2025-08-19T03:13:54Z",
  "categories": [
    "physics.app-ph",
    "physics.ins-det"
  ],
  "primary_category": "physics.app-ph"
}