{
  "arxiv_id": "2507.11317v2",
  "url": "https://arxiv.org/abs/2507.11317v2",
  "pdf_url": "https://arxiv.org/pdf/2507.11317v2.pdf",
  "title": "Species-Dependent Electron Emission from Nanoparticles under Gamma   Irradiation",
  "abstract": "In this study, various nanoparticle species-including Au and Gd$_2$O$_3$-were irradiated with low-energy gamma rays, such as 59.5 keV photons from $^{241}$Am. Pulse-height spectra were recorded using a liquid-scintillation counting system before and after dispersing the nanoparticles into the scintillator, and the differences between them were analyzed to infer the interaction outcomes. Gd$_2$O$_3$ nanoparticles emitted numerous electrons; however, under identical experimental conditions, no detectable electron emission was observed from Au nanoparticles (AuNPs). Here, \"detectable electron emission\" refers to electrons with energies high enough to be registered by the liquid-scintillation detector used (approx 100 eV and, more typically, >= 1-2 keV); however, it excludes electrons that may be emitted at lower energies. Thus, a species-dependent radiation-nanoparticle interaction was observed. Rigorous controls and falsification tests excluded various artefacts-including detector insensitivity, surface contamination, aggregation, quenching, and self-absorption-as causes for the absence of detectable electron emission from AuNPs. This observation potentially prompts a re-evaluation of the common assumption that nanoparticles behave like their bulk counterparts and emit electrons upon gamma-irradiation. Instead, our results suggest that the distinct internal environment of nanoparticles influences their interaction with radiation. These findings offer significant insights for practical applications, including a better mechanistic understanding of nanoparticle radiosensitization in cancer therapy, enhanced gamma-detection efficiency of organic scintillators, and the development of lightweight radiation shields.",
  "authors": [
    "Darukesha B H M"
  ],
  "published": "2025-07-15T13:49:03Z",
  "updated": "2025-08-20T08:32:11Z",
  "categories": [
    "physics.med-ph",
    "physics.ins-det"
  ],
  "primary_category": "physics.med-ph"
}