{
  "arxiv_id": "2508.14622v1",
  "url": "https://arxiv.org/abs/2508.14622v1",
  "pdf_url": "https://arxiv.org/pdf/2508.14622v1.pdf",
  "title": "Excitation of toroidal Alfvén eigenmode by energetic particles in DTT   and effect of negative triangularity",
  "abstract": "A linear gyrokinetic eigenvalue code is developed to study the stability of toroidal Alfv\\'en eigenmode (TAE) in general axisymmetric toroidal geometry, with the self-consistent treatment of energetic particle drive and core plasma Landau damping in a non-perturbative way. The general particle responses of both circulating and trapped particles are incorporated in the calculation by means of the action-angle approach, and, particularly, the finite Larmor radius and orbit width effects of energetic particles are fully taken into account. The ballooning-mode representation is adopted to solve the eigenmode equations in order to reduce the computational resource while obtaining a high resolution of the fine radial structure. Furthermore, the code is able to study the physics of wave-particle interaction in great detail, thanks to the development of systematic theory-based numerical diagnostics, including effective mode structure and phase space resonance structure. As an application of the code, we perform an in-depth study of the triangularity effect on TAE stability based on the reference equilibrium of the Divertor Tokamak Test facility. It is demonstrated that TAE growth rate can be affected by the triangularity through the modifications of geometric couplings, resonance condition, as well as mode frequency and mode structure. As a result, negative triangularity can either stabilize or destabilize the energetic particle driven TAE depending on the dominant mechanism. The relative importance of these mechanisms under different circumstances is systematically analyzed, providing clear physical insights. The overall effect of negative triangularity for a specific tokamak scenario can be assessed based on these studies.",
  "authors": [
    "Guangyu Wei",
    "Fulvio Zonca",
    "Matteo Valerio Falessi",
    "Zhiyong Qiu"
  ],
  "published": "2025-08-20T11:20:13Z",
  "updated": "2025-08-20T11:20:13Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}