{
  "arxiv_id": "2508.12592v1",
  "url": "https://arxiv.org/abs/2508.12592v1",
  "pdf_url": "https://arxiv.org/pdf/2508.12592v1.pdf",
  "title": "From plasma to pattern: observation and characterization of periodic   structure formation in dielectric breakdown channels of electron-irradiated   insulators",
  "abstract": "Dielectric breakdown of insulators is one of the most common failure modes of electronics in the high-radiation environment of space, but its mechanics remain poorly understood. When electron-irradiated polymethyl methacrylate (PMMA) undergoes breakdown, the resulting channels exhibit striking periodic structures with characteristic wavelengths ~80 {\\mu}m in the recently identified ivy-mode channels. These previously unobserved modulations offer unique insights into the physics of ultra-fast dielectric breakdown. Through materials characterization and theoretical modeling, we identify the physical instability mechanism responsible for these structures. Raman spectroscopy reveals that carbon deposition correlates with channel width variations, indicating that periodic structure formation occurs during the plasma discharge phase. We evaluated three candidate instability mechanisms: the Asaro-Tiller-Grinfeld instability, the Plateau-Rayleigh instability, and the z-pinch entropy mode. The first two mechanisms operate on incompatible timescales and require unphysical material parameters to match observations. In contrast, the z-pinch entropy mode operates during the nanosecond discharge phase and produces wavelengths consistent with plasma densities of 0.1-1% of solid density and temperatures of 10-100 eV. Current measurements from isolated discharge channels (~200 A) validate theoretical predictions for the entropy mode. These findings establish that the entropy mode plasma instability during the discharge phase, rather than post discharge thermal or mechanical processes, govern periodic structure formation in breakdown channels. This work provides new insights into the physics of dielectric breakdown and establishes a framework for predicting discharge morphology and characteristics in insulators.",
  "authors": [
    "Nick R. Schwartz",
    "Bryson C. Clifford",
    "Carolyn Chun",
    "Emily H. Frashure",
    "Kathryn M. Sturge",
    "Noah Hoppis",
    "Holly Wilson",
    "Meryl Wiratmo",
    "Jack R. FitzGibbon",
    "Ethan T. Basinger",
    "Brian L. Beaudoin",
    "Raymond J. Phaneuf",
    "John Cumings",
    "Timothy W. Koeth"
  ],
  "published": "2025-08-18T02:57:43Z",
  "updated": "2025-08-18T02:57:43Z",
  "categories": [
    "physics.app-ph",
    "cond-mat.mtrl-sci",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.app-ph"
}