{
  "arxiv_id": "2511.18693v1",
  "url": "https://arxiv.org/abs/2511.18693v1",
  "pdf_url": "https://arxiv.org/pdf/2511.18693v1.pdf",
  "title": "Development of a dual-phase xenon time projection chamber prototype for the RELICS experiment",
  "abstract": "The RELICS (REactor neutrino LIquid xenon Coherent elastic Scattering) experiment aims to detect coherent elastic neutrino-nucleus scattering from reactor antineutrinos using a dual-phase xenon time projection chamber. To validate the detector concept and ensure technical reliability for the full-scale experiment, a dedicated prototype was designed, constructed, and operated. This work presents an overview of the design, construction, and operational performance of the prototype, with emphasis on its major subsystems, including the TPC, cryogenic and xenon purification systems, slow control, and data acquisition. During operation, the detector demonstrated the capability to achieve a sub-keV energy threshold required for the RELICS physics program, as reflected by a measured single electron gain of 34.30~$\\pm$~0.01~(stat.)~PE/e$^-$ and the successful detection of 0.27~keV L-shell decay events from $^{37}$Ar. In addition, essential data analysis techniques and simulation frameworks were developed and validated, establishing the methodological foundation for future RELICS operations. The successful construction and operation of this prototype confirm the feasibility of the core technologies and provide a crucial experimental basis for the final RELICS detector.",
  "authors": [
    "Lingfeng Xie",
    "Jiajun Liu",
    "Yifei Zhao",
    "Chang Cai",
    "Guocai Chen",
    "Jiangyu Chen",
    "Huayu Dai",
    "Rundong Fang",
    "Hongrui Gao",
    "Fei Gao",
    "Jingfan Gu",
    "Xiaoran Guo",
    "Jiheng Guo",
    "Chengjie Jia",
    "Gaojun Jin",
    "Fali Ju",
    "Yanzhou Hao",
    "Xu Han",
    "Yang Lei",
    "Kaihang Li",
    "Meng Li",
    "Minhua Li",
    "Ruize Li",
    "Shengchao Li",
    "Siyin Li",
    "Tao Li",
    "Qing Lin",
    "Sheng Lv",
    "Guang Luo",
    "Yuanyuan Ren",
    "Chuanping Shen",
    "Mingzhuo Song",
    "Lijun Tong",
    "Yuhuang Wan",
    "Xiaoyu Wang",
    "Wei Wang",
    "Xiaoping Wang",
    "Zihu Wang",
    "Yuehuan Wei",
    "Liming Weng",
    "Xiang Xiao",
    "Yikai Xu",
    "Jijun Yang",
    "Litao Yang",
    "Long Yang",
    "Jingqiang Ye",
    "Jiachen Yu",
    "Qian Yue",
    "Yuyong Yue",
    "Tianyuan Zha",
    "Bingwei Zhang",
    "Yuming Zhang",
    "Chenhui Zhu"
  ],
  "published": "2025-11-24T02:28:01Z",
  "updated": "2025-11-24T02:28:01Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}