{
  "arxiv_id": "2506.04992v2",
  "url": "https://arxiv.org/abs/2506.04992v2",
  "pdf_url": "https://arxiv.org/pdf/2506.04992v2.pdf",
  "title": "Prospects for the production and detection of Breit-Wheeler tunneling positrons in Experiment 320 at the FACET-II accelerator",
  "abstract": "The SLAC Experiment 320 collides 10 TW-class laser pulses with the high-quality, 10 GeV electron beam from the FACET-II RF LINAC. This setup is expected to produce a sizable number of $e^+e^-$ pairs via nonlinear Breit-Wheeler mechanism in the strong-field tunneling regime, with an estimated yield of ~0.01-0.1 pairs per collision. This small signal rate typically comes along with large backgrounds originating, e.g., from dumping the high-charge primary beam, secondaries induced by the beam halo, as well as photons and low-energy electrons produced in the electron-laser collision itself. These backgrounds may reach densities of O(100) charged particles per cm^2 (and even more neutral particles) at the surface of the sensing elements, making it a tremendous challenge for an unambiguous detection of single particles. In this work, we demonstrate how detectors and methods adapted from high-energy physics experiments, can enable this measurement. The solution presented is based on a highly granular, multi-layer, radiation-hard pixel detector paired with powerful particle-tracking algorithms. Using a detailed simulation of the existing experimental setup, we show how the false-positive rate due to background processes can be reduced by more than an order of magnitude relative to the expected signal after full reconstruction. Furthermore, we show that the high spatial tracking resolution achievable (<10 microns) allows for positron momentum measurements with a resolution of <2%, enabling spectral characterization of the nonlinear Breit-Wheeler process. Based on our extensive simulation, with a conservatively large background assumption, we show that it is possible to measure single Breit-Wheeler positrons in the coming data taking campaign of E320. That would be the first statistically significant observation and characterization of this elusive process in the (deep) tunneling regime.",
  "authors": [
    "Oleksandr Borysov",
    "Alon Levi",
    "Sebastian Meuren",
    "Nathaly Nofech-Mozes",
    "Ivan Rajkovic",
    "David A. Reis",
    "Arka Santra",
    "Doug W. Storey",
    "Noam Tal Hod",
    "Roman Urmanov"
  ],
  "published": "2025-06-05T13:02:37Z",
  "updated": "2025-11-16T15:17:05Z",
  "categories": [
    "hep-ex",
    "physics.acc-ph"
  ],
  "primary_category": "hep-ex"
}