{
  "arxiv_id": "2509.04566v2",
  "url": "https://arxiv.org/abs/2509.04566v2",
  "pdf_url": "https://arxiv.org/pdf/2509.04566v2.pdf",
  "title": "Measuring the properties of homogeneous turbulence in curved spacetimes",
  "abstract": "Turbulence in curved spacetimes in general, and in the vicinity of black holes (BHs) in particular, represents a poorly understood phenomenon that is often analysed employing techniques developed for flat spacetimes. We here propose a novel approach to study turbulence in strong gravitational fields that is based on the computation of structure functions on generic manifolds and is thus applicable to arbitrary curved spacetimes. In particular, we introduce, for the first time, a formalism to compute the characteristic properties of turbulence, such as the second-order structure function or the power spectral density, in terms of proper lengths and volumes and not in terms of coordinate lengths and volumes, as customarily done. By applying the new approach to the turbulent rest-mass density field from simulations of magnetised disc accretion onto a Kerr BH, we inspect in a rigorous way turbulence in regions close to the event horizon, but also in the disc, the wind, and in the jet. We demonstrate that the new approach can capture the typical behavior of an inertial-range cascade and that differences up to $40-80\\%$ emerge in the vicinity of the event horizon with respect to the standard flat-spacetime approach. While these differences become smaller at larger distances, our study highlights that special care needs to be paid when analysing turbulence in strongly curved spacetimes.",
  "authors": [
    "Rita Megale",
    "Alejandro Cruz-Osorio",
    "Giuseppe Ficarra",
    "Mario Imbrogno",
    "Claudio Meringolo",
    "Leonardo Primavera",
    "Luciano Rezzolla",
    "Sergio Servidio"
  ],
  "published": "2025-09-04T18:00:02Z",
  "updated": "2025-11-18T09:33:13Z",
  "categories": [
    "gr-qc",
    "astro-ph.HE",
    "physics.plasm-ph"
  ],
  "primary_category": "gr-qc",
  "doi": "10.1093/mnras/staf1873"
}