{
  "arxiv_id": "2511.13634v1",
  "url": "https://arxiv.org/abs/2511.13634v1",
  "pdf_url": "https://arxiv.org/pdf/2511.13634v1.pdf",
  "title": "Exploring the production of Terbium-161 in the Brazilian Multipurpose Reactor",
  "abstract": "The Brazilian Multipurpose Reactor (RMB) was conceived to meet national needs for radioisotope production, materials irradiation testing, and neutron beam applications. In addition to its 30~MW pool-type reactor, the RMB complex will include additional facilities for radioisotope production and related applications. $^{161}Tb$ is a promising radionuclide for radiopharmaceutical therapy, offering decay properties similar to $^{177}Lu$ but with additional conversion and Auger electrons that enhance dose delivery to cancer cells. In light of this emerging radioisotope, this study explores the potential production of $^{161}Tb$ in the RMB through neutron irradiation of enriched $Gd_{2}O_{3}$ targets. Monte Carlo (MCNP) simulations provided detailed neutron flux distributions, which were used as input for ORIGEN calculations of isotope buildup. Assuming 10 mg targets enriched to 97.5% in $^{160}Gd$, a 40-day irradiation, and a thermal flux of $2 \\cdot 10^{14}$ $n/cm^{2}s$, the results indicate that $^{161}Tb$ activity reaches approximately 4.5 GBq after 14 days ($\\approx 450 GBq/g$), in agreement with data from other research reactors. Building on prior studies that demonstrated the RMB's capability to irradiate larger targets, terabecquerel-scale yields appear feasible. These findings highlight the RMB's potential to support domestic production of emerging therapeutic radionuclides such as $^{161}Tb$. The potential for isotopic enrichment of $^{160}Gd$ using the AVLIS method is also discussed.",
  "authors": [
    "Fernando Cozim Melges",
    "Jhonatha Ricardo Santos",
    "Luiz Paulo de Oliveira",
    "Alexandre Pinho dos Santos Souza",
    "Carlos Gabriel Santos da Silva",
    "Iberê Souza Ribeiro Júnior",
    "Barbara Perez Gonçalves Silva",
    "Marco Antonio Stanojev Pereira",
    "Frederico Antonio Genezini"
  ],
  "published": "2025-11-17T17:48:24Z",
  "updated": "2025-11-17T17:48:24Z",
  "categories": [
    "physics.ins-det",
    "nucl-ex",
    "nucl-th",
    "physics.med-ph"
  ],
  "primary_category": "physics.ins-det"
}