{
  "arxiv_id": "2511.12328v1",
  "url": "https://arxiv.org/abs/2511.12328v1",
  "pdf_url": "https://arxiv.org/pdf/2511.12328v1.pdf",
  "title": "Laboratory Measurement of the X-ARAPUCA's Absolute Photon Detection Efficiency for the Deep Underground Neutrino Experiment's Vertical Drift Far Detector",
  "abstract": "The Deep Underground Neutrino Experiment (DUNE) will probe fundamental questions in particle physics and cosmology. Its Far Detectors implement a Photon Detection System composed of light-sensitive devices called X-ARAPUCA (XA). These trap incoming VUV photons by total internal reflection in a Wavelength Shifter Light Guide to be collected onto wrapping Silicon Photomultiplier arrays, sensitive to visible light. In the baseline design, Dichroic Filters (DFs) are implemented to improve the collection efficiency of escaping photons. The configuration proposed for DUNE's Vertical Drift module has been characterised in Liquid Argon for the first time using dedicated cryogenic setups developed at CIEMAT and INFN Naples. Additionally, several alternative configurations, based on the design optimisation studies of an R&D campaign, have been evaluated. The results show an efficiency of up to 4.5 $\\pm$ 0.4% at 4.5 V overvoltage, representing a high improvement with respect to previous XA implementations. Most noticeably, configurations without DFs show an improvement of up to 18%, which has been attributed to transmittance deficits.",
  "authors": [
    "G. Botogoske",
    "F. Bruni",
    "E. Calvo",
    "R. Calabrese",
    "N. Canci",
    "A. Canto",
    "C. M. Cattadori",
    "A. Cervera Villanueva",
    "S. Coleman",
    "J. I. Crespo-Anadón",
    "C. Cuesta",
    "F. Di Capua",
    "N. Durand",
    "G. Fiorillo",
    "F. Galizzi",
    "I. Gil-Botella",
    "C. Gotti",
    "G. Grauso",
    "J. Jablonski",
    "A. A. Machado",
    "S. Manthey Corchado",
    "J. Martín-Albo",
    "G. Matteucci",
    "L. Meazza",
    "A. P. Mendoça",
    "A. Minotti",
    "D. Navas-Nicolás",
    "L. Pagliuso",
    "C. Palomares",
    "L. Pérez-Molina",
    "V. Pimentel",
    "I. López de Rego",
    "Z. Rautio",
    "J. Romeo-Araujo",
    "D. Rudik",
    "E. Segreto",
    "Y. Suvorov",
    "M. Sturdivant",
    "F. Terranova",
    "J. Ureña",
    "A. Verdugo de Osa",
    "D. Warner",
    "R. Wilson",
    "K. Zhu"
  ],
  "published": "2025-11-15T19:10:24Z",
  "updated": "2025-11-15T19:10:24Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}