{
  "arxiv_id": "2505.18155v3",
  "url": "https://arxiv.org/abs/2505.18155v3",
  "pdf_url": "https://arxiv.org/pdf/2505.18155v3.pdf",
  "title": "Modelling cosmic-ray transport: magnetised versus unmagnetised motion in astrophysical magnetic turbulence",
  "abstract": "Cosmic-ray transport in turbulent astrophysical environments remains a multifaceted problem and, despite decades of study, the impact of complex magnetic field geometry -- evident in simulations and observations -- has only recently received more focussed attention. To understand how ensemble-averaged transport behaviour emerges from the intricate interactions between cosmic rays and structured magnetic turbulence, we run test-particle experiments in snapshots of a strongly turbulent magnetohydrodynamics simulation. We characterise particle--turbulence interactions via the gyro radii of particles and their experienced field-line curvatures, which reveals two distinct transport modes: magnetised motion, where particles are tightly bound to strong coherent flux tubes and undergo large-scale mirroring; and unmagnetised motion, characterised by chaotic scattering through weak and highly tangled regions of the magnetic field. We formulate an effective stochastic process for each mode: compound subdiffusion with long mean free paths for magnetised motion, and a Langevin process with short mean free paths for unmagnetised motion. A combined stochastic walker that alternates between these two modes accurately reproduces the mean squared displacements observed in the test-particle data. Our results emphasise the critical role of coherent magnetic structures in comprehensively understanding cosmic-ray transport and lay a foundation for developing a theory of geometry-mediated transport.",
  "authors": [
    "Jeremiah Lübke",
    "Patrick Reichherzer",
    "Sophie Aerdker",
    "Frederic Effenberger",
    "Mike Wilbert",
    "Horst Fichtner",
    "Rainer Grauer"
  ],
  "published": "2025-05-23T17:59:52Z",
  "updated": "2025-12-10T20:33:22Z",
  "categories": [
    "physics.plasm-ph",
    "astro-ph.HE"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": "10.1017/S0022377825100883"
}