{
  "arxiv_id": "2512.09686v1",
  "url": "https://arxiv.org/abs/2512.09686v1",
  "pdf_url": "https://arxiv.org/pdf/2512.09686v1.pdf",
  "title": "Surface Ion-Sound Wave in Magnetic Arch With High Pressure Plasma",
  "abstract": "The work analytically substantiates the parameters of the surface wave found in numerical modelling of the collision of two oncoming supersonic plasma flows inside a magnetic arc in application to the experiment on the laboratory setup ``Solar Wind'' (Inst. Appl. Phys RAS). An ion-acoustic surface wave exists in the regime of dense plasma flows when their dynamic pressure is of the order of the pressure of an undisturbed magnetic field, so that the flows push the initial magnetic field out of their volume. The wave frequency is in the range between the ion gyrofrequencies inside the plasma bundle and in the outer region of the confining magnetic field. In the external rarefied medium, the near-surface structure is a heterogeneous magnetic sound, consistent in pressure and low total polarisation of the medium with the ``isotropic'' ion sound confined from the inside in a dense plasma bundle. The energy of the structure is mainly contained in the kinetic energy of the wave motion of ions inside the tube. At the same time, the electric field strength is sharply increased outside. Firstly, the latter circumstance arises from the need to maintain a uniform electron electric drift velocity inside the transition layer. Secondly, the energetically weak ion sound propagating into the outer environment is close to electrostatic ion oscillations below the ion gyrofrequency in the external region, which are characterised by increased electric field strength across the ambient magnetic field.",
  "authors": [
    "Sergey A. Koryagin",
    "Mikhail E. Viktorov",
    "Artem V. Korzhimanov",
    "Andrey A. Elyasin"
  ],
  "published": "2025-12-10T14:35:16Z",
  "updated": "2025-12-10T14:35:16Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}