{
  "arxiv_id": "2501.01524v2",
  "url": "https://arxiv.org/abs/2501.01524v2",
  "pdf_url": "https://arxiv.org/pdf/2501.01524v2.pdf",
  "title": "Gravitational Turbulence: the Small-Scale Limit of the Cold-Dark-Matter   Power Spectrum",
  "abstract": "The matter power spectrum, $P(k)$, is one of the fundamental quantities in the study of large-scale structure in cosmology. Here, we study its small-scale asymptotic limit, and show that for cold dark matter in $d$ spatial dimensions, $P(k)$ has a universal $k^{-d}$ asymptotic scaling with the wave-number $k$, for $k \\gg k_{\\rm nl}$, where $k_{\\rm nl}^{-1}$ denotes the length scale at which non-linearities in gravitational interactions become important. We propose a theoretical explanation for this scaling, based on a non-perturbative analysis of the system's phase-space structure. Gravitational collapse is shown to drive a turbulent phase-space flow of the quadratic Casimir invariant, where the linear and non-linear time scales are balanced, and this balance dictates the $k$ dependence of the power spectrum. A parallel is drawn to Batchelor turbulence in hydrodynamics, where large scales mix smaller ones via tidal interactions. The $k^{-d}$ scaling is also derived by expressing $P(k)$ as a phase-space integral in the framework of kinetic field theory, which is analysed by the saddle-point method; the dominant critical points of this integral are precisely those where the time scales are balanced. The coldness of the dark-matter distribution function - its non-vanishing only on a $d$-dimensional sub-manifold of phase-space - underpins both approaches. The theory is accompanied by $1\\mathrm{D}$ Vlasov-Poisson simulations, which confirm it.",
  "authors": [
    "Yonadav Barry Ginat",
    "Michael L. Nastac",
    "Robert J. Ewart",
    "Sara Konrad",
    "Matthias Bartelmann",
    "Alexander A. Schekochihin"
  ],
  "published": "2025-01-02T20:27:49Z",
  "updated": "2025-07-31T10:14:41Z",
  "categories": [
    "astro-ph.CO",
    "astro-ph.GA",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.CO"
}