{
  "arxiv_id": "2508.03911v1",
  "url": "https://arxiv.org/abs/2508.03911v1",
  "pdf_url": "https://arxiv.org/pdf/2508.03911v1.pdf",
  "title": "Holovibes: real-time ultrahigh-speed digital hologram rendering and   short-time analysis",
  "abstract": "Real-time ultrahigh-speed rendering of digital holograms from high-bitrate interferogram streams demands robust parallel computing and efficient data handling with minimal latency. We present Holovibes, a high-performance software engine that enables real-time holographic image reconstruction and short-time analysis at unprecedented throughput. Holovibes integrates spatial demodulation techniques, such as Fresnel transformations and angular spectrum propagation, with temporal analysis methods including short-time Fourier transform (STFT) and principal component analysis (PCA) in a unified pipeline. By leveraging CUDA-based GPU acceleration, multithreaded parallelism, and efficient buffering, the system achieves high-throughput, low-latency processing suitable for demanding computational imaging applications. We demonstrate sustained real-time hologram rendering of 256x256-pixel from interferograms acquired by a streaming camera at 71,400 frames per second on commodity hardware with no frame loss, while maintaining an end-to-end latency of 30 ms. The engine also supports simultaneous recording of raw or processed data, enabling high-speed acquisition workflows essential for experimental applications. This work represents a significant advance over prior digital holography systems and provides a versatile platform for ultra-high-speed, real-time computational imaging.",
  "authors": [
    "Marius Dubosc",
    "Maxime Boy-Arnould",
    "Jules Guillou",
    "Titouan Gragnic",
    "Arthur Courselle",
    "Gustave Hervé",
    "Alexis Pinson",
    "Etienne Senigout",
    "Bastien Gaulier",
    "Simon Riou",
    "Chloé Magnier",
    "Noé Topeza",
    "Oscar Morand",
    "Thomas Xu",
    "Samuel Goncalves",
    "Edgar Delaporte",
    "Adrien Langou",
    "Paul Duhot",
    "Julien Nicolle",
    "Sacha Bellier",
    "David Chemaly",
    "Damien Didier",
    "Philippe Bernet",
    "Eliott Bouhana",
    "Fabien Colmagro",
    "Guillaume Poisson",
    "Anthony Strazzella",
    "Ilan Guenet",
    "Nicolas Blin",
    "Quentin Kaci",
    "Theo Lepage",
    "Loïc Bellonnet-Mottet",
    "Antoine Martin",
    "François Te",
    "Ellena Davoine",
    "Clement Fang",
    "Danae Marmai",
    "Hugo Verjus",
    "Eloi Charpentier",
    "Julien Gautier",
    "Florian Lapeyre",
    "Thomas Jarrossay",
    "Alexandre Bartz",
    "Cyril Cêtre",
    "Clement Ledant",
    "Eric Delanghe",
    "Arnaud Gaillard",
    "Geoffrey Le Gourrierec",
    "Jeffrey Bencteux",
    "Thomas Kostas",
    "Pierre Pagnoux",
    "Antoine Dillée",
    "Romain Cancillière",
    "Michael Atlan"
  ],
  "published": "2025-08-05T20:55:55Z",
  "updated": "2025-08-05T20:55:55Z",
  "categories": [
    "physics.optics",
    "physics.ins-det"
  ],
  "primary_category": "physics.optics"
}