{
  "arxiv_id": "2508.04806v1",
  "url": "https://arxiv.org/abs/2508.04806v1",
  "pdf_url": "https://arxiv.org/pdf/2508.04806v1.pdf",
  "title": "Electrodeless Magnetohydrodynamic Local Force Generator for Aerocapture",
  "abstract": "This paper presents a novel magnetohydrodynamics (MHD) system for planetary entry aerocapture. The system is advantaged over previous approaches by having the following two characteristics: (i) it can be deployed locally to one or various flow regions, and (ii) it does not make use of electrodes. Previous MHD systems for planetary entry were either electrodeless global systems or two-electrode local systems. The proposed novel MHD system employs two magnets to establish a current loop resulting in a Faraday electromotive force (EMF). The first magnet is positioned to ensure the magnetic field faces outward from the shell, while the second magnet is oriented to ensure the magnetic field faces inward toward the shell. Preliminary findings demonstrate that when located on the surface of an Earth entry capsule at a flight Mach number of 35, the novel electrodeless MHD system can generate forces several times greater than a two-electrode system while utilizing the same magnetic field strength. The study is conducted entirely through numerical simulation using CFDWARP, a computational fluid dynamics (CFD) code that employs advanced numerical methods allowing for the full coupling between aerodynamics, magnetohydrodynamics, and non-neutral plasma sheaths. The physical model includes an 11-species finite-rate chemical solver including real gas effects, the drift-diffusion model for all charged species, along with an electric field potential equation that satisfies Gauss's law.",
  "authors": [
    "Bernard Parent",
    "Felipe Martin Rodriguez Fuentes",
    "Spencer LaFoley"
  ],
  "published": "2025-08-06T18:33:01Z",
  "updated": "2025-08-06T18:33:01Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": "10.2514/1.J064125"
}