{
  "arxiv_id": "2508.05139v1",
  "url": "https://arxiv.org/abs/2508.05139v1",
  "pdf_url": "https://arxiv.org/pdf/2508.05139v1.pdf",
  "title": "Frobenius-Perron Operator Approach to the Beam-Beam Interaction in   Circular Colliders",
  "abstract": "Unlike most publications devoted to the application of the self-consistent method of the nonlinear Vlasov-Poisson system to the study of beam-beam interaction, in this article an alternative strategy using the elegant approach of the Frobenius-Perron operator for symplectic twist maps has been developed. A detailed analysis of the establishment of an equilibrium density distribution in phase space, as well as the behavior of the perturbed distribution function with respect to the coherent stability of the two beams, has been carried out.   Using the Renormalization Group technique for the reduction of the Frobenius-Perron operator, the case where the unperturbed rotation frequency (unperturbed betatron tune) of the map is far from any structural resonance driven by the beam-beam kick perturbation has been analyzed in detail. It has been shown that up to second order in the beam-beam parameter, the renormalized map propagator with nonlinear stabilization describes a random walk of the angle variable, implying that there exists an equilibrium distribution function depending only on the action variable.   The linearized Frobenius-Perron operators for each beam imply a discrete form of the linearized Vlasov equations, which essentially comprises a new method for calculating coherent beam-beam instabilities using a matrix mapping technique. In the special case of an isolated coherent beam-beam resonance, a stability criterion for coherent beam-beam resonances has been found in closed form.   An intriguing particular concerning the effect of repeated beam-beam collisions on collider luminosity has been derived explicitly. An addition of luminosity per kick (small though, of the order of the beam-beam parameter) in the course of successive beam-beam collisions could be achieved.",
  "authors": [
    "Stephan I. Tzenov"
  ],
  "published": "2025-08-07T08:16:57Z",
  "updated": "2025-08-07T08:16:57Z",
  "categories": [
    "physics.acc-ph",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.acc-ph"
}