{
  "arxiv_id": "2506.15234v2",
  "url": "https://arxiv.org/abs/2506.15234v2",
  "pdf_url": "https://arxiv.org/pdf/2506.15234v2.pdf",
  "title": "First Steps Toward the Development of a Straight-Line Reference   Alignment System for Future Accelerators at CERN Using Pseudo-Nondiffracting   Layer Beams",
  "abstract": "This paper presents experimental results that allow for the performance evaluation of a straight-line reference alignment system based on pseudo-nondiffracting Layer beams. Sensors, developed specifically for this system, feature four linear CMOS chips and a square aperture. This allows for simultaneous measurements along the beam path without disrupting the laser reference. Measurements, conducted over a distance of 2 m from the first to the last sensor, were compared with a laser tracker measurement to assess the sensor performance. The alignment reference generated by the Layer Beams exhibited a repeatability and reproducibility root-mean-square error (RMSE) of less than 30 ${\\mu}$m. The relative alignment precision for a known displacement was validated with a standard deviation of 4.3 ${\\mu}$m. The results highlight the underlying sources of noise, which are induced mainly by the cover glass, the protective film of the pixels, and the dark noise of the CMOS chips. Solutions to address these challenges are proposed. Additionally, a proof-of-concept for future development of a radiation-hard sensor utilizing optical fiber matrices is demonstrated. The RMSE of the reference position detection introduced by the fiber matrix remained below 1.3 ${\\mu}$m. This would allow the sensor to be used reliably in high-radiation environments typical for accelerator facilities. This study serves as a foundational step toward developing a robust straight-line reference alignment system based on pseudo-nondiffracting Layer beams intended for deployment in the accelerator facilities.",
  "authors": [
    "Martin Dušek",
    "Sebastian Figura",
    "Jakub Michal Polak",
    "Solomon William Kamugasa",
    "Dirk Mergelkuhl",
    "Witold Niewiem",
    "Štěpán Kunc",
    "Jean-Christophe Gayde",
    "Miroslav Šulc"
  ],
  "published": "2025-06-18T08:18:05Z",
  "updated": "2025-08-26T14:58:02Z",
  "categories": [
    "physics.ins-det",
    "physics.app-ph",
    "physics.optics"
  ],
  "primary_category": "physics.ins-det"
}