{
  "arxiv_id": "2508.13372v2",
  "url": "https://arxiv.org/abs/2508.13372v2",
  "pdf_url": "https://arxiv.org/pdf/2508.13372v2.pdf",
  "title": "Free electron charging of microdroplets in a plasma at atmospheric   pressure",
  "abstract": "Gas phase microdroplets have recently demonstrated exceptional chemical properties via suspected mechanisms such as contact electrification and surface charge pinning leading, in turn, to high electric fields at the surface. In this work, microdroplets are injected into a low temperature flowing gas plasma at atmospheric pressure and during flight they are subject to an excess free electron flux. We report the first measurements of particle charge acquired in a fully collisional plasma with average values up to $2.5 \\times 10^{5}$ electrons, dependent on absorbed power, for droplets with an average diameter of $15~\\mu\\mathrm{m}$. Simulations indicate that for similar plasma conditions, the acquired charge on solid particles would be $\\sim40\\%$ lower, at $1.5 \\times 10^{5}$ electrons, with the difference likely due in part to low mobility water cluster ion formation around the evaporating droplet. Simulations also indicate surface electric fields up to $1 \\times 10^{7}\\,\\mathrm{V\\,m^{-1}}$ for the smallest droplets ($3~\\mu\\mathrm{m}$). The formation of H$_2$O$_2$ was observed in the liquid with measured values up to 33 mM, equivalent to a remarkable generation rate of over $275~\\mathrm{M\\,s^{-1}}$. The microdroplet system involves a complex interplay of various potential mechanisms, yet to be elucidated. The inclusion of a controlled plasma environment offers the capability for creating known charge levels and defined exposure times to allow more systematic study as well as enhancing their already exceptional characteristics.",
  "authors": [
    "Nourhan Hendawy",
    "Harold McQuaid",
    "Somhairle Mag Uidhir",
    "David Rutherford",
    "Declan Diver",
    "Davide Mariotti",
    "Paul Maguire"
  ],
  "published": "2025-08-18T21:27:54Z",
  "updated": "2025-08-26T02:02:19Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}