{
  "arxiv_id": "2508.18573v1",
  "url": "https://arxiv.org/abs/2508.18573v1",
  "pdf_url": "https://arxiv.org/pdf/2508.18573v1.pdf",
  "title": "Results of the LEGEND-200 experiment in the search for neutrinoless   double beta decay",
  "abstract": "The LEGEND experiment is looking for the extremely rare neutrinoless double beta ($0\\nu\\beta\\beta$) decay of $^{76}$Ge using isotopically-enriched high-purity germanium (HPGe) detectors. The detection of this process would imply that the neutrino is a Majorana particle and the total lepton number would not be conserved, which could be related to the cosmological asymmetry between matter and antimatter through leptogenesis. The long-term goal of the collaboration is LEGEND-1000: a 1-ton detector array planned to run for 10 years, with a projected half-life sensitivity exceeding $10^{28}$ years, fully covering the inverted neutrino mass hierarchy. A first search for the $0\\nu\\beta\\beta$ decay has been carried out by LEGEND-200 building on the experience gained from GERDA and the MAJORANA DEMONSTRATOR. The experiment has been collecting physics data for a year at the Gran Sasso National Laboratory in Italy with 140 kg of HPGe detectors. With a total exposure of 61 kg yr, LEGEND-200 has achieved a background index of $5^{+3}_{-2}\\times10^{-4}$ counts/(keV kg yr) in the $0\\nu\\beta\\beta$ decay signal region from the highest performing detectors. After combining the results from GERDA, the MAJORANA Demonstrator and LEGEND-200, an exclusion sensitivity $ > 2.8\\times10^{26}$ yr has been obtained at 90\\% confidence level for the $0\\nu\\beta\\beta$ decay half-life, with no evidence for a signal. A new observed lower limit of $T^{0\\nu}_{1/2} > 1.9\\times10^{26}$ yr at 90\\% confidence level has been established.",
  "authors": [
    "Carmen Romo-Luque"
  ],
  "published": "2025-08-26T00:13:14Z",
  "updated": "2025-08-26T00:13:14Z",
  "categories": [
    "hep-ex",
    "physics.ins-det"
  ],
  "primary_category": "hep-ex"
}