{
  "arxiv_id": "2508.17080v1",
  "url": "https://arxiv.org/abs/2508.17080v1",
  "pdf_url": "https://arxiv.org/pdf/2508.17080v1.pdf",
  "title": "Terahertz-Driven Nano-tip Field-Emission Electron Gun and Cascaded   Acceleration",
  "abstract": "This paper reports two versions of terahertz (THz)-driven nanotip field-emission electron guns: single-layer reflective guns (SLRGs) and double-layer reflective guns (DLRGs). Both guns use nanotip emitters and accelerate electrons through the electric field of the THz wave. SLRGs employ a reflective structure to superimpose the initial and subsequent half-cycles of the THz electric field, enhancing the field amplitude and acceleration efficiency. Experiments have demonstrated that SLRGs achieve higher acceleration efficiency than single-layer nonreflective guns (SLNRGs) for identical THz input energies. This constitutes direct experimental verification of the efficacy of the reflective structure. Theoretically, SLRGs operating in single-feed mode can match the acceleration efficiency of dual-feed SLNRGs while reducing operational complexity. DLRGs demonstrate THz-driven cascaded electron acceleration through precise scanning of the delay between two incident THz beams. This represents a direct experimental demonstration of cascaded acceleration in THz-driven electron sources. The experimental results of DLRGs align closely with the results of electron dynamics predicted by simulations. This establishes the foundation for developing multilayer high-acceleration-efficiency THz-driven high-energy electron guns. The ability to manipulate the THz for each layer individually holds promising potential for improving the beam quality of THz electron guns.",
  "authors": [
    "Wentao Yu",
    "Nongchao Tan",
    "Kai Peng",
    "Sijie Fan",
    "Yixiao Fu",
    "Kai Jiang",
    "Zhao Yun",
    "Longding Wang",
    "Renkai Li",
    "Yingchao Du",
    "Lixin Yan",
    "Chuanxiang Tang",
    "Wenhui Huang"
  ],
  "published": "2025-08-23T16:36:04Z",
  "updated": "2025-08-23T16:36:04Z",
  "categories": [
    "physics.acc-ph"
  ],
  "primary_category": "physics.acc-ph"
}