{
  "arxiv_id": "2508.19296v1",
  "url": "https://arxiv.org/abs/2508.19296v1",
  "pdf_url": "https://arxiv.org/pdf/2508.19296v1.pdf",
  "title": "Solar cosmic ray generation, Newtonian gravity, missing mass, dark   energy, laboratory-based nuclear astrophysics, and all that",
  "abstract": "Begun as part of a promotion of accelerator-based nuclear astrophysics, research toward this goal has shifted to cosmic ray production within the solar system. This has been motivated by the high quality of data collected recently by programs such as the International Space Station (ISS), by the fundamental importance of the topic, and by the unsatisfactory state of our understanding of the actual source of cosmic rays. A ``minor'' change in the Newtonian gravitational formulation converts solar production of high energy cosmic rays from ``impossible'' to ``likely'', without much disrupting the vast existent domain of well understood astronomical gravitational processes. This change enables the sun to ``capture'' protons of energy so high that they would, otherwise, escape the solar system. This change in Newton's gravitational formula would disrupt current cosmological understanding of missing mass and dark energy. With this changed understanding of gravity, it has been quite easy to produce a semi-quantitative understanding of the solar origin of cosmic rays up to energies at least as great as $10^6$\\,GeV/nucleon that have by now been detected and measured so persuasively. A ``Double Slingshot'' mechanism is proposed according to which at least a substantial fraction of all cosmic rays could have begun their life within the solar system. Accelerator-based nuclear astrophysics is promoted, beginning with the functioning of an ``{\\rm E}\\&{\\rm M}'' storage ring for laboratory-based study of processes such as ${\\rm 6LI} + {\\rm 7Li} \\rightarrow {\\rm 13C} + \\gamma$. Especially to be emphasized are experiments made possible by ''rear-end collisions'' between nuclear isotopes of two different types traveling simultaneously at different velocities in the same direction in the same storage ring. This amounts to ``studying nuclear physics in a moving frame of reference''.",
  "authors": [
    "Richard Talman"
  ],
  "published": "2025-08-25T17:52:16Z",
  "updated": "2025-08-25T17:52:16Z",
  "categories": [
    "physics.acc-ph"
  ],
  "primary_category": "physics.acc-ph"
}