[
  {
    "arxiv_id": "2508.20090v1",
    "url": "https://arxiv.org/abs/2508.20090v1",
    "pdf_url": "https://arxiv.org/pdf/2508.20090v1.pdf",
    "title": "Multi-channel, multi-template event reconstruction for SuperCDMS data   using machine learning",
    "abstract": "SuperCDMS SNOLAB uses kilogram-scale germanium and silicon detectors to search for dark matter. Each detector has Transition Edge Sensors (TESs) patterned on the top and bottom faces of a large crystal substrate, with the TESs electrically grouped into six phonon readout channels per face. Noise correlations are expected among a detector's readout channels, in part because the channels and their readout electronics are located in close proximity to one another. Moreover, owing to the large size of the detectors, energy deposits can produce vastly different phonon propagation patterns depending on their location in the substrate, resulting in a strong position dependence in the readout-channel pulse shapes. Both of these effects can degrade the energy resolution and consequently diminish the dark matter search sensitivity of the experiment if not accounted for properly. We present a new algorithm for pulse reconstruction, mathematically formulated to take into account correlated noise and pulse shape variations. This new algorithm fits N readout channels with a superposition of M pulse templates simultaneously - hence termed the N$\\times$M filter. We describe a method to derive the pulse templates using principal component analysis (PCA) and to extract energy and position information using a gradient boosted decision tree (GBDT). We show that these new N$\\times$M and GBDT analysis tools can reduce the impact from correlated noise sources while improving the reconstructed energy resolution for simulated mono-energetic events by more than a factor of three and for the 71Ge K-shell electron-capture peak recoils measured in a previous version of SuperCDMS called CDMSlite to $<$ 50 eV from the previously published value of $\\sim$100 eV. These results lay the groundwork for position reconstruction in SuperCDMS with the N$\\times$M outputs.",
    "authors": [
      "M. F. Albakry",
      "I. Alkhatib",
      "D. Alonso-Gonzalez",
      "J. Anczarski",
      "T. Aralis",
      "T. Aramaki",
      "I. Ataee Langroudy",
      "C. Bathurst",
      "R. Bhattacharyya",
      "A. J. Biff",
      "P. L. Brink",
      "M. Buchanan",
      "R. Bunker",
      "B. Cabrera",
      "R. Calkins",
      "R. A. Cameron",
      "C. Cartaro",
      "D. G. Cerdeno",
      "Y. -Y. Chang",
      "M. Chaudhuri",
      "J. H. Chen",
      "R. Chen",
      "N. Chott",
      "J. Cooley",
      "H. Coombes",
      "P. Cushman",
      "R. Cyna",
      "S. Das",
      "S. Dharani",
      "M. L. di Vacri",
      "M. D. Diamond",
      "M. Elwan",
      "S. Fallows",
      "E. Fascione",
      "E. Figueroa-Feliciano",
      "S. L. Franzen",
      "A. Gevorgian",
      "M. Ghaith",
      "G. Godden",
      "J. Golatkara",
      "S. R. Golwala",
      "R. Gualtieri",
      "J. Hall",
      "S. A. S. Harms",
      "C. Hays",
      "B. A. Hines",
      "Z. Hong",
      "L. Hsu",
      "M. E. Huber",
      "V. Iyer",
      "V. K. S. Kashyap",
      "S. T. D. Keller",
      "M. H. Kelsey",
      "K. T. Kennard",
      "Z. Kromer",
      "A. Kubik",
      "N. A. Kurinsky",
      "M. Lee",
      "J. Leyva",
      "B. Lichtenberga",
      "J. Liu",
      "Y. Liu",
      "E. Lopez Asamard",
      "P. Lukens",
      "R. Lopez Noe",
      "D. B. MacFarlane",
      "R. Mahapatra",
      "J. S. Mammo",
      "A. J. Mayer",
      "P. C. McNamara",
      "E. Michaud",
      "E. Michielin",
      "K. Mickelson",
      "N. Mirabolfathi",
      "M. Mirzakhani",
      "B. Mohanty",
      "D. Mondal",
      "D. Monteiro",
      "J. Nelson",
      "H. Neog",
      "J. L. Orrell",
      "M. D. Osborne",
      "S. M. Oser",
      "L. Pandey",
      "S. Pandey",
      "R. Partridge",
      "P. K. Patel",
      "D. S. Pedrerosa",
      "W. Peng",
      "W. L. Perry",
      "R. Podviianiuk",
      "M. Potts",
      "S. S. Poudel",
      "A. Pradeep",
      "M. Pyle",
      "W. Rau",
      "T. Reynold",
      "M. Rios",
      "A. Roberts",
      "A. E. Robinson",
      "L. Rosado",
      "J. L. Ryan",
      "T. Saab",
      "D. Sadek",
      "B. Sadoulet",
      "S. P. Sahoo",
      "I. Saikia",
      "S. Salehi",
      "J. Sander",
      "B. Sandoval",
      "A. Sattari",
      "R. W. Schnee",
      "B. Serfass",
      "A. E. Sharbaugh",
      "R. S. Shenoy",
      "A. Simchony",
      "P. Sinervo",
      "Z. J. Smith",
      "R. Soni",
      "K. Stifter",
      "J. Street",
      "M. Stukel",
      "H. Sun",
      "E. Tanner",
      "N. Tenpas",
      "D. Toback",
      "A. N. Villano",
      "J. Viola",
      "B. von Krosigk",
      "O. Wen",
      "Z. William",
      "M. J. Wilson",
      "J. Winchell",
      "S. Yellin",
      "B. A. Young",
      "B. Zatschler",
      "S. Zatschler",
      "A. Zaytsev",
      "E. Zhang",
      "L. Zheng",
      "A. Zuniga",
      "M. J. Zurowski"
    ],
    "published": "2025-08-27T17:56:29Z",
    "updated": "2025-08-27T17:56:29Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.11764v2",
    "url": "https://arxiv.org/abs/2508.11764v2",
    "pdf_url": "https://arxiv.org/pdf/2508.11764v2.pdf",
    "title": "Multiphysics Analysis of Cryogenically Cooled Photocathode in a CW SRF   Injector cavity",
    "abstract": "The paper evaluates the thermal regime of a cryogenically cooled copper photocathode integrated into a continuous-wave superconducting radio-frequency injector cavity with direct thermal contact. Such a photoinjector layout is being developed at DESY and has recently demonstrated a record-high 50 MV/m axial electric field in radio-frequency tests, marking an important milestone. To address the thermal effect of the picosecond excitation laser, we first develop a two-temperature model to describe the temperature of the emitting surface at cryogenic temperatures and solve it numerically. Subsequently, we present a one-temperature model of the bulk photocathode coupled with an electromagnetic model of the injector cavity. For the current injector design, we predict a negligible impact of the laser on the intrinsic quality factor of the cavity, identifying instead the cryogenic stability of the copper cathode as the primary operational limit. To overcome cooling challenges, we propose an improved configuration of the cathode plug. For the proposed geometry, the multiphysics analysis confirms stable performance at a nominal 2 W laser power, sufficient for 100 pC beams at 1 MHz under optimistic quantum efficiency assumptions. Operation at higher laser loads will benefit from further dedicated cryogenic analysis.",
    "authors": [
      "Dmitry Bazyl",
      "Klaus Floettmann",
      "Elmar Vogel",
      "Igor Zagorodnov"
    ],
    "published": "2025-08-15T18:29:44Z",
    "updated": "2025-08-27T16:36:21Z",
    "categories": [
      "physics.acc-ph",
      "physics.app-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2503.11285v2",
    "url": "https://arxiv.org/abs/2503.11285v2",
    "pdf_url": "https://arxiv.org/pdf/2503.11285v2.pdf",
    "title": "Knock Out Slow Extraction Using Betatron Sidebands at High Harmonics",
    "abstract": "Radio frequency knock out resonant slow extraction is a standard method for extracting stored particle beams from synchrotrons by transverse excitation. Excitation signals comprising many betatron sidebands have shown to reduce intensity fluctuations of the extracted beam spill and are used at several facilities. In this contribution, the effect of individual sidebands at different harmonics on the spill quality is systematically studied. Particle tracking simulations show a clear correlation between the chosen excitation frequency, the spectrum of particle motion shortly before their extraction, and the spill quality. Experiments confirm these observations while highlighting the reduction of pile-up when using higher excitation frequencies. These insights have implications for an optimal design of excitation waveforms and hardware for knock out extraction systems.",
    "authors": [
      "Philipp Niedermayer",
      "Rahul Singh",
      "Eike Feldmeier",
      "Christian Schömers",
      "Marcel Hun"
    ],
    "published": "2025-03-14T10:46:10Z",
    "updated": "2025-08-27T15:40:40Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.19962v1",
    "url": "https://arxiv.org/abs/2508.19962v1",
    "pdf_url": "https://arxiv.org/pdf/2508.19962v1.pdf",
    "title": "A cryogenic chamber setup for superfluid helium experiments with optical   fiber and electrical access",
    "abstract": "Superfluid helium is a prototypical quantum liquid. As such, it has been a prominent platform for the study of quantum many body physics. More recently, the outstanding mechanical and optical properties of superfluid helium, such as low mechanical dissipation and low optical absorption, have positioned superfluid helium as a promising material platform in applications ranging from dark matter and gravitational wave detection to quantum computation. However, experiments with superfluid helium incur a high barrier to entry as they require incorporation of complex optical and electrical setups within a hermetically sealed cryogenic chamber to confine the superfluid. Here, we report on the design and construction of a helium chamber setup for operation inside a dilution refrigerator at Millikelvin temperatures, featuring electrical and optical fiber access. By incorporating an automated gas handling system, we can precisely control the amount of helium gas inserted into the chamber, rendering our setup particularly promising for experiments with superfluid helium thin films, such as superfluid thin film optomechanics. Using silicon nanophotonic resonators, we demonstrate precise control and in-situ tuning of the thickness of a superfluid helium film on the sub-nanometer level. By making use of the exceptional tunability of the superfluid film thickness, we demonstrate optomechanically induced phonon lasing of phononic crystal cavity third sound modes in the superfluid film and show that the lasing threshold crucially depends on the film thickness. The large internal volume of our chamber (V_chamber = 1l) is adaptable for integration of various optical and electrical measurement and control techniques. Therefore, our setup provides a versatile platform for a variety of experiments in fundamental and applied superfluid helium research.",
    "authors": [
      "Alexander R. Korsch",
      "Niccolò Fiaschi",
      "Simon Gröblacher"
    ],
    "published": "2025-08-27T15:17:24Z",
    "updated": "2025-08-27T15:17:24Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mes-hall",
      "cond-mat.quant-gas",
      "cond-mat.supr-con",
      "physics.app-ph",
      "quant-ph"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1063/5.0249931"
  },
  {
    "arxiv_id": "2508.19820v1",
    "url": "https://arxiv.org/abs/2508.19820v1",
    "pdf_url": "https://arxiv.org/pdf/2508.19820v1.pdf",
    "title": "Molecular dynamics of nondegenerate hydrogen plasma using improved Kelbg   pseudopotential with electron finite-size correction",
    "abstract": "This paper is devoted to semiclassical molecular dynamics simulation of nondegenerate hydrogen plasma using an improved Kelbg pseudopotential. The main novelty of our method is accounting for the finite size of electrons. This modification resolves the nonphysical cluster formation at temperatures below 50 kK, which was first reported by A.V. Filinov [Phys. Rev. E 70, 046411 (2004)]. However, the energy still appears to be underestimated at low temperatures, as indicated by comparisons with the recent path integral Monte Carlo calculations [Phys. Plasmas 31, 110501 (2024)]. Using the presented method, we analyze the dependence of radial distribution functions, composition, ionization degree, energy, and pressure on the plasma coupling parameter, while maintaining a fixed degeneracy parameter. Additionally, we demonstrate the impact of incorporating long-range interactions on the energy $N$-dependence by utilizing the angular-averaged Ewald potential. Finally, we compute the thermodynamic limits for energy and pressure.",
    "authors": [
      "G. S. Demyanov",
      "P. R. Levashov"
    ],
    "published": "2025-08-27T12:07:59Z",
    "updated": "2025-08-27T12:07:59Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.19693v1",
    "url": "https://arxiv.org/abs/2508.19693v1",
    "pdf_url": "https://arxiv.org/pdf/2508.19693v1.pdf",
    "title": "Testing a Computed Tomography Imaging Spectrometer for Earth   Observations on the HEIMDAL Stratospheric Balloon Mission",
    "abstract": "Stratospheric High Altitude Balloons (HABs) have great potential as a remote sensing platform for Earth Observations that complements orbiting satellites and low flying drones. At altitudes between 20-35 kms, HABs operate significantly closer to ground than orbiting satellites, but significantly higher than most drones. HABs therefore offer a unique potential to deliver high spatial resolution imaging with large area coverage. Another two imaging parameters that are important for Earth Observation applications are spectral resolution and spectral range. In this paper, we therefore present the development and testing of a hyperspectral imaging system, able to record near-video-rate images in narrow contiguous spectral bands, from a HAB platform. In particular, we present the first stratospheric environmental tests and HAB flight of a snapshot hyperspectral camera, based on Computed Tomography Imaging Spectroscopy (CTIS), which is well suited to cope with the challenges posed by the motion of the HAB platform and the stratospheric environment. We have successfully acquired images with the system under both simulated stratospheric conditions in the Mars Simulation Laboratory at Aarhus University and during a 5 hour HAB flight mission named HEIMDAL from Kiruna in October 2024 as part of the REXUS/BEXUS 34/35 2024 campaign organized by DLR-SNSA. The study represents a step towards deploying the HAB platform for high quality land cover classification.",
    "authors": [
      "Mads Juul Ahlebæk",
      "Albertino Antonio Almeida Bach",
      "Loui Collin-Enoch",
      "Christian Cordes",
      "Boas Hermansson",
      "Christian Hald Jessen",
      "Søren Peter Jørgensen",
      "Tobias Jørgensen",
      "Viktor Ulrich Kanstrup",
      "Laurits Tværmose Nielsen",
      "Jes Enok Steinmüller",
      "Mads Svanborg Peters",
      "Jonathan Merrison",
      "René Lynge Eriksen",
      "Christoffer Karoff",
      "Mads Toudal Frandsen"
    ],
    "published": "2025-08-27T09:01:22Z",
    "updated": "2025-08-27T09:01:22Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "physics.bio-ph",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.19662v1",
    "url": "https://arxiv.org/abs/2508.19662v1",
    "pdf_url": "https://arxiv.org/pdf/2508.19662v1.pdf",
    "title": "Transition of blue-core helicon discharge",
    "abstract": "This study explores the transitional characteristics of blue-core helicon discharge, which to our knowledge was not particularly focused on before. Parameters are measured on recently built advanced linear plasma device, i.e. Multiple Plasma Simulation Linear Device (MPS-LD) by various diagnostics including Langmuir probe, optical emission spectrometer, and standard high-speed camera. It is found that the jump direction of electron density (from low level to high level) is opposite to that of electron temperature (from high level to low level). Electron density increases significantly and the radial profile becomes localized near the axis when the blue-core transition occurs. With increased field strength, electron density increases whereas electron temperature drops. The radial profile of electron temperature looks like a ``W\" shape, i.e. minimizing around the edge of blue-core column. Electron density increases with background pressure, while electron temperature peaks around certain pressure value. High-speed videos show that the plasma column oscillates radially and experiences azimuthal instabilities with high rate once entered blue-core mode. An electromagnetic solver (EMS) based on Maxwell's equations and a cold-plasma dielectric tensor is also employed to compute the wave field and power absorption during blue-core transition, to provide more details that are valuable for understanding the transitional physics but not yet available in experiment. The results show that wave field in both radial and axial directions changes significantly during the transition, its structure differs from antenna to downstream, and the power dependence of wave magnetic field is overall opposite to that of wave electric field. This work presents comprehensive characteristics of the transitional blue-core discharge and is important to both physics understanding and practical applications.",
    "authors": [
      "L. Chang",
      "S. J. Zhang",
      "J. T. Wu",
      "Y. W. Zhang",
      "C. Wang",
      "Y. Peng",
      "S. S. Gao",
      "C. J. Sun",
      "Q. Wang",
      "C. F. Sang",
      "S. C. Thakur",
      "S. Isayama",
      "S. J. You"
    ],
    "published": "2025-08-27T08:21:04Z",
    "updated": "2025-08-27T08:21:04Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.19653v1",
    "url": "https://arxiv.org/abs/2508.19653v1",
    "pdf_url": "https://arxiv.org/pdf/2508.19653v1.pdf",
    "title": "Charting the Luminosity Capabilities of the CERN Large Hadron Collider   with Various Nuclear Species",
    "abstract": "The Large Hadron Collider (LHC) at CERN has been instrumental in recent advances in experimental high energy physics by colliding beams of protons and heavier nuclei at unprecedented energies. The present heavy-ion programme is based mainly on colliding lead nuclei. For future ion runs, there is strong interest to achieve a significantly higher integrated nucleon-nucleon luminosity, which might be achieved through collisions of species other than Pb. In this paper, we explore the nucleon-nucleon luminosity projections in the LHC for a selection of ion species ranging from He to Xe, and including Pb as reference. Alternative beam production schemes are investigated as a way to mitigate effects such as space charge that degrade the beam quality in the LHC injectors. In the most optimistic scenarios, we find up to about a factor~4 improvement in integrated nucleon-nucleon luminosity for a typical future one-month run, with respect to the present Pb programme. We also outline a future study programme and experiments to test the assumptions and refine the simulated projections put forward in this article.",
    "authors": [
      "E. Waagaard",
      "R. Bruce",
      "R. Alemany Fernandez",
      "H. Bartosik",
      "J. M. Jowett",
      "N. Triantafyllou"
    ],
    "published": "2025-08-27T08:01:30Z",
    "updated": "2025-08-27T08:01:30Z",
    "categories": [
      "physics.acc-ph",
      "nucl-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.08586v3",
    "url": "https://arxiv.org/abs/2507.08586v3",
    "pdf_url": "https://arxiv.org/pdf/2507.08586v3.pdf",
    "title": "Spatial and Temporal Evaluations of the Liquid Argon Purity in   ProtoDUNE-SP",
    "abstract": "Liquid argon time projection chambers (LArTPCs) rely on highly pure argon to ensure that ionization electrons produced by charged particles reach readout arrays. ProtoDUNE Single-Phase (ProtoDUNE-SP) was an approximately 700-ton liquid argon detector intended to prototype the Deep Underground Neutrino Experiment (DUNE) Far Detector Horizontal Drift module. It contains two drift volumes bisected by the cathode plane assembly, which is biased to create an almost uniform electric field in both volumes. The DUNE Far Detector modules must have robust cryogenic systems capable of filtering argon and supplying the TPC with clean liquid. This paper will explore comparisons of the argon purity measured by the purity monitors with those measured using muons in the TPC from October 2018 to November 2018. A new method is introduced to measure the liquid argon purity in the TPC using muons crossing both drift volumes of ProtoDUNE-SP. For extended periods on the timescale of weeks, the drift electron lifetime was measured to be above 30 ms using both systems. A particular focus will be placed on the measured purity of argon as a function of position in the detector.",
    "authors": [
      "DUNE Collaboration",
      "S. Abbaslu",
      "A. Abed Abud",
      "R. Acciarri",
      "L. P. Accorsi",
      "M. A. Acero",
      "M. R. Adames",
      "G. Adamov",
      "M. Adamowski",
      "C. Adriano",
      "F. Akbar",
      "F. Alemanno",
      "N. S. Alex",
      "K. Allison",
      "M. Alrashed",
      "A. Alton",
      "R. Alvarez",
      "T. Alves",
      "A. Aman",
      "H. Amar",
      "P. Amedo",
      "J. Anderson",
      "D. A. Andrade",
      "C. Andreopoulos",
      "M. Andreotti",
      "M. P. Andrews",
      "F. Andrianala",
      "S. Andringa",
      "F. Anjarazafy",
      "S. Ansarifard",
      "D. Antic",
      "M. Antoniassi",
      "A. Aranda-Fernandez",
      "L. Arellano",
      "E. Arrieta Diaz",
      "M. A. Arroyave",
      "M. Arteropons",
      "J. Asaadi",
      "M. Ascencio",
      "A. Ashkenazi",
      "D. Asner",
      "L. Asquith",
      "E. Atkin",
      "D. Auguste",
      "A. Aurisano",
      "V. Aushev",
      "D. Autiero",
      "D. Ávila Gómez",
      "M. B. Azam",
      "F. Azfar",
      "A. Back",
      "J. J. Back",
      "Y. Bae",
      "I. Bagaturia",
      "L. Bagby",
      "D. Baigarashev",
      "S. Balasubramanian",
      "A. Balboni",
      "P. Baldi",
      "W. Baldini",
      "J. Baldonedo",
      "B. Baller",
      "B. Bambah",
      "F. Barao",
      "D. Barbu",
      "G. Barenboim",
      "P. Barham Alzás",
      "G. J. Barker",
      "W. Barkhouse",
      "G. Barr",
      "A. Barros",
      "N. Barros",
      "D. Barrow",
      "J. L. Barrow",
      "A. Basharina-Freshville",
      "A. Bashyal",
      "V. Basque",
      "M. Bassani",
      "D. Basu",
      "C. Batchelor",
      "L. Bathe-Peters",
      "J. B. R. Battat",
      "F. Battisti",
      "J. Bautista",
      "F. Bay",
      "J. L. L. Bazo Alba",
      "J. F. Beacom",
      "E. Bechetoille",
      "B. Behera",
      "E. Belchior",
      "B. Bell",
      "G. Bell",
      "L. Bellantoni",
      "G. Bellettini",
      "V. Bellini",
      "O. Beltramello",
      "A. Belyaev",
      "C. Benitez Montiel",
      "D. Benjamin",
      "F. Bento Neves",
      "J. Berger",
      "S. Berkman",
      "J. Bermudez",
      "J. Bernal",
      "P. Bernardini",
      "A. Bersani",
      "E. Bertholet",
      "E. Bertolini",
      "S. Bertolucci",
      "M. Betancourt",
      "A. Betancur Rodríguez",
      "Y. Bezawada",
      "A. T. Bezerra",
      "A. Bhat",
      "V. Bhatnagar",
      "J. Bhatt",
      "M. Bhattacharjee",
      "S. Bhattacharjee",
      "M. Bhattacharya",
      "S. Bhuller",
      "B. Bhuyan",
      "S. Biagi",
      "J. Bian",
      "K. Biery",
      "B. Bilki",
      "M. Bishai",
      "A. Blake",
      "F. D. Blaszczyk",
      "G. C. Blazey",
      "E. Blucher",
      "B. Bogart",
      "J. Boissevain",
      "S. Bolognesi",
      "T. Bolton",
      "L. Bomben",
      "M. Bonesini",
      "C. Bonilla-Diaz",
      "A. Booth",
      "F. Boran",
      "R. Borges Merlo",
      "N. Bostan",
      "G. Botogoske",
      "B. Bottino",
      "R. Bouet",
      "J. Boza",
      "J. Bracinik",
      "B. Brahma",
      "D. Brailsford",
      "F. Bramati",
      "A. Branca",
      "A. Brandt",
      "J. Bremer",
      "S. J. Brice",
      "V. Brio",
      "C. Brizzolari",
      "C. Bromberg",
      "J. Brooke",
      "A. Bross",
      "G. Brunetti",
      "M. B. Brunetti",
      "N. Buchanan",
      "H. Budd",
      "J. Buergi",
      "A. Bundock",
      "D. Burgardt",
      "S. Butchart",
      "G. Caceres V.",
      "R. Calabrese",
      "R. Calabrese",
      "J. Calcutt",
      "L. Calivers",
      "E. Calvo",
      "A. Caminata",
      "A. F. Camino",
      "W. Campanelli",
      "A. Campani",
      "A. Campos Benitez",
      "N. Canci",
      "J. Capó",
      "I. Caracas",
      "D. Caratelli",
      "D. Carber",
      "J. M. Carceller",
      "G. Carini",
      "B. Carlus",
      "M. F. Carneiro",
      "P. Carniti",
      "I. Caro Terrazas",
      "H. Carranza",
      "N. Carrara",
      "L. Carroll",
      "T. Carroll",
      "A. Carter",
      "E. Casarejos",
      "D. Casazza",
      "J. F. Castaño Forero",
      "F. A. Castaño",
      "C. Castromonte",
      "E. Catano-Mur",
      "C. Cattadori",
      "F. Cavalier",
      "F. Cavanna",
      "S. Centro",
      "G. Cerati",
      "C. Cerna",
      "A. Cervelli",
      "A. Cervera Villanueva",
      "J. Chakrani",
      "M. Chalifour",
      "A. Chappell",
      "A. Chatterjee",
      "B. Chauhan",
      "C. Chavez Barajas",
      "H. Chen",
      "M. Chen",
      "W. C. Chen",
      "Y. Chen",
      "Z. Chen",
      "D. Cherdack",
      "S. S. Chhibra",
      "C. Chi",
      "F. Chiapponi",
      "R. Chirco",
      "N. Chitirasreemadam",
      "K. Cho",
      "S. Choate",
      "G. Choi",
      "D. Chokheli",
      "P. S. Chong",
      "B. Chowdhury",
      "D. Christian",
      "M. Chung",
      "E. Church",
      "M. F. Cicala",
      "M. Cicerchia",
      "V. Cicero",
      "R. Ciolini",
      "P. Clarke",
      "G. Cline",
      "A. G. Cocco",
      "J. A. B. Coelho",
      "A. Cohen",
      "J. Collazo",
      "J. Collot",
      "H. Combs",
      "J. M. Conrad",
      "L. Conti",
      "T. Contreras",
      "M. Convery",
      "K. Conway",
      "S. Copello",
      "P. Cova",
      "C. Cox",
      "L. Cremonesi",
      "J. I. Crespo-Anadón",
      "M. Crisler",
      "E. Cristaldo",
      "J. Crnkovic",
      "G. Crone",
      "R. Cross",
      "A. Cudd",
      "C. Cuesta",
      "Y. Cui",
      "F. Curciarello",
      "D. Cussans",
      "J. Dai",
      "O. Dalager",
      "W. Dallaway",
      "R. D'Amico",
      "H. da Motta",
      "Z. A. Dar",
      "R. Darby",
      "L. Da Silva Peres",
      "Q. David",
      "G. S. Davies",
      "S. Davini",
      "J. Dawson",
      "R. De Aguiar",
      "P. Debbins",
      "M. P. Decowski",
      "A. de Gouvêa",
      "P. C. De Holanda",
      "P. De Jong",
      "P. Del Amo Sanchez",
      "G. De Lauretis",
      "A. Delbart",
      "M. Delgado",
      "A. Dell'Acqua",
      "G. Delle Monache",
      "N. Delmonte",
      "P. De Lurgio",
      "G. De Matteis",
      "J. R. T. de Mello Neto",
      "A. P. A. De Mendonca",
      "D. M. DeMuth",
      "S. Dennis",
      "C. Densham",
      "P. Denton",
      "G. W. Deptuch",
      "A. De Roeck",
      "V. De Romeri",
      "J. P. Detje",
      "J. Devine",
      "K. Dhanmeher",
      "R. Dharmapalan",
      "M. Dias",
      "A. Diaz",
      "J. S. Díaz",
      "F. Díaz",
      "F. Di Capua",
      "A. Di Domenico",
      "S. Di Domizio",
      "S. Di Falco",
      "L. Di Giulio",
      "P. Ding",
      "L. Di Noto",
      "E. Diociaiuti",
      "G. Di Sciascio",
      "V. Di Silvestre",
      "C. Distefano",
      "R. Di Stefano",
      "R. Diurba",
      "M. Diwan",
      "Z. Djurcic",
      "S. Dolan",
      "M. Dolce",
      "M. J. Dolinski",
      "D. Domenici",
      "S. Dominguez",
      "S. Donati",
      "S. Doran",
      "D. Douglas",
      "T. A. Doyle",
      "F. Drielsma",
      "D. Duchesneau",
      "K. Duffy",
      "K. Dugas",
      "P. Dunne",
      "B. Dutta",
      "D. A. Dwyer",
      "A. S. Dyshkant",
      "S. Dytman",
      "M. Eads",
      "A. Earle",
      "S. Edayath",
      "D. Edmunds",
      "J. Eisch",
      "W. Emark",
      "P. Englezos",
      "A. Ereditato",
      "T. Erjavec",
      "C. O. Escobar",
      "J. J. Evans",
      "E. Ewart",
      "A. C. Ezeribe",
      "K. Fahey",
      "A. Falcone",
      "M. Fani'",
      "D. Faragher",
      "C. Farnese",
      "Y. Farzan",
      "J. Felix",
      "Y. Feng",
      "M. Ferreira da Silva",
      "G. Ferry",
      "E. Fialova",
      "L. Fields",
      "P. Filip",
      "A. Filkins",
      "F. Filthaut",
      "G. Fiorillo",
      "M. Fiorini",
      "S. Fogarty",
      "W. Foreman",
      "J. Fowler",
      "J. Franc",
      "K. Francis",
      "D. Franco",
      "J. Freeman",
      "J. Fried",
      "A. Friedland",
      "M. Fucci",
      "S. Fuess",
      "I. K. Furic",
      "K. Furman",
      "A. P. Furmanski",
      "R. Gaba",
      "A. Gabrielli",
      "A. M. Gago",
      "F. Galizzi",
      "H. Gallagher",
      "M. Galli",
      "N. Gallice",
      "V. Galymov",
      "E. Gamberini",
      "T. Gamble",
      "R. Gandhi",
      "S. Ganguly",
      "F. Gao",
      "S. Gao",
      "D. Garcia-Gamez",
      "M. Á. García-Peris",
      "F. Gardim",
      "S. Gardiner",
      "A. Gartman",
      "A. Gauch",
      "P. Gauzzi",
      "S. Gazzana",
      "G. Ge",
      "N. Geffroy",
      "B. Gelli",
      "S. Gent",
      "L. Gerlach",
      "A. Ghosh",
      "T. Giammaria",
      "D. Gibin",
      "I. Gil-Botella",
      "A. Gioiosa",
      "S. Giovannella",
      "A. K. Giri",
      "V. Giusti",
      "D. Gnani",
      "O. Gogota",
      "S. Gollapinni",
      "K. Gollwitzer",
      "R. A. Gomes",
      "L. S. Gomez Fajardo",
      "D. Gonzalez-Diaz",
      "J. Gonzalez-Santome",
      "M. C. Goodman",
      "S. Goswami",
      "C. Gotti",
      "J. Goudeau",
      "C. Grace",
      "E. Gramellini",
      "R. Gran",
      "P. Granger",
      "C. Grant",
      "D. R. Gratieri",
      "G. Grauso",
      "P. Green",
      "S. Greenberg",
      "W. C. Griffith",
      "K. Grzelak",
      "L. Gu",
      "W. Gu",
      "V. Guarino",
      "M. Guarise",
      "R. Guenette",
      "M. Guerzoni",
      "D. Guffanti",
      "A. Guglielmi",
      "F. Y. Guo",
      "A. Gupta",
      "V. Gupta",
      "G. Gurung",
      "D. Gutierrez",
      "P. Guzowski",
      "M. M. Guzzo",
      "S. Gwon",
      "A. Habig",
      "L. Haegel",
      "R. Hafeji",
      "L. Hagaman",
      "A. Hahn",
      "J. Hakenmüller",
      "T. Hamernik",
      "P. Hamilton",
      "J. Hancock",
      "M. Handley",
      "F. Happacher",
      "B. Harris",
      "D. A. Harris",
      "L. Harris",
      "A. L. Hart",
      "J. Hartnell",
      "T. Hartnett",
      "J. Harton",
      "T. Hasegawa",
      "C. M. Hasnip",
      "R. Hatcher",
      "S. Hawkins",
      "J. Hays",
      "M. He",
      "A. Heavey",
      "K. M. Heeger",
      "A. Heindel",
      "J. Heise",
      "P. Hellmuth",
      "L. Henderson",
      "K. Herner",
      "V. Hewes",
      "A. Higuera",
      "A. Himmel",
      "E. Hinkle",
      "L. R. Hirsch",
      "J. Ho",
      "J. Hoefken Zink",
      "J. Hoff",
      "A. Holin",
      "T. Holvey",
      "C. Hong",
      "S. Horiuchi",
      "G. A. Horton-Smith",
      "R. Hosokawa",
      "T. Houdy",
      "B. Howard",
      "R. Howell",
      "I. Hristova",
      "M. S. Hronek",
      "H. Hua",
      "J. Huang",
      "R. G. Huang",
      "X. Huang",
      "Z. Hulcher",
      "A. Hussain",
      "G. Iles",
      "N. Ilic",
      "A. M. Iliescu",
      "R. Illingworth",
      "G. Ingratta",
      "A. Ioannisian",
      "M. Ismerio Oliveira",
      "C. M. Jackson",
      "V. Jain",
      "E. James",
      "W. Jang",
      "B. Jargowsky",
      "D. Jena",
      "I. Jentz",
      "C. Jiang",
      "J. Jiang",
      "A. Jipa",
      "J. H. Jo",
      "F. R. Joaquim",
      "W. Johnson",
      "C. Jollet",
      "R. Jones",
      "N. Jovancevic",
      "M. Judah",
      "C. K. Jung",
      "K. Y. Jung",
      "T. Junk",
      "Y. Jwa",
      "M. Kabirnezhad",
      "A. C. Kaboth",
      "I. Kadenko",
      "O. Kalikulov",
      "D. Kalra",
      "M. Kandemir",
      "S. Kar",
      "G. Karagiorgi",
      "G. Karaman",
      "A. Karcher",
      "Y. Karyotakis",
      "S. P. Kasetti",
      "L. Kashur",
      "A. Kauther",
      "N. Kazaryan",
      "L. Ke",
      "E. Kearns",
      "P. T. Keener",
      "K. J. Kelly",
      "R. Keloth",
      "E. Kemp",
      "O. Kemularia",
      "Y. Kermaidic",
      "W. Ketchum",
      "S. H. Kettell",
      "N. Khan",
      "A. Khvedelidze",
      "D. Kim",
      "J. Kim",
      "M. J. Kim",
      "S. Kim",
      "B. King",
      "M. King",
      "M. Kirby",
      "A. Kish",
      "J. Klein",
      "J. Kleykamp",
      "A. Klustova",
      "T. Kobilarcik",
      "L. Koch",
      "K. Koehler",
      "L. W. Koerner",
      "D. H. Koh",
      "M. Kordosky",
      "T. Kosc",
      "V. A. Kostelecký",
      "I. Kotler",
      "M. Kovalcuk",
      "W. Krah",
      "R. Kralik",
      "M. Kramer",
      "F. Krennrich",
      "T. Kroupova",
      "S. Kubota",
      "M. Kubu",
      "V. A. Kudryavtsev",
      "G. Kufatty",
      "S. Kuhlmann",
      "A. Kumar",
      "J. Kumar",
      "M. Kumar",
      "P. Kumar",
      "P. Kumar",
      "S. Kumaran",
      "J. Kunzmann",
      "V. Kus",
      "T. Kutter",
      "J. Kvasnicka",
      "T. Labree",
      "M. Lachat",
      "T. Lackey",
      "I. Lalău",
      "A. Lambert",
      "B. J. Land",
      "C. E. Lane",
      "N. Lane",
      "K. Lang",
      "T. Langford",
      "M. Langstaff",
      "F. Lanni",
      "J. Larkin",
      "P. Lasorak",
      "D. Last",
      "A. Laundrie",
      "G. Laurenti",
      "E. Lavaut",
      "H. Lay",
      "I. Lazanu",
      "R. LaZur",
      "M. Lazzaroni",
      "S. Leardini",
      "J. Learned",
      "T. LeCompte",
      "G. Lehmann Miotto",
      "R. Lehnert",
      "M. Leitner",
      "H. Lemoine",
      "D. Leon Silverio",
      "L. M. Lepin",
      "J. -Y Li",
      "S. W. Li",
      "Y. Li",
      "R. Lima",
      "C. S. Lin",
      "D. Lindebaum",
      "S. Linden",
      "R. A. Lineros",
      "A. Lister",
      "B. R. Littlejohn",
      "J. Liu",
      "Y. Liu",
      "S. Lockwitz",
      "I. Lomidze",
      "K. Long",
      "J. Lopez",
      "I. López de Rego",
      "N. López-March",
      "J. M. LoSecco",
      "A. Lozano Sanchez",
      "X. -G. Lu",
      "K. B. Luk",
      "X. Luo",
      "E. Luppi",
      "A. A. Machado",
      "P. Machado",
      "C. T. Macias",
      "J. R. Macier",
      "M. MacMahon",
      "S. Magill",
      "C. Magueur",
      "K. Mahn",
      "A. Maio",
      "N. Majeed",
      "A. Major",
      "K. Majumdar",
      "A. Malige",
      "S. Mameli",
      "M. Man",
      "R. C. Mandujano",
      "J. Maneira",
      "S. Manly",
      "K. Manolopoulos",
      "M. Manrique Plata",
      "S. Manthey Corchado",
      "L. Manzanillas-Velez",
      "E. Mao",
      "M. Marchan",
      "A. Marchionni",
      "D. Marfatia",
      "C. Mariani",
      "J. Maricic",
      "F. Marinho",
      "A. D. Marino",
      "T. Markiewicz",
      "F. Das Chagas Marques",
      "M. Marshak",
      "C. M. Marshall",
      "J. Marshall",
      "L. Martina",
      "J. Martín-Albo",
      "D. A. Martinez Caicedo",
      "M. Martinez-Casales",
      "F. Martínez López",
      "S. Martynenko",
      "V. Mascagna",
      "A. Mastbaum",
      "M. Masud",
      "F. Matichard",
      "G. Matteucci",
      "J. Matthews",
      "C. Mauger",
      "N. Mauri",
      "K. Mavrokoridis",
      "I. Mawby",
      "F. Mayhew",
      "T. McAskill",
      "N. McConkey",
      "B. McConnell",
      "K. S. McFarland",
      "C. McGivern",
      "C. McGrew",
      "A. McNab",
      "C. McNulty",
      "J. Mead",
      "L. Meazza",
      "V. C. N. Meddage",
      "A. Medhi",
      "M. Mehmood",
      "B. Mehta",
      "P. Mehta",
      "F. Mei",
      "P. Melas",
      "L. Mellet",
      "T. C. D. Melo",
      "O. Mena",
      "H. Mendez",
      "D. P. Méndez",
      "A. Menegolli",
      "G. Meng",
      "A. C. E. A. Mercuri",
      "A. Meregaglia",
      "M. D. Messier",
      "S. Metallo",
      "W. Metcalf",
      "M. Mewes",
      "H. Meyer",
      "T. Miao",
      "J. Micallef",
      "A. Miccoli",
      "G. Michna",
      "R. Milincic",
      "F. Miller",
      "G. Miller",
      "W. Miller",
      "A. Minotti",
      "L. Miralles Verge",
      "C. Mironov",
      "S. Miscetti",
      "C. S. Mishra",
      "P. Mishra",
      "S. R. Mishra",
      "D. Mladenov",
      "I. Mocioiu",
      "A. Mogan",
      "R. Mohanta",
      "T. A. Mohayai",
      "N. Mokhov",
      "J. Molina",
      "L. Molina Bueno",
      "E. Montagna",
      "A. Montanari",
      "C. Montanari",
      "D. Montanari",
      "D. Montanino",
      "L. M. Montaño Zetina",
      "M. Mooney",
      "A. F. Moor",
      "M. Moore",
      "Z. Moore",
      "D. Moreno",
      "G. Moreno-Granados",
      "O. Moreno-Palacios",
      "L. Morescalchi",
      "C. Morris",
      "E. Motuk",
      "C. A. Moura",
      "G. Mouster",
      "W. Mu",
      "L. Mualem",
      "J. Mueller",
      "M. Muether",
      "F. Muheim",
      "A. Muir",
      "Y. Mukhamejanov",
      "A. Mukhamejanova",
      "M. Mulhearn",
      "D. Munford",
      "L. J. Munteanu",
      "H. Muramatsu",
      "J. Muraz",
      "M. Murphy",
      "T. Murphy",
      "A. Mytilinaki",
      "J. Nachtman",
      "Y. Nagai",
      "S. Nagu",
      "D. Naples",
      "S. Narita",
      "J. Nava",
      "A. Navrer-Agasson",
      "N. Nayak",
      "M. Nebot-Guinot",
      "A. Nehm",
      "J. K. Nelson",
      "O. Neogi",
      "J. Nesbit",
      "M. Nessi",
      "D. Newbold",
      "M. Newcomer",
      "D. Newmark",
      "R. Nichol",
      "F. Nicolas-Arnaldos",
      "A. Nielsen",
      "A. Nikolica",
      "J. Nikolov",
      "E. Niner",
      "X. Ning",
      "K. Nishimura",
      "A. Norman",
      "A. Norrick",
      "P. Novella",
      "A. Nowak",
      "J. A. Nowak",
      "M. Oberling",
      "J. P. Ochoa-Ricoux",
      "S. Oh",
      "S. B. Oh",
      "A. Olivier",
      "T. Olson",
      "Y. Onel",
      "Y. Onishchuk",
      "A. Oranday",
      "M. Osbiston",
      "J. A. Osorio Vélez",
      "L. O'Sullivan",
      "L. Otiniano Ormachea",
      "L. Pagani",
      "G. Palacio",
      "O. Palamara",
      "S. Palestini",
      "J. M. Paley",
      "M. Pallavicini",
      "C. Palomares",
      "S. Pan",
      "M. Panareo",
      "P. Panda",
      "V. Pandey",
      "W. Panduro Vazquez",
      "E. Pantic",
      "V. Paolone",
      "A. Papadopoulou",
      "R. Papaleo",
      "D. Papoulias",
      "S. Paramesvaran",
      "J. Park",
      "S. Parke",
      "S. Parsa",
      "S. Parveen",
      "M. Parvu",
      "D. Pasciuto",
      "S. Pascoli",
      "L. Pasqualini",
      "J. Pasternak",
      "G. Patel",
      "J. L. Paton",
      "C. Patrick",
      "L. Patrizii",
      "R. B. Patterson",
      "T. Patzak",
      "A. Paudel",
      "J. Paul",
      "L. Paulucci",
      "Z. Pavlovic",
      "G. Pawloski",
      "D. Payne",
      "A. Peake",
      "V. Pec",
      "E. Pedreschi",
      "S. J. M. Peeters",
      "W. Pellico",
      "E. Pennacchio",
      "A. Penzo",
      "O. L. G. Peres",
      "L. Pérez-Molina",
      "C. Pernas",
      "J. Perry",
      "D. Pershey",
      "G. Pessina",
      "G. Petrillo",
      "C. Petta",
      "R. Petti",
      "M. Pfaff",
      "V. Pia",
      "G. M. Piacentino",
      "L. Pickering",
      "L. Pierini",
      "F. Pietropaolo",
      "V. L. Pimentel",
      "G. Pinaroli",
      "S. Pincha",
      "J. Pinchault",
      "K. Pitts",
      "P. Plesniak",
      "K. Pletcher",
      "K. Plows",
      "C. Pollack",
      "T. Pollmann",
      "F. Pompa",
      "X. Pons",
      "N. Poonthottathil",
      "V. Popov",
      "F. Poppi",
      "J. Porter",
      "L. G. Porto Paixão",
      "M. Potekhin",
      "M. Pozzato",
      "R. Pradhan",
      "T. Prakash",
      "M. Prest",
      "F. Psihas",
      "D. Pugnere",
      "D. Pullia",
      "X. Qian",
      "J. Queen",
      "J. L. Raaf",
      "M. Rabelhofer",
      "V. Radeka",
      "J. Rademacker",
      "F. Raffaelli",
      "A. Rafique",
      "A. Rahe",
      "S. Rajagopalan",
      "M. Rajaoalisoa",
      "I. Rakhno",
      "L. Rakotondravohitra",
      "M. A. Ralaikoto",
      "L. Ralte",
      "M. A. Ramirez Delgado",
      "B. Ramson",
      "S. S. Randriamanampisoa",
      "A. Rappoldi",
      "G. Raselli",
      "T. Rath",
      "P. Ratoff",
      "R. Ray",
      "H. Razafinime",
      "R. F. Razakamiandra",
      "E. M. Rea",
      "J. S. Real",
      "B. Rebel",
      "R. Rechenmacher",
      "J. Reichenbacher",
      "S. D. Reitzner",
      "E. Renner",
      "S. Repetto",
      "S. Rescia",
      "F. Resnati",
      "C. Reynolds",
      "M. Ribas",
      "S. Riboldi",
      "C. Riccio",
      "G. Riccobene",
      "J. S. Ricol",
      "M. Rigan",
      "A. Rikalo",
      "E. V. Rincón",
      "A. Ritchie-Yates",
      "D. Rivera",
      "A. Robert",
      "A. Roberts",
      "E. Robles",
      "M. Roda",
      "D. Rodas Rodríguez",
      "M. J. O. Rodrigues",
      "J. Rodriguez Rondon",
      "S. Rosauro-Alcaraz",
      "P. Rosier",
      "D. Ross",
      "M. Rossella",
      "M. Ross-Lonergan",
      "T. Rotsy",
      "N. Roy",
      "P. Roy",
      "P. Roy",
      "C. Rubbia",
      "D. Rudik",
      "A. Ruggeri",
      "G. Ruiz Ferreira",
      "K. Rushiya",
      "B. Russell",
      "S. Sacerdoti",
      "N. Saduyev",
      "S. K. Sahoo",
      "N. Sahu",
      "S. Sakhiyev",
      "P. Sala",
      "G. Salmoria",
      "S. Samanta",
      "M. C. Sanchez",
      "A. Sánchez-Castillo",
      "P. Sanchez-Lucas",
      "D. A. Sanders",
      "S. Sanfilippo",
      "D. Santoro",
      "N. Saoulidou",
      "P. Sapienza",
      "I. Sarcevic",
      "I. Sarra",
      "G. Savage",
      "V. Savinov",
      "G. Scanavini",
      "A. Scanu",
      "A. Scaramelli",
      "T. Schefke",
      "H. Schellman",
      "S. Schifano",
      "P. Schlabach",
      "D. Schmitz",
      "A. W. Schneider",
      "K. Scholberg",
      "A. Schroeder",
      "A. Schukraft",
      "B. Schuld",
      "S. Schwartz",
      "A. Segade",
      "E. Segreto",
      "A. Selyunin",
      "C. R. Senise",
      "J. Sensenig",
      "S. H. Seo",
      "D. Seppela",
      "M. H. Shaevitz",
      "P. Shanahan",
      "P. Sharma",
      "R. Kumar",
      "S. Sharma Poudel",
      "K. Shaw",
      "T. Shaw",
      "K. Shchablo",
      "J. Shen",
      "C. Shepherd-Themistocleous",
      "J. Shi",
      "W. Shi",
      "S. Shin",
      "S. Shivakoti",
      "A. Shmakov",
      "I. Shoemaker",
      "D. Shooltz",
      "R. Shrock",
      "M. Siden",
      "J. Silber",
      "L. Simard",
      "J. Sinclair",
      "G. Sinev",
      "Jaydip Singh",
      "J. Singh",
      "L. Singh",
      "P. Singh",
      "V. Singh",
      "S. Singh Chauhan",
      "R. Sipos",
      "C. Sironneau",
      "G. Sirri",
      "K. Siyeon",
      "K. Skarpaas",
      "J. Smedley",
      "J. Smith",
      "P. Smith",
      "J. Smolik",
      "M. Smy",
      "M. Snape",
      "E. L. Snider",
      "P. Snopok",
      "M. Soares Nunes",
      "H. Sobel",
      "M. Soderberg",
      "H. Sogarwal",
      "C. J. Solano Salinas",
      "S. Söldner-Rembold",
      "N. Solomey",
      "V. Solovov",
      "W. E. Sondheim",
      "M. Sorbara",
      "M. Sorel",
      "J. Soto-Oton",
      "A. Sousa",
      "K. Soustruznik",
      "D. Souza Correia",
      "F. Spinella",
      "J. Spitz",
      "N. J. C. Spooner",
      "D. Stalder",
      "M. Stancari",
      "L. Stanco",
      "J. Steenis",
      "R. Stein",
      "H. M. Steiner",
      "A. F. Steklain Lisbôa",
      "J. Stewart",
      "B. Stillwell",
      "J. Stock",
      "T. Stokes",
      "T. Strauss",
      "L. Strigari",
      "A. Stuart",
      "J. G. Suarez",
      "J. Subash",
      "A. Surdo",
      "L. Suter",
      "A. Sutton",
      "K. Sutton",
      "Y. Suvorov",
      "R. Svoboda",
      "S. K. Swain",
      "C. Sweeney",
      "B. Szczerbinska",
      "A. M. Szelc",
      "A. Sztuc",
      "A. Taffara",
      "N. Talukdar",
      "J. Tamara",
      "H. A. Tanaka",
      "S. Tang",
      "N. Taniuchi",
      "A. M. Tapia Casanova",
      "A. Tapper",
      "S. Tariq",
      "E. Tatar",
      "R. Tayloe",
      "A. M. Teklu",
      "K. Tellez Giron Flores",
      "J. Tena Vidal",
      "P. Tennessen",
      "M. Tenti",
      "K. Terao",
      "F. Terranova",
      "G. Testera",
      "T. Thakore",
      "A. Thea",
      "S. Thomas",
      "A. Thompson",
      "C. Thorpe",
      "S. C. Timm",
      "E. Tiras",
      "V. Tishchenko",
      "S. Tiwari",
      "N. Todorović",
      "L. Tomassetti",
      "A. Tonazzo",
      "D. Torbunov",
      "D. Torres Muñoz",
      "M. Torti",
      "M. Tortola",
      "Y. Torun",
      "N. Tosi",
      "D. Totani",
      "M. Toups",
      "C. Touramanis",
      "V. Trabattoni",
      "D. Tran",
      "J. Trevor",
      "E. Triller",
      "S. Trilov",
      "D. Trotta",
      "J. Truchon",
      "D. Truncali",
      "W. H. Trzaska",
      "Y. Tsai",
      "Y. -T. Tsai",
      "Z. Tsamalaidze",
      "K. V. Tsang",
      "N. Tsverava",
      "S. Z. Tu",
      "S. Tufanli",
      "C. Tunnell",
      "M. Tuzi",
      "M. Tzanov",
      "M. A. Uchida",
      "J. Ureña González",
      "J. Urheim",
      "T. Usher",
      "H. Utaegbulam",
      "S. Uzunyan",
      "M. R. Vagins",
      "P. Vahle",
      "G. A. Valdiviesso",
      "E. Valencia",
      "R. Valentim",
      "Z. Vallari",
      "E. Vallazza",
      "J. W. F. Valle",
      "R. Van Berg",
      "D. V. Forero",
      "A. Vannozzi",
      "M. Van Nuland-Troost",
      "F. Varanini",
      "D. Vargas Oliva",
      "N. Vaughan",
      "K. Vaziri",
      "A. Vázquez-Ramos",
      "J. Vega",
      "J. Vences",
      "S. Ventura",
      "A. Verdugo",
      "S. Vergani",
      "M. Verzocchi",
      "K. Vetter",
      "M. Vicenzi",
      "H. Vieira de Souza",
      "C. Vignoli",
      "C. Vilela",
      "E. Villa",
      "S. Viola",
      "B. Viren",
      "G. V. Stenico",
      "R. Vizarreta",
      "A. P. Vizcaya Hernandez",
      "S. Vlachos",
      "G. Vorobyev",
      "Q. Vuong",
      "A. V. Waldron",
      "L. Walker",
      "H. Wallace",
      "M. Wallach",
      "J. Walsh",
      "T. Walton",
      "L. Wan",
      "B. Wang",
      "H. Wang",
      "J. Wang",
      "M. H. L. S. Wang",
      "X. Wang",
      "Y. Wang",
      "D. Warner",
      "L. Warsame",
      "M. O. Wascko",
      "D. Waters",
      "A. Watson",
      "K. Wawrowska",
      "A. Weber",
      "C. M. Weber",
      "M. Weber",
      "H. Wei",
      "A. Weinstein",
      "S. Westerdale",
      "M. Wetstein",
      "K. Whalen",
      "A. J. White",
      "L. H. Whitehead",
      "D. Whittington",
      "F. Wieler",
      "J. Wilhlemi",
      "M. J. Wilking",
      "A. Wilkinson",
      "C. Wilkinson",
      "F. Wilson",
      "R. J. Wilson",
      "P. Winter",
      "J. Wolcott",
      "J. Wolfs",
      "T. Wongjirad",
      "A. Wood",
      "K. Wood",
      "E. Worcester",
      "M. Worcester",
      "K. Wresilo",
      "M. Wright",
      "M. Wrobel",
      "S. Wu",
      "W. Wu",
      "Z. Wu",
      "M. Wurm",
      "J. Wyenberg",
      "B. M. Wynne",
      "Y. Xiao",
      "I. Xiotidis",
      "B. Yaeggy",
      "N. Yahlali",
      "E. Yandel",
      "G. Yang",
      "J. Yang",
      "T. Yang",
      "A. Yankelevich",
      "L. Yates",
      "U. Yevarouskaya",
      "K. Yonehara",
      "T. Young",
      "B. Yu",
      "H. Yu",
      "J. Yu",
      "W. Yuan",
      "M. Zabloudil",
      "R. Zaki",
      "J. Zalesak",
      "L. Zambelli",
      "B. Zamorano",
      "A. Zani",
      "O. Zapata",
      "L. Zazueta",
      "G. P. Zeller",
      "J. Zennamo",
      "J. Zettlemoyer",
      "K. Zeug",
      "C. Zhang",
      "S. Zhang",
      "Y. Zhang",
      "L. Zhao",
      "M. Zhao",
      "E. D. Zimmerman",
      "S. Zucchelli",
      "V. Zutshi",
      "R. Zwaska"
    ],
    "published": "2025-07-11T13:32:28Z",
    "updated": "2025-08-27T07:43:30Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.17691v2",
    "url": "https://arxiv.org/abs/2508.17691v2",
    "pdf_url": "https://arxiv.org/pdf/2508.17691v2.pdf",
    "title": "Design and initial results from the \"Junior\" Levitated Dipole Experiment",
    "abstract": "OpenStar Technologies is a private fusion company exploring the levitated dipole concept for commercial fusion energy production. OpenStar has manufactured a new generation of levitated dipole experiment, called \"Junior\", leveraging recent advances made in high-temperature superconducting magnet technologies. Junior houses a ~5.6 T REBCO high-temperature superconducting magnet in a 5.2 m vacuum chamber, with plasma heating achieved via < 50 kW of electron cyclotron resonance heating power. Importantly, this experiment integrates novel high temperature superconductor power supply technology on board the dipole magnet. Recently OpenStar has completed first experimental campaigns with the Junior experiment, achieving first plasmas in late 2024. Experiments conducted with the full levitated system are planned for 2025. This article provides an overview of the main results from these experiments and details improvements planned for future campaigns.",
    "authors": [
      "Craig S. Chisholm",
      "Thomas Berry",
      "Darren T. Garnier",
      "Rodney A. Badcock",
      "Gabriel Bioletti",
      "Konstantinos Bouloukakis",
      "Emily-Kei Brewerton",
      "Mike A. Buchanan",
      "Pierce J. Burt",
      "Eleanor V. W. Chambers",
      "Kris B. Chappell",
      "Patrick Coulson",
      "Ryan J. Davidson",
      "Josh P. M. Ellingham",
      "Piet Geursen",
      "Kent Hamilton",
      "Raymond Hu",
      "Emily Hunter",
      "Joseph P. Jones",
      "Plaso Kusay",
      "Zvonko Lazić",
      "Bradley Leuw",
      "Matthew Lynch",
      "Ratu Mataira",
      "Mick McCrohon",
      "Les Meadows",
      "Jack R. Morris",
      "Ryan Nowacki",
      "Jack V. Purvis",
      "James H. P. Rice",
      "Michael Rutten",
      "Samuel Schimanski",
      "Aaryan Sharma",
      "Mohammad Siamaki",
      "Alex Simpson",
      "Thomas Simpson",
      "Benjamin Smith",
      "Eric Stiers",
      "Emerson Swanson-Dobbs",
      "Joe Todd",
      "Eddyn O. P. Treacher",
      "Jared D. Tyler",
      "Sriharsha Venturumilli",
      "Hubertus W. Weijers",
      "Theodore Wordsworth",
      "Nancy Zhou"
    ],
    "published": "2025-08-25T05:58:23Z",
    "updated": "2025-08-27T06:43:54Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.19568v1",
    "url": "https://arxiv.org/abs/2508.19568v1",
    "pdf_url": "https://arxiv.org/pdf/2508.19568v1.pdf",
    "title": "Molecular structure, electric property, and scintillation and quenching   of liquid scintillators",
    "abstract": "Liquid scintillators are widely used in particle and nuclear physics. Understanding the scintillation and quenching mechanisms is a fundamental issue in designing a high-light-yield liquid scintillator. In this work, the basic scintillation process for a two-component liquid scintillator is reviewed, highlighting the processes of excitation, ionization, anion-cation recombination, and electric dipole-dipole energy transfer. A molecule's polar group, polarization characteristics, and the corresponding material's dielectric constant are found to be correlated with a liquid scintillator's scintillation efficiency. Polar groups and high relative dielectric constants (permittivity values) can cause severe quenching and should be avoided. The tellurium loading scheme in the liquid scintillator of the SNO+ experiment, TeBD, is discussed. The hydroxyl groups introduce polar structures in the TeBD, and the relative dielectric constant of our reproduced sample is measured to be $17\\pm2$. These discussions explain part of the quenching of the TeBD liquid scintillator.",
    "authors": [
      "Zhe Wang",
      "Ye Liang",
      "Haozhe Sun"
    ],
    "published": "2025-08-27T04:55:20Z",
    "updated": "2025-08-27T04:55:20Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.19434v1",
    "url": "https://arxiv.org/abs/2508.19434v1",
    "pdf_url": "https://arxiv.org/pdf/2508.19434v1.pdf",
    "title": "From Étendue to the Lowest Fundamental SNR: Pixel Étendue   (Optogeometric Factor) Interpreted as Mode Count",
    "abstract": "The optogeometric factor, recently introduced as a pixel level form of \\'etendue, quantifies the spatial angular throughput of a detector element. In this work its interpretation is extended by identifying optogeometric factor with the number of accessible optical modes per pixel. This mode based perspective establishes a direct link between radiometric throughput and quantum photon statistics.   By combining optogeometric factor with the Bose Einstein distribution, an estimate of the lowest achievable signal to noise ratio (SNR) at the pixel level is derived.   Explicit formulas are presented in both scene-based and sensor based forms, showing how the minimal SNR depends on aperture geometry, pixel pitch, f-number, wavelength, and source temperature. This formulation provides a compact and physically transparent benchmark for evaluating imaging sensors against the lowest expected quantum noise limit.",
    "authors": [
      "Jan Sova",
      "Marie Kolaříková"
    ],
    "published": "2025-08-26T21:03:45Z",
    "updated": "2025-08-26T21:03:45Z",
    "categories": [
      "quant-ph",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "quant-ph",
    "doi": "10.5281/zenodo.16954178"
  },
  {
    "arxiv_id": "2211.04553v2",
    "url": "https://arxiv.org/abs/2211.04553v2",
    "pdf_url": "https://arxiv.org/pdf/2211.04553v2.pdf",
    "title": "Effective resistivity in relativistic collisionless plasmoid-mediated   reconnection",
    "abstract": "Magnetic reconnection can power spectacular high-energy astrophysical phenomena by producing non-thermal energy distributions in highly magnetized regions around compact objects. By means of two-dimensional fully kinetic particle-in-cell (PIC) simulations we investigate relativistic collisionless plasmoid-mediated reconnection in magnetically dominated pair plasmas with and without guide field. In X-points, where diverging flows result in a non-diagonal thermal pressure tensor, a finite residence time for particles gives rise to a localized collisionless effective resistivity. Here, for the first time for relativistic reconnection in a fully developed plasmoid chain we identify the mechanisms driving the non-ideal electric field using a full Ohm's law by means of a statistical analysis based on our PIC simulations. We show that the non-ideal electric field is predominantly driven by gradients of nongyrotropic thermal pressures. We propose a kinetic physics motivated non-uniform effective resistivity model, which is negligible on global scales and becomes significant only locally in X-points, that captures the properties of collisionless reconnection with the aim of mimicking its essentials in non-ideal magnetohydrodynamic descriptions. This effective resistivity model provides a viable opportunity to design physically grounded global models for reconnection-powered high-energy emission.",
    "authors": [
      "Sebastiaan Selvi",
      "Oliver Porth",
      "Bart Ripperda",
      "Fabio Bacchini",
      "Lorenzo Sironi",
      "Rony Keppens"
    ],
    "published": "2022-11-08T20:55:07Z",
    "updated": "2025-08-26T20:46:48Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE",
    "doi": "10.3847/1538-4357/acd0b0"
  },
  {
    "arxiv_id": "2506.02506v2",
    "url": "https://arxiv.org/abs/2506.02506v2",
    "pdf_url": "https://arxiv.org/pdf/2506.02506v2.pdf",
    "title": "Classification of Hoyle State Decay Branches in Active Target Time   Projection Chamber using Neural Network",
    "abstract": "A multi-class convolutional neural network (CNN) model has been developed using Keras deep learning library in Python for image-based classification of $^{12}$C Hoyle state decay branches from tracking information, recorded by Saha Active Target Time Projection Chamber, SAT-TPC (currently under development). The nuclear events, produced by the 30 MeV $\\alpha$-particle beam in the SAT-TPC, filled with Ar + CO$_2$ (90:10) gas mixture at atmospheric pressure, have been considered for training and validation of the models. The elastic scattering and Hoyle state sequential and direct decay events in the interaction of $\\alpha$-particle with $^{40}$Ar, $^{12}$C, $^{16}$O nuclei have been generated through Monte-Carlo simulation. The three-dimensional tracks, produced by the scattering and decay products through primary ionization of gaseous medium, have been simulated with Geant4. The primary tracks, distributed on the beam-plane, have been convoluted with electron diffusion, obtained with Magboltz, to produce the final tracking information. The classification performance of the proposed model for different readout segmentation schemes of the SAT-TPC has been discussed.",
    "authors": [
      "Pralay Kumar Das",
      "Nayana Majumdar",
      "Supratik Mukhopadhyay"
    ],
    "published": "2025-06-03T06:35:24Z",
    "updated": "2025-08-26T19:35:23Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex",
      "physics.data-an"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.19220v1",
    "url": "https://arxiv.org/abs/2508.19220v1",
    "pdf_url": "https://arxiv.org/pdf/2508.19220v1.pdf",
    "title": "The 2025 Roadmaps for the US Magnet Development Program",
    "abstract": "The US Physics community completed the Snowmass planning process in 2022, culminating in the HEPAP Particle Physics Project Prioritization Panel (P5) publishing its summary report at the end of 2023. Building on this, the US Magnet Development Program, a national accelerator magnet R&D program established by DOE-OHEP in 2016, has updated its strategic plan to align with the 2023 P5 report, resulting in this roadmap document.",
    "authors": [
      "Lance Cooley",
      "Paolo Ferracin",
      "Steve Gourlay",
      "David Larbalestier",
      "Mark Palmer",
      "Soren Prestemon",
      "George Velev",
      "Giorgio Ambrosio",
      "Diego Arbelaez",
      "Karie Badgley",
      "Lucas Brouwer",
      "Daniel Davis",
      "Jose Luis Fernandez",
      "Vadim Kashikhin",
      "Steven Krave",
      "Maxim Marchevsky",
      "Igor Novitski",
      "Ian Pong",
      "Tengming Shen",
      "Stoyan Stoynev",
      "Reed Teyber",
      "Giorgio Vallone",
      "Xiaorong Wang",
      "Xingchen Xu"
    ],
    "published": "2025-08-26T17:36:52Z",
    "updated": "2025-08-26T17:36:52Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.07086v2",
    "url": "https://arxiv.org/abs/2507.07086v2",
    "pdf_url": "https://arxiv.org/pdf/2507.07086v2.pdf",
    "title": "Lifetime study of the ColdADC for the Deep Underground Neutrino   Experiment",
    "abstract": "ColdADC is a custom ASIC digitizer implemented in 65 nm CMOS technology using specialized techniques for long-term reliability in cryogenic environments. ColdADC was developed for use in the DUNE Far Detector complex, which will consist of four liquid argon time projection chambers. Each contains 17 kilotons liquid argon as the target material in order to measure neutrino oscillations. Approximately 40,000 ColdADC ASICs will be installed for DUNE in the first two large detectors and will be operated at cryogenic temperatures during the experiment without replacement. The lifetime of the ColdADC is a critical parameter affecting the data quality and physics sensitivity of the experiment. A measurement of the lifetime of the ColdADC was carried out, and the results shown in this paper assure orders of magnitude longer lifetime of the ColdADC than the planned operation time of the detectors.",
    "authors": [
      "Wenjie Wu",
      "Benjamin Jargowsky",
      "Yiwen Xiao",
      "Alejandro Yankelevich",
      "Jianming Bian",
      "Cheng-Ju Lin",
      "Tarun Prakash",
      "David Christian"
    ],
    "published": "2025-07-09T17:47:21Z",
    "updated": "2025-08-26T17:06:06Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2505.12874v2",
    "url": "https://arxiv.org/abs/2505.12874v2",
    "pdf_url": "https://arxiv.org/pdf/2505.12874v2.pdf",
    "title": "Optimization of 3D diamond detectors with graphitized electrodes based   on an innovative numerical simulation",
    "abstract": "Future experiments at hadron colliders require an evolution of the tracking sensors to ensure sufficient radiation hardness as well as space and time resolution to handle unprecedented particle fluxes. 3D diamond sensors with laser-graphitized electrodes are promising candidates due to their strong binding energy, small atomic number, and high carrier mobility. However, the high resistance of the engraved electrodes delays the propagation of the induced signals towards the readout electronics, thereby degrading the precision of the timing measurements. So far, this effect has been the dominant factor limiting the time resolution of these devices, with other contributions, such as those due to electric field inhomogeneities or electronic noise, typically neglected. Recent advancements in graphitization technology, however, motivate a renewed effort in modeling signal generation in 3D diamond detectors, to achieve more reliable predictions. To this purpose, we apply an extended version of the Ramo-Shockley theorem describing the effect of signal propagation as a time-dependent weighting potential, obtained by solving numerically the Maxwell's equations in a quasi-static approximation. We developed a custom spectral method solver and validated it against COMSOL MultiPhysics. The response of the modeled sensor to a beam of particles is then simulated using Garfield++ and is compared to the data acquired in a beam test carried on in 2021 by the TimeSPOT Collaboration at the SPS, at CERN. Based on the results obtained with this simulation workflow, we conclude that reducing the resistivity of the graphitic columns remains the priority for significantly improving the time resolution of 3D diamond detectors. Once achieved, optimization of the detector geometry and readout electronics design will become equally important steps to further enhance the timing performance of these devices.",
    "authors": [
      "Lucio Anderlini",
      "Alessandro Bombini",
      "Clarissa Buti",
      "Djunes Janssens",
      "Stefano Lagomarsino",
      "Giovanni Passaleva",
      "Michele Veltri"
    ],
    "published": "2025-05-19T08:58:39Z",
    "updated": "2025-08-26T16:13:46Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.19117v1",
    "url": "https://arxiv.org/abs/2508.19117v1",
    "pdf_url": "https://arxiv.org/pdf/2508.19117v1.pdf",
    "title": "Flow-dependent tagging of $^{214}$Pb decays in the LZ dark matter   detector",
    "abstract": "The LUX-ZEPLIN (LZ) experiment is searching for dark matter interactions in a liquid xenon time projection chamber (LXe-TPC). This article demonstrates how control of the flow state in the LXe-TPC enables the identification of pairs of sequential alpha-decays, which are used to map fluid flow and ion drift in the liquid target. The resulting transport model is used to tag $^{214}$Pb beta-decays, a leading background to dark matter signals in LZ. Temporally evolving volume selections, at a cost of 9.0% of exposure, target the decay of each $^{214}$Pb atom up to 81 minutes after production, resulting in (63 $\\pm$ 6$_{\\mathrm{stat}}$ $\\pm$ 7$_{\\mathrm{sys}}$)% identification of $^{214}$Pb decays to ground state. We also demonstrate how flow-based tagging techniques enable a novel calibration side band that is concurrent with science data.",
    "authors": [
      "J. Aalbers",
      "D. S. Akerib",
      "A. K. Al Musalhi",
      "F. Alder",
      "C. S. Amarasinghe",
      "A. Ames",
      "T. J. Anderson",
      "N. Angelides",
      "H. M. Araújo",
      "J. E. Armstrong",
      "M. Arthurs",
      "A. Baker",
      "S. Balashov",
      "J. Bang",
      "J. W. Bargemann",
      "E. E. Barillier",
      "K. Beattie",
      "T. Benson",
      "A. Bhatti",
      "T. P. Biesiadzinski",
      "H. J. Birch",
      "E. Bishop",
      "G. M. Blockinger",
      "B. Boxer",
      "C. A. J. Brew",
      "P. Brás",
      "S. Burdin",
      "M. C. Carmona-Benitez",
      "M. Carter",
      "A. Chawla",
      "H. Chen",
      "Y. T. Chin",
      "N. I. Chott",
      "M. V. Converse",
      "R. Coronel",
      "A. Cottle",
      "G. Cox",
      "D. Curran",
      "C. E. Dahl",
      "I. Darlington",
      "S. Dave",
      "A. David",
      "J. Delgaudio",
      "S. Dey",
      "L. de Viveiros",
      "L. Di Felice",
      "C. Ding",
      "J. E. Y. Dobson",
      "E. Druszkiewicz",
      "S. Dubey",
      "C. L. Dunbar",
      "S. R. Eriksen",
      "A. Fan",
      "N. M. Fearon",
      "N. Fieldhouse",
      "S. Fiorucci",
      "H. Flaecher",
      "E. D. Fraser",
      "T. M. A. Fruth",
      "R. J. Gaitskell",
      "A. Geffre",
      "J. Genovesi",
      "C. Ghag",
      "A. Ghosh",
      "R. Gibbons",
      "S. Gokhale",
      "J. Green",
      "M. G. D. van der Grinten",
      "J. J. Haiston",
      "C. R. Hall",
      "T. Hall",
      "S. Han",
      "E. Hartigan-O'Connor",
      "S. J. Haselschwardt",
      "M. A. Hernandez",
      "S. A. Hertel",
      "G. J. Homenides",
      "M. Horn",
      "D. Q. Huang",
      "D. Hunt",
      "E. Jacquet",
      "R. S. James",
      "M. K. K",
      "A. C. Kaboth",
      "A. C. Kamaha",
      "D. Khaitan",
      "A. Khazov",
      "J. Kim",
      "Y. D. Kim",
      "J. Kingston",
      "R. Kirk",
      "D. Kodroff",
      "E. V. Korolkova",
      "H. Kraus",
      "S. Kravitz",
      "L. Kreczko",
      "V. A. Kudryavtsev",
      "C. Lawes",
      "D. S. Leonard",
      "K. T. Lesko",
      "C. Levy",
      "J. Lin",
      "A. Lindote",
      "W. H. Lippincott",
      "J. Long",
      "M. I. Lopes",
      "W. Lorenzon",
      "C. Lu",
      "S. Luitz",
      "P. A. Majewski",
      "A. Manalaysay",
      "R. L. Mannino",
      "C. Maupin",
      "M. E. McCarthy",
      "G. McDowell",
      "D. N. McKinsey",
      "J. McLaughlin",
      "J. B. Mclaughlin",
      "R. McMonigle",
      "B. Mitra",
      "E. Mizrachi",
      "M. E. Monzani",
      "E. Morrison",
      "B. J. Mount",
      "M. Murdy",
      "A. St. J. Murphy",
      "H. N. Nelson",
      "F. Neves",
      "A. Nguyen",
      "C. L. O'Brien",
      "I. Olcina",
      "K. C. Oliver-Mallory",
      "J. Orpwood",
      "K. Y Oyulmaz",
      "K. J. Palladino",
      "J. Palmer",
      "N. J. Pannifer",
      "N. Parveen",
      "S. J. Patton",
      "B. Penning",
      "G. Pereira",
      "E. Perry",
      "T. Pershing",
      "A. Piepke",
      "S. S. Poudel",
      "Y. Qie",
      "J. Reichenbacher",
      "C. A. Rhyne",
      "G. R. C. Rischbieter",
      "E. Ritchey",
      "H. S. Riyat",
      "R. Rosero",
      "T. Rushton",
      "D. Rynders",
      "D. Santone",
      "A. B. M. R. Sazzad",
      "R. W. Schnee",
      "G. Sehr",
      "B. Shafer",
      "S. Shaw",
      "K. Shi",
      "T. Shutt",
      "J. J. Silk",
      "C. Silva",
      "G. Sinev",
      "J. Siniscalco",
      "A. M. Slivar",
      "R. Smith",
      "V. N. Solovov",
      "P. Sorensen",
      "J. Soria",
      "I. Stancu",
      "A. Stevens",
      "T. J. Sumner",
      "A. Swain",
      "M. Szydagis",
      "D. R. Tiedt",
      "M. Timalsina",
      "Z. Tong",
      "D. R. Tovey",
      "J. Tranter",
      "M. Trask",
      "M. Tripathi",
      "A. Usón",
      "A. C. Vaitkus",
      "O. Valentino",
      "V. Velan",
      "A. Wang",
      "J. J. Wang",
      "Y. Wang",
      "L. Weeldreyer",
      "T. J. Whitis",
      "K. Wild",
      "M. Williams",
      "W. J. Wisniewski",
      "L. Wolf",
      "F. L. H. Wolfs",
      "S. Woodford",
      "D. Woodward",
      "C. J. Wright",
      "Q. Xia",
      "J. Xu",
      "Y. Xu",
      "M. Yeh",
      "D. Yeum",
      "W. Zha",
      "H. Zhang",
      "T. Zhang"
    ],
    "published": "2025-08-26T15:19:21Z",
    "updated": "2025-08-26T15:19:21Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2506.15234v2",
    "url": "https://arxiv.org/abs/2506.15234v2",
    "pdf_url": "https://arxiv.org/pdf/2506.15234v2.pdf",
    "title": "First Steps Toward the Development of a Straight-Line Reference   Alignment System for Future Accelerators at CERN Using Pseudo-Nondiffracting   Layer Beams",
    "abstract": "This paper presents experimental results that allow for the performance evaluation of a straight-line reference alignment system based on pseudo-nondiffracting Layer beams. Sensors, developed specifically for this system, feature four linear CMOS chips and a square aperture. This allows for simultaneous measurements along the beam path without disrupting the laser reference. Measurements, conducted over a distance of 2 m from the first to the last sensor, were compared with a laser tracker measurement to assess the sensor performance. The alignment reference generated by the Layer Beams exhibited a repeatability and reproducibility root-mean-square error (RMSE) of less than 30 ${\\mu}$m. The relative alignment precision for a known displacement was validated with a standard deviation of 4.3 ${\\mu}$m. The results highlight the underlying sources of noise, which are induced mainly by the cover glass, the protective film of the pixels, and the dark noise of the CMOS chips. Solutions to address these challenges are proposed. Additionally, a proof-of-concept for future development of a radiation-hard sensor utilizing optical fiber matrices is demonstrated. The RMSE of the reference position detection introduced by the fiber matrix remained below 1.3 ${\\mu}$m. This would allow the sensor to be used reliably in high-radiation environments typical for accelerator facilities. This study serves as a foundational step toward developing a robust straight-line reference alignment system based on pseudo-nondiffracting Layer beams intended for deployment in the accelerator facilities.",
    "authors": [
      "Martin Dušek",
      "Sebastian Figura",
      "Jakub Michal Polak",
      "Solomon William Kamugasa",
      "Dirk Mergelkuhl",
      "Witold Niewiem",
      "Štěpán Kunc",
      "Jean-Christophe Gayde",
      "Miroslav Šulc"
    ],
    "published": "2025-06-18T08:18:05Z",
    "updated": "2025-08-26T14:58:02Z",
    "categories": [
      "physics.ins-det",
      "physics.app-ph",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.19020v1",
    "url": "https://arxiv.org/abs/2508.19020v1",
    "pdf_url": "https://arxiv.org/pdf/2508.19020v1.pdf",
    "title": "Attosecond X-ray pulse pairs carrying distinct topological charges",
    "abstract": "Attosecond X-ray pulses are indispensable for exploring ultrafast phenomena in matter on the \\AA{}ngstrom--attosecond scale. Especially, attosecond--pump attosecond--probe experiments could enable the study of electron dynamics in real time. Here, we advance this technique by proposing the production of double attosecond hard X-ray pulses with distinct topological charges using an X-ray free-electron laser. By leveraging transverse-mode frequency pulling, we show the formation of double attosecond pulses with varying topological charges, demonstrated by three-dimensional simulations. The resulting double pulses exhibit two temporally separated peaks with a delay of several hundred attoseconds. This capability opens new avenues for sub-femtosecond pump-probe experiments, leveraging both the temporal and topological degrees of freedom in attosecond X-ray science.",
    "authors": [
      "Chenzhi Xu",
      "Jiawei Yan",
      "Gianluca Geloni",
      "Christoph Lechner",
      "Haixiao Deng"
    ],
    "published": "2025-08-26T13:40:41Z",
    "updated": "2025-08-26T13:40:41Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.13858v2",
    "url": "https://arxiv.org/abs/2508.13858v2",
    "pdf_url": "https://arxiv.org/pdf/2508.13858v2.pdf",
    "title": "Numerical simulations of a RF-RF hybrid plasma torch with argon at   atmospheric pressure",
    "abstract": "We report numerical results regarding the minimum sustaining coil excitation current for a RF-RF hybrid torch operating at two different frequencies. The first coil is excited at a high-frequency, while the second coil is set at a medium frequency. The filling gas is argon, at atmospheric pressure. We use the modeling software COMSOL Multiphysics to describe the evolution of key parameters when: (i) the distance between the two coils changes, (ii) the power of the high frequency coil changes. We discuss the radial temperature profiles, the axial velocities and the heat convected at the end of the medium-frequency coil. The latter is compared with the total heat conduction to the plasma confinement tube wall.",
    "authors": [
      "Loann Terraz",
      "Biruk Alemu",
      "Santiago Eizaguirre"
    ],
    "published": "2025-08-19T14:17:59Z",
    "updated": "2025-08-26T08:02:11Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.13372v2",
    "url": "https://arxiv.org/abs/2508.13372v2",
    "pdf_url": "https://arxiv.org/pdf/2508.13372v2.pdf",
    "title": "Free electron charging of microdroplets in a plasma at atmospheric   pressure",
    "abstract": "Gas phase microdroplets have recently demonstrated exceptional chemical properties via suspected mechanisms such as contact electrification and surface charge pinning leading, in turn, to high electric fields at the surface. In this work, microdroplets are injected into a low temperature flowing gas plasma at atmospheric pressure and during flight they are subject to an excess free electron flux. We report the first measurements of particle charge acquired in a fully collisional plasma with average values up to $2.5 \\times 10^{5}$ electrons, dependent on absorbed power, for droplets with an average diameter of $15~\\mu\\mathrm{m}$. Simulations indicate that for similar plasma conditions, the acquired charge on solid particles would be $\\sim40\\%$ lower, at $1.5 \\times 10^{5}$ electrons, with the difference likely due in part to low mobility water cluster ion formation around the evaporating droplet. Simulations also indicate surface electric fields up to $1 \\times 10^{7}\\,\\mathrm{V\\,m^{-1}}$ for the smallest droplets ($3~\\mu\\mathrm{m}$). The formation of H$_2$O$_2$ was observed in the liquid with measured values up to 33 mM, equivalent to a remarkable generation rate of over $275~\\mathrm{M\\,s^{-1}}$. The microdroplet system involves a complex interplay of various potential mechanisms, yet to be elucidated. The inclusion of a controlled plasma environment offers the capability for creating known charge levels and defined exposure times to allow more systematic study as well as enhancing their already exceptional characteristics.",
    "authors": [
      "Nourhan Hendawy",
      "Harold McQuaid",
      "Somhairle Mag Uidhir",
      "David Rutherford",
      "Declan Diver",
      "Davide Mariotti",
      "Paul Maguire"
    ],
    "published": "2025-08-18T21:27:54Z",
    "updated": "2025-08-26T02:02:19Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.18577v1",
    "url": "https://arxiv.org/abs/2508.18577v1",
    "pdf_url": "https://arxiv.org/pdf/2508.18577v1.pdf",
    "title": "Ice-assisted soft-landing deposition for van der Waals integration",
    "abstract": "Van der Waals integration enables the creation of electronic and optoelectronic devices with unprecedented performance and novel functionalities beyond the existing material limitations. However, it is typically realized using a physical pick-up-and-place process to minimize interfacial damages and is hardly integrated into conventional lithography and metallization procedures. Here we demonstrate a simple in situ transfer strategy for van der Waals integration, in which a thin film of amorphous water ice acts as a buffer layer to shield against the bombardment of energetic clusters during metallization. After ice sublimation, the deposited metal film can be gently and in situ placed onto underlying substrates, to form an atomically clean and damage-free metal-semiconductor interface. This strategy allows ultra-clean and non-destructive fabrication of high-quality contacts on monolayer MoS2, which is extremely beneficial to produce a high-performance 2D field-effect transistor with an ultra-high on/off ratio of 1010, mobility of 80 (cm2 V-1s-1), and also with reduced Fermi level pinning effect. We also demonstrate the batch production of CVD-grown MoS2 transistor arrays with uniform electrical characteristics. Such a gentle and ultra-clean fabrication approach has been further extended to materials with high reactivity, such as halide perovskites. Our method can be easily integrated with mature semiconductor manufacturing technology and may become a generic strategy for fabricating van der Waals contacted devices.",
    "authors": [
      "Xinyu Sun",
      "Xiang Xu",
      "BinBin Jin",
      "Yihan Lu",
      "Jichuang Shen",
      "Wei Kong",
      "Ding Zhao",
      "Min Qiu"
    ],
    "published": "2025-08-26T01:07:25Z",
    "updated": "2025-08-26T01:07:25Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2508.18573v1",
    "url": "https://arxiv.org/abs/2508.18573v1",
    "pdf_url": "https://arxiv.org/pdf/2508.18573v1.pdf",
    "title": "Results of the LEGEND-200 experiment in the search for neutrinoless   double beta decay",
    "abstract": "The LEGEND experiment is looking for the extremely rare neutrinoless double beta ($0\\nu\\beta\\beta$) decay of $^{76}$Ge using isotopically-enriched high-purity germanium (HPGe) detectors. The detection of this process would imply that the neutrino is a Majorana particle and the total lepton number would not be conserved, which could be related to the cosmological asymmetry between matter and antimatter through leptogenesis. The long-term goal of the collaboration is LEGEND-1000: a 1-ton detector array planned to run for 10 years, with a projected half-life sensitivity exceeding $10^{28}$ years, fully covering the inverted neutrino mass hierarchy. A first search for the $0\\nu\\beta\\beta$ decay has been carried out by LEGEND-200 building on the experience gained from GERDA and the MAJORANA DEMONSTRATOR. The experiment has been collecting physics data for a year at the Gran Sasso National Laboratory in Italy with 140 kg of HPGe detectors. With a total exposure of 61 kg yr, LEGEND-200 has achieved a background index of $5^{+3}_{-2}\\times10^{-4}$ counts/(keV kg yr) in the $0\\nu\\beta\\beta$ decay signal region from the highest performing detectors. After combining the results from GERDA, the MAJORANA Demonstrator and LEGEND-200, an exclusion sensitivity $ > 2.8\\times10^{26}$ yr has been obtained at 90\\% confidence level for the $0\\nu\\beta\\beta$ decay half-life, with no evidence for a signal. A new observed lower limit of $T^{0\\nu}_{1/2} > 1.9\\times10^{26}$ yr at 90\\% confidence level has been established.",
    "authors": [
      "Carmen Romo-Luque"
    ],
    "published": "2025-08-26T00:13:14Z",
    "updated": "2025-08-26T00:13:14Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2505.22062v2",
    "url": "https://arxiv.org/abs/2505.22062v2",
    "pdf_url": "https://arxiv.org/pdf/2505.22062v2.pdf",
    "title": "Further Characterization of the JadePix-3 CMOS Pixel Sensor for the CEPC   Vertex Detector",
    "abstract": "The Circular Electron-Positron Collider (CEPC), a proposed next-generation $e^+e^-$ collider to enable high-precision studies of the Higgs boson and potential new physics, imposes rigorous demands on detector technologies, particularly the vertex detector. JadePix-3 is a prototype Monolithic Active Pixel Sensor (MAPS) designed for the CEPC vertex detector. This paper presents a detailed laboratory-based characterization of the JadePix-3 sensor, focusing on the previously under-explored effects of substrate reverse bias voltage on key performance metrics: charge collection efficiency, average cluster size, and detection efficiency. Systematic testing demonstrated that JadePix-3 operates reliably under reverse bias, exhibiting a reduced input capacitance, an expanded depletion region, enhanced charge collection efficiency, and a lower fake-hit rate. These findings confirm the sensor's potential for high-precision particle tracking and vertexing at the CEPC while offering valuable references for future iterational R\\&D of the JadePix series.",
    "authors": [
      "Jiahao Hu",
      "Ruiyang Zhang",
      "Zhiliang Chen",
      "Yunpeng Lu",
      "Qun Ouyang",
      "Lailin Xu"
    ],
    "published": "2025-05-28T07:37:35Z",
    "updated": "2025-08-25T22:29:43Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.18450v1",
    "url": "https://arxiv.org/abs/2508.18450v1",
    "pdf_url": "https://arxiv.org/pdf/2508.18450v1.pdf",
    "title": "Challenges and Optimization of Mu2e Proton Target Design with Radiative   Cooling",
    "abstract": "Mu2e, the Muon-to-Electron Conversion Experiment, aims to identify physics beyond the Standard Model, namely, the conversion of muons to electrons without the emission of neutrinos. The muons are produced from pions generated in a production target when it is hit by an 8 GeV proton beam from the Fermilab Booster/Main Injector. The proton target design space is strongly constrained by a one-year operating lifetime and the need for radiative cooling in a vacuum environment. Uncertainties in the lifetime of the existing baseline design - a monolithic, segmented tungsten target - are large, particularly due to unknown impacts of radiation damage at the very high proton fluences expected in the experiment. We have begun evaluation of a new design utilizing Inconel 718 over the WL10 used in the existing target design. As a result, the structural design of the target has evolved significantly. This evolution focuses on lowering the target temperature, minimizing obstruction to muons, increasing structural stability, maximizing fatigue lifetime, simplifying the fabrication process, and more. The thermal management, structural stability and fatigue lifetime are emphasized here. These optimizations have led to a promising new target design for the Mu2e experiment.",
    "authors": [
      "Z. Liu",
      "J. Williams",
      "A. Makovec",
      "M. Hedges",
      "F. Pellemoine",
      "K. Yonehara",
      "G. Annala",
      "K. Lynch",
      "M. Bloomer",
      "J. Popp",
      "A. Edmonds",
      "J. Miller"
    ],
    "published": "2025-08-25T20:00:02Z",
    "updated": "2025-08-25T20:00:02Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2505.08067v2",
    "url": "https://arxiv.org/abs/2505.08067v2",
    "pdf_url": "https://arxiv.org/pdf/2505.08067v2.pdf",
    "title": "Quartz fluorescence backgrounds in xenon particle detectors",
    "abstract": "It has been known for almost a decade that delayed photon noise with a power law time profile follows scintillation pulses in liquid xenon particle detectors. The origin of the noise has remained unknown, and in the past two years, has become an overwhelming background for low-threshold dark matter searches aimed at O(10) GeV dark matter particle masses, as well as measurements of coherent neutrino-nucleus scattering of 8B solar neutrinos. We have performed a comprehensive series of tests in a small liquid xenon cell at LBL, from which we conclude that the dominant component of this delayed photon noise is due to UV-induced fluorescence of quartz photosensor windows.",
    "authors": [
      "P. Sorensen",
      "R. Gibbons"
    ],
    "published": "2025-05-12T21:08:35Z",
    "updated": "2025-08-25T19:37:13Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1103/lsmf-pm5g"
  },
  {
    "arxiv_id": "2508.19296v1",
    "url": "https://arxiv.org/abs/2508.19296v1",
    "pdf_url": "https://arxiv.org/pdf/2508.19296v1.pdf",
    "title": "Solar cosmic ray generation, Newtonian gravity, missing mass, dark   energy, laboratory-based nuclear astrophysics, and all that",
    "abstract": "Begun as part of a promotion of accelerator-based nuclear astrophysics, research toward this goal has shifted to cosmic ray production within the solar system. This has been motivated by the high quality of data collected recently by programs such as the International Space Station (ISS), by the fundamental importance of the topic, and by the unsatisfactory state of our understanding of the actual source of cosmic rays. A ``minor'' change in the Newtonian gravitational formulation converts solar production of high energy cosmic rays from ``impossible'' to ``likely'', without much disrupting the vast existent domain of well understood astronomical gravitational processes. This change enables the sun to ``capture'' protons of energy so high that they would, otherwise, escape the solar system. This change in Newton's gravitational formula would disrupt current cosmological understanding of missing mass and dark energy. With this changed understanding of gravity, it has been quite easy to produce a semi-quantitative understanding of the solar origin of cosmic rays up to energies at least as great as $10^6$\\,GeV/nucleon that have by now been detected and measured so persuasively. A ``Double Slingshot'' mechanism is proposed according to which at least a substantial fraction of all cosmic rays could have begun their life within the solar system. Accelerator-based nuclear astrophysics is promoted, beginning with the functioning of an ``{\\rm E}\\&{\\rm M}'' storage ring for laboratory-based study of processes such as ${\\rm 6LI} + {\\rm 7Li} \\rightarrow {\\rm 13C} + \\gamma$. Especially to be emphasized are experiments made possible by ''rear-end collisions'' between nuclear isotopes of two different types traveling simultaneously at different velocities in the same direction in the same storage ring. This amounts to ``studying nuclear physics in a moving frame of reference''.",
    "authors": [
      "Richard Talman"
    ],
    "published": "2025-08-25T17:52:16Z",
    "updated": "2025-08-25T17:52:16Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.18219v1",
    "url": "https://arxiv.org/abs/2508.18219v1",
    "pdf_url": "https://arxiv.org/pdf/2508.18219v1.pdf",
    "title": "Three-dimensional hyperspectral imaging with optical microcombs",
    "abstract": "Optical frequency combs have revolutionised time and frequency metrology [1, 2]. The advent of microresonator-based frequency combs ('microcombs' [3-5]) is set to lead to the miniaturisation of devices that are ideally suited to a wide range of applications, including microwave generation [6, 7], ranging [8-10], the precise calibration of astronomical spectrographs [11], neuromorphic computing [12, 13], high-bandwidth data communications[14], and quantum-optics [15, 16] platforms. Here, we introduce a new microcomb application for three-dimensional imaging. Our method can simultaneously determine the chemical identity and full three-dimensional geometry, including size, shape, depth, and spatial coordinates, of particulate matter ranging from micrometres to millimetres in size across nearly $10^5$ distinct image pixels. We demonstrate our technique using millimetre-sized plastic specimens (i.e. microplastics measuring less than 5 mm). We combine amplitude and phase analysis and achieve a throughput exceeding $1.2~10^6$ pixels per second with micrometre-scale precision. Our method leverages the defining feature of microcombs - their large line spacing - to enable precise spectral diagnostics using microcombs with a repetition frequency of 1 THz. Our results suggest scalable operation over several million pixels and nanometre-scale axial resolution. Coupled with its high-speed, label-free and multiplexed capabilities, our approach provides a promising basis for environmental sensing, particularly for the real-time detection and characterisation of microplastic pollutants in aquatic ecosystems [17].",
    "authors": [
      "Stephan Amann",
      "Edoardo Vicentini",
      "Bingxin Xu",
      "Weiqiang Xie",
      "Yang He",
      "Qiang Lin",
      "John Bowers",
      "Theodor W. Hänsch",
      "Kerry Vahala",
      "Nathalie Picqué"
    ],
    "published": "2025-08-25T17:19:04Z",
    "updated": "2025-08-25T17:19:04Z",
    "categories": [
      "physics.optics",
      "physics.app-ph",
      "physics.chem-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2508.18145v1",
    "url": "https://arxiv.org/abs/2508.18145v1",
    "pdf_url": "https://arxiv.org/pdf/2508.18145v1.pdf",
    "title": "Spiral Tuning of Wire-metamaterial Cavity for Plasma Haloscope",
    "abstract": "Axions are hypothetical particles that provide a compelling solution to two major mysteries in modern physics: the strong CP problem and the nature of dark matter. The plasma haloscope has been proposed as a promising approach for probing the higher-mass regime for dark matter axions by employing a periodic arrangement of conducting wires. In this study, we present a novel tuning mechanism for such wire-based structures by bundling the wires into a spiral configuration. This design enables continuous frequency tuning of approximately 25% with a single central rotation while maintaining the form factor. To validate this concept, we fabricated a prototype cavity comprising six spiral arms and experimentally demonstrated its feasibility, achieving results in good agreement with numerical simulations.",
    "authors": [
      "Jacob Lindahl",
      "Rustam Balafendiev",
      "Gagandeep Kaur",
      "Gaganpreet Singh",
      "Andrea Gallo Rosso",
      "Jan Conrad",
      "Jon Gudmundsson",
      "Junu Jeong"
    ],
    "published": "2025-08-25T15:53:53Z",
    "updated": "2025-08-25T15:53:53Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2508.06560v2",
    "url": "https://arxiv.org/abs/2508.06560v2",
    "pdf_url": "https://arxiv.org/pdf/2508.06560v2.pdf",
    "title": "Experimental plasmonic sensing of malaria using an aluminum metasurface",
    "abstract": "A wide range of methods currently exist for testing the presence of malaria, each with its own advantages and disadvantages. New technologies are urgently needed to develop more effective diagnosis tools to fight and eradicate malaria. Optical biosensors that employ surface plasmon resonance (SPR) techniques are a promising category of devices for detecting malaria biomarkers. One such biomarker is plasmodium lactate dehydrogenase (pLDH), a protein produced during the life cycle of the malaria parasite, which is a metabolic enzyme found in all plasmodium species, including the most widespread falciparum. This work reports on the design, probing, and experimental performance of an optical biosensor for detecting pLDH based on SPR and extraordinary optical transmission. The biosensor is composed of an aluminum metasurface made from an array of nanoholes. The sensor operates in the visible spectral region and achieves label-free sensing of plasmodium falciparum LDH (pfLDH) spiked in phosphate-buffered saline. The sensor has a spectral sensitivity of 360 nm/RIU and an LOD of 1.3 nM, equivalent to 45.6 ng/mL of pfLDH. This type of optical biosensor may offer a cost-effective and high sensitivity method for active infection diagnosis.",
    "authors": [
      "A. S. Kiyumbi",
      "M. S. Tame"
    ],
    "published": "2025-08-06T15:30:35Z",
    "updated": "2025-08-25T15:30:11Z",
    "categories": [
      "physics.med-ph",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "physics.med-ph"
  },
  {
    "arxiv_id": "2412.15823v3",
    "url": "https://arxiv.org/abs/2412.15823v3",
    "pdf_url": "https://arxiv.org/pdf/2412.15823v3.pdf",
    "title": "3D non-linear MHD simulations of core density collapse event in LHD   plasma",
    "abstract": "A new three-dimensional, non-linear Magnetohydrodynamics (MHD) model has been extended in MIPS code, incorporating parallel heat diffusivity. The model has been benchmarked against the former MHD model used in MIPS code. A preliminary study of the core density collapse event (CDC) observed in the Large Helical Device (LHD) plasma has been performed using the developed model. The equilibrium has been constructed using HINT code for a typical super dense core discharge in LHD, with vacuum magnetic axis configuration RaxV = 3.85 m and magnetic axis beta \\beta0 = 4% plasma. This configuration corresponds to a plasma with a steep pressure gradient and strong Shafranov shift, which makes the plasma potentially unstable in the LHD. The model shows preliminary characteristics of the CDC event. The plasma is destabilized by high-n ballooning modes in the low-field side region during the linear regime, eventually leading to the collapse of the pressure and density profiles, together with the stochastization of the magnetic field and a shift to low-n modes centered at the core of the plasma after the non-linear coupling at the relaxation regime.",
    "authors": [
      "A. Civit-Bertran",
      "S. Futatani",
      "Y. Suzuki",
      "J. Dominguez-Palacios"
    ],
    "published": "2024-12-20T12:04:21Z",
    "updated": "2025-08-25T15:05:53Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2504.07311v4",
    "url": "https://arxiv.org/abs/2504.07311v4",
    "pdf_url": "https://arxiv.org/pdf/2504.07311v4.pdf",
    "title": "Scenarios for magnetic X-point collapse in 2D incompressible   dissipationless extended magnetohydrodynamics",
    "abstract": "The equations of 2D incompressible dissipationless extended magnetohydrodynamics (XMHD) extend the equations of incompressible Hall MHD (HMHD) by retaining finite-electron inertia. These XMHD equations couple the fluid velocity ${\\bf V} = \\wh{\\sf z}\\btimes\\nabla\\phi + V_{z}\\,\\wh{\\sf z}$ with the magnetic field ${\\bf B} = \\nabla\\psi\\btimes\\wh{\\sf z} + B_{z}\\,\\wh{\\sf z}$ in a process that is known to support dissipationless solutions that exhibit finite-time singularities associated with magnetic X-point collapse in the magnetic plane $(B_{x} = \\partial\\psi/\\partial y, B_{y} = -\\,\\partial\\psi/\\partial x)$. Here, by adopting a 2D self-similar model for the four XMHD fields $(\\phi,\\psi,V_{z},B_{z})$, we obtain five coupled ordinary differential equations that are solved in terms of the Jacobi elliptic functions based on an orbital classification associated with particle motion in a quartic potential. Excellent agreement is found when these analytical solutions are compared with numerical solutions, including the precise time of a magnetic X-point collapse.",
    "authors": [
      "Alain J. Brizard"
    ],
    "published": "2025-04-09T22:25:59Z",
    "updated": "2025-08-25T13:04:27Z",
    "categories": [
      "physics.plasm-ph",
      "math-ph",
      "math.MP"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.17963v1",
    "url": "https://arxiv.org/abs/2508.17963v1",
    "pdf_url": "https://arxiv.org/pdf/2508.17963v1.pdf",
    "title": "Enhanced Terahertz Generation via Oblique Incidence of Unipolar Laser   Pulses on Plasma",
    "abstract": "We investigate terahertz (THz) radiation generation at the vacuum-plasma interface driven by the oblique incidence of s-polarized Gaussian laser pulse(s) on a semi-infinite underdense plasma.~Extending beyond the conventional single-frequency bipolar pulse (B-pulse), this work focuses on leveraging two-color mixed-frequency pulse-- (M-pulse) excitation to enhance THz performance in terms of strength and broadening that can be tuned through controlled amplitude and phase of the constituent pulses of the M-pulse. A new expression for the ponderomotive force (PF) -- which acts as the main driver of THz radiation at the vacuum-plasma boundary -- is derived to capture the hitherto unexplored effects of phase asymmetry intrinsic to the M-pulse, in contrast to a single B-pulse where its phase is irrelevant. This PF formulation captures the underlying cycle-to-cycle symmetry-breaking for the M-pulse field, responsible for efficient THz emission. We demonstrate analytically that such M-pulses of the same total energy as a B-pulse may generate significantly enhanced PF, leading to THz yields several orders of magnitude higher. With a judicious choice of low-frequency to high-frequency ratio, the M-pulse configuration is shown to emerge as a highly efficient, phase-controllable driver of   THz radiation and offers a promising route for optimizing THz source design via tailored two-color laser-plasma interactions.",
    "authors": [
      "Anjana K P",
      "Rohit Kumar Srivastav",
      "Mrityunjay Kundu"
    ],
    "published": "2025-08-25T12:23:41Z",
    "updated": "2025-08-25T12:23:41Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.15691v2",
    "url": "https://arxiv.org/abs/2508.15691v2",
    "pdf_url": "https://arxiv.org/pdf/2508.15691v2.pdf",
    "title": "Trotter-based quantum algorithm for solving transport equations with   exponentially fewer time-steps",
    "abstract": "The extent to which quantum computers can simulate physical phenomena and solve the partial differential equations (PDEs) that govern them remains a central open question. In this work, one of the most fundamental PDEs is addressed: the multidimensional transport equation with space- and time-dependent coefficients. We present a quantum numerical scheme based on three steps: quantum state preparation, evolution, and measurement of relevant observables. The evolution step combines a high-order centered finite difference with a time-splitting scheme based on product formula approximations, also known as Trotterization. We introduce novel vector-norm analysis and prove that the number of time-steps can be reduced by a factor exponential in the number of qubits compared to previously established operator-norm analysis, thereby significantly lowering the projected computational resources. We also present efficient quantum circuits and numerical simulations that confirm the predicted vector-norm scaling. We report results on real quantum hardware for the one-dimensional convection equation, and solve a non-linear ordinary differential equation via its associated Liouville equation, a particular case of transport equations. This work provides a practical framework for efficiently simulating transport phenomena on quantum computers, with potential applications in plasma physics, molecular gas dynamics and non-linear dynamical systems, including chaotic systems.",
    "authors": [
      "Julien Zylberman",
      "Thibault Fredon",
      "Nuno F. Loureiro",
      "Fabrice Debbasch"
    ],
    "published": "2025-08-21T16:14:05Z",
    "updated": "2025-08-25T12:00:54Z",
    "categories": [
      "quant-ph",
      "math-ph",
      "math.MP",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2508.17810v1",
    "url": "https://arxiv.org/abs/2508.17810v1",
    "pdf_url": "https://arxiv.org/pdf/2508.17810v1.pdf",
    "title": "Kinetic contribution to the arbitrary order odd frequency moments of the   dynamic structure factor",
    "abstract": "An exact expression is derived for the kinetic contribution to the odd (arbitrary order) frequency moments of the dynamic structure factor via a finite summation that features averages of even (all lower orders) powers of the momentum over the exact momentum distribution. The derivation is carried out for the non-interacting Fermi gas and generalized to the interacting case based on the conjecture that averages over the Fermi distribution can be substituted with averages over the exact distribution. The expression is validated against known results (first, third frequency moments) and new explicit calculations (fifth, seventh frequency moments).",
    "authors": [
      "Panagiotis Tolias",
      "Tobias Dornheim",
      "Jan Vorberger"
    ],
    "published": "2025-08-25T08:58:27Z",
    "updated": "2025-08-25T08:58:27Z",
    "categories": [
      "cond-mat.quant-gas",
      "cond-mat.str-el",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.quant-gas"
  },
  {
    "arxiv_id": "2508.17443v1",
    "url": "https://arxiv.org/abs/2508.17443v1",
    "pdf_url": "https://arxiv.org/pdf/2508.17443v1.pdf",
    "title": "Pulsed laser synthesis of mesoporous metal chalcogenide thin films",
    "abstract": "Mesoporous films of the metal chalcogenide $\\beta$-FeSe were grown on MgO substrates by KrF pulsed laser deposition (PLD) in an argon background. At 100 mTorr, gated intensified charge-coupled device imaging and ion probe measurements showed that the plasma plume responsible for crystal growth initially comprised three components, with distinct expansion velocities. Plume interactions with the substrate heater and ablation target gave rise to complex dynamics, including collisions between the charged leading edge -- rebounding between the substrate and the target -- and slower-moving species in the plume interior. Film growth was dominated by species with kinetic energies $\\le$0.5 eV/atom. X-ray reflectivity and atomic force microscopy revealed that films grown in this environment -- with a substrate temperature of 350$^\\circ$C, a laser fluence of 1.0 J cm$^{-2}$, and a 7.5 mm$^2$ spot area -- formed a porous framework with 15% porosity and pore sizes below 100 nm. X-ray diffraction indicated that the porous films were epitaxial with respect to the substrate and likely grew by oriented-attachment of gas-phase molecular clusters or very small nanoparticles, in contrast to the conventional epitaxy of vacuum films from atomic constituents. The in-plane orientation of the mesoporous films was $\\beta$-FeSe[100]$\\parallel$[110]MgO, attributed to the soft landing of pre-formed crystallites on the MgO substrates, where protruding Se rows of $\\beta$-FeSe aligned with corrugations of the MgO surface. This work implies that growth of candidate electrocatalyst materials by PLD in inert gas background may allow mesoporous frameworks with a single crystallographic orientation that expose specific crystal facets for electrochemical reactions and active site engineering.",
    "authors": [
      "Dorien E. Carpenter",
      "Zahra Nasiri",
      "Nithesh R. Palagiri",
      "Kamron L. Strickland",
      "Sumner B. Harris",
      "David B. Geohegan",
      "Renato P. Camata"
    ],
    "published": "2025-08-24T16:46:39Z",
    "updated": "2025-08-24T16:46:39Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2508.17420v1",
    "url": "https://arxiv.org/abs/2508.17420v1",
    "pdf_url": "https://arxiv.org/pdf/2508.17420v1.pdf",
    "title": "Landau damping and the long-time collisionless limit of the   Vlasov-Poisson-Landau Equation",
    "abstract": "In this paper, we study the Vlasov-Poisson-Landau Equations on $\\mathbb{T}^3\\times \\mathbb{R}^3$ with small collision frequency $\\nu\\ll 1$. We prove that for $\\nu$-independent perturbations of the global Maxwellians in Gevrey-$2_-$, solutions display uniform-in-$\\nu$ Landau damping and enhanced dissipation. Moreover, the collisionless limit holds, that is, as $\\nu\\to 0_+$ for $0<t\\ll \\nu^{-\\frac{1}{3}}$, the $\\nu > 0$ solutions converge uniformly (and in much stronger norms) to the solution of the Vlasov-Poisson equation with the same initial data. To our knowledge, this work is hence the first justification that the collisionless prediction matches those of collisional plasmas in the nonlinear equations.   The interaction between Landau damping and collisions requires several new ideas:   (1) an infinite-regularity commuting vector field method, merged with Guo's weighted energy methods for the Landau operator and hypocoercivity to extract the enhanced dissipation;   (2) A novel nearly-physical side treatment of the collisionless Vlasov echoes;   (3) A new set of decomposition methods to treat the effects of the nonlinear collisions in the Volterra equation for the density (i.e., the ``collisional echoes'')   (4) A new quasi-linearization method for treating the effect of the slowly evolving homogeneous modes over long times.   As a side result, we also prove Landau damping and enhanced dissipation of $O(\\epsilon\\nu^{1/3})$ Sobolev-space perturbations of homogeneous distributions that are only $O(\\epsilon)$ perturbations of global Maxwellians, generalizing the recent results of Chaturvedi, Luk, and Nguyen. As another side result, our methods also provide a nearly-completely physical-side proof of Mouhot and Villani's theorem in the full range of Gevrey-$3_-$.",
    "authors": [
      "Jacob Bedrossian",
      "Weiren Zhao",
      "Ruizhao Zi"
    ],
    "published": "2025-08-24T15:54:11Z",
    "updated": "2025-08-24T15:54:11Z",
    "categories": [
      "math.AP",
      "physics.plasm-ph"
    ],
    "primary_category": "math.AP"
  },
  {
    "arxiv_id": "2508.17309v1",
    "url": "https://arxiv.org/abs/2508.17309v1",
    "pdf_url": "https://arxiv.org/pdf/2508.17309v1.pdf",
    "title": "An improved nonlocal electron heat transport model for magnetized   plasmas",
    "abstract": "Distortions in the electron distribution function driven by intense temperature gradients critically influence the generation and evolution of heat flux and magnetic fields in plasmas under the condition of inertial confinement fusion. Describing such kinetic behaviors at large spatiotemporal scales typically requires multigroup models based on simplified Vlasov-Fokker-Planck equations. However, the accuracy of existing multigroup models remains uncertain, without a well-defined methodology for implementing nonlocal magnetic field corrections. This paper develops an improved nonlocal multigroup model for magnetized plasmas. The advancements comprise: (i) a revised source term in the diffusion equations, (ii) a Biermann-producing electric field equation incorporating the density perturbation, and (iii) a nonlocal correction method for the Nernst velocity. The numerical method for the anisotropic heat conduction equation is analyzed, and three test cases demonstrate that the model accurately predicts the key phenomena arising from nonlocal effects in magnetized plasmas.",
    "authors": [
      "Z. H. Chen",
      "Z. Q. Zhao",
      "X. H. Yang",
      "L. R. Li",
      "B. Zeng",
      "Z. Li",
      "B. H. Xu",
      "G. B. Zhang",
      "H. H. Ma",
      "M. Tang",
      "Y. Y. Ma",
      "H. Xu",
      "F. Q. Shao",
      "J. Zhang"
    ],
    "published": "2025-08-24T11:29:11Z",
    "updated": "2025-08-24T11:29:11Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.17080v1",
    "url": "https://arxiv.org/abs/2508.17080v1",
    "pdf_url": "https://arxiv.org/pdf/2508.17080v1.pdf",
    "title": "Terahertz-Driven Nano-tip Field-Emission Electron Gun and Cascaded   Acceleration",
    "abstract": "This paper reports two versions of terahertz (THz)-driven nanotip field-emission electron guns: single-layer reflective guns (SLRGs) and double-layer reflective guns (DLRGs). Both guns use nanotip emitters and accelerate electrons through the electric field of the THz wave. SLRGs employ a reflective structure to superimpose the initial and subsequent half-cycles of the THz electric field, enhancing the field amplitude and acceleration efficiency. Experiments have demonstrated that SLRGs achieve higher acceleration efficiency than single-layer nonreflective guns (SLNRGs) for identical THz input energies. This constitutes direct experimental verification of the efficacy of the reflective structure. Theoretically, SLRGs operating in single-feed mode can match the acceleration efficiency of dual-feed SLNRGs while reducing operational complexity. DLRGs demonstrate THz-driven cascaded electron acceleration through precise scanning of the delay between two incident THz beams. This represents a direct experimental demonstration of cascaded acceleration in THz-driven electron sources. The experimental results of DLRGs align closely with the results of electron dynamics predicted by simulations. This establishes the foundation for developing multilayer high-acceleration-efficiency THz-driven high-energy electron guns. The ability to manipulate the THz for each layer individually holds promising potential for improving the beam quality of THz electron guns.",
    "authors": [
      "Wentao Yu",
      "Nongchao Tan",
      "Kai Peng",
      "Sijie Fan",
      "Yixiao Fu",
      "Kai Jiang",
      "Zhao Yun",
      "Longding Wang",
      "Renkai Li",
      "Yingchao Du",
      "Lixin Yan",
      "Chuanxiang Tang",
      "Wenhui Huang"
    ],
    "published": "2025-08-23T16:36:04Z",
    "updated": "2025-08-23T16:36:04Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2501.11761v2",
    "url": "https://arxiv.org/abs/2501.11761v2",
    "pdf_url": "https://arxiv.org/pdf/2501.11761v2.pdf",
    "title": "Strong and weak dynamo regimes in Taylor-Couette flows",
    "abstract": "We reveal a nonlinear magnetic dynamo in a Taylor-Couette flow at small magnetic Prandtl numbers $Pm\\leq 1$, which has been previously believed to exist only at higher $Pm\\gtrsim 10$ in this flow. The amplitude of initial perturbations, $Pm$ and domain aspect ratio play a key role in the onset and evolution of the dynamo. It exists in two main states -- a weak state dominated by large-scale modes and a strong, turbulent state with higher amplitude dominated by small-scale modes. These findings can be important for dynamo processes in various astrophysical objects with small $Pm$.",
    "authors": [
      "A. Mishra",
      "G. Mamatsashvili",
      "F. Stefani"
    ],
    "published": "2025-01-20T21:45:27Z",
    "updated": "2025-08-23T15:18:27Z",
    "categories": [
      "physics.flu-dyn",
      "astro-ph.EP",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.flu-dyn"
  },
  {
    "arxiv_id": "2508.14362v2",
    "url": "https://arxiv.org/abs/2508.14362v2",
    "pdf_url": "https://arxiv.org/pdf/2508.14362v2.pdf",
    "title": "Suppression of two stream instability in relativistic electron-ion   plasmas",
    "abstract": "This paper investigates the suppression of two stream instabilities in electron ion plasmas when the individual species attain relativistic velocities. This suppression of the growth rate of two stream instability is consistent even when the ions form a neutralizing background. It is found that the parameter space of the growth rate reasonably squeezes for relativistic electrons at higher plasma frequencies. We further report the suppression of the growth rate of the said instability as the ion electron mass ratio reaches the realistic limit. Our results have implications for high-energy plasmas, laser-plasma interactions, and relativistic particle beam physics, providing insights into the complex interplay of linear and nonlinear processes governing the two-stream instability. Our unified four-regime analysis extends previous understanding of how realistic mass ratios fundamentally modify relativistic suppression effects, providing essential scaling laws for high-energy plasma applications.",
    "authors": [
      "Vivek Shrivastav",
      "Mani K Chettri",
      "Hemam D Singh",
      "Rupak Mukherjee"
    ],
    "published": "2025-08-20T02:22:46Z",
    "updated": "2025-08-23T04:44:17Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.16864v1",
    "url": "https://arxiv.org/abs/2508.16864v1",
    "pdf_url": "https://arxiv.org/pdf/2508.16864v1.pdf",
    "title": "Precision alignment and tolerance of a plasma wakefield accelerator in a   laser-ionized plasma source",
    "abstract": "We present a novel method for aligning a laser ionized plasma source to a pair of ultra-relativistic electron beams that comprise a plasma wakefield accelerator (PWFA). We achieve alignment by analyzing the plasma afterglow light observed at two longitudinal locations as the plasma column is scanned across the electron beam. By analyzing the relative plasma light intensity at the two locations, we aligned an 85-cm plasma source to a 10 GeV, 1.6 nC electron beam to within 10 um offset, 10 urad tilt. The alignment is verified by analyzing the drive beam energy loss, energy transfer efficiency, and the witness beam energy gain as a function of the misalignment between the beams and the plasma. From this measurement, we extract the alignment tolerance required between the laser-ionized plasma source and electron beams, an important metric necessary for collider design studies or light source applications based on a laser-ionized plasma source.",
    "authors": [
      "Valentina Lee",
      "Robert Ariniello",
      "Douglas Storey",
      "Sebastien Corde",
      "Claudio Emma",
      "Spencer Gessner",
      "Mark Hogan",
      "Alexander Knetsch",
      "Nathan Majernik",
      "Brendan O'Shea",
      "Ivan Rajkovic",
      "Michael Litos"
    ],
    "published": "2025-08-23T01:21:54Z",
    "updated": "2025-08-23T01:21:54Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.16533v1",
    "url": "https://arxiv.org/abs/2508.16533v1",
    "pdf_url": "https://arxiv.org/pdf/2508.16533v1.pdf",
    "title": "Bayesian Optimisation of Breit-Wheeler Pair Production in Simulated   Laser Experiments",
    "abstract": "High laser intensities enable the production of electron-positron pairs from bright gamma rays passing through strong fields. Potentially the most promising approach for all-optical experiments in the near term uses dense but higher divergence electron beams from laser wakefield acceleration to produce gamma rays through inverse Compton scattering. Achieving many-photon collisions between these gamma rays and the high intensity laser pulse in practice is extremely difficult, however, due to significant shot-to-shot jitter in laser pointing and timing.   We model these practical difficulties using simulated Monte-Carlo experiments. By using a more efficient algorithm for sampling infrequent pair production with particle splitting, we enable the exploration of a multi-dimensional parameter space. Using Gaussian Process Regression we then efficiently find optimal conditions for maximising pair production by changing the laser spot size, the energy in the colliding beam, and the stand-off distance between the laser wakefield accelerator and the focus of the colliding laser pulse. We find that the optimal stand-off distance increases with the degree of laser jitter and that the best conditions for producing electron-positron pairs are not the same as the best conditions for maximising the energy in the gamma rays. With \\unit[100]{J} of laser energy, we estimate rates of pair production of around 1 pair per 100 electrons are achievable even with jitter of 10s of microns and 10s of femtoseconds.",
    "authors": [
      "Christopher Arran",
      "Stuart Morris",
      "Christopher P. Ridgers"
    ],
    "published": "2025-08-22T16:55:11Z",
    "updated": "2025-08-22T16:55:11Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.16407v1",
    "url": "https://arxiv.org/abs/2508.16407v1",
    "pdf_url": "https://arxiv.org/pdf/2508.16407v1.pdf",
    "title": "Trapping of electrons and $^{40}\\textrm{Ca}^+$ ions in a dual-frequency   Paul trap",
    "abstract": "We demonstrate the operation of a dual-frequency Paul trap and characterize its performance by storing either electrons or calcium ions while applying two quadrupole fields simultaneously which oscillate at $\\Omega_\\textrm{fast} = 2\\pi \\times 1.6$ GHz and $\\Omega_\\textrm{slow} = 2\\pi \\times 2$ MHz. The particles are loaded and stored in the trap under various conditions followed by detection employing an electron multiplier tube. We find that tens of electrons or ions can be trapped for up to ten milliseconds and a small fraction remains trapped even after hundreds of milliseconds. During dual-frequency operation we find that while the number of trapped electrons rapidly decreases with increase of the $\\Omega_\\textrm{slow}$ field amplitude, the number of trapped ions shows no dependence on the $\\Omega_\\textrm{fast}$ field amplitude as supported by our extensive numerical simulations. We aim to use a similar trap for synthesising antihydrogen from antiprotons and positrons. Accordingly, we discuss open challenges such as the co-trapping of oppositely charged species and particle trap duration.",
    "authors": [
      "Vladimir Mikhailovskii",
      "Natalija Sheth",
      "Guofeng Qu",
      "Michal Hejduk",
      "Niklas Vilhelm Lausti",
      "K. T. Satyajith",
      "Christian Smorra",
      "Günther Werth",
      "Neha Yadav",
      "Qian Yu",
      "Clemens Matthiesen",
      "Hartmut Häffner",
      "Ferdinand Schmidt-Kaler",
      "Hendrik Bekker",
      "Dmitry Budker"
    ],
    "published": "2025-08-22T14:14:17Z",
    "updated": "2025-08-22T14:14:17Z",
    "categories": [
      "physics.atom-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2508.16349v1",
    "url": "https://arxiv.org/abs/2508.16349v1",
    "pdf_url": "https://arxiv.org/pdf/2508.16349v1.pdf",
    "title": "Identification of Nonlinear Damping of Transverse Loop Oscillations by   KHI-induced Turbulence",
    "abstract": "Kink oscillations in coronal loops have been extensively studied for their potential contributions to coronal heating and their role in plasma diagnostics through coronal seismology. A key focus is the strong damping of large-amplitude kink oscillations, which observational evidence suggests is nonlinear. However, directly identifying the nonlinearity is a challenge. This work presents an analytic formula describing nonlinear standing kink oscillations dissipated by turbulence, characterised by a time-varying damping rate and period drift. We investigate how the damping behaviour depends on the driving amplitude and loop properties, showing that the initial damping time $\\tau$ is inversely proportional to the velocity disturbance over the loop radius, $V_i/R$. Using MCMC fitting with Bayesian inference, the nonlinear function better fits an observed decaying kink oscillation than traditional linear models, including exponential damping, suggesting its nonlinear nature. By applying a Bayesian model comparison, we establish regimes in which nonlinear and linear resonant absorption mechanisms dominate based on the relationship between the damping rate $\\tau/P$ and $V_i/R$. Additionally, analysis of two specific events reveals that while one favours the nonlinear model, the other is better explained by the linear model. Our results suggest that this analytical approximation of nonlinear damping due to turbulence provides a valid and reliable description of large-amplitude decaying kink oscillations in coronal loops.",
    "authors": [
      "Sihui Zhong",
      "Andrew Hillier",
      "Iñigo Arregui"
    ],
    "published": "2025-08-22T12:41:55Z",
    "updated": "2025-08-22T12:41:55Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR",
    "doi": "10.3847/1538-4357/adfd5c"
  },
  {
    "arxiv_id": "2504.04282v2",
    "url": "https://arxiv.org/abs/2504.04282v2",
    "pdf_url": "https://arxiv.org/pdf/2504.04282v2.pdf",
    "title": "Semi-Lagrangian methods for a plasma hybrid model with multi-species   kinetic ions and massless electrons",
    "abstract": "The semi-Lagrangian methods with the improved number of one-dimensional advections are proposed for a plasma hybrid model with kinetic ions and mass-less electrons. Two subsystems with mass, momentum, and energy conservation are obtained by a Poisson bracket-based splitting method. For the subsystem in which the distribution functions and the fields are coupled, the second order and reversible modified implicit mid-point rule is used in time with the specially designed mean velocity. The distribution functions are not involved in the iterations and are solved by exact splittings with only one dimensional advections, which makes the proposed schemes efficient. The cancellation problem is overcome by the numerical schemes constructed. Moreover, for the case with a periodic boundary condition, the magnetic field obtained is divergence free, mass, momentum, and energy are conserved. The methods can be extended to cases with multiple ion species.",
    "authors": [
      "Yingzhe Li",
      "Philip J. Morrison",
      "Eric Sonnendrücker"
    ],
    "published": "2025-04-05T21:06:03Z",
    "updated": "2025-08-22T10:10:33Z",
    "categories": [
      "math.NA",
      "cs.NA",
      "physics.plasm-ph",
      "65M25, 85-08, 86-08, 35Q83"
    ],
    "primary_category": "math.NA"
  },
  {
    "arxiv_id": "2508.16248v1",
    "url": "https://arxiv.org/abs/2508.16248v1",
    "pdf_url": "https://arxiv.org/pdf/2508.16248v1.pdf",
    "title": "A rigorous study on the longitudinal beam coupling impedance of a   cylindrical lossy pipe in normal and anomalous regimes",
    "abstract": "One of the primary issues in designing particle accelerators is the effect of energy losses and collective instabilities caused by the conductivity of the vacuum chamber. Due to its relevance, many authors have long focused on studying the coupling impedance of lossy pipes with various geometries and metals. Most studies were developed for relativistic beams and room-temperature conductivity. In recent years, there has been increasing interest in the high-frequency impedance behavior of ultra-short bunches, as in the case of FELs, and in the anomalous conductivity at cryogenic temperatures of the vacuum chambers. This work introduces a new unifying theoretical framework for analyzing electromagnetic interactions in cylindrical pipes excited by charged particles traveling on the axis. In this context, a key achievement is the derivation of a rigorous expression for the electric conductivity, based on the Boltzmann theory of a Fermi gas, which forms the foundation for subsequent developments. New formulas for the surface impedance of cylindrical pipes are presented, from which a more general impedance expression is derived. Our approach captures the system's behavior across various energy and frequency regimes. Eventually, the anomalous regime is studied rigorously, providing analytical solutions for the electromagnetic field at cryogenic temperatures. Indeed, new and exact expressions for the anomalous surface impedance for carriers' reflection coefficients p = 0 and p = 1 are obtained, offering deeper insight into the electromagnetic properties of such systems under extreme conditions.",
    "authors": [
      "A. Curcio",
      "M. Migliorati",
      "A. Mostacci",
      "L. Palumbo"
    ],
    "published": "2025-08-22T09:29:51Z",
    "updated": "2025-08-22T09:29:51Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.16220v1",
    "url": "https://arxiv.org/abs/2508.16220v1",
    "pdf_url": "https://arxiv.org/pdf/2508.16220v1.pdf",
    "title": "Generating Cylindrical Vector γ Rays via Beam-Target   Interactions: Towards Structured Light at High Energies",
    "abstract": "Structured {\\gamma} rays, particularly cylindrical vector {\\gamma} rays, offer promising tools for sub-nuclear imaging and polarization-sensitive probes in fundamental research and applications, but conventional optical methods face great challenges at such photon energy. Here, we put forward a novel method generating such {\\gamma} rays through relativistic beam-target interactions. For instance, radially polarized {\\gamma} rays can be generated by using a dense electron beam striking a multifoil target. We find that the radial polarization is transferred from the generated coherent transition radiation (CTR) fields to $\\gamma$ photons through nonlinear Compton scattering, with the high polarization preserved by phase matching. Three-dimensional spin-resolved simulations demonstrate radial polarization degrees approaching 60\\%. Furthermore, these {\\gamma} rays can decay into azimuthally spin-polarized positrons via the nonlinear Breit-Wheeler process, with their spins aligning along the CTR magnetic field. Our work extends the concept of structured light into the {\\gamma}-ray regime, offering new prospects for broad fields such as nuclear structure probing, fundamental symmetries tests, polarization-sensitive studies in extreme conditions, and laboratory astrophysical observations.",
    "authors": [
      "Yue Cao",
      "Kun Xue",
      "Si-Man Liu",
      "Zhong-Peng Li",
      "Li-Xiang Hu",
      "Xin-Yu Liu",
      "Zhen-Ke Dou",
      "Feng Wan",
      "Qian Zhao",
      "Tong-Pu Yu",
      "Jian-Xing Li"
    ],
    "published": "2025-08-22T08:44:55Z",
    "updated": "2025-08-22T08:44:55Z",
    "categories": [
      "physics.optics",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2508.16208v1",
    "url": "https://arxiv.org/abs/2508.16208v1",
    "pdf_url": "https://arxiv.org/pdf/2508.16208v1.pdf",
    "title": "Resonantly Driven Electron Bernstein Waves in Magnetized Low-Pressure   Capacitive Discharges",
    "abstract": "The physics of capacitively coupled plasma (CCP) discharges is investigated in a mildly magnetized regime, defined by $1 \\le f_{ce}/f_{rf} < 2$, where $f_{ce}$ and $f_{rf}$ denote the electron cyclotron frequency and the applied radio-frequency (RF), respectively. A distinctive feature of this regime is the excitation of electron Bernstein waves (EBWs) that propagate into the bulk plasma. As the applied magnetic field increases, notable changes in the discharge characteristics occur, with EBWs observed to propagate along the plasma density gradient inside the bulk. The underlying physics of CCP operation in this regime is analyzed in detail using particle-in-cell Monte Carlo collisions (PIC-MCC) simulations.",
    "authors": [
      "Deepak Gautam",
      "Sarveshwar Sharma",
      "Igor Kaganovich",
      "Bhooshan Paradkar"
    ],
    "published": "2025-08-22T08:28:56Z",
    "updated": "2025-08-22T08:28:56Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  }
]