{
  "arxiv_id": "2510.23001v3",
  "url": "https://arxiv.org/abs/2510.23001v3",
  "pdf_url": "https://arxiv.org/pdf/2510.23001v3.pdf",
  "title": "Search for Dark Matter via Invisible Decays in ${}^{46}$Sc Nuclear Gamma Cascades with a CsI(Tl) Detector",
  "abstract": "Dark matter remains one of the most compelling open problems in modern physics, motivating experimental searches for new light, weakly coupled particles beyond the Standard Model. Despite extensive efforts employing diverse detection strategies, large regions of parameter space remain unexplored. We report a high-statistics laboratory search for invisible decay modes in nuclear $γ$-ray cascades using approximately $100~\\mathrm{kg}$ of CsI(Tl) scintillators operated at Texas A\\&M University. The experiment employs a high-activity ${}^{46}$Sc radioactive source and a ``missing-$γ$'' technique, in which the absence of a photon from a well-identified cascade serves as a signature of new physics. Unlike appearance-disappearance experiments, this approach requires only a single photon conversion into a dark-sector particle, enabling sensitivity to significantly weaker couplings. The setup provides simultaneous sensitivity to a broad class of light dark-sector candidates, including axions and axion-like particles, dark scalars, and dark photons in the $0.1 - 1 \\text{ MeV}$ mass region. Through careful control of detector containment, energy resolution, and environmental backgrounds, we excludes certain regions on the previously explored parameter space. With foreseeable improvements in detector volume and systematic uncertainty control, this technique has the potential to probe currently unexplored parameter space for axion-like particles and light dark scalars.",
  "authors": [
    "Sharada Sahoo",
    "Jing-han Chen",
    "Mahdi Mirzakhani",
    "Harikrishnan Ramani",
    "Rupak Mahapatra",
    "Surjeet Rajendran"
  ],
  "published": "2025-10-27T04:37:35Z",
  "updated": "2026-02-11T04:04:21Z",
  "categories": [
    "physics.ins-det",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det"
}