{
  "arxiv_id": "2602.12658v1",
  "url": "https://arxiv.org/abs/2602.12658v1",
  "pdf_url": "https://arxiv.org/pdf/2602.12658v1.pdf",
  "title": "High Negative Ion Gain MMThGEM-Micromegas Detector for Directional Dark Matter Searches",
  "abstract": "Low pressure gaseous Negative Ion Time Projection Chambers (NITPCs) have been used previously by the DRIFT experiment to search for a directional Dark Matter (DM) signature. The main challenge with using a Negative Ion Drift (NID) gas target is the significantly lower gas gains to which they are typically limited. Recently, a MMThGEM device has been successfully demonstrated as an excellent gain stage device in the NID gas SF$_6$; capable of producing gas gains comparable with the electron drift gas CF$_4$. The next major challenge is to extend this high gain capability to multi-dimensional readout for the purpose of particle track reconstruction. The MMThGEM is therefore ideal for coupling to a strip readout detector like a Micromegas to achieve a high gain multi-dimensional Negative Ion (NI) readout plane, which is potentially suitable for the scale up required by future searches proposed by the CYGNUS consortium. In this paper, the first high gain demonstration of such a MMThGEM-Micromegas detector in low pressure SF$_6$ is described. This includes detector characterisation in a small test vessel resulting in the largest NI gas gain ever reported, 1.22 $\\pm$ 0.08 $\\times$ 10$^5$ , and directionality with alpha particles. Finally, this gain characterisation and tracking capability is leveraged to measure the energy and range of events, and identify those consistent with Nuclear Recoils (NRs), in a large cubic metre scale volume of SF$_6$ for the first time.",
  "authors": [
    "A. G. McLean",
    "S. Higashino",
    "R. R. Marcelo Gregorio",
    "K. Miuchi",
    "N. J. C. Spooner"
  ],
  "published": "2026-02-13T06:39:50Z",
  "updated": "2026-02-13T06:39:50Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}