[
  {
    "arxiv_id": "2602.13064v1",
    "url": "https://arxiv.org/abs/2602.13064v1",
    "pdf_url": "https://arxiv.org/pdf/2602.13064v1.pdf",
    "title": "Improving the performance of mid-T baked niobium cavities through post-bake surface treatment",
    "abstract": "The Medium temperature (mid-T) baking of niobium superconducting radio-frequency cavities at 300 350&#8239; C in a vacuum furnace is known to enhance the quality factor (Q&#8320;). However, despite this improvement, cavities treated with this process often exhibit premature quench at relatively low accelerating fields. This limitation is suspected to arise from the formation of surface contaminants, such as niobium carbides, during the furnace bake at 350 C for 3 h. To investigate the influence of potential surface contamination, this study applied an ultralight chemical removal to 1.3&#8239;GHz and 650&#8239;MHz single-cell cavities that had undergone medium-temperature baking. The removal of the top RF surface layer led to a notable improvement in the quench field and Q&#8320;, indicating a beneficial effect of eliminating possible surface residues introduced during the bake.",
    "authors": [
      "V. Chouhan",
      "D. Bice",
      "A. Cravatta",
      "B. Guilfoyle",
      "A. Murthy",
      "A. Netepenko",
      "T. Reid",
      "T. Ring",
      "D. Smith",
      "G. Wu"
    ],
    "published": "2026-02-13T16:18:04Z",
    "updated": "2026-02-13T16:18:04Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.13060v1",
    "url": "https://arxiv.org/abs/2602.13060v1",
    "pdf_url": "https://arxiv.org/pdf/2602.13060v1.pdf",
    "title": "Quantitative imaging of Abrikosov vortices by scanning quantum magnetometry",
    "abstract": "Understanding vortex matter in type-II superconductors is central to controlling dissipation and flux pinning in superconducting materials and devices. Here, we use cryogenic scanning nitrogen vacancy magnetometry (NVM) to image Abrikosov vortices in the cuprate superconductors BSCCO-2212 and YBCO under controlled field-cooled conditions. Measurements, which are performed using continuous-wave optically detected magnetic resonance (cw-ODMR) in a closed-cycle cryostat, yield quantitative magnetic-field maps with nanoscale spatial resolution. In BSCCO-2212 at 71 K, we resolve a well-ordered triangular vortex lattice, whose symmetry and spacing are confirmed through 2D Fourier analysis and are consistent with flux quantization. YBCO thin films imaged at 3 K exhibit a more disordered vortex arrangement reflecting stronger pinning, while maintaining quantitative agreement between measured vortex density and the applied magnetic field. These results render our cryogenic scanning NVM a reliable quantitative tool for real-space studies of vortices in high-$T_c$ superconductors, in particular since such a remarkable magnetic resolution has been achieved within relatively short acquisition times of 2 to 4 h.",
    "authors": [
      "Clemens Schäfermeier",
      "Ankit Sharma",
      "Christopher Kelvin von Grundherr",
      "Andrea Morales",
      "Jan Rhensius",
      "Gabriel Puebla-Hellmann",
      "Mirko Bacani"
    ],
    "published": "2026-02-13T16:15:48Z",
    "updated": "2026-02-13T16:15:48Z",
    "categories": [
      "cond-mat.supr-con",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "cond-mat.supr-con"
  },
  {
    "arxiv_id": "2602.12964v1",
    "url": "https://arxiv.org/abs/2602.12964v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12964v1.pdf",
    "title": "High-precision beam profile measurement with a microchannel-plate detector in the high magnetic field of the WISArD experiment",
    "abstract": "We present the development and characterization of a compact low-energy ion beam diagnostic for the WISArD (Weak Interaction Studies with $\\mathrm{^{32}Ar}$ Decay) experiment at ISOLDE/CERN. The microchannel plate (MCP) detector, which is configured in a Z-stack and has a resistive position sensitive anode, was tested with both stable and radioactive beams. This work focuses on the image reconstruction method, which corrects the pincushion distortion inherent to the square-shaped resistive anode, and investigates the influence of the magnetic field on the detector performance. Our results demonstrate that the detector achieves beam profile measurements with sub-millimeter accuracy, while coping with the spatial and high-magnetic field (4 T) constraints of the experiment. These capabilities meet the precision requirements of the WISArD experiment for extracting the modified beta-neutrino angular correlation coefficient, ã$_{βν}$, with an uncertainty of 0.1%.",
    "authors": [
      "S. Lecanuet",
      "X. Fléchard",
      "P. Alfaurt",
      "P. Ascher",
      "D. Atanasov",
      "B. Blank",
      "L. Daudin",
      "H. DePreaumont",
      "M. Gerbaux",
      "J. Giovinazzo",
      "S. Grévy",
      "G. Guignard",
      "J. Ha",
      "C. Knapen",
      "S. Lechner",
      "A. Lépine",
      "J. Lory",
      "J. Perronnel",
      "M. Pomorski",
      "M. Roche",
      "C. Roumegou",
      "N. Severijns",
      "Y. Son",
      "S. Vanlangendonck",
      "M. Versteegen",
      "D. Zakoucky"
    ],
    "published": "2026-02-13T14:30:39Z",
    "updated": "2026-02-13T14:30:39Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.12945v1",
    "url": "https://arxiv.org/abs/2602.12945v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12945v1.pdf",
    "title": "Cross-correlation on a single channel for resistance noise measurements",
    "abstract": "Cross-correlation is an established tool to reduce the background in resistance noise measurements. However, the conventional method requires the amplifier, demodulator and digitizer channels to be duplicated, increasing the cost and complexity of the measurement circuit. We propose an alternating-current technique that allows cross-correlation with only a single channel by modulating the device under test with two carrier frequencies simultaneously. Using multiple software-based demodulators, we show that this method produces accurate amplitude measurements and noise spectra. The signal-to-noise-ratio is improved by 7 dB, and longer measurement durations increase this improvement.",
    "authors": [
      "Tim Thyzel"
    ],
    "published": "2026-02-13T14:07:48Z",
    "updated": "2026-02-13T14:07:48Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.12931v1",
    "url": "https://arxiv.org/abs/2602.12931v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12931v1.pdf",
    "title": "Simulation Study for Particle Identification with the dRICH of the ePIC Experiment at the EIC",
    "abstract": "The dual-radiator Imaging Cherenkov detector (dRICH) is a key component of the forward particle identification system for the ePIC experiment at the Electron-Ion Collider (EIC). This study evaluates the dRICH performance using Geant4 simulations in the context of the global ePIC simulation stack, focusing on the optimization of the aerogel radiator and the impact of sensor noise. We compare two aerogel configurations: the initial design (n=1.019) and the current default (n=1.026). The latter, characterized by improved optical properties and a higher refractive index, demonstrates enhanced $π-K$ separation at high momenta, effectively extending the operational overlap with the $\\mathrm{C_2F_6}$ gas radiator. Additionally, the study investigates the impact of Silicon Photomultiplier (SiPM) dark noise, showing that a 300 kHz noise rate per channel leads to a moderate reduction (approximately 1.5 GeV/c) in the $3σ$ separation threshold. These results validate the current dRICH design and quantify the purity levels achievable for both radiators under expected experimental conditions.",
    "authors": [
      "Tiziano Boasso",
      "Chatterjee Chandradoy",
      "Dalla Torre Silvia",
      "Martin Anna",
      "Tessarotto Fulvio",
      "Agarwala Jinky",
      "Contalbrigo Marco",
      "Polizzi Lorenzo",
      "Occhiuto Luisa",
      "Del Caro Annalisa",
      "Nagorna Tetiana",
      "Osipenko Mikhail",
      "Vallarino Simone",
      "Farokhi Fateme",
      "Kiselev Alexander",
      "Bhadauria Rohit Singh",
      "Ghosh Tapasi",
      "Nunez Cynthia",
      "Pecar Connor",
      "George Nebin",
      "Rajan Adithyan",
      "Samuel Deepak",
      "Jangid Rohit",
      "Kumar Ramandeep",
      "Laishram Girdish",
      "Tanvi Tanya",
      "Thakur Meenu"
    ],
    "published": "2026-02-13T13:40:34Z",
    "updated": "2026-02-13T13:40:34Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.12853v1",
    "url": "https://arxiv.org/abs/2602.12853v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12853v1.pdf",
    "title": "R&D Efforts in Cherenkov Imaging Technologies for Particle Identification in Future Experiments",
    "abstract": "Cherenkov imaging detectors will continue to play a central role for particle identification in future particle and nuclear physics experiments. Growing demands on momentum coverage, timing precision, radiation tolerance, and sustainability have driven extensive R&D in detector concepts, radiator materials, and photon sensors. This article reviews recent efforts, focusing on experiments leading advances in sensor technology, radiator materials, and the exploitation of Cherenkov photon timing to push PID limits, while highlighting synergies across experiments in addressing common challenges.",
    "authors": [
      "Chandradoy Chatterjee"
    ],
    "published": "2026-02-13T11:58:17Z",
    "updated": "2026-02-13T11:58:17Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.12836v1",
    "url": "https://arxiv.org/abs/2602.12836v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12836v1.pdf",
    "title": "Measurements of absolute gamma-ray energies using an ultra-high energy resolution magnetic microcalorimeter",
    "abstract": "We present new measurements of 27 gamma ray energies ranging from 14 keV to 136 keV, obtained using high-energy-resolution magnetic microcalorimeters for energy-dispersive spectrometry. The spectrometer has eight pixels and achieves an energy resolution between 15 and 30 eV across the entire energy range. It faces a cryogenic source sampler with four movable sources. Each source contains a mixture of radionuclides, including Yb-169 and Co-57 used to calibrate the spectrometer and correct its non-linearity. The gamma-ray energies, emitted through the decay of Co-57, Cd-109, Ba-133, Gd-153, Eu-154, Eu-155, Yb-169, Tm-170, Pb-210, Np-239, Am-241 and Am-243, have been reassessed. The lowest absolute uncertainty achieved is 0.13 eV at 105.3 keV, which corresponds to a relative uncertainty of 1.3 ppm. Of the 27 measured gamma rays, the uncertainties of 19 energies were improved with respect to the available literature: 10 by a factor of 5 and 4 by more than one order of magnitude. Good agreement is observed with energies obtained elsewhere by wavelength-dispersive spectrometry. This work significantly improves upon previously reported gamma energies obtained by energy-dispersive spectrometry using semiconductor detectors, thanks to the ultra-high energy resolution of magnetic microcalorimeters.",
    "authors": [
      "Matias Rodrigues",
      "Mostafa L. Zahir",
      "Martin Loidl",
      "Lucille Chambon",
      "Quentin Drenne",
      "Michael Müller",
      "Sebastian Kempf",
      "Etienne Nigron",
      "Ferid Haddad"
    ],
    "published": "2026-02-13T11:41:38Z",
    "updated": "2026-02-13T11:41:38Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.12789v1",
    "url": "https://arxiv.org/abs/2602.12789v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12789v1.pdf",
    "title": "Resonant Excitation of Surface Plasmon for Wakefield Acceleration by Beating GW Lasers on Smooth Cylindrical Surface",
    "abstract": "We present a theoretical and numerical study of resonant surface-plasmon (SP) excitation driven by the beating of two co-propagating laser pulses on a smooth cylindrical plasma-vacuum interface. Analytical expressions for the SP dispersion relation, field amplitude, geometric coupling factor, and resonance conditions are derived and validated by fully three-dimensional particle-in-cell simulations. We reveal that curvature-induced geometric effects can substantially modify the SP dispersion and enable resonant matching by laser beat waves. This is inaccessible in planar geometries or with a single laser. Under matched resonance conditions, a high-amplitude SP-based wakefield can be generated by a few gigawatt lasers, placing this mechanism within reach of state-of-the-art fibre lasers. It therefore opens a route toward portable laser-driven plasma wakefield accelerators.",
    "authors": [
      "Bifeng Lei",
      "Hao Zhang",
      "Alexandre Bonatto",
      "Bin Liu",
      "Javier Resta-Lopez",
      "Matt Zepf",
      "Guoxing Xia",
      "Carsten Welsch"
    ],
    "published": "2026-02-13T10:14:36Z",
    "updated": "2026-02-13T10:14:36Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph",
      "physics.class-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.12773v1",
    "url": "https://arxiv.org/abs/2602.12773v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12773v1.pdf",
    "title": "Design and Operation of Wafer-Scale Packages Containing >500 Superconducting Qubits",
    "abstract": "Packages capable of supporting large arrays of high-coherence superconducting qubits are vital for the realisation of fault-tolerant quantum computers and the necessary high-throughput metrology required to optimise fabrication and manufacturing processes. We present a wafer-scale packaging architecture supporting over 500 qubits on a single 3-inch die. The package is engineered to suppress parasitic RF modes, and to mitigate material loss through simulation-informed design while managing differential thermal contraction to ensure robust operation at millikelvin temperatures. System-level heat-load calculations from a large wiring payload show this package may be operated in commercial dilution refrigerators. Measurements of the qubits loaded into the package show median $T_1$, $T_{2e} \\sim 100~μ$s ($\\sim$100 qubits) alongside readout with median fidelity of 97.5% (54 qubits) and a median qubit temperature of 36 mK (54 qubits). These results validate the performance of these packages and demonstrate that large-scale integration can be achieved without compromising device performance. Finally, we highlight the utility of these packages as a tool for high throughput feedback on qubit figures of merit over large sample sizes, allowing identification of performance outliers in the tails of the coherence distribution, a critical capability for informing fabrication and manufacture of high-quality quantum qubits and quantum processors.",
    "authors": [
      "Oscar W. Kennedy",
      "Waqas Ahmad",
      "Robert Armstrong",
      "Amir Awawdeh",
      "Anirban Bose",
      "Kevin G. Crawford",
      "Sergey Danilin",
      "William D. David",
      "Hamid El Maazouz",
      "Darren J. Hayton",
      "George B. Long",
      "Alexey Lyapin",
      "Scott A. Manifold",
      "Kowsar Shahbazi",
      "Ryan Wesley",
      "Evan Wong",
      "Connor D. Shelly"
    ],
    "published": "2026-02-13T09:58:30Z",
    "updated": "2026-02-13T09:58:30Z",
    "categories": [
      "quant-ph",
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2602.12765v1",
    "url": "https://arxiv.org/abs/2602.12765v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12765v1.pdf",
    "title": "Demonstration of ultra-low emittance beams in a kHz laser wakefield accelerator and application to electron diffraction",
    "abstract": "We present a compact, cost-effective method for measuring the emittance of kHz-repetition-rate laser-wakefield accelerated electron beams using a permanent solenoid. The measured normalized emittance, $ε_n = 124\\,\\mathrm{nm \\cdot rad}$ ($\\simeq 0.04 π\\,\\mathrm{mm \\cdot mrad}$) at $2.7\\,$MeV, is comparable to that of ultra-low emittance radiofrequency guns used for electron diffraction. Leveraging this low emittance, we successfully applied the electron beam to electron diffraction. We demonstrate diffraction images obtained from a single crystal Silicon nano-membrane sample, clearly resolving diffraction peaks across multiple orders.",
    "authors": [
      "J. Monzac",
      "S. Smartsev",
      "J. Huijts",
      "A. Vernier",
      "I. A. Andriyash",
      "V. Tomkus",
      "V. Girdauskas",
      "G. Raciukaitis",
      "M. Mackeviciute",
      "V. Stankevic",
      "A. Cavagna",
      "J. Kaur",
      "A. Kalouguine",
      "R. Lopez-Martens",
      "J. Faure"
    ],
    "published": "2026-02-13T09:49:28Z",
    "updated": "2026-02-13T09:49:28Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2503.05426v2",
    "url": "https://arxiv.org/abs/2503.05426v2",
    "pdf_url": "https://arxiv.org/pdf/2503.05426v2.pdf",
    "title": "Geant4 and FLUKA Simulations of a Cyclotron Based 30 MeV Proton-Beryllium Reaction: Benchmarking and Optimization of Neutron Fields",
    "abstract": "For studies where a reliable neutron source/beam is required and a nuclear reactor is not a viable option (considering their high neutron flux supply, which may not be suitable for research concerning low flux operations), alternative approaches may be sought. We present a comprehensive simulation analysis of 30 MeV proton induced ${}^9\\mathrm{Be}\\text{(p,n)}{}^9\\mathrm{B}$ reaction, which can be utilized as an isotropic neutron source. This energy was chosen as it was the maximum allowed limit of protons supplied by IBA's Cyclone 30 XP proton cyclotron. Due to different underlying physics and transport mechanisms, when it comes to numerical calculations, slight variations in findings between different toolkits may occur. Hence it may require one to have a guide at hand to address the differences and interpret the data more accurately before conducting the actual experiment. In this work present the different numerical results of Geant4 and FLUKA. We conducted preliminary Monte Carlo runs to estimate the resulting neutron fluence and prompt gamma dose equivalents, while also assessing the degree of moderation achieved by different thicknesses of high density polyethylene. Furthermore, this work also presents an examplar modular irradiation station designed for target-moderator configurations, with the capability of generating thermal neutron fields.",
    "authors": [
      "Egemen Gover",
      "Doga Veske",
      "M. Bilge Demirkoz"
    ],
    "published": "2025-03-07T13:52:37Z",
    "updated": "2026-02-13T08:53:53Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.12658v1",
    "url": "https://arxiv.org/abs/2602.12658v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12658v1.pdf",
    "title": "High Negative Ion Gain MMThGEM-Micromegas Detector for Directional Dark Matter Searches",
    "abstract": "Low pressure gaseous Negative Ion Time Projection Chambers (NITPCs) have been used previously by the DRIFT experiment to search for a directional Dark Matter (DM) signature. The main challenge with using a Negative Ion Drift (NID) gas target is the significantly lower gas gains to which they are typically limited. Recently, a MMThGEM device has been successfully demonstrated as an excellent gain stage device in the NID gas SF$_6$; capable of producing gas gains comparable with the electron drift gas CF$_4$. The next major challenge is to extend this high gain capability to multi-dimensional readout for the purpose of particle track reconstruction. The MMThGEM is therefore ideal for coupling to a strip readout detector like a Micromegas to achieve a high gain multi-dimensional Negative Ion (NI) readout plane, which is potentially suitable for the scale up required by future searches proposed by the CYGNUS consortium. In this paper, the first high gain demonstration of such a MMThGEM-Micromegas detector in low pressure SF$_6$ is described. This includes detector characterisation in a small test vessel resulting in the largest NI gas gain ever reported, 1.22 $\\pm$ 0.08 $\\times$ 10$^5$ , and directionality with alpha particles. Finally, this gain characterisation and tracking capability is leveraged to measure the energy and range of events, and identify those consistent with Nuclear Recoils (NRs), in a large cubic metre scale volume of SF$_6$ for the first time.",
    "authors": [
      "A. G. McLean",
      "S. Higashino",
      "R. R. Marcelo Gregorio",
      "K. Miuchi",
      "N. J. C. Spooner"
    ],
    "published": "2026-02-13T06:39:50Z",
    "updated": "2026-02-13T06:39:50Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.16679v2",
    "url": "https://arxiv.org/abs/2511.16679v2",
    "pdf_url": "https://arxiv.org/pdf/2511.16679v2.pdf",
    "title": "On the Measurability of True Coincidence Summing in the GRIFFIN Spectrometer",
    "abstract": "The measurement of gamma-rays from decaying nuclei allow for the investigation into nuclear structure. True coincidence summing occurs when two gamma-rays from a single decay get detected in a single detector and their energies sum together to give false peaks in the energy spectrum. Corrections to this summing effect are crucial for an accurate determination of nuclear decay events. The summing correction formalism of Semkow et al. is generalized here into the \\textit{Semkow matrix formalism} and is extended into a multiplicity expansion. This formalism is used to calculate the matrix probabilities for 180-degree coincidence events as a method for correcting coincidence summing; in doing so, the deviation between the full correction and this 180-degree correction is shown as a function of multiplicity. This formalism is extended to the \\textit{partitioned matrix formalism}, to calculate probabilities for \\textit{gated} gamma rays; where two gamma-rays of interest are taken in multi-detector coincidence. The summing correction probabilities for gated gamma-rays are provided and the deviation is shown in a manner similar to that of the singles. Terms such as measurability, event equivalence, and ontic and epistemic events are defined. It is shown that within these definitions, coincidence summing is not sufficiently measurable, or rather, its sufficient measurability is statistically bounded by the deviations derived.",
    "authors": [
      "Liam Schmidt"
    ],
    "published": "2025-11-10T21:45:04Z",
    "updated": "2026-02-12T22:23:22Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.12420v1",
    "url": "https://arxiv.org/abs/2602.12420v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12420v1.pdf",
    "title": "A Transformer-based Model for Rapid Microstructure Inference from Four-Dimensional Scanning Transmission Electron Microscopy Data",
    "abstract": "Properties of crystalline materials are closely linked to microstructure arising from the spatial arrangement, orientation, and phase of nanocrystals. Rapid characterization of crystalline microstructure can accelerate the identification of these links and the development of materials with desired properties. Here, we combine a machine learning framework with four-dimensional scanning transmission electron microscopy (4D-STEM) to enable fast inference of crystalline microstructure over large fields of view. The framework employs a transformer-based architecture to predict crystallographic orientations and phases from 4D-STEM diffraction patterns, yielding spatially resolved maps of microstructural features at the nanoscale. With this framework, crystallographic orientations are inferred up to two orders of magnitude faster than widely used correlative template-matching approaches. This capability enables high-throughput characterization of complex crystalline materials and facilitates the establishment of structure-property relationships central to materials design and optimization.",
    "authors": [
      "Kwanghwi Je",
      "Ellis R. Kennedy",
      "Sungin Kim",
      "Yao Yang",
      "Erik H. Thiede"
    ],
    "published": "2026-02-12T21:17:58Z",
    "updated": "2026-02-12T21:17:58Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2601.15971v2",
    "url": "https://arxiv.org/abs/2601.15971v2",
    "pdf_url": "https://arxiv.org/pdf/2601.15971v2.pdf",
    "title": "Reaching the intrinsic performance limits of superconducting strip photon detectors up to 0.1 mm wide",
    "abstract": "Single-photon detection underpins a wide range of emerging photonic technologies, from quantum information processing and secure communications to photon-starved biomedical imaging. Among the available detector technologies, superconducting nanowire single-photon detectors (SNSPDs) combine high detection efficiency, low noise, and excellent timing resolution, making them a leading platform for photon-counting applications. However, despite decades of materials and fabrication research, detector performance has never been shown to match theoretical performance expectations. Here, we demonstrate for the first time in situ tuning of a detector from its typical, suboptimal operation, to a regime limited only by material quality, allowing the device to reach its intrinsic performance limit. Our approach is based on current-biased superconducting \"rails\" placed on either side of the detector that redistribute current across its width to achieve its peak performance. This technique not only reduces the dark count rate by ten orders of magnitude, but also enables future detectors to overcome the Pearl limit for device width, paving the way for arbitrarily large detectors. We show operation at this intrinsic performance limit for devices up to 0.1 mm wide, and also demonstrate near-unity internal detection efficiency (IDE) at a wavelength of 4um for a 20um-wide detector--a factor of 20 wider than the current state of the art.",
    "authors": [
      "Kristen M. Parzuchowski",
      "Eli Mueller",
      "Bakhrom G. Oripov",
      "Benedikt Hampel",
      "Ravin A. Chowdhury",
      "Sahil R. Patel",
      "Daniel Kuznesof",
      "Emma K. Batson",
      "Ryan Morgenstern",
      "Robert H. Hadfield",
      "Varun B. Verma",
      "Matthew D. Shaw",
      "Jason P. Allmaras",
      "Martin J. Stevens",
      "Alex Gurevich",
      "Adam N. McCaughan"
    ],
    "published": "2026-01-22T13:51:49Z",
    "updated": "2026-02-12T19:04:28Z",
    "categories": [
      "cond-mat.supr-con",
      "physics.app-ph",
      "physics.ins-det",
      "physics.optics",
      "quant-ph"
    ],
    "primary_category": "cond-mat.supr-con"
  },
  {
    "arxiv_id": "2602.12090v1",
    "url": "https://arxiv.org/abs/2602.12090v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12090v1.pdf",
    "title": "Unconditional full vector magnetometry using spin selectivity in Nitrogen Vacancy centers in diamond",
    "abstract": "Quantum sensors based on nitrogen vacancy (NV) centers in diamond have been a central topic in the sensing community for more than a decade. The extraordinary properties at room temperature of the spin system in diamond have made it one of the most prominent quantum platforms for the development of commercial quantum sensors. In particular, the sensitivity of the electronic spin in NV centers has made diamond-based magnetic sensors of special interest for their potential application in medical, industrial or navigation solutions. However, the use of these sensors for universal vector magnetometry was constrained by the need for previous knowledge on the field being measured to fully exploit their benefits. In this work, we show a method to perform unconditional vector magnetometry without the need of external information on the magnetic field, based only on the spatial arrangement of the diamond and the microwave antenna combination. While previous NV-based vector magnetometry methods require partial knowledge of the magnetic field (e.g. a calibrated bias field), we exploit the possibilities of selecting particular directions of the spins in the diamond with elliptically polarized microwave fields. We prove that our method allows to estimate both magnitude and direction of external magnetic fields without further assumptions or constraints.",
    "authors": [
      "Asier Mongelos-Martinez",
      "Jason Tarunesh Francis",
      "Julia Bertero-DiTella",
      "Geza Giedke",
      "Gabriel Molina-Terriza",
      "Ruben Pellicer-Guridi"
    ],
    "published": "2026-02-12T15:42:31Z",
    "updated": "2026-02-12T15:42:31Z",
    "categories": [
      "quant-ph",
      "physics.app-ph",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2602.12086v1",
    "url": "https://arxiv.org/abs/2602.12086v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12086v1.pdf",
    "title": "Solvothermal vapor annealing and environmental control setup with adjustable magnetic field module for GISAXS studies",
    "abstract": "A compact, modular environmental control and solvothermal vapor annealing chamber designed for maintaining a controlled atmosphere with regard to solvent humidity and temperature is presented. The setup allows ex situ and in situ grazing incidence small-angle X-ray scattering (GISAXS) investigations of thin film self-assembly and reorganization. Its modular slotting system enables stable reconfiguration, including the integration of an adjustable magnetic field module. The temperature is maintained via a water-based heating and cooling loop supplemented by resistive elements, and the solvent vapor environment is regulated using a commercial controlled mixing and evaporation unit. The performance of the setup is validated through measurements of fill and quench times together with magnetic field mapping with Gauss meter measurements and finite element simulations. Further, the versatility of the setup is demonstrated with four research examples using the chamber for solvothermal vapor annealing of block copolymer thin films together with lab-based ex situ and in situ GISAXS measurements. The portable new design offers robust environmental control and flexibility for advanced thin film investigations both in the lab and at large scale facilities. The design can be adapted for grazing incidence small-angle neutron scattering, GISANS.",
    "authors": [
      "Christian Kjeldbjerg",
      "Bo Jakobsen",
      "Miriam Varón",
      "Kim Lefmann",
      "Cathrine Frandsen",
      "Dorthe Posselt"
    ],
    "published": "2026-02-12T15:40:38Z",
    "updated": "2026-02-12T15:40:38Z",
    "categories": [
      "cond-mat.soft",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.soft"
  },
  {
    "arxiv_id": "2602.12052v1",
    "url": "https://arxiv.org/abs/2602.12052v1",
    "pdf_url": "https://arxiv.org/pdf/2602.12052v1.pdf",
    "title": "GPU-Accelerated Analytic Simulation of Sparse Signals in Pixelated Time Projection Detector",
    "abstract": "This paper presents a GPU-accelerated simulation package,   TRED, for next-generation neutrino detectors with pixelated   charge readout, leveraging community-driven software ecosystems to   ensure sustainability and extensibility. We introduce two generic   contributions: (i) an effective-charge calculation based on Gaussian   quadrature rules for numerical integration, and (ii) a sparse,   block-binned tensor representation that enables efficient FFT-based   computation of induced signals on readout electrodes for sparsely   activated detector volumes. The former captures sub-grid structure   without requiring dense sampling, while the latter achieves low   memory usage and scalable runtime, as demonstrated in benchmark   studies. The underlying data representation is applicable to   large-scale detectors and to other computational problems involving   sparse activity.",
    "authors": [
      "Yousen Zhang",
      "Brett Viren",
      "Mary Bishai",
      "Sergey Martynenko",
      "Xin Qian",
      "Rado Razakamiandra",
      "Brooke Russell"
    ],
    "published": "2026-02-12T15:17:57Z",
    "updated": "2026-02-12T15:17:57Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.11970v1",
    "url": "https://arxiv.org/abs/2602.11970v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11970v1.pdf",
    "title": "Tuning Optical Properties of FTO via Carbonaceous Al2O3 Microdot Deposition by DC plasma sputtering",
    "abstract": "Fluorine-doped tin oxide (FTO) is a key transparent conductive oxide for photovoltaic and optoelectronic devices, yet its high reflectance limits light-trapping efficiency. This work demonstrates a simple DC plasma sputtering approach to deposit carbonaceous Al2O3 microdots on FTO under controlled Ar, O2, and Ar-O2 atmospheres. For plasma discharge in the normal mode, with plasma density 10^-9 cm^-3 and temperature of 2 eV, Volmer-Weber growth produced discrete microdots whose size and distribution were tuned by gas composition: dense, uniform dots in Ar (approximately 0.89 um radius), agglomerated structures in O2, and intermediate morphologies in mixed atmospheres. Structural analysis confirmed gamma-Al2O3 formation with carbon incorporation, while SEM revealed morphology-driven optical behavior. UV-Vis measurements showed that Ar-O2 coatings achieved the lowest reflectance across the visible range, outperforming bare FTO and other conditions. These findings establish a clear link between sputtering parameters, surface morphology, and optical performance, offering a scalable route to anti-reflective, light-trapping coatings for next-generation solar cells and optoelectronic devices.",
    "authors": [
      "Sarah Salah",
      "Ahmed Atlam",
      "Nagat Elkahwagy",
      "Abdelhamid Elshaer",
      "Mohammed Shihab"
    ],
    "published": "2026-02-12T14:02:41Z",
    "updated": "2026-02-12T14:02:41Z",
    "categories": [
      "physics.plasm-ph",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.11952v1",
    "url": "https://arxiv.org/abs/2602.11952v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11952v1.pdf",
    "title": "Intrabeam Scattering",
    "abstract": "Intrabeam scattering refers to the effects of the Coulomb interaction acting between pairs of charged particles within a bunch in an accelerator. One of the main consequences of intrabeam scattering is a change in the emittances of a bunch: in some circumstances (in particular, in hadron storage rings operating above transition), the transverse and longitudinal emittances may grow over time without limit. This may restrict the performance of machines for which maintaining low beam emittance is an important requirement. In this note, we describe some of the models used to analyse the effects of intrabeam scattering, and present in particular the Piwinski formulae for the emittance growth rates. We compare the predicted changes in emittance with measurements in a number of machines operating in different parameter regimes.",
    "authors": [
      "Andrzej Wolski"
    ],
    "published": "2026-02-12T13:47:22Z",
    "updated": "2026-02-12T13:47:22Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.11884v1",
    "url": "https://arxiv.org/abs/2602.11884v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11884v1.pdf",
    "title": "Signatures of Damping Nonlinear Oscillations by KHI-induced Turbulence in Synthetic Observations",
    "abstract": "Large-amplitude decaying kink oscillations of coronal loops are strongly influenced by nonlinear processes, such as Kelvin-Helmholtz instability (KHI) and turbulence, though comprehensive theory and observational confirmation remain limited. Building on the recently developed theory on nonlinear damping by KHI-induced turbulence in impulsively driven transverse loop oscillations, we investigate its observational signatures using 3D magnetohydrodynamic simulations and forward-modelled EUV images. The simulated oscillations exhibit time-varying frequency shifts and damping rates, which are broadly consistent with nonlinear turbulence-damping theory. Additionally, they exhibit excitation of higher-order modes, slightly increased periods relative to the linear kink period, and reduced displacement amplitudes. These features are generally preserved in synthetic observations, though resolving higher-order modes requires higher spatial resolution than currently available. For loops embedded in a hotter background, hotter channels (e.g., 193 Angstroms) are more sensitive to boundary dynamics, thus their oscillations decay faster with smaller displacements and larger phase shifts than those in cooler channels (e.g., 171 Angstroms). Comparisons of simulated and synthetic oscillations show close agreement at the early stage. At later times, synthetic oscillations exhibit smaller displacements and larger phase shifts, due to turbulence-induced asymmetry in the loop cross-section. Bayesian fitting shows that the initial oscillation amplitude and kink period are robustly constrained, whereas parameters controlling the damping profile are degenerate, indicating that additional observables would aid reliable seismological inference. These results provide a quantitative basis for identifying nonlinear damping and detecting KHI-driven turbulence in transverse loop oscillations.",
    "authors": [
      "Sihui Zhong",
      "Andrew Hillier",
      "Iñigo Arregui"
    ],
    "published": "2026-02-12T12:34:14Z",
    "updated": "2026-02-12T12:34:14Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR",
    "doi": "10.3847/1538-4357/ae4223"
  },
  {
    "arxiv_id": "2602.10132v2",
    "url": "https://arxiv.org/abs/2602.10132v2",
    "pdf_url": "https://arxiv.org/pdf/2602.10132v2.pdf",
    "title": "TokaMark: A Comprehensive Benchmark for MAST Tokamak Plasma Models",
    "abstract": "Development and operation of commercially viable fusion energy reactors such as tokamaks require accurate predictions of plasma dynamics from sparse, noisy, and incomplete sensors readings. The complexity of the underlying physics and the heterogeneity of experimental data pose formidable challenges for conventional numerical methods, while simultaneously highlight the promise of modern data-native AI approaches. A major obstacle in realizing this potential is, however, the lack of curated, openly available datasets and standardized benchmarks. Existing fusion datasets are scarce, fragmented across institutions, facility-specific, and inconsistently annotated, which limits reproducibility and prevents a fair and scalable comparison of AI approaches. In this paper, we introduce TokaMark, a structured benchmark to evaluate AI models on real experimental data collected from the Mega Ampere Spherical Tokamak (MAST). TokaMark provides a comprehensive suite of tools designed to (i) unify access to multi-modal heterogeneous fusion data, and (ii) harmonize formats, metadata, temporal alignment and evaluation protocols to enable consistent cross-model and cross-task comparisons. The benchmark includes a curated list of 14 tasks spanning a range of physical mechanisms, exploiting a variety of diagnostics and covering multiple operational use cases. A baseline model is provided to facilitate transparent comparison and validation within a unified framework. By establishing a unified benchmark for both the fusion and AI-for-science communities, TokaMark aims to accelerate progress in data-driven AI-based plasma modeling, contributing to the broader goal of achieving sustainable and stable fusion energy. The benchmark, documentation, and tooling will be fully open sourced upon acceptance to encourage community adoption and contribution.",
    "authors": [
      "Cécile Rousseau",
      "Samuel Jackson",
      "Rodrigo H. Ordonez-Hurtado",
      "Nicola C. Amorisco",
      "Tobia Boschi",
      "George K. Holt",
      "Andrea Loreti",
      "Eszter Székely",
      "Alexander Whittle",
      "Adriano Agnello",
      "Stanislas Pamela",
      "Alessandra Pascale",
      "Robert Akers",
      "Juan Bernabe Moreno",
      "Sue Thorne",
      "Mykhaylo Zayats"
    ],
    "published": "2026-02-05T16:49:44Z",
    "updated": "2026-02-12T09:55:27Z",
    "categories": [
      "physics.plasm-ph",
      "cs.AI"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.11763v1",
    "url": "https://arxiv.org/abs/2602.11763v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11763v1.pdf",
    "title": "Phase-Space Topology and Spectral Flow in Screened Magnetized Plasmas",
    "abstract": "Topological wave phenomena in continuous media are fundamentally challenged by unbounded spectra and the absence of a compact Brillouin zone, which obstruct conventional bulk--interface formulations. We develop a unified phase-space framework for screened magnetized plasma based on a pseudo-Hermitian formulation with a positive-definite metric, enabling a generalized Schrödinger description and a Weyl-symbol analysis of the bulk generator. We show that the bulk symbol hosts isolated band degeneracies acting as Berry--Chern monopoles, including a higher-order spin-1 degeneracy with topological charge $+2$ that generically splits into two spin-$\\tfrac{1}{2}$ Weyl points under symmetry breaking. To characterize topology in this noncompact setting, we introduce a strip-gap Chern number associated with finite real-frequency strips of the bulk spectrum, extending band Chern topology to continuum systems. This invariant governs the spectral flow of interface modes induced by spatial variations of the magnetic field and establishes a bulk--interface correspondence at the level of phase-space symbols. By solving the interface eigenvalue problem, we demonstrate that the net spectral flow across the strip gap is determined by the enclosed monopole charge. We further show that this correspondence persists under collisional damping, provided that a finite strip gap remains and no exceptional points enter it. Our results provide a systematic phase-space framework for topological wave transport in continuous media beyond compact-band and idealized Hermitian settings.",
    "authors": [
      "Xianhao Rao",
      "Adil Yolbarsop",
      "Hong Li",
      "Wandong Liu"
    ],
    "published": "2026-02-12T09:43:30Z",
    "updated": "2026-02-12T09:43:30Z",
    "categories": [
      "cond-mat.mes-hall",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.mes-hall"
  },
  {
    "arxiv_id": "2507.15323v2",
    "url": "https://arxiv.org/abs/2507.15323v2",
    "pdf_url": "https://arxiv.org/pdf/2507.15323v2.pdf",
    "title": "Improving terahertz-detection sensitivity of 8x8 FET arrays through liquid-nitrogen cooling in a compact low-noise cryostat",
    "abstract": "We show that the sensitivity of antenna-coupled field-effect transistors (FETs) to terahertz (THz) radiation improves continuously with decreasing temperature. The noise-equivalent power (NEP) of 540 GHz patch-antenna-coupled FETs decreases as temperature reduces to 20 K. We project NEP values approaching 1 to 2 pW/sqrt(Hz) under efficient power coupling conditions (e.g., using a superstrate Si-lens), which is comparable to superconducting niobium transition-edge sensors (TESs) at 4 K. Building on these findings, a compact, low-noise, liquid-nitrogen-cooled (77 K) FET-based direct (incoherent) THz-power sensing system} for spectroscopy applications was realized. Here, an 8x8 pixel-binned detector array fabricated in a commercial 65-nm Si-CMOS process, was optimized for operation in the 2.85 to 3.4 THz band. Characterization was performed in the focal plane of a 2.85-THz quantum-cascade laser delivering approx. 2~mW of THz power. A linear dynamic range exceeding 67 dB was achieved without saturation (for 1~Hz-detection bandwidth). The system provides a -3 dB readout bandwidth of 5 MHz, exceeding that of conventional thermal detectors (typically 1 kHz). Combined with its broad temperature operability 20 K to 300 K and compact design, the system is particularly well suited for space- and payload-constrained platforms such as balloon- and satellite-based missions, where deep cryogenic cooling is impractical.",
    "authors": [
      "Jakob Holstein",
      "Nicholas K. North",
      "Arne Hof",
      "Sanchit Kondawar",
      "Dmytro B. But",
      "Mohammed Salih",
      "Lianhe Li",
      "Edmund H. Linfield",
      "A. Giles Davies",
      "Joshua R. Freeman",
      "Alexander Valavanis",
      "Alvydas Lisauskas",
      "Hartmut G. Roskos"
    ],
    "published": "2025-07-21T07:29:06Z",
    "updated": "2026-02-12T09:15:18Z",
    "categories": [
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.app-ph"
  },
  {
    "arxiv_id": "2602.11728v1",
    "url": "https://arxiv.org/abs/2602.11728v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11728v1.pdf",
    "title": "Beyond One-Thousandth Energy Resolution with an AlMn TES Detector",
    "abstract": "The superconducting Transition-Edge Sensor (TES) is a critical technology for next-generation X-ray spectrometers, known for its exceptional energy resolution. In the last decade, TESs based on AlMn alloy films have been extensively used in several cosmic microwave background (CMB) experiments. The advantages of simple fabrication process and easily tunable critical temperature make them an alternative to bilayer TESs. However, they have rarely been applied to X-ray detection until now. We developed an annular AlMn TES for X-ray detection and tested it in a dilution refrigerator with a Superconducting Quantum Interference Device (SQUID) amplifier, achieving an Full Width at Half Maximum (FWHM) of 12.1 +- 0.3 eV at 17.48 keV. To the best of our knowledge, this is the first demonstration of an AlMn TES achieving an energy resolution below 0.1%, highlighting its potential for high-resolution X-ray detection.",
    "authors": [
      "Liangpeng Xie",
      "Yifei Zhang",
      "Zhengwei Li",
      "Zhouhui Liu",
      "Shibo Shu",
      "Junjie Zhou",
      "Xufang Li",
      "Haoyu Li",
      "He Gao",
      "Yudong Gu",
      "Xuefeng Lu",
      "Yong Zhao",
      "Congzhan Liu"
    ],
    "published": "2026-02-12T08:52:29Z",
    "updated": "2026-02-12T08:52:29Z",
    "categories": [
      "astro-ph.IM",
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2601.19865v2",
    "url": "https://arxiv.org/abs/2601.19865v2",
    "pdf_url": "https://arxiv.org/pdf/2601.19865v2.pdf",
    "title": "Laboratory Tests of Laser Control of Electron Beams for Future Colliders",
    "abstract": "Laser-driven Compton backscattering (CBS) has been proposed as method for controlling the intensity of colliding bunches in the FCC-ee so as to avoid the flip-flop instability caused by intensity asymmetry in colliding bunches. Laser-based collimation has also been proposed as an indestructible collimator for high-intensity electron beams. We have initiated a laboratory-based test program of these concepts with the E344 experiment at FACET-II. In this paper, we describe simulations of laser-beam interactions at FACET-II and the relevant scaling for FCC-ee. We also describe the experimental setup and diagnostics that will be used to make the measurements at FACET-II.",
    "authors": [
      "Claire Munting",
      "Peter Kicsiny",
      "Edoardo Barbi",
      "Noe Gonzalez",
      "Spencer Gessner",
      "Illya Drebot"
    ],
    "published": "2026-01-27T18:23:38Z",
    "updated": "2026-02-12T07:11:24Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.11597v1",
    "url": "https://arxiv.org/abs/2602.11597v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11597v1.pdf",
    "title": "Performance and pulse shape discrimination of glass scintillator SG101 for neutron detection",
    "abstract": "We present a detailed characterization of the thermal neutron sensitive transparent glass scintillator SG101, benchmarked against the conventional LiF ZnS(Ag)based scintillator EJ426. The detection efficiency, energy resolution, and pulse shape discrimination (PSD) performance ofSG101 were evaluated under AmBe neutron irradiation. When coupled with organic scintillators(EJ200 or EJ276),the SG101 EJ200 system achieves a figure of merit (FOM) of 3.81 for thermal neutron/gamma separation, while the SG101 EJ276 configuration resolves three distinct particle populations gamma rays, fast neutrons, and thermal neutrons with FOM values of 3.46 and2.21, respectively. Correlation analysis reveals that the number of fast thermal neutron coincidence events significantly exceeds the accidental background, and the count of gamma fast thermal neutron triple-coincidence events is also far higher than the expected accidental rate, confirming significant physical correlations for both event types within a 100 us time window. These results demonstrate that SG101 is a promising candidate for applications requiring high-efficiency thermal neutron detection and precise event tagging coupling with a scintillator with PSD approach",
    "authors": [
      "Yuhang Liu",
      "Fengpeng An",
      "Guang Luo",
      "Wei Wang",
      "Wei Wei",
      "Xuesong Zhang",
      "Dixiao Lu",
      "Xiaohao Yin"
    ],
    "published": "2026-02-12T05:28:06Z",
    "updated": "2026-02-12T05:28:06Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2505.11361v4",
    "url": "https://arxiv.org/abs/2505.11361v4",
    "pdf_url": "https://arxiv.org/pdf/2505.11361v4.pdf",
    "title": "Magnetic dipole-dipole transition for scintillation quenching",
    "abstract": "A magnetic dipole-dipole interaction is proposed as a scintillation quenching mechanism. The interaction rate follows $R^{-6}$ as the electric dipole-dipole interaction in F$\\mathrm{\\ddot{o}}$ster resonance energy transfer theory. The proposed mechanism causes a long-range resonance energy transfer, and the resonance condition is that the spins of donor and acceptor electrons both flip, and the energy level differences are the same. The new mechanism is distinct to the known spin-orbit coupling induced intersystem crossing, and it can enhance the overall intersystem crossing rate. When oxygen or organic molecules including heavy elements are dissolved in a liquid scintillator, these requirements are possible to be satisfied. The proposal in the paper adds a new approach for scintillation quenching in liquid scintillators.",
    "authors": [
      "Zhe Wang"
    ],
    "published": "2025-05-16T15:28:56Z",
    "updated": "2026-02-12T02:15:11Z",
    "categories": [
      "physics.ins-det",
      "physics.chem-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.11422v1",
    "url": "https://arxiv.org/abs/2602.11422v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11422v1.pdf",
    "title": "Investigation of Toroidal Rotation Effects on Spherical Torus Equilibria using the Fast Spectral Solver VEQ-R",
    "abstract": "Standard reduced models often fail to adequately describe the complex geometric response of tokamak plasmas to strong toroidal rotation. In this work, we present VEQ-R, a computationally efficient spectral solver designed to calculate fixed-boundary equilibria with arbitrary toroidal flow. In contrast to computationally intensive grid-based codes, our model employs a 12-parameter shifted Chebyshev spectral expansion to explicitly resolve radial variations in high-order shaping profiles--such as dynamic elongation and triangularity. This capability allows the solver to accurately capture differential flux surface distortions (non-rigid effects) even in challenging sonic regimes ($M \\sim 1.0$). By synergizing this compact variational formulation with a novel ``Matrix-Kernel'' acceleration technique, we transform the problem into pre-computed algebraic matrix operations. This approach achieves convergence in approximately 5 ms, maintaining exceptional geometric fidelity compared to high-resolution benchmarks while balancing speed and accuracy. Our analysis reveals that rotation-induced flux compression leads to a monotonic decrease in the core safety factor $q_0$, pushing it dangerously close to unity--a structural deformation mechanism effectively captured by this approximate yet robust solver.",
    "authors": [
      "Xingyu Li",
      "Huasheng Xie",
      "Lai Wei",
      "Zhengxiong Wang"
    ],
    "published": "2026-02-11T22:50:25Z",
    "updated": "2026-02-11T22:50:25Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.11415v1",
    "url": "https://arxiv.org/abs/2602.11415v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11415v1.pdf",
    "title": "Fermilab PIP II machine protection system digitized data noise elimination scheme and its FPGA implementation",
    "abstract": "In Fermilab's PIP-II machine protection system, beam loss signals from various detectors are digitized at 125 MS/s. Noise from both high-frequency sources and low-frequency 60 Hz AC power equipment can contaminate the data. To suppress noise across these ranges especially 60 Hz and its harmonics, which overlap with beam loss signal frequencies advanced digital processing beyond standard filtering is required. Several real-time functional blocks were simulated and tested on an FPGA: (1) a dual time-constant discharging integrator filter, (2) a de-ripple baseline extraction and storage block, and (3) a fast-recovery discharging integrator. The nonlinear IIR integrator filter removes high-frequency noise and feeds into the baseline extractor. Upon detecting abrupt beam loss, it switches to a longer time constant to prevent baseline distortion. The de-ripple block calculates a valid baseline by averaging over multiple 60 Hz periods, storing results in a 4096-word FPGA RAM. This baseline is subtracted from raw data before integration by the fast-recovery block, which resets quickly after use. All blocks achieved expected performance.",
    "authors": [
      "J. Wu",
      "A. Warner"
    ],
    "published": "2026-02-11T22:36:36Z",
    "updated": "2026-02-11T22:36:36Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "0.18429/JACoW-IBIC2025-MOPMO45"
  },
  {
    "arxiv_id": "2602.11375v1",
    "url": "https://arxiv.org/abs/2602.11375v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11375v1.pdf",
    "title": "Using a 4-megapixel hybrid photon counting detector for fast, lab-based nanoscale x-ray tomography",
    "abstract": "Hybrid photon counting detectors (HPCDs) have unlocked new capabilities for x-ray-based measurements at synchrotrons around the world in the last 30 years. By leveraging independently optimized sensor and readout layers, they offer high quantum efficiency ($> 80 \\%$), ultra-low dark counts, sub-pixel point-spread function, and high count rates ($> 10^{6}$ counts per pixel per second). Furthermore, their small pixel size and large active area endow them with excellent coverage and resolution for both real-space and reciprocal space imaging. Here, we demonstrate that HPCDs are also well-suited for laboratory-based nanoscale x-ray tomography (nano-xCT). We perform nano-xCT on an integrated circuit fabricated at the 130-nm node and produce a 3D reconstruction with 40 times more photons collected 20 times faster than in this group's previous work, for an overall speedup of 800$\\times$. We review the technical considerations of using an HPCD for tabletop tomography. We quantify our reconstruction image quality using well-established metrics, including the modulation transfer function (MTF), Fourier shell correlation (FSC), and contrast-to-noise (CNR), to validate our choice of experimental parameters that provide sufficient resolution and imaging speed. Using these metrics, we determine that even under current experimental conditions, 160 nm wiring features are reconstructed at 75-80 nm spatial resolution.",
    "authors": [
      "Jordan Fonseca",
      "Zachary H. Levine",
      "Joseph W. Fowler",
      "Felix H. Kim",
      "Galen O'Neil",
      "Nathan J. Ortiz",
      "John Henry Scott",
      "Daniel S. Swetz",
      "Paul Szypryt",
      "Andras E. Vladar",
      "Nathan Nakamura"
    ],
    "published": "2026-02-11T21:08:40Z",
    "updated": "2026-02-11T21:08:40Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.11359v1",
    "url": "https://arxiv.org/abs/2602.11359v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11359v1.pdf",
    "title": "High-level hadronic tau lepton triggers of the CMS experiment in proton-proton collisions at $\\sqrt{s}$ = 13.6 TeV",
    "abstract": "The trigger system of the CMS detector is pivotal in the acquisition of data for physics measurements and searches. Studies of final states characterized by hadronic decays of tau leptons require the reconstruction and the identification of genuine tau leptons against quark- and gluon-initiated jets at the trigger level. This is a difficult task, particularly as improvements to the LHC have resulted in an increased number of interactions per bunch crossing in recent years. To address this challenge, a series of machine-learning algorithms with high identification efficiency and low computational cost have been incorporated into the high-level trigger for hadronically decaying tau leptons. In this paper, these developments and the trigger performance are summarized using data collected by the CMS experiment in proton-proton collisions at $\\sqrt{s}$ = 13.6 TeV in 2022$-$2023, corresponding to an integrated luminosity of 62 fb$^{-1}$.",
    "authors": [
      "CMS Collaboration"
    ],
    "published": "2026-02-11T20:46:53Z",
    "updated": "2026-02-11T20:46:53Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.07224v2",
    "url": "https://arxiv.org/abs/2510.07224v2",
    "pdf_url": "https://arxiv.org/pdf/2510.07224v2.pdf",
    "title": "Sextupole reduction via chaos suppression at the National Synchrotron Light Source II",
    "abstract": "We revisit the nonlinear lattice design approach for the National Synchrotron Light Source II (NSLS-II) storage ring. By suppressing chaos, we identify alternative sextupole configurations to the original design, which relied on the conventional strategy of simultaneously minimizing Resonance Driving Terms (RDT) and Amplitude-Dependent Detuning (ADD). These alternatives achieve comparable performance while requiring fewer sextupoles. A detailed comparison of two representative solutions is presented and supported by experimental validation. Our results show that the dynamic aperture correlates more strongly with global chaos than with individual RDTs, and that the importance of minimizing ADD may have been overstated in earlier design strategies.",
    "authors": [
      "Yongjun Li",
      "Minghao Song",
      "Yoshiteru Hidaka",
      "Victor Smaluk",
      "Timur Shaftan"
    ],
    "published": "2025-10-08T16:57:36Z",
    "updated": "2026-02-11T20:13:43Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.04580v2",
    "url": "https://arxiv.org/abs/2602.04580v2",
    "pdf_url": "https://arxiv.org/pdf/2602.04580v2.pdf",
    "title": "Doberman: a modular and distributed slow control system for small- to medium-scale experiments",
    "abstract": "We present Doberman (Detector OBsERving and Monitoring ApplicatioN), a lightweight, modular, and open-source slow control system designed for small-to medium-scale physics experiments. Doberman addresses the gap between heavyweight industrial SCADA frameworks and ad hoc laboratory solutions by providing a flexible software architecture that supports heterogeneous instrumentation, distributed deployment, automated control, and robust alarm handling. The web-based graphical user interface Doberview provides live and continuously updated visualization, configuration, and control of the entire experiment, supporting both routine operation and rapid response to exceptional conditions. Doberman has been deployed and validated in multiple experimental setups, ranging from a remotely operated underground gamma-ray spectrometer to a large, highly instrumented liquid xenon test facility with several hundred monitored quantities.   Doberman and Doberview are released under permissive open-source licenses, and the software, documentation, and example device integrations are publicly available.",
    "authors": [
      "Jaron Grigat",
      "Darryl Masson",
      "Marc Schumann"
    ],
    "published": "2026-02-04T14:06:28Z",
    "updated": "2026-02-11T17:46:09Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.11053v1",
    "url": "https://arxiv.org/abs/2602.11053v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11053v1.pdf",
    "title": "Collisionless relaxation as the origin of the anisotropic, non-thermal, and multi-temperature momentum distributions observed in space plasmas",
    "abstract": "Anisotropic, non-thermal, and multi-temperature distributed particle momenta are commonly observed in collisionless space plasmas, such as the solar wind. Using Liouville's theorem, we argue that anisotropic compression or expansion of the plasma, followed by a relaxation of the resulting anisotropic stress must lead to non-equilibrium states that are either anisotropic, non-thermal distribution functions, different electron and ion temperatures, or a combination of these effects. We present arguments showing that a plasma in thermal equilibrium undergoing anisotropic compression or expansion cannot return to thermal equilibrium in the absence of particle collisions. Since most astrophysical plasmas are practically collisionless and experience significant anisotropic compression or expansion, we expect anisotropic, non-thermal, and multi-temperature particle distributions to be ubiquitous, in agreement with solar wind measurements.",
    "authors": [
      "Torsten Enßlin",
      "Christoph Pfrommer"
    ],
    "published": "2026-02-11T17:20:13Z",
    "updated": "2026-02-11T17:20:13Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.11228v1",
    "url": "https://arxiv.org/abs/2602.11228v1",
    "pdf_url": "https://arxiv.org/pdf/2602.11228v1.pdf",
    "title": "Rotation catalyzed chiral magnetovortical instability",
    "abstract": "We demonstrate that a background rotation significantly catalyzes the chiral magnetovortical instability in chiral magnetohydrodynamics. The rotation splits the linearly polarized Alfven wave into two circularly polarized magneto-Coriolis waves, one of which exhibits a lower frequency than the original Alfven wave. We find that this low-frequency magneto-Coriolis wave is always unstable in the presence of even a weak chiral vortical effect. This instability may enable new dynamo mechanism applicable to various rotating chiral plasmas.",
    "authors": [
      "Shuai Wang",
      "Xu-Guang Huang"
    ],
    "published": "2026-02-11T14:19:31Z",
    "updated": "2026-02-11T14:19:31Z",
    "categories": [
      "nucl-th",
      "astro-ph.HE",
      "hep-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "nucl-th"
  },
  {
    "arxiv_id": "2602.10836v1",
    "url": "https://arxiv.org/abs/2602.10836v1",
    "pdf_url": "https://arxiv.org/pdf/2602.10836v1.pdf",
    "title": "Charged particle motion in a strong magnetic field: The first order expansion",
    "abstract": "We provide a mathematically rigorous derivation of the first order expansion of the motion of a charged particle in a strong magnetic field. In contrast to the derivations that can be found in the physics literature we solely assume throughout that the magnetic field is strong. In particular we do not need to make any structural assumptions on the particle motion, such as the gyroradius being small in comparison to the magnetic length scale. Instead, some of the additional assumptions which are usually made in the physics literature turn out to be an a posteriori consequence in our approach. Our approach further justifies the utilisation of the guiding centre approximation at \"bounce points\" within magnetic mirrors, a situation which violates the usual assumptions which are made in the physics literature when deriving the guiding centre approximation.",
    "authors": [
      "Ugo Boscain",
      "Wadim Gerner"
    ],
    "published": "2026-02-11T13:22:08Z",
    "updated": "2026-02-11T13:22:08Z",
    "categories": [
      "math-ph",
      "math.CA",
      "physics.plasm-ph"
    ],
    "primary_category": "math-ph"
  },
  {
    "arxiv_id": "2602.10828v1",
    "url": "https://arxiv.org/abs/2602.10828v1",
    "pdf_url": "https://arxiv.org/pdf/2602.10828v1.pdf",
    "title": "A Helical-Deflector-Based Radio-Frequency Spiral Scanning System for keV Energy Electrons",
    "abstract": "We present the design, modeling, and experimental validation of a radio-frequency based time-to-position conversion system for keV electrons incorporating a helical deflector operating in the 400-1000 MHz range. The device performs circular deflection of the electrons when driven by a single RF frequency and enables spiral scanning when two phase-locked RF voltages with slightly different frequencies are applied. The superposition of the two phase-locked RF voltages produces an amplitude-beating field whose slowly varying envelope modulates the deflection radius, transforming the circular scan into a controlled spiral on the detector plane. A detailed theoretical model describing the electron dynamics under two phase-locked RF voltages with different frequencies was derived, yielding analytical expressions for the transverse velocity and radius-vector components at the deflector exit. Spiral scanning will allow measurements with picosecond resolution in a time range 1-2 orders of magnitude larger than the period of the circular scanning.",
    "authors": [
      "Vanik Kakoyan",
      "Simon Zhamkochyan",
      "Vardan Bardakhchyan",
      "Sergey Abrahamyan",
      "Amur Margaryan",
      "Aram Kakoyan",
      "Hasmik Rostomyan",
      "Anna Safaryan",
      "Gagik Sughyan",
      "Hayk Gevorgyan",
      "Artashes Papyan",
      "Martin Pinamyan",
      "Mikael Ivanyan",
      "Satoshi N. Nakamura",
      "John Annand",
      "Kenneth Livingston",
      "Rachel Montgomery",
      "Patrick Achenbach",
      "Josef Pochodzalla",
      "Dimiter L. Balabanski",
      "Ani Aprahamian",
      "Viatcheslav Sharyy",
      "Dominique Yvon",
      "Hayk Elbakyan"
    ],
    "published": "2026-02-11T13:15:07Z",
    "updated": "2026-02-11T13:15:07Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.08313v2",
    "url": "https://arxiv.org/abs/2601.08313v2",
    "pdf_url": "https://arxiv.org/pdf/2601.08313v2.pdf",
    "title": "Interstellar Medium Modulation of Nonlinear Kinetic Alfvén Morphology in Structured Galactic Environments",
    "abstract": "We present a spatially dependent framework for the existence and propagation of nonlinear kinetic Alfvén (KA) structures in the interstellar medium (ISM). Using a multi-component analytical model that incorporates the diffuse warm ionized medium together with localized H II regions, supernova remnants (SNR), and stellar-wind bubbles (SWB), we derive location-dependent coefficients governing KA dispersion and nonlinearity. The reductive perturbation method is applied to obtain Korteweg-de Vries (KdV) equations, enabling the characterization of solitons under realistic astrophysical conditions. Numerical analysis demonstrates how superthermality, plasma $β$, temperature, and density gradients modulate soliton amplitude, width, and stability. Our results reveal distinct exclusion zones (EZs) for KA solitons in high-$β$ HII regions and SWB/SNR interiors, as well as ultra low-$β$ regions near central pulsar wind nebulae. While H II regions exhibit simple Gaussian-driven depletions, the complex ``hole-and-shell\" morphologies of SWBs and SNRs imprint sharp spatial variations and discontinuities on soliton properties. This study establishes a direct link between macroscopic ISM morphology, ion-kinetic scale dissipation, and the emergence of coherent Alfvénic activity, with implications for radio scattering, pulsar scintillation, and fine-scale signatures in astrophysical observations.",
    "authors": [
      "Manpreet Singh",
      "Siming Liu",
      "N. S. Saini"
    ],
    "published": "2026-01-13T08:10:48Z",
    "updated": "2026-02-11T12:29:55Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.11755v4",
    "url": "https://arxiv.org/abs/2507.11755v4",
    "pdf_url": "https://arxiv.org/pdf/2507.11755v4.pdf",
    "title": "Kinetic renormalization of auroral turbulence",
    "abstract": "Driven-dissipative systems often exhibit self-organization in the form of coherent dissipative structures. However, observing such critical states in natural plasmas remains elusive, leading to the traditional view that the fine structure of Earth's auroral ionosphere is shaped by local turbulent flows. Here we report the discovery of a self-organizing regime in Earth's ionosphere. We identify this by modeling the sum of saturation electric fields in the turbulent auroral electrojets as a stochastic variable that renormalizes into noise-enabled transport, via explicitly derived Bohm diffusion. This constitutes an effective field-theory for Farley-Buneman turbulence in the Martin-Siggia-Rose formalism for renormalization group theory, for which we provide strong empirical evidence. Using a composite radar-GPS power spectrum of plasma turbulence, we resolve a scale-invariant cascade that exhibits a characteristic kinetic Alfvén $k^{-8/3}$-signature across four orders of magnitude in $k$. What is more, a large statistical analysis of how the turbulence responds to magnetospheric driving reveals a clear tendency for the observed number density of turbulent waves to scale linearly with driving power, matching the predictions made by our field theory's overdamped equations of motion, which offer closed-form calculations of macroscopic transport relations that are uniquely suitable for sub-grid parameterization in space weather modeling. This establishes geospace storms as opportunities to observe non-equilibrium phase transitions imposing global constraints on collision-dominated systems.",
    "authors": [
      "Magnus F Ivarsen",
      "Kaili Song",
      "Luca Spogli",
      "Jean-Pierre St-Maurice",
      "Brian Pitzel",
      "Saif Marei",
      "Devin R Huyghebaert",
      "Satoshi Kasahara",
      "Kunihiro Keika",
      "Yoshizumi Miyoshi",
      "Tomo Hori",
      "David R Themens",
      "Yoichi Kazama",
      "Shiang-Yu Wang",
      "Ayako Matsuoka",
      "Iku Shinohara",
      "Atsuki Shinbori",
      "Kazuhiro Yamamoto",
      "Takefumi Mitani",
      "Shoichiro Yokota",
      "P. T. Jayachandran",
      "Glenn C Hussey"
    ],
    "published": "2025-07-15T21:33:42Z",
    "updated": "2026-02-11T12:07:13Z",
    "categories": [
      "physics.space-ph",
      "nlin.AO",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2602.10759v1",
    "url": "https://arxiv.org/abs/2602.10759v1",
    "pdf_url": "https://arxiv.org/pdf/2602.10759v1.pdf",
    "title": "Application of a high-precision distributed uranium source for determining the effective mass and volume of a HPGe detector",
    "abstract": "A distributed uranium source with the accurately certified activity of 238U has been used to verify the effective mass of the HPGe detector intended for the νGeN neutrino experiment. The source, dissolved in nitric acid, provides homogeneous irradiation of the detector crystal allowing the study of its mass and volume. The experimental spectra obtained with the distributed source have been compared to the detailed Geant4 Monte Carlo simulations. The measured counting rates of several gamma-lines agree with the simulated efficiencies, confirming that the detector mass and volume coincide with the manufacturer specifications. The results demonstrate the applicability of such sources for mass calibration of HPGe detectors.",
    "authors": [
      "A. S. Barabash",
      "S. Evseev",
      "D. Filosofov",
      "V. Kazalov",
      "T. Khussainov",
      "A. Lubashevskiy",
      "N. D. Mokhine",
      "D. Ponomarev",
      "S. Rozov",
      "S. Vasilyev",
      "M. Vorobyeva",
      "E. Yakushev",
      "V. I. Yumatov"
    ],
    "published": "2026-02-11T11:42:01Z",
    "updated": "2026-02-11T11:42:01Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.10709v1",
    "url": "https://arxiv.org/abs/2602.10709v1",
    "pdf_url": "https://arxiv.org/pdf/2602.10709v1.pdf",
    "title": "Generation and control of Doppler harmonics approaching $10^{22}\\textrm{W/cm}^2$ on plasma mirrors",
    "abstract": "In this letter, we report Doppler harmonic generation with a relativistic plasma mirror at unprecedented intensities $>10^{21} ~\\textrm{W/cm}^2$ using a PetaWatt-class laser. We show that beyond a few $10^{21} ~\\textrm{W/cm}^2$ a precise control of the laser contrast at the sub-picosecond time scale becomes essential to drive the efficient generation of high-order harmonics. Such control is paramount for deploying plasma mirrors in high-field applications at PetaWatt-class laser facilities, including, for instance, their use as intensity boosters in the pursuit of the strong-field regime of quantum electrodynamics.",
    "authors": [
      "Baptiste Groussin",
      "Philipp Sikorski",
      "Aodhan McIlvenny",
      "Kosta Oubrerie",
      "Pierre Bartoli",
      "Lieselotte Obst-Huebl",
      "Anthony Vazquez",
      "Lulu Russell",
      "Tirtha Mandal",
      "Kei Nakamura",
      "Anthony J. Gonsalves",
      "Cameron G. R. Geddes",
      "Luca Fedeli",
      "Henri Vincenti",
      "Adrien Leblanc"
    ],
    "published": "2026-02-11T10:11:51Z",
    "updated": "2026-02-11T10:11:51Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.10681v1",
    "url": "https://arxiv.org/abs/2602.10681v1",
    "pdf_url": "https://arxiv.org/pdf/2602.10681v1.pdf",
    "title": "High-voltage generation system for a traveling-wave Stark decelerator",
    "abstract": "In this paper we describe the high-voltage generation system we have developed for a traveling-wave Stark decelerator (TWSD). The TWSD can reduce the forward velocity of a molecular beam of heavy neutral polar molecules such as strontium monofluoride (SrF) and barium monofluoride (BaF) from $\\sim$ 200 m/s down to $\\sim$ 6 m/s. The main motivation for the development of this device is the increased sensitivity from precision spectroscopy of the decelerated molecules to test fundamental physics. The high-voltage generation system can produce eight pulsed sinusoidal waveforms with a maximum amplitude of 10 kV and a linear frequency sweep from 16.7 kHz down to 500 Hz over the span of 40 ms at a repetition rate of 10 Hz. The eight waveforms are phase-offset to each other by 45 degrees. To slow down the heavy molecules, the decelerator is required to have a length of $\\sim$ 4 m, which results in a significant capacitive coupling between adjacent channels of $\\sim$ 160 pF. As a consequence, the control and stability of the waveforms is extra challenging. We designed a method that compensates for the frequency-dependent coupling between the eight channels. Allowing for amplitude and phase-offsets that do not deviate more than 1% and 2 degrees, respectively, from their design values during the frequency sweep. The system outperforms commercially available options in terms of stability, output voltage amplitude, cost and ease of maintenance. This approach is also relevant for other fields where precise control of high-voltage waveforms is required, such as particle accelerator physics, plasma physics and mass spectroscopy.",
    "authors": [
      "Lucas van Sloten",
      "Leo Huisman",
      "Steven Hoekstra"
    ],
    "published": "2026-02-11T09:32:47Z",
    "updated": "2026-02-11T09:32:47Z",
    "categories": [
      "physics.atom-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2602.10642v1",
    "url": "https://arxiv.org/abs/2602.10642v1",
    "pdf_url": "https://arxiv.org/pdf/2602.10642v1.pdf",
    "title": "Fully nonlinear phenomenology of the bump-on-tail (BOT) instability with drag, diffusion and Krook relaxation",
    "abstract": "Energetic-particle-driven modes in magnetically confined fusion plasmas often exhibit nonlinear frequency sweeping, reflecting complex wave-particle interactions near marginal stability. While the bump-on-tail (BOT) instability within the Berk-Breizman framework has served as a canonical model for understanding such phenomena, a unified nonlinear description remains incomplete when drag, diffusion, and Krook relaxation act simultaneously. In this work, we present a comprehensive numerical investigation of the BOT instability that explicitly retains all three collision operators together with external wave damping. Using a validated characteristic-based BOT code, we systematically scan the multi-dimensional collision parameter space and construct nonlinear regime maps and bifurcation diagrams. To organize the rich dynamics, we introduce a two-level categorization that combines global wave-energy evolution with chirping subtypes identified from spectral morphology. We find that diffusion and Krook relaxation regularize the nonlinear dynamics and promote ordered transitions from chaotic behaviors to periodic oscillations and steady saturation as collision strength increases, with the saturation level decreasing approximately exponentially with external damping. In contrast, drag alone does not admit steady solutions and instead drives persistent or chaotic chirping through convective deformation of resonant phase-space structures. When drag is combined with diffusion or Krook relaxation, clear transition sequences emerge: increasing drag breaks hole-clump symmetry, broadens the effective resonance region, and drives systematic transitions from transient to intermittent and persistent chirping.",
    "authors": [
      "Shi-Jie Zhang",
      "Lei Chang",
      "Zhao-Ju Bo",
      "Zhi-Song Qu",
      "Ilya Zadiriev",
      "Elena Kralkina",
      "Shogo Isayama",
      "Sin-Jae You",
      "Zi-Chen Kan",
      "Ji-Kai Sun",
      "Jing-Jing Ma"
    ],
    "published": "2026-02-11T08:43:48Z",
    "updated": "2026-02-11T08:43:48Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.10596v1",
    "url": "https://arxiv.org/abs/2602.10596v1",
    "pdf_url": "https://arxiv.org/pdf/2602.10596v1.pdf",
    "title": "The high speed analog optical readout system designed for low temperature experiments",
    "abstract": "For low-temperature experiments such as liquid xenon dark matter detectors, it is crucial to read out detector signals from cryostats. Traditionally, photoelectrical signals are transmitted from the cryogenic region to the outside using coaxial cables through vacuum feedthroughs on the cryostats. In this paper, we investigate an analog optical transmission method in which the raw electrical signals are converted into optical signals with light intensity linearly proportional to the electrical amplitude, transmitted out of the cryogenic environment through optical fiber, and subsequently converted back into electrical signals by photoelectric devices while preserving the signal waveform. This new approach offers advantages, including low attenuation over long-distance transmission and reduced crosstalk across the feedthroughs. Additionally, the low-temperature optical wavelength multiplexing scheme has been investigated and applied, increasing the transmission capability of a single fiber. At -100 degree Celsius, the proposed analog optical readout system achieves a -3dB bandwidth of larger than 150MHz, a dynamic range of up to 500mV, and a low cryogenic-region power consumption of 70mW per channel, demonstrating its strong potential for low-temperature experiments.",
    "authors": [
      "Z. Zhou",
      "W. Wu",
      "J. Tang",
      "Y. Fu",
      "Y. Guo",
      "Y. Liu",
      "X. Wang",
      "W. Zhi"
    ],
    "published": "2026-02-11T07:41:01Z",
    "updated": "2026-02-11T07:41:01Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.10562v1",
    "url": "https://arxiv.org/abs/2602.10562v1",
    "pdf_url": "https://arxiv.org/pdf/2602.10562v1.pdf",
    "title": "Unidentified falling objects in the LHC as dark matter signals",
    "abstract": "Unidentified Falling Objects (UFOs) refer to sporadic beam losses observed during LHC operation. The prevailing explanation is that micrometer-sized dust particles released from the beam screen produce beam losses through interactions with the protons. However, the release mechanism of these particles remains unknown. We propose that roughly $(1-10)$% of UFOs may be caused by axion quark nuggets (AQNs), macroscopic dark matter (DM) candidates with masses of order $(5-1000)\\,$g. The AQN model naturally relates the dark- and visible-matter abundances ($Ω_\\mathrm{DM}\\simΩ_\\mathrm{visible}$) and provides a mechanism for generating the baryon-antibaryon asymmetry, with DM composed of both matter and antimatter AQNs. When passing underground within approximately 100km of the LHC, an antimatter AQN generates acoustic waves strong enough to trigger multiple UFO events within $2\\,$s. If three correlated UFOs (placed at different locations along the LHC ring) are detected, the signal-to-noise ratio can exceed 5 across the entire allowed AQN mass range for a measurement time of about 360 hours. Practically, the LHC can serve as a large broadband acoustic detector for AQNs.",
    "authors": [
      "Xunyu Liang",
      "Ariel Zhitnitsky"
    ],
    "published": "2026-02-11T06:18:42Z",
    "updated": "2026-02-11T06:18:42Z",
    "categories": [
      "hep-ph",
      "astro-ph.IM",
      "hep-ex",
      "physics.acc-ph"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2510.23001v3",
    "url": "https://arxiv.org/abs/2510.23001v3",
    "pdf_url": "https://arxiv.org/pdf/2510.23001v3.pdf",
    "title": "Search for Dark Matter via Invisible Decays in ${}^{46}$Sc Nuclear Gamma Cascades with a CsI(Tl) Detector",
    "abstract": "Dark matter remains one of the most compelling open problems in modern physics, motivating experimental searches for new light, weakly coupled particles beyond the Standard Model. Despite extensive efforts employing diverse detection strategies, large regions of parameter space remain unexplored. We report a high-statistics laboratory search for invisible decay modes in nuclear $γ$-ray cascades using approximately $100~\\mathrm{kg}$ of CsI(Tl) scintillators operated at Texas A\\&M University. The experiment employs a high-activity ${}^{46}$Sc radioactive source and a ``missing-$γ$'' technique, in which the absence of a photon from a well-identified cascade serves as a signature of new physics. Unlike appearance-disappearance experiments, this approach requires only a single photon conversion into a dark-sector particle, enabling sensitivity to significantly weaker couplings. The setup provides simultaneous sensitivity to a broad class of light dark-sector candidates, including axions and axion-like particles, dark scalars, and dark photons in the $0.1 - 1 \\text{ MeV}$ mass region. Through careful control of detector containment, energy resolution, and environmental backgrounds, we excludes certain regions on the previously explored parameter space. With foreseeable improvements in detector volume and systematic uncertainty control, this technique has the potential to probe currently unexplored parameter space for axion-like particles and light dark scalars.",
    "authors": [
      "Sharada Sahoo",
      "Jing-han Chen",
      "Mahdi Mirzakhani",
      "Harikrishnan Ramani",
      "Rupak Mahapatra",
      "Surjeet Rajendran"
    ],
    "published": "2025-10-27T04:37:35Z",
    "updated": "2026-02-11T04:04:21Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.10447v1",
    "url": "https://arxiv.org/abs/2602.10447v1",
    "pdf_url": "https://arxiv.org/pdf/2602.10447v1.pdf",
    "title": "Bridging the Kinetic-Fluid Gap: Ion-Driven Magnetogenesis to Prime Cosmic Dynamos",
    "abstract": "The origin of cosmic magnetic fields is widely attributed to the amplification of weak seed fields by turbulent dynamos. However, a critical understanding gap remains between the microscopic generation of these seeds and the macroscopic onset of the dynamo. Current kinetic models, often constrained to electron scales, predict premature saturation via magnetic trapping, leaving the generated fields potentially too weak and small-scale to effectively prime magnetohydrodynamic (MHD) processes. Here, using high-resolution kinetic simulations with a realistic mass ratio, we reveal the physics of this unexplored ion-kinetic regime. Under generalized continuous shear driving, used to simulate ubiquitous macroscopic flows, we demonstrate that the saturation of electron instabilities is not the endpoint but a precursor to a distinct, ion-dominated evolution. Massive ions, sustaining the velocity shear, trigger a subsequent filamentation instability that accesses the vast ion kinetic energy reservoir. This mechanism amplifies the magnetic energy by orders of magnitude beyond the electron-saturation limit, expanding the field coherence to ion scales. Our results establish ion kinetics as the essential ''missing link'' that bridges the divide between microscopic plasma instabilities and macroscopic cosmic dynamos.",
    "authors": [
      "X. Liu",
      "D. Wu",
      "J. Zhang"
    ],
    "published": "2026-02-11T02:39:24Z",
    "updated": "2026-02-11T02:39:24Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.GA"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.10279v1",
    "url": "https://arxiv.org/abs/2602.10279v1",
    "pdf_url": "https://arxiv.org/pdf/2602.10279v1.pdf",
    "title": "The MUSE Target Chamber Post Veto",
    "abstract": "The Muon Scattering Experiment (MUSE) was developed to address the proton radius puzzle through simultaneous electron-proton and muon-proton scattering using the Paul Scherrer Institute's PiM1 secondary beamline. MUSE uses a large-solid-angle, non-magnetic spectrometer to detect beam particles scattering from a liquid hydrogen cell contained within a vacuum chamber. Due to the large scattering windows, the structural integrity of the chamber is supported by posts located at small scattering angles. While out of the acceptance, particles in the tails of the beam distribution can strike these posts, causing a significant trigger background. We describe the design and performance of the Target Chamber Post Veto (TCPV) detector installed inside the vacuum chamber to remove these background events at the trigger level.",
    "authors": [
      "R. Ratvasky",
      "T. Rostomyan",
      "M. Ali",
      "H. Atac",
      "F. Barchetti",
      "J. C. Bernauer",
      "W. J. Briscoe",
      "A. Christopher Ndukwe",
      "E. W. Cline",
      "S. Das",
      "K. Deiters",
      "E. J. Downie",
      "Z. Duan",
      "A. Flannery",
      "M. Foster",
      "A. Friebolin",
      "M. Gantert",
      "R. Gilman",
      "A. Golossanov",
      "J. Guo",
      "J. Hirschman",
      "A. Hofer",
      "N. S. Ifat",
      "Y. Ilieva",
      "D. Jayakodige",
      "T. Krahulik",
      "M. Kohl",
      "I. Lavrukhin",
      "W. Lin",
      "W. Lorenzon",
      "P. MohanMurthy",
      "M. Nicol",
      "M. Paolone",
      "T. Patel",
      "A. Prosnyakov",
      "R. D. Ransome",
      "R. Raymond",
      "H. Reid",
      "P. E. Reimer",
      "R. Richards",
      "G. Ron",
      "O. M. Ruimi",
      "K. Salamone",
      "S. Shrestha",
      "N. Sparveris",
      "S. Strauch",
      "N. Wuerfel",
      "D. A. Yaari",
      "C. Zimmerli"
    ],
    "published": "2026-02-10T20:45:25Z",
    "updated": "2026-02-10T20:45:25Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.10041v1",
    "url": "https://arxiv.org/abs/2602.10041v1",
    "pdf_url": "https://arxiv.org/pdf/2602.10041v1.pdf",
    "title": "Design of experiments characterising heat conduction in magnetised, weakly collisional plasma",
    "abstract": "Heat conduction in weakly collisional, magnetised plasma is challenging to model accurately due to multifaceted physics governing heat-carrying electrons, including microinstabilities that scatter electrons and modify heat transport. Capturing these effects requires multidimensional kinetic theory simulations, which are computationally expensive. Experimental constraints overcome this issue, resulting in improved understanding of thermal transport in systems such as the intra-cluster medium of galaxy clusters, and the hot-spot in inertial confinement fusion. In this paper, we present a new experimental platform that produces a weakly collisional high-\\b{eta} plasma expected to be susceptible to the whistler heat-flux instability. This platform, to be fielded on the Orion laser, enables characterisation of whistler-regulated thermal conductivity. The platform design is assessed using radiation-magnetohydrodynamics simulations with the code FLASH. Simulations using three thermal conduction models predict conductivity suppression by over an order of magnitude relative to the Spitzer value at whistler saturation, demonstrating the efficacy of the platform.",
    "authors": [
      "T. A. Vincent",
      "P. Ariyathilaka",
      "L. Creaser",
      "C. Danson",
      "D. Lamb",
      "J. Meinecke",
      "C. A. J. Palmer",
      "S. Pitt",
      "H. Poole",
      "C. Spindloe",
      "P. Thomas",
      "E. Tubman",
      "L. Wilson",
      "W. J. Garbett",
      "G. Gregori",
      "P. Tzeferacos",
      "T. Hodge",
      "A. F. A. Bott"
    ],
    "published": "2026-02-10T18:07:15Z",
    "updated": "2026-02-10T18:07:15Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  }
]