{
  "arxiv_id": "2503.10758v2",
  "url": "https://arxiv.org/abs/2503.10758v2",
  "pdf_url": "https://arxiv.org/pdf/2503.10758v2.pdf",
  "title": "Parallel Collisionless Shocks in strongly Magnetized Electron-Ion   Plasma. I. Temperature anisotropies",
  "abstract": "Collisionless electron-ion shocks are fundamental to astrophysical plasmas, yet their behavior in strong magnetic fields remains poorly understood. Using Particle-in-Cell (PIC) simulations with the SHARP-1D3V code, we investigate the role of the ion magnetization parameter $\\sigma_i$ in parallel shock transitions. Strongly magnetized converging flows ($\\sigma_i > 1$) exhibit lower density compression ratios ($R \\sim 2$), smaller entropy jumps, and suppressed particle acceleration, while maintaining pressure anisotropy stability due to conserved perpendicular temperatures across the transition region, alongside increased parallel temperatures. In contrast, weakly magnetized shocks drive downstream mirror and firehose instabilities due to ion temperature anisotropy, which are suppressed in strongly magnetized cases. Additionally, weakly magnetized shocks exhibit the onset of a supra-thermal population induced by shock-drift acceleration, with most of the upstream kinetic energy thermalized for both electrons and ions in the downstream region. Our results demonstrate that perpendicular temperatures for both species are conserved in weakly and strongly magnetized cases and highlight deviations from standard ideal magnetohydrodynamic (MHD) behavior in strongly magnetized cases. These findings provide critical insights into the role of magnetic fields in parallel collisionless astrophysical shocks.",
  "authors": [
    "Mohamad Shalaby",
    "Antoine Bret",
    "Federico Fraschetti"
  ],
  "published": "2025-03-13T18:00:02Z",
  "updated": "2025-09-02T18:57:38Z",
  "categories": [
    "astro-ph.SR",
    "astro-ph.GA",
    "astro-ph.HE",
    "physics.comp-ph",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.SR"
}