{
  "arxiv_id": "2509.04360v1",
  "url": "https://arxiv.org/abs/2509.04360v1",
  "pdf_url": "https://arxiv.org/pdf/2509.04360v1.pdf",
  "title": "Sensitivities of time-dependent temperature profile predictions for NSTX   with the Multi-Mode Model",
  "abstract": "The Multi-Mode Model (MMM) for turbulent transport was applied to a large set of well-analyzed discharges from the National Spherical Torus Experiment (NSTX) in order to evaluate its sensitivities to a wide range of plasma conditions. MMM calculations were performed for hundreds of milliseconds in each discharge by performing time-dependent predictive simulations with the 1.5D tokamak integrated modeling code TRANSP. A closely related study concluded that MMM predicted electron ($T_e$) and ion ($T_i$) temperature profiles that were in reasonable agreement with NSTX observations, generally outperforming a different reduced transport model, TGLF, motivating a more thorough investigation of the characteristics of the MMM predictions. The simulations with MMM have electron energy transport dominated by electron temperature gradient modes for relatively low plasma $\\beta$ and high collisionality, transitioning to a mixture of different modes for higher $\\beta$ and lower collisionality. The thermal ion diffusivity predicted by MMM is much smaller than the neoclassical contribution, in line with previous experimental analysis of NSTX. Nonetheless, the $T_e$ and $T_i$ profiles are coupled via collisional energy exchange and thus sensitive to which transport channels are predicted. The simulations with MMM are robust to the simulation start time, converging to remarkably similar temperatures later during the discharge. MMM typically overpredicts confinement relative to NSTX observations, leading to the prediction of overly steep profiles. Plasmas with spatially broader $T_e$ profiles, higher $\\beta$, and longer energy confinement times tend to be predicted by MMM with better agreement with the experiment. These findings provide useful context for understanding the regime-dependent tendencies of MMM in anticipation of self-consistent, time-dependent predictive simulations of NSTX-U discharges.",
  "authors": [
    "J. B. Lestz",
    "G. Avdeeva",
    "S. M. Kaye",
    "M. V. Gorelenkova",
    "F. D. Halpern",
    "J. McClenaghan",
    "A. Y. Pankin",
    "K. E. Thome"
  ],
  "published": "2025-09-04T16:21:24Z",
  "updated": "2025-09-04T16:21:24Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}