[
  {
    "arxiv_id": "2509.03641v2",
    "url": "https://arxiv.org/abs/2509.03641v2",
    "pdf_url": "https://arxiv.org/pdf/2509.03641v2.pdf",
    "title": "Is There an Exact Magnetic-Moment for Charged Particle Motion in a   Homogeneous, Time-Dependent Magnetic Field?",
    "abstract": "The nonperturbative guiding-center model provides an exact alternative to full-orbit simulations of charged particle dynamics in situations where traditional guiding-center theory may fail. We demonstrate that the charged particle motion in a homogeneous, time-varying magnetic field is a solvable example of the nonperturbative guiding-center model. This entails showing that the exact magnetic moment of Qin and Davidson can be constructed to be asymptotic to the adiabatic invariant series of Kruskal. In contrast to the perturbative invariant, the exact invariant contains information about parametric resonances. These resonances destroy the conservation of the usual magnetic moment over very long times. This refutes some previous claims about the all-time invariance of the magnetic moment.",
    "authors": [
      "Michael Updike",
      "Joshua Burby"
    ],
    "published": "2025-09-03T18:48:10Z",
    "updated": "2025-09-05T11:36:28Z",
    "categories": [
      "physics.plasm-ph",
      "math-ph",
      "math.MP"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.00164v4",
    "url": "https://arxiv.org/abs/2509.00164v4",
    "pdf_url": "https://arxiv.org/pdf/2509.00164v4.pdf",
    "title": "The potential applications of muography to revealing sea shipwrecks",
    "abstract": "Muon imaging, a non-invasive technique leveraging naturally occurring cosmic muons, has emerged as a promising tool for exploring underwater objects, including shipwrecks. This article examines the potential of muon imaging to investigate the contents of wrecked ships in the Baltic Sea and other marine environments. By analyzing the principles of muon tomography, its applications in underwater archaeology, and its advantages over traditional methods, we highlight its potential to reveal hidden details within shipwrecks while addressing challenges posed by the marine environment. These wrecks pose significant environmental risks due to their hazardous contents, such as explosives and crude oil products, making their detection and monitoring a matter of environmental and safety concern. Accurate modeling and imaging of such wrecks are therefore crucial for assessing potential dangers and mitigating environmental impacts. In this work, we adopted an approach similar to that used in underground muon experiments. Muon propagation through 50 meters of seawater was simulated using GEANT4, with muons transported to a depth of 35 meters and recorded in a virtual detector. The saved distributions of particle type, kinetic energy, interaction position, and angular directions were then used as tabulated input to the PrimaryGeneratorAction module. This approach enabled the generation of a realistic underwater muon flux over a 20 m x 20 m surface at 35 meters depth, which was subsequently employed to simulate different shipwreck filling scenarios. Assuming an exposure time of one week for a wreck located at a depth of 50 meters, our simulations demonstrate that muon imaging can resolve density contrasts sufficiently to distinguish between water, oil, and high-density materials, underscoring its feasibility as a practical tool for underwater hazard assessment.",
    "authors": [
      "Anzori Sh. Georgadze"
    ],
    "published": "2025-08-29T18:05:45Z",
    "updated": "2025-09-05T05:40:11Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.04374v1",
    "url": "https://arxiv.org/abs/2509.04374v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04374v1.pdf",
    "title": "Estimation of Effective Viscosity to Quantify Collisional Behavior in   Collisionless Plasma",
    "abstract": "While dissipation in collisional plasma is defined in terms of viscosity and resistivity, the exact functional form of dissipation i.e., the so-called dissipation function in nearly collisionless plasma is unknown. Nevertheless, previous studies have suggested that there exists viscous-like energy conversion in collisionless plasma with scaling characteristics analogous to collisional plasma, and in particular that the average dissipation is proportional to the square of the rate of strain as in hydrodynamics. In this study, using 2.5D kinetic particle-in-cell (PIC) simulation of collisionless plasma turbulence, we provide an estimate of effective viscosity at each scale, obtained via a scale-filtering approach. We then compare the turbulent dynamics of the PIC simulation with that from MHD and two-fluid simulations in which with the viscosity is equal to the effective viscosity estimate obtained from the PIC simulation. We find that the global behavior in these MHD and two-fluid simulations has a striking similarity with that in its kinetic/PIC counterpart. In addition, we explore the scale dependence of the effective viscosity, and discuss implications of this approach for space plasmas.",
    "authors": [
      "Subash Adhikari",
      "Carlos Gonzalez",
      "Yan Yang",
      "Sean Oughton",
      "Francesco Pecora",
      "Riddhi Bandyopadhyay",
      "William H. Matthaeus"
    ],
    "published": "2025-09-04T16:32:28Z",
    "updated": "2025-09-04T16:32:28Z",
    "categories": [
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.04367v1",
    "url": "https://arxiv.org/abs/2509.04367v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04367v1.pdf",
    "title": "A compact, low-power epithermal neutron counter for lunar water   detection",
    "abstract": "The detection and characterization of lunar water are critical for enabling sustainable human and robotic exploration of the Moon. Orbital neutron spectrometers, such as instruments on Lunar Prospector and the Lunar Reconnaissance Orbiter, have revealed hydrogen-rich regions near the poles but are limited by coarse spatial resolution and low counting efficiency. We present a compact, lightweight, and low-power epithermal neutron detector based on boron-coated silicon imagers, designed to probe subsurface hydrogen at decimeter scales from mobile platforms such as lunar rovers. This instrument leverages the high neutron capture cross-section of $^{10}$B to convert epithermal neutrons into detectable $\\alpha$ and $^{7}$Li ions in a fully-depleted silicon imager, providing a unique event topology to identify neutrons while suppressing backgrounds. Monte Carlo simulations demonstrate that a 3 $\\mu$m boron layer achieves optimal neutron detection efficiency, further enhanced with polyethylene moderation to improve sensitivity to the 0.4 eV-500 keV epithermal energy range. For a 10 cm$^2$ active area, the detector achieves sensitivity to H$_2$O weight fractions as low as 0.01 wt % in a 15 minute measurement. This scalable, portable, low-mass design is well-suited for integration into upcoming Artemis and commercial lunar rovers, providing a transformative capability for in-situ resource prospecting and ground-truth validation of orbital measurements.",
    "authors": [
      "Julian Cuevas-Zepeda",
      "Phoenix Alpine",
      "Brenda A. Cervantes-Vergara",
      "Claudio Chavez",
      "Juan Estrada",
      "Erez Etzion",
      "Guillermo Fernandez-Moroni",
      "Nathan Saffold",
      "Miguel Sofo-Haro",
      "Javier Tiffenberg"
    ],
    "published": "2025-09-04T16:26:13Z",
    "updated": "2025-09-04T16:26:13Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.04360v1",
    "url": "https://arxiv.org/abs/2509.04360v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04360v1.pdf",
    "title": "Sensitivities of time-dependent temperature profile predictions for NSTX   with the Multi-Mode Model",
    "abstract": "The Multi-Mode Model (MMM) for turbulent transport was applied to a large set of well-analyzed discharges from the National Spherical Torus Experiment (NSTX) in order to evaluate its sensitivities to a wide range of plasma conditions. MMM calculations were performed for hundreds of milliseconds in each discharge by performing time-dependent predictive simulations with the 1.5D tokamak integrated modeling code TRANSP. A closely related study concluded that MMM predicted electron ($T_e$) and ion ($T_i$) temperature profiles that were in reasonable agreement with NSTX observations, generally outperforming a different reduced transport model, TGLF, motivating a more thorough investigation of the characteristics of the MMM predictions. The simulations with MMM have electron energy transport dominated by electron temperature gradient modes for relatively low plasma $\\beta$ and high collisionality, transitioning to a mixture of different modes for higher $\\beta$ and lower collisionality. The thermal ion diffusivity predicted by MMM is much smaller than the neoclassical contribution, in line with previous experimental analysis of NSTX. Nonetheless, the $T_e$ and $T_i$ profiles are coupled via collisional energy exchange and thus sensitive to which transport channels are predicted. The simulations with MMM are robust to the simulation start time, converging to remarkably similar temperatures later during the discharge. MMM typically overpredicts confinement relative to NSTX observations, leading to the prediction of overly steep profiles. Plasmas with spatially broader $T_e$ profiles, higher $\\beta$, and longer energy confinement times tend to be predicted by MMM with better agreement with the experiment. These findings provide useful context for understanding the regime-dependent tendencies of MMM in anticipation of self-consistent, time-dependent predictive simulations of NSTX-U discharges.",
    "authors": [
      "J. B. Lestz",
      "G. Avdeeva",
      "S. M. Kaye",
      "M. V. Gorelenkova",
      "F. D. Halpern",
      "J. McClenaghan",
      "A. Y. Pankin",
      "K. E. Thome"
    ],
    "published": "2025-09-04T16:21:24Z",
    "updated": "2025-09-04T16:21:24Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.04359v1",
    "url": "https://arxiv.org/abs/2509.04359v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04359v1.pdf",
    "title": "Assessing time-dependent temperature profile predictions using reduced   transport models for high performing NSTX plasmas",
    "abstract": "Time-dependent, predictive simulations were performed with the 1.5D tokamak integrated modeling code TRANSP on a large set of well-analyzed, high performing discharges from the National Spherical Torus Experiment (NSTX) in order to evaluate how well modern reduced transport models can reproduce experimentally observed temperature profiles in spherical tokamaks. Overall, it is found that simulations using the Multi-Mode Model (MMM) more consistently agree with the NSTX observations than those using the Trapped Gyro-Landau Fluid (TGLF) model, despite TGLF requiring orders of magnitude greater computational cost. When considering all examined discharges, MMM has median overpredictions of electron temperature ($T_e$) and ion temperature ($T_i$) profiles of 28% and 27%, respectively, relative to the experiment. TGLF overpredicts $T_e$ by 46%, with much larger variance than MMM, and underpredicts $T_i$ by 25%. As $\\beta$ is increased across NSTX discharges, TGLF predicts lower $T_e$ and significant flattening of the $T_i$ profile, conflicting with NSTX observations. When using an electrostatic version of TGLF, both $T_e$ and $T_i$ are substantially overpredicted, underscoring the importance of electromagnetic turbulence in the high $\\beta$ spherical tokamak regime. Additionally, calculations with neural net surrogate models for TGLF were performed outside of TRANSP with a time slice flux matching transport solver, finding better agreement with experiment than the TRANSP simulations, highlighting the impact of different transport solvers and simulation techniques. Altogether, the reasonable agreement with experiment of temperature profiles predicted by MMM motivates a more detailed examination of the sensitivities of the TRANSP simulations with MMM to different NSTX plasma regimes in a companion paper, in preparation for self-consistent, time-dependent predictive modeling of NSTX-U scenarios.",
    "authors": [
      "J. B. Lestz",
      "G. Avdeeva",
      "T. F. Neiser",
      "M. V. Gorelenkova",
      "F. D. Halpern",
      "S. M. Kaye",
      "J. McClenaghan",
      "A. Y. Pankin",
      "K. E. Thome"
    ],
    "published": "2025-09-04T16:19:52Z",
    "updated": "2025-09-04T16:19:52Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.04332v1",
    "url": "https://arxiv.org/abs/2509.04332v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04332v1.pdf",
    "title": "Detection of ultracold neutrons with powdered scintillator screens",
    "abstract": "Zinc sulfide (ZnS:Ag) scintillators are widely used for ultracold neutron (UCN) detection, but their application is limited by long decay times and pronounced phosphorescence. We tested two possible replacement scintillators: yttrium aluminum perovskite (YAP:Ce) and lutetium yttrium orthosilicate (LYSO:Ce). Both have decay times on the order of 30-40 ns, which can help reduce dead time in high count rate experiments. YAP:Ce showed a 60% lower phosphorescence when compared to ZnS:Ag after 2 days and outperformed ZnS:Ag in counting UCN by about 20%. On the other hand, LYSO:Ce exhibited more phosphorescence and produced fewer UCN counts compared to both ZnS:Ag and YAP:Ce. Both of these scintillators are viable UCN detectors for high count rate experiments, but YAP:Ce outperformed LYSO:Ce by every tested metric.",
    "authors": [
      "M. Krivos",
      "N. C. Floyd",
      "C. L. Morris",
      "Z. Tang",
      "M. Blatnik",
      "S. M. Clayton",
      "C. B. Cude-Woods",
      "A. Fratangelo",
      "A. T. Holley",
      "D. E. Hooks",
      "T. M. Ito",
      "C. -Y. Liu",
      "M. Makela",
      "M. R. Martinez",
      "A. S. C. Navazo",
      "C.",
      "M. O'Shaughnessy",
      "R. W. Pattie",
      "E. L. Renner",
      "T. A. Sandborn",
      "T. J. Schaub",
      "M. Singh",
      "I. L. Smythe",
      "F. W. Uhrich",
      "N. K. Washecheck",
      "Z. Wang",
      "A. R. Young"
    ],
    "published": "2025-09-04T15:51:09Z",
    "updated": "2025-09-04T15:51:09Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.04279v1",
    "url": "https://arxiv.org/abs/2509.04279v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04279v1.pdf",
    "title": "Energy Confinement Time Scaling for the Negative Triangularity Scenario   in DIII-D",
    "abstract": "Results from the 2023 negative triangularity campaign on DIII-D demonstrate encouraging energy confinement properties, similar to or exceeding the scaling of the IPB98(y,2) law. This paper describes the procedure with which a new scaling law was regressed specifically from the data from the DIII-D campaign. Given the relatively small size of the single-machine dataset, measures were taken to minimize sampling bias and give a realistic estimate of the large uncertainties from the regression. The resulting power law shows a robustly stronger dependence on plasma current and more severe power degradation as compared to the H-mode scaling law.",
    "authors": [
      "P. Lunia"
    ],
    "published": "2025-09-04T14:55:46Z",
    "updated": "2025-09-04T14:55:46Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.04205v1",
    "url": "https://arxiv.org/abs/2509.04205v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04205v1.pdf",
    "title": "Toward precision physics tests with future COHERENT detectors",
    "abstract": "We present a comprehensive sensitivity study of future CE$\\nu$NS detectors, focusing on a cryogenic cesium iodide detector and a tonne-scale liquid argon one, currently being developed by the COHERENT Collaboration. These setups will enable precision measurements of the weak mixing angle at low energies and allow accurate extraction of the neutron nuclear distribution radius. We also demonstrate that next-generation detectors will place constraints on the neutrino charge radius comparable to or better than current global fits. In addition, we explore the sensitivity to non standard neutrino electromagnetic properties, such as magnetic moments and millicharges, as well as new mediators. These findings reinforce the role of CE$\\nu$NS experiments in the upcoming precision era, with future detectors playing a key role in advancing our understanding of neutrino interactions and electroweak physics at low energies.",
    "authors": [
      "M. Atzori Corona",
      "M. Cadeddu",
      "N. Cargioli",
      "F. Dordei",
      "C. Giunti",
      "R. Pavarani"
    ],
    "published": "2025-09-04T13:31:19Z",
    "updated": "2025-09-04T13:31:19Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "hep-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.16960v2",
    "url": "https://arxiv.org/abs/2507.16960v2",
    "pdf_url": "https://arxiv.org/pdf/2507.16960v2.pdf",
    "title": "Surrogate Modeling of Landau Damping with Deep Operator Networks",
    "abstract": "Kinetic simulations excel at capturing microscale plasma physics phenomena with high accuracy, but their computational demands make them impractical for modeling large-scale space and astrophysical systems. In this context, we build a surrogate model, using Deep Operator Networks (DeepONets), based upon the Vlasov-Poisson simulation data to model the dynamical evolution of plasmas, focusing on the Landau damping process - a fundamental kinetic phenomenon in space and astrophysical plasmas. The trained DeepONets are able to capture the evolution of electric field energy in both linear and nonlinear regimes under various conditions. Extensive validation highlights DeepONets' robust performance in reproducing complex plasma behaviors with high accuracy, paving the way for large-scale modeling of space and astrophysical plasmas.",
    "authors": [
      "Simin Shekarpaz",
      "Chuanfei Dong",
      "Ziyu Huang"
    ],
    "published": "2025-07-22T19:05:24Z",
    "updated": "2025-09-04T12:03:27Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE",
      "astro-ph.IM",
      "astro-ph.SR",
      "physics.comp-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.3847/1538-4357/adf3ac"
  },
  {
    "arxiv_id": "2509.04132v1",
    "url": "https://arxiv.org/abs/2509.04132v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04132v1.pdf",
    "title": "Lagrangian features of turbulent transport in tokamak plasmas",
    "abstract": "This study investigates the Lagrangian properties of ion turbulent transport driven by drift-type turbulence in tokamak plasmas. Despite the compressible and inhomogeneous nature of Eulerian gyrocenter drifts, numerical simulations with the T3ST code reveal approximate ergodicity, stationarity, and time-symmetry. These characteristics are attributed to broad initial phase-space distributions that support ergodic mixing. Moreover, relatively minor constraints on the initial distributions are found to have negligible effects on transport levels.",
    "authors": [
      "D. I. Palade"
    ],
    "published": "2025-09-04T11:55:53Z",
    "updated": "2025-09-04T11:55:53Z",
    "categories": [
      "physics.plasm-ph",
      "nlin.CD",
      "physics.data-an"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.19653v2",
    "url": "https://arxiv.org/abs/2508.19653v2",
    "pdf_url": "https://arxiv.org/pdf/2508.19653v2.pdf",
    "title": "Charting the Luminosity Capabilities of the CERN Large Hadron Collider   with Various Nuclear Species",
    "abstract": "The Large Hadron Collider (LHC) at CERN has been instrumental in recent advances in experimental high energy physics by colliding beams of protons and heavier nuclei at unprecedented energies. The present heavy-ion programme is based mainly on colliding lead nuclei. For future ion runs, there is strong interest to achieve a significantly higher integrated nucleon-nucleon luminosity, which might be achieved through collisions of species other than Pb. In this paper, we explore the nucleon-nucleon luminosity projections in the LHC for a selection of ion species ranging from He to Xe, and including Pb as reference. Alternative beam production schemes are investigated as a way to mitigate effects such as space charge that degrade the beam quality in the LHC injectors. In the most optimistic scenarios, we find up to about a factor~4 improvement in integrated nucleon-nucleon luminosity for a typical future one-month run, with respect to the present Pb programme. We also outline a future study programme and experiments to test the assumptions and refine the simulated projections put forward in this article.",
    "authors": [
      "E. Waagaard",
      "R. Bruce",
      "R. Alemany Fernandez",
      "H. Bartosik",
      "J. M. Jowett",
      "N. Triantafyllou"
    ],
    "published": "2025-08-27T08:01:30Z",
    "updated": "2025-09-04T07:42:46Z",
    "categories": [
      "physics.acc-ph",
      "nucl-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.03955v1",
    "url": "https://arxiv.org/abs/2509.03955v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03955v1.pdf",
    "title": "Beamstrahlung monitoring at SuperKEKB upgrade 2023",
    "abstract": "Beam monitoring is crucial for particle accelerators to achieve high luminosity. We describe an upgrade of the LABM, a beam monitoring device utilizing observation of the beamstrahlung, radiation emitted by a beam of charged particles when it accelerates in the electromagnetic field of another beam of charged particles.",
    "authors": [
      "Dmitri Liventsev",
      "Giovanni Bonvicini",
      "Daniel Ricalde Herrmann",
      "Pedro L. M. Podesta-Lerma",
      "Makoto Tobiyama"
    ],
    "published": "2025-09-04T07:32:11Z",
    "updated": "2025-09-04T07:32:11Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.20523v2",
    "url": "https://arxiv.org/abs/2507.20523v2",
    "pdf_url": "https://arxiv.org/pdf/2507.20523v2.pdf",
    "title": "Multi-Machine Scaling Laws for Fuel and Impurity Puffing Rates   Sufficient for Detachment Access: a Systematic Review of Magnetic Confinement   Fusion Devices",
    "abstract": "From a database of 457 experimental and numerical data from 32 machines among solid-walled tokamaks, stellarators and linear plasma devices, we derive physics-informed multi-machine scaling laws predictive of fuel and impurity puffing rates sufficient to access plasma detachment -- leading candidate for a reactor-relevant solution to the open issue of plasma-wall interaction. Validation of our laws in up to 40 plasmas in low- and high-confinement mode also featuring advanced configurations demonstrates accuracy within a factor 1.5 in up to 50% of the instances, and within a factor 2 on average. Divertor volume alone is found to correlate to fuelling. The addition of plasma opaqueness leads to the empirically-calibrated law $\\Gamma_{\\text{D}}\\propto [n_{\\text{sep}}\\times a\\times(S_{\\text{div}}/V_{\\text{div}})^{-1.5}]^{1.05}$ valid across all toroidal devices. Its simplification to $\\Gamma_{\\text{D}}^{\\text{HDL}}\\propto 0.43\\times a^{1.58}\\times\\lambda_q^{-0.89}$ avoids a dependence on $n_{\\text{sep}}$ and bears intrinsic significance provided by the H/L density limit and the power fall-off length. Non-linearities of the impurity dynamics manifest in the seeding rate -- which the present work identifies both a generalised formula for, and the Greenwald-Eich-Scarabosio simplification $\\Gamma_{\\text{Z}}^{\\text{GES}}\\propto a^{1.51}\\times\\lambda_q^{-0.27}$. Similar relationships are defined for stellarators, closely following the mainstream but without providing data for validation -- which should stimulate further investigations. In the era of nuclear fusion reactor design, these results find immediate applicability in informing reactor fuel cycle design and edge plasma modelling. More generally, this study demonstrates that physics-based 0D laws able to relate detachment to the engineering actuators exist.",
    "authors": [
      "M. Moscheni",
      "A. Herrmann",
      "R. Kembleton",
      "M. Kryjak",
      "S. Lazerson",
      "F. Levi",
      "M. Siccinio",
      "P. Staniec",
      "T. Giegerich",
      "C. Tantos",
      "the Gauss Fusion GmbH Team"
    ],
    "published": "2025-07-28T05:11:10Z",
    "updated": "2025-09-04T05:49:10Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.03880v1",
    "url": "https://arxiv.org/abs/2509.03880v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03880v1.pdf",
    "title": "Plasma wakefield: from accelerators to black holes",
    "abstract": "Commemorating the 2024 S. Chandrasekhar Prize, this review provides a retrospective on the genesis and evolution of plasma wakefield acceleration. It traces the journey from prehistory and the invention of the Plasma Wakefield Accelerator (PWFA), the establishment of its theoretical cornerstones, to its profound reverberations across fundamental physics, including astrophysics and analog gravity. The narrative emphasizes conceptual evolution, key theoretical breakthroughs, and future outlook, culminating in a vision for hybrid schemes and next-generation colliders. In addition to application to particle accelerators and high energy collider physics, it is found that plasma wakefield, with its ultra-intense acceleration, can also be applied to investigate gravity effects in the laboratory based on Einstein's equivalence principle. A specific example is accelerating flying relativistic plasma mirrors to investigate the celebrated black hole Hawking evaporation and the associated information loss paradox. We describe an ongoing experiment, AnaBHEL (Analog Black Hole Evaporation via Lasers), which aims at shedding some lights on the black hole information loss paradox.",
    "authors": [
      "Pisin Chen",
      "Yung-Kun Liu"
    ],
    "published": "2025-09-04T04:34:40Z",
    "updated": "2025-09-04T04:34:40Z",
    "categories": [
      "physics.plasm-ph",
      "gr-qc",
      "hep-ex"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2504.05001v2",
    "url": "https://arxiv.org/abs/2504.05001v2",
    "pdf_url": "https://arxiv.org/pdf/2504.05001v2.pdf",
    "title": "SILVIA: Ultra-precision formation flying demonstration for space-based   interferometry",
    "abstract": "We propose SILVIA (Space Interferometer Laboratory Voyaging towards Innovative Applications), a mission concept designed to demonstrate ultra-precision formation flying between three spacecraft separated by 100 m. SILVIA aims to achieve sub-micrometer precision in relative distance control by integrating spacecraft sensors, laser interferometry, low-thrust and low-noise micro-propulsion for real-time measurement and control of distances and relative orientations between spacecraft. A 100-meter-scale mission in a near-circular low Earth orbit has been identified as an ideal, cost-effective setting for demonstrating SILVIA, as this configuration maintains a good balance between small relative perturbations and low risk for collision. This mission will fill the current technology gap towards future missions, including gravitational wave observatories such as DECIGO (DECihertz Interferometer Gravitational wave Observatory), designed to detect the primordial gravitational wave background, and high-contrast nulling infrared interferometers like LIFE (Large Interferometer for Exoplanets), designed for direct imaging of thermal emissions from nearby terrestrial planet candidates. The mission concept and its key technologies are outlined, paving the way for the next generation of high-precision space-based observatories.",
    "authors": [
      "Takahiro Ito",
      "Kiwamu Izumi",
      "Isao Kawano",
      "Ikkoh Funaki",
      "Shuichi Sato",
      "Tomotada Akutsu",
      "Kentaro Komori",
      "Mitsuru Musha",
      "Yuta Michimura",
      "Satoshi Satoh",
      "Takuya Iwaki",
      "Kentaro Yokota",
      "Kenta Goto",
      "Katsumi Furukawa",
      "Taro Matsuo",
      "Toshihiro Tsuzuki",
      "Katsuhiko Yamada",
      "Takahiro Sasaki",
      "Taisei Nishishita",
      "Yuki Matsumoto",
      "Chikako Hirose",
      "Wataru Torii",
      "Satoshi Ikari",
      "Koji Nagano",
      "Masaki Ando",
      "Seiji Kawamura",
      "Hidehiro Kaneda",
      "Shinsuke Takeuchi",
      "Shinichiro Sakai"
    ],
    "published": "2025-04-07T12:27:46Z",
    "updated": "2025-09-04T00:01:21Z",
    "categories": [
      "astro-ph.IM",
      "cs.SY",
      "eess.SY",
      "gr-qc",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM",
    "doi": "10.1093/pasj/psaf086"
  },
  {
    "arxiv_id": "2501.17382v3",
    "url": "https://arxiv.org/abs/2501.17382v3",
    "pdf_url": "https://arxiv.org/pdf/2501.17382v3.pdf",
    "title": "The nonmodal kinetic theory of the macroscale convective flows of   magnetized plasma, generated by the inhomogeneous microturbulenc",
    "abstract": "In this paper, we present the nonmodal kinetic theory of the macroscale two-dimensional compressed-sheared non-diffusive convective flows of a magnetized plasma generated by the inhomogeneous microturbulence. This theory bases on the two-scales approach to the solution of the Vlasov-Poisson system of equations for magnetized plasma, in which the self-consistent evolution of the plasma and of the electrostatic field on the microscales, commensurable with the wavelength of the microscale instabilities and of the ion gyroradius, as well as on the macroscales of a bulk of plasma, is accounted for. It includes the theory of the formation of the macroscale spatially inhomogeneous compressed-sheared convective flows by the inhomogeneous microturbulence, the theory of the back reaction of the macroscale convected flows on the microturbulence, and of the slow macroscale responce of a bulk of plasma on the development of the compressed-sheared convective flows.",
    "authors": [
      "V. V. Mikhailenko",
      "V. S. Mikhailenko",
      "Hae June Lee"
    ],
    "published": "2025-01-29T02:29:31Z",
    "updated": "2025-09-03T19:52:08Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.03664v1",
    "url": "https://arxiv.org/abs/2509.03664v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03664v1.pdf",
    "title": "Pressure dependence of magnetron sputtering: 2D-RZ particle-in-cell and   1D fluid modeling",
    "abstract": "We reproduce the consistently-seen experimental voltage versus pressure (V-P) dependence of DC magnetron sputtering (DCMS) with 2D-RZ particle-in-cell (PIC) simulation. Informed by PIC simulation, we develop a steady-state, 1D-axial fluid model of the sheath and presheath that also reproduces this V-P dependence. The V-P dependence is the relationship between the steady-state voltage needed to maintain a constant discharge current and the neutral gas pressure. V-P dependence is fundamental to device performance, but has not previously been reproduced with simulation or satisfactorily explained. In this work, we compare the V-P curve of our simulated device and fluid model with past experiments and then present a theoretical explanation for this V-P dependence. We find that the decrease in voltage with increasing pressure is not due to electron recapture at the cathode. Rather, the constant current dictates a constant global ionization rate, so the voltage decrease compensates for the increase in neutral gas density by lowering the energy of the plasma electrons, which decreases their ionization probability. The PIC simulations also reveal that the presheath and bulk plasma are unaffected by the electron reflection coefficient at the cathode; the only effect of increasing reflection is a reduction in the sheath voltage and width. In addition to the potential structure, we explore how pressure affects the plasma density, particle drifts, and particle energy distributions.",
    "authors": [
      "Joseph G. Theis",
      "Gregory R. Werner",
      "Thomas G. Jenkins",
      "Daniel Main",
      "John R. Cary"
    ],
    "published": "2025-09-03T19:28:35Z",
    "updated": "2025-09-03T19:28:35Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.03608v1",
    "url": "https://arxiv.org/abs/2509.03608v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03608v1.pdf",
    "title": "Search for low-mass electron-recoil dark matter using a single-charge   sensitive SuperCDMS-HVeV Detector",
    "abstract": "We present constraints on low mass dark matter-electron scattering and absorption interactions using a SuperCDMS high-voltage eV-resolution (HVeV) detector. Data were taken underground in the NEXUS facility located at Fermilab with an overburden of 225 meters of water equivalent. The experiment benefits from the minimizing of luminescence from the printed circuit boards in the detector holder used in all previous HVeV studies. A blind analysis of $6.1\\,\\mathrm{g\\cdot days}$ of exposure produces exclusion limits for dark matter-electron scattering cross-sections for masses as low as $1\\,\\mathrm{MeV}/c^2$, as well as on the photon-dark photon mixing parameter and the coupling constant between axion-like particles and electrons for particles with masses $>1.2\\,\\mathrm{eV}/c^2$ probed via absorption processes.",
    "authors": [
      "SuperCDMS Collaboration",
      "M. F. Albakry",
      "I. Alkhatib",
      "D. Alonso-González",
      "J. Anczarski",
      "T. Aralis",
      "T. Aramaki",
      "I. Ataee Langroudy",
      "C. Bathurst",
      "R. Bhattacharyya",
      "A. J. Biffl",
      "P. L. Brink",
      "M. Buchanan",
      "R. Bunker",
      "B. Cabrera",
      "R. Calkins",
      "R. A. Cameron",
      "C. Cartaro",
      "D. G. Cerdeño",
      "Y. -Y. Chang",
      "M. Chaudhuri",
      "J. -H. Chen",
      "R. Chen",
      "N. Chott",
      "J. Cooley",
      "H. Coombes",
      "P. Cushman",
      "R. Cyna",
      "S. Das",
      "S. Dharani",
      "M. L. di Vacri",
      "M. D. Diamond",
      "M. Elwan",
      "S. Fallows",
      "E. Fascione",
      "E. Figueroa-Feliciano",
      "S. L. Franzen",
      "A. Gevorgian",
      "M. Ghaith",
      "G. Godden",
      "J. Golatkar",
      "S. R. Golwala",
      "R. Gualtieri",
      "J. Hall",
      "S. A. S. Harms",
      "C. Hays",
      "B. A. Hines",
      "Z. Hong",
      "L. Hsu",
      "M. E. Huber",
      "V. Iyer",
      "V. K. S. Kashyap",
      "S. T. D. Keller",
      "M. H. Kelsey",
      "K. T. Kennard",
      "Z. Kromer",
      "A. Kubik",
      "N. A. Kurinsky",
      "M. Lee",
      "J. Leyva",
      "B. Lichtenberg",
      "J. Liu",
      "Y. Liu",
      "E. Lopez Asamar",
      "P. Lukens",
      "R. López Noé",
      "D. B. MacFarlane",
      "R. Mahapatra",
      "J. S. Mammo",
      "N. Mast",
      "A. J. Mayer",
      "P. C. McNamara",
      "H. Meyer zu Theenhausen",
      "É. Michaud",
      "E. Michielin",
      "K. Mickelson",
      "N. Mirabolfathi",
      "M. Mirzakhani",
      "B. Mohanty",
      "D. Mondal",
      "D. Monteiro",
      "J. Nelson",
      "H. Neog",
      "V. Novati",
      "J. L. Orrell",
      "M. D. Osborne",
      "S. M. Oser",
      "L. Pandey",
      "S. Pandey",
      "R. Partridge",
      "P. K. Patel",
      "D. S. Pedreros",
      "W. Peng",
      "W. L. Perry",
      "R. Podviianiuk",
      "M. Potts",
      "S. S. Poudel",
      "A. Pradeep",
      "M. Pyle",
      "W. Rau",
      "R. Ren",
      "T. Reynolds",
      "M. Rios",
      "A. Roberts",
      "A. E. Robinson",
      "L. Rosado Del Rio",
      "J. L. Ryan",
      "T. Saab",
      "D. Sadek",
      "B. Sadoulet",
      "S. P. Sahoo",
      "I. Saikia",
      "S. Salehi",
      "J. Sander",
      "B. Sandoval",
      "A. Sattari",
      "B. Schmidt",
      "R. W. Schnee",
      "B. Serfass",
      "A. E. Sharbaugh",
      "R. S. Shenoy",
      "A. Simchony",
      "P. Sinervo",
      "Z. J. Smith",
      "R. Soni",
      "K. Stifter",
      "J. Street",
      "M. Stukel",
      "H. Sun",
      "E. Tanner",
      "N. Tenpas",
      "D. Toback",
      "A. N. Villano",
      "J. Viol",
      "B. von Krosigk",
      "Y. Wang",
      "O. Wen",
      "Z. Williams",
      "M. J. Wilson",
      "J. Winchell",
      "S. Yellin",
      "B. A. Young",
      "B. Zatschler",
      "S. Zatschler",
      "A. Zaytsev",
      "E. Zhang",
      "L. Zheng",
      "A. Zuniga",
      "M. J. Zurowski"
    ],
    "published": "2025-09-03T18:04:08Z",
    "updated": "2025-09-03T18:04:08Z",
    "categories": [
      "hep-ex",
      "astro-ph.CO",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2509.03429v1",
    "url": "https://arxiv.org/abs/2509.03429v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03429v1.pdf",
    "title": "The properties of resistive MHD modes and unstable spectra in advanced   tokamak regimes",
    "abstract": "Advanced tokamak regimes, featuring extended regions of low magnetic shear, are promising candidates for future fusion reactors but are also more prone to specific kinds of MHD instabilities. The proximity to a rational surface in a very low shear region weakens field line bending stabilisation and amplifies the effects of toroidal coupling between modes, leading to the emergence of long-wavelength resistive infernal modes. These modes can grow collectively as a discrete spectrum, leading to a cascade of different perturbations for single mode numbers $(m, n)$, with subdominant modes showing increasingly oscillatory radial structures. These spectra of fast-growing modes are significant for developing stable scenarios in future reactors, and for the understanding of global reconnection events like sawteeth, motivating a deeper investigation into their fundamental physics. Deriving new analytic solutions, including a generalisation of the ideal interchange dispersion relation to non monotonic $q$ profiles, and extending a modular linear resistive MHD solver, we investigate how resistivity, compressibility, toroidal effects, and shaping influence stability, especially in reversed shear $q$ profiles. It is also shown that common assumptions in numerical calculations prevent the observation of the full variety of modes present in these advanced scenarios.",
    "authors": [
      "M. Coste-Sarguet",
      "J. P. Graves"
    ],
    "published": "2025-09-03T15:59:24Z",
    "updated": "2025-09-03T15:59:24Z",
    "categories": [
      "physics.plasm-ph",
      "math-ph",
      "math.MP"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2503.24168v2",
    "url": "https://arxiv.org/abs/2503.24168v2",
    "pdf_url": "https://arxiv.org/pdf/2503.24168v2.pdf",
    "title": "The Compact Linear e$^+$e$^-$ Collider (CLIC)",
    "abstract": "The Compact Linear Collider (CLIC) is a TeV-scale high-luminosity linear e$^+$e$^-$ collider studied by the international CLIC and CLICdp collaborations. CLIC uses a two-beam acceleration scheme, in which normal-conducting high-gradient 12 GHz accelerating structures are powered via a high-current drive beam. CLIC is foreseen to be built and operated in stages. The initial 380 GeV stage, with a site length of 11 km, optimally combines the exploration of Higgs and top-quark physics, including a top threshold scan near 350 GeV. A higher-energy stage, still using the initial single drive-beam complex, can be optimised for any energy up to 2 TeV. Parameters are presented in detail for a 1.5 TeV stage, with a site length of 29 km. Since the 2018 ESPPU reporting, significant effort was invested in CLIC accelerator optimisation, technology developments and system tests, including collaboration with new-generation light sources and free-electron lasers. CLIC implementation aspects at CERN have covered detailed studies of civil engineering, electrical networks, cooling and ventilation, scheduling, and costing. The CLIC baseline at 380 GeV is now 100 Hz operation, with a luminosity of 4.5$\\times 10^{34}$ cm$^{-2}$s$^{-1}$ and a power consumption of 166 MW. Compared to the 2018 design, this gives three times higher luminosity-per-power. The new baseline has two beam-delivery systems, allowing for two detectors operating in parallel. The cost estimate of the 380 GeV baseline is approximately 7.2 billion CHF. The construction of the first CLIC energy stage could start as early as ~2034/35 with first beams following a decade later. This report summarises the CLIC project, its implementation and running scenarios, with emphasis on new developments and recent progress. It concludes with an update on the CLIC detector studies and on the physics potential in light of the improved accelerator performance.",
    "authors": [
      "Erik Adli",
      "Gerardo D'Auria",
      "Nuria Catalan Lasheras",
      "Vera Cilento",
      "Roberto Corsini",
      "Dominik Dannheim",
      "Steffen Doebert",
      "Mick Draper",
      "Angeles Faus-Golfe",
      "Edward Fraser Mactavish",
      "Alexej Grudiev",
      "Andrea Latina",
      "Lucie Linssen",
      "John Andrew Osborne",
      "Yannis Papaphilippou",
      "Philipp Roloff",
      "Aidan Robson",
      "Carlo Rossi",
      "Andre Sailer",
      "Daniel Schulte",
      "Eva Sicking",
      "Steinar Stapnes",
      "Igor Syratchev",
      "Rogelio Tomas Garcia",
      "Walter Wuensch"
    ],
    "published": "2025-03-31T14:48:58Z",
    "updated": "2025-09-03T15:14:02Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.03349v1",
    "url": "https://arxiv.org/abs/2509.03349v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03349v1.pdf",
    "title": "Low-coherence interferometry with undetected mid-infrared photons in the   high-gain regime",
    "abstract": "We develop a high-parametric-gain SU(1,1) interferometer based on an aperiodically poled Potassium Titanyl Phosphate (apKTP) crystal, enabling frequency-domain low-coherence interferometry with undetected mid-infrared photons. The system achieves a signal-to-noise ratio as high as 40 dB and axial resolution of 30 $\\mu$m, with a 3 $\\mu$m-centered idler beam. By increasing the poling-period range, we also improve the axial resolution to 17 $\\mu$m, demonstrating a straightforward route to enhance the performance by working on the crystal design",
    "authors": [
      "Giovanni Zotti",
      "Dmitri B. Horoshko",
      "Mikhail I. Kolobov",
      "Yoad Michael",
      "Ziv Gefen",
      "Maria V. Chekhova",
      "Kazuki Hashimoto"
    ],
    "published": "2025-09-03T14:34:59Z",
    "updated": "2025-09-03T14:34:59Z",
    "categories": [
      "physics.optics",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2509.03326v1",
    "url": "https://arxiv.org/abs/2509.03326v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03326v1.pdf",
    "title": "Numerical Modeling of Galactic Cosmic Ray Modulation in the Heliosphere",
    "abstract": "Numerical modeling of galactic cosmic rays (GCRs) penetration through the heliosphere to the vicinity of the Sun is considered. Galactic cosmic rays are charged particles with energies exceeding 10 MeV/nucl., originating from far beyond the boundaries of our Solar System. As they penetrate through the heliosphere - the region of space filled by the solar wind - they interact strongly with the interplanetary magnetic field. In this paper, we present numerical approaches to solving the so-called Parker transport equation for the isotropic velocity distribution function of GCRs. This equation includes a convective term, anisotropic diffusion, adiabatic cooling, and drifts. Additionally, the diffusion coefficient is spatially and energy-dependent, varying by several orders of magnitude. Our numerical approaches are based on the finite-difference method (Crank-Nicolson scheme) and the stochastic differential equations (SDE) method. The numerical methods were validated against a known analytical solution under simplified conditions. For the general problem formulation, which involves anisotropic diffusion and the Parker spiral interplanetary magnetic field configuration, we used the most efficient and flexible SDE method and compared the numerical results with the data from the works of Kota & Jokipii (1983) and Burger (2012). Special attention was devoted to incorporating drift along the heliospheric current sheet in the model.",
    "authors": [
      "D. A. Shestakov",
      "V. V. Izmodenov"
    ],
    "published": "2025-09-03T14:02:09Z",
    "updated": "2025-09-03T14:02:09Z",
    "categories": [
      "astro-ph.HE",
      "astro-ph.IM",
      "astro-ph.SR",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2504.16177v3",
    "url": "https://arxiv.org/abs/2504.16177v3",
    "pdf_url": "https://arxiv.org/pdf/2504.16177v3.pdf",
    "title": "Turbulent heating in collisionless low-beta plasmas: imbalance, Landau   damping, and electron-ion energy partition",
    "abstract": "An understanding of how turbulent energy is partitioned between ions and electrons in weakly collisional plasmas is crucial for modelling many astrophysical systems. Using theory and simulations of a four-dimensional reduced model of low-beta gyrokinetics (the `Kinetic Reduced Electron Heating Model'), we investigate the dependence of collisionless heating processes on plasma beta and imbalance (normalised cross-helicity). These parameters are important because they control the helicity barrier, the formation of which divides the parameter space into two distinct regimes with remarkably different properties. In the first, at lower beta and/or imbalance, the absence of a helicity barrier allows the cascade of injected power to proceed to small (perpendicular) scales, but its slow cascade rate makes it susceptible to significant electron Landau damping, in some cases leading to a marked steepening of the magnetic spectra on scales above the ion Larmor radius. In the second, at higher beta and/or imbalance, the helicity barrier halts the cascade, confining electron Landau damping to scales above the steep `transition-range' spectral break, resulting in dominant ion heating. We formulate quantitative models of these processes that compare well to simulations in each regime, and combine them with results of previous studies to construct a simple formula for the electron-ion heating ratio as a function of beta and imbalance. This model predicts a `winner takes all' picture of low-beta plasma heating, where a small change in the fluctuations' properties at large scales (the imbalance) can cause a sudden switch between electron and ion heating.",
    "authors": [
      "T. Adkins",
      "R. Meyrand",
      "J. Squire"
    ],
    "published": "2025-04-22T18:06:20Z",
    "updated": "2025-09-03T13:12:58Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.3847/1538-4357/ade9b0"
  },
  {
    "arxiv_id": "2509.03264v1",
    "url": "https://arxiv.org/abs/2509.03264v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03264v1.pdf",
    "title": "Universal Analytic Solution for the Quantum Transport of Structured   Matter-Waves in Magnetic Optics",
    "abstract": "We present a closed-form analytic solution for the propagation of an arbitrary charged scalar state in a non-uniform magnetic field. The dynamics are governed by classical beam optics parameters (Courant-Snyder parameters), the Twiss functions, and phase advance, revealing a direct map between quantum evolution and its classical counterpart. The solution decomposes into three components, exhibiting a complex rotation dependent on the sign of the orbital angular momentum (OAM) projection, alongside an intrinsic distortion from interference governed by a generalized Gouy phase. For a relevant Glaser-type magnetic field and a half-blocked twisted electron, we demonstrate that asymmetry triggers rich dynamics incompatible with a simple Bohmian trajectory interpretation. Our fully relativistic framework provides a powerful tool for predicting beam behavior in particle accelerators and electron microscopes, critical for designing next-generation OAM-based experiments.",
    "authors": [
      "N. V. Filina",
      "S. S. Baturin"
    ],
    "published": "2025-09-03T12:29:08Z",
    "updated": "2025-09-03T12:29:08Z",
    "categories": [
      "quant-ph",
      "physics.acc-ph"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2509.03229v1",
    "url": "https://arxiv.org/abs/2509.03229v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03229v1.pdf",
    "title": "Wakefield acceleration of self-injected bunch in a conical plasma   channels",
    "abstract": "Laser wakefield acceleration is a widely studied method for accelerating charged particle bunches, with selfinjection being a key feature. However, as the bunch accelerates beyond the driver velocity, it shifts out of the maximal accelerating wakefield phase. This work proposes using a tapering cone channel to address this issue. The gradual narrowing synchronizes the bunch with the wake phase by reducing the bubble size, keeping the bunch in the accelerating phase. The obtained dependencies of the bunch length, field Ez, and mean longitudinal momentum pz on the channel radius are useful for further researches.",
    "authors": [
      "D. S. Bondar",
      "W. Leemans",
      "V. I. Maslov",
      "I. N. Onishchenko"
    ],
    "published": "2025-09-03T11:40:10Z",
    "updated": "2025-09-03T11:40:10Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph",
      "65Z05",
      "F.2.1"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.03225v1",
    "url": "https://arxiv.org/abs/2509.03225v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03225v1.pdf",
    "title": "Plasma lens for the focusing of positron bunches",
    "abstract": "The development of effective focusing schemes for positron bunches in plasma accelerators remains a significant challenge, as nonlinear regimes fail to create stable focusing channels for positrons. This work presents a method for focusing and improving the quality of positron bunches using a plasma lens operating in the linear regime. Through numerical simulations, we investigate two distinct focused positron bunch profiles: a purely Gaussian bunch and an elongated, flat-top bunch with Gaussian rising and falling edges. For both configurations, the results demonstrate the capability to achieve high-quality transverse focusing. Furthermore, beyond focusing, the proposed system enables potential possibility to reduce energy spread of positron bunches of the sequence after precursor.",
    "authors": [
      "D. S. Bondar",
      "C. A. Lindstrøm",
      "V. I. Maslov",
      "I. N. Onishchenko"
    ],
    "published": "2025-09-03T11:28:01Z",
    "updated": "2025-09-03T11:28:01Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph",
      "65Z05",
      "F.2.1"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2502.07338v2",
    "url": "https://arxiv.org/abs/2502.07338v2",
    "pdf_url": "https://arxiv.org/pdf/2502.07338v2.pdf",
    "title": "Ultrafast 4D scanning transmission electron microscopy for imaging of   localized optical fields",
    "abstract": "Ultrafast electron microscopy aims for imaging transient phenomena occurring on nanoscale. One of its goals is to visualize localized optical and plasmonic modes generated by coherent excitation in the vicinity of various types of nanostructures. Such imaging capability was enabled by photoninduced near-field optical microscopy, which is based on spectral filtering of electrons inelastically scattered due to the stimulated interaction with the nearfield. Here, we report on the development of ultrafast four-dimensional (4D) scanning transmission electron microscopy, which allows us to image the transverse components of the optical near-field while avoiding the need of electron spectral filtering. We demonstrate that this method is capable of imaging the integrated Lorentz force generated by optical near-fields of a tungsten nanotip and the ponderomotive potential of an optical standing wave with a spatial resolution of 21 nm.",
    "authors": [
      "Petr Koutenský",
      "Neli Laštovičková Streshkova",
      "Kamila Moriová",
      "Marius Constantin Chirita Mihaila",
      "Alexandr Knápek",
      "Daniel Burda",
      "Martin Kozák"
    ],
    "published": "2025-02-11T08:01:02Z",
    "updated": "2025-09-03T10:47:15Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics",
    "doi": "10.1021/acsphotonics.5c00864"
  },
  {
    "arxiv_id": "2509.03559v1",
    "url": "https://arxiv.org/abs/2509.03559v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03559v1.pdf",
    "title": "Particle background characterization and prediction for the NUCLEUS   reactor CE$ν$NS experiment",
    "abstract": "NUCLEUS is a cryogenic detection experiment which aims to measure Coherent Elastic Neutrino-Nucleus Scattering (CE$\\nu$NS) and to search for new physics at the Chooz nuclear power plant in France. This article reports on the prediction of particle-induced backgrounds, especially focusing on the sub-keV energy range, which is a poorly known region where most of the CE$\\nu$NS signal from reactor antineutrinos is expected. Together with measurements of the environmental background radiations at the experimental site, extensive Monte Carlo simulations based on the Geant4 package were run both to optimize the experimental setup for background reduction and to estimate the residual rates arising from different contributions such as cosmic ray-induced radiations, environmental gammas and material radioactivity. The NUCLEUS experimental setup is predicted to achieve a total rejection power of more than two orders of magnitude, leaving a residual background component which is strongly dominated by cosmic ray-induced neutrons. In the CE$\\nu$NS signal region of interest between 10 and 100 eV, a total particle background rate of $\\sim$ 250 d$^{-1}$kg$^{-1}$keV$^{-1}$ is expected in the CaWO$_4$ target detectors. This corresponds to a signal-to-background ratio $\\gtrsim$ 1, and therefore meets the required specifications in terms of particle background rejection for the detection of reactor antineutrinos through CE$\\nu$NS.",
    "authors": [
      "H. Abele",
      "G. Anglogher",
      "B. Arnold",
      "M. Atzori Corona",
      "A. Bento",
      "E. Bossio",
      "F. Buchsteiner",
      "J. Burkhart",
      "F. Cappella",
      "M. Cappelli",
      "N. Casali",
      "R. Cerulli",
      "A. Cruciani",
      "G. Del Castello",
      "M. del Gallo Roccagiovine",
      "S. Dorer",
      "A. Erhart",
      "M. Friedl",
      "S. Fichtinger",
      "V. M. Ghete",
      "M. Giammei",
      "C. Goupy",
      "D. Hauff",
      "F. Jeanneau",
      "E. Jericha",
      "M. Kaznacheeva",
      "H. Kluck",
      "A. Langenkämper",
      "T. Lasserre",
      "D. Lhuillier",
      "M. Mancuso",
      "R. Martin",
      "B. Mauri",
      "A. Mazzolari",
      "L. McCallin",
      "H. Neyrial",
      "C. Nones",
      "L. Oberauer",
      "T. Ortmann",
      "L. Peters",
      "F. Petricca",
      "W. Potzel",
      "F. Pröbst",
      "F. Pucci",
      "F. Reindl",
      "M. Romagnoni",
      "J. Rothe",
      "N. Schermer",
      "J. Schieck",
      "S. Schönert",
      "C. Schwertner",
      "L. Scola",
      "G. Soum-Sidikov",
      "L. Stodolsky",
      "R. Strauss",
      "R. Thalmeier",
      "C. Tomei",
      "M. Vignati",
      "M. Vivier",
      "A. Wex"
    ],
    "published": "2025-09-03T09:49:17Z",
    "updated": "2025-09-03T09:49:17Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.03149v1",
    "url": "https://arxiv.org/abs/2509.03149v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03149v1.pdf",
    "title": "Extended temporal coarse-graining in a stratified and confined plasma   under thermal fluctuations",
    "abstract": "We present an extended investigation of a recently introduced model of gravitationally confined, collisionless plasma (Barbieri et al. 2024a), which showed that rapid temperature fluctuations at the base of the plasma, occurring on timescales much shorter than the electron crossing time, can drive the system into a non-thermal state characterized by anti-correlated temperature and density profiles, commonly referred to as temperature inversion. To describe this phenomenon, a temporal coarse-graining formalism was developed (Barbieri et al. 2024b). In this work, we generalize that approach to cover regimes where the timescales of temperature fluctuations are comparable to or exceed the electron crossing time. We derive a set of kinetic equations that incorporate an additional term arising from the coarse-graining procedure, which was not present in the earlier formulation. Through numerical simulations, we analyze the plasma dynamics under these broader conditions, showing that the electric field influences the system when fluctuation timescales approach the electron crossing time. However, for timescales much larger than the proton crossing time, the electric field becomes negligible. The observed behaviours are interpreted within the framework of the extended temporal coarse-graining theory, and we identify the regimes and conditions in which temperature inversion persists.",
    "authors": [
      "Luca Barbieri",
      "Simone Landi",
      "Lapo Casetti",
      "Andrea Verdini"
    ],
    "published": "2025-09-03T09:02:33Z",
    "updated": "2025-09-03T09:02:33Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.03142v1",
    "url": "https://arxiv.org/abs/2509.03142v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03142v1.pdf",
    "title": "Self-consistent generation of the ambipolar electric field in   collisionless plasmas via multi-mode electrostatics",
    "abstract": "In this work, we investigate the generation of the ambipolar electric field in a gravitationally stratified, collisionless plasma atmosphere. In such environments, gravity tends to separate charged species. To prevent separation an electric field, classically described by the Pannekoek-Rosseland expression, is usually imposed externally. Here, we propose a self-consistent method to recover this field based on a multi-mode Fourier expansion of the electrostatic interaction. We show that, under suitable conditions, this approach naturally leads to the ambipolar electric field and restores charge neutrality. The method is tested in both isothermal and multi-temperature plasma configurations. This framework provides a foundation for future developments that may include collisions, ionization, and asymmetric boundary conditions to model more realistic stellar atmospheres.",
    "authors": [
      "Luca Barbieri"
    ],
    "published": "2025-09-03T08:52:48Z",
    "updated": "2025-09-03T08:52:48Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.03137v1",
    "url": "https://arxiv.org/abs/2509.03137v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03137v1.pdf",
    "title": "A Neural Network Approach to Multi-radionuclide TDCR Beta Spectroscopy",
    "abstract": "Liquid scintillation triple-to-doubly coincident ratio (TDCR) spectroscopy is widely adopted as a standard method for radionuclide quantification because of its inherent advantages such as high precision, self-calibrating capability, and independence from radioactive reference sources. However, multiradionuclide analysis via TDCR faces the challenges of limited automation and reliance on mixture-specific standards, which may not be easily available. Here, we present an Artificial Intelligence (AI) framework that combines numerical spectral simulation and deep learning for standard-free automated analysis. $\\beta$ spectra for model training were generated using Geant4 simulations coupled with statistically modeled detector response sampling. A tailored neural network architecture, trained on this dataset covering various nuclei mix ratio and quenching scenarios, enables autonomous resolution of individual radionuclide activities and detecting efficiency through end-to-end learning paradigms. The model delivers consistent high accuracy across tasks: activity proportions (mean absolute error = 0.009), detection efficiencies (mean absolute error = 0.002), and spectral reconstruction (Structural Similarity Index = 0.9998), validating its physical plausibility for quenched $\\beta$ spectroscopy. This AI-driven methodology exhibits significant potential for automated safety-compliant multiradionuclide analysis with robust generalization, real-time processing capabilities, and engineering feasibility, particularly in scenarios where reference materials are unavailable or rapid field analysis is required.",
    "authors": [
      "Li Yi",
      "Qian Yang"
    ],
    "published": "2025-09-03T08:40:02Z",
    "updated": "2025-09-03T08:40:02Z",
    "categories": [
      "cs.LG",
      "cs.AI",
      "nucl-ex",
      "physics.comp-ph",
      "physics.ins-det"
    ],
    "primary_category": "cs.LG"
  },
  {
    "arxiv_id": "2509.03097v1",
    "url": "https://arxiv.org/abs/2509.03097v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03097v1.pdf",
    "title": "Steels and Stainless Steels",
    "abstract": "Steels, and in particular stainless steels, play a crucial role in the construction of large particle accelerators and high-energy physics experiments, of fusion reactors and their superconducting magnet structures. Such projects face severe material challenges, as they require a wide application of tightly specified steel products and grades, featuring a controlled microstructure and adequate mechanical, physical, magnetic and vacuum properties over a wide temperature range. A broad spectrum of relevant examples is presented, issued from the experience maturated within decades of building of large vacuum, cryogenic and associated structural systems that must guarantee a reliable, long-lasting service with limited interventions. The requirements, and in turn the metallurgical processes applied to achieve the final stringent properties are discussed - dictated by mechanical, magnetic or vacuum compatibility constraints and often by a combination of them. Case studies are developed. The study of a few major failure analysis cases and their root causes is also addressed.",
    "authors": [
      "Stefano Sgobba"
    ],
    "published": "2025-09-03T07:53:49Z",
    "updated": "2025-09-03T07:53:49Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.03092v1",
    "url": "https://arxiv.org/abs/2509.03092v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03092v1.pdf",
    "title": "Collision operator for electron runaway in cold weakly-ionized plasmas",
    "abstract": "In cold weakly-ionized plasmas, Dreicer generation mechanism can be non-diffusive as demonstrated in [Y. Lee et. al. Phys. Rev. Lett. 133 17 175102 (2024)]. By expanding the previous letter, we present the detailed description of a proper collision operator to precisely account for the non-diffusive electron kinetics. The operator appropriately combines the Fokker-Planck operator and Boltzmann operator where free-bound collision cross sections are valid in low energy region. The proposed operator is envisaged to predict runaway electrons generations in cold weakly-ionized plasmas, particularly to design a runaway-free reactor tokamak startup.",
    "authors": [
      "Yeongsun Lee",
      "Pavel Aleynikov",
      "Peter de Vries",
      "Jong-Kyu Park",
      "Yong-Su Na"
    ],
    "published": "2025-09-03T07:40:58Z",
    "updated": "2025-09-03T07:40:58Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.03074v1",
    "url": "https://arxiv.org/abs/2509.03074v1",
    "pdf_url": "https://arxiv.org/pdf/2509.03074v1.pdf",
    "title": "An experimental setup for the study of gas-cell processes for the   S$^3$-Low Energy Branch",
    "abstract": "We present an experimental setup dedicated to the study of in-gas ion processes and characterization of gas stopping cells for the Low Energy Branch of the Super Separator Spectrometer (S$^3$) at SPIRAL2-GANIL. The first application is the development of a new gas stopper with a neutralization mechanism designed for faster extraction of the radioactive ions. This development should enable in-gas-jet laser spectroscopy and other low-energy experiments with shorter lived radioactive isotopes. We discuss in detail the motivation and objectives of these developments and we present the results of simulations performed in the design phase, as well as the first experimental results.",
    "authors": [
      "E. Morin",
      "W. Dong",
      "V. Manea",
      "A. Claessens",
      "S. Damoy",
      "R. Ferrer",
      "S. Franchoo",
      "S. Geldhof",
      "T. Hourat",
      "Yu. Kudryavtsev",
      "N. Lecesne",
      "R. Leroy",
      "D. Lunney",
      "V. Marchand",
      "E. Minaya Ramirez",
      "S. Raeder",
      "S. Roset",
      "Ch. Vandamme",
      "P. Van den Bergh",
      "P. Van Duppen"
    ],
    "published": "2025-09-03T07:12:26Z",
    "updated": "2025-09-03T07:12:26Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2506.11457v2",
    "url": "https://arxiv.org/abs/2506.11457v2",
    "pdf_url": "https://arxiv.org/pdf/2506.11457v2.pdf",
    "title": "Vibrational-Electron Heating in Plasma Flows: A Thermodynamically   Consistent Model",
    "abstract": "Accurate prediction of electron temperature ($T_{\\rm e}$) in non-equilibrium {plasma} flows is critical, yet hampered by inadequate models for electron heating from vibrationally excited states. Prior models often relied on ad-hoc scaling or flawed applications of detailed balance that failed to ensure the convergence of electron temperature and species-specific vibrational temperature ($T_{\\rm v}$) at thermal equilibrium. This paper introduces a novel, thermodynamically consistent electron heating model derived rigorously from the principle of detailed balance. By assuming a Boltzmann vibrational distribution and employing an effective activation energy, our approach yields a simple heating-to-cooling ratio of $\\exp(\\theta_{\\rm v}/T_{\\rm e}-\\theta_{\\rm v}/T_{\\rm v})$, where $\\theta_{\\rm v}$ is the characteristic vibrational temperature of the species under consideration. This formulation guarantees that $T_{\\rm e}$ correctly converges to $T_{\\rm v}$ at equilibrium. A key advantage is that our model can utilize total cooling rates determined from swarm experiments, leading to higher accuracy at low electron temperatures. For re-entry flows, the proposed approach predicts an electron temperature several times lower than previous models which results in improved agreement with some flight test data. These more reliable predictions can significantly enhance the modeling fidelity of plasma-assisted combustion, laser-induced plasmas, and various hypersonic plasma technologies such as electron transpiration cooling or magnetohydrodynamic force generators.",
    "authors": [
      "Felipe Martin Rodriguez Fuentes",
      "Bernard Parent"
    ],
    "published": "2025-06-13T04:28:10Z",
    "updated": "2025-09-03T02:31:17Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2502.16384v2",
    "url": "https://arxiv.org/abs/2502.16384v2",
    "pdf_url": "https://arxiv.org/pdf/2502.16384v2.pdf",
    "title": "Muon tagging with Flash ADC waveform baselines",
    "abstract": "This manuscript describes an innovative method to tag the muons using the baseline information of the Flash ADC (FADC) waveform of PMTs in the JSNS1 (J-PARC Sterile Neutrino Search at J-PARC Spallation Neutron Source) experiment. This experiment is designed for the search for sterile neutrinos, and a muon tagging is an essential key component for the background rejection since the detector of the experiment is located over-ground, where is the 3rd floor of the J-PARC Material and Life experimental facility (MLF). Especially, stopping muons inside the detector create the Michel electrons, and they are important background to be rejected. Utilizing this innovative method, more than 99.8% of Michel electrons can be rejected even without a detector veto region. This technique can be employed for any experiments which uses the similar detector configurations.",
    "authors": [
      "D. H. Lee",
      "M. K. Cheoun",
      "J. H. Choi",
      "J. Y. Choi",
      "T. Dodo",
      "J. Goh",
      "M. Harada",
      "S. Hasegawa",
      "W. Hwang",
      "T. Iida",
      "H. I. Jang",
      "J. S. Jang",
      "K. K. Joo",
      "D. E. Jung",
      "S. K. Kang",
      "Y. Kasugai",
      "T. Kawasaki",
      "E. M. Kim",
      "E. J. Kim",
      "S. B. Kim",
      "S. Y. Kim",
      "H. Kinoshita",
      "T. Konno",
      "C. Little",
      "T. Maruyama",
      "E. Marzec",
      "S. Masuda",
      "S. Meigo",
      "D. H. Moon",
      "T. Nakano",
      "M. Niiyama",
      "K. Nishikawa",
      "M. Y. Pac",
      "B. J. Park",
      "H. W. Park",
      "J. B. Park",
      "Jisu Park",
      "J. S. Park",
      "R. G. Park",
      "S. J. M. Peeters",
      "C. Rott",
      "J. W. Ryu",
      "K. Sakai",
      "S. Sakamoto",
      "T. Shima",
      "C. D. Shin",
      "J. Spitz",
      "F. Suekane",
      "Y. Sugaya",
      "K. Suzuya",
      "Y. Takeuchi",
      "W. Wang",
      "W. Wei",
      "Y. Yamaguchi",
      "M. Yeh",
      "I. S. Yeo",
      "I. Yu"
    ],
    "published": "2025-02-22T23:51:15Z",
    "updated": "2025-09-03T01:24:09Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.02916v1",
    "url": "https://arxiv.org/abs/2509.02916v1",
    "pdf_url": "https://arxiv.org/pdf/2509.02916v1.pdf",
    "title": "Initial results of the TRIUMF ultracold advanced neutron source",
    "abstract": "We report the first results on ultracold neutron production from a new spallation-driven superfluid $^4$He (He-II) source at TRIUMF, which is being prepared for a new, precise measurement of the neutron electric dipole moment. A total of $(9.3 \\pm 0.8)\\times 10^{5}$ ultracold neutrons were observed at a proton beam current of \\SI{37}{\\uA}, when the target was irradiated for a period of \\SI{60}{\\s}. The results are in fair agreement with expectations based on a detailed simulation of neutron transport and ultracold neutron source cryogenics. There is some indication that the new source might not be as limited by the conduction of heat through the He-II as originally expected. The results indicate that the source is likely to make its ultimate production goals, once the liquid deuterium cold moderator system is completed.",
    "authors": [
      "B. Algohi",
      "D. Anthony",
      "L. Barrón-Palos",
      "M. Bossé",
      "M. P. Bradley",
      "A. Brossard",
      "T. Bui",
      "J. Chak",
      "R. Chiba",
      "C. Davis",
      "R. de Vries",
      "K. Drury",
      "B. Franke",
      "D. Fujimoto",
      "R. Fujitani",
      "M. Gericke",
      "P. Giampa",
      "C. Gibson",
      "R. Golub",
      "K. Hatanaka",
      "T. Hepworth",
      "T. Higuchi",
      "G. Ichikawa",
      "I. Ide",
      "S. Imajo",
      "A. Jaison",
      "B. Jamieson",
      "M. Katotoka",
      "S. Kawasaki",
      "M. Kitaguchi",
      "W. Klassen",
      "E. Korkmaz",
      "E. Korobkina",
      "F. Kuchler",
      "M. Lavvaf",
      "T. Lindner",
      "N. Lo",
      "S. Longo",
      "K. W. Madison",
      "Y. Makida",
      "J. Malcolm",
      "J. Mammei",
      "R. Mammei",
      "Z. Mao",
      "C. Marshall",
      "J. W. Martin",
      "R. Matsumiya",
      "M. McCrea",
      "E. Miller",
      "M. Miller",
      "K. Mishima",
      "T. Mohammadi",
      "T. Momose",
      "M. Nalbandian",
      "T. Okamura",
      "S. Pankratz",
      "R. Patni",
      "R. Picker",
      "K. Qiao",
      "W. D. Ramsay",
      "W. Rathnakela",
      "T. Reimer",
      "D. Salazar",
      "J. Sato",
      "W. Schreyer",
      "T. Shima",
      "H. M. Shimizu",
      "S. Sidhu",
      "S. Stargardter",
      "R. Stutters",
      "P. Switzer",
      "I. Tanihata",
      "Tushar",
      "S. Vanbergen",
      "W. T. H. van Oers",
      "N. Yazdandoost",
      "Q. Ye",
      "A. Zahra",
      "M. Zhao"
    ],
    "published": "2025-09-03T01:00:39Z",
    "updated": "2025-09-03T01:00:39Z",
    "categories": [
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "nucl-ex"
  },
  {
    "arxiv_id": "2509.02895v1",
    "url": "https://arxiv.org/abs/2509.02895v1",
    "pdf_url": "https://arxiv.org/pdf/2509.02895v1.pdf",
    "title": "Solar Vortices as Conduits for Magnetoacoustic Waves: Multi-Layer   Coupling and Their Role in Atmospheric Heating",
    "abstract": "The Sun's atmosphere hosts swirling plasma structures, known as solar vortices, which have long been thought to channel wave energy into higher layers. Until now, no direct observations have confirmed their role in the heating of the atmosphere. Here, we present the first direct evidence that solar vortices act as structured waveguides, carrying magnetoacoustic modes (waves that behave like sound waves but travel through magnetized plasma) that leave clear wave-heating signatures. By mapping vortex regions at multiple heights and analysing the waves they contain, we show that magnetoacoustic waves efficiently transfer energy, offset losses from radiation, and dominate energy transport in the lower chromosphere. These results challenge the long-standing assumption that vortices primarily support twisting disturbances traveling along magnetic field lines (Alfven waves), revealing instead that magnetoacoustic modes play the leading role in the lower atmosphere. This redefines the role of vortices in magnetized plasmas and has broader implications for wave-plasma interactions in regions of strong magnetic fields.",
    "authors": [
      "Suzana S. A. Silva",
      "Ioannis Dakanalis",
      "Luiz A. C. A. Schiavo",
      "Kostas Tziotziou",
      "Istvan Ballai",
      "Shahin Jafarzadeh",
      "Tiago M. D. Pereira",
      "Georgia Tsiropoula",
      "Gary Verth",
      "Iñaki Esnaola",
      "James A. McLaughlin",
      "Gert J. J. Botha",
      "Viktor Fedun"
    ],
    "published": "2025-09-02T23:39:55Z",
    "updated": "2025-09-02T23:39:55Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2409.06336v4",
    "url": "https://arxiv.org/abs/2409.06336v4",
    "pdf_url": "https://arxiv.org/pdf/2409.06336v4.pdf",
    "title": "Towards Agentic AI on Particle Accelerators",
    "abstract": "As particle accelerators grow in complexity, traditional control methods face increasing challenges in achieving optimal performance. This paper envisions a paradigm shift: a decentralized multi-agent framework for accelerator control, powered by Large Language Models (LLMs) and distributed among autonomous agents. We present a proposition of a self-improving decentralized system where intelligent agents handle high-level tasks and communication and each agent is specialized to control individual accelerator components.   This approach raises some questions: What are the future applications of AI in particle accelerators? How can we implement an autonomous complex system such as a particle accelerator where agents gradually improve through experience and human feedback? What are the implications of integrating a human-in-the-loop component for labeling operational data and providing expert guidance? We show three examples, where we demonstrate the viability of such architecture.",
    "authors": [
      "Antonin Sulc",
      "Thorsten Hellert",
      "Raimund Kammering",
      "Hayden Hoschouer",
      "Jason St. John"
    ],
    "published": "2024-09-10T08:47:23Z",
    "updated": "2025-09-02T19:53:40Z",
    "categories": [
      "physics.acc-ph",
      "cs.AI"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2503.10758v2",
    "url": "https://arxiv.org/abs/2503.10758v2",
    "pdf_url": "https://arxiv.org/pdf/2503.10758v2.pdf",
    "title": "Parallel Collisionless Shocks in strongly Magnetized Electron-Ion   Plasma. I. Temperature anisotropies",
    "abstract": "Collisionless electron-ion shocks are fundamental to astrophysical plasmas, yet their behavior in strong magnetic fields remains poorly understood. Using Particle-in-Cell (PIC) simulations with the SHARP-1D3V code, we investigate the role of the ion magnetization parameter $\\sigma_i$ in parallel shock transitions. Strongly magnetized converging flows ($\\sigma_i > 1$) exhibit lower density compression ratios ($R \\sim 2$), smaller entropy jumps, and suppressed particle acceleration, while maintaining pressure anisotropy stability due to conserved perpendicular temperatures across the transition region, alongside increased parallel temperatures. In contrast, weakly magnetized shocks drive downstream mirror and firehose instabilities due to ion temperature anisotropy, which are suppressed in strongly magnetized cases. Additionally, weakly magnetized shocks exhibit the onset of a supra-thermal population induced by shock-drift acceleration, with most of the upstream kinetic energy thermalized for both electrons and ions in the downstream region. Our results demonstrate that perpendicular temperatures for both species are conserved in weakly and strongly magnetized cases and highlight deviations from standard ideal magnetohydrodynamic (MHD) behavior in strongly magnetized cases. These findings provide critical insights into the role of magnetic fields in parallel collisionless astrophysical shocks.",
    "authors": [
      "Mohamad Shalaby",
      "Antoine Bret",
      "Federico Fraschetti"
    ],
    "published": "2025-03-13T18:00:02Z",
    "updated": "2025-09-02T18:57:38Z",
    "categories": [
      "astro-ph.SR",
      "astro-ph.GA",
      "astro-ph.HE",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2508.03770v2",
    "url": "https://arxiv.org/abs/2508.03770v2",
    "pdf_url": "https://arxiv.org/pdf/2508.03770v2.pdf",
    "title": "Description of CRESST-III lithium aluminate data",
    "abstract": "Two detector modules with lithium aluminate targets were operated in the CRESST underground setup between February and June 2021. The data collected in this period was used to set the currently strongest cross-section upper limits on the spin-dependent interaction of dark matter (DM) with protons and neutrons for the mass region between 0.25 and 1.5 GeV/c$^2$. The data are available online. In this document, we describe how the data set should be used to reproduce our dark matter results.",
    "authors": [
      "G. Angloher",
      "S. Banik",
      "G. Benato",
      "A. Bento",
      "A. Bertolini",
      "R. Breier",
      "C. Bucci",
      "J. Burkhart",
      "L. Canonica",
      "A. D'Addabbo",
      "S. Di Lorenzo",
      "L. Einfalt",
      "A. Erb",
      "F. v. Feilitzsch",
      "N. Ferreiro Iachellini",
      "S. Fichtinger",
      "D. Fuchs",
      "A. Fuss",
      "A. Garai",
      "V. M. Ghete",
      "P. Gorla",
      "P. V. Guillaumon",
      "S. Gupta",
      "D. Hauff",
      "M. Ješkovský",
      "J. Jochum",
      "M. Kaznacheeva",
      "A. Kinast",
      "H. Kluck",
      "S. Kuckuk",
      "H. Kraus",
      "A. Langenkämper",
      "M. Mancuso",
      "L. Marini",
      "L. Meyer",
      "V. Mokina",
      "A. Nilima",
      "M. Olmi",
      "T. Ortmann",
      "C. Pagliarone",
      "L. Pattavina",
      "F. Petricca",
      "W. Potzel",
      "P. Povinec",
      "F. Pröbst",
      "F. Pucci",
      "F. Reindl",
      "J. Rothe",
      "K. Schäffner",
      "J. Schieck",
      "D. Schmiedmayer",
      "S. Schönert",
      "C. Schwertner",
      "M. Stahlberg",
      "L. Stodolsky",
      "C. Strandhagen",
      "R. Strauss",
      "I. Usherov",
      "F. Wagner",
      "M. Willers",
      "V. Zema"
    ],
    "published": "2025-08-05T04:52:36Z",
    "updated": "2025-09-02T18:35:03Z",
    "categories": [
      "hep-ex",
      "astro-ph.CO",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2509.02518v1",
    "url": "https://arxiv.org/abs/2509.02518v1",
    "pdf_url": "https://arxiv.org/pdf/2509.02518v1.pdf",
    "title": "The Far-Infrared Enhanced Survey Spectrometer (FIRESS) for PRIMA:   Approach and Estimated Performance",
    "abstract": "We present the architectural concept for the Far-Infrared Enhanced Survey Spectrometer (FIRESS) for the Probe Mission for far-IR Astrophysics (PRIMA). FIRESS spans the 24--235 micron range with four R ~ 100 slit-fed grating modules, each coupling to a 24 (spatial) by 84 (spectral) pixel array of kinetic inductance detectors (KIDs). All four arrays are read out simultaneously, and a point source of interest can be coupled to two of the four bands at a time. A Fourier transform module can be engaged over a portion of the FIRESS slits to create a high-resolution mode in which the light is intercepted, processed by the interferometer then reinserted into the path to the grating modules for detection. We provide a simulation and description of the technique that will be used to obtain high-resolution spectra. We identify the most important system requirements imposed by the detector system, finding that they are met with the existing design. Finally, we present our performance modeling, including both direct estimates given our current design status, as well as durable guidelines for developing general-observer programs.",
    "authors": [
      "C. M.",
      "Bradford",
      "Alan J. Kogut",
      "Dale Fixsen",
      "Klaus Pontoppidan",
      "C. Darren Dowell",
      "Jason Glenn",
      "Thomas Pagano",
      "Joseph Green",
      "Marc Foote",
      "James McGuire",
      "Michael Rodger",
      "Robert Calvet",
      "Hien Nguyen",
      "Steve Hailey-Dunsheath",
      "Logan Foote",
      "Elijah Kane",
      "Reinier M. J. Janssen",
      "Margaret Meixner",
      "Alexandra Pope",
      "Alberto Bolatto",
      "JD Smith"
    ],
    "published": "2025-09-02T17:13:36Z",
    "updated": "2025-09-02T17:13:36Z",
    "categories": [
      "astro-ph.IM",
      "astro-ph.GA",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2506.16431v2",
    "url": "https://arxiv.org/abs/2506.16431v2",
    "pdf_url": "https://arxiv.org/pdf/2506.16431v2.pdf",
    "title": "The Dielectric Response of Plasmas with Arbitrary Gyrotropic Velocity   Distributions",
    "abstract": "Hot and tenuous plasmas are frequently far from local thermodynamic equilibrium, necessitating sophisticated methods for determining the associated plasma dielectric tensor and normal mode response. The Arbitrary Linear Plasma Solver (\\texttt{alps}) is a numerical tool for calculating such responses of plasmas with arbitrary gyrotropic background velocity distribution functions (VDFs). In order to model weakly and moderately damped plasma waves accurately, we have updated to the code to use an improved analytic continuation enabled by a polynomial basis representation. We demonstrate the continuity of solutions to the linear Vlasov--Maxwell dispersion relation between bi-Maxwellian and arbitrary VDF representations and evaluate the influence of VDF structure on mode polarization and wave power emission and absorption.",
    "authors": [
      "Kristopher Klein",
      "Daniel Verscharen"
    ],
    "published": "2025-06-19T16:09:50Z",
    "updated": "2025-09-02T16:10:06Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.02455v1",
    "url": "https://arxiv.org/abs/2509.02455v1",
    "pdf_url": "https://arxiv.org/pdf/2509.02455v1.pdf",
    "title": "SOLPS-ITER Numerical Simulations of ITER-scale Snowflake Divertors:   Low-Field-Side SF-/SF+ and High-Field-Side SF-/SF+ Configurations",
    "abstract": "With edge plasma code SOLS-ITER, we study four Snowflake (SF) configurations for an ITER-size tokamak, with toroidal magnetic field BT=5T, major radius R=5m and plasma current Ip=10MA. Our aim is to provide insights on SF divertor design for future devices. In this work, the impacts of magnetic geometry and divertor target geometry in the four types of SF configurations on plasma behavior and power exhaust performance are investigated in detail. Low-recycling regime, high-recycling and detachment in the four types of SF divertors are obtained through an upstream density scan. The secondary X-point positions of SF divertors are systematically varied to examine their impact. For Low-Field-Side (LFS) SF- and High-Field-Side (HFS) SF- divertors the observed power splitting, induced by the secondary X-point, is consistent with experimental observations. The effect of target geometry is studied by comparing the flat target plates with the ITER-like divertor shape. The overall simulation results reveal a notable consequence of the LFS SF- divertor: closed structure of the inner target with high inclined plate can compress recycling neutrals originating from the HFS divertor region into the LFS SOL and PFR regions. This results in considerable volumetric dissipation through strong ionization and recombination, causing the connected outer target region to detach. This feature can be considered in the design of the LFS SF- divertor for future devices. For the LFS and HFS SF+ divertors, the region between the two X-points exhibits strong ionization and recombination sources close to the primary X-point. This feature might be beneficial for the formation of an X-point radiator, but would require further impurity seeding simulation study.",
    "authors": [
      "H. S. Wu",
      "F. Subba",
      "M. R. K. Wigram",
      "O. Pan",
      "R. Lo Frano",
      "A. Pucciarelli",
      "R. Zanino"
    ],
    "published": "2025-09-02T16:08:02Z",
    "updated": "2025-09-02T16:08:02Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.02390v1",
    "url": "https://arxiv.org/abs/2509.02390v1",
    "pdf_url": "https://arxiv.org/pdf/2509.02390v1.pdf",
    "title": "One--Component Plasma Equation of State Revisited via Angular--Averaged   Ewald Potential",
    "abstract": "We present analytic fits of classical one--component plasma (OCP) internal energy over a wide range of coupling parameter $0.01\\le\\Gamma\\le 170$ using Monte--Carlo data in the thermodynamic limit. We extend the dataset obtained in [Demyanov and Levashov, Phys. Rev. E 106, 015204 (2022)] using the angular--averaged Ewald potential with additional points at strong coupling ($\\Gamma=120,\\ 150,\\ 170$). We then fit two frequently used functional forms for the OCP equation of state: (i) a five-parameter equation by Caillol [J. Chem. Phys. 111, 6538--6547 (1999)] and (ii) the equation by Potekhin and Chabrier [Phys. Rev. E 62, 8554 (2000)] that enforces the Debye--H\\\"uckel limit. The presented fits reproduce our MC data within statistical uncertainties, recovering the correct weak-coupling behavior. Coefficients, recommended validity ranges, and comparisons to prior analytical and simulation results are provided.",
    "authors": [
      "G. S. Demyanov",
      "P. R. Levashov"
    ],
    "published": "2025-09-02T14:54:48Z",
    "updated": "2025-09-02T14:54:48Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.02285v1",
    "url": "https://arxiv.org/abs/2509.02285v1",
    "pdf_url": "https://arxiv.org/pdf/2509.02285v1.pdf",
    "title": "FPGA-Based RoCEv2-RDMA Readout Electronics for the CTAO-LST Advanced   Camera",
    "abstract": "CTAO's (Cherenkov Telescope Array Observatory) largest telescopes type, the LST (Large-Sized Telescope), are being installed at the northern site of the Cherenkov Telescope Array (CTA) at the Observatorio del Roque de los Muchachos on the Canary island of La Palma. Their aim is to capture the lowest-energy gamma rays of the observatory. The hereby proposed readout electronics architecture, serving as a proof-of-concept for its advanced camera upgrade, relies on a custom high-channel count fast sampling hardware digitizer board acting as a Front-End. The design includes a versatile pre-amplification stage and high-speed serial links for streaming JESD204C-compliant data at rates approaching 12 Gb/s per lane. The data get transferred to Back-End electronics for a first data-processing and trigger before being transmitted to event-building servers through 10 Gb/s Ethernet links. The performance of the link is exploited by implementing RDMA communication in hardware, thanks to a RoCEv2 core written in Bluespec SystemVerilog, enabling the possibility of transfer data directly to processing units without CPU intervention. Hardware design and characterization of the Front End board are reported, as well as a detailed description and tests of the Back End RDMA firmware.",
    "authors": [
      "F. Marini",
      "M. Bellato",
      "A. Bergnoli",
      "D. Corti",
      "A. Griggio",
      "R. Isocrate",
      "L. Modenese",
      "M. Toffano",
      "C. Arcaro",
      "F. Di Pierro",
      "M. Mariotti",
      "M. Mi",
      "P. Wang"
    ],
    "published": "2025-09-02T13:07:24Z",
    "updated": "2025-09-02T13:07:24Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM",
    "doi": "10.1109/TNS.2025.3599615"
  },
  {
    "arxiv_id": "2506.17072v3",
    "url": "https://arxiv.org/abs/2506.17072v3",
    "pdf_url": "https://arxiv.org/pdf/2506.17072v3.pdf",
    "title": "A low-cost plasma source aimed for medical applications using Ar as the   working gas",
    "abstract": "Due to advances in equipment and intense research on plasma biomedical applications over the past few years, plasma devices are now suitable for clinical use. It has been demonstrated that plasma sources can be designed in a way that ensures their safe operation and application whilst preserving the relevant clinical results. However, the manufacturing and operating costs of such plasma devices remain high, which can be decisive for their adoption in medical procedures. In this work, a simple modification of a low-cost plasma jet configuration is proposed in order to evaluate the device's viability for medical applications using argon as working gas. Typically, plasma jets operating with argon (Ar) generate high electrical currents, which makes them unsuitable for medical applications. With the proposed device modification, the treatment is no longer carried out using the plasma jet directly, but rather with the post-discharge effluent enriched with reactive oxygen and nitrogen species. As a result, the electrical current reaching the target remains below the safety threshold established for plasma applications in humans. Tests on water activation by plasma jets with and without the proposed modification indicate that both devices can yield comparable outcomes.",
    "authors": [
      "Fellype do Nascimento",
      "Bruno Henrique da Silva Leal",
      "Konstantin Georgiev Kostov"
    ],
    "published": "2025-06-20T15:21:02Z",
    "updated": "2025-09-02T13:02:10Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1088/1402-4896/adfe2b"
  },
  {
    "arxiv_id": "2409.07073v4",
    "url": "https://arxiv.org/abs/2409.07073v4",
    "pdf_url": "https://arxiv.org/pdf/2409.07073v4.pdf",
    "title": "Dependence of the Solar Wind Plasma Density on Moderate- and Extremely   High-Geomagnetic Activity Elucidated by Potential Learning",
    "abstract": "The relationship between moderate and extremely high levels of geomagnetic activity, represented by the Kp index (2- to 5+ and 6- to 9), and solar wind conditions during southward IMF intervals was revealed utilizing a newly developed machine learning technique. Potential learning (PL) is a neural network algorithm that emphasizes input parameters with the highest variance during training and identifies the most significant ones influencing the outputs based on a computed metric called \"potentiality\". We focus on the dependence of solar wind plasma density on moderate-geomagnetic conditions. It has been unclear from what stage of geomagnetic activity the solar wind density begins to control the Kp level. Previously, PL extracted solar wind velocity as the predominant parameter at extremely low (0 to 1+) and high-Kp ranges under southward IMF. In this study, the IMF three components, solar wind speed, and plasma density from the OMNI database (1998-2019), covering solar cycle 23 to early 25, were used as inputs. Again, PL selected solar wind velocity as the most significant parameter for moderate and extremely high Kp. The potentiality of solar wind density for these ranges was, however, 3.5 times higher than in the previous study, suggesting its impact on geomagnetic activity cannot be ignored. We statistically investigated the relation between solar wind speed and plasma density used as PL inputs under all Kp levels. Above moderate Kp, geomagnetic conditions become high even under slow solar wind if density is large, suggesting that not only velocity but also density contributes significantly. These PL and statistical investigations show that solar wind density begins to regulate Kp above moderate geomagnetic activity under southward IMF. They also help understand the relationship between solar wind and geomagnetic activity and forecast geomagnetic activity under various IMF conditions.",
    "authors": [
      "Ryozo Kitajima",
      "Motoharu Nowada",
      "Ryotaro Kamimura"
    ],
    "published": "2024-09-11T07:48:27Z",
    "updated": "2025-09-02T12:28:48Z",
    "categories": [
      "physics.space-ph",
      "physics.comp-ph",
      "physics.data-an",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2509.02246v1",
    "url": "https://arxiv.org/abs/2509.02246v1",
    "pdf_url": "https://arxiv.org/pdf/2509.02246v1.pdf",
    "title": "Generic Rolling Access to Synchrotron Radiation Facilities",
    "abstract": "A generic model for rolling access to synchrotron radiation experiments is presented, which has the capacity to replace call-based access models. Proposal submission, evaluation and scheduling are all executed in a rolling fashion. This significantly reduces the waiting times between proposal submission and experiment execution than that of the call-based access model. The generic rolling access model is in principle applicable to any beamlines, regardless of the number of experimental methods or setups it provides to users. This access model is flexible and could provide faster access compared to call-based access model as well as accommodate experiments and projects requiring extended preparation times.",
    "authors": [
      "Arka Bikash Dey",
      "Kai Bagschik",
      "Ruslan Khubbutdinov",
      "Jan-Peter Kurz",
      "Daniela Unger",
      "Florian Bertram",
      "Johanna Hakanpää",
      "Christoph Schlueter",
      "Dmitri Novikov",
      "Martin Tolkiehn",
      "Milena Lippmann",
      "Harald Reichert",
      "Hans-Christian Wille",
      "Oliver H. Seeck"
    ],
    "published": "2025-09-02T12:16:30Z",
    "updated": "2025-09-02T12:16:30Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  }
]