{
  "arxiv_id": "2506.13802v2",
  "url": "https://arxiv.org/abs/2506.13802v2",
  "pdf_url": "https://arxiv.org/pdf/2506.13802v2.pdf",
  "title": "Discrimination of neutron-$γ$ in the low energy regime using machine learning for an EJ-276D plastic scintillator",
  "abstract": "In this work, we present results for discrimination of neutron and $γ$ events using a plastic scintillator detector with pulse shape discrimination capabilities. Machine learning (ML) algorithms are used to improve the discriminatory power between neutron and $γ$ events at lower energy ranges which otherwise are not addressed by the conventional pulse shape discrimination techniques. The use of a multilayer perceptron with Bayesian inference (MLPBNN) and support vector machine (SVM) algorithms are studied using the recorded waveforms from the detector. Input variables are constructed for the ML algorithms, which captures the essence of the differences in the head and tail part of the neutron and $γ$ waveforms. A new variable, which utilizes the product of kurtosis and variance calculated from the waveform gives better ranking in terms of separation of neutron and $γ$ events. The training and the testing of the ML algorithms are done using an AmBe neutron source. In the lower energy region, the results obtained from the ML predictions are compared with the results obtained from a time of flight (ToF) technique to benchmark the overall performance of the ML algorithms. A reasonable agreement is observed between the results obtained from ML algorithm and the ToF experiment in the studied energy range. The MLPBNN gives better discriminatory power for the neutron and $γ$ events than the SVM algorithm.",
  "authors": [
    "S. Panda",
    "P. K. Netrakanti",
    "S. P. Behera",
    "R. R. Sahu",
    "K. Kumar",
    "R. Sehgal",
    "D. K. Mishra",
    "V. Jha"
  ],
  "published": "2025-06-13T12:47:41Z",
  "updated": "2025-11-18T07:09:41Z",
  "categories": [
    "physics.ins-det",
    "hep-ex",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.1016/j.nima.2025.171170"
}