{
  "arxiv_id": "2508.00503v2",
  "url": "https://arxiv.org/abs/2508.00503v2",
  "pdf_url": "https://arxiv.org/pdf/2508.00503v2.pdf",
  "title": "Using tunable coherence for reaching micrometer coherence lengths and suppressing stray light in a power-recycled Michelson interferometer",
  "abstract": "By reentering into laser interferometers, scattered or stray light introduces non-linear noise. This is a major limitation of precision interferometers as preventing such parasitic light is nearly impossible. Thus, substantial effort is put into mitigating the reentering of these fields in various ways. Ground-based laser interferometric gravitational wave detectors employ such mitigation techniques to reduce otherwise restrictive stray light noise. However, they are now reaching sensitivities where conventional mitigation techniques reach limitations. Further improvements planed for future observatories are placing even more demanding constraints on tolerable stray light power. We previously presented tunable coherence as a possible technique to ease these constraints and suppress unwanted coherent interference. For these promising demonstrations, the remaining coherence length and achievable suppression in length-constrained layouts was limited, among other things, by the used pseudo-random-noise phase modulation frequency. In this work, we demonstrate stray light suppression and cavity performance at modulation frequencies up to 10 GHz. This reduces the remaining coherence to a few centimeter in an interferometer, and even to the scale of the laser wavelength in a cavity. We further present a first demonstration of tunable coherence in a power-recycled Michelson interferometer, successfully suppressing stray light in a more complex topology.",
  "authors": [
    "Daniel Voigt",
    "Oliver Gerberding"
  ],
  "published": "2025-08-01T10:31:09Z",
  "updated": "2025-11-19T08:58:06Z",
  "categories": [
    "physics.optics",
    "astro-ph.IM",
    "gr-qc",
    "physics.ins-det"
  ],
  "primary_category": "physics.optics"
}