{
  "arxiv_id": "2510.00388v3",
  "url": "https://arxiv.org/abs/2510.00388v3",
  "pdf_url": "https://arxiv.org/pdf/2510.00388v3.pdf",
  "title": "A study of the electronic and ionic structure, for competing states of fully and partially ionized hydrogen, using the neutral pseudo-atom method as well as a classical map for the electron subsystem",
  "abstract": "Prof. Bonitz and his collaborators have made seminal contributions to the study of the uniform electron fluid and the electron-proton fluid, viz., hydrogen, in using {\\it ab initio} simulations, as reflected in this festschrift. Here we review the theoretical methods available for these systems where traditional small-parameter methods fail. We use the neutral-pseudo atom (NPA) method, and a classical map for quantum electrons to study hydrogen plasmas. We show that {\\it both} fully-ionized and partially-ionized hydrogen phases can exist with the same nominal density and temperature, at pressures and temperatures of interest to planetary physics. The mean ionization $\\bar{Z}$, pair-distribution functions, free energies, pressures and conductivities are calculated for the competing phases. Here $\\bar{Z}$ is also a measure of the miscibility of fully ionized and un-ionized hydrogen. Recent studies using path-integral Monte Carlo methods, and $N$-atom Density Functional Theory (DFT) simulations have provided essential structure data including the electron-electron structure factor $S_{ee}(k)$ that enters into interpretation of X-ray Thomson scattering and other diagnostics. We show that these structure data can be inexpensively evaluated using classical-map schemes for fully ionized plasmas, and more generally, using one-atom (average-atom) DFT methods for partially ionized systems.",
  "authors": [
    "M. W. C. Dharma-wardana"
  ],
  "published": "2025-10-01T01:00:54Z",
  "updated": "2025-11-17T23:23:23Z",
  "categories": [
    "physics.plasm-ph",
    "cond-mat.stat-mech"
  ],
  "primary_category": "physics.plasm-ph"
}