{
  "arxiv_id": "2511.13862v1",
  "url": "https://arxiv.org/abs/2511.13862v1",
  "pdf_url": "https://arxiv.org/pdf/2511.13862v1.pdf",
  "title": "Dual Origins of Rapid Flare Ribbon Downflows in an X9-class Solar Flare",
  "abstract": "We detect rapid downflows of 150-217 km/s in IRIS Si IV 1402.77 nm measurements of an X9-class solar flare on 2024 October 3rd. The fast redshift values persist for over 15 minutes from flare onset, and can be split into two distinct stages of behavior, suggesting that multiple mechanisms are responsible for the downwards acceleration of flare ribbon plasma. The first stage of rapid downflows are synchronized with peaks in emission from the Advanced Space-based Solar Observatory Hard X-ray Imager (ASO-S/HXI) and Large Yield Radiometer (LYRA) Lyman-alpha measurements, indicative that the chromospheric downflows (with a maximum redshift of 176 km/s) result from chromospheric condensations associated with impulsive energy release in the solar flare. Later in the event, strong Si IV flare ribbon downflows persist (to a maximum value of 217 km/s), despite the magnetic flux rate falling to zero, and high-energy HXR and Lyman-alpha measurements returning to background levels. This is reflective of downflows in the flare ribbon footpoints of flare-induced coronal rain. Hard X-ray spectral analysis supports this scenario, revealing strong non-thermal emission during the initial downflow stage, falling near background levels by the second stage. Despite these distinct and contrasting stages of ribbon behavior, Si IV Doppler velocities exhibit quasi-periodic pulsations with a constant ~50 s period across the 15-minute flare evolution (independently of loop length). We deduce that these pulsations are likely caused by MHD oscillations in the magnetic arcade. Finally, we utilize machine learning K-means clustering methods to quantify line profile variations during the stages of rapid downflows.",
  "authors": [
    "Ryan J. French",
    "William H. Ashfield",
    "Cole A. Tamburri",
    "Maria D. Kazachenko",
    "Marie Dominique",
    "Marcel Corchado Albelo",
    "Amir Caspi"
  ],
  "published": "2025-11-17T19:26:52Z",
  "updated": "2025-11-17T19:26:52Z",
  "categories": [
    "astro-ph.SR",
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.SR"
}