{
  "arxiv_id": "2511.14938v1",
  "url": "https://arxiv.org/abs/2511.14938v1",
  "pdf_url": "https://arxiv.org/pdf/2511.14938v1.pdf",
  "title": "Proton specific entropy as a proxy for the $O^{7+}/O^{6+}$ charge state ratio over heliocentric distance",
  "abstract": "While the fast solar wind has well-established origins in coronal holes, the source of the slow solar wind remains uncertain. Compositional metrics, such as heavy ion charge state ratios are set in the lower corona, providing insights into solar wind source regions. However, prior to the launch of Solar Orbiter, in situ measurements of heavy ion charge state were limited to distances of 1 AU and beyond. We investigate proton specific entropy as a proxy for the oxygen charge state ratio ($O^{7+}/O^{6+}$),which generally becomes frozen-in below ~1.8 Rsun, leveraging observations from Solar Orbiter's Heavy Ion Sensor and Proton and Alphas Sensor covering 0.28 to 1 AU. Our analysis confirms a strong anti-correlation between specific entropy and the oxygen charge state ratio that persists over a broad range of distances in the inner heliosphere. We categorize observed solar wind into fast solar wind, slow Alfvenic solar wind, and slow solar wind, identifying clear distinctions in specific entropy values and charge state ratios across these types. The work demonstrates the potential to use proton specific entropy as a classifier of solar wind source regions throughout the heliosphere. By establishing the $S_p$-$O^{7+}/O^{6+}$ relationship and quantifying its radial dependence, the specific entropy can be used as a quantity to identify the solar wind source region in the absence of in-situ charge state measurements. This motivates future studies as to the applicability of this proxy to near-Sun observations (such as Parker Solar Probe) and throughout the inner heliosphere.",
  "authors": [
    "Jack D. Collard",
    "Tamar Ervin",
    "Ryan M. Dewey",
    "Yeimy J. Rivera",
    "Aidan J. Nakhleh",
    "Jean-Baptiste Dakeyo",
    "Samuel T. Badman",
    "Trevor A. Bowen",
    "John W. Bonnell",
    "Nicholeen M. Viall",
    "Susan T. Lepri",
    "Jim M. Raines",
    "Stuart D. Bale"
  ],
  "published": "2025-11-18T21:53:11Z",
  "updated": "2025-11-18T21:53:11Z",
  "categories": [
    "astro-ph.SR",
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.SR"
}