{
  "arxiv_id": "2511.15562v1",
  "url": "https://arxiv.org/abs/2511.15562v1",
  "pdf_url": "https://arxiv.org/pdf/2511.15562v1.pdf",
  "title": "High Density Hybridisation Using ENIG Bumping and Anisotropic Conductive Films",
  "abstract": "Fine-pitch hybridisation processes are essential for next-generation pixel detectors and high-density microelectronic assemblies. Conventional bump-bonding techniques, although reliable, remain costly and difficult to implement for single-die applications.   In this work, we present flip-chip hybridisation results combining Electroless Nickel Immersion Gold (ENIG) bumping with Anisotropic Conductive Film (ACF) bonding, both developed in-house. This method enables fine-pitch interconnections without requiring wafer-level processing.   The feasibility of the ENIG-ACF process for functional devices was demonstrated by hybridising functional Timepix3 ASIC and Ti-LGAD (Trench Isolated Low-Gain Avalanche Detector) sensors with 55 um pitch. The approach was then extended to test structures with 25 um pitch, using aligned-particle ACFs. The analysis revealed that the main limitation originated from the mismatch between ACF thickness and bump height, underlining the importance of interface geometry optimisation. To address this, a dedicated simulation program was developed to model the isotropic growth of ENIG bumps and to determine the optimum bump height as a function of ACF thickness and pixel-matrix geometry.   The results provide valuable guidelines for future high connection density assemblies and demonstrate the potential of the ENIG-ACF process as a scalable, low-cost alternative to conventional bump-bonding techniques.",
  "authors": [
    "Haripriya Bangaru",
    "Giovanni Calderini",
    "Dominik Dannheim",
    "Rui De Oliveira",
    "Ahmet Lale",
    "Moritz Lauser",
    "Mateus Vicente Barreto Pinto",
    "Peter Svihra"
  ],
  "published": "2025-11-19T15:56:03Z",
  "updated": "2025-11-19T15:56:03Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}