{
  "arxiv_id": "2509.25423v2",
  "url": "https://arxiv.org/abs/2509.25423v2",
  "pdf_url": "https://arxiv.org/pdf/2509.25423v2.pdf",
  "title": "Electropolishing-Induced Topographic Defects in Niobium: Insights and Implications for Superconducting Radio Frequency Applications",
  "abstract": "Electropolishing is the premier surface preparation method for high-Q, high-gradient superconducting RF cavities made of Nb. This leaves behind an apparently smooth surface, yet the achievable peak magnetic fields fall well below the superheating field of Nb, in most cases. In this work, the ultimate surface finish of electropolishing was investigated by studying its effect on highly polished Nb samples. Electropolishing introduces high slope angle sloped-steps at grain boundaries. The magnetic field enhancement and superheating field suppression factors associated with such a geometry are calculated in the London theory. Despite the by-eye smoothness of electropolished Nb, such defects compromise the stability of the low-loss Meissner state, likely limiting the achievable peak accelerating fields in superconducting RF cavities. Finally, the impact of surface roughness on impurity diffusion is investigated which can link surface roughness to the effectiveness of heat treatments like low-temperature baking or nitrogen infusion in the vortex nucleation or hydride hypotheses. Surface roughness tends to decrease the effective dose of impurities as a result of the expansion of impurities into regions with greater internal angle. The effective dose of impurities can be protected by minimizing slope angles and step heights, ensuring uniformity.",
  "authors": [
    "Oleksandr Hryhorenko",
    "Anne-Marie Valente-Feliciano",
    "Eric M. Lechner"
  ],
  "published": "2025-09-29T19:31:12Z",
  "updated": "2026-02-16T22:54:04Z",
  "categories": [
    "cond-mat.supr-con",
    "cond-mat.mtrl-sci",
    "physics.acc-ph",
    "physics.app-ph"
  ],
  "primary_category": "cond-mat.supr-con",
  "doi": "10.1088/1361-6668/ae40a3"
}