{
  "arxiv_id": "2602.15431v1",
  "url": "https://arxiv.org/abs/2602.15431v1",
  "pdf_url": "https://arxiv.org/pdf/2602.15431v1.pdf",
  "title": "Flux pumping and bifurcated relaxations of helical core in 3D magnetohydrodynamic modelling of ASDEX Upgrade plasmas",
  "abstract": "Flux pumping was achieved in recent hybrid scenario experiments in the ASDEX Upgrade (AUG) tokamak, which is characterized by a sawtooth-free helical quiescent state and the anomalous radial redistribution of toroidal current density and poloidal magnetic flux. In this article, the self-regulation mechanism of the AUG core plasma during flux pumping is investigated at realistic parameters using the JOREK code based on the two-temperature, nonlinear, full magnetohydrodynamic (MHD) model. A key milestone in AUG flux pumping modelling is achieved by quantitatively reproducing the clamped current density and safety factor profiles in the plasma core, demonstrating the effectiveness of the dynamo effect in sustaining the flux pumping state. The dynamo term, that is of particular interest, is primarily generated by the pressure-gradient driven m/n = 1/1 quasi-interchange-like MHD instability. The work systematically extrapolates the parameter regimes of flux pumping from the above AUG base case by scanning dissipation coefficients and plasma beta. The simulation results reveal bifurcated plasma behaviours at different Hartmann numbers, including distinct states such as flux pumping (helical core with a flat current density), sawteeth (periodic kink-cycling), single crash (without subsequent cycle), and quasi-stationary magnetic island (peaked current density). Transitions from marginal flux pumping state to sawteeth are observed in long-term simulations. The relationships between system dissipation, plasma beta, and different plasma states are carefully analyzed. For practical purposes, the potential operational window for flux pumping, as determined by plasma density and temperature, is estimated. The modelling efforts advance the understanding of flux pumping and facilitate the development of a fast surrogate model for efficient evaluation of flux pumping.",
  "authors": [
    "H. Zhang",
    "M. Hoelzl",
    "I. Krebs",
    "A. Burckhart",
    "A. Bock",
    "S. Guenter",
    "V. Igochine",
    "K. Lackner",
    "D. Bonfiglio",
    "E. Fable",
    "F. Stefanelli",
    "R. Ramasamy",
    "H. Zohm",
    "JOREK TEAM",
    "ASDEX UPGRADE TEAM"
  ],
  "published": "2026-02-17T08:52:36Z",
  "updated": "2026-02-17T08:52:36Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}