{
  "arxiv_id": "2601.15391v1",
  "url": "https://arxiv.org/abs/2601.15391v1",
  "pdf_url": "https://arxiv.org/pdf/2601.15391v1.pdf",
  "title": "Asymptotic scaling theory of electrostatic turbulent transport in magnetised fusion plasmas",
  "abstract": "Turbulent transport remains one of the principal obstacles to achieving efficient magnetic confinement in fusion devices. Two of the dominant drivers of the turbulence are microscale instabilities fuelled by electron- and ion-temperature gradients (ETG and ITG), whose nonlinear saturation determines the cross-field transport of particles and energy. Despite decades of study, predictive modelling of this turbulence has been limited either to expensive gyrokinetic simulations or to reduced models calibrated by fitting to numerical or experimental data, restricting their utility for reactor design. Here we present a simple asymptotic scaling theory that unifies ETG- and ITG-driven turbulence within a common framework. By balancing the fundamental time scales of linear growth, nonlinear decorrelation, and parallel propagation, the theory isolates the dependence of the heat flux on equilibrium parameters to two key quantities: the parallel system scale and the outer-scale aspect ratio. We show that these quantities encapsulate the essential physics of saturation, leading to distinct predictions for ETG and ITG transport: a cubic scaling with the temperature gradient in the electron channel, and a linear scaling in the ion channel. Extensive nonlinear gyrokinetic simulations confirm that these theoretical predictions hold irrespective of the magnetic geometry (slab, tokamak, or stellarator), including the first numerical confirmation of the cubic ETG scaling anticipated by earlier theory. By isolating the dependence on just the parallel system scale and the outer-scale aspect ratio, our framework provides a physics-based foundation for fast, geometry-aware transport models, offering a pathway toward reactor optimisation in both tokamaks and stellarators.",
  "authors": [
    "T. Adkins",
    "I. G. Abel",
    "M. Barnes",
    "S. Buller",
    "W. Dorland",
    "P. G. Ivanov",
    "R. Meyrand",
    "F. I. Parra",
    "A. A. Schekochihin",
    "J. Squire"
  ],
  "published": "2026-01-21T19:03:08Z",
  "updated": "2026-01-21T19:03:08Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}