{
  "arxiv_id": "2601.15567v1",
  "url": "https://arxiv.org/abs/2601.15567v1",
  "pdf_url": "https://arxiv.org/pdf/2601.15567v1.pdf",
  "title": "Discovery of Density Limit Disruption Induced by Core-localized Alfv${é}$nic Ion Temperature Gradient Instabilities in a Tokamak Plasma",
  "abstract": "To achieve a high energy gain, the fusion reactor plasma must reach a very high density. However, the tokamak plasmas ofen undergo disruption when the density exceeds the Greenwald density. The density limit disruption in tokamak plasmas is a mysterious barrier to magnetic confinement nuclear fusion, and hitherto, is still an unresolved issue. Over the past several years, the high density experiments with Greenwald density ratio $n_e/n_{eG}\\sim1$ has been carried out using the conventional gas-puff fuelling method in HL-2A NBI and Ohmically heated plasmas. It is found for the first time that there are multiple-branch MHD instabilities in the core plasmas while $n_e/n_{eG}>0.85$. The simulation analysis suggests that the core-localized magnetohydrodynamics (MHD) activities belong to Alfv${é}$nic ion temperature gradient (AITG) modes, and on experiment firstly, it is discovered that they trigger the minor or major disruption of bulk plasmas while the density is peaked. These new findings are of great importance to figure out and understand the origin of density limit disruptions, as well as to forecast and avoid them for future fusion rectors.",
  "authors": [
    "Wei Chen",
    "Liwen Hu",
    "Jianqiang Xu",
    "Ruirui Ma",
    "Peiwan Shi",
    "Rui Ke",
    "Ting Long",
    "Zhiyong Qiu",
    "Haotian Chen",
    "Xiaoxue He",
    "Yonggao Li",
    "Liming Yu",
    "Wenping Guo",
    "Min Jiang",
    "Jinming Gao",
    "Xin Yu",
    "Zhengji Li",
    "Huiling Wei",
    "Deliang Yu",
    "Zhongbing Shi"
  ],
  "published": "2026-01-22T01:12:54Z",
  "updated": "2026-01-22T01:12:54Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}