[
  {
    "arxiv_id": "2601.17554v1",
    "url": "https://arxiv.org/abs/2601.17554v1",
    "pdf_url": "https://arxiv.org/pdf/2601.17554v1.pdf",
    "title": "Full event interpretation with machine-learning-based particle-flow reconstruction in the CMS detector",
    "abstract": "The particle-flow (PF) algorithm constructs a global description of each particle collision by producing a comprehensive list of final-state particles, and is central to event reconstruction in the CMS experiment at the CERN LHC. The existing PF implementation relies on physics-motivated heuristics and assumptions that can be replaced by machine-learning (ML) models trained directly on simulated data and naturally suited to modern graphics processing units (GPUs). A state-of-the-art ML-based PF (MLPF) reconstruction algorithm, implemented within the CMS software framework, is presented. The MLPF algorithm performs a learnable full-event reconstruction on GPUs, generalizes across detector conditions and collision energies, and replaces multiple modular reconstruction steps with a single unified model. Physics performance comparable to standard PF reconstruction is achieved in both simulation and data, with improved jet energy resolution and inference time. In simulated top quark-antiquark events under LHC Run-3 (2023$-$2024) conditions, the jet energy resolution improves by 10$-$20% for jets with transverse momentum between 30$-$100 GeV. Inference time is evaluated using simulated multijet events, with a median of 20 ms per event on an Nvidia L4 GPU, compared to approximately 110 ms for the standard CMS PF reconstruction.",
    "authors": [
      "CMS Collaboration"
    ],
    "published": "2026-01-24T18:49:22Z",
    "updated": "2026-01-24T18:49:22Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.17463v1",
    "url": "https://arxiv.org/abs/2601.17463v1",
    "pdf_url": "https://arxiv.org/pdf/2601.17463v1.pdf",
    "title": "Polyurethane-Based Scintillators for Neutron and Gamma Radiation Detection in Medical and Industrial Applications",
    "abstract": "Organic scintillators using a solid polyurethane (PU) matrix have been introduced to combine the robustness of a construction material with scintillating properties that allow gamma rays and fast neutrons to be detected efficiently and at low cost. This work compares two corresponding materials, the older M600 and the more recent M700, with EJ-276D and EJ-200 representing common plastic scintillators with and without pulse-shape discrimination (PSD) capabilities, respectively. Characterization measurements were performed with small samples of 26 mm diameter and 10 mm height, which were coupled to a photomultiplier tube (PMT) and simultaneously exposed to 252Cf fission neutrons and 137Cs gamma rays. M700 turned out to provide the best PSD performance and about the same light yield as EJ-276D, while its light pulses exhibit a shorter pulse decay. An accelerated ageing process applied in between two test campaigns was too short to trigger distinct performance degradation in any of the materials, though optical degradation was visible in EJ-276D and in EJ-200 but not in the PU-based materials. Nevertheless, the extremely robust polyurethane matrix promises advantages in medical and industrial applications where resilience and long-term stability are of crucial importance.",
    "authors": [
      "Olga Maiatska",
      "Torsten Dünnebacke",
      "Martin Kreuels",
      "Guntram Pausch",
      "Falko Scherwinski",
      "Jürgen R. Stein"
    ],
    "published": "2026-01-24T13:27:53Z",
    "updated": "2026-01-24T13:27:53Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex",
      "physics.app-ph",
      "physics.med-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.08532v2",
    "url": "https://arxiv.org/abs/2601.08532v2",
    "pdf_url": "https://arxiv.org/pdf/2601.08532v2.pdf",
    "title": "Enhanced Athermal Phonon Responsivity in a Kinetic Inductance Detector with Integrated Phonon Collectors",
    "abstract": "Cryogenic phonon detectors are adopted in light dark matter searches and coherent elastic neutrino-nucleus scattering experiments as they can achieve low energy thresholds. The phonon mediated sensing of silicon particle absorbers has already been proved with Kinetic Inductance Detectors (KIDs), acting both as sensors and athermal phonon absorbers at the same time. In this work we present the design and the performance of an improved detector, where the KID acts only as sensor and is coupled to dedicated phonon collectors. The separation between the detector and the collectors increases the variation of the quasi-particle density within the device, thereby enhancing its responsivity. The meander of the KID is composed of a 77nm trilayer wire of Aluminum-Titanium-Aluminum, while the phonon collectors are made of a 100nm Aluminum layer and act as quasi-particles funnels. Inside the collectors, the absorbed athermal phonons generate quasi-particles which, after diffusion, are trapped in the lower-gap superconducting trilayer. The performance of this setup is compared to that of a standard phonon-mediated KID, showing an increase in responsivity by around a factor of five.",
    "authors": [
      "Leonardo Pesce",
      "Alessio Ludovico De Santis",
      "Martino Calvo",
      "Matteo Cappelli",
      "Usasi Chowdhury",
      "Angelo Cruciani",
      "Giorgio Del Castello",
      "Daniele Delicato",
      "Matteo Folcarelli",
      "Matteo del Gallo Roccagiovine",
      "Alessandro Monfardini",
      "Davide Quaranta",
      "Marco Vignati"
    ],
    "published": "2026-01-13T13:17:19Z",
    "updated": "2026-01-24T10:14:51Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.11989v2",
    "url": "https://arxiv.org/abs/2601.11989v2",
    "pdf_url": "https://arxiv.org/pdf/2601.11989v2.pdf",
    "title": "Topological aspects of zero modes in cavity resonators",
    "abstract": "We discuss the relationship between the zero modes of electromagnetic fields in a cavity resonator and the cavity's topological characteristics. We show that the dimension of the electromagnetic zero-mode space coincides with the dimension of the corresponding homology group of the cavity. Moreover, we prove that the alternating sum of the dimensions of the electromagnetic zero-mode spaces is closely related to the Euler characteristic of the cavity boundary, and hence to the integral of the curvature.",
    "authors": [
      "Osamu Kamigaito"
    ],
    "published": "2026-01-17T09:46:16Z",
    "updated": "2026-01-23T23:30:26Z",
    "categories": [
      "physics.acc-ph",
      "physics.class-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.17220v1",
    "url": "https://arxiv.org/abs/2601.17220v1",
    "pdf_url": "https://arxiv.org/pdf/2601.17220v1.pdf",
    "title": "Evaluation of the beam-induced depolarization of the HJET target at the EIC",
    "abstract": "The Polarized Atomic Hydrogen Gas Jet Target (HJET) has played a central role in the absolute calibration of proton beam polarization at RHIC and is foreseen as a key element of the hadron polarimetry program at the future Electron--Ion Collider (EIC). The substantially higher beam current, reduced bunch spacing, and shorter bunch length planned for EIC operation motivate a careful reassessment of possible beam-induced depolarization of the jet target. In this paper, the depolarization of ground-state hydrogen atoms caused by the time-dependent magnetic field of the circulating polarized proton beam is quantitatively evaluated. The hydrogen atom is treated as a four-level hyperfine system in a holding magnetic field, and transitions driven by harmonic components of the bunch-induced magnetic field are analyzed using time-dependent quantum-mechanical evolution along atomic trajectories. Numerical tracking of hydrogen atoms through the beam region is performed using nominal EIC beam parameters. It is shown that, for a holding field of $120\\,\\mathrm{mT}$ (as used at RHIC), the resulting depolarization of the jet target at the EIC is negligibly small, $\\lesssim 0.01\\%$, and well below the level relevant for EIC polarization accuracy requirements. The stability of this result with respect to plausible variations of the EIC proton beam parameters is also evaluated.",
    "authors": [
      "A. A. Poblaguev"
    ],
    "published": "2026-01-23T23:08:45Z",
    "updated": "2026-01-23T23:08:45Z",
    "categories": [
      "physics.ins-det",
      "physics.acc-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.17186v1",
    "url": "https://arxiv.org/abs/2601.17186v1",
    "pdf_url": "https://arxiv.org/pdf/2601.17186v1.pdf",
    "title": "Two-Stage Gamma-Neutron Source Classification in Water Cherenkov Detectors: Energy Threshold Screening and Machine Learning Pulse Analysis",
    "abstract": "Water Cherenkov detectors offer a robust and economical solution for real-time radiation monitoring by detecting Cherenkov light from charged particles moving faster than light in water. This work presents a novel two-stage classification framework for gamma-neutron discrimination: an initial physics-based energy threshold filters unambiguous low-energy gamma sources, followed by a machine learning ensemble that resolves ambiguities at higher energies. The detector response was characterized using $^{60}$Co (1.17/1.33~MeV), $^{137}$Cs (0.66~MeV), and a shielded $^{241}$AmBe source, with lead, paraffin, and cadmium shielding employed to isolate neutron and gamma interactions. Energy calibration established a linear ADU to MeV conversion ($R^2 = 0.966$), enabling identification of a neutron detection threshold at $2.62 \\pm 0.77$~MeV via a $3σ$ significance analysis. Stage one categorizes sources as pure gamma (below threshold) or neutron-emitting (at threshold). For ambiguous cases above threshold, a machine learning pipeline utilizing pulse shape analysis was developed. A soft voting ensemble (Bagging, CatBoost, and MLP) achieved an accuracy of 0.816 and an AUC of 0.921. This hybrid scheme combines physics-based filtering with ML refinement, offering an interpretable and scalable solution for nuclear security, nonproliferation monitoring, and fundamental radiation research.",
    "authors": [
      "Alejandro Núñez-Selin",
      "Iván Sidelnik",
      "Christian Sarmiento-Cano",
      "Hernán Asorey",
      "Luis A. Núñez"
    ],
    "published": "2026-01-23T21:32:04Z",
    "updated": "2026-01-23T21:32:04Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.17161v1",
    "url": "https://arxiv.org/abs/2601.17161v1",
    "pdf_url": "https://arxiv.org/pdf/2601.17161v1.pdf",
    "title": "Industrial Deposition of Wavelength-Shifting Films for Liquid Argon Photon Detection Systems",
    "abstract": "The Deep Underground Neutrino Experiment (DUNE) Phase-II Far Detector is considering an unprecedentedly large-area ~2000 m$^2$ photon detection system to achieve a target mean light yield of 180 PE/MeV. Meeting this requirement demands scalable, cost-effective, and high-quality wavelength-shifter (WLS) coatings capable of converting 127 nm liquid-argon scintillation light into visible photons with high efficiency. We report on the successful realization of an industrial physical vapor deposition (PVD) process for \\textit{p}-terphenyl (pTP) coatings, adapted from vacuum deposition techniques developed for OLED display manufacturing, to produce uniform WLS layers on large-area inorganic substrates, a task traditionally challenged by adhesion and uniformity issues at organic--inorganic interfaces. Surface characterization by profilometry and spectroscopic measurements confirms sub-10% thickness uniformity for 1-2 $μ$m films and emission spectra consistent with high-quality pTP reference samples. The industrial process demonstrates reproducibility, scalability, and significantly reduced production time compared to laboratory-based methods, while maintaining the optical quality required for large-scale liquid-argon time-projection chamber (LArTPC) photon detection systems. These results establish a viable pathway for mass production of high-performance pTP coatings for DUNE FD3 and future neutrino experiments.",
    "authors": [
      "Babak Azmoun",
      "Aleksey Bolotnikov",
      "Francesca Capocasa",
      "Milind Diwan",
      "Yimin Hu",
      "Jay Hyun Jo",
      "William Lenz",
      "Yichen Li",
      "Abdul Rumaiz",
      "Vyara Tsvetkova",
      "Matteo Vicenzi"
    ],
    "published": "2026-01-23T20:48:23Z",
    "updated": "2026-01-23T20:48:23Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.16928v1",
    "url": "https://arxiv.org/abs/2601.16928v1",
    "pdf_url": "https://arxiv.org/pdf/2601.16928v1.pdf",
    "title": "Neutron spectrum measurement in the Yemi underground laboratory",
    "abstract": "We report on the measurement of neutron energy spectra at the newly established Yemi Underground Laboratory (Yemilab) in the Republic of Korea, designed to host dark matter and rare-event search experiments. A high-sensitivity neutron spectrometer was employed, consisting of ten cylindrical {}^{3}He proportional counters, eight of which were embedded in cylindrical high-density polyethylene moderators of various sizes. To quantify and mitigate contributions from internal α-backgrounds, each detector underwent a dedicated background measurement using a cadmium-shielded box. These backgrounds, primarily originating from trace amounts of U and Th in the stainless-steel housings, were characterized and subtracted during data analysis. Neutron measurements were carried out at three locations within the Yemilab between March to October 2023. After waveform-based event selection and correction for \\alphasym-backgrounds, neutron count rates were estimated and corresponding energy spectra were reconstructed using the unfolding method. The total neutron fluence rates were measured ranged from (3.24 $\\pm$ 0.11) to (4.01 $\\pm$ 0.10) $\\times~10^{-5}~ {cm}^{-2}~{s}^{-1}$, with thermal and fast neutron components (1 - 10 MeV) ranging from (1.32 $\\pm$ 0.05) to (1.51 $\\pm$ 0.05) $\\times 10^{-5}~{cm}^{-2}~{s}^{-1}$ and (0.27 $\\pm$ 0.03) to (0.34 $\\pm$ 0.10) $\\times~10^{-5}~{cm}^{-2}~{s}^{-1}$, respectively.",
    "authors": [
      "Joong Hyun Kim",
      "Sinchul Kang",
      "HyeoungWoo Park",
      "Jungho Kim",
      "Hyeonseo Park",
      "Young Soo Yoon",
      "Hongjoo Kim",
      "Yeongduk Kim",
      "Jungho So",
      "SungHyun Kim"
    ],
    "published": "2026-01-23T17:40:36Z",
    "updated": "2026-01-23T17:40:36Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.16925v1",
    "url": "https://arxiv.org/abs/2601.16925v1",
    "pdf_url": "https://arxiv.org/pdf/2601.16925v1.pdf",
    "title": "Investigating ultra-thin 4H-SiC AC-LGADs for superior radiation-hard timing applications",
    "abstract": "The Low Gain Avalanche Diodes (LGADs) are promising particle detectors for timing resolution better than $50$ ps under a high radiation environment. This study investigates n-in-p LGAD architecture, focusing on ultra-thin sensors of thickness less than $50\\ μ$m using the WeightField2 program. The capabilities of WeightField2 are demonstrated by comparing its results with irradiation measurements from an FBK LGAD wafer, showing good agreement across unirradiated and neutron-irradiated conditions. This paper presents device simulations in High Luminosity LHC conditions (lifetime integrated fluence $ \\mathcal{O} (10^{14})\\ \\mathrm{n_{eq}~cm^{-2}}$, temperature $ \\approx 243\\ \\mathrm{K} $), and taking into account radiation damage, gain reduction due to fluence, and lattice defects. It is shown that a 20 $μ$m thick sensor achieves the best timing performance. Among Silicon (Si), Diamond (C), and 4H-Silicon Carbide (4H-SiC), we found 4H-SiC to be the most promising: it provides the highest gain value for a fixed thickness and gain implant layer configuration, and best retains high charge collection value and timing capability under increasing fluence up to $50\\times10^{14}\\ \\mathrm{n_{eq}~cm^{-2}}$. A time resolution less than 25 ps is reported with different gain implant concentrations for a $20 μ$m 4H-SiC sensor. This work presents the potential of SiC-based LGADs in high-radiation collider environments.",
    "authors": [
      "Jaideep Kalani",
      "Saptarshi Datta",
      "Ganesh J Tambve",
      "Prabhakar Palni"
    ],
    "published": "2026-01-23T17:34:01Z",
    "updated": "2026-01-23T17:34:01Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.18956v2",
    "url": "https://arxiv.org/abs/2511.18956v2",
    "pdf_url": "https://arxiv.org/pdf/2511.18956v2.pdf",
    "title": "Ion Temperature Anisotropy Limits from Magnetic Curvature Scattering in Magnetotail Reconnection Jets",
    "abstract": "In collisionless plasmas, relaxation of the deviations of ion velocity distribution functions (VDFs) from local thermodynamic equilibrium occurs through particle interactions with electromagnetic fields. In particular, in the Earth's magnetotail, the deviations of the ion VDFs, typically consisting of multiple components, from the equilibrium must be limited to maintain stability of the current sheet. Curvature scattering is a leading candidate mechanism to limit such deviations, but its role remains insufficiently understood. We investigate the limits of ion temperature anisotropy in a magnetotail-like configuration by modeling a quasi-1D current sheet with a finite magnetic field curvature and three ion populations. We derive analytical thresholds for anisotropy based on current sheet stability and validate against spacecraft observations and numerical simulations. Our findings demonstrate that curvature scattering imposes limits on ion anisotropies, thereby maintaining the stability of the current sheet.",
    "authors": [
      "Louis Richard",
      "Anton V. Artemyev",
      "Cecilia Norgren",
      "Xin An",
      "Sergey R. Kamaletdinov",
      "Yuri V. Khotyaintsev"
    ],
    "published": "2025-11-24T10:18:43Z",
    "updated": "2026-01-23T16:29:04Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2411.03476v5",
    "url": "https://arxiv.org/abs/2411.03476v5",
    "pdf_url": "https://arxiv.org/pdf/2411.03476v5.pdf",
    "title": "Functional Verification for Endcap Concentrator ASICs in the High-Granularity Calorimeter Upgrade of CMS",
    "abstract": "The High-Granularity Calorimeter (HGCAL) will replace the current CMS Endcap Calorimeter during Long-Shutdown 3. The Endcap Concentrator (ECON) ASICs represent key elements in the readout chain, processing trigger (ECON-T) and data (ECON-D) streams from the HGCROC to the lpGBT. The ECONs will operate in a radiation environment with a High-Energy Hadron (${E\\geq20MeV}$) flux up to $2\\cdot10^{7} cm^{-2}s^{-1}$. This contribution describes the Universal Verification Methodology (UVM)-based functional verification of the ECON ASICs focusing on the re-use of existing components to manage the complexity of the verification environment.",
    "authors": [
      "M. Lupi",
      "G. Bergamin",
      "D. Ceresa",
      "D. Coko",
      "G. Cummings",
      "V. Gingu",
      "M. Hammer",
      "J. Hirschauer",
      "J. Hoff",
      "N. Kharwadkar",
      "S. Kulis",
      "C. Mantilla-Suarez",
      "D. Noonan",
      "P. Rubinov",
      "S. Scarfì",
      "A. Shenai",
      "C. Syal",
      "X. Wang",
      "R. Wickwire",
      "J. Wilson"
    ],
    "published": "2024-11-05T19:59:49Z",
    "updated": "2026-01-23T15:51:02Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/02/C02004"
  },
  {
    "arxiv_id": "2411.03478v5",
    "url": "https://arxiv.org/abs/2411.03478v5",
    "pdf_url": "https://arxiv.org/pdf/2411.03478v5.pdf",
    "title": "Reusable Verification Components for High-Energy Physics readout ASICs",
    "abstract": "Verification is a critical aspect of designing front-end (FE) readout ASICs for High-Energy Physics (HEP) experiments. These ASICs share several similar functional features, resulting in similar verification objectives, which can be addressed using comparable verification strategies. This contribution presents a set of re-usable verification components for addressing common verification tasks, such as clock generation, reset handling, configuration, as well as hit and fault injections. The components were developed as part of the CHIPS initiative and they have been successfully used in the verification of multiple HEP ASICs.",
    "authors": [
      "M. Lupi S. Esposito",
      "X. Llopart-Cudie",
      "A. Pulli",
      "S. Scarfí",
      "N. Kharwadkar"
    ],
    "published": "2024-11-05T20:03:43Z",
    "updated": "2026-01-23T15:50:44Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1088/1748-0221/20/02/C02002"
  },
  {
    "arxiv_id": "2511.03857v3",
    "url": "https://arxiv.org/abs/2511.03857v3",
    "pdf_url": "https://arxiv.org/pdf/2511.03857v3.pdf",
    "title": "Challenges and strategies in verification of FastRICH ASIC for the LHCb RICH detector",
    "abstract": "The FastRICH ASIC provides high-precision, triggerless readout for the LS3 Enhancements and Upgrades II of the LHCb RICH detector. The demands of continuous data acquisition and varying hit rates across the detector impose unique challenges on the ASIC's design and verification. This work presents the verification strategy for FastRICH, focusing on functional correctness, timing performance, and operational robustness. The methodology includes simulations across occupancy scenarios, validation of timing precision, and stress testing under pile-up and high-rate conditions. Results demonstrate that FastRICH meets its performance requirements over the full range of expected occupancies. Key design and verification challenges specific to triggerless, fast-timing ASICs are discussed, along with lessons learned for future developments.",
    "authors": [
      "M. Lupi",
      "R. Ballabriga",
      "F. N. Bandi",
      "G. Bergamin",
      "D. Ceresa",
      "D. Gascon",
      "S. Gomez",
      "J. Kaplon",
      "R. Manera",
      "J. Mauricio",
      "A. Paternò",
      "D. Peninon-Herbaut",
      "A. Pulli",
      "S. Scarfì",
      "G. J. Wegrzyn",
      "K. Wyllie"
    ],
    "published": "2025-11-05T20:58:06Z",
    "updated": "2026-01-23T15:48:01Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.17101v1",
    "url": "https://arxiv.org/abs/2601.17101v1",
    "pdf_url": "https://arxiv.org/pdf/2601.17101v1.pdf",
    "title": "Accelerating Molecular H$_2^+$ Beam in AGS and RHIC",
    "abstract": "After the recent success of acceleration molecular H$_2^+$ beam (from EBIS) in Booster to 1.0 GeV/u kinetic energy, we propose to carry out tests to accelerate H$_2^+$ beam in AGS (up to 12 GeV/u) and to RHIC (up to 100 GeV/u). In this Note, we address the main effects that might hamper H$_2^+$ beam acceleration, outline the impacts and benefits of high energy H$_2^+$ beam to BNL.",
    "authors": [
      "Xiaodong Jiang"
    ],
    "published": "2026-01-23T15:36:32Z",
    "updated": "2026-01-23T15:36:32Z",
    "categories": [
      "physics.acc-ph",
      "nucl-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.16822v1",
    "url": "https://arxiv.org/abs/2601.16822v1",
    "pdf_url": "https://arxiv.org/pdf/2601.16822v1.pdf",
    "title": "Design and characterization of the POKERINO prototype for the POKER/NA64 experiment at CERN",
    "abstract": "The NA64 experiment at CERN H4 beamline recently started a high-energy positron-beam program to search for light dark matter particles through a thick-target, missing-energy measurement. To fulfil the energy resolution requirement of the physics measurement $σ_E/E\\simeq2.5\\%/\\sqrt{E\\mathrm{[GeV}]} \\oplus 0.5\\%$ and cope with the constraints and performance requests of the NA64 setup, a new high-resolution homogeneous electromagnetic calorimeter PKR-CAL has been designed. The detector is based on PbWO$_4$ crystals, each read by multiple SiPM sensors to maximize the light collection. The PKR-CAL design has been optimized to mitigate and control unavoidable SiPM saturation effects at high light levels, as well as to minimize the gain fluctuations induced by instantaneous variations of the H4 beam intensity. The $R\\&D$ program culminated in the construction of a small-scale prototype, POKERINO. In this work, we present the results from the experimental characterization campaign of the POKERINO aiming at demonstrating that the obtained performances are compatible with the application requirements.",
    "authors": [
      "Andrei Antonov",
      "Pietro Bisio",
      "Mariangela Bondì",
      "Andrea Celentano",
      "Anna Marini",
      "Luca Marsicano"
    ],
    "published": "2026-01-23T15:20:39Z",
    "updated": "2026-01-23T15:20:39Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.17099v1",
    "url": "https://arxiv.org/abs/2601.17099v1",
    "pdf_url": "https://arxiv.org/pdf/2601.17099v1.pdf",
    "title": "Detecting the full photoemission cone from laser-based ARPES experiments by leveraging deflector technology",
    "abstract": "Angle-resolved photoemission spectroscopy (ARPES) provides a direct access to the electronic band structure of solid and molecular systems. The momentum range accessible by this technique depends directly on the photon energy used, and low-photon-energy sources are insufficient to photoemit electrons over the full Brillouin zone of most quantum materials. In addition, while electrons are emitted over a 2$π$ solid angle, conventional hemispherical analyzers only collect a small subset of those electrons. A previous work [RSI 92, 123907 (2021)] demonstrated that electrons emitted over a larger field-of-view can be acquired in one fixed configuration by accelerating them towards the analyzer with a bias voltage. Here, we extend this work by leveraging the deflector technology of novel ARPES hemispherical analyzers. We demonstrate the ability to detect all $2π$ photoemitted electrons in a fixed configuration for various materials such as gold, cuprates and transition-metal dichalcogenides. This approach is especially advantageous for time-resolved ARPES, as electron dynamics over a large momentum range can be accessed with identical measurement conditions.",
    "authors": [
      "Nicolas Gauthier",
      "Benson Kwaku Frimpong",
      "Dario Armanno",
      "Akib Jabed",
      "Francesco Goto",
      "Vicky Hasse",
      "Claudia Felser",
      "Genda Gu",
      "Heide Ibrahim",
      "Francois Légaré",
      "Fabio Boschini"
    ],
    "published": "2026-01-23T15:15:20Z",
    "updated": "2026-01-23T15:15:20Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "cond-mat.str-el",
      "cond-mat.supr-con",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2601.10571v2",
    "url": "https://arxiv.org/abs/2601.10571v2",
    "pdf_url": "https://arxiv.org/pdf/2601.10571v2.pdf",
    "title": "Corrections for systematic errors in slit-profiler transverse phase space measurements",
    "abstract": "In photo injectors, the transverse emittance is one of the key measures of beam quality as it defines the possible performance of the whole facility. As such it is important to measure the emittance in photo injectors and ensure the accuracy of these measurements. While there are many different methods of measuring the emittance, this paper focuses on quantifying the systematic errors present in transverse phase space measurements taken with slit-profiler methods, i.e. scanning a narrow slit over the beam and continually measuring the passed beamlets' divergence with a downstream profiler. The measurement errors include effects of the slit size, beamlet imaging, and residual space charge. While these effects are generally small, they can have significant impact on the measured emittance when the 2D phase space is strongly coupled. The systematic effects studied and corrections are demonstrated with simulations and measurements from the Photo Injector Test facility at DESY in Zeuthen (PITZ) using a slit-screen emittance scanner.",
    "authors": [
      "C. Richard",
      "M. Krasilnikov",
      "N. Aftab",
      "Z. Amirkhanyan",
      "D. Dmytriiev",
      "A. Hoffmann",
      "X. -K. Li",
      "Z. Lotfi",
      "F. Stephan",
      "G. Vashchenko",
      "S. Zeeshan"
    ],
    "published": "2026-01-15T16:37:09Z",
    "updated": "2026-01-23T14:55:29Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.16794v1",
    "url": "https://arxiv.org/abs/2601.16794v1",
    "pdf_url": "https://arxiv.org/pdf/2601.16794v1.pdf",
    "title": "Improved Kelbg Potentials for $Z>1$ and Application to Carbon Plasmas",
    "abstract": "In this work, we present a general form for the electron-ion diffractive potential derived from the quantum pair density matrix and fit to the improved Kelbg potential for atomic numbers up to $Z = 54$. We apply classical molecular dynamics using the improved Kelbg potential for carbon with various forms of the Pauli potential to compute internal energies and pressures for hot, dense plasma conditions. Our results are compared to an equation of state model based on path integral Monte Carlo and density functional theory simulations to examine the extent to which the improved Kelbg potential reproduces the internal energy and pressure of carbon plasmas. The regions of validity for carbon agree generally with those derived previously for hydrogen once pressure ionization effects are incorporated. Based on our carbon results and previously published hydrogen studies, we discuss the general applicability and limitations of these potentials for equation of state studies in warm dense matter and high energy density plasmas.",
    "authors": [
      "Heather D. Whitley",
      "Michael S. Murillo",
      "John I. Castor",
      "Liam G. Stanton",
      "Lorin X. Benedict",
      "Philip A. Sterne",
      "James N. Glosli",
      "Frank R. Graziani"
    ],
    "published": "2026-01-23T14:47:15Z",
    "updated": "2026-01-23T14:47:15Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.16760v1",
    "url": "https://arxiv.org/abs/2601.16760v1",
    "pdf_url": "https://arxiv.org/pdf/2601.16760v1.pdf",
    "title": "RF Applications",
    "abstract": "Radiofrequency (RF) systems play a critical role in particle accelerators by enabling the acceleration, manipulation, and diagnosis of charged particle beams. At the heart of many of these systems lies the RF cavity, whose effective design requires close collaboration among RF designers, beam physicists, and mechanical engineers. This chapter presents the fundamental principles of RF systems, with particular emphasis on RF cavities, and underscores the interdisciplinary effort involved in their development. The SwissFEL X-ray free-electron laser at the Paul Scherrer Institut serves as a key example to illustrate these concepts.",
    "authors": [
      "Thomas Geoffrey Lucas"
    ],
    "published": "2026-01-23T14:05:51Z",
    "updated": "2026-01-23T14:05:51Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.05127v2",
    "url": "https://arxiv.org/abs/2508.05127v2",
    "pdf_url": "https://arxiv.org/pdf/2508.05127v2.pdf",
    "title": "Information Propagation in Predator-Prey Dynamics of Turbulent Plasma",
    "abstract": "Magnetically confined fusion plasmas exhibit predator-prey-like cyclic oscillations through the self-regulating interaction between drift-wave turbulence and zonal flow. To elucidate the detailed mechanism and causality underlying this phenomenon, we construct a simple stochastic predator-prey model that incorporates intrinsic fluctuations and analyze its statistical properties from an information-theoretic perspective. We first show that the model exhibits persistent fluctuating cyclic oscillations called quasi-cycles due to amplification of intrinsic noise. This result suggests the possibility that the previously observed periodic oscillations in a toroidal plasma are not limit cycles but quasi-cycles, and that such quasi-cycles may be widely observed under various conditions. For this model, we further prove that information of the zonal flow is propagated to turbulence. This result suggests that turbulence behavior may be predictable to a certain extent based on zonal flow characteristics.",
    "authors": [
      "Tomohiro Tanogami",
      "Makoto Sasaki",
      "Tatsuya Kobayashi"
    ],
    "published": "2025-08-07T08:07:45Z",
    "updated": "2026-01-23T04:25:26Z",
    "categories": [
      "physics.plasm-ph",
      "cond-mat.stat-mech",
      "physics.flu-dyn"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.06616v2",
    "url": "https://arxiv.org/abs/2510.06616v2",
    "pdf_url": "https://arxiv.org/pdf/2510.06616v2.pdf",
    "title": "Design, waterproofing, and mass production of the 3-inch PMT frontend system of JUNO",
    "abstract": "Over 25,600 3-inch photomultiplier tubes (PMTs) have been instrumented for the central detector of the Jiangmen Underground Neutrino Observatory. Each PMT is equipped with a high-voltage divider and a frontend cable with waterproof sealing. Groups of sixteen PMTs are connected to the underwater frontend readout electronics via specialized multi-channel waterproof connectors. This paper outlines the design and mass production processes for the high-voltage divider, the cable and connector, as well as the waterproof potting of the PMT bases. The results of the acceptance tests of all the integrated PMTs are also presented.",
    "authors": [
      "Jilei Xu",
      "Miao He",
      "Cédric Cerna",
      "Yongbo Huang",
      "Thomas Adam",
      "Shakeel Ahmad",
      "Rizwan Ahmed",
      "Fengpeng An",
      "Costas Andreopoulos",
      "Giuseppe Andronico",
      "João Pedro Athayde Marcondes de André",
      "Nikolay Anfimov",
      "Vito Antonelli",
      "Tatiana Antoshkina",
      "Didier Auguste",
      "Weidong Bai",
      "Nikita Balashov",
      "Andrea Barresi",
      "Davide Basilico",
      "Eric Baussan",
      "Marco Beretta",
      "Antonio Bergnoli",
      "Nikita Bessonov",
      "Daniel Bick",
      "Lukas Bieger",
      "Svetlana Biktemerova",
      "Thilo Birkenfeld",
      "Simon Blyth",
      "Anastasia Bolshakova",
      "Mathieu Bongrand",
      "Matteo Borghesi",
      "Dominique Breton",
      "Augusto Brigatti",
      "Riccardo Brugnera",
      "Riccardo Bruno",
      "Antonio Budano",
      "Jose Busto",
      "Marcel Büchner",
      "Anatael Cabrera",
      "Barbara Caccianiga",
      "Hao Cai",
      "Xiao Cai",
      "Yanke Cai",
      "Zhiyan Cai",
      "Stéphane Callier",
      "Steven Calvez",
      "Antonio Cammi",
      "Chuanya Cao",
      "Guofu Cao",
      "Jun Cao",
      "Yaoqi Cao",
      "Rossella Caruso",
      "Vanessa Cerrone",
      "Jinfan Chang",
      "Yun Chang",
      "Auttakit Chatrabhuti",
      "Chao Chen",
      "Guoming Chen",
      "Jiahui Chen",
      "Jian Chen",
      "Jing Chen",
      "Junyou Chen",
      "Pingping Chen",
      "Shaomin Chen",
      "Shiqiang Chen",
      "Xin Chen",
      "Yiming Chen",
      "Yixue Chen",
      "Yu Chen",
      "Ze Chen",
      "Zhangming Chen",
      "Zhiyuan Chen",
      "Jie Cheng",
      "Yaping Cheng",
      "Yu Chin Cheng",
      "Alexander Chepurnov",
      "Alexey Chetverikov",
      "Davide Chiesa",
      "Pietro Chimenti",
      "Po-Lin Chou",
      "Ziliang Chu",
      "Artem Chukanov",
      "Gérard Claverie",
      "Catia Clementi",
      "Barbara Clerbaux",
      "Claudio Coletta",
      "Simon Csakli",
      "Chenyang Cui",
      "Olivia Dalager",
      "Zhi Deng",
      "Ziyan Deng",
      "Xiaoyu Ding",
      "Xuefeng Ding",
      "Yayun Ding",
      "Bayu Dirgantara",
      "Carsten Dittrich",
      "Sergey Dmitrievsky",
      "David Doerflinger",
      "Dmitry Dolzhikov",
      "Haojie Dong",
      "Jianmeng Dong",
      "Evgeny Doroshkevich",
      "Marcos Dracos",
      "Frédéric Druillole",
      "Ran Du",
      "Shuxian Du",
      "Yujie Duan",
      "Katherine Dugas",
      "Stefano Dusini",
      "Hongyue Duyang",
      "Jessica Eck",
      "Timo Enqvist",
      "Andrea Fabbri",
      "Ulrike Fahrendholz",
      "Lei Fan",
      "Jian Fang",
      "Wenxing Fang",
      "Elia Stanescu Farilla",
      "Dmitry Fedoseev",
      "Li-Cheng Feng",
      "Qichun Feng",
      "Federico Ferraro",
      "Daniela Fetzer",
      "Marcellin Fotzé",
      "Amélie Fournier",
      "Aaron Freegard",
      "Feng Gao",
      "Alberto Garfagnini",
      "Arsenii Gavrikov",
      "Marco Giammarchi",
      "Nunzio Giudice",
      "Maxim Gonchar",
      "Guanghua Gong",
      "Hui Gong",
      "Yuri Gornushkin",
      "Marco Grassi",
      "Maxim Gromov",
      "Vasily Gromov",
      "Minhao Gu",
      "Xiaofei Gu",
      "Yu Gu",
      "Mengyun Guan",
      "Yuduo Guan",
      "Nunzio Guardone",
      "Rosa Maria Guizzetti",
      "Cong Guo",
      "Wanlei Guo",
      "Caren Hagner",
      "Hechong Han",
      "Ran Han",
      "Yang Han",
      "Vidhya Thara Hariharan",
      "Jinhong He",
      "Wei He",
      "Xinhai He",
      "Ziou He",
      "Tobias Heinz",
      "Patrick Hellmuth",
      "Yuekun Heng",
      "YuenKeung Hor",
      "Shaojing Hou",
      "Yee Hsiung",
      "Bei-Zhen Hu",
      "Hang Hu",
      "Jun Hu",
      "Tao Hu",
      "Yuxiang Hu",
      "Guihong Huang",
      "Hexiang Huang",
      "Jinhao Huang",
      "Junting Huang",
      "Kaixuan Huang",
      "Shengheng Huang",
      "Tao Huang",
      "Xin Huang",
      "Xingtao Huang",
      "Jiaqi Hui",
      "Lei Huo",
      "Cédric Huss",
      "Safeer Hussain",
      "Leonard Imbert",
      "Ara Ioannisian",
      "Adrienne Jacobi",
      "Arshak Jafar",
      "Beatrice Jelmini",
      "Xiangpan Ji",
      "Xiaolu Ji",
      "Huihui Jia",
      "Junji Jia",
      "Cailian Jiang",
      "Wei Jiang",
      "Xiaoshan Jiang",
      "Xiaozhao Jiang",
      "Yijian Jiang",
      "Yixuan Jiang",
      "Xiaoping Jing",
      "Cécile Jollet",
      "Li Kang",
      "Rebin Karaparabil",
      "Narine Kazarian",
      "Ali Khan",
      "Amina Khatun",
      "Khanchai Khosonthongkee",
      "Denis Korablev",
      "Konstantin Kouzakov",
      "Alexey Krasnoperov",
      "Sergey Kuleshov",
      "Sindhujha Kumaran",
      "Nikolay Kutovskiy",
      "Loïc Labit",
      "Tobias Lachenmaier",
      "Haojing Lai",
      "Cecilia Landini",
      "Lorenzo Lastrucci",
      "Sébastien Leblanc",
      "Matthieu Lecocq",
      "Frederic Lefevre",
      "Ruiting Lei",
      "Rupert Leitner",
      "Jason Leung",
      "Demin Li",
      "Fei Li",
      "Fule Li",
      "Gaosong Li",
      "Hongjian Li",
      "Huang Li",
      "Jiajun Li",
      "Min Li",
      "Nan Li",
      "Qingjiang Li",
      "Ruhui Li",
      "Rui Li",
      "Shanfeng Li",
      "Tao Li",
      "Teng Li",
      "Weidong Li",
      "Xiaonan Li",
      "Yi Li",
      "Yichen Li",
      "Yifan Li",
      "Yufeng Li",
      "Zhaohan Li",
      "Zhibing Li",
      "Zi-Ming Li",
      "Zonghai Li",
      "An-An Liang",
      "Jiajun Liao",
      "Minghua Liao",
      "Yilin Liao",
      "Ayut Limphirat",
      "Bo-Chun Lin",
      "Guey-Lin Lin",
      "Shengxin Lin",
      "Tao Lin",
      "Xianhao Lin",
      "Xingyi Lin",
      "Jiajie Ling",
      "Xin Ling",
      "Ivano Lippi",
      "Caimei Liu",
      "Fang Liu",
      "Fengcheng Liu",
      "Haidong Liu",
      "Haotian Liu",
      "Hongbang Liu",
      "Hongjuan Liu",
      "Hongtao Liu",
      "Hongyang Liu",
      "Jianglai Liu",
      "Jiaxi Liu",
      "Jinchang Liu",
      "Kainan Liu",
      "Min Liu",
      "Qian Liu",
      "Runxuan Liu",
      "Shenghui Liu",
      "Shulin Liu",
      "Xiaowei Liu",
      "Xiwen Liu",
      "Xuewei Liu",
      "Yankai Liu",
      "Zhen Liu",
      "Lorenzo Loi",
      "Alexey Lokhov",
      "Paolo Lombardi",
      "Claudio Lombardo",
      "Kai Loo",
      "Selma Conforti Di Lorenzo",
      "Haoqi Lu",
      "Junguang Lu",
      "Meishu Lu",
      "Shuxiang Lu",
      "Xianguo Lu",
      "Bayarto Lubsandorzhiev",
      "Sultim Lubsandorzhiev",
      "Livia Ludhova",
      "Arslan Lukanov",
      "Fengjiao Luo",
      "Guang Luo",
      "Jianyi Luo",
      "Shu Luo",
      "Wuming Luo",
      "Xiaojie Luo",
      "Vladimir Lyashuk",
      "Bangzheng Ma",
      "Bing Ma",
      "Qiumei Ma",
      "Si Ma",
      "Wing Yan Ma",
      "Xiaoyan Ma",
      "Xubo Ma",
      "Jihane Maalmi",
      "Jingyu Mai",
      "Marco Malabarba",
      "Yury Malyshkin",
      "Roberto Carlos Mandujano",
      "Fabio Mantovani",
      "Xin Mao",
      "Stefano M. Mari",
      "Agnese Martini",
      "Matthias Mayer",
      "Davit Mayilyan",
      "Yue Meng",
      "Anselmo Meregaglia",
      "Lino Miramonti",
      "Marta Colomer Molla",
      "Michele Montuschi",
      "Iwan Morton-Blake",
      "Massimiliano Nastasi",
      "Dmitry V. Naumov",
      "Elena Naumova",
      "Igor Nemchenok",
      "Elisabeth Neuerburg",
      "Alexey Nikolaev",
      "Feipeng Ning",
      "Zhe Ning",
      "Yujie Niu",
      "Hiroshi Nunokawa",
      "Lothar Oberauer",
      "Juan Pedro Ochoa-Ricoux",
      "Sebastian Olivares",
      "Alexander Olshevskiy",
      "Domizia Orestano",
      "Fausto Ortica",
      "Rainer Othegraven",
      "Yifei Pan",
      "Alessandro Paoloni",
      "George Parker",
      "Yatian Pei",
      "Luca Pelicci",
      "Anguo Peng",
      "Yu Peng",
      "Zhaoyuan Peng",
      "Elisa Percalli",
      "Willy Perrin",
      "Frédéric Perrot",
      "Pierre-Alexandre Petitjean",
      "Fabrizio Petrucci",
      "Oliver Pilarczyk",
      "Artyom Popov",
      "Pascal Poussot",
      "Ezio Previtali",
      "Fazhi Qi",
      "Ming Qi",
      "Xiaohui Qi",
      "Sen Qian",
      "Xiaohui Qian",
      "Zhonghua Qin",
      "Shoukang Qiu",
      "Manhao Qu",
      "Zhenning Qu",
      "Gioacchino Ranucci",
      "Thomas Raymond",
      "Alessandra Re",
      "Abdel Rebii",
      "Mariia Redchuk",
      "Bin Ren",
      "Yuhan Ren",
      "Cristobal Morales Reveco",
      "Barbara Ricci",
      "Komkrit Rientong",
      "Mariam Rifai",
      "Mathieu Roche",
      "Narongkiat Rodphai",
      "Fernanda de Faria Rodrigues",
      "Aldo Romani",
      "Bedřich Roskovec",
      "Arseniy Rybnikov",
      "Andrey Sadovsky",
      "Paolo Saggese",
      "Deshan Sandanayake",
      "Anut Sangka",
      "Ujwal Santhosh",
      "Giuseppe Sava",
      "Utane Sawangwit",
      "Michaela Schever",
      "Cédric Schwab",
      "Konstantin Schweizer",
      "Alexandr Selyunin",
      "Andrea Serafini",
      "Mariangela Settimo",
      "Junyu Shao",
      "Vladislav Sharov",
      "Hangyu Shi",
      "Hexi Shi",
      "Jingyan Shi",
      "Yanan Shi",
      "Vitaly Shutov",
      "Andrey Sidorenkov",
      "Apeksha Singhal",
      "Chiara Sirignano",
      "Jaruchit Siripak",
      "Monica Sisti",
      "Mikhail Smirnov",
      "Oleg Smirnov",
      "Thiago Sogo-Bezerra",
      "Sergey Sokolov",
      "Julanan Songwadhana",
      "Boonrucksar Soonthornthum",
      "Albert Sotnikov",
      "Warintorn Sreethawong",
      "Achim Stahl",
      "Luca Stanco",
      "Konstantin Stankevich",
      "Hans Steiger",
      "Jochen Steinmann",
      "Tobias Sterr",
      "Matthias Raphael Stock",
      "Virginia Strati",
      "Mikhail Strizh",
      "Alexander Studenikin",
      "Aoqi Su",
      "Jun Su",
      "Guangbao Sun",
      "Mingxia Sun",
      "Xilei Sun",
      "Yongzhao Sun",
      "Zhengyang Sun",
      "Narumon Suwonjandee",
      "Fedor Šimkovic",
      "Christophe De La Taille",
      "Akira Takenaka",
      "Xiaohan Tan",
      "Jian Tang",
      "Jingzhe Tang",
      "Qiang Tang",
      "Quan Tang",
      "Xiao Tang",
      "Minh Thuan Nguyen Thi",
      "Yuxin Tian",
      "Igor Tkachev",
      "Tomas Tmej",
      "Marco Danilo Claudio Torri",
      "Andrea Triossi",
      "Wladyslaw Trzaska",
      "Yu-Chen Tung",
      "Cristina Tuve",
      "Nikita Ushakov",
      "Carlo Venettacci",
      "Giuseppe Verde",
      "Maxim Vialkov",
      "Benoit Viaud",
      "Cornelius Moritz Vollbrecht",
      "Vit Vorobel",
      "Dmitriy Voronin",
      "Lucia Votano",
      "Caishen Wang",
      "Chung-Hsiang Wang",
      "En Wang",
      "Hanwen Wang",
      "Jiabin Wang",
      "Jun Wang",
      "Li Wang",
      "Meng Wang",
      "Meng Wang",
      "Mingyuan Wang",
      "Qianchuan Wang",
      "Ruiguang Wang",
      "Sibo Wang",
      "Tianhong Wang",
      "Wei Wang",
      "Wenshuai Wang",
      "Xi Wang",
      "Yangfu Wang",
      "Yaoguang Wang",
      "Yi Wang",
      "Yi Wang",
      "Yifang Wang",
      "Yuanqing Wang",
      "Yuyi Wang",
      "Zhe Wang",
      "Zheng Wang",
      "Zhimin Wang",
      "Apimook Watcharangkool",
      "Wei Wei",
      "Wei Wei",
      "Yadong Wei",
      "Yuehuan Wei",
      "Zhengbao Wei",
      "Liangjian Wen",
      "Jun Weng",
      "Christopher Wiebusch",
      "Rosmarie Wirth",
      "Bi Wu",
      "Chengxin Wu",
      "Diru Wu",
      "Qun Wu",
      "Yinhui Wu",
      "Yiyang Wu",
      "Zhaoxiang Wu",
      "Zhi Wu",
      "Michael Wurm",
      "Jacques Wurtz",
      "Dongmei Xia",
      "Shishen Xian",
      "Ziqian Xiang",
      "Fei Xiao",
      "Pengfei Xiao",
      "Xiang Xiao",
      "Wei-Jun Xie",
      "Xiaochuan Xie",
      "Yijun Xie",
      "Yuguang Xie",
      "Zhao Xin",
      "Zhizhong Xing",
      "Benda Xu",
      "Cheng Xu",
      "Donglian Xu",
      "Fanrong Xu",
      "Jiayang Xu",
      "Jinghuan Xu",
      "Meihang Xu",
      "Shiwen Xu",
      "Xunjie Xu",
      "Yin Xu",
      "Yu Xu",
      "Jingqin Xue",
      "Baojun Yan",
      "Qiyu Yan",
      "Taylor Yan",
      "Xiongbo Yan",
      "Yupeng Yan",
      "Changgen Yang",
      "Chengfeng Yang",
      "Fengfan Yang",
      "Jie Yang",
      "Lei Yang",
      "Pengfei Yang",
      "Xiaoyu Yang",
      "Yifan Yang",
      "Yixiang Yang",
      "Zekun Yang",
      "Haifeng Yao",
      "Jiaxuan Ye",
      "Mei Ye",
      "Ziping Ye",
      "Frédéric Yermia",
      "Jilong Yin",
      "Weiqing Yin",
      "Xiaohao Yin",
      "Zhengyun You",
      "Boxiang Yu",
      "Chiye Yu",
      "Chunxu Yu",
      "Hongzhao Yu",
      "Peidong Yu",
      "Xianghui Yu",
      "Zeyuan Yu",
      "Zezhong Yu",
      "Cenxi Yuan",
      "Chengzhuo Yuan",
      "Zhaoyang Yuan",
      "Zhenxiong Yuan",
      "Noman Zafar",
      "Kirill Zamogilnyi",
      "Jilberto Zamora",
      "Vitalii Zavadskyi",
      "Fanrui Zeng",
      "Shan Zeng",
      "Tingxuan Zeng",
      "Liang Zhan",
      "Yonghua Zhan",
      "Aiqiang Zhang",
      "Bin Zhang",
      "Binting Zhang",
      "Feiyang Zhang",
      "Han Zhang",
      "Haosen Zhang",
      "Honghao Zhang",
      "Jialiang Zhang",
      "Jiawen Zhang",
      "Jie Zhang",
      "Jingbo Zhang",
      "Junwei Zhang",
      "Lei Zhang",
      "Ping Zhang",
      "Qingmin Zhang",
      "Rongping Zhang",
      "Shiqi Zhang",
      "Shuihan Zhang",
      "Siyuan Zhang",
      "Tao Zhang",
      "Xiaomei Zhang",
      "Xin Zhang",
      "Xu Zhang",
      "Xuantong Zhang",
      "Yibing Zhang",
      "Yinhong Zhang",
      "Yiyu Zhang",
      "Yongpeng Zhang",
      "Yu Zhang",
      "Yuanyuan Zhang",
      "Yumei Zhang",
      "Zhenyu Zhang",
      "Zhijian Zhang",
      "Jie Zhao",
      "Runze Zhao",
      "Shujun Zhao",
      "Tianhao Zhao",
      "Hua Zheng",
      "Yangheng Zheng",
      "Li Zhou",
      "Shun Zhou",
      "Tong Zhou",
      "Xiang Zhou",
      "Xing Zhou",
      "Jingsen Zhu",
      "Kangfu Zhu",
      "Kejun Zhu",
      "Zhihang Zhu",
      "Bo Zhuang",
      "Honglin Zhuang",
      "Liang Zong",
      "Jiaheng Zou"
    ],
    "published": "2025-10-08T03:50:41Z",
    "updated": "2026-01-22T23:52:47Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.16307v1",
    "url": "https://arxiv.org/abs/2601.16307v1",
    "pdf_url": "https://arxiv.org/pdf/2601.16307v1.pdf",
    "title": "Performance of a SuperCDMS HVeV Detector with Sub-eV Energy Resolution and Single Charge-sensitivity",
    "abstract": "We present a detailed characterization of a new generation of athermal-phonon single-charge sensitive Si HVeV detectors, the best of which achieved 612 meV $\\pm$ 4 meV baseline resolution. Our sub-eV energy resolution enables precise measurements of single-photon events and reveal consistent energy losses of 0.81 eV $\\pm$ 0.03 eV per charge excitation across two facilities. We demonstrate that the noise for these detectors is well described using a standard Transition Edge Sensor noise model. We also place upper bounds on the nominal phonon collection efficiency of 45\\%, establishing these detectors as the most efficient athermal phonon detectors to date, limited only by intrinsic limitations of quasiparticle generation.",
    "authors": [
      "Kyle Kennard",
      "Aditi Pradeep",
      "Mason Buchanan",
      "Hope Fu",
      "Aviv Simchony",
      "Qihua Wang",
      "Emanuele Michielin",
      "Taylor Aralis",
      "Elspeth Cudmore",
      "Priscilla Cushman",
      "Miriam Diamond",
      "Enectali Figueroa-Feliciano",
      "Caleb Fink",
      "Simon Harms",
      "Bruce A. Hines",
      "Ziqing Hong",
      "Martin E. Huber",
      "Andrew Kubik",
      "Noah Kurinsky",
      "Rupak Mahapatra",
      "Valentina Novati",
      "Lekhraj Pandey",
      "Pratyush K. Patel",
      "Weigeng Peng",
      "Mark Platt",
      "Ry Pressman-Cyna",
      "Wolfgang Rau",
      "Runze Ren",
      "Tyler Reynolds",
      "James Ryan",
      "Tarek Saab",
      "David Sadek",
      "Benjamin Schmidt",
      "Zoë Smith",
      "Sidney Stevens",
      "Kelly Stifter",
      "Matthew Stukel",
      "Julius Viol",
      "Yongqi Wang",
      "Matthew James Wilson",
      "Betty Young",
      "Stefan Zatschler",
      "Hazal Zenger",
      "Ariel Zuñiga-Reyes"
    ],
    "published": "2026-01-22T20:34:19Z",
    "updated": "2026-01-22T20:34:19Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.16293v1",
    "url": "https://arxiv.org/abs/2601.16293v1",
    "pdf_url": "https://arxiv.org/pdf/2601.16293v1.pdf",
    "title": "VUV Reflectance Measurements for Materials Relevant to Argon and Xenon Experiments",
    "abstract": "Accurate knowledge of material reflectance in the vacuum ultraviolet (VUV) range is crucial for optimizing photon detection in noble gas detectors such as DUNE. Despite its importance, reflectance values for detector materials in the VUV region remain poorly characterized, with literature values showing significant variation depending on surface termination and finish. We present an angular-resolved reflectance measurement system developed at IFIC that operates in a gaseous argon atmosphere, enabling realistic measurements of detector materials under controlled conditions. The setup couples a deuterium lamp to a monochromator and employs a motorized PMT rotating around the sample to measure reflected light distributions across a wide angular range. We have characterized two key DUNE materials -- aluminum field cage profiles and stainless steel cryostat membranes -- in both the UV-VIS (300-500 nm) and VUV (128-200 nm) ranges. In the UV-VIS region, we confirm literature values of approximately 60% reflectance for aluminum and 40% for stainless steel. Preliminary VUV measurements at 45° angle of incidence yield reflectance values of 10-15% for both materials, significantly lower than their UV-VIS counterparts. The reflected light distributions exhibit a mixed character between specular and diffuse reflection. These results have direct implications for detector simulations and light yield predictions in next-generation experiments.",
    "authors": [
      "J. Soto-Oton",
      "H. Amar",
      "A. Cervera",
      "A. Roche"
    ],
    "published": "2026-01-22T19:54:26Z",
    "updated": "2026-01-22T19:54:26Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.16261v1",
    "url": "https://arxiv.org/abs/2601.16261v1",
    "pdf_url": "https://arxiv.org/pdf/2601.16261v1.pdf",
    "title": "A First Demonstration of the SQUAT Detector Architecture: Direct Measurement of Resonator-Free Charge-Sensitive Transmons",
    "abstract": "The Superconducting Quasiparticle-Amplifying Transmon (SQUAT) is a new sensor architecture for THz (meV) detection based on a weakly charge-sensitive transmon directly coupled to a transmission line. In such devices, energy depositions break Cooper pairs in the qubit capacitor islands, generating quasiparticles. Quasiparticles that tunnel across the Josephson junction change the transmon qubit parity, generating a measurable signal. In this paper, we present the design of first-generation SQUATs and demonstrate an architecture validation. We summarize initial characterization measurements made with prototype devices, comment on background sources that influence the observed parity-switching rate, and present experimental results showing simultaneous detection of charge and quasiparticle signals using aluminum-based SQUATs.",
    "authors": [
      "H. Magoon",
      "T. Aralis",
      "T. Dyson",
      "J. Anczarski",
      "D. Baxter",
      "G. Bratrud",
      "R. Carpenter",
      "S. Condon",
      "A. Droster",
      "E. Figueroa-Feliciano",
      "C. W. Fink",
      "S. Harvey",
      "A. Simchony",
      "Z. J. Smith",
      "S. Stevens",
      "N. Tabassum",
      "B. A. Young",
      "C. P. Salemi",
      "K. Stifter",
      "D. I. Schuster",
      "N. A. Kurinsky"
    ],
    "published": "2026-01-22T19:00:02Z",
    "updated": "2026-01-22T19:00:02Z",
    "categories": [
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.16251v1",
    "url": "https://arxiv.org/abs/2601.16251v1",
    "pdf_url": "https://arxiv.org/pdf/2601.16251v1.pdf",
    "title": "Probing dark matter interactions with a RES-NOVA prototype cryogenic detector",
    "abstract": "We report on the operation of a 13 g PbWO$_4$ crystal, grown from archaeological Pb and operated as a cryogenic calorimeter in an underground environment. Read out with a Ge thermistor, the detector achieves a low energy threshold and, for the first time, enables the derivation of a dark matter exclusion limit using PbWO$_4$ as target material, for both spin-dependent interactions on neutrons and spin-independent interactions. Although limited in mass and not representative of the final RES-NOVA detector design, this prototype demonstrates effective control of mechanical vibrations and low-energy noise in a cryogenic system, which is a key requirement for rare-event searches. The experiment therefore provides a proof of principle for the RES-NOVA detection concept, validating the use of archaeological Pb-based PbWO$_4$ crystals, low-background operation, and robust data-analysis procedures. These results establish a solid technological and methodological foundation for future RES-NOVA detectors employing larger target masses and advanced thermal readout technologies.",
    "authors": [
      "D. Alloni",
      "G. Benato",
      "P. Carniti",
      "M. Cataldo",
      "L. Chen",
      "M. Clemenza",
      "M. Consonni",
      "G. Croci",
      "I. Dafinei",
      "F. A. Danevich",
      "C. de Vecchi",
      "D. Di Martino",
      "E. Di Stefano",
      "N. Ferreiro Iachellini",
      "F. Ferroni",
      "F. Filippini",
      "S. Ghislandi",
      "A. Giachero",
      "L. Gironi",
      "P. Gorla",
      "C. Gotti",
      "D. L. Helis",
      "D. V. Kasperovych",
      "V. V. Kobychev",
      "G. Marcucci",
      "A. Melchiorre",
      "A. Menegolli",
      "S. Nisi",
      "M. Musa",
      "L. Pagnanini",
      "L. Pattavina",
      "G. Pessina",
      "S. Pirro",
      "S. Pozzi",
      "M. C. Prata",
      "A. Puiu",
      "S. Quitadamo",
      "M. P. Riccardi",
      "M. Ricci",
      "M. Rossella",
      "R. Rossini",
      "E. Sala",
      "F. Saliu",
      "A. Salvini",
      "V. I. Tretyak",
      "L. Trombetta",
      "D. Trotta",
      "H. Yuan"
    ],
    "published": "2026-01-22T19:00:00Z",
    "updated": "2026-01-22T19:00:00Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.CO"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.03620v2",
    "url": "https://arxiv.org/abs/2601.03620v2",
    "pdf_url": "https://arxiv.org/pdf/2601.03620v2.pdf",
    "title": "On flying through the base of a pseudo-streamer",
    "abstract": "Near the 10 solar radius perihelion of Parker Solar Probe orbit 24, a confined region containing an enhanced plasma density of 25,000 particles per cubic centimeter and broadband electrostatic waves was encountered. The solar wind velocity of 200 kilometers per second and ion temperature of 25 eV were significantly reduced as compared to their values in the ambient solar wind. These anomalous plasma conditions were observed on closed magnetic field lines, as determined from observations of the suprathermal electron strahl. Because the polarity of the radial magnetic field did not change sign on the two sides of the crossing and the crossed region contained a double-peaked plasma structure, the spacecraft must have passed through the base of a pseudo-streamer whose structure extended out to 10 solar radii. In the plasma frame, an electric field as large as 400 millivolts per meter was detected during the crossing. The current associated with this electric field was less than one milliampere per square meter, corresponding to a drift velocity less than 2.5 kilometers per second. It also contained a turbulent plasma with density fluctuations divided by density as large as 0.3, suggesting that the resistive term in the generalized ohm's law was significant. Also, the density as a function of time had a non-zero slope when the electric field was non-zero, suggesting that the pressure gradient term also mattered. As compared to earlier remote sensing and theoretical results, it is surprising that the plasma in this pseudo-streamer had a remarkably low flow velocity and that the pseudo-streamer base extended out to 10 solar radii.",
    "authors": [
      "Forrest Mozer",
      "Oleksiy Agapitov",
      "Kyungeun Choi",
      "Andrii Voshchepynets"
    ],
    "published": "2026-01-07T06:01:19Z",
    "updated": "2026-01-22T17:50:52Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2512.20468v2",
    "url": "https://arxiv.org/abs/2512.20468v2",
    "pdf_url": "https://arxiv.org/pdf/2512.20468v2.pdf",
    "title": "Calibration Method of Spacecraft-Inertial Sensor Center-of-Mass Offset for the Taiji Gravitational Wave Detection Mission under Science Mode",
    "abstract": "Accurately calibrating the center-of-mass (CoM) offset between the spacecraft (SC) and the inertial sensor test mass (TM) is crucial for space-based gravitational-wave (GW) antennas, such as LISA and Taiji. Current calibration methods require additional spacecraft maneuvers that disrupt science data continuity and inter-satellite links, compromising the coherence of gravitational wave signals. Here, we present a maneuver-free calibration scheme that directly estimates the CoM offset vector using only standard science-mode measurements from inertial sensors, interferometers, and differential wavefront sensors. By embedding the CoM offset induced coupling acceleration as an extended state in a model-based adaptive Kalman filter, we achieve estimation accuracy of 0.01-1.5 mm across all axes with a maximum error below 1%. This approach enables continuous, high-precision calibration during nominal observation runs, ensuring continuous and coherent gravitational wave data collection while maintaining the required precision, and also facilitating advanced DFACS functions such as performance evaluations and fault diagnosis. For LISA-like missions, where data continuity is paramount for detecting faint gravitational wave signals, this method will enhance scientific output and reliability.",
    "authors": [
      "Haoyue Zhang",
      "Dong Ye",
      "Peng Xu",
      "Yunhai Geng",
      "Li-E Qiang",
      "Ziren Luo"
    ],
    "published": "2025-12-23T16:03:18Z",
    "updated": "2026-01-22T16:24:55Z",
    "categories": [
      "gr-qc",
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "gr-qc"
  },
  {
    "arxiv_id": "2601.16049v1",
    "url": "https://arxiv.org/abs/2601.16049v1",
    "pdf_url": "https://arxiv.org/pdf/2601.16049v1.pdf",
    "title": "Gain-Layer Project",
    "abstract": "Gain-layer degradation from exposure to radiation limits the use of Low-Gain Avalanche Diodes (LGADs) in high energy particle physics detector experiments. Proper understanding of how the gain-layer is destroyed is not available on a defect level. Only measurements for materials with much lower effective doping concentrations are available. The direct study of the gain-layer is not possible with typical defect spectroscopy measurements like Thermally Stimulated Currents (TSC) and Deep-Level Transient Spectroscopy (DLTS). To combat this problem and gain a better understanding of the processes which degrade LGADs, the Gain-Layer Project was started.   This project produced 19050 diodes with various Boron, Phosphorus, Oxygen and Carbon concentrations. The material used is low-resistivity p-type Silicon. The effective doping concentrations are in the order of a LGAD gain-layer. These diodes will serve the defect community in the coming years for various studies. This article introduces this project with detailed descriptions of the diodes, their flavours and their processing, and reports on results from I-V, C-V, SIMS and DLTS measurements on unirradiated diodes.",
    "authors": [
      "Niels G. Sorgenfrei",
      "Anna Rita Altamura",
      "Cristina Besleaga",
      "Georgia Andra Boni",
      "Tomas Ceponis",
      "Paul Erberk",
      "Eckhart Fretwurst",
      "Yana Gurimskaya",
      "Kevin Lauer",
      "Ludovico Massaccesi",
      "Luca Menzio",
      "Michael Moll",
      "Marie Muehlnikel",
      "Andrei Nitescu",
      "Ulrich Parzefall",
      "Roxana-Elena Patru",
      "Jevgenij Pavlov",
      "Ioana Pintilie",
      "Stephanie Reiss",
      "Joern Schwandt",
      "Valentina Sola"
    ],
    "published": "2026-01-22T15:28:55Z",
    "updated": "2026-01-22T15:28:55Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.15998v1",
    "url": "https://arxiv.org/abs/2601.15998v1",
    "pdf_url": "https://arxiv.org/pdf/2601.15998v1.pdf",
    "title": "Application of zone refining to the development of NaI(Tl) detectors for SABRE North",
    "abstract": "The SABRE North experiment is developing ultra-high radiopurity NaI(Tl) detectors to investigate dark matter. To achieve this, SABRE North utilizes the technique called zone refining for NaI powder purification. This work details the mathematical model developed to describe the purification process. By comparing this model to the results of the commissioning and production runs conducted prior to crystal growth, the distribution coefficients were determined for various impurities, contained in the powder at the parts-per-billion (ppb) level. Furthermore, the synthesis of data from both zone refining and normal freezing is discussed. These findings can be used to predict the SABRE North detectors background level in the energy region-of-interest for dark matter search and to optimize the production of ultra-high purity crystals through multiple purification strategies.",
    "authors": [
      "C. Ananna",
      "F. B. Armani",
      "G. Cataldi",
      "D. D'Angelo",
      "G. D'Imperio",
      "M. L. De Giorgi",
      "G. Di Carlo",
      "M. Diemoz",
      "A. Ianni",
      "S. G. Khattak",
      "E. Martinenghi",
      "A. Miccoli",
      "M. Misiaszek",
      "D. Montanino",
      "V. Pettinacci",
      "L. Pietrofaccia",
      "S. Rahatlou",
      "K. Szczepaniec",
      "C. Tomei",
      "V. Toso",
      "C. Vignoli",
      "S. Zuhra",
      "L. Cid",
      "A. Mellen-Spencer",
      "S. Nisi",
      "J. Tower"
    ],
    "published": "2026-01-22T14:18:29Z",
    "updated": "2026-01-22T14:18:29Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.15981v1",
    "url": "https://arxiv.org/abs/2601.15981v1",
    "pdf_url": "https://arxiv.org/pdf/2601.15981v1.pdf",
    "title": "Mid-infrared high-sensitive cavity-free in-situ CO gas sensing based on up-conversion detection",
    "abstract": "Carbon monoxide (CO) is a significant indicator gas with considerable application value in atmospheric monitoring, industrial production and medical diagnosis. Its fundamental vibrational band locates around 4.6 $\\upmu$m and has larger absorption line strength than that of overtone band, which is more suitable for the precise identification and concentration detection of CO. In this paper, the up-conversion detection is employed to convert the mid-infrared absorption signal obtained by TDLAS to the visible light band, then a silicon-based detector is utilized for detection. By which, we can achieve the highest sensitivity of 79.6 ppb under the condition of cavity-free in-situ with an absorption range length of only 0.14 m. Furthermore, the single-photon level real-time detection of CO concentration after the diffuse reflection is realized by using SPAD. This work demonstrates the merits of the up-conversion detection in terms of its functionality at room temperature and capacity for sensitivity detection. Furthermore, it presents a design and optimization methodology that has the potential to underpin the advancement of the method towards more practical applications, like industrial process monitoring, medical diagnosis and so on.",
    "authors": [
      "Zhao-Qi-Zhi Han",
      "He Zhang",
      "Fan Yang",
      "Xiao-Hua Wang",
      "Bo-Wen Liu",
      "Jin-Peng Li",
      "Zheng-He Zhou",
      "Yin-Hai Li",
      "Yan Li",
      "Zhi-Yuan Zhou",
      "Bao-Sen Shi"
    ],
    "published": "2026-01-22T14:03:56Z",
    "updated": "2026-01-22T14:03:56Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2601.15971v1",
    "url": "https://arxiv.org/abs/2601.15971v1",
    "pdf_url": "https://arxiv.org/pdf/2601.15971v1.pdf",
    "title": "Reaching the intrinsic performance limits of superconducting strip photon detectors up to 0.1 mm wide",
    "abstract": "Superconducting nanowire single-photon detectors (SNSPDs) have emerged as the highest performing photon-counting detectors, making them a critical technology in quantum photonics and photon-starved optical sensing. However, the performance of SNSPDs is limited not by the intrinsic properties of the superconducting film, but by edge-induced current crowding. Despite extensive materials optimization and increasingly demanding fabrication strategies aimed at mitigating this edge-limited behavior, the device edges continue to limit the maximum device operating current, thereby degrading key performance metrics. Here, we demonstrate for the first time in situ tuning of a detector from an edge-limited to a bulk-limited regime, allowing the device to reach its intrinsic performance limit. Our approach is based on current-biased superconducting \"rails\" placed on either side of the detector to suppress current crowding at the edges. We show that activation of the rails reduces the dark count rate by nine orders of magnitude and extends the photon detection plateau at 1550 nm by more than 40%. These results are demonstrated on detectors up to 0.1 mm wide, establishing an entirely new class of ultra-wide strip detectors that we call superconducting strip photon detectors (SSPD). Moreover, the ability to suppress edge current crowding using the rails provides a pathway toward SSPDs with strip widths extending into the mm-scale. Such devices will enable large-area, high efficiency SSPD arrays with infrared sensitivity and open new opportunities in applications ranging from biomedical imaging to deep space optical communication.",
    "authors": [
      "Kristen M. Parzuchowski",
      "Eli Mueller",
      "Bakhrom G. Oripov",
      "Benedikt Hampel",
      "Ravin A. Chowdhury",
      "Sahil R. Patel",
      "Daniel Kuznesof",
      "Emma K. Batson",
      "Ryan Morgenstern",
      "Robert H. Hadfield",
      "Varun B. Verma",
      "Matthew D. Shaw",
      "Jason P. Allmaras",
      "Martin J. Stevens",
      "Alex Gurevich",
      "Adam N. McCaughan"
    ],
    "published": "2026-01-22T13:51:49Z",
    "updated": "2026-01-22T13:51:49Z",
    "categories": [
      "cond-mat.supr-con",
      "physics.app-ph",
      "physics.ins-det",
      "physics.optics",
      "quant-ph"
    ],
    "primary_category": "cond-mat.supr-con"
  },
  {
    "arxiv_id": "2601.15947v1",
    "url": "https://arxiv.org/abs/2601.15947v1",
    "pdf_url": "https://arxiv.org/pdf/2601.15947v1.pdf",
    "title": "Multimodal Imaging System Combining Hyperspectral and Laser Speckle Imaging for In Vivo Hemodynamic and Metabolic Monitoring",
    "abstract": "We present the development and validation of a novel multimodal optical imaging platform that integrates hyperspectral imaging (HSI) and laser speckle contrast imaging (LSCI) to enable real-time, non-invasive mapping of tissue oxygenation, perfusion and metabolism, via blood flowmetry and targeting of oxy- (HbO2), deoxyhemoglobin (HHb), as well as oxidized cytochrome-c-oxidase (oxCCO). The system architecture features a single high-speed camera and dual optical path, with synchronized alternating illumination: a filtered, supercontinuum laser for HSI and a He-Ne laser for LSCI. The system performances were evaluated through in vivo experiments on rat spinal cord under normoxic and hypoxic conditions, revealing coherent physiological changes in hemodynamics, metabolism and relative blood flow index (rBFI). These results demonstrate the potential of the platform for functional tissue imaging and quantitative dynamic monitoring of both oxygen delivery and consumption.",
    "authors": [
      "Junda Wang",
      "Luca Giannoni",
      "Ayse Gertrude Yenicelik",
      "Eleni Giama",
      "Frederic Lange",
      "Kenneth J. Smith",
      "Ilias Tachtsidis"
    ],
    "published": "2026-01-22T13:32:34Z",
    "updated": "2026-01-22T13:32:34Z",
    "categories": [
      "physics.med-ph",
      "physics.app-ph",
      "physics.bio-ph",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "physics.med-ph"
  },
  {
    "arxiv_id": "2601.15938v1",
    "url": "https://arxiv.org/abs/2601.15938v1",
    "pdf_url": "https://arxiv.org/pdf/2601.15938v1.pdf",
    "title": "Operating a large-diameter dual-phase liquid xenon TPC in the unshielded PANCAKE facility",
    "abstract": "Future liquid-xenon (LXe) based observatories for rare processes, such as XLZD, require testing of large components and sub-assemblies in cryogenic liquid or gaseous xenon environments. Here we present results from the stable operation of a shallow dual-phase LXe TPC with an inner diameter of 133.4\\,cm and a height of 3.1\\,cm in the unshielded PANCAKE platform, without underground suppression of cosmic-ray backgrounds. A total of 340\\,kg of xenon was used in the experiment, of which 127\\,kg constituted the active TPC mass. Measurements of the LXe purity-dependent electron lifetime and the electron drift velocity in LXe demonstrate that sensitive measurements to characterize the TPC performance are possible in a high-background environment, even with a very basic PMT-based light detection system. Improving this will straightforwardly reduce the TPC threshold, which was observed to be around 15\\,keV for electronic recoils in TPC operation.",
    "authors": [
      "Julia Müller",
      "Jaron Grigat",
      "Robin Glade-Beucke",
      "Sebastian Lindemann",
      "Tiffany Luce",
      "Gnanesh Chandra Madduri",
      "Jens Reininghaus",
      "Marc Schumann",
      "Adam Softley-Brown",
      "Andrew Stevens"
    ],
    "published": "2026-01-22T13:18:41Z",
    "updated": "2026-01-22T13:18:41Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.15937v1",
    "url": "https://arxiv.org/abs/2601.15937v1",
    "pdf_url": "https://arxiv.org/pdf/2601.15937v1.pdf",
    "title": "OPTIMA, a board dedicated to Optimized Precision Timing for Multichannel Acquisition",
    "abstract": "In the new era of HL-LHC experiments, fast-timing detectors are emerging as critical tools for background rejection. Typical requirements include a temporal hit resolution of about 50 ps, a spatial resolution of around 12 $μ$m, and radiation hardness up to $10^{17}$n$_\\text{eq}$/cm$^2$. To address these challenges, the development of non-standard sensor designs and advanced fast readout electronics is required. The OPTIMA multichannel board addresses the need for testing small sensor demonstrators when they cannot yet be bonded to dedicated readout ASICs. It provides fast readout of up to 16 channels and can be integrated into various test setups, including test beam environments. This contribution presents the design of the OPTIMA board, its integration in test beams, and the first experimental results.",
    "authors": [
      "Federico De Benedetti",
      "Victor Coco",
      "Paula Collins",
      "Raphael Dumps",
      "Edgar Lemos Cid",
      "Alfonso Puicercus Gomez",
      "Efren Rodriguez Rodriguez",
      "Morag Williams"
    ],
    "published": "2026-01-22T13:18:36Z",
    "updated": "2026-01-22T13:18:36Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.15868v1",
    "url": "https://arxiv.org/abs/2601.15868v1",
    "pdf_url": "https://arxiv.org/pdf/2601.15868v1.pdf",
    "title": "Large-scale real-time signal processing in physics experiments: The ALICE TPC FPGA pipeline",
    "abstract": "For LHC Run 3, the ALICE Time Projection Chamber was upgraded to operate in continuous readout mode. Interaction rates of up to 50 kHz in Pb-Pb collisions require real-time processing of more than 3 TB/s of raw detector data. This requirement is met by a custom FPGA-based processing pipeline that performs the complete front-end data treatment fully in-stream, including common-mode correction, pedestal subtraction, ion-tail filtering, zero suppression, and dense data packing.   A central element of the design is a highly parallel common-mode correction algorithm operating directly on the streaming data. It robustly identifies signal-free readout channels on a time-bin basis and applies pad-dependent scaling to compensate for local variations in capacitive coupling in the GEM readout. In combination with pedestal subtraction and ion-tail filtering, this enables accurate baseline restoration under extreme high-occupancy conditions, preventing signal loss while efficiently suppressing noise prior to zero suppression.   The pipeline operates continuously at the full detector bandwidth and reduces the raw input rate to about 900 GB/s for Pb-Pb collisions at the target interaction rate. Overall, it represents a large-scale FPGA-based real-time signal-processing implementation for high-energy physics detector readout.",
    "authors": [
      "J. Alme",
      "T. Alt",
      "C. Andrei",
      "V. Anguelov",
      "H. Appelshäuser",
      "M. Arslandok",
      "R. Averbeck",
      "M. Ball",
      "G. G. Barnaföldi",
      "P. Becht",
      "R. Bellwied",
      "A. Berdnikova",
      "B. Blidaru",
      "L. Boldizsár",
      "L. Bratrud",
      "P. Braun-Munzinger",
      "M. Bregant",
      "C. L. Britton",
      "H. Büsching",
      "H. Caines",
      "P. Chatzidaki",
      "P. Christiansen",
      "T. M. Cormier",
      "L. Döpper",
      "R. Ehlers",
      "L. Fabbietti",
      "F. Flor",
      "J. J. Gaardhøje",
      "M. G. Munhoz",
      "C. Garabatos",
      "P. Gasik",
      "Á. Gera",
      "P. Glässel",
      "N. Grünwald",
      "T. Gündem",
      "T. Gunji",
      "H. Hamagaki",
      "J. W. Harris",
      "P. Hauer",
      "E. Hellbär",
      "H. Helstrup",
      "A. Herghelegiu",
      "H. D. Hernandez Herrera",
      "Y. Hou",
      "C. Hughes",
      "M. Ivanov",
      "J. Jäger",
      "Y. Ji",
      "J. Jung",
      "M. Jung",
      "B. Ketzer",
      "S. Kirsch",
      "M. Kleiner",
      "A. G. Knospe",
      "M. Korwieser",
      "M. Kowalski",
      "L. Lautner",
      "M. Lesch",
      "C. Lippmann",
      "G. Mantzaridis",
      "R. D. Majka",
      "A. Marin",
      "C. Markert",
      "S. Masciocchi",
      "A. Matyja",
      "M. Meres",
      "D. L. Mihaylov",
      "D. Miśkowiec",
      "R. H. Munzer",
      "H. Murakami",
      "K. Münning",
      "A. Nassirpour",
      "C. Nattrass",
      "B. S. Nielsen",
      "W. A. V. Noije",
      "A. C. Oliveira Da Silva",
      "A. Oskarsson",
      "K. Oyama",
      "L. Österman",
      "Y. Pachmayer",
      "G. Paić",
      "M. Petris",
      "M. Petrovici",
      "M. Planinic",
      "J. Rasson",
      "K. F. Read",
      "A. Rehman",
      "R. Renfordt",
      "A. Riedel",
      "K. Røed",
      "D. Röhrich",
      "E. Rubio",
      "A. Rusu",
      "S. Sadhu",
      "B. C. S. Sanches",
      "J. Schambach",
      "A. Schmah",
      "C. Schmidt",
      "A. Schmier",
      "K. Schweda",
      "D. Sekihata",
      "D. Silvermyr",
      "B. Sitar",
      "N. Smirnov",
      "H. K. Soltveit",
      "C. Sonnabend",
      "S. P. Sorensen",
      "J. Stachel",
      "L. Šerkšnytė",
      "G. Tambave",
      "K. Ullaland",
      "B. Ulukutlu",
      "D. Varga",
      "O. Vazquez Rueda",
      "B. Voss",
      "J. Wiechula",
      "B. Windelband",
      "J. Wilkinson",
      "J. Witte",
      "A. Yadav",
      "F. Zanone",
      "S. Zhu"
    ],
    "published": "2026-01-22T11:16:21Z",
    "updated": "2026-01-22T11:16:21Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.15818v1",
    "url": "https://arxiv.org/abs/2601.15818v1",
    "pdf_url": "https://arxiv.org/pdf/2601.15818v1.pdf",
    "title": "Muon beams towards muonium physics: progress and prospects",
    "abstract": "Advances in accelerator technology have led to significant improvements in the quality of muon beams over the past decades. Investigations of the muon and muonium enable precise measurements of fundamental constants, as well as searching for new physics beyond the Standard Model. Furthermore, by utilizing muon beams with high intensity and polarization, studies of the dynamics of the muon and muonium within atom level can offer valuable insights into material science. This review presents recent progress and prospects at the frontiers of muon beams and high-precision muonium physics. It also provides an overview of novel methods and detection techniques to achieve high sensitivities in different areas, including particle physics, nuclear physics, materials science and beyond.",
    "authors": [
      "Siyuan Chen",
      "Mingchen Sun",
      "Jian Tang"
    ],
    "published": "2026-01-22T10:05:19Z",
    "updated": "2026-01-22T10:05:19Z",
    "categories": [
      "hep-ex",
      "cond-mat.mtrl-sci",
      "physics.acc-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2503.19131v2",
    "url": "https://arxiv.org/abs/2503.19131v2",
    "pdf_url": "https://arxiv.org/pdf/2503.19131v2.pdf",
    "title": "Turbulent dynamos in a collapsing cloud",
    "abstract": "The amplification of magnetic fields is crucial for understanding the observed magnetization of stars and galaxies. Turbulent dynamo is the primary mechanism responsible for that but the understanding of its action in a collapsing environment is still rudimentary and relies on limited numerical experiments. We develop an analytical framework and perform numerical simulations to investigate the behavior of small-scale and large-scale dynamos in a collapsing turbulent cloud. This approach is also applicable to expanding environments and facilitates the application of standard dynamo theory to evolving systems. Using a supercomoving formulation of the magnetohydrodynamic (MHD) equations, we demonstrate that dynamo action in a collapsing background leads to a super-exponential growth of magnetic fields in time, significantly faster than the exponential growth seen in stationary turbulence. The enhancement is mainly due to the increasing eddy turnover rate during the collapse, which boosts the instantaneous growth rate of the dynamo. We also show that the scaling of final saturated magnetic field strength with density robustly exceeds the expectation from considerations of pure flux-freezing. Apart from establishing a formal framework for studying magnetic field evolution in collapsing (or expanding) turbulent plasmas, these findings suggest that during star and galaxy formation magnetic fields can become dynamically relevant much earlier than previously thought.",
    "authors": [
      "Muhammed Irshad P",
      "Pallavi Bhat",
      "Kandaswamy Subramanian",
      "Anvar Shukurov"
    ],
    "published": "2025-03-24T20:32:17Z",
    "updated": "2026-01-22T06:28:22Z",
    "categories": [
      "astro-ph.GA",
      "astro-ph.CO",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.GA",
    "doi": "10.1103/fp1v-xrr5"
  },
  {
    "arxiv_id": "2601.15661v1",
    "url": "https://arxiv.org/abs/2601.15661v1",
    "pdf_url": "https://arxiv.org/pdf/2601.15661v1.pdf",
    "title": "Non-Ambipolarity of Microturbulent Transport",
    "abstract": "Even what is called electrostatic microturbulence produces a plasma-beta-dependent turbulent magnetic field $\\tilde{B}$, which makes the magnetic field lines chaotic. Quasi-neutrality along the chaotic magnetic field lines requires a potential that obeys $\\vec{B}\\cdot \\vec{\\nabla} Φ= \\vec{B}\\cdot \\vec{\\nabla} p_e$, where $p_e$ is the electron pressure. This potential produces radial transport similar to that of diffusion coefficient $D_{ef}= (Δ/a_T)T_e/eB$. $Δ$ is the radial distance over which the potential $Φ$ is correlated by the electron motion along the chaotic magnetic field, and $|dT_e/dr| = T_e/a_T$. The chaos-produced electron transport gives an effective viscosity on the electron flow, which can counter balance a non-ambipolar part of the ion radial particle diffusion $f_{na}$. This non-ambipolarity would otherwise require a radial electric field that confines ions and hence impurities. The maximum $f_{na}$ that can be counterbalanced and the required plasma beta to avoid shielding the magnetic perturbations $\\tilde{B}$ are calculated.",
    "authors": [
      "Allen H Boozer"
    ],
    "published": "2026-01-22T05:20:38Z",
    "updated": "2026-01-22T05:20:38Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.18769v2",
    "url": "https://arxiv.org/abs/2512.18769v2",
    "pdf_url": "https://arxiv.org/pdf/2512.18769v2.pdf",
    "title": "Quantitative mobile gamma-ray spectrometry through Bayesian inference",
    "abstract": "Accurate quantitative mapping of gamma-ray sources is critical for applications ranging from radiological emergency response and environmental monitoring to nuclear security and deep space exploration. Here, we show that integrating high-fidelity, platform-dynamic Monte Carlo simulations and Bayesian inference with mobile gamma-ray spectrometry enables rapid and accurate quantification of distributed and point-like gamma-ray sources. Validated against laboratory and field assays, our framework quantifies natural and anthropogenic gamma-ray sources that conventional methods cannot resolve in $1\\,$s with $\\sim\\!\\!1\\,\\%$ error. The developed method marks a critical advance in quantitative gamma-ray sensing, enabling improved radiological situational awareness, enhanced terrestrial geophysical and geochemical mapping, as well as more robust constraints on radionuclide abundances on extraterrestrial bodies across the Solar System.",
    "authors": [
      "David Breitenmoser",
      "Alberto Stabilini",
      "Malgorzata Magdalena Kasprzak",
      "Sabine Mayer"
    ],
    "published": "2025-12-21T15:17:52Z",
    "updated": "2026-01-22T04:48:09Z",
    "categories": [
      "physics.ins-det",
      "physics.app-ph",
      "physics.comp-ph",
      "physics.data-an",
      "physics.geo-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.11768v2",
    "url": "https://arxiv.org/abs/2512.11768v2",
    "pdf_url": "https://arxiv.org/pdf/2512.11768v2.pdf",
    "title": "A low-cost ice melt monitoring system using wind-induced motion of mass-balance stakes",
    "abstract": "Surface ablation measurements of glaciers are critical for understanding mass change over time. Mass-balance stakes are commonly used for localized measurements, with the exposed length typically measured manually at infrequent intervals. This paper presents the design and validation of new instrumentation that automates mass-balance stake readings, thus enabling continuous measurements with high temporal resolution. The instrumentation comprises readout electronics that are mounted on mass-balance stakes to measure wind-induced vibrations. The stake vibrational frequency depends sensitively on the exposed length, and changes in the measured frequency therefore probe glacier surface melt and accumulation. Initial instrumentation field tests conducted at Color Lake on Umingmat Nunaat (Axel Heiberg Island), Nunavut, demonstrate centimeter-level precision on length measurements. The instrumentation can be attached to existing mass-balance stakes and is low-cost (~ $50 USD) in comparison to many other systems that perform automated surface ablation measurements. The accessibility of this instrumentation opens new possibilities for localized, high temporal resolution measurements of glacier surface activity at any locations where mass balance stakes are deployed.",
    "authors": [
      "Felix St-Amour",
      "H. Cynthia Chiang",
      "Jamie Cox",
      "Eamon Egan",
      "Ian Hendricksen",
      "Jonathan Sievers",
      "Laura Thomson"
    ],
    "published": "2025-12-12T18:29:29Z",
    "updated": "2026-01-22T04:41:13Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.15613v1",
    "url": "https://arxiv.org/abs/2601.15613v1",
    "pdf_url": "https://arxiv.org/pdf/2601.15613v1.pdf",
    "title": "A kinetic-moment framework for electron energy dynamics in capacitively coupled plasmas: absorption, conversion, transport, and dissipation",
    "abstract": "Understanding electron energy dynamics in low-temperature plasmas such as capacitively coupled plasmas (CCPs), including energy absorption, conversion, transport, and dissipation, is essential for interpreting discharge physics and process applications. We propose a kinetic-moment framework based on particle-in-cell/Monte Carlo collision (PIC/MCC) simulations. The framework reconstructs the first three velocity moments of the Boltzmann equation directly from PIC/MCC data and enables a quantitative, self-consistent description of electron energy dynamics in low-pressure CCPs. To clarify energy conversion among electromagnetic energy, electron fluid kinetic (mechanical) energy, and electron thermal (internal) energy, we further separate the total energy transport equation into kinetic- and thermal-energy equations. We find that, at low pressure, electrons gain directed kinetic energy in the sheath and convert it locally into thermal energy through pressure-strain interaction and collisions. Thermal energy is then transported into the bulk and is dissipated mainly by inelastic electron-neutral collisions. We further decompose pressure-strain interaction into reversible pressure dilatation and irreversible viscous-like dissipation, which correspond to conversion driven by volumetric compression or expansion and by shear deformation, respectively. This decomposition reveals a significant thermalization channel beyond collisions. More broadly, the results show coexistence of localized kinetic-to-thermal conversion near the sheath and nonlocal energy transport from the sheath to the bulk dominated by microscopic heat flux. The heat flux deviates strongly from Fourier's law based on local temperature gradients. This framework provides a clear fluid description with kinetic fidelity and offers a practical tool for analyzing energy evolution in nonequilibrium plasmas.",
    "authors": [
      "Jianxiong Yao",
      "Zeduan Zhang",
      "Feng He",
      "Jinsong Miao",
      "Jiting Ouyang",
      "Bocong Zheng"
    ],
    "published": "2026-01-22T03:29:10Z",
    "updated": "2026-01-22T03:29:10Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.02729v2",
    "url": "https://arxiv.org/abs/2601.02729v2",
    "pdf_url": "https://arxiv.org/pdf/2601.02729v2.pdf",
    "title": "The Future of Higgs Physics",
    "abstract": "In this lecture, I discuss measurements of the properties of the Higgs boson and related observables in the era of Higgs factories. This highly motivated experimental program is the challenge for the next generation of particle physicists.",
    "authors": [
      "Michael E. Peskin"
    ],
    "published": "2026-01-06T05:47:51Z",
    "updated": "2026-01-22T02:52:26Z",
    "categories": [
      "hep-ph",
      "hep-ex",
      "physics.acc-ph"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2601.15590v1",
    "url": "https://arxiv.org/abs/2601.15590v1",
    "pdf_url": "https://arxiv.org/pdf/2601.15590v1.pdf",
    "title": "Density Limit Experiments and Core-localized Kinetic MHD Activities in HL-2A Ohmic Heating Plasmas",
    "abstract": "The density limit is a mysterious barrier to magnetic confinement nuclear fusion, and is still an unresolved issue. In this paper, we will present the experimental results of the density limit and core-localized kinetic MHD instabilities on HL-2A. Firstly, the high density shots with $ne/ne_G>1$ have been achieved by the conventional gas-puff fuelling method in Ohmic heating plasmas, and the corresponding duration time is close to $t\\sim500$ ms ($\\sim$ $30τ_E$), where $τ_E$ is the global energy confinement time. Secondly, it is found for the first time that there are kinetic MHD instabilities in the core plasmas while $ne/ne_G\\sim1$. The analysis suggests that the core-localized MHD activities belong to Alfv{é}nic ion temperature gradient (AITG) modes or kinetic ballooning modes (KBM), and firstly it is found on experiment that they trigger the minor or major disruption of bulk plasmas while the density profile is peaked. These new findings are of great importance to figure out and understand the origin of the density limit.",
    "authors": [
      "L. W. Hu",
      "W. Chen",
      "P. W. Shi",
      "T. Long",
      "J. Q. Xu",
      "R. R. Ma",
      "Y. G. Li",
      "L. M. Yu",
      "X. Yu",
      "M. Jiang",
      "T. F. Sun",
      "J. M. Gao",
      "Y. B. Dong",
      "X. L. Zhu",
      "Z. B. Shi"
    ],
    "published": "2026-01-22T02:27:45Z",
    "updated": "2026-01-22T02:27:45Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.20091v2",
    "url": "https://arxiv.org/abs/2512.20091v2",
    "pdf_url": "https://arxiv.org/pdf/2512.20091v2.pdf",
    "title": "Precision Bounds for Characterising Quantum Measurements",
    "abstract": "Quantum measurements, alongside quantum states and processes, form a cornerstone of quantum information processing. However, unlike states and processes, their efficient characterisation remains relatively unexplored. We resolve this asymmetry by introducing a comprehensive framework for efficient detector estimation that reveals the fundamental limits to extractable parameter information and errors arising in detector analysis - the detector quantum Fisher information. Our development eliminates the need to optimise for the best probe state, while highlighting aspects of detector analysis that fundamentally differ from quantum state estimation. Through proofs, examples and experimental validation, we demonstrate the relevance and robustness of our proposal for current quantum detector technologies. By formalising a dual perspective to state estimation, our framework completes and connects the triad of efficient state, process, and detector tomography, advancing quantum information theory with broader implications for emerging technologies reliant on precisely calibrated measurements.",
    "authors": [
      "Aritra Das",
      "Simon K. Yung",
      "Lorcan O. Conlon",
      "Ozlem Erkilic",
      "Angus Walsh",
      "Yong-Su Kim",
      "Ping K. Lam",
      "Syed M. Assad",
      "Jie Zhao"
    ],
    "published": "2025-12-23T06:33:50Z",
    "updated": "2026-01-22T01:44:12Z",
    "categories": [
      "quant-ph",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "quant-ph",
    "doi": "10.1038/s41467-026-68529-7"
  },
  {
    "arxiv_id": "2601.15567v1",
    "url": "https://arxiv.org/abs/2601.15567v1",
    "pdf_url": "https://arxiv.org/pdf/2601.15567v1.pdf",
    "title": "Discovery of Density Limit Disruption Induced by Core-localized Alfv${é}$nic Ion Temperature Gradient Instabilities in a Tokamak Plasma",
    "abstract": "To achieve a high energy gain, the fusion reactor plasma must reach a very high density. However, the tokamak plasmas ofen undergo disruption when the density exceeds the Greenwald density. The density limit disruption in tokamak plasmas is a mysterious barrier to magnetic confinement nuclear fusion, and hitherto, is still an unresolved issue. Over the past several years, the high density experiments with Greenwald density ratio $n_e/n_{eG}\\sim1$ has been carried out using the conventional gas-puff fuelling method in HL-2A NBI and Ohmically heated plasmas. It is found for the first time that there are multiple-branch MHD instabilities in the core plasmas while $n_e/n_{eG}>0.85$. The simulation analysis suggests that the core-localized magnetohydrodynamics (MHD) activities belong to Alfv${é}$nic ion temperature gradient (AITG) modes, and on experiment firstly, it is discovered that they trigger the minor or major disruption of bulk plasmas while the density is peaked. These new findings are of great importance to figure out and understand the origin of density limit disruptions, as well as to forecast and avoid them for future fusion rectors.",
    "authors": [
      "Wei Chen",
      "Liwen Hu",
      "Jianqiang Xu",
      "Ruirui Ma",
      "Peiwan Shi",
      "Rui Ke",
      "Ting Long",
      "Zhiyong Qiu",
      "Haotian Chen",
      "Xiaoxue He",
      "Yonggao Li",
      "Liming Yu",
      "Wenping Guo",
      "Min Jiang",
      "Jinming Gao",
      "Xin Yu",
      "Zhengji Li",
      "Huiling Wei",
      "Deliang Yu",
      "Zhongbing Shi"
    ],
    "published": "2026-01-22T01:12:54Z",
    "updated": "2026-01-22T01:12:54Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2504.10192v3",
    "url": "https://arxiv.org/abs/2504.10192v3",
    "pdf_url": "https://arxiv.org/pdf/2504.10192v3.pdf",
    "title": "Picogram-Level Nanoplastic Analysis with Nanoelectromechanical System Fourier Transform Infrared Spectroscopy: NEMS-FTIR",
    "abstract": "We present a photothermal infrared spectroscopy-based approach for the chemical characterization and quantification of nanoplastics. By combining the high sensitivity of nanoelectromechanical systems (NEMS) with the wide spectral range and ubiquity of commercially available Fourier transform infrared (FTIR) spectrometers, NEMS-FTIR offers a time-efficient and cryogen-free option for the rapid, routine analysis of nanoplastics in aqueous samples. Polypropylene, polystyrene, and polyvinyl chloride nanoplastics with nominal diameters ranging from 54 to 262 nm were analyzed by NEMS-FTIR with limits of detection ranging from 101 pg to 353 pg, one order of magnitude lower than values reported for pyrolysis-gas chromatography-mass spectrometry of nanoplastics. The absorptance measured by NEMS-FTIR could be further converted to absolute sample mass using the attenuation coefficient, as demonstrated for polystyrene. Thanks to the wide spectral range of NEMS-FTIR, nanoplastic particles from different polymers could be readily identified, even when present in a mixture. The potential of NEMS-FTIR for the analysis of real samples was demonstrated by identifying the presence of nanoplastics released in water during tea brewing. Polyamide leachates in the form of fragments and smaller oligomers could be identified in the brewing water without sample pre-concentration, even in the presence of an organic matrix. Accelerated aging of the nylon teabags under elevated temperature and UV radiation showed further release of polyamide over time.",
    "authors": [
      "Jelena Timarac-Popović",
      "Johannes Hiesberger",
      "Eldira Šesto",
      "Niklas Luhmann",
      "Ariane Giesriegl",
      "Hajrudin Bešić",
      "Josiane P. Lafleur",
      "Silvan Schmid"
    ],
    "published": "2025-04-14T12:53:59Z",
    "updated": "2026-01-21T19:20:21Z",
    "categories": [
      "physics.ins-det",
      "physics.app-ph",
      "physics.atm-clus",
      "physics.chem-ph",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.15391v1",
    "url": "https://arxiv.org/abs/2601.15391v1",
    "pdf_url": "https://arxiv.org/pdf/2601.15391v1.pdf",
    "title": "Asymptotic scaling theory of electrostatic turbulent transport in magnetised fusion plasmas",
    "abstract": "Turbulent transport remains one of the principal obstacles to achieving efficient magnetic confinement in fusion devices. Two of the dominant drivers of the turbulence are microscale instabilities fuelled by electron- and ion-temperature gradients (ETG and ITG), whose nonlinear saturation determines the cross-field transport of particles and energy. Despite decades of study, predictive modelling of this turbulence has been limited either to expensive gyrokinetic simulations or to reduced models calibrated by fitting to numerical or experimental data, restricting their utility for reactor design. Here we present a simple asymptotic scaling theory that unifies ETG- and ITG-driven turbulence within a common framework. By balancing the fundamental time scales of linear growth, nonlinear decorrelation, and parallel propagation, the theory isolates the dependence of the heat flux on equilibrium parameters to two key quantities: the parallel system scale and the outer-scale aspect ratio. We show that these quantities encapsulate the essential physics of saturation, leading to distinct predictions for ETG and ITG transport: a cubic scaling with the temperature gradient in the electron channel, and a linear scaling in the ion channel. Extensive nonlinear gyrokinetic simulations confirm that these theoretical predictions hold irrespective of the magnetic geometry (slab, tokamak, or stellarator), including the first numerical confirmation of the cubic ETG scaling anticipated by earlier theory. By isolating the dependence on just the parallel system scale and the outer-scale aspect ratio, our framework provides a physics-based foundation for fast, geometry-aware transport models, offering a pathway toward reactor optimisation in both tokamaks and stellarators.",
    "authors": [
      "T. Adkins",
      "I. G. Abel",
      "M. Barnes",
      "S. Buller",
      "W. Dorland",
      "P. G. Ivanov",
      "R. Meyrand",
      "F. I. Parra",
      "A. A. Schekochihin",
      "J. Squire"
    ],
    "published": "2026-01-21T19:03:08Z",
    "updated": "2026-01-21T19:03:08Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2503.12235v2",
    "url": "https://arxiv.org/abs/2503.12235v2",
    "pdf_url": "https://arxiv.org/pdf/2503.12235v2.pdf",
    "title": "A magnetic avalanche as the central engine powering a solar flare",
    "abstract": "Solar flares are the most powerful, magnetically driven, explosions in the heliosphere. The nature of magnetic energy release in the solar corona that heats the plasma and accelerates particles in a flare, however, remains poorly understood. Here, we report high-resolution coronal observations of a flare by the Solar Orbiter mission that reveal initially weaker but rapid reconnection events, on timescales of a few seconds at most, leading to a more prominent activity of a similar nature that explosively causes a flare. Signatures of this process are further imprinted on the widespread raining plasma blobs with short lifetimes, giving rise to the characteristic ribbon-like emission pattern associated with the flare. Our observations unveil the central engine of a flare and emphasize the crucial role of an avalanche-like magnetic energy release mechanism at work.",
    "authors": [
      "L. P. Chitta",
      "D. I. Pontin",
      "E. R. Priest",
      "D. Berghmans",
      "E. Kraaikamp",
      "L. Rodriguez",
      "C. Verbeeck",
      "A. N. Zhukov",
      "S. Krucker",
      "R. Aznar Cuadrado",
      "D. Calchetti",
      "J. Hirzberger",
      "H. Peter",
      "U. Schühle",
      "S. K. Solanki",
      "L. Teriaca",
      "A. S. Giunta",
      "F. Auchère",
      "L. Harra",
      "D. Müller"
    ],
    "published": "2025-03-15T19:11:21Z",
    "updated": "2026-01-21T18:54:19Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR",
    "doi": "10.1051/0004-6361/202557253"
  },
  {
    "arxiv_id": "2601.13517v2",
    "url": "https://arxiv.org/abs/2601.13517v2",
    "pdf_url": "https://arxiv.org/pdf/2601.13517v2.pdf",
    "title": "Demonstration of a novel phase space painting method in a coupled lattice to mitigate space charge in high-intensity hadron beams",
    "abstract": "Multi-turn charge-exchange injection is the primary method of creating high-intensity hadron beams in circular accelerators, and phase space painting during injection enables tailoring of the accumulated phase space distribution. A technique we call eigenpainting allows injection of particles into a single mode of a coupled ring, providing full four-dimensional control of the phase space distribution. Under ideal conditions, uniform eigenpainting generates a linear-force equilibrium distribution in the transverse plane, with zero volume in four-dimensional transverse phase space, even including space charge. We have implemented eigenpainting for the first time in the Spallation Neutron Source (SNS) Accumulator Ring. Injecting 8.8 $μ$C of 800 MeV beam, we obtain a final ratio of intrinsic transverse emittances of $\\approx$2.4. We analyze the effect of space charge on the final distribution through comparison of the reconstructed phase space to particle-in-cell simulations.",
    "authors": [
      "Nicholas J. Evans",
      "Austin Hoover",
      "Timofey Gorlov",
      "Vasiliy Morozov"
    ],
    "published": "2026-01-20T02:10:00Z",
    "updated": "2026-01-21T18:02:30Z",
    "categories": [
      "physics.acc-ph",
      "physics.app-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2506.06814v2",
    "url": "https://arxiv.org/abs/2506.06814v2",
    "pdf_url": "https://arxiv.org/pdf/2506.06814v2.pdf",
    "title": "An analytical optimization of plasma density profiles for downramp injection in laser wake-field acceleration",
    "abstract": "We propose and detail a multi-step analytical procedure, based on an improved fully relativistic plane model for Laser Wake Field Acceleration, to tailor the initial density of a cold diluted plasma to the laser pulse profile, so as to control and optimize the partial wave-breaking of the plasma wave and maximize the acceleration of small bunches of electrons self-injected by the first wave-breaking at the density down-ramp, at least in the first stages of their acceleration phase. We find an excellent agreement with the results of Particle In Cell simulations obtained with the same input data.",
    "authors": [
      "Gaetano Fiore",
      "Paolo Tomassini"
    ],
    "published": "2025-06-07T14:45:03Z",
    "updated": "2026-01-21T17:48:08Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  }
]