{
  "arxiv_id": "2406.10979v2",
  "url": "https://arxiv.org/abs/2406.10979v2",
  "pdf_url": "https://arxiv.org/pdf/2406.10979v2.pdf",
  "title": "Collisional whistler instability and electron temperature staircase in inhomogeneous plasma",
  "abstract": "High-beta magnetized plasmas often exhibit anomalously structured temperature profiles, as seen from galaxy cluster observations and recent experiments. It is well known that when such plasmas are collisionless, temperature gradients along the magnetic field can excite whistler waves that efficiently scatter electrons to limit their heat transport. Only recently has it been shown that parallel temperature gradients can excite whistler waves also in collisional plasmas. Here we develop a Wigner--Moyal theory for the collisional whistler instability starting from Braginskii-like fluid equations in a slab geometry. This formalism is necessary because, for a large region in parameter space, the fastest-growing whistler waves have wavelengths comparable to the background temperature gradients. We find additional damping terms in the expression for the instability growth rate involving inhomogeneous Nernst advection and resistivity. They (i) enable whistler waves to re-arrange the electron temperature profile via growth, propagation, and subsequent dissipation, and (ii) allow non-constant temperature profiles to exist stably. For high-beta plasmas, the marginally stable solutions take the form of a temperature staircase along the magnetic field lines. The electron heat flux can also be suppressed by the Ettingshausen effect when the whistler intensity profile is sufficiently peaked and oriented opposite the background temperature gradient. This mechanism allows cold fronts without magnetic draping, might reduce parallel heat losses in inertial fusion experiments, and generally demonstrates that whistler waves can regulate transport even in the collisional limit.",
  "authors": [
    "N. A. Lopez",
    "A. F. A. Bott",
    "A. A. Schekochihin"
  ],
  "published": "2024-06-16T15:30:15Z",
  "updated": "2026-01-15T16:19:52Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": "10.1017/S0022377825000078"
}