{
  "arxiv_id": "2507.10253v2",
  "url": "https://arxiv.org/abs/2507.10253v2",
  "pdf_url": "https://arxiv.org/pdf/2507.10253v2.pdf",
  "title": "Optimization of a cosmic muon tomography scanner for cargo border control inspection",
  "abstract": "The past several decades have seen significant advancement in applications using cosmic-ray muons for tomography scanning of unknown objects. One of the most promising developments is the application of this technique in border security for the inspection of cargo inside trucks and sea containers in order to search for hazardous and illicit hidden materials. This work focuses on the optimization studies for a muon tomography system similar to that being developed within the framework of the `SilentBorder' project funded by the EU Horizon 2020 scheme. Current studies are directed toward optimizing the detector module design, following two complementary approaches. The first leverages TomOpt, a Python-based end-to-end software that employs differentiable programming to optimize scattering tomography detector configurations. While TomOpt inherently supports gradient-based optimization, a Bayesian Optimization module is introduced to better handle scenarios with noisy objective functions, particularly in image reconstruction-driven optimization tasks. The second optimization strategy relies on detailed GEANT4-based simulations, which, while more computationally intensive, offer higher physical fidelity. These simulations are also employed to study the impact of incorporating secondary particle information alongside cosmic muons for improved material discrimination. This paper presents the current status and results obtained from these optimization studies.",
  "authors": [
    "Z. Zaher",
    "H. Lay",
    "T. Dorigo",
    "A. Giammanco",
    "V. Gulik",
    "C. Hrytsiuk",
    "V. A. Kudryavtsev",
    "M. Lagrange",
    "T. Metspalu",
    "G. C. Strong",
    "C. Turkoglu",
    "P. Vischia"
  ],
  "published": "2025-07-14T13:23:49Z",
  "updated": "2026-01-16T10:26:22Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.063/5.0287758"
}