{
  "arxiv_id": "2601.10829v1",
  "url": "https://arxiv.org/abs/2601.10829v1",
  "pdf_url": "https://arxiv.org/pdf/2601.10829v1.pdf",
  "title": "A Neutron Microscope Using a Nested Wolter-I Condenser and a Bank of Diffractive-Refractive Achromatic Objectives",
  "abstract": "We propose a nested Wolter-I mirror design for a neutron condenser, which is based on established X-ray telescope technology. We demonstrate through simulations that it can increase the flux density at the ESS imaging instrument ODIN by up to two orders of magnitude. Experimental measurements of reflectivity and figure errors on a prototype mirror element confirm the technical feasibility of the approach. Then, we discuss design strategies for an imaging objective to fully exploit the condenser specifications while achieving spatial resolutions comparable to those of X-ray micro-CT instruments. Analytically, we show that for monochromatic beams suitable solutions exist employing arrays of hundreds of identical objectives, realized either as compound refractive lenses (CRLs) or Fresnel zone plates (FZPs). To mitigate the inherent chromatic aberration of these optics, each individual objective could be replaced by an achromatic FZP/CRL combination. Key optical properties of the resulting microscope are estimated. This novel full-field microscopy concept for highly divergent, polychromatic neutron beams has the potential to improve temporal and spatial resolution for large samples and sample environments and to enable the simultaneous acquisition of hundreds of projections in neutron tomography.",
  "authors": [
    "Henning Friis Poulsen",
    "Cæcilie Andersen",
    "Nolan Ravinet",
    "Joan Vila-Comamala",
    "Mano Raj Dhanalakshmi Veeraraj",
    "Erik Bergbäck Knudsen",
    "Peter Kjær Willendrup",
    "Sonny Massahi",
    "Finn Erland Christensen",
    "Desiree Della Monica Ferreira",
    "Markus Strobl",
    "Christian David",
    "Luise Theil Kuhn"
  ],
  "published": "2026-01-15T20:01:53Z",
  "updated": "2026-01-15T20:01:53Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}