{
  "arxiv_id": "2601.11014v1",
  "url": "https://arxiv.org/abs/2601.11014v1",
  "pdf_url": "https://arxiv.org/pdf/2601.11014v1.pdf",
  "title": "Study of circular cross-section plasmas in HL-2A tokamak: MHD equilibrium, stability and operational \\b{eta} limit",
  "abstract": "Circular cross-section plasma is the most basic form of tokamak plasma and the fundamental configuration for magnetic confinement fusion experiments. Based on the HL-2A limiter discharge experiments, the magnetohydrodynamic (MHD) equilibrium and MHD instability of circular cross-section tokamak plasmas are investigated in this work. The results show that when q_0=0.95, the internal kink mode of m/n=1/1 is always unstable. The increase in plasma \\b{eta} (the ratio of thermal pressure to magnetic pressure) can lead to the appearance of external kink modes. The combination of axial safety factor q_0 and edge safety factor q_a determines the equilibrium configuration of the plasma and also affects the MHD stability of the equilibrium, but its growth rate is also related to the size of \\b{eta}. Under the condition of q_a>2 and q_0 slightly greater than 1, the internal kink mode and surface kink mode can be easily stabilized. However the plasma becomes unstable again and the instability intensity increases as q_0 continues to increase when q_0 exceeds 1. As the poloidal beta (\\b{eta}_p) increases, the MHD instability develops, the equilibrium configuration of MHD elongates laterally, and the Shafranov displacement increases, which in turn has the effect on suppressing instability. Calculations have shown that the maximum \\b{eta} value imposed by the ideal MHD mode in a plasma with free boundary in tokamak experiments is proportional to the normalized current I_N (I_N=I_p (MA)/a(m)B_0 (T)), and the achievable maximum beta \\b{eta}(max) is calibrated to be 2.01I_N,i.e. \\b{eta}(max)~2.01I_N. The operational \\b{eta} limit of HL-2A circular cross-section plasma is approximately \\b{eta}_N^c~2.0. Too high a value of q_0 is not conducive to MHD stability and leads the \\b{eta} limit value to decrease. When q_0=1.3, we obtain a maximum value of \\b{eta}_N of approximately 1.8.",
  "authors": [
    "SHEN Yong",
    "DONG Jiaqi",
    "SHI Zhongbing",
    "HE Hongda",
    "ZHAO Kaijun",
    "PENG Xiaodong",
    "QU Hongpeng",
    "LI Jia",
    "SUN Aiping"
  ],
  "published": "2026-01-16T06:11:25Z",
  "updated": "2026-01-16T06:11:25Z",
  "categories": [
    "physics.plasm-ph",
    "physics.data-an"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": "10.7498/aps.74.20250450"
}