{
  "arxiv_id": "2601.10430v1",
  "url": "https://arxiv.org/abs/2601.10430v1",
  "pdf_url": "https://arxiv.org/pdf/2601.10430v1.pdf",
  "title": "Active interrogation of underground piezoelectric fabrics using high energy muon beams propagating across seismogenic faults",
  "abstract": "In this paper we extend a previous analysis of a newly conceived technique based on active interrogation of tectonic stress evolution in regions hosting active seismogenic faults. The aim is to monitor and detect stable and reliable precursor signals on an adequate time scale, well before an earthquake event, that can play a crucial role in activating alarms for civil protection systems. The precursor signal relies on continuous measurements of the time evolution of tectonic stress, obtained by interrogating underground, with a high energy collimated muon beam, the piezoelectric fabrics present in quartz rich granite like rocks surrounding a known seismogenic fault in the Earth crust. Beam propagation through the rock across the active fault conveys to a detector at the exit of the traversal information on the amplitude of the piezoelectric field, which scales with the tectonic stress applied to quartz crystals embedded in the rock. The system, named ERMES (Earthquake Reconnaissance using Muon beam Evolution in Silicon dioxide), differs from other techniques under study detecting electromagnetic signals generated by piezoelectricity outside the Earth crust, as it probes piezoelectric effects directly inside the source region of the associated electromagnetic field, namely the near field within quartz crystals rather than the far field in open space. We present a focused analysis of muon beam manipulation after rock traversal and before detection using a newly conceived muonic lens, and we explore the maximum rock penetration capability of a high energy muon beam, reaching about 3 km of rock thickness for a 10 TeV beam. Owing to the peculiarity of muon propagation through such kilometer scale targets, we cross checked previous FLUKA Monte Carlo simulations with Geant4 to clarify the secondary muons role generated by primary muon interactions in solid matter over long propagation lengths.",
  "authors": [
    "L. Serafini",
    "A. Bacci",
    "L. Bandiera",
    "F. Broggi",
    "I. Drebot",
    "A. Frazzitta",
    "A. M. Marotta",
    "G. Muttoni",
    "G. Paternò",
    "V. Petrillo",
    "M. Rossetti Conti",
    "A. R. Rossi",
    "S. Samsam",
    "M. Voltolini",
    "M. Zucali"
  ],
  "published": "2026-01-15T14:26:10Z",
  "updated": "2026-01-15T14:26:10Z",
  "categories": [
    "physics.acc-ph"
  ],
  "primary_category": "physics.acc-ph"
}