[
  {
    "arxiv_id": "2601.10509v2",
    "url": "https://arxiv.org/abs/2601.10509v2",
    "pdf_url": "https://arxiv.org/pdf/2601.10509v2.pdf",
    "title": "Reply to \"Comment on Nuclear Fusion 66, 016012 (2026) by Richard Fitzpatrick, A Simple Model of Current Ramp-Up and Ramp-Down in Tokamaks\" by A.H. Boozer",
    "abstract": "This report is a follow up to my paper \"A simple model of current ramp-up and ramp-down in tokamaks\" [Nucl. Fusion 66, 016012 (2026)] in the light of comments on the paper recently made by Dr. A.H. Boozer (arXiv:2601.05977).",
    "authors": [
      "Richard Fitzpatrick"
    ],
    "published": "2026-01-15T15:34:42Z",
    "updated": "2026-01-16T15:41:26Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.11366v1",
    "url": "https://arxiv.org/abs/2601.11366v1",
    "pdf_url": "https://arxiv.org/pdf/2601.11366v1.pdf",
    "title": "Nanofabricated torsion pendulums for tabletop gravity experiments",
    "abstract": "Measurement of mutual gravitation on laboratory scales is an outstanding challenge and a prerequisite to probing theories of quantum gravity. A leading technology in tabletop gravity experiments is the torsion balance, with limitations due to thermal decoherence. Recent demonstrations of lithographically defined suspensions in thin-film silicon nitride with macroscale test masses suggest a path forward, as torsion pendulums dominated by gravitational stiffness may achieve higher mechanical quality factors through dilution of material losses. Here we demonstrate a 250 micron by 5 mm by 1.8 micron torsion fiber supporting 87 grams and forming a Cavendish-style torsion pendulum with tungsten test masses that -- to our knowledge -- is the largest thin-film silicon-nitride-based oscillator to date. Torsion pendulums with thin-film, nanofabricated suspensions provide a test bed for near-term tabletop experiments probing classical and quantum gravitational interaction between oscillators.",
    "authors": [
      "Jack Manley",
      "Charles A. Condos",
      "Zachary Fegley",
      "Gayathrini Premawardhana",
      "Thomas Bsaibes",
      "Jacob M. Taylor",
      "Dalziel J. Wilson",
      "Jon R. Pratt"
    ],
    "published": "2026-01-16T15:21:55Z",
    "updated": "2026-01-16T15:21:55Z",
    "categories": [
      "physics.ins-det",
      "gr-qc",
      "quant-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.11361v1",
    "url": "https://arxiv.org/abs/2601.11361v1",
    "pdf_url": "https://arxiv.org/pdf/2601.11361v1.pdf",
    "title": "Vacuum in Accelerators for Mechanical & Materials Engineering",
    "abstract": "Vacuum systems are an intrinsic part of any accelerator around the world: all particles circulate under vacuum. This lecture gives rudiments on the fundamentals of vacuum science such as units, ideal gas law, partial pressure, mean free path, flow of molecules, conductance, pumping speed, and outgassing. An overview of standard vacuum instruments for pressure measurement and pumping is presented. Finally, the specificities of accelerator vacuum systems are introduced, discussing some design, construction, installation, and commissioning aspects, as well as fundamentals of beam-vacuum interactions with synchrotron radiation and electron cloud.",
    "authors": [
      "Vincent Baglin"
    ],
    "published": "2026-01-16T15:17:37Z",
    "updated": "2026-01-16T15:17:37Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.16630v4",
    "url": "https://arxiv.org/abs/2512.16630v4",
    "pdf_url": "https://arxiv.org/pdf/2512.16630v4.pdf",
    "title": "Photon Accelerator in Magnetized Plasma",
    "abstract": "Strong magnetic fields and plasmas are intrinsically linked in both terrestrial laboratory experiments and in space phenomena. One of the most profound consequences of that is the change in relationship between the frequency and the wave number of electromagnetic waves propagating in plasma in the presence of such magnetic fields when compared to the case without these fields. Furthermore, magnetic fields alter electromagnetic wave interaction with relativistic plasma waves, resulting in different outcomes for particle and radiation generation. For a relativistic plasma wave-based photon acceleration this leads to an increased frequency gain, and, thus, potentially to higher efficiency. The influence of a magnetic field leads to quantitative and qualitative change in the properties of photon acceleration, amplifying the increase in the electromagnetic wave frequency.",
    "authors": [
      "Sergei Bulanov",
      "Stepan Bulanov",
      "Timur Esirkepov",
      "Gianluca Gregori",
      "Gabriele Grittani",
      "Marcel Lamač",
      "Brandon Russell",
      "Alec Thomas",
      "Petr Valenta"
    ],
    "published": "2025-12-18T15:06:33Z",
    "updated": "2026-01-16T14:47:21Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.10363v2",
    "url": "https://arxiv.org/abs/2601.10363v2",
    "pdf_url": "https://arxiv.org/pdf/2601.10363v2.pdf",
    "title": "A compact Optical Liquid Argon Facility at Roma Tre",
    "abstract": "In this paper we present a compact test facility for the measurement of optical properties of liquid argon as scintillation detector. The setup is under preparation at Roma Tre and it has a volume of 40 L liquid argon, which is liquefied from argon gas with a purity of $\\ge 99.9999\\%$ vol. To readout the scintillation photons from liquid argon with the highest intensity near 127 nm, we use the vacuum ultraviolet silicon photomultipliers from Hamamatsu. By submerging the photon detectors directly inside the liquid argon, we can eliminate the systematics from the wave length shifter and light guides which have been commonly used to detect the scintillation photons of liquid argon.",
    "authors": [
      "Hexi Shi",
      "Valerio D'Andrea",
      "Krzysztof Szczepaniec",
      "Giuseppe Salamanna",
      "Diego Tagnani"
    ],
    "published": "2026-01-15T13:10:24Z",
    "updated": "2026-01-16T14:26:11Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.11302v1",
    "url": "https://arxiv.org/abs/2601.11302v1",
    "pdf_url": "https://arxiv.org/pdf/2601.11302v1.pdf",
    "title": "Introduction to the Mechanical Design of Accelerators",
    "abstract": "Particle accelerators represent some of the most sophisticated engineering achievements of our time. Their construction requires a unique combination of physics insight and mechanical engineering expertise. The aim of this paper is to provide young mechanical engineers with an introduction to the principles, methods, and challenges associated with the mechanical design of accelerators. The lecture upon which this proceeding is based emphasized the translation of functional requirements into engineering specifications, the critical importance of robust and reliable design, and the need for precisely defined drawings supported by international standards such as ISO GPS and GD&T. Through illustrative examples and a practical case inspired by CERN's existing components, the paper underlines the necessity of anticipating lifecycle demands, ensuring manufacturability, and safeguarding operational reliability. Particular emphasis is placed on the contractual value of 2D drawings, the practical application of functional dimensioning, and tolerance chain analysis. By reviewing common pitfalls and exploring best practices, the paper seeks to orient engineers towards design choices that balance cost, reliability, and performance.",
    "authors": [
      "Marc Timmins"
    ],
    "published": "2026-01-16T13:56:30Z",
    "updated": "2026-01-16T13:56:30Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.11298v1",
    "url": "https://arxiv.org/abs/2601.11298v1",
    "pdf_url": "https://arxiv.org/pdf/2601.11298v1.pdf",
    "title": "In situ and operando laboratory X-ray absorption spectroscopy at high temperature and controlled gas atmosphere with a plug-flow fixed-bed cell",
    "abstract": "The capabilities of a plug-flow fixed-bed cell for operando studies of heterogeneous catalysts are demonstrated using laboratory-based X-ray absorption spectroscopy (XAS) with a von Hamos spectrometer. The cell operates at temperatures up to 1000 deg C and pressures up to 10 bar, equipped with three mass flow controllers and two infrared lamps for rapid heating under inert/reactive gas atmospheres. Proof-of-principle studies include in situ MnO oxidation in 5% Ni/MnO and operando Ni nanoparticle evolution in 20-NiO/COK-12 (20.2% NiO on SiO2) during CO2 methanation before/after activation. Within 5-15 min per spectrum, oxidation state changes are resolved while catalytic activity is simultaneously quantified by online GC. Extended datasets and methods are available in the ancillary file SI.pdf (Supplementary Information file). A shortened version is submitted to Journal of Analytical Atomic Spectrometry as a Technical Note.",
    "authors": [
      "Sebastian Praetz",
      "Emiliano Dal Molin",
      "Delf Kober",
      "Marko Tesic",
      "Christopher Schlesiger",
      "Peter Kraus",
      "Julian T. Müller",
      "Jyothilakshmi Ravi Aswin",
      "Daniel Grötzsch",
      "Maged F. Bekheet",
      "Aleksander Gurlo",
      "Birgit Kanngießer"
    ],
    "published": "2026-01-16T13:53:50Z",
    "updated": "2026-01-16T13:53:50Z",
    "categories": [
      "physics.app-ph",
      "cond-mat.mtrl-sci",
      "physics.chem-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.app-ph"
  },
  {
    "arxiv_id": "2601.11296v1",
    "url": "https://arxiv.org/abs/2601.11296v1",
    "pdf_url": "https://arxiv.org/pdf/2601.11296v1.pdf",
    "title": "Light Dark Matter Search with 7.8 Tonne-Year of Ionization-Only Data in XENONnT",
    "abstract": "We report on a blinded search for dark matter (DM) using ionization-only (S2-only) signals in XENONnT with a total exposure of $7.83\\mathrm{tonne}\\times\\mathrm{year}$ over 579 days in three science runs. Dedicated background suppression techniques and the first complete S2-only background model in XENONnT provide sensitivity to nuclear recoils of [0.5, 5.0] $\\mathrm{keV_\\mathrm{nr}}$ and electronic recoils of [0.04, 0.7] $\\mathrm{keV_\\mathrm{ee}}$. No significant excess over the expected background is observed, and we set 90\\% confidence level upper limits on spin-independent DM--nucleon and spin-dependent DM--neutron scattering for DM masses between 3 and 8 $\\mathrm{GeV}/c^2$, as well as on DM--electron scattering, axion-like particles, and dark photons, improving on previous constraints. For spin-independent DM--nucleon scattering, we exclude cross sections above $6.0\\times10^{-45} $cm$^2$ at a DM mass of 5 $\\mathrm{GeV}/c^2$, pushing the XENONnT sensitivity closer to the region where coherent elastic neutrino-nucleus scattering ($\\text{CE}ν\\text{NS}$) becomes an irreducible background.",
    "authors": [
      "E. Aprile",
      "J. Aalbers",
      "K. Abe",
      "M. Adrover",
      "S. Ahmed Maouloud",
      "L. Althueser",
      "B. Andrieu",
      "E. Angelino",
      "D. Antón Martin",
      "S. R. Armbruster",
      "F. Arneodo",
      "L. Baudis",
      "M. Bazyk",
      "V. Beligotti",
      "L. Bellagamba",
      "R. Biondi",
      "A. Bismark",
      "K. Boese",
      "R. M. Braun",
      "G. Bruni",
      "G. Bruno",
      "R. Budnik",
      "C. Cai",
      "C. Capelli",
      "J. M. R. Cardoso",
      "A. P. Cimental Chávez",
      "A. P. Colijn",
      "J. Conrad",
      "J. J. Cuenca-García",
      "V. D'Andrea",
      "L. C. Daniel Garcia",
      "M. P. Decowski",
      "A. Deisting",
      "C. Di Donato",
      "P. Di Gangi",
      "S. Diglio",
      "K. Eitel",
      "S. el Morabit",
      "R. Elleboro",
      "A. Elykov",
      "A. D. Ferella",
      "C. Ferrari",
      "H. Fischer",
      "T. Flehmke",
      "M. Flierman",
      "R. Frankel",
      "D. Fuchs",
      "W. Fulgione",
      "C. Fuselli",
      "F. Gao",
      "R. Giacomobono",
      "F. Girard",
      "R. Glade-Beucke",
      "L. Grandi",
      "J. Grigat",
      "H. Guan",
      "M. Guida",
      "P. Gyorgy",
      "R. Hammann",
      "C. Hils",
      "L. Hoetzsch",
      "N. F. Hood",
      "M. Iacovacci",
      "Y. Itow",
      "J. Jakob",
      "F. Joerg",
      "Y. Kaminaga",
      "M. Kara",
      "S. Kazama",
      "P. Kharbanda",
      "M. Kobayashi",
      "D. Koke",
      "K. Kooshkjalali",
      "A. Kopec",
      "H. Landsman",
      "R. F. Lang",
      "L. Levinson",
      "A. Li",
      "I. Li",
      "S. Li",
      "S. Liang",
      "Z. Liang",
      "Y. -T. Lin",
      "S. Lindemann",
      "M. Lindner",
      "K. Liu",
      "M. Liu",
      "F. Lombardi",
      "J. A. M. Lopes",
      "G. M. Lucchetti",
      "T. Luce",
      "Y. Ma",
      "C. Macolino",
      "G. C. Madduri",
      "J. Mahlstedt",
      "F. Marignetti",
      "T. Marrodán Undagoitia",
      "K. Martens",
      "J. Masbou",
      "S. Mastroianni",
      "V. Mazza",
      "A. Melchiorre",
      "J. Merz",
      "M. Messina",
      "A. Michel",
      "K. Miuchi",
      "A. Molinario",
      "S. Moriyama",
      "M. Murra",
      "J. Müller",
      "K. Ni",
      "C. T. Oba Ishikawa",
      "U. Oberlack",
      "S. Ouahada",
      "B. Paetsch",
      "Y. Pan",
      "Q. Pellegrini",
      "R. Peres",
      "J. Pienaar",
      "M. Pierre",
      "G. Plante",
      "T. R. Pollmann",
      "F. Pompa",
      "A. Prajapati",
      "L. Principe",
      "J. Qin",
      "D. Ramírez García",
      "A. Ravindran",
      "A. Razeto",
      "R. Singh",
      "L. Sanchez",
      "J. M. F. dos Santos",
      "I. Sarnoff",
      "G. Sartorelli",
      "J. Schreiner",
      "P. Schulte",
      "H. Schulze Eißing",
      "M. Schumann",
      "L. Scotto Lavina",
      "M. Selvi",
      "F. Semeria",
      "F. N. Semler",
      "P. Shagin",
      "S. Shi",
      "H. Simgen",
      "Z. Song",
      "A. Stevens",
      "C. Szyszka",
      "A. Takeda",
      "Y. Takeuchi",
      "P. -L. Tan",
      "D. Thers",
      "G. Trinchero",
      "C. D. Tunnell",
      "K. Valerius",
      "S. Vecchi",
      "S. Vetter",
      "G. Volta",
      "B. von Krosigk",
      "C. Weinheimer",
      "M. Weiss",
      "D. Wenz",
      "C. Wittweg",
      "V. H. S. Wu",
      "Y. Xing",
      "D. Xu",
      "Z. Xu",
      "M. Yamashita",
      "J. Yang",
      "L. Yang",
      "J. Ye",
      "M. Yoshida",
      "L. Yuan",
      "G. Zavattini",
      "Y. Zhao",
      "M. Zhong",
      "T. Zhu"
    ],
    "published": "2026-01-16T13:51:36Z",
    "updated": "2026-01-16T13:51:36Z",
    "categories": [
      "hep-ex",
      "astro-ph.CO",
      "astro-ph.IM",
      "hep-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2601.11276v1",
    "url": "https://arxiv.org/abs/2601.11276v1",
    "pdf_url": "https://arxiv.org/pdf/2601.11276v1.pdf",
    "title": "A new class of special functions arising in plasma linear susceptibility tensor calculations",
    "abstract": "We investigate some fundamental properties of a peculiar class of special functions strictly related to Bessel, Anger and Weber functions, whose introduction was originally motivated by linear susceptibility tensor calculations in a hot, magnetised plasma. We show that these functions are solutions of an inhomogeneous Bessel ODE, with specified initial conditions and a distinct right-hand-side term fulfilling the Nielsen's requirement. Beside deriving recurrence relations and an alternative representation involving incomplete Anger-Weber functions, we show that these functions admit a simple series expansion in terms of Bessel functions of integer order, obtained by resorting to the Jacobi-Anger formula. In plasma applications this eventually leads to expressions involving infinite sums of products of Bessel functions, not particularly apt to numerical evaluation ought to their slow convergence rate when the particle's gyro-radius is larger than the wavelength. By exploiting the previously determined recurrence properties of the new class of functions we present a particularly simple derivation of the linear susceptibility tensor that enables to avoid this inconvenience.",
    "authors": [
      "Roberto Ricci"
    ],
    "published": "2026-01-16T13:21:17Z",
    "updated": "2026-01-16T13:21:17Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.09458v2",
    "url": "https://arxiv.org/abs/2601.09458v2",
    "pdf_url": "https://arxiv.org/pdf/2601.09458v2.pdf",
    "title": "Breakeven in Nuclear Fusion via Electron-Free Target",
    "abstract": "Nuclear fusion promises a nearly limitless energy source, but achieving breakeven-where fusion output exceeds input-requires extreme plasma conditions and complex confinement systems. Here we propose an alternative approach based on beam-target interactions, introducing a simple energy-based criterion that compares fusion energy generation with energy loss. By creating electron-free targets, stopping power is drastically reduced, enabling conditions where fusion energy surpasses beam energy deposition under practical scenarios. This approach offers a viable alternative pathway to fusion energy without high-temperature plasma confinement and warrants further experimental investigation.",
    "authors": [
      "Tadafumi Kishimoto"
    ],
    "published": "2026-01-14T13:04:45Z",
    "updated": "2026-01-16T12:27:02Z",
    "categories": [
      "nucl-ex",
      "physics.plasm-ph"
    ],
    "primary_category": "nucl-ex"
  },
  {
    "arxiv_id": "2508.13858v5",
    "url": "https://arxiv.org/abs/2508.13858v5",
    "pdf_url": "https://arxiv.org/pdf/2508.13858v5.pdf",
    "title": "Numerical simulations of a RF-RF hybrid plasma torch with argon at atmospheric pressure",
    "abstract": "We report numerical results regarding the minimum sustaining coil excitation current for a RF-RF hybrid torch operating at two different frequencies. The first coil is excited at a high-frequency, while the second coil is set at a medium frequency. The filling gas is argon, at atmospheric pressure. We use the modeling software COMSOL Multiphysics to describe the evolution of key parameters when: (i) the distance between the two coils changes, (ii) the power of the high frequency coil changes. We discuss the radial temperature profiles, the axial velocities and the heat convected at the end of the medium-frequency coil. The latter is compared with the total heat conduction to the plasma confinement tube wall.",
    "authors": [
      "Loann Terraz",
      "Biruk Alemu",
      "Santiago Eizaguirre"
    ],
    "published": "2025-08-19T14:17:59Z",
    "updated": "2026-01-16T11:10:56Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.46298/ops.16373"
  },
  {
    "arxiv_id": "2412.09971v2",
    "url": "https://arxiv.org/abs/2412.09971v2",
    "pdf_url": "https://arxiv.org/pdf/2412.09971v2.pdf",
    "title": "Limitations of emittance and source size measurement of laser-accelerated electron beams using the pepper-pot mask method",
    "abstract": "The pepper-pot method is a widely used technique, originally proposed for measuring the emittance of space-charge-dominated electron beams from radio-frequency photoinjectors. With recent advances in producing high-brightness electron beams via laser wakefield acceleration (LWFA), the method has also been applied to evaluate emittance in this new regime. Here, the limitations of this method for measuring the emittance of LWFA electron beams are investigated, particularly in parameter regimes where the true beam emittance is overestimated. Conducting an experiment at the JETi200 laser system, we measured an upper bound for the geometric beam emittance of $(26.2 \\pm 7.3)$ $μ$m mrad using the pepper-pot method. This result is consistent with GEANT4 Monte Carlo simulation of the pepper-pot diagnostic, with an input beam-emittance parameter that matches both PIC simulations of the laser-plasma accelerator and an independent measurement using the transient optical grating method.",
    "authors": [
      "F. C. Salgado",
      "A. Kozan",
      "D. Seipt",
      "D. Hollatz",
      "P. Hilz",
      "M. Kaluza",
      "A. Sävert",
      "A. Seidel",
      "D. Ullmann",
      "Y. Zhao",
      "M. Zepf"
    ],
    "published": "2024-12-13T08:58:42Z",
    "updated": "2026-01-16T11:08:17Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.10253v2",
    "url": "https://arxiv.org/abs/2507.10253v2",
    "pdf_url": "https://arxiv.org/pdf/2507.10253v2.pdf",
    "title": "Optimization of a cosmic muon tomography scanner for cargo border control inspection",
    "abstract": "The past several decades have seen significant advancement in applications using cosmic-ray muons for tomography scanning of unknown objects. One of the most promising developments is the application of this technique in border security for the inspection of cargo inside trucks and sea containers in order to search for hazardous and illicit hidden materials. This work focuses on the optimization studies for a muon tomography system similar to that being developed within the framework of the `SilentBorder' project funded by the EU Horizon 2020 scheme. Current studies are directed toward optimizing the detector module design, following two complementary approaches. The first leverages TomOpt, a Python-based end-to-end software that employs differentiable programming to optimize scattering tomography detector configurations. While TomOpt inherently supports gradient-based optimization, a Bayesian Optimization module is introduced to better handle scenarios with noisy objective functions, particularly in image reconstruction-driven optimization tasks. The second optimization strategy relies on detailed GEANT4-based simulations, which, while more computationally intensive, offer higher physical fidelity. These simulations are also employed to study the impact of incorporating secondary particle information alongside cosmic muons for improved material discrimination. This paper presents the current status and results obtained from these optimization studies.",
    "authors": [
      "Z. Zaher",
      "H. Lay",
      "T. Dorigo",
      "A. Giammanco",
      "V. Gulik",
      "C. Hrytsiuk",
      "V. A. Kudryavtsev",
      "M. Lagrange",
      "T. Metspalu",
      "G. C. Strong",
      "C. Turkoglu",
      "P. Vischia"
    ],
    "published": "2025-07-14T13:23:49Z",
    "updated": "2026-01-16T10:26:22Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.063/5.0287758"
  },
  {
    "arxiv_id": "2510.26741v3",
    "url": "https://arxiv.org/abs/2510.26741v3",
    "pdf_url": "https://arxiv.org/pdf/2510.26741v3.pdf",
    "title": "Characterization of the H2M Monolithic CMOS Sensor",
    "abstract": "The H2M (Hybrid-to-Monolithic) is a monolithic pixel sensor manufactured in a modified \\SI{65}{\\nano\\meter}~CMOS imaging process with a small collection electrode. Its design addresses the challenges of porting an existing hybrid pixel detector architecture into a monolithic chip, using a digital-on-top design methodology, and developing a compact digital cell library. Each square pixel integrates an analog front-end and digital pulse processing with an 8-bit counter within a \\SI{35}{\\micro\\meter}~pitch.   This contribution presents the performance of H2M based on laboratory and test beam measurements, including a comparison with analog front-end simulations in terms of gain and noise. A particular emphasis is placed on backside thinning in order to reduce material budget, down to a total chip thickness of \\SI{21}{\\micro\\meter} for which no degradation in MIP detection performance is observed. For all investigated samples, a MIP detection efficiency above \\SI{99}{\\%} is achieved below a threshold of approximately 205 electrons. At this threshold, the fake-hit rate corresponds to a matrix occupancy of fewer than one pixel per the \\SI{500}{\\nano\\second}~frame.   Measurements reveal a non-uniform in-pixel response, attributed to the formation of local potential wells in regions with low electric field. A simulation flow combining technology computer-aided design, Monte Carlo, and circuit simulations is used to investigate and describe this behavior, and is applied to develop mitigation strategies for future chip submissions with similar features.",
    "authors": [
      "Rafael Ballabriga",
      "Eric Buschmann",
      "Michael Campbell",
      "Raimon Casanova Mohr",
      "Dominik Dannheim",
      "Jona Dilg",
      "Ana Dorda",
      "Ono Feyens",
      "Finn King",
      "Philipp Gadow",
      "Ingrid-Maria Gregor",
      "Karsten Hansen",
      "Yajun He",
      "Lennart Huth",
      "Iraklis Kremastiotis",
      "Stephan Lachnit",
      "Corentin Lemoine",
      "Stefano Maffessanti",
      "Larissa Mendes",
      "Younes Otarid",
      "Christian Reckleben",
      "Sébastien Rettie",
      "Manuel Alejandro del Rio Viera",
      "Sara Ruiz Daza",
      "Judith Schlaadt",
      "Adriana Simancas",
      "Walter Snoeys",
      "Simon Spannagel",
      "Tomas Vanat",
      "Anastasiia Velyka",
      "Gianpiero Vignola",
      "Håkan Wennlöf"
    ],
    "published": "2025-10-30T17:38:03Z",
    "updated": "2026-01-16T10:22:20Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.11014v1",
    "url": "https://arxiv.org/abs/2601.11014v1",
    "pdf_url": "https://arxiv.org/pdf/2601.11014v1.pdf",
    "title": "Study of circular cross-section plasmas in HL-2A tokamak: MHD equilibrium, stability and operational \\b{eta} limit",
    "abstract": "Circular cross-section plasma is the most basic form of tokamak plasma and the fundamental configuration for magnetic confinement fusion experiments. Based on the HL-2A limiter discharge experiments, the magnetohydrodynamic (MHD) equilibrium and MHD instability of circular cross-section tokamak plasmas are investigated in this work. The results show that when q_0=0.95, the internal kink mode of m/n=1/1 is always unstable. The increase in plasma \\b{eta} (the ratio of thermal pressure to magnetic pressure) can lead to the appearance of external kink modes. The combination of axial safety factor q_0 and edge safety factor q_a determines the equilibrium configuration of the plasma and also affects the MHD stability of the equilibrium, but its growth rate is also related to the size of \\b{eta}. Under the condition of q_a>2 and q_0 slightly greater than 1, the internal kink mode and surface kink mode can be easily stabilized. However the plasma becomes unstable again and the instability intensity increases as q_0 continues to increase when q_0 exceeds 1. As the poloidal beta (\\b{eta}_p) increases, the MHD instability develops, the equilibrium configuration of MHD elongates laterally, and the Shafranov displacement increases, which in turn has the effect on suppressing instability. Calculations have shown that the maximum \\b{eta} value imposed by the ideal MHD mode in a plasma with free boundary in tokamak experiments is proportional to the normalized current I_N (I_N=I_p (MA)/a(m)B_0 (T)), and the achievable maximum beta \\b{eta}(max) is calibrated to be 2.01I_N,i.e. \\b{eta}(max)~2.01I_N. The operational \\b{eta} limit of HL-2A circular cross-section plasma is approximately \\b{eta}_N^c~2.0. Too high a value of q_0 is not conducive to MHD stability and leads the \\b{eta} limit value to decrease. When q_0=1.3, we obtain a maximum value of \\b{eta}_N of approximately 1.8.",
    "authors": [
      "SHEN Yong",
      "DONG Jiaqi",
      "SHI Zhongbing",
      "HE Hongda",
      "ZHAO Kaijun",
      "PENG Xiaodong",
      "QU Hongpeng",
      "LI Jia",
      "SUN Aiping"
    ],
    "published": "2026-01-16T06:11:25Z",
    "updated": "2026-01-16T06:11:25Z",
    "categories": [
      "physics.plasm-ph",
      "physics.data-an"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.7498/aps.74.20250450"
  },
  {
    "arxiv_id": "2601.11003v1",
    "url": "https://arxiv.org/abs/2601.11003v1",
    "pdf_url": "https://arxiv.org/pdf/2601.11003v1.pdf",
    "title": "Generation and Enhancement of Persistent Nanoscale Magnetization in All-Dielectric Metasurfaces by Optically Injected and Localized Free Carriers",
    "abstract": "Time-varying dielectric metasurfaces supporting sharp optical resonances with a non-trivial electromagnetic field distribution represent a unique platform for realizing temporal interfaces for metasurface-guided waves (MGWs). Rapidly changing metasurface resonance enables frequency conversion and temporal scattering of a concurrently propagating MGW. Using analytical methods and electromagnetic simulations, we demonstrate that localized free-carrier generation can be engineered to produce frequency-shifted, time-refracted, and reflected infrared MGWs. Furthermore, we demonstrate that such time interfaces can be utilized to generate large, highly localized quasistatic magnetic fields within the metasurfaces. The resulting nanoscale magnetization, supported by the residual circulating currents, persists after the departure of the time-scattered MGWs. We further demonstrate that the initial electromagnetic energy of the injected MGWs is partitioned between the time-reflected/refracted MGWs, residual motion of the free carriers, and a quasistatic magnetic field.",
    "authors": [
      "Shivaksh Rawat",
      "Samyobrata Mukherjee",
      "Gennady Shvets"
    ],
    "published": "2026-01-16T05:35:11Z",
    "updated": "2026-01-16T05:35:11Z",
    "categories": [
      "physics.optics",
      "physics.app-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2401.04600v3",
    "url": "https://arxiv.org/abs/2401.04600v3",
    "pdf_url": "https://arxiv.org/pdf/2401.04600v3.pdf",
    "title": "Theoretical research on low-frequency drift Alfvén waves in general Tokamak equilibria",
    "abstract": "We developed kinetic models based on general fishbone-like dispersion relations. Firstly, a general model for arbitrary magnetic configuration and ion orbit width is presented. Then, by disregarding ion orbit width and approximating the magnetic geometry as circular, we introduce a simplified model that fully incorporates circulating/trapped ion effects. Finally, by considering the limit of ions being well-circulating or deeply trapped, the results directly revert to those observed in earlier theoretical studies.",
    "authors": [
      "Yang Li"
    ],
    "published": "2024-01-09T15:16:12Z",
    "updated": "2026-01-16T03:26:34Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.10898v1",
    "url": "https://arxiv.org/abs/2601.10898v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10898v1.pdf",
    "title": "U-Net-based surrogate modeling for attosecond X-ray free-electron lasers",
    "abstract": "Attosecond X-ray pulse generation in modern X-ray free-electron lasers relies on strongly compressed, precisely tailored electron bunches, making accurate diagnostics and control of the longitudinal phase space (LPS) essential. In the self-chirping scheme, collective effects in the linac generate a strong energy chirp that is converted into high peak current through pre-undulator compression, enabling isolated attosecond pulse generation. Reliable operation of this scheme depends on precise LPS control and fast diagnostics. In this work, we present a U-Net-based neural network surrogate that predicts two-dimensional LPS distributions directly from accelerator settings. The model exhibits excellent agreement with start-to-end simulation results. These results demonstrate the potential of neural network surrogates to facilitate real-time tuning and control in attosecond X-ray pulse generation.",
    "authors": [
      "Yufei Wei",
      "Bingyang Yan",
      "Chenzhi Xu",
      "Jiawei Yan",
      "Haixiao Deng"
    ],
    "published": "2026-01-15T22:53:15Z",
    "updated": "2026-01-15T22:53:15Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.10885v1",
    "url": "https://arxiv.org/abs/2601.10885v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10885v1.pdf",
    "title": "Learning collision operators from plasma phase space data using differentiable simulators",
    "abstract": "We propose a methodology to infer collision operators from phase space data of plasma dynamics. Our approach combines a differentiable kinetic simulator, whose core component in this work is a differentiable Fokker-Planck solver, with a gradient-based optimisation method to learn the collisional operators that best describe the phase space dynamics. We test our method using data from two-dimensional Particle-in-Cell simulations of spatially uniform thermal plasmas, and learn the collision operator that captures the self-consistent electromagnetic interaction between finite-size charged particles over a wide variety of simulation parameters. We demonstrate that the learned operators are more accurate than alternative estimates based on particle tracks, while making no prior assumptions about the relevant time-scales of the processes and significantly reducing memory requirements. We find that the retrieved operators, obtained in the non-relativistic regime, are in excellent agreement with theoretical predictions derived for electrostatic scenarios. Our results show that differentiable simulators offer a powerful and computational efficient approach to infer novel operators for a wide rage of problems, such as electromagnetically dominated collisional dynamics and stochastic wave-particle interactions.",
    "authors": [
      "Diogo D. Carvalho",
      "Pablo J. Bilbao",
      "Warren B. Mori",
      "Luis O. Silva",
      "E. Paulo Alves"
    ],
    "published": "2026-01-15T22:31:26Z",
    "updated": "2026-01-15T22:31:26Z",
    "categories": [
      "physics.plasm-ph",
      "cs.LG",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.10879v1",
    "url": "https://arxiv.org/abs/2601.10879v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10879v1.pdf",
    "title": "Stacked geometry concept for CosmicWatch based muon detectors in coincidence mode",
    "abstract": "CosmicWatch-based muon detectors are inexpensive, handheld, battery-powered, portable instruments designed to measure the flux of secondary muons produced when primary cosmic rays continuously strike the Earth's atmosphere. As these muons pass through the detector, plastic scintillators generate light, which is collected by silicon photomultiplier (SiPM) sensors and converted to an electric signal. The signal is processed by an Arduino-based acquisition system and recorded as count rates corresponding to the cosmic muon flux. A stacked configuration consisting of two scintillator modules wrapped together and read by two SiPM sensors, which are operated in coincidence mode via linked Arduino microcontrollers, is presented. The novelty of this work is in demonstrating that detector geometry improves signal purity by defining a constrained solid angle and enabling coincidence filtering, thereby reducing uncorrelated background and local electronic noise. The system was deployed during the 2024 total solar eclipse, demonstrating stable field operation and reliable flux monitoring. The mechanical design, coincidence logic implementation, and performance characterization of the instrument are described. Overall, this work demonstrates a scalable, robust, and inexpensive architecture suitable for geographically distributed muon flux monitoring arrays.",
    "authors": [
      "Ishannita Banerjee",
      "Swagato Banerjee",
      "Douglas Jackson",
      "John Naber"
    ],
    "published": "2026-01-15T22:15:23Z",
    "updated": "2026-01-15T22:15:23Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.10855v1",
    "url": "https://arxiv.org/abs/2601.10855v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10855v1.pdf",
    "title": "Vortex Solitons and Filamentation of Electromagnetic Beams in Relativistically Degenerate Plasmas",
    "abstract": "We study the propagation and stability of electromagnetic vortex beams in relativistically de generate plasmas. We show that such plasmas support localized vortex solitons carrying orbital angular momentum and analyze their linear and nonlinear stability. Vortex solitons undergo az imuthal symmetry-breaking instabilities whose growth rates depend on beam power, propagation constant, and topological charge, with the dominant mode determining the number of filaments formed during breakup. We further demonstrate that vortex solitons act as nonlinear attractors with a finite basin of attraction, while the vortex core remains topologically protected, maintaining a strictly zero field intensity at the beam center throughout the evolution. The results persist across a broad range of degeneracy parameters and are relevant to hard X-ray radiation propagating in dense astrophysical plasmas.",
    "authors": [
      "Nikolai Maltsev",
      "Vazha I. Berezhiani"
    ],
    "published": "2026-01-15T20:46:44Z",
    "updated": "2026-01-15T20:46:44Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.10829v1",
    "url": "https://arxiv.org/abs/2601.10829v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10829v1.pdf",
    "title": "A Neutron Microscope Using a Nested Wolter-I Condenser and a Bank of Diffractive-Refractive Achromatic Objectives",
    "abstract": "We propose a nested Wolter-I mirror design for a neutron condenser, which is based on established X-ray telescope technology. We demonstrate through simulations that it can increase the flux density at the ESS imaging instrument ODIN by up to two orders of magnitude. Experimental measurements of reflectivity and figure errors on a prototype mirror element confirm the technical feasibility of the approach. Then, we discuss design strategies for an imaging objective to fully exploit the condenser specifications while achieving spatial resolutions comparable to those of X-ray micro-CT instruments. Analytically, we show that for monochromatic beams suitable solutions exist employing arrays of hundreds of identical objectives, realized either as compound refractive lenses (CRLs) or Fresnel zone plates (FZPs). To mitigate the inherent chromatic aberration of these optics, each individual objective could be replaced by an achromatic FZP/CRL combination. Key optical properties of the resulting microscope are estimated. This novel full-field microscopy concept for highly divergent, polychromatic neutron beams has the potential to improve temporal and spatial resolution for large samples and sample environments and to enable the simultaneous acquisition of hundreds of projections in neutron tomography.",
    "authors": [
      "Henning Friis Poulsen",
      "Cæcilie Andersen",
      "Nolan Ravinet",
      "Joan Vila-Comamala",
      "Mano Raj Dhanalakshmi Veeraraj",
      "Erik Bergbäck Knudsen",
      "Peter Kjær Willendrup",
      "Sonny Massahi",
      "Finn Erland Christensen",
      "Desiree Della Monica Ferreira",
      "Markus Strobl",
      "Christian David",
      "Luise Theil Kuhn"
    ],
    "published": "2026-01-15T20:01:53Z",
    "updated": "2026-01-15T20:01:53Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.10807v1",
    "url": "https://arxiv.org/abs/2601.10807v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10807v1.pdf",
    "title": "Charge-Carrier Mobility in Diamond: Review, Data Compilation, and Modelling for Detector Simulations",
    "abstract": "Reported electron and hole mobilities, and their saturation velocities, in diamond span orders of magnitude across the literature. We attribute this dispersion primarily to (i) the electric-field window probed in TCT measurements, (ii) the choice of mobility model, and (iii) the excitation source (alpha, laser, or electron). Using an aggregated literature dataset, we benchmark the Trofimenkoff and Caughey-Thomas parameterisations together with a new piecewise model for both conduction- and valence-band transport. For electrons, the piecewise model provides the best global description over a broad electric-field range and is shown to arise as the room-temperature limit of a more general superposition framework that explicitly incorporates intervalley repopulation in the conduction band. For holes, the Caughey-Thomas model remains the statistically preferred description, in line with the absence of a strong repopulation effect in the accessible data. Furthermore, we demonstrate a systematic source dependence (alpha versus laser) and quantify its impact on fitted mobility and saturation-velocity values. We provide temperature scalings over narrow intervals around room temperature and recommend parameter sets for implementation in device and detector simulation frameworks. Together, these results reconcile much of the apparent inconsistency in the literature and offer clear guidance for model selection, experimental design, and device-level simulation of charge transport in intrinsic diamond.",
    "authors": [
      "Faiz Rahman Ishaqzai",
      "Muhammed Deniz",
      "Kevin Kröninger",
      "Jens Weingarten"
    ],
    "published": "2026-01-15T19:16:04Z",
    "updated": "2026-01-15T19:16:04Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mtrl-sci",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.10801v1",
    "url": "https://arxiv.org/abs/2601.10801v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10801v1.pdf",
    "title": "Towards Tensor Network Models for Low-Latency Jet Tagging on FPGAs",
    "abstract": "We present a systematic study of Tensor Network (TN) models $\\unicode{x2013}$ Matrix Product States (MPS) and Tree Tensor Networks (TTN) $\\unicode{x2013}$ for real-time jet tagging in high-energy physics, with a focus on low-latency deployment on Field Programmable Gate Arrays (FPGAs). Motivated by the strict requirements of the HL-LHC Level-1 trigger system, we explore TNs as compact and interpretable alternatives to deep neural networks. Using low-level jet constituent features, our models achieve competitive performance compared to state-of-the-art deep learning classifiers. We investigate post-training quantization to enable hardware-efficient implementations without degrading classification performance or latency. The best-performing models are synthesized to estimate FPGA resource usage, latency, and memory occupancy, demonstrating sub-microsecond latency and supporting the feasibility of online deployment in real-time trigger systems. Overall, this study highlights the potential of TN-based models for fast and resource-efficient inference in low-latency environments.",
    "authors": [
      "Alberto Coppi",
      "Ema Puljak",
      "Lorenzo Borella",
      "Daniel Jaschke",
      "Enrique Rico",
      "Maurizio Pierini",
      "Jacopo Pazzini",
      "Andrea Triossi",
      "Simone Montangero"
    ],
    "published": "2026-01-15T19:04:49Z",
    "updated": "2026-01-15T19:04:49Z",
    "categories": [
      "cs.LG",
      "hep-ex",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "cs.LG"
  },
  {
    "arxiv_id": "2601.10799v1",
    "url": "https://arxiv.org/abs/2601.10799v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10799v1.pdf",
    "title": "The BigBite Calorimeter for the Super Bigbite Spectrometer Program at Jefferson Lab",
    "abstract": "We report features of the design, construction, installation, and performance of the BigBite Calorimeter (BBCal), a lead-glass electromagnetic calorimeter constructed as part of the BigBite Spectrometer (BBS), which served as the electron arm for the Super Bigbite Spectrometer (SBS) program of high-precision neutron electromagnetic form factor measurements in Hall A at Jefferson Lab. As a total-absorption calorimeter, BBCal provided the primary electron trigger for BBS, detecting (quasi-) elastically scattered electrons in the 1-4 GeV energy range with an energy resolution of approximately 6.2%, position resolution of 1.2 cm, and timing resolution of 0.5 ns.",
    "authors": [
      "Provakar Datta",
      "Katherine Evans",
      "Jason Bane",
      "Hem Bhatt",
      "Bhesha Devkota",
      "Eric Fuchey",
      "Tyler Hague",
      "Douglas Higinbotham",
      "Amanda Hoebel",
      "Mark Jones",
      "Abishek Karki",
      "Mikhail Kubantsev",
      "Shujie Li",
      "Michael Nycz",
      "Roman Pomatsalyuk",
      "Andrew Puckett",
      "Igor Rachek",
      "Seamus Riordan",
      "Brad Sawatzky",
      "Sebastian Seeds",
      "Albert Shahinyan",
      "Yuri Shestakov",
      "Arun Tadepalli",
      "Vladimir Verebryusov",
      "Hakob Voskanyan",
      "Bogdan Wojtsekhowski",
      "Ashley Yoon"
    ],
    "published": "2026-01-15T19:02:44Z",
    "updated": "2026-01-15T19:02:44Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.10694v1",
    "url": "https://arxiv.org/abs/2601.10694v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10694v1.pdf",
    "title": "Increasing the opening speed of the plasma opening switch on an direct action accelerator with an inductive energy storage device",
    "abstract": "To increase the voltage multiplication factor in a small-sized direct-acting electron accelerator DIN-2K with an inductive energy storage and a plasma opening switch, it is necessary to ensure an increase in the rate of change of the current and its amplitude during the POS opening for the purpose of obtaining an explosive electron emission with the formation of an electron beam and a virtual cathode. However, the opening process depends on many electrical parameters of the plant, and it re-quires determining their joint and individual effect on its dynamics. The purpose of this research is to study and determine the effects of electrical parameters, including those of the discharge voltages of the entire electrical circuit of the accelerator on the dynamics of the plasma opening switch, in particular opening speed, current amplitudes, and opening time, as well as to give recommendations on optimizing the operation of accelerators of this type and highlight possible ways to increase the voltage multiplication factor. Methodology. A method for determining the induced voltage according to experimental current oscillograms has been proposed. The methodology was verified by the coincidence of its data with the results of measurements by a capacitive voltage divider with the data spread of less than 20%. Scientific novelty. The rates of change in the current at the plasma switch opening stage were determined depending on the main electrical parameters of the DIN-2K accelerator. The diagnostics of the voltage induced during the POS opening were provided using no capacitive voltage divider in the internal volume of the accelerator, which enabled the removal of some diagnostic tools from the working volume of the chamber. Practical significance.",
    "authors": [
      "D. V. Vinnikov",
      "O. M. Ozerov",
      "V. V. Katrechko",
      "V. I. Tkachov",
      "O. V. Manuilenko",
      "I. N. Onishchenko"
    ],
    "published": "2026-01-15T18:52:26Z",
    "updated": "2026-01-15T18:52:26Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.10571v1",
    "url": "https://arxiv.org/abs/2601.10571v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10571v1.pdf",
    "title": "Corrections for systematic errors in slit-profiler transverse phase space measurements",
    "abstract": "In photo injectors, the transverse emittance is one of the key measures of beam quality as it defines the possible performance of the whole facility. As such it is important to measure the emittance in photo injectors and ensure the accuracy of these measurements. While there are many different methods of measuring the emittance, this paper focuses on quantifying the systematic errors present in transverse phase space measurements taken with slit-profiler methods, i.e. scanning a narrow slit over the beam and continually measuring the passed beamlets' divergence with a downstream profiler. The measurement errors include effects of the slit size, beamlet imaging, and residual space charge. While these effects are generally small, they can have significant impact on the measured emittance when the 2D phase space is strongly coupled. The systematic effects studied and corrections are demonstrated with simulations and measurements from the Photo Injector Test facility at DESY in Zeuthen (PITZ) using a slit-screen emittance scanner.",
    "authors": [
      "C. Richard",
      "M. Krasilnikov",
      "N. Aftab",
      "Z. Amirkhanyan",
      "D. Dmytriiev",
      "A. Hoffmann",
      "M. Gross",
      "X. -K. Li",
      "Z. Lotfi",
      "F. Stephan",
      "G. Vashchenko",
      "S. Zeeshan"
    ],
    "published": "2026-01-15T16:37:09Z",
    "updated": "2026-01-15T16:37:09Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.10570v1",
    "url": "https://arxiv.org/abs/2601.10570v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10570v1.pdf",
    "title": "Canonical Vorticity Perspective on Magnetogenesis: Unifying Weibel, Biermann, and Beyond",
    "abstract": "We briefly review the current status of magnetogenesis, a cross-disciplinary field that bridges cosmology and plasma physics, studying the origin of magnetic fields in the universe. We formulate a canonical vorticity framework to investigate kinetic plasma physics-based magnetogenesis processes in a collisionless plasma. By considering canonical vorticity, a weighted sum of the fluid vorticity and the magnetic field as the canonical variable, this framework unifies several magnetogenesis processes, including the Biermann battery, the Weibel instability, and predicts several new pressure tensorial configurations as the fundamental source of self-generated magnetic field and vorticity in plasma. The framework is further extended to relativistic regime where an additional source of canonical vorticity, termed as kineclinicity effect, is identified. The theoretical predictions are systematically validated using particle-in-cell simulations, highlighting their implications for laboratory and astrophysical plasma environments.",
    "authors": [
      "Modhuchandra Laishram",
      "Young Dae Yoon"
    ],
    "published": "2026-01-15T16:34:10Z",
    "updated": "2026-01-15T16:34:10Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2501.04619v2",
    "url": "https://arxiv.org/abs/2501.04619v2",
    "pdf_url": "https://arxiv.org/pdf/2501.04619v2.pdf",
    "title": "Fast physics-based launcher optimization for electron cyclotron current drive",
    "abstract": "With the increased urgency to design fusion pilot plants, fast optimization of electron cyclotron current drive (ECCD) launchers is paramount. Traditionally, this is done by coarsely sampling the 4-D parameter space of possible launch conditions consisting of (1) the launch location (constrained to lie along the reactor vessel), (2) the launch frequency, (3) the toroidal launch angle, and (4) the poloidal launch angle. For each initial condition, a ray-tracing simulation is performed to evaluate the ECCD efficiency. Unfortunately, this approach often requires a large number of simulations (sometimes millions in extreme cases) to build up a dataset that adequately covers the plasma volume, which must then be repeated every time the design point changes. Here we adopt a different approach. Rather than launching rays from the plasma periphery and hoping for the best, we instead directly reconstruct the optimal ray for driving current at a given flux surface using a reduced physics model coupled with a commercial ray-tracing code. Repeating this throughout the plasma volume requires only hundreds of simulations, constituting a significant speedup. The new method is validated on two separate example tokamak profiles, and is shown to reliably drive localized current at the specified flux surface with the same optimal efficiency as obtained from the traditional approach.",
    "authors": [
      "N A Lopez",
      "A Alieva",
      "S A M McNamara",
      "X Zhang"
    ],
    "published": "2025-01-08T17:03:08Z",
    "updated": "2026-01-15T16:26:44Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1088/1361-6587/adcae7"
  },
  {
    "arxiv_id": "2406.10979v2",
    "url": "https://arxiv.org/abs/2406.10979v2",
    "pdf_url": "https://arxiv.org/pdf/2406.10979v2.pdf",
    "title": "Collisional whistler instability and electron temperature staircase in inhomogeneous plasma",
    "abstract": "High-beta magnetized plasmas often exhibit anomalously structured temperature profiles, as seen from galaxy cluster observations and recent experiments. It is well known that when such plasmas are collisionless, temperature gradients along the magnetic field can excite whistler waves that efficiently scatter electrons to limit their heat transport. Only recently has it been shown that parallel temperature gradients can excite whistler waves also in collisional plasmas. Here we develop a Wigner--Moyal theory for the collisional whistler instability starting from Braginskii-like fluid equations in a slab geometry. This formalism is necessary because, for a large region in parameter space, the fastest-growing whistler waves have wavelengths comparable to the background temperature gradients. We find additional damping terms in the expression for the instability growth rate involving inhomogeneous Nernst advection and resistivity. They (i) enable whistler waves to re-arrange the electron temperature profile via growth, propagation, and subsequent dissipation, and (ii) allow non-constant temperature profiles to exist stably. For high-beta plasmas, the marginally stable solutions take the form of a temperature staircase along the magnetic field lines. The electron heat flux can also be suppressed by the Ettingshausen effect when the whistler intensity profile is sufficiently peaked and oriented opposite the background temperature gradient. This mechanism allows cold fronts without magnetic draping, might reduce parallel heat losses in inertial fusion experiments, and generally demonstrates that whistler waves can regulate transport even in the collisional limit.",
    "authors": [
      "N. A. Lopez",
      "A. F. A. Bott",
      "A. A. Schekochihin"
    ],
    "published": "2024-06-16T15:30:15Z",
    "updated": "2026-01-15T16:19:52Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1017/S0022377825000078"
  },
  {
    "arxiv_id": "2501.11029v2",
    "url": "https://arxiv.org/abs/2501.11029v2",
    "pdf_url": "https://arxiv.org/pdf/2501.11029v2.pdf",
    "title": "Laser-induced plasma formation and cavitation in water: from nanoeffects to extreme states of matter",
    "abstract": "We present an in-depth analysis of the energy dependence of optical breakdown in water by tightly focused laser pulses, from plasma formation to shock waves and cavitation. Laser pulses of fs to ns durations and UV to IR wavelengths are aberration-free focused through microscope objectives. Photography captures luminescent plasmas with submicrometer resolution, and bubble threshold and size are determined via probe beam scattering. The energy dependence of mechanical effects is quantified through the maximum bubble radius Rmax. We find three key scenarios depicting the interaction between multiphoton and avalanche ionization, recombination, and thermal ionization from nanoeffects near threshold to extreme energy densities. They include a previously unknown scenario that emerges with single-longitudinal-mode UV ns pulses from compact lasers. It enables cost-effective creation of nanoeffects, as demonstrated on corneal tissue and glass. High-resolution photography reveals new insights in the spatiotemporal dynamics of plasma formation, with an interplay of breakdown waves, string formation by local instabilities of avalanche ionization, and radiative energy transport. Plasma volume data from photographs together with absorption measurements show that the average energy density of luminescent fs and ns plasmas is similar, ranging between 10 and 40 kJ/cm^3 . However, small hot regions with up to 400 kJ/cm^3 are formed in ns breakdown. From the hot regions, energy is spread out via X-ray bremsstrahlung, forming a luminescent halo. Well above threshold, Rmax scales with E^(1/3) across all scenarios, with 15% - 20% conversion of laser energy into bubble energy. With increasing plasma energy density, an ever-larger energy fraction is converted into shock wave energy (75% at 40 kJ/cm^3 ). The results provide guidelines for parameter selection in laser surgery and material processing.",
    "authors": [
      "Norbert Linz",
      "Sebastian Freidank",
      "Xiao-Xuan Liang",
      "Alfred Vogel"
    ],
    "published": "2025-01-19T12:35:05Z",
    "updated": "2026-01-15T15:02:05Z",
    "categories": [
      "physics.flu-dyn",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.flu-dyn",
    "doi": "10.1088/1361-6633/adedb3"
  },
  {
    "arxiv_id": "2601.10472v1",
    "url": "https://arxiv.org/abs/2601.10472v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10472v1.pdf",
    "title": "From Weibel seeds to collisionless dynamos beyond pair-plasmas",
    "abstract": "Bridging the spatiotemporal scales of magnetic seed field generation and subsequent dynamo amplification in the weakly collisional intracluster medium presents an extreme numerical challenge. We perform collisionless turbulence simulations with initially unmagnetized electrons that capture both magnetic seed generation via the electron Weibel instability and the ensuing dynamo amplification. Going beyond existing pair-plasma studies, we use an ion-to-electron mass ratio of 100 for which we find electron and ion dynamics are sufficiently decoupled. These simulations are enabled by the 10-moment collisionless fluid solver of Gkeyll, which evolves the full pressure tensor for all species. The electron heat-flux closure regulates pressure isotropization and effectively sets the magnetic Reynolds number. We investigate how the strength of of the closure influences the transition between a regime reminiscent of previous kinetic pair-plasma simulations and a more MHD-like dynamo regime.",
    "authors": [
      "Lise Hanebring",
      "James Juno",
      "Ammar Hakim",
      "Jason M. TenBarge",
      "Istvan Pusztai"
    ],
    "published": "2026-01-15T14:57:57Z",
    "updated": "2026-01-15T14:57:57Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.CO"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.10430v1",
    "url": "https://arxiv.org/abs/2601.10430v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10430v1.pdf",
    "title": "Active interrogation of underground piezoelectric fabrics using high energy muon beams propagating across seismogenic faults",
    "abstract": "In this paper we extend a previous analysis of a newly conceived technique based on active interrogation of tectonic stress evolution in regions hosting active seismogenic faults. The aim is to monitor and detect stable and reliable precursor signals on an adequate time scale, well before an earthquake event, that can play a crucial role in activating alarms for civil protection systems. The precursor signal relies on continuous measurements of the time evolution of tectonic stress, obtained by interrogating underground, with a high energy collimated muon beam, the piezoelectric fabrics present in quartz rich granite like rocks surrounding a known seismogenic fault in the Earth crust. Beam propagation through the rock across the active fault conveys to a detector at the exit of the traversal information on the amplitude of the piezoelectric field, which scales with the tectonic stress applied to quartz crystals embedded in the rock. The system, named ERMES (Earthquake Reconnaissance using Muon beam Evolution in Silicon dioxide), differs from other techniques under study detecting electromagnetic signals generated by piezoelectricity outside the Earth crust, as it probes piezoelectric effects directly inside the source region of the associated electromagnetic field, namely the near field within quartz crystals rather than the far field in open space. We present a focused analysis of muon beam manipulation after rock traversal and before detection using a newly conceived muonic lens, and we explore the maximum rock penetration capability of a high energy muon beam, reaching about 3 km of rock thickness for a 10 TeV beam. Owing to the peculiarity of muon propagation through such kilometer scale targets, we cross checked previous FLUKA Monte Carlo simulations with Geant4 to clarify the secondary muons role generated by primary muon interactions in solid matter over long propagation lengths.",
    "authors": [
      "L. Serafini",
      "A. Bacci",
      "L. Bandiera",
      "F. Broggi",
      "I. Drebot",
      "A. Frazzitta",
      "A. M. Marotta",
      "G. Muttoni",
      "G. Paternò",
      "V. Petrillo",
      "M. Rossetti Conti",
      "A. R. Rossi",
      "S. Samsam",
      "M. Voltolini",
      "M. Zucali"
    ],
    "published": "2026-01-15T14:26:10Z",
    "updated": "2026-01-15T14:26:10Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.06651v5",
    "url": "https://arxiv.org/abs/2512.06651v5",
    "pdf_url": "https://arxiv.org/pdf/2512.06651v5.pdf",
    "title": "A Capacitor Model of the Helical Deflector: Revisiting Shamaev's Proposal and the Textbook Model",
    "abstract": "An RF helical deflector is a type of electron and ion optics device that applies a time-dependent rotating transverse electric or magnetic field by means of time-dependent RF voltage applied on two opposite conducting helical structures (wires, ribbons or other) to deflect charged particles (a single, bunch or beam) in a circular or spiral path. It is a perspective indirect timing system being concurrent for reaching picosecond time resolution, and have promise being excellent candidate for high precision time-of-flight detection. As a timing system, it converts the temporal structure of an electron beam into a spatial pattern -- particularly, an ellipse in the case of a single-frequency RF voltage and continuous electron pencil beam.   I propose a capacitor model of an RF helical deflector and compare it with the existing textbook model \\cite{ZhigarevBook, Gevorgian2015}, interpret them and provide understanding of them. Furthermore, I analyze the latter, finding analytical formulas for the applied electric field, ellipse sizes (semi-axes) and rotation angle, lengths of the ellipse line, corresponding to the duration of electron pencil bunches or beams. The present article touches the topics of getting circle on resonance limit and of deflection sensitivity.",
    "authors": [
      "Hayk Lekdar Gevorgyan"
    ],
    "published": "2025-12-07T04:27:08Z",
    "updated": "2026-01-15T11:50:43Z",
    "categories": [
      "physics.acc-ph",
      "physics.app-ph",
      "physics.class-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.10295v1",
    "url": "https://arxiv.org/abs/2601.10295v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10295v1.pdf",
    "title": "Design, Fabrication and Testing of a D-Shaped High Temperature Superconducting Magnet",
    "abstract": "High-temperature technical superconductors are potential candidates for compact and high-field tokamak magnets. The demand for higher fusion power can be met with an on-axis high magnetic field due to toroidal magnets. An R&D activity has been initiated at the Institute for Plasma Research, India, to develop a compact D-shaped superconducting magnet utilizing REBCO high-temperature superconducting tapes. Under this initiative, a toroidal configuration with a major radius of 0.42 m, consisting of eight D-shaped, four poloidal field, and a central solenoid high-temperature superconducting magnets producing an on-axis toroidal magnetic field of 0.23 T has been conceptualized. The fabrication feasibility of a D-shaped coil for this toroidal configuration also envisaged using stacked high-temperature superconducting cable. In this paper, we report the design of a compact D-shaped coil, the fabrication of a long length HTS cable, a winding pack, and its integration with a cryogenic casing and vacuum enclosure. The winding pack terminations, joints, its interfacing with the power supply, and performance testing are also reported in this paper.",
    "authors": [
      "Upendra Prasad",
      "Mahesh Ghate",
      "Piyush Raj",
      "Deven Kanabar",
      "Pankaj Varmora",
      "Swati Roy",
      "Arun Panchal",
      "Dhaval Bhavsar",
      "Anees Bano",
      "Nitish Kumar",
      "Bhadresh Parghi",
      "Akhilesh Yadav",
      "Mohd. Umer",
      "Vijay Vasava",
      "Raton Mandal",
      "Rajkumar Ahirwar",
      "Megha Thaker"
    ],
    "published": "2026-01-15T11:13:18Z",
    "updated": "2026-01-15T11:13:18Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.10293v1",
    "url": "https://arxiv.org/abs/2601.10293v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10293v1.pdf",
    "title": "Updated electrical design of the Diagnostic Neutral Beam Injector in RFX-mod2",
    "abstract": "The Diagnostic Neutral Beam Injector of the RFX-mod2 experiment (Consorzio RFX, Padova) is expected to provide novel and significant information about the Reversed Field Pinch confinement of fusion plasmas. The injection of the hydrogen beam in the plasma will allow Charge Exchange Recombination Spectroscopy (CXRS) and Motional Stark Effect diagnostics (MSE) to measure several quantities: ion speed, ion temperature, impurity content, intensity and pitch of the magnetic field. The DNBI is of particular importance for allowing the determination of these quantities at the core of the plasma. The present DNBI, built by the Budker Institute of Plasma Physics, features an arc discharge H+ source, coupled to a 4-grid 50 keV acceleration system. The 50 ms, 5 A ion beam is neutralized by charge exchange by means of a gas target; residual ions are then deflected by a magnetic field before injection in the torus chamber. The beam can be modulated at maximum 250 Hz. The DNBI will undergo extraordinary maintenance and a structural upgrade to improve its reliability and safety. This contribution presents the latest upgrades of the electrical plants and of the control system of the DNBI.",
    "authors": [
      "Marco Barbisan",
      "Bruno Laterza",
      "Luca Cinnirella",
      "Lionello Marrelli",
      "Federico Molon",
      "Simone Peruzzo",
      "Enrico Zampiva"
    ],
    "published": "2026-01-15T11:11:05Z",
    "updated": "2026-01-15T11:11:05Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2303.18100v2",
    "url": "https://arxiv.org/abs/2303.18100v2",
    "pdf_url": "https://arxiv.org/pdf/2303.18100v2.pdf",
    "title": "Asymmetric Electrostatic Dodecapole: Compact Bandpass Filter with Low Aberrations for Momentum Microscopy",
    "abstract": "Imaging energy filters in photoelectron microscopes and momentum microscopes use spherical fields with deflection angles of 90°, 180°, and even 2 x 180°. These instruments are optimized for high energy resolution, but exhibit image aberrations when operated in high transmission mode at medium energy resolution. Here we present a new approach for bandpass-filtered imaging in real or reciprocal space using an electrostatic dodecapole with an asymmetric electrode array. In addition to energy-dispersive beam deflection, this multipole allows aberration correction up to the 3rd order. Here we describe its use as a bandpass prefilter in a time-of-flight momentum microscope at the hard X-ray beamline P22 of PETRA III. The entire instrument is housed in a straight vacuum tube because the deflection angle is only 4° and the beam displacement in the filter is only 8 mm. The multipole is framed by transfer lenses in the entrance and exit branches. Two sets of 16 different sized entrance and exit apertures on piezomotor driven mounts allow selection of the desired bandpass. For pass energies between 100 and 1400 eV and slit widths between 0.5 and 4 mm the transmitted kinetic energy intervals are between 10 eV and a few hundred eV (FWHM). The filter eliminates all higher or lower energy signals outside the selected bandpass, significantly improving the signal-to-background ratio in the ToF analyzer.",
    "authors": [
      "O. Tkach",
      "S. Babenkov",
      "Y. Lytvynenko",
      "O. Fedchenko",
      "K. Medjanik",
      "D. Vasilyev",
      "H. -J. Elmers",
      "G. Schönhense"
    ],
    "published": "2023-03-31T14:44:15Z",
    "updated": "2026-01-15T09:25:30Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1107/S1600577524003540"
  },
  {
    "arxiv_id": "2601.10139v1",
    "url": "https://arxiv.org/abs/2601.10139v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10139v1.pdf",
    "title": "Effect of hole pitch reduction on electron transport and diffusion: A comparative simulation study of Triple GEM detectors",
    "abstract": "Advances in fabrication techniques and high-performance electronics have facilitated the development of fine-pitch Gas Electron Multipliers (GEMs). Earlier experimental and simulation findings suggest that these reduced-pitch GEMs can outperform the standard configuration in terms of effective gain, collection efficiency, and position resolution. However, a noticeable fraction of avalanche electrons is lost within the GEM systems, resulting in a degradation of charge collection efficiency. Therefore, a comprehensive simulation-based study is essential to provide deeper insights into the extent of degradation and its contributing factors. In this context, we employ ANSYS and Garfield++ to model the Triple GEM detectors with reduced pitch sizes of 90 and 60 $μ$m, and perform a comparative performance analysis with the standard configuration (pitch size: 140 $μ$m). At first, the simulation framework is validated by comparing the results of the standard configuration with available experimental data and previously reported simulation outcomes. Despite the characteristic gain offset, the framework remains physically consistent and reliable in capturing microscopic avalanche dynamics, reproducing the experimental trend. Following validation, we investigate electron losses at the metal electrodes and within the Kapton holes, electron transmission through the transfer and induction regions, electron diffusion on the induction electrode, and the overall collection efficiency. These parameters are analyzed as functions of GEM potential, outer hole diameter, inner hole diameter, Kapton thickness, metal thickness, and gas composition, thereby offering insights for designing efficient GEM detectors.",
    "authors": [
      "Rajiv Gupta",
      "Sunidhi Saxena",
      "Ajay Kumar"
    ],
    "published": "2026-01-15T07:30:08Z",
    "updated": "2026-01-15T07:30:08Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.10039v1",
    "url": "https://arxiv.org/abs/2601.10039v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10039v1.pdf",
    "title": "Effects of parallel magnetic fields on sheaths near biased electrodes in a highly collisional Z-pinch plasma",
    "abstract": "Sheath formation near biased electrodes in magnetic fields parallel to the wall is an understudied topic, especially within the context of Z-pinch fusion experiments. We perform 1X-2V Boltzmann-Poisson simulations of an axial cut at the pinch radius of a Z-pinch plasma between two biased electrodes with a magnetic field parallel to the wall. The collision frequencies are artificially increased to enhance thermalization of the plasma in the smaller simulation domain versus the actual experiment size; this increases the perpendicular mobility and partially de-magnetizes the ions resulting in non-monotonic sheath profiles with the potential increasing away from the wall to a peak before decaying. A classical sheath forms within an electron gyroradius from the wall not due to the natural thermal motion of the electrons, but due to the magnetized electrons gyrating into the wall; therefore, the sheath structure does not significantly change with bias potential or between electrodes. With increasing bias potential, a current is induced perpendicular to the wall due to changes in ion flow, differing from unmagnetized cases where current is induced by changes in electron flow. The magnetic field acts as a high resistivity with the perpendicular current density being three orders of magnitude lower than unmagnetized theoretical predictions. There is, however, significant flow parallel to the wall from the force balance between the pressure tensor and Lorentz force. These parallel flows induce a parallel current density three orders of magnitude larger than the perpendicular current density.",
    "authors": [
      "C. R. Skolar",
      "B. Srinivasan"
    ],
    "published": "2026-01-15T03:34:07Z",
    "updated": "2026-01-15T03:34:07Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.04332v2",
    "url": "https://arxiv.org/abs/2509.04332v2",
    "pdf_url": "https://arxiv.org/pdf/2509.04332v2.pdf",
    "title": "Detection of ultracold neutrons with powdered scintillator screens",
    "abstract": "Zinc sulfide (ZnS:Ag) scintillators coated with a thin 10B layer are widely used for ultracold neutron (UCN) detection, but their application is limited by long decay times and significant phosphorescence. We investigated two possible replacement scintillators: yttrium aluminum perovskite (YAP:Ce) and lutetium ttrium orthosilicate (LYSO:Ce). Both exhibit decay times on the order of 30-40 ns, which can help reduce dead time in high-count-rate experiments. YAP:Ce showed approximately 60% lower phosphorescence than ZnS:Ag after 2 days and detected about 20% more UCN. In contrast, LYSO:Ce exhibited higher phosphorescence and produced fewer UCN counts compared to both ZnS:Ag and YAP:Ce. While both tested scintillators are capable UCN detectors, YAP:Ce consistently outperformed LYSO:Ce across all measured performance metrics.",
    "authors": [
      "M. Krivos",
      "N. C. Floyd",
      "C. L. Morris",
      "Z. Tang",
      "M. Blatnik",
      "S. M. Clayton",
      "C. B. Cude-Woods",
      "A. Fratangelo",
      "A. T. Holley",
      "D. E. Hooks",
      "T. M. Ito",
      "C. -Y. Liu",
      "M. Makela",
      "M. R. Martinez",
      "A. S. C. Navazo",
      "C.",
      "M. O'Shaughnessy",
      "R. W. Pattie",
      "E. L. Renner",
      "T. A. Sandborn",
      "T. J. Schaub",
      "M. Singh",
      "I. L. Smythe",
      "F. W. Uhrich",
      "N. K. Washecheck",
      "Z. Wang",
      "A. R. Young"
    ],
    "published": "2025-09-04T15:51:09Z",
    "updated": "2026-01-15T01:35:43Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.09963v1",
    "url": "https://arxiv.org/abs/2601.09963v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09963v1.pdf",
    "title": "Near-Unity-Efficiency Gas Gratings for Ultraviolet, Visible, and Infrared High-Power Lasers",
    "abstract": "Interfering deep ultraviolet (DUV) lasers can induce substantial density modulations in an ozone-doped gas flow via photochemical reactions, creating volume diffraction gratings. These transient optics are immune to target debris and shrapnel and feature orders-of-magnitude higher damage thresholds than conventional solid optics, providing a promising method for efficiently manipulating high-energy lasers. In this work, we describe gas gratings that can efficiently diffract probe beams across a variety of wavelengths and pulse durations, ranging from deep ultraviolet to near-infrared and from nanosecond to femtosecond, achieving a full beam diffraction efficiency up to 99% while preserving the focusability and wavefront quality. In addition, we present a comprehensive characterization of the performance of the gas gratings under various experimental conditions, including imprint fluence, gas composition, and grating geometries, showing significant enhancement of this process with the addition of carbon dioxide. We also demonstrate stable performance over hours of operation. Our results validate a previously developed theoretical model and suggest optimal parameters to efficiently scale gas gratings to high-energy applications.",
    "authors": [
      "Ke Ou",
      "Harsha Rajesh",
      "Sida Cao",
      "Debolina Chakraborty",
      "Victor M. Perez-Ramirez",
      "Devdigvijay Singh",
      "Caleb Redshaw",
      "Pelin Dedeler",
      "Albertine Oudin",
      "Eugene Kur",
      "Michelle M. Wang",
      "Julia M. Mikhailova",
      "Livia Lancia",
      "Caterina Riconda",
      "Pierre Michel",
      "Matthew R. Edwards"
    ],
    "published": "2026-01-15T00:56:13Z",
    "updated": "2026-01-15T00:56:13Z",
    "categories": [
      "physics.optics",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2511.05643v2",
    "url": "https://arxiv.org/abs/2511.05643v2",
    "pdf_url": "https://arxiv.org/pdf/2511.05643v2.pdf",
    "title": "Transmission Efficiency of the Recoil Mass Spectrometer EMMA at TRIUMF",
    "abstract": "The mean transmission efficiency of the EMMA recoil mass spectrometer at TRIUMF has been measured with 6 different angular apertures at 17 kinetic energy/charge deviations with respect to the central, reference trajectory. Measurements performed using a 148Gd alpha source installed at the target position of the spectrometer are compared to ion-optical calculations and Monte Carlo simulations. The transmission efficiency as a function of angle and kinetic energy/charge is described empirically using piecewise Gaussian functions whose parameters are fit to the data.",
    "authors": [
      "B. Davids",
      "N. E. Esker",
      "J. Jaeyoung",
      "Y. K. Kim",
      "K. Pak",
      "M. Williams"
    ],
    "published": "2025-11-07T18:39:08Z",
    "updated": "2026-01-15T00:19:38Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.09906v1",
    "url": "https://arxiv.org/abs/2601.09906v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09906v1.pdf",
    "title": "A feasibility study for a Doppler Reflectometer System in the JT-60SA tokamak",
    "abstract": "In this work we present a study on the viability and practicality of installing a Doppler reflectometer (DR) system in the JT-60SA advanced tokamak. First, we discuss its scientific scope in the context of the JT-60SA research plan. We identify a number of fields in which a DR would be very relevant for the accomplishment of said plan and outline a scientific program for the diagnostic. Then, starting from a number of design hypothesis, we use a ray tracing code to carry out a feasibility study for a number of relevant scenarios and identify a geometric solution for the installation of a DR such that both core and edge can be probed in the prescribed wave number range, thus achieving the proposed scientific objectives. Finally, we perform a preliminary discussion on the different possibilities for a conceptual design (including a minimum viable system and a baseline system) and their requirements in terms of components and space. We conclude that a viable conceptual design could be carried out using a small fraction of a horizontal port, leaving room for additional diagnostic systems.",
    "authors": [
      "D. Carralero",
      "T. Happel",
      "T. Estrada",
      "T. Tokuzawa",
      "J. Martínez",
      "E. de la Luna",
      "A. Cappa",
      "J. García"
    ],
    "published": "2026-01-14T22:29:05Z",
    "updated": "2026-01-14T22:29:05Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1016/j.fusengdes.2021.112803."
  },
  {
    "arxiv_id": "2507.09106v2",
    "url": "https://arxiv.org/abs/2507.09106v2",
    "pdf_url": "https://arxiv.org/pdf/2507.09106v2.pdf",
    "title": "CycleGAN-Driven Transfer Learning for Electronics Response Emulation in High-Purity Germanium Detectors",
    "abstract": "High-Purity Germanium (HPGe) detectors are a key technology for rare-event searches such as neutrinoless double-beta decay (\\ensuremath{0νββ}) and dark matter experiments. Pulse shapes from these detectors vary with interaction topology and thus encode information critical for event classification. Pulse shape simulations (PSS) are essential for modeling analysis cuts that distinguish signal events from backgrounds and for generating reliable simulations of energy spectra. Traditional PSS methods rely on a series of first-principles corrections to replicate the effect of readout electronics, requiring challenging fits over large parameter spaces and often failing to accurately model the data. We present a neural network architecture, the Cyclic Positional U-Net (https://github.com/aobol/CPU-Net), that performs translations of simulated pulses so that they closely resemble measured detector signals. Using a Cycle Generative Adversarial Network (CycleGAN) framework, this {Response Emulation Network} (REN) learns a data-driven mapping between simulated and measured pulses with high fidelity, without requiring a predetermined response model. We use data from a High-Purity Germanium (HPGe) detector with an inverted-coaxial point contact (ICPC) geometry to show that \\texttt{CPU-Net} effectively captures and reproduces critical pulse shape features, allowing more realistic simulations without detector-specific tuning. \\texttt{CPU-Net} achieves up to a factor-of-four improvement in distribution-level agreement for pulse shape parameter reconstruction, while preserving the topology-dependent information required for pulse-shape discrimination.",
    "authors": [
      "Kevin Bhimani",
      "Julieta Gruszko",
      "Morgan Clark",
      "John Wilkerson",
      "Aobo Li"
    ],
    "published": "2025-07-12T01:36:59Z",
    "updated": "2026-01-14T21:00:17Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/2632-2153/ae3052"
  },
  {
    "arxiv_id": "2510.00493v2",
    "url": "https://arxiv.org/abs/2510.00493v2",
    "pdf_url": "https://arxiv.org/pdf/2510.00493v2.pdf",
    "title": "Correlation function metrology for warm dense matter: Recent developments and practical guidelines",
    "abstract": "X-ray Thomson scattering (XRTS) has emerged as a valuable diagnostic for matter under extreme conditions, as it captures the intricate many-body physics of the probed sample. Recent advances, such as the model-free temperature diagnostic of Dornheim et al. [Nat.Commun. 13, 7911 (2022)], have demonstrated how much information can be extracted directly within the imaginary-time formalism. However, since the imaginary-time formalism is a concept often difficult to grasp, we provide here a systematic overview of its theoretical foundations and explicitly demonstrate its practical applications to temperature inference, including relevant subtleties. Furthermore, we present recent developments that enable the determination of the absolute normalization, Rayleigh weight, and density from XRTS measurements without reliance on uncontrolled model assumptions. Finally, we outline a unified workflow that guides the extraction of these key observables, offering a practical framework for applying the method to interpret experimental measurements.",
    "authors": [
      "Maximilian Peter Böhme",
      "Willow Martin",
      "Hannah Bellenbaum",
      "Margaret Berrens",
      "Jan Vorberger",
      "Sebastian Schwalbe",
      "Zhandos Moldabekov",
      "Thomas Gawne",
      "Sebastien Hamel",
      "Brianna Aguilar-Solis",
      "Abhiraj Sharma",
      "Frank Graziani",
      "Tilo Döppner",
      "Siegfried Glenzer",
      "Tobias Dornheim",
      "David Bishel"
    ],
    "published": "2025-10-01T04:22:31Z",
    "updated": "2026-01-14T19:30:23Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.09675v1",
    "url": "https://arxiv.org/abs/2601.09675v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09675v1.pdf",
    "title": "Radiation tolerance tests on key components of the ePIC-dRICH readout card",
    "abstract": "The dual-radiator RICH detector of the ePIC experiment will employ over 300000 SiPM pixels as photosensors, organized into more than 1000 Photon Detection Units. Each PDU is a compact module, approximately 5x5x12 cm^3 in size, including four custom ASICs connected to 256 SiPMs and an FPGA-based readout card (RDO) responsible for data acquisition and control. Considering the moderately harsh radiation environment expected in the dRICH detector, this study reports on proton irradiation tests performed on key components of the RDO card to assess their tolerance to cumulative Total Ionizing Dose (TID) and Single Event Effects (SEE). All tested components demonstrated radiation tolerance beyond the TID levels expected for the dRICH environment, with the exception of the ATtiny417 microcontroller, which showed destructive failure. Furthermore, as expected, the observed Single Event Upset (SEU) rates call for appropriate mitigation strategies in the final system design.",
    "authors": [
      "S. Geminiani",
      "B. R. Achari",
      "N. Agrawal",
      "M. Alexeev",
      "C. Alice",
      "R. Ammendola",
      "P. Antonioli",
      "C. Baldanza",
      "L. Barion",
      "A. Biagioni",
      "A. Calivà",
      "M. Capua",
      "F. Capuani",
      "A. Ciardiello",
      "E. Cisbani",
      "M. Chiosso",
      "M. Contalbrigo",
      "F. Cossio",
      "M. Da Rocha Rolo",
      "A. De Caro",
      "D. De Gruttola",
      "G. Dellacasa",
      "D. Falchieri",
      "S. Fazio",
      "O. Frezza",
      "N. Funicello",
      "M. Garbini",
      "N. Jacazio",
      "F. Lo Cicero",
      "A. Lonardo",
      "R. Malaguti",
      "F. Mammoliti",
      "M. Martinelli",
      "M. Mignone",
      "C. Mingioni",
      "M. Nenni",
      "F. Noto",
      "L. Occhiuto",
      "A. Paladino",
      "D. Panzieri",
      "P. Perticaroli",
      "S. Plavully",
      "L. Polizzi",
      "L. Pontisso",
      "R. Preghenella",
      "R. Ricci",
      "L. Rignanese",
      "C. Ripoli",
      "C. Rossi",
      "E. Rovati",
      "N. Rubini",
      "M. Ruspa",
      "A. Saputi",
      "F. Simula",
      "F. Spizzo",
      "U. Tamponi",
      "E. Tassi",
      "G. Torromeo",
      "C. Tuvè",
      "G. M. Urciuoli",
      "S. Vallarino",
      "P. Vicini",
      "R. Wheadon"
    ],
    "published": "2026-01-14T18:18:23Z",
    "updated": "2026-01-14T18:18:23Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.16408v2",
    "url": "https://arxiv.org/abs/2511.16408v2",
    "pdf_url": "https://arxiv.org/pdf/2511.16408v2.pdf",
    "title": "Development & Characterization of Electrodes for large-scale Xenon Time Projection Chambers",
    "abstract": "Dual-phase liquid xenon time projection chambers are the core detector elements of many experiments that conduct searches for Dark Matter and rare events, as well as in neutrino and high-energy physics. As part of this detector technology, high-voltage electrodes are instrumental for the generation of observable signals and their physical interpretation. Thus, electrode design and manufacturing has to fulfill stringent requirements, and their production is associated with significant engineering challenges. In this work we describe the successful development of electrodes on the 1.5 m-scale, from their design and simulation to subsequent assembly and high-voltage testing in a gaseous argon environment. The produced electrodes were recently installed as an anode and a cathode during an upgrade to the XENONnT experiment.",
    "authors": [
      "A. Elykov",
      "S. Vetter",
      "V. H. S. Wu",
      "A. Deisting",
      "K. Eitel",
      "R. Gumbsheimer",
      "M. Kara",
      "S. Lichter",
      "S. Lindemann",
      "T. Luce",
      "Y. Ma",
      "J. Müller",
      "K. Müller",
      "K. Ni",
      "U. Oberlack",
      "M. Schumann",
      "P. Shagin",
      "K. Valerius",
      "M. Zhong"
    ],
    "published": "2025-11-20T14:29:16Z",
    "updated": "2026-01-14T18:13:53Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.07848v2",
    "url": "https://arxiv.org/abs/2601.07848v2",
    "pdf_url": "https://arxiv.org/pdf/2601.07848v2.pdf",
    "title": "Cyclotron Radiation Signal Characterization in Resonant Cavities for the Project 8 Neutrino Mass Experiment",
    "abstract": "Many experimental methods in physics require understanding radiation from single particles into non-trivial electromagnetic mode structures. Such characterization is critical for Cyclotron Radiation Emission Spectroscopy (CRES), an advancing new measurement technique that has the potential to greatly benefit fundamental physics measurements. In CRES, charged particles emit cyclotron radiation at frequencies that provide their energy measurement. As a notable example, the Project 8 experiment aims to kinematically infer the neutrino mass by measuring the energies of electrons emitted in tritium beta decay using CRES. In near-term realizations of Project 8, resonant cylindrical cavities will be used for CRES readout, in a configuration with a magnetic field oriented along the symmetry axis, and electrons following helical cyclotron trajectories confined to the cavity interior. The physics of electromagnetic radiation in these environments is complicated, since it involves both the motion of the emitting particle and the mode structure imposed by the cavity. In this work, we derive and validate an analytic model for how an oscillating, trapped electron radiates into cavity modes, and the power and frequency content of the radiation that can be read out from these events. These results can be used to guide the design of cavities for future CRES and other experiments.",
    "authors": [
      "A. Ashtari Esfahani",
      "S. Bhagvati",
      "H. P. Binney",
      "S. Böser",
      "M. J. Brandsema",
      "N. Buzinsky",
      "R. Cabral",
      "M. C. Carmona-Benitez",
      "C. Claessens",
      "L. de Viveiros",
      "A. El Boustani",
      "M. G. Elliott",
      "S. Enomoto",
      "M. Fertl",
      "J. A. Formaggio",
      "B. T. Foust",
      "J. K. Gaison",
      "P. Harmston",
      "K. M. Heeger",
      "B. J. P. Jones",
      "E. Karim",
      "K. Kazkaz",
      "P. T. Kolbeck",
      "A. Kurmus",
      "M. Li",
      "A. Lindman",
      "C. -Y. Liu",
      "T. Luo",
      "C. Matthé",
      "R. Mohiuddin",
      "B. Monreal",
      "B. Mucogllava",
      "R. Mueller",
      "A. Negi",
      "J. A. Nikkel",
      "E. Novitski",
      "N. S. Oblath",
      "M. Oueslati",
      "J. I. Peña",
      "W. Pettus",
      "A. W. P. Poon",
      "V. S. Ranatunga",
      "R. Reimann",
      "A. L. Reine",
      "R. G. H. Robertson",
      "G. Rybka",
      "L. Saldaña",
      "V. Sharma",
      "P. L. Slocum",
      "F. Spanier",
      "J. Stachurska",
      "Y. -H. Sun",
      "P. T. Surukuchi",
      "A. B. Telles",
      "F. Thomas",
      "L. A. Thorne",
      "T. Thümmler",
      "M. Turqueti",
      "W. Van De Pontseele",
      "B. A. VanDevender",
      "T. E. Weiss",
      "M. Wynne",
      "A. Ziegler"
    ],
    "published": "2026-01-07T21:31:03Z",
    "updated": "2026-01-14T18:13:15Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.11725v2",
    "url": "https://arxiv.org/abs/2510.11725v2",
    "pdf_url": "https://arxiv.org/pdf/2510.11725v2.pdf",
    "title": "Towards High-Efficiency Particle Detection Using Superconducting Microwire Arrays",
    "abstract": "We present a detailed study of an 8-channel $1\\times1$ mm$^{2}$ WSi superconducting microwire single photon detector (SMSPD) array exposed to 120 GeV hadron beam and 120 GeV muon beam at the CERN Super Proton Synchrotron H6 beamline. Following up on our first detailed characterization of the efficiency and response of an SMSPD fabricated on a 3 nm WSi film, we report measurements of enhanced particle detection efficiency using a sensor fabricated from a thicker 4.7nm-thick WSi film. We also report the first SMSPD detection efficiency measurement made for muons. Measurements are enabled by a silicon tracking telescope providing 10 $μ$m in-situ spatial resolution. The results show a fill factor-normalized detection efficiency of 75% and a time resolution of about 130 ps across pixels. These findings represent a significant advancement toward developing high-efficiency SMSPD charged particle tracking systems with simultaneous precision timing, with potential applications in future accelerator-based experiments such as the FCC-ee and Muon Collider.",
    "authors": [
      "Christina Wang",
      "Cristián Peña",
      "Adolf Bornheim",
      "Shuoxing Wu",
      "Alexander Albert",
      "Thomas Sievert",
      "Artur Apresyan",
      "Emanuel Knehr",
      "Boris Korzh",
      "Jamie Luskin",
      "Ludovico Mori",
      "Sahil Patel",
      "Guillermo Reales Gutiérrez",
      "Manish Sahu",
      "Ekkehart Schmidt",
      "Matthew Shaw",
      "Elise Sledge",
      "Maria Spiropulu",
      "Towsif Taher",
      "Si Xie"
    ],
    "published": "2025-10-08T13:01:48Z",
    "updated": "2026-01-14T17:05:59Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/12/P12033"
  },
  {
    "arxiv_id": "2507.13864v2",
    "url": "https://arxiv.org/abs/2507.13864v2",
    "pdf_url": "https://arxiv.org/pdf/2507.13864v2.pdf",
    "title": "Muon tracking in a LiquidO opaque scintillator detector",
    "abstract": "LiquidO is an innovative radiation detector concept. The core idea is to exploit stochastic light confinement in a highly scattering medium to self-segment the detector volume. In this paper, we demonstrate event-by-event muon tracking in a LiquidO opaque scintillator detector prototype. The detector consists of a 30 mm cubic scintillator volume instrumented with 64 wavelength-shifting fibres arranged in an 8$\\times$8 grid with a 3.2 mm pitch and read out by silicon photomultipliers. A wax-based opaque scintillator with a scattering length of approximately 0.5 mm is used. The tracking performance of this LiquidO detector is characterised with cosmic-ray muons and the position resolution is demonstrated to be 450 $μ$m per row of fibres. These results highlight the potential of LiquidO opaque scintillator detectors to achieve fine spatial resolution, enabling precise particle tracking and imaging.",
    "authors": [
      "LiquidO Collaboration",
      "J. Apilluelo",
      "L. Asquith",
      "E. F. Bannister",
      "N. P. Barradas",
      "C. L. Baylis",
      "J. L. Beney",
      "M. Berberan e Santos",
      "X. de la Bernardie",
      "T. J. C. Bezerra",
      "M. Bongrand",
      "C. Bourgeois",
      "D. Breton",
      "J. Busto",
      "A. Cabrera",
      "A. Cadiou",
      "E. Calvo",
      "M. de Carlos Generowicz",
      "E. Chauveau",
      "B. J. Cattermole",
      "M. Chen",
      "P. Chimenti",
      "D. F. Cowen",
      "S. Kr. Das",
      "S. Dusini",
      "A. Earle",
      "M. Felizardo",
      "C. Frigerio Martins",
      "J. Galán",
      "J. A. García",
      "A. Gibson-Foster",
      "C. Girard-Carillo",
      "W. C. Griffith",
      "J. J. Gómez-Cadenas",
      "M. Guitière",
      "F. Haddad",
      "J. Hartnell",
      "A. Holin",
      "I. G. Irastorza",
      "I. Jovanovic",
      "A. Kling",
      "L. Koch",
      "P. Lasorak",
      "J. F. Le Du",
      "F. Lefevre",
      "P. Loaiza",
      "J. A. Lock",
      "G. Luzón",
      "J. Maalmi",
      "J. P. Malhado",
      "F. Mantovani",
      "J. G. Marques",
      "C. Marquet",
      "M. Martínez",
      "J. T. Moffat",
      "D. Navas-Nicolás",
      "H. Nunokawa",
      "J. P. Ochoa-Ricoux",
      "T. Palmeira",
      "C. Palomares",
      "D. Petyt",
      "P. Pillot",
      "A. Pin",
      "J. C. C. Porter",
      "M. S. Pravikoff",
      "S. Richards",
      "N. Rodrigues",
      "M. Roche",
      "R. Rosero",
      "B. Roskovec",
      "M. L. Sarsa",
      "S. Schoppmann",
      "A. Serafini",
      "C. Shepherd-Themistocleous",
      "W. Shorrock",
      "M. Silva",
      "L. Simard",
      "S. R. Soleti",
      "D. Stocco",
      "V. Strati",
      "J. S. Stutzmann",
      "F. Suekane",
      "N. Tuccori",
      "A. Verdugo",
      "B. Viaud",
      "S. M. Wakely",
      "A. Weber",
      "G. Wendel",
      "A. S. Wilhelm",
      "A. W. R. Wong",
      "M. Yeh",
      "F. Yermia"
    ],
    "published": "2025-07-18T12:39:06Z",
    "updated": "2026-01-14T17:05:09Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/21/01/P01010"
  }
]