{
  "arxiv_id": "2302.09758v4",
  "url": "https://arxiv.org/abs/2302.09758v4",
  "pdf_url": "https://arxiv.org/pdf/2302.09758v4.pdf",
  "title": "Energy recovery twin linear $e^+e^-$, $e^-e^-$ colliders (ERLC ) with high luminosities and accelerating gradients",
  "abstract": "Recently, the $e^+e^-$ high-energy superconducting linear collider with energy recovery (ERLC) and multiple use of beams has been proposed, using twin RF structures to avoid parasitic collisions in linacs. Such a collider can operate in either pulsed (with duty factor DF) or CW (continuous) mode, if sufficient power is available, with a luminosity of ${\\cal O}(10^{36})$ cm$^{-2}$s$^{-1}$ at $2E_0=$250-500 GeV. In this paper, we point out that the luminosity of the ERLC operating in the pulsed mode does not depend on the accelerating gradient G (for the same total power), allowing the ERLC to operate with the highest available accelerating gradients. This is also true for the CW mode at a power significantly exceeding the threshold power for this mode. The $e^+e^-$ luminosity depends on the quality factor of cavities as $L\\propto Q_0^{1/2}$. We also consider for the first time a twin $e^-e^-$ collider with energy recovery and estimate its achievable luminosity. Such an $e^-e^-$ collider is simpler than an $e^+e^-$ one. It does not require beam recycling since electrons can be produced anew each time. The $e^-e^-$ luminosity depends on the quality factor as $L\\propto Q_0^{1/4}$. RF travelling-wave structures allow higher gradients and reduced thermal loading. It is shown that an ERLC with an accelerating gradient of $G=40$ MeV/m can be operated in CW mode with $L_{e^+e^-} =$ (1-2.5)\\,$10^{36}$ and $L_{e^-e^-} =$ (3-7)$10^{36}$ cm$^{-2}$s$^{-1}$ for reasonable total powers of 150 and 300 MW at $2E_0=250$ and 500 GeV, respectively. Such a machine is a promising candidate for a Higgs factory.",
  "authors": [
    "V. I. Telnov"
  ],
  "published": "2023-02-20T04:49:53Z",
  "updated": "2025-12-01T16:27:05Z",
  "categories": [
    "physics.acc-ph",
    "hep-ex",
    "hep-ph"
  ],
  "primary_category": "physics.acc-ph"
}