{
  "arxiv_id": "2503.03692v2",
  "url": "https://arxiv.org/abs/2503.03692v2",
  "pdf_url": "https://arxiv.org/pdf/2503.03692v2.pdf",
  "title": "Capturing methane in a barn environment: the CH4 Livestock Emission (CH4rLiE) project",
  "abstract": "The CH4 Livestock Emission (CH4rLiE) project explores the development of a prototype system for capturing methane emissions in barn environments, offering an alternative approach to mitigating greenhouse gas emissions from livestock farming. Methane (CH4), with a global warming potential significantly higher than CO2 (GWP100 = 27), accounts for ~23% of anthropogenic climate impact. In 2021, The Assessment Report 6 of Intergovernmental Panel on Climate Change quantified CH4 livestock emissions in 123 Mt/yr, which, together with substantial N2O and CO2 emissions, contributed with a 12% to global emissions. Unlike strategies focused on altering animal feed, CH4rLiE investigates post-emission capture using porous materials, such as zeolites, to adsorb methane from barn air. The project draws on CERN's experience with gas recovery systems for particle detectors, adapting similar technologies to agricultural settings. Preliminary estimates, based on measured CH4 concentrations (~20 mg/m3) and partial air filtration in a 250-animal barn, suggest a low but detectable recovery potential, subject to validation through simulation and in-situ testing. Prototype development considers the potential for energy-efficient operation - possibly through pressure swing regeneration - and compatibility with existing ventilation infrastructure, though these aspects remain under evaluation. If methane concentrations in barns prove too diluted, the system may be better suited for environments with higher gas levels, such as pigsties or landfills. NH3 capture for fertilizer production is planned as a future enhancement. CH4rLiE aims to assess the feasibility of emission recovery in livestock settings without affecting animal welfare, contributing to sustainable farming practices, resource efficiency, and circular bioeconomy goals.",
  "authors": [
    "Francesco Alessandro Angiulli",
    "Chiara Aimè",
    "Maria Cristina Arena",
    "Davide Biagini",
    "Alessandro Braghieri",
    "Matteo Brunoldi",
    "Simone Calzaferri",
    "Elio Dinuccio",
    "Daniele Dondi",
    "Linda Finco",
    "Roberto Guida",
    "Nithish Kumar Kameswaran",
    "Beatrice Mandelli",
    "Paolo Montagna",
    "Cristina Riccardi",
    "Paola Salvini",
    "Alessandro Tamigio",
    "Ilaria Vai",
    "Dhanalakshmi Vadivel",
    "Riccardo Verna",
    "Paolo Vitulo"
  ],
  "published": "2025-03-05T17:38:36Z",
  "updated": "2025-12-01T09:22:52Z",
  "categories": [
    "physics.ins-det",
    "physics.ao-ph"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.1016/j.nexus.2025.100604"
}