{
  "arxiv_id": "2510.16000v2",
  "url": "https://arxiv.org/abs/2510.16000v2",
  "pdf_url": "https://arxiv.org/pdf/2510.16000v2.pdf",
  "title": "Frequency domain laser ultrasound microscopy for nanometric layer thickness imaging with GHz elastic plate resonances",
  "abstract": "Nanometric layer thickness imaging is crucial for fundamental research and characterization of micro fabricated devices. Here, we assess the potential of a non-contact opto-acoustic frequency domain laser ultrasound (FreDomLUS) microscopy technique for imaging nanometric thickness variations via GHz zero-group velocity (ZGV) elastic plate resonances. The method exploits the ZGV's lateral energy confinement that leads to sharp resonance peaks which can be effectively probed with the FreDomLUS technique at GHz acoustic frequencies. For demonstration purposes we introduced sub-10 nm height variation patterns in the topmost layer of solidly mounted bulk-acoustic wave resonators with a design frequency of around 1.7 GHz. They are raster-scanned to retrieve ZGV-frequencies from local acoustic spectra as a contrast quantity for imaging. We show how to retrieve quantitative height information by numerically calibrating the factor which inversely relates ZGV frequency change with the layer thickness change. Height variations in stacks with nominal thickness changes of 8 nm, 4 nm, and 1 nm can be resolved and indicate sub-nanometer depth resolution capabilities. The lateral resolution is studied by measuring the method's step edge function and it is found to be in the micrometer range. Atomic force microscopy imaging is used to validate the results.",
  "authors": [
    "Martin Ryzy",
    "Guqi Yan",
    "István Veres",
    "Thomas Berer",
    "Ivan Alić",
    "Clemens Grünsteidl",
    "Georg Watzl",
    "Georg Gramse",
    "Susanne Kreuzer"
  ],
  "published": "2025-10-14T09:32:36Z",
  "updated": "2025-12-01T16:16:34Z",
  "categories": [
    "physics.ins-det",
    "cond-mat.mtrl-sci",
    "physics.app-ph",
    "physics.class-ph",
    "physics.optics"
  ],
  "primary_category": "physics.ins-det"
}