{
  "arxiv_id": "2512.01757v1",
  "url": "https://arxiv.org/abs/2512.01757v1",
  "pdf_url": "https://arxiv.org/pdf/2512.01757v1.pdf",
  "title": "Evolution of ion distribution functions in ionospheric plasmas perturbed by Alfvén waves",
  "abstract": "This study investigates ion kinetic effects during the parametric decay instability (PDI) of parallel-propagating Alfvén waves under plasma conditions characteristic of the Earth's ionosphere. By using a series of hybrid particle-in-cell simulations, we examine the evolution of ion velocity distribution functions (VDFs) in ultra-low-beta plasmas. Our numerical campaign systematically explores the dependence on key parameters (plasma beta, pump-wave amplitude and polarization, and ion composition). To emphasize the role of kinetic effects, we choose to trigger the PDI with a dispersive mother wave with wavelength comparable to the ion characteristic inertial length. Our results reveal pronounced nonthermal VDF modifications, including parallel heating and the formation of secondary ion beams, linked to the nonlinear evolution of parametric decay instability. By varying the plasma beta and the pump-wave amplitude, we identify a critical regime where rapid and complete broadening of the velocity distribution function is observed, triggering bidirectional ion acceleration. Notably, simulations modeling realistic ionospheric conditions demonstrate that even low-amplitude Alfvénic perturbations can induce significant VDF spreading and ion beam generation, with hydrogen ions exhibiting stronger effects than oxygen. These nonthermal microscopic processes offer a plausible mechanism for particle precipitation in space weather events. This work represents the first comprehensive study with hybrid simulations of PDI-driven ion kinetics in ultra-low-beta plasmas, providing quantitative estimates for the time delay between electromagnetic wave impact and ion VDF modification and new insights into wave-particle interactions that may contribute to ion acceleration, precipitation processes and space plasma dynamics.",
  "authors": [
    "Dario Recchiuti",
    "Luca Franci",
    "Lorenzo Matteini",
    "Emanuele Papini",
    "Roberto Battiston",
    "Mirko Piersanti"
  ],
  "published": "2025-12-01T15:03:06Z",
  "updated": "2025-12-01T15:03:06Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}