{
  "arxiv_id": "2512.00530v1",
  "url": "https://arxiv.org/abs/2512.00530v1",
  "pdf_url": "https://arxiv.org/pdf/2512.00530v1.pdf",
  "title": "Edge-localized-mode heat load effects on plasma-facing materials studied using runaway electrons in the Damavand tokamak",
  "abstract": "Edge localized modes (ELMs) and runaway electrons (REs) pose significant challenges for all Tokamak devices and act as potent heat sources, potentially shortening the lifespan of plasma-facing materials (PFMs). These thermal loads can manifest in various detrimental effects, including melting, sputtering, cracking, blistering, and other forms of material degradation. While the ELMs are an intrinsic feature of H-mode operation in Tokamaks, runaway electrons pose a potential threat across all Tokamak device scales.In devices such as ITER, even with mitigation strategies, the ELMs can still impose considerable heat loads on the PFMs, reaching levels of approximately 1 MJ/m2. Various methods exist to experimentally simulate the heat load effects of ELMs on PFMs. In this study, the thermal loads from REs in small-scale Tokamaks are considered for this purpose.The presence of small-scale Tokamaks, exemplified by the Damavand experiment, facilitates the investigation of RE energy deposition. Analysis of the experimental data indicates that the REs populations generated by plasma instabilities within the Damavand Tokamak discharges exhibit heat densities on the order of MJ/m2 to 1 cm2 area PFMs. Furthermore, considering an average REs energy of 1 MeV and the prevailing discharge current, calculations indicate that the average total energy of the REs population per discharge is approximately 1 kJ, which is subsequently deposited on the Tokamak limiter. Considering the limiter's surface area and assuming that only 40% of the REs energy is transferred to it, the calculated heat load density reaches the order of MJ/m2, comparable to that observed during the ELMs events in large-scale fusion devices. This correspondence enables the Damavand Tokamak to investigate thermal loas effects of ELMs on PFMs in large-scale Tokamaks.",
  "authors": [
    "Ali Masoudi",
    "Davoud Iraji",
    "Chapar Rasouli"
  ],
  "published": "2025-11-29T15:48:18Z",
  "updated": "2025-11-29T15:48:18Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": "10.1103/5dbg-yyw3"
}