{
  "arxiv_id": "2512.01619v1",
  "url": "https://arxiv.org/abs/2512.01619v1",
  "pdf_url": "https://arxiv.org/pdf/2512.01619v1.pdf",
  "title": "An Open-Path Eddy-Covariance Laser Spectrometer for Simultaneous Monitoring of CO$_2$, CH$_4$, and H$_2$O",
  "abstract": "We present E-CAHORS $-$ a compact mid-infrared open-path diode-laser spectrometer designed for the simultaneous measurement of carbon dioxide, methane, and water vapor concentrations in the near-surface atmospheric layer. These measurements, combined with simultaneous data from a three-dimensional anemometer, can be used to determine fluxes using the eddy-covariance method. The instrument utilizes two interband cascade lasers operating at 2.78 $μ$m and 3.24 $μ$m within a novel four-pass M-shaped optical cell, which provides high signal power and long-term field operation without requiring active air sampling. Two detection techniques $-$ tunable diode laser absorption spectroscopy (TDLAS) and a simplified wavelength modulation spectroscopy (sWMS) $-$ were implemented and evaluated. Laboratory calibration demonstrated linear responses for all gases (R$^2$ $\\approx$ 0.999) and detection precisions at 10 Hz of 311 ppb for CO$_2$, 8.87 ppb for CH$_4$, and 788 ppb for H$_2$O. Field tests conducted at a grassland site near Moscow showed strong correlations (R = 0.91 for CO$_2$ and H$_2$O, R = 0.67 for CH$_4$) with commercial LI-COR LI-7200 and LI-7700 analyzers. The TDLAS mode demonstrated lower noise and greater stability under outdoor conditions, while sWMS provided baseline-free spectra but was more sensitive to power fluctuations. E-CAHORS combines high precision, multi-species sensing capability with low power consumption (10 W) and a compact design (4.2 kg).",
  "authors": [
    "Viacheslav Meshcherinov",
    "Iskander Gazizov",
    "Bogdan Pravuk",
    "Viktor Kazakov",
    "Sergei Zenevich",
    "Maxim Spiridonov",
    "Shamil Gazizov",
    "Gennady Suvorov",
    "Olga Kuricheva",
    "Yuri Lebedev",
    "Imant Vinogradov",
    "Alexander Rodin"
  ],
  "published": "2025-12-01T12:40:36Z",
  "updated": "2025-12-01T12:40:36Z",
  "categories": [
    "physics.ins-det",
    "physics.app-ph"
  ],
  "primary_category": "physics.ins-det"
}