{
  "arxiv_id": "2512.01125v1",
  "url": "https://arxiv.org/abs/2512.01125v1",
  "pdf_url": "https://arxiv.org/pdf/2512.01125v1.pdf",
  "title": "Quantum magnetic imaging of current density in lithium-ion batteries",
  "abstract": "The projected rapid growth of battery cell production over the next decade demands advanced diagnostic tools for quality control, ageing prediction, and recycling. Most existing techniques lack the spatial and temporal resolution required to capture internal electrochemical processes non-invasively. Here, we present magnetic imaging of current densities in battery cells, a sensitive quantum-magnetometry method that uses optically pumped magnetometers (OPMs) to perform real-time imaging of internal dynamics in open-circuit configuration. We demonstrate this approach for monitoring relaxation processes in 6000 mA h lithium-ion cells following pulsed discharges across a range of pulse durations and currents as well as states of charge. The measurement results are benchmarked against superconducting-quantum-interference-device (SQUID) magnetometry and validated with three-dimensional finite element simulations. Equivalent circuit models are employed to interpret the relaxation profiles, revealing spatially resolved features and transient magnetic-field signatures that are inaccessible with complementary non-invasive techniques such as electrochemical impedance spectroscopy (EIS). This work establishes OPM-based magnetic imaging of battery current density as a powerful diagnostic tool with potential impact on cell development, manufacturing quality assurance, and second-life assessment.",
  "authors": [
    "W. Evans",
    "T. Coussens",
    "M. T. M. Woodley",
    "A. M. Fabricant",
    "G. D. Kendall",
    "M. Sonnet",
    "D. Wasylowski",
    "D. U. Sauer",
    "F. Oručević",
    "P. Krüger"
  ],
  "published": "2025-11-30T22:32:34Z",
  "updated": "2025-11-30T22:32:34Z",
  "categories": [
    "quant-ph",
    "physics.ins-det"
  ],
  "primary_category": "quant-ph"
}