{
  "arxiv_id": "2503.19862v3",
  "url": "https://arxiv.org/abs/2503.19862v3",
  "pdf_url": "https://arxiv.org/pdf/2503.19862v3.pdf",
  "title": "Early Career Researcher Input to the European Strategy for Particle   Physics Update: White Paper",
  "abstract": "This document, written by early career researchers (ECRs) in particle physics, aims to represent the perspectives of the European ECR community and serves as input for the 2025--2026 update of the European Strategy for Particle Physics. With input from a community-wide survey, it highlights key challenges faced by ECRs -- career stability, funding access and long-term research opportunities -- while proposing policy recommendations and targeted initiatives. It underscores the importance of practices fostering diverse, equitable, inclusive and healthy workplaces, as well as of stronger ECR communities, and highlights how effective communication and interdisciplinary collaborations reinforce the societal relevance of particle physics and promote continued support for large-scale and long-term projects. Finally, the future of both collider and beyond-collider experiments is addressed, emphasising the critical role of ECRs in shaping future projects. The ECR contribution is formed of two parts: the ten-page executive summary submitted as input to the European Strategy for Particle Physics Update and, as backup document, this extended white paper providing additional context.",
  "authors": [
    "Jan-Hendrik Arling",
    "Alexander Burgman",
    "Christina Dimitriadi",
    "Ulrich Einhaus",
    "Axel Gallén",
    "Abdelhamid Haddad",
    "Laura Huhta",
    "Armin Ilg",
    "Jan Klamka",
    "Elizabeth Long",
    "Thomas Madlener",
    "Arnau Morancho Tardà",
    "Emanuela Musumeci",
    "Krzysztof Mękała",
    "Elena Pompa Pacchi",
    "Marvin Pfaff",
    "Daniel Reichelt",
    "Leonhard Reichenbach",
    "Birgit Stapf",
    "Francesco P. Ucci",
    "Erik Wallin",
    "Harriet Watson",
    "Sagar Vidya Addepalli",
    "Bruno Alves",
    "Robert Mihai Amarinei",
    "Ricardo Barrué",
    "Lydia Brenner",
    "Giacomo Da Molin",
    "Arturo de Giorgi",
    "Bohdan Dudar",
    "Francesco Giuli",
    "Andrea Gurgone",
    "César Jesús-Valls",
    "Antoine Laudrain",
    "Martin J. Losekamm",
    "Rafał Masełek",
    "Wrishik Naskar",
    "Miquel Nebot-Guinot",
    "Marko Pesut",
    "Thomas Pöschl",
    "Efrain P. Segarra",
    "Rebecca Taylor",
    "Pavel Vana",
    "Hannah Wakeling",
    "Aidan R. Wiederhold"
  ],
  "published": "2025-03-25T17:29:10Z",
  "updated": "2025-09-11T13:51:23Z",
  "categories": [
    "hep-ex",
    "hep-ph",
    "hep-th",
    "physics.acc-ph",
    "physics.ins-det"
  ],
  "primary_category": "hep-ex"
}