{
  "arxiv_id": "2507.02817v2",
  "url": "https://arxiv.org/abs/2507.02817v2",
  "pdf_url": "https://arxiv.org/pdf/2507.02817v2.pdf",
  "title": "ML-based muon identification using a FNAL-NICADD scintillator chamber   for the MID subsystem of ALICE 3",
  "abstract": "The ALICE Collaboration is planning to construct a new detector (ALICE 3) aiming at exploiting the potential of the high-luminosity Large Hadron Collider (LHC). The new detector will allow ALICE to participate in LHC Run 5 scheduled from 2036 to 2041. The muon-identifier subsystem (MID) is part of the ALICE 3 reference detector layout. The MID will consist of a standard magnetic iron absorber ($\\approx4$ nuclear interaction lengths) followed by muon chambers. The baseline option for the MID chambers considers plastic scintillation bars equipped with wave-length shifting fibers and readout with silicon photomultipliers. This paper reports on the performance of a MID chamber prototype using 3 GeV/$c$ pion- and muon-enriched beams delivered by the CERN Proton Synchrotron (PS). The prototype was built using extruded plastic scintillator produced by FNAL-NICADD (Fermi National Accelerator Laboratory - Northern Illinois Center for Accelerator and Detector Development). The prototype was experimentally evaluated using varying absorber thicknesses (60, 70, 80, 90, and 100 cm) to assess its performance. The analysis was performed using Machine Learning techniques and the performance was validated with GEANT 4 simulations. Potential improvements in both hardware and data analysis are discussed.",
  "authors": [
    "Jesus Eduardo Muñoz Mendez",
    "Antonio Ortiz",
    "Alom Antonio Paz Jimenez",
    "Paola Vargas Torres",
    "Ruben Alfaro Molina",
    "Laura Helena González Trueba",
    "Varlen Grabski",
    "Arturo Fernandez Tellez",
    "Hector David Regules Medel",
    "Mario Rodriguez Cahuantzi",
    "Guillermo Tejeda Muñoz",
    "Yael Antonio Vasquez Beltran",
    "Juan Carlos Cabanillas Noris",
    "Solangel Rojas Torres",
    "Gergely Gabor Barnafoldi",
    "Daniel Szaraz",
    "Dezso Varga",
    "Robert Vertesi",
    "Edmundo Garciaa Solis"
  ],
  "published": "2025-07-03T17:32:39Z",
  "updated": "2025-09-11T19:36:32Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.1088/1748-0221/20/09/P09015"
}