{
  "arxiv_id": "2508.09335v2",
  "url": "https://arxiv.org/abs/2508.09335v2",
  "pdf_url": "https://arxiv.org/pdf/2508.09335v2.pdf",
  "title": "Geometric Optical Throughput and Etendue Revisited: Introducing the   Optogeometric Factor for Pixel Level Quantitative Imaging",
  "abstract": "This paper formally defines the optogeometric factor $F_{\\mathrm{opg}}$ as a pixel level quantity of geometric optical throughput, with units of $\\text{m}^2\\cdot\\text{sr}$ (or $\\text{m}^2$ in reduced form), derived from \\'etendue. Whereas \\'etendue is conventionally used to characterise the throughput of entire optical systems, the optogeometric factor is localised to the level of a single detector pixel, providing a new way to link scene radiance to the radiant flux actually collected by that pixel.   Although examples are drawn from infrared thermography, the formulation is general and applies equally to visible, ultraviolet, and Xray imaging systems.   The underlying radiometric principle is well established: classical radiometry already relates radiance, area, and solid angle. The new contribution of this work is to isolate that pixel level term, to name it as $F_{\\mathrm{opg}}$, and to derive its explicit forms. In this way, $F_{\\mathrm{opg}}$ acts as a compact and universal descriptor of pixel level radiometric throughput.   The present study builds on an earlier quantitative thermography equation that already expressed the radiant flux collected by an individual pixel. In that formulation, the scene based form of the optogeometric factor was present only implicitly, embedded in the derivation. Here, $F_{\\mathrm{opg}}$ is made explicit as an independent radiometric quantity, providing a more transparent and general framework that links pixel level geometry to radiometric throughput.   Two formulations of $F_{\\mathrm{opg}}$ are derived: a scene based form, expressed through the pixel footprint area and instantaneous field of view, and a sensor based form, expressed through the pixel pitch and optical $f$number. They coincide numerically under the paraxial approximation and other conditions discussed in this work.",
  "authors": [
    "Jan Sova",
    "Marie Kolaříková"
  ],
  "published": "2025-08-12T20:45:23Z",
  "updated": "2025-09-11T13:19:29Z",
  "categories": [
    "physics.optics",
    "physics.app-ph",
    "physics.ins-det"
  ],
  "primary_category": "physics.optics"
}