{
  "arxiv_id": "2509.09905v1",
  "url": "https://arxiv.org/abs/2509.09905v1",
  "pdf_url": "https://arxiv.org/pdf/2509.09905v1.pdf",
  "title": "Next generation direct RF sampling LLRF control and monitoring system   for linear accelerators",
  "abstract": "The low-level RF (LLRF) systems for linear accelerating structures are typically based on heterodyne architectures. The linear accelerators normally have many RF stations and multiple RF inputs and outputs for each station, so the complexity and size of the LLRF system grows rapidly when scaling up. To meet the design goals of being compact and affordable for future accelerators, or upgrading existing ones, we have developed and characterized the next generation LLRF (NG-LLRF) platform based on the RF system-on-chip (RFSoC) for S-band and C-band accelerating structures. The integrated RF data converters in RFSoC sample and generate the RF signals directly without any analogue mixing circuits, which significantly simplified the architecture compared with the conventional LLRF systems. We have performed high-power tests for the NG-LLRF with the S-band accelerating structure in the Next Linear Collider Test Accelerator (NLCTA) test facility at SLAC National Accelerator Laboratory and a C-band structure prototyped for Cool Cooper Collider (CCC). The NG-LLRF platform demonstrated pulse-to-pulse fluctuation levels considerably better than the requirements of the targeted applications and high precision and flexibility in generating and measuring the RF pulses. In this paper, the characterization results of the platform with different system architectures will be summarized and a selection of high-power test results of the NG-LLRF will be presented and analyzed.",
  "authors": [
    "C. Liu",
    "E. Snively",
    "R. Herbst",
    "K. Kim",
    "E. A. Nanni"
  ],
  "published": "2025-09-12T00:23:32Z",
  "updated": "2025-09-12T00:23:32Z",
  "categories": [
    "physics.acc-ph",
    "astro-ph.IM"
  ],
  "primary_category": "physics.acc-ph"
}