{
  "arxiv_id": "2509.09487v1",
  "url": "https://arxiv.org/abs/2509.09487v1",
  "pdf_url": "https://arxiv.org/pdf/2509.09487v1.pdf",
  "title": "Vorticity Packing Effects on Turbulent Transport in Decaying 2D   Incompressible Navier-Stokes Fluids",
  "abstract": "This paper investigates the role of initial vorticity packing fractions on the transport properties of decaying incompressible two-dimensional Navier-Stokes turbulence at very high Reynolds numbers and spatial resolutions. Turbulence is initiated via the Kelvin-Helmholtz instability and evolves through nonlinear inverse energy cascades, forming large-scale coherent structures that dominate the flow over long eddy turnover times. The initial vorticity packing fraction and circulation direction lead to qualitatively distinct turbulence dynamics and transport behaviors. Tracer particle trajectories are computed in the fluid field obtained using the Eulerian framework, with transport and mixing quantified using statistical measures such as absolute dispersion, position probability distribution functions (PDFs), and velocity PDFs. In the early stages, the onset of turbulence is primarily governed by the instability growth rate, which increases with vorticity packing fraction. As the flow evolves, transport exhibits a range of behaviors-subdiffusive, diffusive, or superdiffusive-and transitions between anisotropic and isotropic regimes, depending on the initial vorticity packing, flow structure, and stage of evolution. At later times, transport is dominated by the motion of large-scale coherent vortices, whose dynamics are also influenced by the initial vorticity packing ranging from subdiffusive trapping rotational motion and random walks, and L\\'evy flight-like events. These findings offer insights into transport in quasi-2D systems-ranging from laboratory-scale flows to geophysical phenomena and astrophysical structures-through analogies with 2D Navier-Stokes turbulence.",
  "authors": [
    "Snehanshu Maiti",
    "Shishir Biswas",
    "Rajaraman Ganesh"
  ],
  "published": "2025-09-11T14:21:41Z",
  "updated": "2025-09-11T14:21:41Z",
  "categories": [
    "physics.flu-dyn",
    "nlin.CD",
    "physics.comp-ph",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.flu-dyn"
}