{
  "arxiv_id": "2509.10350v1",
  "url": "https://arxiv.org/abs/2509.10350v1",
  "pdf_url": "https://arxiv.org/pdf/2509.10350v1.pdf",
  "title": "First operation of the FAMU experiment at the RIKEN-RAL high intensity   muon beam facility",
  "abstract": "The FAMU experiment, supported and funded by the Italian Institute of Nuclear Physics (INFN) and by the Science and Technology Facilities Council (STFC), aims to perform the first measurement of the ground-state hyperfine splitting (1S-hfs) of muonic hydrogen ($\\mu H$). This quantity is highly sensitive to the proton's Zemach radius $R_Z$. An experimental determination of $R_Z$ provides significant constraints on the parametrization of the proton form factors as well as on theoretical models describing the proton's electromagnetic structure. Following years of technological and methodological development, the FAMU experiment began operations in 2023 at Port 1 of the RIKEN-RAL muon beam line at the ISIS Neutron and Muon Source facility (Didcot, UK). In this paper, we first describe the unique detection technique employed by FAMU to determine the 1S-hfs of muonic hydrogen, followed by a detailed presentation of the final experimental layout. Finally, we report the first outcome from the 2023 commissioning run and from the initial physics runs performed in 2023 and 2024.",
  "authors": [
    "FAMU Collaboration",
    "A. Adamczak",
    "D. Bakalov",
    "G. Baldazzi",
    "M. Baruzzo",
    "R. Benocci",
    "R. Bertoni",
    "M. Bonesini",
    "S. Capra",
    "D. Cirrincione",
    "M. Clemenza",
    "L. Colace",
    "M. Danailov",
    "P. Danev",
    "A. De Bari",
    "C. De Vecchi",
    "D. Di Ferdinando",
    "E. Fasci",
    "R. Gaigher",
    "L. Gianfrani",
    "A. D. Hillier",
    "K. Ishida",
    "J. S. Lord",
    "A. Menegolli",
    "E. Mocchiutti",
    "S. Monzani",
    "L. Moretti",
    "G. Morgante",
    "C. Pizzolotto",
    "A. Pullia",
    "M. Pullia",
    "R. Ramponi",
    "H. E. Roman",
    "M. Rossella",
    "R. Rossini",
    "A. Sbrizzi",
    "M. Stoilov",
    "J. J. Suarez-Vargas",
    "G. Toci",
    "L. Tortora",
    "E. Vallazza",
    "K. Yokoyama",
    "A. Vacchi"
  ],
  "published": "2025-09-12T15:37:58Z",
  "updated": "2025-09-12T15:37:58Z",
  "categories": [
    "physics.atom-ph",
    "physics.ins-det"
  ],
  "primary_category": "physics.atom-ph"
}