[
  {
    "arxiv_id": "2509.09040v2",
    "url": "https://arxiv.org/abs/2509.09040v2",
    "pdf_url": "https://arxiv.org/pdf/2509.09040v2.pdf",
    "title": "Suppression of pair beam instabilities in a laboratory analogue of   blazar pair cascades",
    "abstract": "The generation of dense electron-positron pair beams in the laboratory can enable direct tests of theoretical models of $\\gamma$-ray bursts and active galactic nuclei. We have successfully achieved this using ultra-relativistic protons accelerated by the Super Proton Synchrotron at CERN. In the first application of this experimental platform, the stability of the pair beam is studied as it propagates through a metre-length plasma, analogous to TeV $\\gamma$-ray induced pair cascades in the intergalactic medium. It has been argued that pair beam instabilities disrupt the cascade, thus accounting for the observed lack of reprocessed GeV emission from TeV blazars. If true this would remove the need for a moderate strength intergalactic magnetic field to explain the observations. We find that the pair beam instability is suppressed if the beam is not perfectly collimated or monochromatic, hence the lower limit to the intergalactic magnetic field inferred from $\\gamma$-ray observations of blazars is robust.",
    "authors": [
      "Charles D. Arrowsmith",
      "Francesco Miniati",
      "Pablo J. Bilbao",
      "Pascal Simon",
      "Archie F. A. Bott",
      "Stephane Burger",
      "Hui Chen",
      "Filipe D. Cruz",
      "Tristan Davenne",
      "Anthony Dyson",
      "Ilias Efthymiopoulos",
      "Dustin H. Froula",
      "Alice Goillot",
      "Jon T. Gudmundsson",
      "Dan Haberberger",
      "Jack W. D. Halliday",
      "Tom Hodge",
      "Brian T. Huffman",
      "Sam Iaquinta",
      "G. Marshall",
      "Brian Reville",
      "Subir Sarkar",
      "Alexander A. Schekochihin",
      "Luis O. Silva",
      "Raspberry Simpson",
      "Vasiliki Stergiou",
      "Raoul M. G. M. Trines",
      "Thibault Vieu",
      "Nikolaos Charitonidis",
      "Robert Bingham",
      "Gianluca Gregori"
    ],
    "published": "2025-09-10T22:21:43Z",
    "updated": "2025-09-15T13:26:03Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2509.07448v2",
    "url": "https://arxiv.org/abs/2509.07448v2",
    "pdf_url": "https://arxiv.org/pdf/2509.07448v2.pdf",
    "title": "FCC-ee Lessons from SuperKEKB",
    "abstract": "SuperKEKB has achieved significantly higher specific luminosity than its predecessor KEKB, and it has proven a much more sustainable machine. It has successfully demonstrated several key design elements of FCC-ee. The design luminosity has not yet been reached, however. This observation is often (mistakenly) used to put into question the reliability of the FCC-ee design luminosity. In this note we review the accomplishments, challenges and obstacles of SuperKEKB, and compare these with the FCC-ee design.",
    "authors": [
      "Frank Zimmermann"
    ],
    "published": "2025-09-09T07:12:21Z",
    "updated": "2025-09-13T20:45:35Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.10434v1",
    "url": "https://arxiv.org/abs/2509.10434v1",
    "pdf_url": "https://arxiv.org/pdf/2509.10434v1.pdf",
    "title": "Viewing heat through ice: an infrared camera monitors hydrogel freezing   and thawing during cryoapplication",
    "abstract": "Cryosurgery employs a safe and relatively simple technique of exposure and is an advantageous and highly rated method. For its effective application, it is necessary to control both the volume of the expanding freezing zone and volumetric thermal field dynamics. The aim of this study was to perform a thermal imaging study of freezing and thawing in a model system (gel phantom) to predict the dynamics of the freezing zone during cryodestruction of biological tissues in vivo. Here, the thermal imager is an effective tool for demonstrating the surface temperature distribution. We have studied how the observed infrared image relates to the distribution and change of the thermal field in depth. For this purpose, we created test measuring equipment for simultaneous analysis of the dynamics of thermal fields on the surface, video recording of freezing and thawing on the surface as well as in the depth of the gel phantom, measuring the temperature at any given point in the depth and modeling in the zone of low-temperature exposure of vessels with different blood flow parameters. It was revealed that with a modeled vessel in the low-temperature exposure zone, the surface thermal fields deformed and they gained the shape of butterfly wings. Our experimental study in a gel phantom is supported by numerical calculations, demonstrating how the freezing zone and thermal isotherms on the surface and in depth evolve under real conditions, thereby providing a basis for assessing the cryoeffect time and intensity in practice. Key words: cryoapplication; freezing; thawing; temperature field dynamics; infrared thermography; gel phantom; testing measuring equipment; vessel simulation.",
    "authors": [
      "Gennadiy O. Kovalov",
      "Mykola O. Chyzh",
      "Vyacheslav Yu. Globa",
      "Oleksandr F. Todrin",
      "Galyna V. Shustakova",
      "Eduard Yu. Gordiyenko",
      "Yuliya V. Fomenko",
      "Oleh V. Ivakhnenko",
      "Polina O. Kofman",
      "Sergey N. Shevchenko"
    ],
    "published": "2025-09-12T17:42:27Z",
    "updated": "2025-09-12T17:42:27Z",
    "categories": [
      "physics.med-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.med-ph"
  },
  {
    "arxiv_id": "2501.13196v3",
    "url": "https://arxiv.org/abs/2501.13196v3",
    "pdf_url": "https://arxiv.org/pdf/2501.13196v3.pdf",
    "title": "Direct Measurement of the $^{39}$Ar Half-life from 3.4 Years of Data   with the DEAP-3600 Detector",
    "abstract": "The half-life of $^{39}$Ar is measured using the DEAP-3600 detector located 2 km underground at SNOLAB. Between 2016 and 2020, DEAP-3600 used a target mass of (3269 $\\pm$ 24) kg of liquid argon distilled from the atmosphere in a direct-detection dark matter search. Such an argon mass also enables direct measurements of argon isotope properties. The decay of $^{39}$Ar in DEAP-3600 is the dominant source of triggers by two orders of magnitude, ensuring high statistics and making DEAP-3600 well-suited for measuring this isotope's half-life. Use of the pulse-shape discrimination technique in DEAP-3600 allows powerful discrimination between nuclear recoils and electron recoils, resulting in the selection of a clean sample of $^{39}$Ar decays. Observing over a period of 3.4 years, the $^{39}$Ar half-life is measured to be $(302 \\pm 8_{\\rm stat} \\pm 6_{\\rm sys})$ years. This new direct measurement suggests that the half-life of $^{39}$Ar is significantly longer than the accepted value, with potential implications for measurements using this isotope's half-life as input.",
    "authors": [
      "DEAP Collaboration",
      "P. Adhikari",
      "R. Ajaj",
      "M. Alpízar-Venegas",
      "P. -A. Amaudruz",
      "J. Anstey",
      "D. J. Auty",
      "M. Batygov",
      "B. Beltran",
      "M. A. Bigentini",
      "C. E. Bina",
      "W. M. Bonivento",
      "M. G. Boulay",
      "J. F. Bueno",
      "M. Cadeddu",
      "B. Cai",
      "M. Cárdenas-Montes",
      "S. Cavuoti",
      "Y. Chen",
      "S. Choudhary",
      "B. T. Cleveland",
      "R. Crampton",
      "S. Daugherty",
      "P. DelGobbo",
      "P. Di Stefano",
      "G. Dolganov",
      "L. Doria",
      "F. A. Duncan",
      "M. Dunford",
      "E. Ellingwood",
      "A. Erlandson",
      "S. S. Farahani",
      "N. Fatemighomi",
      "G. Fiorillo",
      "R. J. Ford",
      "D. Gahan",
      "D. Gallacher",
      "A. Garai",
      "P. García Abia",
      "S. Garg",
      "P. Giampa",
      "A. Giménez-Alcázar",
      "D. Goeldi",
      "V. V. Golovko",
      "P. Gorel",
      "K. Graham",
      "A. Grobov",
      "A. L. Hallin",
      "M. Hamstra",
      "S. Haskins",
      "J. Hu",
      "J. Hucker",
      "T. Hugues",
      "A. Ilyasov",
      "B. Jigmeddorj",
      "C. J. Jillings",
      "A. Joy",
      "G. Kaur",
      "A. Kemp",
      "M. Khoshraftar Yazdi",
      "M. Kuźniak",
      "F. La Zia",
      "M. Lai",
      "S. Langrock",
      "B. Lehnert",
      "J. LePage-Bourbonnais",
      "N. Levashko",
      "M. Lissia",
      "L. Luzzi",
      "I. Machulin",
      "A. Maru",
      "J. Mason",
      "A. B. McDonald",
      "T. McElroy",
      "J. B. McLaughlin",
      "C. Mielnichuk",
      "L. Mirasola",
      "A. Moharana",
      "J. Monroe",
      "A. Murray",
      "C. Ng",
      "G. Oliviéro",
      "M. Olszewski",
      "S. Pal",
      "D. Papi",
      "B. Park",
      "M. Perry",
      "V. Pesudo",
      "T. R. Pollmann",
      "F. Rad",
      "C. Rethmeier",
      "F. Retière",
      "I. Rodríguez García",
      "L. Roszkowski",
      "R. Santorelli",
      "F. G. Schuckman II",
      "S. Seth",
      "V. Shalamova",
      "P. Skensved",
      "T. Smirnova",
      "K. Sobotkiewich",
      "T. Sonley",
      "J. Sosiak",
      "J. Soukup",
      "R. Stainforth",
      "M. Stringer",
      "J. Tang",
      "R. Turcotte-Tardif",
      "E. Vázquez-Jáuregui",
      "S. Viel",
      "B. Vyas",
      "M. Walczak",
      "J. Walding",
      "M. Ward",
      "S. Westerdale",
      "R. Wormington",
      "A. Zuñiga-Reyes"
    ],
    "published": "2025-01-22T19:57:03Z",
    "updated": "2025-09-12T16:19:52Z",
    "categories": [
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "nucl-ex",
    "doi": "10.1140/epjc/s10052-025-14289-5"
  },
  {
    "arxiv_id": "2509.10350v1",
    "url": "https://arxiv.org/abs/2509.10350v1",
    "pdf_url": "https://arxiv.org/pdf/2509.10350v1.pdf",
    "title": "First operation of the FAMU experiment at the RIKEN-RAL high intensity   muon beam facility",
    "abstract": "The FAMU experiment, supported and funded by the Italian Institute of Nuclear Physics (INFN) and by the Science and Technology Facilities Council (STFC), aims to perform the first measurement of the ground-state hyperfine splitting (1S-hfs) of muonic hydrogen ($\\mu H$). This quantity is highly sensitive to the proton's Zemach radius $R_Z$. An experimental determination of $R_Z$ provides significant constraints on the parametrization of the proton form factors as well as on theoretical models describing the proton's electromagnetic structure. Following years of technological and methodological development, the FAMU experiment began operations in 2023 at Port 1 of the RIKEN-RAL muon beam line at the ISIS Neutron and Muon Source facility (Didcot, UK). In this paper, we first describe the unique detection technique employed by FAMU to determine the 1S-hfs of muonic hydrogen, followed by a detailed presentation of the final experimental layout. Finally, we report the first outcome from the 2023 commissioning run and from the initial physics runs performed in 2023 and 2024.",
    "authors": [
      "FAMU Collaboration",
      "A. Adamczak",
      "D. Bakalov",
      "G. Baldazzi",
      "M. Baruzzo",
      "R. Benocci",
      "R. Bertoni",
      "M. Bonesini",
      "S. Capra",
      "D. Cirrincione",
      "M. Clemenza",
      "L. Colace",
      "M. Danailov",
      "P. Danev",
      "A. De Bari",
      "C. De Vecchi",
      "D. Di Ferdinando",
      "E. Fasci",
      "R. Gaigher",
      "L. Gianfrani",
      "A. D. Hillier",
      "K. Ishida",
      "J. S. Lord",
      "A. Menegolli",
      "E. Mocchiutti",
      "S. Monzani",
      "L. Moretti",
      "G. Morgante",
      "C. Pizzolotto",
      "A. Pullia",
      "M. Pullia",
      "R. Ramponi",
      "H. E. Roman",
      "M. Rossella",
      "R. Rossini",
      "A. Sbrizzi",
      "M. Stoilov",
      "J. J. Suarez-Vargas",
      "G. Toci",
      "L. Tortora",
      "E. Vallazza",
      "K. Yokoyama",
      "A. Vacchi"
    ],
    "published": "2025-09-12T15:37:58Z",
    "updated": "2025-09-12T15:37:58Z",
    "categories": [
      "physics.atom-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2509.10319v1",
    "url": "https://arxiv.org/abs/2509.10319v1",
    "pdf_url": "https://arxiv.org/pdf/2509.10319v1.pdf",
    "title": "The merger of spinning, accreting supermassive black hole binaries",
    "abstract": "Because they are likely to accrete substantial amounts of interstellar gas, merging supermassive binary black holes are expected to be strong multimessenger sources, radiating gravitational waves, photons from thermal gas, and photons from relativistic electrons energized by relativistic jets. Here we report on a numerical simulation that covers the late inspiral, merger, and initial postmerger phase of such a system where both black holes have the same mass and spin, and both spin axes are parallel to the orbital angular momentum. The simulation incorporates both 3D general relativistic magnetohydrodynamics and numerical relativity. The thermal photon power during the late inspiral, merger, and immediate postmerger phases is drawn from strong shocks rather than dissipation of turbulence inside a smoothly structured accretion disk as typically found around accreting single black holes. We find that the thermal photon and jet Poynting flux outputs are closely related in time, and we posit a mechanism that enforces this relation. The power radiated in both photons and jets diminishes gradually as merger is approached, but jumps sharply at merger to a noisy plateau. Such a distinct lightcurve should aid efforts to identify supermassive black hole mergers, with or without accompanying gravitational wave detections.",
    "authors": [
      "Lorenzo Ennoggi",
      "Manuela Campanelli",
      "Julian Krolik",
      "Scott C. Noble",
      "Yosef Zlochower",
      "Maria Chiara de Simone"
    ],
    "published": "2025-09-12T15:00:43Z",
    "updated": "2025-09-12T15:00:43Z",
    "categories": [
      "astro-ph.HE",
      "gr-qc",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2509.10276v1",
    "url": "https://arxiv.org/abs/2509.10276v1",
    "pdf_url": "https://arxiv.org/pdf/2509.10276v1.pdf",
    "title": "Power coupled to the slow wave resonance cone in cold plasma",
    "abstract": "We consider the power coupled to the plasma from a cylindrical source emitting resonance cones, propagative slow waves which exist in low density magnetized plasmas when the signs of the Stix parameters S and P differ. In this work, we calculate this power for the first time for any collisionality, and show that it remains finite in the cold collisionless limit, even as the radiofrequency electric field itself, and the associated power absorption density, is singular. We give the main parameter dependencies of the coupled power.",
    "authors": [
      "Wouter Tierens"
    ],
    "published": "2025-09-12T14:18:48Z",
    "updated": "2025-09-12T14:18:48Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.10244v1",
    "url": "https://arxiv.org/abs/2509.10244v1",
    "pdf_url": "https://arxiv.org/pdf/2509.10244v1.pdf",
    "title": "Technical Aspects of Plasma Operational Simulation (POPSIM): A Framework   for Data-Driven Simulation and Control",
    "abstract": "This paper reports on technical aspects of Plasma Operational Simulation (POPSIM), a research framework for data-driven simulation and control built in the machine learning framework JAX. The objective of the project is to address the extremely challenging simulation and modeling requirements of tokamak operations and control by combining simple principles-based models with data-driven models, spanning everything from power laws to new neural network architectures. This paper reports on key software and operations problems that the framework addresses, with examples from ongoing modeling activities for illustration.",
    "authors": [
      "Allen M. Wang",
      "Zander Keith",
      "Mark Dan Boyer",
      "Andrew Oakleigh Nelson",
      "Alex Saperstein",
      "Alessandro Pau",
      "Cristina Rea"
    ],
    "published": "2025-09-12T13:42:08Z",
    "updated": "2025-09-12T13:42:08Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2411.17303v2",
    "url": "https://arxiv.org/abs/2411.17303v2",
    "pdf_url": "https://arxiv.org/pdf/2411.17303v2.pdf",
    "title": "Inner crust of neutron stars: Polymorphism and superconductivity in the   liquid drop model",
    "abstract": "Within the liquid drop model built up with the nuclear interaction parametrization Sk$\\chi$450, which is based on the chiral effective field theory, we calculate numerically the internal energy density for each of nuclear pasta phases and for the uniform nuclear matter. We provide quantitative arguments in favor of coexistence of various nuclear matter phases at a significant range of total pressure within the inner crust of neutron stars, a concept known as crystal polymorphism. Specifically, we find that differences of the internal energy per baryon for various phases are typically less than the thermal energy per a freedom degree at temperature about $10^8$--$10^9$ K, which sets the energetic scale for thermal fluctuations of state of Fermi liquid from the ground state. The nuclear energy contributions are described using the same parametrization Sk$\\chi$450 for the bulk, plain surface and curvature terms. We find that the introduction of the curvature correction changes the ground state in a relevant way. This may be understood as a consequence of the corresponding change in size of the nucleus, which significantly modifies the phase transition densities. Using the calculated structural parameters from liquid drop model, we explore the physical consequences of the expected Cooper pairing of protons in lasagna phase. In this case, we find a crossover between the discreet layered and the three-dimensional anisotropic regimes of superconductivity. Additionally, we study the magnetic stress in lasagna accounting for a rotational lag between superfluid neutrons and the crystal lattice, which is believed to develop naturally in pulsars and magnetars. Our results offer a preliminary insight into rich magnetic properties of the inner crust of neutron stars.",
    "authors": [
      "Dmitry Kobyakov",
      "Xavier Viñas"
    ],
    "published": "2024-11-26T10:50:39Z",
    "updated": "2025-09-12T11:37:17Z",
    "categories": [
      "nucl-th",
      "astro-ph.HE",
      "astro-ph.SR",
      "hep-th",
      "physics.plasm-ph"
    ],
    "primary_category": "nucl-th"
  },
  {
    "arxiv_id": "2509.10107v1",
    "url": "https://arxiv.org/abs/2509.10107v1",
    "pdf_url": "https://arxiv.org/pdf/2509.10107v1.pdf",
    "title": "Experimental validation of electron correlation models in warm dense   matter",
    "abstract": "We report X-ray Thomson scattering measurements of warm dense aluminium at densities 3.75-4.5 g/cm$^3$ and a temperature of approximately 0.6 eV, performed at the HED-HiBEF instrument of the European XFEL using the DiPOLE-100X drive laser. By probing plasmon dispersion across momentum transfers $k$ = 0.99-2.57 Angstrom$^{-1}$ with high statistical fidelity, we directly test competing theories of electron dynamics under extreme conditions. Time-dependent density functional theory (TDDFT) reproduces both the observed plasmon energies and spectral shapes across the full $k$ range, whereas the random phase approximation (RPA) and static local-field-correction (LFC) models systematically overestimate the plasmon frequency, even for aluminium (a canonical uniform electron gas metal). Considering electron localisation around ions and the loss of crystalline symmetry due to liquid-state disorder, our measurements provide direct evidence that simple uniform electron gas models fail in warm dense matter and establish TDDFT as a reliable approach for electronic correlations in this regime.",
    "authors": [
      "Dmitrii S. Bespalov",
      "Ulf Zastrau",
      "Zhandos A. Moldabekov",
      "Thomas Gawne",
      "Tobias Dornheim",
      "Moyassar Meshhal",
      "Alexis Amouretti",
      "Michal Andrzejewski",
      "Karen Appel",
      "Carsten Baehtz",
      "Erik Brambrink",
      "Khachiwan Buakor",
      "Carolina Camarda",
      "David Chin",
      "Gilbert Collins",
      "Celine Crepisson",
      "Adrien Descamps",
      "Jon Eggert",
      "Luke Fletcher",
      "Alessandro Forte",
      "Gianluca Gregori",
      "Marion Harmand",
      "Oliver S. Humphries",
      "Hauke Hoeppner",
      "Jonas Kuhlke",
      "William Lynn",
      "Julian Luetgert",
      "Masruri Masruri",
      "Emma M. McBride",
      "Ryan Stewart McWilliams",
      "Alan Augusto Sanjuan Mora",
      "Jean-Paul Naedler",
      "Paul Neumayer",
      "Charlotte Palmer",
      "Alexander Pelka",
      "Lea Pennacchioni",
      "Danae Polsin",
      "Calum Prestwood",
      "Natalia A. Pukhareva",
      "Chongbing Qu",
      "Divyanshu Ranjan",
      "Ronald Redmer",
      "Michael Roeper",
      "Christoph Sahle",
      "Samuel Schumacher",
      "Jan-Patrick Schwinkendorf",
      "Melanie J. Sieber",
      "Madison Singleton",
      "Ethan Smith",
      "Christian Sternemann",
      "Thomas Stevens",
      "Michael Stevenson",
      "Cornelius Strohm",
      "Minxue Tang",
      "Monika Toncian",
      "Toma Toncian",
      "Thomas Tschentscher",
      "Sam Vinko",
      "Justin Wark",
      "Max Wilke",
      "Dominik Kraus",
      "Thomas R. Preston"
    ],
    "published": "2025-09-12T09:57:49Z",
    "updated": "2025-09-12T09:57:49Z",
    "categories": [
      "physics.plasm-ph",
      "cond-mat.str-el"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.10042v1",
    "url": "https://arxiv.org/abs/2509.10042v1",
    "pdf_url": "https://arxiv.org/pdf/2509.10042v1.pdf",
    "title": "Helical Field-Driven Translational-Rotational Conversion in Conductors",
    "abstract": "A theory of a new magnetodynamic effect describing the energy exchange between the degrees of freedom of a conducting cylinder moving in a helical magnetic field has been developed. The possibility of effectively converting the translational motion of the cylinder into its angular rotation around the system axis (translational-rotational conversion, TRC) has been demonstrated. A connection between this effect and the formation of helical trajectories of electrons in undulators in free electron lasers (FELs) and the inverse Faraday effect (IFE) has been revealed. In TRC, unlike many known effects associated with the interaction of a moving conductor with a magnetic field, the conductor has no electrical contact with any external circuit, which makes it especially attractive for various applications. The TRC is also possible in a magnetohydrodynamic flow moving along the axis of a helical magnetic field. The theory is formulated in the limit of large magnetic Reynolds numbers, which corresponds to a sufficiently fast motion of well-conducting objects. In this scenario, the dynamics of the system is described by a nonlinear pendulum equation or a nonlinear pendulum equation with a nonzero right-hand side. In the latter case, a system dynamic mode corresponding to phase lock can be implemented.",
    "authors": [
      "M. D. Tokman",
      "V. L. Bratman",
      "E. Magori",
      "N. Balal"
    ],
    "published": "2025-09-12T08:12:53Z",
    "updated": "2025-09-12T08:12:53Z",
    "categories": [
      "physics.plasm-ph",
      "physics.class-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.09308v2",
    "url": "https://arxiv.org/abs/2509.09308v2",
    "pdf_url": "https://arxiv.org/pdf/2509.09308v2.pdf",
    "title": "New results from fast timing iLGAD sensor on Timepix4",
    "abstract": "With the High-Luminosity Large Hadron Collider (HL-LHC) the number of collisions per bunch crossing increases. To cope with these high rates in the pixel trackers, per-pixel time measurements are required, which implies the need for fast sensors. The inverse Low-Gain Avalanche Detector (iLGAD) is one of the fast sensor options that is being investigated. This paper will show the results of an inverse Low-Gain Avalanche Detector (iLGAD) with a pitch of 55 $\\mu$m, a thickness of 250~$\\mu$m and a large-area (2~cm$^2$), bump bonded to a Timepix4 ASIC. Timepix4 has 195~ps time binning on each pixel and therefore an excellent ASIC to test the sensor. The sensor is characterised with radio-active source measurements in the lab, and during beam test at the CERN SPS North Area H8 beamline, where the Timepix4 telescope was used. The telescope has a time reference of 12~ps and a pointing resolution of 2.4 $\\pm$ 0.1~$\\mu$m. The iLGAD shows an almost uniform gain of approximately 4 and an efficiency of 99.6 $\\pm$ 0.1\\%. Without any corrections the obtained time resolution is about 750~ps. After timewalk and clock corrections the time resolution becomes 377 $\\pm$ 7~ps. Grazing angle measurements have been done, which allow to measure the time resolution as function of depth of the charge deposition in the sensor. This provides more insight for the perpendicular time resolution.",
    "authors": [
      "Daan Oppenhuis"
    ],
    "published": "2025-09-11T09:51:37Z",
    "updated": "2025-09-12T06:04:21Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.09949v1",
    "url": "https://arxiv.org/abs/2509.09949v1",
    "pdf_url": "https://arxiv.org/pdf/2509.09949v1.pdf",
    "title": "The growth of magnetic energy during the nonlinear phase of the subsonic   and supersonic small-scale dynamo",
    "abstract": "Small-scale dynamos (SSDs) amplify magnetic fields in turbulent plasmas. Theory predicts nonlinear magnetic energy growth $E_\\mathrm{mag} \\propto t^{p_\\mathrm{nl}}$, but this scaling has not been tested across flow regimes. Using a large ensemble of SSD simulations spanning sub- to supersonic turbulence, we find linear growth ($p_\\mathrm{nl} = 1$) in subsonic flows and quadratic growth ($p_\\mathrm{nl} = 2$) in supersonic flows. In all cases, we find a dynamo efficiency of $\\sim 1/100$ and a duration $\\Delta t \\approx 20\\,t_0$, with $t_0$ the turnover time, establishing the universal timescales and efficiencies of the nonlinear SSD across astrophysical and laboratory plasmas.",
    "authors": [
      "Neco Kriel",
      "James R. Beattie",
      "Mark R. Krumholz",
      "Jennifer Schober",
      "Patrick J. Armstrong"
    ],
    "published": "2025-09-12T03:56:36Z",
    "updated": "2025-09-12T03:56:36Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.09905v1",
    "url": "https://arxiv.org/abs/2509.09905v1",
    "pdf_url": "https://arxiv.org/pdf/2509.09905v1.pdf",
    "title": "Next generation direct RF sampling LLRF control and monitoring system   for linear accelerators",
    "abstract": "The low-level RF (LLRF) systems for linear accelerating structures are typically based on heterodyne architectures. The linear accelerators normally have many RF stations and multiple RF inputs and outputs for each station, so the complexity and size of the LLRF system grows rapidly when scaling up. To meet the design goals of being compact and affordable for future accelerators, or upgrading existing ones, we have developed and characterized the next generation LLRF (NG-LLRF) platform based on the RF system-on-chip (RFSoC) for S-band and C-band accelerating structures. The integrated RF data converters in RFSoC sample and generate the RF signals directly without any analogue mixing circuits, which significantly simplified the architecture compared with the conventional LLRF systems. We have performed high-power tests for the NG-LLRF with the S-band accelerating structure in the Next Linear Collider Test Accelerator (NLCTA) test facility at SLAC National Accelerator Laboratory and a C-band structure prototyped for Cool Cooper Collider (CCC). The NG-LLRF platform demonstrated pulse-to-pulse fluctuation levels considerably better than the requirements of the targeted applications and high precision and flexibility in generating and measuring the RF pulses. In this paper, the characterization results of the platform with different system architectures will be summarized and a selection of high-power test results of the NG-LLRF will be presented and analyzed.",
    "authors": [
      "C. Liu",
      "E. Snively",
      "R. Herbst",
      "K. Kim",
      "E. A. Nanni"
    ],
    "published": "2025-09-12T00:23:32Z",
    "updated": "2025-09-12T00:23:32Z",
    "categories": [
      "physics.acc-ph",
      "astro-ph.IM"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.02817v2",
    "url": "https://arxiv.org/abs/2507.02817v2",
    "pdf_url": "https://arxiv.org/pdf/2507.02817v2.pdf",
    "title": "ML-based muon identification using a FNAL-NICADD scintillator chamber   for the MID subsystem of ALICE 3",
    "abstract": "The ALICE Collaboration is planning to construct a new detector (ALICE 3) aiming at exploiting the potential of the high-luminosity Large Hadron Collider (LHC). The new detector will allow ALICE to participate in LHC Run 5 scheduled from 2036 to 2041. The muon-identifier subsystem (MID) is part of the ALICE 3 reference detector layout. The MID will consist of a standard magnetic iron absorber ($\\approx4$ nuclear interaction lengths) followed by muon chambers. The baseline option for the MID chambers considers plastic scintillation bars equipped with wave-length shifting fibers and readout with silicon photomultipliers. This paper reports on the performance of a MID chamber prototype using 3 GeV/$c$ pion- and muon-enriched beams delivered by the CERN Proton Synchrotron (PS). The prototype was built using extruded plastic scintillator produced by FNAL-NICADD (Fermi National Accelerator Laboratory - Northern Illinois Center for Accelerator and Detector Development). The prototype was experimentally evaluated using varying absorber thicknesses (60, 70, 80, 90, and 100 cm) to assess its performance. The analysis was performed using Machine Learning techniques and the performance was validated with GEANT 4 simulations. Potential improvements in both hardware and data analysis are discussed.",
    "authors": [
      "Jesus Eduardo Muñoz Mendez",
      "Antonio Ortiz",
      "Alom Antonio Paz Jimenez",
      "Paola Vargas Torres",
      "Ruben Alfaro Molina",
      "Laura Helena González Trueba",
      "Varlen Grabski",
      "Arturo Fernandez Tellez",
      "Hector David Regules Medel",
      "Mario Rodriguez Cahuantzi",
      "Guillermo Tejeda Muñoz",
      "Yael Antonio Vasquez Beltran",
      "Juan Carlos Cabanillas Noris",
      "Solangel Rojas Torres",
      "Gergely Gabor Barnafoldi",
      "Daniel Szaraz",
      "Dezso Varga",
      "Robert Vertesi",
      "Edmundo Garciaa Solis"
    ],
    "published": "2025-07-03T17:32:39Z",
    "updated": "2025-09-11T19:36:32Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/09/P09015"
  },
  {
    "arxiv_id": "2509.09766v1",
    "url": "https://arxiv.org/abs/2509.09766v1",
    "pdf_url": "https://arxiv.org/pdf/2509.09766v1.pdf",
    "title": "Nonequilibrium nonlinear response theory of amplitude-dependent   dissipative conductivity in disordered superconductors",
    "abstract": "This work investigates amplitude-dependent nonlinear corrections to the dissipative conductivity in superconductors, using the Keldysh-Usadel theory of nonequilibrium superconductivity, which captures the nonequilibrium dynamics of both quasiparticles and the pair potential. Our rigorous formulation naturally incorporates both the direct nonlinear action of the photon field and indirect contributions mediated by nonequilibrium variations in the pair potential, namely the Eliashberg effect and the Higgs mode. The third-harmonic current, often regarded as a hallmark of the Higgs mode, arises from both the direct photon action and the Higgs mode. Our numerical results are in excellent agreement with previous studies. In contrast, the first-harmonic current, and consequently the dissipative conductivity, receives contributions from all three mechanisms: the direct photon action, the Higgs mode, and the Eliashberg effect. It is shown that that the nonlinear correction to dissipative conductivity can serve as a fingerprint of the Higgs mode, appearing as a resonance peak at a frequency near the superconducting gap \\( \\Delta \\). In addition, our results provide microscopic insight into amplitude-dependent dissipation at frequencies well below \\( \\Delta \\), which is particularly relevant for applied superconducting devices. In particular, the long-standing issue concerning the frequency dependence of the amplitude-dependent quality factor is explained as originating from the direct nonlinear action of the photon field, rather than from contributions by the Higgs mode and the Eliashberg effect. Our practical and explicit expression for the nonlinear conductivity formula makes our results accessible to a broad range of researchers.",
    "authors": [
      "Takayuki Kubo"
    ],
    "published": "2025-09-11T18:00:02Z",
    "updated": "2025-09-11T18:00:02Z",
    "categories": [
      "cond-mat.supr-con",
      "physics.acc-ph",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "cond-mat.supr-con"
  },
  {
    "arxiv_id": "2509.09514v1",
    "url": "https://arxiv.org/abs/2509.09514v1",
    "pdf_url": "https://arxiv.org/pdf/2509.09514v1.pdf",
    "title": "Mapping of discrete range modulated proton radiograph to   water-equivalent path length using machine learning",
    "abstract": "Objective. Proton beams enable localized dose delivery. Accurate range estimation is essential, but planning still relies on X-ray CT, which introduces uncertainty in stopping power and range. Proton CT measures water equivalent thickness directly but suffers resolution loss from multiple Coulomb scattering. We develop a data driven method that reconstructs water equivalent path length (WEPL) maps from energy resolved proton radiographs, bypassing intermediate reconstructions. Approach. We present a machine learning pipeline for WEPL from high dimensional radiographs. Data were generated with the TOPAS Monte Carlo toolkit, modeling a clinical nozzle and a patient CT. Proton energies spanned 70-230 MeV across 72 projection angles. Principal component analysis reduced input dimensionality while preserving signal. A conditional GAN with gradient penalty was trained for WEPL prediction using a composite loss (adversarial, MSE, SSIM, perceptual) to balance sharpness, accuracy, and stability. Main results. The model reached a mean relative WEPL deviation of 2.5 percent, an SSIM of 0.97, and a proton radiography gamma index passing rate of 97.1 percent (2 percent delta WEPL, 3 mm distance-to-agreement) on a simulated head phantom. Results indicate high spatial fidelity and strong structural agreement. Significance. WEPL can be mapped directly from proton radiographs with deep learning while avoiding intermediate steps. The method mitigates limits of analytic techniques and may improve treatment planning. Future work will tune the number of PCA components, include detector response, explore low dose settings, and extend multi angle data toward full proton CT reconstruction; it is compatible with clinical workflows.",
    "authors": [
      "Atiq Ur Rahman",
      "Chun-Chieh Wang",
      "Shu-Wei Wu",
      "Tsi-Chian Chao",
      "I-Chun Cho"
    ],
    "published": "2025-09-11T14:55:55Z",
    "updated": "2025-09-11T14:55:55Z",
    "categories": [
      "physics.med-ph",
      "hep-ex",
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.med-ph"
  },
  {
    "arxiv_id": "2509.09511v1",
    "url": "https://arxiv.org/abs/2509.09511v1",
    "pdf_url": "https://arxiv.org/pdf/2509.09511v1.pdf",
    "title": "Chromatic Calorimetry -- A Novel Approach to Validate Energy Resolution   and Particle Discrimination",
    "abstract": "Chromatic calorimetry (CCAL) analyses particle detection by utilizing scintillators with distinct emission wavelengths to measure the longitudinal energy deposition of particle showers in high-energy physics, improving particle identification (PID) and energy resolution. By stacking scintillators in order of decreasing emission wavelength, CCAL enables layer-specific energy measurements, analyzed via amplitude fractions ($f_i = A_i / \\sum_j A_j$) and center of gravity ($\\langle z_{\\text{cog}} \\rangle = \\sum_i z_i E_i / \\sum_i E_i$). This thesis presents results from two CERN Super Proton Synchrotron (SPS) experiments conducted in 2023 and 2024, complemented by GEANT4 simulations of a quantum dot (QD)-based CCAL design, to validate its potential for future colliders such as the Future Circular Collider (FCC).",
    "authors": [
      "Devanshi Arora"
    ],
    "published": "2025-09-11T14:52:18Z",
    "updated": "2025-09-11T14:52:18Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2509.09487v1",
    "url": "https://arxiv.org/abs/2509.09487v1",
    "pdf_url": "https://arxiv.org/pdf/2509.09487v1.pdf",
    "title": "Vorticity Packing Effects on Turbulent Transport in Decaying 2D   Incompressible Navier-Stokes Fluids",
    "abstract": "This paper investigates the role of initial vorticity packing fractions on the transport properties of decaying incompressible two-dimensional Navier-Stokes turbulence at very high Reynolds numbers and spatial resolutions. Turbulence is initiated via the Kelvin-Helmholtz instability and evolves through nonlinear inverse energy cascades, forming large-scale coherent structures that dominate the flow over long eddy turnover times. The initial vorticity packing fraction and circulation direction lead to qualitatively distinct turbulence dynamics and transport behaviors. Tracer particle trajectories are computed in the fluid field obtained using the Eulerian framework, with transport and mixing quantified using statistical measures such as absolute dispersion, position probability distribution functions (PDFs), and velocity PDFs. In the early stages, the onset of turbulence is primarily governed by the instability growth rate, which increases with vorticity packing fraction. As the flow evolves, transport exhibits a range of behaviors-subdiffusive, diffusive, or superdiffusive-and transitions between anisotropic and isotropic regimes, depending on the initial vorticity packing, flow structure, and stage of evolution. At later times, transport is dominated by the motion of large-scale coherent vortices, whose dynamics are also influenced by the initial vorticity packing ranging from subdiffusive trapping rotational motion and random walks, and L\\'evy flight-like events. These findings offer insights into transport in quasi-2D systems-ranging from laboratory-scale flows to geophysical phenomena and astrophysical structures-through analogies with 2D Navier-Stokes turbulence.",
    "authors": [
      "Snehanshu Maiti",
      "Shishir Biswas",
      "Rajaraman Ganesh"
    ],
    "published": "2025-09-11T14:21:41Z",
    "updated": "2025-09-11T14:21:41Z",
    "categories": [
      "physics.flu-dyn",
      "nlin.CD",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.flu-dyn"
  },
  {
    "arxiv_id": "2503.19862v3",
    "url": "https://arxiv.org/abs/2503.19862v3",
    "pdf_url": "https://arxiv.org/pdf/2503.19862v3.pdf",
    "title": "Early Career Researcher Input to the European Strategy for Particle   Physics Update: White Paper",
    "abstract": "This document, written by early career researchers (ECRs) in particle physics, aims to represent the perspectives of the European ECR community and serves as input for the 2025--2026 update of the European Strategy for Particle Physics. With input from a community-wide survey, it highlights key challenges faced by ECRs -- career stability, funding access and long-term research opportunities -- while proposing policy recommendations and targeted initiatives. It underscores the importance of practices fostering diverse, equitable, inclusive and healthy workplaces, as well as of stronger ECR communities, and highlights how effective communication and interdisciplinary collaborations reinforce the societal relevance of particle physics and promote continued support for large-scale and long-term projects. Finally, the future of both collider and beyond-collider experiments is addressed, emphasising the critical role of ECRs in shaping future projects. The ECR contribution is formed of two parts: the ten-page executive summary submitted as input to the European Strategy for Particle Physics Update and, as backup document, this extended white paper providing additional context.",
    "authors": [
      "Jan-Hendrik Arling",
      "Alexander Burgman",
      "Christina Dimitriadi",
      "Ulrich Einhaus",
      "Axel Gallén",
      "Abdelhamid Haddad",
      "Laura Huhta",
      "Armin Ilg",
      "Jan Klamka",
      "Elizabeth Long",
      "Thomas Madlener",
      "Arnau Morancho Tardà",
      "Emanuela Musumeci",
      "Krzysztof Mękała",
      "Elena Pompa Pacchi",
      "Marvin Pfaff",
      "Daniel Reichelt",
      "Leonhard Reichenbach",
      "Birgit Stapf",
      "Francesco P. Ucci",
      "Erik Wallin",
      "Harriet Watson",
      "Sagar Vidya Addepalli",
      "Bruno Alves",
      "Robert Mihai Amarinei",
      "Ricardo Barrué",
      "Lydia Brenner",
      "Giacomo Da Molin",
      "Arturo de Giorgi",
      "Bohdan Dudar",
      "Francesco Giuli",
      "Andrea Gurgone",
      "César Jesús-Valls",
      "Antoine Laudrain",
      "Martin J. Losekamm",
      "Rafał Masełek",
      "Wrishik Naskar",
      "Miquel Nebot-Guinot",
      "Marko Pesut",
      "Thomas Pöschl",
      "Efrain P. Segarra",
      "Rebecca Taylor",
      "Pavel Vana",
      "Hannah Wakeling",
      "Aidan R. Wiederhold"
    ],
    "published": "2025-03-25T17:29:10Z",
    "updated": "2025-09-11T13:51:23Z",
    "categories": [
      "hep-ex",
      "hep-ph",
      "hep-th",
      "physics.acc-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2508.09509v2",
    "url": "https://arxiv.org/abs/2508.09509v2",
    "pdf_url": "https://arxiv.org/pdf/2508.09509v2.pdf",
    "title": "A hyperbolic finite difference scheme for anisotropic diffusion   equations: preserving the discrete maximum principle",
    "abstract": "A hyperbolic system approach is proposed for robust computation of anisotropic diffusion equations that appear in quasineutral plasmas. Though the approach exhibits merits of high extensibility and accurate flux computation, the monotonicity of the scheme for anisotropic diffusion cases has not been understood. In this study, the discrete maximum principle (DMP) of the hyperbolic system approach is analyzed and tested in various anisotropic diffusion cases. A mathematical analysis is conducted to obtain an optimal condition of an arbitrary parameter to guarantee the DMP, and numerical experiments reveal an adoptive selection of the parameter for DMP-preserving results. It is confirmed that, with an appropriate preconditioning matrix and parameter choice, the hyperbolic system approach preserves the DMP even with a linear discretization.",
    "authors": [
      "Tokuhiro Eto",
      "Rei Kawashima"
    ],
    "published": "2025-08-13T05:44:45Z",
    "updated": "2025-09-11T13:43:09Z",
    "categories": [
      "math.NA",
      "cs.NA",
      "physics.plasm-ph",
      "35K20, 65M12, 65N06"
    ],
    "primary_category": "math.NA"
  },
  {
    "arxiv_id": "2508.09335v2",
    "url": "https://arxiv.org/abs/2508.09335v2",
    "pdf_url": "https://arxiv.org/pdf/2508.09335v2.pdf",
    "title": "Geometric Optical Throughput and Etendue Revisited: Introducing the   Optogeometric Factor for Pixel Level Quantitative Imaging",
    "abstract": "This paper formally defines the optogeometric factor $F_{\\mathrm{opg}}$ as a pixel level quantity of geometric optical throughput, with units of $\\text{m}^2\\cdot\\text{sr}$ (or $\\text{m}^2$ in reduced form), derived from \\'etendue. Whereas \\'etendue is conventionally used to characterise the throughput of entire optical systems, the optogeometric factor is localised to the level of a single detector pixel, providing a new way to link scene radiance to the radiant flux actually collected by that pixel.   Although examples are drawn from infrared thermography, the formulation is general and applies equally to visible, ultraviolet, and Xray imaging systems.   The underlying radiometric principle is well established: classical radiometry already relates radiance, area, and solid angle. The new contribution of this work is to isolate that pixel level term, to name it as $F_{\\mathrm{opg}}$, and to derive its explicit forms. In this way, $F_{\\mathrm{opg}}$ acts as a compact and universal descriptor of pixel level radiometric throughput.   The present study builds on an earlier quantitative thermography equation that already expressed the radiant flux collected by an individual pixel. In that formulation, the scene based form of the optogeometric factor was present only implicitly, embedded in the derivation. Here, $F_{\\mathrm{opg}}$ is made explicit as an independent radiometric quantity, providing a more transparent and general framework that links pixel level geometry to radiometric throughput.   Two formulations of $F_{\\mathrm{opg}}$ are derived: a scene based form, expressed through the pixel footprint area and instantaneous field of view, and a sensor based form, expressed through the pixel pitch and optical $f$number. They coincide numerically under the paraxial approximation and other conditions discussed in this work.",
    "authors": [
      "Jan Sova",
      "Marie Kolaříková"
    ],
    "published": "2025-08-12T20:45:23Z",
    "updated": "2025-09-11T13:19:29Z",
    "categories": [
      "physics.optics",
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2509.09316v1",
    "url": "https://arxiv.org/abs/2509.09316v1",
    "pdf_url": "https://arxiv.org/pdf/2509.09316v1.pdf",
    "title": "Novel Room-Temperature Synthesis of Tellurium-Loaded Liquid   Scintillators for Neutrinoless Double Beta Decay Search",
    "abstract": "This study establishes an innovative room-temperature synthesis approach for tellurium-diol (Te-diol) compounds, which are crucial components in tellurium-loaded liquid scintillator (Te-LS). The synthesis involves the direct reaction of telluric acid with diols (e.g., 1,2-hexanediol) in methanol under ambient conditions (20$\\pm$5{\\deg}C) , with the key features of lower energy consumption, enhanced safety, and improved scalability. Mechanistic studies reveal that methanol serves not merely as a solvent but also as a catalyst, playing a critical role in the room-temperature synthesis. The organic amine N,N-dimethyldodecylamine demonstrates dual functionality as both catalyst and stabilizer. The Te-diol compounds enable fabrication of high-performance Te-LS exhibiting exceptional optical transparency ($\\Delta Abs$(430nm) $\\leq$ 0.0003 per 1% Te loading), achieving long-term spectral stability exceeding or approaching one year for both 1% and 3% Te formulations, and demonstrating a light yield comparable to that achieved by the azeotropic distillation method. The developed protocol offers a green, efficient alternative for large-scale Te-LS production, particularly valuable for next-generation neutrinoless double-beta decay experiments.",
    "authors": [
      "Yayun Ding",
      "Mengchao Liu",
      "Gaosong Li",
      "Liangjian Wen",
      "Fei Liu",
      "Feng Liu",
      "Jiayu Jiang",
      "Zhiqi Zhang",
      "Wenjie Li",
      "Zhiyong Zhang"
    ],
    "published": "2025-09-11T10:01:29Z",
    "updated": "2025-09-11T10:01:29Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.09260v1",
    "url": "https://arxiv.org/abs/2509.09260v1",
    "pdf_url": "https://arxiv.org/pdf/2509.09260v1.pdf",
    "title": "Study of a Compact Device for Water Attenuation Length Measurements",
    "abstract": "This study presents the development and validation of a compact device for measuring the water attenuation length (WAL), utilizing photomultiplier tubes (PMTs), optical fibers, and LEDs. An 8 m water tank and the device was constructed and validated in the laboratory. The device is capable of measuring WAL values up to 50 m. The stray light was blocked mainly by a custom-designed shutter. Toy Monte Carlo simulations were employed to evaluate the measurement uncertainty, which was found to be within reasonable limits. These simulations further indicate that the uncertainty can be reduced and more accurately predicted for a larger-scale device with a length of 30 m. Real-time monitoring was achieved by integrating the device into a water purification circulation system, providing a practical, scalable solution for WAL measurement in future large-scale water Cherenkov detectors.",
    "authors": [
      "Junyou Chen",
      "Jilei Xu",
      "Yongbo Huang",
      "Sibo Wang",
      "Chuanshi Dong",
      "Haoqi Lu",
      "Changgen Yang",
      "Yongpeng Zhang",
      "Yi Wang"
    ],
    "published": "2025-09-11T08:44:16Z",
    "updated": "2025-09-11T08:44:16Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.09187v1",
    "url": "https://arxiv.org/abs/2509.09187v1",
    "pdf_url": "https://arxiv.org/pdf/2509.09187v1.pdf",
    "title": "TCT-based monitoring of LGAD radiation hardness for ATLAS-HGTD   production",
    "abstract": "Production of the High Granularity Timing Detector for the ATLAS experiment at High Luminosity LHC requires over 21000 silicon sensors based on Low Gain Avalanche Diode (LGAD) technology. Their radiation hardness is monitored as a part of the production quality control. Dedicated test structures from each wafer are irradiated with neutrons and a fast and comprehensive characterization is required. We introduce a new test method based on Transient Current Technique (TCT) performed in the interface region of two LGAD devices. The measurement enables extraction of numerous sensor performance parameters, such as LGAD gain layer depletion voltage, LGAD gain dependence on bias voltage, sensor leakage current and effective interpad distance. Complementary capacitance-voltage measurements and charge collection measurements with 90Sr on the same samples have been performed to calibrate the TCT results in terms of charge collection and define acceptance criteria for wafer radiation hardness in the ATLAS-HGTD project.",
    "authors": [
      "Iskra Velkovska",
      "Bojan Hiti"
    ],
    "published": "2025-09-11T06:55:23Z",
    "updated": "2025-09-11T06:55:23Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2403.03156v6",
    "url": "https://arxiv.org/abs/2403.03156v6",
    "pdf_url": "https://arxiv.org/pdf/2403.03156v6.pdf",
    "title": "The Fast Stochastic Matching Pursuit for Neutrino and Dark Matter   Experiments",
    "abstract": "Photomultiplier tubes (PMTs) are widely deployed at neutrino and dark matter experiments for photon counting. When multiple photons hit a PMT consecutively, their photo-electron (PE) pulses pile up to hinder the precise measurements of the count and timings. We introduce Fast Stochastic Matching Pursuit (FSMP) to analyze the PMT signal waveforms into individual PEs with the strategy of reversible-jump Markov-chain Monte Carlo. We demonstrate that FSMP improves the energy and time resolution of PMT-based experiments and gains acceleration on GPUs. It is suitable for dynode PMTs, and is extensible to microchannel-plate (MCP) PMTs. In the condition of our laboratory characterization of 8-inch MCP-PMTs, FSMP improves the energy resolution by up to 10% from the conventional method of waveform integration.",
    "authors": [
      "Yuyi Wang",
      "Aiqiang Zhang",
      "Yiyang Wu",
      "Benda Xu",
      "Xuewei Liu",
      "Jiajie Chen",
      "Zhe Wang",
      "Shaomin Chen"
    ],
    "published": "2024-03-05T17:49:06Z",
    "updated": "2025-09-11T04:54:31Z",
    "categories": [
      "hep-ex",
      "physics.data-an",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1016/j.nima.2025.170986"
  },
  {
    "arxiv_id": "2509.09126v1",
    "url": "https://arxiv.org/abs/2509.09126v1",
    "pdf_url": "https://arxiv.org/pdf/2509.09126v1.pdf",
    "title": "Exploration on the Two-stream Instability in the Polar Cusp Under Solar   Storm Disturbances and its Potential Impacts on Spacecraft",
    "abstract": "During solar storms, the polar cusp often exhibits electron populations with distinct velocity distributions, which may be associated with the two-stream instability. This study reveals the evolution of the two-stream instability associated with electron velocities and the interaction between the growth phase of the two-stream instability and the electrostatic solitary waves (ESWs). The results from particle-in-cell (PIC) simulations are compared with satellite observational data and computational outcomes. The potential risks associated with two-stream instability, including surface charge accumulation and communication system interference on spacecraft, are also explored. The findings show that, in the high-latitude polar cusp region, the interaction between the solar wind plasma propagating along magnetic field lines and the upward-moving ionospheric plasma could drive two-stream instability, leading to the formation of electron hole structures in phase space and triggering a bipolar distribution of ESWs. When the spatial magnetic field and wave vector meet specific conditions, the enhanced electron cyclotron motion could suppress the formation of two-stream instability and electron hole structures, leading to a reduction in the amplitude of the ESWs. The results offer valuable insights for a deeper understanding of the impact of solar storms on the polar cusp environment, as well as for monitoring electromagnetic environment and ensuring the stable operation of spacecraft.",
    "authors": [
      "Jikai Sun",
      "Lei Chang",
      "Yu Liu",
      "Guojun Wang",
      "Zichen Kan",
      "Shijie Zhang",
      "Jingjing Ma",
      "Dingzhou Li",
      "Yingxin Zhao"
    ],
    "published": "2025-09-11T03:42:32Z",
    "updated": "2025-09-11T03:42:32Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.09104v1",
    "url": "https://arxiv.org/abs/2509.09104v1",
    "pdf_url": "https://arxiv.org/pdf/2509.09104v1.pdf",
    "title": "Exploration of novel ICP using helicon antennas with zero magnetic field",
    "abstract": "Inductively coupled plasma (ICP) attracts great attention from aspects of fundamental research and practical applications, and efficient power coupling is highly desirable for both of them. The present study explores a novel strategy for efficient ICP through using helicon antennas with zero external magnetic field. Specific research is devoted to the effects of antenna geometry (loop, half-helix, Boswell, Nagoya III), driving frequency (13.56-54.24 MHz) and radial density profile (Gaussian and parabolic) on power coupling. Findings reveal that: loop antenna yields higher power deposition efficiency than half-helix, Boswell, and Nagoya III antennas, driving frequency gives negligible effects, and parabolic density profile results in more efficient power coupling than Gaussian density profile especially in the radial direction, for the conditions employed here. Therefore, it is suggested that for this novel ICP strategy one should use loop antenna with parabolic density profile, and the industrial frequency of 13.56 MHz can work well. This study provides a valuable reference for the novel design of efficient ICP sources, which could be used for material processing and space propulsion, etc. Key words: Inductively coupled plasma; Antenna Geometry; Power Deposition; Driving Frequency",
    "authors": [
      "Ye Tao",
      "Lei Chang",
      "Dingzhou Li",
      "Yingxin Zhao"
    ],
    "published": "2025-09-11T02:29:56Z",
    "updated": "2025-09-11T02:29:56Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.09057v1",
    "url": "https://arxiv.org/abs/2509.09057v1",
    "pdf_url": "https://arxiv.org/pdf/2509.09057v1.pdf",
    "title": "Unraveling the emission mechanism powering long period radio transients   from interacting white dwarf binaries via kinetic plasma simulations",
    "abstract": "Recent observations of long period radio transients, such as GLEAM-X J0704-37 and ILTJ1101 + 5521, have revealed a previously unrecognized population of galactic radio transient sources associated with white dwarf - M dwarf binaries. It is an open question how to produce coherent radio emission in these systems, though a model driven by binary interaction seems likely given the nature and correlation of the emission with the binaries' orbital period. Using kinetic plasma simulations, we demonstrate that the relativistic electron cyclotron maser instability (ECMI) is a viable mechanism for generating radio pulses in white dwarf - M dwarf systems, akin to planetary radio emission, such as that from the Jupiter-Io system. We quantify the relativistic ECMI in the nonlinear regime under conditions relevant for white dwarf radio emission for the first time. Our simulations demonstrate that the ECMI can intrinsically produce partially linearly polarized emission relevant to explaining the observed emission spectrum of the two galactic sources, though the precise details will depend on the plasma composition. Our work paves the way for a systematic and fully nonlinear computational modeling of radio emission from interacting white dwarf sources.",
    "authors": [
      "Yici Zhong",
      "Elias R. Most"
    ],
    "published": "2025-09-10T23:33:04Z",
    "updated": "2025-09-10T23:33:04Z",
    "categories": [
      "astro-ph.HE",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2509.09010v1",
    "url": "https://arxiv.org/abs/2509.09010v1",
    "pdf_url": "https://arxiv.org/pdf/2509.09010v1.pdf",
    "title": "Cryogenic geometric anti-spring vibration isolation system",
    "abstract": "The combination of low temperature and low vibration levels is key for ultrasensitive sensing applications such as scanning probe microscopy, large-mass quantum mechanics, and gravitational wave detection. Unfortunately, closed-cycle cryostats using pulse tube or GM coolers introduce strong low-frequency vibrations starting at 1 Hz. Mass-spring systems allow passive isolation, but for low-frequency applications the required spring constants and masses become impractical. Blade-based geometric anti-spring systems are compact isolators that operate from sub-Hz frequencies, but have not been demonstrated at cryogenic temperatures. Here, we characterize a geometric anti-spring system tuned to operate at cryogenic temperatures. Our cryogenic filter uses radially arranged titanium blade springs whose effective spring constant can be tuned in-situ using a magnetic actuator. Our system achieves a vertical resonance frequency of 185 mHz at 7K, which allows reduction of vibrations at the problematic 1 Hz cooler frequency by an order of magnitude.",
    "authors": [
      "L. Feenstra",
      "S. Domínguez-Calderón",
      "K. van Oosten",
      "H. S. M. Bohemen",
      "T. Benschop",
      "M. Brinkman",
      "M. Li",
      "E. Hennes",
      "R. Cornelissen",
      "B. J. Hensen",
      "A. Bertolini",
      "M. P. Allan"
    ],
    "published": "2025-09-10T21:13:37Z",
    "updated": "2025-09-10T21:13:37Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.08987v1",
    "url": "https://arxiv.org/abs/2509.08987v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08987v1.pdf",
    "title": "HitPix3 -- a new HV-CMOS active pixel sensor for ion beam therapy",
    "abstract": "Particle therapy is a well-established clinical treatment of tumors and so far, more than one hundred centers are in operation around the world. High accuracy on position and dose rate in beam monitoring are major cornerstones of clinical success in particle therapy. A high voltage CMOS (HV-CMOS) monolithic active pixel sensor was developed for this beam monitoring system. The HV-CMOS technology has demonstrated many advantages over other technologies in dealing with radiation tolerance. This HV-CMOS sensor was produced with a 180 nm commercial technology on high-resistivity substrate. The HitPix sensor features several specific design details for operation in a high-intensity ion beam environment: hit-counting pixels, on-sensor projection calculation, radiation tolerant design and frame-based readout. It has a 9775 $\\mu$m $\\times$ 10110 $\\mu$m sensor area with 200 $\\mu$m $\\times$ 200 $\\mu$m pixel size. The new HitPix3 has a number of improvements, including a modified in-pixel amplifier, on-sensor calculation of beam profile projection in two dimensions, and in-pixel threshold tuning capacity. The functionality of these features was confirmed in laboratory tests of unirradiated HitPix3 sensors, making the HitPix3 an important step in developing a sensor for use in ion beam monitoring.",
    "authors": [
      "Hui Zhang",
      "Bogdan Topko",
      "Ivan Perić"
    ],
    "published": "2025-09-10T20:35:47Z",
    "updated": "2025-09-10T20:35:47Z",
    "categories": [
      "physics.ins-det",
      "physics.med-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.08931v1",
    "url": "https://arxiv.org/abs/2509.08931v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08931v1.pdf",
    "title": "Fabrication of thin planar radiopure foils with 82Se for the SuperNEMO   Demonstrator",
    "abstract": "The SuperNEMO Demonstrator, designed to search for double beta decay using enriched 82Se, has been assembled in the Modane Underground Laboratory under the French Alps. Thin foils with radio - purified and enriched 82Se are installed centrally in the detector. A novel foil fabrication method has been developed, improving the radiopurity achieved in the previous generation experiment. It consists of wrapping standalone selenium pads in raw Mylar, combined with selenium purified by a new reverse-chromatography method. This paper describes the features of these foils, their fabrication process, the characterization results, and the integration of the foils into the SuperNEMO Demonstrator.",
    "authors": [
      "X. Aguerre",
      "A. Barabash",
      "A. Basharina-Freshville",
      "M. Bongrand",
      "Ch. Bourgeois",
      "D. Breton",
      "R. Breier",
      "J. Busto",
      "C. Cerna",
      "J. Cesar",
      "M. Ceschia",
      "E. Chauveau",
      "S. De Capua",
      "D. Duchesneau",
      "J. J. Evans",
      "D. V. Filosofov",
      "M. Granjon",
      "M. Hoballah",
      "R. Hodák",
      "J. Horkley",
      "A. Jeremie",
      "S. Jullian",
      "J. Kaizer",
      "A. A. Klimenko",
      "O. Kochetov",
      "F. Koňařík",
      "S. Konovalov",
      "T. Křižák",
      "A. Lahaie",
      "K. Lang",
      "Y. Lemière",
      "T. Le Noblet",
      "P. Li",
      "P. Loaiza",
      "J. Maalmi",
      "M. Macko",
      "F. Mamedov",
      "C. Marquet",
      "F. Mauger",
      "A. Mendl",
      "B. Morgan",
      "I. Nemchenok",
      "V. Palušová",
      "C. Patrick",
      "F. Perrot",
      "M. Petro",
      "F. Piquemal",
      "P. Povinec",
      "S. Pratt",
      "M. Proga",
      "W. S. Quinn",
      "A. V. Rakhimov",
      "Y. R amachers",
      "A. Remoto",
      "N. I. Rukhadze",
      "R. Saakyan",
      "R. Salazar",
      "J. Sedgbeer",
      "Y. Shitov",
      "L. Simard",
      "F. Šimkovic",
      "A. A. Smolnikov",
      "S. Söldner-Rembold",
      "I. Štekl",
      "J. Suhonen",
      "H. Tedjditi",
      "J. Thomas",
      "V. Timkin",
      "V. Tretyak",
      "V. I. Tretyak",
      "G. Turnbull",
      "Y. Vereshchaka",
      "G. Warot",
      "D. Waters",
      "V. Yumatov"
    ],
    "published": "2025-09-10T18:51:47Z",
    "updated": "2025-09-10T18:51:47Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2410.21162v3",
    "url": "https://arxiv.org/abs/2410.21162v3",
    "pdf_url": "https://arxiv.org/pdf/2410.21162v3.pdf",
    "title": "Phase space compression of a positive muon beam in two spatial   dimensions",
    "abstract": "We present the first demonstration of simultaneous phase space compression in two spatial dimensions of a positive muon beam, the first stage of the novel high-brightness muon beam under development by the muCool collaboration at the Paul Scherrer Institute. The keV-energy, sub-mm size beam would enable a factor 10$^5$ improvement in brightness for precision muSR, and atomic and particle physics measurements with positive muons. This compression is achieved within a cryogenic helium gas target with a strong density gradient, placed in a homogeneous magnetic field, under the influence of a complex electric field. In the next phase, the muon beam will be extracted into vacuum.",
    "authors": [
      "A. Antognini",
      "N. J. Ayres",
      "I. Belosevic",
      "V. Bondar",
      "A. Eggenberger",
      "M. Hildebrandt",
      "R. Iwai",
      "K. Kirch",
      "A. Knecht",
      "G. Lospalluto",
      "J. Nuber",
      "A. Papa",
      "M. Sakurai",
      "I. Solovyev",
      "D. Taqqu",
      "T. Yan"
    ],
    "published": "2024-10-28T16:03:41Z",
    "updated": "2025-09-10T18:40:15Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2503.07941v2",
    "url": "https://arxiv.org/abs/2503.07941v2",
    "pdf_url": "https://arxiv.org/pdf/2503.07941v2.pdf",
    "title": "Gain characterization of LGAD sensors with beta particles and 28-MeV   protons",
    "abstract": "Low Gain Avalanche Diodes, also known as LGADs, are widely considered for fast-timing applications in high energy physics, nuclear physics, space science, medical imaging, and precision measurements of rare processes. Such devices are silicon-based and feature an intrinsic gain due to a $p{^+}$-doped layer that allows the production of a controlled avalanche of carriers, with multiplication on the order of 10-100. This technology can provide time resolution on the order of 20-30 ps, and variants of this technology can provide precision tracking too. The characterization of LGAD performance has so far primarily been focused on the interaction of minimum ionizing particles for high energy and nuclear physics applications. This article expands the study of LGAD performance to highly-ionizing particles, such as 28-MeV protons, which are relevant for several future scientific applications, e.g. in biology and medical physics, among others. These studies were performed with a beam of 28-MeV protons from a tandem Van de Graaff accelerator at Brookhaven National Laboratory and beta particles from a $^{90}{\\rm Sr}$ source; these were used to characterize the response and the gain of an LGAD as a function of bias voltage and collected charge. The experimental results are also compared to TCAD simulations.",
    "authors": [
      "Mohamed Hijas Mohamed Farook",
      "Gabriele Giacomini",
      "Gabriele DAmen",
      "Giovanni Pinaroli",
      "Enrico Rossi",
      "Sally Seidel",
      "Alessandro Tricoli"
    ],
    "published": "2025-03-11T00:47:10Z",
    "updated": "2025-09-10T18:37:55Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex",
      "physics.app-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.08810v1",
    "url": "https://arxiv.org/abs/2509.08810v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08810v1.pdf",
    "title": "Euclid: Methodology for derivation of IPC-corrected conversion gain of   nonlinear CMOS APS",
    "abstract": "We introduce a fast method to measure the conversion gain in Complementary Metal-Oxide-Semiconductors (CMOS) Active Pixel Sensors (APS), which accounts for nonlinearity and interpixel capacitance (IPC). The standard 'mean-variance' method is biased because it assumes pixel values depend linearly on signal, and existing methods to correct for nonlinearity are still introducing significant biases. While current IPC correction methods are prohibitively slow for a per-pixel application, our new method uses separate measurements of the IPC kernel to make an almost instantaneous calculation of gain. Validated using test data from a flight detector from the ESA Euclid mission, the IPC correction recovers the results of slower methods within 0.1% accuracy. Meanwhile the nonlinearity correction ensures an estimation of the gain that is independent of signal, correcting a bias of more than 2.5% on gain estimation.",
    "authors": [
      "J. Le Graet",
      "A. Secroun",
      "M. Tourneur-Silvain",
      "W. Gillard",
      "N. Fourmanoit",
      "S. Escoffier",
      "E. Kajfasz",
      "S. Kermiche",
      "B. Kubik",
      "J. Zoubian",
      "S. Andreon",
      "M. Baldi",
      "S. Bardelli",
      "P. Battaglia",
      "D. Bonino",
      "E. Branchini",
      "M. Brescia",
      "J. Brinchmann",
      "A. Caillat",
      "S. Camera",
      "V. Capobianco",
      "C. Carbone",
      "J. Carretero",
      "S. Casas",
      "M. Castellano",
      "G. Castignani",
      "S. Cavuoti",
      "A. Cimatti",
      "C. Colodro-Conde",
      "G. Congedo",
      "C. J. Conselice",
      "L. Conversi",
      "Y. Copin",
      "F. Courbin",
      "H. M. Courtois",
      "A. Da Silva",
      "J. Dinis",
      "M. Douspis",
      "F. Dubath",
      "C. A. J. Duncan",
      "X. Dupac",
      "S. Dusini",
      "A. Ealet",
      "M. Farina",
      "S. Farrens",
      "F. Faustini",
      "S. Ferriol",
      "M. Frailis",
      "E. Franceschi",
      "S. Galeotta",
      "B. Gillis",
      "C. Giocoli",
      "F. Grupp",
      "S. V. H. Haugan",
      "W. Holmes",
      "F. Hormuth",
      "A. Hornstrup",
      "P. Hudelot",
      "K. Jahnke",
      "M. Jhabvala",
      "A. Kiessling",
      "M. Kilbinger",
      "R. Kohley",
      "H. Kurki-Suonio",
      "P. B. Lilje",
      "V. Lindholm",
      "I. Lloro",
      "G. Mainetti",
      "D. Maino",
      "E. Maiorano",
      "O. Mansutti",
      "O. Marggraf",
      "K. Markovic",
      "N. Martinet",
      "F. Marulli",
      "R. Massey",
      "E. Medinaceli",
      "S. Mei",
      "M. Meneghetti",
      "G. Meylan",
      "M. Moresco",
      "L. Moscardini",
      "S. -M. Niemi",
      "J. W. Nightingale",
      "C. Padilla",
      "S. Paltani",
      "F. Pasian",
      "K. Pedersen",
      "V. Pettorino",
      "S. Pires",
      "G. Polenta",
      "M. Poncet",
      "L. A. Popa",
      "F. Raison",
      "A. Renzi",
      "J. Rhodes",
      "G. Riccio",
      "E. Romelli",
      "M. Roncarelli",
      "E. Rossetti",
      "R. Saglia",
      "D. Sapone",
      "B. Sartoris",
      "J. A. Schewtschenko",
      "M. Schirmer",
      "G. Seidel",
      "M. Seiffert",
      "C. Sirignano",
      "G. Sirri",
      "L. Stanco",
      "J. Steinwagner",
      "P. Tallada-Crespí",
      "D. Tavagnacco",
      "A. N. Taylor",
      "H. I. Teplitz",
      "I. Tereno",
      "R. Toledo-Moreo",
      "F. Torradeflot",
      "I. Tutusaus",
      "L. Valenziano",
      "T. Vassallo",
      "A. Veropalumbo",
      "Y. Wang",
      "J. Weller"
    ],
    "published": "2025-09-10T17:42:51Z",
    "updated": "2025-09-10T17:42:51Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2501.17382v4",
    "url": "https://arxiv.org/abs/2501.17382v4",
    "pdf_url": "https://arxiv.org/pdf/2501.17382v4.pdf",
    "title": "The nonmodal kinetic theory of the macroscale convective flows of   magnetized plasma, generated by the inhomogeneous microturbulenc",
    "abstract": "In this paper, we present the nonmodal kinetic theory of the macroscale two-dimensional compressed-sheared non-diffusive convective flows of a magnetized plasma generated by the inhomogeneous microturbulence. This theory bases on the two-scales approach to the solution of the Vlasov-Poisson system of equations for magnetized plasma, in which the self-consistent evolution of the plasma and of the electrostatic field on the microscales, commensurable with the wavelength of the microscale instabilities and of the ion gyroradius, as well as on the macroscales of a bulk of plasma, is accounted for. It includes the theory of the formation of the macroscale spatially inhomogeneous compressed-sheared convective flows by the inhomogeneous microturbulence, the theory of the back reaction of the macroscale convected flows on the microturbulence, and of the slow macroscale responce of a bulk of plasma on the development of the compressed-sheared convective flows.",
    "authors": [
      "V. V. Mikhailenko",
      "V. S. Mikhailenko",
      "Hae June Lee"
    ],
    "published": "2025-01-29T02:29:31Z",
    "updated": "2025-09-10T17:18:09Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.09736v1",
    "url": "https://arxiv.org/abs/2509.09736v1",
    "pdf_url": "https://arxiv.org/pdf/2509.09736v1.pdf",
    "title": "A data-driven method to estimate contamination from light ion beam   transmutation at colliders",
    "abstract": "Collisions of relativistic light ions such as oxygen, neon, and magnesium, have been proposed as way to examine the system-size dependence of dynamics typically associated with the quark-gluon plasma produced in collisions of heavier ions such as xenon, gold, or lead. Recent efforts at both the Relativistic Heavy Ion Collider and Large Hadron Collider have produced large datasets of proton-oxygen, oxygen-oxygen, and neon-neon collisions, catalyzing intense interest in experimental backgrounds associated with light ion collisions. In particular, electromagnetic dissociation of light ions while they are circulating in a collider can result in beam contamination that is difficult to simulate precisely. Here we propose a data-driven method for evaluating the potential impact of beam contaminants on physics analyses. The method exploits the time-dependence and smaller size of contaminant ion species to define control regions that can be used to quantify potential contamination effects. A simple model is used to illustrate the method and to study its robustness. This method can inform studies of recent LHC and RHIC data and could also be useful for future light ion programs at the LHC and beyond.",
    "authors": [
      "Sruthy Jyothi Das",
      "Austin Baty"
    ],
    "published": "2025-09-10T17:02:35Z",
    "updated": "2025-09-10T17:02:35Z",
    "categories": [
      "physics.acc-ph",
      "nucl-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2504.21820v2",
    "url": "https://arxiv.org/abs/2504.21820v2",
    "pdf_url": "https://arxiv.org/pdf/2504.21820v2.pdf",
    "title": "Two lock-in amplifiers based $3ω$ technique: a practical guide for   thermal conductivity experiments in bulk samples",
    "abstract": "The accurate determination of thermal conductivity $\\kappa(T)$ in bulk materials at room temperature and above is crucial for evaluating their compatibility for specific applications. The 3$\\omega$ technique is an established methodology for studying the thermal conductivity of thin films, becoming particularly suitable in the case of bulk specimens for $T\\gtrsim$300K, where standard stationary techniques require significant corrections for radiative losses. Although this method has been employed in several works, it remains not widely adopted because its implementation demands considerable sophistication, including experiment design, thin film deposition techniques, and choices of the geometry of the current/heat transducer, electronics, and analytical treatment of the signals. Based on a critical review of the technique's key technical aspects, this work provides practical support for a rapid and user-friendly implementation, from the design phase through to execution and analysis. We release a Python-based graphical user interface that supports a quantitative estimation of the investigated temperature profiles based on the geometrical parameters (width/length) of the deposited transducer (heater/thermometer metal line) before an experiment, guaranteeing an optimal design of the experimental conditions for each given material under scrutiny.",
    "authors": [
      "Alexandre Henriques",
      "Murilo Santoma",
      "Steffen Wirth",
      "Julio Larrea Jiménez",
      "Valentina Martelli"
    ],
    "published": "2025-04-30T17:24:55Z",
    "updated": "2025-09-10T16:03:38Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2509.08695v1",
    "url": "https://arxiv.org/abs/2509.08695v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08695v1.pdf",
    "title": "Above and beyond the laser induced anti Stokes broadband white light   emission in rare earth manganese perovskites",
    "abstract": "Herein, an experimental and theoretical analysis of broadband laser-induced white light emission (LIWE) in lead-free perovskite under near-infrared excitation is reported. LIWE is a tunable emission influenced by excitation wavelength, power density, pressure, and temperature. The radiance profile presented in this work closely resembles the solar spectral distribution, suggesting potential for solid-state lighting and photovoltaic applications. Based on theoretical modelling, along with photophysical and photoconductivity characterisations, a mathematical description of the LIWE generation is presented. This model describes LIWE as a dynamical process that explains the supralinear dependence of the integrated emission intensity on laser power density, pressure, photophysical kinetics, and photocurrent associated with the emission phenomena under excitation at high laser power densities.",
    "authors": [
      "Talita J. S. Ramos",
      "Agata Musialek",
      "Robert Tomala",
      "Wieslaw Strek"
    ],
    "published": "2025-09-10T15:38:40Z",
    "updated": "2025-09-10T15:38:40Z",
    "categories": [
      "physics.optics",
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2508.13105v2",
    "url": "https://arxiv.org/abs/2508.13105v2",
    "pdf_url": "https://arxiv.org/pdf/2508.13105v2.pdf",
    "title": "Eliminating Tokamak Disruptions with Feedback",
    "abstract": "Many disruptions are caused by resistive wall tearing modes (RWTM). A database of DIII-D locked mode disruptions provides two main disruption criteria, which are shown to be signatures of RWTMs. The first is that the q = 2 rational surface must be sufficiently close the resistive wall surrounding the plasma to interact with it. If active feedback is used, this implies that RWTMs can be prevented from causing major disruptions. This is demonstrated in simulations. The second criterion is that the current profile is sufficiently peaked. This is caused by edge cooling, such as by impurity radiation and turbulence, which suppress edge current and temperature. This implies the disruptions are not caused by neoclassical tearing modes (NTM), because the bootstrap current is also suppressed. The dependence of the critical internal inductance on elongation is given, which suggests that elongation might be used as an actuator to prevent disruptions. At high $\\beta,$ resistive wall modes (RWM) can be stabilized with feedback. Feedback also stabilizes high $\\beta$ RWTMs, as shown in NSTX data and in simulations. These results suggest that RWTM disruptions in ITER might be prevented using the resonant magnetic perturbation (RMP) coils.",
    "authors": [
      "H. R. Strauss"
    ],
    "published": "2025-08-18T17:13:39Z",
    "updated": "2025-09-10T13:28:37Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.08562v1",
    "url": "https://arxiv.org/abs/2509.08562v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08562v1.pdf",
    "title": "Enhanced water Cherenkov detector for soil moisture detection",
    "abstract": "This work evaluates the ability of a water Cherenkov detector to measure thermal neutrons and explores its application to soil-moisture monitoring. We study a NaCl-doped detector and model its response to (i) monochromatic thermal neutrons and (ii) the natural thermal-neutron flux expected from dry soil at the elevation of Bucaramanga, Colombia. The ambient flux is estimated with the ARTI framework, and the detector response is simulated with MEIGA in Geant4. Doping with NaCl introduces additional capture channels on $^{35,37}\\mathrm{Cl}$ and $^{23}\\mathrm{Na}$; in particular, $^{35}\\mathrm{Cl}$ has a thermal-neutron absorption cross section up to two orders of magnitude larger than hydrogen, boosting the capture signal. Our results indicate that water Cherenkov detectors can detect thermal neutrons with practical sensitivity under field conditions, enabling their integration into precision agriculture networks for soil moisture sensing. More broadly, this approach extends the cosmic-ray detection range of Cherenkov detectors using non-toxic, low-cost materials.",
    "authors": [
      "J. Betancourt",
      "C. Sarmiento-Cano",
      "I. Sidelnik",
      "H. Asorey",
      "Y. Domínguez-Ballesteros",
      "L. Miranda-Leuro",
      "Luis A. Núñez"
    ],
    "published": "2025-09-10T13:06:34Z",
    "updated": "2025-09-10T13:06:34Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.HE",
      "astro-ph.IM",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.08525v1",
    "url": "https://arxiv.org/abs/2509.08525v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08525v1.pdf",
    "title": "Optimal Landau-type closure parameters for two-fluid simulations of   plasma turbulence at kinetic scales",
    "abstract": "Two fluid simulations using local Landau-fluid closures derived from linear theory provide an efficient computational framework for plasma modelling, since they bridge the gap between computationally intensive kinetic simulations and fluid descriptions. Their accuracy in representing kinetic effects depends critically on the validity of the linear approximation used in the derivation: the plasma should not be too far from local thermodynamic equilibrium, LTE. However, many of the problems where these models are of particular interest (such as plasma turbulence and instabilities) are in fact quite far from LTE. The question then arises, if kinetic scale processes are still sufficiently well captured outside of the theoretical regime of applicability of the closure. In this paper, we show that two fluid simulations with Landau fluid closures can effectively reproduce the energy spectra obtained with fully kinetic Vlasov simulations, used as references, as long as the local closure parameter is appropriately chosen. Our findings validate the usage of two fluid simulations with Landau-fluid closure as a possible alternative to fully kinetic simulations of turbulence, in cases where being able to simulate extremely large domains is of particular interest.",
    "authors": [
      "Simon Lautenbach",
      "Jeremiah Lübke",
      "Maria Elena Innocenti",
      "Katharina Kormann",
      "Rainer Grauer"
    ],
    "published": "2025-09-10T12:09:21Z",
    "updated": "2025-09-10T12:09:21Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.08474v1",
    "url": "https://arxiv.org/abs/2509.08474v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08474v1.pdf",
    "title": "Restarting the Numerical Flow Iteration through low rank tensor   approximations",
    "abstract": "The numerical flow iteration method has recently been proposed as a memory-slim solution method for the Vlasov-Poisson equation. It stores the temporal evolution of the electric field and reconstructs the solution in each time step by following the characteristics backwards in time and reconstructing the solution from the initial distribution. If the number of time steps gets large, the computational cost of this reconstruction may get prohibitive. Given a representation of the intermediate solution, the time intervals over which the characteristic curves need to be solved backwards in time can be reduced by restarting the numerical flow iteration after certain time intervals. In this paper, we propose an algorithm that reconstructs a low-rank representation of the solution at the restart times using the blackbox approximation. The proposed algorithm reduces the computational complexity compared to the pure numerical flow iteration from quadratic to linear in the number of times step while still keeping its memory complexity. On the other hand, our numerical results demonstrate that the methods preserves the property of the numerical flow iteration of showing much less dissipation of filaments compared to the semi-Lagrangian method.",
    "authors": [
      "Rostislav-Paul Wilhelm",
      "Katharina Kormann"
    ],
    "published": "2025-09-10T10:27:12Z",
    "updated": "2025-09-10T10:27:12Z",
    "categories": [
      "math.NA",
      "cs.NA",
      "physics.plasm-ph"
    ],
    "primary_category": "math.NA"
  },
  {
    "arxiv_id": "2509.08866v1",
    "url": "https://arxiv.org/abs/2509.08866v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08866v1.pdf",
    "title": "Uplink Pre-Compensation for Ground-to-Space Optical Communications Using   Downlink Tomographic Reconstruction",
    "abstract": "Uplink pre-compensation in ground-to-satellite optical links remains a problem, with an appropriate measurement of the wavefront error in the uplink path often not being available. We present a method that uses successive measurements of the readily accessible downlink beam to perform a tomographic reconstruction of the volume of atmosphere common to the downlink beam and the ground-station field-of-view. These measurements are done through the existing downlink wavefront sensor. From here, an estimate of the wavefront error along the uplink path can be obtained. We evaluate this method in simulation over representative atmospheric conditions and find good performance, especially for situations where the satellite point-ahead angle is many times greater than the atmosphere's isoplanatic angle. Compared to pre-compensation directly using the downlink phase, we find that this method estimates the uplink path with a residual mean-square wavefront error that is up to 8.6 times less. The hardware simplicity of this method makes it a promising solution for uplink pre-compensation implementations targeted at optical communications.",
    "authors": [
      "Alex Frost",
      "Nicolas Maron",
      "Shane Walsh",
      "Benjamin Dix-Matthews",
      "Sascha Schediwy",
      "Michael Hart"
    ],
    "published": "2025-09-10T09:11:50Z",
    "updated": "2025-09-10T09:11:50Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.14657v3",
    "url": "https://arxiv.org/abs/2508.14657v3",
    "pdf_url": "https://arxiv.org/pdf/2508.14657v3.pdf",
    "title": "Phase space transport, quasilinear diffusion and locality in phase   velocity",
    "abstract": "In this paper, we address the motion of charged particles subjected to a discrete spectrum of electrostatic waves. We focus on situations when transport dominates, leading to significant variations in particle velocity. Nonetheless, these velocity changes remain finite due to the presence of KAM tori bounding phase space. We analyze the conditions under which transport can be modeled as a diffusion process and evaluate the relevance of the so-called quasilinear value of the diffusion coefficient. We distinguish between traditional quasilinear diffusion, when wave-particle interaction is perturbative, and the so-called chaotic regime of diffusion, when the particle motion looks erratic. In the perturbative regime, we demonstrate both numerically and theoretically that diffusion occurs only when wave-particle interaction is local in phase velocity; that is, when wave contributions from phase velocities far from the particles instantaneous velocities are negligible. Conversely, numerical results indicate that chaotic diffusion can occur even when wave-particle interaction is not local. Furthermore, in regimes when quasilinear diffusion is applicable, we introduce a simple analytical expression for the time evolution of the velocity distribution function, that accounts for phase space boundaries.",
    "authors": [
      "Didier Bénisti"
    ],
    "published": "2025-08-20T12:16:51Z",
    "updated": "2025-09-10T09:11:00Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.08420v1",
    "url": "https://arxiv.org/abs/2509.08420v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08420v1.pdf",
    "title": "Slice Emittance Preservation and Focus Control in a Passive Plasma Lens",
    "abstract": "Strong, symmetrically focusing plasma lenses are promising for accommodating the small beams associated with plasma-based accelerators and collider final foci. However, while focusing with active and passive plasma lenses has been experimentally demonstrated, compatibility with high-brightness beams relevant for applications has not. In this Letter, we show experimentally that passive plasma lenses can preserve free-electron-laser-quality slice emittance while focusing two orders of magnitude more strongly than quadrupole magnets, and that the focal parameters can be controlled.",
    "authors": [
      "J. Björklund Svensson",
      "J. Beinortaitė",
      "L. Boulton",
      "B. Foster",
      "J. M. Garland",
      "P. González Caminal",
      "M. Huck",
      "H. Jones",
      "A. Kanekar",
      "G. Loisch",
      "J. Osterhoff",
      "F. Peña",
      "S. Schröder",
      "M. Thévenet",
      "S. Wesch",
      "M. Wing",
      "J. C. Wood",
      "R. D'Arcy"
    ],
    "published": "2025-09-10T09:06:31Z",
    "updated": "2025-09-10T09:06:31Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.08406v1",
    "url": "https://arxiv.org/abs/2509.08406v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08406v1.pdf",
    "title": "Simplified Analytical Models for Temperature-Dependent Characteristics   of Ultra-Fast Avalanche Detectors",
    "abstract": "Ultra-fast detectors have advanced the time resolution of semiconductor sensors to tens of picoseconds, while avalanche-type detectors, with internal gain, enable the detection of weak signals. In this work, we investigate the temperature dependence of ultra-fast avalanche detectors. Building on semiconductor theory and some empirical formulations, we establish a set of models to characterize key electrical properties and performance metrics such as gain and time resolution, and validate them through dedicated experiments. The results show good agreement between model predictions and experimental data, demonstrating the validity of the proposed models. This approach provides an efficient and physics-based method for rapid detector optimization and design.",
    "authors": [
      "Weiyi Sun",
      "Mengzhao Li",
      "Mei Zhao",
      "Zhijun Liang"
    ],
    "published": "2025-09-10T08:54:10Z",
    "updated": "2025-09-10T08:54:10Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.08321v1",
    "url": "https://arxiv.org/abs/2509.08321v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08321v1.pdf",
    "title": "Cepstral Strain Mapping for Small Pixel-Count Detectors",
    "abstract": "With the decreasing sizes of integrated-circuit components, the semiconductor industry is in growing need of high-throughput strain mapping techniques that offer high precision and spatial resolution, with desired industry goals of 0.01-0.1% and 1 nm respectively. As the fundamental limitation on the measurement precision is set by the Poisson noise, pixel array detectors with high saturation current, high dynamic range and fast readout are ideally suited for this purpose. However, due to the limited pixel count on these detectors, they do not work well with traditional strain mapping algorithms that were optimized to work on datasets with a large pixel count. Here, we evaluate the cepstral transform that was designed to address this problem, with the precision determined by the convergence, collection angles and dose while remaining insensitive to the pixel count. We test the performance of our method on silicon wedges and Si-SiGe multilayers, and using datasets collected at different conditions, we show how the measured strain precision scales as a function of dose, aperture size and sample thickness. Using precession gives a further improvement in precision by about 1.5-2x, whereas energy filtering does not have a significant impact on the cepstral method for device-relevant sample thickness ranges.",
    "authors": [
      "Harikrishnan KP",
      "Dasol Yoon",
      "Yu-Tsun Shao",
      "Zhaslan Baraissov",
      "Luigi Mele",
      "Christoph Mitterbauer",
      "Erik Kieft",
      "Stefano Vespucci",
      "David A. Muller"
    ],
    "published": "2025-09-10T06:56:01Z",
    "updated": "2025-09-10T06:56:01Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mtrl-sci",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.01249v2",
    "url": "https://arxiv.org/abs/2509.01249v2",
    "pdf_url": "https://arxiv.org/pdf/2509.01249v2.pdf",
    "title": "An Innovative Photon-Driven Subcritical Reactor Concept Powered by   Synchrotron Radiation Source",
    "abstract": "This paper introduces the conceptual design of a Photon Driven Reactor (PDR), an innovative subcritical reactor designed for energy generation driven by a synchrotron radiation. The PDR concept overcomes key technological challenges of conventional accelerator-driven systems, particularly the target's structural durability and its thermal management, by employing synchrotron photons directly interacting with fissile material to induce photonuclear reactions. Computational analyses involved criticality and fixed-source simulation using MCNPx and SERPENT Monte Carlo codes, providing robust evaluation of the neutron production, moderation, and multiplication mechanisms. The main focus of this study was to evaluate the system's capability to achieve a positive net energy gain, specifically assessing the thermal power output agains the electrical power absorbed from the grid. Furthermore, the adoption of spent nuclear fuel for the subcritical reactor core loading has been investigated, highlighting the sustainability and environmental benefits of the proposed PDR design. The proposed system is able to exploit a modularity feature. For each large synchrotron, up to fifty beam lines may be operated simultaneously, each delivering photons to an independent subcritical reactor core. With a photon flux on the order of $8.8 \\times 10^{17}$ photons per second in each beamline, the results indicate that each individual reactor can achieve a thermal output up to 8 MW, while requiring about 435-660 kW of electrical input from the grid, thereby demonstrating the feasibility of energy amplification in the PDR.",
    "authors": [
      "Antonio Cammi",
      "Lorenzo Loi",
      "Andrea Missaglia",
      "David Alesini",
      "Hans-Heinrich Braun"
    ],
    "published": "2025-09-01T08:41:41Z",
    "updated": "2025-09-10T06:53:36Z",
    "categories": [
      "physics.acc-ph",
      "physics.app-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2409.19704v2",
    "url": "https://arxiv.org/abs/2409.19704v2",
    "pdf_url": "https://arxiv.org/pdf/2409.19704v2.pdf",
    "title": "Reduced dimensional description of hydromagnetic turbulence capturing   higher order fluid moments",
    "abstract": "In this paper, Chandrasekhar's deductive theory of turbulence is extended to the case of hydrodynamics and hydromagnetics, with higher order fluid moments. We include the contributions from correlation tensors at two different points of space and two different points in time to account for the energy transfer between Fourier modes with different $k$ values. We start with three governing equations using the first three moments of Vlasov equation, which gives us particle, momentum and energy conservation relations, respectively. We obtain the scalar representations of correlation tensors for hydrodynamics as well as hydromagnetics. Finally we pick an example from literature where the energy spectra alone was not capable of explaining the observations reported by the authors.",
    "authors": [
      "Arindam Saikia",
      "Rupak Mukherjee"
    ],
    "published": "2024-09-29T13:38:45Z",
    "updated": "2025-09-10T04:36:10Z",
    "categories": [
      "physics.flu-dyn",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.flu-dyn"
  }
]