{
  "arxiv_id": "2506.09030v3",
  "url": "https://arxiv.org/abs/2506.09030v3",
  "pdf_url": "https://arxiv.org/pdf/2506.09030v3.pdf",
  "title": "Full-scatter vector field analysis of an overmoded and periodically-loaded cylindrical structure for the transportation of THz radiation",
  "abstract": "Highly overmoded and periodically loaded structures, such as the iris-line waveguide, offer an attractive solution for the efficient transportation of diffraction-prone THz pulses over long distances (hundreds of meters). This paper presents the full-scatter field theory that allows us to analytically derive all the spectral (modal) coefficients on the discontuities of the iris line. The spectral analysis uses vector fields, superseding scalar field descriptions, to account for diffraction loss as well as polarization effects and ohmic loss on practical conductive surfaces. An advanced application of Lorentz's reciprocity theory, using a generalized guided-field configuration, is developed to reduce complexity of the mode-matching problem over nonuniform sections. The used technique is quite general and applies to a wide class of structures, as it only assumes a paraxial incidence (i.e. a parabolic wave equation) along the axis of the structure. It removes the traditional assumption of very thin screens, allowing for the study of thicker screens in the high-frequency limit, while formulating the problem efficiently by scattering matrices whose coefficients are found analytically. The theory agrees with and expands previously established techniques, including Vainstein's asymptotic limit and the forward-scatter approximation. The used formulation also facilitates accurate visualization of the transient regime at the entrance of the structure and how it evolves to reach steady state.",
  "authors": [
    "Adham Naji",
    "Pawan Kumar Gupta",
    "Gennady Stupakov"
  ],
  "published": "2025-06-10T17:54:33Z",
  "updated": "2025-12-12T19:52:15Z",
  "categories": [
    "physics.acc-ph",
    "math-ph",
    "physics.app-ph",
    "physics.class-ph",
    "physics.optics"
  ],
  "primary_category": "physics.acc-ph"
}