{
  "arxiv_id": "2512.11631v1",
  "url": "https://arxiv.org/abs/2512.11631v1",
  "pdf_url": "https://arxiv.org/pdf/2512.11631v1.pdf",
  "title": "UK White Paper on Magnetic Reconnection",
  "abstract": "Magnetic reconnection powers explosive releases of magnetic energy, heating and particle acceleration throughout the plasma universe. Knowledge of this universal process is vital to understanding the Heliosphere, as it plays a key role in solar flares, coronal mass ejections, coronal heating, solar wind acceleration, geomagnetic storms, and interactions between the solar wind and planetary magnetospheres. As such, reconnection underpins multiple science objectives of multiple future space missions. The UK plays a leading role in this international field, through a combination of in situ measurements from Earth's magnetosphere and the solar wind, observations of the solar corona and chromosphere, and world-class numerical simulations and theory. This white paper identifies: Nine priority science objectives for reconnection research in the next decade; Recommendations to guide investment in theory, simulations and infrastructure; Mission priorities and required measurements to ensure the UK maintains and improves its world-class credentials in reconnection science.",
  "authors": [
    "Alexander J. B. Russell",
    "James A. McLaughlin",
    "Philippa Browning",
    "Jennifer Carter",
    "Luca Franci",
    "Heli Hietala",
    "Andrew Hillier",
    "Gunnar Hornig",
    "David MacTaggart",
    "Sarah Matthews",
    "James McKevitt",
    "Eric Priest",
    "Jack Reid",
    "Ben Snow",
    "Julia Stawarz",
    "Anthony Yeates",
    "Jeffersson Andres Agudelo Rueda",
    "William Bate",
    "Giulio Del Zanna",
    "Jonathan Eastwood",
    "Lucie Green",
    "Anshu Kumari",
    "Mike Lockwood",
    "Thomas Neukirch",
    "David Pontin",
    "Andy Smith",
    "Maria-Theresia Walach",
    "Peter Wyper"
  ],
  "published": "2025-12-12T15:09:58Z",
  "updated": "2025-12-12T15:09:58Z",
  "categories": [
    "astro-ph.IM",
    "astro-ph.SR",
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.IM"
}