{
  "arxiv_id": "2512.11973v1",
  "url": "https://arxiv.org/abs/2512.11973v1",
  "pdf_url": "https://arxiv.org/pdf/2512.11973v1.pdf",
  "title": "Residual energy in weakly compressible turbulence with a mean guide field",
  "abstract": "The energy distribution is a fundamental property of magnetohydrodynamic (MHD) turbulence. In strongly magnetized turbulence energy imbalances can arise, quantified by the so-called residual energy: $E_r~=~(E_{kin}~ - ~E_{mag})$; $E_{kin}$ and $E_{mag}$ stand for the volume-averaged kinetic and magnetic energy, respectively. Numerical simulations of incompressible turbulence yield $E_r < 0$, which is consistent with Solar wind observations, while in highly compressible turbulence simulations $E_r > $ 0. Differences arise in the cascade of $E_r$ between the two regimes. We explore the properties of $E_r$ in weakly compressible MHD turbulence in the presence of an initially strong (guide) magnetic field. We study the influence of different driving mechanisms and field strengths on the cascade of $E_r$. We run a suite of direct numerical simulations with the PENCIL code. All simulations are maintained through forcing in a quasi-static regime with sonic Mach numbers close to 0.1. We solely change the Alfvén Mach number, or equivalently the plasma beta ($β$) of the simulations. We drive turbulence by either injecting velocity or magnetic fluctuations at large scales and study the power spectra of kinetic, magnetic, density, and $E_r$. Magnetically-driven simulations show locally imbalanced Alfvénic fluctuations and a $\\propto k^{-3/2}$ cascade, consistent with the dynamic alignment theory. Kinetically-driven simulations give rise to a $\\propto k^{-1}$ scaling, consistent with interactions between Alfvén waves scattered by density inhomogeneities -- a hallmark of reflection-driven turbulence. Residual energy is positive with a spectral slope ($α$) depending on $β$ as: for $β= 4.0$, $-2 \\lesssim α\\lesssim -5/3$, for $β= 1.0$, $-5/3 \\lesssim α\\lesssim -3/2$, and for $β= 0.3$, $α\\approx -1$.",
  "authors": [
    "R. Skalidis",
    "A. Tritsis",
    "J. R. Beattie",
    "P. F. Hopkins"
  ],
  "published": "2025-12-12T19:00:13Z",
  "updated": "2025-12-12T19:00:13Z",
  "categories": [
    "astro-ph.SR",
    "physics.flu-dyn",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.SR"
}