{
  "arxiv_id": "2512.13118v1",
  "url": "https://arxiv.org/abs/2512.13118v1",
  "pdf_url": "https://arxiv.org/pdf/2512.13118v1.pdf",
  "title": "Laser Wakefield Acceleration in a Capillary Gas Cell Producing GeV-Scale High-Quality Electron Beams",
  "abstract": "Laser Wakefield Acceleration (LWFA) is a promising approach for producing high-brightness electron beams in the GeV energy range, offering significant potential for compact next-generation accelerator facilities. In this work, we present a computational study of LWFA in a specially designed single-stage capillary gas-cell target aimed at producing high-quality, GeV-class electron beams. The capillary cell includes a short (~2 mm) injection region at the entrance filled with a helium (He) and nitrogen (N2 ) gas mixture. This is followed by a longer (~12 mm) pure He section, which provides the required acceleration length and limits continuous ionization injection, thereby significantly reducing the energy spread of the accelerated beam. Hydrodynamic simulations are performed to optimize the capillary geometry and generate the required two-section gas-pressure profile. The resulting gas-density distributions for various cases are then directly incorporated in Particle-In-Cell (PIC) simulations to study LWFA. In particular, our hydrodynamic simulations demonstrate how tailored density profiles with longitudinal density tapering in the acceleration section can be realized in a capillary gas cell, while the corresponding PIC simulations reveal how these profiles influence the acceleration process and the resulting beam quality. Using a 100 TW-class laser system with parameters relevant to the L2-DUHA laser at the ELI Beamlines Facility, the PIC results demonstrate electron acceleration to mean energies exceeding 1.0 GeV with high-quality beam properties. Self-injected He electrons are also observed, and their impact on the main beam quality is evaluated. The findings of this study provide valuable insights for upcoming LWFA experiments planned within the EuPRAXIA Project at the ELI Beamlines Facility.",
  "authors": [
    "Srimanta Maity",
    "Francesco Massimo",
    "Alex Whitehead",
    "Pavel Sasorov",
    "Alexander Molodozhentsev"
  ],
  "published": "2025-12-15T09:17:39Z",
  "updated": "2025-12-15T09:17:39Z",
  "categories": [
    "physics.acc-ph",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.acc-ph"
}