{
  "arxiv_id": "2512.13339v1",
  "url": "https://arxiv.org/abs/2512.13339v1",
  "pdf_url": "https://arxiv.org/pdf/2512.13339v1.pdf",
  "title": "Influence of Radiation and AC Coupling on Time Performance of Analog Pixels Test Structures in 65 nm CMOS technology",
  "abstract": "Monolithic Active Pixel Sensors (MAPS) in advanced CMOS imaging technologies are key to next-generation tracking systems for high-energy physics, where radiation hardness and precise vertex reconstruction are essential. As part of the ALICE ITS3 R&D program in synergy with the CERN R&D, we evaluated the performance of the Analog Pixel Test Structures (APTS) fabricated in the TPSCo 65 nm CMOS imaging process. The prototypes employ 10 um pitch pixels with a fast operational amplifier-based buffering stage at the output, enabling direct characterization of intrinsic sensor response. Beam tests with minimum ionizing particles assessed the timing and charge collection of DC- and AC-coupled designs, including devices exposed to 10^14 NIEL and 10^15 NIEL non ioninsing energy loss. DC-coupled sensors demonstrated stable performance, maintaining time resolution lower than 70 ps and >99% detection efficiency up to 10^15 NIEL.   AC-coupled sensors demonstrated a wide operational margin, with efficiencies above 99% for clusterization thresholds below 150 electrons. Even though the AC coupling allows higher reverse bias than DC-coupled sensors, the reduced signal amplitude lowers the signal-to-noise ratio, increasing the jitter contribution. At high reverse bias, the AC-coupled sensors achieve time resolutions comparable to the DC-coupled version, demonstrating the viability of both approaches. These results also suggest that combining the low capacitance of DC-coupled designs with the high-bias capability of AC coupling could further enhance time resolution.   These results confirm the suitability of 65 nm MAPS for future collider detectors requiring high radiation tolerance, efficiency, and timing precision.",
  "authors": [
    "Gianluca Aglieri Rinella",
    "Luca Aglietta",
    "Matias Antonelli",
    "Francesco Barile",
    "Franco Benotto",
    "Stefania Maria Beole",
    "Elena Botta",
    "Giuseppe Eugenio Bruno",
    "Domenico Colella",
    "Angelo Colelli",
    "Giacomo Contin",
    "Giuseppe De Robertis",
    "Floarea Dumitrache",
    "Domenico Elia",
    "Chiara Ferrero",
    "Martin Fransen",
    "Alessandro Grelli",
    "Hartmut Hillemanns",
    "Isis Hobus",
    "Alex Kluge",
    "Shyam Kumar",
    "Corentin Lemoine",
    "Francesco Licciulli",
    "Bong-Hwi Lim",
    "Flavio Loddo",
    "Esther Mwetaminwa M Bilo",
    "Magnus Mager",
    "Davide Marras",
    "Paolo Martinengo",
    "Cosimo Pastore",
    "Rajendra Nath Patra",
    "Stefania Perciballi",
    "Francesco Piro",
    "Francesco Prino",
    "Luciano Ramello",
    "Felix Reidt",
    "Roberto Russo",
    "Valerio Sarritzu",
    "Umberto Savino",
    "Serhiy Senyukov",
    "Mario Sitta",
    "Walter Snoeys",
    "Jory Sonneveld",
    "Miljenko Suljic",
    "Triloki Triloki",
    "Haakan Wennlof"
  ],
  "published": "2025-12-15T13:54:30Z",
  "updated": "2025-12-15T13:54:30Z",
  "categories": [
    "physics.ins-det",
    "physics.app-ph"
  ],
  "primary_category": "physics.ins-det"
}