{
  "arxiv_id": "2512.12516v1",
  "url": "https://arxiv.org/abs/2512.12516v1",
  "pdf_url": "https://arxiv.org/pdf/2512.12516v1.pdf",
  "title": "Reconnection-Driven Turbulent Fluctuations in the Magnetically Dominated Collisionless Regime",
  "abstract": "Magnetic reconnection is a fundamental plasma process that converts magnetic energy into bulk flow energy, thermal energy, and nonthermal particle acceleration. Despite its importance, the statistical properties of the turbulent fluctuations generated by collisionless reconnection, which are essential for understanding how this energy conversion proceeds, remain poorly understood. Here, we employ large-scale 3D particle-in-cell simulations to investigate the turbulence characteristics of velocity and magnetic field fluctuations generated by collisionless reconnection in a magnetically dominated plasma. We characterize their statistical properties by computing structure functions along different directions within the reconnection layer. We find that the square root of the second-order velocity structure function follows a power-law scaling with a slope near $\\sim1/3$ at intermediate to large scales, consistent with Kolmogorov-like turbulence, a behavior robust along the inflow, outflow, and guide-field directions. The square root of the second-order magnetic structure function consistently exhibits a steeper slope, in the range $\\sim 0.6 - 0.8$. The presence of a finite guide field does not systematically modify the slope of the velocity fluctuations, while it progressively steepens the scaling of the magnetic fluctuations in the guide-field and inflow directions. We also measure higher-order structure functions, which reveal strong magnetic intermittency along the outflow direction and weaker intermittency in the inflow and guide-field directions. In addition, the local anisotropies of both velocity and magnetic field fluctuations are greater for stronger guide fields. These results provide a first systematic characterization of the multiscale nature of turbulence in collisionless reconnection layers, with important implications for plasma heating and particle acceleration.",
  "authors": [
    "Yue Hu",
    "Luca Comisso",
    "Lorenzo Sironi",
    "Siyao Xu"
  ],
  "published": "2025-12-14T01:57:27Z",
  "updated": "2025-12-14T01:57:27Z",
  "categories": [
    "astro-ph.GA",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.GA"
}