{
  "arxiv_id": "2512.14485v1",
  "url": "https://arxiv.org/abs/2512.14485v1",
  "pdf_url": "https://arxiv.org/pdf/2512.14485v1.pdf",
  "title": "Construction techniques and commissioning of the Three-Backlink Experiment for the LISA mission",
  "abstract": "Designed to detect gravitational waves in the lower-frequency band, the space mission LISA will open a new window to astronomy after its launch in the 2030s. Each LISA spacecraft houses two optical benches that require the exchange of a phase reference between them via an optical connection, called a Backlink. Here we present the construction and commissioning of an ultra-stable quasi-monolithic optical testbed to investigate different Backlink implementations: a direct fiber, a frequency-separated fiber, and a free-beam link, compared in the Three-Backlink Experiment. Dedicated alignment techniques crucial for the construction of these optical benches are presented together with the development of a high-precision beam alignment and measurement tool - a Calibrated Quadrant Photodiode Singleton. An upper limit for the performance of all three investigated Backlink schemes, as determined by initial experiments, can be set at a $15\\text{pm}/\\sqrt{\\text{Hz}}$-equivalent level within the LISA band, spanning 0.1mHz to 1Hz. Our measurements were able to verify the successful construction and commissioning of this very complex interferometer as an interferometric laboratory testbed for LISA. We find no limitations due to the construction on the here reported performance levels. Our results can support the construction of high-precision metrology testbeds for space-based laser interferometry for future gravitational wave or geodesy missions.",
  "authors": [
    "Lea Bischof",
    "Melanie Ast",
    "Jiang Ji Ho-Zhang",
    "Nicole Knust",
    "Daniel Penkert",
    "Daniel Jestrabek",
    "Jens Reiche",
    "Thomas S. Schwarze",
    "Katharina-Sophie Isleif",
    "Oliver Gerberding",
    "Gerhard Heinzel",
    "Stefan Ast",
    "Karsten Danzmann"
  ],
  "published": "2025-12-16T15:16:22Z",
  "updated": "2025-12-16T15:16:22Z",
  "categories": [
    "physics.optics",
    "astro-ph.IM",
    "physics.ins-det"
  ],
  "primary_category": "physics.optics"
}