{
  "arxiv_id": "2512.11328v1",
  "url": "https://arxiv.org/abs/2512.11328v1",
  "pdf_url": "https://arxiv.org/pdf/2512.11328v1.pdf",
  "title": "$T_i/T_e$ Dependence of Core Turbulence and Transport in DIII-D QH-Mode Plasmas",
  "abstract": "This study investigates the effect of the ion-to-electron temperature ratio ($T_i/T_e$) on microturbulence driven transport in Quiescent H-mode (QH-mode) plasmas in the DIII-D tokamak. Utilizing the Gyrokinetic Toroidal Code (GTC) and the QH-mode equilibrium, we perform linear and nonlinear simulations to analyze transport properties and instability dynamics under variations of $T_i$ and $T_e$. Our results demonstrate that decreasing $T_i/T_e$ leads to a relative destabilization of trapped electron modes (TEM) over ion temperature gradient (ITG) modes, with the transition between these regimes dictated by $T_i/T_e$. When the electron temperature is increased at fixed ion temperature, we observe an increase in transport saturation levels. In contrast, decreasing the ion temperature at fixed electron temperature results in more modest transport enhancement. The radial correlation length, which characterizes eddy size, increases with rising $T_e$ and decreases with falling $T_i$, consistent with the observed trends in turbulent transport. Additionally, we examine the impact of impurity addition on turbulence and growth rates, finding that impurity presence does not significantly alter transport quantities compared to the impurity-free case. Finally, investigating helium as an alternative main ion species, we find that helium plasmas exhibit higher linear growth rates but result in lower transport saturation levels than deuterium plasmas, suggesting potential confinement benefits. These findings provide quantitative insights into the temperature ratio dependence in QH-mode plasmas and highlight the role of temperature profiles and zonal flows in influencing plasma confinement.",
  "authors": [
    "Abhishek Tiwari",
    "Kshitish Barada",
    "Jaya Kumar Alageshan",
    "Santanu Banerjee",
    "Tanmay Macwan",
    "Terry L. Rhodes",
    "Sarveshwar Sharma",
    "Zhihong Lin",
    "Animesh Kuley"
  ],
  "published": "2025-12-12T07:01:54Z",
  "updated": "2025-12-12T07:01:54Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}