[
  {
    "arxiv_id": "2512.14598v1",
    "url": "https://arxiv.org/abs/2512.14598v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14598v1.pdf",
    "title": "Hybrid Machine-Learning Particle Identification for the ePIC Proximity-Focusing RICH",
    "abstract": "We present a machine-learning-based particle-identification study for the proximity-focusing Ring Imaging Cherenkov (pfRICH) detector of the ePIC experiment at the Electron-Ion Collider. Operating in the backward region ($-3.5 \\lesssim η\\lesssim -1.5$), the pfRICH is designed to achieve at least $3σ$ separation among pions, kaons, and protons up to $7,\\mathrm{GeV}/c$ for Semi-Inclusive Deep Inelastic Scattering measurements. Using a standalone Geant4 simulation of the pfRICH, we develop a hybrid machine-learning approach that combines convolutional neural-network-based feature extraction with gradient-boosted decision-tree classifiers. This method significantly enhances Cherenkov-ring pattern recognition and improves particle-separation performance, demonstrating the effectiveness of hybrid machine-learning techniques for next-generation Cherenkov detectors at the EIC.",
    "authors": [
      "D. H. Dongwi",
      "C. -J. Naïm",
      "L. Rhode",
      "A. Deshpande"
    ],
    "published": "2025-12-16T17:07:56Z",
    "updated": "2025-12-16T17:07:56Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.14485v1",
    "url": "https://arxiv.org/abs/2512.14485v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14485v1.pdf",
    "title": "Construction techniques and commissioning of the Three-Backlink Experiment for the LISA mission",
    "abstract": "Designed to detect gravitational waves in the lower-frequency band, the space mission LISA will open a new window to astronomy after its launch in the 2030s. Each LISA spacecraft houses two optical benches that require the exchange of a phase reference between them via an optical connection, called a Backlink. Here we present the construction and commissioning of an ultra-stable quasi-monolithic optical testbed to investigate different Backlink implementations: a direct fiber, a frequency-separated fiber, and a free-beam link, compared in the Three-Backlink Experiment. Dedicated alignment techniques crucial for the construction of these optical benches are presented together with the development of a high-precision beam alignment and measurement tool - a Calibrated Quadrant Photodiode Singleton. An upper limit for the performance of all three investigated Backlink schemes, as determined by initial experiments, can be set at a $15\\text{pm}/\\sqrt{\\text{Hz}}$-equivalent level within the LISA band, spanning 0.1mHz to 1Hz. Our measurements were able to verify the successful construction and commissioning of this very complex interferometer as an interferometric laboratory testbed for LISA. We find no limitations due to the construction on the here reported performance levels. Our results can support the construction of high-precision metrology testbeds for space-based laser interferometry for future gravitational wave or geodesy missions.",
    "authors": [
      "Lea Bischof",
      "Melanie Ast",
      "Jiang Ji Ho-Zhang",
      "Nicole Knust",
      "Daniel Penkert",
      "Daniel Jestrabek",
      "Jens Reiche",
      "Thomas S. Schwarze",
      "Katharina-Sophie Isleif",
      "Oliver Gerberding",
      "Gerhard Heinzel",
      "Stefan Ast",
      "Karsten Danzmann"
    ],
    "published": "2025-12-16T15:16:22Z",
    "updated": "2025-12-16T15:16:22Z",
    "categories": [
      "physics.optics",
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2512.14484v1",
    "url": "https://arxiv.org/abs/2512.14484v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14484v1.pdf",
    "title": "Demonstrating sub-picometer non-reciprocity levels in the Three-Backlink Experiment for LISA",
    "abstract": "The current planned space-based gravitational-wave detectors require a bidirectional optical connection, referred to as Backlink, between two adjacent optical benches to provide a mutual phase reference for the local interferometric measurements. However, if the Backlink shows asymmetry between the two propagation directions, the effective optical pathlengths of the counter-propagating beams can introduce a differential phase noise, called non-reciprocity, into the main interferometric measurement that will limit the achievable accuracy in time-delay interferometry (TDI) post-processing. Hence, it is important to understand the properties of the Backlink to ensure that it will not compromise the interferometric detection. The Three-Backlink Experiment (3BL), which consists of an optical test facility with two rotatable benches, was designed under the Laser Interferometer Space Antenna (LISA) framework to study the performance of three Backlink configurations: two fiber-based and one free-beam scheme. In this paper, we report recent experimental results from the 3BL. We describe the commissioning and the subsequent noise mitigation. We achieve a setup noise floor below $1\\text{ pm}\\sqrt{\\text{Hz}}$ across most of the LISA measurement band, and provide an understanding of the current technical limitations. With this low-noise baseline, we measured the performance of the three Backlink implementations under non-rotational conditions. We show that all three Backlinks reach sub-picometer non-reciprocity levels across most of the frequency band, with the remaining part dominated by the mentioned testbed noise. This enabled us to conduct a preliminary study of the Backlink inherent noise, where we emphasized on the backscatter noise intrinsic to a straightforward fiber-based Backlink, as this is the current baseline for LISA.",
    "authors": [
      "Jiang Ji Ho-Zhang",
      "Melanie Ast",
      "Lea Bischof",
      "Michael Born",
      "Daniel Jestrabek",
      "Stefan Ast",
      "Katharina-Sophie Isleif",
      "Oliver Gerberding",
      "Thomas S. Schwarze",
      "Jens Reiche",
      "Gerhard Heinzel",
      "Karsten Danzmann"
    ],
    "published": "2025-12-16T15:16:21Z",
    "updated": "2025-12-16T15:16:21Z",
    "categories": [
      "physics.optics",
      "astro-ph.IM",
      "gr-qc",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2512.14476v1",
    "url": "https://arxiv.org/abs/2512.14476v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14476v1.pdf",
    "title": "Influence of ion motion in a resonantly driven wakefield accelerator",
    "abstract": "Several different schemes for plasma wakefield acceleration using a train of drivers have been pursued, based on the resonant excitation of a plasma wave. Since these schemes rely on the plasma electron wave surviving for many periods, the motion of the plasma ions can have a significant impact on the beam--plasma interaction. In this work, simulations are used to study the impact of this ion motion on the development of the self-modulation of a long beam, directly applicable to recent experiments. It is shown that two related but distinct effects contribute to the suppression of the wakefield excitation: the loss of resonance between the drive beam and the plasma wave it excites, and phase mixing due to transverse wavebreaking. Although only the latter has previously been investigated, we show that the two effects follow the same scaling with ion mass.",
    "authors": [
      "Erwin Walter",
      "John P. Farmer",
      "Marlene Turner",
      "Frank Jenko"
    ],
    "published": "2025-12-16T15:09:30Z",
    "updated": "2025-12-16T15:09:30Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.14261v1",
    "url": "https://arxiv.org/abs/2512.14261v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14261v1.pdf",
    "title": "An LNGS Mobile Neutron Detector (ALMOND): Mapping Ambient Neutron Background of Gran Sasso National Laboratory",
    "abstract": "In deep underground laboratories, environmental neutrons, which are produced at the cavern walls, introduce a source of background to rare event searches. The flux and spectrum of the ambient neutrons vary considerably with time and location. Precise knowledge of this background is necessary to devise shielding and veto mechanisms, thereby improving the sensitivity of the neutron-susceptible underground experiments. ALMOND, currently in operation, is a low-flux mobile neutron spectrometer developed for the LNGS underground laboratory to measure the ambient neutron background of the entire facility. In this paper, an overview of the design, construction and calibration of ALMOND is given. Furthermore, the result of the first underground neutron measurement is shown along with an outlook for future measurements and analyses.",
    "authors": [
      "Melih Solmaz",
      "Klaus Eitel",
      "Alfredo Davide Ferella",
      "Felix Kratzmeier",
      "Francesco Pompa",
      "Kathrin Valerius"
    ],
    "published": "2025-12-16T10:13:43Z",
    "updated": "2025-12-16T10:13:43Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "1512.08282v2",
    "url": "https://arxiv.org/abs/1512.08282v2",
    "pdf_url": "https://arxiv.org/pdf/1512.08282v2.pdf",
    "title": "Positron Bunch Radiation in the System of Tightly Packed Nanotube",
    "abstract": "Radiation emitted by a bunch of positrons channeled in nanotubes at zero emission angle is studied taking into account medium polarization. The formation of radiation is characterized by an energy threshold that depends on the oscillation amplitude of each positron. When the bunch energy reaches the maximum value of the threshold energy, radiation is produced by all positrons in the bunch. The nanotube potential barrier is described using a harmonic model. The spectral line shape of the radiation from the positron bunch, the fundamental radiation frequency, and the number of emitted photons are determined. It is shown that a system of tightly packed carbon nanotubes can generate an intense, quasi-monochromatic, and directed beam of circularly polarized soft X-ray photons with an energy of about $3$~\\SI{}{\\kilo\\electronvolt} (wavelength $4.1$~\\SI{}{\\angstrom}).",
    "authors": [
      "Hayk L. Gevorgyana",
      "Koryun L. Gevorgyan",
      "Lekdar A. Gevorgian"
    ],
    "published": "2015-12-27T21:54:18Z",
    "updated": "2025-12-16T06:38:14Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2501.03334v2",
    "url": "https://arxiv.org/abs/2501.03334v2",
    "pdf_url": "https://arxiv.org/pdf/2501.03334v2.pdf",
    "title": "FEL Gain Enhancement in an Optical Klystron",
    "abstract": "A system comprising two identical helical or planar undulators separated by a gap -- viz., an optical klystron (OK) -- is investigated. A formula for the frequency distribution of spontaneous radiation at zero angle is derived. It is shown that the spontaneous radiation line shape gradually narrows with increasing distance (up to an optimal value) between the undulators due to the constructive interference of the radiation fields formed in each of them, while the number of radiated photons decreases. The free-electron laser (FEL) gain coefficient also gradually increases, since it is proportional to the derivative of the spontaneous radiation line shape. Using the undulator parameters of the SASE XFEL and the bunch parameters of the LCLS, the total gain coefficient in the X-ray range is on the order of 2.5 and, for a different electron energy, reaches approximately 90 in the water window frequency range.",
    "authors": [
      "Anahit H. Shamamian",
      "Hayk L. Gevorgyan",
      "Lekdar A. Gevorgian"
    ],
    "published": "2025-01-06T19:01:45Z",
    "updated": "2025-12-16T06:25:06Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex",
      "physics.app-ph",
      "physics.optics"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.14033v1",
    "url": "https://arxiv.org/abs/2512.14033v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14033v1.pdf",
    "title": "Liquid Handling of the JUNO Experiment",
    "abstract": "The Filling, Overflow, and Circulation (FOC) system is a critical subsystem of the Jiangmen Underground Neutrino Observatory (JUNO), responsible for the safe handling of the Liquid Scintillator (LS) and water throughout the detector's commissioning and operational lifetime. This paper details the design and operation of the FOC system, which accomplished the filling of the world's largest LS detector--taking 45 days for water (6.4*10^4 m^3) and 200 days for LS (2.3*10^4 m^3). Throughout water filling, the liquid level difference between the Central Detector and Water Pool was rigorously maintained within safety limits. During LS filling, level control achieved +/-2 cm precision with flow regulation within +/-0.5% of setpoints. An automated control system based on Programmable Logic Controllers and the Experimental Physics and Industrial Control System framework ensured reliable operation. The system preserved LS radiopurity, maintaining 222Rn below 1 mBq/m^3 during filling and achieving 238U/232Th concentrations below 10^-16 g/g. The successful commissioning and operation of the FOC system have established it as an indispensable foundation for the stable long-term operation of the JUNO detector.",
    "authors": [
      "Jiajun Li",
      "Yuekun Heng",
      "Jiajie Ling",
      "Zhi Wu",
      "Xiao Tang",
      "Cong Guo",
      "Jinchang Liu",
      "Xiaolan Luo",
      "Xiao Cai",
      "Chengfeng Yang",
      "Xiaoyan Ma",
      "Xiaohui Qian",
      "Tao Huang",
      "Bi Wu",
      "Pengfei Yang",
      "Lei Yang",
      "Mei Ye",
      "Shenghui Liu"
    ],
    "published": "2025-12-16T02:57:17Z",
    "updated": "2025-12-16T02:57:17Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.13958v1",
    "url": "https://arxiv.org/abs/2512.13958v1",
    "pdf_url": "https://arxiv.org/pdf/2512.13958v1.pdf",
    "title": "Radiative Spin Polarization in High Energy Storage Rings",
    "abstract": "The usual theoretical model for synchrotron radiation in circular accelerators (synchrotrons and storage rings) is to treat a single electron moving in a horizontal circle in a uniform vertical magnetic field, but the true situation in real storage rings is more complicated and exhibits much richer physics. The magnetic fields are inhomogeneous, and there is a bunch of many particles and they traverse a distribution of orbits (hence they encounter different magnetic fields). This results in so-called ``depolarizing spin resonances'' (which do not appear in a simple model of a uniform vertical magnetic field). The calculation of the equilibrium electron spin polarization requires a much more careful analysis. For example, a key insight is that, for motion in inhomogeneous magnetic fields, ``spin flip'' is in general \\emph{not} a $180^\\circ$ reversal of the spin orientation. The physics of radiative spin polarization involves a mix of many disciplines, and provides a good example of cross-disciplinary thinking. We shall also briefly note the connection to astrophysics. The astrophysics literature mainly treats electron motion in very strong magnetic fields, stronger than the Schwinger critical field (for example a neutron star). It is a problem of ongoing interest in astrophysics to study the radiation by electrons circulating in such strong magnetic fields. This article aims to provide the reader with a survey of the basic physics principles of radiative spin polarization, omitting low-level mathematical algebra as much as possible. Such details can be found in the literature, and are not relevant here.",
    "authors": [
      "S. R. Mane"
    ],
    "published": "2025-12-15T23:30:41Z",
    "updated": "2025-12-15T23:30:41Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.13885v1",
    "url": "https://arxiv.org/abs/2512.13885v1",
    "pdf_url": "https://arxiv.org/pdf/2512.13885v1.pdf",
    "title": "Performance Reconstruction of Eco-Friendly Gas Mixtures for Improved Resistive Plate Chambers at GIF++ Using Geant4",
    "abstract": "A macroscopic reconstruction is developed to infer iRPC performance using Geant4 observables and one experimental anchor. The Geant4 energy deposition is used to estimate the primary ionization yield, while the efficiency turn-on is modeled through an induced-charge description encoded in an effective gain G(E). The absolute scale is fixed by calibrating the standard CMS mixture to its GIF++ efficiency curve and extracting macroscopic Townsend parameters (A,B). The same procedure is propagated to four alternative mixtures, including two HFO and CO2 eco-friendly blends, to reconstruct efficiency curves and working points, enabling detector mixture screening without microscopic transport inputs.",
    "authors": [
      "V. O. Ramirez-Beltran",
      "Cecilia Uribe Estrada",
      "Mauricio Flores Geronimo",
      "François Lagarde"
    ],
    "published": "2025-12-15T20:38:15Z",
    "updated": "2025-12-15T20:38:15Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.22806v2",
    "url": "https://arxiv.org/abs/2510.22806v2",
    "pdf_url": "https://arxiv.org/pdf/2510.22806v2.pdf",
    "title": "Photon-starved imaging through turbulence at the diffraction limit",
    "abstract": "Ground-based imaging systems struggle to achieve diffraction-limited resolution when atmospheric turbulence and photon scarcity act simultaneously. In this regime, conventional adaptive optics, speckle imaging, and blind deconvolution lack sufficient information diversity to reliably estimate either the scene or the turbulence. We present Turbulence Aware Poisson Blind Deconvolution (TAP-BD), a framework designed for robust image recovery in these extreme conditions. TAP-BD extracts more information from coded-detection through phase diversity and decodes it with a physics-informed optimization that incorporates low photon Poisson statistics. Experiments show that TAP-BD provides reliable reconstructions of both scene and turbulence using only a few tens of measurements, even under strong aberrations and photon-starved conditions where existing methods fail. This capability enables photon-efficient, turbulence resilient imaging for applications such as space situational awareness and long-range remote sensing.",
    "authors": [
      "Seungman Choi",
      "Peter Menart",
      "Andrew Schramka",
      "Shubhankar Jape",
      "Leif Bauer",
      "In-Yong Park",
      "Zubin Jacob"
    ],
    "published": "2025-10-26T19:36:28Z",
    "updated": "2025-12-15T18:30:55Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2512.13432v1",
    "url": "https://arxiv.org/abs/2512.13432v1",
    "pdf_url": "https://arxiv.org/pdf/2512.13432v1.pdf",
    "title": "Fast label-free point-scanning super-resolution imaging for endoscopy",
    "abstract": "Optical endoscopy plays a crucial role in minimally invasive medical diagnostics and therapeutic procedures. Nonetheless, state-of-the-art endoscopic zoom objectives are bulky, requiring multi-element lens actuation, which can limit continued miniaturization. Point-scanning super-resolution approaches improve spatial resolution by illuminating the scene with a reduced-width focused spot, yet mechanical scanning requirements limit applicability in clinical settings. Here, we experimentally demonstrate a Fast label-free point-scanning super-resolution (Flaps) microscopy system, which exploits a multi-level phase-only diffractive optical element (DOE) to generate super-resolution spot(s) and uses a high-speed digital micromirror device (DMD) to deliver the illumination without mechanical scanning. Two imaging architectures are explored: a single super-resolution spot (0.47 Airy spot) or a 5 times 5 super-resolution spot array (0.52 Airy spot) in the far-field; the DMD scans the spot or spot array in the object plane at kHz rates. To demonstrate super-resolution imaging with high-speed acquisition using optical elements suitable for future deployment in endoscopy, we image a label-free resolution test target and fluorescently labelled cells.",
    "authors": [
      "Ning Xu",
      "Calum Williams",
      "Graham Spicer",
      "Qixia Wang",
      "Qiaofeng Tan",
      "Sarah E. Bohndiek"
    ],
    "published": "2025-12-15T15:20:14Z",
    "updated": "2025-12-15T15:20:14Z",
    "categories": [
      "physics.optics",
      "physics.ins-det",
      "physics.med-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2512.13394v1",
    "url": "https://arxiv.org/abs/2512.13394v1",
    "pdf_url": "https://arxiv.org/pdf/2512.13394v1.pdf",
    "title": "The Maximum Particle Energy Gain During Magnetic Reconnection",
    "abstract": "The factors that control the maximum energy attained by protons and electrons during magnetic reconnection are investigated analytically and using large-scale simulations with the \\textit{kglobal} model. Previous work revealed that a strong ambient guide field strongly impacts particle energy gain during reconnection, suppressing energy gain from Fermi reflection by increasing the radius of curvature of reconnected field lines. However, previous simulations have also shown that the maximum energy gain increases with the system size. The physical basis for this result has not been explored. We perform simulations that vary the effective system size over a large range to isolate the processes determining the maximum energy gain. The maximum energy $W_{max}$ is regulated by the number of magnetic-island mergers that occur, as multiple flux ropes that form at early time repeatedly merge until the largest approaches the system scale. Fermi reflection in these repeated mergers dominates particle energy gain. The number of mergers is linked to the effective system size -- larger systems produce a larger number of flux ropes and more mergers. That $W_{max}$ is linked to the number of flux rope mergers has implications for understanding why particle-in-cell simulations only produce powerlaw distributions of energetic particles with a limited range in energy.",
    "authors": [
      "Zhiyu Yin",
      "Harry Arnold",
      "James F Drake",
      "Marc Swisdak"
    ],
    "published": "2025-12-15T14:48:17Z",
    "updated": "2025-12-15T14:48:17Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2410.21065v2",
    "url": "https://arxiv.org/abs/2410.21065v2",
    "pdf_url": "https://arxiv.org/pdf/2410.21065v2.pdf",
    "title": "Hollow Beam Optical Ponderomotive Trap for Ultracold Neutral Plasma",
    "abstract": "Rapidly oscillating, inhomogeneous electromagnetic field from laser exert a force that repels charged particles from regions of high light intensity. We propose and analyze a flat-bottomed hollow-beam ponderomotive optical trap for an ultracold neutral plasma (UNP), driven by a high-power CO$_2$ laser. Molecular dynamics simulations show that the plasma and Rydberg atoms are effectively trapped within a nearly uniform dark region bounded by repulsive light walls. In contrast to RF traps, flat-bottomed traps yield a small density-weighted mean ponderomotive energy per electron, while the UNP collision frequency is far below the laser frequency, thereby making collisional absorption negligible and does not limit the lifetime of the trap. This approach could enhance antimatter production and storage.",
    "authors": [
      "S. A. Saakyan"
    ],
    "published": "2024-10-28T14:26:05Z",
    "updated": "2025-12-15T14:47:47Z",
    "categories": [
      "physics.plasm-ph",
      "physics.atom-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.00022v2",
    "url": "https://arxiv.org/abs/2508.00022v2",
    "pdf_url": "https://arxiv.org/pdf/2508.00022v2.pdf",
    "title": "A pair polarimeter for multi-GeV $γ$-rays",
    "abstract": "Accessing the polarization of photon allows to understand the mechanisms behind its emission or scattering, revealing much about a peculiar environment or a probed object. For energy above $\\sim$10~MeV, the pair production dominates the photon-matter interaction and the photon polarization is accessible via the azimuthal angle of the conversion. Unfortunately pair polarimeters have a low figure-of-merit for multi-GeV photons and are mostly used for beam characterization. In this paper, we report a new concept of a compact pair polarimeter associating monolithic active pixel sensors to low-density extended solid converters to reach simultaneously a high efficiency of $\\sim$7\\% and intrinsic analyzing power ranging from 0.2 to 0.5. This new concept will add a new obersvable to the multi-messenger physics, isolate the intrinsic strong force in nucleons and possibly reveal violations of Lorentz invariance.",
    "authors": [
      "Maxime Defurne",
      "Arthur Muhulet"
    ],
    "published": "2025-07-28T19:16:01Z",
    "updated": "2025-12-15T14:22:35Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.13339v1",
    "url": "https://arxiv.org/abs/2512.13339v1",
    "pdf_url": "https://arxiv.org/pdf/2512.13339v1.pdf",
    "title": "Influence of Radiation and AC Coupling on Time Performance of Analog Pixels Test Structures in 65 nm CMOS technology",
    "abstract": "Monolithic Active Pixel Sensors (MAPS) in advanced CMOS imaging technologies are key to next-generation tracking systems for high-energy physics, where radiation hardness and precise vertex reconstruction are essential. As part of the ALICE ITS3 R&D program in synergy with the CERN R&D, we evaluated the performance of the Analog Pixel Test Structures (APTS) fabricated in the TPSCo 65 nm CMOS imaging process. The prototypes employ 10 um pitch pixels with a fast operational amplifier-based buffering stage at the output, enabling direct characterization of intrinsic sensor response. Beam tests with minimum ionizing particles assessed the timing and charge collection of DC- and AC-coupled designs, including devices exposed to 10^14 NIEL and 10^15 NIEL non ioninsing energy loss. DC-coupled sensors demonstrated stable performance, maintaining time resolution lower than 70 ps and >99% detection efficiency up to 10^15 NIEL.   AC-coupled sensors demonstrated a wide operational margin, with efficiencies above 99% for clusterization thresholds below 150 electrons. Even though the AC coupling allows higher reverse bias than DC-coupled sensors, the reduced signal amplitude lowers the signal-to-noise ratio, increasing the jitter contribution. At high reverse bias, the AC-coupled sensors achieve time resolutions comparable to the DC-coupled version, demonstrating the viability of both approaches. These results also suggest that combining the low capacitance of DC-coupled designs with the high-bias capability of AC coupling could further enhance time resolution.   These results confirm the suitability of 65 nm MAPS for future collider detectors requiring high radiation tolerance, efficiency, and timing precision.",
    "authors": [
      "Gianluca Aglieri Rinella",
      "Luca Aglietta",
      "Matias Antonelli",
      "Francesco Barile",
      "Franco Benotto",
      "Stefania Maria Beole",
      "Elena Botta",
      "Giuseppe Eugenio Bruno",
      "Domenico Colella",
      "Angelo Colelli",
      "Giacomo Contin",
      "Giuseppe De Robertis",
      "Floarea Dumitrache",
      "Domenico Elia",
      "Chiara Ferrero",
      "Martin Fransen",
      "Alessandro Grelli",
      "Hartmut Hillemanns",
      "Isis Hobus",
      "Alex Kluge",
      "Shyam Kumar",
      "Corentin Lemoine",
      "Francesco Licciulli",
      "Bong-Hwi Lim",
      "Flavio Loddo",
      "Esther Mwetaminwa M Bilo",
      "Magnus Mager",
      "Davide Marras",
      "Paolo Martinengo",
      "Cosimo Pastore",
      "Rajendra Nath Patra",
      "Stefania Perciballi",
      "Francesco Piro",
      "Francesco Prino",
      "Luciano Ramello",
      "Felix Reidt",
      "Roberto Russo",
      "Valerio Sarritzu",
      "Umberto Savino",
      "Serhiy Senyukov",
      "Mario Sitta",
      "Walter Snoeys",
      "Jory Sonneveld",
      "Miljenko Suljic",
      "Triloki Triloki",
      "Haakan Wennlof"
    ],
    "published": "2025-12-15T13:54:30Z",
    "updated": "2025-12-15T13:54:30Z",
    "categories": [
      "physics.ins-det",
      "physics.app-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.11954v2",
    "url": "https://arxiv.org/abs/2509.11954v2",
    "pdf_url": "https://arxiv.org/pdf/2509.11954v2.pdf",
    "title": "Exploring the performance of SiPM at cryogenic temperature for the sub-meV threshold detector",
    "abstract": "We propose a novel particle detector concept that exploits the breaking of superconducting Cooper pairs, offering a theoretical energy threshold at the sub-meV level. A major challenge for such detectors is the readout of quasiparticles at mK temperatures, where the Cooper pair binding energy is at the sub-meV level, making conventional electronic devices ineffective. Here we demonstrate that silicon photomultipliers (SiPMs) retain full avalanche multiplication capability at environmental temperatures as low as 10 mK. Compared to room temperature operation, the dark count rate decreases by seven orders of magnitude while the gain is reduced by only a factor of 4.44. we present a characterization of several important performance parameters of the SiPM at 10~mK, including breakdown voltage, second divergence voltage, operating voltage range, output waveform characteristics, gain, single-photoelectron resolution, dark count rate, and the correlated noise probability. These results show that SiPMs operating at 10 mK provide sufficient gain and extremely low noise suitable for quasiparticle detection. Based on this finding, we propose a conceptual readout scheme for sub-meV threshold superconducting detectors using PN junction electron multiplication, which holds promise for advancing new searches for neutrino, dark matter, and other rare low-energy processes.",
    "authors": [
      "Aiqin Gao",
      "Hengyu Wang",
      "Xuegang Li",
      "Junhua Wang",
      "Junguang Lv",
      "Guopu Qu",
      "Lei Cao",
      "Xilei Sun",
      "Yiming Guo"
    ],
    "published": "2025-09-15T14:11:54Z",
    "updated": "2025-12-15T12:18:21Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.13184v1",
    "url": "https://arxiv.org/abs/2512.13184v1",
    "pdf_url": "https://arxiv.org/pdf/2512.13184v1.pdf",
    "title": "Charged particle energization by low-amplitude electrostatic waves at cyclotron harmonics",
    "abstract": "The system made by a charged particle interacting with a single electrostatic wave which propagates perpendicularly to the magnetic field, at a frequency larger than the cyclotron one, has been extensively studied in literature due to its implications with ion heating in magnetized plasmas. It is known that a threshold in the electrostatic potential must be exceeded in order for stochastic particle motion and heating to occur. Regardless its amplitude, however, the electrostatic wave induces a periodic oscillation in the particle motion. We show, by analytical and numerical arguments, that this dynamics is non-adiabatic, meaning that the particle does not land back to its initial state when the wave is slowly turned off. This way, particle energization (although, not rigorously heating) occurs even under sub-threshold conditions.",
    "authors": [
      "F. Sattin. L. Martinelli"
    ],
    "published": "2025-12-15T10:49:34Z",
    "updated": "2025-12-15T10:49:34Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.13179v1",
    "url": "https://arxiv.org/abs/2512.13179v1",
    "pdf_url": "https://arxiv.org/pdf/2512.13179v1.pdf",
    "title": "A nanopore-gated sub-attoliter silicon nanocavity for single-molecule trapping and analysis",
    "abstract": "Biomolecules exhibit dynamic conformations critical to their functions, yet observing these processes at the single-molecule level under native conditions remains a formidable challenge. While surface immobilization has been widely used to extend observation times, it could disrupt molecular dynamics and impede biological function. Moreover, the study of weak molecular interactions requires high local concentrations, often leading to problems with signal saturation in fluorescence-based approaches. Recent advancements in single-molecule trapping techniques have addressed some limitations, but achieving precise, controllable, long-term trapping in a molecularly crowded environment without external forces remains difficult. Here, we introduce a nanopore-gated sub-attoliter silicon nanocavity that enables precise, non-perturbative trapping of individual biomolecules for extended observation times, eliminating the need for external forces. Using nucleosomes as model systems, we demonstrate single-molecule Förster resonance energy transfer (smFRET) to monitor relative distances. Our data also show that an applied electric field can modulate the conformational properties of macromolecules, emphasizing a key advantage of our device: it does not require an electric field to retain trapped molecules. We envision this nanocavity platform as a powerful tool for interrogating molecular dynamics in physiologically relevant environments, offering unperturbed access to weak and transient interactions that are central to biological regulation.",
    "authors": [
      "Funing Liu",
      "Qitao Hu",
      "Anton Sabantsev",
      "Giovanni Di Muccio",
      "Shuangshuang Zeng",
      "Mauro Chinappi",
      "Sebastian Deindl",
      "Zhen Zhang"
    ],
    "published": "2025-12-15T10:38:33Z",
    "updated": "2025-12-15T10:38:33Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.15377v2",
    "url": "https://arxiv.org/abs/2509.15377v2",
    "pdf_url": "https://arxiv.org/pdf/2509.15377v2.pdf",
    "title": "Accelerating Garfield++ with CUDA",
    "abstract": "Garfield++ is extensively used within the gaseous detector community for comprehensive detector simulations, supporting the full experimental life cycle from design to operation and calibration. The emergence of micro-pattern gaseous detectors has necessitated computationally intensive microscopic avalanche simulations. The acceleration of one of Garfield++'s most demanding algorithms, AvalancheMicroscopic, by porting it to graphics processing units using NVIDIA's CUDA framework is described. The modifications are integrated into the Garfield++ codebase and are accessible to end users with only minor adjustments to their existing code. Benchmark results demonstrate substantial speed-up, especially for high-gain avalanches involving thousands of electrons, thereby enabling more efficient and detailed detector simulations.",
    "authors": [
      "T. Neep",
      "K. Nikolopoulos",
      "M. Slater"
    ],
    "published": "2025-09-18T19:29:31Z",
    "updated": "2025-12-15T10:31:14Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/12/P12019"
  },
  {
    "arxiv_id": "2512.13152v1",
    "url": "https://arxiv.org/abs/2512.13152v1",
    "pdf_url": "https://arxiv.org/pdf/2512.13152v1.pdf",
    "title": "Performance of USTC first batch resistive AC-LGAD sensor",
    "abstract": "In this paper, the design and characterization of AC-LGAD sensors at the University of Science and Technology of China is introduced. The sensors are characterized with an infrared laser Transient Current Technique (TCT) system for evaluating signal response characteristics and spatial resolution. The temporal resolution was quantified with electrons emitted by a Sr-90 radioactive source. The spatial resolution can reach 4 μm and a temporal resolution of 48 ps is achieved",
    "authors": [
      "Han Li",
      "Xiao Yang",
      "Kuo Ma",
      "Hang Yang",
      "Aonan Wang",
      "De Zhang",
      "Tianao Wang",
      "Xiangxuan Zheng",
      "Jiajin Ge",
      "Yusheng Wu",
      "Hao Liang",
      "Yanwen Liu"
    ],
    "published": "2025-12-15T10:02:14Z",
    "updated": "2025-12-15T10:02:14Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.13118v1",
    "url": "https://arxiv.org/abs/2512.13118v1",
    "pdf_url": "https://arxiv.org/pdf/2512.13118v1.pdf",
    "title": "Laser Wakefield Acceleration in a Capillary Gas Cell Producing GeV-Scale High-Quality Electron Beams",
    "abstract": "Laser Wakefield Acceleration (LWFA) is a promising approach for producing high-brightness electron beams in the GeV energy range, offering significant potential for compact next-generation accelerator facilities. In this work, we present a computational study of LWFA in a specially designed single-stage capillary gas-cell target aimed at producing high-quality, GeV-class electron beams. The capillary cell includes a short (~2 mm) injection region at the entrance filled with a helium (He) and nitrogen (N2 ) gas mixture. This is followed by a longer (~12 mm) pure He section, which provides the required acceleration length and limits continuous ionization injection, thereby significantly reducing the energy spread of the accelerated beam. Hydrodynamic simulations are performed to optimize the capillary geometry and generate the required two-section gas-pressure profile. The resulting gas-density distributions for various cases are then directly incorporated in Particle-In-Cell (PIC) simulations to study LWFA. In particular, our hydrodynamic simulations demonstrate how tailored density profiles with longitudinal density tapering in the acceleration section can be realized in a capillary gas cell, while the corresponding PIC simulations reveal how these profiles influence the acceleration process and the resulting beam quality. Using a 100 TW-class laser system with parameters relevant to the L2-DUHA laser at the ELI Beamlines Facility, the PIC results demonstrate electron acceleration to mean energies exceeding 1.0 GeV with high-quality beam properties. Self-injected He electrons are also observed, and their impact on the main beam quality is evaluated. The findings of this study provide valuable insights for upcoming LWFA experiments planned within the EuPRAXIA Project at the ELI Beamlines Facility.",
    "authors": [
      "Srimanta Maity",
      "Francesco Massimo",
      "Alex Whitehead",
      "Pavel Sasorov",
      "Alexander Molodozhentsev"
    ],
    "published": "2025-12-15T09:17:39Z",
    "updated": "2025-12-15T09:17:39Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.03921v2",
    "url": "https://arxiv.org/abs/2511.03921v2",
    "pdf_url": "https://arxiv.org/pdf/2511.03921v2.pdf",
    "title": "Upgrade of Super-Kamiokande with Gadolinium",
    "abstract": "Super-Kamiokande [SK] was upgraded through the addition of gadolinium sulfate to its ultrapure water, initiating the SK-Gd program. This development enables efficient neutron tagging via the large capture cross section of gadolinium, greatly improving the identification of inverse beta decay events, the primary channel for detecting the diffuse supernova neutrino background [DSNB]. The upgrade also enhances sensitivity to galactic and pre-supernova neutrinos, as well as atmospheric neutrino interactions. To realize this capability, extensive work was performed, including the construction and operation of the EGADS demonstrator, the refurbishment of the SK tank, the development of radiopure gadolinium production methods, and the validation of the loading and uniformity of gadolinium in solution. Early SK-Gd operation has demonstrated high neutron-tagging efficiency, reduced backgrounds, and world-leading limits on the DSNB flux. With these advances, SK-Gd now stands at the threshold of discovering the DSNB and opens a wide range of new opportunities in astrophysics and neutrino physics.",
    "authors": [
      "Yusuke Koshio",
      "Masayuki Nakahata",
      "Hiroyuki Sekiya",
      "Mark R. Vagins"
    ],
    "published": "2025-11-05T23:53:04Z",
    "updated": "2025-12-15T07:10:25Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.HE"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.13022v1",
    "url": "https://arxiv.org/abs/2512.13022v1",
    "pdf_url": "https://arxiv.org/pdf/2512.13022v1.pdf",
    "title": "Measurement of Position Resolutions of L-band Cavity Beam Position Monitors",
    "abstract": "Beam position monitors (BPMs) are indispensable components of modern particle accelerators, providing real-time diagnostics to ensure precise beam control, stability, and quality. As accelerators such as the International Linear Collider (ILC) aim for nanometer-scale beam sizes at the interaction point, stringent requirements on position resolution arise. Specifically, the main linac of the ILC demands a BPM resolution better than 5 μm to support stable beam transport and minimize emittance growth. To address this, we have developed an L-band cavity BPM optimized for the beam conditions of the ILC. In this paper, we introduce a prototype of an L-band cavity BPM and its signal processing system, describe the methodology for position resolution measurements, discuss the problems and solutions encountered in the past experiment, and report the projected position resolutions of about 300 nm at best.",
    "authors": [
      "Soohyung Lee",
      "Ho Jun Jeong",
      "JongMo Hwang",
      "GwangUk Park",
      "Siwon Jang",
      "Konstantin Popov",
      "Alexander Aryshev",
      "Toshiyuki Okugi",
      "Eun San Kim"
    ],
    "published": "2025-12-15T06:39:58Z",
    "updated": "2025-12-15T06:39:58Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.12679v1",
    "url": "https://arxiv.org/abs/2512.12679v1",
    "pdf_url": "https://arxiv.org/pdf/2512.12679v1.pdf",
    "title": "HEL1OS -- A Hard X-ray Spectrometer on Board Aditya-L1",
    "abstract": "HEL1OS (High Energy L1 Orbiting X-ray Spectrometer) is one of the remote sensing payloads on board Aditya-L1 mission designed to continuously monitor and measure the time-resolved spectra of solar flares between 8 keV and 150 keV. This broad energy range has been covered by using compound semiconductor detectors: cadmium telluride (CdTe: 8 - 70 keV) and cadmium zinc telluride (CZT: 20 - 150 keV) with geometric areas of 0.5 cm$^2$ and 32 cm$^2$, respectively. A stainless steel collimator provides a field-of-view of 6$^\\circ$ $\\times$ 6$^\\circ$ optimized to limit the off-axis response while keeping the design within the instrument mass constraints. The in-house designed low-noise digital pulse processing-based front-end electronics has achieved a spectral resolution of $\\approx$ 1 keV at 14 keV (CdTe) and $\\approx$ 7 keV at 60 keV (CZT). The instrument is also equipped with processing and power electronics to process the signal, drive the electronics, bias the detectors with required low and high voltages for optimal performance of the overall system. In this article, we present design aspects of the instrument, results from the pre-launch ground-based tests, and the in-orbit operations, which have indicated optimal performance in line with that expected.",
    "authors": [
      "Anuj Nandi",
      "Manju Sudhakar",
      "Srikar Paavan Tadepalli",
      "Anand Jain",
      "Brajpal Singh",
      "Reenu Palawat",
      "Ravishankar B. T.",
      "Bhuwan Joshi",
      "Monoj Bug",
      "Anurag Tyagi",
      "Sumit Kumar",
      "Mukund Kumar Thakur",
      "Akanksha Baggan",
      "Srikanth T.",
      "Arjun Dey",
      "Veeresha D. R.",
      "Abhijit Avinash Adoni",
      "Padmanabhan",
      "Vivechana M. S.",
      "Evangelin Leeja Justin",
      "James M. P.",
      "Kinshuk Gupta",
      "Shalini Maiya P. R.",
      "Lakshmi A.",
      "Sajjade Faisal Mustafa",
      "Vivek R. Subramanian",
      "Gayatri Malhotra",
      "Shree Niwas Sahu",
      "Murugiah S.",
      "Medasani Thejasree",
      "Narayan Rao G. S.",
      "T Rethika.",
      "Motamarri Srikanth",
      "Ravi A.",
      "Nashiket Premlal Parate",
      "Nigar Shaji"
    ],
    "published": "2025-12-14T13:16:39Z",
    "updated": "2025-12-14T13:16:39Z",
    "categories": [
      "astro-ph.SR",
      "astro-ph.HE",
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.SR",
    "doi": "10.1007/s11207-025-02543-8"
  },
  {
    "arxiv_id": "2512.06651v3",
    "url": "https://arxiv.org/abs/2512.06651v3",
    "pdf_url": "https://arxiv.org/pdf/2512.06651v3.pdf",
    "title": "A Capacitor Model of the Helical Deflector: Revisiting Shamaev's Proposal and the Model in the Book",
    "abstract": "An RF helical deflector is a type of electron and ion optics device that applies a time-dependent rotating transverse electric or magnetic field by means of time-dependent RF voltage applied on two opposite conducting helical structures (wires, ribbons or other) to deflect charged particles (a single, bunch or beam) in a circular or spiral path. It is a perspective indirect timing system being concurrent for reaching picosecond time resolution, and have promise being excellent candidate for high precision time-of-flight detection. As a timing system, it converts the temporal structure of an electron beam into a spatial pattern -- particularly, an ellipse in the case of a single-frequency RF voltage and continuous electron pencil beam.   I propose a capacitor model of an RF helical deflector and compare it with the existing model in the Book \\cite{ZhigarevBook, Gevorgian2015}, interpret them and provide understanding of them. Furthermore, I analyze the latter, finding analytical formulas for the applied electric field, ellipse sizes (semi-axes) and rotation angle, lengths of the ellipse line, corresponding to the duration of electron pencil bunches or beams. The present article touches the topics of getting circle on resonance limit and of deflection sensitivity.",
    "authors": [
      "Hayk L. Gevorgyan"
    ],
    "published": "2025-12-07T04:27:08Z",
    "updated": "2025-12-14T09:19:27Z",
    "categories": [
      "physics.acc-ph",
      "physics.app-ph",
      "physics.class-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.12585v1",
    "url": "https://arxiv.org/abs/2512.12585v1",
    "pdf_url": "https://arxiv.org/pdf/2512.12585v1.pdf",
    "title": "What are Switchbacks?",
    "abstract": "We present a solitary Alfvén wave model that exhibits nontrivial three-dimensional twisting of open magnetic field lines while preserving constant $|B|$. Embedded rotational discontinuities sharply deflect the otherwise uniform field lines, producing localized, large-amplitude field reversals in one-dimensional profiles that closely resemble the ``switchbacks'' observed by the Parker Solar Probe in the inner heliosphere. This indicates that switchbacks, as seen in one-dimensional spacecraft time series, arise from traversals through strongly curved segments of open magnetic field lines.",
    "authors": [
      "Zesen Huang",
      "Marco Velli",
      "Yuliang Ding"
    ],
    "published": "2025-12-14T07:39:01Z",
    "updated": "2025-12-14T07:39:01Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.HE",
      "astro-ph.SR",
      "physics.flu-dyn",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2506.05727v6",
    "url": "https://arxiv.org/abs/2506.05727v6",
    "pdf_url": "https://arxiv.org/pdf/2506.05727v6.pdf",
    "title": "Bennett Vorticity: A family of nonlinear Shear-Flow Stabilized Z-pinch equilibria",
    "abstract": "The Bennett profile is a classic form for the plasma number density of an equilibrium Z-pinch that has been studied for almost a century by plasma physicists interested in nonlinear plasma pinch science, and fusion energy. By transferring the nonlinearity entirely from the number density to the plasma flow velocity the current density of the resulting flowing Z-pinch equilibrium remains unchanged whilst now being defined by a vortical flow which previously did not exist in the classic case. Due to the positive-definite structure of the nonlinearity's first derivative, in the ideal limit this equilibrium conforms globally to the validity criterion for a shear-flow stabilized Z-pinch when the form of the temperature profile satisfies certain constraints. An analytic equilibrium can be found for the case $T = \\frac{T_{p}}{r_{p}^{3}}r^{3}$, and is investigated. The predictions are found to be in good agreement where they should with the observations from the Zap, and Zap-HD DD fusion devices, including a very accurate prediction of the shear, and an axial profile that can be seen developing at multiple instances. The minimum pinch length necessary for this cubic vortex equilibrium to form an SFS state can be arbitrarily small arbitrarily close to the pinch.",
    "authors": [
      "Matt Russell"
    ],
    "published": "2025-06-06T04:20:38Z",
    "updated": "2025-12-14T07:32:49Z",
    "categories": [
      "physics.plasm-ph",
      "nlin.SI"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.12516v1",
    "url": "https://arxiv.org/abs/2512.12516v1",
    "pdf_url": "https://arxiv.org/pdf/2512.12516v1.pdf",
    "title": "Reconnection-Driven Turbulent Fluctuations in the Magnetically Dominated Collisionless Regime",
    "abstract": "Magnetic reconnection is a fundamental plasma process that converts magnetic energy into bulk flow energy, thermal energy, and nonthermal particle acceleration. Despite its importance, the statistical properties of the turbulent fluctuations generated by collisionless reconnection, which are essential for understanding how this energy conversion proceeds, remain poorly understood. Here, we employ large-scale 3D particle-in-cell simulations to investigate the turbulence characteristics of velocity and magnetic field fluctuations generated by collisionless reconnection in a magnetically dominated plasma. We characterize their statistical properties by computing structure functions along different directions within the reconnection layer. We find that the square root of the second-order velocity structure function follows a power-law scaling with a slope near $\\sim1/3$ at intermediate to large scales, consistent with Kolmogorov-like turbulence, a behavior robust along the inflow, outflow, and guide-field directions. The square root of the second-order magnetic structure function consistently exhibits a steeper slope, in the range $\\sim 0.6 - 0.8$. The presence of a finite guide field does not systematically modify the slope of the velocity fluctuations, while it progressively steepens the scaling of the magnetic fluctuations in the guide-field and inflow directions. We also measure higher-order structure functions, which reveal strong magnetic intermittency along the outflow direction and weaker intermittency in the inflow and guide-field directions. In addition, the local anisotropies of both velocity and magnetic field fluctuations are greater for stronger guide fields. These results provide a first systematic characterization of the multiscale nature of turbulence in collisionless reconnection layers, with important implications for plasma heating and particle acceleration.",
    "authors": [
      "Yue Hu",
      "Luca Comisso",
      "Lorenzo Sironi",
      "Siyao Xu"
    ],
    "published": "2025-12-14T01:57:27Z",
    "updated": "2025-12-14T01:57:27Z",
    "categories": [
      "astro-ph.GA",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.GA"
  },
  {
    "arxiv_id": "2512.12484v1",
    "url": "https://arxiv.org/abs/2512.12484v1",
    "pdf_url": "https://arxiv.org/pdf/2512.12484v1.pdf",
    "title": "Updated Simulation of GRETA Detector Response and Exploration of Temperature Sensitivity",
    "abstract": "The Gamma-Ray Energy Tracking Array (GRETA) is a next-generation gamma-ray spectrometer designed to push the frontiers of nuclear structure and astrophysics experiment. Its high sensitivity is enabled by high-precision localization of gamma-ray interactions within its active detector volume, and the subsequent tracking of gamma-ray scattering sequences. In order to perform gamma-ray tracking, we need to simulate signal generation in the detectors accurately. This requires both accurate calculations of charge movement in the semiconductor volume, as well as a faithful reproduction of real-world experimental effects such as the electronics response. This work addresses the fidelity of the calculated signals for GRETA in two ways. An updated approach has been applied to find an optimized parameterization of the electronics response, while the impact of the detector temperature was also explored to best reproduce experimental signals and improve the position localization performance for GRETA. The results suggest that the electronics response can be simplified without impacting performance, and that the response correction parameters can effectively compensate for the changes in signal which arise due to the crystal temperature, resulting in minimal sensitivity of the position resolution to the assumed temperature.",
    "authors": [
      "Arin Manohar",
      "Mario Cromaz",
      "Christopher Campbell",
      "Heather Crawford",
      "Marco Salathe"
    ],
    "published": "2025-12-13T22:49:55Z",
    "updated": "2025-12-13T22:49:55Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.12421v1",
    "url": "https://arxiv.org/abs/2512.12421v1",
    "pdf_url": "https://arxiv.org/pdf/2512.12421v1.pdf",
    "title": "Rethinking massive multiplexing in whispering gallery mode biosensing",
    "abstract": "Accurate, label-free quantification of multiple analytes in complex biological media remains a major challenge due to limited multiplexing, signal cross-correlations, and inconsistency across sensor samples and measurement runs. We introduce a multiplexed whispering-gallery-mode (WGM) biosensing framework that overcomes these barriers by jointly advancing photonic integration and data analytics. Our glass-chip platform enables massive, parallelized and flexible multiplexing of >10000 microresonators organized into up to 100 sensing channels, with universal and modular chip design and detection hardware, while maintaining loaded Q-factors of 10^6. Our novel hybrid deep-learning framework BioCCF that integrates domain adaptation with cross-channel fusion enables harmonization of responses across sensing chips and extraction of nonlinear correlations in complex mixtures. Using a highly heterogeneous dataset comprising over 200 hours of sensing data acquired from nine chips with different channel configurations, biological replicates, and repeated regeneration cycles, we demonstrate recalibration-free identification of solution (99.3\\% accuracy) and quantification of immunoglobulin G components with relative prediction error of 10^-4 under 5 min. The affordability and modularity of the platform enable distributed data acquisition and aggregation into shared repositories, providing a pathway toward continuously improving model generalization, cross-validation and a scalable, community-driven paradigm for biosensing.",
    "authors": [
      "Ivan Saetchnikov",
      "Elina Tcherniavskaia",
      "Andreas Ostendorf",
      "Anton Saetchnikov"
    ],
    "published": "2025-12-13T18:21:36Z",
    "updated": "2025-12-13T18:21:36Z",
    "categories": [
      "physics.optics",
      "physics.bio-ph",
      "physics.chem-ph",
      "physics.data-an",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2512.12163v1",
    "url": "https://arxiv.org/abs/2512.12163v1",
    "pdf_url": "https://arxiv.org/pdf/2512.12163v1.pdf",
    "title": "Large Errors in Kinetic Temperature Measurements Using Particle Tracking Velocimetry",
    "abstract": "We report on random errors in kinetic temperature measurements due to position uncertainty in particle tracking velocimetry. Using simulated data, we isolate the effects of spatial resolution and the frame rate on particle velocity calculations. A sample of particle velocities is generated from a Maxwellian distribution at a known temperature. Particle positions are assigned randomly and roughened to match a prescribed spatial resolution. Velocities are restored using the two-frame tracking method, and the kinetic temperature is calculated. By repeating this procedure, we obtain the discrepancy as a function of the spatial resolution and frame rate. Results show that, under typical experimental conditions, the restored kinetic temperature can deviate significantly from the true value, with spatial resolution playing a more dominant role than the frame rate.",
    "authors": [
      "Anton Kananovich",
      "Parth Mehrotra",
      "Surabhi Jaiswal"
    ],
    "published": "2025-12-13T04:03:18Z",
    "updated": "2025-12-13T04:03:18Z",
    "categories": [
      "physics.plasm-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.12160v1",
    "url": "https://arxiv.org/abs/2512.12160v1",
    "pdf_url": "https://arxiv.org/pdf/2512.12160v1.pdf",
    "title": "JAX-in-Cell: A Differentiable Particle-in-Cell Code for Plasma Physics Applications",
    "abstract": "JAX-in-Cell is a fully electromagnetic, multispecies, and relativistic 1D3V Particle-in-Cell (PIC) framework implemented entirely in JAX. It provides a modern, Python-based alternative to traditional PIC frameworks. It leverages Just-In-Time compilation and automatic vectorization to achieve the performance of traditional compiled codes on CPUs, GPUs, and TPUs. The resulting framework bridges the gap between educational scripts and production codes, providing a testbed for differentiable physics and AI integration that enables end-to-end gradient-based optimization. The code solves the Vlasov-Maxwell system on a staggered Yee lattice with either periodic, reflective, or absorbing boundary conditions, allowing both an explicit Boris solver and an implicit Crank-Nicolson method via Picard iteration to ensure energy conservation. Here, we detail the numerical methods employed, validate against standard benchmarks, and showcase the use of its auto-differentiation capabilities.",
    "authors": [
      "Longyu Ma",
      "Rogerio Jorge",
      "Hongke Lu",
      "Aaron Tran",
      "Christopher Woolford"
    ],
    "published": "2025-12-13T03:51:00Z",
    "updated": "2025-12-13T03:51:00Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.00119v2",
    "url": "https://arxiv.org/abs/2508.00119v2",
    "pdf_url": "https://arxiv.org/pdf/2508.00119v2.pdf",
    "title": "Probing Proton versus Electron Heating and Energization during Magnetic Reconnection",
    "abstract": "The mechanisms controlling the relative heating and energization of electrons and protons during magnetic reconnection are explored. Simulations are carried out with the kglobal model, which produces bulk heating and the extended powerlaw distributions of both species that have been documented in observations. The simulations have been carried out with a range of proton-to-electron mass ratios and upstream temperatures to isolate the factors that control energy gain. The simulations reveal that when the upstream temperatures of the two species are equal, the proton heating and energization exceeds that of electrons and that this is a consequence of the much larger energy gain of protons on their first entry into the reconnection exhaust. The effective energy gain of protons on exhaust entry scales as $m_iC_A^2$ since the protons counterstream at the Alfvén speed $C_A$ while the initial electron energy gain is smaller by the factor $(β_{e0}m_e/m_i)^{1/2}$. Since Fermi reflection during flux rope merger dominates energy gain in large-scale reconnecting systems and the rate of energy gain is proportional to energy, protons continue to gain energy faster than electrons for the duration of the simulations, leading to temperature increments of protons exceeding that of electrons and the non-thermal energy content of protons also exceeding that of electrons.",
    "authors": [
      "Zhiyu Yin",
      "James F. Drake",
      "Marc Swisdak"
    ],
    "published": "2025-07-31T19:14:47Z",
    "updated": "2025-12-13T03:37:19Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.3847/1538-4357/ae18cd"
  },
  {
    "arxiv_id": "2502.01945v3",
    "url": "https://arxiv.org/abs/2502.01945v3",
    "pdf_url": "https://arxiv.org/pdf/2502.01945v3.pdf",
    "title": "Cryogenic Thermal Modeling of Microwave High Density Signaling",
    "abstract": "Superconducting quantum computers require microwave control lines running from room temperature to the mixing chamber of a dilution refrigerator. Adding more lines without preliminary thermal modeling to make predictions risks overwhelming the cooling power at each thermal stage. In this paper, we investigate the thermal load of SC-086/50-SCN-CN semi-rigid coaxial cable, which is commonly used for the control and readout lines of a superconducting quantum computer, as we increase the number of lines to a quantum processor. We investigate the makeup of the coaxial cables, verify the materials and dimensions, and experimentally measure the total thermal conductivity of a single cable as a function of the temperature from cryogenic to room temperature values. We also measure the cryogenic DC electrical resistance of the inner conductor as a function of temperature, allowing for the calculation of active thermal loads due to Ohmic heating. Fitting this data produces a numerical thermal conductivity function used to calculate the static heat loads due to thermal transfer within the wires resulting from a temperature gradient. The resistivity data is used to calculate active heat loads, and we use these fits in a cryogenic model of a superconducting quantum processor in a typical Bluefors XLD1000-SL dilution refrigerator, investigating how the thermal load increases with processor sizes ranging from 100 to 225 qubits. We conclude that the theoretical upper limit of the described architecture is approximately 200 qubits. However, including an engineering margin in the cooling power and the available space for microwave readout circuitry at the mixing chamber, the practical limit is approximately 140 qubits.",
    "authors": [
      "Naomi Raicu",
      "Tom Hogan",
      "Xian Wu",
      "Mehrnoosh Vahidpour",
      "David Snow",
      "Matthew Hollister",
      "Mark Field"
    ],
    "published": "2025-02-04T02:38:24Z",
    "updated": "2025-12-12T21:30:12Z",
    "categories": [
      "quant-ph",
      "physics.ins-det"
    ],
    "primary_category": "quant-ph",
    "doi": "10.1140/epjqt/s40507-025-00427-1"
  },
  {
    "arxiv_id": "2506.09030v3",
    "url": "https://arxiv.org/abs/2506.09030v3",
    "pdf_url": "https://arxiv.org/pdf/2506.09030v3.pdf",
    "title": "Full-scatter vector field analysis of an overmoded and periodically-loaded cylindrical structure for the transportation of THz radiation",
    "abstract": "Highly overmoded and periodically loaded structures, such as the iris-line waveguide, offer an attractive solution for the efficient transportation of diffraction-prone THz pulses over long distances (hundreds of meters). This paper presents the full-scatter field theory that allows us to analytically derive all the spectral (modal) coefficients on the discontuities of the iris line. The spectral analysis uses vector fields, superseding scalar field descriptions, to account for diffraction loss as well as polarization effects and ohmic loss on practical conductive surfaces. An advanced application of Lorentz's reciprocity theory, using a generalized guided-field configuration, is developed to reduce complexity of the mode-matching problem over nonuniform sections. The used technique is quite general and applies to a wide class of structures, as it only assumes a paraxial incidence (i.e. a parabolic wave equation) along the axis of the structure. It removes the traditional assumption of very thin screens, allowing for the study of thicker screens in the high-frequency limit, while formulating the problem efficiently by scattering matrices whose coefficients are found analytically. The theory agrees with and expands previously established techniques, including Vainstein's asymptotic limit and the forward-scatter approximation. The used formulation also facilitates accurate visualization of the transient regime at the entrance of the structure and how it evolves to reach steady state.",
    "authors": [
      "Adham Naji",
      "Pawan Kumar Gupta",
      "Gennady Stupakov"
    ],
    "published": "2025-06-10T17:54:33Z",
    "updated": "2025-12-12T19:52:15Z",
    "categories": [
      "physics.acc-ph",
      "math-ph",
      "physics.app-ph",
      "physics.class-ph",
      "physics.optics"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.11973v1",
    "url": "https://arxiv.org/abs/2512.11973v1",
    "pdf_url": "https://arxiv.org/pdf/2512.11973v1.pdf",
    "title": "Residual energy in weakly compressible turbulence with a mean guide field",
    "abstract": "The energy distribution is a fundamental property of magnetohydrodynamic (MHD) turbulence. In strongly magnetized turbulence energy imbalances can arise, quantified by the so-called residual energy: $E_r~=~(E_{kin}~ - ~E_{mag})$; $E_{kin}$ and $E_{mag}$ stand for the volume-averaged kinetic and magnetic energy, respectively. Numerical simulations of incompressible turbulence yield $E_r < 0$, which is consistent with Solar wind observations, while in highly compressible turbulence simulations $E_r > $ 0. Differences arise in the cascade of $E_r$ between the two regimes. We explore the properties of $E_r$ in weakly compressible MHD turbulence in the presence of an initially strong (guide) magnetic field. We study the influence of different driving mechanisms and field strengths on the cascade of $E_r$. We run a suite of direct numerical simulations with the PENCIL code. All simulations are maintained through forcing in a quasi-static regime with sonic Mach numbers close to 0.1. We solely change the Alfvén Mach number, or equivalently the plasma beta ($β$) of the simulations. We drive turbulence by either injecting velocity or magnetic fluctuations at large scales and study the power spectra of kinetic, magnetic, density, and $E_r$. Magnetically-driven simulations show locally imbalanced Alfvénic fluctuations and a $\\propto k^{-3/2}$ cascade, consistent with the dynamic alignment theory. Kinetically-driven simulations give rise to a $\\propto k^{-1}$ scaling, consistent with interactions between Alfvén waves scattered by density inhomogeneities -- a hallmark of reflection-driven turbulence. Residual energy is positive with a spectral slope ($α$) depending on $β$ as: for $β= 4.0$, $-2 \\lesssim α\\lesssim -5/3$, for $β= 1.0$, $-5/3 \\lesssim α\\lesssim -3/2$, and for $β= 0.3$, $α\\approx -1$.",
    "authors": [
      "R. Skalidis",
      "A. Tritsis",
      "J. R. Beattie",
      "P. F. Hopkins"
    ],
    "published": "2025-12-12T19:00:13Z",
    "updated": "2025-12-12T19:00:13Z",
    "categories": [
      "astro-ph.SR",
      "physics.flu-dyn",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2512.11768v1",
    "url": "https://arxiv.org/abs/2512.11768v1",
    "pdf_url": "https://arxiv.org/pdf/2512.11768v1.pdf",
    "title": "A low-cost ice melt monitoring system using wind-induced motion of mass-balance stakes",
    "abstract": "Surface ablation measurements of glaciers are critical for understanding mass change over time. Mass-balance stakes are commonly used for localized measurements, with the exposed length typically measured manually at infrequent intervals. This paper presents the design and validation of new instrumentation that automates mass-balance stake readings, thus enabling continuous measurements with high temporal resolution. The instrumentation comprises readout electronics that are mounted on mass-balance stakes to measure wind-induced vibrations. The stake vibrational frequency depends sensitively on the exposed length, and changes in the measured frequency therefore probe glacier surface melt and accumulation. Initial instrumentation field tests conducted at Color Lake on Umingmat Nunaat (Axel Heiberg Island), Nunavut, demonstrate centimeter-level precision on length measurements. The instrumentation can be attached to existing mass-balance stakes and is low-cost (~ $50 USD) in comparison to many other systems that perform automated surface ablation measurements. The accessibility of this instrumentation opens new possibilities for localized, high temporal resolution measurements of glacier surface activity at any locations where mass balance stakes are deployed.",
    "authors": [
      "Felix St-Amour",
      "H. Cynthia Chiang",
      "Jamie Cox",
      "Eamon Egan",
      "Ian Hendricksen",
      "Jonathan Sievers",
      "Laura Thomson"
    ],
    "published": "2025-12-12T18:29:29Z",
    "updated": "2025-12-12T18:29:29Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.20413v2",
    "url": "https://arxiv.org/abs/2507.20413v2",
    "pdf_url": "https://arxiv.org/pdf/2507.20413v2.pdf",
    "title": "Electromagnetic Noise Characterization and Suppression in Low-Field MRI Systems",
    "abstract": "Purpose: Low-field MRI systems operate at single MHz-range frequencies, where signal losses are primarily dominated by thermal noise from the radio-frequency (RF) receive coils. Achieving operation close to this limit is essential for maximizing imaging performance and signal-to-noise ratio (SNR). However, electromagnetic interference (EMI) from cabling, electronics, and patient loading often degrades system performance. Our goal is to develop and validate a practical protocol that guides users in identifying and suppressing electromagnetic noise in low-field MRI systems, enabling operation near the thermal noise limit.   Methods: We present a systematic, stepwise methodology that includes diagnostic measurements, hardware isolation strategies, and good practices for cabling and shielding. Each step is validated with corresponding noise measurements under increasingly complex system configurations, both unloaded and with a human subject present.   Results: Noise levels were monitored through the incremental assembly of a low-field MRI system, revealing key sources of EMI and quantifying their impact. Final configurations achieved noise within 1.5x the theoretical thermal bound with a subject in the scanner. Image reconstructions illustrate the direct relationship between system noise and image quality.   Conclusion: The proposed protocol enables low-field MRI systems to operate close to fundamental noise limits in realistic conditions. The framework also provides actionable guidance for the integration of additional system components, such as gradient drivers and automatic tuning networks, without compromising SNR.",
    "authors": [
      "Teresa Guallart-Naval",
      "José M. Algarín",
      "Joseba Alonso"
    ],
    "published": "2025-07-27T21:13:27Z",
    "updated": "2025-12-12T17:32:19Z",
    "categories": [
      "physics.med-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.med-ph"
  },
  {
    "arxiv_id": "2511.20445v2",
    "url": "https://arxiv.org/abs/2511.20445v2",
    "pdf_url": "https://arxiv.org/pdf/2511.20445v2.pdf",
    "title": "Diffusion for Fusion: Designing Stellarators with Generative AI",
    "abstract": "Stellarators are a prospective class of fusion-based power plants that confine a hot plasma with three-dimensional magnetic fields. Typically framed as a PDE-constrained optimization problem, stellarator design is a time-consuming process that can take hours to solve on a computing cluster. Developing fast methods for designing stellarators is crucial for advancing fusion research. Given the recent development of large datasets of optimized stellarators, machine learning approaches have emerged as a potential candidate. Motivated by this, we present an open inverse problem to the machine learning community: to rapidly generate high-quality stellarator designs which have a set of desirable characteristics. As a case study in the problem space, we train a conditional diffusion model on data from the QUASR database to generate quasisymmetric stellarator designs with desirable characteristics (aspect ratio and mean rotational transform). The diffusion model is applied to design stellarators with characteristics not seen during training. We provide evaluation protocols and show that many of the generated stellarators exhibit solid performance: less than 5% deviation from quasisymmetry and the target characteristics. The modest deviation from quasisymmetry highlights an opportunity to reach the sub 1% target. Beyond the case study, we share multiple promising avenues for generative modeling to advance stellarator design.",
    "authors": [
      "Misha Padidar",
      "Teresa Huang",
      "Andrew Giuliani",
      "Marina Spivak"
    ],
    "published": "2025-11-25T16:17:12Z",
    "updated": "2025-12-12T15:38:08Z",
    "categories": [
      "cs.LG",
      "physics.plasm-ph"
    ],
    "primary_category": "cs.LG"
  },
  {
    "arxiv_id": "2512.11641v1",
    "url": "https://arxiv.org/abs/2512.11641v1",
    "pdf_url": "https://arxiv.org/pdf/2512.11641v1.pdf",
    "title": "Design optimization of hadronic calorimeters for future colliders",
    "abstract": "Calorimeters are a crucial component in modern particle detectors. They are responsible for providing accurate energy measurements of particles produced in high-energy collisions. The demanding requirements set for next-generation collider experiments impose new challenges on the design of new detectors, and a systematic approach to their optimization is increasingly necessary. The performance of calorimeters is primarily characterized by their energy resolution, parameterized by a stochastic and a constant term, related to sampling fluctuations and non-uniformities respectively. To improve the reconstruction quality of physics objects in the calorimeter, both terms need to be taken into account. Changes in a longitudinally constrained design usually result in a trade-off between these terms, making optimization a non-trivial task. This work focuses on the optimization of a hadronic sampling calorimeter, based on the FCC-ee ALLEGRO detector concept. By controlling the absorber layer thickness in a Geant4 simulation, the impact of the passive to active material proportion on the deposited energy distribution and resolution can be analyzed. Our methodology aims at exploring the design space with practical considerations, paving the way for the development of a closed optimization framework that can evaluate multiple designs against physics performance targets.",
    "authors": [
      "Bruno Rodrigues",
      "Inês Ochoa",
      "Agostinho Gomes"
    ],
    "published": "2025-12-12T15:20:42Z",
    "updated": "2025-12-12T15:20:42Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.11631v1",
    "url": "https://arxiv.org/abs/2512.11631v1",
    "pdf_url": "https://arxiv.org/pdf/2512.11631v1.pdf",
    "title": "UK White Paper on Magnetic Reconnection",
    "abstract": "Magnetic reconnection powers explosive releases of magnetic energy, heating and particle acceleration throughout the plasma universe. Knowledge of this universal process is vital to understanding the Heliosphere, as it plays a key role in solar flares, coronal mass ejections, coronal heating, solar wind acceleration, geomagnetic storms, and interactions between the solar wind and planetary magnetospheres. As such, reconnection underpins multiple science objectives of multiple future space missions. The UK plays a leading role in this international field, through a combination of in situ measurements from Earth's magnetosphere and the solar wind, observations of the solar corona and chromosphere, and world-class numerical simulations and theory. This white paper identifies: Nine priority science objectives for reconnection research in the next decade; Recommendations to guide investment in theory, simulations and infrastructure; Mission priorities and required measurements to ensure the UK maintains and improves its world-class credentials in reconnection science.",
    "authors": [
      "Alexander J. B. Russell",
      "James A. McLaughlin",
      "Philippa Browning",
      "Jennifer Carter",
      "Luca Franci",
      "Heli Hietala",
      "Andrew Hillier",
      "Gunnar Hornig",
      "David MacTaggart",
      "Sarah Matthews",
      "James McKevitt",
      "Eric Priest",
      "Jack Reid",
      "Ben Snow",
      "Julia Stawarz",
      "Anthony Yeates",
      "Jeffersson Andres Agudelo Rueda",
      "William Bate",
      "Giulio Del Zanna",
      "Jonathan Eastwood",
      "Lucie Green",
      "Anshu Kumari",
      "Mike Lockwood",
      "Thomas Neukirch",
      "David Pontin",
      "Andy Smith",
      "Maria-Theresia Walach",
      "Peter Wyper"
    ],
    "published": "2025-12-12T15:09:58Z",
    "updated": "2025-12-12T15:09:58Z",
    "categories": [
      "astro-ph.IM",
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2506.18982v3",
    "url": "https://arxiv.org/abs/2506.18982v3",
    "pdf_url": "https://arxiv.org/pdf/2506.18982v3.pdf",
    "title": "First direct search for light dark matter interactions in a transition-edge sensor",
    "abstract": "We propose the use of transition-edge sensor (TES) single-photon detectors as a simultaneous target and sensor for direct dark matter searches, and report results from the first search of this kind. We perform a 489 h science run with a TES device optimized for the detection of 1064 nm photons, with a mass of ~0.2 ng and an energy threshold of ~0.3 eV, and set new limits on dark matter interactions with both electrons and nucleons for dark matter with mass below the MeV scale. With their excellent energy resolution, TESs enable search strategies that are complementary to recent results from superconducting nanowire single-photon detectors and kinetic inductance detectors. We show that next-generation TES arrays hold promise to probe new regions of light dark matter parameter space.",
    "authors": [
      "Christina Schwemmbauer",
      "Guy Daniel Hadas",
      "Yonit Hochberg",
      "Katharina-Sophie Isleif",
      "Friederike Januschek",
      "Benjamin V. Lehmann",
      "Axel Lindner",
      "Adriana E. Lita",
      "Manuel Meyer",
      "Gulden Othman",
      "Elmeri Rivasto",
      "José Alejandro Rubiera Gimeno"
    ],
    "published": "2025-06-23T18:00:03Z",
    "updated": "2025-12-12T15:07:21Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "hep-ph",
      "quant-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.11478v1",
    "url": "https://arxiv.org/abs/2512.11478v1",
    "pdf_url": "https://arxiv.org/pdf/2512.11478v1.pdf",
    "title": "Numerical investigation of kinetic instabilities in BGK equilibria under collisional effects",
    "abstract": "An unstable one-dimensional Bernstein-Greene-Kruskal (BGK) mode has been studied through high-precision numerical simulations. The initial turbulent, periodic equilibrium state is obtained by solving a Vlasov-Poisson system for initially thermalized electrons, with the addition of an external electric field able to trigger undamped, high-amplitude electron acoustic waves (EAWs). Once the external field is turned off, resonant particles are trapped in a stationary two-hole phase-space configuration. This equilibrium scenario is perturbed by some large-scale density noise, leading to an electrostatic instability with the merging of vortices into a final one-hole state. Numerical runs investigate several features of this regime, focusing on the dependence of the instability trigger time and growth rate on the rate of short-range collisions and grid resolution. According to Landau theory for weakly inhomogeneous equilibria, we observe that the growth rate of the instability depends only on the slope of the distribution function in the resonant region. Conversely, the onset time of the instability is affected by the collisional rate, which is able to postpone the onset of the instability. Moreover, by extending the simulations to a long-time scale, we investigate the saturation stage of the instability, which can be analyzed through the Hermite spectral analysis. In collisionless simulations where grid effects are negligible, the Hermite spectrum follows a power law typical of a constant enstrophy flux scenario. Otherwise, if collisional effects become significant, a cutoff is observed at high Hermite modes, leading to a decaying trend.",
    "authors": [
      "Sofia Zanelli",
      "Gabriele Celebre",
      "Sergio Servidio",
      "Francesco Valentini"
    ],
    "published": "2025-12-12T11:23:51Z",
    "updated": "2025-12-12T11:23:51Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.11456v1",
    "url": "https://arxiv.org/abs/2512.11456v1",
    "pdf_url": "https://arxiv.org/pdf/2512.11456v1.pdf",
    "title": "Multichannel SiPM test readout system for gamma-ray measurements with monolithic inorganic CeBr_{3}",
    "abstract": "Energy resolution and the detection efficiency for gamma quanta are fundamental properties in the construction of detectors for ionizing radiation. In this study, a SiPM-based photodetector coupled to a monolithic inorganic CeBr_{3} crystal is exposed to gamma rays in order to study the performance of the CeBr_{3} crystal. Measurements are made using three different radioactive sources - ^{137}Cs, ^{22}Na, and ^{60}Co. For each source, the measurements are conducted at several SiPM bias voltages. Furthermore, two CeBr_{3} crystals with different thicknesses are used in order to study how detector efficiency is affected by crystal dimensions. A preliminary analysis of the data is presented.",
    "authors": [
      "Veronika Asova",
      "Galin Bistrev",
      "Valentin Buchakchiev",
      "Venelin Kozhuharov"
    ],
    "published": "2025-12-12T10:48:38Z",
    "updated": "2025-12-12T10:48:38Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1742-6596/2794/1/012006"
  },
  {
    "arxiv_id": "2512.11365v1",
    "url": "https://arxiv.org/abs/2512.11365v1",
    "pdf_url": "https://arxiv.org/pdf/2512.11365v1.pdf",
    "title": "Temporal Substepping Scheme for Magnetohydrodynamics with Cell-based Adaptive Mesh Refinement on Staggered Grid",
    "abstract": "We present a new algorithm for numerical magnetohydrodynamics on staggered meshes preserving $\\nabla \\cdot B = 0$. Our algorithm is based on the constrained transport method and supports both cell-based adaptive mesh refinement and temporal substepping. We handle resolution changes directly on the logically Cartesian grid without needing interpolation or projection between nested or neighboring grids, nor coupling the solution between refinement levels.",
    "authors": [
      "Ilja Honkonen",
      "Riku Jarvinen",
      "David Phillips"
    ],
    "published": "2025-12-12T08:27:21Z",
    "updated": "2025-12-12T08:27:21Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.IM",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2505.13926v5",
    "url": "https://arxiv.org/abs/2505.13926v5",
    "pdf_url": "https://arxiv.org/pdf/2505.13926v5.pdf",
    "title": "An exploratory study of a tellurium-loaded liquid scintillator based on water and p-dioxane",
    "abstract": "Tellurium-loaded liquid scintillators are critical for neutrinoless double-beta decay experiments. However, conventional organic scintillators are constrained by the limited solubility of organic tellurium compounds compared with that of inorganic ones in water, whereas water-based scintillators are likely constrained by the destabilization of surfactants caused by inorganic tellurium compounds. In this work, a surfactant-free water-containing route is explored, in which an aqueous telluric acid solution is introduced into a water-miscible organic scintillator comprising p-dioxane, naphthalene, and PPO. The phase behavior of this system is mapped to delineate homogeneous-mixture domains and to estimate practical upper bounds on tellurium loading. Optical properties are characterized by UV-visible absorption spectroscopy and fluorescence spectroscopy. The scintillation light yield is obtained with a relative method that compares to a reference LAB-PPO scintillator. The measurements demonstrate scintillation quenching induced by water and by tellurium acid. These results provide benchmarks for water-containing and surfactant-free formulations and support the development of high-loading liquid scintillators for future detector design.",
    "authors": [
      "Ye Liang",
      "Haozhe Sun",
      "Zhe Wang"
    ],
    "published": "2025-05-20T04:42:24Z",
    "updated": "2025-12-12T08:03:19Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.11328v1",
    "url": "https://arxiv.org/abs/2512.11328v1",
    "pdf_url": "https://arxiv.org/pdf/2512.11328v1.pdf",
    "title": "$T_i/T_e$ Dependence of Core Turbulence and Transport in DIII-D QH-Mode Plasmas",
    "abstract": "This study investigates the effect of the ion-to-electron temperature ratio ($T_i/T_e$) on microturbulence driven transport in Quiescent H-mode (QH-mode) plasmas in the DIII-D tokamak. Utilizing the Gyrokinetic Toroidal Code (GTC) and the QH-mode equilibrium, we perform linear and nonlinear simulations to analyze transport properties and instability dynamics under variations of $T_i$ and $T_e$. Our results demonstrate that decreasing $T_i/T_e$ leads to a relative destabilization of trapped electron modes (TEM) over ion temperature gradient (ITG) modes, with the transition between these regimes dictated by $T_i/T_e$. When the electron temperature is increased at fixed ion temperature, we observe an increase in transport saturation levels. In contrast, decreasing the ion temperature at fixed electron temperature results in more modest transport enhancement. The radial correlation length, which characterizes eddy size, increases with rising $T_e$ and decreases with falling $T_i$, consistent with the observed trends in turbulent transport. Additionally, we examine the impact of impurity addition on turbulence and growth rates, finding that impurity presence does not significantly alter transport quantities compared to the impurity-free case. Finally, investigating helium as an alternative main ion species, we find that helium plasmas exhibit higher linear growth rates but result in lower transport saturation levels than deuterium plasmas, suggesting potential confinement benefits. These findings provide quantitative insights into the temperature ratio dependence in QH-mode plasmas and highlight the role of temperature profiles and zonal flows in influencing plasma confinement.",
    "authors": [
      "Abhishek Tiwari",
      "Kshitish Barada",
      "Jaya Kumar Alageshan",
      "Santanu Banerjee",
      "Tanmay Macwan",
      "Terry L. Rhodes",
      "Sarveshwar Sharma",
      "Zhihong Lin",
      "Animesh Kuley"
    ],
    "published": "2025-12-12T07:01:54Z",
    "updated": "2025-12-12T07:01:54Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.11310v1",
    "url": "https://arxiv.org/abs/2512.11310v1",
    "pdf_url": "https://arxiv.org/pdf/2512.11310v1.pdf",
    "title": "ALS-U AR RF Equipment Protection System",
    "abstract": "This paper presents the design and status of Accumulator Ring (AR) RF Equipment Protection System (EPS) of Advanced Light Source Upgrade project at LBNL. The key components of AR RF EPS include a Master Interlock PLC subsystem handling supervisory control and slow interlocks in \\SI{}{\\milli\\second} scale, an FPGA-based LLRF Controller managing fast interlocks in \\SI{}{\\micro\\second} scale, a 60 kW high-power amplifier with standalone PLC-based slow (\\SI{}{\\milli\\second} scale) and FPGA-based fast (\\SI{}{\\micro\\second} scale) protection systems, and an RF Drive Control Chassis acting as primary RF mitigation device. The design of AR RF EPS is presented along with internal RF and external AR subsystems interfaces.",
    "authors": [
      "Najm Us Saqib",
      "Christopher Toy",
      "Qiang Du",
      "Kevin Bender",
      "Shree Subhasish Basak",
      "Shreeharshini Murthy",
      "Jeong Han Lee",
      "David Nett"
    ],
    "published": "2025-12-12T06:16:21Z",
    "updated": "2025-12-12T06:16:21Z",
    "categories": [
      "physics.acc-ph",
      "eess.SY"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.18429/JACoW-IPAC2024-THPG20"
  },
  {
    "arxiv_id": "2512.11290v1",
    "url": "https://arxiv.org/abs/2512.11290v1",
    "pdf_url": "https://arxiv.org/pdf/2512.11290v1.pdf",
    "title": "Charge transport and mode transition in dual-energy electron beam diodes",
    "abstract": "This Letter uncovers five distinct charge transport modes and their transitions in dual-energy electron beam diodes. We, via fully kinetic particle-in-cell (PIC) simulations, establish that the specific mode (e.g., space charge oscillations) and the current transport characteristics are essentially governed by the interplay between the electron beam energy and injected current density. A more generalized analysis is conducted for n-component electron beams, and a theoretical piecewise function is proposed, which agrees well with the PIC results under designed conditions. The discovery provides a mechanistic picture of multiple electron beam transport in diodes, paving the way for novel designs of high-performance modern vacuum electronic devices.",
    "authors": [
      "Chubin Lin",
      "Jiandong Chen",
      "Huihui Wang",
      "Yangyang Fu"
    ],
    "published": "2025-12-12T05:34:30Z",
    "updated": "2025-12-12T05:34:30Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  }
]