{
  "arxiv_id": "2507.21612v4",
  "url": "https://arxiv.org/abs/2507.21612v4",
  "pdf_url": "https://arxiv.org/pdf/2507.21612v4.pdf",
  "title": "First use of large area SiPM matrices coupled with NaI(Tl) scintillating crystal for low energy dark matter search",
  "abstract": "The long-standing claim of dark matter detection by the DAMA experiment remains a crucial open question in astroparticle physics. A key step towards its independent verification is the development of NaI(Tl)-based detectors with improved sensitivity at low energies. The majority of NaI(Tl)-based experiments rely on conventional photomultiplier tubes (PMTs) as single photon detectors, which present technological limitations in terms of light collection, intrinsic radioactivity and high noise contribution at keV energies. ASTAROTH is an R&D project developing a NaI(Tl)-based detector where the scintillation light is read out by silicon photomultipliers (SiPMs) matrices. SiPMs exhibit high photon detection efficiency, negligible radioactivity, and, most importantly, a dark noise nearly two orders of magnitude lower than PMTs, when operated at cryogenic temperature. To this end, ASTAROTH features a custom-designed cryostat based on a bath of cryogenic fluid, able to safely operate the detector and the read-out electronics down to about 80 K. This work reports the first experimental characterization of an approximately 360 g NaI(Tl) detector read out by a large area (5 cm x 5 cm) SiPM matrix. The net photoelectron yield obtained with a preliminary configuration is approximately 4.5 photoelectrons/keV after crosstalk correction, which is rather promising in light of several planned developments. The signal-to-noise ratio and the energy threshold attainable with SiPMs is expected to improve the sensitivity for dark matter searches beyond the reach of current-generation PMT-based detectors. This result is the first proof of the viability of this technology and sets a milestone toward the design of future large-scale experiments.",
  "authors": [
    "Edoardo Martinenghi",
    "Valerio Toso",
    "Fabrizio Bruno Armani",
    "Andrea Castoldi",
    "Giuseppe di Carlo",
    "Luca Frontini",
    "Niccolò Gallice",
    "Chiara Guazzoni",
    "Valentino Liberali",
    "Alberto Stabile",
    "Valeria Trabattoni",
    "Andrea Zani",
    "Davide D'Angelo"
  ],
  "published": "2025-07-29T09:10:39Z",
  "updated": "2026-01-07T10:14:20Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.1140/epjc/s10052-025-15197-4"
}