{
  "arxiv_id": "2510.05855v2",
  "url": "https://arxiv.org/abs/2510.05855v2",
  "pdf_url": "https://arxiv.org/pdf/2510.05855v2.pdf",
  "title": "Studies of ultrafast dynamics in substrate-free nanoparticles at ELI using Timepix3 optical camera",
  "abstract": "We present a novel application of the Timepix3 optical camera (Tpx3Cam) for investigating ultrafast dynamics in substrate-free nanoparticles at the Extreme Light Infrastructure European Research Infrastructure Consortium (ELI ERIC). The camera, integrated into an ion imaging system based on a micro-channel plate (MCP) and a fast P47 scintillator, enables individual time-stamping of incoming ions with nanosecond timing precision and high spatial resolution. The detector successfully captured laser-induced ion events originating from free nanoparticles disintegrated by intense laser pulses. Owing to the broad size distribution of the nanoparticles (10-500 nm) and the variation in laser intensities within the interaction volume, the detected events range in occupancy from near-zero to extremely high, approaching the readout limits of the detector. By combining time-of-flight and velocity map imaging (VMI) techniques, detailed post-processing and analysis were performed. The results presented here focus on the performance of Tpx3Cam under high-occupancy conditions, which are of particular relevance to this study. These conditions approach the limitations imposed by the camera readout capabilities and challenge the effectiveness of standard post-processing algorithms. We investigated these limitations and associated trade-offs, and we present improved methods and algorithms designed to extract the most informative features from the data.",
  "authors": [
    "Dmitrij Ševaev",
    "Andrei Nomerotski",
    "Peter Švihra",
    "Keshav Sishodia",
    "Andreas Hult Roos",
    "Martin Albrecht",
    "Sivarama Krishnan",
    "Jakob Andreasson",
    "Maria Krikunova",
    "Eva Klimešová"
  ],
  "published": "2025-10-07T12:24:18Z",
  "updated": "2026-01-09T10:09:11Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}