{
  "arxiv_id": "2601.05285v1",
  "url": "https://arxiv.org/abs/2601.05285v1",
  "pdf_url": "https://arxiv.org/pdf/2601.05285v1.pdf",
  "title": "Detector characterization for a new $^{12}$C+$^{12}$C reaction study at LUNA",
  "abstract": "The $^{12}$C+$^{12}$C fusion reaction plays a crucial role in stellar evolution, including the occurrence of supernova explosions, and in the synthesis of the chemical elements. However, our understanding of its cross section remains severely deficient, particularly below $E_\\textrm{cm}=2.5$\\,MeV, the energy range of interest for astrophysics. To address these unresolved issues, the LUNA collaboration will conduct a dedicated study of the $^{12}$C+$^{12}$C reaction at the Bellotti Ion Beam Facility (Bellotti IBF) located deep underground within the Gran Sasso National Laboratory (LNGS) in Italy. Based on the combination of passive and active shields, this campaign aims to achieve unprecedented sensitivity in measuring the cross sections of the two key reaction channels, $^{12}$C($^{12}$C,$α$)$^{20}$Ne and $^{12}$C($^{12}$C,$p$)$^{23}$Na in the low-energy regime via $γ$-ray detection. Here, we report on a sensitivity study for the upcoming campaign with a focus on the characterization of two detectors, namely a HPGe detector and a NaI(Tl) array. Furthermore, their intrinsic contamination is thoroughly investigated since this could potentially influence the overall sensitivity. Assuming typical beam intensities of the Bellotti IBF, we will be able to investigate reaction rates significantly below 100 counts per day. In case of the $^{12}$C+$^{12}$C reaction we therefore expect to acquire experimental data well below the current limit of $E_\\textrm{cm}=2.1\\,$MeV. The results are supported by simulations to highlight the advantageous low-background environment, essential for high-precision nuclear astrophysics studies.",
  "authors": [
    "R. M. Gesùè",
    "S. Turkat",
    "J. Skowroński",
    "M. Aliotta",
    "L. Barbieri",
    "F. Barile",
    "D. Bemmerer",
    "A. Best",
    "A. Boeltzig",
    "C. Broggini",
    "C. G. Bruno",
    "A. Caciolli",
    "M. Campostrini",
    "F. Casaburo",
    "F. Cavanna",
    "T. Chillery",
    "G. F. Ciani",
    "P. Colombetti",
    "A. Compagnucci",
    "P. Corvisiero",
    "L. Csedreki",
    "T. Davinson",
    "D. Dell'Aquila",
    "R. Depalo",
    "A. Di Leva",
    "Z. Elekes",
    "F. Ferraro",
    "A. Formicola",
    "Zs. Fülöp",
    "G. Gervino",
    "A. Guglielmetti",
    "C. Gustavino",
    "Gy. Gyürky",
    "G. Imbriani",
    "M. Junker",
    "M. Lugaro",
    "P. Marigo",
    "J. Marsh",
    "E. Masha",
    "R. Menegazzo",
    "D. Mercogliano",
    "V. Paticchio",
    "D. Piatti",
    "P. Prati",
    "D. Rapagnani",
    "V. Rigato",
    "D. Robb",
    "L. Russell",
    "R. S. Sidhu",
    "B. Spadavecchia",
    "O. Straniero",
    "T. Szücs",
    "S. Zavatarelli"
  ],
  "published": "2026-01-07T14:40:48Z",
  "updated": "2026-01-07T14:40:48Z",
  "categories": [
    "physics.ins-det",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det",
  "doi": "0.1088/1361-6471/ade0dc"
}