{
  "arxiv_id": "2504.21050v2",
  "url": "https://arxiv.org/abs/2504.21050v2",
  "pdf_url": "https://arxiv.org/pdf/2504.21050v2.pdf",
  "title": "High-Precision Physics Experiments at Huizhou Large-Scale Scientific   Facilities",
  "abstract": "In response to the capabilities presented by the High-Intensity Heavy Ion Accelerator Facility (HIAF) and the Accelerator-Driven Subcritical System (CiADS), as well as the proposed Chinese Advanced Nuclear Physics Research Facility (CNUF), we are assembling a consortium of experts in relevant discipline--both domestically and internationally--to delineate high-precision physics experiments that leverage the state-of-the-art research environment afforded by CNUF. Our focus encompasses six primary domains of inquiry: hadron physics--including endeavors such as the super eta factory and investigations into light hadron structures; muon physics; neutrino physics; neutron physics; the testing of fundamental symmetries; and the exploration of quantum effects within nuclear physics, along with the utilization of vortex accelerators. We aim to foster a well-rounded portfolio of large, medium, and small-scale projects, thus unlocking new scientific avenues and optimizing the potential of the Huizhou large scientific facility. The aspiration for international leadership in scientific research will be a guiding principle in our strategic planning. This initiative will serve as a foundational reference for the Institute of Modern Physics in its strategic planning and goal-setting, ensuring alignment with its developmental objectives while striving to secure a competitive edge in technological advancement. Our ambition is to engage in substantive research within these realms of high-precision physics, to pursue groundbreaking discoveries, and to stimulate progress in China's nuclear physics landscape, positioning Huizhou as a preeminent global hub for advanced nuclear physics research.",
  "authors": [
    "FengPeng An",
    "Dong Bai",
    "Siyuan Chen",
    "Xurong Chen",
    "Hongyue Duyang",
    "Leyun Gao",
    "Shao-Feng Ge",
    "Jun He",
    "Junting Huang",
    "Zhongkui Huang",
    "Igor Ivanov",
    "Chen Ji",
    "Huan Jia",
    "Junjie Jiang",
    "Xiaolin Kang",
    "Soo-Bong Kim",
    "Chui-Fan Kong",
    "Wei Kou",
    "Qiang Li",
    "Qite Li",
    "Jiajun Liao",
    "Jiajie Ling",
    "Cheng-en Liu",
    "Xinwen Ma",
    "Hao Qiu",
    "Jian Tang",
    "Rong Wang",
    "Weiqiang Wen",
    "Jia-Jun Wu",
    "Jun Xiao",
    "Xiang Xiao",
    "Yu Xu",
    "Weihua Yang",
    "Xiaofei Yang",
    "Jiangming Yao",
    "Ye Yuan",
    "Mushtaq Zaiba",
    "Pengming Zhang",
    "Shaofeng Zhang",
    "Shuo Zhang",
    "Shihan Zhao",
    "Liping Zou"
  ],
  "published": "2025-04-29T01:54:31Z",
  "updated": "2025-10-31T02:33:20Z",
  "categories": [
    "hep-ph",
    "hep-ex",
    "nucl-ex",
    "physics.ins-det"
  ],
  "primary_category": "hep-ph"
}