{
  "arxiv_id": "2507.18497v3",
  "url": "https://arxiv.org/abs/2507.18497v3",
  "pdf_url": "https://arxiv.org/pdf/2507.18497v3.pdf",
  "title": "Characterization of Lateral Amorphous Selenium Photodetectors for   Low-Photon and VUV Detection at Cryogenic Temperatures",
  "abstract": "The performance of amorphous selenium (a-Se) as a cryogenic photodetector material is evaluated through a series of experiments using laterally structured devices operated in a custom optical test stand. These studies investigate the response of a-Se detectors to low-photon fluxes at high electric fields near avalanche conditions, the linearity of the photoconductive response over a wide dynamic range and the direct detection of narrowband 130 nm vacuum ultraviolet (VUV) illumination. At 87 K, matched-filter analysis shows reliable single-shot detection with efficiencies greater than or equal to 80 percent and area under the curve (AUC) greater than or equal to 0.85 using as few as approximately 6800 incident 401 nm photons, corresponding to approximately 3400 photons within field-active regions after accounting for geometric constraints. Measurements are performed at cryogenic temperatures using calibrated photon fluxes derived from a silicon photomultiplier reference and a characterized optical filter stack. Additional experiments using a tellurium-doped a-Se (a-SeTe) device explore the material's behavior under identical test conditions and demonstrate that avalanche is achievable in a-SeTe at cryogenic temperatures. The results demonstrate reproducible low-noise operation, VUV sensitivity and field-dependent gain behavior in a lateral a-Se architecture, representing the first reported observation of avalanche multiplication in laterally structured a-Se and a-SeTe devices at cryogenic temperatures. These findings support the potential integration of laterally structured a-Se devices into next-generation pixelated liquid-argon time projection chambers (TPCs) requiring scalable, high-field-compatible photon detection systems.",
  "authors": [
    "M. Rooks",
    "S. Abbaszadeh",
    "J. Asaadi",
    "V. A. Chirayath",
    "M. Febbraro",
    "M. Á. García-Peris",
    "E. Gramellini",
    "K. Hellier",
    "B. Sudarsan",
    "I. Tzoka"
  ],
  "published": "2025-07-24T15:10:57Z",
  "updated": "2025-10-30T15:24:00Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}