{
  "arxiv_id": "2509.03559v2",
  "url": "https://arxiv.org/abs/2509.03559v2",
  "pdf_url": "https://arxiv.org/pdf/2509.03559v2.pdf",
  "title": "Particle background characterization and prediction for the NUCLEUS   reactor CE$ν$NS experiment",
  "abstract": "NUCLEUS is a cryogenic detection experiment which aims to measure Coherent Elastic Neutrino-Nucleus Scattering (CE$\\nu$NS) and to search for new physics at the Chooz nuclear power plant in France. This article reports on the prediction of particle-induced backgrounds, especially focusing on the sub-keV energy range, which is a poorly known region where most of the CE$\\nu$NS signal from reactor antineutrinos is expected. Together with measurements of the environmental background radiations at the experimental site, extensive Monte Carlo simulations based on the Geant4 package were run both to optimize the experimental setup for background reduction and to estimate the residual rates arising from different contributions such as cosmic ray-induced radiations, environmental gammas and material radioactivity. The NUCLEUS experimental setup is predicted to achieve a total rejection power of more than two orders of magnitude, leaving a residual background component which is strongly dominated by cosmic ray-induced neutrons. In the CE$\\nu$NS signal region of interest between 10 and 100 eV, a total particle background rate of $\\sim$ 250 d$^{-1}$kg$^{-1}$keV$^{-1}$ is expected in the CaWO$_4$ target detectors. This corresponds to a signal-to-background ratio $\\gtrsim$ 1, and therefore meets the required specifications in terms of particle background rejection for the detection of reactor antineutrinos through CE$\\nu$NS.",
  "authors": [
    "H. Abele",
    "G. Anglogher",
    "B. Arnold",
    "M. Atzori Corona",
    "A. Bento",
    "E. Bossio",
    "F. Buchsteiner",
    "J. Burkhart",
    "F. Cappella",
    "M. Cappelli",
    "N. Casali",
    "R. Cerulli",
    "A. Cruciani",
    "G. Del Castello",
    "M. del Gallo Roccagiovine",
    "S. Dorer",
    "A. Erhart",
    "M. Friedl",
    "S. Fichtinger",
    "V. M. Ghete",
    "M. Giammei",
    "C. Goupy",
    "D. Hauff",
    "F. Jeanneau",
    "E. Jericha",
    "M. Kaznacheeva",
    "H. Kluck",
    "A. Langenkämper",
    "T. Lasserre",
    "D. Lhuillier",
    "M. Mancuso",
    "R. Martin",
    "B. Mauri",
    "A. Mazzolari",
    "L. McCallin",
    "H. Neyrial",
    "C. Nones",
    "L. Oberauer",
    "T. Ortmann",
    "L. Peters",
    "F. Petricca",
    "W. Potzel",
    "F. Pröbst",
    "F. Pucci",
    "F. Reindl",
    "M. Romagnoni",
    "J. Rothe",
    "N. Schermer",
    "J. Schieck",
    "S. Schönert",
    "C. Schwertner",
    "L. Scola",
    "G. Soum-Sidikov",
    "L. Stodolsky",
    "R. Strauss",
    "R. Thalmeier",
    "C. Tomei",
    "M. Vignati",
    "M. Vivier",
    "A. Wex"
  ],
  "published": "2025-09-03T09:49:17Z",
  "updated": "2025-11-03T13:21:52Z",
  "categories": [
    "physics.ins-det",
    "hep-ex",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det"
}