{
  "arxiv_id": "2510.27162v1",
  "url": "https://arxiv.org/abs/2510.27162v1",
  "pdf_url": "https://arxiv.org/pdf/2510.27162v1.pdf",
  "title": "Two-Stage Nature of a Solar Flare with Parallel and Semi-Circular   Ribbons",
  "abstract": "Flare ribbons with parallel and circular morphologies are typically associated with different magnetic reconnection models, and the simultaneous observation of both types in a single event remains rare. Using multi-wavelength observations from a tandem of instruments, we present an M8.2-class flare that occurred on 2023 September 20, which produced quasi-parallel and semi-circular ribbons. The complex evolution of the flare includes two distinct brightening episodes in the quasi-parallel ribbons, corresponding to the two major peaks in the hard X-ray (HXR) light curve. In contrast, the brightening of semi-circular ribbons temporally coincides with the local minimum between the two peaks. Using potential field extrapolation, we reconstruct an incomplete dome-like magnetic structure with a negative polarity embedded within the northwestern part of the semi-circular positive polarity. Consequently, the magnetic configuration comprises two sets of field lines with distinct magnetic connectivities. We suggest that the standard flare reconnection accounts for the two-stage brightening of quasi-parallel ribbons associated with the two HXR peaks. Between the two stages, this process is constrained by the interaction of eruptive structures with the dome. The interaction drives the quasi-separatrix layer reconnection, leading to the brightening of semi-circular ribbons. It also suppresses the standard flare reconnection, resulting in a delayed second HXR peak.",
  "authors": [
    "Ruifei Huang",
    "Hao Ning",
    "Ze Zhong",
    "Ye Qiu",
    "Zhenyong Hou",
    "Yang Su",
    "Chuan Li",
    "Xiangliang Kong",
    "Yao Chen"
  ],
  "published": "2025-10-31T04:17:28Z",
  "updated": "2025-10-31T04:17:28Z",
  "categories": [
    "astro-ph.SR",
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.SR"
}