[
  {
    "arxiv_id": "2509.03559v2",
    "url": "https://arxiv.org/abs/2509.03559v2",
    "pdf_url": "https://arxiv.org/pdf/2509.03559v2.pdf",
    "title": "Particle background characterization and prediction for the NUCLEUS   reactor CE$ν$NS experiment",
    "abstract": "NUCLEUS is a cryogenic detection experiment which aims to measure Coherent Elastic Neutrino-Nucleus Scattering (CE$\\nu$NS) and to search for new physics at the Chooz nuclear power plant in France. This article reports on the prediction of particle-induced backgrounds, especially focusing on the sub-keV energy range, which is a poorly known region where most of the CE$\\nu$NS signal from reactor antineutrinos is expected. Together with measurements of the environmental background radiations at the experimental site, extensive Monte Carlo simulations based on the Geant4 package were run both to optimize the experimental setup for background reduction and to estimate the residual rates arising from different contributions such as cosmic ray-induced radiations, environmental gammas and material radioactivity. The NUCLEUS experimental setup is predicted to achieve a total rejection power of more than two orders of magnitude, leaving a residual background component which is strongly dominated by cosmic ray-induced neutrons. In the CE$\\nu$NS signal region of interest between 10 and 100 eV, a total particle background rate of $\\sim$ 250 d$^{-1}$kg$^{-1}$keV$^{-1}$ is expected in the CaWO$_4$ target detectors. This corresponds to a signal-to-background ratio $\\gtrsim$ 1, and therefore meets the required specifications in terms of particle background rejection for the detection of reactor antineutrinos through CE$\\nu$NS.",
    "authors": [
      "H. Abele",
      "G. Anglogher",
      "B. Arnold",
      "M. Atzori Corona",
      "A. Bento",
      "E. Bossio",
      "F. Buchsteiner",
      "J. Burkhart",
      "F. Cappella",
      "M. Cappelli",
      "N. Casali",
      "R. Cerulli",
      "A. Cruciani",
      "G. Del Castello",
      "M. del Gallo Roccagiovine",
      "S. Dorer",
      "A. Erhart",
      "M. Friedl",
      "S. Fichtinger",
      "V. M. Ghete",
      "M. Giammei",
      "C. Goupy",
      "D. Hauff",
      "F. Jeanneau",
      "E. Jericha",
      "M. Kaznacheeva",
      "H. Kluck",
      "A. Langenkämper",
      "T. Lasserre",
      "D. Lhuillier",
      "M. Mancuso",
      "R. Martin",
      "B. Mauri",
      "A. Mazzolari",
      "L. McCallin",
      "H. Neyrial",
      "C. Nones",
      "L. Oberauer",
      "T. Ortmann",
      "L. Peters",
      "F. Petricca",
      "W. Potzel",
      "F. Pröbst",
      "F. Pucci",
      "F. Reindl",
      "M. Romagnoni",
      "J. Rothe",
      "N. Schermer",
      "J. Schieck",
      "S. Schönert",
      "C. Schwertner",
      "L. Scola",
      "G. Soum-Sidikov",
      "L. Stodolsky",
      "R. Strauss",
      "R. Thalmeier",
      "C. Tomei",
      "M. Vignati",
      "M. Vivier",
      "A. Wex"
    ],
    "published": "2025-09-03T09:49:17Z",
    "updated": "2025-11-03T13:21:52Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.04528v2",
    "url": "https://arxiv.org/abs/2509.04528v2",
    "pdf_url": "https://arxiv.org/pdf/2509.04528v2.pdf",
    "title": "HEEPidermis: a versatile SoC for BioZ recording",
    "abstract": "Biological impedance (BioZ) is an information-packed modality that allows for non-invasive monitoring of health and emotional state. Currently, most research involving tissue impedance is based on bulky or fixed-purpose hardware, which limits the scope of research and the possibilities of experiments. In this work, we present HEEPidermis: a System-on-Chip (SoC) which integrates all the blocks needed for tissue impedance measurement, including two 8-bit, arbitrary-signal current DACs, two VCO-based ADCs, and a RISC-V CPU to enable on-chip feature extraction for closed-loop operation. An event-based sub-sampler improves storage and energy efficiency for long-term recording. In addition to the versatile SoC, the digital back-end and behavioral models of the analog front-end are open-source, allowing fast system-level simulations or repurposing. The SoC was taped out on TSMC 65 nm LP process.",
    "authors": [
      "Juan Sapriza",
      "Beatrice Grassano",
      "Alessio Naclerio",
      "Filippo Quadri",
      "Tommaso Terzano",
      "David Mallasén",
      "Davide Schiavone",
      "Robin Leplae",
      "Jérémie Moullet",
      "Alexandre Levisse",
      "Christoph Müller",
      "Mariagrazia Graziano",
      "Matías Miguez",
      "David Atienza"
    ],
    "published": "2025-09-03T19:34:37Z",
    "updated": "2025-11-03T09:19:47Z",
    "categories": [
      "physics.ins-det",
      "cs.AR",
      "physics.med-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.21676v2",
    "url": "https://arxiv.org/abs/2510.21676v2",
    "pdf_url": "https://arxiv.org/pdf/2510.21676v2.pdf",
    "title": "Constructing Field Aligned Coordinate Systems for Gyrokinetic   Simulations of Tokamaks in X-point Geometries",
    "abstract": "Structures in tokamak plasmas are elongated along the direction of the magnetic field and short in the directions perpendicular to the magnetic field. Many tokamak simulation codes take advantage of this by using a field aligned coordinate system. However, field aligned coordinate systems have a coordinate singularity at magnetic X-points where the poloidal magnetic field vanishes, which makes it difficult to use field aligned coordinate systems when simulating the core and scrape-off layer (SOL) simultaneously. Here we present an algorithm for computing geometric quantities in a standard field aligned coordinate system that avoids the singularity and allows one to conduct 2D axisymmetric simulations in X-point geometries. We demonstrate the efficacy of this algorithm with an example simulation of the Spherical Tokamak for Energy Production (STEP).",
    "authors": [
      "Akash Shukla",
      "Ammar Hakim",
      "James Juno",
      "Gregory Hammett",
      "Manaure Francisquez"
    ],
    "published": "2025-10-24T17:31:59Z",
    "updated": "2025-11-02T18:09:56Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.14953v2",
    "url": "https://arxiv.org/abs/2506.14953v2",
    "pdf_url": "https://arxiv.org/pdf/2506.14953v2.pdf",
    "title": "Fourier Transform Method Of A Detailed Configuration Accounting In Hot   Plasma Bound-Bound Opacity Calculations",
    "abstract": "G.~Hazak and J.~Kurzweil discovered a method of configurational resolution of transition arrays for the Super Transition Arrays approach to the bound-bound opacity calculation. Their method is based on the representation of the photoabsorption coefficient as the Fourier transform, the linearity of the transition energy between configurations with respect to shell occupation numbers, and factorization of the probabilities of configurations on shell occupation numbers. We extend the Hazak -- Kurzweil method for the calculations with Detailed Configuration Accounting. The resulting expressions for the bound-bound opacity represent an alternative to the widely used ones and are quite convenient for numerical implementation.",
    "authors": [
      "Evgeniya Arapova",
      "Yulia Koryakina",
      "Mikhail Vronskiy"
    ],
    "published": "2025-06-17T20:09:05Z",
    "updated": "2025-11-02T11:24:19Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2501.14242v2",
    "url": "https://arxiv.org/abs/2501.14242v2",
    "pdf_url": "https://arxiv.org/pdf/2501.14242v2.pdf",
    "title": "Sawtooth crash in tokamak as a sequence of Multi-region Relaxed MHD   equilibria",
    "abstract": "This study examines the sawtooth crash phenomenon in tokamak plasmas by modelling it as a sequence of Multi-region Relaxed Magnetohydrodynamic (MRxMHD) equilibria. Using the Stepped-Pressure Equilibrium Code (SPEC), we constructed a series of equilibria representing intermediate states during the sawtooth crash, with progressively increasing reconnection regions. Numerical results demonstrated that the system prefers the lower energy non-axisymmetric equilibria with islands and is eventually back to an axisymmetric state, capturing key features of the reconnection process. Comparisons with the nonlinear MHD code M3D-C1 showed remarkable agreement on the field-line topology, the safety factor, and the current profile. However, the simplified MRxMHD model does not resolve the detailed structure of the current sheet. Despite this limitation, MRxMHD offers an insightful approach and a complementary perspective to initial-value MHD simulations.",
    "authors": [
      "Zhisong Qu",
      "Yao Zhou",
      "Arunav Kumar",
      "Joshua Doak",
      "Joaquim Loizu",
      "Matthew Hole"
    ],
    "published": "2025-01-24T05:02:37Z",
    "updated": "2025-11-02T01:28:23Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.05108v2",
    "url": "https://arxiv.org/abs/2509.05108v2",
    "pdf_url": "https://arxiv.org/pdf/2509.05108v2.pdf",
    "title": "LEMURS dataset: Large-scale multi-detector ElectroMagnetic Universal   Representation of Showers",
    "abstract": "We present LEMURS: an extensive dataset of simulated calorimeter showers designed to support the development and benchmarking of fast simulation methods in high-energy physics, most notably providing a step towards the development of foundation models. This new dataset is more robust than the well-established CaloChallenge dataset 2, featuring substantially greater statistics, a wider range of incident angles in the detector, and most crucially multiple detector geometries (including more realistic calorimeters). The dataset is provided in HDF5 format, with a file structure inspired by the CaloChallenge shower representation while also including more variables. LEMURS scale and diversity make it particularly suitable for development of foundation models and has been used in the CaloDiT-2 model, a pre-trained model released in the community standard simulation toolkit Geant4 (version 11.4.beta). All data and code for generation and analysis are openly accessible, facilitating reproducibility and reuse across the community.",
    "authors": [
      "Peter McKeown",
      "Piyush Raikwar",
      "Anna Zaborowska"
    ],
    "published": "2025-09-05T13:47:39Z",
    "updated": "2025-11-01T21:21:04Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "physics.comp-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.08533v2",
    "url": "https://arxiv.org/abs/2508.08533v2",
    "pdf_url": "https://arxiv.org/pdf/2508.08533v2.pdf",
    "title": "Transition to Petschek Reconnection in Subrelativistic Pair Plasmas:   Implications for Particle Acceleration",
    "abstract": "While relativistic magnetic reconnection in pair plasmas has emerged in recent years as a candidate for the origin of radiation from extreme astrophysical environments, the corresponding subrelativistic pair plasma regime has remained less explored, leaving open the question of how relativistic physics affects reconnection. In this paper, we investigate the differences between these regimes by contrasting 2D particle-in-cell simulations of reconnection in pair plasmas with relativistic magnetization ($\\sigma \\gg 1$) and subrelativistic magnetization ($\\sigma < 1$). By utilizing unprecedentedly large domain sizes and outflow boundary conditions, we demonstrate that lowering the magnetization results in a change in the reconnection geometry from a plasmoid chain to a Petschek geometry, where laminar exhausts bounded by slow-mode shocks emanate from a single diffusion region. We attribute this change to the reduced plasmoid production rate in the low-$\\sigma$ case: when the secondary tearing rate is sufficiently low, plasmoids are too few in number to prevent the system from relaxing into a stable Petschek configuration. This geometric change also affects particle energization: we show that while high-$\\sigma$ plasmoid chains generate power-law energy spectra, low-$\\sigma$ Petschek exhausts merely heat incoming plasma and yield negligible nonthermal acceleration. These results have implications for predicting the global current sheet geometry and the resulting energy spectrum in a variety of systems.",
    "authors": [
      "Adam Robbins",
      "Anatoly Spitkovsky"
    ],
    "published": "2025-08-12T00:22:43Z",
    "updated": "2025-10-31T23:18:05Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.20628v2",
    "url": "https://arxiv.org/abs/2510.20628v2",
    "pdf_url": "https://arxiv.org/pdf/2510.20628v2.pdf",
    "title": "Magnetic Field-Line Curvature and Its Role in Particle Acceleration by   Magnetically Dominated Turbulence",
    "abstract": "We employ first-principles, fully kinetic particle-in-cell simulations to investigate magnetic field-line curvature in magnetically dominated turbulent plasmas and its role in particle acceleration through curvature-drift motion along the motional electric field. By varying the fluctuation-to-mean magnetic-field ratio $\\delta B_0/B_0$, we examine curvature $\\kappa$ statistics and their connection to particle acceleration. The curvature probability densities display broad power-law wings, scaling linearly in $\\kappa$ below the peak and developing hard high-$\\kappa$ tails for $\\delta B_0/B_0 \\gtrsim 1$. As the mean field strengthens, the high-$\\kappa$ tails steepen, and large-curvature events are suppressed when $\\delta B_0/B_0 \\ll 1$. The probability density functions of magnetic field-line contraction, ${\\bf v}_E \\cdot {\\bf \\kappa}$, with ${\\bf v}_E$ the field-line velocity, develop power-law tails well described by a symmetric Pareto distribution, characteristic of stochastic energy exchanges, with the tails becoming harder as $\\delta B_0/B_0$ increases. Our guiding-center analysis shows that curvature-drift acceleration accounts for a substantial fraction of the energization via the motional electric field, and that it strengthens with increasing $\\delta B_0/B_0$. For well-magnetized particles, curvature-drift acceleration typically exceeds ${\\bf\\nabla}B$ drift, polarization drift, and betatron contributions. These results identify curvature-drift acceleration as a principal pathway through which magnetized turbulence transfers energy to nonthermal particles in astrophysical plasmas.",
    "authors": [
      "Samuel Sebastian",
      "Luca Comisso"
    ],
    "published": "2025-10-23T15:02:34Z",
    "updated": "2025-10-31T18:23:21Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2510.27624v1",
    "url": "https://arxiv.org/abs/2510.27624v1",
    "pdf_url": "https://arxiv.org/pdf/2510.27624v1.pdf",
    "title": "Stellarator divertor design by optimizing coils for surfaces with sharp   corners",
    "abstract": "In stellarators, achieving effective divertor configurations is challenging due to the three-dimensional nature of the magnetic fields, which often leads to chaotic field lines and fuzzy separatrices. This work presents a novel approach to directly optimize modular stellarator coils for a sharp X-point divertor topology akin to the Large Helical Device's (LHD) helical divertor using a target plasma surface with sharp corners. By minimizing the normal magnetic field component on this surface, we target a clean separatrix with minimal chaos. Notably, this approach demonstrates the first LHD-like helical divertor design using optimized modular coils instead of helical coils. Separatrices are produced with significantly lower chaos than in LHD, demonstrating that a wide chaotic layer is not intrinsic to the helical divertor. Additional optimization methods are implemented to improve engineering feasibility of the coils and reduce chaos, including weighted quadrature and manifold optimization, a method which does not rely on normal field minimization. The results outline several new strategies for divertor design in stellarators, though it remains to achieve these edge divertor features at the same time as internal field qualities like quasisymmetry.",
    "authors": [
      "Todd Elder",
      "Matt Landremann",
      "Christoper B. Smiet",
      "Robert Davies"
    ],
    "published": "2025-10-31T16:51:27Z",
    "updated": "2025-10-31T16:51:27Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.27601v1",
    "url": "https://arxiv.org/abs/2510.27601v1",
    "pdf_url": "https://arxiv.org/pdf/2510.27601v1.pdf",
    "title": "Magnetic wideband VHF localized field probe using magnon polaritons",
    "abstract": "We present here an optimisation and demonstration of a wide band instrument capable of measuring localised and directionally alternated magnetic fields below pT in the very high frequency (VHF) range. We take advantage of the magnon-photon hybridization between a yttrium iron garnet (YIG) sphere and a copper resonant cavity to employ a resonant heterodyne detection scheme. The measurement is near instantaneous due to the strong coupling attained between magnons and photons.In this work measurements are reported showing a significant widening of the measurement bandwidth, obtained by tuning the YIG Larmor frequency with a bias magnetic field and adjusting the magnon-photon coupling strength. Minimum sensitivity in the sub pT regime is demonstrated in the range 150 -- 225 MHz at room temperature and expected to go to fT in cryogenic temperatures. Dynamic range is estimated to be above 100 dB. The sensitivity is found to be independent on size, being ready to in-chip miniaturization. Such device can be an important building block to quantum circuits, such as baluns, transducers or signal processing units.",
    "authors": [
      "Gabriel Soares",
      "Nicolò Crescini",
      "Giovanni Carugno",
      "Giuseppe Ruoso"
    ],
    "published": "2025-10-31T16:26:54Z",
    "updated": "2025-10-31T16:26:54Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mes-hall"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.27592v1",
    "url": "https://arxiv.org/abs/2510.27592v1",
    "pdf_url": "https://arxiv.org/pdf/2510.27592v1.pdf",
    "title": "Sensor operating point calibration and monitoring of the ALICE Inner   Tracking System during LHC Run 3",
    "abstract": "The new Inner Tracking System (ITS2) of the ALICE experiment began operation in 2021 with the start of LHC Run 3. Compared to its predecessor, ITS2 offers substantial improvements in pointing resolution, tracking efficiency at low transverse momenta, and readout-rate capabilities. The detector employs silicon Monolithic Active Pixel Sensors (MAPS) featuring a pixel size of 26.88$\\times$29.24 $\\mu$m$^2$ and an intrinsic spatial resolution of approximately 5 $\\mu$m. With a remarkably low material budget of 0.36% of radiation length ($X_{0}$) per layer in the three innermost layers and a total sensitive area of about 10 m$^2$, the ITS2 constitutes the largest-scale application of MAPS technology in a high-energy physics experiment and the first of its kind operated at the LHC. For stable data taking, it is crucial to calibrate different parameters of the detector, such as in-pixel charge thresholds and the masking of noisy pixels. The calibration of 24120 monolithic sensors, comprising a total of 12.6$\\times$10$^{9}$ pixels, represents a major operational challenge. This paper presents the methods developed for the calibration of the ITS2 and outlines the strategies for monitoring and dynamically adjusting the detector's key performance parameters over time.",
    "authors": [
      "D. Agguiaro",
      "G. Aglieri Rinella",
      "L. Aglietta",
      "M. Agnello",
      "F. Agnese",
      "B. Alessandro",
      "G. Alfarone",
      "J. Alme",
      "E. Anderssen",
      "D. Andreou",
      "M. Angeletti",
      "N. Apadula",
      "P. Atkinson",
      "C. Azzan",
      "R. Baccomi",
      "A. Badalà",
      "A. Balbino",
      "P. Barberis",
      "F. Barile",
      "L. Barioglio",
      "R. Barthel",
      "F. Baruffaldi",
      "N. K. Behera",
      "I. Belikov",
      "A. Benato",
      "M. Benettoni",
      "F. Benotto",
      "S. Beole",
      "N. Bez",
      "A. Bhatti",
      "M. Bhopal",
      "A. P. Bigot",
      "G. Boca",
      "G. Bonomi",
      "M. Bonora",
      "F. Borotto Dalla Vecchia",
      "M. Borri",
      "V. Borshchov",
      "E. Botta",
      "L. Boynton",
      "G. Brower",
      "E. Bruna",
      "O. Brunasso Cattarello",
      "G. E. Bruno",
      "M. D. Buckland",
      "S. Bufalino",
      "P. Camerini",
      "P. Cariola",
      "C. Ceballos Sanchez",
      "J. Cho",
      "S. Cho",
      "K. Choi",
      "Y. Choi",
      "N. J. Clague",
      "O. A. Clausse",
      "F. Colamaria",
      "D. Colella",
      "S. Coli",
      "A. Collu",
      "M. Concas",
      "G. Contin",
      "Y. Corrales Morales",
      "S. Costanza",
      "J. B. Dainton",
      "E. Danè",
      "W. Degraw",
      "C. De Martin",
      "W. Deng",
      "G. De Robertis",
      "P. Dhankher",
      "A. Di Mauro",
      "F. Dumitrache",
      "D. Elia",
      "M. R. Ersdal",
      "J. Eum",
      "A. Fantoni",
      "G. Feofilov",
      "J. Ferencei",
      "F. Fichera",
      "G. Fiorenza",
      "A. N. Flores",
      "A. Franco",
      "M. Franco",
      "J. P. Fransen",
      "D. Gajanana",
      "A. Galdames Perez",
      "C. Gao",
      "C. Gargiulo",
      "L. Garizzo",
      "P. Giubilato",
      "M. Goffe",
      "A. Grant",
      "E. Grecka",
      "L. Greiner",
      "A. Grelli",
      "A. Grimaldi",
      "O. S. Groettvik",
      "F. Grosa",
      "C. Guo Hu",
      "R. P. Hannigan",
      "H. Helstrup",
      "A. Hill",
      "H. Hillemanns",
      "P. Hindley",
      "G. Huang",
      "M. Iannone",
      "J. P. Iddon",
      "P. Ijzermans",
      "M. A. Imhoff",
      "A. Isakov",
      "J. Jeong",
      "T. Johnson",
      "A. Junique",
      "J. Kaewjai",
      "M. Keil",
      "Z. Khabanova",
      "H. Khan",
      "H. Kim",
      "J. Kim",
      "J. Kim",
      "J. Kim",
      "M. Kim",
      "T. Kim",
      "J. Klein",
      "C. Kobdaj",
      "A. Kotliarov",
      "M. J. Kraan",
      "I. Králik",
      "F. Krizek",
      "T. Kugathasan",
      "C. Kuhn",
      "P. G. Kuijer",
      "S. Kushpil",
      "M. J. Kweon",
      "M. Kwon",
      "Y. Kwon",
      "P. La Rocca",
      "N. Lacalamita",
      "P. Larionov",
      "G. Ledey",
      "S. Lee",
      "T. Lee",
      "R. C. Lemmon",
      "Y. Lesenechal",
      "E. D. Lesser",
      "B. E. Liang-Gilman",
      "F. Librizzi",
      "B. Lim",
      "S. Lim",
      "S. Lindsay",
      "J. Liu",
      "J. Liu",
      "F. Loddo",
      "M. Lupi",
      "M. Mager",
      "A. Maire",
      "G. Mandaglio",
      "V. Manzari",
      "C. Markert",
      "G. Markey",
      "D. Marras",
      "P. Martinengo",
      "S. Martiradonna",
      "M. Masera",
      "A. Mastroserio",
      "G. Mazza",
      "D. Mazzaro",
      "F. Mazzaschi",
      "M. Mazzilli",
      "L. Mcalpine",
      "M. Mongelli",
      "J. Morant",
      "F. Morel",
      "P. Morrall",
      "V. Muccifora",
      "A. Mulliri",
      "L. Musa",
      "A. I. Nambrath",
      "M. Obergger",
      "A. Orlandi",
      "A. Palasciano",
      "R. Panero",
      "E. Paoletti",
      "G. S. Pappalardo",
      "O. Parasole",
      "J. Park",
      "L. Passamonti",
      "C. Pastore",
      "R. N. Patra",
      "F. Pellegrino",
      "A. Pepato",
      "C. Petta",
      "S. Piano",
      "D. Pierluigi",
      "S. Pisano",
      "M. Pĺoskoń",
      "M. T. Poblocki",
      "S. Politano",
      "E. Prakasa",
      "F. Prino",
      "M. Protsenko",
      "M. Puccio",
      "C. Puggioni",
      "A. Rachevski",
      "L. Ramello",
      "M. Rasa",
      "I. Ravasenga",
      "A. U. Rehman",
      "F. Reidt",
      "M. Richter",
      "F. Riggi",
      "M. Rizzi",
      "K. Røed",
      "D. Röhrich",
      "F. Ronchetti",
      "M. J. Rossewij",
      "A. Rossi",
      "A. Russo",
      "B. Di Ruzza",
      "G. Saccà",
      "M. Sacchetti",
      "R. Sadikin",
      "A. Sanchez Gonzalez",
      "U. Savino",
      "J. Schambach",
      "F. Schlepper",
      "R. Schotter",
      "P. J. Secouet",
      "M. Selina",
      "S. Senyukov",
      "J. J. Seo",
      "R. Shahoyan",
      "S. Shaukat",
      "F. Shirokopetlev",
      "K. Sielewicz",
      "G. Simantovic",
      "M. Sitta",
      "R. J. M. Snellings",
      "W. Snoeys",
      "J. Song",
      "J. M. Sonneveld",
      "R. Spijkers",
      "A. Sturniolo",
      "C. P. Stylianidis",
      "M. Šuljić",
      "D. Sun",
      "X. Sun",
      "R. A. Syed",
      "A. Szczepankiewicz",
      "C. Terrevoli",
      "M. Toppi",
      "A. Trifiró",
      "A. S. Triolo",
      "S. Trogolo",
      "V. Trubnikov",
      "M. Turcato",
      "R. Turrisi",
      "T. Tveter",
      "I. Tymchuk",
      "G. L. Usai",
      "V. Valentino",
      "N. Valle",
      "J. B. Van Beelen",
      "J. W. Van Hoorne",
      "T. Vanat",
      "M. Varga-Kofarago",
      "A. Velure",
      "G. Venier",
      "F. Veronese",
      "A. Villani",
      "A. Viticchié",
      "C. Wabnitz",
      "Y. Wang",
      "P. Yang",
      "E. R. Yeats",
      "I. -K. Yoo",
      "J. H. Yoon",
      "S. Yuan",
      "V. Zaccolo",
      "A. Zampieri",
      "C. Zampolli",
      "E. Zhang",
      "L. Zhang",
      "X. Zhang",
      "Z. Zhang",
      "V. Zherebchevskii",
      "N. Zurlo"
    ],
    "published": "2025-10-31T16:18:13Z",
    "updated": "2025-10-31T16:18:13Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.27548v1",
    "url": "https://arxiv.org/abs/2510.27548v1",
    "pdf_url": "https://arxiv.org/pdf/2510.27548v1.pdf",
    "title": "Plasma Processing Of SRF Cavities at Jefferson Lab: Experiment Results   and Simulation Insight",
    "abstract": "Plasma processing of superconducting radio frequency (SRF) cavities has been an active research effort at Jefferson Lab (JLab) since 2019, aimed at enhancing cavity performance by removing hydrocarbon contaminants and reducing field emission. In this experiment, processing using argon-oxygen and helium-oxygen gas mixtures to find minimum ignition power at different cavity pressure was investigated. Ongoing simulations are contributing to a better understanding of the plasma surface interactions and the fundamental physics behind the process. These simulations, combined with experimental studies, guide the optimization of key parameters such as gas type, RF power, and pressure to ignite plasma using selected higher-order mode (HOM) frequencies. This paper presents experimental data from argon-oxygen and helium-oxygen gas mixture C75 and C100 cavity plasma ignition studies, as well as simulation results for the C100-type cavity based on the COMSOL model previously applied to the C75 cavity.",
    "authors": [
      "I. H. Senevirathne",
      "T. Powers",
      "N. Raut"
    ],
    "published": "2025-10-31T15:26:07Z",
    "updated": "2025-10-31T15:26:07Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.18429/JACoW-NAPAC2025-WEP066"
  },
  {
    "arxiv_id": "2510.20105v2",
    "url": "https://arxiv.org/abs/2510.20105v2",
    "pdf_url": "https://arxiv.org/pdf/2510.20105v2.pdf",
    "title": "High Gain Fusion Target Design using Generative Artificial Intelligence",
    "abstract": "By returning to the topological basics of fusion target design, Generative Artificial Intelligence (genAI) is used to specify how to initially configure and drive the optimally entangled topological state, and stabilize that topological state from disruption. This can be applied to all methods; including tokamaks, laser-driven schemes, and pulsed-power driven schemes. The result is practical, room temperature targets that can yield up to 10 GJ of energy, driven by as little as 3 MJ of absorbed energy. The genAI is based on the concept of Ubuntu that replaces the Deep Convolutional Neural Network approximation of a functional, with the formula for the generating functional of a canonical transformation from the domain of the canonical field momentums and fields, to the domain of the canonical momentums and coordinates, that is the Reduced Order Model. This formula is a logical process of renormalization, enabling Heisenberg's canonical approach to field theory, via calculation of the S-matrix, given observation of the fields. This can be viewed as topological characterization and control of collective, that is complex, systems.",
    "authors": [
      "Michael E. Glinsky"
    ],
    "published": "2025-10-23T01:17:29Z",
    "updated": "2025-10-31T14:58:03Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.27518v1",
    "url": "https://arxiv.org/abs/2510.27518v1",
    "pdf_url": "https://arxiv.org/pdf/2510.27518v1.pdf",
    "title": "The Rayleigh-Taylor instability with foams",
    "abstract": "We analyse the behaviour of the Rayleigh-Taylor instability (RTI) in the presence of a foam. Such a problem may be relevant, for example, to some inertial confinement fusion (ICF) scenarios such as foams within the capsule or lining the inner hohlraum wall. The foam displays 3 different phases: by order of increasing stress, it is first elastic, then plastic, and then fractures. Only the elastic and plastic phases can be subject to a linear analysis of the instability. The growth rate is analytically computed in these 2 phases, in terms of the micro-structure of the foam. In the first, elastic, phase, the RTI can be stabilized for some wavelengths. In this elastic phase, a homogenous foam model overestimates the growth because it ignores the elastic nature of the foam. Although this result is derived for a simplified foam model, it is likely valid for most of them. Besides the ICF context considered here, our results could be relevant for many fields of science.",
    "authors": [
      "Antoine Bret",
      "Audrey DeVault",
      "Skylar Dannhoff",
      "Maria Gatu Johnson",
      "Chikang Li",
      "Johan Frenje"
    ],
    "published": "2025-10-31T14:45:43Z",
    "updated": "2025-10-31T14:45:43Z",
    "categories": [
      "physics.plasm-ph",
      "physics.app-ph",
      "physics.flu-dyn",
      "physics.geo-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.27513v1",
    "url": "https://arxiv.org/abs/2510.27513v1",
    "pdf_url": "https://arxiv.org/pdf/2510.27513v1.pdf",
    "title": "Fast and accurate calculation of the bootstrap current and radial   neoclassical transport in low collisionality stellarator plasmas",
    "abstract": "In this PhD thesis, a method for solving fast and accurately the monoenergetic drift-kinetic equation at low collisionality is presented. The algorithm is based on the analytical properties of the drift-kinetic equation when its dependence on the pitch-angle cosine is represented employing Legendre polynomials as basis functions. The Legendre representation of the monoenergetic drift-kinetic equation possesses a tridiagonal structure, which is exploited by the algorithm presented. The monoenergetic drift-kinetic equation can be solved fast and accurately at low collisionality by employing the standard block tridiagonal algorithm for block tridiagonal matrices. The implementation of the aforementioned algorithm leads to the main result of this thesis: the new neoclassical code MONKES (MONoenergetic Kinetic Equation Solver), conceived to satisfy the necessity of fast and accurate calculations of the bootstrap current for stellarators and in particular for stellarator optimization. MONKES is a new neoclassical code for the evaluation of monoenergetic transport coefficients in stellarators. By means of a convergence study and benchmarks with other codes, it is shown that MONKES is accurate and efficient. The combination of spectral discretization in spatial and velocity coordinates with block sparsity allows MONKES to compute monoenergetic coefficients at low collisionality, in a single core, in approximately one minute. MONKES is sufficiently fast to be integrated into stellarator optimization codes for direct optimization of the bootstrap current (and radial neoclassical transport) and to be included in predictive transport suites.",
    "authors": [
      "Francisco Javier Escoto López"
    ],
    "published": "2025-10-31T14:38:52Z",
    "updated": "2025-10-31T14:38:52Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.27446v1",
    "url": "https://arxiv.org/abs/2510.27446v1",
    "pdf_url": "https://arxiv.org/pdf/2510.27446v1.pdf",
    "title": "Modeling partially-ionized dense plasma using wavepacket molecular   dynamics",
    "abstract": "We develop a wave packet molecular dynamics framework for modeling the structural properties of partially-ionized dense plasmas, based on a chemical model that explicitly includes bound state wavefunctions. Using hydrogen as a representative system, we compute self-consistent charge state distributions through free energy minimization, following the approach of Plummer et al. [Phys. Rev. E 111, 015204 (2025)]. This enables a direct comparison of static equilibrium properties with path integral Monte Carlo data, facilitating an evaluation of the model's underlying approximations and its ability to capture the complex interplay between ionization and structure in dense plasma environments.",
    "authors": [
      "Daniel Plummer",
      "Pontus Svensson",
      "Wiktor Jasniak",
      "Patrick Hollebon",
      "Sam M. Vinko",
      "Gianluca Gregori"
    ],
    "published": "2025-10-31T12:54:32Z",
    "updated": "2025-10-31T12:54:32Z",
    "categories": [
      "physics.plasm-ph",
      "quant-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.27437v1",
    "url": "https://arxiv.org/abs/2510.27437v1",
    "pdf_url": "https://arxiv.org/pdf/2510.27437v1.pdf",
    "title": "MuCol Milestone Report No. 7: Consolidated Parameters",
    "abstract": "This document is comprised of a collection of consolidated parameters for the key parts of the muon collider. These consolidated parameters follow on from the October 2024 Preliminary Parameters Report. Attention has been given to a high-level consistent set of baseline parameters throughout all systems of the complex, following a 10 TeV center-of-mass design. Additional details of the designs contributing to this baseline design are featured in the appendix. Likewise, explorative variations from this baseline set can be found in the appendix. The data is collected from a collaborative spreadsheet and transferred to overleaf.",
    "authors": [
      "Rebecca Taylor",
      "Antoine Chancé",
      "Dario Augusto Giove",
      "Natalia Milas",
      "Roberto Losito",
      "Donatella Lucchesi",
      "Chris Rogers",
      "Lucio Rossi",
      "Daniel Schulte",
      "Carlotta Accettura",
      "Simon Adrian",
      "Rohit Agarwal",
      "Claudia Ahdida",
      "Chiara Aime",
      "Avni Aksoy",
      "Gian Luigi Alberghi",
      "Simon Albright",
      "Siobhan Alden",
      "Luca Alfonso",
      "Muhammad Ali",
      "Anna Rita Altamura",
      "Nicola Amapane",
      "Kathleen Amm",
      "David Amorim",
      "Paolo Andreetto",
      "Fabio Anulli",
      "Ludovica Aperio Bella",
      "Rob Appleby",
      "Artur Apresyan",
      "Pouya Asadi",
      "Mohammed Attia Mahmoud",
      "Bernhard Auchmann",
      "John Back",
      "Anthony Badea",
      "Kyu Jung Bae",
      "E. J. Bahng",
      "Lorenzo Balconi",
      "Fabrice Balli",
      "Laura Bandiera",
      "Carmelo Barbagallo",
      "Daniele Barducci",
      "Roger Barlow",
      "Camilla Bartoli",
      "Nazar Bartosik",
      "Emanuela Barzi",
      "Fabian Batsch",
      "Matteo Bauce",
      "Michael Begel",
      "J. Scott Berg",
      "Andrea Bersani",
      "Alessandro Bertarelli",
      "Francesco Bertinelli",
      "Alessandro Bertolin",
      "Pushpalatha Bhat",
      "Clarissa Bianchi",
      "Michele Bianco",
      "William Bishop",
      "Kevin Black",
      "Fulvio Boattini",
      "Alex Bogacz",
      "Maurizio Bonesini",
      "Bernardo Bordini",
      "Patricia Borges de Sousa",
      "Salvatore Bottaro",
      "Luca Bottura",
      "Steven Boyd",
      "Johannes Braathen",
      "Marco Breschi",
      "Francesco Broggi",
      "Matteo Brunoldi",
      "Xavier Buffat",
      "Laura Buonincontri",
      "Marco Buonsante",
      "Philip Nicholas Burrows",
      "Graeme Campbell Burt",
      "Dario Buttazzo",
      "Barbara Caiffi",
      "Ilkay Turk Cakir",
      "Orhan Cakir",
      "Rama Calaga",
      "Sergio Calatroni",
      "Marco Calviani",
      "Simone Calzaferri",
      "Daniele Calzolari",
      "Kyle Capobianco-Hogan",
      "Vieri Candelise",
      "Silvio Candido",
      "Ali Can Canbay",
      "Claudio Cantone",
      "Rodolfo Capdevilla",
      "Christian Carli",
      "Carlo Carrelli",
      "Fausto Casaburo",
      "Massimo Casarsa",
      "Luca Castelli",
      "Maria Gabriella Catanesi",
      "Lorenzo Cavallucci",
      "Gianluca Cavoto",
      "Francesco Giovanni Celiberto",
      "Luigi Celona",
      "Alessia Cemmi",
      "Sergio Ceravolo",
      "Alessandro Cerri",
      "Francesco Cerutti",
      "Gianmario Cesarini",
      "Cari Cesarotti",
      "Nikolaos Charitonidis",
      "mauro chiesa",
      "Paolo Chiggiato",
      "Vittoria Ludovica Ciccarella",
      "Pietro Cioli Puviani",
      "Anna Colaleo",
      "Francesco Colao",
      "Francesco Collamati",
      "Marco Costa",
      "Nathaniel Craig",
      "David Curtin",
      "Laura D'Angelo",
      "Giacomo Da Molin",
      "Heiko Damerau",
      "Sridhara Dasu",
      "Jorge de Blas",
      "Stefania De Curtis",
      "Herbert De Gersem",
      "Andre de Gouvea",
      "Tommaso Del Moro",
      "Jean-Pierre Delahaye",
      "Dmitri Denisov",
      "Haluk Denizli",
      "Radovan Dermisek",
      "Paula Desiré Valdor",
      "Charlotte Desponds",
      "Luca Di Luzio",
      "Elisa Di Meco",
      "Karri Folan Di Petrillo",
      "Ilaria Di Sarcina",
      "Eleonora Diociaiuti",
      "Tommaso Dorigo",
      "Karlis Dreimanis",
      "Tristan du Pree",
      "Hatice Duran Yildiz",
      "Juhi Dutta",
      "Thomas Edgecock",
      "Mamad Eshraqi",
      "Siara Fabbri",
      "Marco Fabbrichesi",
      "Stefania Farinon",
      "Davide Fazioli",
      "Javier Fernandez Roncal",
      "Guillaume Ferrand",
      "Samuel Ferraro",
      "Jose Antonio Ferreira Somoza",
      "Marco Ferrero",
      "Max Fieg",
      "Frank Filthaut",
      "Patrick Fox",
      "Roberto Franceschini",
      "Rui Franqueira Ximenes",
      "Frank Gaede",
      "Simone Galletto",
      "Michele Gallinaro",
      "Maurice Garcia-Sciveres",
      "Luis Garcia-Tabares",
      "Rocky Bala Garg",
      "Ruben Gargiulo",
      "Cedric Garion",
      "Maria Vittoria Garzelli",
      "Marco Gast",
      "Lisa Generoso",
      "Cecilia E. Gerber",
      "Luca Giambastiani",
      "Alessio Gianelle",
      "Eliana Gianfelice-Wendt",
      "Stephen Gibson",
      "Simone Gilardoni",
      "Valentina Giovinco",
      "Carlo Giraldin",
      "Alfredo Glioti",
      "Arkadiusz Gorzawski",
      "Mario Greco",
      "Christophe Grojean",
      "Alexej Grudiev",
      "Edda Gschwendtner",
      "Emanuele Gueli",
      "Nicolas Guilhaudin",
      "Tao Han",
      "Chengcheng Han",
      "John Michael Hauptman",
      "Matthew Herndon",
      "Adrian D Hillier",
      "Micah Hillman",
      "Gabriela Hoff",
      "Tova Ray Holmes",
      "Samuel Homiller",
      "Walter Hopkins",
      "Lennart Huth",
      "Sudip Jana",
      "Laura Jeanty",
      "Sergo Jindariani",
      "Sofia Johannesson",
      "Benjamin Johnson",
      "Owain Rhodri Jones",
      "Paul-Bogdan Jurj",
      "Yonatan Kahn",
      "Rohan Kamath",
      "Anna Kario",
      "Ivan Karpov",
      "David Kelliher",
      "Wolfgang Kilian",
      "Ryuichiro Kitano",
      "Felix Kling",
      "Antti Kolehmainen",
      "K. C. Kong",
      "Jaap Kosse",
      "Jakub Kremer",
      "Georgios Krintiras",
      "Karol Krizka",
      "Nilanjana Kumar",
      "Erik Kvikne",
      "Robert Kyle",
      "Stephan Lachnit",
      "Emanuele Laface",
      "Elleanor Lamb",
      "Kenneth Lane",
      "Andrea Latina",
      "Anton Lechner",
      "Lawrence Lee",
      "Junghyun Lee",
      "Seh Wook Lee",
      "Thibaut Lefevre",
      "Emanuele Leonardi",
      "Giuseppe Lerner",
      "Gabriele Levati",
      "Filippo Levi",
      "Peiran Li",
      "Qiang Li",
      "Tong Li",
      "Wei Li",
      "Roberto Li Voti",
      "Giulia Liberalato",
      "Mats Lindroos",
      "Ronald Lipton",
      "Da Liu",
      "Zhen Liu",
      "Miaoyuan Liu",
      "Alessandra Lombardi",
      "Shivani Lomte",
      "Kenneth Long",
      "Luigi Longo",
      "José Lorenzo",
      "Ian Low",
      "Xianguo Lu",
      "Tianhuan Luo",
      "Anna Lupato",
      "Yang Ma",
      "Shinji Machida",
      "Edward MacTavish",
      "Thomas Madlener",
      "Lorenzo Magaletti",
      "Marcello Maggi",
      "Tommaso Maiello",
      "Helene Mainaud Durand",
      "Abhishikth Mallampalli",
      "Fabio Maltoni",
      "Jerzy Mikolaj Manczak",
      "Marco Mandurrino",
      "Claude Marchand",
      "Francesco Mariani",
      "Stefano Marin",
      "Samuele Mariotto",
      "Simon Marsh",
      "Stewart Martin-Haugh",
      "David Marzocca",
      "Maria Rosaria Masullo",
      "Giorgio Sebastiano Mauro",
      "Anna Mazzacane",
      "Andrea Mazzolari",
      "Patrick Meade",
      "Barbara Mele",
      "Federico Meloni",
      "Xiangwei Meng",
      "Matthias Mentink",
      "Rebecca Miceli",
      "Abdollah Mohammadi",
      "Dominik Moll",
      "Francesco Montagno Bozzone",
      "Alessandro Montella",
      "Manuel Morales-Alvarado",
      "Mauro Morandin",
      "Marco Morrone",
      "Tim Mulder",
      "Riccardo Musenich",
      "Toni Mäkelä",
      "Elias Métral",
      "Krzysztof Mękała",
      "Emilio Nanni",
      "Marco Nardecchia",
      "Federico Nardi",
      "Felice Nenna",
      "David Neuffer",
      "David Newbold",
      "Daniel Novelli",
      "Maja Olvegård",
      "Yasar Onel",
      "Domizia Orestano",
      "Inaki Ortega Ruiz",
      "John Osborne",
      "Simon Otten",
      "Yohan Mauricio Oviedo Torres",
      "Daniele Paesani",
      "Simone Pagan Griso",
      "Davide Pagani",
      "Kincso Pal",
      "Mark Palmer",
      "Leonardo Palombini",
      "Alessandra Pampaloni",
      "Paolo Panci",
      "Priscilla Pani",
      "Yannis Papaphilippou",
      "Rocco Paparella",
      "Paride Paradisi",
      "Antonio Passeri",
      "Jaroslaw Pasternak",
      "Nadia Pastrone",
      "Kevin Pedro",
      "Antonello Pellecchia",
      "Fulvio Piccinini",
      "Henryk Piekarz",
      "Tatiana Pieloni",
      "Juliette Plouin",
      "Alfredo Portone",
      "Karolos Potamianos",
      "Joséphine Potdevin",
      "Soren Prestemon",
      "Teresa Puig",
      "Ji Qiang",
      "Lionel Quettier",
      "Tanjona Radonirina Rabemananjara",
      "Emilio Radicioni",
      "Raffaella Radogna",
      "Ilaria Carmela Rago",
      "Angira Rastogi",
      "Andris Ratkus",
      "Elodie Resseguie",
      "Juergen Reuter",
      "Pier Luigi Ribani",
      "Cristina Riccardi",
      "Stefania Ricciardi",
      "Caroline Riggall",
      "Tania Robens",
      "Youri Robert",
      "Juan Rojo",
      "Marco Romagnoni",
      "Kevin Ronald",
      "Benjamin Rosser",
      "Carlo Rossi",
      "Leo Rozanov",
      "Maximilian Ruhdorfer",
      "Richard Ruiz",
      "Farinaldo S. Queiroz",
      "Saurabh Saini",
      "Filippo Sala",
      "Claudia Salierno",
      "Tiina Salmi",
      "Paola Salvini",
      "Ennio Salvioni",
      "Nicholas Sammut",
      "Carlo Santini",
      "Alessandro Saputi",
      "Ivano Sarra",
      "Giuseppe Scarantino",
      "Hans Schneider-Muntau",
      "Jessica Scifo",
      "Sally Seidel",
      "Claudia Seitz",
      "Tanaji Sen",
      "Carmine Senatore",
      "Abdulkadir Senol",
      "Daniele Sertore",
      "Lorenzo Sestini",
      "Vladimir Shiltsev",
      "Ricardo César Silva Rêgo",
      "Federica Maria Simone",
      "Kyriacos Skoufaris",
      "Elise Sledge",
      "Valentina Sola",
      "Gino Sorbello",
      "Massimo Sorbi",
      "Stefano Sorti",
      "Lisa Soubirou",
      "Simon Spannagel",
      "David Spataro",
      "Anna Stamerra",
      "Marcel Stanitzki",
      "Steinar Stapnes",
      "Giordon Stark",
      "Marco Statera",
      "Bernd Stechauner",
      "Shufang Su",
      "Wei Su",
      "Ben Suitters",
      "Xiaohu Sun",
      "Alexei Sytov",
      "Yoxara Sánchez Villamizar",
      "Jingyu Tang",
      "Jian Tang",
      "Herman Ten Kate",
      "Pietro Testoni",
      "Leonard Sebastian Thiele",
      "Rogelio Tomas Garcia",
      "Max Topp-Mugglestone",
      "Toms Torims",
      "Riccardo Torre",
      "Luca Tortora",
      "Ludovico Tortora",
      "Luca Tricarico",
      "Sokratis Trifinopoulos",
      "Donato Troiano",
      "Alexander Naip Tuna",
      "Sosoho-Abasi Udongwo",
      "Ilaria Vai",
      "Riccardo Umberto Valente",
      "Giorgio Vallone",
      "Ursula van Rienen",
      "Rob Van Weelderen",
      "Marion Vanwelde",
      "Gueorgui Velev",
      "Rosamaria Venditti",
      "Adam Vendrasco",
      "Adriano Verna",
      "Gianluca Vernassa",
      "Arjan Verweij",
      "Piet Verwilligen",
      "Ludovico Vittorio",
      "Paolo Vitulo",
      "Isabella Vojskovic",
      "Biao Wang",
      "Dayong Wang",
      "Lian-Tao Wang",
      "Xing Wang",
      "Manfred Wendt",
      "Robert Stephen White",
      "Markus Widorski",
      "Mariusz Wozniak",
      "Juliet Wright",
      "Yongcheng Wu",
      "Andrea Wulzer",
      "Keping Xie",
      "Yifeng Yang",
      "Yee Chinn Yap",
      "Katsuya Yonehara",
      "Hwi Dong Yoo",
      "Zhengyun You",
      "Zaib Un Nisa",
      "Marco Zanetti",
      "Angela Zaza",
      "Jinlong Zhang",
      "Liang Zhang",
      "Ruihu Zhu",
      "Alexander Zlobin",
      "Davide Zuliani",
      "José Francisco Zurita"
    ],
    "published": "2025-10-31T12:43:41Z",
    "updated": "2025-10-31T12:43:41Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.5281/zenodo.17476875"
  },
  {
    "arxiv_id": "2510.27406v1",
    "url": "https://arxiv.org/abs/2510.27406v1",
    "pdf_url": "https://arxiv.org/pdf/2510.27406v1.pdf",
    "title": "Muon veto system for the CROSS double-beta decay search experiment",
    "abstract": "In preparation to the CROSS experiment at the Canfranc underground laboratory (Spain) $-$ aiming to search for neutrinoless double-beta ($0\\nu\\beta\\beta$) decay of $^{100}$Mo using low-temperature detectors with heat-scintillation readout $-$ we report on development of a dedicated muon veto system. The need for the muon veto in CROSS is caused by a comparatively high residual cosmic muon flux at the experimental site ($\\sim$20 $\\mu$/m$^2$/h), being a dominant background in the region of interest (ROI) at $\\sim$3 MeV. Thus, we installed the muon veto system around the CROSS low-background setup, forming four lateral, one top, and four bottom sectors. In this paper we describe the design, construction and operation of the CROSS muon veto system, as well as its optimization and validation by comparing dedicated Monte Carlo (MC) simulations of muons with low-temperature measurements in the setup. We demonstrate a stable operation of the veto system with the average trigger rates compatible with MC simulations. Also, we investigated two muon trigger logics based on coincidences with either 2 sectors or a single sector of the veto. The MC study shows that, in combination with the multiplicity cut of thermal detectors, these trigger logics allow to reject 99.2\\% and 99.7\\% of muon-induced events in the ROI, respectively. Despite a comparatively high dead time ($\\sim$18\\%) introduced by coincidences with any of nine sectors of the veto $-$ the adopted strategy $-$ the muon-induced background in the ROI of the CROSS experiment can be reduced down to $\\sim$2 $\\times 10^{-3}$ cnts/keV/kg/yr, i.e., an acceptable level compatible with a high-sensitivity $0\\nu\\beta\\beta$ decay search foreseen in CROSS.",
    "authors": [
      "A. S. Barabash",
      "L. Bergé",
      "M. Buchynska",
      "J. M. Calvo-Mozota",
      "A. Candela",
      "P. Carniti",
      "M. Chapellier",
      "D. Cintas",
      "A. Corsi",
      "I. Dafinei",
      "F. A. Danevich",
      "M. De Deo",
      "L. Dumoulin",
      "F. Ferri",
      "A. Giuliani",
      "C. Gotti",
      "P. Gras",
      "A. Ianni",
      "V. V. Kobychev",
      "S. I. Konovalov",
      "P. Loaiza",
      "P. de Marcillac",
      "S. Marnieros",
      "C. A. Marrache-Kikuchi",
      "M. Martinez",
      "C. Nones",
      "E. Olivieri",
      "A. Ortiz de Solórzano",
      "V. Perez",
      "G. Pessina",
      "D. V. Poda",
      "B. Romualdi",
      "Ph. Rosier",
      "R. Serino",
      "V. I. Tretyak",
      "V. I. Umatov",
      "G. Ursini",
      "M. M. Zarytskyy",
      "A. Zolotarova"
    ],
    "published": "2025-10-31T11:47:56Z",
    "updated": "2025-10-31T11:47:56Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.27372v1",
    "url": "https://arxiv.org/abs/2510.27372v1",
    "pdf_url": "https://arxiv.org/pdf/2510.27372v1.pdf",
    "title": "Ionospheric responses over the Antarctic region to Intense Space Weather   events: Plasma Convection vs. Auroral Precipitation",
    "abstract": "The present investigation is directed at exploring southern polar ionospheric responses to intense space weather events and their correlations with plasma convection and auroral precipitation. The main phases of six geomagnetic storms occurring in the year 2023 (ascending phase of the present solar cycle) are considered for this study. The ionospheric Total Electron Content (TEC) measurements derived from GPS receivers covering the Antarctic region are used for probing the electron density perturbations during these events. Auroral precipitation maps are shown to illustrate the locations of the GPS stations relative to particle precipitation. SuperDARN maps are shown to understand the effects of plasma convection over these locations. Correlation between the enhanced TEC observations with the auroral precipitation (R $\\sim$ 0.31) and the plasma convection (R $\\sim$ 0.88) reveals that the latter is more responsible for causing significant enhancements in the diurnal maximum values of TEC over the Antarctic region in comparison to the former. Therefore, this work shows correlation studies between two physical processes and ionospheric density enhancements over the under-explored south polar region under strong levels of geomagnetic activity during 2023.",
    "authors": [
      "Sumanjit Chakraborty",
      "Gopi K. Seemala"
    ],
    "published": "2025-10-31T11:02:49Z",
    "updated": "2025-10-31T11:02:49Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.EP",
      "astro-ph.SR",
      "physics.geo-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2510.27239v1",
    "url": "https://arxiv.org/abs/2510.27239v1",
    "pdf_url": "https://arxiv.org/pdf/2510.27239v1.pdf",
    "title": "Synchronized Catastrophic Collapse and Extreme Intensity Amplification   of Ultra-Intense Pulses in Near-Resonance Magnetized Plasma",
    "abstract": "Achieving ultra-high field intensities is paramount for advancing compact plasma accelerators and high-energy-density physics, yet it is fundamentally limited by the constraints of focusing distance and nonlinear efficiency. We report a theoretical model demonstrating a highly efficient, magnetically-assisted pathway for extreme laser energy concentration in under-dense plasma. By tuning an external magnetic field near the cyclotron resonance (Ce=0.7), we show a fundamental, nonlinear enhancement of the relativistic self-focusing (RSF) mechanism. This magnetic enhancement drives the pulse into a catastrophic, coupled collapse over an exceptionally short distance of 1.25 Rayleigh lengths. The dynamics result in simultaneous spatial confinement (fr=0.05) and significant temporal self-compression (ft=0.60 ). Crucially, this combined confinement yields a localized peak intensity amplification factor exceeding 103 compared to the initial state. This work confirms a robust and compact method for generating petawatt-scale power densities and provides a direct, actionable blueprint for next-generation laser-plasma experiments.",
    "authors": [
      "Sintu Kumar",
      "Pratibha Jaiswal",
      "Rajesh Kumar Rai"
    ],
    "published": "2025-10-31T07:07:06Z",
    "updated": "2025-10-31T07:07:06Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.09198v2",
    "url": "https://arxiv.org/abs/2510.09198v2",
    "pdf_url": "https://arxiv.org/pdf/2510.09198v2.pdf",
    "title": "Crab-waist interaction region design and integration for the Super   Tau-Charm Facility",
    "abstract": "The Super Tau-Charm Facility (STCF) is a new-generation $e^+e^-$ collider proposed in China, designed to operate in the center-of-mass (CoM) energy range of 2-7 GeV. To achieve the design luminosity exceeding 5*10^34 cm^-2s^-1 at the optimal CoM energy of 4 GeV, a large crossing angle combined with the crab-waist correction scheme is adopted. However, this scheme introduces strong nonlinearities in the interaction region (IR) due to the extremely low vertical beta function of beta_y* <=1 mm, which significantly limits dynamic and momentum apertures of the collider ring. This paper presents a comprehensive modular optics design that addresses these challenges through several key features: 1) local chromaticity correction up to third order to enhance momentum bandwidth; 2) exact -I transformation between chromatic sextupole pairs for nonlinear cancellation; 3) minimization of the dispersion invariant along the IR to improve local momentum acceptance; 4) optimized beta functions at crab sextupole locations to reduce strength requirements and associated nonlinearities. Resonance driving terms analysis confirms effective suppression of geometric aberrations while preserving the intended crab-waist effects. When integrated into the collider ring, the design achieves a Touschek lifetime exceeding 300 s at beam energy of 2 GeV, meeting STCF requirements. The impact of fringe fields from superconducting quadrupoles is mitigated using octupole correctors, and detector solenoid effects are fully suppressed via local anti-solenoid compensation. Furthermore, the defined machine-detector interface layout ensures minimal synchrotron radiation background at the IP beryllium chamber, while ultra-high vacuum conditions are required to suppress beam-gas background. This IR design represents the current optimal solution for STCF and has been incorporated into the project's conceptual design report.",
    "authors": [
      "Linhao Zhang",
      "Tao Liu",
      "Ye Zou",
      "Penghui Yang",
      "Demin Zhou",
      "Jiancong Bao",
      "Ze Yu",
      "Yuhan Jin",
      "Yihao Mo",
      "Sangya Li",
      "Tianlong He",
      "Qing Luo",
      "Jingyu Tang"
    ],
    "published": "2025-10-10T09:39:49Z",
    "updated": "2025-10-31T05:34:01Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.27162v1",
    "url": "https://arxiv.org/abs/2510.27162v1",
    "pdf_url": "https://arxiv.org/pdf/2510.27162v1.pdf",
    "title": "Two-Stage Nature of a Solar Flare with Parallel and Semi-Circular   Ribbons",
    "abstract": "Flare ribbons with parallel and circular morphologies are typically associated with different magnetic reconnection models, and the simultaneous observation of both types in a single event remains rare. Using multi-wavelength observations from a tandem of instruments, we present an M8.2-class flare that occurred on 2023 September 20, which produced quasi-parallel and semi-circular ribbons. The complex evolution of the flare includes two distinct brightening episodes in the quasi-parallel ribbons, corresponding to the two major peaks in the hard X-ray (HXR) light curve. In contrast, the brightening of semi-circular ribbons temporally coincides with the local minimum between the two peaks. Using potential field extrapolation, we reconstruct an incomplete dome-like magnetic structure with a negative polarity embedded within the northwestern part of the semi-circular positive polarity. Consequently, the magnetic configuration comprises two sets of field lines with distinct magnetic connectivities. We suggest that the standard flare reconnection accounts for the two-stage brightening of quasi-parallel ribbons associated with the two HXR peaks. Between the two stages, this process is constrained by the interaction of eruptive structures with the dome. The interaction drives the quasi-separatrix layer reconnection, leading to the brightening of semi-circular ribbons. It also suppresses the standard flare reconnection, resulting in a delayed second HXR peak.",
    "authors": [
      "Ruifei Huang",
      "Hao Ning",
      "Ze Zhong",
      "Ye Qiu",
      "Zhenyong Hou",
      "Yang Su",
      "Chuan Li",
      "Xiangliang Kong",
      "Yao Chen"
    ],
    "published": "2025-10-31T04:17:28Z",
    "updated": "2025-10-31T04:17:28Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2504.21050v2",
    "url": "https://arxiv.org/abs/2504.21050v2",
    "pdf_url": "https://arxiv.org/pdf/2504.21050v2.pdf",
    "title": "High-Precision Physics Experiments at Huizhou Large-Scale Scientific   Facilities",
    "abstract": "In response to the capabilities presented by the High-Intensity Heavy Ion Accelerator Facility (HIAF) and the Accelerator-Driven Subcritical System (CiADS), as well as the proposed Chinese Advanced Nuclear Physics Research Facility (CNUF), we are assembling a consortium of experts in relevant discipline--both domestically and internationally--to delineate high-precision physics experiments that leverage the state-of-the-art research environment afforded by CNUF. Our focus encompasses six primary domains of inquiry: hadron physics--including endeavors such as the super eta factory and investigations into light hadron structures; muon physics; neutrino physics; neutron physics; the testing of fundamental symmetries; and the exploration of quantum effects within nuclear physics, along with the utilization of vortex accelerators. We aim to foster a well-rounded portfolio of large, medium, and small-scale projects, thus unlocking new scientific avenues and optimizing the potential of the Huizhou large scientific facility. The aspiration for international leadership in scientific research will be a guiding principle in our strategic planning. This initiative will serve as a foundational reference for the Institute of Modern Physics in its strategic planning and goal-setting, ensuring alignment with its developmental objectives while striving to secure a competitive edge in technological advancement. Our ambition is to engage in substantive research within these realms of high-precision physics, to pursue groundbreaking discoveries, and to stimulate progress in China's nuclear physics landscape, positioning Huizhou as a preeminent global hub for advanced nuclear physics research.",
    "authors": [
      "FengPeng An",
      "Dong Bai",
      "Siyuan Chen",
      "Xurong Chen",
      "Hongyue Duyang",
      "Leyun Gao",
      "Shao-Feng Ge",
      "Jun He",
      "Junting Huang",
      "Zhongkui Huang",
      "Igor Ivanov",
      "Chen Ji",
      "Huan Jia",
      "Junjie Jiang",
      "Xiaolin Kang",
      "Soo-Bong Kim",
      "Chui-Fan Kong",
      "Wei Kou",
      "Qiang Li",
      "Qite Li",
      "Jiajun Liao",
      "Jiajie Ling",
      "Cheng-en Liu",
      "Xinwen Ma",
      "Hao Qiu",
      "Jian Tang",
      "Rong Wang",
      "Weiqiang Wen",
      "Jia-Jun Wu",
      "Jun Xiao",
      "Xiang Xiao",
      "Yu Xu",
      "Weihua Yang",
      "Xiaofei Yang",
      "Jiangming Yao",
      "Ye Yuan",
      "Mushtaq Zaiba",
      "Pengming Zhang",
      "Shaofeng Zhang",
      "Shuo Zhang",
      "Shihan Zhao",
      "Liping Zou"
    ],
    "published": "2025-04-29T01:54:31Z",
    "updated": "2025-10-31T02:33:20Z",
    "categories": [
      "hep-ph",
      "hep-ex",
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2510.27105v1",
    "url": "https://arxiv.org/abs/2510.27105v1",
    "pdf_url": "https://arxiv.org/pdf/2510.27105v1.pdf",
    "title": "Plasma fibre using bright-core helicon plasma",
    "abstract": "This paper reports an innovative concept of ``plasma fibre\" using bright-core helicon plasma, inspired by its spatial and spectral similarities to the well-known optical fibre. Theoretical analyses are presented for both ideal case of step-like density profile and the realistic case of Gaussian density profile in radius. The total reflection of electromagnetic waves near the sharp plasma density gradient and consequently the wave-guide feature could indeed happen if the incident angle is larger than a threshold value. Numerical computations using electromagnetic solver that based on Maxwell's equations and cold-plasma dielectric tensor yield consistent results. The experimental verification and prospective applications are also suggested. The ``plasma fibre\" could be functional component that embedded into existing communication systems for special purpose based on its capability of dynamic reconfiguration.",
    "authors": [
      "Lei Chang",
      "Zi-Chen Kan",
      "Jing-Jing Ma",
      "Saikat Chakraborty Thakur",
      "Juan Francisco Caneses"
    ],
    "published": "2025-10-31T02:01:13Z",
    "updated": "2025-10-31T02:01:13Z",
    "categories": [
      "physics.plasm-ph",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.09260v2",
    "url": "https://arxiv.org/abs/2509.09260v2",
    "pdf_url": "https://arxiv.org/pdf/2509.09260v2.pdf",
    "title": "Study of a Compact Device for Water Attenuation Length Measurements",
    "abstract": "This study presents the development and validation of a compact device for measuring the water attenuation length (WAL), utilizing photomultiplier tubes (PMTs), optical fibers, and light-emitting diodes (LEDs). An 8 m water tank and the device was constructed and validated in the laboratory. The device is capable of measuring WAL values up to 50 m. The stray light was blocked mainly by a custom-designed shutter. Toy Monte Carlo simulations were employed to evaluate the measurement uncertainty, which was found to be within reasonable limits. These simulations further indicate that the uncertainty can be reduced and more accurately predicted for a larger-scale device with a length of 30 m. Real-time monitoring was achieved by integrating the device into a water purification circulation system, providing a practical, scalable solution for WAL measurement in future large-scale water Cherenkov detectors.",
    "authors": [
      "Junyou Chen",
      "Jilei Xu",
      "Yongbo Huang",
      "Sibo Wang",
      "Chuanshi Dong",
      "Haoqi Lu",
      "Changgen Yang",
      "Yongpeng Zhang",
      "Yi Wang"
    ],
    "published": "2025-09-11T08:44:16Z",
    "updated": "2025-10-31T00:23:21Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.27053v1",
    "url": "https://arxiv.org/abs/2510.27053v1",
    "pdf_url": "https://arxiv.org/pdf/2510.27053v1.pdf",
    "title": "Comparing the magnetic Rayleigh-Taylor instability dynamics in two- and   three-dimensions",
    "abstract": "The magnetic Rayleigh-Taylor instability (MRTI) governs plasma mixing and transport in a wide range of astrophysical and laboratory systems. Owing to computational constraints, MRTI is often studied using two-dimensional (2D) simulations, but the extent to which 2D captures the true three-dimensional (3D) dynamics remains unclear. In this work, we perform direct numerical simulations of non-ideal, incompressible MRTI in both 2D and 3D, systematically varying the magnetic field strength from weakly to strongly magnetized regimes. We find that the 3D system exhibits richer mode interactions due to the coexistence of interchange, undular, and mixed modes structures that are inherently absent in 2D. The mixing layer in 3D has enhanced small-scale mixing and reduced fluid dispersion compared to 2D, which is characterized by large-scale plumes. Energy diagnostics reveal that the gravitational potential energy released is higher in 2D, primarily because of inefficient mixing and significant fluid dispersion. In contrast, 3D systems display greater energy dissipation and anisotropy, driven by small-scale vortical motions. The non-linear growth of the instability increases monotonically with magnetic field strength in 3D but shows a non-monotonic trend in 2D. Despite these broad differences, the rate of magnetic-to-kinetic energy conversion remains remarkably similar across dimensions, indicating that 2D simulations can meaningfully capture reconnection-driven processes but not the full turbulent evolution. Overall, our results demonstrate that 2D MRTI simulations cannot reliably represent 3D mixing, energy dynamics, or nonlinear growth, highlighting the fundamental importance of three-dimensionality in magnetized plasma instabilities.",
    "authors": [
      "Manohar Teja Kalluri",
      "Andrew Hillier"
    ],
    "published": "2025-10-30T23:47:24Z",
    "updated": "2025-10-30T23:47:24Z",
    "categories": [
      "physics.flu-dyn",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.flu-dyn"
  },
  {
    "arxiv_id": "2510.27000v1",
    "url": "https://arxiv.org/abs/2510.27000v1",
    "pdf_url": "https://arxiv.org/pdf/2510.27000v1.pdf",
    "title": "Non-uniform Birefringence in Highly-reflective Substrate-Transferred   GaAs/Al$_{0.92}$Ga$_{0.08}$As Coatings at 1064 nm",
    "abstract": "Using a custom-built scanning system, we generated maps of birefringence on reflection at $\\lambda=1064$~nm from single-crystal GaAs/Al$_{0.92}$Ga$_{0.08}$As Bragg reflectors (henceforth ``AlGaAs coatings''). Ten coatings were bonded to fused silica substrates and one remained on the epitaxial growth wafer. The average phase difference on reflection between beams polarized along the fast and slow axes of the coating was found to be $\\psi = 1.09 \\pm 0.18$~mrad, consistent with values observed in high-finesse optical reference cavities using similar AlGaAs coatings. Scans of substrate-transferred coatings with diameters between 18 and 194 millimeters showed birefringence non-uniformity at a median level of $0.1$~mrad. A similar epitaxial multilayer that was not substrate transferred, but remained on the growth wafer, had by far the least birefringence non-uniformity of all mirrors tested at $0.02$~mrad. On the other hand, the average birefringence of the epi-on-wafer coating and substrate-transferred coatings was indistinguishable. Excluding non-uniformity found at the location of crystal and bonding defects, we conclude that the observed non-uniformity was imparted during the substrate transfer process, likely during bonding. Quantifying the impact on the scatter loss in a LIGO-like interferometer, we find that birefringence non-uniformity at the levels seen here is unlikely to have a significant impact on performance. Nonetheless, future efforts will focus on improved process control to minimize and ultimately eliminate the observed non-uniformity.",
    "authors": [
      "Andri M. Gretarsson",
      "Ambroise L. M. Juston",
      "Benjamin Nicolai",
      "Naomi Borg",
      "Breck N. Meagher",
      "Garrett D. Cole",
      "GariLynn Billingsley",
      "Camille N. Makarem",
      "Elizabeth M. Gretarsson",
      "Gregory M. Harry",
      "Steven D. Penn"
    ],
    "published": "2025-10-30T21:01:03Z",
    "updated": "2025-10-30T21:01:03Z",
    "categories": [
      "physics.optics",
      "astro-ph.IM",
      "gr-qc",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2510.26986v1",
    "url": "https://arxiv.org/abs/2510.26986v1",
    "pdf_url": "https://arxiv.org/pdf/2510.26986v1.pdf",
    "title": "MRX: A differentiable 3D MHD equilibrium solver without nested flux   surfaces",
    "abstract": "This article introduces a new 3D magnetohydrodynamic (MHD) equilibrium solver, based on the concept of admissible variations of B, p that allows for magnetic relaxation of a magnetic field in a perturbed/non-minimum energy state to a lower energy state. We describe the mathematical theory behind this method, including ensuring certain bounds on the magnetic energy, and the differential geometry behind transforming to and from a logical domain and physical domain. Our code is designed to address a number of traditional challenges to 3D MHD equilibrium solvers, e.g. exactly enforcing physical constraints such as divergence-free magnetic field, exhibiting high levels of numerical convergence, dealing with complex geometries, and modeling stochastic field lines or chaotic behavior. By using differentiable Python, our numerical method comes with the additional benefits of computational efficiency on modern computing architectures, high code accessibility, and differentiability at each step. The proposed magnetic relaxation solver is robustly benchmarked and tested with standard examples, including solving 2D toroidal equilibria at high-beta, and a rotating ellipse stellarator. Future work will address the integration of this code for 3D equilibrium optimization for modeling magnetic islands and chaos in stellarator fusion devices.",
    "authors": [
      "Tobias Blickhan",
      "Julianne Stratton",
      "Alan A. Kaptanoglu"
    ],
    "published": "2025-10-30T20:28:16Z",
    "updated": "2025-10-30T20:28:16Z",
    "categories": [
      "physics.comp-ph",
      "physics.plasm-ph",
      "76W05 (Primary) 49-04, 76M10, 78M10 (Secondary)"
    ],
    "primary_category": "physics.comp-ph"
  },
  {
    "arxiv_id": "2510.26747v1",
    "url": "https://arxiv.org/abs/2510.26747v1",
    "pdf_url": "https://arxiv.org/pdf/2510.26747v1.pdf",
    "title": "Spectral Deconvolution without the Deconvolution: Extracting Temperature   from X-ray Thomson Scattering Spectra without the Source-and-Instrument   Function",
    "abstract": "X-ray Thomson scattering (XRTS) probes the dynamic structure factor of the system, but the measured spectrum is broadened by the combined source-and-instrument function (SIF) of the setup. In order to extract properties such as temperature from an XRTS spectrum, the broadening by the SIF needs to be removed. Recent work [Dornheim et al. Nature Commun. 13, 7911 (2022)] has suggested that the SIF may be deconvolved using the two-sided Laplace transform. However, the extracted information can depend strongly on the shape of the input SIF, and the SIF is in practice challenging to measure accurately. Here, we propose an alternative approach: we demonstrate that considering ratios of Laplace-transformed XRTS spectra collected at different scattering angles is equivalent to performing the deconvolution, but without the need for explicit knowledge of the SIF. From these ratios, it is possible to directly extract the temperature from the scattering spectra, when the system is in thermal equilibrium. We find the method to be generally robust to spectral noise and physical differences between the spectrometers, and we explore situations in which the method breaks down. Furthermore, the fact that consistent temperatures can be extracted for systems in thermal equilibrium indicates that non-equilibrium effects could be identified by inconsistent temperatures of a few eV between the ratios of three or more scattering angles.",
    "authors": [
      "Thomas Gawne",
      "Alina Kononov",
      "Andrew Baczewski",
      "Hannah Bellenbaum",
      "Maximilian P Böhme",
      "Zhandos Moldabekov",
      "Thomas R Preston",
      "Sebastian Schwalbe",
      "Jan Vorberger",
      "Tobias Dornheim"
    ],
    "published": "2025-10-30T17:40:50Z",
    "updated": "2025-10-30T17:40:50Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.26741v1",
    "url": "https://arxiv.org/abs/2510.26741v1",
    "pdf_url": "https://arxiv.org/pdf/2510.26741v1.pdf",
    "title": "Characterization of the H2M Monolithic CMOS Sensor",
    "abstract": "The H2M (Hybrid-to-Monolithic) is a monolithic pixel sensor manufactured in a modified \\SI{65}{\\nano\\meter}~CMOS imaging process with a small collection electrode. Its design addresses the challenges of porting an existing hybrid pixel detector architecture into a monolithic chip, using a digital-on-top design methodology, and developing a compact digital cell library. Each square pixel integrates an analog front-end and digital pulse processing with an 8-bit counter within a \\SI{35}{\\micro\\meter}~pitch.   This contribution presents the performance of H2M based on laboratory and test beam measurements, including a comparison with analog front-end simulations in terms of gain and noise. A particular emphasis is placed on backside thinning in order to reduce material budget, down to a total chip thickness of \\SI{21}{\\micro\\meter} for which no degradation in MIP detection performance is observed. For all investigated samples, a MIP detection efficiency above \\SI{99}{\\%} is achieved below a threshold of approximately 205 electrons. At this threshold, the fake-hit rate corresponds to a matrix occupancy of fewer than one pixel per the \\SI{500}{\\nano\\second}~frame.   Measurements reveal a non-uniform in-pixel response, attributed to the formation of local potential wells in regions with low electric field. A simulation flow combining technology computer-aided design, Monte Carlo, and circuit simulations is used to investigate and describe this behavior, and is applied to develop mitigation strategies for future chip submissions with similar features.",
    "authors": [
      "Rafael Ballabriga",
      "Eric Buschmann",
      "Michael Campbell",
      "Raimon Casanova Mohr",
      "Dominik Dannheim",
      "Jona Dilg",
      "Ana Dorda",
      "Ono Feyens",
      "Finn King",
      "Philipp Gadow",
      "Ingrid-Maria Gregor",
      "Karsten Hansen",
      "Yajun He",
      "Lennart Huth",
      "Iraklis Kremastiotis",
      "Stephan Lachnit",
      "Corentin Lemoine",
      "Stefano Maffessanti",
      "Larissa Mendes",
      "Younes Otarid",
      "Christian Reckleben",
      "Sébastien Rettie",
      "Manuel Alejandro del Rio Viera",
      "Sara Ruiz Daza",
      "Judith Schlaadt",
      "Adriana Simancas",
      "Walter Snoeys",
      "Simon Spannagel",
      "Tomas Vanat",
      "Anastasiia Velyka",
      "Gianpiero Vignola",
      "Håkan Wennlöf"
    ],
    "published": "2025-10-30T17:38:03Z",
    "updated": "2025-10-30T17:38:03Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.26665v1",
    "url": "https://arxiv.org/abs/2510.26665v1",
    "pdf_url": "https://arxiv.org/pdf/2510.26665v1.pdf",
    "title": "Quantifying Resolution in Pink Beam Dark Field X-ray Microscopy:   Experiments and Simulations",
    "abstract": "Pink-beam Dark-Field X-ray Microscopy (pDFXM) is a powerful emerging technique for time-resolved studies of microstructure and strain evolution in bulk crystalline materials. In this work, we systematically assess the performance of pDFXM relative to monochromatic DFXM when using a compound refractive lens (CRL) as the objective. Analytical expressions for the spatial and angular resolution are derived and compared with numerical simulations based on geometrical optics and experimental data. The pink-beam configuration provides an increased diffraction intensity depending on the deformation state of the sample, accompanied by a general tenfold degradation in angular resolution along the rocking and longitudinal directions. This trade-off is disadvantageous for axial strain mapping, but can be advantageous in cases where integrated intensities are needed. For a perfect crystal under parallel illumination with a pink beam, our results show that chromatic aberration is absent, whereas under condensed illumination it becomes significant. The aberration is shown to depend strongly on the local distortion of the crystal. Weak-beam imaging conditions, such as those required for resolving dislocations, are shown to remain feasible under pink-beam operation and may even provide an improved signal-to-noise ratio. The higher incident flux, enhanced by nearly two orders of magnitude, is quantified in terms of beam heating effects, and implications for optimized scanning protocols are discussed.",
    "authors": [
      "Michela La Bella",
      "Henning Friis Poulsen",
      "Steffen Staeck",
      "Nils Axel Henningsson",
      "Merve Pinar Kabukcuoglu",
      "Carsten Detlefs",
      "Can Yildirim"
    ],
    "published": "2025-10-30T16:34:59Z",
    "updated": "2025-10-30T16:34:59Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2507.15398v2",
    "url": "https://arxiv.org/abs/2507.15398v2",
    "pdf_url": "https://arxiv.org/pdf/2507.15398v2.pdf",
    "title": "Multi-scale optimal control for Einstein Telescope active seismic   isolation",
    "abstract": "We present a multi-scale optimal control framework for active seismic isolation in the Einstein Telescope, a third-generation gravitational-wave observatory. Our approach jointly optimizes feedback and blending filters in a cross-coupled opto-mechanical system using a unified cost function based on the \"acausal optimum,\" which quantifies sensor signal-to-noise ratios across frequencies. This method enables efficient re-optimization under varying sensor configurations and environmental conditions. We apply the framework to two candidate sensing systems using their modeled sensitivity: OmniSens-a six-degree-of-freedom inertial isolation system-and BRS-T360, which combines Beam Rotation Sensor (BRS) as an inertial tilt sensor with T360 as a horizontal seismometer. We demonstrate superior low-frequency isolation with OmniSens, reducing platform motion by up to two orders of magnitude near the microseism. The framework allows for ready optimization and projection of sensor noise to metrics relevant to the performance of the instrument, aiding the design of the Einstein Telescope.",
    "authors": [
      "Pooya Saffarieh",
      "Nathan A. Holland",
      "Michele Valentini",
      "Jesse van Dongen",
      "Alexandra Mitchell",
      "Sander Sijtsma",
      "Armin Numic",
      "Wouter Hakvoort",
      "Conor Mow-Lowry"
    ],
    "published": "2025-07-21T09:00:12Z",
    "updated": "2025-10-30T16:16:24Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.21883v3",
    "url": "https://arxiv.org/abs/2509.21883v3",
    "pdf_url": "https://arxiv.org/pdf/2509.21883v3.pdf",
    "title": "Enhancing Particle Identification in Helium-Based Drift Chambers Using   Cluster Counting Insights from Beam Test Studies",
    "abstract": "Particle identification in gaseous detectors traditionally relies on energy loss measurements (dE/dx); however, uncertainties in total energy deposition limit its resolution. The cluster counting technique (dN/dx) offers an alternative approach by exploiting the Poisson-distributed nature of primary ionization, providing a statistically robust method for mass determination. Simulation studies with Garfield++ and Geant4 indicate that dN/dx can achieve twice the resolution of dE/dx in helium-based drift chambers. However, experimental implementation is challenging due to signal overlap in the time domain, complicating the identification of electron peaks and ionization clusters. This paper presents novel algorithms and modern computational techniques to address these challenges, facilitating accurate cluster recognition in experimental data. The effectiveness of these algorithms is validated through four beam tests conducted at CERN, utilizing various helium gas mixtures, gas gains, and wire orientations relative to ionizing tracks. The experiments employ a muon beam (1 GeV/c to 180 GeV/c) with drift tubes of different sizes and sense wire diameters. The analysis explores the Poisson nature of cluster formation, evaluates the performance of different clustering algorithms, and examines the dependence of counting efficiency on the beam particle impact parameter. Furthermore, a comparative study of the resolution achieved using dN/dx and dE/dx is presented.",
    "authors": [
      "W. Elmetenawee",
      "M. Abbrescia",
      "M. Anwar",
      "G. Chiarello",
      "A. Corvaglia",
      "F. Cuna",
      "B. D'Anzi",
      "N. De Filippis",
      "F. De Santis",
      "M. Dong",
      "E. Gorini",
      "F Grancagnolo",
      "F. G. Gravili",
      "K. Johnson",
      "S. Liu",
      "M. Louka",
      "A. Miccoli",
      "M. Panareo",
      "M. Primavera",
      "F. M. Procacci",
      "A. Taliercio",
      "G. Tassielli",
      "A. Ventura L. Wu",
      "G. Zhao"
    ],
    "published": "2025-09-26T05:15:47Z",
    "updated": "2025-10-30T16:15:24Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.26640v1",
    "url": "https://arxiv.org/abs/2510.26640v1",
    "pdf_url": "https://arxiv.org/pdf/2510.26640v1.pdf",
    "title": "Nonlocal Model for Electron Heat Flux and Self-generated Magnetic Field",
    "abstract": "Coupling of electron heat conduction and magnetic field takes significant effects in inertial confinement fusion (ICF). As the nonlocal models for electron heat conduction have been developed for modeling kinetic effects on heat flux in hydrodynamic scale, modeling kinetic effects on magnetic field are still restricted to flux limiters instead of nonlocal corrections. We propose a new nonlocal model which can recover the kinetic effects for heat conduction and magnetic field in hydrodynamic scale simultaneously. We clarify the necessity of self-consistently considering the electric field corrections in nonlocal models to get reasonable physical quantities. Using the new nonlocal model, the nonlocal corrections of transport coefficients in magnetized plasma and the magnetic field generation without density gradients are systematically studied. We find nonlocal effects significantly change the magnetic field distribution in laser ablation, which potentially influences the hydrodynamic instabilities in ICF.",
    "authors": [
      "Xinyu Zhu",
      "Wenqiang Yuan",
      "Yusen Wang",
      "Zhipeng Zhang",
      "Xianxu Jin",
      "Zhonghai Zhao",
      "Bin Qiao"
    ],
    "published": "2025-10-30T16:08:13Z",
    "updated": "2025-10-30T16:08:13Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.18497v3",
    "url": "https://arxiv.org/abs/2507.18497v3",
    "pdf_url": "https://arxiv.org/pdf/2507.18497v3.pdf",
    "title": "Characterization of Lateral Amorphous Selenium Photodetectors for   Low-Photon and VUV Detection at Cryogenic Temperatures",
    "abstract": "The performance of amorphous selenium (a-Se) as a cryogenic photodetector material is evaluated through a series of experiments using laterally structured devices operated in a custom optical test stand. These studies investigate the response of a-Se detectors to low-photon fluxes at high electric fields near avalanche conditions, the linearity of the photoconductive response over a wide dynamic range and the direct detection of narrowband 130 nm vacuum ultraviolet (VUV) illumination. At 87 K, matched-filter analysis shows reliable single-shot detection with efficiencies greater than or equal to 80 percent and area under the curve (AUC) greater than or equal to 0.85 using as few as approximately 6800 incident 401 nm photons, corresponding to approximately 3400 photons within field-active regions after accounting for geometric constraints. Measurements are performed at cryogenic temperatures using calibrated photon fluxes derived from a silicon photomultiplier reference and a characterized optical filter stack. Additional experiments using a tellurium-doped a-Se (a-SeTe) device explore the material's behavior under identical test conditions and demonstrate that avalanche is achievable in a-SeTe at cryogenic temperatures. The results demonstrate reproducible low-noise operation, VUV sensitivity and field-dependent gain behavior in a lateral a-Se architecture, representing the first reported observation of avalanche multiplication in laterally structured a-Se and a-SeTe devices at cryogenic temperatures. These findings support the potential integration of laterally structured a-Se devices into next-generation pixelated liquid-argon time projection chambers (TPCs) requiring scalable, high-field-compatible photon detection systems.",
    "authors": [
      "M. Rooks",
      "S. Abbaszadeh",
      "J. Asaadi",
      "V. A. Chirayath",
      "M. Febbraro",
      "M. Á. García-Peris",
      "E. Gramellini",
      "K. Hellier",
      "B. Sudarsan",
      "I. Tzoka"
    ],
    "published": "2025-07-24T15:10:57Z",
    "updated": "2025-10-30T15:24:00Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2505.10456v2",
    "url": "https://arxiv.org/abs/2505.10456v2",
    "pdf_url": "https://arxiv.org/pdf/2505.10456v2.pdf",
    "title": "Comparison of high-order moment models for the ion dynamics in a bounded   low-temperature plasma",
    "abstract": "Low-temperature plasmas often present non-equilibrium ion distribution functions due to the collisions with the background gas and the presence of strong electric fields. This non-equilibrium is beyond classical fluid models, often requiring computationally-intensive kinetic simulations. In our work, we study high-order moment models in order to capture the non-equilibrium state with a macroscopic set of equations, which is more computationally efficient than kinetic simulations. We compare numerical simulations of different moment closures: Grad's closure, the hyperbolic quadrature method of moments (HyQMOM), the extended quadrature method of moments, and a method based on entropy maximization. We assess the different closures for plasma applications and propose efficient numerical discretizations. The numerical solution of the high-order moment models is compared to kinetic simulations of an argon plasma between two floating walls at different pressure regimes, from nearly collisionless to collisionally-dominated. In general, all the high-order moment closures capture the ion transport with high fidelity as compared to the kinetic simulations, providing an improvement as compared to classical fluid models. Classical fluid closures such as the Fourier law for the heat flux is shown to be not suitable to capture the sheath or the low pressure regime. In addition, the ability of each moment method to reconstruct the velocity distribution function from the moments is assessed. The high-order moment models are able to capture the non-equilibrium distributions in the bulk and sheath with remarkable fidelity, dramatically improving classical fluid models while having comparable computational cost. In particular, the HyQMOM shows to be a robust method that provides an excellent comparison with the kinetic simulations of both the moments and the distribution function in the bulk and the sheath.",
    "authors": [
      "Anatole Berger",
      "Thierry Magin",
      "Anne Bourdon",
      "Alejandro Alvarez Laguna"
    ],
    "published": "2025-05-15T16:12:50Z",
    "updated": "2025-10-30T10:18:23Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1063/5.0281989"
  },
  {
    "arxiv_id": "2510.06703v4",
    "url": "https://arxiv.org/abs/2510.06703v4",
    "pdf_url": "https://arxiv.org/pdf/2510.06703v4.pdf",
    "title": "Developing a Cost-Effective Spectrometer: A Practical Approach",
    "abstract": "The paper demonstrates the design and execution of a low-cost optical spectrometer that employs a webcam, diffraction grating & Python (a free, open-source programming language). The device's design prioritized economy and usability, with a black box casing to reduce stray light and increase measurement accuracy. A diffraction grating made from a DVD was used to split light into its constituent wavelengths, which were then collected by the camera. The calibration procedure used a RED TIDE USB650 Fiber Optic Spectrometer to set calibration values for various wavelength ranges, which ensured that the spectrometer's results closely matched those derived from the former, a high-cost industry-standard model. Spectrums of several light sources, such as red, green, blue, yellow, white, magenta, orange, and UV LEDs, as well as a green laser, were studied and compared. The results showed a high level of precision, with minimal divergence from industry-standard spectrometer measurements. This comparison was carried out utilizing Origin software, which allowed for extensive analysis and display of the spectrum data. In addition, the spectrometer captured data in real time, allowing users to watch live spectrum changes and ensure instant accessibility of results. Despite its simplicity and low cost, the spectrometer provides significant value for instructional and practical applications, making it a valuable tool in cost-constrained situations.",
    "authors": [
      "Zafrin Jahan Nikita",
      "Mohammad Tahsin Alam",
      "Yasir Mahmud",
      "Rafichha Yasmin",
      "Fairuz Darimi Bushra",
      "Sheikh Hasib Cheragee",
      "Redwanul Talukder Zeem"
    ],
    "published": "2025-10-08T06:58:18Z",
    "updated": "2025-10-30T09:24:25Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2410.07965v2",
    "url": "https://arxiv.org/abs/2410.07965v2",
    "pdf_url": "https://arxiv.org/pdf/2410.07965v2.pdf",
    "title": "Field enhancement of intense laser pulses in a subwavelength plasma   aperture",
    "abstract": "The interaction of intense, ultra-short laser pulses with nanostructures offers promising avenues for spatiotemporal light control. While enhanced optical transmission through subwavelength apertures has been extensively studied in the linear regime, its extension to ultrashort, high-intensity pulses remains largely unexplored. Here we demonstrate, through three-dimensional particle-in-cell simulations, significant field enhancement of intense laser pulses in subwavelength plasma apertures. The enhancement exhibits a non-resonant character, remaining robust across a wide range of plasma densities and saturating above approximately $20n_c$, while showing minimal dependence on wall thickness. Analysis of the Poynting vector reveals that energy concentration arises from interference between the incident field and back-scattered longitudinal field components. This size-dependent enhanced transmission in plasma apertures enables potential applications such as plasma-based dichroic filters operating at extreme intensities.",
    "authors": [
      "Xiaohui Gao"
    ],
    "published": "2024-10-10T14:26:42Z",
    "updated": "2025-10-30T07:16:08Z",
    "categories": [
      "physics.optics",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2510.26195v1",
    "url": "https://arxiv.org/abs/2510.26195v1",
    "pdf_url": "https://arxiv.org/pdf/2510.26195v1.pdf",
    "title": "The IDEA detector concept for FCC-ee",
    "abstract": "The electron-positron stage of the Future Circular Collider (FCC-ee) provides exciting opportunities that are enabled by next generation particle physics detectors. This contribution presents IDEA, a detector concept optimised for FCC-ee and composed of a vertex detector based on MAPS, a very light drift chamber, a silicon wrapper, a high resolution dual-readout crystal electromagnetic calorimeter, an HTS based superconducting solenoid, a dual-readout fibre calorimeter, and three layers of muon chambers embedded in the magnet flux return yoke. In particular, the physics requirements and the technical solutions chosen in the various sub-systems to address them are discussed. This is followed by a description of the detector R&D currently in progress, test-beam results, and the expected performance on some key physics benchmarks.",
    "authors": [
      "Armin Ilg"
    ],
    "published": "2025-10-30T07:11:51Z",
    "updated": "2025-10-30T07:11:51Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.26175v1",
    "url": "https://arxiv.org/abs/2510.26175v1",
    "pdf_url": "https://arxiv.org/pdf/2510.26175v1.pdf",
    "title": "High-order Mie resonance and transient field enhancement in laser-driven   plasma nanoshells",
    "abstract": "We demonstrate substantial field enhancement in plasma nanoshells through high-order Mie resonances using combined Mie theory and particle-in-cell simulations. Optimal shell geometries yield approximately threefold electric field enhancement for 800 nm irradiation, with transient buildup times of tens of femtoseconds before plasma expansion disrupts resonance. Few-cycle pulses produce reduced enhancement due to insufficient resonance establishment. These findings enable optimized laser-plasma interactions for applications including diagnostics of laser-cluster interaction and energetic ion production from engineered core-shell targets, highlighting the critical role of temporal dynamics in nanoplasma resonances.",
    "authors": [
      "Xiaohui Gao"
    ],
    "published": "2025-10-30T06:32:29Z",
    "updated": "2025-10-30T06:32:29Z",
    "categories": [
      "physics.plasm-ph",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.26162v1",
    "url": "https://arxiv.org/abs/2510.26162v1",
    "pdf_url": "https://arxiv.org/pdf/2510.26162v1.pdf",
    "title": "Design and Implementation of a Fast-Sweeping Langmuir Probe Diagnostic   for DC Arc Jet Environments",
    "abstract": "Langmuir probe diagnostics are a cornerstone of plasma characterization, providing critical measurements of electron temperature, electron density, and plasma potential. However, conventional swept Langmuir probes and other traditional electrostatic probes often lack the temporal resolution necessary to capture transient plasma behavior in dynamic environments. This paper presents the design and implementation of a fast-sweeping Langmuir probe system that is open-source, low-cost, and adaptable for a wide range of plasma applications. The probe system incorporates voltage sweeping to resolve rapid fluctuations in plasma parameters at a temporal resolution of up to 200 kHz. To validate its performance, the system was implemented in the 30 kW miniature Arc jet Research Chamber (mARC II), a high-enthalpy DC arc jet facility designed for prototype testing and development. Experimental results demonstrate the probe's capability to operate in extreme aerothermal conditions, providing time-resolved electron temperature and density along the flow's radial profile. This work establishes a robust and accessible Langmuir diagnostic solution for researchers studying transient plasma behavior in high-enthalpy environments.",
    "authors": [
      "Sebastian V. Colom",
      "Magnus A. Haw",
      "Jocelino Rodrigues"
    ],
    "published": "2025-10-30T05:57:06Z",
    "updated": "2025-10-30T05:57:06Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.26155v1",
    "url": "https://arxiv.org/abs/2510.26155v1",
    "pdf_url": "https://arxiv.org/pdf/2510.26155v1.pdf",
    "title": "Optimization of the Compact Stellarator with Simple Coils at finite-beta",
    "abstract": "An optimized stellarator at finite plasma beta is realized by single-stage optimization of simply modifying the coil currents of the Compact Stellarator with Simple Coils (CSSC)[Yu et al., J. Plasma Physics 88,905880306 (2022)]. The CSSC is an optimized stellarator obtained by direct optimization via coil shapes, with its coil topology similar to that of the Columbia Non-neutral Torus (CNT) [Pederson et al., Phys. Rev. Lett. 88, 205002 (2002)]. Due to its vacuum-based optimization, the CSSC exhibits detrimental finite beta effects on neoclassical confinement. The results of optimization show that the finite beta effects can be largely mitigated by reducing the coil currents of CSSC.",
    "authors": [
      "Haorong Qiu",
      "Guodong Yu",
      "Peiyou Jiang",
      "Guoyong Fu"
    ],
    "published": "2025-10-30T05:33:52Z",
    "updated": "2025-10-30T05:33:52Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.08384v2",
    "url": "https://arxiv.org/abs/2506.08384v2",
    "pdf_url": "https://arxiv.org/pdf/2506.08384v2.pdf",
    "title": "Planar Collisionless Shock Simulations with Semi-Implicit   Particle-in-Cell Model FLEKS",
    "abstract": "This study investigates the applicability of the semi-implicit particle-in-cell code FLEKS to heliospheric shock simulations. We examine one- and two-dimensional local planar shock simulations, initialized using MHD states with upstream conditions representative of plasmas in the hypersonic, $\\beta\\sim 1$ regime, for both quasi-perpendicular and quasi-parallel configurations. The refined algorithm in FLEKS proves robust, enabling accurate shock simulations with a grid resolution on the order of the electron inertial length $d_e$. Our simulations successfully capture key shock features, including shock structures (foot, ramp, overshoot, and undershoot), upstream and downstream waves (fast magnetosonic, whistler, Alfv\\'en ion-cyclotron, and mirror modes), and non-Maxwellian particle distributions. Crucially, we find that at least two spatial dimensions are critical for accurately reproducing downstream wave physics in quasi-perpendicular shocks and capturing the complex dynamics of quasi-parallel shocks, including surface rippling, shocklets, SLAMS, magnetic reconnection and jets. Furthermore, our parameter studies demonstrate the impact of mass ratio and grid resolution on shock physics. This work provides valuable guidance for selecting appropriate physical and numerical parameters for shock simulations using a semi-implicit PIC method, paving the way for incorporating kinetic shock processes into large-scale collisionless plasma simulations with the MHD-AEPIC model.",
    "authors": [
      "Hongyang Zhou",
      "Yuxi Chen",
      "Chuanfei Dong",
      "Liang Wang",
      "Ying Zou",
      "Brian Walsh",
      "Gábor Tóth"
    ],
    "published": "2025-06-10T02:50:06Z",
    "updated": "2025-10-30T02:19:19Z",
    "categories": [
      "physics.space-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2510.25980v1",
    "url": "https://arxiv.org/abs/2510.25980v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25980v1.pdf",
    "title": "MKS 390 Micro-Ion Gauge Performance After Exposure to High Pressures",
    "abstract": "In certain applications, pressure transducers may be exposed to high pressures either deliberately or accidentally, raising concerns about their functionality afterwards. We compared the performance of two MKS Granville-Phillips 390 Micro-Ion Gauges against each other, one that had been exposed to 10,000 Torr and the other had never been exposed to pressures above 1000 Torr. Our results show that the differences in the readings between the gauges were within the range of uncertainty specified by the manufacturer indicating negligible impact due to the exposure to high pressure. Additionally, the high pressure exposure did not compromise the leak integrity of the gauge.",
    "authors": [
      "Brandon Massett",
      "Walter Shmayda"
    ],
    "published": "2025-10-29T21:27:54Z",
    "updated": "2025-10-29T21:27:54Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.25972v1",
    "url": "https://arxiv.org/abs/2510.25972v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25972v1.pdf",
    "title": "A Self-Consistent Model of Kinetic Alfven Solitons in Pulsar Wind   Plasma: Linking Soliton Characteristics to Pulsar Observables",
    "abstract": "We present a self-consistent model for the formation and propagation of kinetic Alfven (KA) solitons in the pulsar wind zone, where a relativistic, magnetized electron positron ion plasma flows along open magnetic field lines beyond the light cylinder. Using a reductive perturbation approach, we derive a Korteweg de Vries (KdV) equation that governs the nonlinear evolution of KA solitons in this environment. The soliton amplitude and width are shown to depend sensitively on key pulsar observables, including spin period, spin-down rate, and pair multiplicity as well as plasma composition and suprathermal particle distributions. Our analysis reveals that soliton structures are strongly influenced by the presence of heavy ions, kappa-distributed pairs, and oblique propagation angles. Heavier ion species such as Fe26+ produce significantly broader solitons due to enhanced inertia and dispersion, while increasing pair multiplicity leads to smaller solitons through stronger screening. Oblique propagation (larger theta) results in wider but lower-amplitude solitons, and more thermalized pair plasmas (higher kappa) support taller and broader structures. A population-level analysis of 1174 pulsars shows a clear positive correlation between soliton width and spin period, with millisecond pulsars hosting the narrowest solitons. By linking soliton dynamics to measurable pulsar parameters, this work provides a framework for interpreting magnetospheric microphysics and its role in shaping pulsar emission signatures.",
    "authors": [
      "Manpreet Singh",
      "Geetika Slathia",
      "N. S. Saini",
      "Siming Liu"
    ],
    "published": "2025-10-29T21:15:53Z",
    "updated": "2025-10-29T21:15:53Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.06665v3",
    "url": "https://arxiv.org/abs/2510.06665v3",
    "pdf_url": "https://arxiv.org/pdf/2510.06665v3.pdf",
    "title": "Doping of a Borexino-like Liquid Scintillator with Tellurium-Diols",
    "abstract": "One of the most promising approaches for future neutrinoless double beta decay searches is to incorporate a candidate isotope into the liquid scintillator of a next-generation neutrino detector. In this study, a sample of the high-performance 1,2,4-Trimethylbenzene-based liquid scintillator from the Borexino detector was loaded with different concentrations of Te-diols. Therefore,a novel and completely water-free synthesis in a non-acidic organic environment at room temperature was used. Key parameters of the loaded samples were analyzed and compared with those of the pure Borexino liquid. Both the emission spectrum and transmission remained nearly unchanged,even at high doping levels. The reduction in light yield was moderate, with approximately 8,400 photons emitted for a 1 MeV energy deposition by an electron at 1$\\%$ tellurium loading. The time profile of the light emission induced by alpha particles was also investigated, revealing that the scintillation response becomes significantly faster with increasing tellurium concentration.",
    "authors": [
      "Hans Th. J. Steiger",
      "Marco Beretta",
      "Manuel Böhles",
      "Alberto Garfagnini",
      "Arsenii Gavrikov",
      "Paolo Lombardi",
      "Kai Loo",
      "Elena Pasini",
      "Benedetta Rasera",
      "Andrea Serafini",
      "Michael Wurm"
    ],
    "published": "2025-10-08T05:32:35Z",
    "updated": "2025-10-29T21:10:33Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.25946v1",
    "url": "https://arxiv.org/abs/2510.25946v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25946v1.pdf",
    "title": "Heavy Water Displacement in Molecular Sieve Drying Beds at Various   Humidities",
    "abstract": "Tritium plays a critical role in nuclear fusion power plant designs and dryer beds are an essential tool for managing tritiated water vapor. A series of tests were performed to investigate the ability of a saturated dryer to preferentially adsorb heavy water vapor. The design of passive tritiated control systems is feasible by utilizing a dryer's ability to preferentially trap heavier isotopologues of water. This work investigates this displacement phenomenon and the effect of the heavy water humidity on the dryers performance. Significant displacement was observed when a humid stream of heavy water was diverted through a dryer pre-saturated with light water, as indicated by changes in the partial pressures of $D_2O$ and $H_2O$. After the capture of heavy water in the bed, the subsequent rise in $D_2O$ partial pressure depended on the humidity of heavy water in the gas stream. Higher humidity values lead to faster and steeper mass transfer profiles in the dryer, which could be empirically fit with sigmoid curves.",
    "authors": [
      "Brandon Massett",
      "Walter Shmayda"
    ],
    "published": "2025-10-29T20:44:54Z",
    "updated": "2025-10-29T20:44:54Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.26836v1",
    "url": "https://arxiv.org/abs/2510.26836v1",
    "pdf_url": "https://arxiv.org/pdf/2510.26836v1.pdf",
    "title": "Path-integral Monte Carlo estimator for the dipole polarizability of   quantum plasma",
    "abstract": "We present a path-integral Monte Carlo estimator for calculating the dipole polarizability of interacting Coulomb plasma in the long-wavelength limit, i.e., the optical region. Unlike the conventional dynamic structure factor in reciprocal space, our approach is based on the real-space dipole autocorrelation function and is suited for long wavelengths and small cell sizes, including finite clusters. The simulation of thermal equilibrium in imaginary time has exact Coulomb interactions and Boltzmann quantum statistics. For reference, we demonstrate analytic continuation of the Drude model into the imaginary time and Matsubara series, showing perfect agreement with our data within ranges of finite temperatures and densities. Method parameters, such as the finite time-step and finite-size effects prove only modestly significant. Our method, here carefully validated against an exactly solvable reference, remains amenable to more interesting domains in higher-order optical response, quantum confinements and quantum statistical effects, and applications in plasmonics, heterogeneous plasmas and nonlinear optics, such as epsilon-near-zero materials.",
    "authors": [
      "Juha Tiihonen",
      "David Trejo-Garcia",
      "Tapio T. Rantala",
      "Marco Ornigotti"
    ],
    "published": "2025-10-29T20:26:00Z",
    "updated": "2025-10-29T20:26:00Z",
    "categories": [
      "cond-mat.mes-hall",
      "physics.plasm-ph",
      "quant-ph"
    ],
    "primary_category": "cond-mat.mes-hall"
  },
  {
    "arxiv_id": "2509.08061v2",
    "url": "https://arxiv.org/abs/2509.08061v2",
    "pdf_url": "https://arxiv.org/pdf/2509.08061v2.pdf",
    "title": "Acceleration of Heavy Ions at Non-Relativistic Collisionless Shocks",
    "abstract": "We investigate the process of Diffusive Shock Acceleration (DSA) of particles with mass number to charge number ratios $A/Q > 1$, e.g., partially-ionized heavy ions. To this end, we introduce helium- and carbon-like ions at solar abundances into two-dimensional hybrid (kinetic ions-fluid electrons) simulations of non-relativistic collisionless shocks. This study yields three main results: 1) Heavy ions are preferentially accelerated compared to hydrogen. For typical solar abundances, the energy transferred to accelerated helium ions is comparable to, or even exceeds, that of hydrogen, thereby enhancing the overall shock acceleration efficiency. 2) Accelerated helium ions contribute to magnetic field amplification, which increases the maximum attainable particle energy and steepen the spectra of accelerated particles. 3) The efficient acceleration of helium significantly enhances the production of hadronic gamma rays and neutrinos, likely dominating the one due to hydrogen. These effects should be taken into account, especially when modeling strong space and astrophysical shocks.",
    "authors": [
      "Damiano Caprioli",
      "Luca Orusa",
      "Miha Cernetic",
      "Colby C. Haggerty",
      "Bricker Ostler"
    ],
    "published": "2025-09-09T18:02:22Z",
    "updated": "2025-10-29T19:38:48Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE",
    "doi": "10.3847/2041-8213/ae109b"
  },
  {
    "arxiv_id": "2504.12906v2",
    "url": "https://arxiv.org/abs/2504.12906v2",
    "pdf_url": "https://arxiv.org/pdf/2504.12906v2.pdf",
    "title": "Water activation using $\\rm{Ar-H_2}$ atmospheric pressure plasma jets",
    "abstract": "Whether for materials processing or medical applications, the use of atmospheric pressure plasma jets (APPJs) has emerged as a relevant alternative to conventional methods. Within the APPJs research field, the search for innovation aims not only to solve existing problems but also to explore novel options for generating plasma jets and find new possible applications. In this work, the properties of $\\rm{Ar-H_2}$ APPJs generated using two plasma sources that differ in the frequency, amplitude, and waveform of the generated voltage signal were studied through electrical, thermal, and optical characterization. The discharge parameters were analyzed as a function of the $\\rm{H_2}$ content in the gas mixture, with this parameter varying from 0\\% to 3.5\\%. Optical emission spectroscopy revealed that the same reactive species were produced for both plasma sources, except nitric oxide ($\\rm{NO}$), which was observed only for the source operated at a higher frequency (PS \\#1). Applications for water activation were performed without $\\rm{H_2}$ and with 3.5\\% $\\rm{H_2}$ in the gas mixture. The results of water treatment revealed that ammonia is also produced when $\\rm{H_2}$ is added to the working gas. This finding suggests that the water treated by a $\\rm{Ar-H_2}$ plasma jet can be an attractive option for use in agriculture.",
    "authors": [
      "Fellype do Nascimento",
      "Ananias Alves Barbosa",
      "Konstantin Georgiev Kostov"
    ],
    "published": "2025-04-17T12:52:45Z",
    "updated": "2025-10-29T18:58:45Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  }
]