{
  "arxiv_id": "2405.06026v2",
  "url": "https://arxiv.org/abs/2405.06026v2",
  "pdf_url": "https://arxiv.org/pdf/2405.06026v2.pdf",
  "title": "Microphysical Regulation of Non-Ideal MHD in Weakly-Ionized Systems:   Does the Hall Effect Matter?",
  "abstract": "The magnetohydrodynamics (MHD) equations plus 'non-ideal' (Ohmic, Hall, ambipolar) resistivities are widely used to model weakly-ionized astrophysical systems. We show that if gradients in the magnetic field become too steep, the implied charge drift speeds become much faster than microphysical signal speeds, invalidating the assumptions used to derive both the resistivities and MHD equations themselves. Generically this situation will excite microscale instabilities that suppress the drift and current. We show this could be relevant at low ionization fractions especially if Hall terms appear significant, external forces induce supersonic motions, or dust grains become a dominant charge carrier. Considering well-established treatments of super-thermal drifts in laboratory, terrestrial, and Solar plasmas as well as conduction and viscosity models, we generalize a simple prescription to rectify these issues, where the resistivities are multiplied by a correction factor that depends only on already-known macroscopic quantities. This is generalized for multi-species and weakly-ionized systems, and leaves the equations unchanged in the drift limits for which they are derived, but restores physical behavior (driving the system back towards slow drift by diffusing away small-scale gradients in the magnetic field) if the limits are violated. This has important consequences: restoring intuitive behaviors such as the system becoming hydrodynamic in the limit of zero ionization; suppressing magnetic structure on scales below a critical length which can comparable to circumstellar disk sizes; limiting the maximum magnetic amplification; and suppressing the effects of the Hall term in particular. This likely implies that the Hall term does not become dynamically important under most conditions of interest in these systems.",
  "authors": [
    "Philip F. Hopkins",
    "Jonathan Squire",
    "Raphael Skalidis",
    "Nadine H. Soliman"
  ],
  "published": "2024-05-09T18:00:26Z",
  "updated": "2025-09-22T19:27:57Z",
  "categories": [
    "astro-ph.EP",
    "astro-ph.GA",
    "astro-ph.SR",
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.EP"
}