{
  "arxiv_id": "2509.18448v1",
  "url": "https://arxiv.org/abs/2509.18448v1",
  "pdf_url": "https://arxiv.org/pdf/2509.18448v1.pdf",
  "title": "Stability and optical quality of liquid crystal films as high repetition   rate plasma mirrors in staged laser-plasma accelerators",
  "abstract": "Staging multiple laser-plasma accelerators (LPAs), each driven by its own laser pulse, is a promising technique for reaching higher particle energies than achievable in a single LPA. However, introducing subsequent laser pulses for post-acceleration in staged LPA geometries presents a significant challenge for conventional optics. Due to the focused, high-intensity nature of the laser beam interacting with the electron beam, the fluence on the coupling mirror surpasses the damage threshold of any solid-state optic. Replenishable plasma mirrors (PMs) offer a promising solution to this inherent restriction from high-energy pulses; however, they require a high stability and optical quality, and need to be produced at high repetition rates that match the needs to the staging experiment. Here, we investigate the properties of 4-octyl-4'-cyanobiphenyl (8CB) liquid crystal (LC) films, produced with our new \"windmill\" film formation device, for this application. We conduct this investigation by observing the reliability of film formation at high repetition rates, characterizing the reflected beam profile, and pointing stability as a function of temperature and film formation speed, including film flatness and surface quality, using low-power laser reflection measurements. Our measurements demonstrate that 8CB LC films exhibit unprecedented microscopic surface quality, crucial for preserving laser pulse properties upon reflection. We also show consistent film formation suitable for operation up to 0.5 Hz with great film to film angular stability. The results allow us to conclude that 8CB LC films hold significant potential as reliable and cost-effective PMs that are suitable for coupling LPA stages.",
  "authors": [
    "A. Vazquez",
    "A. Jewell",
    "M. Cole",
    "A. Abdi",
    "T. K. Le",
    "A. McIlvenny",
    "N. Czapla",
    "A. J. Gonsalves",
    "K. Nakamura",
    "D. W. Schumacher",
    "Z. Eisentraut",
    "C. B. Schroeder",
    "J. van Tilborg",
    "J. Osterhoff",
    "E. Esarey",
    "L. Obst-Huebl"
  ],
  "published": "2025-09-22T22:06:04Z",
  "updated": "2025-09-22T22:06:04Z",
  "categories": [
    "physics.optics",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.optics"
}