{
  "arxiv_id": "2509.15383v2",
  "url": "https://arxiv.org/abs/2509.15383v2",
  "pdf_url": "https://arxiv.org/pdf/2509.15383v2.pdf",
  "title": "Integration and commissioning plan of Full Flow Purifier at Muon Campus",
  "abstract": "The Full Flow Purifier for Fermilab's Muon Campus uses a charcoal bed surrounded by a liquid nitrogen jacket to purify up to 240 g/s of helium gas. Fabrication by Ability Engineering Technology Inc. has been completed and the purifier delivered to Fermilab. It is the largest purifier to be used at Fermilab based on both capacity and size. A previous paper discussed the design of purifier for various operational conditions and horizontal shipping. The purifier is designed to withstand 5g force in vertical and 2g force in lateral and longitudinal directions. Transportation experience from vendor to Fermilab and within site is discussed. Integration of the purifier involved design and fabrication of a liquid nitrogen transfer line, regeneration system, and helium piping to connect it to Muon Campus cryogenic system. It also involved establishing electrical, instrumentation and controls connections to the system. Integration of the purifier is discussed in detail. The purifier is to be commissioned using up to 4 MYCOM helium compressors to supply helium and liquid nitrogen supplied by a 60,000-liter tank. Actual effectiveness of the 3-stream heat exchanger is to be estimated based on measured temperatures and flow rate. Impurity levels will be monitored at inlet and outlet of the purifier. Theoretical adsorption capacity of the purifier is calculated based on the measured temperatures and flowrates and is compared to actual adsorption capacity over time.",
  "authors": [
    "J. Subedi",
    "T. Tope",
    "B. Hansen",
    "M. White",
    "J. Tillman",
    "V. Patel",
    "W. Cyko",
    "J. Dong"
  ],
  "published": "2025-09-18T19:40:34Z",
  "updated": "2025-09-22T14:11:05Z",
  "categories": [
    "physics.acc-ph"
  ],
  "primary_category": "physics.acc-ph"
}