{
  "arxiv_id": "2509.18374v1",
  "url": "https://arxiv.org/abs/2509.18374v1",
  "pdf_url": "https://arxiv.org/pdf/2509.18374v1.pdf",
  "title": "Efficient Particle Acceleration in 2.5-Dimensional, Hybrid-Kinetic   Simulations of Decaying, Supersonic, Plasma Turbulence",
  "abstract": "Collisionless, turbulent plasmas surround the Earth, from the magnetosphere to the intergalactic medium, and the fluctuations within them affect nearly every field in the space sciences, from space weather forecasts to theories of galaxy formation. Where turbulent motions become supersonic, their interactions can lead to the formation of shocks, which are known to efficiently energize ions to cosmic-ray energies. We present 2.5-dimensional, hybrid-kinetic simulations of decaying, supersonic, non-relativistic turbulence in a collisionless plasma using the code dHybridR. Turbulence within these simulations is highly compressible; after accounting for this compression by taking the omni-directional power-spectrum of the density weighted velocity field, we find turbulent spectra with power-law slopes of $\\alpha \\approx -\\frac{5}{3}$ for low Mach numbers, in the inertial range, and $\\alpha \\approx -2$ for high Mach numbers. Ions embedded in the highly supersonic simulations are accelerated to non-thermal energies at efficiencies similar to those seen in shocks, despite being in a non-relativistic regime and lacking the large scale structure of a shock. We observe that particles are accelerated into a power-law spectrum, with a slope of $q \\approx 2.5$ in (non-relativistic) energy. We compare these results to those obtained from the theory and simulations of diffusive shock acceleration, and discuss the astrophysical implications of this theoretical work.",
  "authors": [
    "Keyan Gootkin",
    "Colby Haggerty",
    "Damiano Caprioli",
    "Zachary Davis"
  ],
  "published": "2025-09-22T19:56:32Z",
  "updated": "2025-09-22T19:56:32Z",
  "categories": [
    "astro-ph.HE",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.HE"
}