{
  "arxiv_id": "2511.11400v4",
  "url": "https://arxiv.org/abs/2511.11400v4",
  "pdf_url": "https://arxiv.org/pdf/2511.11400v4.pdf",
  "title": "GRANITE: Mechanical Characterization and Optical Inspection of Large-Area TPC Electrodes",
  "abstract": "Next-generation dual-phase time projection chambers (TPCs) for rare event searches will require large-scale, high-precision electrodes. To meet the stringent requirements for mechanical stability and high-voltage performance of such an experiment, we have developed a scanning setup for electrode quality assurance called GRANITE: Granular Robotic Assay for Novel Integrated TPC Electrodes. GRANITE is built around a gantry robot on top of a $2.5\\,\\text{m}\\times1.8\\,\\text{m}$ granite table, equipped with a suite of non-contact metrology devices.   We demonstrate the setup's capabilities in two key areas: first, using laser scanners, we characterize wire tension, and in an independent measurement wire deflection due to gravity and electrostatic forces is determined. The setup achieves a precision of $20\\,μ\\text{m}$ for the relative measurement of only electrostatic displacement. Furthermore, GRANITE can measure gravitational sag down to $200\\,μ\\text{m}$ in an absolute measurement; this precision improves to $50\\,μ\\text{m}$ when applying model-based corrections for systematic effects. The performance achieved exceeds the needs for the characterisation of the electrode sagging in future experiments, which typically aims to ensure a maximal sag on the order of $500\\,μ\\text{m}$.   Second, we use GRANITE's high resolution camera to image all wires of XENON1T's cathode grid. Subsets of these images are then hand sorted and used to train an autoencoder, to reliably classify wire images as either pristine wires or images containing severe anomalous features. These anomalies appear e.g. as staining and may be potential defects. The interpretation of the classification results is complicated by the fact that most wire segments are not spotless, but show a varying amount of anomalous features. Follow-up studies are needed to identify the exact nature of such features on wires.",
  "authors": [
    "Alexander Deisting",
    "Jan Lommler",
    "Shumit A. Mitra",
    "Uwe Oberlack",
    "Fabian Piermaier",
    "Quirin Weitzel",
    "Daniel Wenz"
  ],
  "published": "2025-11-14T15:28:24Z",
  "updated": "2026-02-03T11:07:22Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.1088/1748-0221/21/01/P01033"
}