{
  "arxiv_id": "2601.23117v1",
  "url": "https://arxiv.org/abs/2601.23117v1",
  "pdf_url": "https://arxiv.org/pdf/2601.23117v1.pdf",
  "title": "A centimeter-sized gas pressure sensor for high-vacuum measurements at cryogenic temperatures",
  "abstract": "Gas pressure sensors based on nanomechanical membranes have recently demonstrated an ultra-wide ten-decade measurement range, a gas-type-independent response, and a self-calibrating operation with uncertainties of approximately $1\\,\\%$. The readout relied on tabletop free-space laser interferometers. Here we present a centimeter-sized, portable implementation in which a square Si$_3$N$_4$ membrane is read out via a fiber-based laser interferometer. We perform pressure measurements between $5\\times10^{-5}$ and $10^{-1}$~mbar in a confined $0.7$~L volume cooled to $78$~K. Because no suitable commercial pressure sensor exists for direct cryogenic comparison, we benchmark our device against room-temperature commercial gauges connected to the cold volume through a pipe of limited conductance. The measured relationship between the two sensors is compared with models accounting for temperature- and pumping-induced pressure gradients within the measurement chamber. These models agree with the measurements to within $<10\\,\\%$ for helium and $<13\\,\\%$ for nitrogen. The achieved readout sensitivity of $S_x = 8\\times10^{-14}\\,\\mathrm{m}/\\sqrt{\\mathrm{Hz}}$ theoretically enables resolving the thermal displacement noise spectrum of a trampoline membrane at atmospheric pressure, with a peak response of $48\\,S_x$ $\\left(25\\,S_x\\right)$ at $295\\,\\mathrm{K}$ $\\left(78\\,\\mathrm{K}\\right)$. Our results suggest that the previously achieved pressure measurement range of ten decades with trampoline membranes is compatible with fiber-based optical readout. This paves the way for widely applicable pressure sensors in the centimeter size range in cryogenic environments.",
  "authors": [
    "Christoph Reinhardt",
    "Lea Lara Stankewitz",
    "Daniel Hartwig",
    "Sandy Croatto",
    "Hossein Masalehdan",
    "Nils Sültmann",
    "Axel Lindner",
    "Roman Schnabel"
  ],
  "published": "2026-01-30T16:03:25Z",
  "updated": "2026-01-30T16:03:25Z",
  "categories": [
    "physics.app-ph",
    "physics.ins-det"
  ],
  "primary_category": "physics.app-ph"
}