{
  "arxiv_id": "2602.02442v1",
  "url": "https://arxiv.org/abs/2602.02442v1",
  "pdf_url": "https://arxiv.org/pdf/2602.02442v1.pdf",
  "title": "Depth Calibration of Double-sided Strip Germanium Detectors for the Compton Spectrometer and Imager Satellite",
  "abstract": "Double-sided strip high-purity germanium detectors with three-dimensional position reconstruction capability have been developed over three decades, with space-based applications in high-energy astrophysics and heliophysics. Position resolution in three dimensions is key to reconstruction of Compton scattering events, including for the upcoming Compton Spectrometer and Imager (COSI) satellite mission. Two-dimensional position reconstruction is enabled by segmentation of the two detector faces into orthogonal strip contacts, enabling a pixelized analysis. The depth of an interaction cannot be measured directly but must be inferred from the charge collection time difference between the two faces of the detector. Here, we demonstrate for the first time the depth calibration of a detector with the COSI satellite geometry read out using an application specific integrated circuit (ASIC) developed for the COSI mission. In this work, we map collection time difference to depth using the Julia-based simulation package SolidStateDetectors$.$jl and validate it with comparison to the timing distributions observed in data. We also use simulations and data to demonstrate the depth resolution on a per-pixel basis, with >90% of pixels having <0.9 mm (FWHM) resolution at 59.5 keV and <0.6 mm (FWHM) resolution at 122.1 keV.",
  "authors": [
    "Field R. Rogers",
    "Sean N. Pike",
    "Samer Alnussirat",
    "Robin Anthony-Petersen",
    "Steven E. Boggs",
    "Felix Hagemann",
    "Sophia E. Haight",
    "Alyson Joens",
    "Carolyn Kierans",
    "Alexander Lowell",
    "Brent Mochizuki",
    "Albert Y. Shih",
    "Clio Sleator",
    "John A. Tomsick",
    "Andreas Zoglauer"
  ],
  "published": "2026-02-02T18:38:40Z",
  "updated": "2026-02-02T18:38:40Z",
  "categories": [
    "astro-ph.IM",
    "physics.ins-det"
  ],
  "primary_category": "astro-ph.IM",
  "doi": "10.1016/j.nima.2026.171332"
}