{
  "arxiv_id": "2602.01097v1",
  "url": "https://arxiv.org/abs/2602.01097v1",
  "pdf_url": "https://arxiv.org/pdf/2602.01097v1.pdf",
  "title": "Radiation-Driven Origin of Super-Equipartition Magnetic Fields in Accretion Discs and Outflows",
  "abstract": "Magnetic fields play a central role in accretion physics around black holes, yet their physical origin within accretion flows remains an open problem. In this work, we investigate the generation and subsequent evolution of magnetic fields triggered by anisotropic radiation fields in black hole accretion discs with compact rotating inner corona. We self-consistently evolve the magnetic field using the generalized field evolution MHD equation, including advection, shear-driven induction, and Hall effects. The radiation field acts as a primary field generator, while azimuthal rotation in the magnetized plasma provides rapid amplification. We find that radiation-generated fields efficiently reach a dominant toroidal component by Keplerian rotation, leading to magnetic field strengths of order $\\sim 10^{8}\\,\\mathrm{G}$ in the vicinity of a 10 solar mass black hole and accretion disc-corona emitting at luminosity equivalent to the Eddington unit. These magnetic fields are achieved within viscous timescales and reach or exceed local equipartition estimates based on gas pressure. When vertical outflows are included, the amplified magnetic fields are advected into the corona, magnetizing disc-launched winds and jet precursors with field strengths of similar order. Our results demonstrate that radiation is not merely a passive component of accretion flows, but provides a robust and unavoidable trigger for the generation of dynamically significant magnetic fields. Our results provide a physically grounded explanation for the origin of large-scale, structured magnetic fields in and around accretion discs. This mechanism offers a pathway for magnetizing accretion discs and their outflows without invoking externally supplied magnetic flux, with broad implications for X-ray binaries, active galactic nuclei and other transients such as gamma-ray bursts (GRBs).",
  "authors": [
    "Mukesh Kumar Vyas",
    "Asaf Pe'er"
  ],
  "published": "2026-02-01T08:30:12Z",
  "updated": "2026-02-01T08:30:12Z",
  "categories": [
    "astro-ph.HE",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.HE"
}