{
  "arxiv_id": "2602.01972v1",
  "url": "https://arxiv.org/abs/2602.01972v1",
  "pdf_url": "https://arxiv.org/pdf/2602.01972v1.pdf",
  "title": "Heat load measurements for the PIP-II pHB650 cryomodule",
  "abstract": "Phase-3 testing of the pHB650 cryomodule at the PIP-II Injector Test Facility was conducted to evaluate the effectiveness of heat load mitigations performed after earlier phases of testing and to continue pinpointing any sources of unexpectedly high heat loads.. The programme measured HTTS, LTTS, and 2 K isothermal/non-isothermal loads under \"standard\", \"linac\", and \"simulated dynamic\" operating modes, recording data both inside the cryomodule and across the bayonet can circuits. Thermal-acoustic oscillations were eliminated by replacing the original G10 cooldown-valve stem with a stainless-steel stem fitted with wipers. A newly developed Python script automated acquisition of ACNET data, performed real-time heat-load calculations, and generated plots and tables that were posted to the electronic logbook within minutes, vastly reducing manual effort and accelerating feedback between SRF and cryogenics teams. Analysis showed that JT heat-exchanger effectiveness and temperature stratification in the two-phase and relief piping strongly influence the observed loads and helped isolate sources of excess heat. The campaign demonstrates that rigorous pre-test planning, real-time diagnostics, and automated reporting can improve both accuracy and efficiency, providing a template for future PIP-II cryomodule tests and for implementing targeted heat-load mitigations.",
  "authors": [
    "D. Porwisiak",
    "M. J. White",
    "V. Roger",
    "J. Bernardini",
    "B. J. Hansen",
    "J. P. Holzbauer",
    "J. Makara",
    "J. Ozelis",
    "D. Passarelli",
    "S. Yoon",
    "J. Subedi",
    "S. Ranpariya",
    "V. Patel",
    "J. Dong"
  ],
  "published": "2026-02-02T11:25:46Z",
  "updated": "2026-02-02T11:25:46Z",
  "categories": [
    "physics.acc-ph"
  ],
  "primary_category": "physics.acc-ph"
}