{
  "arxiv_id": "2602.01886v1",
  "url": "https://arxiv.org/abs/2602.01886v1",
  "pdf_url": "https://arxiv.org/pdf/2602.01886v1.pdf",
  "title": "Development and characterization of hybrid MCP-PMT with embedded Timepix4 ASIC used as pixelated anode",
  "abstract": "We present a novel single-photon detector based on a vacuum tube incorporating a photocathode, a microchannel plate (MCP), and a Timepix4 CMOS ASIC functioning as a pixelated anode. Designed to handle photon rates up to 1 billion per second across a 7 cm$^2$ active area, the detector achieves outstanding spatial and temporal resolutions of 5-10 $μ$m and below 50 ps r.m.s., respectively.   The Timepix4 ASIC comprises approximately 230,000 pixels, each integrating analog and digital front-end electronics. This enables data-driven acquisition and supports data transmission rates up to 160 Gb/s. External FPGA-based electronics manage both configuration and readout.   In order to test the timing performance of the Timepix4 ASIC we performed preliminary characterization of an assembly bonded to a 100 $μ$m thick n-on-p silicon sensor using a pulsed infrared laser, which demonstrated a per-pixel timing resolution of 110 ps, with cluster-based averaging methods improving to below 50 ps.   Six prototype detectors incorporating different MCP stack configurations and end-spoiling depths were produced by Hamamatsu Photonics. We report on their characterization, including dark count rates, gain, and spatial and timing resolutions, assessed both in laboratory conditions and during a test-beam campaign at CERN's SPS facility.",
  "authors": [
    "Riccardo Bolzonella",
    "Jerome Alozy",
    "Rafael Ballabriga",
    "Nicolò Vladi Biesuz",
    "Michael Campbell",
    "Viola Cavallini",
    "Angelo Cotta Ramusino",
    "Massimiliano Fiorini",
    "Edoardo Franzoso",
    "Marco Guarise",
    "Xavi Llopart Cudie",
    "Gabriele Romolini",
    "Alessandro Saputi"
  ],
  "published": "2026-02-02T09:58:51Z",
  "updated": "2026-02-02T09:58:51Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.1016/j.nima.2025.170965"
}