{
  "arxiv_id": "2602.01800v1",
  "url": "https://arxiv.org/abs/2602.01800v1",
  "pdf_url": "https://arxiv.org/pdf/2602.01800v1.pdf",
  "title": "Proton Energy Dependence of Radiation Induced Low Gain Avalanche Detector Degradation",
  "abstract": "Low Gain Avalanche Detectors (LGADs) are key components for precise timing measurements in high-energy physics experiments, including the High Luminosity upgrades of the current LHC detectors. Their performance is, however, limited by radiation induced degradation of the gain layer, primarily driven by acceptor removal. This study presents a systematic comparison of how the degradation evolves with different incident proton energies, using LGADs from Hamamatsu Photonics (HPK) and The Institute of Microelectronics of Barcelona (IMB-CNM) irradiated with 18 MeV, 24 MeV, 400 MeV and 23 GeV protons and fluences up to 2.5x10^15 p/cm2. Electrical characterization is used to extract the acceptor removal coefficients for different proton energies, whereas IR TCT measurements offer complementary insight into the gain evolution in LGADs after irradiation. Across all devices, lower energy protons induce stronger gain layer degradation, confirming expectations. However, 400 MeV protons consistently appear less damaging than both lower and higher energy protons, an unexpected deviation from a monotonic energy trend. Conversion of proton fluences to 1 MeV neutron-equivalent fluences reduces but does not eliminate these differences, indicating that the standard Non-Ionizing Energy Loss (NIEL) scaling does not fully account for the underlying defect formation mechanisms at different energies and requires revision when considering irradiation fields that contain a broader spectrum of particle types and energies.",
  "authors": [
    "Veronika Kraus",
    "Marcos Fernandez Garcia",
    "Luca Menzio",
    "Michael Moll"
  ],
  "published": "2026-02-02T08:31:08Z",
  "updated": "2026-02-02T08:31:08Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}