{
  "arxiv_id": "2602.00826v1",
  "url": "https://arxiv.org/abs/2602.00826v1",
  "pdf_url": "https://arxiv.org/pdf/2602.00826v1.pdf",
  "title": "Gamma Imagers for Nuclear Security and Nuclear Forensics: Recommendations based on results from a side-by-side intercomparison",
  "abstract": "Nuclear security operations and forensic investigations require the utilization of a suite of instruments ranging from passive gamma spectrometers to high-precision laboratory sample analyzers. Gamma spectroscopy survey is further broken down into wide-area search performed with large-volume scintillator-based mobile survey spectrometers which are integrated with geographic position sensors for mapping and identification of hot zones, and high-precision long-dwell measurements using solid state spectrometers for follow-on characterization to establish isotopic content and ratios. While performing well at detecting the presence, quantity and type of radioactivity, all of these methods have limited ability to determine the location of a source of radioactivity. In recent years, technology advances have resulted in gamma imager devices which can create an image of the distribution of radioactive sources using the gamma emissions which accompany radioactive decay, and overlay this on an optical photograph of the environment. These gamma imaging devices have arisen out of methods developed for medical physics, experimental particle physics, and astrophysics, resulting in a proliferation of different technological approaches. Those responsible for establishing a nuclear security concept of operations, require guidance to choose the proper gamma imager for each of the application spaces in a tiered response. Here the results of an intercomparison of two gamma imagers based on two widely different technologies, semiconductor and scintillator detectors, are presented. The optimal utilization of these imaging technologies in a tiered response is discussed based on the results of the trial. Finally, an outlook on future directions for gamma imaging advances is provided.",
  "authors": [
    "L. E. Sinclair",
    "P. R. B. Saull",
    "A. McCann",
    "A. M. L. MacLeod",
    "N. J. Murtha",
    "A. El-Jaby",
    "G. Jonkmans"
  ],
  "published": "2026-01-31T17:42:04Z",
  "updated": "2026-01-31T17:42:04Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}