[
  {
    "arxiv_id": "2601.15818v2",
    "url": "https://arxiv.org/abs/2601.15818v2",
    "pdf_url": "https://arxiv.org/pdf/2601.15818v2.pdf",
    "title": "Muon beams towards muonium physics: progress and prospects",
    "abstract": "Advances in accelerator technology have led to significant improvements in the quality of muon beams over the past decades. Investigations of the muon and muonium enable precise measurements of fundamental constants, as well as searches for new physics beyond the Standard Model. Furthermore, by utilizing muon beams with high intensity and polarization, studies of the dynamics of the muon and muonium within atomic level can offer valuable insights into materials science. This review presents recent progress and prospects at the frontiers of muon beams and high-precision muonium physics. It also provides an overview of novel methods and detection techniques to achieve high sensitivities in different areas, including particle physics, nuclear physics, materials science and beyond.",
    "authors": [
      "Siyuan Chen",
      "Mingchen Sun",
      "Jian Tang"
    ],
    "published": "2026-01-22T10:05:19Z",
    "updated": "2026-02-03T11:59:31Z",
    "categories": [
      "hep-ex",
      "cond-mat.mtrl-sci",
      "physics.acc-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2511.11401v4",
    "url": "https://arxiv.org/abs/2511.11401v4",
    "pdf_url": "https://arxiv.org/pdf/2511.11401v4.pdf",
    "title": "GRANITE: High-Resolution Imaging and Electrical Qualification of Large-Area TPC Electrodes",
    "abstract": "Next-generation dual-phase time projection chambers (TPCs) for rare event searches will require large-scale, high-precision electrodes. To meet the stringent requirements for high-voltage performance of such an experiment, we have developed a scanning setup for comprehensive electrode quality assurance. The system is built around the GRANITE (Granular Robotic Assay for Novel Integrated TPC Electrodes) facility: a gantry robot on top of a $2.5\\,\\text{m}\\times1.8\\,\\text{m}$ granite table, equipped with a suite of non-contact metrology devices.   We developed a coaxial wire scanning head to measure and correlate localized high-voltage discharge currents in air with high-resolution surface images. We find that the identified discharge 'hotspots' are transient and show no significant correlation with static visual features. Next, we established a quantitative relationship between artificially induced abrasive surface damage on the wires and a reduction in the discharge inception voltage. This work provides a novel non-invasive tool for qualifying wires dedicated for use in electrodes for future low-background experiments.",
    "authors": [
      "Shumit A. Mitra",
      "Alexander Deisting",
      "Jan Lommler",
      "Uwe Oberlack",
      "Fabian Piermaier",
      "Quirin Weitzel",
      "Daniel Wenz"
    ],
    "published": "2025-11-14T15:28:26Z",
    "updated": "2026-02-03T11:12:31Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/21/01/P01034"
  },
  {
    "arxiv_id": "2511.11400v4",
    "url": "https://arxiv.org/abs/2511.11400v4",
    "pdf_url": "https://arxiv.org/pdf/2511.11400v4.pdf",
    "title": "GRANITE: Mechanical Characterization and Optical Inspection of Large-Area TPC Electrodes",
    "abstract": "Next-generation dual-phase time projection chambers (TPCs) for rare event searches will require large-scale, high-precision electrodes. To meet the stringent requirements for mechanical stability and high-voltage performance of such an experiment, we have developed a scanning setup for electrode quality assurance called GRANITE: Granular Robotic Assay for Novel Integrated TPC Electrodes. GRANITE is built around a gantry robot on top of a $2.5\\,\\text{m}\\times1.8\\,\\text{m}$ granite table, equipped with a suite of non-contact metrology devices.   We demonstrate the setup's capabilities in two key areas: first, using laser scanners, we characterize wire tension, and in an independent measurement wire deflection due to gravity and electrostatic forces is determined. The setup achieves a precision of $20\\,μ\\text{m}$ for the relative measurement of only electrostatic displacement. Furthermore, GRANITE can measure gravitational sag down to $200\\,μ\\text{m}$ in an absolute measurement; this precision improves to $50\\,μ\\text{m}$ when applying model-based corrections for systematic effects. The performance achieved exceeds the needs for the characterisation of the electrode sagging in future experiments, which typically aims to ensure a maximal sag on the order of $500\\,μ\\text{m}$.   Second, we use GRANITE's high resolution camera to image all wires of XENON1T's cathode grid. Subsets of these images are then hand sorted and used to train an autoencoder, to reliably classify wire images as either pristine wires or images containing severe anomalous features. These anomalies appear e.g. as staining and may be potential defects. The interpretation of the classification results is complicated by the fact that most wire segments are not spotless, but show a varying amount of anomalous features. Follow-up studies are needed to identify the exact nature of such features on wires.",
    "authors": [
      "Alexander Deisting",
      "Jan Lommler",
      "Shumit A. Mitra",
      "Uwe Oberlack",
      "Fabian Piermaier",
      "Quirin Weitzel",
      "Daniel Wenz"
    ],
    "published": "2025-11-14T15:28:24Z",
    "updated": "2026-02-03T11:07:22Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/21/01/P01033"
  },
  {
    "arxiv_id": "2602.03273v1",
    "url": "https://arxiv.org/abs/2602.03273v1",
    "pdf_url": "https://arxiv.org/pdf/2602.03273v1.pdf",
    "title": "Production of GEM-like structures for cryogenic applications, using laser-cutting techniques",
    "abstract": "A novel concept for electroluminescence (EL) structures was recently proposed. In it, a wavelength-shifting material is deposited inside the holes of GEM-like structures which, after suitable optical treatment of its electrodes, improves the light collection and detection efficiency in noble gas TPCs. This new development directly addresses problems related with the scalability of future dual-phase TPCs for rare-event searches, matching (and potentially exceeding) the performance of conventional EL techniques.   We report the newest developments on the production of such structures using laser-based techniques, namely the manufacture of a first batch of the so-called FAT-GEMs. This process allows low-cost and reproducible manufacturing of a high volume of such structures.   In addition to the detailed description of the production, we present a performance assessment in pure argon, at a gas density close to the one expected in LAr conditions. An energy resolution of 23.5$\\pm$1~\\% (FWHM) at 5.9~keV was obtained, indicating a consistent improvement over previous batch. The optical treatment of the electrode surfaces has been greatly simplified and modestly improved, while charging-up effects arising from the use of laminates eliminated.",
    "authors": [
      "D. Rodas-Rodríguez",
      "A. F. V. Cortez",
      "M. Kuźniak",
      "D. González-Díaz",
      "P. A. O. C. Silva",
      "A. Gnat",
      "G. Nieradka",
      "T. Sworobowicz",
      "E. Alario",
      "C. D. R. Azevedo",
      "K. T. Floethner",
      "P. Gasik",
      "J. Llerena",
      "C. M. B. Monteiro",
      "R. Oliveira",
      "A. Pallas",
      "D. Tenreiro",
      "V. Peskov",
      "J. M. F. dos Santos"
    ],
    "published": "2026-02-03T08:58:10Z",
    "updated": "2026-02-03T08:58:10Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.03270v1",
    "url": "https://arxiv.org/abs/2602.03270v1",
    "pdf_url": "https://arxiv.org/pdf/2602.03270v1.pdf",
    "title": "Computational Tools in EN-MME: Implicit and Explicit Finite-Element Simulations",
    "abstract": "This paper recalls the principles of the finite-element methods (FEM) theory and declines its application in the EN-MME group, for the numerical modelling and study of particle accelerator equipment. Implicit and explicit methods are compared, and practical examples of their use are given.",
    "authors": [
      "Federico Carra",
      "Giuditta Coladonato",
      "Audrey Piccini",
      "Joanna Sylwia Swieszek",
      "Nikolina Vejnovic"
    ],
    "published": "2026-02-03T08:56:15Z",
    "updated": "2026-02-03T08:56:15Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.01504v2",
    "url": "https://arxiv.org/abs/2602.01504v2",
    "pdf_url": "https://arxiv.org/pdf/2602.01504v2.pdf",
    "title": "First Experimental Demonstration of Beam Storage by Three-Dimensional Spiral Injection Scheme for Ultra-Compact Storage Rings",
    "abstract": "Three-dimensional spiral injection scheme enables storage in ultra-compact rings with nanosecond revolution period. We report the first successful storage of a $297\\,\\mathrm{keV/}c$ electron beam in a $22\\,\\mathrm{cm}$ weak-focusing storage ring with a $4.7\\,\\mathrm{ns}$ revolution period using multi-turn vertical kick with a $140\\,\\mathrm{ns}$ kicker pulse. Using a scintillating-fiber detector, we observe a signal exceeding $5σ$ of the pre-injection rms noise for $\\geq 1\\,\\mathrm{μs}$, confirming beam storage. By varying the weak-focusing field configuration and measuring the stored beam distribution, we show that the storage beam resides within the predicted region by Monte Carlo simulations. This result is a key proof-of-principle for realizing ultra-compact storage rings for next-generation precision measurements including the muon experiments at J-PARC and PSI.",
    "authors": [
      "R. Matsushita",
      "H. Iinuma",
      "S. Ohsawa",
      "H. Nakayama",
      "K. Furukawa",
      "S. Ogawa",
      "N. Saito",
      "T. Mibe",
      "M. A. Rehman"
    ],
    "published": "2026-02-02T00:33:47Z",
    "updated": "2026-02-03T08:24:08Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.08763v2",
    "url": "https://arxiv.org/abs/2507.08763v2",
    "pdf_url": "https://arxiv.org/pdf/2507.08763v2.pdf",
    "title": "Angular momentum dynamics of vortex particles in accelerators",
    "abstract": "Experiments with spin-polarized beams of leptons and hadrons typically employ plane-wave states with definite momenta and energies. In contrast, vortex states represent cylindrical waves carrying a well-defined orbital angular momentum projection along the propagation direction. This projection can be arbitrarily large, endowing such particles with magnetic moments orders of magnitude greater than those of plane-wave states. Consequently, vortex particles could complement - or even replace - spin-polarized beams in high-energy collisions, enabling access to observables beyond the reach of the conventional states. Although relativistic vortex beams have yet to be realized, we investigate the radiative and non-radiative dynamics of angular momentum for vortex particles in accelerators. We compute the timescale for angular momentum loss via photon emission, finding it significantly longer than typical acceleration times. The non-radiative dynamics is governed by precession, with the orbital angular momentum precessing at a frequency markedly different from that of spin. Similar to spin tunes in circular accelerators, this can induce resonances that disrupt the beam's orbital momentum - occurring far more frequently for vortex beams than for spin-polarized ones. Thus, vortex particle acceleration can be more feasible in linacs, while Siberian snakes could serve as a tool for angular momentum manipulations.",
    "authors": [
      "D. Karlovets",
      "D. Grosman",
      "I. Pavlov"
    ],
    "published": "2025-07-11T17:20:08Z",
    "updated": "2026-02-02T22:22:09Z",
    "categories": [
      "physics.acc-ph",
      "hep-ph",
      "quant-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.02867v1",
    "url": "https://arxiv.org/abs/2602.02867v1",
    "pdf_url": "https://arxiv.org/pdf/2602.02867v1.pdf",
    "title": "Monochromation of pulsed electron beams with terahertz radiation at a planar mirror",
    "abstract": "Exquisite control of electron beam energy is required for many electron spectroscopy and imaging applications. For both continuous and pulsed beams, the beam energy spread is fundamentally limited by the electron source, and is typically a sizable fraction of an electron-volt. In this paper, we present a means to reduce electron beam energy spread after emission to the level of a few 10s of meV rms using femtosecond photoemission and an interaction with laser-derived single- to few-cycle terahertz (THz) radiation. We show analytically and in particle tracking simulations that this interaction can remove energy spread stored in both the transverse and longitudinal degrees of freedom. We analytically formulate the limit of energy spread that this technique can achieve, and map the non-ideal affects arising at high frequencies. The interaction is mediated by the beam's passage through a mirror which is reflective to terahertz radiation but allows transmission of the majority of the electron beam (e.g. a wire mesh). This method then only requires beam current losses of a few tens of percent, far smaller than what is achieved in prism and slit-based electron monochromators.",
    "authors": [
      "Cecilia Abbamonte",
      "Adam Bartnik",
      "Jared Maxson"
    ],
    "published": "2026-02-02T22:17:58Z",
    "updated": "2026-02-02T22:17:58Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.02674v1",
    "url": "https://arxiv.org/abs/2602.02674v1",
    "pdf_url": "https://arxiv.org/pdf/2602.02674v1.pdf",
    "title": "A rapid low-background assay of $^{210}$Pb in archaeological lead",
    "abstract": "In this work, we present a fast and highly efficient method for the measurement of $^{210}$Pb in metallic archaeological lead using the commercial low-background liquid scintillation counter Wallac Quantulus 1220 installed at the University of Milano-Bicocca (Italy). By combining an optimized chemical preparation with pulse-shape analysis (PSA), the technique achieves sensitivities at the level of a few $10^2$ mBq/kg within one week of measurement, using sample masses below 1 g. The method enables the simultaneous identification of the $β$ decays of $^{210}$Pb and $^{210}$Bi and the $α$ decay of $^{210}$Po, allowing a direct verification of secular equilibrium within the decay chain. With extended acquisition times, detection limits below 100 mBq/kg are reached after approximately 40 days. This approach provides a rapid, accessible, and reliable tool for the radiopurity screening of lead, and is well suited for quality control and R&D activities in next-generation low-background and rare-event physics experiments. Moreover, the method has the potential to be extended to other materials relevant for low-background applications.",
    "authors": [
      "M. Consonni",
      "M. Clemenza",
      "E. Di Stefano",
      "N. Ferreiro Iachellini",
      "F. Filippini",
      "A. Gardini",
      "G. Grosso",
      "L. Pattavina",
      "R. Della Pergola",
      "S. Quitadamo",
      "E. Sala",
      "F. Saliu",
      "A. Salvini",
      "L. Trombetta"
    ],
    "published": "2026-02-02T19:00:13Z",
    "updated": "2026-02-02T19:00:13Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.02442v1",
    "url": "https://arxiv.org/abs/2602.02442v1",
    "pdf_url": "https://arxiv.org/pdf/2602.02442v1.pdf",
    "title": "Depth Calibration of Double-sided Strip Germanium Detectors for the Compton Spectrometer and Imager Satellite",
    "abstract": "Double-sided strip high-purity germanium detectors with three-dimensional position reconstruction capability have been developed over three decades, with space-based applications in high-energy astrophysics and heliophysics. Position resolution in three dimensions is key to reconstruction of Compton scattering events, including for the upcoming Compton Spectrometer and Imager (COSI) satellite mission. Two-dimensional position reconstruction is enabled by segmentation of the two detector faces into orthogonal strip contacts, enabling a pixelized analysis. The depth of an interaction cannot be measured directly but must be inferred from the charge collection time difference between the two faces of the detector. Here, we demonstrate for the first time the depth calibration of a detector with the COSI satellite geometry read out using an application specific integrated circuit (ASIC) developed for the COSI mission. In this work, we map collection time difference to depth using the Julia-based simulation package SolidStateDetectors$.$jl and validate it with comparison to the timing distributions observed in data. We also use simulations and data to demonstrate the depth resolution on a per-pixel basis, with >90% of pixels having <0.9 mm (FWHM) resolution at 59.5 keV and <0.6 mm (FWHM) resolution at 122.1 keV.",
    "authors": [
      "Field R. Rogers",
      "Sean N. Pike",
      "Samer Alnussirat",
      "Robin Anthony-Petersen",
      "Steven E. Boggs",
      "Felix Hagemann",
      "Sophia E. Haight",
      "Alyson Joens",
      "Carolyn Kierans",
      "Alexander Lowell",
      "Brent Mochizuki",
      "Albert Y. Shih",
      "Clio Sleator",
      "John A. Tomsick",
      "Andreas Zoglauer"
    ],
    "published": "2026-02-02T18:38:40Z",
    "updated": "2026-02-02T18:38:40Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM",
    "doi": "10.1016/j.nima.2026.171332"
  },
  {
    "arxiv_id": "2510.01060v3",
    "url": "https://arxiv.org/abs/2510.01060v3",
    "pdf_url": "https://arxiv.org/pdf/2510.01060v3.pdf",
    "title": "Do plasmoids induce fast magnetic reconnection in well-resolved current sheets in 2D MHD simulations?",
    "abstract": "We investigate the development of tearing-mode instability using the highest-resolution two-dimensional magnetohydrodynamic simulations of reconnecting current sheets performed on a uniform grid, for Lundquist numbers of $10^3 \\le S \\le 5 \\times 10^5$ , reaching up to $65,536^2$ grid cells. We demonstrate a Sweet--Parker scaling of the reconnection rate $V_{\\text{rec}} \\sim S^{-1/2}$ up to Lundquist numbers $S \\sim 10^4$. For larger values of Lundquist number, between $2\\times 10^4\\le S \\le 2 \\times 10^5$, plasmoid formation sets in, leading to a slight enhancement of the reconnection rate, $V_{\\text{rec}} \\sim S^{-1/3}$, consistent with the prediction from linear tearing mode induced reconnection, indicating that reconnection remains resistivity-dependent and therefore slow. In this range of $S$-values, the plasmoids do not undergo a merger cascade, as they are rapidly advected out of the reconnection layer. Only for $S > 2 \\times 10^5$, we observe the nonlinear development of the tearing-mode instability, with plasmoid coalescence and a saturation of the reconnection rate at $V_\\text{rec} / V_A \\sim 0.01$. At such high $S$, however, the corresponding Reynolds number is large, reaching $\\text{Re} > 2000$ even on scales comparable to the current-sheet thickness. We therefore conclude that, in astrophysical systems, it is essential to account for the dominant influence of turbulence and three-dimensional effects in the reconnection process.",
    "authors": [
      "G. H. Vicentin",
      "G. Kowal",
      "E. M. de Gouveia Dal Pino",
      "A. Lazarian"
    ],
    "published": "2025-10-01T16:00:23Z",
    "updated": "2026-02-02T16:07:50Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE",
      "hep-th"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.03245v3",
    "url": "https://arxiv.org/abs/2507.03245v3",
    "pdf_url": "https://arxiv.org/pdf/2507.03245v3.pdf",
    "title": "Fast prediction of plasma instabilities with sparse-grid-accelerated optimized dynamic mode decomposition",
    "abstract": "Parametric data-driven reduced-order models (ROMs) that embed dependencies in a large number of input parameters are crucial for enabling many-query tasks in large-scale problems. These tasks, including design optimization, control, and uncertainty quantification, are essential for developing digital twins in real-world applications. However, standard grid-based data generation methods are computationally prohibitive due to the curse of dimensionality. This paper investigates efficient training of parametric data-driven ROMs using sparse grid interpolation with (L)-Leja points, specifically targeting scenarios with higher-dimensional input parameter spaces. (L)-Leja points are nested and exhibit slow growth, resulting in sparse grids with low cardinality in low-to-medium dimensional settings, making them ideal for large-scale, computationally expensive problems. Focusing on gyrokinetic simulations of plasma micro-instabilities in fusion experiments as a representative real-world application, we construct parametric ROMs for the full 5D gyrokinetic distribution function via optimized dynamic mode decomposition (optDMD) and sparse grids based on (L)-Leja points. We perform detailed experiments in two scenarios: First, the Cyclone Base Case benchmark assesses optDMD ROM prediction capabilities beyond training time horizons and across variations in the binormal wave number. Second, for a real-world electron-temperature-gradient-driven micro-instability simulation with six input parameters, we demonstrate that a predictive parametric optDMD ROM that is up to three orders of magnitude cheaper to evaluate can be constructed using only 28 high-fidelity gyrokinetic simulations, enabled by the use of sparse grids. In the broader context of fusion research, these results demonstrate the potential of sparse grid-based parametric ROMs to enable otherwise intractable many-query tasks.",
    "authors": [
      "Kevin Gill",
      "Ionut-Gabriel Farcas",
      "Silke Glas",
      "Benjamin J. Faber"
    ],
    "published": "2025-07-04T01:34:54Z",
    "updated": "2026-02-02T14:29:06Z",
    "categories": [
      "physics.comp-ph",
      "cs.CE",
      "math.NA",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.comp-ph",
    "doi": "10.1016/j.jcp.2026.114718"
  },
  {
    "arxiv_id": "2510.24618v2",
    "url": "https://arxiv.org/abs/2510.24618v2",
    "pdf_url": "https://arxiv.org/pdf/2510.24618v2.pdf",
    "title": "Distributed Inter-Strand Coupling Current Model for Finite Element Simulations of Rutherford Cables",
    "abstract": "In this paper, we present the Distributed Inter-Strand Coupling Current (DISCC) model. It is a finite element (FE) model based on a homogenization approach enabling efficient and accurate simulation of the transient magnetic response of superconducting Rutherford cables without explicitly representing individual strands. The DISCC model reproduces the inter-strand coupling current dynamics via a novel mixed FE formulation, and can be combined with the Reduced Order Hysteretic Magnetization (ROHM) and Flux (ROHF) models in order to reproduce the effects of internal strand dynamics: hysteresis, eddy, and inter-filament coupling currents, as well as ohmic effects. The DISCC model offers a massive reduction of the computational time compared to fully detailed FE models and still accounts for all types of loss and magnetization contributions. As a result, Rutherford cables homogenized with the DISCC model can be directly included in FE models of magnet cross-sections for efficient electro-magneto-thermal simulations of their transient response. We present two possible FE formulations for the implementation of the DISCC model, a first one based on the h-phi-formulation, and a second one based on the h-phi-a-formulation, which is well suited for an efficient treatment of the ferromagnetic regions in magnet cross-sections.",
    "authors": [
      "Julien Dular",
      "Alexander Glock",
      "Arjan Verweij",
      "Mariusz Wozniak"
    ],
    "published": "2025-10-28T16:45:23Z",
    "updated": "2026-02-02T14:13:53Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.02088v1",
    "url": "https://arxiv.org/abs/2602.02088v1",
    "pdf_url": "https://arxiv.org/pdf/2602.02088v1.pdf",
    "title": "A statistical theory of electronic degrees of freedom in wave packet molecular dynamics",
    "abstract": "We derive statistical distributions for the degrees of freedom in wave packet molecular dynamics models. Specifically, a theory is developed for the width distributions of Gaussian wavepackets in both isotropic and anisotropic formulations. The resulting distribution functions show good agreement with molecular dynamics data under warm dense matter conditions, providing practical guidance for constraining the confining potential, an empirical parameter in the model. We also discuss how these distributions influence the resulting effective Coulomb interactions.",
    "authors": [
      "Daniel Plummer",
      "Pontus Svensson",
      "Wiktor Jasniak",
      "Patrick Hollebon",
      "Sam M. Vinko",
      "Gianluca Gregori"
    ],
    "published": "2026-02-02T13:35:02Z",
    "updated": "2026-02-02T13:35:02Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.01972v1",
    "url": "https://arxiv.org/abs/2602.01972v1",
    "pdf_url": "https://arxiv.org/pdf/2602.01972v1.pdf",
    "title": "Heat load measurements for the PIP-II pHB650 cryomodule",
    "abstract": "Phase-3 testing of the pHB650 cryomodule at the PIP-II Injector Test Facility was conducted to evaluate the effectiveness of heat load mitigations performed after earlier phases of testing and to continue pinpointing any sources of unexpectedly high heat loads.. The programme measured HTTS, LTTS, and 2 K isothermal/non-isothermal loads under \"standard\", \"linac\", and \"simulated dynamic\" operating modes, recording data both inside the cryomodule and across the bayonet can circuits. Thermal-acoustic oscillations were eliminated by replacing the original G10 cooldown-valve stem with a stainless-steel stem fitted with wipers. A newly developed Python script automated acquisition of ACNET data, performed real-time heat-load calculations, and generated plots and tables that were posted to the electronic logbook within minutes, vastly reducing manual effort and accelerating feedback between SRF and cryogenics teams. Analysis showed that JT heat-exchanger effectiveness and temperature stratification in the two-phase and relief piping strongly influence the observed loads and helped isolate sources of excess heat. The campaign demonstrates that rigorous pre-test planning, real-time diagnostics, and automated reporting can improve both accuracy and efficiency, providing a template for future PIP-II cryomodule tests and for implementing targeted heat-load mitigations.",
    "authors": [
      "D. Porwisiak",
      "M. J. White",
      "V. Roger",
      "J. Bernardini",
      "B. J. Hansen",
      "J. P. Holzbauer",
      "J. Makara",
      "J. Ozelis",
      "D. Passarelli",
      "S. Yoon",
      "J. Subedi",
      "S. Ranpariya",
      "V. Patel",
      "J. Dong"
    ],
    "published": "2026-02-02T11:25:46Z",
    "updated": "2026-02-02T11:25:46Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.05589v3",
    "url": "https://arxiv.org/abs/2512.05589v3",
    "pdf_url": "https://arxiv.org/pdf/2512.05589v3.pdf",
    "title": "Design and Performance of a 96-channel Resistive PICOSEC Micromegas Detector for ENUBET",
    "abstract": "The PICOSEC-Micromegas (PICOSEC-MM) detector is a fast gaseous detector that achieves picosecond-level timing by coupling a Cherenkov radiator, typically an MgF2 crystal, to a Micromegas-based photodetector with a photocathode. This configuration allows the fast photoelectron-induced signal to suppress the intrinsic time jitter of gaseous detectors, enabling sub-20 ps timing precision while preserving the robustness and scalability of micro-pattern gaseous detector technologies. The 96-pad PICOSEC-MM detector is a large-area demonstrator optimized for precision timing in high-energy physics, building on research and development insights from earlier 7-pad resistive prototypes to validate scalability, uniformity, and robustness for the ENUBET project. It employs a 2.5 nm diamond-like carbon photocathode and a Micromegas board with a surface resistivity of 10 megaohms per square, and was characterized using 150 GeV/c muons at the CERN SPS beamline, with one-third of the active area instrumented per run. A dedicated alignment procedure for multi-pad PICOSEC-MM systems was used to reconstruct pad centers and merge measurements across regions, yielding a timing resolution of 43 ps and uniform signal arrival time distributions over the tested area. Mechanical flatness was identified as a key factor, with planarity tolerances within 10 micrometers required to maintain good timing resolution, and the successful operation of the 96-pad demonstrator confirms the scalability of the PICOSEC-MM concept toward robust, high-granularity, picosecond-level gaseous timing detectors for monitored neutrino beam experiments such as ENUBET.",
    "authors": [
      "A. Kallitsopoulou",
      "S. Aune",
      "Y. Angelis",
      "R. Aleksan",
      "A. Bonenfant",
      "J. Bortfeldt",
      "F. Brunbauer",
      "M. Brunoldi",
      "J. Datta",
      "D. Desforge",
      "G. Fanourakis",
      "D. Fiorina",
      "K. J. Floethner",
      "M. Gallinaro",
      "F. Garcia",
      "I. Giomataris",
      "K. Gnanvo",
      "F. J. Iguaz",
      "D. Janssens",
      "F. Jeanneau",
      "M. Kebbiri",
      "M. Kovacic",
      "B. Kross",
      "P. Legou",
      "M. Lisowska",
      "J. Liu",
      "C. Loiseau",
      "M. Lupberger",
      "I. Maniatis",
      "J. McKisson",
      "B. Moreno",
      "Y. Meng",
      "H. Muller",
      "E. Oliveri",
      "G. Orlandini",
      "A. Pandey",
      "T. Papaevangelou",
      "M. Pomorski",
      "E. F. Ribas",
      "L. Ropelewski",
      "D. Sampsonidis",
      "L. Scharenberg",
      "T. Schneider",
      "E. Scorsone",
      "L. Sohl",
      "M. van Stenis",
      "Y. Tsipolitis",
      "S. E. Tzamarias",
      "A. Utrobicic",
      "I. Vai",
      "R. Veenhof",
      "P. Vitulo",
      "X. Wang",
      "S. White",
      "W. Xi",
      "Z. Zhang",
      "Y. Zhou"
    ],
    "published": "2025-12-05T10:23:46Z",
    "updated": "2026-02-02T10:45:53Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2503.00532v5",
    "url": "https://arxiv.org/abs/2503.00532v5",
    "pdf_url": "https://arxiv.org/pdf/2503.00532v5.pdf",
    "title": "Performance and radiation damage mitigation strategy for silicon photomultipliers on LEO space missions",
    "abstract": "Space missions require lightweight, low-power consuming, radiation-tolerant components. Silicon photomultipliers are increasingly used for detecting near-UV, optical, and infrared light in space due to their compact design, low cost, low power consumption, robustness, and high photo-detection efficiency, which makes them sensitive to single photons. Although SiPMs outperform traditional photomultiplier tubes in many areas, concerns about their radiation tolerance and noise remain. In this study, we estimate the radiation effects on a satellite in sun-synchronous low Earth orbit (LEO) at an altitude of 550~km during the declining phase of solar cycle 25 (2026-2029). We evaluated silicon photomultipliers produced by the Foundation Bruno Kessler (FBK) using front-side illuminated technology with metal trenches (NUV-HD-MT), assessing their response to a 50~MeV proton beam and exposure to a $β$-radioactive source (strontium-90). Simulations with SPENVIS and Geant4 were used to validate the experimental results. Based on our findings, we propose a photosensor annealing strategy for space-based instruments.",
    "authors": [
      "L. Burmistrov",
      "S. Davarpanah",
      "M. Heller",
      "T. Montaruli",
      "C. Trimarelli",
      "R. Aloisio",
      "F. C. T. Barbato",
      "I. De Mitri",
      "A. Di Giovanni",
      "G. Fontanella",
      "P. Savina",
      "C. Tönnis",
      "E. Moretti",
      "M. Ruzzarin",
      "J. Swakoń",
      "D. Wróbel"
    ],
    "published": "2025-03-01T15:17:13Z",
    "updated": "2026-02-02T10:27:23Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1088/1475-7516/2025/07/073"
  },
  {
    "arxiv_id": "2511.03989v2",
    "url": "https://arxiv.org/abs/2511.03989v2",
    "pdf_url": "https://arxiv.org/pdf/2511.03989v2.pdf",
    "title": "Performance study of 4-MU-loaded water for Cherenkov light detection",
    "abstract": "We report on R&D study to improve the photon detection efficiency of water Cherenkov detectors by doping ultra-pure water with 4-methylumbelliferone (4-MU), a wavelength shifting additive. Cherenkov light yields from cosmic-ray muons were measured for various 4-MU concentrations and compared with those from pure water. At a concentration of 1 ppm, the detected light yield increased by approximately a factor of three. This enhancement can be attributed to wavelength shifting and improved photon collection efficiency. No noticeable degradation in optical transparency was observed across the tested concentrations of 0.5 and 1 ppm with different concentration of ethanol. These results suggest that 4-MU is a promising additive for improving the performance of water Cherenkov detectors.",
    "authors": [
      "Pendo B. Nyanda",
      "Gowoon Kim",
      "Youngduk Kim",
      "Kyungmin Seo",
      "Jaison Lee",
      "Olga Gileva",
      "Eungseok Yi"
    ],
    "published": "2025-11-06T02:22:11Z",
    "updated": "2026-02-02T10:05:26Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.01888v1",
    "url": "https://arxiv.org/abs/2602.01888v1",
    "pdf_url": "https://arxiv.org/pdf/2602.01888v1.pdf",
    "title": "Multigrid Poisson Solver for Complex Geometries Using Finite Difference Method",
    "abstract": "We present an efficient numerical method, inspired by transformation optics, for solving the Poisson equation in complex and arbitrarily shaped geometries. The approach operates by mapping the physical domain to a uniform computational domain through coordinate transformations, which can be applied either to the entire domain or selectively to specific boundaries inside the domain. This flexibility allows both homogeneous (Laplace equation) and inhomogeneous (Poisson equation) problems to be solved efficiently using iterative or fast direct solvers, with only the material parameters and source terms modified according to the transformation. The method is formulated within a finite difference framework, where the modified material properties are computed from the coordinate transformation equations, either analytically or numerically. This enables accurate treatment of arbitrary geometric shapes while retaining the simplicity of a uniform grid solver. Numerical experiments confirm that the method achieves second-order accuracy , and offers a straightforward pathway to integrate fast solvers such as multigrid methods on the uniform computational grid.",
    "authors": [
      "Deepak Gautam",
      "Bhooshan Paradkar"
    ],
    "published": "2026-02-02T10:00:10Z",
    "updated": "2026-02-02T10:00:10Z",
    "categories": [
      "math.NA",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "math.NA"
  },
  {
    "arxiv_id": "2602.01886v1",
    "url": "https://arxiv.org/abs/2602.01886v1",
    "pdf_url": "https://arxiv.org/pdf/2602.01886v1.pdf",
    "title": "Development and characterization of hybrid MCP-PMT with embedded Timepix4 ASIC used as pixelated anode",
    "abstract": "We present a novel single-photon detector based on a vacuum tube incorporating a photocathode, a microchannel plate (MCP), and a Timepix4 CMOS ASIC functioning as a pixelated anode. Designed to handle photon rates up to 1 billion per second across a 7 cm$^2$ active area, the detector achieves outstanding spatial and temporal resolutions of 5-10 $μ$m and below 50 ps r.m.s., respectively.   The Timepix4 ASIC comprises approximately 230,000 pixels, each integrating analog and digital front-end electronics. This enables data-driven acquisition and supports data transmission rates up to 160 Gb/s. External FPGA-based electronics manage both configuration and readout.   In order to test the timing performance of the Timepix4 ASIC we performed preliminary characterization of an assembly bonded to a 100 $μ$m thick n-on-p silicon sensor using a pulsed infrared laser, which demonstrated a per-pixel timing resolution of 110 ps, with cluster-based averaging methods improving to below 50 ps.   Six prototype detectors incorporating different MCP stack configurations and end-spoiling depths were produced by Hamamatsu Photonics. We report on their characterization, including dark count rates, gain, and spatial and timing resolutions, assessed both in laboratory conditions and during a test-beam campaign at CERN's SPS facility.",
    "authors": [
      "Riccardo Bolzonella",
      "Jerome Alozy",
      "Rafael Ballabriga",
      "Nicolò Vladi Biesuz",
      "Michael Campbell",
      "Viola Cavallini",
      "Angelo Cotta Ramusino",
      "Massimiliano Fiorini",
      "Edoardo Franzoso",
      "Marco Guarise",
      "Xavi Llopart Cudie",
      "Gabriele Romolini",
      "Alessandro Saputi"
    ],
    "published": "2026-02-02T09:58:51Z",
    "updated": "2026-02-02T09:58:51Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1016/j.nima.2025.170965"
  },
  {
    "arxiv_id": "2510.15997v3",
    "url": "https://arxiv.org/abs/2510.15997v3",
    "pdf_url": "https://arxiv.org/pdf/2510.15997v3.pdf",
    "title": "Frequency domain laser ultrasound for inertial confinement fusion target wall thickness measurements",
    "abstract": "In inertial confinement fusion experiments hollow, spherical mm-sized capsules are used as a container for nuclear fuel. To achieve maximum implosion efficiency, a perfect capsule geometry is required. This paper presents a wall thickness measurement method based on zero-group velocity guided elastic wave resonances. They are measured with a non-destructive, contactless frequency domain laser ultrasound microscopy system. Wall thickness measurements along the equator of a high-density carbon capsule with a diameter of around 2 mm and a wall thickness of around 80 $\\unicode{x00B5}$m excellently agree with infrared interferometry reference measurements. In addition, the multi-resonant nature of a spherical shell is studied by complementing experimental observations with plate dispersion calculations and finite element wave propagation simulations. The presented method is scalable and can be applied to a broad range of target materials, including metals, or metal-doped targets.",
    "authors": [
      "Martin Ryzy",
      "Guqi Yan",
      "Clemens Grünsteidl",
      "Georg Watzl",
      "Kevin Sequoia",
      "Pavel Lapa",
      "Haibo Huang"
    ],
    "published": "2025-10-14T08:56:55Z",
    "updated": "2026-02-02T09:36:08Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mtrl-sci",
      "physics.app-ph",
      "physics.optics",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1016/j.pacs.2026.100801"
  },
  {
    "arxiv_id": "2602.01800v1",
    "url": "https://arxiv.org/abs/2602.01800v1",
    "pdf_url": "https://arxiv.org/pdf/2602.01800v1.pdf",
    "title": "Proton Energy Dependence of Radiation Induced Low Gain Avalanche Detector Degradation",
    "abstract": "Low Gain Avalanche Detectors (LGADs) are key components for precise timing measurements in high-energy physics experiments, including the High Luminosity upgrades of the current LHC detectors. Their performance is, however, limited by radiation induced degradation of the gain layer, primarily driven by acceptor removal. This study presents a systematic comparison of how the degradation evolves with different incident proton energies, using LGADs from Hamamatsu Photonics (HPK) and The Institute of Microelectronics of Barcelona (IMB-CNM) irradiated with 18 MeV, 24 MeV, 400 MeV and 23 GeV protons and fluences up to 2.5x10^15 p/cm2. Electrical characterization is used to extract the acceptor removal coefficients for different proton energies, whereas IR TCT measurements offer complementary insight into the gain evolution in LGADs after irradiation. Across all devices, lower energy protons induce stronger gain layer degradation, confirming expectations. However, 400 MeV protons consistently appear less damaging than both lower and higher energy protons, an unexpected deviation from a monotonic energy trend. Conversion of proton fluences to 1 MeV neutron-equivalent fluences reduces but does not eliminate these differences, indicating that the standard Non-Ionizing Energy Loss (NIEL) scaling does not fully account for the underlying defect formation mechanisms at different energies and requires revision when considering irradiation fields that contain a broader spectrum of particle types and energies.",
    "authors": [
      "Veronika Kraus",
      "Marcos Fernandez Garcia",
      "Luca Menzio",
      "Michael Moll"
    ],
    "published": "2026-02-02T08:31:08Z",
    "updated": "2026-02-02T08:31:08Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.02258v3",
    "url": "https://arxiv.org/abs/2510.02258v3",
    "pdf_url": "https://arxiv.org/pdf/2510.02258v3.pdf",
    "title": "Predicting the single-site and multi-site event discrimination power of dual-phase time projection chambers",
    "abstract": "Dual-phase xenon time projection chambers (TPCs) are widely used in searches for rare dark matter and neutrino interactions, in part because of their excellent position reconstruction capability in 3D. Despite their millimeter-scale resolution along the charge drift axis, xenon TPCs face challenges in resolving single-site (SS) and multi-site (MS) interactions in the transverse plane. In this paper, we build a generic TPC model with an idealized signal readout, and use Fisher Information (FI) to predict its theoretical capability of differentiating SS and MS events using the electroluminescence signal. We also demonstrate via simulation that, when only statistical photon noise is present, the theoretical limits can be approached with conventional reconstruction algorithms like maximum likelihood estimation, and with a convolutional neural network classifier. The implications of this study on future TPC experiments will be discussed.",
    "authors": [
      "A. B. M. Rafi Sazzad",
      "Clarke A. Hardy",
      "Xiang Dai",
      "Jingke Xu",
      "Brian G. Lenardo",
      "Felicia Sutanto",
      "Nicholas A. Antipa",
      "Jeremy D. Koertzen",
      "Prince John",
      "Abraham Akinin",
      "Teal J. Pershing"
    ],
    "published": "2025-10-02T17:41:15Z",
    "updated": "2026-02-02T06:09:36Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2507.04596v3",
    "url": "https://arxiv.org/abs/2507.04596v3",
    "pdf_url": "https://arxiv.org/pdf/2507.04596v3.pdf",
    "title": "On Topology of Perturbed Vortices",
    "abstract": "This work shows that the interiors of perturbed zero-helicity vortices display simply connected topology with a crescent-shaped boundary. Flux surfaces in fluid and magnetic vortices were explored analytically, while particle trajectories in the context of plasma confinement were examined numerically, demonstrating the existence of both toroidal and simply connected topologies. This new topology appears for perturbations in a broad class, with amplitudes and spatial variance allowed to be arbitrarily small. A corollary of this work proves the closedness of field lines under odd-parity perturbations of zero-helicity vortices in full three dimensional context.",
    "authors": [
      "Taosif Ahsan",
      "Samuel A. Cohen",
      "Alan H. Glasser"
    ],
    "published": "2025-07-07T01:19:11Z",
    "updated": "2026-02-02T04:52:05Z",
    "categories": [
      "math-ph",
      "physics.flu-dyn",
      "physics.plasm-ph"
    ],
    "primary_category": "math-ph"
  },
  {
    "arxiv_id": "2602.01504v1",
    "url": "https://arxiv.org/abs/2602.01504v1",
    "pdf_url": "https://arxiv.org/pdf/2602.01504v1.pdf",
    "title": "First Experimental Demonstration of Beam Storage by Three-Dimensional Spiral Injection Scheme for Ultra-Compact Storage Rings",
    "abstract": "Three-dimensional spiral injection scheme enables storage in ultra-compact rings with nanosecond revolution period. We report the first successful storage of a $297\\,\\mathrm{keV/}c$ electron beam in a $22\\,\\mathrm{cm}$ weak-focusing storage ring with a $4.7\\,\\mathrm{ns}$ revolution period using multi-turn vertical kick with a $140\\,\\mathrm{ns}$ kicker pulse. Using a scintillating-fiber detector, we observe a signal exceeding $5σ$ of the pre-injection rms noise for $\\geq 1\\,\\mathrm{μs}$, confirming beam storage. By varying the weak-focusing field configuration and measuring the stored beam distribution, we show that the storage beam resides within the predicted region by Monte Carlo simulations. This result is a key proof-of-principle for realizing ultra-compact storage rings for next-generation precision measurements including the muon experiments at J-PARC and PSI.",
    "authors": [
      "R. Matsushita",
      "H. Iinuma",
      "S. Ohsawa",
      "H. Nakayama",
      "K. Furukawa",
      "S. Ogawa",
      "N. Saito",
      "T. Mibe",
      "M. A. Rehman"
    ],
    "published": "2026-02-02T00:33:47Z",
    "updated": "2026-02-02T00:33:47Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.01426v1",
    "url": "https://arxiv.org/abs/2602.01426v1",
    "pdf_url": "https://arxiv.org/pdf/2602.01426v1.pdf",
    "title": "Free-space and Satellite-Based Quantum Communication: Principles, Implementations, and Challenges",
    "abstract": "Satellite-based quantum communications represent a critical advancement in the pursuit of secure, global-scale quantum networks. Leveraging the principles of quantum mechanics, these systems offer unparalleled security through Quantum Key Distribution (QKD) and other quantum communication protocols. This review provides a comprehensive overview of the current state of satellite-based quantum communications, focusing on the evolution from terrestrial to space-based systems. We explore the distinct advantages and challenges of discrete-variable (DV) and continuous-variable (CV) quantum communication technologies in the context of satellite deployments. The paper also discusses key milestones such as the successful implementation of quantum communication via the Micius satellite and outlines the primary challenges, including atmospheric turbulence and the development of quantum repeaters, that must be addressed to achieve a global quantum internet. This review aims to consolidate recent advancements in the field, providing insights and perspectives on the future directions and potential innovations that will drive the continued evolution of satellite-based quantum communications.",
    "authors": [
      "Georgi Gary Rozenman",
      "Alona Maslennikov",
      "Sara P. Gandelman",
      "Yuval Reches",
      "Sahar Delfan",
      "Neel Kanth Kundu",
      "Leyi Zhang",
      "Ruiqi Liu"
    ],
    "published": "2026-02-01T20:21:26Z",
    "updated": "2026-02-01T20:21:26Z",
    "categories": [
      "quant-ph",
      "cs.CR",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2602.01422v1",
    "url": "https://arxiv.org/abs/2602.01422v1",
    "pdf_url": "https://arxiv.org/pdf/2602.01422v1.pdf",
    "title": "PCIe400 generic readout board qualification test",
    "abstract": "The PCIe400 is a generic board for high-throughput data acquisition systems in high energy physics experiments. Its purpose is to interface up to 48 bidirectional links, supporting custom protocols at 1 to 26 Gbit/s, to modern commercial back-end links providing 400 Gbit/s bandwidth. It also targets clock distribution with phase determinism below 10 ps peak-to-peak. It has been designed for LHCb LS3 enhancement upgrade with experimental features to prepare LHCb Upgrade II, foreseeing an aggregated throughput of 200 Tbit/s. However, its versatility allows it to be used in several experimental environments. The board embeds Altera's flagship Agilex 7 M-series FPGA with a PCIe Gen 5 interface and an experimental QSFP112 serial interface. We present the results of qualification tests performed on prototype boards and the challenges encountered to meet specifications. Section 1 describes board-level validation, including power-up behavior and peripheral access. Section 2 focuses on high-bandwidth interface qualification through BER measurements. Finally, Section 3 investigates phase determinism in Agilex transceivers, a key requirement for precise clock distribution.",
    "authors": [
      "Kevin Arnaud",
      "Antoine Back",
      "Daniel Charlet",
      "Gabriel Degret",
      "Luigi Del Buono",
      "Paolo Durante",
      "Amaury Hervo",
      "Frédéric Hachon",
      "Xavier Lafay",
      "Julien Langouët",
      "Renaud Le Gac",
      "Jea-Luc Meunier",
      "Jean-Marc Nappa",
      "Costy Nassif Mattar",
      "Christophe Renard",
      "Guillaume Vouters"
    ],
    "published": "2026-02-01T20:02:30Z",
    "updated": "2026-02-01T20:02:30Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.01314v1",
    "url": "https://arxiv.org/abs/2602.01314v1",
    "pdf_url": "https://arxiv.org/pdf/2602.01314v1.pdf",
    "title": "Irreversibility and Entropy Exclusion in Collisionless Plasmas",
    "abstract": "We examine entropy production in reduced descriptions of collisionless plasmas. Introducing a closure dependent entropy hierarchy, we show that non-conservative moment closures generate a residual entropy associated with irreversible information loss, whereas invariant closures remain reversible. The monotonic growth of this residual entropy imposes a statistical realizability constraint on macroscopic plasma states, excluding regions of phase space independent of dynamical stability. For anisotropic plasmas, we evaluate entropy production within a second-order moment closure, identifying contributions from transport and magnetic field inhomogeneity. The resulting entropy exclusion boundary is broadly consistent with observed anisotropy distributions in space plasmas. Statistical realizability thus emerges as an organizing principle for reduced collisionless plasma descriptions.",
    "authors": [
      "Alexander G. Tevzadze"
    ],
    "published": "2026-02-01T16:14:33Z",
    "updated": "2026-02-01T16:14:33Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.01097v1",
    "url": "https://arxiv.org/abs/2602.01097v1",
    "pdf_url": "https://arxiv.org/pdf/2602.01097v1.pdf",
    "title": "Radiation-Driven Origin of Super-Equipartition Magnetic Fields in Accretion Discs and Outflows",
    "abstract": "Magnetic fields play a central role in accretion physics around black holes, yet their physical origin within accretion flows remains an open problem. In this work, we investigate the generation and subsequent evolution of magnetic fields triggered by anisotropic radiation fields in black hole accretion discs with compact rotating inner corona. We self-consistently evolve the magnetic field using the generalized field evolution MHD equation, including advection, shear-driven induction, and Hall effects. The radiation field acts as a primary field generator, while azimuthal rotation in the magnetized plasma provides rapid amplification. We find that radiation-generated fields efficiently reach a dominant toroidal component by Keplerian rotation, leading to magnetic field strengths of order $\\sim 10^{8}\\,\\mathrm{G}$ in the vicinity of a 10 solar mass black hole and accretion disc-corona emitting at luminosity equivalent to the Eddington unit. These magnetic fields are achieved within viscous timescales and reach or exceed local equipartition estimates based on gas pressure. When vertical outflows are included, the amplified magnetic fields are advected into the corona, magnetizing disc-launched winds and jet precursors with field strengths of similar order. Our results demonstrate that radiation is not merely a passive component of accretion flows, but provides a robust and unavoidable trigger for the generation of dynamically significant magnetic fields. Our results provide a physically grounded explanation for the origin of large-scale, structured magnetic fields in and around accretion discs. This mechanism offers a pathway for magnetizing accretion discs and their outflows without invoking externally supplied magnetic flux, with broad implications for X-ray binaries, active galactic nuclei and other transients such as gamma-ray bursts (GRBs).",
    "authors": [
      "Mukesh Kumar Vyas",
      "Asaf Pe'er"
    ],
    "published": "2026-02-01T08:30:12Z",
    "updated": "2026-02-01T08:30:12Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2510.23088v2",
    "url": "https://arxiv.org/abs/2510.23088v2",
    "pdf_url": "https://arxiv.org/pdf/2510.23088v2.pdf",
    "title": "Machine Learning approach to modeling of neutral particles transport in plasma",
    "abstract": "A propagator-based approach is investigated for Monte-Carlo (MC) modeling of neutral particles transport in fusion boundary plasmas. The propagator is essentially a Green function for the neutral kinetic equation, which depends on the plasma profiles. A Neural Network (NN) based model for the propagator provides a fast and accurate solution for the neutral distribution function in plasma. Furthermore, continuous and smooth dependence of NN-based reconstruction of the propagator on the plasma parameters opens the possibility for using this approach with Jacobian-based methods for time-integration and root finding. Initial results from a small 1D test problem look promising; however, important research questions are concerned with the scaling of the algorithm to larger systems.",
    "authors": [
      "M. V. Umansky",
      "G. J. Parker",
      "R. D. Smirnov"
    ],
    "published": "2025-10-27T07:51:04Z",
    "updated": "2026-02-01T03:55:37Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.00831v1",
    "url": "https://arxiv.org/abs/2602.00831v1",
    "pdf_url": "https://arxiv.org/pdf/2602.00831v1.pdf",
    "title": "Emerging Technologies and Methods in Wide-Area Search for Nuclear Materials",
    "abstract": "Canada, a Tier 1 nuclear nation involved in uranium mining and refining, operating nuclear power reactors, and with a Small Modular Reactor action plan, maintains a rigorous nuclear security infrastructure. The Nuclear Emergency Response team at Natural Resources Canada fulfills federal mandates in high-sensitivity air- and ground-based mobile survey for prevention, detection and response. A robust operational framework exists for deployment of traditional large-volume NaI(Tl)-based detection suites. At the same time, a research arm examines emerging non-nuclear technologies which can enhance the capabilities of the operational team. Herein, the potential for uncrewed mobile systems in nuclear security and emergency response operations is discussed. The impact of new technologies such as silicon photomultipliers, gamma imagers and self-shielding directional detectors is presented, and the use of high-performance computing in modelling of system response functions is discussed. Finally, a capability to extrapolate to the location of a source some distance away from a survey trajectory is shown. The extrapolation method includes propagation of the measurement error to the extrapolated region, essential information for nuclear response operators to know if a region is actually clear of radioactivity or not.",
    "authors": [
      "L. E. Sinclair",
      "D. A. McCormack"
    ],
    "published": "2026-01-31T17:51:46Z",
    "updated": "2026-01-31T17:51:46Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.00826v1",
    "url": "https://arxiv.org/abs/2602.00826v1",
    "pdf_url": "https://arxiv.org/pdf/2602.00826v1.pdf",
    "title": "Gamma Imagers for Nuclear Security and Nuclear Forensics: Recommendations based on results from a side-by-side intercomparison",
    "abstract": "Nuclear security operations and forensic investigations require the utilization of a suite of instruments ranging from passive gamma spectrometers to high-precision laboratory sample analyzers. Gamma spectroscopy survey is further broken down into wide-area search performed with large-volume scintillator-based mobile survey spectrometers which are integrated with geographic position sensors for mapping and identification of hot zones, and high-precision long-dwell measurements using solid state spectrometers for follow-on characterization to establish isotopic content and ratios. While performing well at detecting the presence, quantity and type of radioactivity, all of these methods have limited ability to determine the location of a source of radioactivity. In recent years, technology advances have resulted in gamma imager devices which can create an image of the distribution of radioactive sources using the gamma emissions which accompany radioactive decay, and overlay this on an optical photograph of the environment. These gamma imaging devices have arisen out of methods developed for medical physics, experimental particle physics, and astrophysics, resulting in a proliferation of different technological approaches. Those responsible for establishing a nuclear security concept of operations, require guidance to choose the proper gamma imager for each of the application spaces in a tiered response. Here the results of an intercomparison of two gamma imagers based on two widely different technologies, semiconductor and scintillator detectors, are presented. The optimal utilization of these imaging technologies in a tiered response is discussed based on the results of the trial. Finally, an outlook on future directions for gamma imaging advances is provided.",
    "authors": [
      "L. E. Sinclair",
      "P. R. B. Saull",
      "A. McCann",
      "A. M. L. MacLeod",
      "N. J. Murtha",
      "A. El-Jaby",
      "G. Jonkmans"
    ],
    "published": "2026-01-31T17:42:04Z",
    "updated": "2026-01-31T17:42:04Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.00786v1",
    "url": "https://arxiv.org/abs/2602.00786v1",
    "pdf_url": "https://arxiv.org/pdf/2602.00786v1.pdf",
    "title": "Flow Generation via Catastrophic Loss of Equilibrium in Weakly-Rotating Self-Gravitating Fluids: A Minimal Idealized Model",
    "abstract": "This paper explores the catastrophic energy transformations, in particular the ones leading to the generation of a flow in a weakly rotating self-gravitating fluid/gas found, for instance, in the vicinity of a massive compact object. Because of the similarity in the governing equations, the system dynamics is worked out exactly in parallel to the methods developed for investigating catastrophic relaxation in stellar plasmas [1-3]. In the latter a more ``complex\" equilibrium state, on slow changes in the environment, can lose its equilibrium (catastrophe), and transform to a less complex state with a very different energy mix from the original. It is shown that a similar transformation in the weakly rotating self-gravitating fluid/gas will convert much of its gravitation energy into kinetic energy in the flow. Since flows are a perennial ingredient of high-energy astrophysical systems, the energy transformation processes revealed in present study, can advance our understanding of a variety of them. Some particularly relevant examples are: macro-scale flows / structures in galaxies, accretion discs, and the dynamics and stability of a rotating star / its atmosphere.",
    "authors": [
      "L. Gudushauri",
      "N. L. Shatashvili",
      "G. Shekiladze",
      "S. M. Mahajan"
    ],
    "published": "2026-01-31T15:52:05Z",
    "updated": "2026-01-31T15:52:05Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE",
    "doi": "10.1103/whwv-trcw"
  },
  {
    "arxiv_id": "2502.17002v2",
    "url": "https://arxiv.org/abs/2502.17002v2",
    "pdf_url": "https://arxiv.org/pdf/2502.17002v2.pdf",
    "title": "Neutron multiplicity measurement in muon capture on oxygen nuclei in the Gd-loaded Super-Kamiokande detector",
    "abstract": "In recent neutrino detectors, neutrons produced in neutrino reactions play an important role. Muon capture on oxygen nuclei is one of the processes that produce neutrons in water Cherenkov detectors. We measured neutron multiplicity in the process using cosmic ray muons that stop in the gadolinium-loaded Super-Kamiokande detector. For this measurement, neutron detection efficiency is obtained with the muon capture events followed by gamma rays to be $50.2^{+2.0}_{-2.1}\\%$. By fitting the observed multiplicity considering the detection efficiency, we measure neutron multiplicity in muon capture as $P(0)=24\\pm3\\%$, $P(1)=70^{+3}_{-2}\\%$, $P(2)=6.1\\pm0.5\\%$, $P(3)=0.38\\pm0.09\\%$. This is the first measurement of the multiplicity of neutrons associated with muon capture on oxygen without neutron energy threshold.",
    "authors": [
      "The Super-Kamiokande Collaboration",
      ":",
      "S. Miki",
      "K. Abe",
      "S. Abe",
      "Y. Asaoka",
      "C. Bronner",
      "M. Harada",
      "Y. Hayato",
      "K. Hiraide",
      "K. Hosokawa",
      "K. Ieki",
      "M. Ikeda",
      "J. Kameda",
      "Y. Kanemura",
      "R. Kaneshima",
      "Y. Kashiwagi",
      "Y. Kataoka",
      "S. Mine",
      "M. Miura",
      "S. Moriyama",
      "M. Nakahata",
      "S. Nakayama",
      "Y. Noguchi",
      "K. Okamoto",
      "G. Pronost",
      "K. Sato",
      "H. Sekiya",
      "H. Shiba",
      "K. Shimizu",
      "M. Shiozawa",
      "Y. Sonoda",
      "Y. Suzuki",
      "A. Takeda",
      "Y. Takemoto",
      "A. Takenaka",
      "H. Tanaka",
      "S. Watanabe",
      "T. Yano",
      "T. Kajita",
      "K. Okumura",
      "T. Tashiro",
      "T. Tomiya",
      "X. Wang",
      "S. Yoshida",
      "G. D. Megias",
      "P. Fernandez",
      "L. Labarga",
      "N. Ospina",
      "B. Zaldivar",
      "B. W. Pointon",
      "C. Yanagisawa",
      "E. Kearns",
      "J. L. Raaf",
      "L. Wan",
      "T. Wester",
      "J. Bian",
      "B. Cortez",
      "N. J. Griskevich",
      "S. Locke",
      "M. B. Smy",
      "H. W. Sobel",
      "V. Takhistov",
      "A. Yankelevich",
      "J. Hill",
      "M. C. Jang",
      "S. H. Lee",
      "D. H. Moon",
      "R. G. Park",
      "B. S. Yang",
      "B. Bodur",
      "K. Scholberg",
      "C. W. Walter",
      "A. Beauchêne",
      "O. Drapier",
      "A. Ershova",
      "A. Giampaolo",
      "Th. A. Mueller",
      "A. D. Santos",
      "P. Paganini",
      "C. Quach",
      "B. Quilain",
      "R. Rogly",
      "T. Nakamura",
      "J. S. Jang",
      "R. P. Litchfield",
      "L. N. Machado",
      "F. J. P. Soler",
      "J. G. Learned",
      "K. Choi",
      "N. Iovine",
      "S. Cao",
      "L. H. V. Anthony",
      "D. Martin",
      "N. W. Prouse",
      "M. Scott",
      "A. A. Sztuc",
      "Y. Uchida",
      "V. Berardi",
      "N. F. Calabria",
      "M. G. Catanesi",
      "E. Radicioni",
      "N. F. Calabria",
      "A. Langella",
      "G. De Rosa",
      "G. Collazuol",
      "M. Feltre",
      "F. Iacob",
      "M. Lamoureux",
      "M. Mattiazzi",
      "L. Ludovici",
      "M. Gonin",
      "L. Périssé",
      "B. Quilain",
      "C. Fujisawa",
      "S. Horiuchi",
      "M. Kobayashi",
      "Y. M. Liu",
      "Y. Maekawa",
      "Y. Nishimura",
      "R. Okazaki",
      "R. Akutsu",
      "M. Friend",
      "T. Hasegawa",
      "T. Ishida",
      "T. Kobayashi",
      "M. Jakkapu",
      "T. Matsubara",
      "T. Nakadaira",
      "K. Nakamura",
      "Y. Oyama",
      "A. Portocarrero Yrey",
      "K. Sakashita",
      "T. Sekiguchi",
      "T. Tsukamoto",
      "N. Bhuiyan",
      "G. T. Burton",
      "F. Di Lodovico",
      "J. Gao",
      "A. Goldsack",
      "T. Katori",
      "J. Migenda",
      "R. M. Ramsden",
      "Z. Xie",
      "S. Zsoldos",
      "Y. Kotsar",
      "H. Ozaki",
      "A. T. Suzuki",
      "Y. Takagi",
      "Y. Takeuchi",
      "H. Zhong",
      "J. Feng",
      "L. Feng",
      "S. Han",
      "J. R. Hu",
      "Z. Hu",
      "M. Kawaue",
      "T. Kikawa",
      "M. Mori",
      "T. Nakaya",
      "T. V. Ngoc",
      "R. A. Wendell",
      "K. Yasutome",
      "S. J. Jenkins",
      "N. McCauley",
      "P. Mehta",
      "A. Tarrant",
      "M. J. Wilking",
      "Y. Fukuda",
      "Y. Itow",
      "H. Menjo",
      "K. Ninomiya",
      "Y. Yoshioka",
      "J. Lagoda",
      "M. Mandal",
      "P. Mijakowski",
      "Y. S. Prabhu",
      "J. Zalipska",
      "M. Jia",
      "J. Jiang",
      "C. K. Jung",
      "W. Shi",
      "M. J. Wilking",
      "Y. Hino",
      "H. Ishino",
      "H. Kitagawa",
      "Y. Koshio",
      "F. Nakanishi",
      "S. Sakai",
      "T. Tada",
      "T. Tano",
      "T. Ishizuka",
      "G. Barr",
      "D. Barrow",
      "L. Cook",
      "S. Samani",
      "D. Wark",
      "A. Holin",
      "F. Nova",
      "S. Jung",
      "B. S. Yang",
      "J. Y. Yang",
      "J. Yoo",
      "J. E. P. Fannon",
      "L. Kneale",
      "M. Malek",
      "J. M. McElwee",
      "T. Peacock",
      "P. Stowell",
      "M. D. Thiesse",
      "L. F. Thompson",
      "S. T. Wilson",
      "H. Okazawa",
      "S. M. Lakshmi",
      "S. B. Kim",
      "E. Kwon",
      "M. W. Lee",
      "J. W. Seo",
      "I. Yu",
      "A. K. Ichikawa",
      "K. D. Nakamura",
      "S. Tairafune",
      "K. Nishijima",
      "A. Eguchi",
      "S. Goto",
      "Y. Mizuno",
      "T. Muro",
      "K. Nakagiri",
      "Y. Nakajima",
      "S. Shima",
      "N. Taniuchi",
      "E. Watanabe",
      "M. Yokoyama",
      "P. de Perio",
      "S. Fujita",
      "C. Jesús-Valls",
      "K. Martens",
      "Ll. Marti",
      "K. M. Tsui",
      "M. R. Vagins",
      "J. Xia",
      "M. Kuze",
      "S. Izumiyama",
      "R. Matsumoto",
      "K. Terada",
      "R. Asaka",
      "M. Ishitsuka",
      "H. Ito",
      "T. Kinoshita",
      "Y. Ommura",
      "N. Shigeta",
      "M. Shinoki",
      "T. Suganuma",
      "K. Yamauchi",
      "T. Yoshida",
      "J. F. Martin",
      "H. A. Tanaka",
      "T. Towstego",
      "Y. Nakano",
      "F. Cormier",
      "R. Gaur",
      "V. Gousy-Leblanc",
      "M. Hartz",
      "A. Konaka",
      "X. Li",
      "B. R. Smithers",
      "S. Chen",
      "Y. Wu",
      "B. D. Xu",
      "A. Q. Zhang",
      "B. Zhang",
      "M. Girgus",
      "P. Govindaraj",
      "M. Posiadala-Zezula",
      "S. B. Boyd",
      "R. Edwards",
      "D. Hadley",
      "M. Nicholson",
      "M. O'Flaherty",
      "B. Richards",
      "A. Ali",
      "B. Jamieson",
      "S. Amanai",
      "A. Minamino",
      "G. Pintaudi",
      "S. Sano",
      "R. Shibayama",
      "R. Shimamura",
      "S. Suzuki",
      "K. Wada"
    ],
    "published": "2025-02-24T09:35:07Z",
    "updated": "2026-01-31T13:54:29Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2602.00649v1",
    "url": "https://arxiv.org/abs/2602.00649v1",
    "pdf_url": "https://arxiv.org/pdf/2602.00649v1.pdf",
    "title": "Linear Magnetohydrodynamic Waves in a Magneto-Lattice: A Unified Theoretical Framework and Numerical Validation",
    "abstract": "We present a systematic theoretical and numerical investigation of the propagation properties of linear magnetohydrodynamic (MHD) waves in a spatially periodic magnetic field, referred to as a magneto-lattice. Two types of central equations, expressed in terms of $\\left(ρ,\\boldsymbol{B},\\boldsymbol{v}\\right)$ (where $ρ$ is perturbed mass density, $\\boldsymbol{B}$ is perturbed magnetic field, and $\\boldsymbol{v}$ is perturbed velocity) and the perturbation displacement $\\boldsymbolξ$, are established using the plane wave expansion (PWE) method. The validity of both equations is demonstrated through two numerical examples. This framework enables the identification of intrinsic frequency bandgaps and cutoff phenomena within the system. Our numerical results show that the bandgap width increases with the magnetic modulation ratio $B_{m}$, leading to the suppression of specific MHD wave modes. Furthermore, the periodicity of the magnetic field induces the splitting of Alfvén waves into multiple branches\\textemdash a phenomenon absent in uniform plasmas. These findings provide new insights for manipulating MHD waves in a crystalline lattice framework of structured plasmas.",
    "authors": [
      "Shiyu Sun",
      "Peifeng Fan",
      "Yulei Wang",
      "Qiang Chen",
      "Xingkai Li",
      "Weihua Wang"
    ],
    "published": "2026-01-31T10:47:17Z",
    "updated": "2026-01-31T10:47:17Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.00600v1",
    "url": "https://arxiv.org/abs/2602.00600v1",
    "pdf_url": "https://arxiv.org/pdf/2602.00600v1.pdf",
    "title": "von Neumann entropy of phase space structures in gyrokinetic plasma turbulence",
    "abstract": "We introduce a data-driven diagnostic that combines the singular value decomposition (SVD) with an information-theoretic entropy to quantify the phase-space complexity of perturbed distribution functions in gyrokinetic turbulence. Applying this framework to nonlinear flux-tube simulations that solve the time evolution of the ion distribution function represented by Fourier modes with the wavenumber for real space, we define the von Neumann entropy (vNE) to analyze the velocity-space structure. A global survey in the wavenumber space reveals a wavenumber-dependent variation of the vNE in velocity-space structure: the vNE remains low at low wavenumber but increases across $k_\\perpρ_{t\\mathrm{i}}\\sim 1$. Hermite/Laguerre decompositions revealed that the finite Larmor radius (FLR) phase mixing in the perpendicular (magnetic-moment) direction is active. Simultaneously, the systematic increase in vNE for $k_\\perpρ_{t\\mathrm{i}}$ correlates with the broadening of the Hermite spectrum, suggesting enhanced parallel phase mixing (Landau resonance) as the primary mechanism for the observed wave number dependence. These results demonstrate that the SVD-based vNE provides a compact measure of kinetic complexity without assuming a predefined basis and enables a global mapping of its wavenumber dependence of phase-mixing processes in gyrokinetic turbulence.",
    "authors": [
      "Go Yatomi",
      "Motoki Nakata"
    ],
    "published": "2026-01-31T08:30:11Z",
    "updated": "2026-01-31T08:30:11Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.00552v1",
    "url": "https://arxiv.org/abs/2602.00552v1",
    "pdf_url": "https://arxiv.org/pdf/2602.00552v1.pdf",
    "title": "Drift-kinetic PIC model for simulations of longitudinal plasma confinement in mirror traps",
    "abstract": "The paper presents a 1D2V electrostatic PIC model with a drift-kinetic description of all particle types aiming at simulating classical longitudinal plasma transport in axially symmetric open traps. The model generalizes the semi-implicit particle-in-cell method with exact conservation of energy and charge to the case of collisional plasma and adapts it to boundary conditions on perfectly conducting walls with a floating potential. Implementation of Coulomb collisions is tested on the problem of temperature relaxation in a two-component plasma and demonstrates good agreement with the analytical theory. Since quasi-neutrality of plasma is not strictly determined, the model is able to correctly reproduce the ambipolar electric potential profile up to the walls. At the same time, the main advantage of implicit PIC simulations - the ability to use large grid steps, many times larger than the Debye radius - does not prevent the correct modeling of the near-wall electric potential jump. The model satisfactorily reproduces the known results of the Debye sheath theory and the Bohm criterion. A comparison of stationary plasma profiles formed in a mirror trap in the presence of a constant particle source with the results of simulations using the hybrid code MIDAS showed that self-consistent consideration of electron kinetics in expanders leads to noticeable (at the level of 15 %) differences in the electron temperature, potential, and density of the confined plasma.",
    "authors": [
      "V. V. Glinskiy",
      "I. V. Timofeev",
      "V. V. Prikhodko"
    ],
    "published": "2026-01-31T06:29:13Z",
    "updated": "2026-01-31T06:29:13Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.18769v3",
    "url": "https://arxiv.org/abs/2512.18769v3",
    "pdf_url": "https://arxiv.org/pdf/2512.18769v3.pdf",
    "title": "Quantitative mobile gamma-ray spectrometry through Bayesian inference",
    "abstract": "Accurate quantitative mapping of gamma-ray sources is critical for applications ranging from radiological emergency response and environmental monitoring to nuclear security and deep space exploration. Here, we show that integrating high-fidelity, platform-dynamic Monte Carlo simulations and Bayesian inference with mobile gamma-ray spectrometry enables rapid and accurate quantification of distributed and point-like gamma-ray sources. Validated against laboratory and field assays, our framework quantifies natural and anthropogenic gamma-ray sources that conventional methods cannot resolve in $1\\,$s with $\\sim\\!\\!1\\,\\%$ error. The developed method marks a critical advance in quantitative gamma-ray sensing, enabling improved radiological situational awareness, enhanced terrestrial geophysical and geochemical mapping, as well as more robust constraints on radionuclide abundances on extraterrestrial bodies across the Solar System.",
    "authors": [
      "David Breitenmoser",
      "Alberto Stabilini",
      "Malgorzata Magdalena Kasprzak",
      "Sabine Mayer"
    ],
    "published": "2025-12-21T15:17:52Z",
    "updated": "2026-01-31T04:46:33Z",
    "categories": [
      "physics.ins-det",
      "physics.app-ph",
      "physics.comp-ph",
      "physics.data-an",
      "physics.geo-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.00501v1",
    "url": "https://arxiv.org/abs/2602.00501v1",
    "pdf_url": "https://arxiv.org/pdf/2602.00501v1.pdf",
    "title": "KEK Accelerator Test Facility Low-Level RF and Timing Systems",
    "abstract": "The KEK Accelerator Test Facility (ATF) is a dedicated testbed for nanobeam technologies in support of the International Linear Collider (ILC). Stable pulsed operation requires synchronization of the facility timing system with the Low-Level RF (LLRF) system. The timing system distributes trigger and gate signals to key subsystems, including the DAQ, klystrons, laser systems, pulsed kicker magnets, and interlocks. The LLRF system provides phase-coherent RF references and facility-wide clock distribution for synchronization. Achieving ~100 fs-level synchronization depends critically on the phase-noise power spectral density (PN-PSD) of the distributed clock signals and on preserving this performance throughout the distribution network. We present facility-wide measurements of the KEK ATF LLRF clock PN-PSD and discuss the resulting synchronization floor imposed by the stability of the ATF Linac and Damping Ring signal generators.",
    "authors": [
      "Konstantin Popov",
      "Alexander Aryshev",
      "Hiroshi Kaji",
      "Toshiyuki Okugi"
    ],
    "published": "2026-01-31T04:05:04Z",
    "updated": "2026-01-31T04:05:04Z",
    "categories": [
      "physics.acc-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.18365v2",
    "url": "https://arxiv.org/abs/2509.18365v2",
    "pdf_url": "https://arxiv.org/pdf/2509.18365v2.pdf",
    "title": "Lie-transform derivation of oscillation-center quasilinear theory",
    "abstract": "The derivation of the oscillation-center quasilinear theory in an unmagnetized plasma by Dewar \\cite{Dewar:1973} is rederived by Lie-transform perturbation method.",
    "authors": [
      "Alain J. Brizard"
    ],
    "published": "2025-09-22T19:46:11Z",
    "updated": "2026-01-31T00:42:12Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.00421v1",
    "url": "https://arxiv.org/abs/2602.00421v1",
    "pdf_url": "https://arxiv.org/pdf/2602.00421v1.pdf",
    "title": "Observational Evidence for Wind-Driven Low-Pass Filtering of Infrasound at Short Range",
    "abstract": "Infrasound from controlled explosions provide a unique opportunity to isolate atmospheric effects on propagation. We report observations from two campaigns in May and October 2024, each featuring 10-ton TNT-equivalent controlled surface chemical explosions recorded by a dense network of 31 single-sensor stations within 23 km. Despite identical sources, the observed wavefields were very different. October signals followed a near-unimodal period-distance trend, whereas May signals exhibited a pronounced azimuthal bifurcation in both period and celerity. Downwind paths largely preserved the short-period baseline observed in October, while upwind paths showed systematically longer periods caused by wind-driven low-pass filtering. This study provides the first direct observational evidence that tropospheric winds can impose azimuth-dependent low-pass filtering at local ranges, without the influence of measured temperature inversions. Thus, the structure of the atmosphere can modify the spectral characteristics of low-frequency acoustic waves even at a distance of only a few kilometers.",
    "authors": [
      "Elizabeth A. Silber",
      "Daniel C. Bowman",
      "Sasha Egan",
      "Lawrence Burkett",
      "Michael Fleigle",
      "Keehoon Kim",
      "Tesla Newton",
      "Loring P. Schaible",
      "Richard Sonnenfeld",
      "Nora Wynn",
      "Jonathan Snively"
    ],
    "published": "2026-01-31T00:18:38Z",
    "updated": "2026-01-31T00:18:38Z",
    "categories": [
      "physics.geo-ph",
      "physics.ao-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.geo-ph",
    "doi": "10.1029/2025GL120042"
  },
  {
    "arxiv_id": "2602.00336v1",
    "url": "https://arxiv.org/abs/2602.00336v1",
    "pdf_url": "https://arxiv.org/pdf/2602.00336v1.pdf",
    "title": "Inter-detector differential fuzz testing for tamper detection in gamma spectrometers",
    "abstract": "We extend physical differential fuzz testing as an anti-tamper method for radiation detectors [Vavrek et al., Science and Global Security 2025] to comparisons across multiple detector units. The method was previously introduced as a tamper detection method for authenticating a single radiation detector in nuclear safeguards and treaty verification scenarios, and works by randomly sampling detector configuration parameters to produce a sequence of spectra that form a baseline signature of an untampered system. At a later date, after potential tampering, the same random sequence of parameters is used to generate another series of spectra that can be compared against the baseline. Anomalies in the series of comparisons indicate changes in detector behavior, which may be due to tampering. One limitation of this original method is that once the detector has `gone downrange' and may have been tampered with, the original baseline is fixed, and a new trusted baseline can never be established if tests at new parameters are required. In this work, we extend our anti-tamper fuzz testing concept to multiple detector units, such that the downrange detector can be compared against a trusted or `golden copy' detector, even despite normal inter-detector manufacturing variations. We show using three NaI detectors that this inter-detector differential fuzz testing can detect a representative attack, even when the tested and golden copy detectors are from different manufacturers and have different performances. Here, detecting tampering requires visualizing the comparison metric vs. the parameter values and not just the sample number; moreover this baseline is non-linear and may require anomaly detection methods more complex than a simple threshold. Overall, this extension to multiple detectors improves prospects for operationalizing the technique in real-world treaty verification and safeguards contexts.",
    "authors": [
      "Pei Yao Li",
      "Jayson R. Vavrek",
      "Sean Peisert"
    ],
    "published": "2026-01-30T21:39:46Z",
    "updated": "2026-01-30T21:39:46Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.00312v1",
    "url": "https://arxiv.org/abs/2602.00312v1",
    "pdf_url": "https://arxiv.org/pdf/2602.00312v1.pdf",
    "title": "Self ordering to imposed ordering of dust -- a continuous spatial phase transition experiment in MDPX",
    "abstract": "Previous experiments conducted in the Magnetized Dusty Plasma eXperiment (MDPX) revealed an intriguing phenomenon first referred to as imposed ordering. This occurs when micron-sized dust particles become aligned with the geometry of a conducting mesh placed above the dust (at a distance much larger than the plasma Debye length or the ion-neutral or electron-neutral mean free paths) in the presence of a strong magnetic field perpendicular to the mesh. In this work, results of a transition experiment are presented wherein starting from a classical two-dimensional Coulomb crystal with hexagonal symmetry in an unmagnetized plasma $(B = 0\\,T)$, dust transitions to a state in which it flows along the geometry of a conducting mesh placed above it, mapping out the 4-fold symmetry of the boundary condition. It is hypothesized that beyond a certain magnetization, elongated electric potential structures emanating from the mesh drive the dust motion to reflect the mesh morphology, transitioning from a 6-fold self ordering to 4-fold imposed ordering. The various dust phases are quantified and a critical value of magnetic field is identified in the transition experiment indicating the onset of imposed ordering.",
    "authors": [
      "Siddharth Bachoti",
      "Saikat Chakraborty Thakur",
      "Rahul Banka",
      "Cameron Royer",
      "Edward Thomas"
    ],
    "published": "2026-01-30T21:03:28Z",
    "updated": "2026-01-30T21:03:28Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2502.20112v2",
    "url": "https://arxiv.org/abs/2502.20112v2",
    "pdf_url": "https://arxiv.org/pdf/2502.20112v2.pdf",
    "title": "Monte Carlo simulation of the ISOLPHARM gamma camera for Ag-111 imaging",
    "abstract": "Targeted Radionuclide Therapy (TRT) is a well-established technique for cancer treatment. In this approach, radionuclides are bound to specific drugs that selectively transport them to the tumor site. Within the ISOLPHARM project, a radiopharmaceutical for TRT based on the innovative radionuclide Ag-111 is currently under development. Ag-111 has a half-life of 7.45 days and decays by emitting both electrons and gamma-rays. The emission of gamma-rays, predominantly at an energy of 342 keV, enables the visualization of Ag-111 using a gamma camera. In this work, we describe a Monte Carlo simulation developed to optimize the design parameters of such an imaging device. The simulation is based on the Geant4 toolkit, which accurately models the interactions between particles and matter. The estimated spatial resolution and sensitivity of the system are approximately 4 mm and 19 cps/MBq, respectively. The simulated device is able to resolve lesions with a lesion-to-background activity ratio of 4:1 under in-vivo-like conditions. These results indicate that the proposed gamma camera can provide cost-effective imaging capabilities for preclinical radiopharmaceutical studies.",
    "authors": [
      "D. Serafini",
      "A. Leso",
      "A. Arzenton",
      "S. Spadano",
      "E. Borciani",
      "D. Chen",
      "C. Sbarra",
      "M. Negrini",
      "A. Margotti",
      "N. Lanconelli",
      "G. Baldazzi",
      "E. Mariotti",
      "S. Corradetti",
      "A. Andrighetto"
    ],
    "published": "2025-02-27T14:03:49Z",
    "updated": "2026-01-30T19:55:05Z",
    "categories": [
      "physics.med-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.med-ph"
  },
  {
    "arxiv_id": "2601.23271v1",
    "url": "https://arxiv.org/abs/2601.23271v1",
    "pdf_url": "https://arxiv.org/pdf/2601.23271v1.pdf",
    "title": "Time-Resolved Interferometric Measurements of Plasma Density Evolution in Laser-Driven Capacitor-Coil Targets",
    "abstract": "Laser-driven capacitor-coil targets provide a compact platform for generating strong magnetic fields and are widely used in magnetized high-energy-density plasma experiments. In addition to magnetic-field generation, these targets also produce plasma in the coil region, which can influence the subject physical processes, interact with secondary targets or external plasmas in their applications. However, direct, time-resolved measurements of the plasma density surrounding the coil remain limited. Here, we report interferometric measurements of the plasma density evolution in laser-driven capacitor-coil targets irradiated by the University of Osaka LFEX laser. Two-dimensional electron density maps reveal two distinct plasma sources loading the coil region: plasma generated in the coil itself and plasma produced by laser ablation of the target plates. These results provide quantitative information on plasma loading and evolution in capacitor-coil targets and are directly relevant to the design and modeling of magnetized high-energy-density plasma experiments.",
    "authors": [
      "Yang Zhang",
      "Ryo Omura",
      "Rinya Akematsu",
      "King Fai Farley Law",
      "Brandon K. Russell",
      "Geoffrey Pomraning",
      "Kian Orr",
      "Kai Kimura",
      "Muhammad Fauzan Syahbana",
      "Yuga Karaki",
      "Hiroki Matsubara",
      "Ryuya Yamada",
      "Jinyuan Dun",
      "Ryunosuke Takizawa",
      "Yasunobu Arikawa",
      "Tatiana Pikuz",
      "Yuji Fukuda",
      "Lan Gao",
      "Hantao Ji",
      "Shinsuke Fujioka"
    ],
    "published": "2026-01-30T18:37:05Z",
    "updated": "2026-01-30T18:37:05Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.09256v2",
    "url": "https://arxiv.org/abs/2508.09256v2",
    "pdf_url": "https://arxiv.org/pdf/2508.09256v2.pdf",
    "title": "Jitter Sensing and Control for Multi-Plane Phase Retrieval",
    "abstract": "The family of multi-plane phase retrieval sensors, such as the curvature and nonlinear curvature wavefront sensors (WFS), contain tip/tilt information embedded in their signals. We have built a nonlinear curvature WFS to study different wavefront reconstruction methods and test the ability to extract tip/tilt information. Using reliable and fast centroiding algorithms, combined with knowledge of the measured $z$-distance to each measurement plane, we demonstrate that image jitter may be sensed and compensated for using a fast steering mirror and the WFS in closed loop. This approach obviates the need for peripheral components such as quad-cells or access to a separate scientific imaging channel. Our laboratory experiments validate tip/tilt estimation and correction using nlCWFS data, achieving tip/tilt accuracy of +/-0.1, lambda/D for an unaberrated beam and better than ~+/-0.5, lambda/D in the presence of aberrations, consistent with prior numerical simulations. We further demonstrate a closed-loop tip/tilt control implementation and show a qualitative improvement in the stability and overall quality of multi-plane phase retrieval reconstructions.",
    "authors": [
      "Caleb G. Abbott",
      "Justin R. Crepp",
      "Brian Sands"
    ],
    "published": "2025-08-12T18:00:12Z",
    "updated": "2026-01-30T16:44:13Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2601.23140v1",
    "url": "https://arxiv.org/abs/2601.23140v1",
    "pdf_url": "https://arxiv.org/pdf/2601.23140v1.pdf",
    "title": "A predictive formula for the H-mode electron separatrix density: Bridging regression and physics-based models across C-Mod, AUG and JET tokamaks",
    "abstract": "The electron density at the separatrix ($n_{e,\\mathrm{sep}}$) plays a central role in balancing energy confinement, detachment achievement, and ELM suppression in tokamaks, thereby influencing core-edge integration. To study what determines this key parameter, a database of H-mode separatrix density measurements from Alcator C-Mod, ASDEX Upgrade, and JET tokamaks has been assembled using a consistent analysis method across all devices. This dataset is used to derive a regression scaling expression based solely on engineering parameters, and the results are compared to predictions from the two-point model. The agreement found is remarkable: both the regression and model provide similar parameter dependencies and tokamak-specific multiplicative constants. Building on this agreement, a fully predictive formula that combines the regression dependencies and the two-point model multiplicative constant is proposed. This formula is able to estimate $n_{e,\\mathrm{sep}}$ across the three machines within a factor of 1.5, and provides projections to next-step devices (ITER, SPARC, DTT, JT-60SA and COMPASS-U) that are in agreement with available SOLPS simulations.",
    "authors": [
      "D. Silvagni",
      "O. Grover",
      "A. Stagni",
      "J. W. Hughes",
      "M. A. Miller",
      "B. Lomanowski",
      "L. Balbinot",
      "G. Ciraolo",
      "W. Dekeyser",
      "M. Dunne",
      "L. Frassinetti",
      "C. Giroud",
      "T. Happel",
      "I. Jepu",
      "A. Kallenbach",
      "A. Kirjasuo",
      "A. Kuang",
      "T. Luda",
      "D. Moulton",
      "O. Pan",
      "C. Perez von Thun",
      "T. Puetterich",
      "G. Rubino",
      "S. A. Silburn",
      "H. J. Sun",
      "D. Umezaki",
      "H. Zohm",
      "the ASDEX Upgrade team",
      "JET contributors",
      "the EUROfusion tokamak exploitation team"
    ],
    "published": "2026-01-30T16:28:37Z",
    "updated": "2026-01-30T16:28:37Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.23117v1",
    "url": "https://arxiv.org/abs/2601.23117v1",
    "pdf_url": "https://arxiv.org/pdf/2601.23117v1.pdf",
    "title": "A centimeter-sized gas pressure sensor for high-vacuum measurements at cryogenic temperatures",
    "abstract": "Gas pressure sensors based on nanomechanical membranes have recently demonstrated an ultra-wide ten-decade measurement range, a gas-type-independent response, and a self-calibrating operation with uncertainties of approximately $1\\,\\%$. The readout relied on tabletop free-space laser interferometers. Here we present a centimeter-sized, portable implementation in which a square Si$_3$N$_4$ membrane is read out via a fiber-based laser interferometer. We perform pressure measurements between $5\\times10^{-5}$ and $10^{-1}$~mbar in a confined $0.7$~L volume cooled to $78$~K. Because no suitable commercial pressure sensor exists for direct cryogenic comparison, we benchmark our device against room-temperature commercial gauges connected to the cold volume through a pipe of limited conductance. The measured relationship between the two sensors is compared with models accounting for temperature- and pumping-induced pressure gradients within the measurement chamber. These models agree with the measurements to within $<10\\,\\%$ for helium and $<13\\,\\%$ for nitrogen. The achieved readout sensitivity of $S_x = 8\\times10^{-14}\\,\\mathrm{m}/\\sqrt{\\mathrm{Hz}}$ theoretically enables resolving the thermal displacement noise spectrum of a trampoline membrane at atmospheric pressure, with a peak response of $48\\,S_x$ $\\left(25\\,S_x\\right)$ at $295\\,\\mathrm{K}$ $\\left(78\\,\\mathrm{K}\\right)$. Our results suggest that the previously achieved pressure measurement range of ten decades with trampoline membranes is compatible with fiber-based optical readout. This paves the way for widely applicable pressure sensors in the centimeter size range in cryogenic environments.",
    "authors": [
      "Christoph Reinhardt",
      "Lea Lara Stankewitz",
      "Daniel Hartwig",
      "Sandy Croatto",
      "Hossein Masalehdan",
      "Nils Sültmann",
      "Axel Lindner",
      "Roman Schnabel"
    ],
    "published": "2026-01-30T16:03:25Z",
    "updated": "2026-01-30T16:03:25Z",
    "categories": [
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.app-ph"
  },
  {
    "arxiv_id": "2508.16533v2",
    "url": "https://arxiv.org/abs/2508.16533v2",
    "pdf_url": "https://arxiv.org/pdf/2508.16533v2.pdf",
    "title": "Bayesian Optimisation of Non-linear Breit-Wheeler Pair Production in Simulated Laser Experiments",
    "abstract": "High laser intensities enable the production of electron-positron pairs from bright gamma rays passing through strong fields. Potentially the most promising approach for all-optical experiments in the near term uses dense but higher divergence electron beams from laser wakefield acceleration to produce gamma rays through inverse Compton scattering. Achieving many-photon collisions between these gamma rays and the high intensity laser pulse in practice is extremely difficult, however, due to significant shot-to-shot jitter in laser pointing and timing.   We model these practical difficulties using simulated Monte-Carlo experiments. By using a more efficient algorithm for sampling infrequent pair production with particle splitting, we enable the exploration of a multi-dimensional parameter space. Using Gaussian Process Regression we then efficiently find optimal conditions for maximising pair production by changing the laser spot size, the energy in the colliding beam, and the stand-off distance between the laser wakefield accelerator and the focus of the colliding laser pulse. We find that the optimal stand-off distance increases with the degree of laser jitter and that the best conditions for producing electron-positron pairs are not the same as the best conditions for maximising the energy in the gamma rays. With \\unit[100]{J} of laser energy, we estimate rates of pair production of around 1 pair per 100 electrons are achievable even with jitter of 10s of microns and 10s of femtoseconds.",
    "authors": [
      "Christopher Arran",
      "Stuart Morris",
      "Christopher P. Ridgers"
    ],
    "published": "2025-08-22T16:55:11Z",
    "updated": "2026-01-30T16:02:20Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.01855v2",
    "url": "https://arxiv.org/abs/2512.01855v2",
    "pdf_url": "https://arxiv.org/pdf/2512.01855v2.pdf",
    "title": "Beam-test evaluation of pre-production Low Gain Avalanche Detectors for the ATLAS High Granularity Timing Detector",
    "abstract": "The High Granularity Timing Detector (HGTD) will be installed in the ATLAS experiment as part of the Phase-II upgrade for the High Luminosity-Large Hadron Collider (HL-LHC). It will mitigate pile-up effects in the forward region, and measure per bunch luminosity. The design of HGTD is based on Low Gain Avalanche Detector (LGAD) sensors. This paper presents the results of beam-test campaigns conducted at CERN and DESY in 2023 and 2024 on single LGADs from HGTD pre-production test structures, before and after neutron irradiation up to fluences of $2.5 \\times 10^{15}~\\mathrm{n_{eq}/cm^2}$. The tested LGADs can meet HGTD requirements in terms of charge collection, time resolution, and hit efficiency, even under HL-LHC end-of-life conditions, supporting their deployment in the final detector.",
    "authors": [
      "A. Aboulhorma",
      "M. Ait Tamlihat",
      "H. M. Alfanda",
      "O. Atanova",
      "N. Atanov",
      "I. Azzouzi",
      "J. Barreiro Guimarães da Costa",
      "T. Beau",
      "D. Benchekroun",
      "F. Bendebba",
      "G. Bergamin",
      "Y. Bimgdi",
      "A. Blot",
      "A. Boikov",
      "J. Bonis",
      "D. Boumediene",
      "C. Brito",
      "A. S. Brogna",
      "A. M. Burger",
      "L. Cadamuro",
      "Y. Cai",
      "N. Cartalade",
      "R. Casanova Mohr",
      "R. Cherkaoui El Moursli",
      "Y. Che",
      "X. Chen",
      "E. Y. S. Chow",
      "L. D. Corpe",
      "C. G. Crozatier",
      "L. D'Eramo",
      "S. Dahbi",
      "D. Dannheim",
      "G. Daubard",
      "Y. Davydov",
      "J. Debevc",
      "Y. Degerli",
      "E. Delagnes",
      "F. Deliot",
      "M. Dhellot",
      "P. Dinaucourt",
      "G. Di Gregorio",
      "P. J. Dos Santos De Assis",
      "C. Duan",
      "O. Duarte",
      "F. Dulucq",
      "J. Ehrecke",
      "Y. El Ghazali",
      "A. El Moussaouy",
      "A. Falou",
      "L. Fan",
      "Y. Fan",
      "Z. Fan",
      "K. Farman",
      "F. Fassi",
      "Y. Feng",
      "M. Ferreira",
      "F. Filthaut",
      "F. Fischer",
      "P. Fusté",
      "J. Fu",
      "J. García Rodriquez",
      "G. Gaspar De Andrade",
      "V. Gautam",
      "Z. Ge",
      "R. Gonçalo",
      "M. Gouighri",
      "S. Grinstein",
      "K. Gritsay",
      "F. Guilloux",
      "S. Guindon",
      "A. Haddad",
      "S. E. D. Hammoud",
      "L. Han",
      "A. M. Henriques Correia",
      "M. Hidaoui",
      "B. Hiti",
      "J. Hofner",
      "S. Hou",
      "P. J. Hsu",
      "X. Huang",
      "Y. Huang",
      "K. Hu",
      "C. Insa",
      "J. Jeglot",
      "X. Jia",
      "G. Kramberger",
      "M. Kuriyama",
      "B. Y. Ky",
      "D. Lacour",
      "A. Lafarge",
      "B. Lakssir",
      "A. Lantheaume",
      "D. Laporte",
      "C. de La Taille",
      "M. A. L. Leite",
      "A. Leopold",
      "H. Li",
      "L. Li",
      "M. Li",
      "S. Li",
      "S. Li",
      "Y. Li",
      "Z. Li",
      "S. Liang",
      "Z. Liang",
      "B. Liu",
      "K. Liu",
      "K. Liu",
      "Y. L. Liu",
      "Y. W. Liu",
      "F. L. Lucio Alves",
      "M. Lu",
      "Y. J. Lu",
      "F. Lyu",
      "D. Macina",
      "R. Madar",
      "N. Makovec",
      "S. Malyukov",
      "I. Mandić",
      "T. Manoussos",
      "S. Manzoni",
      "G. Martin-Chassard",
      "F. Martins",
      "L. Masetti",
      "R. Mazini",
      "E. Mazzeo",
      "K. Ma",
      "X. Ma",
      "R. Menegasso",
      "J-P. Meyer",
      "Y. Miao",
      "A. Migayron",
      "M. Mihovilovic",
      "M. Milovanovic",
      "M. Missio",
      "V. Moskalenko",
      "N. Mouadili",
      "A. Moussa",
      "I. Nikolic-Audit",
      "C. C. Ohm",
      "H. Okawa",
      "S. Okkerman",
      "M. Ouchrif",
      "C. Pénélaud",
      "A. Parreira",
      "B. Pascual Dias",
      "R. E. de Paula",
      "J. Pinol Bel",
      "P. -O. Puhl",
      "C. Puigdengoles Olive",
      "M. Puklavec",
      "J. Qin",
      "M. Qi",
      "H. Ren",
      "H. Riani",
      "S. Ridouani",
      "V. Rogozin",
      "L. Royer",
      "F. Rudnyckyj",
      "E. F. Saad",
      "G. T. Saito",
      "A. Salem",
      "H. Santos",
      "S. Scarfi",
      "Ph. Schwemling",
      "N. Seguin-Moreau",
      "L. Serin",
      "R. P. Serrano Fernandez",
      "A. Shaikovskii",
      "Q. Sha",
      "L. Shan",
      "R. Shen",
      "X. Shi",
      "P. Skomina",
      "H. Smitmanns",
      "H. L. Snoek",
      "A. P. Soulier",
      "A. Stein",
      "H. Stenzel",
      "J. Strandberg",
      "W. Sun",
      "X. Sun",
      "Y. Sun",
      "Y. Tan",
      "K. Tariq",
      "Y. Tayalati",
      "S. Terzo",
      "A. Torrento Coello",
      "S. Trincaz-Duvoid",
      "U. M. Vande Voorde",
      "I. Velkovska",
      "R. P. Vieira",
      "L. A. Vieira Lopes",
      "A. Visibile",
      "A. Wang",
      "C. Wang",
      "S. M. Wang",
      "T. Wang",
      "T. Wang",
      "W. Wang",
      "Y. Wang",
      "Y. Wang",
      "J. Wan",
      "Q. Weitzel",
      "J. Wu",
      "M. Wu",
      "W. Wu",
      "Y. Wu",
      "L. Xia",
      "D. Xu",
      "H. Xu",
      "L. Xu",
      "Z. Yan",
      "H. Yang",
      "H. Yang",
      "X. Yang",
      "X. Yang",
      "J. Ye",
      "I. Youbi",
      "J. Yuan",
      "I. Zahir",
      "H. Zeng",
      "D. Zhang",
      "J. Zhang",
      "L. Zhang",
      "Z. Zhang",
      "M. Zhao",
      "Z. Zhao",
      "X. Zheng",
      "Z. Zhou",
      "Y. Zhu",
      "X. Zhuang"
    ],
    "published": "2025-12-01T16:39:31Z",
    "updated": "2026-01-30T15:56:39Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  }
]