{
  "arxiv_id": "2511.09462v2",
  "url": "https://arxiv.org/abs/2511.09462v2",
  "pdf_url": "https://arxiv.org/pdf/2511.09462v2.pdf",
  "title": "Depth-enhanced molecular imaging with two-photon oblique plane microscopy",
  "abstract": "High-numerical-aperture (NA) oblique plane microscopy enables noninvasive fluorescence imaging of subcellular dynamics without requiring radical sample modification. However, performance degrades at depth in multicellular specimens as scattering and refractive-index heterogeneity raise out-of-focus background. We report a two-photon oblique plane microscope that improves resolution at depth by combining high-NA single-objective detection with multiphoton plane illumination. The microscope achieves $\\sim\\!300$ nm lateral and $\\sim\\!650$ nm axial resolution, with single-molecule sensitivity in vivo. Compared with two-photon point scanning, the lower illumination NA delivers an order of magnitude lower peak intensity, enabling $>\\!5\\times$ faster volumetric acquisition (up to $3.25 \\times 10^6$ voxels s$^{-1}$) with reduced photodamage. In multicellular contexts, near-infrared nonlinear excitation enhances contrast throughout the illumination depth by $\\sim\\!2\\times$ and restores volumetric resolving power by $>\\!2\\times$ relative to linear excitation. We demonstrate these capabilities through molecular imaging of epithelial tissue, stem-cell-derived gastruloids, and living fruit fly embryos, including multicolor transcription-factor dynamics, optogenetic subcellular control, and single-mRNA tracking, all using standard glass-based mounting.",
  "authors": [
    "Kevin Keomanee-Dizon",
    "Yaakov Clenman",
    "Alejandra Duran",
    "Sergey Ryabichko",
    "Pauline Hansen",
    "Tohn Borjigin",
    "Richard Thornton",
    "Jared E. Toettcher",
    "Harold M. McNamara"
  ],
  "published": "2025-11-12T16:27:30Z",
  "updated": "2025-12-04T00:49:58Z",
  "categories": [
    "physics.optics",
    "physics.bio-ph",
    "physics.ins-det"
  ],
  "primary_category": "physics.optics"
}