{
  "arxiv_id": "2512.03216v1",
  "url": "https://arxiv.org/abs/2512.03216v1",
  "pdf_url": "https://arxiv.org/pdf/2512.03216v1.pdf",
  "title": "Kaleidoscopic Scintillation Event Imaging",
  "abstract": "Scintillators are transparent materials that interact with high-energy particles and emit visible light as a result. They are used in state of the art methods of measuring high-energy particles and radiation sources. Most existing methods use fast single-pixel detectors to detect and time scintillation events. Cameras provide spatial resolution but can only capture an average over many events, making it difficult to image the events associated with an individual particle. Emerging single-photon avalanche diode cameras combine speed and spatial resolution to enable capturing images of individual events. This allows us to use machine vision techniques to analyze events, enabling new types of detectors. The main challenge is the very low brightness of the events. Techniques have to work with a very limited number of photons.   We propose a kaleidoscopic scintillator to increase light collection in a single-photon camera while preserving the event's spatial information. The kaleidoscopic geometry creates mirror reflections of the event in known locations for a given event location that are captured by the camera. We introduce theory for imaging an event in a kaleidoscopic scintillator and an algorithm to estimate the event's 3D position. We find that the kaleidoscopic scintillator design provides sufficient light collection to perform high-resolution event measurements for advanced radiation imaging techniques using a commercial CMOS single-photon camera. Code and data are available at https://github.com/bocchs/kaleidoscopic_scintillator.",
  "authors": [
    "Alex Bocchieri",
    "John Mamish",
    "David Appleyard",
    "Andreas Velten"
  ],
  "published": "2025-12-02T20:39:24Z",
  "updated": "2025-12-02T20:39:24Z",
  "categories": [
    "physics.ins-det",
    "cs.CV",
    "eess.IV"
  ],
  "primary_category": "physics.ins-det"
}