[
  {
    "arxiv_id": "2512.04982v1",
    "url": "https://arxiv.org/abs/2512.04982v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04982v1.pdf",
    "title": "Operator Formalism for Laser-Plasma Wakefield Acceleration",
    "abstract": "In this paper, we develop an operator-based framework for laser--plasma wakefield acceleration (LPWA) in capillary discharges, providing a compact and systematic description of the coupled dynamics of laser fields and plasma response. The formalism employs key operators: the transverse modal operator $\\hat{K}$, the nonlinear plasma operator $\\hat{N}[Ψ]$, the plasma oscillation operator $\\hatΩ_p^{\\,2}$, and the ponderomotive source operator $\\hatα$, which together describe mode coupling, plasma oscillations, and nonlinear feedback induced by the ponderomotive force. In the linear regime, the system is characterized by invariant subspaces associated with stable modal structures, while nonlinear interactions break these invariances, leading to mode mixing and complex dynamics. The approach establishes a direct connection between LPWA and Hilbert-space operator theory, including the invariant subspace, providing a formal mathematical interpretation of energy transfer and wakefield formation. Furthermore, the operator formalism integrates with neural operator methods, allowing efficient approximation of $\\hat{N}$ and $\\hatα$ for reduced-order modeling and predictive control. This hybrid physics--AI framework offers a robust foundation for modeling, analysis, and optimization of high-intensity laser--plasma interactions in next-generation accelerator experiments.",
    "authors": [
      "Mostafa Behtouei",
      "Carlos Salgado Lopez",
      "Giancarlo Gatti"
    ],
    "published": "2025-12-04T16:54:15Z",
    "updated": "2025-12-04T16:54:15Z",
    "categories": [
      "physics.plasm-ph",
      "math-ph",
      "physics.acc-ph",
      "quant-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.05727v4",
    "url": "https://arxiv.org/abs/2506.05727v4",
    "pdf_url": "https://arxiv.org/pdf/2506.05727v4.pdf",
    "title": "Bennett Vorticity: A family of nonlinear Shear-Flow Stabilized Z-pinch equilibria",
    "abstract": "The Bennett profile is a classic form for the plasma number density of an equilibrium Z-pinch that has been studied for almost a century by plasma physicists interested in nonlinear plasma pinch science, and fusion energy. By transferring the nonlinearity entirely from the number density to the plasma flow velocity the current density of the resulting flowing Z-pinch equilibrium remains unchanged whilst now being defined by a vortical flow which previously did not exist in the classic case. Due to the positive-definite structure of the nonlinearity's first derivative, in the ideal limit this equilibrium conforms globally to the validity criterion for a shear-flow stabilized Z-pinch when the form of the temperature profile satisfies certain constraints. For a cubic temperature the equilibrium has an analytic solution which is investigated.",
    "authors": [
      "Matt Russell"
    ],
    "published": "2025-06-06T04:20:38Z",
    "updated": "2025-12-04T16:49:02Z",
    "categories": [
      "physics.plasm-ph",
      "nlin.SI"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.04965v1",
    "url": "https://arxiv.org/abs/2512.04965v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04965v1.pdf",
    "title": "Characterization of thin optical filters for high purity Cherenkov light readout from scintillating crystals",
    "abstract": "A hybrid dual-readout calorimeter concept, comprising both electromagnetic and hadronic sections, has recently been proposed to meet the performance requirements of experiments at future e$^{+}$e$^{-}$ colliders. The front compartment consists of a homogeneous electromagnetic calorimeter made of high-density crystals, each coupled to a pair of Silicon Photomultipliers (SiPMs) providing the simultaneous readout of scintillation and Cherenkov light. To efficiently detect Cherenkov photons in the presence of dominant scintillation signals, an optical filter is placed in front of one of the two SiPMs to suppress photons in the wavelength region corresponding to that of scintillation emission. % In this study, PWO, BGO, and BSO crystals with different dimensions were tested to measure their scintillation light yield and decay time, as well as their transmission and emission spectra. A set of $\\sim 100~\\rm μm$-thick optical filters was also characterized by measuring their transmittance curves. The experimental results were used to model and estimate the expected filter performance in attenuating scintillation light for the various crystals. % The performance of each filter was experimentally validated by measuring the crystal light output with and without the filter using a $^{22}$Na radioactive source and a LYSO:Ce crystal, confirming the accuracy of the calculations. % The results show that interference filters are unsuitable for this application because their transmittance strongly depends on the photon incidence angle. Conversely, two absorptive long-pass filters with cutoff wavelengths around 590~nm were found to block more than 99\\% of the scintillation light from PWO crystals, satisfying the calorimeter specifications.",
    "authors": [
      "Andrea Benaglia",
      "Flavia Cetorelli",
      "Marco Toliman Lucchini",
      "Etiennette Auffray",
      "Louis Roux",
      "Julie Delenne"
    ],
    "published": "2025-12-04T16:33:45Z",
    "updated": "2025-12-04T16:33:45Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.04901v1",
    "url": "https://arxiv.org/abs/2512.04901v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04901v1.pdf",
    "title": "Adaptive Optics-Enhanced Michelson Interferometer for Spectroscopy of Narrow-Band Light Sources",
    "abstract": "Adaptive optics enables the deployment of interferometer-based spectroscopy without the need for moving parts necessary for scanning the interferometer arms. Here, we employ a Michelson Interferometer in conjunction with a Spatial Light Modulator (SLM) for determining the spectral profile of a narrow-band light source. Interestingly, we observe that the fringes across the interferometer output beam are inherently shifted in wavelength even when a constant phase profile is provided to the SLM. We calibrate the spectral shifts as a function of fringe spatial location by measuring the incident light spectrum at various points across the fringe pattern, and observe that the spectral peak traces out a `teardrop' shape, whose width is dependent on the spectral bandwidth of the source, the relative tilt and path difference between the two arms of the interferometer, and the divergence of the beam. Next, we demonstrate that this inherent spectral variation of the fringes can be used to perform fast single-snapshot spectroscopy of narrow-band light sources, while a time-varied phase profile provided to the SLM leads to multi-step spectroscopy with lower noise, higher resolution, and better contrast. Our findings establish that the Michelson Interferometer can be used to perform spectroscopy of any source within a certain spectral range from simple images of the fringe pattern, so as to facilitate exciting applications towards hyperspectral imaging.",
    "authors": [
      "Jesneil Lauren Lewis",
      "Ayan Banerjee"
    ],
    "published": "2025-12-04T15:29:32Z",
    "updated": "2025-12-04T15:29:32Z",
    "categories": [
      "physics.optics",
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2512.04866v1",
    "url": "https://arxiv.org/abs/2512.04866v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04866v1.pdf",
    "title": "Degrees of universality in wave turbulence",
    "abstract": "Turbulence of weakly interacting waves displays a great deal of universality: independence of the details of the interaction and of the pumping and dissipation scales. Here we study how inverse turbulent cascades (from small to large scales) transition from weak to strong. We find that while one-loop corrections can be dependent on excitation and dissipation scales, new types of universality appear in strong turbulence. We contrast turbulence of spin waves in ferromagnets with turbulent cascades in the Nonlinear Schrödinger Equation (NSE) and in an MMT-like model in higher dimensions having a multiplicative interaction vertex: vertex renormalization gives rise to dependence on the pumping (UV scale) in the former but not in the latter. As a result of this spectral nonlocality, spin-wave turbulence stops being weak if one is sufficiently far from the pumping scale, even when the interaction of waves with comparable wavenumbers is weak. We paraphrase this as: nonlocality enhances nonlinearity.   We then describe strong turbulence in a multi-component version of these models with a large number of components. We argue that strong spin-wave turbulence is similar to turbulence of the focusing NSE, as it realizes a critical-balance state. However, UV nonlocality causes the level of spin-wave turbulence at large scales to decrease with increasing pumping level, culminating in a state that is independent of the level of pumping.",
    "authors": [
      "Jiasheng Liu",
      "Vladimir Rosenhaus",
      "Gregory Falkovich"
    ],
    "published": "2025-12-04T14:49:12Z",
    "updated": "2025-12-04T14:49:12Z",
    "categories": [
      "cond-mat.stat-mech",
      "hep-th",
      "nlin.CD",
      "physics.flu-dyn",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.stat-mech"
  },
  {
    "arxiv_id": "2512.04842v1",
    "url": "https://arxiv.org/abs/2512.04842v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04842v1.pdf",
    "title": "Performance Optimization and Characterization of 7-pad Resistive PICOSEC Micromegas Detectors",
    "abstract": "We present a comprehensive characterization of resistive PICOSEC Micromegas detector prototypes, tested under identical conditions, constant drift gap, field configurations, and photocathode at the CERN SPS H4 beam line. This work provides a proof of concept for the use of resistive layer technology in gaseous timing detectors, demonstrating that robustness can be improved without compromising the excellent timing performance of PICOSEC Micromegas. Different resistive architectures and values were explored to optimize stability and ensure reliable long-term operation in challenging experimental environments. The prototype with a 10MΩ resistive layer achieved the best overall performance, with a timing resolution of 22.900 {\\pm} 0.002 ps and a spatial resolution of 1.190 {\\pm} 0.003 mm, while charge sharing across multiple pads enabled combined timing resolutions below 28 ps. A lower-resistivity (200kΩ) configuration exhibited enhanced charge spread, leading to minor systematic offsets in reconstructed pad centers, yet maintained robust timing and spatial performance. Capacitive charge-sharing architectures improved spatial resolution in some regions but suffered from signal attenuation and nonuniform charge distributions, resulting in slightly degraded timing (33.300 {\\pm} 0.002 ps) and complex localization patterns. Mechanical precision, particularly readout planarity and photocathode alignment, was identified as critical for uniform detector response. These studies benchmark the potential of resistive layers for gaseous timing detectors and provide a foundation for scalable designs with optimized timing and spatial resolution across diverse experimental applications.",
    "authors": [
      "A. Kallitsopoulou",
      "R. Aleksan",
      "S. Aune",
      "J. Bortfeldt",
      "F. Brunbauer",
      "M. Brunoldi",
      "J. Datta",
      "D. Desforge",
      "G. Fanourakis",
      "D. Fiorina",
      "K. J. Floethner",
      "M. Gallinaro",
      "F. Garcia",
      "I. Giomataris",
      "K. Gnanvo",
      "F. J. Iguaz",
      "D. Janssens",
      "F. Jeanneau",
      "M. Kovacic",
      "B. Kross",
      "P. Legou",
      "M. Lisowska",
      "J. Liu",
      "M. Lupberger",
      "I. Maniatis",
      "J. McKisson",
      "Y. Meng",
      "H. Muller",
      "E. Oliveri",
      "G. Orlandini",
      "A. Pandey",
      "T. Papaevangelou",
      "M. Pomorski",
      "E. F. Ribas",
      "L. Ropelewski",
      "D. Sampsonidis",
      "L. Scharenberg",
      "T. Schneider",
      "E. Scorsone",
      "L. Sohl",
      "M. van Stenis",
      "Y. Tsipolitis",
      "S. E. Tzamarias",
      "A. Utrobicic",
      "I. Vai",
      "R. Veenhof",
      "P. Vitulo",
      "X. Wang",
      "S. White",
      "W. Xi",
      "Z. Zhang",
      "Y. Zhou"
    ],
    "published": "2025-12-04T14:27:08Z",
    "updated": "2025-12-04T14:27:08Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.04816v1",
    "url": "https://arxiv.org/abs/2512.04816v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04816v1.pdf",
    "title": "Spaceflight KID Readout Electronics for PRIMA",
    "abstract": "We present the design and testing of a prototype multiplexing kinetic inductance detector (KID) readout electronics for the PRobe far-Infrared Mission for Astrophysics (PRIMA) space mission. PRIMA is a Probe-class astrophysics mission concept that will answer fundamental questions about the formation of planetary systems, the co-evolution of stars and supermassive black holes in galaxies, and the rise of heavy elements and dust over cosmic time. The readout electronics for PRIMA must be compatible with operation at Earth-Sun L2 and capable of multiplexing more than 1000 detectors over 2.5 GHz bandwidth while consuming around 30 W per readout chain. The electronics must also be capable of switching between the two instruments, which have different readout bands: the hyperspectral imager (PRIMAger, 2.6-4.9 GHz) and the spectrometer (FIRESS, 0.4-2.4 GHz). The PRIMA readout electronics use high-heritage SpaceCube digital electronics with a build-to-print SpaceCube Mini v3.0 board using a radiation-tolerant Kintex KU060 field programmable gate array (FPGA) and a custom high-speed digitizer board, along with RF electronics that provide filtering and power conditioning. We present the driving requirements for the system, as well as the hardware, firmware, software, and system-level design that meets those requirements.",
    "authors": [
      "Thomas Essinger-Hileman",
      "C. Matt Bradford",
      "Patrick Brown",
      "Sean Bryan",
      "Jesse Coldsmith",
      "Jennifer Corekin",
      "Sumit Dahal",
      "Thomas Devlin",
      "Marc Foote",
      "Draisy Friedman",
      "Alessandro Geist",
      "Jason Glenn",
      "Christopher Green",
      "Tracee Jamison-Hooks",
      "Kevin Horgan",
      "Jared Lucey",
      "Philip Mauskopf",
      "Lynn Miles",
      "Sanetra Bailey Newman",
      "Gerard Quilligan",
      "Cody Roberson",
      "Adrian Sinclair",
      "Salman Sheikh",
      "Eric Weeks",
      "Christopher Wilson",
      "Travis Wise"
    ],
    "published": "2025-12-04T14:05:16Z",
    "updated": "2025-12-04T14:05:16Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2510.15997v2",
    "url": "https://arxiv.org/abs/2510.15997v2",
    "pdf_url": "https://arxiv.org/pdf/2510.15997v2.pdf",
    "title": "Frequency domain laser ultrasound for inertial confinement fusion target wall thickness measurements",
    "abstract": "In inertial confinement fusion experiments hollow, spherical mm-sized capsules are used as a container for nuclear fuel. To achieve maximum implosion efficiency, a perfect capsule geometry is required. This paper presents a wall thickness measurement method based on zero-group velocity guided elastic wave resonances. They are measured with a non-destructive, contactless frequency domain laser ultrasound microscopy system. Wall thickness measurements along the equator of a high-density carbon capsule with a diameter of around 2 mm and a wall thickness of around 80 $\\unicode{x00B5}$m excellently agree with infrared interferometry reference measurements. In addition, the multi-resonant nature of a spherical shell is studied by complementing experimental observations with plate dispersion calculations and finite element wave propagation simulations. The presented method is scalable and can be applied to a broad range of target materials, including metals, or metal-doped targets.",
    "authors": [
      "Martin Ryzy",
      "Guqi Yan",
      "Clemens Grünsteidl",
      "Georg Watzl",
      "Kevin Sequoia",
      "Pavel Lapa",
      "Haibo Huang"
    ],
    "published": "2025-10-14T08:56:55Z",
    "updated": "2025-12-04T13:42:40Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mtrl-sci",
      "physics.app-ph",
      "physics.optics",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.04788v1",
    "url": "https://arxiv.org/abs/2512.04788v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04788v1.pdf",
    "title": "High-repetition-rate, all-reflective optical guiding and electron acceleration in helium using an off-axis axicon",
    "abstract": "We present recent results on high-power guiding and laser wakefield acceleration (LWFA) in the ELBA beamline at ELI Beamlines, using the L3-HAPLS laser system (13 J, 30 fs, 0.2 Hz). By employing self-waveguiding in a 20 cm plasma channel in helium, we achieved stable acceleration of electron beams to energies approaching 5 GeV. A novel all-reflective optical setup, including an off-axis reflective axicon, enabled efficient acceleration at 0.2 Hz and guiding at repetition rates up to 3.3 Hz. This compact single laser, single compressor implementation of plasma channels for electron acceleration stabilizes electron pointing and enhances energy gain without requiring modifications to the laser system, paving the way for broader adoption of the technology across user facilities.",
    "authors": [
      "Jiří Šišma",
      "Michal Nevrkla",
      "Filip Vitha",
      "Sebastian Lorenz",
      "Illia Zymak",
      "Alžběta Špádová",
      "Andrea Kollárová",
      "Matěj Jech",
      "Alexandr Jančárek",
      "Davorin Peceli",
      "Carlo M. Lazzarini",
      "Leonardo V. N. Goncalves",
      "Gabriele M. Grittani",
      "Sergei V. Bulanov",
      "Jaron E. Shrock",
      "Ela Rockafellow",
      "Ari J. Sloss",
      "Bo Miao",
      "Scott W. Hancock",
      "Howard M. Milchberg"
    ],
    "published": "2025-12-04T13:37:40Z",
    "updated": "2025-12-04T13:37:40Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.04787v1",
    "url": "https://arxiv.org/abs/2512.04787v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04787v1.pdf",
    "title": "2bNIRS: a portable, multi-distance, broadband oximeter and cytochrome-c-oxidase monitoring system for in vivo applications",
    "abstract": "Conventional near-infrared spectroscopy (NIRS) instruments typically employ 2-3 wavelengths for monitoring tissue haemodynamics. However, the use of broadband illumination (hundreds of wavelengths) unlocks also the targeting of tissue metabolism by exploiting the wide differential-redox peak of absorption of cytochrome-c-oxidase (CCO). For this purpose, we present here a novel, broadband (780-900nm), multi-distance NIRS system, called 2bNIRS. Compact and portable (20 x 30 x 40 cm3), 2bNIRS was validated using a dynamic, optical phantom con-taining blood and yeast, and benchmarked against a multi-wavelength time-domain NIRS (TD-NIRS) system. Validation confirmed its accuracy in tracking haemody-namic and metabolic changes, with superior oximetry performance achieved via our BRUNO algorithm, which integrates broadband spectral fitting with spatially-re-solved analysis. Preliminary in vivo, human applications demonstrated 2bNIRS ap-plicability to monitoring both muscle tissue, during arm cuff occlusions, and the brain, during frontal cortex activation.",
    "authors": [
      "Luca Giannoni",
      "Archie Barraclough",
      "Chiara Carnati",
      "Frederic Lange",
      "Ilias Tachtsidis"
    ],
    "published": "2025-12-04T13:34:35Z",
    "updated": "2025-12-04T13:34:35Z",
    "categories": [
      "physics.med-ph",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "physics.med-ph"
  },
  {
    "arxiv_id": "2509.00732v2",
    "url": "https://arxiv.org/abs/2509.00732v2",
    "pdf_url": "https://arxiv.org/pdf/2509.00732v2.pdf",
    "title": "Classical and Quantum Beam Dynamics Simulation of the RF Photoinjector Test Bench at JINR",
    "abstract": "We present beam-dynamics simulations for an S-band RF photoinjector test bench under development at JINR, aimed at producing high-quality electron beams and enabling future generation of relativistic vortex electrons. Simulations of the 1.5-cell photogun under the presently available RF gradient of ~45 MV/m demonstrate stable bunch formation at low charge (Q = 0.63 pC), where space-charge forces are weak, and the transverse emittance is dominated by RF-induced correlations. Optimization of the injection phase and cathode-region solenoid yields a robust emittance-stabilization regime with a final normalized emittance of ~3.2 pi mm mrad. To assess prospects for accelerating structured electron beams, we additionally model the quantum evolution of single-electron Laguerre-Gaussian wave packets. The results show that multi-MeV acceleration suppresses free-space spreading and preserves the wave-packet's initial OAM structure, indicating that the test bench provides suitable conditions for forthcoming experimental studies of relativistic vortex electrons.",
    "authors": [
      "A. S. Dyatlov",
      "A. V. Afanasyev",
      "V. V. Kobets",
      "A. E. Levichev",
      "M. V. Maksimov",
      "D. A. Nikiforov",
      "M. A. Nozdrin",
      "K. A. Sibiryakova",
      "K. E. Yunenko",
      "D. V. Karlovets"
    ],
    "published": "2025-08-31T07:52:04Z",
    "updated": "2025-12-04T13:30:21Z",
    "categories": [
      "physics.acc-ph",
      "physics.atom-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.04722v1",
    "url": "https://arxiv.org/abs/2512.04722v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04722v1.pdf",
    "title": "Optimization of laser illumination configuration for directly driven inertial confinement fusion",
    "abstract": "Optimum laser configurations are presented to achieve high illumination uniformity with directly driven inertial confinement fusion targets. Assuming axisymmetric absorption pattern of individual laser beams, theoretical models are reviewed in terms of the number of laser beams, system imperfection, and laser beam patterns. Utilizing a self-organizing system of charged particles on a sphere, a simple numerical model is provided to give an optimal configuration for an arbitrary number of laser beams. As a result, such new configurations as M48 and M60 are found to show substantially higher illumination uniformity than any other existing direct drive systems. A new polar direct-drive scheme is proposed with the laser axes keeping off the target center, which can be applied to laser configurations designed for indirectly driven inertial fusion.",
    "authors": [
      "Masakatsu Murakami",
      "Daiki Nishi"
    ],
    "published": "2025-12-04T12:06:25Z",
    "updated": "2025-12-04T12:06:25Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1016/j.mre.2016.12.002"
  },
  {
    "arxiv_id": "2512.04715v1",
    "url": "https://arxiv.org/abs/2512.04715v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04715v1.pdf",
    "title": "Generation of ultrahigh field by micro-bubble implosion",
    "abstract": "Breaking the 100-MeV barrier for proton acceleration will help elucidate fundamental physics and advance practical applications from inertial confinement fusion to tumour therapy. Herein we propose a novel concept of bubble implosions. A bubble implosion combines micro-bubbles and ultraintense laser pulses of 10^20-10^22W/cm^2 to generate ultrahigh fields and relativistic protons. The bubble wall protons undergo volumetric acceleration toward the centre due to the spherically symmetric Coulomb force and the innermost protons accumulate at the centre with a density comparable to the interior of a white dwarf. Then an unprecedentedly high electric field is formed, which produces an energetic proton flash. Three-dimensional particle simulations confirm the robustness of Coulomb-imploded bubbles, which behave as nano-pulsars with repeated implosions and explosions to emit protons. Current technologies should be sufficient to experimentally verify concept of bubble implosions.",
    "authors": [
      "M. Murakami",
      "A. Arefiev",
      "M. A. Zosa"
    ],
    "published": "2025-12-04T12:01:51Z",
    "updated": "2025-12-04T12:01:51Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1038/541598-018-25594-3"
  },
  {
    "arxiv_id": "2509.13831v3",
    "url": "https://arxiv.org/abs/2509.13831v3",
    "pdf_url": "https://arxiv.org/pdf/2509.13831v3.pdf",
    "title": "Signal Processing and Machine Learning Algorithms for Precise Timing with PICOSEC Micromegas Detectors",
    "abstract": "High particle rates in current and future experiments make pile-up phenomena a critical issue for extracting useful information. In this context, timing can be important as the 4$^{\\mathrm{th}}$ dimension parameter for triggering or event reconstruction. The PICOSEC-Micromegas detector has been shown to offer precise timing of the order of tens of\\,ps. In this work, novel signal processing algorithms are being developed and evaluated to demonstrate the technology's ability for online precise timing. We propose, an algorithm based on Artificial Neural Networks (ANN). This algorithm uses a model to train the ANN. The performance of the different algorithms is evaluated using experimental data, resulting in a timing resolution of 18.3 $\\pm$ 0.6\\,ps, comparable to the standard analysis based on the Constant Fraction Discrimination technique. Additionally, an alternative algorithm using the charge of the pulse exceeding a threshold as a parameter to correct for systematic effects is reported.",
    "authors": [
      "A. Kallitsopoulou",
      "I. Maniatis",
      "I. Manthos",
      "T. Papaevangelou",
      "L. Sohl",
      "A. Tsiamis",
      "S. E. Tzamarias"
    ],
    "published": "2025-09-17T08:56:21Z",
    "updated": "2025-12-04T11:31:10Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.01656v2",
    "url": "https://arxiv.org/abs/2512.01656v2",
    "pdf_url": "https://arxiv.org/pdf/2512.01656v2.pdf",
    "title": "Impact of local bunching factors in single-pass THz free electron lasers",
    "abstract": "In simulations for modern free-electron lasers (FEL), shot noise plays a crucial role. While it is inversely proportional to the number of electrons, shot noise is typically modeled using macroparticles, with their bunching factors corresponding to the bunching factors of the much larger number of electrons. For short-wavelength FELs, the macroparticles are assumed to be uniformly distributed on the scale of the resonant wavelength, since shot noise dominates the initial radiation - for instance, in the self-amplified spontaneous emission (SASE) regime. In this paper, we show that this assumption does not hold at longer wavelengths, particularly in the THz range, where the bunch current profile is not uniform even within the length of the resonant wavelength. Instead, the current profile dominates the initial bunching factors, which can be several orders of magnitude higher than shot noise. The slice-based bunching factors and bunching phases are derived for Gaussian distributions and compared with shot noise under the assumption that the current within each slice remains constant. Using the THz FEL at the photoinjector test facility at DESY in Zeuthen (PITZ) as a case study, the influence of the current profile has been benchmarked through simulations under very low bunch charge, where the full number of electrons can be modeled using the Genesis1.3 code. Additional simulations with the nominal working parameters of PITZ THz FEL have been compared with experimental data, indicating better agreement when the actual current profile is taken into account.",
    "authors": [
      "Xiangkun Li",
      "Mikhail Krasilnikov"
    ],
    "published": "2025-12-01T13:29:53Z",
    "updated": "2025-12-04T11:22:47Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.04669v1",
    "url": "https://arxiv.org/abs/2512.04669v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04669v1.pdf",
    "title": "Progress towards a microchannel plate detector with AlGaN photocathode and cross-strip anode for ultraviolet astronomy",
    "abstract": "Microchannel plates (MCPs) were the driving detector technology for ultraviolet (UV) astronomy over many years, and still today MCP-based detectors are the baseline for several planned UV instruments. The development of advanced MCP detectors is ongoing and pursues the major goals of maximizing sensitivity, resolution, and lifetime, while at the same time decreasing weight, volume, and power consumption.   Development efforts for an MCP-based detector system for the UV are running at IAAT at the University of Tübingen. In this publication, we present our latest results towards coating aluminum gallium nitride (AlGaN) photocathodes directly on MCPs, to improve quantum detection efficiency in the far- and extreme-UV. Furthermore, we report on the implementation of a non-iterative centroiding algorithm for our coplanar cross-strip anode directly in an FPGA.",
    "authors": [
      "S. Diebold",
      "J. Barnstedt",
      "L. Conti",
      "H. R. Elsener",
      "L. Hanke",
      "M. Höltzli",
      "C. Kalkuhl",
      "D. Rau",
      "D. Schaadt",
      "T. Schanz",
      "B. Stelzer",
      "K. Werner"
    ],
    "published": "2025-12-04T11:03:00Z",
    "updated": "2025-12-04T11:03:00Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM",
    "doi": "10.1117/1.JATIS.11.4.042230"
  },
  {
    "arxiv_id": "2512.03914v2",
    "url": "https://arxiv.org/abs/2512.03914v2",
    "pdf_url": "https://arxiv.org/pdf/2512.03914v2.pdf",
    "title": "Integrating High Performance In-Memory Data Streaming and In-Situ Visualization in Hybrid MPI+OpenMP PIC MC Simulations Towards Exascale",
    "abstract": "Efficient simulation of complex plasma dynamics is crucial for advancing fusion energy research. Particle-in-Cell (PIC) Monte Carlo (MC) simulations provide insights into plasma behavior, including turbulence and confinement, which are essential for optimizing fusion reactor performance. Transitioning to exascale simulations introduces significant challenges, with traditional file input/output (I/O) inefficiencies remaining a key bottleneck. This work advances BIT1, an electrostatic PIC MC code, by improving the particle mover with OpenMP task-based parallelism, integrating the openPMD streaming API, and enabling in-memory data streaming with ADIOS2's Sustainable Staging Transport (SST) engine to enhance I/O performance, computational efficiency, and system storage utilization. We employ profiling tools such as gprof, perf, IPM and Darshan, which provide insights into computation, communication, and I/O operations. We implement time-dependent data checkpointing with the openPMD API enabling seamless data movement and in-situ visualization for real-time analysis without interrupting the simulation. We demonstrate improvements in simulation runtime, data accessibility and real-time insights by comparing traditional file I/O with the ADIOS2 BP4 and SST backends. The proposed hybrid BIT1 openPMD SST enhancement introduces a new paradigm for real-time scientific discovery in plasma simulations, enabling faster insights and more efficient use of exascale computing resources.",
    "authors": [
      "Jeremy J. Williams",
      "Stefan Costea",
      "Daniel Medeiros",
      "Jordy Trilaksono",
      "Pratibha Hegde",
      "David Tskhakaya",
      "Leon Kos",
      "Ales Podolnik",
      "Jakub Hromadka",
      "Kevin A. Huck",
      "Allen D. Malony",
      "Frank Jenko",
      "Erwin Laure",
      "Stefano Markidis"
    ],
    "published": "2025-12-03T15:59:14Z",
    "updated": "2025-12-04T10:33:41Z",
    "categories": [
      "physics.plasm-ph",
      "cs.DC",
      "cs.PF"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2307.12423v2",
    "url": "https://arxiv.org/abs/2307.12423v2",
    "pdf_url": "https://arxiv.org/pdf/2307.12423v2.pdf",
    "title": "The Importance of Heat Flux in Quasi-Parallel Collisionless Shocks",
    "abstract": "Collisionless plasma shocks are a common feature of many space and astrophysical systems and are sources of high-energy particles and non-thermal emission, channeling as much as 20\\% of the shock's energy into non-thermal particles. The generation and acceleration of these non-thermal particles have been extensively studied, however, how these particles feed back on the shock hydrodynamics has not been fully treated. This work presents the results of self-consistent hybrid particle-in-cell simulations that show the effect of self-generated non-thermal particle populations on the nature of collisionless, quasi-parallel shocks. They contribute to a significant heat flux density upstream of the shock. Non-thermal particles downstream of the shock leak into the upstream region, taking energy away from the shock. This increases the compression ratio, slows the shock down, and flattens the non-thermal population's spectral index for lower Mach number shocks. We incorporate this into a revised theory for the Rankine-Hugoniot jump conditions that include this effect and it shows excellent agreement with simulations. The results have the potential to explain discrepancies between predictions and observations in a wide range of systems, such as inaccuracies of predictions of arrival times of coronal mass ejections and the conflicting radio and x-ray observations of intracluster shocks.   These effects will likely need to be included in fluid modeling to accurately predict shock evolution.",
    "authors": [
      "Colby C. Haggerty",
      "Damiano Caprioli",
      "Paul A. Cassak",
      "M. Hasan Barbhuiya",
      "Lynn Wilson",
      "Drew Turner"
    ],
    "published": "2023-07-23T20:32:19Z",
    "updated": "2025-12-04T08:01:41Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.04484v1",
    "url": "https://arxiv.org/abs/2512.04484v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04484v1.pdf",
    "title": "Numerical model for pellet rocket acceleration in PELOTON",
    "abstract": "A direct numerical simulation model for the rocket acceleration of pellets in thermonuclear fusion devices has been developed for PELOTON, a 3D Lagrangian particle pellet code [R. Samulyak et al, Nuclear Fusion 61 (4), 046007 (2021)], and validated using shattered pellet injection (SPI) experiments in JET. The pellet rocket acceleration is driven by grad-B drift of the ablation cloud that creates asymmetry and non-uniform heating of the cloud. The model accounts for non-uniform charging of the ablation cloud by hot plasma electrons as well as local plasma gradients. The increased pressure on the high-field-side compared to the low-field-side leads to pellet (fragment) rocket acceleration. Pure deuterium and deuterium-neon mixture models have been implemented. The background plasma states have been obtained by using a new plasma cooling model for PELOTON. The cooling model distributes the ablated material within the corresponding flux volumes and accounts for ionization and other energy losses, Ohmic heating by toroidal currents, and the energy exchange between ions and electrons. Plasma profiles predicted by PELOTON cooling model have been compared with JOREK and INDEX simulations. PELOTON simulations of rocket acceleration and the corresponding trajectories of deuterium fragments are consistent with experimentally measured trajectories in JET. We show that composite deuterium-neon pellets containing 0.5% of neon experienced smaller deviation of their trajectories compared to the pure deuterium case. We simulate various spatial configurations of pellet fragments and demonstrate the cloud overlap impact on rocket acceleration. Additionally, we demonstrate the effect of plasma state gradients on the rocket acceleration. Future work will focus on the rocket acceleration of SPI in projected ITER plasmas and the development of the corresponding scaling law for the rocket acceleration.",
    "authors": [
      "J. Corbett",
      "R. Samulyak",
      "F. J. Artola",
      "S. Jachmich",
      "M. Kong",
      "E. Nardon"
    ],
    "published": "2025-12-04T05:38:13Z",
    "updated": "2025-12-04T05:38:13Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.04447v1",
    "url": "https://arxiv.org/abs/2512.04447v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04447v1.pdf",
    "title": "GPU-Portable Real-Space Density Functional Theory Implementation on Unified-Memory Architectures",
    "abstract": "We present a GPU-portable implementation of a real-space density functional theory (DFT) code ``QUMASUN'' and benchmark it on the new Plasma Simulator featuring Intel Xeon 6980P CPUs, and AMD MI300A GPUs. Additional tests were performed on an NVIDIA GH200 GPU. In particular MI300A supports unified memory and GH200 supports coherent memory interconnect, simplifying GPU porting. A lightweight C++ lambda-based layer enables CPU, CUDA, and HIP execution without OpenMP/OpenACC preprocessor directives. For diamond (216 atoms) and tungsten (128 atoms) systems, MI300A and GH200 achieve 2.0-2.8 $\\times$ and 2.3-2.4 $\\times$ speedups over a 256-core Xeon node. The compute-bound kernels, which are fast Fourier transforms (FFT), dense matrix-matrix multiplications (GEMM) and eigenvalue solver, show substantial acceleration on both GPUs, indicating that the present GPU-portable approach can benefit a wide range of plasma-fusion simulation codes beyond DFT.",
    "authors": [
      "Atsushi M. Ito"
    ],
    "published": "2025-12-04T04:37:33Z",
    "updated": "2025-12-04T04:37:33Z",
    "categories": [
      "physics.comp-ph",
      "cond-mat.mtrl-sci",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.comp-ph"
  },
  {
    "arxiv_id": "2512.04432v1",
    "url": "https://arxiv.org/abs/2512.04432v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04432v1.pdf",
    "title": "Design and Performance Simulation of the Electromagnetic Calorimeter at EicC",
    "abstract": "The electromagnetic calorimeter (ECAL) is a key detector component for precise electron and photon measurements in electron-ion collision experiments. At the Electron-Ion Collider in China (EicC), high-performance calorimetry is essential for exploring the internal structure of nucleons and studying the dynamics of quarks and gluons within quantum chromodynamics (QCD). This paper presents the optimized design and performance simulation of the EicC ECAL system. The ECAL consists of three specialized sections tailored to distinct detection environments: (1) an electron-Endcap employing high-resolution pure Cesium Iodide (pCsI) crystals, (2) a central barrel, and (3) an ion-Endcap, both adopting a cost-effective Shashlik-style sampling calorimeter with improved light yield. Each segment's geometry and material composition have been systematically optimized through Geant4 simulations to achieve excellent energy and position resolutions as well as strong electron-pion discrimination. The simulated performance indicates that the ECAL can achieve energy resolutions of 2 percent divided by sqrt(E) for pCsI crystals and 5 percent divided by sqrt(E) for Shashlik modules, meeting the design goals of the EicC detector.",
    "authors": [
      "Ye Tian",
      "Souvik Maity",
      "Jingyu Li",
      "Yuancai Wu",
      "Shan Sha",
      "Yutie Liang",
      "Aiqiang Guo",
      "Yuxiang Zhao",
      "Dexu Lin"
    ],
    "published": "2025-12-04T03:55:34Z",
    "updated": "2025-12-04T03:55:34Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.09462v2",
    "url": "https://arxiv.org/abs/2511.09462v2",
    "pdf_url": "https://arxiv.org/pdf/2511.09462v2.pdf",
    "title": "Depth-enhanced molecular imaging with two-photon oblique plane microscopy",
    "abstract": "High-numerical-aperture (NA) oblique plane microscopy enables noninvasive fluorescence imaging of subcellular dynamics without requiring radical sample modification. However, performance degrades at depth in multicellular specimens as scattering and refractive-index heterogeneity raise out-of-focus background. We report a two-photon oblique plane microscope that improves resolution at depth by combining high-NA single-objective detection with multiphoton plane illumination. The microscope achieves $\\sim\\!300$ nm lateral and $\\sim\\!650$ nm axial resolution, with single-molecule sensitivity in vivo. Compared with two-photon point scanning, the lower illumination NA delivers an order of magnitude lower peak intensity, enabling $>\\!5\\times$ faster volumetric acquisition (up to $3.25 \\times 10^6$ voxels s$^{-1}$) with reduced photodamage. In multicellular contexts, near-infrared nonlinear excitation enhances contrast throughout the illumination depth by $\\sim\\!2\\times$ and restores volumetric resolving power by $>\\!2\\times$ relative to linear excitation. We demonstrate these capabilities through molecular imaging of epithelial tissue, stem-cell-derived gastruloids, and living fruit fly embryos, including multicolor transcription-factor dynamics, optogenetic subcellular control, and single-mRNA tracking, all using standard glass-based mounting.",
    "authors": [
      "Kevin Keomanee-Dizon",
      "Yaakov Clenman",
      "Alejandra Duran",
      "Sergey Ryabichko",
      "Pauline Hansen",
      "Tohn Borjigin",
      "Richard Thornton",
      "Jared E. Toettcher",
      "Harold M. McNamara"
    ],
    "published": "2025-11-12T16:27:30Z",
    "updated": "2025-12-04T00:49:58Z",
    "categories": [
      "physics.optics",
      "physics.bio-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2408.02656v2",
    "url": "https://arxiv.org/abs/2408.02656v2",
    "pdf_url": "https://arxiv.org/pdf/2408.02656v2.pdf",
    "title": "Long-living Equilibria in Kinetic Astrophysical Plasma Turbulence",
    "abstract": "Turbulence in classical fluids is characterized by persistent structures that emerge from the chaotic landscape. We investigate the analogous process in fully kinetic plasma turbulence by using high-resolution, direct numerical simulations in two spatial dimensions. We observe the formation of long-living vortices with a profile typical of macroscopic, magnetically dominated force-free states. Inspired by the Harris pinch model for inhomogeneous equilibria, we describe these metastable solutions with a self-consistent kinetic model in a cylindrical coordinate system centered on a representative vortex, starting from an explicit form of the particle velocity distribution function. Such new equilibria can be simplified to a Gold-Hoyle solution of the modified force-free state. Turbulence is mediated by the long-living structures, accompanied by transients in which such vortices merge and form self-similarly new metastable equilibria. This process can be relevant to the comprehension of various astrophysical phenomena, going from the formation of plasmoids in the vicinity of massive compact objects to the emergence of coherent structures in the heliosphere.",
    "authors": [
      "Mario Imbrogno",
      "Claudio Meringolo",
      "Sergio Servidio",
      "Alejandro Cruz-Osorio",
      "Benoît Cerutti",
      "Francesco Pegoraro"
    ],
    "published": "2024-08-05T17:46:42Z",
    "updated": "2025-12-03T23:27:39Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.04286v1",
    "url": "https://arxiv.org/abs/2512.04286v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04286v1.pdf",
    "title": "Mu2e Straw Tube Tracker Gas Flow Quality Control",
    "abstract": "We present a tracker gas flow quality control method developed for the Mu2e straw tube tracker. Using time-dependent current measurements, we quantify the onset time of ionization gain induced by an 55Fe source during gas exchange, which is correlated to the gas conductance in the straw. This allows for the identification of channels with inadequate flow. This approach is broadly applicable to other gaseous detectors that require high-channel-count screening.",
    "authors": [
      "Vishal Bharatwaj",
      "Scott N. Israel",
      "Mamta Jangra",
      "Minh Truong Nguyen",
      "Joey Peck",
      "Matthew Stortini",
      "Nam H. Tran",
      "Dan Ambrose",
      "Andrew Edmonds",
      "Hannah Hass",
      "Emma R. Martin",
      "Aseet Mukherjee",
      "Klara Northrup",
      "James L. Popp",
      "Vadim L. Rusu",
      "Robert S. Tschirhart",
      "Robert L. Wagner"
    ],
    "published": "2025-12-03T21:59:43Z",
    "updated": "2025-12-03T21:59:43Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.21924v2",
    "url": "https://arxiv.org/abs/2511.21924v2",
    "pdf_url": "https://arxiv.org/pdf/2511.21924v2.pdf",
    "title": "FPGA-Accelerated Real-Time Beam Emission Spectroscopy Diagnostics at DIII-D Using the SLAC Neural Network Library for ML Inference",
    "abstract": "Achieving reliable real-time control of tokamak plasmas is essential for sustaining high-performance operation in next-generation fusion reactors. A major challenge is the accurate and timely prediction of edge-localized modes (ELMs), especially in high-confinement regimes such as wide-pedestal quiescent H-mode. We present a hardware-accelerated machine learning (ML) inference system integrated into the RTSTAB processing node of the DIII-D real-time diagnostic and control infrastructure. The system uses an AMD/Xilinx KCU1500 FPGA to enable ultra low latency plasma state classification and ELM forecasting. Input features come from real-time Beam Emission Spectroscopy (BES), and the ML model is implemented as a dense neural network using the SLAC Neural Network Library (SNL).   A key capability is SNL dynamic parameter loading, which allows on-the-fly updates of neural network weights and biases without hardware resynthesis. This enables multiple classification tasks on a single FPGA design and supports adaptive control strategies that respond to evolving plasma conditions. By decoupling inference from fixed-weight configurations, the system supports continuous model refinement and seamless task switching during live operation.   The SNL-based inference engine is fully integrated with the FPGA in the DIII-D RTSTAB Plasma Control System (PCS), improving ELM avoidance, confinement, and operational stability. These results show the feasibility of embedding dynamically reconfigurable FPGA-based ML inference into real-time fusion diagnostic pipelines, providing a scalable and resilient path toward intelligent and autonomous plasma control in future magnetic confinement fusion devices.",
    "authors": [
      "Abhilasha Dave",
      "James Russell",
      "Mudit Mishra",
      "Larry Ruckman",
      "Keith Erickson",
      "SangKyeun Kim",
      "Semin Joung",
      "Jalal Butt",
      "Ryan Herbst",
      "Ryan Coffee",
      "David Smith",
      "Egemen Kolemen"
    ],
    "published": "2025-11-26T21:31:51Z",
    "updated": "2025-12-03T21:33:10Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.04272v1",
    "url": "https://arxiv.org/abs/2512.04272v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04272v1.pdf",
    "title": "A simple procedure for generating a Kappa distribution in PIC simulation",
    "abstract": "For kinetic modeling of plasma processes in space, a rejection-sampling procedure for generating a Kappa distribution in particle-in-cell (PIC) simulation is proposed. A Pareto distribution is employed as an envelope distribution. The procedure only requires uniform variates, and its acceptance efficiency is $\\approx 0.73$--$0.8$.",
    "authors": [
      "Seiji Zenitani"
    ],
    "published": "2025-12-03T21:22:25Z",
    "updated": "2025-12-03T21:22:25Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.IM"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.3847/2515-5172/ae1c41"
  },
  {
    "arxiv_id": "2508.20299v4",
    "url": "https://arxiv.org/abs/2508.20299v4",
    "pdf_url": "https://arxiv.org/pdf/2508.20299v4.pdf",
    "title": "Magnetic Centrifuge Effects in Ultrafast Laser Ablation Plasmas",
    "abstract": "A self-consistent model is developed to explain the anomalously large enrichment of nickel isotopes observed in ablation plumes from ultrafast laser irradiation of solid surfaces. The model is based on the spontaneous creation of a magnetic centrifuge in the ablation plume and the associated cyclotron rotation of plasma ions with effective rotation rates on the order of $10^9$ radians per second. Mass separation occurs around the radial coordinate of cylindrical symmetry with longitudinal axis normal to the ablating surface. A Gaussian shaped radial magnetic field $B_{eff}$ is extracted for Ni isotopes which is shown to be a combination of an axial $B_z$ component and a second contribution $B_{ibw}$ that represents the equivalent of an effective magnetic field contributing to the isotopic separation due to broad spectrum Ion Bernstein Waves providing electrostatic acceleration to the cyclotron orbits. These IBWs are also responsible for a profound resonance of enrichment observed for certain specific charge states. In addition to cyclotron rotation of ions, a rigid rotor model is also presented that is associated with the hydrodynamic rotation of the entire plasma and is shown to be of little consequence for the isotope enrichment. Cyclotron rotation and IBWs dominate the process.",
    "authors": [
      "Peter P. Pronko",
      "Paul A. Van Rompay"
    ],
    "published": "2025-08-27T22:10:22Z",
    "updated": "2025-12-03T17:44:44Z",
    "categories": [
      "physics.plasm-ph",
      "physics.app-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.03997v1",
    "url": "https://arxiv.org/abs/2512.03997v1",
    "pdf_url": "https://arxiv.org/pdf/2512.03997v1.pdf",
    "title": "Comment on \"Monochromatization interaction region optics design for direct s-channel Higgs production at FCC-ee\"",
    "abstract": "The original article [1] can be logically divided into two parts: 1) the selection of main parameters for monochromatization and 2) interaction region optics design; the comment pertains only to the first part. The authors of [1] state that \"The purpose of this paper is to report on the development of realistic IR optics designs for monochromatization at the FCC-ee\". However, the proposed parameters do not seem very realistic and raise many questions.",
    "authors": [
      "Dmitry Shatilov"
    ],
    "published": "2025-12-03T17:29:11Z",
    "updated": "2025-12-03T17:29:11Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.09010v3",
    "url": "https://arxiv.org/abs/2509.09010v3",
    "pdf_url": "https://arxiv.org/pdf/2509.09010v3.pdf",
    "title": "Cryogenic geometric anti-spring vibration isolation system",
    "abstract": "The combination of low temperature and low vibration levels is key for ultrasensitive sensing applications such as scanning probe microscopy, large-mass quantum mechanics, and gravitational wave detection. Unfortunately, closed-cycle cryostats using pulse tube or GM coolers introduce strong low-frequency vibrations starting at 1 Hz. Mass-spring systems allow passive isolation, but for low-frequency applications the required spring constants and masses become impractical. Blade-based geometric anti-spring systems are compact isolators that operate from sub-Hz frequencies, but have not been demonstrated at cryogenic temperatures. Here, we characterize a geometric anti-spring system tuned to operate at cryogenic temperatures. Our cryogenic filter uses radially arranged titanium blade springs whose effective spring constant can be tuned in-situ using a magnetic actuator. Our system achieves a vertical resonance frequency of 185 mHz at 7K, which allows reduction of vibrations at the problematic 1 Hz cooler frequency by an order of magnitude.",
    "authors": [
      "L. Feenstra",
      "S. Domínguez-Calderón",
      "K. van Oosten",
      "H. S. M. Bohemen",
      "T. Benschop",
      "M. Brinkman",
      "M. Li",
      "E. Hennes",
      "R. Cornelissen",
      "B. J. Hensen",
      "A. Bertolini",
      "M. P. Allan"
    ],
    "published": "2025-09-10T21:13:37Z",
    "updated": "2025-12-03T16:55:11Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.03876v1",
    "url": "https://arxiv.org/abs/2512.03876v1",
    "pdf_url": "https://arxiv.org/pdf/2512.03876v1.pdf",
    "title": "Generalized Beth--Uhlenbeck entropy formula from the $Φ-$derivable approach",
    "abstract": "We derive a generalized Beth-Uhlenbeck formula for the entropy of a dense fermion system with strong two-particle correlations, including scattering states and bound states. We work within the $Φ-$derivable approach to the thermodynamic potential. The formula takes the form of an energy-momentum integral over a statistical distribution function times a unique spectral density. In the near mass-shell limit, the spectral density reduces, contrary to naïve expectations, not to a Lorentzian but rather to a \"squared Lorentzian\" shape. The relation of the Beth-Uhlenbeck formula to the $Φ$-derivable approach is exact at the two-loop level for $Φ$. The formalism we develop, which extends the Beth-Uhlenbeck approach beyond the low-density limit, includes Mott dissociation of bound states, in accordance with Levinson's theorem, and the self-consistent back reaction of correlations in the fermion propagation. We discuss applications to further systems, such as quark matter and nuclear matter.",
    "authors": [
      "David Blaschke",
      "Gerd Röpke",
      "Gordon Baym"
    ],
    "published": "2025-12-03T15:28:36Z",
    "updated": "2025-12-03T15:28:36Z",
    "categories": [
      "nucl-th",
      "hep-th",
      "physics.plasm-ph"
    ],
    "primary_category": "nucl-th"
  },
  {
    "arxiv_id": "2512.03856v1",
    "url": "https://arxiv.org/abs/2512.03856v1",
    "pdf_url": "https://arxiv.org/pdf/2512.03856v1.pdf",
    "title": "Solar Wind Penetration into Dusty Magnetospheres creates Electrostatic Waves and Structures",
    "abstract": "The low frequency electrostatic perturbations have been investigated in a bi ion plasma in the background of static dust. It is shown that the field aligned shear flow of both the ions produce low frequency electrostatic instabilities and create nonlinear structures, the double layers and the solitons. The general theoretical model is applied to the magnetospheres of Jupiter (with positively charged dust) and Saturn (with negatively charged dust) which have oxygen ions in addition to protons. This model predicts the existence of extremely low frequency electrostatic waves with real frequencies of the order of a milli Hertz (mHz) to several mHz and this range of frequencies have been reported in literature for these plasma environments. The estimated width of the nonlinear structures vary from a few hundred meters to a few kilometers. These structures are similar to that observed in the oxygen and oxygen hydrogen plasmas in Earth's upper ionosphere which is free from dust.",
    "authors": [
      "Usman Saeed",
      "Shaukat Ali Shan",
      "Hamid Saleem"
    ],
    "published": "2025-12-03T15:01:42Z",
    "updated": "2025-12-03T15:01:42Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1063/5.0247622"
  },
  {
    "arxiv_id": "2512.03829v1",
    "url": "https://arxiv.org/abs/2512.03829v1",
    "pdf_url": "https://arxiv.org/pdf/2512.03829v1.pdf",
    "title": "First Experimental Demonstration of Machine Learning-Based Tuning on the PSI Injector 2 Cyclotron",
    "abstract": "Reliable operation of high-power proton cyclotrons is a critical requirement for Accelerator Driven Systems (ADS) and other large-scale applications. Beam tuning in such machines is traditionally performed manually, a process that can be slow, non-optimal, and difficult to execute in the presence of faults or changing conditions. To address this, we developed and deployed a machine learning (ML) based tuning framework on the Injector 2 cyclotron at PSI, chosen as an ideal testbed for high-power operation. The system combined a tailored reinforcement learning algorithm with real-time diagnostics and control, and incorporated accelerator-physics inspired adaptations such as an overshoot strategy that reduced magnetic field settling times by nearly a factor of six. Over an extensive 12-day operational test campaign, relatively long in the context of real-time ML experiments, the ML agent successfully tuned the machine across multiple operating points, achieving convergence within hours and maintaining stable beam extraction with reduced losses. Beyond initial tuning, the system was also operated in evaluation mode overnight, where it autonomously monitored and corrected the machine to compensate for drifts, demonstrating robustness and long-term stability. Crucially, the learned policy generalized reliably from low-current training to higher-current operation, underscoring its scalability. These results constitute the first demonstration of ML-assisted tuning on a high-power cyclotron, with direct relevance to ADS-class drivers.",
    "authors": [
      "M. Haj Tahar",
      "W. Joho",
      "E. Solodko",
      "M. Bocchio",
      "S. Marquie",
      "M. Busch",
      "A. Barchetti",
      "J. Grillenberger",
      "J. Snuverink",
      "M. Schneider"
    ],
    "published": "2025-12-03T14:21:39Z",
    "updated": "2025-12-03T14:21:39Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.03826v1",
    "url": "https://arxiv.org/abs/2512.03826v1",
    "pdf_url": "https://arxiv.org/pdf/2512.03826v1.pdf",
    "title": "Recent Developments of the VOXES Von Hamos X-ray Spectrometer for Laboratory XES and XAS Studies",
    "abstract": "VOXES is a Von Hamos X-ray spectrometer developed at the INFN National Laboratories of Frascati for high-resolution laboratory X-ray spectroscopy in the 5--20~keV range. It uses curved mosaic crystals and motorized positioning stages to perform wavelength-dispersive X-ray fluorescence (WD-XRF) with sub-10~eV tunable resolution for extended and dilute samples. Recent developments include the integration of an energy-dispersive X-ray fluorescence (ED-XRF) line based on a silicon pin-diode detector, which enables flux monitoring and simultaneous ED and WD measurements. In addition, a dedicated liquid-sample holder has been introduced, and a Y-shaped support geometry, crucial for switching to a transmission layout, provides mechanical compatibility with laboratory XAS, now under implementation. These upgrades expand the versatility and automation of VOXES, strengthening its role as a table-top platform for laboratory X-ray spectroscopy.",
    "authors": [
      "Simone Manti",
      "Alberto Clozza",
      "Gabriel Moskal",
      "Kristian Piscicchia",
      "Diana Sirghi",
      "Florin Sirghi",
      "Catalina Curceanu",
      "Alessandro Scordo"
    ],
    "published": "2025-12-03T14:18:44Z",
    "updated": "2025-12-03T14:18:44Z",
    "categories": [
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.app-ph"
  },
  {
    "arxiv_id": "2509.10319v3",
    "url": "https://arxiv.org/abs/2509.10319v3",
    "pdf_url": "https://arxiv.org/pdf/2509.10319v3.pdf",
    "title": "The merger of spinning, accreting supermassive black hole binaries",
    "abstract": "Because they are likely to accrete substantial amounts of interstellar gas, merging supermassive binary black holes are expected to be strong multimessenger sources, radiating gravitational waves, photons from thermal gas, and photons from relativistic electrons energized by relativistic jets. Here we report on a numerical simulation that covers the late inspiral, merger, and initial postmerger phase of such a system where both black holes have the same mass and spin, and both spin axes are parallel to the orbital angular momentum. The simulation incorporates both 3D general relativistic magnetohydrodynamics and numerical relativity. The thermal photon power during the late inspiral, merger, and immediate postmerger phases is drawn from strong shocks rather than dissipation of turbulence inside a smoothly structured accretion disk as typically found around accreting single black holes. We find that the thermal photon and jet Poynting flux outputs are closely related in time, and we posit a mechanism that enforces this relation. The power radiated in both photons and jets diminishes gradually as merger is approached, but jumps sharply at merger to a noisy plateau. Such a distinct lightcurve should aid efforts to identify supermassive black hole mergers, with or without accompanying gravitational wave detections.",
    "authors": [
      "Lorenzo Ennoggi",
      "Manuela Campanelli",
      "Julian Krolik",
      "Scott C. Noble",
      "Yosef Zlochower",
      "Maria Chiara de Simone"
    ],
    "published": "2025-09-12T15:00:43Z",
    "updated": "2025-12-03T14:11:56Z",
    "categories": [
      "astro-ph.HE",
      "gr-qc",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2512.03811v1",
    "url": "https://arxiv.org/abs/2512.03811v1",
    "pdf_url": "https://arxiv.org/pdf/2512.03811v1.pdf",
    "title": "Studying the GRAiNITA concept: first test beam results",
    "abstract": "Data collected over a two-day period in June 2024 at the CERN SPS H9 test beam using a small-scale GRAiNITA prototype have been analyzed to characterize the detector's energy resolution performance. The measurements allow for a first estimate of the constant term associated with detector non-uniformity. Although the evaluation is limited by the small prototype size and the use of pion beams, the results indicate that the non-uniformity-related constant term is significantly below 1%. Furthermore, the test-beam data confirm that the contribution to the energy resolution arising from photo-electron statistics is approximately 1%/sqrt(E). These findings validate the expected calorimetric performance of the GRAiNITA concept and provide important input for the design and optimization of future full-scale detectors.",
    "authors": [
      "Sergey Barsuk",
      "Oleg Bezshyyko",
      "Ianina Boiaryntseva",
      "Andrey Boyarintsev",
      "Dominique Breton",
      "Herve Chanal",
      "Alexander M. Dubovik",
      "Larysa Golinka-Bezshyyko",
      "Carlos Dominguez Goncalves",
      "Yingrui Hou",
      "Giulia Hull",
      "Miktat Imre",
      "Denys Klekots",
      "Jacques Lefrancois",
      "Jihane Maalmi",
      "Magali Magne",
      "Bernard Mathon",
      "Stéphane Monteil",
      "Sebastien Olmo",
      "David Picard",
      "Marie-Helene Schune",
      "Irina Tupitsyna",
      "Mykhailo Yeresko"
    ],
    "published": "2025-12-03T14:00:59Z",
    "updated": "2025-12-03T14:00:59Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.03780v1",
    "url": "https://arxiv.org/abs/2512.03780v1",
    "pdf_url": "https://arxiv.org/pdf/2512.03780v1.pdf",
    "title": "Poly- and single-crystalline diamond nitrogen-induced TLS losses estimation with superconducting lumped elements micro-resonators",
    "abstract": "Research on diamond has intensified due to its exceptional thermal, optical, and mechanical properties, making it a key material in quantum technologies and high-power applications. Diamonds with engineered nitrogen-vacancy (NV) centers represent a very sensitive platform for quantum sensing, while high-optical quality diamond windows represent a fundamental safety component inside Electron Cyclotron Resonance Heating (ECRH) systems in nuclear fusion reactors. A major challenge is the development of ultra-low-loss, high-optical-quality single-crystal diamond substrates to meet growing demands for quantum coherence and power handling. Traditionally, dielectric losses ($\\tan δ$) in diamonds are evaluated using Fabry-Perot microwave resonators, in which the resonance quality factors Q of the cavity with and without the sample are compared. These devices are limited to resolutions around 10$^{-5}$ by the need to keep the resonator dimensions within a reasonable range. In contrast, superconducting thin-film micro-strip resonators, with Q factors exceeding 10$^6$, are stated to provide higher sensitivity for assessing ultra-low-loss materials. This study examines four diamond samples grown through different processes, analyzing their dielectric losses at extreme low temperatures (sub-Kelvin) within the Two-Level System (TLS) framework. Complementary Raman spectroscopy measurements allowed us not only to associate higher nitrogen content with increased losses, but also to investigate how the different growth process influence the way these defects are incorporated in the crystal lattice.",
    "authors": [
      "Francesco Mazzocchi",
      "Martin Neidig",
      "Hideaki Yamada",
      "Sebastian Kempf",
      "Dirk Strauss",
      "Theo Scherer"
    ],
    "published": "2025-12-03T13:32:35Z",
    "updated": "2025-12-03T13:32:35Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2512.03711v1",
    "url": "https://arxiv.org/abs/2512.03711v1",
    "pdf_url": "https://arxiv.org/pdf/2512.03711v1.pdf",
    "title": "Compton suppressed scintillation spectrometer based on a cluster of 9$\\times$CeBr$_{3}$-NaI(Tl) phoswich detectors",
    "abstract": "Measurements of the characteristics of an Compton suppressed spectrometer consisting of 9$\\times$CeBr$_{3}$-NaI(Tl) phoswich detectors surrounded by four CsI(Tl) scintillation detectors intended for suppressing the Compton component of the spectrum have been carried out. Measurements were performed using gamma and neutron radiation sources. Key parameters of the spectrometer have been determined: the suppression factor of the Compton part of the $γ$-spectrum, as well as the dependencies of the neutron detection efficiency on their energy at various detection threshold values.",
    "authors": [
      "Mark Povolotskiy",
      "Yuri Sobolev",
      "Sergei Stukalov"
    ],
    "published": "2025-12-03T12:02:00Z",
    "updated": "2025-12-03T12:02:00Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.21612v3",
    "url": "https://arxiv.org/abs/2507.21612v3",
    "pdf_url": "https://arxiv.org/pdf/2507.21612v3.pdf",
    "title": "First use of large area SiPM matrices coupled with NaI(Tl) scintillating crystal for low energy dark matter search",
    "abstract": "The long-standing claim of dark matter detection by the DAMA experiment remains a crucial open question in astroparticle physics. A key step towards its independent verification is the development of NaI(Tl)-based detectors with improved sensitivity at low energies. The majority of NaI(Tl)-based experiments rely on conventional photomultiplier tubes (PMTs) as single photon detectors, which present technological limitations in terms of light collection, intrinsic radioactivity and a high noise contribution at keV energies. ASTAROTH is an R&D project developing a NaI(Tl)-based detector where the scintillation light is read out by silicon photomultipliers (SiPM) matrices. SiPMs exhibit high photon detection efficiency, negligible radioactivity, and, most importantly, a dark noise nearly two orders of magnitude lower than PMTs, when operated at cryogenic temperature. To this end, ASTAROTH features a custom-designed cryostat based on a bath of cryogenic fluid, able to safely operate the detector and the read-out electronics down to about 80K. We report the first experimental characterization of 360 g NaI(Tl) detector read out by a large area (5 cm x 5 cm) SiPM matrix. The photoelectron yield obtained with a preliminary configuration is 7.2 photoelectrons/keV, which is rather promising, also in light of several planned developments. The signal-to-noise ratio and the energy threshold attainable with SiPMs is expected to improve the sensitivity for dark matter searches beyond the reach of current-generation PMT-based detectors. This result is the first proof of the viability of this technology and sets a milestone toward the design of future large-scale experiments.",
    "authors": [
      "Edoardo Martinenghi",
      "Valerio Toso",
      "Fabrizio Bruno Armani",
      "Andrea Castoldi",
      "Giuseppe di Carlo",
      "Luca Frontini",
      "Niccolò Gallice",
      "Chiara Guazzoni",
      "Valentino Liberali",
      "Alberto Stabile",
      "Valeria Trabattoni",
      "Andrea Zani",
      "Davide D'Angelo"
    ],
    "published": "2025-07-29T09:10:39Z",
    "updated": "2025-12-03T09:38:35Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2404.08459v3",
    "url": "https://arxiv.org/abs/2404.08459v3",
    "pdf_url": "https://arxiv.org/pdf/2404.08459v3.pdf",
    "title": "Observation of Fine Structure in Channeling of Particles in Bent Crystals",
    "abstract": "We observed highly efficient manipulation of the 530 MeV positron beam at Mainz Microtron via bent crystals. The low beam divergence revealed a fine structure in the angular distribution of channeled particles. A compact analytical model, supported by Monte Carlo including multiple scattering, accounts for the measurements. We established a criterion for designing a crystal with reduced angular spread of channeled particles for beam manipulation at any energy. This finding is particularly useful in view of applications of channeling to the highest energies.",
    "authors": [
      "A. Mazzolari",
      "H. Backe",
      "L. Bandiera",
      "N. Canale",
      "D. De Salvador",
      "P. Drexler",
      "V. Guidi",
      "P. Klag",
      "W. Lauth",
      "L. Malagutti",
      "R. Negrello",
      "G. Paternò",
      "M. Romagnoni",
      "F. Sgarbossa",
      "A. Sytov",
      "V. Tikhomirov",
      "D. Valzani"
    ],
    "published": "2024-04-12T13:10:46Z",
    "updated": "2025-12-03T09:15:44Z",
    "categories": [
      "physics.acc-ph",
      "physics.app-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.1103/t4ms-hmdd"
  },
  {
    "arxiv_id": "2509.07223v2",
    "url": "https://arxiv.org/abs/2509.07223v2",
    "pdf_url": "https://arxiv.org/pdf/2509.07223v2.pdf",
    "title": "Readout noise of digital frequency multiplexed TES detectors for CUPID",
    "abstract": "Superconducting transition-edge sensor (TES) detectors have been the standard in Cosmic Microwave Background experiments for almost two decades and are now being adapted for use in nuclear physics, such as neutrinoless double beta decay searches. In this paper we focus on a new high-bandwidth frequency multiplexed TES readout system developed for CUPID, a neutrinoless double beta decay experiment that will replace CUORE. In order to achieve the high energy resolution requirements for CUPID, the readout noise of the system must be kept to a minimum. Low TES operating resistance and long wiring between the readout SQUID and the warm electronics are needed for CUPID, prompting a careful consideration of the design parameters of this application of frequency multiplexing. In this work, we characterize the readout noise of the newly designed frequency multiplexed TES readout system for CUPID and construct a noise model to understand it. We find that current sharing between the SQUID coil impedance and other branches of the circuit, as well as the long output wiring, worsen the readout noise of the system. To meet noise requirements, a SQUID with a low input inductance, high transimpedance and/or low dynamic impedance is needed, and the wiring capacitance should be kept as small as possible. Alternatively, the option of adding a cryogenic low-noise amplifier at the output of the SQUID should be explored.",
    "authors": [
      "Michel Adamič",
      "Joseph Camilleri",
      "Chiara Capelli",
      "Matt Dobbs",
      "Tucker Elleflot",
      "Yury G. Kolomensky",
      "Daniel Mayer",
      "Joshua Montgomery",
      "Valentine Novosad",
      "Vivek Singh",
      "Graeme Smecher",
      "Aritoki Suzuki",
      "Bradford Welliver"
    ],
    "published": "2025-09-08T21:04:31Z",
    "updated": "2025-12-03T06:33:37Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1109/TNS.2025.3638275"
  },
  {
    "arxiv_id": "2512.03472v1",
    "url": "https://arxiv.org/abs/2512.03472v1",
    "pdf_url": "https://arxiv.org/pdf/2512.03472v1.pdf",
    "title": "Quasi-linear theory of perpendicular ion heating by critically balanced turbulence",
    "abstract": "In collisionless astrophysical plasmas, turbulence mediates the partitioning of free energy among cascade channels and its dissipation into ion and electron heat. The resulting ion heating is often anisotropic, with ions observed to be preferentially heated perpendicular to the local magnetic field; understanding the mechanisms responsible for this heating is a key step in understanding the evolution of such plasmas. In this paper, we use the framework of quasi-linear theory to compute analytically the heating rates of ions interacting with turbulent, large-scale Alfvénic fluctuations. We show how the imbalance of the turbulence (the difference in energies between Alfvénic fluctuations travelling parallel and antiparallel to the magnetic field) modifies the spatiotemporal spectrum of these fluctuations, allowing the heating mechanism to transition between two commonly-studied mechanisms: stochastic heating in balanced turbulence to resonant-cyclotron heating in imbalanced turbulence. The resultant heating rate is found to have a general form regardless of the level of imbalance, exhibiting a suppression related to the conservation of the ions' magnetic moment at small turbulent amplitudes and recovering previous empirical results in a formal calculation. The results of this work help to consolidate our qualitative understanding of ion heating within astrophysical plasmas, as well as yielding specific quantitative predictions to analyse simulations and observations.",
    "authors": [
      "Zade Johnston",
      "Jonathan Squire"
    ],
    "published": "2025-12-03T05:53:28Z",
    "updated": "2025-12-03T05:53:28Z",
    "categories": [
      "astro-ph.SR",
      "astro-ph.HE",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2512.03443v1",
    "url": "https://arxiv.org/abs/2512.03443v1",
    "pdf_url": "https://arxiv.org/pdf/2512.03443v1.pdf",
    "title": "Subgrid Mean-field Dynamo Model with Dynamical Quenching in General Relativistic Magnetohydrodynamic Simulations",
    "abstract": "Large-scale magnetic fields are relevant for a number of dynamical processes in accretion disks, including driving turbulence, reconnection events, and launching outflows. Numerical simulations have indicated that the initial strengths and configurations of the large-scale magnetic fields have a direct imprint on the outcome of an accretion disk evolution. To facilitate future self-consistent simulations that include intrinsic dynamo processes, we derive and implement a subgrid model of a helical large-scale dynamo with dynamical quenching in general-relativistic resistive magnetohydrodynamical simulations of geometrically thin accretion disks. By incorporating previous numerical and analytical results of helical dynamos, our model features only one input parameter, the viscosity parameter $α_\\text{SS}$. We demonstrate that our model can reproduce butterfly diagrams seen in previous local and global simulations. With rather aggressive parameter choice of $α_\\text{SS}=0.02$ and black hole spin $a_\\text{BH}=0.9375$, our thin-disk model launches weak collimated polar outflows with Lorentz factor $\\simeq 1.2$, but no polar outflow is present with less vigorous turbulence or less positive $a_\\text{BH}$. With negative $a_\\text{BH}$, we find the field configurations to appear more similar to Newtonian cases, whereas for positive $a_\\text{BH}$, the poloidal field loops become distorted and the cycle period becomes sporadic or even disappears. Moreover, we demonstrate how $α_\\text{SS}$ can avoid to be prescribed and instead be determined by the local plasma beta. Such a fully dynamical subgrid dynamo allows for self-consistent amplification of the large-scale magnetic fields.",
    "authors": [
      "Hongzhe Zhou",
      "Yosuke Mizuno",
      "Zhenyu Zhu"
    ],
    "published": "2025-12-03T04:51:53Z",
    "updated": "2025-12-03T04:51:53Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2512.03388v1",
    "url": "https://arxiv.org/abs/2512.03388v1",
    "pdf_url": "https://arxiv.org/pdf/2512.03388v1.pdf",
    "title": "Magnetic field amplification driven by the gyro motion of charged particles",
    "abstract": "Spontaneous magnetic field generation plays important role in laser-plasma interactions. Strong quasi-static magnetic fields affect the thermal conductivity and the plasma dynamics, particularly in the case of ultra intense laser where the magnetic part of Lorentz force becomes as significant as the electric part. Kinetic simulations of giga-gauss magnetic field amplification via a laser irradiated microtube structure reveal the dynamics of charged particle implosions and the mechanism of magnetic field growth. A giga-gauss magnetic field is generated and amplified with the opposite polarity to the seed magnetic field. The spot size of the field is comparable to the laser wavelength, and the lifetime is hundreds of femtoseconds. An analytical model is presented to explain the underlying physics. This study should aid in designing future experiments.",
    "authors": [
      "Y-J. Gu",
      "M. Murakami"
    ],
    "published": "2025-12-03T02:41:02Z",
    "updated": "2025-12-03T02:41:02Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1038/s41598-021-02944-2"
  },
  {
    "arxiv_id": "2512.03379v1",
    "url": "https://arxiv.org/abs/2512.03379v1",
    "pdf_url": "https://arxiv.org/pdf/2512.03379v1.pdf",
    "title": "Microbubble implosions in finite hollow spheres",
    "abstract": "Microbubble implosion (MBI) is a recently proposed novel mechanism with many interesting and exciting potential applications. MBI predicts that the inner layers of a spherical target with a hollow cavity can be compressed into a core with a density 105 times that of the solid density. Furthermore, this ultra-compressed core mostly consists of ions. This leads to the generation of ultra-high electric fields, which may be applicable to gamma-ray lensing or pair creation. However, MBI has yet to be studied for finite hollow spheres whose electrons are free to redistribute themselves after being given an initial temperature. This paper studies MBI under finite sphere conditions. Using an elec- tron distribution model, the electron distribution after receiving an initial temperature is studied. Then, the optimal parameters required to fill a hollow cavity with electrons are calculated. The dynamics of MBI is simulated using a hybrid one-dimensional code. The simulation demonstrates that MBI occurs even for finite spheres, and high-density compression is still achievable with this setup. It also shows the opti- mal target structure, which maximizes ion flashing.",
    "authors": [
      "M. A. H. Zosa",
      "M. Murakami"
    ],
    "published": "2025-12-03T02:27:57Z",
    "updated": "2025-12-03T02:27:57Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1063/5.0068815"
  },
  {
    "arxiv_id": "2512.03269v1",
    "url": "https://arxiv.org/abs/2512.03269v1",
    "pdf_url": "https://arxiv.org/pdf/2512.03269v1.pdf",
    "title": "Understanding cold electron impact on parallel-propagating whistler chorus waves via moment-based quasilinear theory",
    "abstract": "Earth's magnetosphere hosts a wide range of collisionless particle populations that interact through various wave-particle processes. Among these, cold electrons, with energies below 100eV, often dominate the plasma density but remain poorly characterized due to measurement challenges such as spacecraft charging and photoelectron contamination. Understanding the contribution of these cold populations to wave-particle interaction is of significant interest. Recent kinetic simulations identified a secondary drift-driven instability in which parallel-propagating whistler-mode chorus waves excite oblique electrostatic whistler waves near the resonance cone and Bernstein-mode turbulence. These secondary modes enable a new channel of energy transfer from the parallel-propagating whistler wave to the cold electrons. In this work, we develop a moment-based quasilinear theory of the secondary instabilities to quantify such energy exchange. Our results show that these secondary instabilities persist for a wide range of parameters and, in many cases, lead to nearly complete damping of the primary wave. Such secondary instability might limit the amplitude of parallel-propagating whistler waves in Earth's magnetosphere and might explain why high-amplitude oblique whistler or electron Bernstein waves are rarely observed simultaneously with high-amplitude field-aligned whistler waves in the inner magnetosphere.",
    "authors": [
      "Opal Issan",
      "Vadim Roytershteyn",
      "Gian Luca Delzanno",
      "Salomon Janhunen"
    ],
    "published": "2025-12-02T22:21:41Z",
    "updated": "2025-12-02T22:21:41Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2408.11709v3",
    "url": "https://arxiv.org/abs/2408.11709v3",
    "pdf_url": "https://arxiv.org/pdf/2408.11709v3.pdf",
    "title": "SynradG4: A Geant4-Based Extension for Synchrotron Radiation Background Studies in the ePIC Detector at the Electron-Ion Collider",
    "abstract": "The Electron-Ion Collider (EIC) will operate at high luminosity with multi-GeV, high-current electron beams, resulting in substantial synchrotron radiation (SR) emission in the electron storage ring (ESR). A detailed understanding of SR photon transport in the complex three-dimensional interaction region (IR) geometry is critical for estimating backgrounds in the ePIC detector and for developing effective shielding and masking strategies.   This paper presents SynradG4, an EIC-specific extension of Geant4 designed for fast photon tracking in vacuum using established SR reflection and rough surface scattering models. SynradG4 integrates the photon reflection models of Synrad+ within the Geant4 geometry and field framework, while disabling all bulk matter interactions to achieve high-statistics transport through the 50-m-long IR vacuum system. Absorbed photon coordinates are then passed to a second-stage DD4hep simulation, where full electromagnetic processes such as photoabsorption, Compton scattering, Rayleigh scattering, and fluorescence are enabled for propagation through the beam pipe and detector materials.   SynradG4 is not intended to replace general SR simulation codes; rather, it complements them by providing the workflow and geometry integration capabilities needed for EIC-specific background studies. Benchmark tests against Synrad+, Synrad3D, and the native Geant4 X-ray reflection model demonstrate excellent agreement for specular and diffuse reflection regimes. Using the full IR geometry and machine lattice, we present the first SR background estimates for the ePIC detector and evaluate the impact of potential SR masks.",
    "authors": [
      "Andrii Natochii"
    ],
    "published": "2024-08-21T15:33:47Z",
    "updated": "2025-12-02T21:41:14Z",
    "categories": [
      "physics.acc-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.03216v1",
    "url": "https://arxiv.org/abs/2512.03216v1",
    "pdf_url": "https://arxiv.org/pdf/2512.03216v1.pdf",
    "title": "Kaleidoscopic Scintillation Event Imaging",
    "abstract": "Scintillators are transparent materials that interact with high-energy particles and emit visible light as a result. They are used in state of the art methods of measuring high-energy particles and radiation sources. Most existing methods use fast single-pixel detectors to detect and time scintillation events. Cameras provide spatial resolution but can only capture an average over many events, making it difficult to image the events associated with an individual particle. Emerging single-photon avalanche diode cameras combine speed and spatial resolution to enable capturing images of individual events. This allows us to use machine vision techniques to analyze events, enabling new types of detectors. The main challenge is the very low brightness of the events. Techniques have to work with a very limited number of photons.   We propose a kaleidoscopic scintillator to increase light collection in a single-photon camera while preserving the event's spatial information. The kaleidoscopic geometry creates mirror reflections of the event in known locations for a given event location that are captured by the camera. We introduce theory for imaging an event in a kaleidoscopic scintillator and an algorithm to estimate the event's 3D position. We find that the kaleidoscopic scintillator design provides sufficient light collection to perform high-resolution event measurements for advanced radiation imaging techniques using a commercial CMOS single-photon camera. Code and data are available at https://github.com/bocchs/kaleidoscopic_scintillator.",
    "authors": [
      "Alex Bocchieri",
      "John Mamish",
      "David Appleyard",
      "Andreas Velten"
    ],
    "published": "2025-12-02T20:39:24Z",
    "updated": "2025-12-02T20:39:24Z",
    "categories": [
      "physics.ins-det",
      "cs.CV",
      "eess.IV"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.03169v1",
    "url": "https://arxiv.org/abs/2512.03169v1",
    "pdf_url": "https://arxiv.org/pdf/2512.03169v1.pdf",
    "title": "Magnetic Field Amplification and Particle Acceleration in Weakly Magnetized Trans-relativistic Electron-ion Shocks",
    "abstract": "We investigate the physics of quasi-parallel trans-relativistic shocks propagating in weakly magnetized plasmas by means of long-duration two-dimensional particle-in-cell simulations. The structure of the shock precursor is shaped by a competition between the Bell instability and the Weibel instability. The Bell instability is dominant at relatively high magnetizations $(σ\\gtrsim10^{-3})$, whereas the Weibel instability prevails at lower magnetizations $(σ\\lesssim10^{-4})$. Bell-dominated shocks efficiently accelerate ions, converting a fraction $\\varepsilon_{\\mathrm{i}}\\sim0.2$ of the upstream flow energy into downstream nonthermal ion energy. The maximum energy of nonthermal ions exhibits a Bohm scaling in time, as $E_{\\max}\\propto t$. A much smaller fraction $\\varepsilon_{\\mathrm{e}}\\ll0.1$ of the upstream flow energy goes into downstream nonthermal electrons in the Bell-dominated regime. On the other hand, Weibel-dominated shocks efficiently generate both nonthermal ions and electrons with $\\varepsilon_{\\mathrm{i}}\\sim\\varepsilon_{\\mathrm{e}}\\sim0.1$, albeit with a slower scaling for the maximum energy, $E_{\\mathrm{max}}\\propto t^{1/2}$. Our results are applicable to a wide range of trans-relativistic shocks, including the termination shocks of extragalactic jets, the late stages of gamma-ray burst afterglows, and shocks in fast blue optical transients.",
    "authors": [
      "Taiki Jikei",
      "Daniel Groselj",
      "Lorenzo Sironi"
    ],
    "published": "2025-12-02T19:12:25Z",
    "updated": "2025-12-02T19:12:25Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2512.03165v1",
    "url": "https://arxiv.org/abs/2512.03165v1",
    "pdf_url": "https://arxiv.org/pdf/2512.03165v1.pdf",
    "title": "Energetic-particle orbits near rational flux surfaces in stellarators: I. Passing particles",
    "abstract": "Recent simulations have shown that, even when the magnetic field of a stellarator possesses nested toroidal flux surfaces, the orbits of passing energetic particles can exhibit islands. These 'drift islands' arise near rational flux surfaces, where they are likely to enhance alpha-particle transport -- flattening the alpha density profile locally -- unless they can be avoided by suitable design of the stellarator magnetic field. To investigate how this might be achieved, we derive an equation for the drift-island shape in a general stellarator. This result follows from the solution to a more fundamental problem: that of calculating the orbits of passing particles near a rational flux surface. We show that these orbits are determined by conservation of an adiabatic invariant associated with the closed rational-surface field lines. We use this 'transit adiabatic invariant' to prove that there are no drift islands, for all passing particles, if and only if the magnetic field satisfies a weaker version of the Cary-Shasharina condition for omnigeneity; we call such magnetic fields 'cyclometric'. The drift-island width scales as $\\sim (ρ_\\starδ/s)^{1/2} a$ ($ρ_\\star$ is the normalized gyroradius, $δ$ is the deviation from cyclometry, $s$ is the magnetic shear, and $a$ is the minor radius), so large drift islands could arise in low-shear stellarators that are insufficiently cyclometric. To ensure accurate results for very energetic particles, we compute higher-order corrections to the transit invariant. Our calculations agree extremely well with ASCOT5 guiding-centre and full-orbit simulations of alpha particles in reactor-scale equilibria, even at $3.5\\text{MeV}$. Finally, we show how our results can also be derived using Hamiltonian perturbation theory, which provides a systematic framework for calculating passing-particle orbits on both rational and irrational surfaces.",
    "authors": [
      "Thomas E. Foster",
      "Felix I. Parra",
      "Roscoe B. White",
      "José Luis Velasco",
      "Iván Calvo",
      "Elizabeth J. Paul"
    ],
    "published": "2025-12-02T19:11:24Z",
    "updated": "2025-12-02T19:11:24Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.03007v1",
    "url": "https://arxiv.org/abs/2512.03007v1",
    "pdf_url": "https://arxiv.org/pdf/2512.03007v1.pdf",
    "title": "Generation of strong ultralow-phase-noise microwave fields with tunable ellipticity for ultracold polar molecules",
    "abstract": "Microwave(MW) fields with strong field strength, ultralow phase-noise and tunable polarization are crucial for stabilizing and manipulating ultracold polar molecules, which have emerged as a promising platform for quantum sciences. In this letter, we present the design, characterization, and performance of a robust MW setup tailored for precise control of molecular states. This setup achieves a high electric field intensity of 6.9 kV/m in the near-field from a dual-feed waveguide antenna, enabling a Rabi frequency as high as 71 MHz for the rotational transition of sodium-potassium molecules. In addition, the low noise signal source and controlled electronics provide ultralow phase-noise and dynamically tunable polarization. Narrow-band filters within the MW circuitry further reduce phase-noise by more than 20 dB at 20 MHz offset frequency, ensuring prolonged one-body molecular lifetimes up to 10 seconds. We also show practical methods to measure the MW field strength and polarization using a simple homemade dipole probe, and to characterize phase-noise down to -170 dBc/Hz with a commercial spectrum analyser and a notch filter. Those capabilities allowed us to evaporatively cool our molecular sample to deep quantum degeneracy. Furthermore, the polarization tunability enabled the observation of field-linked resonances and facilitated the creation of field-linked tetramers.These techniques advance the study of ultracold polar molecules and broaden the potential applications of MW tools in other platforms of quantum sciences.",
    "authors": [
      "Shrestha Biswas",
      "Sebastian Eppelt",
      "Christian Buchberger",
      "Xing-Yan Chen",
      "Andreas Schindewolf",
      "Michael Hani",
      "Erwin Biebl",
      "Immanuel Bloch",
      "Xin-Yu Luo"
    ],
    "published": "2025-12-02T18:32:11Z",
    "updated": "2025-12-02T18:32:11Z",
    "categories": [
      "physics.atom-ph",
      "cond-mat.quant-gas",
      "physics.ins-det"
    ],
    "primary_category": "physics.atom-ph"
  }
]