{
  "arxiv_id": "2504.20755v2",
  "url": "https://arxiv.org/abs/2504.20755v2",
  "pdf_url": "https://arxiv.org/pdf/2504.20755v2.pdf",
  "title": "Low dose gamma irradiation study of ATLAS ITk MD8 diodes",
  "abstract": "Silicon strip detectors developed for the Inner Tracker (ITk) of the ATLAS experiment will operate in a harsh radiation environment of the HL-LHC accelerator. The ITk is thus designed to endure a total fluence of 1.6E15 1MeV n_eq/cm2 and a total ionizing dose (TID) of 66 Mrad in the strip detector region. A radiation-hard n^+-in-p technology is implemented in the ITk strip sensors. To achieve the required radiation hardness, extensive irradiation studies were conducted during sensor development, primarily performed up to the maximal expected total fluence and TID to ensure a full functionality of the detector at its end-of-life. These studies included irradiations of sensors with various particle types and energies, including the Co60 gamma-rays. Our previous results obtained for gamma-irradiated diodes and strip sensors indicate a linear increase of bulk current with TID, while the surface current saturates at the lowest TID levels checked (66 Mrad), preventing a determination of the exact TID for which the observed saturation occurs. This work presents the results coming from irradiations by Co60 gamma-rays to multiple low TIDs, ranging from 0.5 to 100 krad. The detailed study of total, bulk, and surface currents of diodes explores an unknown dependence of surface current on the TID, annealing, and temperature. Additionally, the effect of the p-stop implant between the bias and the guard ring of measured samples is shown. The observations are relevant for the initial operations of the new ATLAS tracker.",
  "authors": [
    "M. Mikeštíková",
    "V. Fadeyev",
    "P. Federičová",
    "P. Gallus",
    "J. Kozáková",
    "J. Kroll",
    "M. Kůtová",
    "J. Kvasnička",
    "P. Tůma",
    "M. Ullán",
    "Y. Unno"
  ],
  "published": "2025-04-29T13:34:38Z",
  "updated": "2026-02-18T16:07:36Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}