{
  "arxiv_id": "2510.01875v3",
  "url": "https://arxiv.org/abs/2510.01875v3",
  "pdf_url": "https://arxiv.org/pdf/2510.01875v3.pdf",
  "title": "Enhancing the Efficiency of Time-Dependent Density Functional Theory Calculations of Dynamic Response Properties",
  "abstract": "X-ray Thomson scattering (XRTS) constitutes an essential technique for diagnosing material properties under extreme conditions, such as high pressures and intense laser heating. Time-dependent density functional theory (TDDFT) is one of the most accurate available ab initio methods for modeling XRTS spectra, as well as a host of other dynamic material properties. However, strong thermal excitations, along with the need to account for variations in temperature and density as well as the finite size of the detector significantly increase the computational cost of TDDFT simulations compared to ambient conditions. In this work, we present a broadly applicable method for optimizing and enhancing the efficiency of TDDFT calculations. Our approach is based on a one-to-one mapping between the dynamic structure factor and the imaginary time density--density correlation function, which naturally emerges in Feynman's path integral formulation of quantum many-body theory. Specifically, we combine rigorous convergence tests in the imaginary time domain with a constraints-based attenuation of narrow-band fluctuations to improve the efficiency of TDDFT modeling without the introduction of any significant bias. As a result, we can report a speed-up by up to an order of magnitude, thus substantially reducing the burden of computational cost required for XRTS analysis.",
  "authors": [
    "Zhandos A. Moldabekov",
    "Sebastian Schwalbe",
    "Uwe Hernandez Acosta",
    "Thomas Gawne",
    "Jan Vorberger",
    "Michele Pavanello",
    "Tobias Dornheim"
  ],
  "published": "2025-10-02T10:31:46Z",
  "updated": "2026-02-16T15:00:09Z",
  "categories": [
    "cond-mat.mtrl-sci",
    "physics.chem-ph",
    "physics.comp-ph",
    "physics.plasm-ph"
  ],
  "primary_category": "cond-mat.mtrl-sci"
}