{
  "arxiv_id": "2512.21122v2",
  "url": "https://arxiv.org/abs/2512.21122v2",
  "pdf_url": "https://arxiv.org/pdf/2512.21122v2.pdf",
  "title": "Coherent-state boundary conditions as the first-principles origin of background fields in QED",
  "abstract": "QED formulated in prescribed classical background electromagnetic fields is a standard framework for strong-field and laser\\textendash matter interactions. It is usually treated as a theory modified by externally imposed fields, obscuring its precise relation to full QED and, in particular, the role of asymptotic boundary conditions for the gauge field. Starting from an operator-based formulation, we show that QED with background fields is not a distinct theory but arises as a well-defined boundary-condition limit of full QED, in which the classical background field emerges from coherent-state boundary conditions on the quantized electromagnetic field. In this limit, the conventional generating functional used in calculations with prescribed background fields is recovered naturally, while relaxing the boundary conditions allows depletion and backreaction effects to be incorporated within the same framework. The central new result is a rigorous operator-level proof of the equivalence between the fixed background-field approximation and coherent-state asymptotic boundary conditions\\textemdash a formulation that, to our knowledge, has not been made explicit in previous approaches. We further demonstrate that the apparent time dependence of background fields does not originate from an explicitly time-dependent Hamiltonian, but instead reflects the choice of picture\\textemdash Schrödinger versus Heisenberg\\textemdash in the underlying quantum theory. Rather than introducing new properties of coherent states, our analysis provides a first-principles reinterpretation of the fixed background-field approximation as a controlled and picture-dependent limit of full QED.",
  "authors": [
    "Keita Seto"
  ],
  "published": "2025-12-24T11:49:53Z",
  "updated": "2026-02-17T16:19:08Z",
  "categories": [
    "physics.plasm-ph",
    "hep-ph",
    "physics.optics",
    "quant-ph"
  ],
  "primary_category": "physics.plasm-ph"
}