{
  "arxiv_id": "2602.15296v1",
  "url": "https://arxiv.org/abs/2602.15296v1",
  "pdf_url": "https://arxiv.org/pdf/2602.15296v1.pdf",
  "title": "GPS constellation search for exotic physics messengers coincident with the binary neutron star merger GW170817",
  "abstract": "The Global Positioning System (GPS) includes a continuously operating, planet-scale network of atomic clocks that, beyond navigation and time dissemination, enables precision tests of fundamental physics. Here we use GPS carrier phase archival data to perform a retrospective search for exotic low-mass fields (ELFs) that might be emitted by the binary neutron-star merger GW170817, complementing gravitational wave and electromagnetic modalitiesnin multi-messenger astronomy. Such ultra-relativistic fields would imprint a dispersive, anti-chirp signature in clock-frequency time series, delayed with respect to the LIGO-Virgo gravitational wave detection. We construct network-median pseudo-frequency data from eighteen Rb satellite clocks referenced to a terrestrial hydrogen maser and conduct a template-bank search spanning ELF pulse duration, arrival delay, and characteristic frequency. No statistically significant signal is observed after accounting for noise statistics and template-bank trials. We derive 95\\% confidence-level lower bounds on the interaction energy scale $Λ_α$ of quadratic couplings driving variations in electromagnetic fine-structure constant. These limits improve upon existing astrophysical and gravity-test constraints across the ELF-energy range $\\approx10^{-18}$--$10^{-14}\\,\\mathrm{eV}$. This demonstrates that mature global satellite-clock networks provide an observational capability for retrospective, multi-messenger searches for new physics using decades of archival timing data.",
  "authors": [
    "Arko P. Sen",
    "Geoffrey Blewitt",
    "Andrey Sarantsev",
    "Paul Ries",
    "Andrei Derevianko"
  ],
  "published": "2026-02-17T01:40:17Z",
  "updated": "2026-02-17T01:40:17Z",
  "categories": [
    "astro-ph.IM",
    "astro-ph.HE",
    "physics.atom-ph",
    "physics.data-an",
    "physics.ins-det"
  ],
  "primary_category": "astro-ph.IM"
}