[
  {
    "arxiv_id": "2602.16672v1",
    "url": "https://arxiv.org/abs/2602.16672v1",
    "pdf_url": "https://arxiv.org/pdf/2602.16672v1.pdf",
    "title": "FLUKA-Based Optimization of Muon Production Target Design for a Muon Collider Demonstrator",
    "abstract": "This study investigates how target geometry and material influence pion and muon production from an 8 GeV proton beam, in support of target-system design for a muon collider demonstrator. A 2 m long, 0.7 m radius solenoid with a 5 T peak magnetic field is used to capture secondary particles, with the target positioned at its center. We examine how variations in target radius, length, and material affect secondary-beam yield and emittance at the solenoid exit. In parallel, we evaluate temperature rise within the target to assess material limitations and guide future work on thermal and structural survivability. The results provide initial intuition for optimizing both particle yield and target durability in muon collider front-end systems.",
    "authors": [
      "Ruaa Al-Harthy"
    ],
    "published": "2026-02-18T18:09:08Z",
    "updated": "2026-02-18T18:09:08Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.16624v1",
    "url": "https://arxiv.org/abs/2602.16624v1",
    "pdf_url": "https://arxiv.org/pdf/2602.16624v1.pdf",
    "title": "Measurement of the Saturation Length of the Self-Modulation Instability",
    "abstract": "The self-modulation (SM) instability transforms a long charged particle bunch traveling in plasma into a train of microbunches that resonantly drives large-amplitude wakefields. We present the first determination of the saturation length of SM using experimental and numerical results. The saturation length is the distance over which wakefields reach their maximum amplitude along the plasma. By varying the plasma length and measuring the radius of the transverse distribution of the bunch, we find that the saturation length of SM decreases with plasma density and initial field amplitude, e.g., when seeding. The saturation length is a fundamental parameter of the instability, and these results are key for understanding SM and designing plasma wakefield accelerators driven by long bunches, such as AWAKE, or by long laser pulses for radiation production.",
    "authors": [
      "A. Clairembaud",
      "M. Turner",
      "M. Bergamaschi",
      "L. Ranc",
      "F. Pannell",
      "J. Mezger",
      "H. Jaworska",
      "N. van Gils",
      "J. Farmer",
      "P. Muggli",
      "the AWAKE Collaboration"
    ],
    "published": "2026-02-18T17:18:25Z",
    "updated": "2026-02-18T17:18:25Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.16567v1",
    "url": "https://arxiv.org/abs/2602.16567v1",
    "pdf_url": "https://arxiv.org/pdf/2602.16567v1.pdf",
    "title": "Scattering and sputtering on the lunar surface; Insights from negative ions observed at the surface",
    "abstract": "Context. Airless planetary bodies are directly exposed to solar wind ions, which can scatter or become implanted upon impact with the regolith-covered surface, while also sputtering surface atoms.   Aims. We construct a semi-analytical model for the scattering of ions of hundreds of eV and the sputtering of surface atoms, both resulting in the emission of negative ions from the lunar surface. Our model contains a novel description of the scattering process that is physics-based and constrained by observations.   Methods. We use data from the Negative Ions at the Lunar Surface (NILS) instrument on the Chang'e-6 lander to update prior knowledge of ion scattering and sputtering from lunar regolith through Bayesian inference.   Results. Our model shows good agreement with the NILS data. A precipitating solar wind proton has roughly a 22% chance of scattering from the lunar surface in any charge state, and about an 8% chance of sputtering a surface hydrogen atom. The resulting ratio of scattered to sputtered hydrogen flux is eta_sc / eta_sp = 1.5 for a proton speed of 300 km/s. We find a high probability (7-20%) that a hydrogen atom leaves the surface negatively charged. The angular emission distributions at near-grazing angles for both scattered and sputtered fluxes are controlled by surface roughness. Our model also indicates significant inelastic energy losses for hydrogen interacting with the regolith, suggesting a longer effective path length than previously assumed. Finally, we estimate a surface binding energy of 5.5 eV, consistent with the observations.   Conclusions. Our model describes the scattering and sputtering of particles of any charge state from any homogeneous, multi-species surface. Using NILS data, we successfully applied the model to update our understanding of solar wind interacting with lunar regolith, and the emission of negative hydrogen ions.",
    "authors": [
      "Romain Canu-Blot",
      "Martin Wieser",
      "Umberto Rollero",
      "Thomas Maynadié",
      "Stas Barabash",
      "Gabriella Stenberg Wieser",
      "Aibing Zhang",
      "Wenjing Wang",
      "Chi Wang"
    ],
    "published": "2026-02-18T16:09:02Z",
    "updated": "2026-02-18T16:09:02Z",
    "categories": [
      "physics.space-ph",
      "physics.atom-ph",
      "physics.ins-det",
      "stat.AP"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2504.20755v2",
    "url": "https://arxiv.org/abs/2504.20755v2",
    "pdf_url": "https://arxiv.org/pdf/2504.20755v2.pdf",
    "title": "Low dose gamma irradiation study of ATLAS ITk MD8 diodes",
    "abstract": "Silicon strip detectors developed for the Inner Tracker (ITk) of the ATLAS experiment will operate in a harsh radiation environment of the HL-LHC accelerator. The ITk is thus designed to endure a total fluence of 1.6E15 1MeV n_eq/cm2 and a total ionizing dose (TID) of 66 Mrad in the strip detector region. A radiation-hard n^+-in-p technology is implemented in the ITk strip sensors. To achieve the required radiation hardness, extensive irradiation studies were conducted during sensor development, primarily performed up to the maximal expected total fluence and TID to ensure a full functionality of the detector at its end-of-life. These studies included irradiations of sensors with various particle types and energies, including the Co60 gamma-rays. Our previous results obtained for gamma-irradiated diodes and strip sensors indicate a linear increase of bulk current with TID, while the surface current saturates at the lowest TID levels checked (66 Mrad), preventing a determination of the exact TID for which the observed saturation occurs. This work presents the results coming from irradiations by Co60 gamma-rays to multiple low TIDs, ranging from 0.5 to 100 krad. The detailed study of total, bulk, and surface currents of diodes explores an unknown dependence of surface current on the TID, annealing, and temperature. Additionally, the effect of the p-stop implant between the bias and the guard ring of measured samples is shown. The observations are relevant for the initial operations of the new ATLAS tracker.",
    "authors": [
      "M. Mikeštíková",
      "V. Fadeyev",
      "P. Federičová",
      "P. Gallus",
      "J. Kozáková",
      "J. Kroll",
      "M. Kůtová",
      "J. Kvasnička",
      "P. Tůma",
      "M. Ullán",
      "Y. Unno"
    ],
    "published": "2025-04-29T13:34:38Z",
    "updated": "2026-02-18T16:07:36Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.16529v1",
    "url": "https://arxiv.org/abs/2602.16529v1",
    "pdf_url": "https://arxiv.org/pdf/2602.16529v1.pdf",
    "title": "Thermal Decoherence and Population Transfer of MeV Channeling Electrons in Diamond",
    "abstract": "Channeling radiation in oriented crystals arises from transitions between quantized transverse bound states in the MeV regime and is strongly affected by thermal diffuse scattering through population transfer and decoherence. A frozen-phonon multislice propagation framework is developed to track a reduced transverse Hilbert space spanned by selected bound-state manifolds using configuration-resolved projection amplitudes. Beyond reproducing transition energies, the method yields reduced manifold density matrices, thermal population kinetics, and depth-resolved coherence metrics. Applied to axial electron channeling in $\\langle100\\rangle$ diamond at 16.9 MeV, the results show approximately exponential population loss with strongly state-dependent feeding among low-lying manifolds. For an initial coherent superposition in the degenerate 2p manifold, the intra-manifold purity relaxes toward the maximally mixed limit, consistent with thermally induced random basis rotations. Under 1s initial excitation, population transferred into the 2p and 3d manifolds remains close to maximally mixed, while weak cross-manifold coherences persist. The framework enables quantitative analysis of thermal population dynamics, decoherence, and their links to spontaneous and coherently driven emission observables across a broad range of crystal structures.",
    "authors": [
      "Tadas Paulauskas"
    ],
    "published": "2026-02-18T15:17:12Z",
    "updated": "2026-02-18T15:17:12Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.acc-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2512.06397v2",
    "url": "https://arxiv.org/abs/2512.06397v2",
    "pdf_url": "https://arxiv.org/pdf/2512.06397v2.pdf",
    "title": "Measuring the buried interphase between solid electrolytes and lithium metal using neutrons",
    "abstract": "Interfaces are the key to next generation high energy batteries including solid state Li metal batteries. In solid state batteries, the buried nature of solid solid electrolyte electrode interfaces makes studying them difficult. Neutrons have significant potential to non destructively probe these buried solid solid interfaces. This work presents a comparative study using both neutron depth profiling (NDP) and neutron reflectometry (NR) to study a model lithium metal-lithium phosphorus oxynitride (LiPON) solid electrolyte system. In the NDP data, no distinct interphase is observed at the interface. NR shows a difference between electrodeposited, and vapor deposited LiPON -Li interfaces but finds both are gradient interphases that are less than 30 nm thick. Additional simulations of the LiPON-Li2O-Li system demonstrate that NDP has an excellent resolution in the 50 nm-1 mm regime while NR has an ideal resolution from 0.1 - 200 nm with different sample requirements. Together NDP and NR can provide a complementary understanding of interfaces between Li metal and solid electrolytes across relevant length scales.",
    "authors": [
      "Andrew S. Westover",
      "Katie L. Browning",
      "Antonino Cannavo",
      "Ralph Gilles",
      "Jiri Vacik",
      "James F. Browning",
      "Neelima Paul",
      "Giovanni Ceccio",
      "Vasyl Lavrentiev"
    ],
    "published": "2025-12-06T10:59:46Z",
    "updated": "2026-02-18T15:15:04Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2602.16297v1",
    "url": "https://arxiv.org/abs/2602.16297v1",
    "pdf_url": "https://arxiv.org/pdf/2602.16297v1.pdf",
    "title": "Characterization of an MPPC-Based Scintillator Telescope and Measurement of Cosmic Muon Angular Distribution",
    "abstract": "This report presents the design, characterization, and application of a high-sensitivity optical detection system based on plastic scintillators coupled to Multi-Pixel Photon Counters (MPPCs). The primary objective was to evaluate the performance of MPPCs (Silicon Photomultipliers) as robust, low-voltage alternatives to traditional photomultiplier tubes for detecting faint scintillation light. The optoelectronic properties of the sensors were analyzed, including single-photoelectron gain calibration and dark count rate measurements, to optimize the signal-to-noise ratio. By embedding wavelength-shifting fibers to enhance light collection efficiency, the system was configured into a three-fold coincidence telescope. The angular distribution of the cosmic ray muon flux was measured to validate the detector's stability and geometric acceptance. Fitting the experimental data to a $\\bm{\\cos^n(θ)}$ distribution yielded an angular exponent of $\\bm{n = 1.44 \\pm 0.06}$, consistent with literature values. These results demonstrate the efficacy of the MPPC-scintillator coupling for precise photon counting and timing applications in high-energy physics instrumentation.",
    "authors": [
      "Sahla Manithottathil",
      "Anuj Gupta",
      "Mudit Kumar",
      "Navaneeth Poonthottathil"
    ],
    "published": "2026-02-18T09:27:39Z",
    "updated": "2026-02-18T09:27:39Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.02971v2",
    "url": "https://arxiv.org/abs/2510.02971v2",
    "pdf_url": "https://arxiv.org/pdf/2510.02971v2.pdf",
    "title": "Millimeter-Wavelength Lens-Absorber-Coupled Ti/Al Kinetic Inductance Detectors",
    "abstract": "This work presents Ti/Al bi-layer Microwave Kinetic Inductance Detectors (MKIDs) based on lens-coupled spiral absorbers as the quasi-optical coupling mechanism for millimeter-wavelength radiation detection. From simulations, the lens-coupled absorbers provide a 70% lens aperture efficiency in both polarizations over an octave band with a spiral array absorber and over 10% relative bandwidth with a single spiral. We have fabricated and measured two devices with bare Ti/Al MKIDs: a 3x3 cm chip with 9 pixels to characterize the optical response at 85 GHz of the two variations of the absorber; and a large format demonstrator with 253 spiral-array pixels showing potential towards a large format millimeter-wavelength camera. We estimate a sensitivity of 1 $\\mathrm{mK}\\cdot\\mathrm{Hz}^{-0.5}$ and a 95% detector yield.",
    "authors": [
      "Alejandro Pascual Laguna",
      "Victor Rollano",
      "Aimar Najarro-Fiandra",
      "David Rodriguez",
      "Maria T. Magaz",
      "Daniel Granados",
      "Alicia Gomez"
    ],
    "published": "2025-10-03T13:03:14Z",
    "updated": "2026-02-18T08:43:59Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "astro-ph.IM",
    "doi": "10.1109/TASC.2026.3665923"
  },
  {
    "arxiv_id": "2601.11837v2",
    "url": "https://arxiv.org/abs/2601.11837v2",
    "pdf_url": "https://arxiv.org/pdf/2601.11837v2.pdf",
    "title": "High-Voltage Performance Testing in LAr of the PMMA Cathode Connection for the DarkSide-20k Experiment",
    "abstract": "DarkSide-20k (DS-20k) is a next-generation dual-phase liquid argon (LAr) time projection chamber (TPC) devoted to the direct-detection of dark matter. The detector is currently under construction in Hall-C at the Laboratori Nazionali del Gran Sasso, Italy, at a depth of approximately 3500 m water equivalent. The detector will instrument 49.7 t of low-radioactivity underground LAr contained within an acrylic TPC and is designed to reach a WIMP-nucleon spin-independent cross-section sensitivity down to $10^{-48}\\,\\mathrm{cm}^{2}$ for a WIMP mass of $0.1\\,\\mathrm{TeV}/c^{2}$ in a 200 tonne-year run. In DS-20k a uniform electric drift field is established in the active volume to transport ionization electrons toward the electroluminescence region, with the required high voltage delivered to the TPC cathode through a custom cable and stress-cone assembly. At the University of California, Davis, a dedicated test setup was developed to reproduce the DS-20k cathode high-voltage connection in LAr, matching the local electric-field conditions. This work summarizes the results of a comprehensive test campaign validating the operation of the DS-20k cathode HV system in LAr up to $-100$ kV.",
    "authors": [
      "Ludovico Luzzi"
    ],
    "published": "2026-01-17T00:03:03Z",
    "updated": "2026-02-18T02:02:11Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.08881v2",
    "url": "https://arxiv.org/abs/2511.08881v2",
    "pdf_url": "https://arxiv.org/pdf/2511.08881v2.pdf",
    "title": "Commissioning the Resonance Ionization Spectroscopy Experiment at FRIB",
    "abstract": "This manuscript reports on the commissioning of the Resonance Ionization Spectroscopy Experiment (RISE) at the BECOLA facility at FRIB. The new instrument implements the collinear resonance ionization spectroscopy technique for sensitive measurements of isotope shifts and hyperfine structure of short-lived isotopes produced at FRIB. The existing BECOLA beamline was extended to integrate an electrostatic ion-beam bender and an ion detector at ultra-high vacuum. An injection-seeded Ti:Sapphire laser and a multi-harmonic pulsed Nd:YAG laser were installed to perform resonant excitation and selective ionization. Commissioning tests were performed to demonstrate the capabilities of the new instrument by measuring the hyperfine structure of stable $^{27}$Al produced in an offline ion source. The RISE instrument is ready and operational for future studies of short-lived isotopes at FRIB.",
    "authors": [
      "A. J. Brinson",
      "B. J. Rickey",
      "J. M. Allmond",
      "A. Dockery",
      "A. Fernandez Chiu",
      "R. F. Garcia Ruiz",
      "T. J. Gray",
      "J. Karthein",
      "T. T. King",
      "K. Minamisono",
      "A. Ortiz-Cortes",
      "S. V. Pineda",
      "M. Reponen",
      "B. C. Rasco",
      "S. M. Udrescu",
      "A. R. Vernon",
      "S. G. Wilkins"
    ],
    "published": "2025-11-12T01:35:09Z",
    "updated": "2026-02-17T22:52:25Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1103/hm9t-4pgp"
  },
  {
    "arxiv_id": "2602.15992v1",
    "url": "https://arxiv.org/abs/2602.15992v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15992v1.pdf",
    "title": "Properties of a compact neutron supermirror transmission polarizer with an electromagnetic system",
    "abstract": "The paper will present SVAROG, a compact neutron supermirror transmission multichannel polarizer with an electromagnetic system. The basic properties of this polarizer will be considered. Variants for using this polarizer in experimenrtla facilities of the PIK research reactor (Petersburg Nuclear Physics Institute of National Research Centre «Kurchatov Institute» (NRC «Kurchatov Institute» - PNPI)) will be discussed and a comparison of the considered polarizer with known neutron transmission polarizers will be carried out.",
    "authors": [
      "V. G. Syromyatnikov",
      "S. Yu. Semenikhin",
      "M. V. Lasitsa"
    ],
    "published": "2026-02-17T20:29:09Z",
    "updated": "2026-02-17T20:29:09Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex",
      "physics.acc-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.15990v1",
    "url": "https://arxiv.org/abs/2602.15990v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15990v1.pdf",
    "title": "Memristive tabular variational autoencoder for compression of analog data in high energy physics",
    "abstract": "We present an implementation of edge AI to compress data on an in-memory analog content-addressable memory (ACAM) device. A variational autoencoder is trained on a simulated sample of energy measurements from incident high-energy electrons on a generic three-layer scintillator-based calorimeter. The encoding part is distilled into tabular format by regressing the latent space variables using decision trees, which is then programmed on a memristor-based ACAM. In real-time, the ACAM compresses 48 continuously valued incoming energies measured by the calorimeter sensors into the latent space, achieving a compression factor of 12x, which is transmitted off-detector for decompression. The performance result of the ACAM, obtained using the Structural Simulation Toolkit, the SST open source framework, gives a latency value of 24 ns and a throughput of 330M compressions per second, i.e., 3 ns between successive inputs, and an average energy consumption of 4.1 nJ per compression.",
    "authors": [
      "Rajat Gupta",
      "Yuvaraj Elangovan",
      "Tae Min Hong",
      "James Ignowski",
      "John Moon",
      "Aishwarya Natarajan",
      "Stephen Roche",
      "Luca Buonanno"
    ],
    "published": "2026-02-17T20:26:56Z",
    "updated": "2026-02-17T20:26:56Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "physics.data-an"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.15946v1",
    "url": "https://arxiv.org/abs/2602.15946v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15946v1.pdf",
    "title": "On-chip probabilistic inference for charged-particle tracking at the sensor edge",
    "abstract": "Modern scientific instruments operate under increasingly extreme constraints on bandwidth, latency, and power. Inference at the sensor edge determines experimental data collection efficiency by deciding which information to save for further analysis. Particle tracking detectors at the Large Hadron Collider exemplify this challenge: pixelated silicon sensors generate rich spatiotemporal ionization patterns, yet most of this information is discarded due to data-rate limitations. Concurrently, advancements in co-design tools provide rapid turn-around for incorporating machine learning into application-specific integrated circuits, motivating designs for particle detectors with new integrated technologies. We demonstrate that neural networks embedded in the front-end electronics can infer charged-particle kinematic parameters from a single silicon layer. We regress hit positions and incident angles with calibrated uncertainties, while satisfying stringent constraints on numerical precision, latency, and silicon area. Our results establish a path toward probabilistic inference directly at the edge, opening new opportunities for intelligent sensing in high-rate scientific instruments.",
    "authors": [
      "Arghya Ranjan Das",
      "David Jiang",
      "Rachel Kovach-Fuentes",
      "Shiqi Kuang",
      "Ana Sofía Calle Muñoz",
      "Danush Shekar",
      "Jennet Dickinson",
      "Giuseppe Di Guglielmo",
      "Lindsey Gray",
      "Mia Liu",
      "Corrinne Mills",
      "Mark S. Neubauer",
      "Daniel Abadjiev",
      "Anthony Badea",
      "Doug Berry",
      "Karri DiPetrillo",
      "Farah Fahim",
      "Abhijith Gandrakota",
      "Harshul Gupta",
      "James Hirschauer",
      "Eliza Howard",
      "Ron Lipton",
      "Petar Maksimovic",
      "Nick Manganelli",
      "Benjamin Parpillon",
      "Jannicke Pearkes",
      "Ricardo Silvestre",
      "Morris Swartz",
      "Chinar Syal",
      "Nhan Tran",
      "Amit Trivedi",
      "Keith Ulmer",
      "Mohammad Abrar Wadud",
      "Benjamin Weiss",
      "Eric You"
    ],
    "published": "2026-02-17T19:03:17Z",
    "updated": "2026-02-17T19:03:17Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.15777v1",
    "url": "https://arxiv.org/abs/2602.15777v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15777v1.pdf",
    "title": "New Challenges in Plasma Accelerators: Final Focusing for Wakefield Colliders",
    "abstract": "The focusing of particle beams for collider experiments is crucial for maximizing the luminosity and thus the discovery potential of these machines. In recent years, plasma wakefield acceleration has emerged as a leading candidate for achieving higher energy collisions with smaller facility footprints due to the large accelerating gradients in the plasma. This higher beam energy poses significant challenges for the final focusing system of the collider. Here, we discuss the various challenges of final focusing for TeV-scale plasma accelerators and propose possible solutions. Finally, we present the first design of a final focusing system for a 10 TeV linear wakefield collider, evaluate its performance, and discuss its shortcomings as well as improvements for future designs.",
    "authors": [
      "Keegan Downham",
      "Spencer Gessner",
      "Lewis Kennedy",
      "Rogelio Tomás",
      "Andrei Seryi"
    ],
    "published": "2026-02-17T18:06:54Z",
    "updated": "2026-02-17T18:06:54Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2212.00126v3",
    "url": "https://arxiv.org/abs/2212.00126v3",
    "pdf_url": "https://arxiv.org/pdf/2212.00126v3.pdf",
    "title": "Proton Computed Tomography Image Reconstruction Based on the Richardson-Lucy Algorithm",
    "abstract": "Proton therapy is an emerging method in cancer therapy. One of the main developments is to increase the accuracy of the Bragg-peak position calculation, which requires more precise relative stopping power (RSP) measurements. A promising choice is the application of proton computed tomography (pCT) systems which takes the images under similar conditions, as they use the same irradiation device and hadron beam for imaging and treatment. A key aim is to develop a precise image reconstruction algorithm for pCT systems to reach their maximal performance.   In this work, an iterative image reconstruction algorithm, based on the Richardson-Lucy iteration is proposed for the first time for proton CT image reconstruction. Monte Carlo (MC) simulations of CTP528 and CTP404 phantoms were used to benchmark the proposed method. In the case of an idealized detector setup, using a 1 mm pitch grid, 4.88 lp/cm spatial resolution and 0.66% average RSP uncertainty was achieved. The present method provides a promising proof-of-concept candidate for compromise between accuracy and speed with several further development directions.",
    "authors": [
      "Gábor Bíró",
      "Ákos Sudár",
      "Zsófia Jólesz",
      "Gábor Papp",
      "Gergely Gábor Barnaföldi"
    ],
    "published": "2022-11-30T21:28:10Z",
    "updated": "2026-02-17T17:08:34Z",
    "categories": [
      "physics.med-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.med-ph"
  },
  {
    "arxiv_id": "2512.21122v2",
    "url": "https://arxiv.org/abs/2512.21122v2",
    "pdf_url": "https://arxiv.org/pdf/2512.21122v2.pdf",
    "title": "Coherent-state boundary conditions as the first-principles origin of background fields in QED",
    "abstract": "QED formulated in prescribed classical background electromagnetic fields is a standard framework for strong-field and laser\\textendash matter interactions. It is usually treated as a theory modified by externally imposed fields, obscuring its precise relation to full QED and, in particular, the role of asymptotic boundary conditions for the gauge field. Starting from an operator-based formulation, we show that QED with background fields is not a distinct theory but arises as a well-defined boundary-condition limit of full QED, in which the classical background field emerges from coherent-state boundary conditions on the quantized electromagnetic field. In this limit, the conventional generating functional used in calculations with prescribed background fields is recovered naturally, while relaxing the boundary conditions allows depletion and backreaction effects to be incorporated within the same framework. The central new result is a rigorous operator-level proof of the equivalence between the fixed background-field approximation and coherent-state asymptotic boundary conditions\\textemdash a formulation that, to our knowledge, has not been made explicit in previous approaches. We further demonstrate that the apparent time dependence of background fields does not originate from an explicitly time-dependent Hamiltonian, but instead reflects the choice of picture\\textemdash Schrödinger versus Heisenberg\\textemdash in the underlying quantum theory. Rather than introducing new properties of coherent states, our analysis provides a first-principles reinterpretation of the fixed background-field approximation as a controlled and picture-dependent limit of full QED.",
    "authors": [
      "Keita Seto"
    ],
    "published": "2025-12-24T11:49:53Z",
    "updated": "2026-02-17T16:19:08Z",
    "categories": [
      "physics.plasm-ph",
      "hep-ph",
      "physics.optics",
      "quant-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.08549v2",
    "url": "https://arxiv.org/abs/2512.08549v2",
    "pdf_url": "https://arxiv.org/pdf/2512.08549v2.pdf",
    "title": "A journey to ITACA: Ion Tracking with Ammonium Cations Apparatus",
    "abstract": "A unique feature of gas xenon electroluminescent time projection chambers (GXeEL TPCs) in $0νββ$ searches is their ability to reconstruct event topology, in particular to distinguish \"single-electron\" from \"double-electron\" tracks, the latter being the signature of a $0νββ$ decay near the decay endpoint $Q_{ββ}$. Together with excellent energy resolution and the t$_0$ provided by primary scintillation, this topological information is key to suppressing backgrounds. Preserving EL, however, requires operation in pure xenon (with helium as the only benign additive), where electron diffusion is large. Consequently, reconstructed track fidelity is limited by diffusion and intrinsic EL blurring. We propose augmenting the detector with the ability to image not only the electron track but also the corresponding mirror ion track. Introducing trace amounts of NH$_3$ ($\\sim$100 ppb) converts primary xenon ions into ammonium ions, NH$_4^+$, via a fast two-step ion-molecule process involving charge transfer followed by proton transfer, while leaving EL unaffected. Electrons drift rapidly to the anode, producing the standard EL image, whereas NH$_4^+$ ions drift slowly toward the cathode, allowing time to determine the event energy and barycenter. For events in the region of interest, an ion sensor near the cathode at the projected barycenter captures the ions. Laser interrogation of the sensor's molecular layer then reveals an ion-track image with sub-millimeter diffusion and no EL-induced smearing. Combined electron-ion imaging strengthens topological discrimination, improving background rejection by about an order of magnitude and significantly extending the discovery potential of GXeEL TPCs for very long $0νββ$ lifetimes.",
    "authors": [
      "J. J. Gómez-Cadenas",
      "L. Arazi",
      "M. Elorza",
      "Z. Freixa",
      "F. Monrabal",
      "A. Pazos",
      "J. Renner",
      "S. R. Soleti",
      "S. Torelli"
    ],
    "published": "2025-12-09T12:46:14Z",
    "updated": "2026-02-17T15:37:16Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.15652v1",
    "url": "https://arxiv.org/abs/2602.15652v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15652v1.pdf",
    "title": "The COHERENT Experiment: 2026 Update",
    "abstract": "The COHERENT experiment measures neutrino-induced recoils from coherent elastic neutrino-nucleus scattering (CEvNS) with multiple nuclear targets at the Spallation Neutron Source (SNS) at the Oak Ridge National Laboratory (ORNL), USA. Several successful CEvNS measurements have been achieved in recent years with tens-of-kg detector masses, with a CsI scintillating crystal, a liquid argon single-phase detector, and high-purity germanium spectrometers. For the next phase, COHERENT aims at high-statistics detection of CEvNS events for precision tests of the standard model of particle physics, and to probe new physics beyond-the-standard model. Percent-level precision can be achieved by lowering thresholds, reducing backgrounds, and by scaling up the detector masses. It goes hand in hand with benchmarking the neutrino flux from the SNS. Further detectors will measure CEvNS in additional nuclei, including lighter target nuclei such as sodium and neon, to continue to test the expected neutron-number-squared dependence of the cross section. COHERENT can furthermore study charged-current and neutral-current inelastic neutrino-nucleus cross sections on various nuclei at neutrino energies below $\\sim$50 MeV. Many of these cross sections have never been measured before, but are critical input for the interpretation of core-collapse supernova detection in large-scale neutrino experiments such as DUNE, Super-K, Hyper-K, and HALO.",
    "authors": [
      "M. Adhikari",
      "M. Ahn",
      "D. Amaya Matamoros",
      "P. S. Barbeau",
      "V. Belov",
      "I. Bernardi",
      "C. Bock",
      "A. Bolozdynya",
      "R. Bouabid",
      "J. Browning",
      "B. Cabrera-Palmer",
      "N. Cedarblade-Jones",
      "S. Chen",
      "A. I. Colón Rivera",
      "V. da Silva",
      "J. Daughhetee",
      "Y. Efremenko",
      "S. R. Elliott",
      "A. Erlandson",
      "L. Fabris",
      "M. L. Fischer",
      "S. Foster",
      "A. Galindo-Uribarri",
      "E. Granados Vazquez",
      "M. P. Green",
      "B. Hackett",
      "J. Hakenmüller",
      "M. Harada",
      "M. R. Heath",
      "S. Hedges",
      "Y. Hino",
      "H. Huang",
      "W. Huang",
      "H. Jeong",
      "B. A. Johnson",
      "T. Johnson",
      "A. Khromov",
      "D. Kim",
      "L. Kong",
      "A. Konovalov",
      "Y. Koshio",
      "E. Kozlova",
      "A. Kumpan",
      "O. Kyzylova",
      "Y. Lee",
      "S. M. Lee",
      "G. Li",
      "L. Li",
      "Z. Li",
      "J. M. Link",
      "J. Liu",
      "Q. Liu",
      "X. Lu",
      "M. Luxnat",
      "D. M. Markoff",
      "J. Mattingly",
      "H. McLaurin",
      "K. McMichael",
      "N. Meredith",
      "Y. Nakajima",
      "F. Nakanishi",
      "J. Newby",
      "B. Nolan",
      "J. O'Reilly",
      "A. Orvedahl",
      "D. S. Parno",
      "D. Pérez-Loureiro",
      "D. Pershey",
      "C. G. Prior",
      "J. Queen",
      "R. Rapp",
      "H. Ray",
      "O. Razuvaeva",
      "D. Reyna",
      "D. Rudik",
      "J. Runge",
      "D. J. Salvat",
      "J. Sander",
      "K. Scholberg",
      "H. Sekiya",
      "J. Seligman",
      "A. Shakirov",
      "G. Simakov",
      "J. Skweres",
      "W. M. Snow",
      "V. Sosnovtsev",
      "Q. Stefan",
      "M. Stringer",
      "C. Su",
      "T. Subedi",
      "B. Suh",
      "B. Sur",
      "R. Tayloe",
      "Y. -T. Tsai",
      "J. Vaccaro",
      "E. E. van Nieuwenhuizen",
      "C. J. Virtue",
      "G. Visser",
      "K. Walkup",
      "E. M. Ward",
      "R. Wendell",
      "T. Wongjirad",
      "C. Yang",
      "Y. Yang",
      "J. Yoo",
      "C. -H. Yu",
      "Y. Yu",
      "A. Zaalishvili",
      "J. Zettlemoyer",
      "Y. Zheng"
    ],
    "published": "2026-02-17T15:24:29Z",
    "updated": "2026-02-17T15:24:29Z",
    "categories": [
      "hep-ex",
      "hep-ph",
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2404.09793v2",
    "url": "https://arxiv.org/abs/2404.09793v2",
    "pdf_url": "https://arxiv.org/pdf/2404.09793v2.pdf",
    "title": "First search for light fermionic dark matter absorption on electrons using germanium detector in CDEX-10 experiment",
    "abstract": "We present the first results of the search for sub-MeV fermionic dark matter absorbed by electron targets of germanium using the 205.4~kg$\\cdot$day data collected by the CDEX-10 experiment, with the analysis threshold of 160~eVee. No significant dark matter (DM) signals over the background are observed. Results are presented as limits on the cross section of DM--electron interaction. We present new constraints of cross section in the DM range of 0.1--10 keV/$c^2$ for vector and axial-vector interaction. The upper limit on the cross section is set to be $\\rm 6.8\\times10^{-46}~cm^2$ for vector interaction, and $\\rm 2.3\\times10^{-46}~cm^2$ for axial-vector interaction at DM mass of 5 keV/$c^2$.",
    "authors": [
      "J. X. Liu",
      "L. T. Yang",
      "Q. Yue",
      "K. J. Kang",
      "Y. J. Li",
      "H. P. An",
      "Greeshma C.",
      "J. P. Chang",
      "Y. H. Chen",
      "J. P. Cheng",
      "W. H. Dai",
      "Z. Deng",
      "C. H. Fang",
      "X. P. Geng",
      "H. Gong",
      "Q. J. Guo",
      "T. Guo",
      "X. Y. Guo",
      "L. He",
      "J. R. He",
      "J. W. Hu",
      "H. X. Huang",
      "T. C. Huang",
      "L. Jiang",
      "S. Karmakar",
      "H. B. Li",
      "H. Y. Li",
      "J. M. Li",
      "J. Li",
      "M. C. Li",
      "Q. Y. Li",
      "R. M. J. Li",
      "X. Q. Li",
      "Y. L. Li",
      "Y. F. Liang",
      "B. Liao",
      "F. K. Lin",
      "S. T. Lin",
      "S. K. Liu",
      "Y. D. Liu",
      "Y. Liu",
      "Y. Y. Liu",
      "H. Ma",
      "Y. C. Mao",
      "Q. Y. Nie",
      "H. Pan",
      "N. C. Qi",
      "J. Ren",
      "X. C. Ruan",
      "M. B. Shen",
      "M. K. Singh",
      "T. X. Sun",
      "W. L. Sun",
      "C. J. Tang",
      "Y. Tian",
      "G. F. Wang",
      "J. Z. Wang",
      "L. Wang",
      "Q. Wang",
      "Y. F. Wang",
      "Y. X. Wang",
      "H. T. Wong",
      "Y. C. Wu",
      "H. Y. Xing",
      "K. Z. Xiong",
      "R. Xu",
      "Y. Xu",
      "T. Xue",
      "Y. L. Yan",
      "N. Yi",
      "C. X. Yu",
      "H. J. Yu",
      "M. Zeng",
      "Z. Zeng",
      "B. T. Zhang",
      "F. S. Zhang",
      "L. Zhang",
      "P. Zhang",
      "Z. H. Zhang",
      "Z. Y. Zhang",
      "J. Z. Zhao",
      "K. K. Zhao",
      "M. G. Zhao",
      "J. F. Zhou",
      "Z. Y. Zhou",
      "J. J. Zhu"
    ],
    "published": "2024-04-15T13:48:25Z",
    "updated": "2026-02-17T14:33:43Z",
    "categories": [
      "hep-ex",
      "hep-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1103/hq9t-z4xf"
  },
  {
    "arxiv_id": "2503.16215v2",
    "url": "https://arxiv.org/abs/2503.16215v2",
    "pdf_url": "https://arxiv.org/pdf/2503.16215v2.pdf",
    "title": "Quantum Metrology of Newton's Constant with Levitated Mechanical Systems",
    "abstract": "Newton's constant is the least well-measured among the fundamental constants of Nature, and, indeed, its accurate measurement has long served an experimental challenge. Levitated mechanical systems are attracting growing attention for their promising applications in sensing and as an experimental platform for exploring the intersection between quantum physics and gravitation. Here we propose a mechanical interferometric scheme of interacting levitated oscillators for the accurate estimation of Newton's constant. Our scheme promises to beat the current standard by several orders of magnitude.",
    "authors": [
      "Francis J. Headley",
      "Alessio Belenchia",
      "Mauro Paternostro",
      "Daniel Braun"
    ],
    "published": "2025-03-20T15:08:04Z",
    "updated": "2026-02-17T14:13:35Z",
    "categories": [
      "quant-ph",
      "physics.ins-det"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2502.04374v2",
    "url": "https://arxiv.org/abs/2502.04374v2",
    "pdf_url": "https://arxiv.org/pdf/2502.04374v2.pdf",
    "title": "The Numerics of VMEC++",
    "abstract": "VMEC++ is a Python-friendly, from-scratch reimplementation in C++ of the Variational Moments Equilibrium Code (VMEC), a fixed- and free-boundary ideal-MHD equilibrium solver for stellarators and tokamaks. The first VMEC implementation was written by Steven P. Hirshman and colleagues in the 1980s and 1990s and its latest Fortran incarnation (PARVMEC, https://github.com/ORNL-Fusion/PARVMEC) is widely used in stellarator optimization systems. Our work improves on previous implementations with regard to various critical aspects: special care has been put in providing an idiomatic Python experience, from installation to actual usage; VMEC++ has a zero-crash policy; it supports inputs in the classic INDATA format as well as friendlier JSON files. VMEC++ execution times are typically less than or equal to previous implementations, and time to convergence can be decreased dramatically by leveraging its hot-restart feature: by providing the output of a VMEC++ run as initial state for a subsequent one, VMEC++ is initialized using the previously converged equilibrium. This can dramatically decrease runtimes when running on many similar magnetic configurations as it typically happens in stellarator optimization pipelines. On the flip side, some features of the original Fortran VMEC implementation are not yet available in VMEC++, such as support for non-stellarator-symmetric configurations. This contribution presents the internal numerics of the open-source VMEC++ package publicly for the first time.",
    "authors": [
      "Jonathan Schilling"
    ],
    "published": "2025-02-05T14:02:06Z",
    "updated": "2026-02-17T11:25:46Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.IM"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.15500v1",
    "url": "https://arxiv.org/abs/2602.15500v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15500v1.pdf",
    "title": "From Coils to Surface Recession: Fully Coupled Simulation of Ablation in ICP Wind Tunnels",
    "abstract": "This work presents a fully coupled, multiphysics computational framework for predicting the thermo-chemical material response of thermal protection systems in inductively coupled plasma (ICP) wind tunnels. The framework integrates a high-fidelity Navier-Stokes plasma solver, an electromagnetic field solver, and a discontinuous-Galerkin material response solver using a partitioned coupling strategy. This enables an ab initio, end-to-end simulation of the 350 kW Plasmatron X facility at the University of Illinois Urbana-Champaign (UIUC), including plasma generation, electromagnetic heating, near-wall thermochemistry, and time-accurate material ablation. The model captures key ICP physics such as vortex-mode recirculation, Joule-heating-driven plasma formation, and Lorentz-force-induced flow confinement, and accurately predicts the transition from subsonic to supersonic jet behavior at low pressures. Validation against cold-wall calorimetry and graphite ablation experiments shows that predicted stagnation-point heat fluxes fall well within experimental uncertainty, while fully coupled simulations accurately reproduce measured stagnation temperature histories and recession rates with errors below 12% and 10%, respectively. Remaining discrepancies during early transient heating are attributed to uncertainties in power-coupling efficiency, equilibrium ablation modeling, and material property datasets. Overall, the framework demonstrates strong predictive capability for ICP wind tunnel environments and provides a foundation for improved design, interpretation, and planning of hypersonic material testing campaigns.",
    "authors": [
      "Sanjeev Kumar",
      "Alessandro Munafo",
      "Blaine Vollmer",
      "Daniel J. Bodony",
      "Gregory S. Elliott",
      "Kelly A. Stephani",
      "Sean Kearney",
      "Marco Panesi"
    ],
    "published": "2026-02-17T11:13:00Z",
    "updated": "2026-02-17T11:13:00Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.09491v4",
    "url": "https://arxiv.org/abs/2510.09491v4",
    "pdf_url": "https://arxiv.org/pdf/2510.09491v4.pdf",
    "title": "Investigating Solid-Fluid Phase Coexistence in DC Plasma Bilayer Crystals: The Role of Particle Pairing and Mode Coupling",
    "abstract": "This article presents a detailed investigation of solid-fluid phase coexistence in a bilayer dusty plasma crystal subjected to varying confinement ring bias voltages in a DC glow discharge argon plasma. Melamine formaldehyde particles were employed to form a stable, hexagonally ordered bilayer crystal within a confinement ring electrically isolated from the grounded cathode. By systematically adjusting the confinement ring bias, a distinct phase coexistence emerged characterized by a fluid-like melted core surrounded by a solid crystalline periphery. Crucially, analysis of the phonon spectra revealed frequency shifts that deviate significantly from the predictions of classical monolayer Mode-Coupling Instability (MCI) theory. Stability analysis further demonstrated that dynamic interlayer particle pairing and the associated increase in non-reciprocal interaction strength are strongly correlated with the onset of structural destabilization. These findings highlight previously underappreciated mechanisms driving the melting transition in bilayer dusty plasmas, offering a more comprehensive understanding of phase behavior in complex plasma systems. The results underscore the importance of interlayer coupling and confinement effects in tuning structural transitions.",
    "authors": [
      "Siddhartha Mangamuri",
      "Lénaïc Couëdel",
      "Surabhi Jaiswal"
    ],
    "published": "2025-10-10T15:52:47Z",
    "updated": "2026-02-17T10:06:26Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1103/nxt3-qwj6"
  },
  {
    "arxiv_id": "2602.15450v1",
    "url": "https://arxiv.org/abs/2602.15450v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15450v1.pdf",
    "title": "Impact of front-end parameters of the ARCADIA MD3 on charged particle detection",
    "abstract": "The ARCADIA INFN R&D project developed a Fully Depleted Monolithic Active Pixel Sensor (FD-MAPS) using a customized LFoundry 110 nm CIS process. The first in-beam characterization of the ARCADIA Main Demonstrator 3 (MD3) sensor with 200 $μ$m active thickness has been performed at the Fermilab Test Beam Facility with a 120 GeV proton beam. The Device Under Test (DUT) is tested with a trigger-less telescope composed of two ARCADIA MD3 tracking planes. This early study investigates the effect of the front-end parameters on the tracking performance.",
    "authors": [
      "C. Pantouvakis",
      "S. Garbolino",
      "M. Rignanese",
      "P. Affleck",
      "A. Apresyan",
      "P. Azzi",
      "N. Bacchetta",
      "C. Bonini",
      "D. Chiappara",
      "S. Ciarlantini",
      "D. Falchieri",
      "A. Hayrapetyan",
      "S. Mattiazzo",
      "L. Pancheri",
      "D. Pantano",
      "A. Rivetti",
      "M. Rolo",
      "R. Santoro",
      "R. Turrisi",
      "J. Wyss",
      "S. Xie",
      "A. Zingaretti",
      "I. Zoi",
      "P. Giubilato"
    ],
    "published": "2026-02-17T09:33:25Z",
    "updated": "2026-02-17T09:33:25Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.05864v2",
    "url": "https://arxiv.org/abs/2511.05864v2",
    "pdf_url": "https://arxiv.org/pdf/2511.05864v2.pdf",
    "title": "Compressive multi-beam scanning transmission electron microscopy",
    "abstract": "We demonstrate a multi-beam scanning transmission electron microscopy (STEM) imaging that integrates down-sampling with super-resolution image reconstruction via a compressive sensing framework. A custom condenser aperture with six randomly positioned circular holes is employed to produce a multi-beam STEM probe, with the beam shape and distribution tuned through defocus. While the raw multi-beam images exhibit overlapping patterns, reconstruction using Adam optimization and total variation normalization yields high-fidelity images that closely reproduce the original sample structures, even from substantially down-sampled data. The proposed approach offers a pathway toward significant acceleration of such techniques through multibeam sparse sampling and computational reconstruction potentially useful for the analytical scanning methods in general.",
    "authors": [
      "Akira Yasuhara",
      "Takumi Sannomiya",
      "Ryoichi Horisaki"
    ],
    "published": "2025-11-08T05:37:33Z",
    "updated": "2026-02-17T09:09:58Z",
    "categories": [
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.15440v1",
    "url": "https://arxiv.org/abs/2602.15440v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15440v1.pdf",
    "title": "The First Instrumentally Documented Fall of an Iron Meteorite: atmospheric trajectory and ground impact",
    "abstract": "Iron meteorite falls are rare compared to stony meteorites, and until recently no iron meteorite had a reliably determined pre-atmospheric orbit. This changed on 2020 November 7, when a bright fireball was observed across Sweden and neighboring regions, with optical, acoustic, and seismic detections extending up to 665 km from the trajectory. After a month-long recovery effort, a 13.8 kg iron meteorite was discovered near Ådalen, representing the first instrumentally recorded and recovered fall of its type and the first iron meteorite with a derivable heliocentric orbit; the event also exhibited the lowest terminal height measured for a well-documented fireball. We combine optical, infrasound, and seismic data to reconstruct the luminous trajectory and employ a Monte Carlo model to simulate the dark flight phase and predicted strewn field, while also investigating the plausibility of a ricochet prior to final deposition. Our analysis identifies distinct aerodynamic properties of iron meteoroids compared to stony bodies, including the influence of streamlined shapes and deep regmaglypts on drag and flight stability, underscoring the need to incorporate iron-specific parameters into entry models to constrain atmospheric dynamics and improve recovery predictions for future events.",
    "authors": [
      "Jarmo Moilanen",
      "Maria Gritsevich",
      "Jaakko Visuri"
    ],
    "published": "2026-02-17T09:03:37Z",
    "updated": "2026-02-17T09:03:37Z",
    "categories": [
      "astro-ph.EP",
      "astro-ph.IM",
      "physics.geo-ph",
      "physics.ins-det",
      "physics.pop-ph"
    ],
    "primary_category": "astro-ph.EP"
  },
  {
    "arxiv_id": "2602.15431v1",
    "url": "https://arxiv.org/abs/2602.15431v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15431v1.pdf",
    "title": "Flux pumping and bifurcated relaxations of helical core in 3D magnetohydrodynamic modelling of ASDEX Upgrade plasmas",
    "abstract": "Flux pumping was achieved in recent hybrid scenario experiments in the ASDEX Upgrade (AUG) tokamak, which is characterized by a sawtooth-free helical quiescent state and the anomalous radial redistribution of toroidal current density and poloidal magnetic flux. In this article, the self-regulation mechanism of the AUG core plasma during flux pumping is investigated at realistic parameters using the JOREK code based on the two-temperature, nonlinear, full magnetohydrodynamic (MHD) model. A key milestone in AUG flux pumping modelling is achieved by quantitatively reproducing the clamped current density and safety factor profiles in the plasma core, demonstrating the effectiveness of the dynamo effect in sustaining the flux pumping state. The dynamo term, that is of particular interest, is primarily generated by the pressure-gradient driven m/n = 1/1 quasi-interchange-like MHD instability. The work systematically extrapolates the parameter regimes of flux pumping from the above AUG base case by scanning dissipation coefficients and plasma beta. The simulation results reveal bifurcated plasma behaviours at different Hartmann numbers, including distinct states such as flux pumping (helical core with a flat current density), sawteeth (periodic kink-cycling), single crash (without subsequent cycle), and quasi-stationary magnetic island (peaked current density). Transitions from marginal flux pumping state to sawteeth are observed in long-term simulations. The relationships between system dissipation, plasma beta, and different plasma states are carefully analyzed. For practical purposes, the potential operational window for flux pumping, as determined by plasma density and temperature, is estimated. The modelling efforts advance the understanding of flux pumping and facilitate the development of a fast surrogate model for efficient evaluation of flux pumping.",
    "authors": [
      "H. Zhang",
      "M. Hoelzl",
      "I. Krebs",
      "A. Burckhart",
      "A. Bock",
      "S. Guenter",
      "V. Igochine",
      "K. Lackner",
      "D. Bonfiglio",
      "E. Fable",
      "F. Stefanelli",
      "R. Ramasamy",
      "H. Zohm",
      "JOREK TEAM",
      "ASDEX UPGRADE TEAM"
    ],
    "published": "2026-02-17T08:52:36Z",
    "updated": "2026-02-17T08:52:36Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.15310v1",
    "url": "https://arxiv.org/abs/2602.15310v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15310v1.pdf",
    "title": "Compton imaging of undepleted volumes of germanium detectors",
    "abstract": "The shape of the undepleted volume of a p-type high-purity Broad Energy Germanium detector, dependent on the bias voltage, has been imaged by measuring spatially-resolved Compton-scattering efficiency. The bias voltage was raised stepwise from $-50\\,\\text{V}$ to the full-depletion voltage. The geometric acceptance was determined at full depletion. Below full depletion, the relative acceptance observed for $2\\times2\\times2\\,\\text{mm}^3$ voxels was used to create the image of the undepleted volume for each bias voltage. The images were used to extract the impurity density profile of the detector by fitting predictions of the open-source software package SolidStateDetectors$.$jl to the images. The result is shown and compared to the impurity density profile deduced from capacitance measurements. This is the first time that three-dimensional images of the undepleted volumes of a germanium detector have become available and have been used to deduce an impurity density profile.",
    "authors": [
      "Iris Abt",
      "Arthur Butorev",
      "Felix Hagemann",
      "David Hervas Aguilar",
      "Johanna Lührs",
      "Julia Penner",
      "Oliver Schulz"
    ],
    "published": "2026-02-17T02:33:33Z",
    "updated": "2026-02-17T02:33:33Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.15296v1",
    "url": "https://arxiv.org/abs/2602.15296v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15296v1.pdf",
    "title": "GPS constellation search for exotic physics messengers coincident with the binary neutron star merger GW170817",
    "abstract": "The Global Positioning System (GPS) includes a continuously operating, planet-scale network of atomic clocks that, beyond navigation and time dissemination, enables precision tests of fundamental physics. Here we use GPS carrier phase archival data to perform a retrospective search for exotic low-mass fields (ELFs) that might be emitted by the binary neutron-star merger GW170817, complementing gravitational wave and electromagnetic modalitiesnin multi-messenger astronomy. Such ultra-relativistic fields would imprint a dispersive, anti-chirp signature in clock-frequency time series, delayed with respect to the LIGO-Virgo gravitational wave detection. We construct network-median pseudo-frequency data from eighteen Rb satellite clocks referenced to a terrestrial hydrogen maser and conduct a template-bank search spanning ELF pulse duration, arrival delay, and characteristic frequency. No statistically significant signal is observed after accounting for noise statistics and template-bank trials. We derive 95\\% confidence-level lower bounds on the interaction energy scale $Λ_α$ of quadratic couplings driving variations in electromagnetic fine-structure constant. These limits improve upon existing astrophysical and gravity-test constraints across the ELF-energy range $\\approx10^{-18}$--$10^{-14}\\,\\mathrm{eV}$. This demonstrates that mature global satellite-clock networks provide an observational capability for retrospective, multi-messenger searches for new physics using decades of archival timing data.",
    "authors": [
      "Arko P. Sen",
      "Geoffrey Blewitt",
      "Andrey Sarantsev",
      "Paul Ries",
      "Andrei Derevianko"
    ],
    "published": "2026-02-17T01:40:17Z",
    "updated": "2026-02-17T01:40:17Z",
    "categories": [
      "astro-ph.IM",
      "astro-ph.HE",
      "physics.atom-ph",
      "physics.data-an",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2509.18532v3",
    "url": "https://arxiv.org/abs/2509.18532v3",
    "pdf_url": "https://arxiv.org/pdf/2509.18532v3.pdf",
    "title": "A Doppler backscattering diagnostic for the EXL-50U spherical tokamak: plasma considerations and preliminary quasioptical design",
    "abstract": "The EXL-50U spherical tokamak was built by Energy iNNovation to develop technologies for proton-boron fusion in spherical tokamaks (Liu et al., Phys. Plasmas 2024). We present a conceptual design of the Doppler backscattering (DBS) diagnostic for the EXL-50U spherical tokamak. DBS is a diagnostic capable of measuring plasma turbulence, which is especially important for transport in tokamaks. Starting from a set of physical design constraints, such as port window availability and in-vessel space, we used SCOTTY (Hall-Chen et al., PPCF 2022), an in-house beam tracing code, to predict the location of the cutoffs and the corresponding scattering wavenumbers for several EXL-50U plasma scenarios. We find that we are able to measure scattering locations of 0.15 $<$ $ρ$ $<$ 1, with corresponding turbulent wavenumbers of 2.47 cm$^{-1}$$<$ $k_{\\perp}$ $<$ 9.49 cm$^{-1}$. Here, $ρ$ is the normalised radial coordinate of the scattering location, and $k_{\\perp}$ is the corresponding turbulent wavenumber. We then determine the optimal toroidal launch angles to ensure that the probe beam's wavevector is perpendicular to the magnetic field at the cutoff location, thereby maximising the backscattered signal. This matching is crucial due to the EXL-50U's high magnetic pitch angle, $\\sim35^{\\circ}$ at the outboard midplane. Given our results, we propose the use of toroidal steering and tunable frequency channels to ensure beams are well-matched with the magnetic pitch angle. We propose a quasioptical system that covers the U-band range (40--60 GHz).",
    "authors": [
      "Ying Hao Matthew Liang",
      "Valerian Hongjie Hall-Chen",
      "Terry L. Rhodes",
      "Yumin Wang",
      "Yihang Zhao"
    ],
    "published": "2025-09-23T01:54:04Z",
    "updated": "2026-02-17T00:50:37Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.25423v2",
    "url": "https://arxiv.org/abs/2509.25423v2",
    "pdf_url": "https://arxiv.org/pdf/2509.25423v2.pdf",
    "title": "Electropolishing-Induced Topographic Defects in Niobium: Insights and Implications for Superconducting Radio Frequency Applications",
    "abstract": "Electropolishing is the premier surface preparation method for high-Q, high-gradient superconducting RF cavities made of Nb. This leaves behind an apparently smooth surface, yet the achievable peak magnetic fields fall well below the superheating field of Nb, in most cases. In this work, the ultimate surface finish of electropolishing was investigated by studying its effect on highly polished Nb samples. Electropolishing introduces high slope angle sloped-steps at grain boundaries. The magnetic field enhancement and superheating field suppression factors associated with such a geometry are calculated in the London theory. Despite the by-eye smoothness of electropolished Nb, such defects compromise the stability of the low-loss Meissner state, likely limiting the achievable peak accelerating fields in superconducting RF cavities. Finally, the impact of surface roughness on impurity diffusion is investigated which can link surface roughness to the effectiveness of heat treatments like low-temperature baking or nitrogen infusion in the vortex nucleation or hydride hypotheses. Surface roughness tends to decrease the effective dose of impurities as a result of the expansion of impurities into regions with greater internal angle. The effective dose of impurities can be protected by minimizing slope angles and step heights, ensuring uniformity.",
    "authors": [
      "Oleksandr Hryhorenko",
      "Anne-Marie Valente-Feliciano",
      "Eric M. Lechner"
    ],
    "published": "2025-09-29T19:31:12Z",
    "updated": "2026-02-16T22:54:04Z",
    "categories": [
      "cond-mat.supr-con",
      "cond-mat.mtrl-sci",
      "physics.acc-ph",
      "physics.app-ph"
    ],
    "primary_category": "cond-mat.supr-con",
    "doi": "10.1088/1361-6668/ae40a3"
  },
  {
    "arxiv_id": "2602.15223v1",
    "url": "https://arxiv.org/abs/2602.15223v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15223v1.pdf",
    "title": "Systematic study of high performance GeSn photodiodes with thick absorber for SWIR and extended SWIR detection",
    "abstract": "Germanium-tin (GeSn) photodiodes potentiate a viable solution to integrate SWIR and extended SWIR detection technology into CMOS processing line. However, challenges in the growth of thick, high quality GeSn limit the device absorber thickness, making it impossible to ascertain the performance limit of GeSn photodiodes. An in-depth understanding of their device physics and a clear optimization pathway towards commercial-grade devices remain elusive. This work presents a systematic empirical study of GeSn photodiodes with thick absorber (2 to 8% Sn content, up to 2630 nm thick), showing high responsivity up to 0.59 A.W-1 at 1.55 μm and 0.43 A.W-1 at 2 μm wavelengths, low dark current density down to 2 x 10-2 A.cm-2, and high detection cutoff wavelengths up to 2.1 and 2.5 μm at 5% and 8% Sn, respectively. Using specific doping design (P-i-N and N-i-P), an in-depth analysis is presented on the impact of junction position, p-type background carrier concentration, bulk/ surface defects and photocarrier diffusion length - on photodetection performance. Different optimization strategies for GeSn photodiodes, in particular at high Sn content, are proposed.",
    "authors": [
      "Quang Minh Thai",
      "Rajesh Kumar",
      "Abdulla Said Ali",
      "Justin Rudie",
      "Steven Akwabli",
      "Yunsheng Qiu",
      "Mourad Benamara",
      "Hryhorii Stanchu",
      "Kushal Dahal",
      "Xuehuan Ma",
      "Sudip Acharya",
      "Chun-Chieh Chang",
      "Gregory T. Forcherio",
      "Bruce Claflin",
      "Wei Du",
      "Shui-Qing Yu"
    ],
    "published": "2026-02-16T22:06:10Z",
    "updated": "2026-02-16T22:06:10Z",
    "categories": [
      "physics.ins-det",
      "physics.app-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.15205v1",
    "url": "https://arxiv.org/abs/2602.15205v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15205v1.pdf",
    "title": "Basics of RF Electronics",
    "abstract": "The focus of this educational text is selected examples of high-frequency electronic circuits and their components employed for the accurate phasing and synchronisation of accelerator cavities. Examples have been chosen to describe the basics of RF electronics. The starting point is transmission lines, connectors, discontinuities, and the handling of reflection. The application of simple surface mount components is discussed. The use of the Kuroda identities for converting lumped circuit designs to printed circuit designs is demonstrated. The accelerator example used to demonstrate the use of components is a circuit designed for the synchronisation of the CLIC crab cavities. This example employs co-planar waveguide, SMA connectors, Wilkinson splitters, and surface-mount double-balanced mixers. For the control of cavity phase and amplitude, the benefit of I&Q controllers will be explained. The text will then discuss the operation and use of I&Q modulators and VCOs.",
    "authors": [
      "Amos Christopher Dexter"
    ],
    "published": "2026-02-16T21:35:42Z",
    "updated": "2026-02-16T21:35:42Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.15130v1",
    "url": "https://arxiv.org/abs/2602.15130v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15130v1.pdf",
    "title": "Code-Verification Techniques for Particle-in-Cell Simulations with Direct Simulation Monte Carlo Collisions",
    "abstract": "Particle-in-cell methods with stochastic collision models are commonly used to simulate collisional plasma dynamics, with applications ranging from hypersonic flight to semiconductor manufacturing. Code verification of such methods is challenging due to the interaction between the spatial- and temporal-discretization errors, the statistical sampling noise, and the stochastic nature of the collision algorithm. In this paper, we introduce our code-verification approaches to apply the method of manufactured solutions to plasma dynamics, and we derive expected convergence rates for the different sources of discretization and statistical error. For the particles, we incorporate the method of manufactured solutions into the equations of motion. We manufacture the particle distribution function and inversely query the cumulative distribution function to obtain known particle positions and velocities at each time step. In doing so, we avoid modifying the particle weights, eliminating risks from potentially negative weights or modifications to weight-dependent collision algorithms. For the collision algorithm, we average independent outcomes at each time step and we derive a corresponding manufactured source term for the velocity change for each particle. By having known solutions for the particle positions and velocities, we are able to compute the error in these quantities directly instead of attempting to compute differences in distribution functions. These approaches are equally valid for particle-in-cell simulations with Monte Carlo collisions and direct simulation Monte Carlo simulations of neutral gas flows. We demonstrate the effectiveness of our approaches in three dimensions for different couplings between the particles and field, with and without binary elastic collisions, and with and without coding errors.",
    "authors": [
      "Brian A. Freno",
      "William J. McDoniel",
      "Christopher H. Moore",
      "Neil R. Matula"
    ],
    "published": "2026-02-16T19:19:34Z",
    "updated": "2026-02-16T19:19:34Z",
    "categories": [
      "physics.comp-ph",
      "math.NA",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.comp-ph"
  },
  {
    "arxiv_id": "2602.15118v1",
    "url": "https://arxiv.org/abs/2602.15118v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15118v1.pdf",
    "title": "Real-time graph neural networks on FPGAs for the Belle II electromagnetic calorimeter",
    "abstract": "We present the development and evaluation of a real-time Graph Neural Network-based trigger for the electromagnetic calorimeter of the Belle II experiment at the SuperKEKB collider. The algorithm processes calorimeter trigger cells as graph nodes to perform clustering, feature extraction, and per-cluster signal classification with deterministic latency compatible with the first-level trigger readout system. The model predicts cluster positions and energies and provides a signal classification score, enabling a more flexible clustering strategy than the baseline trigger algorithm. Implemented on an FPGA and integrated into the Belle II trigger chain for synchronous operation, the system sustains the 8 MHz trigger throughput with an end-to-end latency of 3.168 $μ$s. The performance is evaluated using simulated events and collision data. The energy resolution is comparable to the baseline trigger, while the position resolution for high-energy clusters improves by up to 18 percent in the central detector region. Cluster purity increases by up to 20 percent at low energies for isolated clusters, and cluster efficiency improves by up to 20 percent for overlapping clusters. The signal classifier enables additional background suppression at fixed signal retention. These results demonstrate the first operation of a Graph Neural Network-based reconstruction system implemented on FPGAs within the real-time trigger readout path of a collider experiment.",
    "authors": [
      "I. Haide",
      "M. Neu",
      "Y. Unno",
      "T. Justinger",
      "V. Dajaku",
      "F. Baptist",
      "T. Lobmaier",
      "J. Becker",
      "T. Ferber",
      "H. Bae",
      "A. Beaubien",
      "J. Eppelt",
      "R. Giordano",
      "G. Heine",
      "T. Koga",
      "Y. -T. Lai",
      "K. Miyabayashi",
      "H. Nakazawa",
      "M. Remnev",
      "L. Reuter",
      "K. Unger",
      "R. van Tonder"
    ],
    "published": "2026-02-16T19:00:16Z",
    "updated": "2026-02-16T19:00:16Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.15879v2",
    "url": "https://arxiv.org/abs/2508.15879v2",
    "pdf_url": "https://arxiv.org/pdf/2508.15879v2.pdf",
    "title": "Hypothesis of a bi-isotropic-like plasma permeating the interstellar space",
    "abstract": "In this work, we study the propagation of electromagnetic waves in a magnetized chiral plasma that pervades the interstellar space. The Maxwell equations, supplemented by bi-isotropic-like constitutive relations, are rewritten to describe a cold, uniform, and collisionless plasma model that yields new collective electromagnetic modes for distinct pairs of refractive indices associated with right- and left-handed circularly polarized waves. We have investigated the optical behavior through the rotatory power (RP) and dichroism coefficient, reporting that the finite chiral parameter induces double RP sign reversal, an exotic optical signature that takes place in chiral dielectrics and rotating plasmas. In the low-frequency regime, a modified propagating helicon with right-handed circular polarization is obtained. Next, supposing that the interstellar medium behaves as a chiral bi-isotropic-like cold plasma, we employ Astrophysical data of radio pulsars to achieve upper limits on the magnetoelectric parameters magnitude. In particular, by using dispersion measure and rotation measure data from five pulsars, we constrain the magnitude of the chiral parameter to the order of $10^{-16}$ and $10^{-22}$, respectively.",
    "authors": [
      "Filipe S. Ribeiro",
      "Pedro D. S. Silva",
      "Rodolfo Casana",
      "Manoel M. Ferreira"
    ],
    "published": "2025-08-21T14:38:46Z",
    "updated": "2026-02-16T17:18:54Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE",
    "doi": "10.1103/47sj-7m3c"
  },
  {
    "arxiv_id": "2602.14918v1",
    "url": "https://arxiv.org/abs/2602.14918v1",
    "pdf_url": "https://arxiv.org/pdf/2602.14918v1.pdf",
    "title": "Data-driven modeling of shock physics by physics-informed MeshGraphNets",
    "abstract": "High-resolution fluid simulations for plasma physics and astrophysics rely on Particle in cell (PIC) and hydrodynamic solvers (e.g., FLASH) to resolve shock dominated, multiscale phenomena, but their high computational cost severely limits scalability. This motivates the development of learning based surrogate models, which offer a promising route to accelerate these simulations while preserving physical fidelity. In this work, we study the Sedov Taylor shock propagation problem using a physics informed graph based surrogate model, Physics Informed MeshGraphNet (PhyMGN), designed for grid-based hydrodynamics. By incorporating weak physics constraints derived from the Euler equations using finite difference method, the model captures the self similar shock evolution and associated flow structures without explicitly solving the full hydrodynamic equations at each timestep. Comparing to the baseline MeshGraphNet model, PhyMGN is able to generalize beyond the training regime with a higher accuracy and preserves differentiability in parameter space while achieving a substantial reduction in computational cost relative to conventional numerical solvers.",
    "authors": [
      "S. Zhang",
      "M. Mallon",
      "M. Luo",
      "J. Thiyagalingam",
      "P. Tzeferacos",
      "R. Bingham",
      "G. Gregori"
    ],
    "published": "2026-02-16T16:53:51Z",
    "updated": "2026-02-16T16:53:51Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.14900v1",
    "url": "https://arxiv.org/abs/2602.14900v1",
    "pdf_url": "https://arxiv.org/pdf/2602.14900v1.pdf",
    "title": "Review of prototypes developed in a 65 nm CMOS imaging technology in view of vertexing applications at a future lepton collider",
    "abstract": "The OCTOPUS project addresses the development and characterization of monolithic active pixel sensors in the TPSCo 65 nm ISC technology in view of vertexing applications at a future lepton collider. Meeting the corresponding requirements -- outlined in the ECFA detector road map -- will necessitate the simulation, design, and testing of prototypes and a demonstrator chip in this very process.   This work reviews the literature on existing prototypes, summarizing their design characteristics, properties, and performance in charged-particle detection, and provides an overview of previous simulation efforts. The presented results suggest the feasibility of the endeavor while showcasing challenges, the need for further investigations, and providing a foundation for imminent design choices.",
    "authors": [
      "Finn King",
      "Matthew Lewis Franks",
      "Yajun He",
      "Gianpiero Vignola",
      "Simon Spannagel",
      "Malte Backhaus",
      "Auguste Besson",
      "Dominik Dannheim",
      "Andrei Dorokhov",
      "Ingrid-Maria Gregor",
      "Fadoua Guezzi-Messaoud",
      "Lennart Huth",
      "Armin Ilg",
      "Zdenko Janoska",
      "Monika Kuncova",
      "Anna Macchiolo",
      "Frédéric Morel",
      "Sara Ruiz Daza",
      "Roberto Russo",
      "Judith Schlaadt",
      "Serhiy Senyukov",
      "Peter Švihra",
      "Anastasiia Velyka",
      "Håkan Wennlöf"
    ],
    "published": "2026-02-16T16:36:12Z",
    "updated": "2026-02-16T16:36:12Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.14870v1",
    "url": "https://arxiv.org/abs/2602.14870v1",
    "pdf_url": "https://arxiv.org/pdf/2602.14870v1.pdf",
    "title": "Application of RFSoC Technology for Beam Position Monitors at the SuperKEKB Storage Rings Injection Points",
    "abstract": "In order to achieve its ambitious luminosity target, the SuperKEKB collider must achieve and sustain high beam currents on the order of Ampere in its storage rings. This requires continuous top-up injection and operation with a two-bunch injection scheme, injecting two 96 ns spaced bunches in a single injection cycle. An important input for tuning the injection beam is the position reading from a dedicated beam position monitor (BPM), located after the septum magnets, slightly upstream of where the injected and stored beams converge. Previously, the readout electronics used for these special BPMs were not capable of independent measurement of both bunches in the two-bunch injection mode and modification of the concerned devices and their firmware was not feasible. The opportunity was taken to develop a new readout device based on the AMD/Xilinx RF System on a Chip (RFSoC) platform with the goal of not only providing a sufficiently flexible and performant readout solution for the concerned BPMs, but also to evaluate and gain experience with the platform for beam monitor electronics applications. This paper is concerned with the details of this development as well as evaluation and operation of the developed device.",
    "authors": [
      "B. Urbschat",
      "G. Mitsuka",
      "L. Ruckman"
    ],
    "published": "2026-02-16T16:02:20Z",
    "updated": "2026-02-16T16:02:20Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.14836v1",
    "url": "https://arxiv.org/abs/2602.14836v1",
    "pdf_url": "https://arxiv.org/pdf/2602.14836v1.pdf",
    "title": "Asymmetry in laser wakefields driven by intense pulses",
    "abstract": "Laser wakefield theories rely on the laser envelope function, which is radially symmetric, and predict zero transverse momentum for the electrons along the propagation axis. Exact description of laser wakefields, beyond the envelope approximation, requires a more general formula for the Lorentz force acting on the electrons. Here we present a fundamental approach to express the transverse momentum of an electron crossing the laser pulse, and we show that an exact analytical formula can be derived for the non-zero transverse momentum of electrons initially lying along the axis of symmetry. The results outlined here shed light on the details of the electron motion inside an intense laser pulse and explain the strong wakefield asymmetry observed in simulations.",
    "authors": [
      "Zsolt Lécz",
      "Szilárd Majorosi"
    ],
    "published": "2026-02-16T15:27:15Z",
    "updated": "2026-02-16T15:27:15Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.04270v2",
    "url": "https://arxiv.org/abs/2511.04270v2",
    "pdf_url": "https://arxiv.org/pdf/2511.04270v2.pdf",
    "title": "Advancements and future expansions of the Caribou DAQ system",
    "abstract": "Caribou is a versatile data acquisition (DAQ) system developed within several collaborative frameworks (CERN EP R&D, DRD3, AIDAinnova, and Tangerine) to support laboratory and test-beam characterization of novel silicon pixel detectors. It combines a custom Control and Readout (CaR) board with a Xilinx Zynq System-on-Chip (SoC) running project-wide shared firmware and software stacks. The system architecture emphasizes reusability, flexibility, and ease of integration. The CaR board provides essential interfaces such as programmable power supplies, voltage and current references, high-speed ADCs, and configurable I/O lines for detector control and readout. The SoC runs an embedded Linux distribution built with PetaLinux and integrates two main components: Peary, a C++ embedded DAQ application providing hardware abstraction, configuration management, logging, and multi-device control through Command Line (CLI) and Python interfaces; and Boreal, a common Caribou FPGA firmware framework offering reusable modules and automated build workflows for user-specific bit files. The next major milestone in Caribou's evolution is the transition to version 2.0, based on a Zynq UltraScale+ System-on-Module (SoM) architecture. This paper presents the recent progress and future prospects of the project and describes recent hardware, firmware, and software developments preparing the system for the upcoming CaR board v2.0.",
    "authors": [
      "Younes Otarid",
      "Mathieu Benoit",
      "Eric Buschmann",
      "Hucheng Chen",
      "Dominik Dannheim",
      "Ilias Kamoisis",
      "Thomas Koffas",
      "Ryan St-Jean",
      "Simon Spannagel",
      "Shaochun Tang",
      "Tomas Vanat",
      "Changbum You"
    ],
    "published": "2025-11-06T11:05:48Z",
    "updated": "2026-02-16T15:23:36Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.14824v1",
    "url": "https://arxiv.org/abs/2602.14824v1",
    "pdf_url": "https://arxiv.org/pdf/2602.14824v1.pdf",
    "title": "Experimental Validation of HomHBFEM Simulations of Fast Corrector Magnets for PETRA IV",
    "abstract": "This paper presents experimental validation of the homogenized harmonic balance finite element method (HomHBFEM), which we have developed as a dedicated simulation technique for magnets with fast excitation cycles, in particular the fast corrector (FC) magnets for PETRA IV at DESY. The HomHBFEM allows efficient three-dimensional nonlinear eddy-current simulations of laminated magnets at elevated frequencies with a relatively coarse finite element (FE) mesh and without computationally expensive time-stepping. This is achieved by combining a frequency-domain-based homogenization technique with the harmonic balance FE method. The simulation results for the magnetic flux density along the axis of the FC magnets as a function of frequency and the resulting integrated transfer function (ITF) are compared to Hall probe and search coil measurements of the first prototype FC magnet for PETRA IV. A good agreement between simulated and measured ITFs is achieved for excitation frequencies from 10 Hz to 10 kHz.",
    "authors": [
      "Jan-Magnus Christmann",
      "Laura Anna Maria D'Angelo",
      "Herbert De Gersem",
      "Sven Pfeiffer",
      "Sajjad Hussain Mirza",
      "Adeel Amjad",
      "Lucas Rousselange",
      "Matthias Thede"
    ],
    "published": "2026-02-16T15:16:14Z",
    "updated": "2026-02-16T15:16:14Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.14810v1",
    "url": "https://arxiv.org/abs/2602.14810v1",
    "pdf_url": "https://arxiv.org/pdf/2602.14810v1.pdf",
    "title": "Excavation of a 69-m diameter and 94-m high cavern for the Hyper-Kamiokande detector",
    "abstract": "The excavation of the Hyper-Kamiokande cavern, 600 m underground, is complete. Measuring 69 m in diameter and 94 m in height, it is among the world's largest rock caverns. A vertically oriented, dome-capped cylindrical design was chosen to optimize cost and performance. Combined with substantial overburden, the geometry posed major engineering challenges. This paper outlines the underground works, main cavern design, excavation plan, and the evolution of support design and construction methods during excavation, namely the information-based (observational) design and construction approach.",
    "authors": [
      "Y. Asaoka",
      "H. Tanaka",
      "S. Nakayama",
      "K. Abe",
      "K. Ishita",
      "S. Moriyama",
      "M. Shiozawa",
      "K. Horinokuchi",
      "C. Miura",
      "Y. Suzuki",
      "H. Morioka",
      "D. Inagaki",
      "H. Kurose",
      "T. Suido",
      "T. Kobuchi",
      "M. Tobita",
      "M. Utsuno"
    ],
    "published": "2026-02-16T15:02:11Z",
    "updated": "2026-02-16T15:02:11Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.01875v3",
    "url": "https://arxiv.org/abs/2510.01875v3",
    "pdf_url": "https://arxiv.org/pdf/2510.01875v3.pdf",
    "title": "Enhancing the Efficiency of Time-Dependent Density Functional Theory Calculations of Dynamic Response Properties",
    "abstract": "X-ray Thomson scattering (XRTS) constitutes an essential technique for diagnosing material properties under extreme conditions, such as high pressures and intense laser heating. Time-dependent density functional theory (TDDFT) is one of the most accurate available ab initio methods for modeling XRTS spectra, as well as a host of other dynamic material properties. However, strong thermal excitations, along with the need to account for variations in temperature and density as well as the finite size of the detector significantly increase the computational cost of TDDFT simulations compared to ambient conditions. In this work, we present a broadly applicable method for optimizing and enhancing the efficiency of TDDFT calculations. Our approach is based on a one-to-one mapping between the dynamic structure factor and the imaginary time density--density correlation function, which naturally emerges in Feynman's path integral formulation of quantum many-body theory. Specifically, we combine rigorous convergence tests in the imaginary time domain with a constraints-based attenuation of narrow-band fluctuations to improve the efficiency of TDDFT modeling without the introduction of any significant bias. As a result, we can report a speed-up by up to an order of magnitude, thus substantially reducing the burden of computational cost required for XRTS analysis.",
    "authors": [
      "Zhandos A. Moldabekov",
      "Sebastian Schwalbe",
      "Uwe Hernandez Acosta",
      "Thomas Gawne",
      "Jan Vorberger",
      "Michele Pavanello",
      "Tobias Dornheim"
    ],
    "published": "2025-10-02T10:31:46Z",
    "updated": "2026-02-16T15:00:09Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.chem-ph",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2602.07305v2",
    "url": "https://arxiv.org/abs/2602.07305v2",
    "pdf_url": "https://arxiv.org/pdf/2602.07305v2.pdf",
    "title": "Split-Post Microwave Displacement Transducer with Quadratic Readout",
    "abstract": "We investigate a microwave cavity-based displacement readout employing a split-post geometry for measuring the motion of a dielectric membrane. The cavity response to membrane displacement is predominantly quadratic when the membrane is positioned at the centre of the posts. We characterise this behaviour by driving the membrane piezo electrically at both central and off-centre positions and calibrating the displacement using an independent interferometric measurement. The calibration reveals a linear coupling between the membrane displacement and the applied drive voltage, while the microwave response follows the static displacement dependence. When the membrane is driven at the centre, the system exhibits the highest displacement-to-voltage sensitivity and the largest quadratic output. As the membrane is moved away from the centre, the response gradually transitions from quadratic to linear. There is a difference of ~ 97 $\\%$ in the quadratic coefficient from the central position and a difference of ~ 92 $\\%$ in the linear coefficient from the off-centre position. This controllable crossover between quadratic and linear coupling is a key requirement for sensors capable of resolving energy quantisation. It establishes this platform as a promising candidate for a microwave-mechanical quantum transducer.",
    "authors": [
      "Sonali Parashar",
      "Jeremy F. Bourhill",
      "Maxim Goryachev",
      "Michael E. Tobar"
    ],
    "published": "2026-02-07T01:41:37Z",
    "updated": "2026-02-16T13:29:20Z",
    "categories": [
      "physics.ins-det",
      "physics.app-ph",
      "quant-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.14734v1",
    "url": "https://arxiv.org/abs/2602.14734v1",
    "pdf_url": "https://arxiv.org/pdf/2602.14734v1.pdf",
    "title": "An x-ray regenerative amplifier free-electron laser with a step-tapered-undulator",
    "abstract": "Regenerative amplifier x-ray free-electron lasers constitute alternative configurations for fourth generation light sources which are typically operated in self-amplified spontaneous emission (SASE) mode. However, SASE exhibits relatively large fluctuations in the power and spectral properties from shot to shot, whereas XRAFELs provide a much more stable source of hard x-ray photons. Here, we study the performance of an x-ray cavity under consideration at the Stanford Linear Accelerator Facility using both uniform and step-tapered undulators with either transmissive or hole out-coupling.",
    "authors": [
      "Henry P. Freund",
      "P. J. M. van der Slot",
      "P. G. O'Shea"
    ],
    "published": "2026-02-16T13:24:55Z",
    "updated": "2026-02-16T13:24:55Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.15084v1",
    "url": "https://arxiv.org/abs/2602.15084v1",
    "pdf_url": "https://arxiv.org/pdf/2602.15084v1.pdf",
    "title": "TokaMind: A Multi-Modal Transformer Foundation Model for Tokamak Plasma Dynamics",
    "abstract": "We present TokaMind, an open-source foundation model framework for fusion plasma modeling, based on a Multi-Modal Transformer (MMT) and trained on heterogeneous tokamak diagnostics from the publicly available MAST dataset. TokaMind supports multiple data modalities (time-series, 2D profiles, and videos) with different sampling rates, robust missing-signal handling, and efficient task adaptation via selectively loading and freezing four model components. To represent multi-modal signals, we use a training-free Discrete Cosine Transform embedding (DCT3D) and provide a clean interface for alternative embeddings (e.g., Variational Autoencoders - VAEs). We evaluate TokaMind on the recently introduced MAST benchmark TokaMark, comparing training and embedding strategies. Our results show that fine-tuned TokaMind outperforms the benchmark baseline on all but one task, and that, for several tasks, lightweight fine-tuning yields better performance than training the same architecture from scratch under a matched epoch budget. These findings highlight the benefits of multi-modal pretraining for tokamak plasma dynamics and provide a practical, extensible foundation for future fusion modeling tasks. Training code and model weights will be made publicly available.",
    "authors": [
      "Tobia Boschi",
      "Andrea Loreti",
      "Nicola C. Amorisco",
      "Rodrigo H. Ordonez-Hurtado",
      "Cécile Rousseau",
      "George K. Holt",
      "Eszter Székely",
      "Alexander Whittle",
      "Samuel Jackson",
      "Adriano Agnello",
      "Stanislas Pamela",
      "Alessandra Pascale",
      "Robert Akers",
      "Juan Bernabe Moreno",
      "Vassil Alexandrov",
      "Mykhaylo Zayats"
    ],
    "published": "2026-02-16T12:26:07Z",
    "updated": "2026-02-16T12:26:07Z",
    "categories": [
      "physics.plasm-ph",
      "cs.AI",
      "cs.LG"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.05649v2",
    "url": "https://arxiv.org/abs/2509.05649v2",
    "pdf_url": "https://arxiv.org/pdf/2509.05649v2.pdf",
    "title": "Hanbury Brown-Twiss interference with massively parallel spectral multiplexing for broadband light",
    "abstract": "Two-photon interference is a fundamental resource for quantum technologies and optical quantum computing, underpinning precision measurements, scalable entanglement distribution, and the operation of photonic circuits and quantum network protocols. Here, we report the first demonstration of massively parallel, wavelength-resolved photon bunching, revealing Hanbury Brown-Twiss correlations across 100 independent spectral channels. These observations are enabled by a fast, data-driven single-photon spectrometer that achieves 40 pm spectral and 40 ps temporal resolution over a 10 nm bandwidth, providing simultaneous access to spectro-temporal photon correlations without the need for narrowband filtering. This approach preserves photon flux while enabling high-dimensional quantum interference measurements across a broad spectrum. Our results establish frequency-multiplexed two-photon interference as a scalable and throughput-efficient platform for quantum-enhanced photonic technologies, offering a practical route toward room-temperature architectures that overcome loss limitations and advance the scalability for a variety of applications.",
    "authors": [
      "Sergei Kulkov",
      "Ondrej Matousek",
      "Lou-Ann Pestana De Sousa",
      "Lada Radmacherova",
      "Dmitrij Sevaev",
      "Yuri Kurochkin",
      "Stephen Vintskevich",
      "Ermanno Bernasconi",
      "Claudio Bruschini",
      "Tommaso Milanese",
      "Edoardo Charbon",
      "Peter Svihra",
      "Andrei Nomerotski"
    ],
    "published": "2025-09-06T09:00:49Z",
    "updated": "2026-02-16T11:28:42Z",
    "categories": [
      "quant-ph",
      "physics.ins-det"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2602.12969v2",
    "url": "https://arxiv.org/abs/2602.12969v2",
    "pdf_url": "https://arxiv.org/pdf/2602.12969v2.pdf",
    "title": "Role of the radial electric field in the confinement of energetic ions in the Wendelstein 7-X stellarator",
    "abstract": "Good fast-ion confinement is an essential requirement for a fusion reactor. The magnetic configuration of the Wendelstein 7-X (W7-X) stellarator is partially optimized in this regard in a reactor-relevant scenario: it is expected to show improved fast-ion confinement when $β$ is high and the effect of the radial electric field is negligible. The experimental validation of this optimization is difficult since, with the available power, achieving high $β$ under appropriate conditions for the validation is challenging and the effect of the radial electric field is inevitable. In this work, the confinement of fast ions in W7-X has been studied numerically for a variety of scenarios via the ASCOT5 code. The effect of the radial electric field on fast-ion losses is confirmed to be equivalent to the one produced by $β$, and this is characterized by means of scans on both parameters. Through a preliminary study with experimentally-based profiles, a viable scenario is identified that takes advantage of this effect for the experimental validation of the optimization strategy of W7-X.",
    "authors": [
      "M. Arranz",
      "J. L. Velasco",
      "I. Calvo",
      "D. Carralero"
    ],
    "published": "2026-02-13T14:43:01Z",
    "updated": "2026-02-16T10:24:27Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.01504v3",
    "url": "https://arxiv.org/abs/2602.01504v3",
    "pdf_url": "https://arxiv.org/pdf/2602.01504v3.pdf",
    "title": "First Experimental Demonstration of Beam Storage by Three-Dimensional Spiral Injection Scheme for Ultra-Compact Storage Rings",
    "abstract": "Three-dimensional spiral injection enables beam storage in ultra-compact rings with nanosecond revolution periods. We report first storage of a $297 \\, \\mathrm{keV/}c$ electron beam in a $22 \\,\\mathrm{cm}$ weak-focusing ring with a $4.7\\,\\mathrm{ns}$ revolution period using a $140\\,\\mathrm{ns}$ kicker pulse. A scintillating-fiber detector observes signals $>5σ$ above noise for $\\geq 1\\, \\mathrm{μs}$, and varying the weak-focusing field potential shifts the stored-beam region, consistent with Monte Carlo predictions, validating beam storage. This proof-of-principle opens a path to ultra-compact storage rings for next-generation precision measurements.",
    "authors": [
      "R. Matsushita",
      "H. Iinuma",
      "S. Ohsawa",
      "H. Nakayama",
      "K. Furukawa",
      "S. Ogawa",
      "N. Saito",
      "T. Mibe",
      "M. A. Rehman"
    ],
    "published": "2026-02-02T00:33:47Z",
    "updated": "2026-02-16T09:32:25Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  }
]