{
  "arxiv_id": "2302.12180v3",
  "url": "https://arxiv.org/abs/2302.12180v3",
  "pdf_url": "https://arxiv.org/pdf/2302.12180v3.pdf",
  "title": "Development of advanced photon calibrator for Kamioka gravitational wave   detector (KAGRA)",
  "abstract": "The Kamioka Gravitational wave detector (KAGRA) cryogenic gravitational-wave observatory has commenced joint observations with the worldwide gravitational wave detector network. Precise calibration of the detector response is essential for accurately estimating parameters of gravitational wave sources. A photon calibrator is a crucial calibration tool used in laser interferometer gravitational-wave observatory, Virgo, and KAGRA, and it was utilized in joint observation 3 with GEO600 in Germany in April 2020. In this paper, KAGRA implemented three key enhancements: a high-power laser, a power stabilization system, and remote beam position control. KAGRA employs a 20 W laser divided into two beams that are injected onto the mirror surface. By utilizing a high-power laser, the response of the detector at kHz frequencies can be calibrated. To independently control the power of each laser beam, an optical follower servo was installed for power stabilization. The optical path of the photon calibrator beam positions was controlled using pico-motors, allowing for the characterization of the detector rotation response. Additionally, a telephoto camera and quadrant photodetectors were installed to monitor beam positions, and beam position control was implemented to optimize the mirror response. In this paper, we discuss the statistical errors associated with the measurement of relative power noise. We also address systematic errors related to the power calibration model of the photon calibrator and the simulation of elastic deformation effects using finite element analysis. Ultimately, we have successfully reduced the total systematic error from the photon calibrator to 2.0 /%.",
  "authors": [
    "Y. Inoue",
    "B. H. Hsieh",
    "K. H. Chen",
    "Y. K. Chu",
    "K. Ito",
    "C. Kozakai",
    "T. Shishido",
    "Y. Tomigami",
    "T. Akutsu",
    "S. Haino",
    "K. Izumi",
    "T. Kajita",
    "N. Kanda",
    "C. S. Lin",
    "F. K. Lin",
    "Y. Moriwaki",
    "W. Ogaki",
    "H. F. Pang",
    "T. Sawada",
    "T. Tomaru",
    "T. Suzuki",
    "S. Tsuchida",
    "T. Ushiba",
    "T. Washimi",
    "T. Yamamoto",
    "T. Yokozawa"
  ],
  "published": "2023-02-23T17:23:01Z",
  "updated": "2025-09-27T08:18:41Z",
  "categories": [
    "astro-ph.IM",
    "physics.ins-det"
  ],
  "primary_category": "astro-ph.IM",
  "doi": "10.1063/5.0147888"
}