{
  "arxiv_id": "2504.03548v2",
  "url": "https://arxiv.org/abs/2504.03548v2",
  "pdf_url": "https://arxiv.org/pdf/2504.03548v2.pdf",
  "title": "Calculation and comparison of sensitivities in $0νββ$   experiments based on key parameters",
  "abstract": "Worldwide efforts are underway to detect neutrinoless double beta ($0\\nu\\beta\\beta$) decay using experiments based on various technologies and target isotopes. Future experiments in this regard aim to exclude the inverted order (IO) condition or explore the normal order (NO) band. Consequently, comparing the sensitivities of proposed $0\\nu\\beta\\beta$ decay experiments with promising prospects is essential. The current study adopts sensitivity metrics, including exclusion and discovery sensitivities, half-life sensitivities, and $m_{\\beta\\beta}$ sensitivities, to provide a comprehensive evaluation of ten typical promising experiments: LEGEND, CDEX, nEXO, XLZD, PandaX, NEXT, KamLAND-Zen, JUNO, SNO+, and CUPID, and highlight their unique features. Based on reported experimental parameters, the concept of a ``technical line'' is introduced to determine the location that each experiment may realize in the $\\xi$ and $\\lambda_{b}$ space, where $\\xi$ represents the sensitive exposure per year, and $\\lambda_{b}$ denotes the expected annual rate of background events. Half-life sensitivities for the selected experiments are calculated, some of them in multiple phases and others in conservative or aggressive condition. The results indicate that increasing the operation time is more beneficial for zero-background experiments, which also demonstrate greater competitiveness in discovery sensitivity. $m_{\\beta\\beta}$ sensitivities are presented as uncertainty bands arising from the nuclear matrix element uncertainties. Additionally, half-life and $m_{\\beta\\beta}$ sensitivities are estimated under ideal conditions also in the form of uncertainty bands, where only irreducible $2\\nu\\beta\\beta$ and solar B-8 neutrino induced background remain.",
  "authors": [
    "X. Yu",
    "L. T. Yang",
    "Q. Yue",
    "H. Ma",
    "H. T. Wong"
  ],
  "published": "2025-04-04T15:53:46Z",
  "updated": "2025-09-28T06:27:47Z",
  "categories": [
    "nucl-ex",
    "hep-ex",
    "physics.ins-det"
  ],
  "primary_category": "nucl-ex",
  "doi": "10.1103/d6gx-944x"
}