{
  "arxiv_id": "2509.22948v1",
  "url": "https://arxiv.org/abs/2509.22948v1",
  "pdf_url": "https://arxiv.org/pdf/2509.22948v1.pdf",
  "title": "On the mechanism of Pedestal Relaxation Events -- Insights gained by   turbulence simulations with GRILLIX",
  "abstract": "Pedestal Relaxation Events (PREs) appear in I-mode discharges close to the I-H transition. Although they show certain similarities with Edge Localised Modes (ELMs), i.e. periodic energy ejections, the underlying mechanism seems to be very different from the mechanism responsible for ELMs. In this manuscript, we present global trans-collisional fluid simulations of an I-mode discharge in ASDEX Upgrade using GRILLIX. We observe multiple PREs during the simulation, which reproduce a range of experimentally observed PRE characteristics. Furthermore, a detailed analysis of various mode properties in our simulation allows us to pinpoint the underlying mechanism responsible for triggering PREs to Micro-Tearing Modes (MTMs). The system is analysed dynamically by evaluating density and electron temperature gradient lengths at the OMP position, where the MTM is located and grows over time. The path taken by the system in gradient length space is compared to a growth-rate estimate calculated by linear theory in simplified slab geometry, providing excellent agreement. Building on these insights, we sketch a qualitative picture of a full PRE cycle. Finally, we discuss the influence of the recently implemented Landau-fluid closure and the challenges of simulating low collisionality regimes with trans-collisional fluid models, like the one employed by GRILLIX.",
  "authors": [
    "Christoph Pitzal",
    "Andreas Stegmeir",
    "Tim Happel",
    "Kaiyu Zhang",
    "Konrad Eder",
    "Wladimir Zholobenko",
    "Philipp Ulbl",
    "Manuel Herschel",
    "Frank Jenko",
    "The ASDEX Upgrade Team"
  ],
  "published": "2025-09-26T21:29:34Z",
  "updated": "2025-09-26T21:29:34Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}