{
  "arxiv_id": "2509.22409v1",
  "url": "https://arxiv.org/abs/2509.22409v1",
  "pdf_url": "https://arxiv.org/pdf/2509.22409v1.pdf",
  "title": "X-ray and neural network based in-situ identification of the melt pool   during the additive manufacturing of a stainless steel part",
  "abstract": "Laser Metal Deposition with Powder (LMDp) is an additive manufacturing technique used for repairing metal components or producing parts with intricate geometries. However, a comprehensive understanding of the melt pool dynamics, which significantly influences the final properties of LMDp-fabricated parts, remains limited. Non-destructive testing is highly valuable for conducting in-situ controls during manufacturing. X-ray imaging offers the ability to penetrate metallic parts and detect defects such as porosity. In the context of additive manufacturing, X-rays can be employed to visualize the shape of the melt pool during the fabrication process. The contrast between the liquid and solid phases, due to their density differences, should be observable in the radioscopy images. The experimental setup required to perform such a test on an industrial additive manufacturing installation consists of a movable X-ray source that produces polychromatic beams, a detector, and extensive lead shielding to ensure X-ray safety. In-situ observations of the melt pool were conducted during the deposition of ten successive layers of stainless steel 316L (SS316L). The polychromatic nature of the X-ray beam, however, rendered traditional image analysis methods ineffective for detecting contrast variations. To address this challenge, neural networks trained on simulated data (thermal and X-ray) were employed, providing a solution to identify the melt pool in low-contrast radioscopic images. The architecture inspired by VGG16 demonstrated promising results, confirming the potential for in-situ non-destructive testing using X-ray imaging in industrial additive manufacturing processes.",
  "authors": [
    "Loic Jegou",
    "Valerie Kaftandjian",
    "Thomas Elguedj",
    "Mohamed Tahraoui",
    "Philippe Duvauchelle",
    "Mady Guillemot"
  ],
  "published": "2025-09-26T14:36:03Z",
  "updated": "2025-09-26T14:36:03Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}