{
  "arxiv_id": "2509.22804v1",
  "url": "https://arxiv.org/abs/2509.22804v1",
  "pdf_url": "https://arxiv.org/pdf/2509.22804v1.pdf",
  "title": "Ultralow-Temperature Cryogenic Transmission Electron Microscopy Using a   New Helium Flow Cryostat Stage",
  "abstract": "Advances in cryogenic electron microscopy have opened new avenues for probing quantum phenomena in correlated materials. This study reports the installation and performance of a new side-entry condenZero cryogenic cooling system for JEOL (Scanning) Transmission Electron Microscopes (S/TEM), utilizing compressed liquid helium (LHe) and designed for imaging and spectroscopy at ultra-low temperatures. The system includes an external dewar mounted on a vibration-damping stage and a pressurized, low-noise helium transfer line with a remotely controllable needle valve, ensuring stable and efficient LHe flow with minimal thermal and mechanical noise. Performance evaluation demonstrates a stable base temperature of 6.58 K measured using a Cernox bare chip sensor on the holder with temperature fluctuations within 0.04 K. Complementary in-situ electron energy-loss spectroscopy (EELS) via aluminum bulk plasmon analysis was used to measure the local specimen temperature and validate cryogenic operation during experiments. The integration of cryogenic cooling with other microscopy techniques, including electron diffraction and Lorentz TEM, was demonstrated by resolving charge density wave (CDW) transitions in NbSe2 using electron diffraction, and imaging nanometric magnetic skyrmions in MnSi via Lorentz TEM. This platform provides reliable cryogenic operation below 7 K, establishing a low-drift route for direct visualization of electronic and magnetic phase transformations in quantum materials.",
  "authors": [
    "Young-Hoon Kim",
    "Fehmi Sami Yasin",
    "Na Yeon Kim",
    "Max Birch",
    "Xiuzhen Yu",
    "Akiko Kikkawa",
    "Yasujiro Taguchi",
    "Jiaqiang Yan",
    "Miaofang Chi"
  ],
  "published": "2025-09-26T18:09:55Z",
  "updated": "2025-09-26T18:09:55Z",
  "categories": [
    "cond-mat.str-el",
    "physics.ins-det",
    "quant-ph"
  ],
  "primary_category": "cond-mat.str-el"
}