{
  "arxiv_id": "2509.24513v1",
  "url": "https://arxiv.org/abs/2509.24513v1",
  "pdf_url": "https://arxiv.org/pdf/2509.24513v1.pdf",
  "title": "Flow Crossover and Parallel Outflow during Collisionless Magnetic   Reconnection",
  "abstract": "Using particle-in-cell simulations that label ions and electrons according to their initial inflow region, we find that during 2D collisionless magnetic reconnection, the bulk flow of the plasma from each inflow side crosses paths with plasma from the other inflow side and crosses the midplane before being redirected into an outflow jet. This feature, which we term ``flow crossover,'' implies mechanisms to generate bulk motion in a direction parallel to the magnetic field. We find that ions and electrons undergo different parallel driving mechanisms, leading to different flow crossover patterns. The parallel bulk flow for ions is generated more locally within the ion diffusion region, whereas the parallel bulk flow for electrons is mostly generated outside the electron diffusion region. Consequently, the reconnection outflows are more of a parallel flow than a perpendicular flow, especially for the electron outflow. The flow crossover and the parallel outflow patterns occur not only in symmetric reconnection but also in the more complex scenario of a guide-field asymmetric reconnection, suggesting that it is a general feature of collisionless magnetic reconnection. Because the plasma on one side of the outflow mostly originates from the inflow plasma on the other side, we predict that near an asymmetric reconnection site in a collisionless space plasma, in situ observations across the outflow region could reveal locally reversed gradients in plasma properties.",
  "authors": [
    "Theerasarn Pianpanit",
    "Kittipat Malakit",
    "Pakkapawn Prapan",
    "David Ruffolo",
    "Peera Pongkitiwanichakul",
    "Piyawat Suetrong",
    "Michael A. Shay",
    "Paul A. Cassak"
  ],
  "published": "2025-09-29T09:27:04Z",
  "updated": "2025-09-29T09:27:04Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}