[
  {
    "arxiv_id": "2509.21883v2",
    "url": "https://arxiv.org/abs/2509.21883v2",
    "pdf_url": "https://arxiv.org/pdf/2509.21883v2.pdf",
    "title": "Enhancing Particle Identification in Helium-Based Drift Chambers Using   Cluster Counting Insights from Beam Test Studies",
    "abstract": "Particle identification in gaseous detectors traditionally relies on energy loss measurements (dE/dx); however, uncertainties in total energy deposition limit its resolution. The cluster counting technique (dN/dx) offers an alternative approach by exploiting the Poisson-distributed nature of primary ionization, providing a statistically robust method for mass determination. Simulation studies with Garfield++ and Geant4 indicate that dN/dx can achieve twice the resolution of dE/dx in helium-based drift chambers. However, experimental implementation is challenging due to signal overlap in the time domain, complicating the identification of electron peaks and ionization clusters. This paper presents novel algorithms and modern computational techniques to address these challenges, facilitating accurate cluster recognition in experimental data. The effectiveness of these algorithms is validated through four beam tests conducted at CERN, utilizing various helium gas mixtures, gas gains, and wire orientations relative to ionizing tracks. The experiments employ a muon beam (1 GeV/c to 180 GeV/c) with drift tubes of different sizes and sense wire diameters. The analysis explores the Poisson nature of cluster formation, evaluates the performance of different clustering algorithms, and examines the dependence of counting efficiency on the beam particle impact parameter. Furthermore, a comparative study of the resolution achieved using dN/dx and dE/dx is presented.",
    "authors": [
      "W. Elmetenawee",
      "M. Abbrescia",
      "M. Anwar",
      "G. Chiarello",
      "A. Corvaglia",
      "F. Cuna",
      "B. D'Anzi",
      "N. De Filippis",
      "F. De Santis",
      "M. Dong",
      "E. Gorini",
      "F Grancagnolo",
      "F. G. Gravili",
      "K. Johnson",
      "S. Liu",
      "M. Louka",
      "A. Miccoli",
      "M. Panareo",
      "M. Primavera",
      "F. M. Procacci",
      "A. Taliercio",
      "G. Tassielli",
      "A. Ventura L. Wu",
      "G. Zhao"
    ],
    "published": "2025-09-26T05:15:47Z",
    "updated": "2025-09-30T07:14:25Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.07448v3",
    "url": "https://arxiv.org/abs/2509.07448v3",
    "pdf_url": "https://arxiv.org/pdf/2509.07448v3.pdf",
    "title": "FCC-ee Lessons from SuperKEKB",
    "abstract": "SuperKEKB has achieved significantly higher specific luminosity than its predecessor KEKB, and it has proven a much more sustainable machine. It has successfully demonstrated several key design elements of FCC-ee. The design luminosity has not yet been reached, however. This observation is often (mistakenly) used to put into question the reliability of the FCC-ee design luminosity. In this note we review the accomplishments, challenges and obstacles of SuperKEKB, and compare these with the FCC-ee design.",
    "authors": [
      "Frank Zimmermann"
    ],
    "published": "2025-09-09T07:12:21Z",
    "updated": "2025-09-30T06:39:25Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.25119v1",
    "url": "https://arxiv.org/abs/2509.25119v1",
    "pdf_url": "https://arxiv.org/pdf/2509.25119v1.pdf",
    "title": "Single-shot, simultaneous spatially resolved polarimetry and wavefront   sensing with stress engineered optics",
    "abstract": "We present an experimental test of the use of stress engineered optics incorporated into a Shack-Hartmann wavefront sensor in such a way that the shape of the point spread function (PSF) provides polarization information while the displacement of the PSF gives information about the local wavefront gradient, allowing a reconstruction of the wavefront gradient. Using calibrated polarizations and wavefront tilts we construct a measurement matrix capable of reconstructing both the Stokes parameters and the wavefront, yielding a measurement of wavefront gradients as small as 100 $\\mu$rad with a polarimetric angular error of approximately 0.1 radians on the Poincar\\'e sphere in a single frame measurement.",
    "authors": [
      "David E. Spiecker",
      "Thomas G. Brown"
    ],
    "published": "2025-09-29T17:43:12Z",
    "updated": "2025-09-29T17:43:12Z",
    "categories": [
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.25066v1",
    "url": "https://arxiv.org/abs/2509.25066v1",
    "pdf_url": "https://arxiv.org/pdf/2509.25066v1.pdf",
    "title": "Avalanches in Magnetohydrodynamical simulations",
    "abstract": "Scale invariance is a hallmark of many natural systems, including solar flares, where energy release spans a vast range of scales. Recent computational advances, at the level of both algorithmics and hardware, have enabled high-resolution magnetohydrodynamical (MHD) simulations to span multiple scales, offering new insights into magnetic energy dissipation processes. Here, we study scale invariance of magnetic energy dissipation in two distinct MHD simulations. Current sheets are identified and analyzed over time. Results demonstrate that dissipative events exhibit scale invariance, with power-law distributions characterizing their energy dissipation and lifetimes. Remarkably, these distributions are consistent across the two simulations, despite differing numerical and physical setups, suggesting universality in the process of magnetic energy dissipation. Comparisons between the evolution of dissipation regions reveals distinct growth behaviors in high plasma-beta regions (convective zone) and low plasma-beta regions (atmosphere). The latter display spatiotemporal dynamics similar to those of avalanche models, suggesting self-organized criticality and a common universality class.",
    "authors": [
      "Henri Lamarre",
      "Paul Charbonneau",
      "Quentin Noraz",
      "Antoine Strugarek",
      "Alexis Blaise",
      "Allan Sacha Brun",
      "Mats Carlsson",
      "Boris Vilhelm Gudiksen"
    ],
    "published": "2025-09-29T17:13:12Z",
    "updated": "2025-09-29T17:13:12Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2506.07230v2",
    "url": "https://arxiv.org/abs/2506.07230v2",
    "pdf_url": "https://arxiv.org/pdf/2506.07230v2.pdf",
    "title": "First positronium imaging using $^{44}$Sc with the J-PET scanner: a case   study on the NEMA-Image Quality phantom",
    "abstract": "Positronium Lifetime Imaging (PLI), an emerging extension of conventional positron emission tomography (PET) imaging, offers a novel window for probing the submolecular properties of biological tissues by imaging the mean lifetime of the positronium atom. Currently, the method is under rapid development in terms of reconstruction and detection systems. Recently, the first in vivo PLI of the human brain was performed using the J-PET scanner utilizing the $^{68}$Ga isotope. However, this isotope has limitations due to its comparatively low prompt gamma yields, which is crucial for positronium lifetime measurement. Among alternative radionuclides, $^{44}$Sc stands out as a promising isotope for PLI, characterized by a clinically suitable half-life (4.04 hours) emitting 1157 keV prompt gamma in 100% cases after the emission of the positron. This study reports the first experimental demonstration of PLI with $^{44}$Sc, carried out on a NEMA-Image Quality (IQ) phantom using the Modular J-PET tomograph-the first plastic scintillators-based PET scanner.",
    "authors": [
      "Manish Das",
      "Sushil Sharma",
      "Aleksander Bilewicz",
      "Jarosław Choiński",
      "Neha Chug",
      "Catalina Curceanu",
      "Eryk Czerwiński",
      "Jakub Hajduga",
      "Sharareh Jalali",
      "Krzysztof Kacprzak",
      "Tevfik Kaplanoglu",
      "Łukasz Kapłon",
      "Kamila Kasperska",
      "Aleksander Khreptak",
      "Grzegorz Korcyl",
      "Tomasz Kozik",
      "Karol Kubat",
      "Deepak Kumar",
      "Anoop Kunimmal Venadan",
      "Edward Lisowski",
      "Filip Lisowski",
      "Justyna Medrala-Sowa",
      "Simbarashe Moyo",
      "Wiktor Mryka",
      "Szymon Niedźwiecki",
      "Piyush Pandey",
      "Szymon Parzych",
      "Alessio Porcelli",
      "Bartłomiej Rachwał",
      "Elena Perez del Rio",
      "Martin Rädler",
      "Axel Rominger",
      "Kuangyu Shi",
      "Magdalena Skurzok",
      "Anna Stolarz",
      "Tomasz Szumlak",
      "Pooja Tanty",
      "Keyvan Tayefi Ardebili",
      "Satyam Tiwari",
      "Kavya Valsan Eliyan",
      "Rafał Walczak",
      "Ermias Yitayew Beyene",
      "Ewa Ł. Stępień",
      "Paweł Moskal"
    ],
    "published": "2025-06-08T17:27:32Z",
    "updated": "2025-09-29T17:04:44Z",
    "categories": [
      "physics.med-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.med-ph"
  },
  {
    "arxiv_id": "2507.05423v2",
    "url": "https://arxiv.org/abs/2507.05423v2",
    "pdf_url": "https://arxiv.org/pdf/2507.05423v2.pdf",
    "title": "The CMS Phase-2 Fast Beam Condition Monitor prototype test with beam",
    "abstract": "The Fast Beam Condition Monitor (FBCM) is a standalone luminometer for the High Luminosity LHC (HL-LHC) program of the CMS Experiment at CERN. The detector is under development and features a new, radiation-hard, front-end application-specific integrated circuit (ASIC) designed for beam monitoring applications. The achieved timing resolution of a few nanoseconds enables the measurement of both the luminosity and the beam-induced background. The ASIC, called FBCM23, features six channels with adjustable shaping times, enabling in-field fine-tuning. Each ASIC channel outputs a single binary asynchronous signal encoding time of arrival and time over threshold information. The FBCM is based on silicon-pad sensors, with two sensor designs presently being considered. This paper presents the results of tests of the FBCM detector prototype using both types of silicon sensors with hadron, muon, and electron beams. Irradiated FBCM23 ASICs and silicon-pad sensors were also tested to simulate the expected conditions near the end of the detector's lifetime in the HL-LHC radiation environment. Based on test results, direct bonding between the sensor and ASIC was chosen, and an optimal bias voltage and ASIC threshold for FBCM operation were proposed. The current design of the front-end test board was validated following the beam test and is now being used for the first front-end module, which is expected to be produced in summer 2025. These results represent a major step forward in validating the FBCM concept, first version of the firmware and establishing a reliable design path for the final detector.",
    "authors": [
      "G. Auzinger",
      "H. Bakhshiansohi",
      "A. E. Dabrowski",
      "A. G. Delannoy",
      "V. Dalavi",
      "N. Dienemann",
      "M. Dragicevic",
      "M. F. Garcia",
      "M. Guthoff",
      "B. Gyöngyösi",
      "M. Jenihhin",
      "Á. Kadlecsik",
      "J. Kaplon",
      "O. Karacheban",
      "B. Korcsmáros",
      "A. Lokhovitskiy",
      "W. H. Liu",
      "R. Loos",
      "S. Mallows",
      "D. Mihhailov",
      "M. Obradovic",
      "S. Orfanelli",
      "M. Pari",
      "G. Pásztor",
      "F. L. Pereira Carneiro",
      "M. Princova",
      "B. Ristic",
      "C. Romero",
      "J. Schwandt",
      "M. Sedghi",
      "A. Shevelev",
      "K. Shibin",
      "S. Spanier",
      "G. Steinbrueck",
      "D. P. Stickland",
      "A. Tsirou",
      "B. Ujvári",
      "M. Velasco",
      "P. G. Verdini",
      "G. J. Wegrzyn",
      "M. Wiehe",
      "D. Wilbern",
      "P. D. Winney"
    ],
    "published": "2025-07-07T19:11:42Z",
    "updated": "2025-09-29T16:38:50Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2507.08887v4",
    "url": "https://arxiv.org/abs/2507.08887v4",
    "pdf_url": "https://arxiv.org/pdf/2507.08887v4.pdf",
    "title": "Measurement of the Liquid Argon Scintillation Pulse Shape Using   Differentiable Simulation in the Coherent CAPTAIN-Mills Experiment",
    "abstract": "The Coherent CAPTAIN-Mills (CCM) experiment is a liquid argon (LAr) light collection detector searching for MeV-scale neutrino and Beyond Standard Model physics signatures. Two hundred 8-inch photomultiplier tubes (PMTs) instrument the 7 ton fiducial volume with 50% photocathode coverage to detect light produced by charged particles. CCM's light-based approach reduces requirements of LAr purity, compared to other detection technologies, such that sub-MeV particles can be reliably detected without additional LAr filtration and with O(1) parts-per-million of common contaminants. We present a measurement of LAr light production and propagation parameters, with uncertainties, obtained from a sample of MeV-scale electromagnetic events. The optimization of this high-dimensional parameter space was facilitated by a differentiable optical photon Monte-Carlo simulation, and detailed PMT response characterization. This result accurately predicts the timing and spatial distribution of light due to scintillation and Cherenkov emission in the detector. This is the first description of photon propagation in LAr to include several effects, including: anomalous dispersion of the index of refraction near the ultraviolet resonance, Mie scattering from impurities, and Cherenkov light production.",
    "authors": [
      "A. A. Aguilar-Arevalo",
      "S. Biedron",
      "J. Boissevain",
      "M. Borrego",
      "L. Bugel",
      "M. Chavez-Estrada",
      "J. M. Conrad",
      "R. L. Cooper",
      "J. R. Distel",
      "J. C. D'Olivo",
      "E. Dunton",
      "B. Dutta",
      "D. E. Fields",
      "M. Gold",
      "E. Guardincerri",
      "E. C. Huang",
      "N. Kamp",
      "D. Kim",
      "K. Knickerbocker",
      "W. C. Louis",
      "C. F. Macias-Acevedo",
      "R. Mahapatra",
      "J. Mezzetti",
      "J. Mirabal",
      "M. J. Mocko",
      "D. A. Newmark",
      "P. deNiverville",
      "C. O'Connor",
      "V. Pandey",
      "D. Poulson",
      "H. Ray",
      "E. Renner",
      "T. J. Schaub",
      "A. Schneider",
      "M. H. Shaevitz",
      "D. Smith",
      "W. Sondheim",
      "A. M. Szelc",
      "C. Taylor",
      "A. Thompson",
      "W. H. Thompson",
      "M. Tripathi",
      "R. T. Thornton",
      "R. Van Berg",
      "R. G. Van de Water"
    ],
    "published": "2025-07-10T18:01:17Z",
    "updated": "2025-09-29T15:54:03Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.08886v4",
    "url": "https://arxiv.org/abs/2507.08886v4",
    "pdf_url": "https://arxiv.org/pdf/2507.08886v4.pdf",
    "title": "First Event-by-Event Identification of Cherenkov Radiation from Sub-MeV   Particles in Liquid Argon",
    "abstract": "This Letter reports the event-by-event observation of Cherenkov light from sub-MeV electrons in a high scintillation light-yield liquid argon (LAr) detector by the Coherent CAPTAIN-Mills (CCM) experiment. The CCM200 detector, located at Los Alamos National Laboratory, instruments 7 tons (fiducial volume) of LAr with 200 8-inch photomultiplier tubes (PMTs), 80% of which are coated in a wavelength shifting material and the remaining 20% are uncoated. In the prompt time region of an event, defined as $-6 \\leq t < 0$ ns relative to the event start time $t=0$, the uncoated PMTs are primarily sensitive to visible Cherenkov photons. Using gamma-rays from a $^{22}$Na source for production of sub-MeV electrons, we isolated prompt Cherenkov light with $>5\\sigma$ confidence and developed a selection to obtain a low-background electromagnetic sample. This is the first event-by-event observation of Cherenkov photons from sub-MeV electrons in a high-yield scintillator detector, and represents a milestone in low-energy particle detector development.",
    "authors": [
      "A. A. Aguilar-Arevalo",
      "S. Biedron",
      "J. Boissevain",
      "M. Borrego",
      "L. Bugel",
      "M. Chavez-Estrada",
      "J. M. Conrad",
      "R. L. Cooper",
      "J. R. Distel",
      "J. C. D'Olivo",
      "E. Dunton",
      "B. Dutta",
      "D. E. Fields",
      "M. Gold",
      "E. Guardincerri",
      "E. C. Huang",
      "N. Kamp",
      "D. Kim",
      "K. Knickerbocker",
      "W. C. Louis",
      "C. F. Macias-Acevedo",
      "R. Mahapatra",
      "J. Mezzetti",
      "J. Mirabal",
      "M. J. Mocko",
      "D. A. Newmark",
      "P. deNiverville",
      "C. O'Connor",
      "V. Pandey",
      "D. Poulson",
      "H. Ray",
      "E. Renner",
      "T. J. Schaub",
      "A. Schneider",
      "M. H. Shaevitz",
      "D. Smith",
      "W. Sondheim",
      "A. M. Szelc",
      "C. Taylor",
      "A. Thompson",
      "W. H. Thompson",
      "M. Tripathi",
      "R. T. Thornton",
      "R. Van Berg",
      "R. G. Van de Water"
    ],
    "published": "2025-07-10T18:01:05Z",
    "updated": "2025-09-29T15:17:08Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.24851v1",
    "url": "https://arxiv.org/abs/2509.24851v1",
    "pdf_url": "https://arxiv.org/pdf/2509.24851v1.pdf",
    "title": "The development of a high granular crystal calorimeter prototype of   VLAST",
    "abstract": "Very Large Area gamma-ray Space Telescope (VLAST) is the next-generation flagship space observatory for high-energy gamma-ray detection proposed by China. The observation energy range covers from MeV to TeV and beyond, with acceptance of 10 m^2sr. The calorimeter serves as a crucial subdetector of VLAST, responsible for high-precision energy measurement and electron/proton discrimination. This discrimination capability is essential for accurately identifying gamma-ray events among the background of charged particles. To accommodate such an extensive energy range, a high dynamic range readout scheme employing dual avalanche photodiodes (APDs) has been developed, achieving a remarkable dynamic range of 10^6. Furthermore, a high granular prototype based on bismuth germanate (BGO) cubic scintillation crystals has been developed. This high granularity enables detailed imaging of the particle showers, improving both energy resolution and particle identification. The prototype's performance is evaluated through cosmic ray testing, providing valuable data for optimizing the final calorimeter design for VLAST.",
    "authors": [
      "Yanshuo Zhang",
      "Qian Chen",
      "Dengyi Chen",
      "Jianguo Liu",
      "Yiming Hu",
      "Yunlong Zhang",
      "Yifeng Wei",
      "Zhongtao Shen",
      "Changqing Feng",
      "Jianhua Guo",
      "Shubin Liu",
      "Guangshun Huang",
      "Xiaolian Wang",
      "Zizong Xu"
    ],
    "published": "2025-09-29T14:38:01Z",
    "updated": "2025-09-29T14:38:01Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.01546v2",
    "url": "https://arxiv.org/abs/2509.01546v2",
    "pdf_url": "https://arxiv.org/pdf/2509.01546v2.pdf",
    "title": "Wavelength-tunable femtosecond pulsed laser for the characterisation of   solid-state sensors",
    "abstract": "The Two-Photon Absorption (TPA) process provides an excellent method for the characterisation of solid-state sensors due to its intrinsic 3D resolution for the excitation of electron-hole pairs. This paper presents the commissioning of a system composed of a Light Conversion PHAROS laser read out with an ORPHEUS optical parametric amplifier with tuneable output wavelength across $310-16000$ nm. This is one of the few facilities suitable for particle physics detector applications with a very wide wavelength range and ultra short pulses. The voxel characterisation shows a Rayleigh length of $12.20 \\pm 0.47$ $~\\mu$m and the beam radius at the waist of $1.53 \\pm 0.04$$~\\mu$m. Initial measurements with silicon and diamond samples are described. The apparatus is characterised with both devices, demonstrating the expected quadratic dependency with the energy per pulse, and different models are presented to explain the signal generated due to reflection. The signal generated in the silicon diode is in good agreement with one dimension voxel model predictions.",
    "authors": [
      "Enoch Ejopu",
      "Oscar Augusto de Aguiar Francisco",
      "Nawal Al Amairi",
      "Huazhen Li",
      "Marco Gersabeck",
      "Alexander Oh",
      "Christopher Parkes",
      "Patrick Parkinson",
      "Francisca Munoz Sanchez",
      "Charles Smith"
    ],
    "published": "2025-09-01T15:19:49Z",
    "updated": "2025-09-29T14:06:13Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.24775v1",
    "url": "https://arxiv.org/abs/2509.24775v1",
    "pdf_url": "https://arxiv.org/pdf/2509.24775v1.pdf",
    "title": "Attosecond electron bunch generation by an intense high-order harmonic   pulse interacting with a thin target",
    "abstract": "Laser-accelerated electron bunches and the secondary radiation sources they produce exhibit unique temporal resolution for probing ultrafast physical processes due to their ultrashort pulse duration. The inherently short temporal profile of these pulses leads to extremely high peak bunch currents, thereby enabling a wide range of practical applications. In this study, we propose an innovative method for generating such bunch by utilizing high-harmonics generated through laser-plasma interaction as the driving pulse, which subsequently interacts with a thin target to produce an attosecond electron bunch. Using this method, we successfully generated an electron bunch characterized by excellent collimation and an ultra-short duration of approximately 100 attoseconds, representing a substantial reduction in bunch duration. The total bunch charge achieved was 0.38 nC, with an emittance of $4.5 \\times 10^{-3} \\, \\text{mm} \\cdot \\text{mrad}$ and a divergence angle of approximately $10^\\circ$. Moreover, by systematically analyzing the effects of laser intensity and target positioning, we determined an optimized set of simulation parameters. This research establishes a robust foundation for the generation of ultrashort electron bunches and opens new prospects for their application in advanced high-energy and attosecond physics experiments.",
    "authors": [
      "Yang He",
      "Mamat Ali Bake",
      "Cheng-Qi Zhang",
      "Bai-Song Xie"
    ],
    "published": "2025-09-29T13:40:21Z",
    "updated": "2025-09-29T13:40:21Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.24751v1",
    "url": "https://arxiv.org/abs/2509.24751v1",
    "pdf_url": "https://arxiv.org/pdf/2509.24751v1.pdf",
    "title": "Laboratory and Synchrotron Validation of $μ$-XRF for Sulfur Mapping in   CTMP Paper Samples",
    "abstract": "The transition toward renewable, fiber-based packaging requires an improved understanding of chemical modifications in high-yield pulps such as chemithermomechanical pulp (CTMP). Sulfonation uniformity is essential for the energy-efficient production of high-strength CTMP pulp. However, laboratory methods only measure total sulfur and cannot illustrate its distribution at the fiber level, which can be visualized using $\\mu$-XRF. In this work, we present a laboratory $\\mu$-XRF system developed at Mid Sweden University and assess its capability to detect light elements in CTMP paper handsheets. A 32 $\\times$ 32 point grid scan (1.6-1.6 mm$^2$ field of view, 50 $\\mu$m step, 300 s/point) successfully resolved sulfur K$\\alpha$ (2.31 keV) and calcium K$\\alpha$ (3.69 keV) fluorescence without helium flushing. Comparative measurements at the Elettra synchrotron confirmed consistency of sulfur peak position and spatial distribution, with higher spectral resolution and signal-to-noise ratio. Histogram analysis using Wasserstein distance metrics demonstrated close agreement between datasets despite differing acquisition conditions. These results demonstrate that laboratory XRF can reproducibly detect and map sulfur in CTMP fibers under ambient conditions, providing a practical tool to complement synchrotron studies and supporting the development of energy-efficient, fiber-based packaging materials.",
    "authors": [
      "F. Foroughi",
      "H. Bergman",
      "D. Krapohl",
      "H. Rahman",
      "D. Chapman",
      "R. H. Menk",
      "B. Norlin"
    ],
    "published": "2025-09-29T13:18:15Z",
    "updated": "2025-09-29T13:18:15Z",
    "categories": [
      "physics.ins-det",
      "physics.app-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.24750v1",
    "url": "https://arxiv.org/abs/2509.24750v1",
    "pdf_url": "https://arxiv.org/pdf/2509.24750v1.pdf",
    "title": "Is Turbulence able to Generate Magnetic Islands in Tokamaks? Gyrokinetic   Simulations of Turbulence-Driven Magnetic Islands in Toroidal Geometry",
    "abstract": "We report a universal mechanism for turbulence-driven magnetic islands in fusion plasmas. Using gyrokinetic simulations of a linearly stable tearing mode in a large-aspect-ratio toroidal geometry under collisionless conditions, we demonstrate that micro-instabilities generate an $\\boldsymbol{E}\\times\\boldsymbol{B}$ flow that drives magnetic field line reconnection. This process forms multiple small-scale islands along the resonant surface, which interact nonlinearly and eventually coalesce into large-scale magnetic islands. These islands are capable of significantly flattening the equilibrium profile across the island O-points and thus acting as a seed for their further neoclassical growth. Notably, the mechanism operates independently of the parity of the destabilizing micro-instability.",
    "authors": [
      "Fabien Widmer",
      "Emanuele Poli",
      "Alexey Mishchenko",
      "Akihiro Ishizawa",
      "Thomas Hayward-Schneider",
      "Alberto Bottino"
    ],
    "published": "2025-09-29T13:17:30Z",
    "updated": "2025-09-29T13:17:30Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.03208v2",
    "url": "https://arxiv.org/abs/2506.03208v2",
    "pdf_url": "https://arxiv.org/pdf/2506.03208v2.pdf",
    "title": "Intrinsic Resolution of Organic Scintillators",
    "abstract": "Fluctuations in photon production within scintillators contribute to the overall energy resolution of scintillation detectors. While typically negligible, this contribution - known as intrinsic resolution (IR) - presents significant challenges for both experimental measurement and Monte Carlo simulation. Using the phenomenological model proposed in~[1], we interpreted multiple datasets of IR measurements in organic scintillators. Although our results generally agree with the IR dataset examined in~[1], a comprehensive evaluation of systematic uncertainties highlights the necessity for more detailed investigation. Based on our findings, we offer specific recommendations for future measurements.",
    "authors": [
      "O. Smirnov"
    ],
    "published": "2025-06-02T22:09:55Z",
    "updated": "2025-09-29T11:15:17Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.24551v1",
    "url": "https://arxiv.org/abs/2509.24551v1",
    "pdf_url": "https://arxiv.org/pdf/2509.24551v1.pdf",
    "title": "Broadband Magnetless Isolator using Adiabatic Flux Modulation",
    "abstract": "Isolators are commonly found in the amplification chain of microwave setups to shield sensitive devices such as superconducting qubits from noise and back-scattered signals. Conventional ferrite-based isolators are bulky, lossy and rely on strong magnetic fields, which pose challenges for their co-integration in large-scale superconducting devices. Here, we present a magnetless isolator that overcomes these limitations with simulated performances on par with the state-of-the-art. Using a dispersion-engineered transmission line with a propagating adiabatic flux modulation, the simulated device achieves more than 20 dB isolation over a broad frequency band ranging from 4 to 8 GHz, which can be modified based on the device parameters. Moreover, we propose a compact, low-loss, on-chip superconducting device that shows promise against parameter variations and enables a scalable path for co-integration with large-scale superconducting systems of the future.",
    "authors": [
      "M. Demarets",
      "A. M. Vadiraj",
      "C. Caloz",
      "K. De Greve"
    ],
    "published": "2025-09-29T10:01:28Z",
    "updated": "2025-09-29T10:01:28Z",
    "categories": [
      "quant-ph",
      "physics.ins-det"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2509.24532v1",
    "url": "https://arxiv.org/abs/2509.24532v1",
    "pdf_url": "https://arxiv.org/pdf/2509.24532v1.pdf",
    "title": "Bromine-methanol etching of semiconductor crystals   $Cd_{1-x}Zn_{x}Te_{1-y}Se_{y}$ with different selenium concentrations",
    "abstract": "The effect of the selenium concentration in the composition of the $Cd_{1-x}Zn_{x}Te_{1-y}Se_{y}$ semiconductor crystals on their etching with a bromine-methanol solution was studied. A thermodynamic model is proposed to describe the degree of etching of $Cd_{1-x}Zn_{x}Te$ and $Cd_{1-x}Zn_{x}Te_{1-y}Se_{y}$ crystals. A thermodynamic law is obtained for the first time to describe the change in the etching rate of $Cd_{1-x}Zn_{x}Te_{1-y}Se_{y}$ crystals with different selenium concentrations. Experimental dependencies are constructed for etching trajectories and etching rates with 5% bromine-methanol solutions of $Cd_{1-x}Zn_{x}Te_{1-y}Se_{y}$ crystal samples with nominal $x\\sim 0.1$ and selenium concentrations of $y=0$, $y=0.02$, $y=0.06$, and $y=0.1$. The average etching rates were 24${\\mu }$m/min, 18${\\mu }$m/min, 15${\\mu }$m/min, and 13${\\mu }$m/min. The threshold effect of a strong decrease in the etching rate upon transition from ternary $Cd_{1-x}Zn_{x}Te$ to quaternary $Cd_{1-x}Zn_{x}Te_{1-y}Se_{y}$ crystals, associated with hardening of the crystal structure, is identify and theoretically explained. The obtained experimental data are in good agreement with the theoretical estimates and will be useful for choosing the optimal regimes of crystal treatment.",
    "authors": [
      "S. V. Naydenov",
      "G. M. Babenko",
      "O. K. Kapustnyk",
      "I. M. Pritula"
    ],
    "published": "2025-09-29T09:45:52Z",
    "updated": "2025-09-29T09:45:52Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2509.24513v1",
    "url": "https://arxiv.org/abs/2509.24513v1",
    "pdf_url": "https://arxiv.org/pdf/2509.24513v1.pdf",
    "title": "Flow Crossover and Parallel Outflow during Collisionless Magnetic   Reconnection",
    "abstract": "Using particle-in-cell simulations that label ions and electrons according to their initial inflow region, we find that during 2D collisionless magnetic reconnection, the bulk flow of the plasma from each inflow side crosses paths with plasma from the other inflow side and crosses the midplane before being redirected into an outflow jet. This feature, which we term ``flow crossover,'' implies mechanisms to generate bulk motion in a direction parallel to the magnetic field. We find that ions and electrons undergo different parallel driving mechanisms, leading to different flow crossover patterns. The parallel bulk flow for ions is generated more locally within the ion diffusion region, whereas the parallel bulk flow for electrons is mostly generated outside the electron diffusion region. Consequently, the reconnection outflows are more of a parallel flow than a perpendicular flow, especially for the electron outflow. The flow crossover and the parallel outflow patterns occur not only in symmetric reconnection but also in the more complex scenario of a guide-field asymmetric reconnection, suggesting that it is a general feature of collisionless magnetic reconnection. Because the plasma on one side of the outflow mostly originates from the inflow plasma on the other side, we predict that near an asymmetric reconnection site in a collisionless space plasma, in situ observations across the outflow region could reveal locally reversed gradients in plasma properties.",
    "authors": [
      "Theerasarn Pianpanit",
      "Kittipat Malakit",
      "Pakkapawn Prapan",
      "David Ruffolo",
      "Peera Pongkitiwanichakul",
      "Piyawat Suetrong",
      "Michael A. Shay",
      "Paul A. Cassak"
    ],
    "published": "2025-09-29T09:27:04Z",
    "updated": "2025-09-29T09:27:04Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.03443v2",
    "url": "https://arxiv.org/abs/2508.03443v2",
    "pdf_url": "https://arxiv.org/pdf/2508.03443v2.pdf",
    "title": "Energy Cascade and Damping in Fast-Mode Compressible Turbulence",
    "abstract": "Compressible turbulence governs energy transfer across scales in space and astrophysical systems. Capturing both the turbulence cascade and damping is therefore crucial for models of energy conversion, plasma heating, and particle transport in diverse plasma environments, but remains challenging. Progress is constrained by two unresolved fundamental questions: the persistence of the turbulence cascade in the presence of shocks and discontinuities, and the validity of classical wave theories under strong nonlinearity. In particular, it remains unclear whether meaningful cascade dynamics can be defined in compressible turbulence with phase steepening, and whether frameworks developed for monochromatic waves remain applicable to complex, broadband fluctuations. Using large-scale, high-resolution kinetic simulations, we analyze turbulence-particle interactions, which are beyond the capability of standard magnetohydrodynamic (MHD) simulations. We show that compressible turbulence damping at MHD scales in quantitative agreement with transit-time damping theory, even in fully developed nonlinear states. Moreover, the cascade persists despite the generation of shocks and discontinuities due to phase steepening, revealing a surprising robustness of cross-scale energy transfer under extreme conditions. We further provide the spectral expression of compressible turbulence. These results close a long-standing gap in the physics of compressible turbulence and establish a robust foundation for turbulence modeling from the heliosphere to galaxies.",
    "authors": [
      "Chuanpeng Hou",
      "Huirong Yan",
      "Siqi Zhao",
      "Parth Pavaskar"
    ],
    "published": "2025-08-05T13:41:18Z",
    "updated": "2025-09-29T08:07:51Z",
    "categories": [
      "astro-ph.SR",
      "astro-ph.HE",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2509.17997v2",
    "url": "https://arxiv.org/abs/2509.17997v2",
    "pdf_url": "https://arxiv.org/pdf/2509.17997v2.pdf",
    "title": "Hybrid Electromagnetic Calorimeter Module: Enhanced Performance through   Integration of Silicon Pixel Layer into Scintillator Design",
    "abstract": "This study constructs a hybrid module with a multi-material collaborative detection architecture by integrating silicon pixel layers into the longitudinally segmented scintillating fiber sampling calorimeter module and optimizes the placement of the silicon layers. The module utilizes the pre-shower characteristics of the front-end scintillator units to ensure sufficient energy deposition in the silicon pixel layers, thereby maintaining its high-precision detection capability. A dedicated simulation framework combining Geant4 modeling for the scintillator section and a parameterized approach for the silicon pixel layer is employed for module verification and performance study. The hybrid module demonstrates overall performance enhancement. The maximum achievable improvements are 56% for position resolution and 26% for time resolution, respectively. These advancements also lead to significant increase of physics sensitivity, especially for physics channels with low-energy photons, for instance, a 16% boost in signal significance for $D^{*0}$ from the $B^-\\rightarrow D^{*0}(\\rightarrow D^0 \\gamma)\\pi^-$ decay.",
    "authors": [
      "Jia-Le Fei",
      "Ao Yuan",
      "Chang-Heng Huang",
      "Liu-Pan An",
      "Ji-Ke Wang"
    ],
    "published": "2025-09-22T16:37:54Z",
    "updated": "2025-09-29T07:45:01Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2504.08559v2",
    "url": "https://arxiv.org/abs/2504.08559v2",
    "pdf_url": "https://arxiv.org/pdf/2504.08559v2.pdf",
    "title": "Multi-MeV electron occurrence and lifetimes in the outer radiation belt   and slot region during the maximum of solar cycle 22",
    "abstract": "The Combined Release and Radiation Effects Satellite (CRRES) observed the response of the Van Allen radiation belts to peak solar activity within solar cycle 22. This study analyses relativistic and ultra-relativistic electron occurrence and loss timescales within the CRRES High Energy Electron Fluxometer (HEEF) dataset, including during several strong and severe geomagnetic storms that all, remarkably, flooded the slot region with multi-MeV electrons. These allow the first definitive multi-MeV electron lifetimes to be calculated in this region and indicate an elevated risk to satellites in slot region orbits during periods of heightened solar activity. The HEEF outer belt loss timescales are broadly in agreement with those from later solar cycles, but differences include longer-lasting sub-MeV electrons near the inner region of the outer belt and faster-decaying multi-MeV electrons near geosynchronous orbit. These differences are associated with higher levels of geomagnetic activity, a phenomenon that enables the spread in the results to be parameterised accordingly. The timescales generally appear well-bounded by Kp-dependent theoretical predictions, but the variability within the spread is not always well-ordered by geomagnetic activity. This suggests the limitations of using pitch-angle diffusion to account for the decay of elevated electrons following geomagnetic storms, and the need for more sophisticated space weather indices for radiation belt forecasting.",
    "authors": [
      "R. T. Desai",
      "J. Perrin",
      "N. P. Meredith",
      "S. A. Glauert",
      "S. Ruparelia",
      "W. R. Johnston"
    ],
    "published": "2025-04-11T14:07:09Z",
    "updated": "2025-09-29T07:17:24Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.EP",
      "astro-ph.HE",
      "astro-ph.SR",
      "physics.geo-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph",
    "doi": "10.1029/2025SW004448"
  },
  {
    "arxiv_id": "2501.13681v7",
    "url": "https://arxiv.org/abs/2501.13681v7",
    "pdf_url": "https://arxiv.org/pdf/2501.13681v7.pdf",
    "title": "A projection method for particle resampling",
    "abstract": "Particle discretizations of partial differential equations are advantageous for high-dimensional kinetic models in phase space due to their better scalability than continuum approaches with respect to dimension. Complex processes collectively referred to as particle noise hamper long time simulations with particle methods. One approach to address this problem is particle mesh adaptivity or remapping, known as particle resampling. This paper introduces a resampling method that projects particles to and from a (finite element) function space. The method is simple; using standard sparse linear algebra and finite element techniques, it can adapt to almost any set of new particle locations and preserves all moments up to the order of polynomial represented exactly by the continuum function space. This work is motivated by the Vlasov-Maxwell-Landau model of magnetized plasmas with up to six dimensions, 3X in physical space and 3V in velocity space, and is developed in the context of a 1X + 1V Vlasov-Poisson model of Landau damping with logically regular particle and continuum phase space grids. Stable long time dynamics are demonstrated up to T = 500 and reproducibility artifacts and data with stable dynamics up to T = 1000 are publicly available.",
    "authors": [
      "Mark F. Adams",
      "Daniel S. Finn",
      "Matthew G. Knepley",
      "Joseph V. Pusztay"
    ],
    "published": "2025-01-23T14:07:15Z",
    "updated": "2025-09-29T01:02:32Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.24075v1",
    "url": "https://arxiv.org/abs/2509.24075v1",
    "pdf_url": "https://arxiv.org/pdf/2509.24075v1.pdf",
    "title": "Wafer-Level Prototyping Tools for CMOS Bioelectronic Sensors",
    "abstract": "Integrating biology with complementary metal-oxide-semiconductor (CMOS) sensors can enable highly parallel measurements with minimal parasitic effects, significantly enhancing sensitivity. However, realizing this potential often requires overcoming substantial barriers related to design, fabrication, and heterogeneous integration. In this context, we present a comprehensive suite of tools and methods designed for wafer-scale biosensor prototyping that is sensitive, highly parallelizable, and manufacturable. A central component of our approach is a new initiative that allows for open-source multi-project wafers (MPW), giving all participants access to the designs submitted by others. We demonstrate that this strategy not only promotes design reuse but also facilitates advanced back-end-of-line (BEOL) fabrication techniques, improving the manufacturability and process yield of CMOS biosensors. Developing CMOS-based biosensors also involves the challenge of heterogeneous integration, which includes external electrical, mechanical, and fluid layers. We demonstrate simple modular designs that enable such integration for sample delivery and signal readout. Finally, we showcase the effectiveness of our approach in measuring the hybridization of DNA molecules by focusing on data acquisition and machine learning (ML) methods that leverage the parallelism of the sensors to enable robust classification of desirable analyte interactions.",
    "authors": [
      "Advait Madhavan",
      "Ruohong Shi",
      "Alokik Kanwal",
      "Glenn Holland",
      "Jacob M. Majikes",
      "Paul N. Patrone",
      "Anthony J. Kearsley",
      "Arvind Balijepalli"
    ],
    "published": "2025-09-28T21:21:29Z",
    "updated": "2025-09-28T21:21:29Z",
    "categories": [
      "physics.ins-det",
      "physics.bio-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2505.11361v3",
    "url": "https://arxiv.org/abs/2505.11361v3",
    "pdf_url": "https://arxiv.org/pdf/2505.11361v3.pdf",
    "title": "Magnetic dipole-dipole transition for scintillation quenching",
    "abstract": "A magnetic dipole-dipole interaction is proposed as a scintillation quenching mechanism. The interaction rate follows $R^{-6}$ as the electric dipole-dipole interaction in F$\\mathrm{\\ddot{o}}$ster resonance energy transfer theory. The proposed mechanism causes a long-range resonance energy transfer, and the resonance condition is that the spins of donor and acceptor electrons both flip, and the energy level differences are the same. The new mechanism is distinct to the known spin-orbit coupling induced intersystem crossing, and it can enhance the overall intersystem crossing rate. When oxygen or organic molecules including heavy elements are dissolved in a liquid scintillator, these requirements are possible to be satisfied. The proposal in the paper adds a new approach for scintillation quenching in liquid scintillators.",
    "authors": [
      "Zhe Wang"
    ],
    "published": "2025-05-16T15:28:56Z",
    "updated": "2025-09-28T13:56:14Z",
    "categories": [
      "physics.ins-det",
      "physics.chem-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2402.03657v4",
    "url": "https://arxiv.org/abs/2402.03657v4",
    "pdf_url": "https://arxiv.org/pdf/2402.03657v4.pdf",
    "title": "Discretization form of the continuity condition at the polar axis, with   application to the gyrokinetic simulation in a magnetic fusion torus",
    "abstract": "A new computational method to solve the hyperbolic (Vlasov) equation and the elliptic (Poisson-like) equation at the polar axis is proposed. It is shown that the value of a scalar function at the polar axis can be predicted by its neighbouring values based on the continuity condition. This continuity condition systematically solves the pole problems including the singular factor 1/r in the hyperbolic equation and the inner boundary in the elliptic equation. The proposed method is applied to the global gyrokinetic simulation of the tokamak plasma with the magnetic axis included.",
    "authors": [
      "Tiannan Wu",
      "Zihao Wang",
      "Shaojie Wang"
    ],
    "published": "2024-02-06T03:09:39Z",
    "updated": "2025-09-28T13:06:27Z",
    "categories": [
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.comp-ph"
  },
  {
    "arxiv_id": "2504.03548v2",
    "url": "https://arxiv.org/abs/2504.03548v2",
    "pdf_url": "https://arxiv.org/pdf/2504.03548v2.pdf",
    "title": "Calculation and comparison of sensitivities in $0νββ$   experiments based on key parameters",
    "abstract": "Worldwide efforts are underway to detect neutrinoless double beta ($0\\nu\\beta\\beta$) decay using experiments based on various technologies and target isotopes. Future experiments in this regard aim to exclude the inverted order (IO) condition or explore the normal order (NO) band. Consequently, comparing the sensitivities of proposed $0\\nu\\beta\\beta$ decay experiments with promising prospects is essential. The current study adopts sensitivity metrics, including exclusion and discovery sensitivities, half-life sensitivities, and $m_{\\beta\\beta}$ sensitivities, to provide a comprehensive evaluation of ten typical promising experiments: LEGEND, CDEX, nEXO, XLZD, PandaX, NEXT, KamLAND-Zen, JUNO, SNO+, and CUPID, and highlight their unique features. Based on reported experimental parameters, the concept of a ``technical line'' is introduced to determine the location that each experiment may realize in the $\\xi$ and $\\lambda_{b}$ space, where $\\xi$ represents the sensitive exposure per year, and $\\lambda_{b}$ denotes the expected annual rate of background events. Half-life sensitivities for the selected experiments are calculated, some of them in multiple phases and others in conservative or aggressive condition. The results indicate that increasing the operation time is more beneficial for zero-background experiments, which also demonstrate greater competitiveness in discovery sensitivity. $m_{\\beta\\beta}$ sensitivities are presented as uncertainty bands arising from the nuclear matrix element uncertainties. Additionally, half-life and $m_{\\beta\\beta}$ sensitivities are estimated under ideal conditions also in the form of uncertainty bands, where only irreducible $2\\nu\\beta\\beta$ and solar B-8 neutrino induced background remain.",
    "authors": [
      "X. Yu",
      "L. T. Yang",
      "Q. Yue",
      "H. Ma",
      "H. T. Wong"
    ],
    "published": "2025-04-04T15:53:46Z",
    "updated": "2025-09-28T06:27:47Z",
    "categories": [
      "nucl-ex",
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "nucl-ex",
    "doi": "10.1103/d6gx-944x"
  },
  {
    "arxiv_id": "2412.04722v2",
    "url": "https://arxiv.org/abs/2412.04722v2",
    "pdf_url": "https://arxiv.org/pdf/2412.04722v2.pdf",
    "title": "Thermal instability and multiphase dynamics in the ISM with polybaric   pressure effects",
    "abstract": "In this work, we have carried out a two-dimensional (2D) simulation of thermal instability (TI) in interstellar matter (ISM), considering it to be a weakly ionised inviscid plasma with radiation loss. We carry out the simulation using our multi-fluid flux-corrected transport (mFCT) code, which incorporates a background magnetic field and anisotropic pressure. The anisotropic pressure is modelled with a polybaric pressure model. The findings of our analysis are consistent with the contemporary status of knowledge about the multiphase nature of the ISM, with volume and mass fractions of the various components of the ISM, that is, warm, cold, and unstable neutral matter (UNM) in the ranges reported by various numerical and observational analyses. Though the strength of the background magnetic field only marginally affects the overall evolution, the ratio of the parallel and perpendicular pressures can considerably alter the mass and volume fractions of the three phases, which can affect the overall evolution of the TI in the long run.",
    "authors": [
      "Hitendra Sarkar",
      "Madhurjya P. Bora"
    ],
    "published": "2024-12-06T02:29:57Z",
    "updated": "2025-09-28T02:11:17Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.23569v1",
    "url": "https://arxiv.org/abs/2509.23569v1",
    "pdf_url": "https://arxiv.org/pdf/2509.23569v1.pdf",
    "title": "Microwave SQUID Multiplexer Readout Performance Using a Direct-RF   RFSoC-Based Software-Defined Radio",
    "abstract": "In this work, we report the experimental readout results of a {\\mu}MUX device using a Direct-RF SDR prototype based on the ZCU216 Radio-Frequency System-on-Chip (RFSoC) evaluation board. First, the analog performance of the SDR system was evaluated both in loopback and coupled to the cryogenic multiplexing system. Then, the SDR system performance was optimized for {\\mu}MUX readout, focusing on bolometric applications. Finally, the minimum demodulated flux noise was obtained through the optimally conditioned readout of a {\\mu}MUX channel. The results presented are comparable to those obtained with traditional SDR architectures and demonstrate that the Direct-RF SDR prototype is suitable for the readout of {\\mu}MUX devices. We anticipate that Direct-RF SDR technology will play a key role in enabling the next generation of SDR readout systems for frequency-multiplexed low-temperature detector arrays.",
    "authors": [
      "M. E. García Redondo",
      "J. D. Bonilla Neira",
      "N. A. Müller",
      "L. P. Ferreyro",
      "J. M. Geria",
      "T. Muscheid",
      "R. Gartmann",
      "A. Almela",
      "M. R. Hampel",
      "L. Ardila-Perez",
      "M. Wegner",
      "M. Platino",
      "O. Sander",
      "S. Kempf",
      "M. Weber"
    ],
    "published": "2025-09-28T01:59:37Z",
    "updated": "2025-09-28T01:59:37Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.23507v1",
    "url": "https://arxiv.org/abs/2509.23507v1",
    "pdf_url": "https://arxiv.org/pdf/2509.23507v1.pdf",
    "title": "Development of a microwave SQUID multiplexer for magnetic   microbolometers",
    "abstract": "The search for primordial B-modes in the cosmic microwave background (CMB) requires highly sensitive and scalable detector systems. The magnetic microbolometer (MMB) is an emerging detector concept that exploits the magnetic properties of paramagnetic materials at sub-kelvin temperatures, offering bolometers with a high dynamic range and low intrinsic noise. In recent years, the microwave SQUID multiplexer ($\\mu$MUX) has become a key technology to efficiently read large low temperature detector arrays, enabling the readout of hundreds to thousands of detectors over a single transmission line with low noise and minimal power dissipation while reducing the cryogenic setup complexity. In this work, we report the design, fabrication and characterization of a $\\mu$MUX optimized for MMB detectors and share our latest experimental results from a bolometer prototype. These findings provide valuable insight of the $\\mu$MUX in advancing next-generation CMB instrumentation and also demonstrate its suitability for novel detector technologies such as the MMB.",
    "authors": [
      "N. Müller",
      "J. Bonilla-Neira",
      "J. Geria",
      "M. García Redondo",
      "L. Ferreyro",
      "M. Hampel",
      "M. Wegner",
      "A. Almela",
      "S. Kempf"
    ],
    "published": "2025-09-27T21:31:04Z",
    "updated": "2025-09-27T21:31:04Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.supr-con"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.19729v2",
    "url": "https://arxiv.org/abs/2507.19729v2",
    "pdf_url": "https://arxiv.org/pdf/2507.19729v2.pdf",
    "title": "Semi-Implicit Continuum Kinetic Modeling of Weakly Collisional Parallel   Transport in a Magnetic Mirror",
    "abstract": "We present implicit-explicit (IMEX) kinetic simulations of weakly collisional parallel plasma transport in magnetic mirror configurations using the continuum code \\textsc{COGENT}. The numerical scheme employs a Jacobian-free Newton--Krylov method with algebraic multigrid preconditioning to overcome the severe time-step limitations imposed by strong mirror forces in fully explicit schemes. Applied to parameters relevant to the WHAM mirror experiment, the IMEX approach enables time steps up to $2.5 \\times 10^4$ times larger than those permitted by explicit methods, resulting in a 2500x speedup in 1D--2V simulations of parallel transport with kinetic ions and Boltzmann electrons. Additionally, a reduced bounce-averaged model for a square mirror is implemented to support the computationally intensive fully kinetic simulations. The bounce-averaged formulation is used to evaluate the numerical convergence of the velocity-space discretization algorithms and to assess the role of the collision model by comparing simulations employing the nonlinear Fokker--Planck and the simplified Lenard--Bernstein--Dougherty collision operators.",
    "authors": [
      "M. Dorf",
      "M. Dorr",
      "V. Geyko",
      "D. Ghosh",
      "M. Umansky",
      "J. Angus"
    ],
    "published": "2025-07-26T01:04:25Z",
    "updated": "2025-09-27T20:32:58Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.05228v2",
    "url": "https://arxiv.org/abs/2509.05228v2",
    "pdf_url": "https://arxiv.org/pdf/2509.05228v2.pdf",
    "title": "Design of a High-Average-Power Ferroelectric Phase Shifter",
    "abstract": "This paper describes performance of a voltage controlled phase shifter designed for a high average power and a high figure of merit. The device is a reflection-type, resonant phase shifter that utilizes ferroelectric capacitors and impedance matching to the port impedance. With state-of-the-art ferroelectric materials, the device achieves a high Figure of Merit of nearly a thousand degrees phase shift per dB insertion loss at 800 MHz, along with sub-microsecond response. This phase shifter is capable of handling average power up to a megawatt. Its application is expected to enhance the electrical efficiency of particle accelerators, reducing both capital and operating costs.",
    "authors": [
      "Ilan Ben-Zvi",
      "Alick Macpherson",
      "Samuel Smith"
    ],
    "published": "2025-09-05T16:45:20Z",
    "updated": "2025-09-27T20:01:29Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.23422v1",
    "url": "https://arxiv.org/abs/2509.23422v1",
    "pdf_url": "https://arxiv.org/pdf/2509.23422v1.pdf",
    "title": "Cryogenic Materials Repository: A Public Resource and New Measurements   for Cryogenic Research Applications",
    "abstract": "Low-temperature systems play a vital role in a variety of scientific research applications, including the next generation of cosmology and astrophysics telescopes. More ambitious cryogenic applications require precise estimates of the thermal conductivity of materials and thermal joints to meet project goals. We present the development of the Cryogenic Material Repository (CMR), a public GitHub repository of cryogenic material properties data created to support and enable researchers across scientific disciplines to accurately and efficiently design and assess cryogenic systems. We also present updated sub-Kelvin thermal conductivity results for select carbon fiber reinforced polymer and aluminum alloy samples.",
    "authors": [
      "Henry E. Nachman",
      "Oorie Desai",
      "Nicholas Galitzki",
      "Daniel Lee",
      "JB Lloyd",
      "Tannishtha Nandi",
      "Ani Pagni",
      "Ray Radebaugh",
      "Elle C. Shaw"
    ],
    "published": "2025-09-27T17:35:03Z",
    "updated": "2025-09-27T17:35:03Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2509.23294v1",
    "url": "https://arxiv.org/abs/2509.23294v1",
    "pdf_url": "https://arxiv.org/pdf/2509.23294v1.pdf",
    "title": "Programmable Focal Elongation and Shaping of High-Intensity Laser Pulses   using Adaptive Optics",
    "abstract": "Controlling the intensity distribution of laser pulses in the focal region is essential for optimizing optically generated plasma waveguides and enabling advanced plasma acceleration techniques, including dephasingless wakefield acceleration. Here, we present a method for programmatic structuring of the high-intensity focal region of a standard off-axis parabolic mirror, extending the length of this region well beyond the Rayleigh length and enabling control over the longitudinal intensity distribution. The theoretical framework is validated through numerical simulations and experimental measurements. Further, we demonstrate the use of this technique in an existing plasma accelerator system using readily available hardware components. Finally, we illustrate the potential application of this method to multi-GeV laser plasma acceleration and the generation of flying foci, research areas which would significantly benefit from improved programmatic structuring of high-intensity laser pulses.",
    "authors": [
      "P. Blum",
      "A. Puchert",
      "E. Archer",
      "S. Jalas",
      "S. W. Jolly",
      "J. Osterhoff",
      "W. P. Leemans",
      "M. Kirchen",
      "A. R. Maier",
      "R. J. Shalloo"
    ],
    "published": "2025-09-27T13:11:48Z",
    "updated": "2025-09-27T13:11:48Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2504.19090v2",
    "url": "https://arxiv.org/abs/2504.19090v2",
    "pdf_url": "https://arxiv.org/pdf/2504.19090v2.pdf",
    "title": "The Imaging Time-of-Propagation Detector at Belle II",
    "abstract": "We report on the construction, operation, and performance of the Time-of-Propagation detector with imaging used for the Belle II experiment running at the Super-KEKB $e^+e^-$ collider. This detector is located in the central barrel region and uses Cherenkov light to provide particle identification among hadrons. The Cherenkov light is radiated in highly polished bars of synthetic fused silica (quartz) and transported to the ends of the bars via total internal reflection. One bar end is instrumented with finely segmented micro-channel-plate photomultiplier tubes to record the light, while the other end has a mirror attached to reflect the photons back to the instrumented end. Both the propagation times and hit positions of the Cherenkov photons are measured; these depend on the Cherenkov angle and together provide good discrimination among charged pions, kaons, and protons with momenta up to around 4 GeV/$c$. To date, the detector has been used to record and analyze almost 600 fb$^{-1}$ of Belle II data.",
    "authors": [
      "Hulya Atmacan",
      "Matt Belhorn",
      "Yinghui Guan",
      "Longke Li",
      "Bilas Pal",
      "Saurabh Sandilya",
      "Alan Schwartz",
      "Boqun Wang",
      "Shun Watanuki",
      "Matthew Andrew",
      "Matthew Barrett",
      "Martin Bessner",
      "Thomas Browder",
      "J. Bynes",
      "J. Cercillieux",
      "Shawn Dubey",
      "Oskar Hartbrich",
      "Chris Ketter",
      "Brian Kirby",
      "Shahab Kohani",
      "D. Kotchetkov",
      "Luca Macchiarulo",
      "B. Macek",
      "Kurtis Nishimura",
      "H. Purwar",
      "Z. Sang",
      "V. Shebalin",
      "S. Tripathy",
      "Gary Varner",
      "K. Yoshihara",
      "T. Kohriki",
      "X. Wang",
      "S. P. Maharana",
      "V. S. Vismaya",
      "Gerard Visser",
      "Alessandro Gaz",
      "Stefano Lacaprara",
      "R. Stroili",
      "Ezio Torassa",
      "Roberto Mussa",
      "Umberto Tamponi",
      "Peter Krizan",
      "Samo Korpar",
      "Tara Nanut",
      "A. Novosel",
      "Marko Petric",
      "L. Rizzuto",
      "Marko Staric",
      "Lucien Cremaldi",
      "David Sanders",
      "Y. Adachi",
      "Y. Arita",
      "D. Furumura",
      "S. Hara",
      "T. Hayakawa",
      "S. Hirose",
      "Y. Horii",
      "Toru Iijima",
      "Kenji Inami",
      "Y. Ito",
      "Y. Kato",
      "N. Kiribe",
      "R. Koga",
      "K. Kojima",
      "A. Maeda",
      "Y. Maeda",
      "K. Maehara",
      "R. Maeshima",
      "Kodai Matsuoka",
      "G. Muroyama",
      "T. Nakano",
      "R. Okubo",
      "R. Okuto",
      "R. Omori",
      "S. Senga",
      "K. Suzuki",
      "H. Takeichi",
      "N. Tsuzuki",
      "T. Yonekura",
      "R. Conrad",
      "James Fast",
      "Brian Fulsom",
      "Jan Strube",
      "Lynn Wood",
      "I. Danko",
      "T. Gu",
      "N. Herring",
      "N. K. Nisar",
      "S. Roffe",
      "Vladimir Savinov",
      "E. Wang",
      "Vishal Bhardwaj",
      "Alyssa Loos",
      "Milind Purohit",
      "Carl Rosenfeld"
    ],
    "published": "2025-04-27T03:09:56Z",
    "updated": "2025-09-27T12:25:17Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1016/j.nima.2025.170627"
  },
  {
    "arxiv_id": "2505.06770v3",
    "url": "https://arxiv.org/abs/2505.06770v3",
    "pdf_url": "https://arxiv.org/pdf/2505.06770v3.pdf",
    "title": "Adjusting optical cavity birefringence with wavelength tunable laser for   axion searches",
    "abstract": "Axions have attracted attention as promising candidates for dark matter (DM). Although axions have been intensively searched for, they have not been observed yet. Recently, novel experiments to search for axion DM have been proposed that use optical cavities to amplify polarization rotation of laser light induced by the axion-photon interaction. One such experiment employs a ring cavity composed of four mirrors. However, its sensitivity to the axion-photon coupling $g_{a\\gamma}$ in the low axion mass region is limited due to a reflection phase difference between s- and p-polarizations. In this paper, we propose a new method to improve the sensitivity using zero-phase shift mirrors and a wavelength tunable laser. Moreover, the laser makes it easier to scan the high axion mass region by tuning the reflection phase difference between s- and p-polarizations. We experimentally confirmed that the phase difference generated upon reflection on a zero phase shift mirror satisfied the requirement of $8.6 \\times 10^{-3}~\\mathrm{deg}$, which corresponds to the half width at half maximum (HWHM) of the cavity for p-polarization with the mirror fixed on a folded cavity and a wavelength tunable laser.",
    "authors": [
      "Hinata Takidera",
      "Hiroki Fujimoto",
      "Yuka Oshima",
      "Satoru Takano",
      "Kentaro Komori",
      "Tomohiro Fujita",
      "Ippei Obata",
      "Masaki Ando",
      "Yuta Michimura"
    ],
    "published": "2025-05-10T22:31:11Z",
    "updated": "2025-09-27T11:47:43Z",
    "categories": [
      "hep-ex",
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1103/5pw8-zxmc"
  },
  {
    "arxiv_id": "2302.12180v3",
    "url": "https://arxiv.org/abs/2302.12180v3",
    "pdf_url": "https://arxiv.org/pdf/2302.12180v3.pdf",
    "title": "Development of advanced photon calibrator for Kamioka gravitational wave   detector (KAGRA)",
    "abstract": "The Kamioka Gravitational wave detector (KAGRA) cryogenic gravitational-wave observatory has commenced joint observations with the worldwide gravitational wave detector network. Precise calibration of the detector response is essential for accurately estimating parameters of gravitational wave sources. A photon calibrator is a crucial calibration tool used in laser interferometer gravitational-wave observatory, Virgo, and KAGRA, and it was utilized in joint observation 3 with GEO600 in Germany in April 2020. In this paper, KAGRA implemented three key enhancements: a high-power laser, a power stabilization system, and remote beam position control. KAGRA employs a 20 W laser divided into two beams that are injected onto the mirror surface. By utilizing a high-power laser, the response of the detector at kHz frequencies can be calibrated. To independently control the power of each laser beam, an optical follower servo was installed for power stabilization. The optical path of the photon calibrator beam positions was controlled using pico-motors, allowing for the characterization of the detector rotation response. Additionally, a telephoto camera and quadrant photodetectors were installed to monitor beam positions, and beam position control was implemented to optimize the mirror response. In this paper, we discuss the statistical errors associated with the measurement of relative power noise. We also address systematic errors related to the power calibration model of the photon calibrator and the simulation of elastic deformation effects using finite element analysis. Ultimately, we have successfully reduced the total systematic error from the photon calibrator to 2.0 /%.",
    "authors": [
      "Y. Inoue",
      "B. H. Hsieh",
      "K. H. Chen",
      "Y. K. Chu",
      "K. Ito",
      "C. Kozakai",
      "T. Shishido",
      "Y. Tomigami",
      "T. Akutsu",
      "S. Haino",
      "K. Izumi",
      "T. Kajita",
      "N. Kanda",
      "C. S. Lin",
      "F. K. Lin",
      "Y. Moriwaki",
      "W. Ogaki",
      "H. F. Pang",
      "T. Sawada",
      "T. Tomaru",
      "T. Suzuki",
      "S. Tsuchida",
      "T. Ushiba",
      "T. Washimi",
      "T. Yamamoto",
      "T. Yokozawa"
    ],
    "published": "2023-02-23T17:23:01Z",
    "updated": "2025-09-27T08:18:41Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM",
    "doi": "10.1063/5.0147888"
  },
  {
    "arxiv_id": "2509.23172v1",
    "url": "https://arxiv.org/abs/2509.23172v1",
    "pdf_url": "https://arxiv.org/pdf/2509.23172v1.pdf",
    "title": "CHRONOS: Cryogenic sub-Hz cROss torsion bar detector with quantum   NOn-demolition Speed meter",
    "abstract": "We propose a next-generation ground-based gravitational-wave detector, the Cryogenic sub-Hz cROss torsion-bar detector with quantum NOn-demolition Speed meter (CHRONOS), optimized for the unexplored 0.1-10Hz band bridging the gap between the space-based LISA and future ground-based detectors such as Cosmic Explorer and the Einstein Telescope. CHRONOS combines a ring-cavity Sagnac interferometer with torsion-bar test masses to realize the first quantum nondemolition (QND) measurement of angular momentum in a macroscopic system. By implementing a speed-meter readout in the rotational degree of freedom, CHRONOS coherently cancels quantum radiation-pressure noise and enables sub-Hz observations. We show that detuned power recycling and cavity-length optimization can simultaneously relax technical requirements on both torsion bars and speed meters. Assuming a realistic optical design with a 1m torsion bar, we estimate strain sensitivities of $h \\simeq 1 \\times 10^{-18}\\mathrm{Hz}^{-1/2}$ at 1Hz for detectors with arm lengths of 2.5m, 40m, and 300m. These sensitivities enable (i) direct detection of intermediate-mass black hole binaries up to 380Mpc with ${\\rm SNR}=3$, (ii) probing stochastic gravitational-wave backgrounds down to $\\Omega_{\\rm GW} \\sim 3.2 \\times 10^{-9}$ at 0.2Hz with 5yr accumulation. Furthermore, CHRONOS enables prompt detection of gravity-gradient signals from magnitude-5.5 earthquakes even with a 2.5m prototype. CHRONOS thus opens new opportunities for quantum-limited geophysical observation and multi-band, multi-messenger gravitational-wave astronomy.",
    "authors": [
      "Yuki Inoue",
      "Hsiang-Chieh Hsu",
      "Hsiang-Yu Huang",
      "M. Afif Ismail",
      "Vivek Kumar",
      "Miftahul Ma'arif",
      "Avani Patel",
      "Daiki Tanabe",
      "Henry Tsz-King Wong",
      "Da-Chun Yu"
    ],
    "published": "2025-09-27T08:04:34Z",
    "updated": "2025-09-27T08:04:34Z",
    "categories": [
      "astro-ph.IM",
      "gr-qc",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2509.17379v2",
    "url": "https://arxiv.org/abs/2509.17379v2",
    "pdf_url": "https://arxiv.org/pdf/2509.17379v2.pdf",
    "title": "Negative charge acquisition by isolated single microdroplets from plasma   exposure at atmospheric pressure",
    "abstract": "Charged liquid microdroplets have generated significant interest recently due to the observation of chemical reaction rate enhancement by orders of magnitude. Droplet charging by plasma irradiation has been observed along with significantly enhanced reaction rates in liquid. In this paper we measure the charge on fixed size (47 $\\mu$m) individual droplets, exposed for approximately 4 ms to a low temperature RF-driven plasma operated at atmospheric pressure. The measured charge values (0.8 - 2.0 $\\times 10^{7}$ electrons) approached the Rayleigh limit for the given droplet diameter. Results were compared with finite element simulations of plasma charging which provided estimates of surface electric fields and charge fluxes to the droplet surface and helps advance the development of a theoretical framework for plasma-charged microreactors.",
    "authors": [
      "Nourhan Hendawy",
      "Harold McQuaid",
      "Somhairle Mag Uidhir",
      "David Rutherford",
      "Declan Diver",
      "Davide Mariotti",
      "Paul Maguire"
    ],
    "published": "2025-09-22T06:38:07Z",
    "updated": "2025-09-27T07:15:38Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.23080v1",
    "url": "https://arxiv.org/abs/2509.23080v1",
    "pdf_url": "https://arxiv.org/pdf/2509.23080v1.pdf",
    "title": "Control of kinetic plasma instabilities by laser fields",
    "abstract": "We study the possibility of controlling kinetic plasma instabilities by using lasers to apply external electromagnetic fields. We derive the dispersion relation for the corresponding mathematical description, a reduced Vlasov--Maxwell system, by extending the well-known Penrose condition. It is observed that, under very mild assumptions, the dispersion relation decouples into two parts. The first part is identical to the classic Penrose condition for the Vlasov--Poisson system, while the second part describes the influence of the laser on the transverse dynamics (e.g. a Weibel instability). In particular, this means that the longitudinal dynamics (e.g. a two-stream instability) can not be stabilized in this manner as far as linear theory is concerned. We show, however, that nonlinear effects can be used to couple the two parts and achieve effective control. This is done by determining the control parameters (i.e. the form of the external electric and magnetic fields) by solving a PDE-constrained optimization problem.",
    "authors": [
      "Nicolas Crouseilles",
      "Lukas Einkemmer",
      "Qin Li",
      "Uri Shumlak",
      "Yukun Yue"
    ],
    "published": "2025-09-27T03:25:07Z",
    "updated": "2025-09-27T03:25:07Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.23039v1",
    "url": "https://arxiv.org/abs/2509.23039v1",
    "pdf_url": "https://arxiv.org/pdf/2509.23039v1.pdf",
    "title": "Angular Resolution Enhancement of Electron Backscatter Diffraction   Patterns",
    "abstract": "We present a simple 'shift-and-add' based improvement in the angular resolution of single electron backscatter diffraction (EBSD) patterns. Sub-pixel image registration is used to measure the (sub-pixel) difference in projection parameters for patterns collected within a map, and then the pattern is shifted and added together. The resultant EBSD-pattern is shown to contain more angular information than a long-exposure single pattern, via 2D Fast Fourier Transform (FFT)-based analysis. In particular, this method has the potential to enhance the scope of small compact direct electron detectors (DEDs).",
    "authors": [
      "Ben Britton",
      "Tianbi Zhang"
    ],
    "published": "2025-09-27T01:32:25Z",
    "updated": "2025-09-27T01:32:25Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.20390v2",
    "url": "https://arxiv.org/abs/2509.20390v2",
    "pdf_url": "https://arxiv.org/pdf/2509.20390v2.pdf",
    "title": "Optical characterization of wavelength-shifting and   scintillating-wavelength-shifting fibers",
    "abstract": "We report results of optical characterizations of new wavelength-shifting and scintillating-wavelength-shifting fibers EJ-182 and EJ-160 from Eljen Technology and compare them to the wavelength-shifting fiber BCF-91A from Saint-Gobain. The wavelength-dependence of attenuation was derived from spectral measurements confirming that the long attenuation length increases with wavelength, while short attenuation effects become less significant at longer wavelengths. The impact of environmental refractive index was measured by immersing a fiber in water. Immersing the fibers in water reduced the light yield and led to a suppression of the short attenuation length, consistent with the expected decrease in the refractive index contrast.",
    "authors": [
      "W. Bae",
      "J. Cesar",
      "K. Chen",
      "J. Cho",
      "D. Du",
      "J. Edgar",
      "L. Earthman",
      "O. M. Falana",
      "M. Gajda",
      "C. Hurlbut",
      "M. Jackson",
      "K. Lang",
      "C. Lee",
      "J. Y. Lee",
      "E. Liang",
      "J. Liu",
      "C. Maxwell",
      "C. Murthy",
      "D. Myers",
      "S. Nguyen",
      "T. O'Brien",
      "M. Proga",
      "T. Rodriguez",
      "S. Syed",
      "M. Zalikha",
      "J. Zey"
    ],
    "published": "2025-09-22T22:15:06Z",
    "updated": "2025-09-26T22:32:07Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.14400v2",
    "url": "https://arxiv.org/abs/2509.14400v2",
    "pdf_url": "https://arxiv.org/pdf/2509.14400v2.pdf",
    "title": "Electron Inertia and Magnetic Reconnection",
    "abstract": "The finite electron mass can cause magnetic reconnection even in the absence of any other non-ideal effect. It will be shown that when electron inertia is the only non-ideal effect in the evolution of a magnetic field $\\vec{B}$, there is a related field that evolves ideally. This field is $\\vec{\\mathcal{B}} \\equiv \\vec{B} + \\vec{\\nabla}\\times \\left( (c/\\omega_{pe})^2\\mu_0\\vec{j} \\right)$ with $\\omega_{pe}$ the plasma frequency and $\\vec{j}$ the current density. In three dimensional space, the practical importance of the ideal evolution of $\\vec{\\mathcal{B}}$ on its reconnection appears limited. When the evolution velocity of modified field is chaotic, $\\vec{\\mathcal{B}}$ will reconnect on a timescale that depends only logarithmically on any non-ideal effect that is diffusive, such as resistivity, with a current density enhancement that is also proportional to the logarithm. In near ideal magnetic fields, this logarithm is typically of order ten, and it is difficult to conceive of a physically realistic situation in which it larger than a hundred.",
    "authors": [
      "Allen H Boozer"
    ],
    "published": "2025-09-17T20:02:37Z",
    "updated": "2025-09-26T22:23:29Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.22948v1",
    "url": "https://arxiv.org/abs/2509.22948v1",
    "pdf_url": "https://arxiv.org/pdf/2509.22948v1.pdf",
    "title": "On the mechanism of Pedestal Relaxation Events -- Insights gained by   turbulence simulations with GRILLIX",
    "abstract": "Pedestal Relaxation Events (PREs) appear in I-mode discharges close to the I-H transition. Although they show certain similarities with Edge Localised Modes (ELMs), i.e. periodic energy ejections, the underlying mechanism seems to be very different from the mechanism responsible for ELMs. In this manuscript, we present global trans-collisional fluid simulations of an I-mode discharge in ASDEX Upgrade using GRILLIX. We observe multiple PREs during the simulation, which reproduce a range of experimentally observed PRE characteristics. Furthermore, a detailed analysis of various mode properties in our simulation allows us to pinpoint the underlying mechanism responsible for triggering PREs to Micro-Tearing Modes (MTMs). The system is analysed dynamically by evaluating density and electron temperature gradient lengths at the OMP position, where the MTM is located and grows over time. The path taken by the system in gradient length space is compared to a growth-rate estimate calculated by linear theory in simplified slab geometry, providing excellent agreement. Building on these insights, we sketch a qualitative picture of a full PRE cycle. Finally, we discuss the influence of the recently implemented Landau-fluid closure and the challenges of simulating low collisionality regimes with trans-collisional fluid models, like the one employed by GRILLIX.",
    "authors": [
      "Christoph Pitzal",
      "Andreas Stegmeir",
      "Tim Happel",
      "Kaiyu Zhang",
      "Konrad Eder",
      "Wladimir Zholobenko",
      "Philipp Ulbl",
      "Manuel Herschel",
      "Frank Jenko",
      "The ASDEX Upgrade Team"
    ],
    "published": "2025-09-26T21:29:34Z",
    "updated": "2025-09-26T21:29:34Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2505.21415v2",
    "url": "https://arxiv.org/abs/2505.21415v2",
    "pdf_url": "https://arxiv.org/pdf/2505.21415v2.pdf",
    "title": "Efficient production of sodium Bose-Einstein condensates in a hybrid   trap",
    "abstract": "We describe an apparatus that efficiently produces $^{23}$Na Bose-Einstein condensates (BECs) in a hybrid trap that combines a quadrupole magnetic field with a far-detuned optical dipole trap. Using a Bayesian optimization framework, we systematically optimize all BEC production parameters in modest sized batches of highly correlated parameters. Furthermore, we introduce a Lagrange multiplier-based technique to optimize the duration of different evaporation stages constrained to have a fixed total duration; this enables the progressive creation of increasingly rapid experimental sequences that still generate high quality BECs. Taken together, our techniques constitute a general approach for refining and accelerating sequence-based experimental protocols.",
    "authors": [
      "Yanda Geng",
      "Shouvik Mukherjee",
      "Swarnav Banik",
      "Monica Gutierrez Galan",
      "Madison J. Anderson",
      "Hector Sosa-Martinez",
      "Stephen P. Eckel",
      "Ian B. Spielman",
      "Gretchen K. Campbell"
    ],
    "published": "2025-05-27T16:41:44Z",
    "updated": "2025-09-26T21:03:08Z",
    "categories": [
      "cond-mat.quant-gas",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.quant-gas",
    "doi": "10.1063/5.0279068"
  },
  {
    "arxiv_id": "2509.22804v1",
    "url": "https://arxiv.org/abs/2509.22804v1",
    "pdf_url": "https://arxiv.org/pdf/2509.22804v1.pdf",
    "title": "Ultralow-Temperature Cryogenic Transmission Electron Microscopy Using a   New Helium Flow Cryostat Stage",
    "abstract": "Advances in cryogenic electron microscopy have opened new avenues for probing quantum phenomena in correlated materials. This study reports the installation and performance of a new side-entry condenZero cryogenic cooling system for JEOL (Scanning) Transmission Electron Microscopes (S/TEM), utilizing compressed liquid helium (LHe) and designed for imaging and spectroscopy at ultra-low temperatures. The system includes an external dewar mounted on a vibration-damping stage and a pressurized, low-noise helium transfer line with a remotely controllable needle valve, ensuring stable and efficient LHe flow with minimal thermal and mechanical noise. Performance evaluation demonstrates a stable base temperature of 6.58 K measured using a Cernox bare chip sensor on the holder with temperature fluctuations within 0.04 K. Complementary in-situ electron energy-loss spectroscopy (EELS) via aluminum bulk plasmon analysis was used to measure the local specimen temperature and validate cryogenic operation during experiments. The integration of cryogenic cooling with other microscopy techniques, including electron diffraction and Lorentz TEM, was demonstrated by resolving charge density wave (CDW) transitions in NbSe2 using electron diffraction, and imaging nanometric magnetic skyrmions in MnSi via Lorentz TEM. This platform provides reliable cryogenic operation below 7 K, establishing a low-drift route for direct visualization of electronic and magnetic phase transformations in quantum materials.",
    "authors": [
      "Young-Hoon Kim",
      "Fehmi Sami Yasin",
      "Na Yeon Kim",
      "Max Birch",
      "Xiuzhen Yu",
      "Akiko Kikkawa",
      "Yasujiro Taguchi",
      "Jiaqiang Yan",
      "Miaofang Chi"
    ],
    "published": "2025-09-26T18:09:55Z",
    "updated": "2025-09-26T18:09:55Z",
    "categories": [
      "cond-mat.str-el",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "cond-mat.str-el"
  },
  {
    "arxiv_id": "2507.06756v2",
    "url": "https://arxiv.org/abs/2507.06756v2",
    "pdf_url": "https://arxiv.org/pdf/2507.06756v2.pdf",
    "title": "Investigating the convergence properties of iterative ptychography for   atomic-resolution low-dose imaging",
    "abstract": "This study investigates the convergence properties of a collection of iterative electron ptychography methods, under low electron doses ($<$ 10$^3$ $e^-/A^2$) and gives particular attention to the impact of the user-defined update strengths. We demonstrate that carefully chosen values for this parameter, ideally smaller than those conventionally met in the literature, are essential for achieving accurate reconstructions of the projected electrostatic potential. Using a 4D dataset of a thin hybrid organic-inorganic formamidinium lead bromide (FAPbBr$_{3}$) sample, we show that convergence is in practice achievable only when the update strengths for both the object and probe are relatively small compared to what is found in literature. Additionally we demonstrate that under low electron doses, the reconstructions initial error increases when the update strength coefficients are reduced below a certain threshold emphasizing the existence of critical values beyond which the algorithms are trapped in local minima. These findings highlight the need for carefully optimized reconstruction parameters in iterative ptychography, especially when working with low electron doses, ensuring both effective convergence and correctness of the result.",
    "authors": [
      "Tamazouzt Chennit",
      "Songge Li",
      "Hoelen L. Lalandec Robert",
      "Christoph Hofer",
      "Nadine J. Schrenker",
      "Liberato Manna",
      "Sara Bals",
      "Timothy J. Pennycook",
      "Jo Verbeeck"
    ],
    "published": "2025-07-09T11:27:47Z",
    "updated": "2025-09-26T17:16:16Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2509.22586v1",
    "url": "https://arxiv.org/abs/2509.22586v1",
    "pdf_url": "https://arxiv.org/pdf/2509.22586v1.pdf",
    "title": "How to image single isolated atoms by using coherent low-energy   electrons",
    "abstract": "Coherent low-energy electrons have been demonstrated as a practical tool for imaging individual macromolecules and two-dimensional (2D) crystals. Low-energy electrons exhibit unique properties: low radiation damage to biological molecules and high sensitivity to the local potentials. In this study, we outline the conditions at which single isolated charge-free atoms can be imaged by low-energy electron holography. A single atom produces an interference pattern consisting of concentric fringes of finite diameter and of very weak intensity. The diffraction angle theta, determined as the first minimum of the concentric rings interference pattern, exhibits similar dependency on the source-to-sample distance zs as sin(theta) ~ 0.3/sqrt(zs) for electrons of different energies (50, 100 and 200 eV) and scattered off different elements (Li, C, and Cs). The results are compared to the recently reported experimental holograms of alkali atoms intercalated into bilayer graphene and adsorbed on top of graphene.",
    "authors": [
      "Tatiana Latychevskaia"
    ],
    "published": "2025-09-26T17:04:45Z",
    "updated": "2025-09-26T17:04:45Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mtrl-sci",
      "cond-mat.other",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1515/mim-2025-0018/html"
  },
  {
    "arxiv_id": "2509.22503v1",
    "url": "https://arxiv.org/abs/2509.22503v1",
    "pdf_url": "https://arxiv.org/pdf/2509.22503v1.pdf",
    "title": "A Quantum Algorithm for Nonlinear Electromagnetic Fluid Dynamics via   Koopman-von Neumann Linearization",
    "abstract": "To simulate plasma phenomena, large-scale computational resources have been employed in developing high-precision and high-resolution plasma simulations. One of the main obstacles in plasma simulations is the requirement of computational resources that scale polynomially with the number of spatial grids, which poses a significant challenge for large-scale modeling. To address this issue, this study presents a quantum algorithm for simulating the nonlinear electromagnetic fluid dynamics that govern space plasmas. We map it, by applying Koopman-von Neumann linearization, to the Schr\\\"{o}dinger equation and evolve the system using Hamiltonian simulation via quantum singular value transformation. Our algorithm scales $O \\left(s N_x \\, \\mathrm{polylog} \\left( N_x \\right) T \\right)$ in time complexity with $s$, $N_x$, and $T$ being the spatial dimension, the number of spatial grid points per dimension, and the evolution time, respectively. Comparing the scaling $O \\left( s N_x^s \\left(T^{5/4}+T N_x\\right) \\right)$ for the classical method with the finite volume scheme, this algorithm achieves polynomial speedup in $N_x$. The space complexity of this algorithm is exponentially reduced from $O\\left( s N_x^s \\right)$ to $O\\left( s \\, \\mathrm{polylog} \\left( N_x \\right) \\right)$. Numerical experiments validate that accurate solutions are attainable with smaller $m$ than theoretically anticipated and with practical values of $m$ and $R$, underscoring the feasibility of the approach. As a practical demonstration, the method accurately reproduces the Kelvin-Helmholtz instability, underscoring its capability to tackle more intricate nonlinear dynamics. These results suggest that quantum computing can offer a viable pathway to overcome the computational barriers of multiscale plasma modeling.",
    "authors": [
      "Hayato Higuchi",
      "Yuki Ito",
      "Kazuki Sakamoto",
      "Keisuke Fujii",
      "Akimasa Yoshikawa"
    ],
    "published": "2025-09-26T15:44:51Z",
    "updated": "2025-09-26T15:44:51Z",
    "categories": [
      "quant-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2508.18450v2",
    "url": "https://arxiv.org/abs/2508.18450v2",
    "pdf_url": "https://arxiv.org/pdf/2508.18450v2.pdf",
    "title": "Challenges and Optimization of Mu2e Proton Target Design with Radiative   Cooling",
    "abstract": "The Mu2e experiment at Fermilab will search for the charged lepton flavour violating process of coherent neutrinoless muon-to-electron conversion in the presence of an aluminum nucleus. The muons are produced by an 8 GeV proton beam from the Fermilab Booster striking a production target to create hadrons that decay to muons. The production target design space is strongly constrained by a required one-year operating lifetime and the need for radiative cooling in a vacuum. Uncertainties in the lifetime of the existing baseline design - a monolithic, segmented tungsten (WL10) target - are large, particularly due to unknown effects of radiation damage at the very high proton fluences expected in the experiment. We have begun evaluating a new design utilizing Inconel 718. Here, we present an engineering analysis of a prototype modular design. specifically thermal management, structural stability, fatigue lifetime, and fabrication changes. The results approve a promising new target design for the Mu2e experiment.",
    "authors": [
      "Z. Liu",
      "J. Williams",
      "A. Makovec",
      "M. Hedges",
      "F. Pellemoine",
      "K. Yonehara",
      "G. Annala",
      "K. Lynch",
      "M. Bloomer",
      "J. Popp",
      "A. Edmonds",
      "J. Miller"
    ],
    "published": "2025-08-25T20:00:02Z",
    "updated": "2025-09-26T15:19:33Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.18429/JACoW-MEDSI2025-THOB03"
  },
  {
    "arxiv_id": "2509.22409v1",
    "url": "https://arxiv.org/abs/2509.22409v1",
    "pdf_url": "https://arxiv.org/pdf/2509.22409v1.pdf",
    "title": "X-ray and neural network based in-situ identification of the melt pool   during the additive manufacturing of a stainless steel part",
    "abstract": "Laser Metal Deposition with Powder (LMDp) is an additive manufacturing technique used for repairing metal components or producing parts with intricate geometries. However, a comprehensive understanding of the melt pool dynamics, which significantly influences the final properties of LMDp-fabricated parts, remains limited. Non-destructive testing is highly valuable for conducting in-situ controls during manufacturing. X-ray imaging offers the ability to penetrate metallic parts and detect defects such as porosity. In the context of additive manufacturing, X-rays can be employed to visualize the shape of the melt pool during the fabrication process. The contrast between the liquid and solid phases, due to their density differences, should be observable in the radioscopy images. The experimental setup required to perform such a test on an industrial additive manufacturing installation consists of a movable X-ray source that produces polychromatic beams, a detector, and extensive lead shielding to ensure X-ray safety. In-situ observations of the melt pool were conducted during the deposition of ten successive layers of stainless steel 316L (SS316L). The polychromatic nature of the X-ray beam, however, rendered traditional image analysis methods ineffective for detecting contrast variations. To address this challenge, neural networks trained on simulated data (thermal and X-ray) were employed, providing a solution to identify the melt pool in low-contrast radioscopic images. The architecture inspired by VGG16 demonstrated promising results, confirming the potential for in-situ non-destructive testing using X-ray imaging in industrial additive manufacturing processes.",
    "authors": [
      "Loic Jegou",
      "Valerie Kaftandjian",
      "Thomas Elguedj",
      "Mohamed Tahraoui",
      "Philippe Duvauchelle",
      "Mady Guillemot"
    ],
    "published": "2025-09-26T14:36:03Z",
    "updated": "2025-09-26T14:36:03Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.22397v1",
    "url": "https://arxiv.org/abs/2509.22397v1",
    "pdf_url": "https://arxiv.org/pdf/2509.22397v1.pdf",
    "title": "From Concept to Reality: Additive Manufacturing in Particle Accelerator   and Storage Ring R&D at GSI and for FAIR",
    "abstract": "State-of-the-art additive manufacturing technologies are not only finding ever-wider applications in everyday life, but also assuming an increasingly important role in scientific research. This kind of advanced manufacturing method eliminates many of the constraints of conventional processes in fabricating components with complex external shapes or intricate internal structures, thereby providing enhanced flexibility for the design and realization of a new generation of more efficient particle accelerators and storage rings. The RACERS team initiated by the Stochastic Cooling Group at GSI, Germany, is worldwide one of the first teams working on this topic. Based on the metal 3D-printing technology, two novel accelerating structures and one efficient cooling plate for a future stochastic cooling system are under development at GSI and for the FAIR project, respectively. Some successful experience as well as learnt lessons will be presented.",
    "authors": [
      "Chuan Zhang",
      "Roland Böhm",
      "Eduard Boos",
      "Ramy Cherif",
      "Alexander Japs",
      "Stefan Wunderlich"
    ],
    "published": "2025-09-26T14:23:57Z",
    "updated": "2025-09-26T14:23:57Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  }
]