{
  "arxiv_id": "2507.20748v1",
  "url": "https://arxiv.org/abs/2507.20748v1",
  "pdf_url": "https://arxiv.org/pdf/2507.20748v1.pdf",
  "title": "Two-dimensional spatially resolved measurements of helium metastable   densities by tunable diode laser absorption spectroscopy in atmospheric   pressure RF plasma jets",
  "abstract": "Helium metastable species play a critical role in sustaining radio-frequency (RF) driven micro atmospheric pressure plasma jets through Penning ionization and for the generation of reactive oxygen and nitrogen species (RONS). Their densities are typically measured using tunable diode laser absorption spectroscopy (TDLAS). Most spatially resolved TDLAS approaches rely on mechanical scanning of a narrow laser beam across the plasma, which is time-consuming and limits spatial resolution. In this work, we present an advanced two-dimensional (2D) TDLAS method that enables direct spatial mapping of helium metastable densities without the need for mechanical scanning. A rotating optical diffuser is employed to suppress speckle interference and generate uniform illumination across the plasma region. The absorption profile is captured using a short-wavelength infrared camera equipped with a telecentric lens, achieving high spatial resolution (approximately 10 {\\mu}m) across the entire field of view. This approach significantly enhances both data quality and acquisition speed. The improved 2D TDLAS system is applied to measure helium metastable densities in plasma jets with structured electrodes driven by different tailored voltage waveforms. The results show very good qualitative agreement with fluid simulations and previously reported experimental data.",
  "authors": [
    "David A Schulenberg",
    "Xiao-Kun Wang",
    "Mate Vass",
    "Ihor Korolov",
    "Thomas Mussenbrock",
    "Julian Schulze"
  ],
  "published": "2025-07-28T11:57:42Z",
  "updated": "2025-07-28T11:57:42Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}