{
  "arxiv_id": "2507.22560v1",
  "url": "https://arxiv.org/abs/2507.22560v1",
  "pdf_url": "https://arxiv.org/pdf/2507.22560v1.pdf",
  "title": "Use of solid fused silica etalon with broadband metallic coatings for   calibration of high-resolution optical spectrograph",
  "abstract": "Wavelength calibration is a key factor for high-resolution spectroscopic measurements for precision radial velocities. Hollow-cathode lamps (e.g., ThAr), absorption cells (e.g., iodine cell), dielectric coated Fabry-P\\'erot etalons and laser frequency combs have been implemented over the years for precise wavelength calibration and wavelength drift measurements. However, due to their various impediments as wavelength calibrators, investigations of alternative methods remain of prime interest. In this paper, we examined the feasibility of low-cost (~ $1000) commercially available solid fused silica etalon with a broadband metallic coating as a calibrator. We studied the behaviour for two cavity spacings (free spectral range of 1/cm and 0.5/cm) with temperature from theoretical derivation and experimental data. Our setup had a temperature stability of 0.8 mK for a calibrator system using an off-the-shelf dewar flask with active stabilisation. Our result from radial velocity drift measurements demonstrated that such a calibration system is capable of providing higher signal-to-noise calibration and better nightly drift measurement relative to ThAr in the wavelength range between 470 nm and 780 nm. A similar result has been previously found for Fabry-P\\'erot etalons, and although the metalon solution lacks the efficiency of an etalon, it does offers a cost-effective broadband solution, which should be less prone to aging relative to complex dielectric mirror coatings. Nonetheless, long-term monitoring is required to understand the metalon behaviour in detail.",
  "authors": [
    "Supriyo Ghosh",
    "William Martin",
    "Kajal Kunverji",
    "Hugh R. A. Jones"
  ],
  "published": "2025-07-30T10:35:53Z",
  "updated": "2025-07-30T10:35:53Z",
  "categories": [
    "astro-ph.IM",
    "astro-ph.EP",
    "physics.ins-det",
    "physics.optics"
  ],
  "primary_category": "astro-ph.IM"
}