{
  "arxiv_id": "2505.01208v2",
  "url": "https://arxiv.org/abs/2505.01208v2",
  "pdf_url": "https://arxiv.org/pdf/2505.01208v2.pdf",
  "title": "Impact of magnetic field gradients on the development of the MRI: Applications to binary neutron star mergers and proto-planetary disks",
  "abstract": "The magneto-rotational instability (MRI) is widely believed to play a central role in generating large-scale, poloidal magnetic fields during binary neutron star mergers. However, the few simulations that begin with a weak seed magnetic field and capture its growth until saturation predominantly show the effects of small-scale turbulence and winding, but lack convincing evidence of MRI activity. In this work, we investigate how the MRI is affected by the complex magnetic field topologies characteristic of the post-merger phase, aiming to assess the actual feasibility of MRI in such environments. We first derive the MRI instability criterion, as well as expressions for the characteristic wavelength and growth timescale of the fastest-growing modes, under conditions that include significant magnetic field gradients. Our analysis reveals that strong radial magnetic field gradients can impact significantly on the MRI, slowing its growth or suppressing it entirely if large enough. We then apply this extended framework to both idealized analytical disk models and data from a numerical relativity simulation of a long-lived neutron star merger remnant. We find that conditions favourable to MRI growth on astrophysically relevant timescales may occur only in limited regions of the post-merger disk, and only at late times $t\\gtrsim 100$ ms after the merger. These results suggest that the MRI plays a limited role in amplifying poloidal magnetic fields in post-merger environments during the first $\\mathcal{O}(100)$ms.",
  "authors": [
    "T. Celora",
    "C. Palenzuela",
    "D. Viganò",
    "R. Aguilera-Miret"
  ],
  "published": "2025-05-02T11:51:35Z",
  "updated": "2025-12-02T15:27:36Z",
  "categories": [
    "astro-ph.HE",
    "gr-qc",
    "physics.flu-dyn",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.HE",
  "doi": "10.1051/0004-6361/202555395"
}