{
  "arxiv_id": "2512.03443v1",
  "url": "https://arxiv.org/abs/2512.03443v1",
  "pdf_url": "https://arxiv.org/pdf/2512.03443v1.pdf",
  "title": "Subgrid Mean-field Dynamo Model with Dynamical Quenching in General Relativistic Magnetohydrodynamic Simulations",
  "abstract": "Large-scale magnetic fields are relevant for a number of dynamical processes in accretion disks, including driving turbulence, reconnection events, and launching outflows. Numerical simulations have indicated that the initial strengths and configurations of the large-scale magnetic fields have a direct imprint on the outcome of an accretion disk evolution. To facilitate future self-consistent simulations that include intrinsic dynamo processes, we derive and implement a subgrid model of a helical large-scale dynamo with dynamical quenching in general-relativistic resistive magnetohydrodynamical simulations of geometrically thin accretion disks. By incorporating previous numerical and analytical results of helical dynamos, our model features only one input parameter, the viscosity parameter $α_\\text{SS}$. We demonstrate that our model can reproduce butterfly diagrams seen in previous local and global simulations. With rather aggressive parameter choice of $α_\\text{SS}=0.02$ and black hole spin $a_\\text{BH}=0.9375$, our thin-disk model launches weak collimated polar outflows with Lorentz factor $\\simeq 1.2$, but no polar outflow is present with less vigorous turbulence or less positive $a_\\text{BH}$. With negative $a_\\text{BH}$, we find the field configurations to appear more similar to Newtonian cases, whereas for positive $a_\\text{BH}$, the poloidal field loops become distorted and the cycle period becomes sporadic or even disappears. Moreover, we demonstrate how $α_\\text{SS}$ can avoid to be prescribed and instead be determined by the local plasma beta. Such a fully dynamical subgrid dynamo allows for self-consistent amplification of the large-scale magnetic fields.",
  "authors": [
    "Hongzhe Zhou",
    "Yosuke Mizuno",
    "Zhenyu Zhu"
  ],
  "published": "2025-12-03T04:51:53Z",
  "updated": "2025-12-03T04:51:53Z",
  "categories": [
    "astro-ph.HE",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.HE"
}