{
  "arxiv_id": "2512.03007v1",
  "url": "https://arxiv.org/abs/2512.03007v1",
  "pdf_url": "https://arxiv.org/pdf/2512.03007v1.pdf",
  "title": "Generation of strong ultralow-phase-noise microwave fields with tunable ellipticity for ultracold polar molecules",
  "abstract": "Microwave(MW) fields with strong field strength, ultralow phase-noise and tunable polarization are crucial for stabilizing and manipulating ultracold polar molecules, which have emerged as a promising platform for quantum sciences. In this letter, we present the design, characterization, and performance of a robust MW setup tailored for precise control of molecular states. This setup achieves a high electric field intensity of 6.9 kV/m in the near-field from a dual-feed waveguide antenna, enabling a Rabi frequency as high as 71 MHz for the rotational transition of sodium-potassium molecules. In addition, the low noise signal source and controlled electronics provide ultralow phase-noise and dynamically tunable polarization. Narrow-band filters within the MW circuitry further reduce phase-noise by more than 20 dB at 20 MHz offset frequency, ensuring prolonged one-body molecular lifetimes up to 10 seconds. We also show practical methods to measure the MW field strength and polarization using a simple homemade dipole probe, and to characterize phase-noise down to -170 dBc/Hz with a commercial spectrum analyser and a notch filter. Those capabilities allowed us to evaporatively cool our molecular sample to deep quantum degeneracy. Furthermore, the polarization tunability enabled the observation of field-linked resonances and facilitated the creation of field-linked tetramers.These techniques advance the study of ultracold polar molecules and broaden the potential applications of MW tools in other platforms of quantum sciences.",
  "authors": [
    "Shrestha Biswas",
    "Sebastian Eppelt",
    "Christian Buchberger",
    "Xing-Yan Chen",
    "Andreas Schindewolf",
    "Michael Hani",
    "Erwin Biebl",
    "Immanuel Bloch",
    "Xin-Yu Luo"
  ],
  "published": "2025-12-02T18:32:11Z",
  "updated": "2025-12-02T18:32:11Z",
  "categories": [
    "physics.atom-ph",
    "cond-mat.quant-gas",
    "physics.ins-det"
  ],
  "primary_category": "physics.atom-ph"
}