{
  "arxiv_id": "2512.03165v1",
  "url": "https://arxiv.org/abs/2512.03165v1",
  "pdf_url": "https://arxiv.org/pdf/2512.03165v1.pdf",
  "title": "Energetic-particle orbits near rational flux surfaces in stellarators: I. Passing particles",
  "abstract": "Recent simulations have shown that, even when the magnetic field of a stellarator possesses nested toroidal flux surfaces, the orbits of passing energetic particles can exhibit islands. These 'drift islands' arise near rational flux surfaces, where they are likely to enhance alpha-particle transport -- flattening the alpha density profile locally -- unless they can be avoided by suitable design of the stellarator magnetic field. To investigate how this might be achieved, we derive an equation for the drift-island shape in a general stellarator. This result follows from the solution to a more fundamental problem: that of calculating the orbits of passing particles near a rational flux surface. We show that these orbits are determined by conservation of an adiabatic invariant associated with the closed rational-surface field lines. We use this 'transit adiabatic invariant' to prove that there are no drift islands, for all passing particles, if and only if the magnetic field satisfies a weaker version of the Cary-Shasharina condition for omnigeneity; we call such magnetic fields 'cyclometric'. The drift-island width scales as $\\sim (ρ_\\starδ/s)^{1/2} a$ ($ρ_\\star$ is the normalized gyroradius, $δ$ is the deviation from cyclometry, $s$ is the magnetic shear, and $a$ is the minor radius), so large drift islands could arise in low-shear stellarators that are insufficiently cyclometric. To ensure accurate results for very energetic particles, we compute higher-order corrections to the transit invariant. Our calculations agree extremely well with ASCOT5 guiding-centre and full-orbit simulations of alpha particles in reactor-scale equilibria, even at $3.5\\text{MeV}$. Finally, we show how our results can also be derived using Hamiltonian perturbation theory, which provides a systematic framework for calculating passing-particle orbits on both rational and irrational surfaces.",
  "authors": [
    "Thomas E. Foster",
    "Felix I. Parra",
    "Roscoe B. White",
    "José Luis Velasco",
    "Iván Calvo",
    "Elizabeth J. Paul"
  ],
  "published": "2025-12-02T19:11:24Z",
  "updated": "2025-12-02T19:11:24Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}