{
  "arxiv_id": "2512.23554v1",
  "url": "https://arxiv.org/abs/2512.23554v1",
  "pdf_url": "https://arxiv.org/pdf/2512.23554v1.pdf",
  "title": "An integrated quantitative single-objective light-sheet microscope for subcellular dynamics in embryos and cultured multicellular systems",
  "abstract": "Quantitative imaging of subcellular processes in living embryos, stem-cell systems, and organoid models requires microscopy platforms that combine high spatial resolution, fast volumetric acquisition, long-term stability, and minimal phototoxicity. Single-objective light-sheet approaches based on oblique plane microscopy (OPM) are well suited for live imaging in standard sample geometries, but most existing implementations lack the optical calibration, timing precision, and end-to-end integration required for reproducible quantitative measurements. Here we present a fully integrated and quantitatively characterized OPM platform engineered for dynamic studies of transcription and nuclear organization in embryos, embryonic stem cells, and three-dimensional culture systems. The system combines high numerical aperture remote refocusing with tilt-invariant light-sheet scanning and hardware-timed synchronization of laser excitation, galvo scanning, and camera readout. We provide a comprehensive characterization of the optical performance, including point spread function, sampling geometry, usable field of view, and system stability, establishing a well-defined framework for quantitative volumetric imaging. To support high-throughput operation, we developed a unified acquisition and reconstruction pipeline that enables real time volumetric imaging at hardware-limited rates while preserving deterministic timing and reproducible geometry. Using this platform, we demonstrate quantitative three-dimensional imaging of MS2-labeled transcription sites in living Drosophila embryos, cultured mouse embryonic stem cells, and mESC-derived gastruloids, enabling extraction of transcriptional intensity traces across diverse biological contexts. This work establishes OPM as a robust and quantitatively calibrated single-objective light-sheet platform for transcription imaging in complex living systems.",
  "authors": [
    "Armin Shoushtarizadeh",
    "Michele Cerminara",
    "Corinne Chureau",
    "Leah Friedman",
    "Deepthi Kailash",
    "Thomas Gregor"
  ],
  "published": "2025-12-29T15:50:51Z",
  "updated": "2025-12-29T15:50:51Z",
  "categories": [
    "q-bio.QM",
    "physics.bio-ph",
    "physics.ins-det",
    "physics.optics"
  ],
  "primary_category": "q-bio.QM"
}