{
  "arxiv_id": "2503.19920v3",
  "url": "https://arxiv.org/abs/2503.19920v3",
  "pdf_url": "https://arxiv.org/pdf/2503.19920v3.pdf",
  "title": "Most stringent bound on electron neutrino mass obtained with a scalable   low temperature microcalorimeter array",
  "abstract": "The determination of the absolute neutrino mass scale remains a fundamental open question in particle physics, with profound implications for both the Standard Model and cosmology. Direct kinematic measurements, independent of model-dependent assumptions, provide the most robust approach to address this challenge. In this Letter, we present the most stringent upper bound on the effective electron neutrino mass ever obtained with a calorimetric measurement of the electron capture decay of $^{163}$Ho. The HOLMES experiment employs an array of ion-implanted transition-edge sensor (TES) microcalorimeters, achieving an average energy resolution of 6 eV FWHM with a scalable, multiplexed readout technique. With a total of $7\\times10^7$ decay events recorded over two months and a Bayesian statistical analysis, we derive an upper limit of $m_{\\beta}<27$ eV/c$^2$ at 90% credibility. These results validate the feasibility of $^{163}$Ho calorimetry for next-generation neutrino mass experiments and demonstrate the potential of a scalable TES-based microcalorimetric technique to push the sensitivity of direct neutrino mass measurements beyond the current state of the art.",
  "authors": [
    "B. K. Alpert",
    "M. Balata",
    "D. T. Becker",
    "D. A. Bennett",
    "M. Borghesi",
    "P. Campana",
    "R. Carobene",
    "M. De Gerone",
    "W. B. Doriese",
    "M. Faverzani",
    "L. Ferrari Barusso",
    "E. Ferri",
    "J. W. Fowler",
    "G. Gallucci",
    "S. Gamba",
    "J. D. Gard",
    "F. Gatti",
    "A. Giachero",
    "M. Gobbo",
    "U. Köster",
    "D. Labranca",
    "M. Lusignoli",
    "P. Manfrinetti",
    "J. A. B. Mates",
    "E. Maugeri",
    "R. Moretti",
    "S. Nisi",
    "A. Nucciotti",
    "G. C. O'Neil",
    "L. Origo",
    "G. Pessina",
    "S. Ragazzi",
    "C. D. Reintsema",
    "D. R. Schmidt",
    "D. Schumann",
    "D. S. Swetz",
    "Z. Talip",
    "J. N. Ullom",
    "L. R. Vale"
  ],
  "published": "2025-03-10T21:26:20Z",
  "updated": "2025-09-29T19:52:31Z",
  "categories": [
    "hep-ex",
    "nucl-ex",
    "physics.ins-det"
  ],
  "primary_category": "hep-ex",
  "doi": "10.1103/s9vl-7n24"
}