{
  "arxiv_id": "2506.02104v2",
  "url": "https://arxiv.org/abs/2506.02104v2",
  "pdf_url": "https://arxiv.org/pdf/2506.02104v2.pdf",
  "title": "Collisionless relaxation to equilibrium distributions in cold dark   matter halos: origin of the NFW profile",
  "abstract": "Collisionless self-gravitating systems such as cold dark matter halos are known to harbor universal density profiles despite the intricate non-linear physics of hierarchical structure formation in the $\\Lambda$CDM paradigm. The origin of such states has been a persistent mystery, particularly because the physics of collisionless relaxation has remained poorly understood. To solve this long-standing problem, we develop a self-consistent quasilinear theory in action-angle space for the collisionless relaxation of inhomogeneous, self-gravitating systems by perturbing the governing Vlasov-Poisson equations. We obtain a quasilinear diffusion equation that describes the secular evolution of the mean coarse-grained distribution function $f_0$ of accreted matter in the fluctuating force field of a spherical isotropic halo. The diffusion coefficient not only depends on the fluctuation power spectrum but also on the evolving potential of the system, which reflects the self-consistency of the problem. Diffusive heating by an initially cored halo develops an $r^{-1}$ cusp in the density profile of the accreted material, with $r$ the halocentric radius, if it is initially shallower than $r^{-1}$. This is fundamentally a consequence of the virial theorem: self-gravitating systems have a negative specific heat and want to cool down when energized. The inner halo relaxes to an $r^{-1}$ cusp because its central region is the coldest among all $r^{-\\gamma}$ profiles with $0\\leq \\gamma \\leq 2$. Accretion and relaxation in the $r^{-1}$ cusp develops an $r^{-3}$ outer fall-off, thereby establishing the Navarro-Frenk-White (NFW) density profile. We demonstrate for the first time that this profile emerges as a steady state solution to the problem of self-consistent collisionless relaxation.",
  "authors": [
    "Uddipan Banik",
    "Amitava Bhattacharjee"
  ],
  "published": "2025-06-02T18:00:00Z",
  "updated": "2025-09-30T00:10:46Z",
  "categories": [
    "astro-ph.GA",
    "astro-ph.CO",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.GA"
}