{
  "arxiv_id": "2507.08887v4",
  "url": "https://arxiv.org/abs/2507.08887v4",
  "pdf_url": "https://arxiv.org/pdf/2507.08887v4.pdf",
  "title": "Measurement of the Liquid Argon Scintillation Pulse Shape Using   Differentiable Simulation in the Coherent CAPTAIN-Mills Experiment",
  "abstract": "The Coherent CAPTAIN-Mills (CCM) experiment is a liquid argon (LAr) light collection detector searching for MeV-scale neutrino and Beyond Standard Model physics signatures. Two hundred 8-inch photomultiplier tubes (PMTs) instrument the 7 ton fiducial volume with 50% photocathode coverage to detect light produced by charged particles. CCM's light-based approach reduces requirements of LAr purity, compared to other detection technologies, such that sub-MeV particles can be reliably detected without additional LAr filtration and with O(1) parts-per-million of common contaminants. We present a measurement of LAr light production and propagation parameters, with uncertainties, obtained from a sample of MeV-scale electromagnetic events. The optimization of this high-dimensional parameter space was facilitated by a differentiable optical photon Monte-Carlo simulation, and detailed PMT response characterization. This result accurately predicts the timing and spatial distribution of light due to scintillation and Cherenkov emission in the detector. This is the first description of photon propagation in LAr to include several effects, including: anomalous dispersion of the index of refraction near the ultraviolet resonance, Mie scattering from impurities, and Cherenkov light production.",
  "authors": [
    "A. A. Aguilar-Arevalo",
    "S. Biedron",
    "J. Boissevain",
    "M. Borrego",
    "L. Bugel",
    "M. Chavez-Estrada",
    "J. M. Conrad",
    "R. L. Cooper",
    "J. R. Distel",
    "J. C. D'Olivo",
    "E. Dunton",
    "B. Dutta",
    "D. E. Fields",
    "M. Gold",
    "E. Guardincerri",
    "E. C. Huang",
    "N. Kamp",
    "D. Kim",
    "K. Knickerbocker",
    "W. C. Louis",
    "C. F. Macias-Acevedo",
    "R. Mahapatra",
    "J. Mezzetti",
    "J. Mirabal",
    "M. J. Mocko",
    "D. A. Newmark",
    "P. deNiverville",
    "C. O'Connor",
    "V. Pandey",
    "D. Poulson",
    "H. Ray",
    "E. Renner",
    "T. J. Schaub",
    "A. Schneider",
    "M. H. Shaevitz",
    "D. Smith",
    "W. Sondheim",
    "A. M. Szelc",
    "C. Taylor",
    "A. Thompson",
    "W. H. Thompson",
    "M. Tripathi",
    "R. T. Thornton",
    "R. Van Berg",
    "R. G. Van de Water"
  ],
  "published": "2025-07-10T18:01:17Z",
  "updated": "2025-09-29T15:54:03Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}