{
  "arxiv_id": "2507.08886v4",
  "url": "https://arxiv.org/abs/2507.08886v4",
  "pdf_url": "https://arxiv.org/pdf/2507.08886v4.pdf",
  "title": "First Event-by-Event Identification of Cherenkov Radiation from Sub-MeV   Particles in Liquid Argon",
  "abstract": "This Letter reports the event-by-event observation of Cherenkov light from sub-MeV electrons in a high scintillation light-yield liquid argon (LAr) detector by the Coherent CAPTAIN-Mills (CCM) experiment. The CCM200 detector, located at Los Alamos National Laboratory, instruments 7 tons (fiducial volume) of LAr with 200 8-inch photomultiplier tubes (PMTs), 80% of which are coated in a wavelength shifting material and the remaining 20% are uncoated. In the prompt time region of an event, defined as $-6 \\leq t < 0$ ns relative to the event start time $t=0$, the uncoated PMTs are primarily sensitive to visible Cherenkov photons. Using gamma-rays from a $^{22}$Na source for production of sub-MeV electrons, we isolated prompt Cherenkov light with $>5\\sigma$ confidence and developed a selection to obtain a low-background electromagnetic sample. This is the first event-by-event observation of Cherenkov photons from sub-MeV electrons in a high-yield scintillator detector, and represents a milestone in low-energy particle detector development.",
  "authors": [
    "A. A. Aguilar-Arevalo",
    "S. Biedron",
    "J. Boissevain",
    "M. Borrego",
    "L. Bugel",
    "M. Chavez-Estrada",
    "J. M. Conrad",
    "R. L. Cooper",
    "J. R. Distel",
    "J. C. D'Olivo",
    "E. Dunton",
    "B. Dutta",
    "D. E. Fields",
    "M. Gold",
    "E. Guardincerri",
    "E. C. Huang",
    "N. Kamp",
    "D. Kim",
    "K. Knickerbocker",
    "W. C. Louis",
    "C. F. Macias-Acevedo",
    "R. Mahapatra",
    "J. Mezzetti",
    "J. Mirabal",
    "M. J. Mocko",
    "D. A. Newmark",
    "P. deNiverville",
    "C. O'Connor",
    "V. Pandey",
    "D. Poulson",
    "H. Ray",
    "E. Renner",
    "T. J. Schaub",
    "A. Schneider",
    "M. H. Shaevitz",
    "D. Smith",
    "W. Sondheim",
    "A. M. Szelc",
    "C. Taylor",
    "A. Thompson",
    "W. H. Thompson",
    "M. Tripathi",
    "R. T. Thornton",
    "R. Van Berg",
    "R. G. Van de Water"
  ],
  "published": "2025-07-10T18:01:05Z",
  "updated": "2025-09-29T15:17:08Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}