{
  "arxiv_id": "2509.26252v1",
  "url": "https://arxiv.org/abs/2509.26252v1",
  "pdf_url": "https://arxiv.org/pdf/2509.26252v1.pdf",
  "title": "Comparative study of YSO, GaGG, and BGO scintillators coupled to a SiPM   array for gamma-ray spectroscopy",
  "abstract": "A compact gamma-ray detector module was developed and characterized for spectroscopic applications across a wide energy range. The detector comprises a 4x4 array of silicon photomultipliers (SiPMs, Hamamatsu MPPC S13360-3050) coupled with three different inorganic scintillators (YSO, GaGG, BGO). The performance of the detector was evaluated over an energy range from 32 keV to 2500 keV using various standard gamma-ray point sources ({241}Am, {137}Cs, {22}Na, {60}Co, {228}Th). All three detector configurations demonstrated linearity between pulse height and gamma-ray energy over most of the tested range. GAGG exhibited the most consistent linear behavior up to 2500 keV. YSO with a faster decay constant showed linearity up to ~2000 keV, followed by slight saturation effects likely due to SiPM microcell occupancy limits at higher photon flux. BGO, characterized by a low light output and longer decay time, demonstrated stable linearity up to 2500 keV but reduced sensitivity below 300 keV. The measured energy resolution at 662 keV was 8.17% for GAGG, 9.3% for YSO, and 10.2% for BGO, consistent with their light yield and photon detection efficiency (PDE) - matching characteristics. The obtained results showed the trade-offs between scintillator materials in terms of energy resolution, dynamic range, and linearity, and confirm the suitability of the tested configurations for compact gamma-ray spectroscopy applications across the studied energy range.",
  "authors": [
    "S. Nuruyev",
    "G. Ahmadov",
    "D. Berikov",
    "M. Holik",
    "F. Ahmadov",
    "A. Sadigov",
    "R. Akbarov",
    "J. Naghiyev",
    "I. Nuruyev",
    "A. Mammadli"
  ],
  "published": "2025-09-30T13:42:58Z",
  "updated": "2025-09-30T13:42:58Z",
  "categories": [
    "physics.ins-det",
    "physics.app-ph"
  ],
  "primary_category": "physics.ins-det"
}