{
  "arxiv_id": "2509.24751v1",
  "url": "https://arxiv.org/abs/2509.24751v1",
  "pdf_url": "https://arxiv.org/pdf/2509.24751v1.pdf",
  "title": "Laboratory and Synchrotron Validation of $μ$-XRF for Sulfur Mapping in   CTMP Paper Samples",
  "abstract": "The transition toward renewable, fiber-based packaging requires an improved understanding of chemical modifications in high-yield pulps such as chemithermomechanical pulp (CTMP). Sulfonation uniformity is essential for the energy-efficient production of high-strength CTMP pulp. However, laboratory methods only measure total sulfur and cannot illustrate its distribution at the fiber level, which can be visualized using $\\mu$-XRF. In this work, we present a laboratory $\\mu$-XRF system developed at Mid Sweden University and assess its capability to detect light elements in CTMP paper handsheets. A 32 $\\times$ 32 point grid scan (1.6-1.6 mm$^2$ field of view, 50 $\\mu$m step, 300 s/point) successfully resolved sulfur K$\\alpha$ (2.31 keV) and calcium K$\\alpha$ (3.69 keV) fluorescence without helium flushing. Comparative measurements at the Elettra synchrotron confirmed consistency of sulfur peak position and spatial distribution, with higher spectral resolution and signal-to-noise ratio. Histogram analysis using Wasserstein distance metrics demonstrated close agreement between datasets despite differing acquisition conditions. These results demonstrate that laboratory XRF can reproducibly detect and map sulfur in CTMP fibers under ambient conditions, providing a practical tool to complement synchrotron studies and supporting the development of energy-efficient, fiber-based packaging materials.",
  "authors": [
    "F. Foroughi",
    "H. Bergman",
    "D. Krapohl",
    "H. Rahman",
    "D. Chapman",
    "R. H. Menk",
    "B. Norlin"
  ],
  "published": "2025-09-29T13:18:15Z",
  "updated": "2025-09-29T13:18:15Z",
  "categories": [
    "physics.ins-det",
    "physics.app-ph"
  ],
  "primary_category": "physics.ins-det"
}