{
  "arxiv_id": "2508.03443v2",
  "url": "https://arxiv.org/abs/2508.03443v2",
  "pdf_url": "https://arxiv.org/pdf/2508.03443v2.pdf",
  "title": "Energy Cascade and Damping in Fast-Mode Compressible Turbulence",
  "abstract": "Compressible turbulence governs energy transfer across scales in space and astrophysical systems. Capturing both the turbulence cascade and damping is therefore crucial for models of energy conversion, plasma heating, and particle transport in diverse plasma environments, but remains challenging. Progress is constrained by two unresolved fundamental questions: the persistence of the turbulence cascade in the presence of shocks and discontinuities, and the validity of classical wave theories under strong nonlinearity. In particular, it remains unclear whether meaningful cascade dynamics can be defined in compressible turbulence with phase steepening, and whether frameworks developed for monochromatic waves remain applicable to complex, broadband fluctuations. Using large-scale, high-resolution kinetic simulations, we analyze turbulence-particle interactions, which are beyond the capability of standard magnetohydrodynamic (MHD) simulations. We show that compressible turbulence damping at MHD scales in quantitative agreement with transit-time damping theory, even in fully developed nonlinear states. Moreover, the cascade persists despite the generation of shocks and discontinuities due to phase steepening, revealing a surprising robustness of cross-scale energy transfer under extreme conditions. We further provide the spectral expression of compressible turbulence. These results close a long-standing gap in the physics of compressible turbulence and establish a robust foundation for turbulence modeling from the heliosphere to galaxies.",
  "authors": [
    "Chuanpeng Hou",
    "Huirong Yan",
    "Siqi Zhao",
    "Parth Pavaskar"
  ],
  "published": "2025-08-05T13:41:18Z",
  "updated": "2025-09-29T08:07:51Z",
  "categories": [
    "astro-ph.SR",
    "astro-ph.HE",
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.SR"
}