{
  "arxiv_id": "2509.25870v1",
  "url": "https://arxiv.org/abs/2509.25870v1",
  "pdf_url": "https://arxiv.org/pdf/2509.25870v1.pdf",
  "title": "All-Optical Generation of Dense, Multi-GeV, Longitudinally-Polarized   Positron Beams",
  "abstract": "The production of high-yield, longitudinally polarized positron beams represents an outstanding challenge in advanced accelerator science. Laser-driven schemes offer a compact alternative but typically yield only transverse polarization, or require pre-polarized electron beams, and struggle to efficiently accelerate positrons to high energies. Here, we introduce an all-optical scheme that overcomes these limitations by integrating positron generation, acceleration, and spin manipulation in a unified framework. Through a head-on collision between an ultraintense, circularly polarized laser pulse and a counterpropagating unpolarized electron beam, we drive a robust QED cascade. The nonlinear Breit-Wheeler process within the cascade produces positrons that are born directly within the strong laser field. Crucially, these positrons are instantaneously captured and accelerated to multi-GeV energies (up to $\\sim$9 GeV) via a direct laser acceleration mechanism, while their spins are simultaneously rotated to longitudinal alignment by the field dynamics. Our Monte-Carlo simulations confirm the simultaneous achievement of a high positron yield ($\\sim$20 $e^+/e^-$), a high average longitudinal polarization ($\\sim$50\\%), and GeV-scale energies. This all-optical source, feasible at upcoming ultraintense laser facilities, presents a compact and efficient solution for applications in collider physics and fundamental high-energy experiments.",
  "authors": [
    "Rui-Qi Qin",
    "Peng-Pei Xie",
    "Yan-Fei Li",
    "Xian-Zhang Wu",
    "Zheng-Yang Zuo",
    "Bing-Jun Li",
    "Jun Liu",
    "Liang-Liang Ji",
    "Yu-Tong Li"
  ],
  "published": "2025-09-30T07:06:31Z",
  "updated": "2025-09-30T07:06:31Z",
  "categories": [
    "physics.acc-ph",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.acc-ph"
}