{
  "arxiv_id": "2510.00388v2",
  "url": "https://arxiv.org/abs/2510.00388v2",
  "pdf_url": "https://arxiv.org/pdf/2510.00388v2.pdf",
  "title": "A study of the electronic and ionic structure, for co-existing states of   fully and partially ionized hydrogen, using the neutral pseudo-atom method as   well as a classical map for the electron subsystem",
  "abstract": "Prof. Michael Bonitz and his collaborators have made seminal contributions to the study of the uniform electron fluid and the electron-proton fluid, viz., hydrogen, in using {\\it ab initio} simulations. These studies provide essential inputs to astrophysics as well as high-energy density physics. This is reflected in the contributions to this festshrift in his honour. The electron-proton system becomes particularly difficult for theoretical modeling when the temperature becomes comparable to the Fermi energy $E_F$, when the warm-dense matter (WDM) state of hydrogen is reached. In this study we briefly review the theoretical methods available for the study of WDM systems, and use the neutral-pseudo atom (NPA) method, and a classical map for quantum electrons to study fully and partially ionized hydrogen. It is shown that {\\it both} fully and partially ionized states can independently exist at the {\\it same density and temperature} in many cases. Recent studies using path-integral Monte Carlo methods, and $N$-atom Density Functional Theory (DFT) simulations have provided essential structure data including the electron-electron structure factor $S_{ee}(k)$ that enters into interpretation of X-ray Thomson scattering and other diagnostics. We show that these structure data can be rapidly and inexpensively evaluated, with sufficient accuracy, using classical-map schemes for fully ionized plasmas, and more generally, using one-atom (average-atom) DFT methods for partially ionized systems.",
  "authors": [
    "M. W. C. Dharma-wardana"
  ],
  "published": "2025-10-01T01:00:54Z",
  "updated": "2025-10-02T05:23:20Z",
  "categories": [
    "physics.plasm-ph",
    "cond-mat.stat-mech"
  ],
  "primary_category": "physics.plasm-ph"
}