[
  {
    "arxiv_id": "2510.01060v2",
    "url": "https://arxiv.org/abs/2510.01060v2",
    "pdf_url": "https://arxiv.org/pdf/2510.01060v2.pdf",
    "title": "Do plasmoids induce fast magnetic reconnection in well-resolved current   sheets in 2D MHD simulations?",
    "abstract": "We investigate the development of tearing-mode instability using the highest resolution two-dimensional magnetohydrodynamic simulations of reconnecting current sheets on a uniform grid, for Lundquist numbers $10^3 \\le S \\le 2 \\times 10^5$. Although the tearing-mode instability is commonly thought to trigger a plasmoid cascade that enables fast reconnection - i.e., independent of $S$ - our results, in broad agreement with the recent findings of Morillo \\& Alexakis (2025), challenge this belief. We demonstrate a Sweet-Parker scaling of the reconnection rate $V_{\\text{rec}} \\sim S^{-1/2}$ up to Lundquist numbers $S \\sim 10^4$. For larger values, plasmoid formation sets in leading to a slight enhancement of the reconnection rate, $V_{\\text{rec}} \\sim S^{-1/3}$, consistent with the prediction from linear tearing mode induced reconnection, indicating that reconnection remains resistivity dependent, and therefore slow. In our simulations, the plasmoids do not form a cascade of mergers, as they are rapidly advected out of the reconnection layer. Our findings call for the revision of the role of plasmoid formation in 2D high Lundquist number magnetic reconnection. Even if future studies demonstrate that 2D plasmoid-reconnection becomes resistivity-independent at sufficiently large $S$, directly extending those results to 3D astrophysical environments is not justified, as in realistic circumstances, the increase of $S$ also raises the Reynolds number of the outflows, making it essential to account for the dominant role of turbulence.",
    "authors": [
      "G. H. Vicentin",
      "G. Kowal",
      "E. M. de Gouveia Dal Pino",
      "A. Lazarian"
    ],
    "published": "2025-10-01T16:00:23Z",
    "updated": "2025-10-03T19:09:52Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE",
      "hep-th"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.21506v2",
    "url": "https://arxiv.org/abs/2509.21506v2",
    "pdf_url": "https://arxiv.org/pdf/2509.21506v2.pdf",
    "title": "Electrostatic waves in astrophysical Druyvesteyn plasmas: I. Langmuir   waves",
    "abstract": "Plasmas in various astrophysical systems are in non-equilibrium states as evidenced by direct in-situ measurements in the solar wind, solar corona and planetary environments as well as by indirect observations of various sources of waves and emissions in astrophysical systems. Specific are non-Maxwellian velocity distributions with suprathermal tails, for whose description the most-used are the Kappa (power-law) distributions. With this paper we introduce a modeling alternative for linear waves in plasmas described by another non-equilibrium model, namely the generalized Druyvesteyn distribution. This can reproduce not only high-energy tails, but also low-energy flat-tops of velocity distributions, like those of electrons associated with the Earth's bow shock and interplanetary shocks or of electrons in the solar transition region. We derive the corresponding dispersion relation for longitudinal waves in terms of the newly introduced Druyvsteyn dispersion function, numerically compute, for the isotropic case, the dispersion curves as well as damping rates, and provide analytical approximation in the limit of weak damping. Thereby, we provide a new modeling tool that facilitates the quantitative treatment of a variety of non-Maxwellian plasmas.",
    "authors": [
      "Simon Tischmann",
      "Rudi Gaelzer",
      "Dustin Schröder",
      "Marian Lazar",
      "Horst Fichtner"
    ],
    "published": "2025-09-25T19:59:11Z",
    "updated": "2025-10-03T16:47:55Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.03141v1",
    "url": "https://arxiv.org/abs/2510.03141v1",
    "pdf_url": "https://arxiv.org/pdf/2510.03141v1.pdf",
    "title": "Nonmodal growth and optimal perturbations in magnetohydrodynamic shear   flows",
    "abstract": "In astrophysical shear flows, the Kelvin-Helmholtz (KH) instability is generally suppressed by magnetic tension provided a sufficiently strong streamwise magnetic field. This is often used to infer upper (or lower) bounds on field strengths in systems where shear-driven fluctuations are (or are not) observed, on the basis that fluctuations cannot grow in the absence of linear instability. On the contrary, by calculating the maximum growth that small-amplitude perturbations can achieve in finite time for such a system, we show that perturbations can grow in energy by orders of magnitude even when the flow is sub-Alfv\\'enic, suggesting that shear-driven turbulence is possible even in the presence of strong magnetic fields, and challenging inferences from the observed presence or absence of shear-driven fluctuations. We further show that magnetic fields introduce additional nonmodal growth mechanisms relative to the hydrodynamic case, and that 2D simulations miss key aspects of these growth mechanisms.",
    "authors": [
      "Adrian E. Fraser",
      "Alexis K. Kaminski",
      "Jeffrey S. Oishi"
    ],
    "published": "2025-10-03T16:11:36Z",
    "updated": "2025-10-03T16:11:36Z",
    "categories": [
      "physics.flu-dyn",
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.flu-dyn"
  },
  {
    "arxiv_id": "2510.03008v1",
    "url": "https://arxiv.org/abs/2510.03008v1",
    "pdf_url": "https://arxiv.org/pdf/2510.03008v1.pdf",
    "title": "Status of the MARS code",
    "abstract": "This report describes major features of the most recent version of the MARS code as well as ongoing developments. The list of features includes various options for geometry models, a beam line builder based on MADX code, import of geometry models in GDML format, use of structured and unstructured meshes for scoring purposes, an update to the recent TENDL library for a number of projectiles at low energies (up to 250 MeV), and a recently implemented method to calculate spatial distribution of residual dose in a single computer run without an intermediate source. Examples of the code application to various projects are presented as well.",
    "authors": [
      "Igor Rakhno",
      "Igor Tropint",
      "Dali Georgobiani",
      "Alajos Makovec"
    ],
    "published": "2025-10-03T13:52:35Z",
    "updated": "2025-10-03T13:52:35Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.02971v1",
    "url": "https://arxiv.org/abs/2510.02971v1",
    "pdf_url": "https://arxiv.org/pdf/2510.02971v1.pdf",
    "title": "Millimeter-Wavelength Dual-Polarized Lens-Absorber-Coupled Ti/Al Kinetic   Inductance Detectors",
    "abstract": "This work presents Ti/Al bi-layer Microwave Kinetic Inductance Detectors (MKIDs) based on lens-coupled spiral absorbers as the quasi-optical coupling mechanism for millimeter-wavelength radiation detection. From simulations, the lens-coupled absorbers provide a 70% lens aperture efficiency in both polarizations over an octave band with a spiral array absorber and over 10% relative bandwidth with a single spiral. We have fabricated and measured two devices with bare Ti/Al MKIDs: a 3x3 cm chip with 9 pixels to characterize the optical response at 85 GHz of the two variations of the absorber; and a large format demonstrator with 253 spiral-array pixels showing potential towards a large format millimeter-wavelength camera. We find a sensitivity of 1 mK/sqrt{Hz} and a detector yield of 95%.",
    "authors": [
      "Alejandro Pascual Laguna",
      "Victor Rollano",
      "Aimar Najarro-Fiandra",
      "David Rodriguez",
      "Maria T. Magaz",
      "Daniel Granados",
      "Alicia Gomez"
    ],
    "published": "2025-10-03T13:03:14Z",
    "updated": "2025-10-03T13:03:14Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2404.06950v2",
    "url": "https://arxiv.org/abs/2404.06950v2",
    "pdf_url": "https://arxiv.org/pdf/2404.06950v2.pdf",
    "title": "Compton Edge Convolutional Model and Algorithm for Energy-channel   Calibration",
    "abstract": "Scintillation detectors are essential tools for radiation measurement, but calibrating them accurately can be challenging, especially when full-energy peaks are not prominent. This is common in detectors like plastic scintillators. Current methods for calibrating these detectors often require manual adjustments. To address this, we propose a new method called the convolution model. This model accurately calibrates the energy-channel relationship of the Compton edge in various detectors. We tested it with plastic scintillator BC408, NaI crystal, and LaBr$_3$ crystal. Using ${}^{137}$Cs radioactive sources, we calibrated NaI and LaBr$_3$ detectors using full-energy peaks, then applied the convolution model to fit the Compton edge. Our results show errors within 1\\% when compared to full-energy peak calibration.",
    "authors": [
      "Yanbiao Zhang",
      "Fanjie Zeng",
      "Dehua Kong",
      "Lian Lei",
      "Zhonghai Wang"
    ],
    "published": "2024-04-10T11:57:36Z",
    "updated": "2025-10-03T12:30:14Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.00273v2",
    "url": "https://arxiv.org/abs/2510.00273v2",
    "pdf_url": "https://arxiv.org/pdf/2510.00273v2.pdf",
    "title": "Physical Thickness Characterization of the FRIB Production Targets",
    "abstract": "The FRIB heavy-ion accelerator, commissioned in 2022, is a leading facility   for producing rare isotope beams (RIBs) and exploring nuclei beyond the limits of stability.   These RIBs are produced via reactions between stable primary beams and a graphite target.   Approximately 20-40 \\% of the primary beam power is deposited in the target,   requiring efficient thermal dissipation.   Currently, FRIB operates with a primary beam power of up to 20 kW. To enhance thermal dissipation efficiency,   a single-slice rotating graphite target with a diameter of approximately 30 cm is employed.   The effective target region is a 1 cm-wide outer rim of the graphite disc.   To achieve high RIB production rates, the areal thickness variation must be constrained within 2 \\%.   This paper presents physical thickness characterizations of FRIB production targets with various nominal thicknesses,   measured using a custom-built non-contact thickness measurement apparatus.",
    "authors": [
      "D. J. Lee",
      "M. Reaume",
      "W. Franklin",
      "J. Song"
    ],
    "published": "2025-09-30T20:52:04Z",
    "updated": "2025-10-03T12:04:22Z",
    "categories": [
      "physics.acc-ph",
      "nucl-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.02920v1",
    "url": "https://arxiv.org/abs/2510.02920v1",
    "pdf_url": "https://arxiv.org/pdf/2510.02920v1.pdf",
    "title": "Measurements of the Birks' coefficient of GAGG:Ce using hard X-rays",
    "abstract": "Inorganic scintillators continue to be widely used within astrophysical X-ray and gamma-ray detectors. This is in part thanks to the development of new scintillators, such as GAGG:Ce, as well as the availability of new scintillator readout sensors such as Silicon Photomultipliers and Silicon Drift Detectors. In order to use such scintillator materials for spectrometry or polarimetry, a detailed understanding of their response is important. One parameter that can affect the scintillator performance, particularly at lower photon energies, is their Birks' coefficienct, which correlates the relative light yield to the ionization energy. While for many high-Z inorganic scintillators this effect can be ignored, for GAGG:Ce this appears to not be the case. Here we provide a measurement of the Birks' coefficient for GAGG:Ce using data from two different detectors irradiated in the 20-80 keV energy range at the LARIX-A X-ray beam in Ferrara, Italy. While the effects due to Birks' law are visible below 30 keV, they also significantly influence the performance of GAGG:Ce performance near one of the K-edges, affecting both the measured gain and the energy resolution. Here, we use beam test data to derive the Birks' coefficient from GAGG:Ce. The results indicate that for usage in hard X-ray and soft gamma-ray missions, this coefficient has a significant effect on the measurements.",
    "authors": [
      "Merlin Kole",
      "Nicolas De Angelis"
    ],
    "published": "2025-10-03T11:46:10Z",
    "updated": "2025-10-03T11:46:10Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2509.17934v2",
    "url": "https://arxiv.org/abs/2509.17934v2",
    "pdf_url": "https://arxiv.org/pdf/2509.17934v2.pdf",
    "title": "Superconducting Low-beta Nb$_3$Sn Cavity for ATLAS and Future Ion   Accelerators",
    "abstract": "We report on a Nb$_3$Sn-coated low-beta superconducting radio frequency (SRF) cavity intended for accelerating ions. We aim to apply the cavity in ATLAS, our Argonne National Laboratory user facility for nuclear physics studies with ion beams in the energy range of 5-20 MeV/u. The Nb$_3$Sn-coated cavity, a 145 MHz quarter-wave optimized for ions moving with velocity $\\beta$=v/c=0.08 exhibits an order-of-magnitude reduction in radiofrequency (RF) losses into helium at $4.4\\,\\mathrm{K}$ compared to a superconducting niobium (Nb) cavity at the same frequency and temperature. Experimentally measured fields are among the highest to date for any Nb$_3$Sn-coated cavity, reaching a peak surface magnetic field of 105 mT. We also present a practical solution to the problem of cavity frequency tuning. Tuning by mechanical deformation has been a challenge with Nb3Sn due to its brittle nature, however, using a set of techniques tailored to the properties of thin-film Nb$_3$Sn on Nb, we can repeatably tune the cavity to the ATLAS master clock frequency after it is cooled, while maintaining the excellent performance characteristics. The same Nb$_3$Sn cavity technology offers broad benefits for future ion accelerators.",
    "authors": [
      "T. Petersen",
      "G. Eremeev",
      "B. Tennis",
      "N. Tagdulang",
      "Y. Zhou",
      "M. Kedzie",
      "B. Guilfoyle",
      "Y. Xu",
      "S. V. Kutsaev",
      "R. Agustsson",
      "E. Spranza",
      "P. Davis",
      "G. P. Zinkann",
      "T. Reid",
      "S. Posen",
      "M. P. Kelly"
    ],
    "published": "2025-09-22T15:54:44Z",
    "updated": "2025-10-03T10:56:41Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2403.07790v2",
    "url": "https://arxiv.org/abs/2403.07790v2",
    "pdf_url": "https://arxiv.org/pdf/2403.07790v2.pdf",
    "title": "RADES axion search results with a High-Temperature Superconducting   cavity in an 11.7 T magnet",
    "abstract": "We describe the results of a haloscope axion search performed with an 11.7 T dipole magnet at CERN. The search used a custom-made radio-frequency cavity coated with high-temperature superconducting tape. A set of 27 h of data at a resonant frequency of around 8.84 GHz was analysed. In the range of axion mass 36.5676 $\\mu$eV to 36.5699 $\\mu$eV, corresponding to a width of 554 kHz, no signal excess hinting at an axion-like particle was found. Correspondingly, in this mass range, a limit on the axion to photon coupling-strength was set in the range between g$_{a\\gamma}\\gtrsim$ 6.2e-13 GeV$^{-1}$ and g$_{a\\gamma}\\gtrsim$ 1.59e-13 GeV$^{-1}$ with a 95% confidence level.",
    "authors": [
      "S. Ahyoune",
      "A. Álvarez Melcón",
      "S. Arguedas Cuendis",
      "S. Calatroni",
      "C. Cogollos",
      "A. Díaz-Morcillo",
      "B. Döbrich",
      "J. D. Gallego",
      "J. M. García-Barceló",
      "B. Gimeno",
      "J. Golm",
      "X. Granados",
      "J. Gutierrez",
      "L. Herwig",
      "I. G. Irastorza",
      "N. Lamas",
      "A. Lozano-Guerrero",
      "W. L. Millar",
      "C. Malbrunot",
      "J. Miralda-Escudé",
      "P. Navarro",
      "J. R. Navarro-Madrid",
      "T. Puig",
      "M. Siodlaczek",
      "G. T. Telles",
      "W. Wuensch"
    ],
    "published": "2024-03-12T16:30:33Z",
    "updated": "2025-10-03T09:52:48Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1007/JHEP04(2025)113"
  },
  {
    "arxiv_id": "2503.09495v2",
    "url": "https://arxiv.org/abs/2503.09495v2",
    "pdf_url": "https://arxiv.org/pdf/2503.09495v2.pdf",
    "title": "Calibration of Solid State Nuclear Track Detectors for Rare Event   Searches",
    "abstract": "The calibration of the CR39 and Makrofol Nuclear Track Detectors of the MoEDAL experiment at the CERN-LHC was performed by exposing stacks of detector foils to heavy ion beams with energies ranging from 340 MeV/nucleon to 150 GeV/nucleon. After chemical etching, the base areas and lengths of etch-pit cones were measured using automatic and manual optical microscopes. The response of the detectors, as measured by the ratio of the track-etching rate over the bulk-etching rate, was determined over a range extending from their threshold at Z/$\\beta\\sim7$ and $\\sim50$ for CR39 and Makrofol, respectively, up to Z/$\\beta\\sim92$",
    "authors": [
      "M. Kalliokoski",
      "G. Levi",
      "A. Maulik",
      "I. Ostrovskiy",
      "L. Patrizii",
      "J. Pinfold",
      "Z. Sahnoun",
      "G. Sirri",
      "R. Soluk",
      "M. Staelens",
      "V. Togo",
      "A. Upreti"
    ],
    "published": "2025-03-12T15:57:48Z",
    "updated": "2025-10-03T09:20:12Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/03/P03014"
  },
  {
    "arxiv_id": "2509.21525v2",
    "url": "https://arxiv.org/abs/2509.21525v2",
    "pdf_url": "https://arxiv.org/pdf/2509.21525v2.pdf",
    "title": "High-accuracy low-noise electrical measurements in a closed-cycle   pulse-tube cryostat",
    "abstract": "A shift of paradigm to obtain (sub-)Kelvin environment is currently on-going with the democratization of cryogen-free cryocoolers, boosted by their easy-to-use and continuous operation without the need of liquid helium whose cost and scarcity globally increase. Thanks to their large sample space and cooling power, they can host a superconducting magnet and are an adapted platform for quantum technologies, material science, low temperature detectors and even medical fields. The drawback is that this type of system is inherently based on gas compression that induces a certain level of vibrations and electromagnetic perturbations, which can potentially prevent the determination of low amplitude signals or spoil their stability. In this paper we demonstrate that pulse-tube based cryocoolers can be used for electrical precision measurements, using a commercial cryomagnetic system combined with our home-made a coaxial cryoprobe. In particular, parts-per-billion level of measurement uncertainties in resistance determination, based on quantum Hall resistance standards, is achievable at the level of state-of-the-art measurements involving conventional cryostats based on liquid helium. We performed an extensive characterization of the cryomagnetic system to determine the level of vibrations and electromagnetic perturbations, and revealed that although the magnetic field has a drastic effect on the noise level, only marginal interplays on the measurement are observed as long as the working frequencies of the instrumentation are not in the vicinity of the ones of the perturbations. The set of characterization measurements presented here are easily implementable in laboratories, which can help to determine the vibrations and electromagnetic pollution generated by any cryocooler.",
    "authors": [
      "Mathieu Taupin",
      "Kamel Dougdag",
      "Djamel Ziane",
      "Francois Couedo"
    ],
    "published": "2025-09-25T20:09:58Z",
    "updated": "2025-10-03T09:13:12Z",
    "categories": [
      "cond-mat.other",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.other"
  },
  {
    "arxiv_id": "2510.02762v1",
    "url": "https://arxiv.org/abs/2510.02762v1",
    "pdf_url": "https://arxiv.org/pdf/2510.02762v1.pdf",
    "title": "Development of Deep Neural Network First-Level Hardware Track Trigger   for the Belle II Experiment",
    "abstract": "The Belle II experiment at the SuperKEKB accelerator is designed to explore physics beyond the Standard Model with unprecedented luminosity. As the beam intensity increased, the experiment faced significant challenges due to higher beam-induced background, leading to a high trigger rate and placing limitations on further luminosity increases. To address this problem, we developed trigger logic for tracking using deep neural network (DNN) technology on an FPGA for the Belle II hardware trigger system, employing high-level synthesis techniques. By leveraging drift time and hit pattern information from the Central Drift Chamber and incorporating a simplified self-attention architecture, the DNN track trigger significantly improves track reconstruction performance at the hardware level. Compared to the existing neural track trigger, our implementation reduces the total track trigger rate by 37% while improving average efficiency for the signal tracks from 96% to 98% for charged tracks with transverse momentum > 0.3 GeV. This upgrade ensures the long-term viability of the Belle II data acquisition system as luminosity continues to increase.",
    "authors": [
      "Y. -X. Liu",
      "T. Koga",
      "H. Bae",
      "Y. Yang",
      "C. Kiesling",
      "F. Meggendorfer",
      "K. Unger",
      "S. Hiesl",
      "T. Forsthofer",
      "A. Ishikawa",
      "Y. Ahn",
      "T. Ferber",
      "I. Haide",
      "G. Heine",
      "C. -L. Hsu",
      "A. Little",
      "H. Nakazawa",
      "M. Neu",
      "L. Reuter",
      "V. Savinov",
      "Y. Unno",
      "J. Yuan",
      "Z. Xu"
    ],
    "published": "2025-10-03T06:49:08Z",
    "updated": "2025-10-03T06:49:08Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.18324v2",
    "url": "https://arxiv.org/abs/2507.18324v2",
    "pdf_url": "https://arxiv.org/pdf/2507.18324v2.pdf",
    "title": "Plasma Position Constrained Free-Boundary MHD Equilibrium in Tokamaks   using pyIPREQ",
    "abstract": "A free-boundary, axisymmetric magnetohydrodynamic (MHD) equilibrium code, pyIPREQ, has been developed for Tokamak plasmas using finite difference and Green's function approach. The code builds upon the foundational frameworks of the PEST and IPREQ codes, introducing several enhancements and new capabilities. Notably, pyIPREQ supports the specification of limiter boundaries and enables the computation of key physical quantities. The code has also been extended to compute equilibria constrained by a prescribed magnetic axis position, which is particularly useful when such information can be inferred from the diagnostics data. In addition, pyIPREQ includes functionality to address vertical instabilities, a requirement for accurately modeling elongated plasma configurations. Benchmarking has been carried out against published results and the original IPREQ code. Applications are demonstrated for ADITYA-U Tokamak experiments, where magnetic axis measurements are available, and predictions are also made for SST-1 and ADITYA-U Tokamaks under various operational scenarios.",
    "authors": [
      "Udaya Maurya",
      "Amit K. Singh",
      "Suman Aich",
      "Jagabandhu Kumar",
      "Rohit Kumar",
      "Daniel Raju"
    ],
    "published": "2025-07-24T11:50:38Z",
    "updated": "2025-10-03T05:33:45Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1063/5.0290301"
  },
  {
    "arxiv_id": "2510.02659v1",
    "url": "https://arxiv.org/abs/2510.02659v1",
    "pdf_url": "https://arxiv.org/pdf/2510.02659v1.pdf",
    "title": "Holographic Gaseous Lenses for High-Power Lasers",
    "abstract": "The capabilities of the world's highest energy and peak-power pulsed lasers are limited by optical damage, and further advances in high-intensity laser science will require optics that are substantially more robust than existing components. We describe here the experimental demonstration of off-axis diffractive gaseous lenses capable of withstanding extreme laser fluence and immune to cumulative damage. We used less than 8 mJ of energy from interfering ultraviolet laser pulses to holographically write millimeter-scale diffractive gas lenses into an ozone, oxygen, and carbon-dioxide gas mixture. These lenses allowed us to focus, defocus, and collimate 532-nm nanosecond laser pulses with up to 210 mJ of energy at efficiencies above 50% and fluences up to 35 J/cm$^2$. We also show that the gas lenses have sufficient bandwidth to efficiently diffract 35-fs 800-nm pulses and that beam pointing, divergence, and diffraction efficiency are stable while operating at 10 Hz. These diffractive lenses are simple holograms, and the principles demonstrated here could be extended to other types of optics, suggesting that gaseous optics may enable arbitrary, damage-resistant manipulation of intense light for next-generation ultra-high-power lasers.",
    "authors": [
      "Devdigvijay Singh",
      "Ke Ou",
      "Sida Cao",
      "Victor M. Perez-Ramirez",
      "Harsha Rajesh",
      "Debolina Chakraborty",
      "Caleb Redshaw",
      "Pelin Dedeler",
      "Albertine Oudin",
      "Michelle M. Wang",
      "Julia M. Mikhailova",
      "Livia Lancia",
      "Caterina Riconda",
      "Pierre Michel",
      "Matthew R. Edwards"
    ],
    "published": "2025-10-03T01:36:53Z",
    "updated": "2025-10-03T01:36:53Z",
    "categories": [
      "physics.optics",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2510.01819v2",
    "url": "https://arxiv.org/abs/2510.01819v2",
    "pdf_url": "https://arxiv.org/pdf/2510.01819v2.pdf",
    "title": "Three-Dimensional Niobium Coaxial Cavity with $\\sim0.1\\,$second Lifetime",
    "abstract": "We report on the internal quality factor of a three-dimensional niobium quarter-wave coaxial cavity, with mid-temperature annealing, exhibiting $Q_{\\rm int} \\gtrsim 3\\times10^9$ at the single-photon level below 20\\,mK, which corresponds to an internal photon lifetime of $\\tau_{\\rm int}\\sim90\\,\\mathrm{ms}$. Moreover, $Q_{\\rm int}$ of the mid-temperature annealed cavities remains almost unchanged even after several cooldown cycles and air exposure. These results suggest that stable low-loss niobium oxides might be formed by mid-temperature annealing on the surface of three-dimensional niobium cavity. This surface treatment could be applicable to the fabrication of 2D superconducting circuits and help improve the lifetime of Nb-based superconducting qubits.",
    "authors": [
      "Takaaki Takenaka",
      "Takayuki Kubo",
      "Imran Mahboob",
      "Kosuke Mizuno",
      "Hitoshi Inoue",
      "Takayuki Saeki",
      "Shiro Saito"
    ],
    "published": "2025-10-02T09:05:52Z",
    "updated": "2025-10-03T00:56:20Z",
    "categories": [
      "quant-ph",
      "cond-mat.supr-con",
      "physics.acc-ph"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2510.02301v1",
    "url": "https://arxiv.org/abs/2510.02301v1",
    "pdf_url": "https://arxiv.org/pdf/2510.02301v1.pdf",
    "title": "Relativistic Jets and Winds in Radio-Identified Supermassive Black Hole   Binary Candidates",
    "abstract": "Supermassive black hole binary systems (SMBHBs) are thought to emit the recently discovered nHz gravitational wave background; however, not a single individual nHz source has been confirmed to date. Long-term radio-monitoring at the Owens Valley Radio Observatory has revealed two potential SMBHB candidates: blazars PKS 2131-021 and PKS J0805-0111. These sources show periodic flux density variations across the electromagnetic spectrum, signaling the presence of a good clock. To explain the emission, we propose a generalizable jet model, where a mildly relativistic wind creates an outward-moving helical channel, along which the ultra-relativistic jet propagates. The observed flux variation from the jet is mostly due to aberration. The emission at lower frequency arises at larger radius and its variation is consequently delayed, as observed. Our model reproduces the main observable features of both sources and can be applied to other sources as they are discovered. We make predictions for radio polarization, direct imaging, and emission line variation, which can be tested with forthcoming observations. Our results motivate future numerical simulations of jetted SMBHB systems and have implications for the fueling, structure, and evolution of blazar jets.",
    "authors": [
      "Andrew G. Sullivan",
      "Roger D. Blandford",
      "Anna Synani",
      "Philipe V. de la Parra",
      "Noémie Globus",
      "Mitchell C. Begelman",
      "Anthony C. S. Readhead"
    ],
    "published": "2025-10-02T17:59:08Z",
    "updated": "2025-10-02T17:59:08Z",
    "categories": [
      "astro-ph.HE",
      "astro-ph.GA",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2510.02088v1",
    "url": "https://arxiv.org/abs/2510.02088v1",
    "pdf_url": "https://arxiv.org/pdf/2510.02088v1.pdf",
    "title": "A neural network approach to kinetic Mie polarimetry for particle size   diagnostics in nanodusty plasmas",
    "abstract": "The analysis of the size of nanoparticles is an essential task in plasma technology and dusty plasmas. Light scattering techniques, based on Mie theory, can be used as a non-invasive and in-situ diagnostic tool for this purpose. However, the standard back-calculation methods require expertise from the user. To address this, we introduce a neural network that performs the same task. We discuss how we set up and trained the network to analyze the size of plasma-grown amorphous carbon nanoparticles (a:C-H) with a refractive index n in the range of real(n) = 1.4-2.2 and imag(n) = 0.04i-0.1i and a radius of up to several hundred nanometers, depending on the used wavelength. The diagnostic approach is kinetic, which means that the particles need to change in size due to growth or etching. An uncertainty analysis as well as a test with experimental data are presented. Our neural network achieves results that agree with those of prior fitting algorithms while offering higher methodical stability. The model also holds a major advantage in terms of computing speed and automation.",
    "authors": [
      "Alexander Schmitz",
      "Andreas Petersen",
      "Franko Greiner"
    ],
    "published": "2025-10-02T14:55:05Z",
    "updated": "2025-10-02T14:55:05Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1088/1361-6463/aceb71"
  },
  {
    "arxiv_id": "2510.02058v1",
    "url": "https://arxiv.org/abs/2510.02058v1",
    "pdf_url": "https://arxiv.org/pdf/2510.02058v1.pdf",
    "title": "Accurate Modelling of Intrabeam Scattering and its Impact on   Photoinjectors for Free-Electron Lasers",
    "abstract": "Intrabeam scattering (IBS) is a fundamental effect that can limit the performance of high-brightness electron machines, yet it has so far been neglected in standard modelling of RF photoinjectors. Recent measurements at SwissFEL reveal that the slice energy spread (SES) in the injector is significantly underestimated by conventional tracking codes. In this work, we present a dedicated Monte Carlo simulation model that accurately predicts the IBS-induced SES growth in the photoinjector of an X-ray free-electron laser. The simulations are benchmarked against SES measurements at the SwissFEL as well as theoretically supported by a new analytical model. The results demonstrate that IBS-induced SES growth occurs throughout the injector, most prominently in the electron source, and must be taken into account when assessing photoinjector performance. We further show that while the 5D brightness is largely conserved, the 6D brightness undergoes notable degradation with propagation, underscoring the need to include IBS in the accurate design and optimization of photoinjectors.",
    "authors": [
      "Thomas Geoffrey Lucas",
      "Paolo Craievich",
      "Eduard Prat",
      "Sven Reiche",
      "Erion Gjonaj"
    ],
    "published": "2025-10-02T14:26:39Z",
    "updated": "2025-10-02T14:26:39Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.02018v1",
    "url": "https://arxiv.org/abs/2510.02018v1",
    "pdf_url": "https://arxiv.org/pdf/2510.02018v1.pdf",
    "title": "An electro-optical bunch profile monitor for FCC-ee",
    "abstract": "The Future Circular Lepton Collider (FCC-ee) presents challenges for a longitudinal bunch profile monitor due to its wide range of bunch lengths and charge densities across its four distinct operational modes. For commissioning, monitoring the top-up injection, and energy calibration, the FCC-ee requires non-destructive, single-shot measurements of the bunch length and profile. This contribution proposes an in-vacuum electro-optical (EO) longitudinal bunch profile monitor for single-shot measurements at high repetition rates, building on the successful EO monitor at the Karlsruhe Research Accelerator (KARA) at the Karlsruhe Institute of Technology. A novel single-pass conceptual design for the in-vacuum holder of the electro-optical crystal is presented, utilizing prisms instead of a mirror to guide the laser through the crystal, which additionally allows measurements of the long bunches foreseen for FCC-ee operation mode at the Z-pole energy. A first prototype has been constructed and tested at the in-air test stand of the CERN Linear Electron Accelerator for Research (CLEAR). Results from the prototype tests are presented, demonstrating the proof of principle for the single-pass prism-based EO monitor design for FCC-ee.",
    "authors": [
      "M. Reissig",
      "E. Bründermann",
      "S. Funkner",
      "L. L. Grimm",
      "B. Härer",
      "G. Niehues",
      "J. L. Steinmann",
      "A. -S. Müller",
      "R. Corsini",
      "A. Gilardi",
      "S. Mazzoni",
      "C. Pakuza",
      "A. Schloegelhofer",
      "T. Lefevre",
      "P. Korysko"
    ],
    "published": "2025-10-02T13:45:29Z",
    "updated": "2025-10-02T13:45:29Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.01977v1",
    "url": "https://arxiv.org/abs/2510.01977v1",
    "pdf_url": "https://arxiv.org/pdf/2510.01977v1.pdf",
    "title": "Accelerating kinetic plasma simulations with machine learning generated   initial conditions",
    "abstract": "Computer aided engineering of multi-time-scale plasma systems which exhibit a quasi-steady state solution are challenging due to the large number of time steps required to reach convergence. Machine learning techniques combined with traditional first-principles simulations and high-performance computing offer many interesting pathways towards resolving this challenge. We consider acceleration of kinetic plasma simulations via machine learning generated initial conditions. The approach is demonstrated through modeling of capacitively coupled plasma discharges relevant to the microelectronics industry. Three models are trained on simulations across a parameter space of device driving frequency and operating pressure. The models incorporate elements of a multi-layer perceptron, principal component analysis, and convolutional neural networks to predict the final time-averaged profiles of ion-density and velocity distribution functions. These data-driven initial condition generators (ICGs) provide a mean speedup of 17.1x in convergence time, when measured using an offline procedure, or a 4.4x speedup with an online procedure, with convolutional neural networks leading to the best performance. The paper also outlines a workflow for continuous data-driven model improvement and simulation speedup, with the aim of generating sufficient data for full device digital twins.",
    "authors": [
      "Andrew T. Powis",
      "Domenica Corona Rivera",
      "Alexander Khrabry",
      "Igor D. Kaganovich"
    ],
    "published": "2025-10-02T12:53:26Z",
    "updated": "2025-10-02T12:53:26Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.01957v1",
    "url": "https://arxiv.org/abs/2510.01957v1",
    "pdf_url": "https://arxiv.org/pdf/2510.01957v1.pdf",
    "title": "Numerical tests of formulae for volume enclosed by flux surfaces of   integrable magnetic fields",
    "abstract": "Numerical tests of volume formulae are presented to compute efficiently the volume enclosed between flux surfaces for integrable 3D vector fields with various degrees of symmetry. In the process, a new case is proposed and tested.",
    "authors": [
      "David Martinez-del-Rio",
      "Robert S. MacKay"
    ],
    "published": "2025-10-02T12:24:41Z",
    "updated": "2025-10-02T12:24:41Z",
    "categories": [
      "math.DS",
      "physics.plasm-ph"
    ],
    "primary_category": "math.DS"
  },
  {
    "arxiv_id": "2510.01875v1",
    "url": "https://arxiv.org/abs/2510.01875v1",
    "pdf_url": "https://arxiv.org/pdf/2510.01875v1.pdf",
    "title": "Enhancing the Efficiency of Time-Dependent Density Functional Theory   Calculations of Dynamic Response Properties",
    "abstract": "X-ray Thomson scattering (XRTS) constitutes an essential technique for diagnosing material properties under extreme conditions, such as high pressures and intense laser heating. Time-dependent density functional theory (TDDFT) is one of the most accurate available ab initio methods for modeling XRTS spectra, as well as a host of other dynamic material properties. However, strong thermal excitations, along with the need to account for variations in temperature and density as well as the finite size of the detector significantly increase the computational cost of TDDFT simulations compared to ambient conditions. In this work, we present a broadly applicable method for optimizing and enhancing the efficiency of TDDFT calculations. Our approach is based on a one-to-one mapping between the dynamic structure factor and the imaginary time density--density correlation function, which naturally emerges in Feynman's path integral formulation of quantum many-body theory. Specifically, we combine rigorous convergence tests in the imaginary time domain with a constraints-based noise attenuation technique to improve the efficiency of TDDFT modeling without the introduction of any significant bias. As a result, we can report a speed-up by up to an order of magnitude, thus potentially saving millions of CPU hours for modeling a single XRTS measurement of matter under extreme conditions.",
    "authors": [
      "Zhandos A. Moldabekov",
      "Sebastian Schwalbe",
      "Uwe Hernandez Acosta",
      "Thomas Gawne",
      "Jan Vorberger",
      "Michele Pavanello",
      "Tobias Dornheim"
    ],
    "published": "2025-10-02T10:31:46Z",
    "updated": "2025-10-02T10:31:46Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.chem-ph",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2510.00388v2",
    "url": "https://arxiv.org/abs/2510.00388v2",
    "pdf_url": "https://arxiv.org/pdf/2510.00388v2.pdf",
    "title": "A study of the electronic and ionic structure, for co-existing states of   fully and partially ionized hydrogen, using the neutral pseudo-atom method as   well as a classical map for the electron subsystem",
    "abstract": "Prof. Michael Bonitz and his collaborators have made seminal contributions to the study of the uniform electron fluid and the electron-proton fluid, viz., hydrogen, in using {\\it ab initio} simulations. These studies provide essential inputs to astrophysics as well as high-energy density physics. This is reflected in the contributions to this festshrift in his honour. The electron-proton system becomes particularly difficult for theoretical modeling when the temperature becomes comparable to the Fermi energy $E_F$, when the warm-dense matter (WDM) state of hydrogen is reached. In this study we briefly review the theoretical methods available for the study of WDM systems, and use the neutral-pseudo atom (NPA) method, and a classical map for quantum electrons to study fully and partially ionized hydrogen. It is shown that {\\it both} fully and partially ionized states can independently exist at the {\\it same density and temperature} in many cases. Recent studies using path-integral Monte Carlo methods, and $N$-atom Density Functional Theory (DFT) simulations have provided essential structure data including the electron-electron structure factor $S_{ee}(k)$ that enters into interpretation of X-ray Thomson scattering and other diagnostics. We show that these structure data can be rapidly and inexpensively evaluated, with sufficient accuracy, using classical-map schemes for fully ionized plasmas, and more generally, using one-atom (average-atom) DFT methods for partially ionized systems.",
    "authors": [
      "M. W. C. Dharma-wardana"
    ],
    "published": "2025-10-01T01:00:54Z",
    "updated": "2025-10-02T05:23:20Z",
    "categories": [
      "physics.plasm-ph",
      "cond-mat.stat-mech"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.01573v1",
    "url": "https://arxiv.org/abs/2510.01573v1",
    "pdf_url": "https://arxiv.org/pdf/2510.01573v1.pdf",
    "title": "Suppression of inverse magnetic energy transfer in collisionless   marginally magnetized plasmas",
    "abstract": "We investigate the inverse cascade of magnetic energy in decaying, collisionless plasmas with moderate to high-$\\beta$ values via first-principles numerical simulations and analytical theory. We find that pressure-anisotropy-driven instabilities, in particular the firehose instability, suppress reconnection-driven coalescence of magnetic structures (i.e., inverse transfer) by nullifying magnetic tension. This suppression leaves such structures elongated and confined to scales comparable to the Larmor radius of the particles. The presence of a magnetic guide field of sufficient strength, or a greater scale separation between the initial size of the magnetic structures and the Larmor radius, restores the system's ability to inverse transfer magnetic energy. These results reveal that inverse energy transfer in collisionless plasmas is not guaranteed, but instead sensitively depends on magnetization. In the astrophysical context, this identifies a kinetic mechanism by which Weibel-generated seed fields may fail to merge consistently, potentially limiting their role in cosmic magnetogenesis.",
    "authors": [
      "Zhuo Liu",
      "Muni Zhou",
      "Nuno F. G. Loureiro"
    ],
    "published": "2025-10-02T01:43:53Z",
    "updated": "2025-10-02T01:43:53Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2504.18312v3",
    "url": "https://arxiv.org/abs/2504.18312v3",
    "pdf_url": "https://arxiv.org/pdf/2504.18312v3.pdf",
    "title": "A Multispacecraft Analysis and Modeling of Type III Radio Burst Exciter   Deceleration in Inhomogeneous Heliospheric Plasma",
    "abstract": "Electron beams accelerated in solar flares and escaping from the Sun along open magnetic field lines can trigger intense radio emissions known as type III solar radio bursts. Utilizing observations by Parker Solar Probe (PSP), STEREO-A (STA), Solar Orbiter (SolO), and Wind spacecrafts, the speeds and accelerations of type III exciters are derived for simple and isolated type III solar bursts. For the first time, simultaneous four spacecraft observations allow to determine positions, and correct the resulting velocities and accelerations for the location between the spacecraft and the apparent source. We observe velocities and acceleration to change as $u(r) \\propto r^{-0.37 \\pm 0.14}$ and $a(r) \\propto r^{-1.71 \\pm 0.20}$ with radial distance from the Sun $r$. To explain the electron beam deceleration, we develop a simple gas-dynamic description of the electron beam moving through plasma with monotonically decreasing density. The model predicts that the beam velocity decreases as $u(f)\\propto f^{1/4}(r)$, so the acceleration changes $\\propto r^{-1.58}$ (and speed as $\\propto r^{-0.29}$) for the plasma density profile $n(r)\\propto r^{-2.3}$. The deceleration is consistent with the average observation values corrected for the type III source locations. Intriguingly, the observations also show differences in velocity and acceleration of the same type III observed by different spacecrafts. We suggest the difference could be related to the additional time delay caused by radio-wave scattering between the spacecraft and the source.",
    "authors": [
      "Francesco Azzollini",
      "Eduard P. Kontar"
    ],
    "published": "2025-04-25T12:39:29Z",
    "updated": "2025-10-01T15:51:04Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2510.00826v1",
    "url": "https://arxiv.org/abs/2510.00826v1",
    "pdf_url": "https://arxiv.org/pdf/2510.00826v1.pdf",
    "title": "Diffraction by Circular and Triangular Apertures as a Diagnostic Tool of   Twisted Matter Waves",
    "abstract": "We study diffraction of twisted matter waves (electrons and light ions carrying orbital angular momentum $\\ell/\\hbar=0,\\pm1,\\pm2,\\ldots$ by circular and triangular apertures. Within the scalar Kirchhoff-Fresnel framework, circular apertures preserve cylindrical symmetry and produce ringlike far-field profiles whose radii and widths depend on $|\\ell|$ but are insensitive to its sign. In contrast, equilateral triangles break axial symmetry and yield structured patterns that encode both the magnitude and the sign of $\\ell$. A transparent Fraunhofer mapping links detector coordinates to the Fourier plane, explaining the $(|\\ell|+1)$-lobe rule and the sign-dependent rotation of the pattern. We validate these results for both ideal Bessel beams and localized Laguerre-Gaussian packets, and we cross-check them by split-step Fourier propagation of the time-dependent Schr\"odinger equation. From these analyses we extract practical design rules (Fraunhofer distance, lattice pitch, detector sampling) relevant to OAM diagnostics with moderately relativistic electrons with $E_{\\rm kin}\\sim0.1$ to $5$ MeV and light ions with $E_{\\rm kin}\\sim0.1$ to $1$ MeV/u. Our results establish triangular diffraction as a simple, passive, and robust method for reading out the OAM content of structured quantum beams.",
    "authors": [
      "Maksim Maksimov",
      "Nikita Borodin",
      "Daria Kargina",
      "Dmitry Naumov",
      "Dmitry Karlovets"
    ],
    "published": "2025-10-01T12:37:17Z",
    "updated": "2025-10-01T12:37:17Z",
    "categories": [
      "quant-ph",
      "hep-ph",
      "physics.acc-ph"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2510.00640v1",
    "url": "https://arxiv.org/abs/2510.00640v1",
    "pdf_url": "https://arxiv.org/pdf/2510.00640v1.pdf",
    "title": "Spectral Control of a Cavity-Based X-ray Free-Electron Laser via Active   Mode Locking",
    "abstract": "Precise spectral control in the hard X-ray regime remains a long-standing challenge that limits applications in atomic-scale science and ultrafast spectroscopy. We present an actively mode-locked cavity-based X-ray free-electron laser that achieves deterministic spectral programmability with phase-locked pulse trains and comb-like spectra, by coherently modulating the electron-beam energy. Three-dimensional time-dependent simulations predict \\SI{700}{\\micro\\joule} total energy, \\SI{30}{\\giga\\watt} peak power, and frequency-comb spacing of \\SI{1.55}{\\electronvolt} set by the modulation frequency. We further develop selective single-line amplification via undulator tapering and absolute frequency positioning through modulation-laser tuning with better than $2 \\times 10^{-5}$ relative precision. Importantly, stable mode-locked operation persists under >80\\% peak-to-peak cavity-reflectivity variations, substantially relaxing requirements on X-ray optics. These results establish active mode locking as a practical route to fully coherent, spectrally agile hard X-ray sources and enable new opportunities in time-resolved core-level spectroscopy, X-ray quantum optics, and precision metrology.",
    "authors": [
      "Nanshun Huang",
      "Hanxiang Yang",
      "Haixiao Deng"
    ],
    "published": "2025-10-01T08:16:23Z",
    "updated": "2025-10-01T08:16:23Z",
    "categories": [
      "physics.acc-ph",
      "physics.optics"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.11952v2",
    "url": "https://arxiv.org/abs/2507.11952v2",
    "pdf_url": "https://arxiv.org/pdf/2507.11952v2.pdf",
    "title": "Multi-directional investigations on quiet time suprathermal ions   measured by ASPEX-STEPS on-board Aditya L1",
    "abstract": "The origin, acceleration and anisotropy of suprathermal ions in the interplanetary medium during quiet periods have remained poorly understood issues in solar wind physics. To address these aspects, we derive the spectral indices for the quiet time suprathermal ions based on the measurements by the four directionally separated sensors that are part of the Supra-Thermal and Energetic Particle Spectrometer (STEPS) of Aditya Solar Wind Particle EXperiment (ASPEX) on-board Aditya L1 spacecraft. Three out of four STEPS sensors Parker Spiral (PS), Inter-Mediate (IM), Earth Pointing (EP) are in one plane (nearly aligned with the ecliptic plane) while the fourth sensor North Pointing (NP) is in a mutually orthogonal plane. The energy ranges covered by the PS, IM, EP and NP sensors are 0.36-1.32 MeV, 0.14-1.22 MeV, 0.39-1.33 MeV and 0.12-1.23 MeV respectively. The quiet intervals are identified during January November, 2024 and the derived spectral indices (differential directional flux versus energy) are found to be in the range of 2.0 for all directions in the time scale of a few days revealing isotropic nature of their distribution. Further analysis of elemental abundance ratios (3He/4He, Fe/O, and C/O) during the same quiet intervals obtained from the Ultra-Low Energy Isotope Spectrometer (ULEIS) on board the Advanced Composition Explorer (ACE) spacecraft suggests possible contributions from the leftover ions from the previous impulsive (Solar flares) and gradual events (CMEs) in the quiet time suprathermal ion pool.",
    "authors": [
      "Aakash Gupta",
      "Dibyendu Chakrabarty",
      "Santosh Vadawale",
      "Aveek Sarkar",
      "Bijoy Dalal",
      "Shiv Kumar Goyal",
      "Jacob Sebastian",
      "P. Janardhan",
      "Nandita Srivastava",
      "M. Shanmugam",
      "Neeraj Kumar Tiwari",
      "Aaditya Sarda",
      "Piyush Sharma",
      "Anil Bhardwaj",
      "Prashant Kumar",
      "Manan S. Shah",
      "Bhas Bapat",
      "Pranav R. Adhyaru",
      "Arpit R. Patel",
      "Hitesh Kumar Adalja",
      "Abhishek Kumar",
      "Tinkal Ladiya",
      "Sushil Kumar",
      "Nishant Singh",
      "Deepak Kumar Painkra",
      "Abhishek J. Verma",
      "Swaroop Banerjee",
      "K. P. Subramanian",
      "M. B. Dadhania"
    ],
    "published": "2025-07-16T06:38:52Z",
    "updated": "2025-10-01T06:42:38Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.EP",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2510.00493v1",
    "url": "https://arxiv.org/abs/2510.00493v1",
    "pdf_url": "https://arxiv.org/pdf/2510.00493v1.pdf",
    "title": "Correlation function metrology for warm dense matter: Recent   developments and practical guidelines",
    "abstract": "X-ray Thomson scattering (XRTS) has emerged as a valuable diagnostic for matter under extreme conditions, as it captures the intricate many-body physics of the probed sample. Recent advances, such as the model-free temperature diagnostic of Dornheim et al. [Nat.Commun. 13, 7911 (2022)], have demonstrated how much information can be extracted directly within the imaginary-time formalism. However, since the imaginary-time formalism is a concept often difficult to grasp, we provide here a systematic overview of its theoretical foundations and explicitly demonstrate its practical applications to temperature inference, including relevant subtleties. Furthermore, we present recent developments that enable the determination of the absolute normalization, Rayleigh weight, and density from XRTS measurements without reliance on uncontrolled model assumptions. Finally, we outline a unified workflow that guides the extraction of these key observables, offering a practical framework for applying the method to interpret experimental measurements.",
    "authors": [
      "Maximilian Peter Böhme",
      "Willow Martin",
      "Hannah Bellenbaum",
      "Magaret Berrens",
      "Jan Vorberger",
      "Sebastian Schwalbe",
      "Zhandos Moldabekov",
      "Thomas Gawne",
      "Sebastien Hamel",
      "Brianna Aguilar-Solis",
      "Abhiraj Sharma",
      "Frank Graziani",
      "Tilo Döppner",
      "Siegfried Glenzer",
      "Tobias Dornheim",
      "David Bishel"
    ],
    "published": "2025-10-01T04:22:31Z",
    "updated": "2025-10-01T04:22:31Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.01289v1",
    "url": "https://arxiv.org/abs/2510.01289v1",
    "pdf_url": "https://arxiv.org/pdf/2510.01289v1.pdf",
    "title": "Detailed Derivation of the Scalar Explicit Expressions Governing the   Electric Field, Current Density, and Volumetric Power Density in the Four   Types of Linear Divergent MHD Channels Under a Unidirectional Applied   Magnetic Field",
    "abstract": "The current study belongs to the field of applied mathematics in plasma physics and electric power, where mathematical analysis of the algebraic equations governing the electric field vector, and the electric-current density field vector within a Magnetohydrodynamic (MHD) linear two-dimensional divergent supersonic channel is utilized to derive analytical expressions for these important fields, as well as closed-form equations for the volumetric power density (output electric power per unit volume of the plasma channel). The expressions presented here describe analytically the operation of the MHD channel as an electric power source within an Open-Cycle Magnetohydrodynamic (OCMHD) generator. The four common types of the MHD linear channels are covered here: namely, (1) continuous-electrode Faraday channel, (2) linear Hall channel, (3) segmented-electrode Faraday channel, and (4) diagonal-electrode channel. The mathematical results, their detailed derivation, and the companion graphical illustrations aid in making a proper decision regarding which channel type is the most suitable for a given application.Under typical operational conditions of 5 S/m plasma electric conductivity, 5 T magnetic field, and 2,000 m/s plasma speed, as well as an optimized load factor of 0.5, we estimate the following numerical values (unsigned magnitudes) for the continuous-electrode Faraday channel (with a Hall parameter of 1): useful electric field (across the external electric load): 5 kV/m, useful electric current-density (between the terminal electrodes within the channel): 12.5 kA/m2 , volumetric power density (dissipated by the load per unit volume of plasma): 62.5 MW/m3 , and electric efficiency (for the electric field or voltage): 50%. For the Halllinear channel (with a Hall parameter of 5), these quantitative performance values become25 kV/m, 4.808 kA/m2, 120.19 MW/m3, and 46.30%.",
    "authors": [
      "Osama A. Marzouk"
    ],
    "published": "2025-10-01T02:56:59Z",
    "updated": "2025-10-01T02:56:59Z",
    "categories": [
      "physics.plasm-ph",
      "00A79, 03H10"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.37256/cm.6420256918"
  },
  {
    "arxiv_id": "2510.00282v1",
    "url": "https://arxiv.org/abs/2510.00282v1",
    "pdf_url": "https://arxiv.org/pdf/2510.00282v1.pdf",
    "title": "Electron neural closure for turbulent magnetosheath simulations: energy   channels",
    "abstract": "In this work, we introduce a non-local five-moment electron pressure tensor closure parametrized by a Fully Convolutional Neural Network (FCNN). Electron pressure plays an important role in generalized Ohm's law, competing with electron inertia. This model is used in the development of a surrogate model for a fully kinetic energy-conserving semi-implicit Particle-in-Cell simulation of decaying magnetosheath turbulence. We achieve this by training FCNN on a representative set of simulations with a smaller number of particles per cell and showing that our results generalise to a simulation with a large number of particles per cell. We evaluate the statistical properties of the learned equation of state, with a focus on pressure-strain interaction, which is crucial for understanding energy channels in turbulent plasmas. The resulting equation of state learned via FCNN significantly outperforms local closures, such as those learned by Multi-Layer Perceptron (MLP) or double adiabatic expressions. We report that the overall spatial distribution of pressure-strain and its conditional averages are reconstructed well. However, some small-scale features are missed, especially for the off-diagonal components of the pressure tensor. Nevertheless, the results are substantially improved with more training data, indicating favorable scaling and potential for improvement, which will be addressed in future work.",
    "authors": [
      "George Miloshevich",
      "Luka Vranckx",
      "Felipe Nathan de Oliveira Lopes",
      "Pietro Dazzi",
      "Giuseppe Arrò",
      "Giovanni Lapenta"
    ],
    "published": "2025-09-30T21:00:50Z",
    "updated": "2025-09-30T21:00:50Z",
    "categories": [
      "physics.plasm-ph",
      "cs.LG",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.26586v1",
    "url": "https://arxiv.org/abs/2509.26586v1",
    "pdf_url": "https://arxiv.org/pdf/2509.26586v1.pdf",
    "title": "Supergranulation and poleward migration of the magnetic field at high   latitudes of the Sun",
    "abstract": "Magnetoconvection at the solar surface governs the dynamics in the upper solar atmosphere and sustains the heliosphere. Properties of this fundamental process are poorly described near the solar poles. Here we report the first out-of-ecliptic remote-sensing observations of the south pole of the Sun from a high-latitude campaign of the Solar Orbiter spacecraft which reveal spatial and temporal evolution of supergranular convective cells. The supergranular cells have spatial scales of 20--40\\,Mm. From eight days of observations starting on 2025 March 16, our analysis shows that the magnetic network migrates poleward, on average, at high latitudes (above 60\\textdegree), with speeds in the range of 10--20\\,m\\,s$^{-1}$, depending on the structures being tracked. These results shed light on the buildup of the polar magnetic field that is central to our understanding of the solar cycle and the heliospheric magnetic field.",
    "authors": [
      "L. P. Chitta",
      "D. Calchetti",
      "J. Hirzberger",
      "G. Valori",
      "E. R. Priest",
      "S. K. Solanki",
      "D. Berghmans",
      "C. Verbeeck",
      "E. Kraaikamp",
      "K. Albert",
      "T. Appourchaux",
      "F. J. Bailén",
      "L. R. Bellot Rubio",
      "J. Blanco Rodríguez",
      "A. Feller",
      "A. Gandorfer",
      "L. Gizon",
      "A. Lagg",
      "A. Moreno Vacas",
      "D. Orozco Suárez",
      "J. Schou",
      "U. Schühle",
      "J. Sinjan",
      "H. Strecker",
      "R. Volkmer",
      "J. Woch",
      "X. Li",
      "T. Oba",
      "A. Ulyanov"
    ],
    "published": "2025-09-30T17:43:25Z",
    "updated": "2025-09-30T17:43:25Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2509.26357v1",
    "url": "https://arxiv.org/abs/2509.26357v1",
    "pdf_url": "https://arxiv.org/pdf/2509.26357v1.pdf",
    "title": "Validation of ERMES 20.0 finite element code for MAST Upgrade O-X mode   conversion",
    "abstract": "This study presents the validation of the frequency-domain finite element code ERMES 20.0, benchmarked against Finite Difference Time Domain (FDTD) solvers. The simulations focus on Ordinary-Extraordinary (O-X) mode conversion in the Electron Bernstein Wave (EBW) regime of the MAST Upgrade experiment. Validation is performed in terms of mode conversion efficiency and wave propagation characteristics. Several finite element formulations are tested and compared with the FDTD results. The simulations demonstrate excellent agreement between the different approaches, confirming the accuracy and robustness of ERMES 20.0 for modeling cold plasma wave interactions.",
    "authors": [
      "Ruben Otin",
      "Ying Hao Matthew Liang",
      "Thomas Wilson",
      "Simon Freethy",
      "Valerian Hall-Chen"
    ],
    "published": "2025-09-30T14:57:10Z",
    "updated": "2025-09-30T14:57:10Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.13206v2",
    "url": "https://arxiv.org/abs/2509.13206v2",
    "pdf_url": "https://arxiv.org/pdf/2509.13206v2.pdf",
    "title": "Virtual states and exponential decay in small-scale dynamo",
    "abstract": "We develop the Kazantsev theory of small-scale dynamo generation at small Prandtl numbers near the generation threshold and restore the concordance between the theory and numerical simulations: the theory predicted a power-law decay below the threshold, while simulations demonstrate exponential decay. We show that the exponential decay is temporary and owes its existence to the flattening of the velocity correlator at large scales. This effect corresponds to the existence of a long-living virtual level in the corresponding Schrodinger type equation. We also find the critical Reynolds number and the increment of growth/decay above and under the threshold; we express them in terms of the quantitative characteristic properties of the velocity correlator, which makes it possible to compare the results with the data of different simulations.",
    "authors": [
      "A. V. Kopyev",
      "V. A. Sirota",
      "A. S. Il'yn",
      "K. P. Zybin"
    ],
    "published": "2025-09-16T16:15:04Z",
    "updated": "2025-09-30T14:08:53Z",
    "categories": [
      "physics.flu-dyn",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.flu-dyn"
  },
  {
    "arxiv_id": "2509.26174v1",
    "url": "https://arxiv.org/abs/2509.26174v1",
    "pdf_url": "https://arxiv.org/pdf/2509.26174v1.pdf",
    "title": "BABY 1L: First Tritium Breeding Campaign Results",
    "abstract": "Achieving tritium self-sufficiency is a critical challenge for future fusion power plants. The BABY 1L experiment, part of the LIBRA project at MIT, aims to benchmark tritium breeding and release in molten salt breeder systems under deuterium-tritium (DT) neutron irradiation. Building on the initial \\SI{100}{mL} campaign, BABY 1L introduces a tenfold increase in breeder volume, improved thermal and gas handling systems, and enhanced neutron diagnostics, including a proton recoil telescope. We report on results from four irradiation experiments using sealed-tube DT neutron generators, with tritium collected by water bubblers measured via liquid scintillation counting. Experimentally determined Tritium Breeding Ratios (TBRs) were compared to OpenMC neutronics simulations, showing very good agreement. The measured TBR values demonstrate a six-fold improvement over the \\SI{100}{mL} experiments, largely attributed to the increased solid angle and improved measurement fidelity. We also investigate tritium release dynamics and identify diffusion-limited transport as the dominant regime in the salt volume in the temperature range 630-750 \\si{\\celsius}. Additionally, we observe that the introduction of hydrogen in the helium carrier gas significantly accelerates tritium release, consistent with an isotopic exchange mechanism. All analysis is conducted through the open-source \\texttt{libra-toolbox} \\cite{libra-toolbox}, which streamlines simulation, data processing, and validation across experimental campaigns. These results provide critical insights into the design and operation of future liquid breeder systems and demonstrate the maturity of the BABY platform as a testbed for tritium breeding studies.",
    "authors": [
      "Rémi Delaporte-Mathurin",
      "Nikola Goles",
      "Collin Dunn",
      "Emily Edwards",
      "Sara Ferry",
      "Ross MacDonald",
      "Ethan Peterson",
      "Davide Pettinari",
      "Stefano Segantin",
      "Weiyue Zhou",
      "Kevin B. Woller"
    ],
    "published": "2025-09-30T12:30:12Z",
    "updated": "2025-09-30T12:30:12Z",
    "categories": [
      "physics.ins-det",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.25870v1",
    "url": "https://arxiv.org/abs/2509.25870v1",
    "pdf_url": "https://arxiv.org/pdf/2509.25870v1.pdf",
    "title": "All-Optical Generation of Dense, Multi-GeV, Longitudinally-Polarized   Positron Beams",
    "abstract": "The production of high-yield, longitudinally polarized positron beams represents an outstanding challenge in advanced accelerator science. Laser-driven schemes offer a compact alternative but typically yield only transverse polarization, or require pre-polarized electron beams, and struggle to efficiently accelerate positrons to high energies. Here, we introduce an all-optical scheme that overcomes these limitations by integrating positron generation, acceleration, and spin manipulation in a unified framework. Through a head-on collision between an ultraintense, circularly polarized laser pulse and a counterpropagating unpolarized electron beam, we drive a robust QED cascade. The nonlinear Breit-Wheeler process within the cascade produces positrons that are born directly within the strong laser field. Crucially, these positrons are instantaneously captured and accelerated to multi-GeV energies (up to $\\sim$9 GeV) via a direct laser acceleration mechanism, while their spins are simultaneously rotated to longitudinal alignment by the field dynamics. Our Monte-Carlo simulations confirm the simultaneous achievement of a high positron yield ($\\sim$20 $e^+/e^-$), a high average longitudinal polarization ($\\sim$50\\%), and GeV-scale energies. This all-optical source, feasible at upcoming ultraintense laser facilities, presents a compact and efficient solution for applications in collider physics and fundamental high-energy experiments.",
    "authors": [
      "Rui-Qi Qin",
      "Peng-Pei Xie",
      "Yan-Fei Li",
      "Xian-Zhang Wu",
      "Zheng-Yang Zuo",
      "Bing-Jun Li",
      "Jun Liu",
      "Liang-Liang Ji",
      "Yu-Tong Li"
    ],
    "published": "2025-09-30T07:06:31Z",
    "updated": "2025-09-30T07:06:31Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.07448v3",
    "url": "https://arxiv.org/abs/2509.07448v3",
    "pdf_url": "https://arxiv.org/pdf/2509.07448v3.pdf",
    "title": "FCC-ee Lessons from SuperKEKB",
    "abstract": "SuperKEKB has achieved significantly higher specific luminosity than its predecessor KEKB, and it has proven a much more sustainable machine. It has successfully demonstrated several key design elements of FCC-ee. The design luminosity has not yet been reached, however. This observation is often (mistakenly) used to put into question the reliability of the FCC-ee design luminosity. In this note we review the accomplishments, challenges and obstacles of SuperKEKB, and compare these with the FCC-ee design.",
    "authors": [
      "Frank Zimmermann"
    ],
    "published": "2025-09-09T07:12:21Z",
    "updated": "2025-09-30T06:39:25Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2505.04211v2",
    "url": "https://arxiv.org/abs/2505.04211v2",
    "pdf_url": "https://arxiv.org/pdf/2505.04211v2.pdf",
    "title": "Omnigenous umbilic stellarators",
    "abstract": "To better understand the dependence of the magnetic field structure in the plasma edge on the plasma boundary shape, in the context of X-point and island divertor designs, we define and develop a class of stellarators called umbilic stellarators. These equilibria are characterized by a single continuous high-curvature edge on the plasma boundary that goes around multiple times toroidally before meeting itself. We develop a technique that allows us to simultaneously optimize the plasma boundary along with a curve lying on the boundary on which we impose a high curvature while imposing omnigenity -- a property of the magnetic field that ensures trapped particle confinement throughout the plasma volume. We find that umbilic stellarators naturally tend to favor piecewise omnigenity instead of omnigenity with a specific helicity. After generating omnigenous umbilic stellarators, we design coil sets for some of them and explore the field line structure in the edge and its sensitivity to small fluctuations in the plasma. Finally, using single-stage optimization, we simultaneously modify the plasma and coil shape and propose an experiment to modify an existing tokamak to a finite-beta stellarator using this technique and explore a potentially simpler way to convert a limited tokamak into a diverted stellarator.",
    "authors": [
      "R. Gaur",
      "D. Panici",
      "T. M. Elder",
      "M. Landreman",
      "K. E. Unalmis",
      "Y. Elmacioglu",
      "D. Dudt",
      "R. Conlin",
      "E. Kolemen"
    ],
    "published": "2025-05-07T08:05:50Z",
    "updated": "2025-09-30T06:35:47Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.02104v2",
    "url": "https://arxiv.org/abs/2506.02104v2",
    "pdf_url": "https://arxiv.org/pdf/2506.02104v2.pdf",
    "title": "Collisionless relaxation to equilibrium distributions in cold dark   matter halos: origin of the NFW profile",
    "abstract": "Collisionless self-gravitating systems such as cold dark matter halos are known to harbor universal density profiles despite the intricate non-linear physics of hierarchical structure formation in the $\\Lambda$CDM paradigm. The origin of such states has been a persistent mystery, particularly because the physics of collisionless relaxation has remained poorly understood. To solve this long-standing problem, we develop a self-consistent quasilinear theory in action-angle space for the collisionless relaxation of inhomogeneous, self-gravitating systems by perturbing the governing Vlasov-Poisson equations. We obtain a quasilinear diffusion equation that describes the secular evolution of the mean coarse-grained distribution function $f_0$ of accreted matter in the fluctuating force field of a spherical isotropic halo. The diffusion coefficient not only depends on the fluctuation power spectrum but also on the evolving potential of the system, which reflects the self-consistency of the problem. Diffusive heating by an initially cored halo develops an $r^{-1}$ cusp in the density profile of the accreted material, with $r$ the halocentric radius, if it is initially shallower than $r^{-1}$. This is fundamentally a consequence of the virial theorem: self-gravitating systems have a negative specific heat and want to cool down when energized. The inner halo relaxes to an $r^{-1}$ cusp because its central region is the coldest among all $r^{-\\gamma}$ profiles with $0\\leq \\gamma \\leq 2$. Accretion and relaxation in the $r^{-1}$ cusp develops an $r^{-3}$ outer fall-off, thereby establishing the Navarro-Frenk-White (NFW) density profile. We demonstrate for the first time that this profile emerges as a steady state solution to the problem of self-consistent collisionless relaxation.",
    "authors": [
      "Uddipan Banik",
      "Amitava Bhattacharjee"
    ],
    "published": "2025-06-02T18:00:00Z",
    "updated": "2025-09-30T00:10:46Z",
    "categories": [
      "astro-ph.GA",
      "astro-ph.CO",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.GA"
  },
  {
    "arxiv_id": "2503.19983v3",
    "url": "https://arxiv.org/abs/2503.19983v3",
    "pdf_url": "https://arxiv.org/pdf/2503.19983v3.pdf",
    "title": "A Linear Collider Vision for the Future of Particle Physics",
    "abstract": "In this paper we review the physics opportunities at linear $e^+e^-$ colliders with a special focus on high centre-of-mass energies and beam polarisation, take a fresh look at the various accelerator technologies available or under development and, for the first time, discuss how a facility first equipped with a technology mature today could be upgraded with technologies of tomorrow to reach much higher energies and/or luminosities. In addition, we will discuss detectors and alternative collider modes, as well as opportunities for beyond-collider experiments and R\\&D facilities as part of a linear collider facility (LCF). The material of this paper will support all plans for $e^+e^-$ linear colliders and additional opportunities they offer, independently of technology choice or proposed site, as well as R\\&D for advanced accelerator technologies. This joint perspective on the physics goals, early technologies and upgrade strategies has been developed by the LCVision team based on an initial discussion at LCWS2024 in Tokyo and a follow-up at the LCVision Community Event at CERN in January 2025. It heavily builds on decades of achievements of the global linear collider community, in particular in the context of CLIC and ILC.",
    "authors": [
      "H. Abramowicz",
      "E. Adli",
      "F. Alharthi",
      "M. Almanza-Soto",
      "M. M. Altakach",
      "S Ampudia Castelazo",
      "D. Angal-Kalinin",
      "R. B. Appleby",
      "O. Apsimon",
      "A. Arbey",
      "O. Arquero",
      "A. Aryshev",
      "S. Asai",
      "D. Attié",
      "J. L. Avila-Jimenez",
      "H. Baer",
      "J. A. Bagger",
      "Y. Bai",
      "I. R. Bailey",
      "C. Balazs",
      "T Barklow",
      "J. Baudot",
      "P. Bechtle",
      "T. Behnke",
      "A. B. Bellerive",
      "S. Belomestnykh",
      "Y. Benhammou",
      "J. Berenguer-Antequera",
      "M. Berger",
      "M. Berggren",
      "M. Bertucci",
      "M. Besançon",
      "T. Biekötter",
      "S. Bilanishvili",
      "B. Bilki",
      "B. Bilki",
      "J. Björklund Svensson",
      "V. M. Bjelland",
      "C. Blanch",
      "M. Boehler",
      "S. Boogert",
      "M. Boronat",
      "V. Boudry",
      "D. Bourilkov",
      "I. Bozovic",
      "J. Braathen",
      "J. E. Brau",
      "C. Breuning",
      "J. -C. Brient",
      "I. Brock",
      "B. Brudnowski",
      "K. Buesser",
      "E. Bulyak",
      "P. N. Burrows",
      "A. Caldwell",
      "F. G. Celiberto",
      "E. Cenni",
      "I. Chaikovska",
      "R. Chehab",
      "J. B. B. Chen",
      "G. Chen",
      "T. Chikamatsu",
      "V. Cilento",
      "P. Colas",
      "M. Coman",
      "F. Cornet",
      "F. Cornet-Gomez",
      "F. Corriveau",
      "J. Cvach",
      "R. D'Arcy",
      "C. Damerell",
      "A. Das",
      "S. Dasu",
      "J. de Blas",
      "E. Del Core",
      "M. Demarteau",
      "H. Denizli",
      "R. Dermisek",
      "A. Dhar",
      "S. Dittmaier",
      "F. Djurabekova",
      "E. M. Donegani",
      "A. Doyle",
      "P. Drobniak",
      "T. A. du Pree",
      "B. Dudar",
      "H. Duran Yildiz",
      "G. Durieux",
      "J. Dutta",
      "S. Easo",
      "G. Eckerlin",
      "U. Einhaus",
      "E. Esarey",
      "D. Espriu",
      "L. R Evans",
      "J. Farmer",
      "A. Faus Golfe",
      "M. Fernandez",
      "J. C. Fernandez-Ortega",
      "M. Formela",
      "A. Formenti",
      "B. Foster",
      "N. Fourches",
      "M. C. Fouz",
      "A. Freitas",
      "C. D. Fu",
      "K. Fujii",
      "J. Fujimoto",
      "B. Fuks",
      "J. Fuster",
      "N. Fuster-Martínez",
      "F. Gaede",
      "M. Galletti",
      "E. Gallo",
      "S. Ganjour",
      "M. V. Garzelli",
      "R. L. Geng",
      "S. Gessner",
      "I. D. Gialamas",
      "B. Gimeno",
      "J. Goldstein",
      "M. Goncerz",
      "F. J. Gonzalez",
      "D. González-Iglesias",
      "S. G. Gori",
      "J. Grames",
      "P. Grannis",
      "L. Gray",
      "G. Grenier",
      "H. Guler",
      "H. E. Haber",
      "K. Hamaguchi",
      "N. Hamann",
      "O. Hartbrich",
      "G. Hütsi",
      "S. Heinemeyer",
      "G. Heinrich",
      "C. Hensel",
      "K. Hidaka",
      "S. Hirose",
      "A. H. Hoang",
      "M. J. Hogan",
      "W. Hollik",
      "Y. Horii",
      "R. Hosokawa",
      "S. Huang",
      "D. Hynds",
      "M. I. Idzik",
      "S. Iguro",
      "Y. Iiyama",
      "K. Ikematsu",
      "A. Irles",
      "A. Ishikawa",
      "M. Ishino",
      "I. P. Ivanov",
      "Y. Iwashita",
      "M. Jacewicz",
      "R. Jaramillo",
      "D. Jeans",
      "C. Jing",
      "R. M Jones",
      "W. Kaabi",
      "M. Kagan",
      "J. Kalinowski",
      "D. K Kalvik",
      "J. Kaminski",
      "S. Kanemura",
      "K. Kannike",
      "A. Karam",
      "Y. Kato",
      "K. Kawagoe",
      "D. Käfer",
      "L. Kennedy",
      "J. Kersten",
      "S. A. Khan",
      "V. A. Khoze",
      "W. Kilian",
      "J. Klamka",
      "P. Kluit",
      "K. Kong",
      "P. Koppenburg",
      "A. Korsun",
      "A. V. Kotwal",
      "S. Kraml",
      "K. Krüger",
      "K. Kubo",
      "T. Kubo",
      "M. Kucharczyk",
      "N. Kumar",
      "A. Kumar",
      "M. Kurata",
      "Y. Kurihara",
      "J. Kvasnicka",
      "K. Kyoya",
      "I. Laktineh",
      "A. Latina",
      "F. LeDiberder",
      "A. Levy",
      "M. Liepe",
      "C. A. Lindstrøm",
      "B. List",
      "J. List",
      "M. Litos",
      "V. N. Litvinenko",
      "A. Lopez-Virto",
      "X. Lu",
      "T. Luo",
      "M. Lupberger",
      "B. Madison",
      "T. Madlener",
      "J. Maeda",
      "F. Mahmoudi",
      "E. Maina",
      "N. Majernik",
      "R. Margraf-O'Neal",
      "P. Martín-Luna",
      "A. Martens",
      "V. J. Martin",
      "L. Marzola",
      "V. I. Maslov",
      "K. T. Matchev",
      "S. Matsumoto",
      "K. Mawatari",
      "J. P. Márquez",
      "M. M. Mühlleitner",
      "P. A. McIntosh",
      "K. Mekala",
      "D. Melini",
      "F. Meloni",
      "A. Menéndez",
      "S. Michizono",
      "K. Mimasu",
      "V. Miralles",
      "W. Mitaroff",
      "V. A. Mitsou",
      "L. Monaco",
      "G. Moortgat-Pick",
      "M. Moreno-Llácer",
      "T. Mori",
      "J. M. Moron",
      "S. Morton",
      "D. Moya",
      "M. Mulder",
      "E. Musumeci",
      "V. V. Mytrochenko",
      "N. Nagata",
      "E. Nagy",
      "T. Nakada",
      "J. Nakajima",
      "K. Nakamura",
      "E. A. Nanni",
      "E. Nardi",
      "S. Narita",
      "M. T. Núñez Pardo de Vera",
      "M. Nojiri",
      "D. Ntounis",
      "A. Ody",
      "O. M. Ogreid",
      "Y. Okada",
      "C. Oleari",
      "M. Olvegård",
      "M. Omet",
      "T. Omori",
      "Y. Onel",
      "H. Ono",
      "W. Ootani",
      "C. Orero",
      "J. Osborne",
      "K. Osterberg",
      "J. Osterhoff",
      "M. Ouchemhou",
      "Q. Ouyang",
      "S. Pagan Griso",
      "R. Paparella",
      "S. C. Park",
      "J. Pata",
      "J. R. Patterson",
      "R. Pöschl",
      "F. Peña",
      "L. K Pedraza-Motavita",
      "M. E. Peskin",
      "F. Pilat",
      "P. Piot",
      "S. Plätzer",
      "I. Polak",
      "W. Porod",
      "K. Potamianos",
      "C. T. Potter",
      "P. Poulose",
      "J. G. Power",
      "D. Protopopescu",
      "H. R. Qi",
      "J. Rabara Bailey",
      "M. Raidal",
      "J. P. Ralston",
      "A. Rastogi",
      "L. Reichenbach",
      "J. Reuter",
      "F. Richard",
      "S. Riemann",
      "R. A. Rimmer",
      "T. Robens",
      "A. Robson",
      "G. Rodrigo",
      "C. S. Rogan",
      "J. Rojo",
      "M. Q. Ruan",
      "S. Rudrabhatla",
      "A. Ruiz Jimeno",
      "T. Saeki",
      "H. Sakai",
      "Y. Sakaki",
      "F. Salvatore",
      "T. Sanuki",
      "S. Sasikumar",
      "T Schörner",
      "S. Schroeder",
      "C. B. Schroeder",
      "I. Schulthess",
      "M. Schumacher",
      "A. Schwartzman",
      "Y. Seiya",
      "A. Senol",
      "H. Sert",
      "D. Sertore",
      "A. Seryi",
      "T. Shidara",
      "K. Sjobak",
      "I. Smiljanic",
      "S. Spannagel",
      "M. Spira",
      "M. Stanitzki",
      "S. Stapnes",
      "D. Storey",
      "J. Strube",
      "A. Subba",
      "A. Subba",
      "T. Suehara",
      "H. Sugawara",
      "K. Sugizaki",
      "Z. Sun",
      "R. Szafron",
      "T. Takahashi",
      "T. Takeshita",
      "T. Tauchi",
      "G. Taylor",
      "N. Terunuma",
      "D. Terzani",
      "T. Teubner",
      "J. Tian",
      "J. Timmermans",
      "M. Titov",
      "R. Tomas Garcia",
      "T. Tong",
      "J. M. Torndal",
      "M. Trautwein",
      "A. Tricoli",
      "K. Tsumura",
      "B. Tuchming",
      "D. Tuckler",
      "M. Tytgat",
      "A. Ukleja",
      "C. Vallee",
      "R. Van Kooten",
      "J. van Tilborg",
      "A. Vauth",
      "M. Vellasco",
      "C. Vernieri",
      "L. Verra",
      "M. Vicente Barreto Pinto",
      "I. Vidakovic",
      "H. Videau",
      "E. Viklund",
      "I. Vila",
      "M. Villaplana",
      "M. Vos",
      "N. Vukasinovic",
      "N. Walker",
      "K. Wandall-Christensen",
      "Y. Wang",
      "Z. Was",
      "T. Watanabe",
      "N. K. Watson",
      "G. Weiglein",
      "J. D. Wells",
      "H. Wennlöf",
      "M. Wenskat",
      "S. Westhoff",
      "J. W. Wetzel",
      "A. P. White",
      "P. H. Williams",
      "M. Williams",
      "G. W. Wilson",
      "M. Wing",
      "A. Winter",
      "M. Winter",
      "T. Wojton",
      "J. C. Wood",
      "X. Xia",
      "K. Yagyu",
      "H. Yamamoto",
      "A. Yamamoto",
      "K. Yamamoto",
      "Y. Yamamoto",
      "S. Yamashita",
      "M. Yamauchi",
      "K. Yokoya",
      "M. Yoshioka",
      "J. Zalesak",
      "A. F. Zarnecki",
      "K. Zembaczynski",
      "D. Zerwas",
      "Y. Zhang",
      "J. Zhang",
      "M. Zielinski",
      "M. Zobov"
    ],
    "published": "2025-03-25T18:09:46Z",
    "updated": "2025-09-29T22:58:20Z",
    "categories": [
      "hep-ex",
      "hep-ph",
      "physics.acc-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2509.25506v1",
    "url": "https://arxiv.org/abs/2509.25506v1",
    "pdf_url": "https://arxiv.org/pdf/2509.25506v1.pdf",
    "title": "Persistence of Deuterium and Tritium Nuclear Spin-Polarization in   Presence of High-Frequency Plasma Waves",
    "abstract": "We present first-principles numerical calculations of the depolarization rate of spin-polarized deuterium and tritium nuclei in realistic tokamak plasmas, driven by resonant interactions with plasma waves. Backed up by first-of-a-kind linear and nonlinear simulations, we find that alpha particle-driven Alfv\\'enic modes cause only negligible depolarization, which is contrary to expectations in prior literature. Other Alfv\\'enic instabilities can in principle degrade polarization, but only under conditions unlikely to be realized on transport timescales. By combining full-orbit particle tracing with a dedicated depolarization solver, we demonstrate that wave-driven depolarization is surprisingly weak in SPARC and ITER-scale devices. These results provide strong evidence that spin-polarized fuel can maintain its polarization long enough to boost fusion reactivity, opening a viable path toward substantially enhanced performance in magnetic confinement fusion power plants.",
    "authors": [
      "J. W. S. Cook",
      "H. Ali",
      "J. F. Parisi",
      "A. Diallo",
      "N. Faatz"
    ],
    "published": "2025-09-29T21:04:35Z",
    "updated": "2025-09-29T21:04:35Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.25423v1",
    "url": "https://arxiv.org/abs/2509.25423v1",
    "pdf_url": "https://arxiv.org/pdf/2509.25423v1.pdf",
    "title": "Electropolishing-Induced Topographic Defects in Niobium: Insights and   Implications for Superconducting Radio Frequency Applications",
    "abstract": "Electropolishing is the premier surface preparation method for high-Q, high-gradient superconducting RF cavities made of Nb. This leaves behind an apparently smooth surface, yet the achievable peak magnetic fields fall well below the superheating field of Nb, in most cases. In this work, the ultimate surface finish of electropolishing was investigated by studying its effect on highly polished Nb samples. Electropolishing introduces high slope angle sloped-steps at grain boundaries. The magnetic field enhancement and superheating field suppression factors associated with such a geometry are calculated in the London theory. Despite the by-eye smoothness of electropolished Nb, such defects compromise the stability of the low-loss Meissner state, likely limiting the achievable peak accelerating fields in superconducting RF cavities. Finally, the impact of surface roughness on impurity diffusion is investigated which can link surface roughness to the effectiveness of heat treatments like low-temperature baking or nitrogen infusion in the vortex nucleation or hydride hypotheses. Surface roughness tends to decrease the effective dose of impurities as a result of the expansion of impurities into regions with greater internal angle. The effective dose of impurities can be protected by minimizing slope angles and step heights, ensuring uniformity.",
    "authors": [
      "Oleksandr Hryhorenko",
      "Anne-Marie Valente-Feliciano",
      "Eric M. Lechner"
    ],
    "published": "2025-09-29T19:31:12Z",
    "updated": "2025-09-29T19:31:12Z",
    "categories": [
      "cond-mat.supr-con",
      "cond-mat.mtrl-sci",
      "physics.acc-ph",
      "physics.app-ph"
    ],
    "primary_category": "cond-mat.supr-con"
  },
  {
    "arxiv_id": "2509.25066v1",
    "url": "https://arxiv.org/abs/2509.25066v1",
    "pdf_url": "https://arxiv.org/pdf/2509.25066v1.pdf",
    "title": "Avalanches in Magnetohydrodynamical simulations",
    "abstract": "Scale invariance is a hallmark of many natural systems, including solar flares, where energy release spans a vast range of scales. Recent computational advances, at the level of both algorithmics and hardware, have enabled high-resolution magnetohydrodynamical (MHD) simulations to span multiple scales, offering new insights into magnetic energy dissipation processes. Here, we study scale invariance of magnetic energy dissipation in two distinct MHD simulations. Current sheets are identified and analyzed over time. Results demonstrate that dissipative events exhibit scale invariance, with power-law distributions characterizing their energy dissipation and lifetimes. Remarkably, these distributions are consistent across the two simulations, despite differing numerical and physical setups, suggesting universality in the process of magnetic energy dissipation. Comparisons between the evolution of dissipation regions reveals distinct growth behaviors in high plasma-beta regions (convective zone) and low plasma-beta regions (atmosphere). The latter display spatiotemporal dynamics similar to those of avalanche models, suggesting self-organized criticality and a common universality class.",
    "authors": [
      "Henri Lamarre",
      "Paul Charbonneau",
      "Quentin Noraz",
      "Antoine Strugarek",
      "Alexis Blaise",
      "Allan Sacha Brun",
      "Mats Carlsson",
      "Boris Vilhelm Gudiksen"
    ],
    "published": "2025-09-29T17:13:12Z",
    "updated": "2025-09-29T17:13:12Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2509.24775v1",
    "url": "https://arxiv.org/abs/2509.24775v1",
    "pdf_url": "https://arxiv.org/pdf/2509.24775v1.pdf",
    "title": "Attosecond electron bunch generation by an intense high-order harmonic   pulse interacting with a thin target",
    "abstract": "Laser-accelerated electron bunches and the secondary radiation sources they produce exhibit unique temporal resolution for probing ultrafast physical processes due to their ultrashort pulse duration. The inherently short temporal profile of these pulses leads to extremely high peak bunch currents, thereby enabling a wide range of practical applications. In this study, we propose an innovative method for generating such bunch by utilizing high-harmonics generated through laser-plasma interaction as the driving pulse, which subsequently interacts with a thin target to produce an attosecond electron bunch. Using this method, we successfully generated an electron bunch characterized by excellent collimation and an ultra-short duration of approximately 100 attoseconds, representing a substantial reduction in bunch duration. The total bunch charge achieved was 0.38 nC, with an emittance of $4.5 \\times 10^{-3} \\, \\text{mm} \\cdot \\text{mrad}$ and a divergence angle of approximately $10^\\circ$. Moreover, by systematically analyzing the effects of laser intensity and target positioning, we determined an optimized set of simulation parameters. This research establishes a robust foundation for the generation of ultrashort electron bunches and opens new prospects for their application in advanced high-energy and attosecond physics experiments.",
    "authors": [
      "Yang He",
      "Mamat Ali Bake",
      "Cheng-Qi Zhang",
      "Bai-Song Xie"
    ],
    "published": "2025-09-29T13:40:21Z",
    "updated": "2025-09-29T13:40:21Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.24750v1",
    "url": "https://arxiv.org/abs/2509.24750v1",
    "pdf_url": "https://arxiv.org/pdf/2509.24750v1.pdf",
    "title": "Is Turbulence able to Generate Magnetic Islands in Tokamaks? Gyrokinetic   Simulations of Turbulence-Driven Magnetic Islands in Toroidal Geometry",
    "abstract": "We report a universal mechanism for turbulence-driven magnetic islands in fusion plasmas. Using gyrokinetic simulations of a linearly stable tearing mode in a large-aspect-ratio toroidal geometry under collisionless conditions, we demonstrate that micro-instabilities generate an $\\boldsymbol{E}\\times\\boldsymbol{B}$ flow that drives magnetic field line reconnection. This process forms multiple small-scale islands along the resonant surface, which interact nonlinearly and eventually coalesce into large-scale magnetic islands. These islands are capable of significantly flattening the equilibrium profile across the island O-points and thus acting as a seed for their further neoclassical growth. Notably, the mechanism operates independently of the parity of the destabilizing micro-instability.",
    "authors": [
      "Fabien Widmer",
      "Emanuele Poli",
      "Alexey Mishchenko",
      "Akihiro Ishizawa",
      "Thomas Hayward-Schneider",
      "Alberto Bottino"
    ],
    "published": "2025-09-29T13:17:30Z",
    "updated": "2025-09-29T13:17:30Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.24513v1",
    "url": "https://arxiv.org/abs/2509.24513v1",
    "pdf_url": "https://arxiv.org/pdf/2509.24513v1.pdf",
    "title": "Flow Crossover and Parallel Outflow during Collisionless Magnetic   Reconnection",
    "abstract": "Using particle-in-cell simulations that label ions and electrons according to their initial inflow region, we find that during 2D collisionless magnetic reconnection, the bulk flow of the plasma from each inflow side crosses paths with plasma from the other inflow side and crosses the midplane before being redirected into an outflow jet. This feature, which we term ``flow crossover,'' implies mechanisms to generate bulk motion in a direction parallel to the magnetic field. We find that ions and electrons undergo different parallel driving mechanisms, leading to different flow crossover patterns. The parallel bulk flow for ions is generated more locally within the ion diffusion region, whereas the parallel bulk flow for electrons is mostly generated outside the electron diffusion region. Consequently, the reconnection outflows are more of a parallel flow than a perpendicular flow, especially for the electron outflow. The flow crossover and the parallel outflow patterns occur not only in symmetric reconnection but also in the more complex scenario of a guide-field asymmetric reconnection, suggesting that it is a general feature of collisionless magnetic reconnection. Because the plasma on one side of the outflow mostly originates from the inflow plasma on the other side, we predict that near an asymmetric reconnection site in a collisionless space plasma, in situ observations across the outflow region could reveal locally reversed gradients in plasma properties.",
    "authors": [
      "Theerasarn Pianpanit",
      "Kittipat Malakit",
      "Pakkapawn Prapan",
      "David Ruffolo",
      "Peera Pongkitiwanichakul",
      "Piyawat Suetrong",
      "Michael A. Shay",
      "Paul A. Cassak"
    ],
    "published": "2025-09-29T09:27:04Z",
    "updated": "2025-09-29T09:27:04Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.03443v2",
    "url": "https://arxiv.org/abs/2508.03443v2",
    "pdf_url": "https://arxiv.org/pdf/2508.03443v2.pdf",
    "title": "Energy Cascade and Damping in Fast-Mode Compressible Turbulence",
    "abstract": "Compressible turbulence governs energy transfer across scales in space and astrophysical systems. Capturing both the turbulence cascade and damping is therefore crucial for models of energy conversion, plasma heating, and particle transport in diverse plasma environments, but remains challenging. Progress is constrained by two unresolved fundamental questions: the persistence of the turbulence cascade in the presence of shocks and discontinuities, and the validity of classical wave theories under strong nonlinearity. In particular, it remains unclear whether meaningful cascade dynamics can be defined in compressible turbulence with phase steepening, and whether frameworks developed for monochromatic waves remain applicable to complex, broadband fluctuations. Using large-scale, high-resolution kinetic simulations, we analyze turbulence-particle interactions, which are beyond the capability of standard magnetohydrodynamic (MHD) simulations. We show that compressible turbulence damping at MHD scales in quantitative agreement with transit-time damping theory, even in fully developed nonlinear states. Moreover, the cascade persists despite the generation of shocks and discontinuities due to phase steepening, revealing a surprising robustness of cross-scale energy transfer under extreme conditions. We further provide the spectral expression of compressible turbulence. These results close a long-standing gap in the physics of compressible turbulence and establish a robust foundation for turbulence modeling from the heliosphere to galaxies.",
    "authors": [
      "Chuanpeng Hou",
      "Huirong Yan",
      "Siqi Zhao",
      "Parth Pavaskar"
    ],
    "published": "2025-08-05T13:41:18Z",
    "updated": "2025-09-29T08:07:51Z",
    "categories": [
      "astro-ph.SR",
      "astro-ph.HE",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2504.08559v2",
    "url": "https://arxiv.org/abs/2504.08559v2",
    "pdf_url": "https://arxiv.org/pdf/2504.08559v2.pdf",
    "title": "Multi-MeV electron occurrence and lifetimes in the outer radiation belt   and slot region during the maximum of solar cycle 22",
    "abstract": "The Combined Release and Radiation Effects Satellite (CRRES) observed the response of the Van Allen radiation belts to peak solar activity within solar cycle 22. This study analyses relativistic and ultra-relativistic electron occurrence and loss timescales within the CRRES High Energy Electron Fluxometer (HEEF) dataset, including during several strong and severe geomagnetic storms that all, remarkably, flooded the slot region with multi-MeV electrons. These allow the first definitive multi-MeV electron lifetimes to be calculated in this region and indicate an elevated risk to satellites in slot region orbits during periods of heightened solar activity. The HEEF outer belt loss timescales are broadly in agreement with those from later solar cycles, but differences include longer-lasting sub-MeV electrons near the inner region of the outer belt and faster-decaying multi-MeV electrons near geosynchronous orbit. These differences are associated with higher levels of geomagnetic activity, a phenomenon that enables the spread in the results to be parameterised accordingly. The timescales generally appear well-bounded by Kp-dependent theoretical predictions, but the variability within the spread is not always well-ordered by geomagnetic activity. This suggests the limitations of using pitch-angle diffusion to account for the decay of elevated electrons following geomagnetic storms, and the need for more sophisticated space weather indices for radiation belt forecasting.",
    "authors": [
      "R. T. Desai",
      "J. Perrin",
      "N. P. Meredith",
      "S. A. Glauert",
      "S. Ruparelia",
      "W. R. Johnston"
    ],
    "published": "2025-04-11T14:07:09Z",
    "updated": "2025-09-29T07:17:24Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.EP",
      "astro-ph.HE",
      "astro-ph.SR",
      "physics.geo-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph",
    "doi": "10.1029/2025SW004448"
  },
  {
    "arxiv_id": "2501.13681v7",
    "url": "https://arxiv.org/abs/2501.13681v7",
    "pdf_url": "https://arxiv.org/pdf/2501.13681v7.pdf",
    "title": "A projection method for particle resampling",
    "abstract": "Particle discretizations of partial differential equations are advantageous for high-dimensional kinetic models in phase space due to their better scalability than continuum approaches with respect to dimension. Complex processes collectively referred to as particle noise hamper long time simulations with particle methods. One approach to address this problem is particle mesh adaptivity or remapping, known as particle resampling. This paper introduces a resampling method that projects particles to and from a (finite element) function space. The method is simple; using standard sparse linear algebra and finite element techniques, it can adapt to almost any set of new particle locations and preserves all moments up to the order of polynomial represented exactly by the continuum function space. This work is motivated by the Vlasov-Maxwell-Landau model of magnetized plasmas with up to six dimensions, 3X in physical space and 3V in velocity space, and is developed in the context of a 1X + 1V Vlasov-Poisson model of Landau damping with logically regular particle and continuum phase space grids. Stable long time dynamics are demonstrated up to T = 500 and reproducibility artifacts and data with stable dynamics up to T = 1000 are publicly available.",
    "authors": [
      "Mark F. Adams",
      "Daniel S. Finn",
      "Matthew G. Knepley",
      "Joseph V. Pusztay"
    ],
    "published": "2025-01-23T14:07:15Z",
    "updated": "2025-09-29T01:02:32Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  }
]