{
  "arxiv_id": "2504.20698v2",
  "url": "https://arxiv.org/abs/2504.20698v2",
  "pdf_url": "https://arxiv.org/pdf/2504.20698v2.pdf",
  "title": "A High-Granularity Proton CT Enhanced by Track Discrimination",
  "abstract": "Proton Computed Tomography (pCT) provides a promising solution to enhance the accuracy of Relative Stopping Power (RSP) required for proton therapy planning. This research introduces a novel high-granularity pCT architecture that incorporates a silicon pixel tracking system and a calorimetric range telescope, which uniquely integrates range telescope functionality with track discrimination capabilities. The Bortfeld function fitting and Convolutional Neural Network (CNN) classifier algorithms are developed and applied for discrimination. In simulation studies, both approaches demonstrate the capability to reduce uncertainty in Water Equivalent Path Length (WEPL) determination for individual proton tracks to below 3~mm. The standard imaging protocol (3.2~mGy, $4\\times10^{8}$ protons) achieves sub-millimeter spatial resolution ($\\sim$0.5 mm) with sub-1\\% RSP accuracy. With proton count requirements reduced by track discrimination, an ultra-low-dose protocol (0.16~mGy, $2\\times10^{7}$~protons) is proposed with achieved sub-1\\% RSP accuracy and $\\sim$1.1~mm spatial resolution in simulation. This low-dose performance significantly expands clinical applicability, particularly for pediatric imaging or frequent imaging scenarios. Furthermore, the target 10 MHz proton detection rate suggests potential for real-time image guidance during radiotherapy. By circumventing the need for ultra-precise energy measurements, this design minimizes hardware complexity and provides a scalable foundation for future pCT systems.",
  "authors": [
    "Huang-Chao Shi",
    "Dan-Qi Wang",
    "Mei-Qi Liu",
    "Yi-Dong Yang",
    "Bao-Hua Qi",
    "Yong Liu",
    "Yang-Hui Qin",
    "Chang-Qing Feng",
    "Yi Liu",
    "Hong-Bo Zhu"
  ],
  "published": "2025-04-29T12:29:12Z",
  "updated": "2025-08-16T03:11:47Z",
  "categories": [
    "physics.med-ph",
    "physics.ins-det"
  ],
  "primary_category": "physics.med-ph"
}