{
  "arxiv_id": "2507.03914v2",
  "url": "https://arxiv.org/abs/2507.03914v2",
  "pdf_url": "https://arxiv.org/pdf/2507.03914v2.pdf",
  "title": "Revealing Secondary Particle Signatures in Muography Based on the Point   of Closest Approach Algorithm",
  "abstract": "This work reinterprets so-called 'noise' in cosmic ray imaging, indicating that the data of reconstructed Points of Closest Approach (PoCA points) outside the volume of interest defined by traditional tomography methods contain valuable physical information that has been traditionally disregarded. Through analysis of data from the detection system of four resistive plate chambers (RPCs) and Monte Carlo simulations employing energy deposition weighting for coordinate determination, we confirm that these points physically originate from the interaction between muons and the material above the detection system, particularly the roof, resulting in the production of secondary particles. The research yields two principal findings: first, in the four-layer compliance measurement system, the position recording of the first layer can be from secondary particles generated by cosmic rays, while the records from the three layers below represent the actual trajectories of cosmic rays; second, the roof structure significantly impacts the distribution of PoCA points at detector positions, where quantitative analysis demonstrates a strong correlation between roof thickness and the number of reconstructed PoCA points -- a relationship that can be precisely measured through $z$-coordinate distribution analysis in specific intervals. Due to the varying performances of different roofing materials in this analytical method, this approach holds significant potential for development into a new tomography technique.",
  "authors": [
    "Rongfeng Zhang",
    "Zibo Qin",
    "Cheng-en Liu",
    "Qite Li",
    "Yong Ban",
    "Chen Zhou",
    "Qiang Li"
  ],
  "published": "2025-07-05T06:00:26Z",
  "updated": "2025-09-16T11:54:36Z",
  "categories": [
    "hep-ex",
    "physics.ins-det"
  ],
  "primary_category": "hep-ex"
}