{
  "arxiv_id": "2509.11918v1",
  "url": "https://arxiv.org/abs/2509.11918v1",
  "pdf_url": "https://arxiv.org/pdf/2509.11918v1.pdf",
  "title": "Extraction of Electron and Hole Drift Velocities in thin 4H-SiC PIN   Detectors using High-Frequency Readout Electronics",
  "abstract": "Silicon carbide (SiC) has been widely adopted in the semiconductor industry, particularly in power electronics, because of its high temperature stability, high breakdown field, and fast switching speeds. Its wide band gap makes it an interesting candidate for radiation-hard particle detectors in high-energy physics and medical applications. Furthermore, the high electron and hole drift velocities in 4H-SiC enable devices suitable for ultra-fast particle detection and timing applications. However, currently, the front-end readout electronics used for 4H-SiC detectors constitute a bottleneck in investigations of the charge carrier drift. To address these limitations, a high-frequency readout board with an intrinsic bandwidth of 10 GHz was developed. With this readout, the transient current signals of a 4H-SiC diode with a diameter of 141 $\\mathrm{\\mu m}$ and a thickness of 50 $\\mathrm{\\mu m}$ upon UV-laser, alpha particle, and high-energy proton beam excitation were recorded. In all three cases, the electron and hole drift can clearly be separated, which enables the extraction of the charge carrier drift velocities as a function of the electric field. These velocities, for the first time directly measured, provide a valuable comparison to Monte-Carlo simulated literature values and constitute an essential input for TCAD simulations. Finally, a complete simulation environment combining TCAD, the Allpix$^2$ framework, and SPICE simulations is presented, in good agreement with the measured data.",
  "authors": [
    "Andreas Gsponer",
    "Sebastian Onder",
    "Stefan Gundacker",
    "Jürgen Burin",
    "Matthias Knopf",
    "Daniel Radmanovac",
    "Simon Waid",
    "Thomas Bergauer"
  ],
  "published": "2025-09-15T13:34:54Z",
  "updated": "2025-09-15T13:34:54Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}