{
  "arxiv_id": "2509.09040v2",
  "url": "https://arxiv.org/abs/2509.09040v2",
  "pdf_url": "https://arxiv.org/pdf/2509.09040v2.pdf",
  "title": "Suppression of pair beam instabilities in a laboratory analogue of   blazar pair cascades",
  "abstract": "The generation of dense electron-positron pair beams in the laboratory can enable direct tests of theoretical models of $\\gamma$-ray bursts and active galactic nuclei. We have successfully achieved this using ultra-relativistic protons accelerated by the Super Proton Synchrotron at CERN. In the first application of this experimental platform, the stability of the pair beam is studied as it propagates through a metre-length plasma, analogous to TeV $\\gamma$-ray induced pair cascades in the intergalactic medium. It has been argued that pair beam instabilities disrupt the cascade, thus accounting for the observed lack of reprocessed GeV emission from TeV blazars. If true this would remove the need for a moderate strength intergalactic magnetic field to explain the observations. We find that the pair beam instability is suppressed if the beam is not perfectly collimated or monochromatic, hence the lower limit to the intergalactic magnetic field inferred from $\\gamma$-ray observations of blazars is robust.",
  "authors": [
    "Charles D. Arrowsmith",
    "Francesco Miniati",
    "Pablo J. Bilbao",
    "Pascal Simon",
    "Archie F. A. Bott",
    "Stephane Burger",
    "Hui Chen",
    "Filipe D. Cruz",
    "Tristan Davenne",
    "Anthony Dyson",
    "Ilias Efthymiopoulos",
    "Dustin H. Froula",
    "Alice Goillot",
    "Jon T. Gudmundsson",
    "Dan Haberberger",
    "Jack W. D. Halliday",
    "Tom Hodge",
    "Brian T. Huffman",
    "Sam Iaquinta",
    "G. Marshall",
    "Brian Reville",
    "Subir Sarkar",
    "Alexander A. Schekochihin",
    "Luis O. Silva",
    "Raspberry Simpson",
    "Vasiliki Stergiou",
    "Raoul M. G. M. Trines",
    "Thibault Vieu",
    "Nikolaos Charitonidis",
    "Robert Bingham",
    "Gianluca Gregori"
  ],
  "published": "2025-09-10T22:21:43Z",
  "updated": "2025-09-15T13:26:03Z",
  "categories": [
    "astro-ph.HE",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.HE"
}