{
  "arxiv_id": "2509.12015v1",
  "url": "https://arxiv.org/abs/2509.12015v1",
  "pdf_url": "https://arxiv.org/pdf/2509.12015v1.pdf",
  "title": "Probing laser-driven surface and subsurface dynamics via   grazing-incidence XFEL scattering and diffraction",
  "abstract": "We demonstrate a grazing-incidence x-ray platform that simultaneously records time-resolved grazing-incidence small-angle x-ray scattering (GISAXS) and grazing-incidence x-ray diffraction (GID) from a femtosecond laser-irradiated gold film above the melting threshold, with picosecond resolution at an x-ray free-electron laser (XFEL). By tuning the x-ray incidence angle, the probe depth is set to tens of nanometers, enabling depth-selective sensitivity to near-surface dynamics. GISAXS resolves ultrafast changes in surface nanomorphology (correlation length, roughness), while GID quantifies subsurface lattice compression, grain orientation, melting, and recrystallization. The approach overcomes photon-flux limitations of synchrotron grazing-incidence geometries and provides stringent, time-resolved benchmarks for complex theoretical models of ultrafast laser-matter interaction and warm dense matter. Looking ahead, the same depth-selective methodology is well suited to inertial confinement fusion (ICF): it can visualize buried-interface perturbations and interfacial thermal resistance on micron to sub-micron scales that affect instability seeding and burn propagation.",
  "authors": [
    "Lisa Randolph",
    "Özgül Öztürk",
    "Dmitriy Ksenzov",
    "Lingen Huang",
    "Thomas Kluge",
    "S. V. Rahul",
    "Victorien Bouffetier",
    "Carsten Baehtz",
    "Mohammadreza Banjafar",
    "Erik Brambrink",
    "Fabien Brieuc",
    "Byoung Ick Cho",
    "Sebastian Göde",
    "Tobias Held",
    "Hauke Höppner",
    "Gerhard Jakob",
    "Mathias Kläui",
    "Zuzana Konôpková",
    "Changhoo Lee",
    "Gyusang Lee",
    "Mikako Makita",
    "Mikhail Mishchenko",
    "Mianzhen Mo",
    "Pascal D. Ndione",
    "Michael Paulus",
    "Alexander Pelka",
    "Franziska Paschke-Bruehl",
    "Thomas R. Preston",
    "Baerbel Rethfeld",
    "Christian Rödel",
    "Michal Šmíd",
    "Ling Wang",
    "Sebastian T. Weber",
    "Lennart Wollenweber",
    "Jan-Patrick Schwinkendorf",
    "Christian Gutt",
    "Motoaki Nakatsutsumi"
  ],
  "published": "2025-09-15T14:57:00Z",
  "updated": "2025-09-15T14:57:00Z",
  "categories": [
    "physics.optics",
    "physics.app-ph",
    "physics.ins-det",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.optics"
}