[
  {
    "arxiv_id": "2509.13272v1",
    "url": "https://arxiv.org/abs/2509.13272v1",
    "pdf_url": "https://arxiv.org/pdf/2509.13272v1.pdf",
    "title": "Ionization and temperature measurements in warm dense copper using x-ray   absorption spectroscopy",
    "abstract": "We detail experimental results inferring ionization and temperature for warm dense copper plasmas at several times solid density (15 to 25 g/cm$^3$) and temperatures of 10 to 21 eV. Experiments performed at the OMEGA Laser Facility generate uniform warm dense matter conditions via symmetric shock compression of a buried copper layer. The plasma is probed with a laser-generated x-ray source to collect the K-shell x-ray absorption spectrum. Fitting bound-bound absorption contributions from constituent charge states of copper provides an estimated $\\overline{Z}$ of approximately 4 to 7 for these warm dense copper plasmas. We find that these partially ionized plasmas have K-edge shifts of 12 to 30 eV and bound-bound resonance 1s$\\rightarrow$3p absorption shifts of 4 to 26 eV with respect to the cold K-edge. This study provides necessary experimental data to improve ionization and opacity models in the warm dense matter regime.",
    "authors": [
      "T. Cordova",
      "E. V. Marley",
      "D. A. Chin",
      "R. A. London",
      "H. A. Scott",
      "T. Döppner",
      "F. N. Beg",
      "F. Coppari",
      "M. Millot",
      "J. Emig",
      "S. B. Hansen",
      "P. M. Nilson",
      "P. Sterne",
      "M. J. MacDonald"
    ],
    "published": "2025-09-16T17:29:32Z",
    "updated": "2025-09-16T17:29:32Z",
    "categories": [
      "hep-ex",
      "physics.plasm-ph"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2509.13271v1",
    "url": "https://arxiv.org/abs/2509.13271v1",
    "pdf_url": "https://arxiv.org/pdf/2509.13271v1.pdf",
    "title": "Runaway electron interactions with whistler waves in tokamak plasmas:   energy-dependent transport scaling",
    "abstract": "Resonant interactions between high energy runaway electrons (REs) and whistler waves are a promising mechanism for RE mitigation in tokamak plasmas. While prior studies have largely relied on quasi-linear diffusion models in simplified geometries, we present a first-principles-informed framework that models RE-whistler interactions in a 3D tokamak equilibrium. This is achieved by coupling AORSA, which computes whistler eigenmodes for a given tokamak plasma equilibrium, and KORC, a kinetic orbit code that tracks full orbit RE trajectories in prescribed wave fields. Our results demonstrate that REs undergo scattering to large pitch angles and exhibit anomalous diffusion in both pitch-angle and kinetic energy space. Crucially, we observe a transition between diffusive, sub-diffusive, and super-diffusive transport regimes as a function of initial RE energy - an effect not captured by existing quasi-linear models. This anomalous transport behavior represents a significant advancement in understanding RE dynamics in the presence of wave - particle interactions. By identifying the conditions under which anomalous diffusion arises, this work lays the theoretical foundation for designing targeted, wave-based mitigation strategies in future tokamak experiments.",
    "authors": [
      "Yashika Ghai",
      "D. Del-Castillo-Negrete",
      "D. A. Spong",
      "M. T. Beidler"
    ],
    "published": "2025-09-16T17:29:01Z",
    "updated": "2025-09-16T17:29:01Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.11484v2",
    "url": "https://arxiv.org/abs/2509.11484v2",
    "pdf_url": "https://arxiv.org/pdf/2509.11484v2.pdf",
    "title": "The impact of kinetic and global effects on ballooning 2nd stable   pedestals of conventional and high aspect ratio tokamaks",
    "abstract": "The EPED model [P.B. Snyder et al 2011 Nucl. Fusion 51 103016] had success in describing type-I ELM and QH-mode pedestals in conventional tokamaks, by combining kinetic ballooning mode (KBM) and peeling-ballooning (PB) constraints. Within EPED, the KBM constraint is usually approximated by the ideal ballooning mode (IBM) stability threshold. It has been noted that quantitative differences between local ideal MHD and gyro-kinetic (GK) ballooning stability can be larger at low aspect ratio. KBM critical pedestals are consistent with observation in initial studies on conventional and spherical tokamaks. In this work, the application of a reduced model for the calculation of the kinetic ballooning stability boundary is presented based on a novel and newly developed Gyro-Fluid System (GFS) code [G.M. Staebler et al 2023 Phys. Plasmas 30 102501]. GFS is observed to capture KBMs in DIII-D as well as the NSTX(-U) pedestals, opening the route for the integration of this model into EPED. Finally, high-n global ballooning modes are observed to limit local 2nd stability access and thus provide a transport mechanism that constrains the width evolution with beta_p,ped. The high-n global ballooning stability is approximated by its ideal MHD analogue using ELITE. It is shown that nearly local high-n with k_y*rho_s~1/2 modes can provide a proxy for the critical beta_p,ped when 2nd stable access exists on DIII-D plasmas. The use of GFS and ELITE scaling in EPED provided improved agreement in comparison to EPED1 with DIII-D pedestal data.",
    "authors": [
      "M. S. Anastopoulos Tzanis",
      "M. Yang",
      "A. Kleiner",
      "J. F. Parisi",
      "G. M. Staebler",
      "P. B. Snyder"
    ],
    "published": "2025-09-15T00:14:56Z",
    "updated": "2025-09-16T17:17:08Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2406.12880v2",
    "url": "https://arxiv.org/abs/2406.12880v2",
    "pdf_url": "https://arxiv.org/pdf/2406.12880v2.pdf",
    "title": "Technical design report for the CODEX-$β$ demonstrator",
    "abstract": "The CODEX-$\\beta$ apparatus is a demonstrator for the proposed future CODEX-b experiment, a long-lived-particle detector foreseen for operation at IP8 during HL-LHC data-taking. The demonstrator project, intended to collect data in 2025, is described, with a particular focus on the design, construction, and installation of the new apparatus.",
    "authors": [
      "CODEX-b collaboration",
      ":",
      "Giulio Aielli",
      "Juliette Alimena",
      "Saul Balcarcel-Salazar",
      "James Beacham",
      "Eli Ben Haim",
      "András Barnabás Burucs",
      "Roberto Cardarelli",
      "Matthew J. Charles",
      "Xabier Cid Vidal",
      "Albert De Roeck",
      "Biplab Dey",
      "Silviu Dobrescu",
      "Ozgur Durmus",
      "Mohamed Elashri",
      "Vladimir V. Gligorov",
      "Rebeca Gonzalez Suarez",
      "Thomas Gorordo",
      "Zarria Gray",
      "Conor Henderson",
      "Louis Henry",
      "Philip Ilten",
      "Daniel Johnson",
      "Jacob Kautz",
      "Simon Knapen",
      "Bingxuan Liu",
      "Yang Liu",
      "Saul López Soliño",
      "Pablo Eduardo Menéndez-Valdés Pérez",
      "Titus Mombächer",
      "Benjamin Nachman",
      "David T. Northacker",
      "Gabriel M. Nowak",
      "Michele Papucci",
      "Gabriella Pásztor",
      "Eloi Pazos Rial",
      "María Pereira Martínez",
      "Michael Peters",
      "Jake Pfaller",
      "Luca Pizzimento",
      "Máximo Pló Casasús",
      "Gian Andrea Rassati",
      "Dean J. Robinson",
      "Emilio Xosé Rodríguez Fernández",
      "Debashis Sahoo",
      "Sinem Simsek",
      "Michael D. Sokoloff",
      "Joeal Subash",
      "Aditya Suresh",
      "Paul Swallow",
      "James Swanson",
      "Abhinaba Upadhyay",
      "Riccardo Vari",
      "Carlos Vázquez Sierra",
      "Gábor Veres",
      "Nigel Watson",
      "Michael K. Wilkinson",
      "Michael Williams",
      "Eleanor Winkler"
    ],
    "published": "2024-05-22T08:00:23Z",
    "updated": "2025-09-16T17:06:42Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/07/T07007"
  },
  {
    "arxiv_id": "2508.00720v3",
    "url": "https://arxiv.org/abs/2508.00720v3",
    "pdf_url": "https://arxiv.org/pdf/2508.00720v3.pdf",
    "title": "Propagation and collisionless damping of topologically-protected surface   plasma waves in non-uniformly magnetized plasma columns",
    "abstract": "Recent theoretical studies revealed the existence of topologically-protected surface plasma waves (TSPWs) in cold magnetized plasmas assumed uniform along the direction of a uniaxial magnetic field. Reflections-free propagation of the TSPWs along arbitrarily-shaped plasma boundaries oriented perpendicularly to the magnetic field was shown to be preserved even when their collisionless damping by localized upper-hybrid resonances was accounted for. Here we extend this theory to the realistic case of three-dimensional magnetic field produced by finite-sized magnetic coils. We demonstrate that when TSPWs are launched in the direction of the decreasing magnetic field, they are collisionlessly absorbed within a highly localized (evanescent) region as they propagate away from the magnetic coil. We show that the resulting wave reflection can be negligible -- in clear contrast with conventional wave reflection from the corresponding evanescence regions.",
    "authors": [
      "Roopendra Singh Rajawat",
      "Gennady Shvets"
    ],
    "published": "2025-08-01T15:40:33Z",
    "updated": "2025-09-16T16:44:06Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.02445v2",
    "url": "https://arxiv.org/abs/2508.02445v2",
    "pdf_url": "https://arxiv.org/pdf/2508.02445v2.pdf",
    "title": "Gyrotropy-Induced Symmetry Breaking of Erosion Hot Spots on Antenna   Limiters during High-Power Tokamak RF Operation: Mechanisms and Mitigation   Strategies",
    "abstract": "Ion Cyclotron Range of Frequencies (ICRF) heating is essential for creating plasma in next-generation fusion devices. ICRF antennas often produce hot spots, reducing reliability, material survivability, and overall plasma performance. We show that toroidal and poloidal asymmetries in these hot spots arise intrinsically from the wave physics' gyrotropy, and that they can be compensated for either by controlling the poloidal phasing or by modifying the limiter shapes, reducing total erosion by a factor $\\sim$2 compared to state-of-the-art designs.",
    "authors": [
      "W. Tierens",
      "A. Kumar",
      "J. Lore",
      "K. Fujii",
      "G. Urbanczyk",
      "R. Diab",
      "The WEST Team"
    ],
    "published": "2025-08-04T14:05:01Z",
    "updated": "2025-09-16T16:40:42Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.13206v1",
    "url": "https://arxiv.org/abs/2509.13206v1",
    "pdf_url": "https://arxiv.org/pdf/2509.13206v1.pdf",
    "title": "Virtual states and exponential decay in small-scale dynamo",
    "abstract": "We develop the Kazantsev theory of small-scale dynamo generation at small Prandtl numbers near the generation threshold and restore the concordance between the theory and numerical simulations: the theory predicted a power-law decay below the threshold, while simulations demonstrate exponential decay. We show that the exponential decay is temporary and owes its existence to the flattening of the velocity correlator at large scales. This effect corresponds to the existence of a long-living virtual level in the corresponding Schrodinger type equation. We also find the critical Reynolds number and the increment of growth/decay above and under the threshold; we express them in terms of the quantitative characteristic properties of the velocity correlator, which makes it possible to compare the results with the data of different simulations.",
    "authors": [
      "A. V. Kopyev",
      "A. S. Il'yn",
      "V. A. Sirota",
      "K. P. Zybin"
    ],
    "published": "2025-09-16T16:15:04Z",
    "updated": "2025-09-16T16:15:04Z",
    "categories": [
      "physics.flu-dyn",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.flu-dyn"
  },
  {
    "arxiv_id": "2506.03796v3",
    "url": "https://arxiv.org/abs/2506.03796v3",
    "pdf_url": "https://arxiv.org/pdf/2506.03796v3.pdf",
    "title": "Geoff: The Generic Optimization Framework & Frontend for Particle   Accelerator Controls",
    "abstract": "Geoff is a collection of Python packages that form a framework for automation of particle accelerator controls. With particle accelerator laboratories around the world researching machine learning techniques to improve accelerator performance and uptime, a multitude of approaches and algorithms have emerged. The purpose of Geoff is to harmonize these approaches and to minimize friction when comparing or migrating between them. It provides standardized interfaces for optimization problems, utility functions to speed up development, and a reference GUI application that ties everything together. Geoff is an open-source library developed at CERN and maintained and updated in collaboration between CERN and GSI as part of the EURO-LABS project. This paper gives an overview over Geoff's design, features, and current usage.",
    "authors": [
      "Penelope Madysa",
      "Sabrina Appel",
      "Verena Kain",
      "Michael Schenk"
    ],
    "published": "2025-06-04T09:58:48Z",
    "updated": "2025-09-16T15:03:48Z",
    "categories": [
      "physics.acc-ph",
      "cs.LG"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2501.10993v2",
    "url": "https://arxiv.org/abs/2501.10993v2",
    "pdf_url": "https://arxiv.org/pdf/2501.10993v2.pdf",
    "title": "Improved and automated krypton assay for low-background xenon detectors   with Auto-RGMS",
    "abstract": "Ultra-sensitive quantification of trace radioactive krypton-85 is essential for low-background experiments, particularly for next-generation searches of galactic dark matter and neutrino physics using xenon-based time projection chambers (TPCs). While the rare gas mass spectrometer (RGMS) represents the current state-of-the-art for krypton detection in the field, we are developing a fully automated system (Auto-RGMS) to overcome the limitations of its manual operation. Auto-RGMS incorporates a robust control system for rapid measurements and minimized systematic uncertainties. A primary goal is to reach detection limits in the low parts-per-quadrillion (ppq) range for natural krypton by improving the chromatography stage to enhance the separation of krypton from xenon. Investigations into various adsorbent materials identified two candidates. HayeSep Q offers a 12-fold improvement in chromatographic resolution for xenon/krypton separation compared to the previously used adsorbent. Alternatively, HayeSep D provides a more limited improvement in resolution while allowing a higher measurement frequency because of its moderate retention-induced contamination after each measurement. By automating krypton assays and achieving ppq sensitivity, Auto-RGMS will be an indispensable tool for next-generation detectors, maximizing their scientific potential.",
    "authors": [
      "Matteo Guida",
      "Ying-Ting Lin",
      "Hardy Simgen"
    ],
    "published": "2025-01-19T09:30:30Z",
    "updated": "2025-09-16T13:29:13Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1140/epjc/s10052-025-14262-2"
  },
  {
    "arxiv_id": "2507.03914v2",
    "url": "https://arxiv.org/abs/2507.03914v2",
    "pdf_url": "https://arxiv.org/pdf/2507.03914v2.pdf",
    "title": "Revealing Secondary Particle Signatures in Muography Based on the Point   of Closest Approach Algorithm",
    "abstract": "This work reinterprets so-called 'noise' in cosmic ray imaging, indicating that the data of reconstructed Points of Closest Approach (PoCA points) outside the volume of interest defined by traditional tomography methods contain valuable physical information that has been traditionally disregarded. Through analysis of data from the detection system of four resistive plate chambers (RPCs) and Monte Carlo simulations employing energy deposition weighting for coordinate determination, we confirm that these points physically originate from the interaction between muons and the material above the detection system, particularly the roof, resulting in the production of secondary particles. The research yields two principal findings: first, in the four-layer compliance measurement system, the position recording of the first layer can be from secondary particles generated by cosmic rays, while the records from the three layers below represent the actual trajectories of cosmic rays; second, the roof structure significantly impacts the distribution of PoCA points at detector positions, where quantitative analysis demonstrates a strong correlation between roof thickness and the number of reconstructed PoCA points -- a relationship that can be precisely measured through $z$-coordinate distribution analysis in specific intervals. Due to the varying performances of different roofing materials in this analytical method, this approach holds significant potential for development into a new tomography technique.",
    "authors": [
      "Rongfeng Zhang",
      "Zibo Qin",
      "Cheng-en Liu",
      "Qite Li",
      "Yong Ban",
      "Chen Zhou",
      "Qiang Li"
    ],
    "published": "2025-07-05T06:00:26Z",
    "updated": "2025-09-16T11:54:36Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2503.05489v2",
    "url": "https://arxiv.org/abs/2503.05489v2",
    "pdf_url": "https://arxiv.org/pdf/2503.05489v2.pdf",
    "title": "On the use of the Axelrod formula for thermal electron collisions in   Astrophysical Modelling",
    "abstract": "The Axelrod approximation is widely used in astrophysical modelling codes to evaluate electron-impact excitation effective collision strengths for forbidden transitions. Approximate methods such as this are a necessity for many heavy elements with open shells where collisional data is either non existent or sparse as the use of more robust methods prove prohibitively expensive. Atomic data for such forbidden transitions are essential for producing full collisional radiative models that do not assume Local-Thermodynamic-Equilibrium (LTE). In this short work we repeat the optimization of the simple Axelrod formula for a large number of $R$-matrix data sets, ranging from Fe and Ni to the first r-process peak elements of Sr, Y and Zr, to higher Z systems Te, W, Pt and Au. We show that the approximate treatment of forbidden transitions can be a significant source of inaccuracy in such collisional radiative models. We find a large variance of the optimized coefficients for differing systems and charge states, although some general trends can be seen based on the orbital structure of the ground-state-configurations. These trends could potentially inform better estimates for future calculations for elements where $R$-matrix data is not available.",
    "authors": [
      "Leo P. Mulholland",
      "Steven J. Bromley",
      "Connor P. Ballance",
      "Stuart A. Sim",
      "Catherine A. Ramsbottom"
    ],
    "published": "2025-03-07T14:58:19Z",
    "updated": "2025-09-16T11:25:55Z",
    "categories": [
      "astro-ph.HE",
      "physics.atom-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE",
    "doi": "10.1016/j.jqsrt.2025.109545"
  },
  {
    "arxiv_id": "2509.12945v1",
    "url": "https://arxiv.org/abs/2509.12945v1",
    "pdf_url": "https://arxiv.org/pdf/2509.12945v1.pdf",
    "title": "FusionMAE: large-scale pretrained model to optimize and simplify   diagnostic and control of fusion plasma",
    "abstract": "In magnetically confined fusion device, the complex, multiscale, and nonlinear dynamics of plasmas necessitate the integration of extensive diagnostic systems to effectively monitor and control plasma behaviour. The complexity and uncertainty arising from these extensive systems and their tangled interrelations has long posed a significant obstacle to the acceleration of fusion energy development. In this work, a large-scale model, fusion masked auto-encoder (FusionMAE) is pre-trained to compress the information from 88 diagnostic signals into a concrete embedding, to provide a unified interface between diagnostic systems and control actuators. Two mechanisms are proposed to ensure a meaningful embedding: compression-reduction and missing-signal reconstruction. Upon completion of pre-training, the model acquires the capability for 'virtual backup diagnosis', enabling the inference of missing diagnostic data with 96.7% reliability. Furthermore, the model demonstrates three emergent capabilities: automatic data analysis, universal control-diagnosis interface, and enhancement of control performance on multiple tasks. This work pioneers large-scale AI model integration in fusion energy, demonstrating how pre-trained embeddings can simplify the system interface, reducing necessary diagnostic systems and optimize operation performance for future fusion reactors.",
    "authors": [
      "Zongyu Yang",
      "Zhenghao Yang",
      "Wenjing Tian",
      "Jiyuan Li",
      "Xiang Sun",
      "Guohui Zheng",
      "Songfen Liu",
      "Niannian Wu",
      "Rongpeng Li",
      "Zhaohe Xu",
      "Bo Li",
      "Zhongbing Shi",
      "Zhe Gao",
      "Wei Chen",
      "Xiaoquan Ji",
      "Min Xu",
      "Wulyu Zhong"
    ],
    "published": "2025-09-16T10:50:29Z",
    "updated": "2025-09-16T10:50:29Z",
    "categories": [
      "physics.plasm-ph",
      "cs.AI"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.12800v1",
    "url": "https://arxiv.org/abs/2509.12800v1",
    "pdf_url": "https://arxiv.org/pdf/2509.12800v1.pdf",
    "title": "Improving Muon Scattering Tomography Performance With A Muon Momentum   Measurement Scheme",
    "abstract": "Muon imaging, especially muon scattering tomography (MST), has recently garnered significant attention. MST measures the magnitude of muon scattering angles inside an object, which depends not only on the material properties but also on the muon momentum. Due to the difficulty of simultaneous measurement of momentum, it was neglected and taken as a constant in multiple MST reconstruction algorithms. Recently, an experimental measurement scheme has emerged that is feasible in engineering, but it requires many layers of detectors to approach the true momentum. From this, we proposed both an algorithm to incorporating momentum into MST, and a scheme to determine the thresholds of Cherenkov detectors. This novel scheme, termed the \"equi-percentage scheme\", sets momentum thresholds for Cherenkov detector layers based on cosmic muon momentum distribution. Results showed our approach delivers noticeable enhancement in reconstructed image quality even with only two detector layers, reaching near-saturation performance with four layers. This study proves that momentum measurement significantly enhances short-duration MST, and that substantial improvement can be achieved with relatively coarse momentum measurement using 2-4 layers of Cherenkov detectors.",
    "authors": [
      "Pei Yu",
      "Ziwen Pan",
      "Jiajia Zhai",
      "Yu Xu",
      "Li Deng",
      "Zhengyang He",
      "Zhe Chen",
      "Zechao Kang",
      "Yuhong Yu",
      "Xueheng Zhang",
      "Liangwen Chen",
      "Lei Yang",
      "Zhiyu Sun"
    ],
    "published": "2025-09-16T08:19:35Z",
    "updated": "2025-09-16T08:19:35Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.12790v1",
    "url": "https://arxiv.org/abs/2509.12790v1",
    "pdf_url": "https://arxiv.org/pdf/2509.12790v1.pdf",
    "title": "The design of the data acquisition system for SPD experiment",
    "abstract": "The Spin Physics Detector (SPD) experiment at the NICA collider in JINR aims to investigate the spin structure of nucleons and spin-related phenomena. The combination of the number of background processes, the event rate and conditions for event selection makes the use of a classical trigger system impractical, requiring a triggerless data acquisition (DAQ) system. The DAQ system is designed to ensure precise time synchronization, efficient data collection, and high-throughput processing. Its architecture combines commercially available FPGA-based modules and high-speed optical interfaces with custom-developed components based on widely accessible technologies. This approach provides scalability from 180,000 at the initial stage of the experiment to more than 600,000 detector channels in the final configuration and supports data rates up to 20 GB/s or more. The modular system design ensures adaptability for future upgrades while maintaining high efficiency and reliability. Such an approach makes the DAQ system suitable for other high-rate nuclear physics experiments.",
    "authors": [
      "L. Afanasyev",
      "A. Berngardt",
      "A. Boikov",
      "V. Borshch",
      "A. Boykov",
      "D. Cherepkov",
      "D. Erofeev",
      "V. Frolov",
      "K. Gritsay",
      "A. Isupov",
      "K. Kotov",
      "D. Kozyrev",
      "A. Kulikov",
      "O. Mamoutova",
      "N. Reshetikhin",
      "D. Ryabikov",
      "S. Tereshchenko",
      "V. Tereshchenko"
    ],
    "published": "2025-09-16T08:08:12Z",
    "updated": "2025-09-16T08:08:12Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.11522v2",
    "url": "https://arxiv.org/abs/2509.11522v2",
    "pdf_url": "https://arxiv.org/pdf/2509.11522v2.pdf",
    "title": "Conceptual Design Report of Super Tau-Charm Facility: The Accelerator",
    "abstract": "Electron-positron colliders operating in the GeV region of center-of-mass energies or the Tau-Charm energy region, have been proven to enable competitive frontier research, due to its several unique features. With the progress of high energy physics in the last two decades, a new-generation Tau-Charm factory, Super Tau Charm Facility (STCF) has been actively promoting by the particle physics community in China. STCF holds great potential to address fundamental questions such as the essence of color confinement and the matter-antimatter asymmetry in the universe in the next decades. The main design goals of STCF are with a center-of-mass energy ranging from 2 to 7 GeV and a peak luminosity surpassing 5*10^34 cm^-2s^-1 that is optimized at a center-of-mass energy of 4 GeV, which is about 50 times that of the currently operating Tau-Charm factory - BEPCII. The STCF accelerator is composed of two main parts: a double-ring collider with the crab-waist collision scheme and an injector that provides top-up injections for both electron and positron beams. As a typical third-generation electron-positron circular collider, the STCF accelerator faces many challenges in both accelerator physics and technology. In this paper, the conceptual design of the STCF accelerator complex is presented, including the ongoing efforts and plans for technological R&D, as well as the required infrastructure. The STCF project aims to secure support from the Chinese central government for its construction during the 15th Five-Year Plan (2026-2030) in China.",
    "authors": [
      "Jiancong Bao",
      "Anton Bogomyagkov",
      "Zexin Cao",
      "Mingxuan Chang",
      "Fangzhou Chen",
      "Guanghua Chen",
      "Qi Chen",
      "Qushan Chen",
      "Zhi Chen",
      "Kuanjun Fan",
      "Hailiang Gong",
      "Duan Gu",
      "Hao Guo",
      "Tengjun Guo",
      "Chongchao He",
      "Tianlong He",
      "Kaiwen Hou",
      "Hao Hu",
      "Tongning Hu",
      "Xiaocheng Hu",
      "Dazhang Huang",
      "Pengwei Huang",
      "Ruixuan Huang",
      "Zhicheng Huang",
      "Hangzhou Li",
      "Renkai Li",
      "Sangya Li",
      "Weiwei Li",
      "Xuan Li",
      "Xunfeng Li",
      "Yu Liang",
      "Chao Liu",
      "Tao Liu",
      "Xiaoyu Liu",
      "Xuyang Liu",
      "Yuan Liu",
      "Huihui Lv",
      "Qing Luo",
      "Tao Luo",
      "Mikhail Skamarokha",
      "Shaohang Ma",
      "Wenbin Ma",
      "Masahito Hosaka",
      "Xuece Miao",
      "Yihao Mo",
      "Kazuhito Ohmi",
      "Jian Pang",
      "Guoxi Pei",
      "Zhijun Qi",
      "Fenglei Shang",
      "Lei Shang",
      "Caitu Shi",
      "Kun Sun",
      "Li Sun",
      "Jingyu Tang",
      "Anxin Wang",
      "Chengzhe Wang",
      "Hongjin Wang",
      "Lei Wang",
      "Qian Wang",
      "Shengyuan Wang",
      "Shikang Wang",
      "Ziyu Wang",
      "Shaoqing Wei",
      "Yelong Wei",
      "Jun Wu",
      "Sang Wu",
      "Chunjie Xie",
      "Ziyu Xiong",
      "Xin Xu",
      "Jun Yang",
      "Penghui Yang",
      "Tao Yang",
      "Lixin Yin",
      "Chen Yu",
      "Ze Yu",
      "Youjin Yuan",
      "Yifeng Zeng",
      "Ailin Zhang",
      "Haiyan Zhang",
      "Jialian Zhang",
      "Linhao Zhang",
      "Ning Zhang",
      "Ruiyang Zhang",
      "Xiaoyang Zhang",
      "Yihao Zhang",
      "Yangcheng Zhao",
      "Jingxin Zheng",
      "Demin Zhou",
      "Hao Zhou",
      "Yimei Zhou",
      "Zeran Zhou",
      "Bing Zhu",
      "Xinghao Zhu",
      "Zi'an Zhu",
      "Ye Zou"
    ],
    "published": "2025-09-15T02:20:12Z",
    "updated": "2025-09-16T06:58:11Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2506.06059v2",
    "url": "https://arxiv.org/abs/2506.06059v2",
    "pdf_url": "https://arxiv.org/pdf/2506.06059v2.pdf",
    "title": "Driven Collisionless Reconnection of Force-free Flux Tubes: From Onset   to Coalescence",
    "abstract": "We investigate the onset of driven collisionless reconnection and plasmoid formation in a magnetically dominated pair plasma, using 2D Particle-in-Cell simulations. Two force-free flux tubes of radius $R$ are initially pushed together with a prescribed velocity, forming a current sheet whose width shrinks until reconnection sets in. % Even in our largest simulation with $R\\approx 1600$ plasma skin depths, the sheet thickness at reconnection onset is comparable to the skin depth. Plasmoid chains develop when the sheet length-to-width aspect ratio $A\\gtrsim30$. In the strongly magnetized limit, the onset of reconnection occurs in roughly 2--6 light-crossing times, depending on the imposed driving timescale, which controls the duration of the thinning phase. In the subsequent nonlinear merging phase, the evolution becomes effectively independent of the initially imposed velocity, leading to magnetic-energy dissipation consistent with a normalized reconnection rate $\\sim 0.1$. Our results have important implications for explosive release of magnetic energy in magnetospheres of astrophysical compact objects and their surroundings.",
    "authors": [
      "Camille Granier",
      "Daniel Groselj",
      "Luca Comisso",
      "Fabio Bacchini"
    ],
    "published": "2025-06-06T13:12:26Z",
    "updated": "2025-09-16T05:54:56Z",
    "categories": [
      "physics.plasm-ph",
      "hep-th"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.12608v1",
    "url": "https://arxiv.org/abs/2509.12608v1",
    "pdf_url": "https://arxiv.org/pdf/2509.12608v1.pdf",
    "title": "The impact of Alfvenic shear flow on magnetic reconnection and   turbulence",
    "abstract": "Magnetic reconnection is a fundamental and omnipresent energy conversion process in plasma physics. Novel observations of fields and particles from Parker Solar Probe (PSP) have shown the absence of reconnection in a large number of current sheets in the near-Sun solar wind. Using near-Sun observations from PSP Encounters 4 to 11 (Jan 2020 to March 2022), we investigate whether reconnection onset might be suppressed by velocity shear. We compare estimates of the tearing mode growth rate in the presence of shear flow for time periods identified as containing reconnecting current sheets versus non-reconnecting times, finding systematically larger growth rates for reconnection periods. Upon examination of the parameters associated with reconnection onset, we find that 85% of the reconnection events are embedded in slow, non-Alfvenic wind streams. We compare with fast, slow non-Alfvenic, and slow Alfvenic streams, finding that the growth rate is suppressed in highly Alfvenic fast and slow wind and reconnection is not seen in these wind types, as would be expected from our theoretical expressions. These wind streams have strong Alfvenic} flow shear, consistent with the idea of reconnection suppression by such flows. This could help explain the frequent absence of reconnection events in the highly Alfvenic, near-Sun solar wind observed by PSP. Finally, we find a steepening of both the trace and magnitude magnetic field spectra within reconnection periods in comparison to ambient wind. We tie this to the dynamics of relatively balanced turbulence within these reconnection periods and the potential generation of compressible fluctuations.",
    "authors": [
      "Tamar Ervin",
      "Alfred Mallet",
      "Stefan Eriksson",
      "Marc Swisdak",
      "James Juno",
      "Orlando M. Romeo",
      "Tai Phan",
      "Trevor A. Bowen",
      "Roberto Livi",
      "Phyllis L. Whittlesey",
      "Davin E. Larson",
      "Stuart D. Bake"
    ],
    "published": "2025-09-16T03:11:53Z",
    "updated": "2025-09-16T03:11:53Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2509.12599v1",
    "url": "https://arxiv.org/abs/2509.12599v1",
    "pdf_url": "https://arxiv.org/pdf/2509.12599v1.pdf",
    "title": "Validation of the GFS model for Gyrokinetic Stability of NSTX Pedestal   Data",
    "abstract": "This study presents a large database validation of the Gyro Fluid System (GFS) model for linear gyrokinetic stability for high-mode (H-mode) edge transport barrier conditions in the National Spherical Torus Experiment (NSTX) tokamak. The database of linear stability calculations with the CGYRO gyrokinetic code was produced using plasma profile measurements from NSTX discharges to identify kinetic ballooning modes (KBM), trapped electron modes (TEM), and micro-tearing modes (MTM) that limit the pressure profile gradient in the H-mode barrier. A novel Bayesian optimization approach determines optimal resolution parameters for GFS specifically for spherical tokamak pedestal conditions. Our results demonstrate that GFS, with optimized resolution, can achieve accurate linear stability analysis in NSTX pedestal conditions for reduced resolution compared to CGYRO. GFS can accurately find the KBM, TEM, and MTM instability branches. Parametric analysis reveals that GFS accuracy in this extreme pedestal parameter range is degraded for low magnetic shear and near the separatrix conditions. These findings establish GFS as a fast linear eigenmode solver for spherical tokamak pedestal gyrokinetic stability and demonstrate a systematic methodology for determining the optimum resolution settings.",
    "authors": [
      "M. Yang",
      "J. F. Parisi",
      "M. S. Anastopoulos Tzanis",
      "G. M. Staebler"
    ],
    "published": "2025-09-16T02:55:54Z",
    "updated": "2025-09-16T02:55:54Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.12475v1",
    "url": "https://arxiv.org/abs/2509.12475v1",
    "pdf_url": "https://arxiv.org/pdf/2509.12475v1.pdf",
    "title": "Liquid Helium Cryogenic TEM below 1 Å",
    "abstract": "Next-generation cryogenic transmission electron microscopes (TEM) aim to achieve high-resolution imaging at ultracold sample temperatures (< 90 K) and over extended hold times. Lower temperatures enable atomic-scale characterization with improved beam and dose resilience for organic specimens and access to emergent electronic phases in quantum materials. Side-entry liquid helium cooling stages presently lack the mechanical and thermal stability required to support sub-Angstrom information transfer in modern TEM. Here we demonstrate sub-Angstrom atomic imaging TEM with a side-entry stage at specimen temperatures down to ~20K and with low stage drift and stable hold times.",
    "authors": [
      "Suk Hyun Sung",
      "Maya Gates",
      "Nishkarsh Agarwal",
      "Yang Zhang",
      "William Millsaps",
      "Miti Shah",
      "Emily Rennich",
      "Cong Li",
      "Pu Yu",
      "Miaofang Chi",
      "Benjamin H. Savitzky",
      "Ismail El Baggari",
      "Robert Hovden"
    ],
    "published": "2025-09-15T21:45:51Z",
    "updated": "2025-09-15T21:45:51Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.12397v1",
    "url": "https://arxiv.org/abs/2509.12397v1",
    "pdf_url": "https://arxiv.org/pdf/2509.12397v1.pdf",
    "title": "Shock wave bending around a dusty plasma void",
    "abstract": "We report on experimental observations of the bending of a dust acoustic shock wave around a dust void region. This phenomenon occurs as a planar shock wavefront encounters a compressible obstacle in the form of a void whose size is larger than the wavelength of the wave. As they collide, the central portion of the wavefront, that is the first to touch the void, is blocked while the rest of the front continues to propagate, resulting in an inward bending of the shock wave. The bent shock wave eventually collapses, leading to the transient trapping of dust particles in the void. Subsequently, a Coulomb explosion of the trapped particles generates a bow shock. The experiments have been carried out in a DC glow discharge plasma, where the shock wave and the void are simultaneously created as self-excited modes of a three-dimensional dust cloud. The salient features of this phenomenon are reproduced in molecular dynamics simulations, which provide valuable insights into the underlying dynamics of this interaction.",
    "authors": [
      "Sachin Sharma",
      "Rauoof Wani",
      "Prabhakar Srivastav",
      "Meenakshee Sharma",
      "Sayak Bose",
      "Sanat Tiwari",
      "Abhijit Sen"
    ],
    "published": "2025-09-15T19:42:15Z",
    "updated": "2025-09-15T19:42:15Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.12175v1",
    "url": "https://arxiv.org/abs/2509.12175v1",
    "pdf_url": "https://arxiv.org/pdf/2509.12175v1.pdf",
    "title": "An Optomechanical Accelerometer Search for Ultralight Dark Matter",
    "abstract": "We use a cavity optomechanical accelerometer to perform a resonant search for ultralight dark matter at acoustic frequencies near 39 kHz (a particle mass of $0.16$ neV/$c^2$). The accelerometer is based on a Si$_3$N$_4$ membrane, cryogenically cooled to 4 K, with photothermal heating employed to scan the resonance frequency by $10^2$ detector linewidths. Leveraging shot-noise-limited displacement readout and radiation pressure feedback cooling, we realize an acceleration resolution of $\\sim 10\\;\\text{n}g_0/\\sqrt{\\text{Hz}}$ over a bandwidth of $30$ Hz near the fundamental test mass resonance. We find no evidence of a dark matter signal and infer an upper bound on the coupling to normal matter that is several orders of magnitude above the stringent bounds set by equivalence principle experiments. We outline a path toward novel dark matter constraints in future experiments by exploiting arrays of mass-loaded optomechanical sensors at lower temperature probed with distributed squeezed light.",
    "authors": [
      "M. Dey Chowdhury",
      "J. P. Manley",
      "C. A. Condos",
      "A. R. Agrawal",
      "D. J. Wilson"
    ],
    "published": "2025-09-15T17:38:12Z",
    "updated": "2025-09-15T17:38:12Z",
    "categories": [
      "hep-ex",
      "astro-ph.IM",
      "physics.ins-det",
      "physics.optics",
      "quant-ph"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2509.12164v1",
    "url": "https://arxiv.org/abs/2509.12164v1",
    "pdf_url": "https://arxiv.org/pdf/2509.12164v1.pdf",
    "title": "Anomalous electron heating in laboratory magnetized quasi-perpendicular   collisionless shocks",
    "abstract": "We present laboratory results from supercritical, magnetized collisionless shock experiments ($M_A \\lesssim 10$, $\\beta\\sim 1$). We report the first observation of fully-developed shocks ($R=4$ compression ratio and a downstream region decoupled from the piston) after seven upstream ion gyration periods. A foot ahead of the shock exhibits super-adiabatic electron and ion heating. We measure the electron temperature $T_e = 115$ eV and ion temperature $T_i = 15$ eV upstream of the shock; whereas, downstream, we measure $T_e=390$ eV and infer $T_i=340$ eV, consistent with both Thomson scattering ion-acoustic wave spectral broadening and Rankine-Hugoniot conditions. The downstream electron temperature has a $30$-percent excess from adiabatic and collisional electron-ion heating, implying significant collisionless anomalous electron heating. Furthermore, downstream electrons and ions are in equipartition, with a unity electron-ion temperature ratio $T_e/T_i = 1.2$.",
    "authors": [
      "V. Valenzuela-Villaseca",
      "S. Totorica",
      "J. Griff-McMahon",
      "L. -J. Chen",
      "S. Malko",
      "P. V. Heuer",
      "P. Pongkitiwanichakul",
      "W. Fox",
      "D. B. Schaeffer"
    ],
    "published": "2025-09-15T17:26:36Z",
    "updated": "2025-09-15T17:26:36Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE",
      "astro-ph.SR"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2505.18155v2",
    "url": "https://arxiv.org/abs/2505.18155v2",
    "pdf_url": "https://arxiv.org/pdf/2505.18155v2.pdf",
    "title": "Modelling Cosmic-Ray Transport: Magnetized versus Unmagnetized Motion in   Astrophysical Magnetic Turbulence",
    "abstract": "Cosmic-ray transport in turbulent astrophysical environments remains a multifaceted problem, and despite decades of study the impact of complex magnetic field geometry -- evident in simulations and observations -- has only recently received more focused attention. To understand how ensemble-averaged transport behaviour emerges from the intricate interactions between cosmic rays and structured magnetic turbulence, we run test-particle experiments in snapshots of a strongly turbulent magnetohydrodynamics simulation. We characterize particle-turbulence interactions via the gyro radii of particles and their experienced field-line curvatures, which reveals two distinct transport modes: magnetized motion, where particles are tightly bound to strong coherent flux tubes and undergo large-scale mirroring; and unmagnetized motion characterized by chaotic scattering through weak and highly tangled regions of the magnetic field. We formulate an effective stochastic process for each mode: compound subdiffusion with long mean free paths for magnetized motion, and a Langevin process with short mean free paths for unmagnetized motion. A combined stochastic walker that alternates between these two modes accurately reproduces the mean squared displacements observed in the test-particle data. Our results emphasize the critical role of coherent magnetic structures in comprehensively understanding cosmic-ray transport and lay a foundation for developing a theory of geometry-mediated transport.",
    "authors": [
      "Jeremiah Lübke",
      "Patrick Reichherzer",
      "Sophie Aerdker",
      "Frederic Effenberger",
      "Mike Wilbert",
      "Horst Fichtner",
      "Rainer Grauer"
    ],
    "published": "2025-05-23T17:59:52Z",
    "updated": "2025-09-15T17:03:07Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2408.00661v4",
    "url": "https://arxiv.org/abs/2408.00661v4",
    "pdf_url": "https://arxiv.org/pdf/2408.00661v4.pdf",
    "title": "Neuromorphic detection and cooling of microparticles in arrays",
    "abstract": "Micro-objects levitated in a vacuum are an exciting platform for precision sensing due to their low dissipation motion and the potential for control at the quantum level. Arrays of such sensors would offer increased sensitivity, directionality, and in the quantum regime the potential to exploit correlation and entanglement. We use neuromorphic detection via a single event based camera to record the motion of an array of levitated microspheres. We present a scalable method for arbitrary multiparticle tracking and control by implementing real-time feedback to {simultaneously cool the motion of three uncoupled microscale objects",
    "authors": [
      "Yugang Ren",
      "Benjamin Siegel",
      "Ronghao Yin",
      "Qiongyuan Wu",
      "Jonathan D. Pritchett",
      "Muddassar Rashid",
      "James Millen"
    ],
    "published": "2024-08-01T15:49:37Z",
    "updated": "2025-09-15T16:26:40Z",
    "categories": [
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.12030v1",
    "url": "https://arxiv.org/abs/2509.12030v1",
    "pdf_url": "https://arxiv.org/pdf/2509.12030v1.pdf",
    "title": "Acceleration of Multi-Scale LTS Magnet Simulations with Neural Network   Surrogate Models",
    "abstract": "While the prediction of AC losses during transients is critical for designing large-scale low-temperature superconducting (LTS) magnets, brute-force finite-element (FE) simulation of their detailed geometry down to the length scale of the conductors is a computational challenge. Multi-scale methods, balancing between a coarse approximation of the fields at the scale of the magnet and a detailed description at the scale of the conductors, are promising approaches to reduce the computational load while keeping a sufficient accuracy. In this work, we introduce a neural network approach to accelerate multi-scale magneto-thermal simulations of LTS magnets by replacing costly single-turn FE models with neural network surrogates. The neural network architecture is presented and discussed, together with an automated procedure for generating simulation data for its training. The resulting accelerated multi-scale model is used to simulate current ramp-up procedures for the IBA S2C2 magnet. The surrogate-based multi-scale model is compared with a conventional multi-scale model based on a composite wire-in-channel FE model. The surrogate model is shown to reproduce single-turn filament hysteresis, inter-filament coupling, and eddy losses, while the computational time of the multi-scale method is reduced by a factor of 800.",
    "authors": [
      "Louis Denis",
      "Julien Dular",
      "Vincent Nuttens",
      "Mariusz Wozniak",
      "Benoît Vanderheyden",
      "Christophe Geuzaine"
    ],
    "published": "2025-09-15T15:13:20Z",
    "updated": "2025-09-15T15:13:20Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.12015v1",
    "url": "https://arxiv.org/abs/2509.12015v1",
    "pdf_url": "https://arxiv.org/pdf/2509.12015v1.pdf",
    "title": "Probing laser-driven surface and subsurface dynamics via   grazing-incidence XFEL scattering and diffraction",
    "abstract": "We demonstrate a grazing-incidence x-ray platform that simultaneously records time-resolved grazing-incidence small-angle x-ray scattering (GISAXS) and grazing-incidence x-ray diffraction (GID) from a femtosecond laser-irradiated gold film above the melting threshold, with picosecond resolution at an x-ray free-electron laser (XFEL). By tuning the x-ray incidence angle, the probe depth is set to tens of nanometers, enabling depth-selective sensitivity to near-surface dynamics. GISAXS resolves ultrafast changes in surface nanomorphology (correlation length, roughness), while GID quantifies subsurface lattice compression, grain orientation, melting, and recrystallization. The approach overcomes photon-flux limitations of synchrotron grazing-incidence geometries and provides stringent, time-resolved benchmarks for complex theoretical models of ultrafast laser-matter interaction and warm dense matter. Looking ahead, the same depth-selective methodology is well suited to inertial confinement fusion (ICF): it can visualize buried-interface perturbations and interfacial thermal resistance on micron to sub-micron scales that affect instability seeding and burn propagation.",
    "authors": [
      "Lisa Randolph",
      "Özgül Öztürk",
      "Dmitriy Ksenzov",
      "Lingen Huang",
      "Thomas Kluge",
      "S. V. Rahul",
      "Victorien Bouffetier",
      "Carsten Baehtz",
      "Mohammadreza Banjafar",
      "Erik Brambrink",
      "Fabien Brieuc",
      "Byoung Ick Cho",
      "Sebastian Göde",
      "Tobias Held",
      "Hauke Höppner",
      "Gerhard Jakob",
      "Mathias Kläui",
      "Zuzana Konôpková",
      "Changhoo Lee",
      "Gyusang Lee",
      "Mikako Makita",
      "Mikhail Mishchenko",
      "Mianzhen Mo",
      "Pascal D. Ndione",
      "Michael Paulus",
      "Alexander Pelka",
      "Franziska Paschke-Bruehl",
      "Thomas R. Preston",
      "Baerbel Rethfeld",
      "Christian Rödel",
      "Michal Šmíd",
      "Ling Wang",
      "Sebastian T. Weber",
      "Lennart Wollenweber",
      "Jan-Patrick Schwinkendorf",
      "Christian Gutt",
      "Motoaki Nakatsutsumi"
    ],
    "published": "2025-09-15T14:57:00Z",
    "updated": "2025-09-15T14:57:00Z",
    "categories": [
      "physics.optics",
      "physics.app-ph",
      "physics.ins-det",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2509.11954v1",
    "url": "https://arxiv.org/abs/2509.11954v1",
    "pdf_url": "https://arxiv.org/pdf/2509.11954v1.pdf",
    "title": "Exploring the performance of SiPM at cryogenic temperature for the   sub-meV threshold detector",
    "abstract": "This paper proposes a new detector concept that uses the decoupling of superconducting Cooper pairs to detect particles, which has a theoretical energy threshold at the sub-meV level. However, quasiparticles decoupled from Cooper pairs in superconductors is difficult to detect using conventional photoelectric devices, since the binding energy of Cooper pairs is at the sub-meV scale. A key challenge is reading out quasiparticle signals at cryogenic temperatures. Therefore, we firstly investigate the performance of silicon photomultipliers (SiPMs) at a cryogenic temperature of 10~mK, and observed that the dark count rate drops by seven orders of magnitude compared to room temperature, while the gain decreases by only a factor of 4.44. In this paper, we present a comprehensive characterization of the SiPM's performance at 10~mK, including breakdown voltage, second breakdown and operating voltage range, single-photoelectron gain and resolution, dark count rate, output waveform characteristics, and the probability of correlated signals. Based on these findings, we propose a conceptual framework for a sub-meV particle detector that uses electron multiplication in a PN junction for signal readout.",
    "authors": [
      "Aiqin Gao",
      "Hengyu Wang",
      "Xuegang Li",
      "Junhua Wang",
      "Junguang Lv",
      "Guopu Qu",
      "Lei Cao",
      "Xilei Sun",
      "Yiming Guo"
    ],
    "published": "2025-09-15T14:11:54Z",
    "updated": "2025-09-15T14:11:54Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2505.12449v2",
    "url": "https://arxiv.org/abs/2505.12449v2",
    "pdf_url": "https://arxiv.org/pdf/2505.12449v2.pdf",
    "title": "Interaction of a spatially uniform electron beam with a rotational   magnetic hole in a form of a Harris current sheet",
    "abstract": "In this work we use particle-in-cell (PIC) numerical simulations to study interaction of a spatially uniform electron beam with a rotational magnetic hole in a form of a Harris current sheet. We vary width of the Harris current sheet to investigate how this affects the quasi-linear relaxation, i.e. plateau formation of the bump-on-tail unstable electron beam. We find that when width of the Harris current sheet approaches and becomes smaller than the electron gyro-radius, quasi-linear relaxation becomes hampered and a positive slope in the electron velocity distribution function (VDF) persists. We explain this by the effects of non-conservation of electron magnetic moment, which, as recent works suggest, can maintain the positive slope of the VDF. In part, this can explain why some electron beams (the ones that interact with narrow magnetic holes with sharp boundaries, represented in our study by a Harris current sheet) in the solar wind travel much longer distances than predicted by the quasi-linear theory, at least in those cases when the electron beams slide along the current sheets that are abundant when the different-speed solar wind streams interact with each other.",
    "authors": [
      "D. Tsiklauri"
    ],
    "published": "2025-05-18T14:41:53Z",
    "updated": "2025-09-15T13:48:36Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2509.11918v1",
    "url": "https://arxiv.org/abs/2509.11918v1",
    "pdf_url": "https://arxiv.org/pdf/2509.11918v1.pdf",
    "title": "Extraction of Electron and Hole Drift Velocities in thin 4H-SiC PIN   Detectors using High-Frequency Readout Electronics",
    "abstract": "Silicon carbide (SiC) has been widely adopted in the semiconductor industry, particularly in power electronics, because of its high temperature stability, high breakdown field, and fast switching speeds. Its wide band gap makes it an interesting candidate for radiation-hard particle detectors in high-energy physics and medical applications. Furthermore, the high electron and hole drift velocities in 4H-SiC enable devices suitable for ultra-fast particle detection and timing applications. However, currently, the front-end readout electronics used for 4H-SiC detectors constitute a bottleneck in investigations of the charge carrier drift. To address these limitations, a high-frequency readout board with an intrinsic bandwidth of 10 GHz was developed. With this readout, the transient current signals of a 4H-SiC diode with a diameter of 141 $\\mathrm{\\mu m}$ and a thickness of 50 $\\mathrm{\\mu m}$ upon UV-laser, alpha particle, and high-energy proton beam excitation were recorded. In all three cases, the electron and hole drift can clearly be separated, which enables the extraction of the charge carrier drift velocities as a function of the electric field. These velocities, for the first time directly measured, provide a valuable comparison to Monte-Carlo simulated literature values and constitute an essential input for TCAD simulations. Finally, a complete simulation environment combining TCAD, the Allpix$^2$ framework, and SPICE simulations is presented, in good agreement with the measured data.",
    "authors": [
      "Andreas Gsponer",
      "Sebastian Onder",
      "Stefan Gundacker",
      "Jürgen Burin",
      "Matthias Knopf",
      "Daniel Radmanovac",
      "Simon Waid",
      "Thomas Bergauer"
    ],
    "published": "2025-09-15T13:34:54Z",
    "updated": "2025-09-15T13:34:54Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.09040v2",
    "url": "https://arxiv.org/abs/2509.09040v2",
    "pdf_url": "https://arxiv.org/pdf/2509.09040v2.pdf",
    "title": "Suppression of pair beam instabilities in a laboratory analogue of   blazar pair cascades",
    "abstract": "The generation of dense electron-positron pair beams in the laboratory can enable direct tests of theoretical models of $\\gamma$-ray bursts and active galactic nuclei. We have successfully achieved this using ultra-relativistic protons accelerated by the Super Proton Synchrotron at CERN. In the first application of this experimental platform, the stability of the pair beam is studied as it propagates through a metre-length plasma, analogous to TeV $\\gamma$-ray induced pair cascades in the intergalactic medium. It has been argued that pair beam instabilities disrupt the cascade, thus accounting for the observed lack of reprocessed GeV emission from TeV blazars. If true this would remove the need for a moderate strength intergalactic magnetic field to explain the observations. We find that the pair beam instability is suppressed if the beam is not perfectly collimated or monochromatic, hence the lower limit to the intergalactic magnetic field inferred from $\\gamma$-ray observations of blazars is robust.",
    "authors": [
      "Charles D. Arrowsmith",
      "Francesco Miniati",
      "Pablo J. Bilbao",
      "Pascal Simon",
      "Archie F. A. Bott",
      "Stephane Burger",
      "Hui Chen",
      "Filipe D. Cruz",
      "Tristan Davenne",
      "Anthony Dyson",
      "Ilias Efthymiopoulos",
      "Dustin H. Froula",
      "Alice Goillot",
      "Jon T. Gudmundsson",
      "Dan Haberberger",
      "Jack W. D. Halliday",
      "Tom Hodge",
      "Brian T. Huffman",
      "Sam Iaquinta",
      "G. Marshall",
      "Brian Reville",
      "Subir Sarkar",
      "Alexander A. Schekochihin",
      "Luis O. Silva",
      "Raspberry Simpson",
      "Vasiliki Stergiou",
      "Raoul M. G. M. Trines",
      "Thibault Vieu",
      "Nikolaos Charitonidis",
      "Robert Bingham",
      "Gianluca Gregori"
    ],
    "published": "2025-09-10T22:21:43Z",
    "updated": "2025-09-15T13:26:03Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2509.11899v1",
    "url": "https://arxiv.org/abs/2509.11899v1",
    "pdf_url": "https://arxiv.org/pdf/2509.11899v1.pdf",
    "title": "Multi-parameter sensing enabled by modular fibre-optic assemblies",
    "abstract": "Industry is transitioning from manually monitored components and processes to data-driven solutions. At the heart of this transformation is predictive maintenance, which relies on simultaneous, real-time monitoring of key operational parameters such as temperature and vibration to anticipate and prevent equipment failures. In this work, we present a modular approach to fibre-optic sensing, where different types of optical fibres and other wires are combined to compact, hybrid cable assemblies, customized for each application. These fibre-optic assemblies can be embedded or integrated in various settings, enabling multi-parameter sensing and the measurement of new parameters.",
    "authors": [
      "Kenny Hey Tow",
      "Joao M B Pereira",
      "Miguel Soriano-Amat",
      "Markus Persson",
      "Kristian Angele",
      "Mats Billstein",
      "María R. Fernández-Ruiz",
      "Camilo Escobar-Vera",
      "Åsa Claesson"
    ],
    "published": "2025-09-15T13:21:00Z",
    "updated": "2025-09-15T13:21:00Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.11831v1",
    "url": "https://arxiv.org/abs/2509.11831v1",
    "pdf_url": "https://arxiv.org/pdf/2509.11831v1.pdf",
    "title": "A high-performance elliptic solver for plasma boundary turbulence codes",
    "abstract": "Elliptic equations play a crucial role in turbulence models for magnetic confinement fusion. Regardless of the chosen modeling approach - whether gyrokinetic, gyrofluid, or drift-fluid - the Poisson equation and Amp\\`{e}re's law lead to elliptic problems that must be solved on 2D planes perpendicular to the magnetic field. In this work, we present an efficient solver for such generalised elliptic problems, especially suited for the conditions in the boundary region. A finite difference discretisation is employed, and the solver is based on a flexible generalised minimal residual method (fGMRES) with a geometric multigrid preconditioner. We present implementations with OpenMP parallelisation and GPU acceleration, with backends in CUDA and HIP. On the node level, significant speed-ups are achieved with the GPU implementation, exceeding external library solutions such as rocALUTION. In accordance with theoretical scaling laws for multigrid methods, we observe linear scaling of the solver with problem size, $O(N)$. This solver is implemented in the PARALLAX/PAccX libraries and serves as a central component of the plasma boundary turbulence codes GRILLIX and GENE-X.",
    "authors": [
      "Andreas Stegmeir",
      "Cristian Lalescu",
      "Mou Lin",
      "Jordy Trilaksono",
      "Nicola Varini",
      "Tilman Dannert"
    ],
    "published": "2025-09-15T12:17:51Z",
    "updated": "2025-09-15T12:17:51Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2504.12257v2",
    "url": "https://arxiv.org/abs/2504.12257v2",
    "pdf_url": "https://arxiv.org/pdf/2504.12257v2.pdf",
    "title": "QSHS: An Axion Dark Matter Resonant Search Apparatus",
    "abstract": "We describe a resonant cavity search apparatus for axion dark matter constructed by the Quantum Sensors for the Hidden Sector (QSHS) collaboration. The apparatus is configured to search for QCD axion dark matter, though also has the capability to detect axion-like particles (ALPs), dark photons, and some other forms of wave-like dark matter. Initially, a tuneable cylindrical oxygen-free copper cavity is read out using a low noise microwave amplifier feeding a heterodyne receiver. The cavity is housed in a dilution refrigerator and threaded by a solenoidal magnetic field, nominally 8T. The apparatus also houses a magnetic field shield for housing superconducting electronics, and several other fixed-frequency resonators for use in testing and commissioning various prototype quantum electronic devices sensitive at a range of axion masses in the range 2.0 to 40 micro-eV/c2. The apparatus as currently configured is intended as a test stand for electronics over the relatively wide frequency band attainable with the TM010 cavity mode used for axion searches. We present performance data for the resonator, dilution refrigerator, and magnet, and plans for the first science run.",
    "authors": [
      "A. Alsulami",
      "I. Bailey",
      "G. Carosi",
      "G. Chapman",
      "B. Chakraborty",
      "E. J. Daw",
      "N. Du",
      "S. Durham",
      "J. Esmenda",
      "J. Gallop",
      "T. Gamble",
      "T. Godfrey",
      "G. Gregori",
      "J. Halliday",
      "L. Hao",
      "E. Hardy",
      "E. A. Laird",
      "P. Leek",
      "J. March-Russell",
      "P. J. Meeson",
      "C. F. Mostyn",
      "Yu. A. Pashkin",
      "S. O. Peatain",
      "M. Perry",
      "M. Piscitelli",
      "M. Reig",
      "E. J. Romans",
      "S. Sarkar",
      "P. J. Smith",
      "A. Sokolov",
      "N. Song",
      "A. Sundararajan",
      "B. -K Tan",
      "S. M. West",
      "S. Withington"
    ],
    "published": "2025-04-16T17:08:00Z",
    "updated": "2025-09-15T11:35:56Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.11749v1",
    "url": "https://arxiv.org/abs/2509.11749v1",
    "pdf_url": "https://arxiv.org/pdf/2509.11749v1.pdf",
    "title": "Helical Core Formation and MHD Stability in ITER-Scale Plasmas with   Fusion-born Alpha Particles",
    "abstract": "The effect of fusion-born alpha particles on the helical core (HC), a long-lived ideal saturation state of the $m/n=1/1$ kink/quasi-interchange mode, is studied in the ITER-scale hybrid scenario where a core plasma has a low magnetic shear $q\\gtrsim1$. The HC state is determined by 3-D MHD force balance and all factors that contribute to it, such as plasma shaping, the safety factor profile, and the pressure profiles of all particle species. An incomplete but useful measure of the HC is the displacement of the magnetic axis, $\\delta_\\mathrm{HC}$. Using MHD-PIC simulations, we find that $\\delta_\\mathrm{HC}$ is enhanced by increasing alpha particle pressure $\\beta_\\mathrm{\\alpha}$. Within the ITER operating alpha pressure $\\beta_\\mathrm{\\alpha}(0) \\lesssim 1\\%$, $\\beta_\\mathrm{\\alpha}$ can be approximately treated as part of the total MHD pressure. In this regime, there is no notable flattening of the pressure profile, indicating that the HC preserves the omnigenity of the plasma. If one increases $\\beta_\\mathrm{\\alpha}(0)$ beyond $1\\%$, $\\delta_\\mathrm{HC}$ continues to increase with $\\beta_\\mathrm{\\alpha}$ until it reaches an upper limit at $\\beta_\\mathrm{\\alpha}(0)=3\\%$ for our reference case. At this limit, both the bulk and alpha pressure profiles are partially flattened, indicating a reduction in omnigenity. After HC formation, a resistive pressure-driven MHD mode can become unstable, which is localized along the compressed magnetic flux region of the HC. This secondary mode consists of a broad spectrum of short-wavelength Fourier components that grow at same rates and are thus part of a single coherent entity. Our present simulation model is insufficient to adequately represent such a secondary mode; however, preliminary results suggest that it can facilitate magnetic chaos, which affects plasma confinement.",
    "authors": [
      "P. Adulsiriswad",
      "A. Bierwage",
      "M. Yagi"
    ],
    "published": "2025-09-15T10:00:33Z",
    "updated": "2025-09-15T10:00:33Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.11705v1",
    "url": "https://arxiv.org/abs/2509.11705v1",
    "pdf_url": "https://arxiv.org/pdf/2509.11705v1.pdf",
    "title": "Sustainability Assessment of Future Accelerators",
    "abstract": "The Large Particle Physics Laboratory Directors Group (LDG) established the Working Group (WG) on the Sustainability Assessment of Future Accelerators in 2024 with the mandate to develop guidelines and a list of key parameters for the assessment of the sustainability of future accelerators in particle physics. While focused on accelerator projects, much of the work will also be relevant to other present and upcoming research infrastructures. The development and continuous update of such a framework aim to enable a coherent communication amongst scientists and adequately convey the information to a broader set of stakeholders. This document outlines the key findings and recommendations of the LDG Sustainability WG and provides a summary of current best practices aimed at enabling sustainable accelerator-based research infrastructures. Not all sustainability topics are addressed at the same level. The assessment process is complex, largely under development and a homogeneous evaluation of all the aspects requires a strategy to be developed and implemented over time.",
    "authors": [
      "C. Bloise",
      "E. Cennini",
      "J. Gutleber",
      "W. Kaabi",
      "A. Klumpp",
      "P. Koppenburg",
      "Y. Li",
      "B. List",
      "R. Losito",
      "B. Mandelli",
      "E. A. Nanni",
      "N. Neufeld",
      "T. Schoerner-Sadenius",
      "B. Shepherd",
      "V. Shiltsev",
      "S. Stapnes",
      "M. Titov",
      "L. Ulrici",
      "H. Wakeling"
    ],
    "published": "2025-09-15T09:07:01Z",
    "updated": "2025-09-15T09:07:01Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.11576v1",
    "url": "https://arxiv.org/abs/2509.11576v1",
    "pdf_url": "https://arxiv.org/pdf/2509.11576v1.pdf",
    "title": "Reconstructing High-fidelity Plasma Turbulence with Data-driven Tuning   of Diffusion in Low Resolution Grids",
    "abstract": "Developing physically consistent closure models is a longstanding challenge in simulating plasma turbulence, even in minimal systems such as the two-field Hasegawa-Wakatani (HW) model, which captures essential features of drift-wave turbulence with a reduced set of variables. In this work, we leverage theoretical insights from Direct Interaction Approximation (DIA) to construct a six-term closure structure that captures the dominant turbulent transport processes, including both diffusion and hyper-diffusion. While the mathematical form of the closure is fully prescribed by DIA, the corresponding transport coefficients are learned from data using physics-informed neural networks (PINNs). The resulting Extended HW model with Closure (EHW-C) model reveals several nontrivial features of plasma turbulence: notably, some inferred coefficients become negative in certain regimes, indicating inverse transport, a phenomenon absent in conventional closure models. Moreover, the EHW-C model accurately reproduces the spectral and flux characteristics of high-resolution Direct Numerical Simulations (DNS), while requiring only one-eighth the spatial resolution per direction, yielding a tenfold speed-up. This work demonstrates how theory-guided machine learning can both enhance computational efficiency and uncover emergent transport mechanisms in strongly nonlinear plasma systems.",
    "authors": [
      "Kunpeng Li",
      "Youngwoo Cho",
      "Xavier Garbet",
      "Chenguang Wan",
      "Robin Varennes",
      "Kyungtak Lim",
      "Virginie Grandgirard",
      "Zhisong Qu",
      "Ong Yew Soon"
    ],
    "published": "2025-09-15T04:40:36Z",
    "updated": "2025-09-15T04:40:36Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.21179v2",
    "url": "https://arxiv.org/abs/2506.21179v2",
    "pdf_url": "https://arxiv.org/pdf/2506.21179v2.pdf",
    "title": "JUNO 20-inch PMT and electronics system characterization using large   pulses of PMT dark counts at the Pan-Asia testing platform",
    "abstract": "The main goal of the JUNO experiment is to determine the neutrino mass ordering with a 20kt liquid-scintillator detector. The 20-inch PMT and its 1F3 (one for three) electronics are crucial to realize the excellent energy resolution of at least 3% at 1MeV. The knowledge on the PMT and 1F3 electronics response is critical for detector performance understanding. A study of the JUNO 20-inch PMT and 1F3 electronics system characterization is presented using large pulses of PMT dark count at the Pan-Asia testing platform in China. Thanks to its broad amplitude range and high rate, the large pulse signals are also used to investigate the PMT after pulse response.",
    "authors": [
      "Caimei Liu",
      "Min Li",
      "Narongkiat Rodphai",
      "Zhimin Wang",
      "Jun Hu",
      "Nikolay Anfimov",
      "Lei Fan",
      "Alberto Garfagnini",
      "Guanghua Gong",
      "Shaojing Hou",
      "Xiaolu Ji",
      "Xiaoshan Jiang",
      "Denis Korablev",
      "Tobias Lachenmaier",
      "Si Ma",
      "Xiaoyan Ma",
      "Zhe Ning",
      "Alexander G. Olshevskiy",
      "Zhaoyuan Peng",
      "Zhonghua Qin",
      "Tobias Sterr",
      "Yunhua Sun",
      "Alexander Felix Tietzsch",
      "Jun Wang",
      "Wei Wang",
      "Yangfu Wang",
      "Kaile Wen",
      "Bjoern Soenke Wonsak",
      "Wan Xie",
      "Meihang Xu",
      "Xiongbo Yan",
      "Yifan Yang",
      "Rong Zhao",
      "Tong Zhou",
      "Kejun Zhu",
      "Jianmeng Dong",
      "Pierre-Alexandre Petitjean",
      "Barbara Clerbaux"
    ],
    "published": "2025-06-26T12:36:42Z",
    "updated": "2025-09-15T03:43:01Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2501.06069v3",
    "url": "https://arxiv.org/abs/2501.06069v3",
    "pdf_url": "https://arxiv.org/pdf/2501.06069v3.pdf",
    "title": "Bayesian optimization of electron energy from laser wakefield   accelerators",
    "abstract": "We use Bayesian optimization in combination with three-dimensional particle-in-cell simulations to determine the optimal laser and plasma parameters that, for a given laser pulse energy, maximize the cut-off energy of an electron beam produced by laser wakefield accelerators. We assume a Gaussian laser driver with matched spot size and amplitude and investigate both self-guiding in a uniform-density plasma and guiding in a preformed plasma channel with matched radius. To interpret the simulation results quantitatively, we derive novel analytical expressions for the maximum electron energy and the corresponding acceleration distance, accounting for the effects of laser diffraction and energy depletion. Based on the results obtained, we discuss the potential scalability of the optimal input (plasma density, pulse duration, amplitude, spot size, and channel radius) and output (electron energy, electron charge, acceleration length, and acceleration efficiency) parameters to laser systems of arbitrary energy.",
    "authors": [
      "P. Valenta",
      "T. Zh. Esirkepov",
      "J. D. Ludwig",
      "S. C. Wilks",
      "S. V. Bulanov"
    ],
    "published": "2025-01-10T16:02:09Z",
    "updated": "2025-09-14T21:19:13Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1103/knh7-hbr3"
  },
  {
    "arxiv_id": "2509.11416v1",
    "url": "https://arxiv.org/abs/2509.11416v1",
    "pdf_url": "https://arxiv.org/pdf/2509.11416v1.pdf",
    "title": "Role of magnetic shear distribution on the formation of eruptive flux   ropes",
    "abstract": "Erupting flux ropes play crucial role in powering a wide range of solar transients, including flares, jets, and coronal mass ejections. These events are driven by the release of stored magnetic energy, facilitated by the shear in the complex magnetic topologies. However, the mechanisms governing the formation and eruption of flux ropes, particularly the role of magnetic shear distribution in coronal arcades are not fully understood. We employ magnetohydrodynamic simulations incorporating nonadiabatic effects of optically thin radiative losses, magnetic field-aligned thermal conduction, and spatially varying (steady) background heating, to realistically model the coronal environment. A stratified solar atmosphere under gravity is initialized with a non-force-free field comprising sheared arcades. We study two different cases by varying the initial shear to analyze their resulting dynamics, and the possibility of flux rope formation and eruptions. Our results show that strong initial magnetic shear leads to spontaneous flux rope formation and eruption via magnetic reconnection, driven by Lorentz force. The shear distribution infers the non-potentiality distributed along arcades and demonstrates its relevance in identifying sites prone to eruptive activity. The evolution of mean shear and the relative strength between guide to reconnection fields during the pre- and post-eruption phases are explored, with implications of bulk heating for the ``hot onset'' phenomena in flares, and particle acceleration. On the other hand, the weaker shear case does not lead to formation of any flux ropes. Our findings highlight the limitations of relying solely on foot point shear and underscore the need for coronal scale diagnostics. These results are relevant for understanding eruptive onset conditions and can promote a better interpretation of coronal observations from current and future missions.",
    "authors": [
      "Samrat Sen",
      "Sushree S Nayak",
      "Patrick Antolin"
    ],
    "published": "2025-09-14T20:08:33Z",
    "updated": "2025-09-14T20:08:33Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2506.20270v2",
    "url": "https://arxiv.org/abs/2506.20270v2",
    "pdf_url": "https://arxiv.org/pdf/2506.20270v2.pdf",
    "title": "Versatile luminescence macroscope with dynamic illumination for   photoactive systems",
    "abstract": "Luminescence imaging is invaluable for studying biological and material systems, particularly when advanced protocols that exploit temporal dynamics are employed. However, implementing such protocols often requires custom instrumentation, either modified commercial systems or fully bespoke setups, which poses a barrier for researchers without expertise in optics, electronics, or software. To address this, we present a versatile macroscopic fluorescence imaging system capable of supporting a wide range of protocols, and provide detailed build instructions along with open-source software to enable replication with minimal prior experience. We demonstrate its broad utility through applications to plants, reversibly photoswitchable fluorescent proteins, and optoelectronic devices.",
    "authors": [
      "Ian Coghill",
      "Alienor Lahlou",
      "Andrea Lodetti",
      "Shizue Matsubara",
      "Johann Boucle",
      "Thomas Le Saux",
      "Ludovic Jullien"
    ],
    "published": "2025-06-25T09:29:28Z",
    "updated": "2025-09-14T17:24:00Z",
    "categories": [
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1364/OE.570450"
  },
  {
    "arxiv_id": "2409.01268v3",
    "url": "https://arxiv.org/abs/2409.01268v3",
    "pdf_url": "https://arxiv.org/pdf/2409.01268v3.pdf",
    "title": "Including the vacuum energy in stellarator coil design",
    "abstract": "Being three-dimensional, stellarators have the advantage that plasma currents are not essential for creating rotational-transform; however, the external current-carrying coils in stellarators can have strong geometrical shaping, which can complicate the construction. Reducing the inter-coil electromagnetic forces acting on strongly shaped 3D coils and the stress on the support structure while preserving the favorable properties of the magnetic field is a design challenge. In this work, we recognize that the inter-coil forces are the gradient of the vacuum magnetic energy. We introduce an objective functional built on the usual quadratic flux on a prescribed target surface together with a weighed penalty on the vacuum energy. The Euler-Lagrange equation for stationary states is derived, and numerical illustrations are computed using a modern stellarator optimization framework. A study of the effect of the energy functional on the inter-coil forces is conducted and the energy is shown to be a promising quantity in producing coils with low forces.",
    "authors": [
      "S. Guinchard",
      "S. R. Hudson",
      "E. J. Paul"
    ],
    "published": "2024-09-02T14:00:43Z",
    "updated": "2025-09-14T16:22:24Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1088/1361-6587/adb789"
  },
  {
    "arxiv_id": "2509.11317v1",
    "url": "https://arxiv.org/abs/2509.11317v1",
    "pdf_url": "https://arxiv.org/pdf/2509.11317v1.pdf",
    "title": "Taylor series perspective on ab initio path integral Monte Carlo   simulations with Fermi-Dirac statistics",
    "abstract": "The fermion sign problem constitutes a fundamental computational bottleneck across a plethora of research fields in physics, quantum chemistry and related disciplines. Recently, it has been suggested to alleviate the sign problem in \\emph{ab initio} path integral Molecular Dynamics and path integral Monte Carlo (PIMC) calculations based on the simulation of fictitious identical particles that are represented by a continuous quantum statistics variable $\\xi$ [\\textit{J.~Chem.~Phys.}~\\textbf{157}, 094112 (2022)]. This idea facilitated a host of applications including the interpretation of an x-ray scattering experiment with strongly compressed beryllium at the National Ignition Facility [\\textit{Nature Commun.}~\\textbf{16}, 5103 (2025)]. In the present work, we express the original isothermal $\\xi$-extrapolation method as a special case of a truncated Taylor series expansion around the $\\xi=0$ limit of distinguishable particles. We derive new PIMC estimators that allow us to evaluate the Taylor coefficients up to arbitrary order and we carry out extensive new PIMC simulations of the warm dense electron gas to systematically analyze the sign problem from this new perspective. This gives us important insights into the applicability of the $\\xi$-extrapolation method for different levels of quantum degeneracy in terms of the Taylor series radius of convergence. Moreover, the direct PIMC evaluation of the $\\xi$-derivatives, in principle, removes the necessity for simulations at different values of $\\xi$ and can facilitate more efficient simulations that are designed to maximize compute time in those regions of the full permutation space that contribute most to the final Taylor estimate of the fermionic expectation value of interest.",
    "authors": [
      "Tobias Dornheim",
      "Alexander Benedix Robles",
      "Paul Hamann",
      "Thomas M. Chuna",
      "Pontus Svensson",
      "Sebastian Schwalbe",
      "Zhandos A. Moldabekov",
      "Panagiotis Tolias",
      "Jan Vorberger"
    ],
    "published": "2025-09-14T15:29:45Z",
    "updated": "2025-09-14T15:29:45Z",
    "categories": [
      "physics.chem-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.chem-ph"
  },
  {
    "arxiv_id": "2509.11302v1",
    "url": "https://arxiv.org/abs/2509.11302v1",
    "pdf_url": "https://arxiv.org/pdf/2509.11302v1.pdf",
    "title": "Glow discharge induced reactions in mixtures of ozone and   chlorodifluoromethane with atmospheric gases",
    "abstract": "The influence of extraterrestrial particles like cosmic radiation (CR) on the chemistry and ozone density in the Earth stratosphere is not well investigated and normally neglected in stratospheric chemistry models. Here we present the commissioning of a lab-based apparatus which aims at simulating conditions in the stratosphere in order to get better insight into the reactions induced by the secondary-particle showers from high-energetic CR which can reach low altitudes. Admixtures of ozone and the halocarbon CHClF2 (R22, chlorodifluoromethane) to atmospheric gases (N2, O2, Ar) were exposed to a glow discharge in the total pressure regime of a few hPa. According to the mass spectrometric analysis of the gas composition the discharge initiates significant ozone depletion by a factor four in the absence of R22. This depletion is strongly enhanced to two orders of magnitude in the presence of R22. The possible underlying reactions are discussed.",
    "authors": [
      "Alexander Dorn",
      "Haydar Mutaf",
      "Recep Orhan",
      "Wania Wolff",
      "Thomas Pfeifer",
      "Haji Ahmedov"
    ],
    "published": "2025-09-14T14:45:56Z",
    "updated": "2025-09-14T14:45:56Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.11291v1",
    "url": "https://arxiv.org/abs/2509.11291v1",
    "pdf_url": "https://arxiv.org/pdf/2509.11291v1.pdf",
    "title": "Enhancing Electromagnetic Calorimeter Signal Reconstruction with Machine   Learning-Based Noise Discrimination",
    "abstract": "Calorimeters operating in high-radiation environments are susceptible to damage, leading to increased noise that can significantly degrade energy resolution. A common way to mitigate noise is to apply a higher energy threshold on the cells, typically set a few standard deviations above the noise level. However, this method risks discarding cells with genuine energy deposits, worsening the energy resolution. In this paper we explore various machine learning (ML) algorithms that can replace a rigid threshold on the reconstructed cell energy and we demonstrate the improvement in calorimetric energy reconstruction and energy resolution that these ML methods can achieve in such challenging conditions.",
    "authors": [
      "Suman Das Gupta",
      "Shamik Ghosh",
      "Laltu Gazi",
      "Shubham Dutta",
      "Alexander Ledovskoy",
      "Satyaki Bhattacharya",
      "Shilpi Jain"
    ],
    "published": "2025-09-14T14:30:52Z",
    "updated": "2025-09-14T14:30:52Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "physics.data-an"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.11286v1",
    "url": "https://arxiv.org/abs/2509.11286v1",
    "pdf_url": "https://arxiv.org/pdf/2509.11286v1.pdf",
    "title": "Magnitude of Short-Wavelength Electric Field Fluctuations in Simulations   of Collisionless Plasma Shocks",
    "abstract": "Large-amplitude electrostatic fluctuations are routinely observed by spacecraft upon traversal of collisionless shocks in the heliosphere. Kinetic simulations of shocks have struggled to reproduce the amplitude of such fluctuations, complicating efforts to understand their influence on energy dissipation and shock structure. In this paper, 1D particle-in-cell simulations with realistic proton-to-electron mass ratio are used to show that in cases with upstream electron temperature $T_e$ exceeding the ion temperature $T_i$, the magnitude of the fluctuations increases with the electron plasma-to-cyclotron frequency ratio $\\omega_{pe}/\\Omega_{ce}$, reaching realistic values at $\\omega_{pe}/\\Omega_{ce} \\gtrsim 30$. The large-amplitude fluctuations in the simulations are shown to be associated with electrostatic solitary structures, such as ion phase-space holes. In the cases where upstream temperature ratio is reversed, the magnitude of the fluctuations remains small.",
    "authors": [
      "Vadim Roytershteyn",
      "Lynn B. Wilson III",
      "Li-Jen Chen",
      "Michael Gedalin",
      "Nicolai Pogorelov"
    ],
    "published": "2025-09-14T14:26:11Z",
    "updated": "2025-09-14T14:26:11Z",
    "categories": [
      "physics.space-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2509.11255v1",
    "url": "https://arxiv.org/abs/2509.11255v1",
    "pdf_url": "https://arxiv.org/pdf/2509.11255v1.pdf",
    "title": "A Geometrically Consistent Matching Framework for Side-Scan Sonar   Mapping",
    "abstract": "Robust matching of side scan sonar imagery remains a fundamental challenge in seafloor mapping due to view dependent backscatter, shadows, and geometric distortion. This paper proposes a novel matching framework that combines physical decoupling and geometric consistency to enhance correspondence accuracy and consistency across viewpoints. A self supervised multi branch network, derived from the Lambertian reflection model, decomposes raw sonar images into seabed reflectivity, terrain elevation, and acoustic path loss. The reflectivity map, serving as a stable matching domain, is used in conjunction with a training-free matching pipeline combining SuperPoint and MINIMA LightGlue. Geometry aware outlier rejection leverages both terrain elevation and its physically derived shadow map to further remove mismatches in acoustically occluded and topographically inconsistent regions, thereby improving registration accuracy. Quantitative and visual evaluations against traditional, CNN, and Transformer based state of the art methods demonstrate that our method achieves lower matching error, higher geometric consistency, and greater robustness to viewpoint variations. The proposed approach provides a data efficient, physically interpretable solution for high precision side scan sonar image matching in complex seafloor environments.",
    "authors": [
      "Can Lei",
      "Hayat Rajani",
      "Nuno Gracias",
      "Rafael Garcia",
      "Huigang Wang"
    ],
    "published": "2025-09-14T12:54:42Z",
    "updated": "2025-09-14T12:54:42Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.11160v1",
    "url": "https://arxiv.org/abs/2509.11160v1",
    "pdf_url": "https://arxiv.org/pdf/2509.11160v1.pdf",
    "title": "On the Poisson brackets of hybrid plasma models with kinetic ions and   massless electrons",
    "abstract": "We investigate the conditions under which the Jacobi identity holds for a class of recently introduced anti-symmetric brackets for the hybrid plasma models with kinetic ions and massless electrons. In particular, we establish the precise conditions under which the brackets for the vector-potential-based formulations satisfy the Jacobi identity, and demonstrate that these conditions are fulfilled by all physically relevant functionals. Moreover, for the magnetic-field-based formulation, we show that the corresponding anti-symmetric bracket constitutes a Poisson bracket under the divergence-free condition of the magnetic field, and we provide a direct proof of the Jacobi identity. These results are further extended to models incorporating electron entropy as well as more general hybrid kinetic-fluid models.",
    "authors": [
      "Yingzhe Li",
      "Philip J. Morrison",
      "Stefan Possanner",
      "Eric Sonnendrücker"
    ],
    "published": "2025-09-14T08:37:43Z",
    "updated": "2025-09-14T08:37:43Z",
    "categories": [
      "physics.plasm-ph",
      "math-ph",
      "math.MP"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.11148v1",
    "url": "https://arxiv.org/abs/2509.11148v1",
    "pdf_url": "https://arxiv.org/pdf/2509.11148v1.pdf",
    "title": "Simulation of radiation environment for the beam monitor of CEE   experiment",
    "abstract": "The cooling storage ring external-target experiment is a large-scale nuclear physics experiment, which aims to study the physics of heavy-ion collisions at low temperatures and high baryon densities. A beam monitor (BM) is placed in the beam line to monitor the beam status and to improve the reconstruction resolution of the primary vertices. The radiation dose and particle fluence stemming from the beam interactions with gases and detector materials affect the performance of the sensors and electronics of BM. This paper uses FLUKA Monte Carlo code to simulate the radiation environment of BM detector. Radiation quantities including the total ionizing dose, 1 MeV neutron equivalent fluence, high-energy hadron flux, thermal neutron flux, and nuclear fragment flux are presented. Results of alternative simulation setups, including adding shielding layers inside the BM, are also investigated.",
    "authors": [
      "Qian Wang",
      "Hulin Wang",
      "Chaosong Gao",
      "Jun Liu",
      "Xianglun Wei",
      "Junshuai Liu",
      "Zhen Wang",
      "Ran Chen",
      "Peng Ma",
      "Haibo Yang",
      "Chengxin Zhao",
      "Mingmei Xu",
      "Shusu Shi",
      "Xiangming Sun",
      "Feng Liu"
    ],
    "published": "2025-09-14T07:41:06Z",
    "updated": "2025-09-14T07:41:06Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/09/P09020"
  },
  {
    "arxiv_id": "2509.11122v1",
    "url": "https://arxiv.org/abs/2509.11122v1",
    "pdf_url": "https://arxiv.org/pdf/2509.11122v1.pdf",
    "title": "Dynamical generation of macroscale magnetic fields and fast flows in a   four-component astrophysical plasma",
    "abstract": "We explore the possibility of the generation or amplification of macroscale magnetic fields and flows in a four-component astrophysical dusty plasma composed of mobile massless electrons and positrons, inertial positive ions and negatively charged static dust particles. The investigation demonstrates that when microscopic turbulent ambient plasma energy is predominantly kinetic, a straight dynamo (DY) mechanism is feasible. Conversely, a unified reverse-dynamo/dynamo (RDY/DY) mechanism is possible when the microscopic turbulent ambient plasma energy is primarily magnetic. Additionally, the evolution of Alfv\\'{e}n Mach numbers at the macro- and microscale are significantly affected by plasma species densities and invariant helicities. The potential implications of the present study for astrophysical settings are also highlighted.",
    "authors": [
      "Usman Shazad",
      "M. Iqbal"
    ],
    "published": "2025-09-14T06:25:47Z",
    "updated": "2025-09-14T06:25:47Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1088/1402-4896/ad7a32"
  },
  {
    "arxiv_id": "2509.11100v1",
    "url": "https://arxiv.org/abs/2509.11100v1",
    "pdf_url": "https://arxiv.org/pdf/2509.11100v1.pdf",
    "title": "Energetic spectra from semi-implicit particle-in-cell simulations of   magnetic reconnection",
    "abstract": "Astrophysical observations suggest that magnetic reconnection in relativistic plasmas plays an important role in the acceleration of energetic particles. Modeling this accurately requires numerical schemes capable of addressing large scales and realistic magnetic field configurations without sacrificing the kinetic description needed to model particle acceleration self-consistently. We demonstrate the computational advantage of the relativistic semi-implicit method (RelSIM), which allows for reduced resolution while avoiding the numerical instabilities typically affecting standard explicit methods, helping to bridge the gap between macroscopic and kinetic scales. Two- and three-dimensional semi-implicit particle-in-cell simulations explore the linear tearing instability and the nonlinear development of reconnection and subsequent particle acceleration starting from a relativistic Harris equilibrium with no guide field. The simulations show that particle acceleration in the context of magnetic reconnection leads to energetic power-law spectra with cutoff energies, consistent with previous work done using explicit methods, but are obtained with a considerably reduced resolution.",
    "authors": [
      "K. M. Schoeffler",
      "F. Bacchini",
      "K. Kormann",
      "B. Eichmann",
      "M. E. Innocenti"
    ],
    "published": "2025-09-14T05:39:01Z",
    "updated": "2025-09-14T05:39:01Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  }
]