{
  "arxiv_id": "2601.19188v1",
  "url": "https://arxiv.org/abs/2601.19188v1",
  "pdf_url": "https://arxiv.org/pdf/2601.19188v1.pdf",
  "title": "Development of Electroformed X-ray Optics Bridging Synchrotron Technology and Space Astronomy",
  "abstract": "We have developed X-ray telescope mirrors using an original electroforming replication technique established through the fabrication of millimeter-aperture, ultra-short-focal-length nanofocusing mirrors for synchrotron X-ray microscopy. This paper presents detailed results of X-ray illumination tests of a 60-mm-diameter, full-circumference, double-reflection monolithic electroformed nickel mirror and its Mirror Module Assembly (MMA). The experiments were conducted at the 1-km beamline BL29XUL at SPring-8. To simulate a parallel X-ray beam from celestial sources, we constructed a dedicated evaluation system, the High-Brilliance X-ray Kilometer-long Large-Area Expanded-beam Evaluation System (HBX-KLAEES). Owing to the high photon flux and the quasi-point-like source with a small divergence provided by HBX-KLAEES, the imaging performance was evaluated with high fidelity, resolving both the sharp core and large-angle components of the Point Spread Function (PSF). The results show an extremely sharp core with a Full Width at Half Maximum (FWHM) of 0.7 arcsec and a Half Power Diameter (HPD) of 14 arcsec, even after integration into the MMA. In addition, a positive correlation was found between angular resolution and axial figure error in both the primary and secondary mirror sections, indicating that axial figure errors contribute to image degradation. Based on these results, the MMA was selected as one of the hard X-ray optics for the FOXSI-4 sounding rocket experiment, which performs high-resolution soft and hard X-ray imaging spectroscopy of solar flares and was successfully launched. These results demonstrate the potential for further improvements in angular resolution and the development of high-resolution, ultra-short focal length X-ray optics for small satellites, including CubeSats.",
  "authors": [
    "Ryuto Fujii",
    "Koki Sakuta",
    "Kazuki Ampuku",
    "Yusuke Yoshida",
    "Makoto Yoshihara",
    "Ayumu Takigawa",
    "Keitoku Yoshihira",
    "Tetsuo Kano",
    "Naoki Ishida",
    "Noriyuki Narukage",
    "Keisuke Tamura",
    "Kikuko Miyata",
    "Gota Yamaguchi",
    "Hidekazu Takano",
    "Yoshiki Kohmura",
    "Shutaro Mohri",
    "Takehiro Kume",
    "Yusuke Matsuzawa",
    "Yoichi Imamura",
    "Takahiro Saito",
    "Kentaro Hiraguri",
    "Hirokazu Hashizume",
    "Hidekazu Mimura",
    "Ikuyuki Mitsuishi"
  ],
  "published": "2026-01-27T04:42:58Z",
  "updated": "2026-01-27T04:42:58Z",
  "categories": [
    "astro-ph.IM",
    "astro-ph.SR",
    "physics.ins-det",
    "physics.optics",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.IM"
}