{
  "arxiv_id": "2601.20457v1",
  "url": "https://arxiv.org/abs/2601.20457v1",
  "pdf_url": "https://arxiv.org/pdf/2601.20457v1.pdf",
  "title": "TIARA: a fast gamma-ray detector for range monitoring in Proton Therapy",
  "abstract": "We developed a novel gamma-ray detection system (TIARA) for range monitoring in Particle Therapy. The system employs Cherenkov-based gamma-ray detection modules arranged around the target or patient, operated in time coincidence with a fast plastic beam monitor (described in a separate paper). This work focuses on the design and comprehensive characterization of the gamma-ray detection module. It consists of a monolithic PbF$_2$ crystal (2 $\\times$ 1.5 $\\times$ 1.5 cm$^{3}$) coupled to a 2 $\\times$ 2 SiPM matrix from Hamamatsu. A series of beam tests at different clinical facilities (MEDICYC and ProteusOne in France, CNAO in Italy) enabled the determination of the detector time resolution under various conditions, with values ranging from 222 to 283 ps FWHM (Full Width Half Maximum). Monte Carlo simulations including the optical response of PbF$_2$ allowed for the determination of the detection efficiency as a function of particle type and energy. For the final TIARA prototype, which will be composed of 30 modules, an overall detection efficiency of 0.45% is expected. Comparison with experimental data confirmed that the modules are effectively insensitive to neutrons, yielding an excellent signal-to-noise ratio (SNR), with an estimated SNR of 17 for a module placed at 25 cm from the 148 MeV proton beam axis. These features translate into high range accuracy: while the performance varies with beam energy and irradiation conditions, a range accuracy of 3.3 mm at 2$σ$ significance level was achieved at low intensity with 63 MeV protons at MEDICYC, for a small irradiation spot of $\\mathbf{\\sim}$10$\\mathbf{^{7}}$ protons.",
  "authors": [
    "A. André",
    "M. Pinson",
    "C. Hoarau",
    "Y. Boursier",
    "M. Dupont",
    "L. Gallin Martel",
    "M. -L. Gallin Martel",
    "A. Garnier",
    "J. Hérault",
    "J. -P. Hofverberg",
    "P. Kavrigin",
    "C. Morel",
    "J. -F. Muraz",
    "M. Pullia",
    "S. Savazzi",
    "D. Maneval",
    "S. Marcatili"
  ],
  "published": "2026-01-28T10:31:26Z",
  "updated": "2026-01-28T10:31:26Z",
  "categories": [
    "physics.ins-det",
    "physics.med-ph"
  ],
  "primary_category": "physics.ins-det"
}