{
  "arxiv_id": "2601.20997v1",
  "url": "https://arxiv.org/abs/2601.20997v1",
  "pdf_url": "https://arxiv.org/pdf/2601.20997v1.pdf",
  "title": "From Beam to Bedside: Reinforcing Domestic Supply of $^{99}$Mo/$^{99m}$Tc using Novel High-Current D+ Cyclotrons for Compact Neutron Generation and $^{99}$Mo Production",
  "abstract": "Technetium-99m ($^{99m}$Tc) is essential to more than 16 million diagnostic procedures performed annually in the United States. It is typically acquired on-site from generators containing $^{99}$Mo, in turn produced at nuclear reactor facilities. This supply chain involves multiple points of vulnerability, which can lead to shortages and delays with potentially negative patient outcomes. We report on the development of a new family of cyclotrons originally designed for the IsoDAR neutrino experiment, capable of operating at much higher current than typical cyclotrons. When operated with deuterons at 1.5 MeV/amu and an anticipated continuous beam current of 5 mA, simulations project that such a system would yield $\\sim$10$^{13}$ neutrons per second using a thin beryllium target. This neutron yield is sufficient, in principle, to support $^{99}$Mo production without the use of highly enriched uranium or reliance on foreign reactors. Simulations and conceptual design studies suggest that the system's beam dynamics could make it a viable pathway toward decentralized, hospital-based isotope generation. The relatively low energy of the deuterons minimizes activation and safety concerns. This work presents the physics motivation, technical design considerations, and projected neutron yields, outlining a pathway from a neutrino-physics prototype to a biomedical isotope production platform.",
  "authors": [
    "Jarrett Moon",
    "Daniel Winklehner",
    "Jose Alonso",
    "Claire Huchthausen",
    "David McClain",
    "Janet Conrad"
  ],
  "published": "2026-01-28T19:47:47Z",
  "updated": "2026-01-28T19:47:47Z",
  "categories": [
    "physics.acc-ph",
    "hep-ex",
    "nucl-ex"
  ],
  "primary_category": "physics.acc-ph"
}