{
  "arxiv_id": "2601.22342v1",
  "url": "https://arxiv.org/abs/2601.22342v1",
  "pdf_url": "https://arxiv.org/pdf/2601.22342v1.pdf",
  "title": "High-resolution calorimetric sample platforms for cryogenic thermodynamic studies with multimodal synchrotron x-ray compatibility",
  "abstract": "X-ray calorimetric sample platforms combining specific heat and synchrotron x-ray measurements provide a powerful means to investigate fundamental material properties. Calorimeter cell designs featuring a compact heater and thermometer arranged in a sidecar geometry, with the sample positioned directly above the heater at the center of a silicon nitride membrane, are presented. High-yield, wafer-level batch fabrication of precision calorimetric sensor chips, beamline and laboratory cryostat plugins with sensor mounting and packaging are described. Using our calorimetric sensors, we present specific heat measurements on samples with masses ranging from 4 μg to 145 μg. The sample and reference cells are characterized with relaxation and ac steady-state measurements. The thermal response is captured using lock-in detection at carefully optimized measurement frequencies, with phase-lag correction ensuring precise extraction of heat capacity. The reference cell's background heat capacity was measured to be under 320 nJ/K at 300 K, decreasing to just 0.4 nJ/K at 0.7 K. The calorimeter performance is illustrated by studying the specific heat of small samples of superconducting Nb and a 4 μg piece of superconducting Al under different magnetic field strengths. The determination of fundamental thermodynamic quantities from low-temperature electronic and lattice specific heat measurements is discussed. These versatile, high-throughput sample platforms are engineered for small-sample calorimetry across a broad cryogenic temperature range, and they support scalable integration with a wide range of cryostats, including beamline cryostats at the Advanced Photon Source. They accommodate multimodal geometries and enable operation under ultra-high vacuum, millikelvin temperatures, magnetic fields, and x-ray illumination.",
  "authors": [
    "U. Patel",
    "H. Zheng",
    "J. L. McChesney",
    "U. Welp",
    "Z. Islam",
    "A. Miceli"
  ],
  "published": "2026-01-29T21:36:06Z",
  "updated": "2026-01-29T21:36:06Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}