{
  "arxiv_id": "2512.21468v2",
  "url": "https://arxiv.org/abs/2512.21468v2",
  "pdf_url": "https://arxiv.org/pdf/2512.21468v2.pdf",
  "title": "Probing Internal Conversion and Dark-Matter-Induced De-excitation of 180mTa with a gamma-ray TES Array",
  "abstract": "We propose and evaluate a source-as-detector search for the de-excitation of the long-lived isomer $^{180\\mathrm{m}}\\mathrm{Ta}$ in natural tantalum (Ta), using a $γ$-ray transition-edge-sensor (TES) array. We exploit two capabilities not available in conventional high-purity germanium (HPGe) searches: (i) near-unity containment of low-energy secondaries (internal-conversion electrons and characteristic X rays), as well as the nuclear recoil, enabling a calorimetric, event-by-event measurement of the total energy deposited in the absorber; and (ii) a delayed-coincidence tag based on the subsequent ${}^{180}$Ta electron-capture (EC) decay to ${}^{180}$Hf. We evaluate the $3σ$ discovery reach for internal conversion (IC) and for dark-matter-induced de-excitation in two benchmark scenarios: a strongly interacting dark-matter (DM) subcomponent and inelastic DM with off-diagonal couplings. Using a background model based on intrinsic radioactivity in the Ta absorber and realistic detector performance, we show that arrays with $N_{\\mathrm{TES}}=256$ and $1{,}000$ pixels can reach the theoretically expected IC half-life within $2.6$ yr and $0.66$ yr, respectively. For an array with $N_{\\mathrm{TES}}=10^4$ and a five-year exposure, the projected sensitivity to DM-induced de-excitation surpasses limits inferred from HPGe non-observations of ${}^{180\\mathrm{m}}$Ta and probes regions of parameter space not covered by current direct-detection experiments.",
  "authors": [
    "A. Gando",
    "K. Ichimura",
    "K. Ishidoshiro",
    "T. Kikuchi",
    "T. Kishimoto",
    "A. Takeuchi",
    "R. Sato",
    "R. Smith"
  ],
  "published": "2025-12-25T02:01:51Z",
  "updated": "2026-02-20T01:22:09Z",
  "categories": [
    "hep-ph",
    "nucl-ex",
    "physics.ins-det"
  ],
  "primary_category": "hep-ph"
}