{
  "arxiv_id": "2602.17742v1",
  "url": "https://arxiv.org/abs/2602.17742v1",
  "pdf_url": "https://arxiv.org/pdf/2602.17742v1.pdf",
  "title": "Development and Application of an eV Neutron Polarization for Parity Violation Studies at CSNS Back-n Beamline",
  "abstract": "The dynamic enhancement of symmetry-breaking effects in neutron-nucleus resonances provides a sensitive testing ground for Time-Reversal Invariance Violation (TRIV). Exploiting this mechanism, the Neutron Optics Parity and Time Reversal Experiment (NOPTREX) seeks to elucidate the origin of the universe's baryon asymmetry. Critical to this effort is the precise measurement of Parity Violation (PV) asymmetries, which is essential to calibrate the nuclear parameters required for future TRIV experiments. To facilitate these studies, we developed an eV polarized neutron at the Back-n white neutron beamline of the China Spallation Neutron Source (CSNS). Neutron polarization is generated by an in-situ Spin-Exchange Optical Pumping (SEOP) $^3$He filter. Spin manipulation is performed by an adiabatic spin flipper, while spin polarization is preserved over the flight path by a vacuum transport system equipped with a solenoidal guide field. Experiments successfully measured an asymmetry of approximately $7.8 \\pm 2.4$ (stat.) $\\pm 0.3$ (sys.) % at the 0.747 eV p-wave resonance of $^{139}$La. These results are in agreement with previous results on this resonance and validate the system's capability for PV measurements.",
  "authors": [
    "Xu Qin",
    "Tianhao Wang",
    "Xuanbo Chen",
    "Changdong Deng",
    "Yongce Gong",
    "Zenghang Huang",
    "Wei Jiang",
    "Zhengquan Liu",
    "Guangyuan Luan",
    "Haotian Luo",
    "Qiuyue Luo",
    "Yongjia Lv",
    "You Lv",
    "Nikolaos Vassilopoulos",
    "Xichao Ruan",
    "William Michael Snow",
    "Kang Sun",
    "Sepehr Samiei",
    "Jian Tang",
    "Shilin Wang",
    "Hongyi Wu",
    "Xiaomin Xiong",
    "Xinyu Yuan",
    "Junpei Zhang",
    "Mofan Zhang",
    "Qiwei Zhang",
    "Qingbo Zheng",
    "Ruirui Fan",
    "Xin Tong"
  ],
  "published": "2026-02-19T11:10:28Z",
  "updated": "2026-02-19T11:10:28Z",
  "categories": [
    "physics.ins-det",
    "hep-ex",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det"
}