{
  "arxiv_id": "2602.18318v1",
  "url": "https://arxiv.org/abs/2602.18318v1",
  "pdf_url": "https://arxiv.org/pdf/2602.18318v1.pdf",
  "title": "Prompt Gamma Timing in Carbon Therapy: First Experimental Results with the TIARA Detector",
  "abstract": "In the context of range monitoring for particle therapy, this study presents the first experimental results obtained with the TIARA detector using carbon-ion beams at the CNAO clinical center in Pavia, Italy. TIARA is based on the Prompt Gamma Timing (PGT) technique, which measures the time of flight (TOF) between incident ions and prompt gamma rays (PGs) emitted during nuclear interactions in the target. While the TIARA prototype has previously been validated with protons, carbons present a more challenging scenario due to their higher linear energy transfer, nuclear fragmentation products, and the continuous beam time structure of synchrotron accelerators. Experiments were performed by irradiating PMMA targets of different thicknesses with 200 MeV/u carbon beams. A coincidence time resolution of 279$\\pm$35 ps FWHM was achieved, outperforming results previously obtained with protons at the same facility. A range accuracy of 4.74$\\pm$0.36 mm at a 2$σ$ confidence level was measured at clinical intensity, when considering 5600 detected PGs, corresponding to the grouping of four irradiation spots of 2.4$\\cdot$10$^6$ ions each. Overall, the results demonstrate that PGT-based range monitoring remains viable for carbon-ion beams, although increased background from secondary protons indicates that detector configuration adaptations are required.",
  "authors": [
    "Maxime Pinson",
    "Adélie André",
    "Yannick Boursier",
    "Mathieu Dupont",
    "Marie-Laure Gallin Martel",
    "Alicia Garnier",
    "Christophe Hoarau",
    "Pavel Kavrigin",
    "Daniel Maneval",
    "Christian Morel",
    "Jean-François Muraz",
    "Marco Pullia",
    "Simone Savazzi",
    "Sara Marcatili"
  ],
  "published": "2026-02-20T16:18:02Z",
  "updated": "2026-02-20T16:18:02Z",
  "categories": [
    "physics.med-ph",
    "physics.ins-det"
  ],
  "primary_category": "physics.med-ph"
}