{
  "arxiv_id": "2602.16567v1",
  "url": "https://arxiv.org/abs/2602.16567v1",
  "pdf_url": "https://arxiv.org/pdf/2602.16567v1.pdf",
  "title": "Scattering and sputtering on the lunar surface; Insights from negative ions observed at the surface",
  "abstract": "Context. Airless planetary bodies are directly exposed to solar wind ions, which can scatter or become implanted upon impact with the regolith-covered surface, while also sputtering surface atoms.   Aims. We construct a semi-analytical model for the scattering of ions of hundreds of eV and the sputtering of surface atoms, both resulting in the emission of negative ions from the lunar surface. Our model contains a novel description of the scattering process that is physics-based and constrained by observations.   Methods. We use data from the Negative Ions at the Lunar Surface (NILS) instrument on the Chang'e-6 lander to update prior knowledge of ion scattering and sputtering from lunar regolith through Bayesian inference.   Results. Our model shows good agreement with the NILS data. A precipitating solar wind proton has roughly a 22% chance of scattering from the lunar surface in any charge state, and about an 8% chance of sputtering a surface hydrogen atom. The resulting ratio of scattered to sputtered hydrogen flux is eta_sc / eta_sp = 1.5 for a proton speed of 300 km/s. We find a high probability (7-20%) that a hydrogen atom leaves the surface negatively charged. The angular emission distributions at near-grazing angles for both scattered and sputtered fluxes are controlled by surface roughness. Our model also indicates significant inelastic energy losses for hydrogen interacting with the regolith, suggesting a longer effective path length than previously assumed. Finally, we estimate a surface binding energy of 5.5 eV, consistent with the observations.   Conclusions. Our model describes the scattering and sputtering of particles of any charge state from any homogeneous, multi-species surface. Using NILS data, we successfully applied the model to update our understanding of solar wind interacting with lunar regolith, and the emission of negative hydrogen ions.",
  "authors": [
    "Romain Canu-Blot",
    "Martin Wieser",
    "Umberto Rollero",
    "Thomas Maynadié",
    "Stas Barabash",
    "Gabriella Stenberg Wieser",
    "Aibing Zhang",
    "Wenjing Wang",
    "Chi Wang"
  ],
  "published": "2026-02-18T16:09:02Z",
  "updated": "2026-02-18T16:09:02Z",
  "categories": [
    "physics.space-ph",
    "physics.atom-ph",
    "physics.ins-det",
    "stat.AP"
  ],
  "primary_category": "physics.space-ph"
}