{
  "arxiv_id": "2504.20128v2",
  "url": "https://arxiv.org/abs/2504.20128v2",
  "pdf_url": "https://arxiv.org/pdf/2504.20128v2.pdf",
  "title": "Gas-cell development for nuclear astrophysics motivated studies on noble gas targets and the $^3$He($α$,$γ$)$^7$Be reaction",
  "abstract": "In many astrophysical scenarios, alpha induced reactions on noble gas nuclei play a crucial role. Studying these reactions in the laboratory requires the noble gas atoms to be confined in a sufficient amount to allow the reactions. At Atomki thin-windowed gas-cell targets were developed and improved for studying alpha induced reactions on noble gases. Several stages of the gas-cell design used for activation experiments and lately a version to be used for particle scattering experiments will be presented.   A new experimental study of the $^3$He($α$,$γ$)$^7$Be reaction with one of the activation gas-cell targets was performed. This reaction plays an important role both in the solar pp-chains and in big bang nucleosynthesis. The reaction cross section was measured in the past in several works, however, there are still energy regions lacking experimental data, rendering the extrapolations towards the astrophysically relevant energies uncertain. New experimental total cross section of the $^3$He($α$,$γ$)$^7$Be reaction was thus determined here in the energy range of $E_\\mathrm{c.m.} = 2600-3000$ keV in about 50 keV energy steps. These results confirm the overall trend, and also the absolute scale set by the only one previous measurement in this energy range.   In addition, two pilot experiments with the scattering cell were performed aiming to study the $^4$He($α$,$α$)$^4$He and $^{124}$Xe($α$,$α$)$^{124}$Xe reactions at $E_α= 18$ MeV. These studies benchmark the performance of the cell and detection system both for light and heavy noble gas targets.",
  "authors": [
    "Á. Tóth",
    "Z. Elekes",
    "Zs. Fülöp",
    "Gy. Gyürky",
    "Z. Halász",
    "M. M. Juhász",
    "G. G. Kiss",
    "S. R. Kovács",
    "Zs. Mátyus",
    "T. N. Szegedi",
    "T. Szücs"
  ],
  "published": "2025-04-28T17:11:10Z",
  "updated": "2025-11-25T10:49:12Z",
  "categories": [
    "physics.ins-det",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det"
}