{
  "arxiv_id": "2511.20864v1",
  "url": "https://arxiv.org/abs/2511.20864v1",
  "pdf_url": "https://arxiv.org/pdf/2511.20864v1.pdf",
  "title": "Investigating the Timing Behavior of Compton Scattering in BGO for Time-of-Flight PET",
  "abstract": "Bismuth germanate (BGO) is gaining renewed attention as a viable material for hybrid Cherenkov/scintillation time-of-flight positron emission tomography (TOF-PET) detectors. While single-crystal studies have demonstrated excellent timing resolution by leveraging prompt Cherenkov photons, practical detector modules based on pixelated arrays introduce a high prevalence of inter-crystal scattering (InterCS) events, complicating timing accuracy. In this study, we experimentally investigated the impact of InterCS on BGO Cherenkov timing using a dual-pixel detector coupled to a segmented SiPM readout. Events were classified into full-energy deposition (FED; primary crystal 511 keV absorption), InterCS, and penetration types via energy-weighted positioning and validated using GATE simulations, which also revealed that over 25% of the experimentally identified full-energy events involved intra-crystal scatter (IntraCS). For InterCS events, the optimal timestamp selection was achieved by choosing the earlier of the two timestamps, yielding a coincidence timing resolution of 221 ps FWHM (831 ps FWTM)-markedly worse than the 184 ps (603 ps FWTM) obtained for FED events. Furthermore, prompt photon yield was found to decrease measurably due to energy splitting: InterCS events averaged 4.73 detected photons in the first 1 ns, compared to 5.76 for FED events. These results emphasize the importance of incorporating time-aware, per-pixel timestamping strategies in pixelated BGO TOF-PET systems to maintain optimal timing performance in the presence of scatter.",
  "authors": [
    "Minseok Yi",
    "Daehee Lee",
    "Alberto Gola",
    "Stefano Merzi",
    "Michele Penna",
    "Simon R. Cherry",
    "Jae Sung Lee",
    "Sun Il Kwon"
  ],
  "published": "2025-11-25T21:25:25Z",
  "updated": "2025-11-25T21:25:25Z",
  "categories": [
    "physics.ins-det",
    "physics.med-ph"
  ],
  "primary_category": "physics.ins-det"
}