{
  "arxiv_id": "2506.15164v2",
  "url": "https://arxiv.org/abs/2506.15164v2",
  "pdf_url": "https://arxiv.org/pdf/2506.15164v2.pdf",
  "title": "Dark Count Rate Stability of JUNO 20-inch PMTs in Mass Testing",
  "abstract": "The Jiangmen Underground Neutrino Observatory (JUNO) is an ambitious multipurpose neutrino experiment designed to determine the neutrino mass ordering, with an impressive energy resolution goal of at least 3% at 1 MeV. To achieve a photon detection coverage of approximately 75%, JUNO will utilize two types of 20-inch photomultiplier tubes (PMTs): the large PMT (LPMT) and the microchannel plate PMT (MCP-PMT). A significant concern in high-precision neutrino measurements is the dark count rate (DCR) of PMTs, which introduces noise that can adversely affect energy measurement accuracy. During the mass testing phase of the JUNO 20-inch PMTs, comprehensive measurements of the DCR were undertaken. These measurements not only captured the DCR values of individual PMTs but also examined the stability and temperature dependence of the DCR at an operating gain of (1x10^7). This paper presents a detailed characterization of the DCR of the JUNO 20-inch PMTs, investigating factors such as cooling time, temperature variations, and long-term stability using the JUNO Pan-Asia PMT testing facilities. The results reveal distinct DCR characteristics between the two types of PMTs, providing valuable insights into the nature of DCR and its implications for JUNO's scientific objectives. In addition to performance characterization, we implemented a monitoring system to track DCR stability over time. Notably, several spikes in DCR were identified, prompting a preliminary investigation into their causes. Potential factors contributing to these spikes, such as flasher events, were explored using coincidence rate analysis and complementary imaging techniques. The findings from this study are crucial for optimizing the performance of PMTs in JUNO, ultimately aiding the experiment in achieving its goals related to neutrino physics.",
  "authors": [
    "Min Li",
    "Narongkiat Rodphai",
    "Caimei Liu",
    "Zhimin Wang",
    "Zhaoyuan Peng",
    "Jun Wang",
    "Nikolay Anfimov",
    "Denis Korablev",
    "Tobias Lachenmaier",
    "Alexander G. Olshevskiy",
    "Zhonghua Qin",
    "Tobias Sterr",
    "Alexander Felix Tietzsch",
    "Rong Zhao",
    "Wei Wang",
    "Kaile Wen",
    "Bjoern Soenke Wonsak",
    "Wan Xie",
    "Meihang Xu",
    "Yu Zhang"
  ],
  "published": "2025-06-18T06:26:21Z",
  "updated": "2025-08-11T17:50:50Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}