{
  "arxiv_id": "2508.09335v1",
  "url": "https://arxiv.org/abs/2508.09335v1",
  "pdf_url": "https://arxiv.org/pdf/2508.09335v1.pdf",
  "title": "Geometric Optical Throughput and Etendue Revisited: Introducing the   Optogeometric Factor for Pixel Level Quantitative Imaging",
  "abstract": "This paper formally defines optogeometric factor as a pixel level measure of geometric optical throughput.   The quantity is formally defined as the surface solid angle integral of the local etendue between a pixel and its corresponding scene element. Under ideal geometric optical conditions, it can be approximated by the product of the projected pixel footprint area on the object plane and the solid angle covered by the entrance pupil. Provides a compact link between the radiance of the scene and the radiant flux collected by a single pixel, making explicit the spatial angular coupling that governs the radiometric measurements at the pixel level.   Two mathematically equivalent expressions of optogeometric factor are derived: a scene based form, expressed via the footprint area and instantaneous field of view, and a sensor based form, expressed via the pixel pitch and optical f number. Their equivalence is demonstrated analytically and confirmed using representative parameters of real thermal imaging systems.   The concept is extended to effective optogeometric factor, which incorporates the pixel fill factor to account for the active area of the sensor. This concept enables a clear separation of geometric optical coupling from detector design and other calibration terms, offering a physically transparent and transferable basis for quantitative thermography and other imaging modalities operating in the geometric optics regime.",
  "authors": [
    "Sova Jan",
    "Kolaříková Marie"
  ],
  "published": "2025-08-12T20:45:23Z",
  "updated": "2025-08-12T20:45:23Z",
  "categories": [
    "physics.optics",
    "physics.app-ph",
    "physics.ins-det"
  ],
  "primary_category": "physics.optics"
}