{
  "arxiv_id": "2411.11804v2",
  "url": "https://arxiv.org/abs/2411.11804v2",
  "pdf_url": "https://arxiv.org/pdf/2411.11804v2.pdf",
  "title": "Novel Application of Neutrinos to Evaluate U.S. Nuclear Weapons   Performance",
  "abstract": "There is a growing realization that neutrinos can be used as a diagnostic tool to better understand the inner workings of a nuclear weapon. Robust estimates demonstrate that an Inverse Beta Decay (IBD) neutrino scintillation detector built at the Nevada Test Site of 1000-ton active target mass at a standoff distance of 500 m would detect thousands of neutrino events per kTe of nuclear yield. This would provide less than 4% statistical error on measured neutrino rate and 5% error on neutrino energy. Extrapolating this to an error on the test device explosive yield requires knowledge from evaluated nuclear databases, non-equilibrium fission rates, and assumptions on internal neutron fluxes. Initial calculations demonstrate that prompt neutrino rates from a short pulse of Pu-239 fission is about a factor of two less than that from a steady state assumption. As well, there are significant energy spectral differences as a function of time after the pulse that needs to be considered. In the absence of nuclear weapons testing, many of the technical and theoretical challenges of a full nuclear test could be mitigated with a low cost smaller scale 20 ton fiducial mass IBD demonstration detector placed near a TRIGA pulsed reactor. The short duty cycle and repeatability of pulses would provide critical real environment testing and the measured neutrino rate as a function of time data would provide unique constraints on fission databases and equilibrium assumptions.",
  "authors": [
    "J. R. Distel",
    "E. C. Dunton",
    "J. M. Durham",
    "A. C. Hayes",
    "W. C. Louis",
    "J. D. Martin",
    "G. W. Misch",
    "M. R. Mumpower",
    "Z. Tang",
    "R. T. Thornton",
    "B. T. Turner",
    "R. G. Van de Water",
    "W. S. Wilburn"
  ],
  "published": "2024-11-18T18:18:43Z",
  "updated": "2025-08-28T22:43:07Z",
  "categories": [
    "physics.ins-det",
    "hep-ex",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det"
}