{
  "arxiv_id": "2508.20482v1",
  "url": "https://arxiv.org/abs/2508.20482v1",
  "pdf_url": "https://arxiv.org/pdf/2508.20482v1.pdf",
  "title": "Mineral Detection of Neutrinos and Dark Matter 2025 Proceedings",
  "abstract": "The third ``Mineral Detection of Neutrinos and Dark Matter'' (MD$\\nu$DM'25) meeting was held May 20-23, 2025 in Yokohama, Japan, hosted by the Yokohama Institute for Earth Sciences, Japan Agency for Marine-Earth Science and Technology (JAMSTEC). These proceedings compile contributions from the workshop and update the progress of mineral detector research. MD$\\nu$DM'25 was the third such meeting, following the first in October of 2022 held at the IFPU in Trieste, Italy and the second in January of 2024 hosted by the Center for Neutrino Physics at Virginia Tech in Arlington, USA. Mineral detectors record and retain damage induced by nuclear recoils in synthetic or natural mineral samples. The damage features can then be read out by a variety of nano- and micro-scale imaging techniques. Applications of mineral detectors on timescales relevant for laboratory experiments include reactor neutrino monitoring and dark matter detection, with the potential to measure the directions as well as the energies of the induced nuclear recoils. For natural mineral detectors which record nuclear recoils over geological timescales, reading out even small mineral samples could be sensitive to rare interactions induced by astrophysical neutrinos, cosmic rays, dark matter and heavy exotic particles. A series of mineral detectors of different ages could measure the time evolution of these fluxes, offering a unique window into the history of our solar system and the Milky Way. Mineral detector research is highly multidisciplinary, incorporating aspects of high energy physics, condensed matter physics, materials science, geoscience, and AI/ML for data analysis. Although realizing the scientific potential of mineral detectors poses many challenges, the MD$\\nu$DM community looks forward to the continued development of mineral detector experiments and the possible discoveries that mineral detectors could reveal.",
  "authors": [
    "Shigenobu Hirose",
    "Patrick Stengel",
    "Natsue Abe",
    "Daniel Ang",
    "Lorenzo Apollonio",
    "Gabriela R. Araujo",
    "Yoshihiro Asahara",
    "Laura Baudis",
    "Pranshu Bhaumik",
    "Nathaniel Bowden",
    "Joseph Bramante",
    "Lorenzo Caccianiga",
    "Mason Camp",
    "Qing Chang",
    "Jordan Chapman",
    "Reza Ebadi",
    "Alexey Elykov",
    "Anna Erickson",
    "Valentin Fondement",
    "Katherine Freese",
    "Shota Futamura",
    "Claudio Galelli",
    "Andrew Gilpin",
    "Takeshi Hanyu",
    "Noriko Hasebe",
    "Adam A. Hecht",
    "Samuel C. Hedges",
    "Shunsaku Horiuchi",
    "Yasushi Hoshino",
    "Patrick Huber",
    "Yuki Ido",
    "Yohei Igami",
    "Yuto Iinuma",
    "Vsevolod Ivanov",
    "Igor Jovanovic",
    "Ayuki Kamada",
    "Takashi Kamiyama",
    "Takenori Kato",
    "Yoji Kawamura",
    "Giti A. Khodaparast",
    "Yui Kouketsu",
    "Yukiko Kozaka",
    "Emilie M. LaVoie-Ingram",
    "Matthew Leybourne",
    "Gavishta Liyanage",
    "Brenden A. Magill",
    "Paolo Magnani",
    "William F. McDonough",
    "Katsuyoshi Michibayashi",
    "Naoki Mizutani",
    "Kohta Murase",
    "Tatsuhiro Naka",
    "Taiki Nakashima",
    "Kenji Oguni",
    "Mariano Guerrero Perez",
    "Noriaki Sakurai",
    "Lukas Scherne",
    "Maximilian Shen",
    "Joshua Spitz",
    "Kai Sun",
    "Katsuhiko Suzuki",
    "Koichi Takamiya",
    "Jiashen Tang",
    "Erwin H. Tanin",
    "Ethan Todd",
    "Atsuhiro Umemoto",
    "Keegan Walkup",
    "Ronald Walsworth",
    "Alexis M. Willson",
    "Norihiro Yamada",
    "Seiko Yamasaki",
    "Wen Yin",
    "Akihiko Yokoyama"
  ],
  "published": "2025-08-28T06:59:44Z",
  "updated": "2025-08-28T06:59:44Z",
  "categories": [
    "physics.ins-det",
    "astro-ph.CO",
    "astro-ph.IM",
    "hep-ex",
    "hep-ph"
  ],
  "primary_category": "physics.ins-det"
}