{
  "arxiv_id": "2508.19693v1",
  "url": "https://arxiv.org/abs/2508.19693v1",
  "pdf_url": "https://arxiv.org/pdf/2508.19693v1.pdf",
  "title": "Testing a Computed Tomography Imaging Spectrometer for Earth   Observations on the HEIMDAL Stratospheric Balloon Mission",
  "abstract": "Stratospheric High Altitude Balloons (HABs) have great potential as a remote sensing platform for Earth Observations that complements orbiting satellites and low flying drones. At altitudes between 20-35 kms, HABs operate significantly closer to ground than orbiting satellites, but significantly higher than most drones. HABs therefore offer a unique potential to deliver high spatial resolution imaging with large area coverage. Another two imaging parameters that are important for Earth Observation applications are spectral resolution and spectral range. In this paper, we therefore present the development and testing of a hyperspectral imaging system, able to record near-video-rate images in narrow contiguous spectral bands, from a HAB platform. In particular, we present the first stratospheric environmental tests and HAB flight of a snapshot hyperspectral camera, based on Computed Tomography Imaging Spectroscopy (CTIS), which is well suited to cope with the challenges posed by the motion of the HAB platform and the stratospheric environment. We have successfully acquired images with the system under both simulated stratospheric conditions in the Mars Simulation Laboratory at Aarhus University and during a 5 hour HAB flight mission named HEIMDAL from Kiruna in October 2024 as part of the REXUS/BEXUS 34/35 2024 campaign organized by DLR-SNSA. The study represents a step towards deploying the HAB platform for high quality land cover classification.",
  "authors": [
    "Mads Juul Ahlebæk",
    "Albertino Antonio Almeida Bach",
    "Loui Collin-Enoch",
    "Christian Cordes",
    "Boas Hermansson",
    "Christian Hald Jessen",
    "Søren Peter Jørgensen",
    "Tobias Jørgensen",
    "Viktor Ulrich Kanstrup",
    "Laurits Tværmose Nielsen",
    "Jes Enok Steinmüller",
    "Mads Svanborg Peters",
    "Jonathan Merrison",
    "René Lynge Eriksen",
    "Christoffer Karoff",
    "Mads Toudal Frandsen"
  ],
  "published": "2025-08-27T09:01:22Z",
  "updated": "2025-08-27T09:01:22Z",
  "categories": [
    "physics.ins-det",
    "astro-ph.IM",
    "physics.bio-ph",
    "physics.optics"
  ],
  "primary_category": "physics.ins-det"
}