{
  "arxiv_id": "2508.19962v1",
  "url": "https://arxiv.org/abs/2508.19962v1",
  "pdf_url": "https://arxiv.org/pdf/2508.19962v1.pdf",
  "title": "A cryogenic chamber setup for superfluid helium experiments with optical   fiber and electrical access",
  "abstract": "Superfluid helium is a prototypical quantum liquid. As such, it has been a prominent platform for the study of quantum many body physics. More recently, the outstanding mechanical and optical properties of superfluid helium, such as low mechanical dissipation and low optical absorption, have positioned superfluid helium as a promising material platform in applications ranging from dark matter and gravitational wave detection to quantum computation. However, experiments with superfluid helium incur a high barrier to entry as they require incorporation of complex optical and electrical setups within a hermetically sealed cryogenic chamber to confine the superfluid. Here, we report on the design and construction of a helium chamber setup for operation inside a dilution refrigerator at Millikelvin temperatures, featuring electrical and optical fiber access. By incorporating an automated gas handling system, we can precisely control the amount of helium gas inserted into the chamber, rendering our setup particularly promising for experiments with superfluid helium thin films, such as superfluid thin film optomechanics. Using silicon nanophotonic resonators, we demonstrate precise control and in-situ tuning of the thickness of a superfluid helium film on the sub-nanometer level. By making use of the exceptional tunability of the superfluid film thickness, we demonstrate optomechanically induced phonon lasing of phononic crystal cavity third sound modes in the superfluid film and show that the lasing threshold crucially depends on the film thickness. The large internal volume of our chamber (V_chamber = 1l) is adaptable for integration of various optical and electrical measurement and control techniques. Therefore, our setup provides a versatile platform for a variety of experiments in fundamental and applied superfluid helium research.",
  "authors": [
    "Alexander R. Korsch",
    "Niccolò Fiaschi",
    "Simon Gröblacher"
  ],
  "published": "2025-08-27T15:17:24Z",
  "updated": "2025-08-27T15:17:24Z",
  "categories": [
    "physics.ins-det",
    "cond-mat.mes-hall",
    "cond-mat.quant-gas",
    "cond-mat.supr-con",
    "physics.app-ph",
    "quant-ph"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.1063/5.0249931"
}