{
  "arxiv_id": "2508.20391v1",
  "url": "https://arxiv.org/abs/2508.20391v1",
  "pdf_url": "https://arxiv.org/pdf/2508.20391v1.pdf",
  "title": "On the Regulation of the Solar Wind Helium Abundance by the Hydrogen   Compressibility",
  "abstract": "Traditionally, fast solar wind is considered to originate in solar source regions that are continuously open to the heliosphere and slow wind originates in regions that are intermittently open to it. In fast wind, the gradient of the solar wind helium abundance ($A_\\mathrm{He}$) with increasing solar wind speed ($v_\\mathrm{sw}$) is $\\sim0$ and $A_\\mathrm{He}$ is fixed at $\\sim50\\%$ of the photospheric value. In slow wind, this gradient is large, $A_\\mathrm{He}$ is highly variable, and it doesn't exceed this $\\sim50\\%$ value. Although the normalized cross helicity in fast wind typically approaches 1, this is not universally true and Alterman & D'Amicis (2025) show that $\\nabla_{v_\\mathrm{sw}} \\! A_\\mathrm{He}$ in fast wind unexpectedly increases with decreasing $\\left|\\sigma_c\\right|$. We show that these large gradients are due to the presence of compressive fluctuations. Accounting for the solar wind's compressibility ($\\left|\\delta n/n\\right|$), there are two subsets of enhanced $A_\\mathrm{He}$ in excess of typical fast wind values. The subset with a large compressibility is likely from neither continuously nor intermittently open sources. The portion of the solar wind speed distribution over which these fluctuations are most significant corresponds to the range of Alfv\\'en wave-poor solar wind from continuously open source regions, which is likely analogous to the Alfv\\'enic slow wind. Mapping the results of this work to Alterman & D'Amicis (2025) and vice versa shows that, in any given $\\left|\\delta n/n\\right|$ quantile, $\\left|\\sigma_c\\right| \\lesssim 0.65$, an upper bound on non-Alfv\\'enic cross helicity. Similarly, $\\left|\\delta n/n\\right| \\lesssim 0.15$ in any given $\\left|\\sigma_c\\right|$ quantile, is an upper bound on incompressible fluctuations. We conclude that $\\left|\\delta n/n\\right|$ is essential for characterizing the solar wind helium abundance and possibly regulating it.",
  "authors": [
    "B. L. Alterman",
    "R. D'Amicis"
  ],
  "published": "2025-08-28T03:30:55Z",
  "updated": "2025-08-28T03:30:55Z",
  "categories": [
    "physics.space-ph",
    "astro-ph.SR",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.space-ph"
}