[
  {
    "arxiv_id": "2508.21794v1",
    "url": "https://arxiv.org/abs/2508.21794v1",
    "pdf_url": "https://arxiv.org/pdf/2508.21794v1.pdf",
    "title": "Simulating Gadolinium-Induced Magnetic Field Variations for Temperature   Sensing with Magneto-Mechanical Resonators",
    "abstract": "Small-size magneto-mechanical resonators (MMR) represent an emerging class of passive, wireless sensors that combine a sensing functionality with a tracking option. The operation principle is based on a resonating rotor oscillation whose frequency is defined by the magnetic flux density of a stator magnet. One general sensing mechanism is the coupling of an external parameter to this resonator frequency. In this study, we investigate an approach for encoding a temperature information as a shift in the natural oscillation frequency utilizing the temperature-dependent magnetic properties of gadolinium (Gd). We perform an isolated simulation study on the temperature scaling of the magnetic field generation for stators coated with Gd of varying thickness. Our results show that the magnetic phase transition of Gd at its Curie temperature leads to a pronounced change in the magnetic permeability enabling a significant magnetic shielding behavior only for lower temperatures. In the transition regime, we find a peak sensitivity reaching 45.8 Hz/K exceeding existing values from the literature by up to a factor of $\\sim$ 20. The findings of this work are an important step toward quantitative high-sensitivity temperature extraction with MMRs.",
    "authors": [
      "Jonas Faltinath",
      "Miriam Schmitz",
      "Fynn Foerger",
      "Martin Möddel",
      "Tobias Knopp"
    ],
    "published": "2025-08-29T17:20:20Z",
    "updated": "2025-08-29T17:20:20Z",
    "categories": [
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.app-ph"
  },
  {
    "arxiv_id": "2503.15239v3",
    "url": "https://arxiv.org/abs/2503.15239v3",
    "pdf_url": "https://arxiv.org/pdf/2503.15239v3.pdf",
    "title": "Ultra-cold neutron simulation framework for the free neutron lifetime   experiment $τ$SPECT",
    "abstract": "The precise determination of the free neutron lifetime is of great significance in modern precision physics. This key observable is linked to the mixing of up and down quarks via the Cabibbo-Kobayashi-Maskawa matrix element $V_{ud}$, and the abundance of primordial elements after the Big-Bang Nucleosynthesis. However, the two leading measurement techniques for the neutron lifetime currently yield incompatible results, a discrepancy referred to as the neutron lifetime puzzle. To address the systematic uncertainties arising from neutron interactions with material walls, the $\\tau$SPECT experiment employs a fully magnetic trap for ultra-cold neutrons (UCNs).   UCNs are extremely low-energy neutrons with typical velocities below $8\\,\\textrm{m/s}$, which can be manipulated using magnetic fields, gravity, and suitable material guides, whose surface can reflect them at any angle of incidence. To precisely study and characterize UCN behavior during production, guidance, storage, and detection in $\\tau$SPECT, we have developed a dedicated simulation framework. This framework is built upon the externally developed UCN Monte Carlo software package PENTrack and is enhanced with two companion tools: one for flexible and parametrizable upstream configuration of PENTrack such that the simulation's input settings can be adjusted to reproduce the experimental observations. The second package is used for analyzing, visualizing, and animating simulation data.   The simulation results align well with experimental data obtained with $\\tau$SPECT at the Paul Scherrer Institute and serve as a powerful resource for identifying systematic uncertainties and guiding future improvements to the current experimental setup.",
    "authors": [
      "Julian Auler",
      "Utkarsh Bajpai",
      "Martin Engler",
      "Viktoria Ermuth",
      "Martin Fertl",
      "Konrad Franz",
      "Werner Heil",
      "Simon Kaufmann",
      "Bernhard Lauss",
      "Niklas Pfeifer",
      "Dieter Ries",
      "Sylvain Vanneste",
      "Noah Yazdandoost"
    ],
    "published": "2025-03-19T14:15:34Z",
    "updated": "2025-08-29T13:36:17Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.21604v1",
    "url": "https://arxiv.org/abs/2508.21604v1",
    "pdf_url": "https://arxiv.org/pdf/2508.21604v1.pdf",
    "title": "An Evaluation of External Magnetic Flux Error in Magnet-Moving Kibble   balances",
    "abstract": "The magnet-moving measurement scheme in Kibble balances avoids displacing force-sensitive components, such as the weighing cell, and enables a broader magnetic profile measurement range during the velocity phase. However, this mechanism introduces the risk of asymmetry in the $Bl$ measurement due to external magnetic flux, leading to a potential systematic error in the final measurement results. Using the Tsinghua tabletop Kibble balance magnet as a case study, this paper investigates the error mechanism through finite element analysis and experimental investigations. An evaluation method combining external weak-field measurements with attenuation factor analysis is proposed to assess external magnetic flux errors in magnet-moving measurement schemes. The findings demonstrate that selecting an optimal weighing position can reduce the far-end flux effect to the order of $10^{-9}$. In contrast, the near-end flux effect can be quantified by monitoring the magnetic field surrounding the magnet system. In the Tsinghua Kibble balance system, we show that with proper control of external flux sources, the relative error can be reduced below $1 \\times 10^{-8}$ without requiring additional magnetic shielding.",
    "authors": [
      "Yongchao Ma",
      "Wei Zhao",
      "Songling Huang",
      "Shisong Li"
    ],
    "published": "2025-08-29T13:02:38Z",
    "updated": "2025-08-29T13:02:38Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.21532v1",
    "url": "https://arxiv.org/abs/2508.21532v1",
    "pdf_url": "https://arxiv.org/pdf/2508.21532v1.pdf",
    "title": "Quantifying Reconnection and it's Dynamical Role in 2D Magnetic   Rayleigh-Taylor Turbulence",
    "abstract": "Magnetic Rayleigh-Taylor instability (MRTI) governs material transport and mixing in astrophysical and laboratory plasmas under the influence of gravity and magnetic fields. While magnetic reconnection is known to occur during MRTI evolution, its role in the evolution and energy dynamics remains poorly understood. Here, we present a comprehensive analysis of the role of reconnection in the two-dimensional MRTI dynamics, using high-resolution simulations. We establish that reconnection, through facilitating plume merger, relieving magnetic tension, and enabling continued instability growth, forms an essential component for the long-term instability evolution. To quantify the role of reconnection in energy dynamics, we develop a robust automated reconnection detection algorithm and perform a statistical analysis across a range of magnetic field strengths. We find that reconnection accounts for up to $80\\%$ of the magnetic-to-kinetic energy transfer in the weak magnetic field regime, while contributing minimally ($\\approx 3\\%$) to magnetic energy dissipation. Our results establish magnetic reconnection as a critical mechanism that regulates large-scale MRTI dynamics, with implications for astrophysical plasmas and turbulent mixing in magnetized flows.",
    "authors": [
      "Manohar Teja Kalluri",
      "Andrew Hillier",
      "Ben Snow"
    ],
    "published": "2025-08-29T11:38:38Z",
    "updated": "2025-08-29T11:38:38Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR",
      "physics.flu-dyn",
      "physics.geo-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.03796v2",
    "url": "https://arxiv.org/abs/2506.03796v2",
    "pdf_url": "https://arxiv.org/pdf/2506.03796v2.pdf",
    "title": "Geoff: The Generic Optimization Framework & Frontend for Particle   Accelerator Controls",
    "abstract": "Geoff is a collection of Python packages that form a framework for automation of particle accelerator controls. With particle accelerator laboratories around the world researching machine learning techniques to improve accelerator performance and uptime, a multitude of approaches and algorithms have emerged. The purpose of Geoff is to harmonize these approaches and to minimize friction when comparing or migrating between them. It provides standardized interfaces for optimization problems, utility functions to speed up development, and a reference GUI application that ties everything together. Geoff is an open-source library developed at CERN and maintained and updated in collaboration between CERN and GSI as part of the EURO-LABS project. This paper gives an overview over Geoff's design, features, and current usage.",
    "authors": [
      "Penelope Madysa",
      "Sabrina Appel",
      "Verena Kain",
      "Michael Schenk"
    ],
    "published": "2025-06-04T09:58:48Z",
    "updated": "2025-08-29T08:45:55Z",
    "categories": [
      "physics.acc-ph",
      "cs.LG"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.11580v2",
    "url": "https://arxiv.org/abs/2507.11580v2",
    "pdf_url": "https://arxiv.org/pdf/2507.11580v2.pdf",
    "title": "AMBER: Algorithm for Multiplexing spectrometer Background Estimation   with Rotation-independence",
    "abstract": "State-of-the art neutron spectrometers enable simultaneous measurements of high-dimensional datasets, allowing for a large collection rate of dynamic material properties. In this paper, we present the Algorithm for Multiplexing spectrometer Background Estimation with Rotation-independence (AMBER), which is a segmentation algorithm designed to decompose measured neutron scattering data into model-agnostic foreground and background contributions. The method takes advantage of the fact that background and foreground signals are measured simultaneously during the data collection process, relying on rotational independence of background contributions. The algorithm, initially developed for multiplexing neutron spectrometers, aims to strongly reduce time consuming expert input, therefore promoting full data set usage while minimizing the source of systematic errors.",
    "authors": [
      "Jakob Lass",
      "Victor Cohen",
      "Benjamín Béjar Haro",
      "Daniel G. Mazzone"
    ],
    "published": "2025-07-15T09:07:03Z",
    "updated": "2025-08-29T08:37:41Z",
    "categories": [
      "physics.ins-det",
      "physics.data-an"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2502.02161v3",
    "url": "https://arxiv.org/abs/2502.02161v3",
    "pdf_url": "https://arxiv.org/pdf/2502.02161v3.pdf",
    "title": "A plug-and-play solution for characterizing two-way optical frequency   transfer over free-space",
    "abstract": "Optical clock networks connected by phase-coherent links offer significant potential for advancing fundamental research and diverse scientific applications. Free-space optical frequency transfer extends fiber-based connectivity to remote areas and holds the potential for global coverage via satellite links. Here we present a compact and robust portable, rack-integrated two-way free-space link characterization system. Equipped with plug-and-play capabilities, the system enables straightforward interfacing with various optical systems and facilitates quick deployment for field experiments. In this work, we achieve a fractional frequency instability of $2.0 \\times 10^{-19}$ for an averaging time of 10 s over a 3.4 km horizontal fully folded intra-city free-space link. Moreover, the system maintains an uptime of $94\\%$ over 15 hours, illustrating its reliability and effectiveness for high-precision optical frequency comparisons over free-space.",
    "authors": [
      "Jingxian Ji",
      "Shambo Mukherjee",
      "Alexander Kuhl",
      "Sebastian Koke",
      "Markus Leipe",
      "Markus Rothe",
      "Fabian Steinlechner",
      "Jochen Kronjäger"
    ],
    "published": "2025-02-04T09:37:20Z",
    "updated": "2025-08-29T07:34:50Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2508.21293v1",
    "url": "https://arxiv.org/abs/2508.21293v1",
    "pdf_url": "https://arxiv.org/pdf/2508.21293v1.pdf",
    "title": "Coherent attosecond pulses generated by a relativistic electron beam   interacting with an intense laser at a grazing angle",
    "abstract": "The interaction between relativistic electron beams and intense laser fields has been extensively studied for generating high-energy radiation. However, achieving coherent radiation from such interactions needs to precisely control the phase matching of the radiationg electrons, which has proven to be exceptionally challenging. In this study, we demonstrate that coherent attosecond radiation can be produced when a laser pulse interacts at grazing angle with a relativistic electron beam. The electrons oscillate in the laser field and are modulated with a superluminal phase, coherent ultrashort pulse trains are produced in the far field at the Cherenkov angle. This is verified by theoretical modeling and numerical simulations, including three-dimensional particle-in-cell (PIC) simulations and far-field time-domain radiation simulations. Based on our proposed scheme, high-repetition-rate, compact, and high-energy attosecond pulse sources are feasible.",
    "authors": [
      "H. Peng",
      "T. W. Huang",
      "C. N. Wu",
      "K. Jiang",
      "R. Li",
      "C. Riconda",
      "S. Weber",
      "C. T. Zhou"
    ],
    "published": "2025-08-29T01:21:31Z",
    "updated": "2025-08-29T01:21:31Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2411.11804v2",
    "url": "https://arxiv.org/abs/2411.11804v2",
    "pdf_url": "https://arxiv.org/pdf/2411.11804v2.pdf",
    "title": "Novel Application of Neutrinos to Evaluate U.S. Nuclear Weapons   Performance",
    "abstract": "There is a growing realization that neutrinos can be used as a diagnostic tool to better understand the inner workings of a nuclear weapon. Robust estimates demonstrate that an Inverse Beta Decay (IBD) neutrino scintillation detector built at the Nevada Test Site of 1000-ton active target mass at a standoff distance of 500 m would detect thousands of neutrino events per kTe of nuclear yield. This would provide less than 4% statistical error on measured neutrino rate and 5% error on neutrino energy. Extrapolating this to an error on the test device explosive yield requires knowledge from evaluated nuclear databases, non-equilibrium fission rates, and assumptions on internal neutron fluxes. Initial calculations demonstrate that prompt neutrino rates from a short pulse of Pu-239 fission is about a factor of two less than that from a steady state assumption. As well, there are significant energy spectral differences as a function of time after the pulse that needs to be considered. In the absence of nuclear weapons testing, many of the technical and theoretical challenges of a full nuclear test could be mitigated with a low cost smaller scale 20 ton fiducial mass IBD demonstration detector placed near a TRIGA pulsed reactor. The short duty cycle and repeatability of pulses would provide critical real environment testing and the measured neutrino rate as a function of time data would provide unique constraints on fission databases and equilibrium assumptions.",
    "authors": [
      "J. R. Distel",
      "E. C. Dunton",
      "J. M. Durham",
      "A. C. Hayes",
      "W. C. Louis",
      "J. D. Martin",
      "G. W. Misch",
      "M. R. Mumpower",
      "Z. Tang",
      "R. T. Thornton",
      "B. T. Turner",
      "R. G. Van de Water",
      "W. S. Wilburn"
    ],
    "published": "2024-11-18T18:18:43Z",
    "updated": "2025-08-28T22:43:07Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.21173v1",
    "url": "https://arxiv.org/abs/2508.21173v1",
    "pdf_url": "https://arxiv.org/pdf/2508.21173v1.pdf",
    "title": "X-ray diffraction strains in laser-ablated aluminum, nickel, sodium and   Invar: pressures to 475 GPa",
    "abstract": "Dynamically compressed materials in longitudinal waves are described by two physical models: hydrostatic pressure, with equal, normal, principal stresses or material uniaxially strained in the wave propagation direction. These models are disparate, so experimental comparisons and evaluations are important. Polycrystalline material in a state of hydrostatic pressure, will have no eccentricity of X-ray diffracted Debye-Scherrer rings. A general three-dimensional solution of Bragg diffracted X-rays based on principal crystallographic strains in the compression wave was found. The distortion of X-ray diffraction beams has been used for strain measurements; the analysis developed incorporates a strained reciprocal lattice and the incident X-ray beam. Strain distorted Polanyi surfaces form an annulus of compression with an ellipsoid of revolution in reciprocal space which is intersected by Ewald sphere for Bragg diffraction. The in-situ measurements for strain describe nanosecond diffraction evaluated using two planes, and both in the same crystallographic phase. Diffraction from Al, Ni, Na, and Invar quantify the compression axial strains in these materials: the compression axial ratios are 0.65, 1.05, 0.88 and 1.58 at pressures of 291, 402, 409, and 367 GPa for the respective materials. Crystal structure transformations with homogeneous pressurized stresses, mandating equal normal strains, should not be anticipated to agree with heterogeneous, uniaxially strained and sheared crystalline phases. Measurements support in-plane strains increasing with pressure, p, in fcc and hcp aluminum as with p in GPa.",
    "authors": [
      "S. J. Burns",
      "Danae N. Polsin"
    ],
    "published": "2025-08-28T19:24:55Z",
    "updated": "2025-08-28T19:24:55Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2508.21029v1",
    "url": "https://arxiv.org/abs/2508.21029v1",
    "pdf_url": "https://arxiv.org/pdf/2508.21029v1.pdf",
    "title": "Titanium for rare-event searches: Hydrofluoric acid-free etching",
    "abstract": "Rare-event search experiments require construction materials with high radiopurity to minimise background contributions. Thanks to its high mechanical strength, low density, machinability, and commercial availability in relatively radio-pure forms, titanium is a suitable material for structural elements in rare event searches. To remove surface deposits on materials used, a chemical etching stage is usually performed. However, the chemical resistance of titanium means that, conventionally, such etching is done with hydrofluoric acid. Hydrofluoric acid presents serious health risks to users, and such hazards are compounded in the case of construction in deep underground laboratories. An alternative chemical etching using sulphuric acid is presented. This is demonstrated to etch titanium, removing 3.7 $\\mu$m of material from the surface over the course of 20 hours. Scanning electron microscopy with back-scattered electron spectroscopy was used to study the surface and contamination of the titanium, demonstrating the removal of surface contaminants after etching. The proposed method is a potential alternative to those currently employed.",
    "authors": [
      "P. Knights",
      "K. Nikolopoulos",
      "G. Rogers",
      "D. Spathara",
      "P. Walters"
    ],
    "published": "2025-08-28T17:32:54Z",
    "updated": "2025-08-28T17:32:54Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.21028v1",
    "url": "https://arxiv.org/abs/2508.21028v1",
    "pdf_url": "https://arxiv.org/pdf/2508.21028v1.pdf",
    "title": "Response of AC-coupled Low Gain Avalanche Detectors to Ionizing and   Non-ionizing Radiation Damage",
    "abstract": "Low gain avalanche diodes with DC- and AC-coupled readout were exposed to ionizing and non-ionizing radiation at levels relevant to future experiments in particle, nuclear, and medical physics and to astrophysics. Damage-related change in their acceptor removal constants and in the resistivity of the region between the guard ring and the active area are reported, as is change in the leakage current and depletion voltages of the active volumes.",
    "authors": [
      "Jiahe Si",
      "Gabriele D'Amen",
      "Mohamed Hijas Mohamed Farook",
      "Gabriele Giacomini",
      "Martin R. Hoeferkamp",
      "Sally Seidel",
      "Alessandro Tricoli"
    ],
    "published": "2025-08-28T17:30:52Z",
    "updated": "2025-08-28T17:30:52Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2506.22289v2",
    "url": "https://arxiv.org/abs/2506.22289v2",
    "pdf_url": "https://arxiv.org/pdf/2506.22289v2.pdf",
    "title": "Metriplectic bracket for guiding-center Vlasov-Maxwell-Landau theory",
    "abstract": "The metriplectic formulation of collisional guiding-center Vlasov-Maxwell-Landau theory is presented. The guiding-center Landau collision operator, which describes collisions involving test-particle and field-particle guiding-center orbits, is represented in terms of a symmetric dissipative bracket involving functional derivatives of the guiding-center Vlasov phase-space density $F_{\\rm gc}$ and the electromagnetic fields $({\\bf D}_{\\rm gc},{\\bf B})$, where the guiding-center displacement vector ${\\bf D}_{\\rm gc} \\equiv {\\bf E} + 4\\pi\\,{\\sf P}_{\\rm gc}$ is expressed in terms of the electric field ${\\bf E}$ and the guiding-center polarization ${\\sf P}_{\\rm gc}$. This dissipative Landau bracket conserves guiding-center energy-momentum and angular momentum, as well as satisfying a guiding-center H-theorem.",
    "authors": [
      "A. J. Brizard",
      "H. Sugama"
    ],
    "published": "2025-06-27T15:02:48Z",
    "updated": "2025-08-28T17:28:47Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2504.16849v3",
    "url": "https://arxiv.org/abs/2504.16849v3",
    "pdf_url": "https://arxiv.org/pdf/2504.16849v3.pdf",
    "title": "Magnetorotational instability in a solar near-surface mean-field dynamo",
    "abstract": "We address the question whether the magnetorotational instability (MRI) can operate in the near-surface shear layer (NSSL) of the Sun and how it affects the interaction with the dynamo process. Using hydromagnetic mean-field simulations of $\\alpha\\Omega$-type dynamos in rotating shearing-periodic boxes, we show that for negative shear, the MRI can operate above a certain critical shear parameter. This parameter scales inversely with the equipartition magnetic field strength above which $\\alpha$ quenching set in. Like the usual $\\Omega$ effect, the MRI produces toroidal magnetic field when the field is sufficiently strong. The work done by the Lorentz force is positive, so the magnetic field drives kinetic energy and not the other way around, as in a turbulent dynamo. This results in strong kinetic energy production and dissipation, which tends to go at the expense of the magnetic energy. In view of the application to the solar NSSL, we conclude that the turbulent magnetic diffusivity may be too large for the MRI to be excited and that therefore only the standard $\\Omega$ effect is expected to operate.",
    "authors": [
      "Axel Brandenburg",
      "Gustav Larsson",
      "Fabio Del Sordo",
      "Petri J. Käpylä"
    ],
    "published": "2025-04-23T16:10:59Z",
    "updated": "2025-08-28T16:41:08Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2508.20878v1",
    "url": "https://arxiv.org/abs/2508.20878v1",
    "pdf_url": "https://arxiv.org/pdf/2508.20878v1.pdf",
    "title": "Automated simulation-based design via multi-fidelity active learning and   optimisation for laser direct drive implosions",
    "abstract": "The design of inertial fusion experiments is a complex task as driver energy must be delivered in a precise manner to a structured target to achieve a fast, but hydrodynamically stable, implosion. Radiation-hydrodynamics simulation codes are an essential tool in this design process. However, multi-dimensional simulations that capture hydrodynamic instabilities are more computationally expensive than optimistic, 1D, spherically symmetric simulations which are often the primary design tool. In this work, we develop a machine learning framework that aims to effectively use information from a large number of 1D simulations to inform design in the presence of hydrodynamic instabilities. We use an ensemble of neural network surrogate models trained on both 1D and 2D data to capture the space of good designs, i.e. those that are robust to hydrodynamic instabilities. We use this surrogate to perform Bayesian optimisation to find optimal designs for a 25 kJ laser driver. We perform hydrodynamic scaling on these designs to confirm the achievement of high gain for a 2 MJ laser driver, using 2D simulations including alpha heating effects.",
    "authors": [
      "A. J. Crilly",
      "P. W. Moloney",
      "D. Shi",
      "E. A. Ferdinandi"
    ],
    "published": "2025-08-28T15:07:18Z",
    "updated": "2025-08-28T15:07:18Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2503.16955v2",
    "url": "https://arxiv.org/abs/2503.16955v2",
    "pdf_url": "https://arxiv.org/pdf/2503.16955v2.pdf",
    "title": "HEART: A New X-Ray Tracing Code for Mosaic Crystal Spectrometers",
    "abstract": "We introduce a new open-source Python x-ray tracing code for modelling Bragg diffracting mosaic crystal spectrometers: High Energy Applications Ray Tracer (HEART). HEART's high modularity enables customizable workflows as well as efficient development of novel features. Utilizing Numba's just-in-time (JIT) compiler and the message-passing interface (MPI) allows running HEART in parallel leading to excellent performance. HEART is intended to be used for modelling x-ray spectra as they would be seen in experiments that measure x-ray spectroscopy with a mosaic crystal spectrometer. This enables the user to make predictions about what will be seen on a detector in experiment, perform optimizations on the design of the spectrometer setup, or to study the effect of the spectrometer on measured spectra. However, the code certainly has further uses beyond these example use cases. Here, we discuss the physical model used in the code, and explore a number of different mosaic distribution functions, intrinsic rocking curves, and sampling approaches which are available to the user. Finally, we demonstrate its strong predictive capability in comparison to spectroscopic data collected at the European XFEL in Germany.",
    "authors": [
      "Thomas Gawne",
      "Sebastian Schwalbe",
      "Thomas Chuna",
      "Uwe Hernandez Acosta",
      "Thomas R. Preston",
      "Tobias Dornheim"
    ],
    "published": "2025-03-21T09:00:21Z",
    "updated": "2025-08-28T15:02:38Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.05730v2",
    "url": "https://arxiv.org/abs/2508.05730v2",
    "pdf_url": "https://arxiv.org/pdf/2508.05730v2.pdf",
    "title": "A response matrix determined with a coincidence-based acquisition for   correction of charge sharing spectral distortions in energy-resolved photon   counting detectors",
    "abstract": "A model-independent method is proposed to characterize and correct charge sharing spectral distortions in energy-resolved X-ray acquisitions with pixellated photon-counting detectors. The technique is based on the determination of a coincidence-based response matrix (CBRM) through a preliminary calibration with a uniform irradiation and an arbitrary polychromatic spectrum. The calibration requires the collection of the number of coincidences between a reference pixel and its neighbours for different combinations of energy bins, in order to calculate a set of charge sharing probabilities which are independent of the input spectrum. A detector response matrix is determined, which can afterwards be applied to correct other spectra acquired with the same detector and a conventional multi-comparator electronics, without introducing penalties in terms of processing time. The technique was validated with Geant4 simulations of a 1 mm thick CdTe detector and with data collected with a pixel hybrid detector made of a 300 um thick silicon sensor coupled to a Timepix4 ASIC chip. The differences between the reconstructed spectra and reference distributions of an ideal detector or a 3x3 offline clustering algorithm were evaluated in terms of mean absolute percentage errors. It is demonstrated that the response matrix can restore the spectral information with a performance close to standard clustering algorithms and is less affected by noise artifacts than analog charge summing techniques.",
    "authors": [
      "Vincenzo Monaco",
      "Luca Brombal",
      "Pasquale Delogu",
      "Alessandro Feruglio",
      "Massimiliano Fiorini",
      "Renata Longo",
      "Luca Marchetti",
      "Anna Maria Poli",
      "Luigi Rigon",
      "Valeria Rosso"
    ],
    "published": "2025-08-07T17:40:15Z",
    "updated": "2025-08-28T14:56:50Z",
    "categories": [
      "physics.ins-det",
      "physics.med-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.20862v1",
    "url": "https://arxiv.org/abs/2508.20862v1",
    "pdf_url": "https://arxiv.org/pdf/2508.20862v1.pdf",
    "title": "Dipole Localization Using An Integrated Radio Frequency Atomic   Magnetometer",
    "abstract": "Optically-pumped atomic magnetometers have previously been used in arrays to reject interference from far away sources and enable the sensitive detection of local sources of radio frequency (RF) signals, useful, for instance, in the detection of low field NMR signals in an unshielded environment. We now demonstrate a complementary scheme in which four magnetometer measurements are used to locate in three dimensions a nearby radio frequency source. The methodology relies on the measurement of a radio frequency vector at two different positions and modeling the source as a magnetic dipole of known orientation. In contrast to coil detection, magnetometers have the advantage of measuring signals in a 2D plane, and do not inductively couple to their environment or each other, making them a strong candidate for localization of hidden RF sources. For this demonstration, we use only a single RF magnetometer to make four measurements of a synchronous and oriented dipole source, but it is to be expected that this could be replaced by four magnetometers working simultaneously. In addition, this work is greatly aided by the introduction of a fully integrated magnetometer, in which all optics, including lasers, are safely enclosed into a compact head with flexible wired connections. The portable, as well as safe, nature of the sensor make it quite valuable for in the field work.",
    "authors": [
      "Ayse Marasli",
      "Thomas Kornack",
      "Casey Oware",
      "Karen L. Sauer"
    ],
    "published": "2025-08-28T14:56:21Z",
    "updated": "2025-08-28T14:56:21Z",
    "categories": [
      "physics.ins-det",
      "78A30",
      "J.2"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.20800v1",
    "url": "https://arxiv.org/abs/2508.20800v1",
    "pdf_url": "https://arxiv.org/pdf/2508.20800v1.pdf",
    "title": "EPICS for Small-Scale Laboratories with Python Soft IOCs",
    "abstract": "While the Experimental Physics and Industrial Control System (EPICS) is widely used at large laboratories for slow controls and instrumentation, the deployment of a full EPICS installation can be difficult, with a steep learning curve to new users. Taking advantage of the pythonSoftIOC module, we developed an EPICS slow controls implementation for Jefferson Lab's Hall B cryotarget written entirely in Python and based on software IOCs that communicate with instruments over Ethernet. This system ran successfully, interfacing with Jefferson Lab's full EPICS network, and we offer it as an example of the capabilities of pythonSoftIOC to build lightweight, yet robust and flexible instrumentation platforms that would be easily adapted for use at a small-scale laboratory. University groups can use these examples to build complete slow controls systems, from device communication to data archiving and display, using open-source, mature EPICS tools and student-friendly Python as an alternative to expensive and proprietary systems such as LabView.",
    "authors": [
      "James D. Maxwell"
    ],
    "published": "2025-08-28T14:01:54Z",
    "updated": "2025-08-28T14:01:54Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2504.03016v2",
    "url": "https://arxiv.org/abs/2504.03016v2",
    "pdf_url": "https://arxiv.org/pdf/2504.03016v2.pdf",
    "title": "Strong gradient effects on neoclassical electron transport and the   bootstrap current",
    "abstract": "Standard approaches to neoclassical theory do not extend into regions of strong gradients in tokamaks such as the pedestal and internal transport barriers. Here, we calculate the modifications to neoclassical electron physics inside strong gradient regions of large aspect ratio tokamaks. We show that these modifications are due to the different ion flow and the strong poloidal variation of the potential. We also provide a physical interpretation of the mechanisms that drive poloidal asymmetries and hence a poloidal electric field. We apply our model to two specific example cases of pedestal profiles, calculating the neoclassical electron flux and the bootstrap current. We find that depending on the ion flow, weak gradient neoclassical theory overestimates or underestimates the neoclassical electron transport and the bootstrap current in regions with strong gradients. We show that the determination of the mean parallel flow is more complex than in weak gradient neoclassical theory. For vanishing turbulence, we can determine the radial electric field for a given flow profile in the pedestal.",
    "authors": [
      "Silvia Trinczek",
      "Felix I. Parra",
      "Peter J. Catto"
    ],
    "published": "2025-04-03T20:20:01Z",
    "updated": "2025-08-28T13:57:09Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.20728v1",
    "url": "https://arxiv.org/abs/2508.20728v1",
    "pdf_url": "https://arxiv.org/pdf/2508.20728v1.pdf",
    "title": "Photon identification using the Hough transform in imaging calorimeters",
    "abstract": "Photon identification in calorimeters represents a crucial challenge in particle physics experiments, especially in high-density environments where shower overlap probabilities become significant. We present an energy-core-based photon identification method that exploits the distinct compact energy core feature of electromagnetic showers through Hough transform pattern recognition in imaging calorimeters. The method, validated through simulations of the CEPC crystal electromagnetic calorimeter, demonstrates outstanding performance. It achieves a high identification efficiency of nearly 100% for photons with energies exceeding 2 GeV and a separation efficiency approaching 100% for two 5 GeV photons when the distance between them reaches the granularity limit of the calorimeter. This advanced energy-core-based photon identification method integrated with an energy splitting technique enhances the performance of photon measurement and provides a promising tool for imaging calorimeters, particularly those requiring high precision in photon detection in complex event topologies with high multiplicity.",
    "authors": [
      "Yang Zhang",
      "Shengsen Sun",
      "Weizheng Song",
      "Fangyi Guo",
      "Yuanzhan Wang",
      "Linghui Wu",
      "Yifang Wang"
    ],
    "published": "2025-08-28T12:50:29Z",
    "updated": "2025-08-28T12:50:29Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.20714v1",
    "url": "https://arxiv.org/abs/2508.20714v1",
    "pdf_url": "https://arxiv.org/pdf/2508.20714v1.pdf",
    "title": "Ultrafast solid-state chemical synthesis of BaTiO3 initiated by gyrotron   microwave radiation",
    "abstract": "This work presents the results of a study on the solid-state synthesis of barium titanate under continuous microwave radiation from a 24 GHz gyrotron in a multimode cavity reactor. It is shown that in localized domains where fine-scale thermal instabilities develop, initiated by microwave radiation within the initial stoichiometric reaction mixture of ultrafine barium carbonate and titanium dioxide powders, the synthesis can proceed within 1,5 - 7 minutes, achieving a target product yield of up to 90%. Based on a developed realistic numerical model of the multimode reactor, involving an iterative solution of stationary Maxwell and heat conduction equations, it is demonstrated that the specific absorbed power in the domains where fine-scale thermal instabilities develop can reach 670 W/cm3 under an input microwave power of 400 W.",
    "authors": [
      "S. V. Sintsov",
      "N. V. Chekmarev",
      "K. I. Rybakov",
      "A. A. Sorokin",
      "E. I. Preobrazhenskii",
      "A. V. Vodopyanov"
    ],
    "published": "2025-08-28T12:33:47Z",
    "updated": "2025-08-28T12:33:47Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.chem-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2506.10551v2",
    "url": "https://arxiv.org/abs/2506.10551v2",
    "pdf_url": "https://arxiv.org/pdf/2506.10551v2.pdf",
    "title": "Impact of angle-dependent recombination on neutrino energy   reconstruction in LArTPCs",
    "abstract": "The technology of Liquid Argon Time-Projection Chambers (LArTPC) plays a very important role in modern neutrino physics. It allows precise tracking and calorimetry in detectors with very large volume and mass. One important component of LArTPC calorimetric energy reconstruction is the electron-ion recombination effect. Existing experiments have provided constraints to its empirical description, including an explicit dependence on the particle's angle with respect to the TPC's electric field.   In this paper we analyze the impact of angle-dependent recombination models on the reconstruction of neutrino energy in LArTPCs. We examine in detail the predictions of the existing models, showing that there is still considerable uncertainty for the angular dependence prediction at the low values of $dE/dx$ typical of minimum ionizing particles. We apply a simple correction to overcome unphysical predictions in the non-constrained energy loss regions and evaluate the consequences of that in the bias and linearity of electron neutrino energy responses, using generator-level and electron shower simulations for neutrino energies in the range of 0.5-5 GeV. Comparing prediction with and without angular-dependence, we observe an average energy bias between -0.9\\% at 0.5 GeV and -0.6\\% at 5 GeV. While small, these values are close to the typical requirement of 2\\% for the energy scale uncertainty of future experiments, and indicate the need to obtain actual experimental constraints at low $dE/dx$ and take the effect into account in order to achieve the best precision in future LAr TPC electron neutrino calorimetry.",
    "authors": [
      "J. Vences",
      "J. Maneira",
      "C. Vilela"
    ],
    "published": "2025-06-12T10:18:43Z",
    "updated": "2025-08-28T12:02:33Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2508.20685v1",
    "url": "https://arxiv.org/abs/2508.20685v1",
    "pdf_url": "https://arxiv.org/pdf/2508.20685v1.pdf",
    "title": "Terahertz control of relativistic electron beams for femtosecond   bunching and laser-synchronized temporal locking",
    "abstract": "Femtosecond relativistic electron bunches and micro-bunch trains synchronised with femtosecond precision to external laser sources are widely sought for next-generation accelerator and photonic technologies, from extreme UV and X-ray light sources for materials science, to ultrafast electron diffraction and future high-energy physics colliders. While few-femtosecond bunches have been demonstrated, achieving the control, stability and femtosecond-level laser synchronisation remains critically out of reach. Here we demonstrate a concept for laser-driven compression of high-energy (35.5 MeV) electron bunches with temporal synchronisation to a high-power (few-TW) laser system. Laser-generated multi-cycle terahertz (THz) pulses drive periodic electron energy modulation, enabling subsequent magnetic compression capable of generating tuneable picosecond-spaced bunch trains with 30 pC total charge and 50 A peak currents, or to compress a single bunch by a factor of 27 down to 15 fs duration. The THz-driven compression simultaneously drives temporal-locking of the bunch to the THz drive laser, providing a route to femtosecond-level synchronisation, overcoming the timing jitter inherent to radio-frequency accelerators and high-power laser systems. This THz technique offers compact and flexible bunch control with unprecedented temporal synchronisation, opening a pathway to unlock new capabilities for free electron lasers, ultrafast electron diffraction and novel plasma accelerators.",
    "authors": [
      "Morgan T. Hibberd",
      "Christopher T. Shaw",
      "Joseph T. Bradbury",
      "Daniel S. Lake",
      "Connor D. W. Mosley",
      "Sergey S. Siaber",
      "Laurence J. R. Nix",
      "Beatriz Higuera-González",
      "Thomas H. Pacey",
      "James K. Jones",
      "David A. Walsh",
      "Robert B. Appleby",
      "Graeme Burt",
      "Darren M. Graham",
      "Steven P. Jamison"
    ],
    "published": "2025-08-28T11:44:14Z",
    "updated": "2025-08-28T11:44:14Z",
    "categories": [
      "physics.acc-ph",
      "physics.app-ph",
      "physics.optics"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.20678v1",
    "url": "https://arxiv.org/abs/2508.20678v1",
    "pdf_url": "https://arxiv.org/pdf/2508.20678v1.pdf",
    "title": "Start-to-end modelling of laser-plasma acceleration, beam transport and   dose deposition of very high-energy electrons for radiotherapy",
    "abstract": "Radiotherapy using very high-energy electron (VHEE) beams generated by a laser-plasma accelerator has garnered significant interest due to its dose distribution capabilities and potential to address limitations of traditional photon-based radiotherapy. To explore the feasibility of such approach, the presented study uses the parameters of OONA, the commercial <1.3\\,J, <25\\,fs pulse duration laser recently installed at the Weizmann Institute of Science. Through particle-in-cell simulations of laser-plasma interaction, realistic electron beams were obtained. After filtering and collimation with a beamline and arranging them into an array of pencil beams, their radiotherapeutic potential was investigated. GEANT4 simulations were used to calculate the dose deposition in water phantoms and heterogeneous phantoms with bone inserts, considering realistic beam parameters for laser-plasma accelerators. Multifield irradiation setup and the dose distribution at the isocenter through different incidence angles were studied, simulating an intensity-modulated delivery. Our findings demonstrate that polychromatic VHEE beams generated from laser-plasma accelerators, when collimated using a compact beamline of quadrupoles and dipoles, can deliver an on-axis dose with enhanced precision and uniformity. This study highlights the transformative potential of laser-plasma accelerators in advancing radiotherapy modalities, paving the way for further research and clinical implementation.",
    "authors": [
      "Rajakrishna Kalvala",
      "Anton Golovanov",
      "Arnaud Courvoisier",
      "Tomer Friling",
      "Eyal Kroupp",
      "Lidan Grishko",
      "Victor Malka"
    ],
    "published": "2025-08-28T11:39:39Z",
    "updated": "2025-08-28T11:39:39Z",
    "categories": [
      "physics.med-ph",
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.med-ph"
  },
  {
    "arxiv_id": "2508.20627v1",
    "url": "https://arxiv.org/abs/2508.20627v1",
    "pdf_url": "https://arxiv.org/pdf/2508.20627v1.pdf",
    "title": "Monte Carlo simulation method for incoherent Thomson scattering spectra   from arbitrary electron distribution functions",
    "abstract": "We developed a Monte Carlo simulation method to calculate incoherent Thomson scattering spectra in high temperature plasmas. The basic idea is to treat the entire scattering process as the superposition of individual photon-electron interactions. We introduce macro-particles, referred from particle-in-cell simulations, to reduce the computational cost, and obtain scattered spectra within a reasonable computational time. Since the velocity of the interacting electron is randomly sampled from an electron distribution function, the method can be applied to arbitrary electron distribution functions provided an appropriate sampling scheme is available. We present simulation results for relativistic Maxwellian and kappa distribution functions, and compare them with both analytical and numerical spectra for validation. The simulated spectra show good agreement with both analytical and numerical results, demonstrating that the Monte Carlo simulation method can reliably reproduce incoherent Thomson scattering spectra.",
    "authors": [
      "Kentaro Sakai",
      "Kentaro Tomita",
      "Takeo Hoshi",
      "Ryo Yasuhara"
    ],
    "published": "2025-08-28T10:20:13Z",
    "updated": "2025-08-28T10:20:13Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.20566v1",
    "url": "https://arxiv.org/abs/2508.20566v1",
    "pdf_url": "https://arxiv.org/pdf/2508.20566v1.pdf",
    "title": "Physics-informed neural network enhanced multispectral single-pixel   imaging with a chip spectral sensor",
    "abstract": "Multispectral imaging (MSI) captures data across multiple spectral bands, offering enhanced informational depth compared to standard RGB imaging and benefiting diverse fields such as agriculture, medical diagnostics, and industrial inspection. Conventional MSI systems, however, suffer from high cost, complexity, and limited performance in low-light conditions. Moreover, data-driven MSI methods depend heavily on large, labeled training datasets and struggle with generalization. In this work, we present a portable multispectral single-pixel imaging (MS-SPI) method that integrates a chip-sized multispectral sensor for system miniaturization and leverages an untrained physics-informed neural network (PINN) to reconstruct high-quality spectral images without the need for labeled training data. The physics-informed structure of the network enables the self-corrected reconstruction of multispectral images directly with the input of raw measurements from the multispectral sensor. Our proof-of-concept prototype achieves the reconstruction of 12-channel high-quality spectral images at the sampling rate of 10%. We also experimentally validate its performance under varying sampling rate conditions, by comparing it with conventional compressive sensing algorithms. Furthermore, we demonstrate the application of this technique to an MSI-based image segmentation task, in which spatial regions are discriminated according to their characteristic spectral signatures. This compact, high-fidelity, and portable approach offers promising pathways to lightweight and cost-effective spectral imaging on mobile platforms.",
    "authors": [
      "Muchen Zhu",
      "Baolei Liu",
      "Yao Wang",
      "Linjun Zhai",
      "Jiaqi Song",
      "Nana Liu",
      "Zhaohua Yang",
      "Lei Ding",
      "Fan Wang"
    ],
    "published": "2025-08-28T09:04:28Z",
    "updated": "2025-08-28T09:04:28Z",
    "categories": [
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.20502v1",
    "url": "https://arxiv.org/abs/2508.20502v1",
    "pdf_url": "https://arxiv.org/pdf/2508.20502v1.pdf",
    "title": "Assessment of the Runaway Electrons induced damage to the Tokamak First   Wall",
    "abstract": "The study assessed the damage caused by Runaway Electrons (RE) on First Wall tiles, comparing the effects on Beryllium and Tungsten. This was done by using realistic RE energy distribution functions to replicate RE impacts through the FLUKA code. These energy distribution functions are based on the ASDEX Upgrade experiment # 39012. The parametric analysis carried out with FLUKA in the presence of magnetic fields indicated a clear relationship between the beam impact angle and the material deposited energy, demonstrating that higher impact angles lead to deeper electron penetration and greater deposited energies. A finite element model based on apparent heat capacity formulation in FreeFem++ was developed to analyze the material thermal response to such thermal loads using volumetric energy density profiles from FLUKA simulations as input. Different RE current values were simulated to show its influence on the evolution of the material temperature and melting thickness",
    "authors": [
      "L. Singh",
      "M. De Bastiani",
      "R. Bonifetto",
      "F. Subba",
      "D. Borgogno"
    ],
    "published": "2025-08-28T07:41:51Z",
    "updated": "2025-08-28T07:41:51Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.20482v1",
    "url": "https://arxiv.org/abs/2508.20482v1",
    "pdf_url": "https://arxiv.org/pdf/2508.20482v1.pdf",
    "title": "Mineral Detection of Neutrinos and Dark Matter 2025 Proceedings",
    "abstract": "The third ``Mineral Detection of Neutrinos and Dark Matter'' (MD$\\nu$DM'25) meeting was held May 20-23, 2025 in Yokohama, Japan, hosted by the Yokohama Institute for Earth Sciences, Japan Agency for Marine-Earth Science and Technology (JAMSTEC). These proceedings compile contributions from the workshop and update the progress of mineral detector research. MD$\\nu$DM'25 was the third such meeting, following the first in October of 2022 held at the IFPU in Trieste, Italy and the second in January of 2024 hosted by the Center for Neutrino Physics at Virginia Tech in Arlington, USA. Mineral detectors record and retain damage induced by nuclear recoils in synthetic or natural mineral samples. The damage features can then be read out by a variety of nano- and micro-scale imaging techniques. Applications of mineral detectors on timescales relevant for laboratory experiments include reactor neutrino monitoring and dark matter detection, with the potential to measure the directions as well as the energies of the induced nuclear recoils. For natural mineral detectors which record nuclear recoils over geological timescales, reading out even small mineral samples could be sensitive to rare interactions induced by astrophysical neutrinos, cosmic rays, dark matter and heavy exotic particles. A series of mineral detectors of different ages could measure the time evolution of these fluxes, offering a unique window into the history of our solar system and the Milky Way. Mineral detector research is highly multidisciplinary, incorporating aspects of high energy physics, condensed matter physics, materials science, geoscience, and AI/ML for data analysis. Although realizing the scientific potential of mineral detectors poses many challenges, the MD$\\nu$DM community looks forward to the continued development of mineral detector experiments and the possible discoveries that mineral detectors could reveal.",
    "authors": [
      "Shigenobu Hirose",
      "Patrick Stengel",
      "Natsue Abe",
      "Daniel Ang",
      "Lorenzo Apollonio",
      "Gabriela R. Araujo",
      "Yoshihiro Asahara",
      "Laura Baudis",
      "Pranshu Bhaumik",
      "Nathaniel Bowden",
      "Joseph Bramante",
      "Lorenzo Caccianiga",
      "Mason Camp",
      "Qing Chang",
      "Jordan Chapman",
      "Reza Ebadi",
      "Alexey Elykov",
      "Anna Erickson",
      "Valentin Fondement",
      "Katherine Freese",
      "Shota Futamura",
      "Claudio Galelli",
      "Andrew Gilpin",
      "Takeshi Hanyu",
      "Noriko Hasebe",
      "Adam A. Hecht",
      "Samuel C. Hedges",
      "Shunsaku Horiuchi",
      "Yasushi Hoshino",
      "Patrick Huber",
      "Yuki Ido",
      "Yohei Igami",
      "Yuto Iinuma",
      "Vsevolod Ivanov",
      "Igor Jovanovic",
      "Ayuki Kamada",
      "Takashi Kamiyama",
      "Takenori Kato",
      "Yoji Kawamura",
      "Giti A. Khodaparast",
      "Yui Kouketsu",
      "Yukiko Kozaka",
      "Emilie M. LaVoie-Ingram",
      "Matthew Leybourne",
      "Gavishta Liyanage",
      "Brenden A. Magill",
      "Paolo Magnani",
      "William F. McDonough",
      "Katsuyoshi Michibayashi",
      "Naoki Mizutani",
      "Kohta Murase",
      "Tatsuhiro Naka",
      "Taiki Nakashima",
      "Kenji Oguni",
      "Mariano Guerrero Perez",
      "Noriaki Sakurai",
      "Lukas Scherne",
      "Maximilian Shen",
      "Joshua Spitz",
      "Kai Sun",
      "Katsuhiko Suzuki",
      "Koichi Takamiya",
      "Jiashen Tang",
      "Erwin H. Tanin",
      "Ethan Todd",
      "Atsuhiro Umemoto",
      "Keegan Walkup",
      "Ronald Walsworth",
      "Alexis M. Willson",
      "Norihiro Yamada",
      "Seiko Yamasaki",
      "Wen Yin",
      "Akihiko Yokoyama"
    ],
    "published": "2025-08-28T06:59:44Z",
    "updated": "2025-08-28T06:59:44Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.CO",
      "astro-ph.IM",
      "hep-ex",
      "hep-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.20431v1",
    "url": "https://arxiv.org/abs/2508.20431v1",
    "pdf_url": "https://arxiv.org/pdf/2508.20431v1.pdf",
    "title": "Electrical Impedance Tomography with an Integrated Picoliter-Volume   Subtractive Microfluidic Chamber in 65 nm CMOS",
    "abstract": "Electrical impedance tomography with fully integrated microfluidics and electronics is presented for the first time in a CMOS chip. Chambers and electrodes are fabricated in the interconnect layers of a 65 nm CMOS chip through post-processing, enabling picoliter-volumes to be processed and imaged. Tomography maps are reconstructed by reading out voltages from a 16-element electrode array and processing the data off-chip, and sources of variation in reconstruction are discussed. The EIT system presented in this work serves as a proof-of-concept towards using CMOS as a platform for co-integrated microfluidics and electronics.",
    "authors": [
      "Antonio Victor Machado de Oliveira",
      "Debjit Sarkar",
      "Ali Hajimiri"
    ],
    "published": "2025-08-28T05:05:34Z",
    "updated": "2025-08-28T05:05:34Z",
    "categories": [
      "physics.ins-det",
      "eess.SP"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.20391v1",
    "url": "https://arxiv.org/abs/2508.20391v1",
    "pdf_url": "https://arxiv.org/pdf/2508.20391v1.pdf",
    "title": "On the Regulation of the Solar Wind Helium Abundance by the Hydrogen   Compressibility",
    "abstract": "Traditionally, fast solar wind is considered to originate in solar source regions that are continuously open to the heliosphere and slow wind originates in regions that are intermittently open to it. In fast wind, the gradient of the solar wind helium abundance ($A_\\mathrm{He}$) with increasing solar wind speed ($v_\\mathrm{sw}$) is $\\sim0$ and $A_\\mathrm{He}$ is fixed at $\\sim50\\%$ of the photospheric value. In slow wind, this gradient is large, $A_\\mathrm{He}$ is highly variable, and it doesn't exceed this $\\sim50\\%$ value. Although the normalized cross helicity in fast wind typically approaches 1, this is not universally true and Alterman & D'Amicis (2025) show that $\\nabla_{v_\\mathrm{sw}} \\! A_\\mathrm{He}$ in fast wind unexpectedly increases with decreasing $\\left|\\sigma_c\\right|$. We show that these large gradients are due to the presence of compressive fluctuations. Accounting for the solar wind's compressibility ($\\left|\\delta n/n\\right|$), there are two subsets of enhanced $A_\\mathrm{He}$ in excess of typical fast wind values. The subset with a large compressibility is likely from neither continuously nor intermittently open sources. The portion of the solar wind speed distribution over which these fluctuations are most significant corresponds to the range of Alfv\\'en wave-poor solar wind from continuously open source regions, which is likely analogous to the Alfv\\'enic slow wind. Mapping the results of this work to Alterman & D'Amicis (2025) and vice versa shows that, in any given $\\left|\\delta n/n\\right|$ quantile, $\\left|\\sigma_c\\right| \\lesssim 0.65$, an upper bound on non-Alfv\\'enic cross helicity. Similarly, $\\left|\\delta n/n\\right| \\lesssim 0.15$ in any given $\\left|\\sigma_c\\right|$ quantile, is an upper bound on incompressible fluctuations. We conclude that $\\left|\\delta n/n\\right|$ is essential for characterizing the solar wind helium abundance and possibly regulating it.",
    "authors": [
      "B. L. Alterman",
      "R. D'Amicis"
    ],
    "published": "2025-08-28T03:30:55Z",
    "updated": "2025-08-28T03:30:55Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2508.20303v1",
    "url": "https://arxiv.org/abs/2508.20303v1",
    "pdf_url": "https://arxiv.org/pdf/2508.20303v1.pdf",
    "title": "Efficient ion re-acceleration in laboratory-produced interpenetrating   collisionless shocks",
    "abstract": "Although the origin of cosmic rays (CRs) remains an open question, collisionless magnetized shock waves are widely regarded as key sites for particle acceleration. Recent theories further suggest that shock-shock collisions in stellar clusters could provide the additional acceleration needed to explain the observed high-energy CR spectrum. Here, we investigate this hypothesis through a laser-based experiment that creates magnetized plasma conditions similar to astrophysical environments. Our results demonstrate that interpenetrating collisionless shocks can significantly boost the energy of ambient protons previously energized by the individual shocks, while also improving the overall acceleration efficiency. Numerical kinetic simulations corroborate these findings, revealing that protons are reaccelerated via their bouncing motion in the convective electric fields of the colliding magnetized flows. By allowing to highly energize ambient protons, our novel colliding-shock platform opens the prospect to test the long-discussed mechanism of diffusive shock acceleration in a controlled laboratory setting.",
    "authors": [
      "W. Yao",
      "I. Cohen",
      "P. Suarez Gerona",
      "H. Ahmed",
      "A. F. A. Bott",
      "S. N. Chen",
      "M. Cook",
      "R. Lelièvre",
      "P. Martin",
      "T. Waltenspiel",
      "P. Antici",
      "J. Béard",
      "M. Borghesi",
      "D. Caprioli",
      "A. Ciardi",
      "E. d'Humières",
      "M. François",
      "L. Gremillet",
      "A. Marcowith",
      "M. Miceli",
      "T. Seebaruth",
      "S. Orlando",
      "J. Fuchs"
    ],
    "published": "2025-08-27T22:34:23Z",
    "updated": "2025-08-27T22:34:23Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.20299v1",
    "url": "https://arxiv.org/abs/2508.20299v1",
    "pdf_url": "https://arxiv.org/pdf/2508.20299v1.pdf",
    "title": "Isotope Enrichment and Element Separation by Self Generated Magnetic   Centrifuge Fields in Ultrafast Laser Ablation",
    "abstract": "A self-consistent model is developed to explain the anomalously large enrichment of nickel isotopes observed in ablation plumes from ultrafast laser irradiation of solid surfaces. The model is based on the spontaneous creation of a magnetic centrifuge in the ablation plume and the associated cyclotron rotation of plasma ions with rotation rates on the order of 10^9 radians per second. Mass separation occurs around the radial coordinate of cylindrical symmetry with longitudinal axis normal to the ablating surface. A Gaussian shaped radial magnetic field distribution is extracted for Ni isotopes with peak field of 53 Megagauss and average field of 20 Megagauss. In addition to cyclotron rotation of ions, a rigid rotor model is also presented that is associated with the hydrodynamic rotation of the entire plasma and is shown to be of little consequence for the isotope enrichment. Cyclotron rotations dominate the process. A profound resonance of enrichment is observed for specific cyclotron charge states and is shown to be associated with Ion Bernstein Wave (IBW) coupling that provides electrostatic acceleration to these resonant orbits.",
    "authors": [
      "Peter P. Pronko",
      "Paul A. Van Rompay"
    ],
    "published": "2025-08-27T22:10:22Z",
    "updated": "2025-08-27T22:10:22Z",
    "categories": [
      "physics.plasm-ph",
      "physics.app-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2503.21461v2",
    "url": "https://arxiv.org/abs/2503.21461v2",
    "pdf_url": "https://arxiv.org/pdf/2503.21461v2.pdf",
    "title": "ParaFlow: fast calorimeter simulations parameterized in upstream   material configurations",
    "abstract": "We study whether machine-learning models for fast calorimeter simulations can learn meaningful representations of calorimeter signatures that account for variations in the full particle detector's configuration. This may open new opportunities in high-energy physics measurements, for example in the assessment of systematic uncertainties that are related to the detector geometry, in the inference of properties of the detector configuration, or in the automated design of experiments. As a concrete example, we parameterize normalizing-flow-based simulations in configurations of the material upstream of a toy calorimeter. We call this model ParaFlow, which is trained to interpolate between different material budgets and positions, as simulated with Geant4. We study ParaFlow's performance in terms of photon shower shapes that are directly influenced by the properties of the upstream material, in which photons can convert to an electron-positron pair. In general, we find that ParaFlow is able to reproduce the dependence of the shower shapes on the material properties at the few-percent level with larger differences only in the tails of the distributions.",
    "authors": [
      "Johannes Erdmann",
      "Jonas Kann",
      "Florian Mausolf",
      "Peter Wissmann"
    ],
    "published": "2025-03-27T12:50:49Z",
    "updated": "2025-08-27T19:30:28Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1140/epjc/s10052-025-14604-0"
  },
  {
    "arxiv_id": "2508.20090v1",
    "url": "https://arxiv.org/abs/2508.20090v1",
    "pdf_url": "https://arxiv.org/pdf/2508.20090v1.pdf",
    "title": "Multi-channel, multi-template event reconstruction for SuperCDMS data   using machine learning",
    "abstract": "SuperCDMS SNOLAB uses kilogram-scale germanium and silicon detectors to search for dark matter. Each detector has Transition Edge Sensors (TESs) patterned on the top and bottom faces of a large crystal substrate, with the TESs electrically grouped into six phonon readout channels per face. Noise correlations are expected among a detector's readout channels, in part because the channels and their readout electronics are located in close proximity to one another. Moreover, owing to the large size of the detectors, energy deposits can produce vastly different phonon propagation patterns depending on their location in the substrate, resulting in a strong position dependence in the readout-channel pulse shapes. Both of these effects can degrade the energy resolution and consequently diminish the dark matter search sensitivity of the experiment if not accounted for properly. We present a new algorithm for pulse reconstruction, mathematically formulated to take into account correlated noise and pulse shape variations. This new algorithm fits N readout channels with a superposition of M pulse templates simultaneously - hence termed the N$\\times$M filter. We describe a method to derive the pulse templates using principal component analysis (PCA) and to extract energy and position information using a gradient boosted decision tree (GBDT). We show that these new N$\\times$M and GBDT analysis tools can reduce the impact from correlated noise sources while improving the reconstructed energy resolution for simulated mono-energetic events by more than a factor of three and for the 71Ge K-shell electron-capture peak recoils measured in a previous version of SuperCDMS called CDMSlite to $<$ 50 eV from the previously published value of $\\sim$100 eV. These results lay the groundwork for position reconstruction in SuperCDMS with the N$\\times$M outputs.",
    "authors": [
      "M. F. Albakry",
      "I. Alkhatib",
      "D. Alonso-Gonzalez",
      "J. Anczarski",
      "T. Aralis",
      "T. Aramaki",
      "I. Ataee Langroudy",
      "C. Bathurst",
      "R. Bhattacharyya",
      "A. J. Biff",
      "P. L. Brink",
      "M. Buchanan",
      "R. Bunker",
      "B. Cabrera",
      "R. Calkins",
      "R. A. Cameron",
      "C. Cartaro",
      "D. G. Cerdeno",
      "Y. -Y. Chang",
      "M. Chaudhuri",
      "J. H. Chen",
      "R. Chen",
      "N. Chott",
      "J. Cooley",
      "H. Coombes",
      "P. Cushman",
      "R. Cyna",
      "S. Das",
      "S. Dharani",
      "M. L. di Vacri",
      "M. D. Diamond",
      "M. Elwan",
      "S. Fallows",
      "E. Fascione",
      "E. Figueroa-Feliciano",
      "S. L. Franzen",
      "A. Gevorgian",
      "M. Ghaith",
      "G. Godden",
      "J. Golatkara",
      "S. R. Golwala",
      "R. Gualtieri",
      "J. Hall",
      "S. A. S. Harms",
      "C. Hays",
      "B. A. Hines",
      "Z. Hong",
      "L. Hsu",
      "M. E. Huber",
      "V. Iyer",
      "V. K. S. Kashyap",
      "S. T. D. Keller",
      "M. H. Kelsey",
      "K. T. Kennard",
      "Z. Kromer",
      "A. Kubik",
      "N. A. Kurinsky",
      "M. Lee",
      "J. Leyva",
      "B. Lichtenberga",
      "J. Liu",
      "Y. Liu",
      "E. Lopez Asamard",
      "P. Lukens",
      "R. Lopez Noe",
      "D. B. MacFarlane",
      "R. Mahapatra",
      "J. S. Mammo",
      "A. J. Mayer",
      "P. C. McNamara",
      "E. Michaud",
      "E. Michielin",
      "K. Mickelson",
      "N. Mirabolfathi",
      "M. Mirzakhani",
      "B. Mohanty",
      "D. Mondal",
      "D. Monteiro",
      "J. Nelson",
      "H. Neog",
      "J. L. Orrell",
      "M. D. Osborne",
      "S. M. Oser",
      "L. Pandey",
      "S. Pandey",
      "R. Partridge",
      "P. K. Patel",
      "D. S. Pedrerosa",
      "W. Peng",
      "W. L. Perry",
      "R. Podviianiuk",
      "M. Potts",
      "S. S. Poudel",
      "A. Pradeep",
      "M. Pyle",
      "W. Rau",
      "T. Reynold",
      "M. Rios",
      "A. Roberts",
      "A. E. Robinson",
      "L. Rosado",
      "J. L. Ryan",
      "T. Saab",
      "D. Sadek",
      "B. Sadoulet",
      "S. P. Sahoo",
      "I. Saikia",
      "S. Salehi",
      "J. Sander",
      "B. Sandoval",
      "A. Sattari",
      "R. W. Schnee",
      "B. Serfass",
      "A. E. Sharbaugh",
      "R. S. Shenoy",
      "A. Simchony",
      "P. Sinervo",
      "Z. J. Smith",
      "R. Soni",
      "K. Stifter",
      "J. Street",
      "M. Stukel",
      "H. Sun",
      "E. Tanner",
      "N. Tenpas",
      "D. Toback",
      "A. N. Villano",
      "J. Viola",
      "B. von Krosigk",
      "O. Wen",
      "Z. William",
      "M. J. Wilson",
      "J. Winchell",
      "S. Yellin",
      "B. A. Young",
      "B. Zatschler",
      "S. Zatschler",
      "A. Zaytsev",
      "E. Zhang",
      "L. Zheng",
      "A. Zuniga",
      "M. J. Zurowski"
    ],
    "published": "2025-08-27T17:56:29Z",
    "updated": "2025-08-27T17:56:29Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.11764v2",
    "url": "https://arxiv.org/abs/2508.11764v2",
    "pdf_url": "https://arxiv.org/pdf/2508.11764v2.pdf",
    "title": "Multiphysics Analysis of Cryogenically Cooled Photocathode in a CW SRF   Injector cavity",
    "abstract": "The paper evaluates the thermal regime of a cryogenically cooled copper photocathode integrated into a continuous-wave superconducting radio-frequency injector cavity with direct thermal contact. Such a photoinjector layout is being developed at DESY and has recently demonstrated a record-high 50 MV/m axial electric field in radio-frequency tests, marking an important milestone. To address the thermal effect of the picosecond excitation laser, we first develop a two-temperature model to describe the temperature of the emitting surface at cryogenic temperatures and solve it numerically. Subsequently, we present a one-temperature model of the bulk photocathode coupled with an electromagnetic model of the injector cavity. For the current injector design, we predict a negligible impact of the laser on the intrinsic quality factor of the cavity, identifying instead the cryogenic stability of the copper cathode as the primary operational limit. To overcome cooling challenges, we propose an improved configuration of the cathode plug. For the proposed geometry, the multiphysics analysis confirms stable performance at a nominal 2 W laser power, sufficient for 100 pC beams at 1 MHz under optimistic quantum efficiency assumptions. Operation at higher laser loads will benefit from further dedicated cryogenic analysis.",
    "authors": [
      "Dmitry Bazyl",
      "Klaus Floettmann",
      "Elmar Vogel",
      "Igor Zagorodnov"
    ],
    "published": "2025-08-15T18:29:44Z",
    "updated": "2025-08-27T16:36:21Z",
    "categories": [
      "physics.acc-ph",
      "physics.app-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2503.11285v2",
    "url": "https://arxiv.org/abs/2503.11285v2",
    "pdf_url": "https://arxiv.org/pdf/2503.11285v2.pdf",
    "title": "Knock Out Slow Extraction Using Betatron Sidebands at High Harmonics",
    "abstract": "Radio frequency knock out resonant slow extraction is a standard method for extracting stored particle beams from synchrotrons by transverse excitation. Excitation signals comprising many betatron sidebands have shown to reduce intensity fluctuations of the extracted beam spill and are used at several facilities. In this contribution, the effect of individual sidebands at different harmonics on the spill quality is systematically studied. Particle tracking simulations show a clear correlation between the chosen excitation frequency, the spectrum of particle motion shortly before their extraction, and the spill quality. Experiments confirm these observations while highlighting the reduction of pile-up when using higher excitation frequencies. These insights have implications for an optimal design of excitation waveforms and hardware for knock out extraction systems.",
    "authors": [
      "Philipp Niedermayer",
      "Rahul Singh",
      "Eike Feldmeier",
      "Christian Schömers",
      "Marcel Hun"
    ],
    "published": "2025-03-14T10:46:10Z",
    "updated": "2025-08-27T15:40:40Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.19962v1",
    "url": "https://arxiv.org/abs/2508.19962v1",
    "pdf_url": "https://arxiv.org/pdf/2508.19962v1.pdf",
    "title": "A cryogenic chamber setup for superfluid helium experiments with optical   fiber and electrical access",
    "abstract": "Superfluid helium is a prototypical quantum liquid. As such, it has been a prominent platform for the study of quantum many body physics. More recently, the outstanding mechanical and optical properties of superfluid helium, such as low mechanical dissipation and low optical absorption, have positioned superfluid helium as a promising material platform in applications ranging from dark matter and gravitational wave detection to quantum computation. However, experiments with superfluid helium incur a high barrier to entry as they require incorporation of complex optical and electrical setups within a hermetically sealed cryogenic chamber to confine the superfluid. Here, we report on the design and construction of a helium chamber setup for operation inside a dilution refrigerator at Millikelvin temperatures, featuring electrical and optical fiber access. By incorporating an automated gas handling system, we can precisely control the amount of helium gas inserted into the chamber, rendering our setup particularly promising for experiments with superfluid helium thin films, such as superfluid thin film optomechanics. Using silicon nanophotonic resonators, we demonstrate precise control and in-situ tuning of the thickness of a superfluid helium film on the sub-nanometer level. By making use of the exceptional tunability of the superfluid film thickness, we demonstrate optomechanically induced phonon lasing of phononic crystal cavity third sound modes in the superfluid film and show that the lasing threshold crucially depends on the film thickness. The large internal volume of our chamber (V_chamber = 1l) is adaptable for integration of various optical and electrical measurement and control techniques. Therefore, our setup provides a versatile platform for a variety of experiments in fundamental and applied superfluid helium research.",
    "authors": [
      "Alexander R. Korsch",
      "Niccolò Fiaschi",
      "Simon Gröblacher"
    ],
    "published": "2025-08-27T15:17:24Z",
    "updated": "2025-08-27T15:17:24Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mes-hall",
      "cond-mat.quant-gas",
      "cond-mat.supr-con",
      "physics.app-ph",
      "quant-ph"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1063/5.0249931"
  },
  {
    "arxiv_id": "2508.19820v1",
    "url": "https://arxiv.org/abs/2508.19820v1",
    "pdf_url": "https://arxiv.org/pdf/2508.19820v1.pdf",
    "title": "Molecular dynamics of nondegenerate hydrogen plasma using improved Kelbg   pseudopotential with electron finite-size correction",
    "abstract": "This paper is devoted to semiclassical molecular dynamics simulation of nondegenerate hydrogen plasma using an improved Kelbg pseudopotential. The main novelty of our method is accounting for the finite size of electrons. This modification resolves the nonphysical cluster formation at temperatures below 50 kK, which was first reported by A.V. Filinov [Phys. Rev. E 70, 046411 (2004)]. However, the energy still appears to be underestimated at low temperatures, as indicated by comparisons with the recent path integral Monte Carlo calculations [Phys. Plasmas 31, 110501 (2024)]. Using the presented method, we analyze the dependence of radial distribution functions, composition, ionization degree, energy, and pressure on the plasma coupling parameter, while maintaining a fixed degeneracy parameter. Additionally, we demonstrate the impact of incorporating long-range interactions on the energy $N$-dependence by utilizing the angular-averaged Ewald potential. Finally, we compute the thermodynamic limits for energy and pressure.",
    "authors": [
      "G. S. Demyanov",
      "P. R. Levashov"
    ],
    "published": "2025-08-27T12:07:59Z",
    "updated": "2025-08-27T12:07:59Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.19693v1",
    "url": "https://arxiv.org/abs/2508.19693v1",
    "pdf_url": "https://arxiv.org/pdf/2508.19693v1.pdf",
    "title": "Testing a Computed Tomography Imaging Spectrometer for Earth   Observations on the HEIMDAL Stratospheric Balloon Mission",
    "abstract": "Stratospheric High Altitude Balloons (HABs) have great potential as a remote sensing platform for Earth Observations that complements orbiting satellites and low flying drones. At altitudes between 20-35 kms, HABs operate significantly closer to ground than orbiting satellites, but significantly higher than most drones. HABs therefore offer a unique potential to deliver high spatial resolution imaging with large area coverage. Another two imaging parameters that are important for Earth Observation applications are spectral resolution and spectral range. In this paper, we therefore present the development and testing of a hyperspectral imaging system, able to record near-video-rate images in narrow contiguous spectral bands, from a HAB platform. In particular, we present the first stratospheric environmental tests and HAB flight of a snapshot hyperspectral camera, based on Computed Tomography Imaging Spectroscopy (CTIS), which is well suited to cope with the challenges posed by the motion of the HAB platform and the stratospheric environment. We have successfully acquired images with the system under both simulated stratospheric conditions in the Mars Simulation Laboratory at Aarhus University and during a 5 hour HAB flight mission named HEIMDAL from Kiruna in October 2024 as part of the REXUS/BEXUS 34/35 2024 campaign organized by DLR-SNSA. The study represents a step towards deploying the HAB platform for high quality land cover classification.",
    "authors": [
      "Mads Juul Ahlebæk",
      "Albertino Antonio Almeida Bach",
      "Loui Collin-Enoch",
      "Christian Cordes",
      "Boas Hermansson",
      "Christian Hald Jessen",
      "Søren Peter Jørgensen",
      "Tobias Jørgensen",
      "Viktor Ulrich Kanstrup",
      "Laurits Tværmose Nielsen",
      "Jes Enok Steinmüller",
      "Mads Svanborg Peters",
      "Jonathan Merrison",
      "René Lynge Eriksen",
      "Christoffer Karoff",
      "Mads Toudal Frandsen"
    ],
    "published": "2025-08-27T09:01:22Z",
    "updated": "2025-08-27T09:01:22Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "physics.bio-ph",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.19662v1",
    "url": "https://arxiv.org/abs/2508.19662v1",
    "pdf_url": "https://arxiv.org/pdf/2508.19662v1.pdf",
    "title": "Transition of blue-core helicon discharge",
    "abstract": "This study explores the transitional characteristics of blue-core helicon discharge, which to our knowledge was not particularly focused on before. Parameters are measured on recently built advanced linear plasma device, i.e. Multiple Plasma Simulation Linear Device (MPS-LD) by various diagnostics including Langmuir probe, optical emission spectrometer, and standard high-speed camera. It is found that the jump direction of electron density (from low level to high level) is opposite to that of electron temperature (from high level to low level). Electron density increases significantly and the radial profile becomes localized near the axis when the blue-core transition occurs. With increased field strength, electron density increases whereas electron temperature drops. The radial profile of electron temperature looks like a ``W\" shape, i.e. minimizing around the edge of blue-core column. Electron density increases with background pressure, while electron temperature peaks around certain pressure value. High-speed videos show that the plasma column oscillates radially and experiences azimuthal instabilities with high rate once entered blue-core mode. An electromagnetic solver (EMS) based on Maxwell's equations and a cold-plasma dielectric tensor is also employed to compute the wave field and power absorption during blue-core transition, to provide more details that are valuable for understanding the transitional physics but not yet available in experiment. The results show that wave field in both radial and axial directions changes significantly during the transition, its structure differs from antenna to downstream, and the power dependence of wave magnetic field is overall opposite to that of wave electric field. This work presents comprehensive characteristics of the transitional blue-core discharge and is important to both physics understanding and practical applications.",
    "authors": [
      "L. Chang",
      "S. J. Zhang",
      "J. T. Wu",
      "Y. W. Zhang",
      "C. Wang",
      "Y. Peng",
      "S. S. Gao",
      "C. J. Sun",
      "Q. Wang",
      "C. F. Sang",
      "S. C. Thakur",
      "S. Isayama",
      "S. J. You"
    ],
    "published": "2025-08-27T08:21:04Z",
    "updated": "2025-08-27T08:21:04Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.19653v1",
    "url": "https://arxiv.org/abs/2508.19653v1",
    "pdf_url": "https://arxiv.org/pdf/2508.19653v1.pdf",
    "title": "Charting the Luminosity Capabilities of the CERN Large Hadron Collider   with Various Nuclear Species",
    "abstract": "The Large Hadron Collider (LHC) at CERN has been instrumental in recent advances in experimental high energy physics by colliding beams of protons and heavier nuclei at unprecedented energies. The present heavy-ion programme is based mainly on colliding lead nuclei. For future ion runs, there is strong interest to achieve a significantly higher integrated nucleon-nucleon luminosity, which might be achieved through collisions of species other than Pb. In this paper, we explore the nucleon-nucleon luminosity projections in the LHC for a selection of ion species ranging from He to Xe, and including Pb as reference. Alternative beam production schemes are investigated as a way to mitigate effects such as space charge that degrade the beam quality in the LHC injectors. In the most optimistic scenarios, we find up to about a factor~4 improvement in integrated nucleon-nucleon luminosity for a typical future one-month run, with respect to the present Pb programme. We also outline a future study programme and experiments to test the assumptions and refine the simulated projections put forward in this article.",
    "authors": [
      "E. Waagaard",
      "R. Bruce",
      "R. Alemany Fernandez",
      "H. Bartosik",
      "J. M. Jowett",
      "N. Triantafyllou"
    ],
    "published": "2025-08-27T08:01:30Z",
    "updated": "2025-08-27T08:01:30Z",
    "categories": [
      "physics.acc-ph",
      "nucl-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.08586v3",
    "url": "https://arxiv.org/abs/2507.08586v3",
    "pdf_url": "https://arxiv.org/pdf/2507.08586v3.pdf",
    "title": "Spatial and Temporal Evaluations of the Liquid Argon Purity in   ProtoDUNE-SP",
    "abstract": "Liquid argon time projection chambers (LArTPCs) rely on highly pure argon to ensure that ionization electrons produced by charged particles reach readout arrays. ProtoDUNE Single-Phase (ProtoDUNE-SP) was an approximately 700-ton liquid argon detector intended to prototype the Deep Underground Neutrino Experiment (DUNE) Far Detector Horizontal Drift module. It contains two drift volumes bisected by the cathode plane assembly, which is biased to create an almost uniform electric field in both volumes. The DUNE Far Detector modules must have robust cryogenic systems capable of filtering argon and supplying the TPC with clean liquid. This paper will explore comparisons of the argon purity measured by the purity monitors with those measured using muons in the TPC from October 2018 to November 2018. A new method is introduced to measure the liquid argon purity in the TPC using muons crossing both drift volumes of ProtoDUNE-SP. For extended periods on the timescale of weeks, the drift electron lifetime was measured to be above 30 ms using both systems. A particular focus will be placed on the measured purity of argon as a function of position in the detector.",
    "authors": [
      "DUNE Collaboration",
      "S. Abbaslu",
      "A. Abed Abud",
      "R. Acciarri",
      "L. P. Accorsi",
      "M. A. Acero",
      "M. R. Adames",
      "G. Adamov",
      "M. Adamowski",
      "C. Adriano",
      "F. Akbar",
      "F. Alemanno",
      "N. S. Alex",
      "K. Allison",
      "M. Alrashed",
      "A. Alton",
      "R. Alvarez",
      "T. Alves",
      "A. Aman",
      "H. Amar",
      "P. Amedo",
      "J. Anderson",
      "D. A. Andrade",
      "C. Andreopoulos",
      "M. Andreotti",
      "M. P. Andrews",
      "F. Andrianala",
      "S. Andringa",
      "F. Anjarazafy",
      "S. Ansarifard",
      "D. Antic",
      "M. Antoniassi",
      "A. Aranda-Fernandez",
      "L. Arellano",
      "E. Arrieta Diaz",
      "M. A. Arroyave",
      "M. Arteropons",
      "J. Asaadi",
      "M. Ascencio",
      "A. Ashkenazi",
      "D. Asner",
      "L. Asquith",
      "E. Atkin",
      "D. Auguste",
      "A. Aurisano",
      "V. Aushev",
      "D. Autiero",
      "D. Ávila Gómez",
      "M. B. Azam",
      "F. Azfar",
      "A. Back",
      "J. J. Back",
      "Y. Bae",
      "I. Bagaturia",
      "L. Bagby",
      "D. Baigarashev",
      "S. Balasubramanian",
      "A. Balboni",
      "P. Baldi",
      "W. Baldini",
      "J. Baldonedo",
      "B. Baller",
      "B. Bambah",
      "F. Barao",
      "D. Barbu",
      "G. Barenboim",
      "P. Barham Alzás",
      "G. J. Barker",
      "W. Barkhouse",
      "G. Barr",
      "A. Barros",
      "N. Barros",
      "D. Barrow",
      "J. L. Barrow",
      "A. Basharina-Freshville",
      "A. Bashyal",
      "V. Basque",
      "M. Bassani",
      "D. Basu",
      "C. Batchelor",
      "L. Bathe-Peters",
      "J. B. R. Battat",
      "F. Battisti",
      "J. Bautista",
      "F. Bay",
      "J. L. L. Bazo Alba",
      "J. F. Beacom",
      "E. Bechetoille",
      "B. Behera",
      "E. Belchior",
      "B. Bell",
      "G. Bell",
      "L. Bellantoni",
      "G. Bellettini",
      "V. Bellini",
      "O. Beltramello",
      "A. Belyaev",
      "C. Benitez Montiel",
      "D. Benjamin",
      "F. Bento Neves",
      "J. Berger",
      "S. Berkman",
      "J. Bermudez",
      "J. Bernal",
      "P. Bernardini",
      "A. Bersani",
      "E. Bertholet",
      "E. Bertolini",
      "S. Bertolucci",
      "M. Betancourt",
      "A. Betancur Rodríguez",
      "Y. Bezawada",
      "A. T. Bezerra",
      "A. Bhat",
      "V. Bhatnagar",
      "J. Bhatt",
      "M. Bhattacharjee",
      "S. Bhattacharjee",
      "M. Bhattacharya",
      "S. Bhuller",
      "B. Bhuyan",
      "S. Biagi",
      "J. Bian",
      "K. Biery",
      "B. Bilki",
      "M. Bishai",
      "A. Blake",
      "F. D. Blaszczyk",
      "G. C. Blazey",
      "E. Blucher",
      "B. Bogart",
      "J. Boissevain",
      "S. Bolognesi",
      "T. Bolton",
      "L. Bomben",
      "M. Bonesini",
      "C. Bonilla-Diaz",
      "A. Booth",
      "F. Boran",
      "R. Borges Merlo",
      "N. Bostan",
      "G. Botogoske",
      "B. Bottino",
      "R. Bouet",
      "J. Boza",
      "J. Bracinik",
      "B. Brahma",
      "D. Brailsford",
      "F. Bramati",
      "A. Branca",
      "A. Brandt",
      "J. Bremer",
      "S. J. Brice",
      "V. Brio",
      "C. Brizzolari",
      "C. Bromberg",
      "J. Brooke",
      "A. Bross",
      "G. Brunetti",
      "M. B. Brunetti",
      "N. Buchanan",
      "H. Budd",
      "J. Buergi",
      "A. Bundock",
      "D. Burgardt",
      "S. Butchart",
      "G. Caceres V.",
      "R. Calabrese",
      "R. Calabrese",
      "J. Calcutt",
      "L. Calivers",
      "E. Calvo",
      "A. Caminata",
      "A. F. Camino",
      "W. Campanelli",
      "A. Campani",
      "A. Campos Benitez",
      "N. Canci",
      "J. Capó",
      "I. Caracas",
      "D. Caratelli",
      "D. Carber",
      "J. M. Carceller",
      "G. Carini",
      "B. Carlus",
      "M. F. Carneiro",
      "P. Carniti",
      "I. Caro Terrazas",
      "H. Carranza",
      "N. Carrara",
      "L. Carroll",
      "T. Carroll",
      "A. Carter",
      "E. Casarejos",
      "D. Casazza",
      "J. F. Castaño Forero",
      "F. A. Castaño",
      "C. Castromonte",
      "E. Catano-Mur",
      "C. Cattadori",
      "F. Cavalier",
      "F. Cavanna",
      "S. Centro",
      "G. Cerati",
      "C. Cerna",
      "A. Cervelli",
      "A. Cervera Villanueva",
      "J. Chakrani",
      "M. Chalifour",
      "A. Chappell",
      "A. Chatterjee",
      "B. Chauhan",
      "C. Chavez Barajas",
      "H. Chen",
      "M. Chen",
      "W. C. Chen",
      "Y. Chen",
      "Z. Chen",
      "D. Cherdack",
      "S. S. Chhibra",
      "C. Chi",
      "F. Chiapponi",
      "R. Chirco",
      "N. Chitirasreemadam",
      "K. Cho",
      "S. Choate",
      "G. Choi",
      "D. Chokheli",
      "P. S. Chong",
      "B. Chowdhury",
      "D. Christian",
      "M. Chung",
      "E. Church",
      "M. F. Cicala",
      "M. Cicerchia",
      "V. Cicero",
      "R. Ciolini",
      "P. Clarke",
      "G. Cline",
      "A. G. Cocco",
      "J. A. B. Coelho",
      "A. Cohen",
      "J. Collazo",
      "J. Collot",
      "H. Combs",
      "J. M. Conrad",
      "L. Conti",
      "T. Contreras",
      "M. Convery",
      "K. Conway",
      "S. Copello",
      "P. Cova",
      "C. Cox",
      "L. Cremonesi",
      "J. I. Crespo-Anadón",
      "M. Crisler",
      "E. Cristaldo",
      "J. Crnkovic",
      "G. Crone",
      "R. Cross",
      "A. Cudd",
      "C. Cuesta",
      "Y. Cui",
      "F. Curciarello",
      "D. Cussans",
      "J. Dai",
      "O. Dalager",
      "W. Dallaway",
      "R. D'Amico",
      "H. da Motta",
      "Z. A. Dar",
      "R. Darby",
      "L. Da Silva Peres",
      "Q. David",
      "G. S. Davies",
      "S. Davini",
      "J. Dawson",
      "R. De Aguiar",
      "P. Debbins",
      "M. P. Decowski",
      "A. de Gouvêa",
      "P. C. De Holanda",
      "P. De Jong",
      "P. Del Amo Sanchez",
      "G. De Lauretis",
      "A. Delbart",
      "M. Delgado",
      "A. Dell'Acqua",
      "G. Delle Monache",
      "N. Delmonte",
      "P. De Lurgio",
      "G. De Matteis",
      "J. R. T. de Mello Neto",
      "A. P. A. De Mendonca",
      "D. M. DeMuth",
      "S. Dennis",
      "C. Densham",
      "P. Denton",
      "G. W. Deptuch",
      "A. De Roeck",
      "V. De Romeri",
      "J. P. Detje",
      "J. Devine",
      "K. Dhanmeher",
      "R. Dharmapalan",
      "M. Dias",
      "A. Diaz",
      "J. S. Díaz",
      "F. Díaz",
      "F. Di Capua",
      "A. Di Domenico",
      "S. Di Domizio",
      "S. Di Falco",
      "L. Di Giulio",
      "P. Ding",
      "L. Di Noto",
      "E. Diociaiuti",
      "G. Di Sciascio",
      "V. Di Silvestre",
      "C. Distefano",
      "R. Di Stefano",
      "R. Diurba",
      "M. Diwan",
      "Z. Djurcic",
      "S. Dolan",
      "M. Dolce",
      "M. J. Dolinski",
      "D. Domenici",
      "S. Dominguez",
      "S. Donati",
      "S. Doran",
      "D. Douglas",
      "T. A. Doyle",
      "F. Drielsma",
      "D. Duchesneau",
      "K. Duffy",
      "K. Dugas",
      "P. Dunne",
      "B. Dutta",
      "D. A. Dwyer",
      "A. S. Dyshkant",
      "S. Dytman",
      "M. Eads",
      "A. Earle",
      "S. Edayath",
      "D. Edmunds",
      "J. Eisch",
      "W. Emark",
      "P. Englezos",
      "A. Ereditato",
      "T. Erjavec",
      "C. O. Escobar",
      "J. J. Evans",
      "E. Ewart",
      "A. C. Ezeribe",
      "K. Fahey",
      "A. Falcone",
      "M. Fani'",
      "D. Faragher",
      "C. Farnese",
      "Y. Farzan",
      "J. Felix",
      "Y. Feng",
      "M. Ferreira da Silva",
      "G. Ferry",
      "E. Fialova",
      "L. Fields",
      "P. Filip",
      "A. Filkins",
      "F. Filthaut",
      "G. Fiorillo",
      "M. Fiorini",
      "S. Fogarty",
      "W. Foreman",
      "J. Fowler",
      "J. Franc",
      "K. Francis",
      "D. Franco",
      "J. Freeman",
      "J. Fried",
      "A. Friedland",
      "M. Fucci",
      "S. Fuess",
      "I. K. Furic",
      "K. Furman",
      "A. P. Furmanski",
      "R. Gaba",
      "A. Gabrielli",
      "A. M. Gago",
      "F. Galizzi",
      "H. Gallagher",
      "M. Galli",
      "N. Gallice",
      "V. Galymov",
      "E. Gamberini",
      "T. Gamble",
      "R. Gandhi",
      "S. Ganguly",
      "F. Gao",
      "S. Gao",
      "D. Garcia-Gamez",
      "M. Á. García-Peris",
      "F. Gardim",
      "S. Gardiner",
      "A. Gartman",
      "A. Gauch",
      "P. Gauzzi",
      "S. Gazzana",
      "G. Ge",
      "N. Geffroy",
      "B. Gelli",
      "S. Gent",
      "L. Gerlach",
      "A. Ghosh",
      "T. Giammaria",
      "D. Gibin",
      "I. Gil-Botella",
      "A. Gioiosa",
      "S. Giovannella",
      "A. K. Giri",
      "V. Giusti",
      "D. Gnani",
      "O. Gogota",
      "S. Gollapinni",
      "K. Gollwitzer",
      "R. A. Gomes",
      "L. S. Gomez Fajardo",
      "D. Gonzalez-Diaz",
      "J. Gonzalez-Santome",
      "M. C. Goodman",
      "S. Goswami",
      "C. Gotti",
      "J. Goudeau",
      "C. Grace",
      "E. Gramellini",
      "R. Gran",
      "P. Granger",
      "C. Grant",
      "D. R. Gratieri",
      "G. Grauso",
      "P. Green",
      "S. Greenberg",
      "W. C. Griffith",
      "K. Grzelak",
      "L. Gu",
      "W. Gu",
      "V. Guarino",
      "M. Guarise",
      "R. Guenette",
      "M. Guerzoni",
      "D. Guffanti",
      "A. Guglielmi",
      "F. Y. Guo",
      "A. Gupta",
      "V. Gupta",
      "G. Gurung",
      "D. Gutierrez",
      "P. Guzowski",
      "M. M. Guzzo",
      "S. Gwon",
      "A. Habig",
      "L. Haegel",
      "R. Hafeji",
      "L. Hagaman",
      "A. Hahn",
      "J. Hakenmüller",
      "T. Hamernik",
      "P. Hamilton",
      "J. Hancock",
      "M. Handley",
      "F. Happacher",
      "B. Harris",
      "D. A. Harris",
      "L. Harris",
      "A. L. Hart",
      "J. Hartnell",
      "T. Hartnett",
      "J. Harton",
      "T. Hasegawa",
      "C. M. Hasnip",
      "R. Hatcher",
      "S. Hawkins",
      "J. Hays",
      "M. He",
      "A. Heavey",
      "K. M. Heeger",
      "A. Heindel",
      "J. Heise",
      "P. Hellmuth",
      "L. Henderson",
      "K. Herner",
      "V. Hewes",
      "A. Higuera",
      "A. Himmel",
      "E. Hinkle",
      "L. R. Hirsch",
      "J. Ho",
      "J. Hoefken Zink",
      "J. Hoff",
      "A. Holin",
      "T. Holvey",
      "C. Hong",
      "S. Horiuchi",
      "G. A. Horton-Smith",
      "R. Hosokawa",
      "T. Houdy",
      "B. Howard",
      "R. Howell",
      "I. Hristova",
      "M. S. Hronek",
      "H. Hua",
      "J. Huang",
      "R. G. Huang",
      "X. Huang",
      "Z. Hulcher",
      "A. Hussain",
      "G. Iles",
      "N. Ilic",
      "A. M. Iliescu",
      "R. Illingworth",
      "G. Ingratta",
      "A. Ioannisian",
      "M. Ismerio Oliveira",
      "C. M. Jackson",
      "V. Jain",
      "E. James",
      "W. Jang",
      "B. Jargowsky",
      "D. Jena",
      "I. Jentz",
      "C. Jiang",
      "J. Jiang",
      "A. Jipa",
      "J. H. Jo",
      "F. R. Joaquim",
      "W. Johnson",
      "C. Jollet",
      "R. Jones",
      "N. Jovancevic",
      "M. Judah",
      "C. K. Jung",
      "K. Y. Jung",
      "T. Junk",
      "Y. Jwa",
      "M. Kabirnezhad",
      "A. C. Kaboth",
      "I. Kadenko",
      "O. Kalikulov",
      "D. Kalra",
      "M. Kandemir",
      "S. Kar",
      "G. Karagiorgi",
      "G. Karaman",
      "A. Karcher",
      "Y. Karyotakis",
      "S. P. Kasetti",
      "L. Kashur",
      "A. Kauther",
      "N. Kazaryan",
      "L. Ke",
      "E. Kearns",
      "P. T. Keener",
      "K. J. Kelly",
      "R. Keloth",
      "E. Kemp",
      "O. Kemularia",
      "Y. Kermaidic",
      "W. Ketchum",
      "S. H. Kettell",
      "N. Khan",
      "A. Khvedelidze",
      "D. Kim",
      "J. Kim",
      "M. J. Kim",
      "S. Kim",
      "B. King",
      "M. King",
      "M. Kirby",
      "A. Kish",
      "J. Klein",
      "J. Kleykamp",
      "A. Klustova",
      "T. Kobilarcik",
      "L. Koch",
      "K. Koehler",
      "L. W. Koerner",
      "D. H. Koh",
      "M. Kordosky",
      "T. Kosc",
      "V. A. Kostelecký",
      "I. Kotler",
      "M. Kovalcuk",
      "W. Krah",
      "R. Kralik",
      "M. Kramer",
      "F. Krennrich",
      "T. Kroupova",
      "S. Kubota",
      "M. Kubu",
      "V. A. Kudryavtsev",
      "G. Kufatty",
      "S. Kuhlmann",
      "A. Kumar",
      "J. Kumar",
      "M. Kumar",
      "P. Kumar",
      "P. Kumar",
      "S. Kumaran",
      "J. Kunzmann",
      "V. Kus",
      "T. Kutter",
      "J. Kvasnicka",
      "T. Labree",
      "M. Lachat",
      "T. Lackey",
      "I. Lalău",
      "A. Lambert",
      "B. J. Land",
      "C. E. Lane",
      "N. Lane",
      "K. Lang",
      "T. Langford",
      "M. Langstaff",
      "F. Lanni",
      "J. Larkin",
      "P. Lasorak",
      "D. Last",
      "A. Laundrie",
      "G. Laurenti",
      "E. Lavaut",
      "H. Lay",
      "I. Lazanu",
      "R. LaZur",
      "M. Lazzaroni",
      "S. Leardini",
      "J. Learned",
      "T. LeCompte",
      "G. Lehmann Miotto",
      "R. Lehnert",
      "M. Leitner",
      "H. Lemoine",
      "D. Leon Silverio",
      "L. M. Lepin",
      "J. -Y Li",
      "S. W. Li",
      "Y. Li",
      "R. Lima",
      "C. S. Lin",
      "D. Lindebaum",
      "S. Linden",
      "R. A. Lineros",
      "A. Lister",
      "B. R. Littlejohn",
      "J. Liu",
      "Y. Liu",
      "S. Lockwitz",
      "I. Lomidze",
      "K. Long",
      "J. Lopez",
      "I. López de Rego",
      "N. López-March",
      "J. M. LoSecco",
      "A. Lozano Sanchez",
      "X. -G. Lu",
      "K. B. Luk",
      "X. Luo",
      "E. Luppi",
      "A. A. Machado",
      "P. Machado",
      "C. T. Macias",
      "J. R. Macier",
      "M. MacMahon",
      "S. Magill",
      "C. Magueur",
      "K. Mahn",
      "A. Maio",
      "N. Majeed",
      "A. Major",
      "K. Majumdar",
      "A. Malige",
      "S. Mameli",
      "M. Man",
      "R. C. Mandujano",
      "J. Maneira",
      "S. Manly",
      "K. Manolopoulos",
      "M. Manrique Plata",
      "S. Manthey Corchado",
      "L. Manzanillas-Velez",
      "E. Mao",
      "M. Marchan",
      "A. Marchionni",
      "D. Marfatia",
      "C. Mariani",
      "J. Maricic",
      "F. Marinho",
      "A. D. Marino",
      "T. Markiewicz",
      "F. Das Chagas Marques",
      "M. Marshak",
      "C. M. Marshall",
      "J. Marshall",
      "L. Martina",
      "J. Martín-Albo",
      "D. A. Martinez Caicedo",
      "M. Martinez-Casales",
      "F. Martínez López",
      "S. Martynenko",
      "V. Mascagna",
      "A. Mastbaum",
      "M. Masud",
      "F. Matichard",
      "G. Matteucci",
      "J. Matthews",
      "C. Mauger",
      "N. Mauri",
      "K. Mavrokoridis",
      "I. Mawby",
      "F. Mayhew",
      "T. McAskill",
      "N. McConkey",
      "B. McConnell",
      "K. S. McFarland",
      "C. McGivern",
      "C. McGrew",
      "A. McNab",
      "C. McNulty",
      "J. Mead",
      "L. Meazza",
      "V. C. N. Meddage",
      "A. Medhi",
      "M. Mehmood",
      "B. Mehta",
      "P. Mehta",
      "F. Mei",
      "P. Melas",
      "L. Mellet",
      "T. C. D. Melo",
      "O. Mena",
      "H. Mendez",
      "D. P. Méndez",
      "A. Menegolli",
      "G. Meng",
      "A. C. E. A. Mercuri",
      "A. Meregaglia",
      "M. D. Messier",
      "S. Metallo",
      "W. Metcalf",
      "M. Mewes",
      "H. Meyer",
      "T. Miao",
      "J. Micallef",
      "A. Miccoli",
      "G. Michna",
      "R. Milincic",
      "F. Miller",
      "G. Miller",
      "W. Miller",
      "A. Minotti",
      "L. Miralles Verge",
      "C. Mironov",
      "S. Miscetti",
      "C. S. Mishra",
      "P. Mishra",
      "S. R. Mishra",
      "D. Mladenov",
      "I. Mocioiu",
      "A. Mogan",
      "R. Mohanta",
      "T. A. Mohayai",
      "N. Mokhov",
      "J. Molina",
      "L. Molina Bueno",
      "E. Montagna",
      "A. Montanari",
      "C. Montanari",
      "D. Montanari",
      "D. Montanino",
      "L. M. Montaño Zetina",
      "M. Mooney",
      "A. F. Moor",
      "M. Moore",
      "Z. Moore",
      "D. Moreno",
      "G. Moreno-Granados",
      "O. Moreno-Palacios",
      "L. Morescalchi",
      "C. Morris",
      "E. Motuk",
      "C. A. Moura",
      "G. Mouster",
      "W. Mu",
      "L. Mualem",
      "J. Mueller",
      "M. Muether",
      "F. Muheim",
      "A. Muir",
      "Y. Mukhamejanov",
      "A. Mukhamejanova",
      "M. Mulhearn",
      "D. Munford",
      "L. J. Munteanu",
      "H. Muramatsu",
      "J. Muraz",
      "M. Murphy",
      "T. Murphy",
      "A. Mytilinaki",
      "J. Nachtman",
      "Y. Nagai",
      "S. Nagu",
      "D. Naples",
      "S. Narita",
      "J. Nava",
      "A. Navrer-Agasson",
      "N. Nayak",
      "M. Nebot-Guinot",
      "A. Nehm",
      "J. K. Nelson",
      "O. Neogi",
      "J. Nesbit",
      "M. Nessi",
      "D. Newbold",
      "M. Newcomer",
      "D. Newmark",
      "R. Nichol",
      "F. Nicolas-Arnaldos",
      "A. Nielsen",
      "A. Nikolica",
      "J. Nikolov",
      "E. Niner",
      "X. Ning",
      "K. Nishimura",
      "A. Norman",
      "A. Norrick",
      "P. Novella",
      "A. Nowak",
      "J. A. Nowak",
      "M. Oberling",
      "J. P. Ochoa-Ricoux",
      "S. Oh",
      "S. B. Oh",
      "A. Olivier",
      "T. Olson",
      "Y. Onel",
      "Y. Onishchuk",
      "A. Oranday",
      "M. Osbiston",
      "J. A. Osorio Vélez",
      "L. O'Sullivan",
      "L. Otiniano Ormachea",
      "L. Pagani",
      "G. Palacio",
      "O. Palamara",
      "S. Palestini",
      "J. M. Paley",
      "M. Pallavicini",
      "C. Palomares",
      "S. Pan",
      "M. Panareo",
      "P. Panda",
      "V. Pandey",
      "W. Panduro Vazquez",
      "E. Pantic",
      "V. Paolone",
      "A. Papadopoulou",
      "R. Papaleo",
      "D. Papoulias",
      "S. Paramesvaran",
      "J. Park",
      "S. Parke",
      "S. Parsa",
      "S. Parveen",
      "M. Parvu",
      "D. Pasciuto",
      "S. Pascoli",
      "L. Pasqualini",
      "J. Pasternak",
      "G. Patel",
      "J. L. Paton",
      "C. Patrick",
      "L. Patrizii",
      "R. B. Patterson",
      "T. Patzak",
      "A. Paudel",
      "J. Paul",
      "L. Paulucci",
      "Z. Pavlovic",
      "G. Pawloski",
      "D. Payne",
      "A. Peake",
      "V. Pec",
      "E. Pedreschi",
      "S. J. M. Peeters",
      "W. Pellico",
      "E. Pennacchio",
      "A. Penzo",
      "O. L. G. Peres",
      "L. Pérez-Molina",
      "C. Pernas",
      "J. Perry",
      "D. Pershey",
      "G. Pessina",
      "G. Petrillo",
      "C. Petta",
      "R. Petti",
      "M. Pfaff",
      "V. Pia",
      "G. M. Piacentino",
      "L. Pickering",
      "L. Pierini",
      "F. Pietropaolo",
      "V. L. Pimentel",
      "G. Pinaroli",
      "S. Pincha",
      "J. Pinchault",
      "K. Pitts",
      "P. Plesniak",
      "K. Pletcher",
      "K. Plows",
      "C. Pollack",
      "T. Pollmann",
      "F. Pompa",
      "X. Pons",
      "N. Poonthottathil",
      "V. Popov",
      "F. Poppi",
      "J. Porter",
      "L. G. Porto Paixão",
      "M. Potekhin",
      "M. Pozzato",
      "R. Pradhan",
      "T. Prakash",
      "M. Prest",
      "F. Psihas",
      "D. Pugnere",
      "D. Pullia",
      "X. Qian",
      "J. Queen",
      "J. L. Raaf",
      "M. Rabelhofer",
      "V. Radeka",
      "J. Rademacker",
      "F. Raffaelli",
      "A. Rafique",
      "A. Rahe",
      "S. Rajagopalan",
      "M. Rajaoalisoa",
      "I. Rakhno",
      "L. Rakotondravohitra",
      "M. A. Ralaikoto",
      "L. Ralte",
      "M. A. Ramirez Delgado",
      "B. Ramson",
      "S. S. Randriamanampisoa",
      "A. Rappoldi",
      "G. Raselli",
      "T. Rath",
      "P. Ratoff",
      "R. Ray",
      "H. Razafinime",
      "R. F. Razakamiandra",
      "E. M. Rea",
      "J. S. Real",
      "B. Rebel",
      "R. Rechenmacher",
      "J. Reichenbacher",
      "S. D. Reitzner",
      "E. Renner",
      "S. Repetto",
      "S. Rescia",
      "F. Resnati",
      "C. Reynolds",
      "M. Ribas",
      "S. Riboldi",
      "C. Riccio",
      "G. Riccobene",
      "J. S. Ricol",
      "M. Rigan",
      "A. Rikalo",
      "E. V. Rincón",
      "A. Ritchie-Yates",
      "D. Rivera",
      "A. Robert",
      "A. Roberts",
      "E. Robles",
      "M. Roda",
      "D. Rodas Rodríguez",
      "M. J. O. Rodrigues",
      "J. Rodriguez Rondon",
      "S. Rosauro-Alcaraz",
      "P. Rosier",
      "D. Ross",
      "M. Rossella",
      "M. Ross-Lonergan",
      "T. Rotsy",
      "N. Roy",
      "P. Roy",
      "P. Roy",
      "C. Rubbia",
      "D. Rudik",
      "A. Ruggeri",
      "G. Ruiz Ferreira",
      "K. Rushiya",
      "B. Russell",
      "S. Sacerdoti",
      "N. Saduyev",
      "S. K. Sahoo",
      "N. Sahu",
      "S. Sakhiyev",
      "P. Sala",
      "G. Salmoria",
      "S. Samanta",
      "M. C. Sanchez",
      "A. Sánchez-Castillo",
      "P. Sanchez-Lucas",
      "D. A. Sanders",
      "S. Sanfilippo",
      "D. Santoro",
      "N. Saoulidou",
      "P. Sapienza",
      "I. Sarcevic",
      "I. Sarra",
      "G. Savage",
      "V. Savinov",
      "G. Scanavini",
      "A. Scanu",
      "A. Scaramelli",
      "T. Schefke",
      "H. Schellman",
      "S. Schifano",
      "P. Schlabach",
      "D. Schmitz",
      "A. W. Schneider",
      "K. Scholberg",
      "A. Schroeder",
      "A. Schukraft",
      "B. Schuld",
      "S. Schwartz",
      "A. Segade",
      "E. Segreto",
      "A. Selyunin",
      "C. R. Senise",
      "J. Sensenig",
      "S. H. Seo",
      "D. Seppela",
      "M. H. Shaevitz",
      "P. Shanahan",
      "P. Sharma",
      "R. Kumar",
      "S. Sharma Poudel",
      "K. Shaw",
      "T. Shaw",
      "K. Shchablo",
      "J. Shen",
      "C. Shepherd-Themistocleous",
      "J. Shi",
      "W. Shi",
      "S. Shin",
      "S. Shivakoti",
      "A. Shmakov",
      "I. Shoemaker",
      "D. Shooltz",
      "R. Shrock",
      "M. Siden",
      "J. Silber",
      "L. Simard",
      "J. Sinclair",
      "G. Sinev",
      "Jaydip Singh",
      "J. Singh",
      "L. Singh",
      "P. Singh",
      "V. Singh",
      "S. Singh Chauhan",
      "R. Sipos",
      "C. Sironneau",
      "G. Sirri",
      "K. Siyeon",
      "K. Skarpaas",
      "J. Smedley",
      "J. Smith",
      "P. Smith",
      "J. Smolik",
      "M. Smy",
      "M. Snape",
      "E. L. Snider",
      "P. Snopok",
      "M. Soares Nunes",
      "H. Sobel",
      "M. Soderberg",
      "H. Sogarwal",
      "C. J. Solano Salinas",
      "S. Söldner-Rembold",
      "N. Solomey",
      "V. Solovov",
      "W. E. Sondheim",
      "M. Sorbara",
      "M. Sorel",
      "J. Soto-Oton",
      "A. Sousa",
      "K. Soustruznik",
      "D. Souza Correia",
      "F. Spinella",
      "J. Spitz",
      "N. J. C. Spooner",
      "D. Stalder",
      "M. Stancari",
      "L. Stanco",
      "J. Steenis",
      "R. Stein",
      "H. M. Steiner",
      "A. F. Steklain Lisbôa",
      "J. Stewart",
      "B. Stillwell",
      "J. Stock",
      "T. Stokes",
      "T. Strauss",
      "L. Strigari",
      "A. Stuart",
      "J. G. Suarez",
      "J. Subash",
      "A. Surdo",
      "L. Suter",
      "A. Sutton",
      "K. Sutton",
      "Y. Suvorov",
      "R. Svoboda",
      "S. K. Swain",
      "C. Sweeney",
      "B. Szczerbinska",
      "A. M. Szelc",
      "A. Sztuc",
      "A. Taffara",
      "N. Talukdar",
      "J. Tamara",
      "H. A. Tanaka",
      "S. Tang",
      "N. Taniuchi",
      "A. M. Tapia Casanova",
      "A. Tapper",
      "S. Tariq",
      "E. Tatar",
      "R. Tayloe",
      "A. M. Teklu",
      "K. Tellez Giron Flores",
      "J. Tena Vidal",
      "P. Tennessen",
      "M. Tenti",
      "K. Terao",
      "F. Terranova",
      "G. Testera",
      "T. Thakore",
      "A. Thea",
      "S. Thomas",
      "A. Thompson",
      "C. Thorpe",
      "S. C. Timm",
      "E. Tiras",
      "V. Tishchenko",
      "S. Tiwari",
      "N. Todorović",
      "L. Tomassetti",
      "A. Tonazzo",
      "D. Torbunov",
      "D. Torres Muñoz",
      "M. Torti",
      "M. Tortola",
      "Y. Torun",
      "N. Tosi",
      "D. Totani",
      "M. Toups",
      "C. Touramanis",
      "V. Trabattoni",
      "D. Tran",
      "J. Trevor",
      "E. Triller",
      "S. Trilov",
      "D. Trotta",
      "J. Truchon",
      "D. Truncali",
      "W. H. Trzaska",
      "Y. Tsai",
      "Y. -T. Tsai",
      "Z. Tsamalaidze",
      "K. V. Tsang",
      "N. Tsverava",
      "S. Z. Tu",
      "S. Tufanli",
      "C. Tunnell",
      "M. Tuzi",
      "M. Tzanov",
      "M. A. Uchida",
      "J. Ureña González",
      "J. Urheim",
      "T. Usher",
      "H. Utaegbulam",
      "S. Uzunyan",
      "M. R. Vagins",
      "P. Vahle",
      "G. A. Valdiviesso",
      "E. Valencia",
      "R. Valentim",
      "Z. Vallari",
      "E. Vallazza",
      "J. W. F. Valle",
      "R. Van Berg",
      "D. V. Forero",
      "A. Vannozzi",
      "M. Van Nuland-Troost",
      "F. Varanini",
      "D. Vargas Oliva",
      "N. Vaughan",
      "K. Vaziri",
      "A. Vázquez-Ramos",
      "J. Vega",
      "J. Vences",
      "S. Ventura",
      "A. Verdugo",
      "S. Vergani",
      "M. Verzocchi",
      "K. Vetter",
      "M. Vicenzi",
      "H. Vieira de Souza",
      "C. Vignoli",
      "C. Vilela",
      "E. Villa",
      "S. Viola",
      "B. Viren",
      "G. V. Stenico",
      "R. Vizarreta",
      "A. P. Vizcaya Hernandez",
      "S. Vlachos",
      "G. Vorobyev",
      "Q. Vuong",
      "A. V. Waldron",
      "L. Walker",
      "H. Wallace",
      "M. Wallach",
      "J. Walsh",
      "T. Walton",
      "L. Wan",
      "B. Wang",
      "H. Wang",
      "J. Wang",
      "M. H. L. S. Wang",
      "X. Wang",
      "Y. Wang",
      "D. Warner",
      "L. Warsame",
      "M. O. Wascko",
      "D. Waters",
      "A. Watson",
      "K. Wawrowska",
      "A. Weber",
      "C. M. Weber",
      "M. Weber",
      "H. Wei",
      "A. Weinstein",
      "S. Westerdale",
      "M. Wetstein",
      "K. Whalen",
      "A. J. White",
      "L. H. Whitehead",
      "D. Whittington",
      "F. Wieler",
      "J. Wilhlemi",
      "M. J. Wilking",
      "A. Wilkinson",
      "C. Wilkinson",
      "F. Wilson",
      "R. J. Wilson",
      "P. Winter",
      "J. Wolcott",
      "J. Wolfs",
      "T. Wongjirad",
      "A. Wood",
      "K. Wood",
      "E. Worcester",
      "M. Worcester",
      "K. Wresilo",
      "M. Wright",
      "M. Wrobel",
      "S. Wu",
      "W. Wu",
      "Z. Wu",
      "M. Wurm",
      "J. Wyenberg",
      "B. M. Wynne",
      "Y. Xiao",
      "I. Xiotidis",
      "B. Yaeggy",
      "N. Yahlali",
      "E. Yandel",
      "G. Yang",
      "J. Yang",
      "T. Yang",
      "A. Yankelevich",
      "L. Yates",
      "U. Yevarouskaya",
      "K. Yonehara",
      "T. Young",
      "B. Yu",
      "H. Yu",
      "J. Yu",
      "W. Yuan",
      "M. Zabloudil",
      "R. Zaki",
      "J. Zalesak",
      "L. Zambelli",
      "B. Zamorano",
      "A. Zani",
      "O. Zapata",
      "L. Zazueta",
      "G. P. Zeller",
      "J. Zennamo",
      "J. Zettlemoyer",
      "K. Zeug",
      "C. Zhang",
      "S. Zhang",
      "Y. Zhang",
      "L. Zhao",
      "M. Zhao",
      "E. D. Zimmerman",
      "S. Zucchelli",
      "V. Zutshi",
      "R. Zwaska"
    ],
    "published": "2025-07-11T13:32:28Z",
    "updated": "2025-08-27T07:43:30Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.17691v2",
    "url": "https://arxiv.org/abs/2508.17691v2",
    "pdf_url": "https://arxiv.org/pdf/2508.17691v2.pdf",
    "title": "Design and initial results from the \"Junior\" Levitated Dipole Experiment",
    "abstract": "OpenStar Technologies is a private fusion company exploring the levitated dipole concept for commercial fusion energy production. OpenStar has manufactured a new generation of levitated dipole experiment, called \"Junior\", leveraging recent advances made in high-temperature superconducting magnet technologies. Junior houses a ~5.6 T REBCO high-temperature superconducting magnet in a 5.2 m vacuum chamber, with plasma heating achieved via < 50 kW of electron cyclotron resonance heating power. Importantly, this experiment integrates novel high temperature superconductor power supply technology on board the dipole magnet. Recently OpenStar has completed first experimental campaigns with the Junior experiment, achieving first plasmas in late 2024. Experiments conducted with the full levitated system are planned for 2025. This article provides an overview of the main results from these experiments and details improvements planned for future campaigns.",
    "authors": [
      "Craig S. Chisholm",
      "Thomas Berry",
      "Darren T. Garnier",
      "Rodney A. Badcock",
      "Gabriel Bioletti",
      "Konstantinos Bouloukakis",
      "Emily-Kei Brewerton",
      "Mike A. Buchanan",
      "Pierce J. Burt",
      "Eleanor V. W. Chambers",
      "Kris B. Chappell",
      "Patrick Coulson",
      "Ryan J. Davidson",
      "Josh P. M. Ellingham",
      "Piet Geursen",
      "Kent Hamilton",
      "Raymond Hu",
      "Emily Hunter",
      "Joseph P. Jones",
      "Plaso Kusay",
      "Zvonko Lazić",
      "Bradley Leuw",
      "Matthew Lynch",
      "Ratu Mataira",
      "Mick McCrohon",
      "Les Meadows",
      "Jack R. Morris",
      "Ryan Nowacki",
      "Jack V. Purvis",
      "James H. P. Rice",
      "Michael Rutten",
      "Samuel Schimanski",
      "Aaryan Sharma",
      "Mohammad Siamaki",
      "Alex Simpson",
      "Thomas Simpson",
      "Benjamin Smith",
      "Eric Stiers",
      "Emerson Swanson-Dobbs",
      "Joe Todd",
      "Eddyn O. P. Treacher",
      "Jared D. Tyler",
      "Sriharsha Venturumilli",
      "Hubertus W. Weijers",
      "Theodore Wordsworth",
      "Nancy Zhou"
    ],
    "published": "2025-08-25T05:58:23Z",
    "updated": "2025-08-27T06:43:54Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.19568v1",
    "url": "https://arxiv.org/abs/2508.19568v1",
    "pdf_url": "https://arxiv.org/pdf/2508.19568v1.pdf",
    "title": "Molecular structure, electric property, and scintillation and quenching   of liquid scintillators",
    "abstract": "Liquid scintillators are widely used in particle and nuclear physics. Understanding the scintillation and quenching mechanisms is a fundamental issue in designing a high-light-yield liquid scintillator. In this work, the basic scintillation process for a two-component liquid scintillator is reviewed, highlighting the processes of excitation, ionization, anion-cation recombination, and electric dipole-dipole energy transfer. A molecule's polar group, polarization characteristics, and the corresponding material's dielectric constant are found to be correlated with a liquid scintillator's scintillation efficiency. Polar groups and high relative dielectric constants (permittivity values) can cause severe quenching and should be avoided. The tellurium loading scheme in the liquid scintillator of the SNO+ experiment, TeBD, is discussed. The hydroxyl groups introduce polar structures in the TeBD, and the relative dielectric constant of our reproduced sample is measured to be $17\\pm2$. These discussions explain part of the quenching of the TeBD liquid scintillator.",
    "authors": [
      "Zhe Wang",
      "Ye Liang",
      "Haozhe Sun"
    ],
    "published": "2025-08-27T04:55:20Z",
    "updated": "2025-08-27T04:55:20Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.19434v1",
    "url": "https://arxiv.org/abs/2508.19434v1",
    "pdf_url": "https://arxiv.org/pdf/2508.19434v1.pdf",
    "title": "From Étendue to the Lowest Fundamental SNR: Pixel Étendue   (Optogeometric Factor) Interpreted as Mode Count",
    "abstract": "The optogeometric factor, recently introduced as a pixel level form of \\'etendue, quantifies the spatial angular throughput of a detector element. In this work its interpretation is extended by identifying optogeometric factor with the number of accessible optical modes per pixel. This mode based perspective establishes a direct link between radiometric throughput and quantum photon statistics.   By combining optogeometric factor with the Bose Einstein distribution, an estimate of the lowest achievable signal to noise ratio (SNR) at the pixel level is derived.   Explicit formulas are presented in both scene-based and sensor based forms, showing how the minimal SNR depends on aperture geometry, pixel pitch, f-number, wavelength, and source temperature. This formulation provides a compact and physically transparent benchmark for evaluating imaging sensors against the lowest expected quantum noise limit.",
    "authors": [
      "Jan Sova",
      "Marie Kolaříková"
    ],
    "published": "2025-08-26T21:03:45Z",
    "updated": "2025-08-26T21:03:45Z",
    "categories": [
      "quant-ph",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "quant-ph",
    "doi": "10.5281/zenodo.16954178"
  },
  {
    "arxiv_id": "2211.04553v2",
    "url": "https://arxiv.org/abs/2211.04553v2",
    "pdf_url": "https://arxiv.org/pdf/2211.04553v2.pdf",
    "title": "Effective resistivity in relativistic collisionless plasmoid-mediated   reconnection",
    "abstract": "Magnetic reconnection can power spectacular high-energy astrophysical phenomena by producing non-thermal energy distributions in highly magnetized regions around compact objects. By means of two-dimensional fully kinetic particle-in-cell (PIC) simulations we investigate relativistic collisionless plasmoid-mediated reconnection in magnetically dominated pair plasmas with and without guide field. In X-points, where diverging flows result in a non-diagonal thermal pressure tensor, a finite residence time for particles gives rise to a localized collisionless effective resistivity. Here, for the first time for relativistic reconnection in a fully developed plasmoid chain we identify the mechanisms driving the non-ideal electric field using a full Ohm's law by means of a statistical analysis based on our PIC simulations. We show that the non-ideal electric field is predominantly driven by gradients of nongyrotropic thermal pressures. We propose a kinetic physics motivated non-uniform effective resistivity model, which is negligible on global scales and becomes significant only locally in X-points, that captures the properties of collisionless reconnection with the aim of mimicking its essentials in non-ideal magnetohydrodynamic descriptions. This effective resistivity model provides a viable opportunity to design physically grounded global models for reconnection-powered high-energy emission.",
    "authors": [
      "Sebastiaan Selvi",
      "Oliver Porth",
      "Bart Ripperda",
      "Fabio Bacchini",
      "Lorenzo Sironi",
      "Rony Keppens"
    ],
    "published": "2022-11-08T20:55:07Z",
    "updated": "2025-08-26T20:46:48Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE",
    "doi": "10.3847/1538-4357/acd0b0"
  },
  {
    "arxiv_id": "2506.02506v2",
    "url": "https://arxiv.org/abs/2506.02506v2",
    "pdf_url": "https://arxiv.org/pdf/2506.02506v2.pdf",
    "title": "Classification of Hoyle State Decay Branches in Active Target Time   Projection Chamber using Neural Network",
    "abstract": "A multi-class convolutional neural network (CNN) model has been developed using Keras deep learning library in Python for image-based classification of $^{12}$C Hoyle state decay branches from tracking information, recorded by Saha Active Target Time Projection Chamber, SAT-TPC (currently under development). The nuclear events, produced by the 30 MeV $\\alpha$-particle beam in the SAT-TPC, filled with Ar + CO$_2$ (90:10) gas mixture at atmospheric pressure, have been considered for training and validation of the models. The elastic scattering and Hoyle state sequential and direct decay events in the interaction of $\\alpha$-particle with $^{40}$Ar, $^{12}$C, $^{16}$O nuclei have been generated through Monte-Carlo simulation. The three-dimensional tracks, produced by the scattering and decay products through primary ionization of gaseous medium, have been simulated with Geant4. The primary tracks, distributed on the beam-plane, have been convoluted with electron diffusion, obtained with Magboltz, to produce the final tracking information. The classification performance of the proposed model for different readout segmentation schemes of the SAT-TPC has been discussed.",
    "authors": [
      "Pralay Kumar Das",
      "Nayana Majumdar",
      "Supratik Mukhopadhyay"
    ],
    "published": "2025-06-03T06:35:24Z",
    "updated": "2025-08-26T19:35:23Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex",
      "physics.data-an"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.19220v1",
    "url": "https://arxiv.org/abs/2508.19220v1",
    "pdf_url": "https://arxiv.org/pdf/2508.19220v1.pdf",
    "title": "The 2025 Roadmaps for the US Magnet Development Program",
    "abstract": "The US Physics community completed the Snowmass planning process in 2022, culminating in the HEPAP Particle Physics Project Prioritization Panel (P5) publishing its summary report at the end of 2023. Building on this, the US Magnet Development Program, a national accelerator magnet R&D program established by DOE-OHEP in 2016, has updated its strategic plan to align with the 2023 P5 report, resulting in this roadmap document.",
    "authors": [
      "Lance Cooley",
      "Paolo Ferracin",
      "Steve Gourlay",
      "David Larbalestier",
      "Mark Palmer",
      "Soren Prestemon",
      "George Velev",
      "Giorgio Ambrosio",
      "Diego Arbelaez",
      "Karie Badgley",
      "Lucas Brouwer",
      "Daniel Davis",
      "Jose Luis Fernandez",
      "Vadim Kashikhin",
      "Steven Krave",
      "Maxim Marchevsky",
      "Igor Novitski",
      "Ian Pong",
      "Tengming Shen",
      "Stoyan Stoynev",
      "Reed Teyber",
      "Giorgio Vallone",
      "Xiaorong Wang",
      "Xingchen Xu"
    ],
    "published": "2025-08-26T17:36:52Z",
    "updated": "2025-08-26T17:36:52Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.07086v2",
    "url": "https://arxiv.org/abs/2507.07086v2",
    "pdf_url": "https://arxiv.org/pdf/2507.07086v2.pdf",
    "title": "Lifetime study of the ColdADC for the Deep Underground Neutrino   Experiment",
    "abstract": "ColdADC is a custom ASIC digitizer implemented in 65 nm CMOS technology using specialized techniques for long-term reliability in cryogenic environments. ColdADC was developed for use in the DUNE Far Detector complex, which will consist of four liquid argon time projection chambers. Each contains 17 kilotons liquid argon as the target material in order to measure neutrino oscillations. Approximately 40,000 ColdADC ASICs will be installed for DUNE in the first two large detectors and will be operated at cryogenic temperatures during the experiment without replacement. The lifetime of the ColdADC is a critical parameter affecting the data quality and physics sensitivity of the experiment. A measurement of the lifetime of the ColdADC was carried out, and the results shown in this paper assure orders of magnitude longer lifetime of the ColdADC than the planned operation time of the detectors.",
    "authors": [
      "Wenjie Wu",
      "Benjamin Jargowsky",
      "Yiwen Xiao",
      "Alejandro Yankelevich",
      "Jianming Bian",
      "Cheng-Ju Lin",
      "Tarun Prakash",
      "David Christian"
    ],
    "published": "2025-07-09T17:47:21Z",
    "updated": "2025-08-26T17:06:06Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  }
]