{
  "arxiv_id": "2509.03664v1",
  "url": "https://arxiv.org/abs/2509.03664v1",
  "pdf_url": "https://arxiv.org/pdf/2509.03664v1.pdf",
  "title": "Pressure dependence of magnetron sputtering: 2D-RZ particle-in-cell and   1D fluid modeling",
  "abstract": "We reproduce the consistently-seen experimental voltage versus pressure (V-P) dependence of DC magnetron sputtering (DCMS) with 2D-RZ particle-in-cell (PIC) simulation. Informed by PIC simulation, we develop a steady-state, 1D-axial fluid model of the sheath and presheath that also reproduces this V-P dependence. The V-P dependence is the relationship between the steady-state voltage needed to maintain a constant discharge current and the neutral gas pressure. V-P dependence is fundamental to device performance, but has not previously been reproduced with simulation or satisfactorily explained. In this work, we compare the V-P curve of our simulated device and fluid model with past experiments and then present a theoretical explanation for this V-P dependence. We find that the decrease in voltage with increasing pressure is not due to electron recapture at the cathode. Rather, the constant current dictates a constant global ionization rate, so the voltage decrease compensates for the increase in neutral gas density by lowering the energy of the plasma electrons, which decreases their ionization probability. The PIC simulations also reveal that the presheath and bulk plasma are unaffected by the electron reflection coefficient at the cathode; the only effect of increasing reflection is a reduction in the sheath voltage and width. In addition to the potential structure, we explore how pressure affects the plasma density, particle drifts, and particle energy distributions.",
  "authors": [
    "Joseph G. Theis",
    "Gregory R. Werner",
    "Thomas G. Jenkins",
    "Daniel Main",
    "John R. Cary"
  ],
  "published": "2025-09-03T19:28:35Z",
  "updated": "2025-09-03T19:28:35Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}