{
  "arxiv_id": "2509.04367v1",
  "url": "https://arxiv.org/abs/2509.04367v1",
  "pdf_url": "https://arxiv.org/pdf/2509.04367v1.pdf",
  "title": "A compact, low-power epithermal neutron counter for lunar water   detection",
  "abstract": "The detection and characterization of lunar water are critical for enabling sustainable human and robotic exploration of the Moon. Orbital neutron spectrometers, such as instruments on Lunar Prospector and the Lunar Reconnaissance Orbiter, have revealed hydrogen-rich regions near the poles but are limited by coarse spatial resolution and low counting efficiency. We present a compact, lightweight, and low-power epithermal neutron detector based on boron-coated silicon imagers, designed to probe subsurface hydrogen at decimeter scales from mobile platforms such as lunar rovers. This instrument leverages the high neutron capture cross-section of $^{10}$B to convert epithermal neutrons into detectable $\\alpha$ and $^{7}$Li ions in a fully-depleted silicon imager, providing a unique event topology to identify neutrons while suppressing backgrounds. Monte Carlo simulations demonstrate that a 3 $\\mu$m boron layer achieves optimal neutron detection efficiency, further enhanced with polyethylene moderation to improve sensitivity to the 0.4 eV-500 keV epithermal energy range. For a 10 cm$^2$ active area, the detector achieves sensitivity to H$_2$O weight fractions as low as 0.01 wt % in a 15 minute measurement. This scalable, portable, low-mass design is well-suited for integration into upcoming Artemis and commercial lunar rovers, providing a transformative capability for in-situ resource prospecting and ground-truth validation of orbital measurements.",
  "authors": [
    "Julian Cuevas-Zepeda",
    "Phoenix Alpine",
    "Brenda A. Cervantes-Vergara",
    "Claudio Chavez",
    "Juan Estrada",
    "Erez Etzion",
    "Guillermo Fernandez-Moroni",
    "Nathan Saffold",
    "Miguel Sofo-Haro",
    "Javier Tiffenberg"
  ],
  "published": "2025-09-04T16:26:13Z",
  "updated": "2025-09-04T16:26:13Z",
  "categories": [
    "physics.ins-det",
    "astro-ph.IM"
  ],
  "primary_category": "physics.ins-det"
}