{
  "arxiv_id": "2507.10929v2",
  "url": "https://arxiv.org/abs/2507.10929v2",
  "pdf_url": "https://arxiv.org/pdf/2507.10929v2.pdf",
  "title": "Demonstration of a 1820 channel multiplexer for transition-edge sensor   bolometers",
  "abstract": "The scalability of most transition-edge sensor arrays is limited by the multiplexing technology which combines their signals over a reduced number of wires and amplifiers. In this Letter, we present and demonstrate a multiplexer design optimized for transition-edge sensor bolometers with 1820 sensors per readout unit, a factor of two more than the previous state-of-the-art. The design is optimized for cosmic microwave background imaging applications, and it builds on previous microwave superconducting quantum interference device multiplexers by doubling the available readout bandwidth to the full 4-8 GHz octave. Evaluating the key performance metrics of yield, sensitivity, and crosstalk through laboratory testing, we find an end-to-end operable detector yield of 78%, a typical nearest-neighbor crosstalk amplitude of ~0.4%, and a median white noise level of 83 pA/rtHz due to the multiplexer, corresponding to an estimated contribution of 4% to the total system noise for a ground-based cosmic microwave background telescope. Additionally, we identify a possible path toward reducing resonator loss for future designs with reduced noise. We expect these developments to alleviate the system complexity, cryogenic requirements, and cost of future large arrays of low temperature detectors.",
  "authors": [
    "J. C. Groh",
    "Z. Ahmed",
    "J. Austermann",
    "J. Beall",
    "D. Daniel",
    "S. M. Duff",
    "S. W. Henderson",
    "J. Hubmayr",
    "R. Lew",
    "M. Link",
    "T. J. Lucas",
    "J. A. B. Mates",
    "M. Silva-Feaver",
    "R. Singh",
    "J. Ullom",
    "L. Vale",
    "J. Van Lanen",
    "M. Vissers",
    "C. Yu"
  ],
  "published": "2025-07-15T02:40:12Z",
  "updated": "2025-10-17T22:01:51Z",
  "categories": [
    "physics.ins-det",
    "astro-ph.IM"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.1063/5.0290914"
}