{
  "arxiv_id": "2510.16600v1",
  "url": "https://arxiv.org/abs/2510.16600v1",
  "pdf_url": "https://arxiv.org/pdf/2510.16600v1.pdf",
  "title": "Readout of Microwave Kinetic Inductance Detector (MKID) Arrays for   Habitable Worlds Observatory Using a Polyphase Filterbank Algorithm",
  "abstract": "The Habitable Worlds Observatory (HWO), a nextgeneration ultraviolet/optical/infrared space telescope, will require detector technologies capable of supporting substantially larger pixel-count arrays than those flown on previous missions. Microwave Kinetic Inductance Detectors (MKIDs) provide a scalable solution through microwave multiplexing and have already been demonstrated in balloon-borne instruments using Field-Programmable Gate Arrays (FPGAs) for real-time signal processing. A central element of MKID readout is the Polyphase Filter Bank (PFB) spectrometer, which converts digitized timedomain signals into finely resolved frequency channels for subsequent analysis. To meet the demands for broader bandwidths and higher spectral resolution driven by emerging science goals, efficient FPGA-based implementations of the PFB are essential. This work presents current results from a fixed-point digital design methodology for deploying the PFB architecture on spacequalified FPGAs. The approach emphasizes efficient resource utilization and numerical precision while satisfying stringent performance constraints, enabling scalable, high-resolution spectral processing for future space observatories and remote sensing applications.",
  "authors": [
    "Oketa Basha",
    "Tracee Lynn Jamison-Hooks",
    "Philip Mauskopf",
    "Lynn Miles",
    "Sanetra Newman-Bailey",
    "Abarna Karthikeyan",
    "Mohammad Samad",
    "Mariya Taylor",
    "Sarah E. Kay",
    "Sean Bryan",
    "Devika Band",
    "Thomas Essinger-Hileman",
    "Sumit Dahal",
    "Adrian Sinclair",
    "Caleb Distel"
  ],
  "published": "2025-10-18T17:55:49Z",
  "updated": "2025-10-18T17:55:49Z",
  "categories": [
    "astro-ph.IM",
    "astro-ph.EP",
    "physics.ins-det"
  ],
  "primary_category": "astro-ph.IM"
}