{
  "arxiv_id": "2502.08498v2",
  "url": "https://arxiv.org/abs/2502.08498v2",
  "pdf_url": "https://arxiv.org/pdf/2502.08498v2.pdf",
  "title": "100s TeV/m-Level Particle Accelerators Driven by High-density Electron   Beams in Micro Structured Carbon Nanotube Forest Channel",
  "abstract": "Solid-state materials, such as carbon nanotubes (CNTs), have the potential to support ultra-high accelerating fields in the TV/m range for charged particle acceleration. In this study, we explore the feasibility of using nanostructured CNTs forest to develop plasma-based accelerators at the 100 TeV/m-level, driven by high-density, ultra-relativistic electron beams, using fully three-dimensional particle-in-cell simulations. Two different acceleration mechanisms are proposed and investigated: the surface plasmon leakage field and the bubble wakefield. The leakage field, driven by a relatively low-density beam, can achieve an acceleration field up to TV/m, capable of accelerating both electron and positron beams. In particular, due to the direct acceleration by the driver beam, the positron acceleration is highly efficient with an average acceleration gradient of 2.3 TeV/m. In contrast, the bubble wakefield mechanism allows significantly higher acceleration fields, e.g. beyond $400~\\si{TV/m}$, with a much higher energy transfer efficiency of $66.7\\%$. In principle, electrons can be accelerated to PeV energies over distances of several meters. If the beam density is sufficiently high, the CNT target will be completely blown out, where no accelerating field is generated. Its threshold has been estimated. Two major challenges in these schemes are recognised and investigated. Leveraging the ultra-high energy and charge pumping rate of the driver beam, the nanostructured CNTs also offer significant potential for a wide range of advanced applications. This work represents a promising avenue for the development of ultra-compact, high-energy particle accelerators. We also outline conceptual experiments using currently available facilities, demonstrating that this approach is experimentally accessible.",
  "authors": [
    "Bifeng Lei",
    "Hao Zhang",
    "Cristian Bontoiu",
    "Alexandre Bonatto",
    "Javier Resta-Lopez",
    "Guoxing Xia",
    "Bin Qiao",
    "Carsten Welsch"
  ],
  "published": "2025-02-12T15:33:48Z",
  "updated": "2025-07-29T14:19:47Z",
  "categories": [
    "physics.acc-ph",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.acc-ph"
}