{
  "arxiv_id": "2507.20244v1",
  "url": "https://arxiv.org/abs/2507.20244v1",
  "pdf_url": "https://arxiv.org/pdf/2507.20244v1.pdf",
  "title": "On the interplay between plasma triangularity and micro-tearing   turbulence",
  "abstract": "In this work, we study the interplay between triangularity and micro-tearing turbulence using linear and nonlinear flux tube GENE simulations. We consider scenarios with negative and positive triangularity plasma shaping taken from existing tokamaks (TCV, DIII-D, MAST-U and SMART) and EU-DEMO. The study of all these tokamaks reveals a coherent picture. Negative triangularity geometry is more susceptible to micro-tearing modes (MTM), which, when present, make transport much worse than in positive triangularity. At sufficiently large $\\beta$ (the ratio of plasma pressure over magnetic pressure), magnetic shear and ratio of electron to ion temperature gradient, all the scenarios with negative triangularity are dominated by MTM turbulence. In contrast, the corresponding scenarios with positive triangularity remain dominated by electrostatic turbulence and MTMs are subdominant or stable. We observe that conventional tokamaks usually operate in a parameter space far away from the onset of this MTM-dominated regime in negative triangularity, thus preserving the beneficial effect of negative triangularity on turbulent transport. In contrast, spherical tokamaks operate close to this regime and may ultimately exhibit worse transport at negative triangularity than positive triangularity. We find that lowering the magnetic shear in spherical tokamaks can preserve the beneficial effect of negative triangularity on electrostatic turbulence and prevent strong MTM transport. Finally, linear and nonlinear simulations reveal the reason for stronger MTMs: the magnetic drifts are faster in the negative triangularity geometry.",
  "authors": [
    "Alessandro Balestri",
    "Justin Ball",
    "Stefano Coda"
  ],
  "published": "2025-07-27T12:03:12Z",
  "updated": "2025-07-27T12:03:12Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}