[
  {
    "arxiv_id": "2111.15555v5",
    "url": "https://arxiv.org/abs/2111.15555v5",
    "pdf_url": "https://arxiv.org/pdf/2111.15555v5.pdf",
    "title": "Detuning Properties of RF Phase Modulation in an Electron Storage Ring",
    "abstract": "In electron storage rings, it is possible to increase the bunch length by applying phase modulation to the radio frequency accelerating field by choosing appropriate parameters for the modulation. Such a bunch lengthening effect improves beam parameters such as beam lifetime, which can help us achieve better beam stability. It is well known that the modulation frequency around the double synchrotron frequency is effective in lengthening the bunch. The dependence of bunch lengthening on modulation frequency, the so-called detuning property, has a peak around the double synchrotron frequency with a frequency width that depends on the modulation amplitude. Nonlinear effects due to phase modulation lead to a peak frequency shift in a negative direction from the double synchrotron frequency, accompanied by an asymmetric peak shape. Beam current also affects the properties of the detuning condition of such bunch lengthening. We investigated the detuning property using a theoretical model and systematic measurements at the electron storage ring KARA, and we verified the qualitative agreement between the experiments and the theoretical model. The macro-particle simulations have confirmed the agreement.",
    "authors": [
      "Akira Mochihashi",
      "Sebastian Maier",
      "Edmund Blomley",
      "Marcel Schuh",
      "Erhard Huttel",
      "Tobias Boltz",
      "Benjamin Kehrer",
      "Anke-Susanne Müller",
      "Dmitry Teytelman"
    ],
    "published": "2021-11-30T16:46:04Z",
    "updated": "2025-07-29T13:40:59Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.1103/t3gd-13n4"
  },
  {
    "arxiv_id": "2507.22055v1",
    "url": "https://arxiv.org/abs/2507.22055v1",
    "pdf_url": "https://arxiv.org/pdf/2507.22055v1.pdf",
    "title": "Quantum and Material Effects in Undulator-Based LSW Searches for Dark   Photons",
    "abstract": "The dark photon is one of the simplest extensions of the Standard Model and provides a minimal laboratory for quantum-mechanical phenomena. Light-shining-through-a-wall (LSW) searches often adopt the dark photon-photon oscillation formula as if the sensitivity were independent of the light source, the wall, and the surrounding medium. In this paper, I revisit an LSW experiment whose light source is an undulator and systematically include various quantum effects: finite wave packets, kinematical suppression due to the microscopic structure of the source, and mixing suppression/enhancement in the wall and the air. We find that the resulting sensitivities deviate significantly from those obtained with the na\\\"{i}ve oscillation formula, especially depending on the mass of the dark photon, relevant to reflective index of the medium or walls, there can be resonance effects enhancing the sensitivity significantly. Accounting for these effects, we show that placing a photon detector outside the shielding along the beamline of a synchrotron facility enables an economical, parasitic LSW search for dark photons.",
    "authors": [
      "Wen Yin"
    ],
    "published": "2025-07-29T17:57:09Z",
    "updated": "2025-07-29T17:57:09Z",
    "categories": [
      "hep-ph",
      "hep-ex",
      "physics.acc-ph"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2507.19436v2",
    "url": "https://arxiv.org/abs/2507.19436v2",
    "pdf_url": "https://arxiv.org/pdf/2507.19436v2.pdf",
    "title": "Unveiling the Velocity-Space Signature of Ion Cyclotron Damping Using   Liouville Mapping",
    "abstract": "Ion cyclotron damping is a key mechanism for the dissipation of electromagnetic wave energy in weakly collisional plasmas. This study presents a combined approach using Liouville mapping and the field-particle correlation technique to investigate qualitatively and quantitatively the velocity-space signature of ion cyclotron damping. Liouville mapping offers a computationally efficient way to predict perturbations to the particle velocity distribution function using single-particle trajectories in prescribed electromagnetic fields. One may apply the field-particle correlation technique to these perturbed velocity distributions to reveal the unique velocity-space signatures of the secular energy transfer rate associated with specific wave-particle interactions. We validate this method by reproducing known Landau damping signatures for kinetic Alfv\\'en waves, and then we apply this method to ion cyclotron waves where ion cyclotron damping dominates. The resulting velocity-space signature reveals distinct energization features of ion cyclotron damping : (i) a quadrupolar pattern in the perpendicular $(v_x, v_y)$ plane; and (ii) a localized energization near the $n = 1$ resonant velocity in gyrotropic $(v_\\parallel, v_\\perp)$ velocity-space. The quantitative patterns remain unchanged as the ion plasma beta $\\beta_i$ is varied, ultimately showing minimal $v_\\perp$ dependence on $\\beta_i$ of the velocity-space signature at the $n = 1$ resonant velocity. This work provides a systematic study of how the ion cyclotron damping signature varies with $\\beta_i$, offering a practical foundation to identify ion cyclotron damping using kinetic simulation data or spacecraft data.",
    "authors": [
      "Rui Huang",
      "Gregory G. Howes"
    ],
    "published": "2025-07-25T17:07:15Z",
    "updated": "2025-07-29T17:57:03Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2505.10353v3",
    "url": "https://arxiv.org/abs/2505.10353v3",
    "pdf_url": "https://arxiv.org/pdf/2505.10353v3.pdf",
    "title": "Photomultiplier Requirements and Pre-Calibration for the SABRE South   Liquid Scintillator Veto",
    "abstract": "We present a study of the oil-proof base Hamamatsu R5912 photomultiplier tubes that will be used in the SABRE South linear-alkylbenzene liquid scintillator veto. SABRE South is a dark matter direct detection experiment at the Stawell Underground Physics Laboratory, aiming to test the DAMA/LIBRA dark matter annual modulation signal. We discuss the requirements of the liquid scintillator system and its photomultipliers, outline the methods and analysis used for the characterisation measurements, and results from initial tests. We discuss the impact of these measurements on the performance of the active veto system and explore analysis methods to allow for low threshold operation. Finally, we include results from a small scale liquid scintillator detector prototype used to assess the future performance of pulse shape discrimination in the liquid scintillator veto, and how well accommodated it is by the R5912 PMTs.",
    "authors": [
      "L. J. Milligan",
      "P. Urquijo",
      "E. Barberio",
      "V. U. Bashu",
      "L. J. Bignell",
      "I. Bolognino",
      "S. S. Chhun",
      "F. Dastgiri",
      "T. Fruth",
      "G. Fu",
      "G. C. Hill",
      "Y. Hua",
      "R. S. James",
      "K. Janssens",
      "S. Kapoor",
      "G. J. Lane",
      "K. T. Leaver",
      "P. McGee",
      "L. J. McKie",
      "J. McKenzie",
      "P. C. McNamara",
      "W. J. D. Melbourne",
      "M. Mews",
      "W. H. Ng",
      "K. J. Rule",
      "Z. Slavkovská",
      "O. Stanley",
      "A. E. Stuchbery",
      "B. Suerfu",
      "G. N. Taylor",
      "D. Tempra",
      "T. Tunningley",
      "A. G. Williams",
      "Y. Y. Zhong",
      "M. J. Zurowski"
    ],
    "published": "2025-05-15T14:43:42Z",
    "updated": "2025-07-29T17:13:33Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/07/P07049"
  },
  {
    "arxiv_id": "2502.08498v2",
    "url": "https://arxiv.org/abs/2502.08498v2",
    "pdf_url": "https://arxiv.org/pdf/2502.08498v2.pdf",
    "title": "100s TeV/m-Level Particle Accelerators Driven by High-density Electron   Beams in Micro Structured Carbon Nanotube Forest Channel",
    "abstract": "Solid-state materials, such as carbon nanotubes (CNTs), have the potential to support ultra-high accelerating fields in the TV/m range for charged particle acceleration. In this study, we explore the feasibility of using nanostructured CNTs forest to develop plasma-based accelerators at the 100 TeV/m-level, driven by high-density, ultra-relativistic electron beams, using fully three-dimensional particle-in-cell simulations. Two different acceleration mechanisms are proposed and investigated: the surface plasmon leakage field and the bubble wakefield. The leakage field, driven by a relatively low-density beam, can achieve an acceleration field up to TV/m, capable of accelerating both electron and positron beams. In particular, due to the direct acceleration by the driver beam, the positron acceleration is highly efficient with an average acceleration gradient of 2.3 TeV/m. In contrast, the bubble wakefield mechanism allows significantly higher acceleration fields, e.g. beyond $400~\\si{TV/m}$, with a much higher energy transfer efficiency of $66.7\\%$. In principle, electrons can be accelerated to PeV energies over distances of several meters. If the beam density is sufficiently high, the CNT target will be completely blown out, where no accelerating field is generated. Its threshold has been estimated. Two major challenges in these schemes are recognised and investigated. Leveraging the ultra-high energy and charge pumping rate of the driver beam, the nanostructured CNTs also offer significant potential for a wide range of advanced applications. This work represents a promising avenue for the development of ultra-compact, high-energy particle accelerators. We also outline conceptual experiments using currently available facilities, demonstrating that this approach is experimentally accessible.",
    "authors": [
      "Bifeng Lei",
      "Hao Zhang",
      "Cristian Bontoiu",
      "Alexandre Bonatto",
      "Javier Resta-Lopez",
      "Guoxing Xia",
      "Bin Qiao",
      "Carsten Welsch"
    ],
    "published": "2025-02-12T15:33:48Z",
    "updated": "2025-07-29T14:19:47Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.21657v1",
    "url": "https://arxiv.org/abs/2507.21657v1",
    "pdf_url": "https://arxiv.org/pdf/2507.21657v1.pdf",
    "title": "Direct single-shot phase difference retrieval of two wavelength in   off-axis digital holography",
    "abstract": "A method for direct phase difference reconstruction using single-shot dual-wavelength off-axis digital holography is presented. This approach enables direct imaging of samples with high steps without the need to reconstruct phase images at each individual wavelength. As the dual wavelengths in the reference and object arms pass through a common path in this configuration, single-wavelength arrangements can be applied. Due to the unique capability of the presented method, a sodium-vapor lamp source has been utilized to obtain two closely spaced wavelengths (${\\lambda}1 = 589 nm$ and ${\\lambda}2 = 589.6 nm$), with in a synthetic wavelength of ${\\Lambda} = 578.8 \\mu m$ in the Michelson configuration. To evaluate the validity of the method, the height of an air wedge measured using the proposed approach has been compared with the result obtained from phase unwrapping in the single-wavelength method. The capability of the proposed technique to image samples with high step structures is further demonstrated by measuring a $30 \\mu m$ step height and a glass plate with a thickness of approximately $140 \\mu m$.",
    "authors": [
      "M. Amani",
      "M. Dashtdar"
    ],
    "published": "2025-07-29T10:13:10Z",
    "updated": "2025-07-29T10:13:10Z",
    "categories": [
      "physics.optics",
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2507.21612v1",
    "url": "https://arxiv.org/abs/2507.21612v1",
    "pdf_url": "https://arxiv.org/pdf/2507.21612v1.pdf",
    "title": "First use of large area SiPM matrices coupled with NaI(Tl) scintillating   crystal for low energy dark matter search",
    "abstract": "The long-standing claim of dark matter detection by the DAMA experiment remains a crucial open question in astroparticle physics. A key step towards its independent verification is the development of NaI(Tl)-based detectors with improved sensitivity at low energies. The majority of NaI(Tl)-based experiments rely on conventional photomultiplier tubes (PMTs) as single photon detectors, which present technological limitations in terms of light collection, intrinsic radioactivity and a high noise contribution at keV energies. ASTAROTH is an R&D project developing a NaI(Tl)-based detector where the scintillation light is read out by silicon photomultipliers (SiPM) matrices. SiPMs exhibit high photon detection efficiency, negligible radioactivity, and, most importantly, a dark noise nearly two orders of magnitude lower than PMTs, when operated at cryogenic temperature. To this end, ASTAROTH features a custom-designed cryostat based on a bath of cryogenic fluid, able to safely operate the detector and the read-out electronics down to about 80K. We report the first experimental characterization of 360 g NaI(Tl) detector read out by a large area (5 cm x 5 cm) SiPM matrix. The photoelectron yield obtained with a preliminary configuration is 7.2 photoelectrons/keV, which is rather promising, also in light of several planned developments. The signal-to-noise ratio and the energy threshold attainable with SiPMs is expected to improve the sensitivity for dark matter searches beyond the reach of current-generation PMT-based detectors. This result is the first proof of the viability of this technology and sets a milestone toward the design of future large-scale experiments.",
    "authors": [
      "Edoardo Martinenghi",
      "Valerio Toso",
      "Fabrizio Bruno Armani",
      "Andrea Castoldi",
      "Giuseppe di Carlo",
      "Luca Frontini",
      "Niccolò Gallice",
      "Chiara Guazzoni",
      "Valentino Liberali",
      "Alberto Stabile",
      "Valeria Trabattoni",
      "Andrea Zani",
      "Davide D'Angelo"
    ],
    "published": "2025-07-29T09:10:39Z",
    "updated": "2025-07-29T09:10:39Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2503.17189v3",
    "url": "https://arxiv.org/abs/2503.17189v3",
    "pdf_url": "https://arxiv.org/pdf/2503.17189v3.pdf",
    "title": "Bayesian optimisation of poloidal field coil positions in tokamaks",
    "abstract": "The tokamak is a world-leading concept for producing sustainable energy via magnetically-confined nuclear fusion. Identifying where to position the magnets within a tokamak, specifically the poloidal field (PF) coils, is a design problem which requires balancing a number of competing economic, physical, and engineering objectives and constraints. In this paper, we show that multi-objective Bayesian optimisation (BO), an iterative optimisation technique utilising probabilistic machine learning models, can effectively explore this complex design space and return several optimal PF coil sets. These solutions span the Pareto front, a subset of the objective space that optimally satisfies the specified objective functions. We outline an easy-to-use BO framework and demonstrate that it outperforms alternative optimisation techniques while using significantly fewer computational resources. Our results show that BO is a promising technique for fusion design problems that rely on computationally demanding high-fidelity simulations.",
    "authors": [
      "Timothy Nunn",
      "Kamran Pentland",
      "Vignesh Gopakumar",
      "James Buchanan"
    ],
    "published": "2025-03-21T14:35:29Z",
    "updated": "2025-07-29T08:48:26Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1063/5.0272085"
  },
  {
    "arxiv_id": "2507.21525v1",
    "url": "https://arxiv.org/abs/2507.21525v1",
    "pdf_url": "https://arxiv.org/pdf/2507.21525v1.pdf",
    "title": "Weak decaying collective-excitation approximation for Yukawa   one-component plasmas",
    "abstract": "In this paper, the theoretical model of weak decaying collective excitations characteristic of many-particle systems with long-range interaction potentials is developed using the example of one-component strongly coupled Yukawa plasmas. The proposed model is based on the self-consistent relaxation theory of collective dynamics and covers spatial scales from extended hydrodynamics to scales related to the mean interparticle distance. The theoretical model reproduces the dynamic structure factor spectra and the corresponding dispersion characteristics in agreement with molecular dynamics simulation data without using any fitting parameters. In the limit of small wave numbers, the correspondence of the proposed theoretical model with the damped harmonic oscillator model is established. The simple analytical expression for the sound attenuation coefficient of strongly coupled Yukawa plasmas is obtained.",
    "authors": [
      "Ilnaz I. Fairushin",
      "Anatolii V. Mokshin"
    ],
    "published": "2025-07-29T06:26:11Z",
    "updated": "2025-07-29T06:26:11Z",
    "categories": [
      "physics.plasm-ph",
      "cond-mat.dis-nn",
      "cond-mat.soft",
      "cond-mat.stat-mech",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1103/wzbf-p11r"
  },
  {
    "arxiv_id": "2507.21365v1",
    "url": "https://arxiv.org/abs/2507.21365v1",
    "pdf_url": "https://arxiv.org/pdf/2507.21365v1.pdf",
    "title": "Electrostatic toroidal bender and its fringe fields",
    "abstract": "I describe the COSY-Infinity code GES that we have developed and used in various forms in the past 30 years to calculate maps to third order through electrostatic bend elements. It has been a mystery that COSY's in-built procedures ES, ESP and ECL disagreed with our own code. This note is intended to clarify the issue.",
    "authors": [
      "Rick Baartman"
    ],
    "published": "2025-07-28T22:18:48Z",
    "updated": "2025-07-28T22:18:48Z",
    "categories": [
      "physics.acc-ph",
      "hep-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.21052v1",
    "url": "https://arxiv.org/abs/2507.21052v1",
    "pdf_url": "https://arxiv.org/pdf/2507.21052v1.pdf",
    "title": "Monolithic optoelectronic circuit design for on-chip terahertz   applications",
    "abstract": "We demonstrate a monolithic coplanar stripline platform for on-chip terahertz (THz) generation, transmission, and detection, addressing key challenges of mode purity, bandwidth, and referencing. Capacitive coupling of the photoconductive generator switch enforces pure odd-mode propagation, increases THz field strength, and extends the operational frequency range, achieving 0.05-1.4 THz. Our architecture enables fully monolithic fabrication with amorphous silicon switches, in situ field referencing, and galvanic isolation between generation and detection. Finite-element simulations and experiments confirm that suppressing parasitic modes improves signal integrity, providing a robust platform for high-fidelity THz spectroscopy, ultrafast electronics, and nanoscale quantum materials research.",
    "authors": [
      "Kateryna Kusyak",
      "Benedikt Schulte",
      "Toru Matsuyama",
      "Gunda Kipp",
      "Hope M. Bretscher",
      "Matthew W. Day",
      "Guido Meier",
      "Alexander M. Potts",
      "James W. McIver"
    ],
    "published": "2025-07-28T17:59:55Z",
    "updated": "2025-07-28T17:59:55Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics",
    "doi": "10.1063/5.0278183"
  },
  {
    "arxiv_id": "2506.05553v2",
    "url": "https://arxiv.org/abs/2506.05553v2",
    "pdf_url": "https://arxiv.org/pdf/2506.05553v2.pdf",
    "title": "Investigation of Neoclassical Tearing Mode Detection by ECE Radiometry   in Tokamak Reactors via Asymptotic Matching Techniques",
    "abstract": "The TJ toroidal tearing mode code is used to make realistic predictions of the electron cyclotron emission (ECE) signals generated by neoclassical tearing modes (NTMs) in an ITER-like tokamak plasma equilibrium. In the so-called \"outer region'', which comprises the bulk of the plasma, helical harmonics of the magnetic field with the same toroidal mode number as the NTM, but different poloidal mode numbers, are coupled together by the Shafranov shifts and shaping of the equilibrium magnetic flux-surfaces. In the \"inner region'', which is localized in the vicinity of the NTM rational surface, helical harmonics whose poloidal and toroidal mode numbers are in the same ratio as those of the NTM are coupled together nonlinearly to produce a radially asymmetric magnetic island chain. The solutions in the inner and outer regions are asymptotically matched to one another. The asymptotic matching process determines the overall magnetic structure of the NTM, as well as the global perturbation to the electron temperature caused by the mode. A simulated ECE diagnostic is developed that accounts for the downshifting and broadening in frequency of the signal due to the relativistic mass increase of the emitting electrons.",
    "authors": [
      "R. Fitzpatrick"
    ],
    "published": "2025-06-05T20:01:51Z",
    "updated": "2025-07-28T17:28:20Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.21003v1",
    "url": "https://arxiv.org/abs/2507.21003v1",
    "pdf_url": "https://arxiv.org/pdf/2507.21003v1.pdf",
    "title": "Optimizing Particle Transport for Enhanced Confinement in   Quasi-Isodynamic Stellarators",
    "abstract": "Despite significant advances in reducing turbulent heat losses, modern quasi-isodynamic (QI) stellarators -- such as Stellaris -- continue to suffer from poor particle confinement, which fundamentally limits their overall performance. Using gyrokinetic simulations within the GENE--Tango framework, we identify suppressed inward thermodiffusion, caused by unfavorable magnetic geometry, as the primary cause. To overcome this limitation, we design a new configuration with a reduced mirror ratio, which enhances the contribution of passing electrons to the inward particle flux. This facilitates the formation of strongly peaked density profiles, suppresses turbulence, and leads to a substantial improvement in confinement. Our optimized configuration achieves nearly a twofold increase in energy confinement compared to Stellaris, highlighting the crucial role of optimizing particle transport in next-generation stellarator designs.",
    "authors": [
      "A. Bañón Navarro",
      "A. Di Siena",
      "F. Jenko",
      "A. Merlo",
      "E. Laude"
    ],
    "published": "2025-07-28T17:17:39Z",
    "updated": "2025-07-28T17:17:39Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.20948v1",
    "url": "https://arxiv.org/abs/2507.20948v1",
    "pdf_url": "https://arxiv.org/pdf/2507.20948v1.pdf",
    "title": "Enhanced beam transport via space charge mitigation in a multistage   accelerator for fusion plasma diagnostics",
    "abstract": "Efficient transport of high-current negative ion beams is critical for accurate plasma potential diagnostics using heavy-ion beam probe (HIBP) systems in magnetically confined fusion plasmas. However, strong space-charge effects often degrade transport efficiency, particularly for heavy ions such as Au-. In this study, we demonstrate a substantial improvement in beam transport by introducing an electrostatic lens effect through optimized voltage allocation in a multistage acceleration system. Numerical simulations using IGUN, supported by experiments with the LHD-HIBP system, show that this approach effectively suppresses space-charge-induced beam divergence and loss. Without requiring mechanical modifications to the beamline, the optimized configuration enables a 2-3 fold increase in Au-beam current injected into the tandem accelerator. Consequently, plasma potential measurements were extended to higher-density plasmas, reaching line-averaged electron densities up to $1.75\\times 10^{19}$ m$^{-3}$ with improved signal-to-noise ratio. This technique offers a compact, practical, and highly effective solution for transporting high-current heavy-ion beams under space-charge-dominated conditions. Beyond its impact on plasma diagnostics, the method is broadly applicable to a wide range of accelerator systems, including those used in scientific and industrial applications where high-intensity beam transport is required.",
    "authors": [
      "M. Nishiura",
      "K. Nakamura",
      "K. Ueda",
      "A. Shimizu",
      "H. Takubo",
      "M. Kanda",
      "T. Ido",
      "M. Okamura"
    ],
    "published": "2025-07-28T15:59:15Z",
    "updated": "2025-07-28T15:59:15Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2412.15823v2",
    "url": "https://arxiv.org/abs/2412.15823v2",
    "pdf_url": "https://arxiv.org/pdf/2412.15823v2.pdf",
    "title": "3D non-linear MHD simulations of core density collapse event in LHD   plasma",
    "abstract": "A new three-dimensional, non-linear Magnetohydrodynamics (MHD) model has been extended in MIPS code, incorporating parallel heat diffusivity. The model has been benchmarked against the former MHD model used in MIPS code. A preliminary study of the core density collapse event (CDC) observed in the Large Helical Device (LHD) plasma has been performed using the developed model. The equilibrium has been constructed using HINT code for a typical super dense core discharge in LHD, with vacuum magnetic axis configuration RaxV = 3.85 m and magnetic axis beta \\beta0 = 4% plasma. This configuration corresponds to a plasma with a steep pressure gradient and strong Shafranov shift, which makes the plasma potentially unstable in the LHD. The model shows preliminary characteristics of the CDC event. The plasma is destabilized by high-n ballooning modes in the low-field side region during the linear regime, eventually leading to the collapse of the pressure and density profiles, together with the stochastization of the magnetic field and a shift to low-n modes centered at the core of the plasma after the non-linear coupling at the relaxation regime.",
    "authors": [
      "A. Civit",
      "S. Futatani",
      "Y. Suzuki",
      "J. Dominguez-Palacios"
    ],
    "published": "2024-12-20T12:04:21Z",
    "updated": "2025-07-28T15:20:53Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.20895v1",
    "url": "https://arxiv.org/abs/2507.20895v1",
    "pdf_url": "https://arxiv.org/pdf/2507.20895v1.pdf",
    "title": "Rapid-cycling ReBCO dipole magnet concept for muon acceleration",
    "abstract": "We present a concept of the rapid-cycling 1.7 T ReBCO magnet for 1 to 10 kT/s ramping range as required for muon acceleration in a future muon collider presently under study. This approach is based on the 6 kA CORC-like cable constructed with 12 superconducting ReBCO tapes of 2 mm width. Based on theoretical prediction there is a linear scaling of the ReBCO cable hysteresis loss with the crossing magnetic field possibly generating power loss independent of the magnetic field ramping speed. This feature makes this ReBCO cable suitable for the construction of rapid-cycling magnets. In this work we outline the design of a dipole magnet for 1.7 T gap magnetic field and discuss the helium coolant parameters for the minimal electric power.",
    "authors": [
      "Henryk Piekarz",
      "Simon Otten",
      "Anna Kario",
      "Herman ten Kate"
    ],
    "published": "2025-07-28T14:47:45Z",
    "updated": "2025-07-28T14:47:45Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.20771v1",
    "url": "https://arxiv.org/abs/2507.20771v1",
    "pdf_url": "https://arxiv.org/pdf/2507.20771v1.pdf",
    "title": "Plasma pressure response to non-inductive current drive in axisymmetric   visco-resistive MHD steady-states",
    "abstract": "We investigate self-consistent, steady-state axisymmetric solutions of incompressible tokamak plasma using a visco-resistive magnetohydrodynamic model. A key contribution of this work is the formulation of Poisson's equation that governs the pressure profile. Our analysis reveals that the current modeling fails to produce realistic pressure levels. To overcome this limitation, we introduce additional non-inductive current drives, akin to those generated by neutral beam injection or radio frequency heating, modeled as modifications to the toroidal current. Numerical simulations validate our enhanced model, showing significant improvements in pressure profile characteristics. In the cases examined, the effect of these current drives on the velocity profiles is moderate, except when the non-inductive current drives induce reversals in the total toroidal current density, leading to non-nested flux surfaces with internal separatrices.",
    "authors": [
      "Anna Krupka",
      "Marie-Christine Firpo"
    ],
    "published": "2025-07-28T12:34:17Z",
    "updated": "2025-07-28T12:34:17Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.20756v1",
    "url": "https://arxiv.org/abs/2507.20756v1",
    "pdf_url": "https://arxiv.org/pdf/2507.20756v1.pdf",
    "title": "Measurements of enriched 155 Gd and 157Gd converters with the NMX   detector on the nTOF EAR2 beam line at CERN",
    "abstract": "The detectors for the NMX instrument at the European Spallation Source (ESS) in Lund use natural Gd as the neutron converter. In 2024, beam time was obtained at the neutron time-of flight experiment (nTOF) at CERN to study the feasibility of an upgrade to enriched Gd. A 10 x 10 cm^2 prototype of the NMX detector was equipped with two enriched Gd samples (157Gd and 155Gd) that were attached with copper tape to the natural Gd cathode of the detector. Three sets of measurements were taken, with the beam focused on either the natural Gd, the 157Gd, or the 155Gd samples. Using the time-of-flight technique with the subsequent conversion of time-of-flight into energy, the resonant region between 1 eV and 200 eV of the 157Gd and 155Gd cross sections was studied. The peaks in the resonant region were clearly visible, having higher ADC values in the ADC spectrum. Additionally, the resonant peaks had a larger number of counts per energy bin. In the thermal neutron energy range, the count rate at the center of the beam was measured for natural Gd, 157Gd, and 155Gd. Enriched 157Gd showed an efficiency that was between 60 - 180% higher, compared to natural Gd, for neutron wavelengths between 0.8 A and 1.8 A. The measured 60 % increase in efficiency at 1.8 A is lower than expected from simulations (100 %) and previous measurements with solid state detectors (80 %). Gamma background detection, bad focusing, and saturation effects most likely explain this deviation. An upgrade of the natural Gd converter to enriched 157Gd would thus lead to an efficiency increase of at least 60 %. The measurements presented in this paper are the first successful time-of-flight measurements with the NMX detector prototype and the ESS VMM readout.",
    "authors": [
      "D. Pfeiffer",
      "F. M. Brunbauer",
      "I. R. Fehse",
      "A. D. Finke",
      "K. Fissum",
      "K. J. Floethner",
      "D. Janssens",
      "M. Lisowska",
      "H. Muller",
      "E. Oksanen",
      "E. Oliveri",
      "L. Ropelewski",
      "A. Rusu",
      "J. Samarati",
      "L. Scharenberg",
      "M. van Stenis",
      "R. Veenhof",
      "N. Zavaritskaya"
    ],
    "published": "2025-07-28T12:10:42Z",
    "updated": "2025-07-28T12:10:42Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.20748v1",
    "url": "https://arxiv.org/abs/2507.20748v1",
    "pdf_url": "https://arxiv.org/pdf/2507.20748v1.pdf",
    "title": "Two-dimensional spatially resolved measurements of helium metastable   densities by tunable diode laser absorption spectroscopy in atmospheric   pressure RF plasma jets",
    "abstract": "Helium metastable species play a critical role in sustaining radio-frequency (RF) driven micro atmospheric pressure plasma jets through Penning ionization and for the generation of reactive oxygen and nitrogen species (RONS). Their densities are typically measured using tunable diode laser absorption spectroscopy (TDLAS). Most spatially resolved TDLAS approaches rely on mechanical scanning of a narrow laser beam across the plasma, which is time-consuming and limits spatial resolution. In this work, we present an advanced two-dimensional (2D) TDLAS method that enables direct spatial mapping of helium metastable densities without the need for mechanical scanning. A rotating optical diffuser is employed to suppress speckle interference and generate uniform illumination across the plasma region. The absorption profile is captured using a short-wavelength infrared camera equipped with a telecentric lens, achieving high spatial resolution (approximately 10 {\\mu}m) across the entire field of view. This approach significantly enhances both data quality and acquisition speed. The improved 2D TDLAS system is applied to measure helium metastable densities in plasma jets with structured electrodes driven by different tailored voltage waveforms. The results show very good qualitative agreement with fluid simulations and previously reported experimental data.",
    "authors": [
      "David A Schulenberg",
      "Xiao-Kun Wang",
      "Mate Vass",
      "Ihor Korolov",
      "Thomas Mussenbrock",
      "Julian Schulze"
    ],
    "published": "2025-07-28T11:57:42Z",
    "updated": "2025-07-28T11:57:42Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2503.05674v5",
    "url": "https://arxiv.org/abs/2503.05674v5",
    "pdf_url": "https://arxiv.org/pdf/2503.05674v5.pdf",
    "title": "Multiple solutions to the static forward free-boundary Grad-Shafranov   problem on MAST-U",
    "abstract": "The Grad-Shafranov (GS) equation is a nonlinear elliptic partial differential equation that governs the ideal magnetohydrodynamic equilibrium of a tokamak plasma. Previous studies have demonstrated the existence of multiple solutions to the GS equation when solved in idealistic geometries with simplified plasma current density profiles and boundary conditions. Until now, the question of whether multiple equilibria might exist in real-world tokamak geometries with more complex current density profiles and integral free-boundary conditions (commonly used in production-level equilibrium codes) has remained unanswered. In this work, we discover multiple solutions to the static forward free-boundary GS problem in the MAST-U tokamak geometry using the validated evolutive equilibrium solver FreeGSNKE and the deflated continuation algorithm. By varying the plasma current, current density profile coefficients, or coil currents in the GS equation, we identify and characterise distinct equilibrium solutions, including both deeply and more shallowly confined plasma states. We suggest that the existence of even more equilibria is likely prohibited by the restrictive nature of the integral free-boundary condition, which globally couples poloidal fluxes on the computational boundary with those on the interior. We conclude by discussing the implications of these findings for wider equilibrium modelling and emphasise the need to explore whether multiple solutions are present in other equilibrium codes and tokamaks, as well as their potential impact on downstream simulations that rely on GS equilibria.",
    "authors": [
      "K. Pentland",
      "N. C. Amorisco",
      "P. E. Farrell",
      "C. J. Ham"
    ],
    "published": "2025-03-07T18:34:41Z",
    "updated": "2025-07-28T11:41:05Z",
    "categories": [
      "physics.plasm-ph",
      "cs.NA",
      "math.NA"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.20691v1",
    "url": "https://arxiv.org/abs/2507.20691v1",
    "pdf_url": "https://arxiv.org/pdf/2507.20691v1.pdf",
    "title": "Numerical Studies for EuPRAXIA@SPARC\\_LAB Plasma Beam Driven Working   Point",
    "abstract": "The realization of a plasma based user facility on the model of EuPRAXIA@SPARC\\_LAB requires to design a working point for the operation that allows to get an high accelerating gradient preserving a low emittance and low energy spread of the accelerated beam. Such beam is supposed to pilot a soft x-ray free electron laser with a wavelength of 2-\\SI{4}{\\nano\\meter}. In this work several simulation scans are presented, varying at the same time the plasma density and driver-witness separation in order to show that, in a realistic working point for EuPRAXIA@SPARC\\_LAB, it is possible to find an ideal compromise for a witness with a peak current >1kA that allows to preserve the energy spread of the core (80\\% of the charge) below 0.1\\%, while maintaining an accelerating gradient inside the plasma module around of 1 GV/m. The study is completed with a parametric analysis with the aim of establishing the stability requirements of the RF working point and the plasma channel in order to preserve the energy jitter at the same level of the energy spread.",
    "authors": [
      "Stefano Romeo",
      "Alessio Del Dotto",
      "Massimo Ferrario",
      "Anna Giribono",
      "Andrea Renato Rossi",
      "Gilles Jacopo Silvi",
      "Cristina Vaccarezza"
    ],
    "published": "2025-07-28T10:21:09Z",
    "updated": "2025-07-28T10:21:09Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1088/1742-6596/2687/4/042008"
  },
  {
    "arxiv_id": "2507.20663v1",
    "url": "https://arxiv.org/abs/2507.20663v1",
    "pdf_url": "https://arxiv.org/pdf/2507.20663v1.pdf",
    "title": "Terahertz frequency conversion at plasma-induced time boundary",
    "abstract": "We report on the frequency conversions of terahertz (THz) waves at ultrafast time boundaries created via femtosecond laser-induced air-to-plasma phase transitions. Our combined experimental and theoretical approach reveals that the abrupt change in refractive index at the ultrafast time boundaries drives both the red and blue shifts over the broadband THz spectrum due to the dispersive plasma, with distinctive amplitude variations. The present study contrasts these effects with those from spatial boundaries, highlighting the superior efficacy of temporal manipulations for spectral engineering. These findings not only deepen the understanding of light-matter interactions in time-varying media but also pave the way for innovative applications in THz technology and lay the groundwork for the observation of temporal reflection effects, photonic time crystals, and spatio-temporally modulated matter.",
    "authors": [
      "Yindong Huang",
      "Bin Zhou",
      "Aijun Xuan",
      "Mingxin Gao",
      "Jing Lou",
      "Xiaomin Qu",
      "Zengxiu Zhao",
      "Ce Shang",
      "Xuchen Wang",
      "Chao Chang",
      "Viktar Asadchy"
    ],
    "published": "2025-07-28T09:35:01Z",
    "updated": "2025-07-28T09:35:01Z",
    "categories": [
      "physics.optics",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2507.20626v1",
    "url": "https://arxiv.org/abs/2507.20626v1",
    "pdf_url": "https://arxiv.org/pdf/2507.20626v1.pdf",
    "title": "Characterizing ion-acoustic shock wave collisions in Martian   multicomponent plasma environments",
    "abstract": "We present theoretical investigation of colliding ion-acoustic (IA) shock waves in Martian multicomponent plasmas consisting of hydrogen ($H^+$), oxygen ($O^+$) and oxygen molecule ($O_2^+$) ions, including background superthermal electrons (modeled by a $\\kappa$-(kappa) distribution function). A set of Burgers' equations is obtained by adopting a modified Poincar\\'e-Lighthill-Kuo (PLK) perturbation method to describe the head-on-collision dynamics of dissipative nonlinear IA wave structures. We have estimated the spatio-temporal scales using parameters typically observed in the Martian atmosphere by the MAVEN spacecraft, for which shock waves are theoretically expected to undergo mutual collisions in the multicomponent plasma. The effects of head-on collisions on the electrostatic potential profiles arising from one-fold and two-fold IA shock interactions are explored. Our numerical analysis reveals that the collision leads to a noticeable broadening of the shock structures with the enhancement of kinematic viscosity.",
    "authors": [
      "Jayshree Mondal",
      "Prasanta Chatterjee",
      "Laxmikanta Mandi",
      "Biswajit Sahu"
    ],
    "published": "2025-07-28T08:39:04Z",
    "updated": "2025-07-28T08:39:04Z",
    "categories": [
      "physics.plasm-ph",
      "math-ph",
      "math.MP"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.20523v1",
    "url": "https://arxiv.org/abs/2507.20523v1",
    "pdf_url": "https://arxiv.org/pdf/2507.20523v1.pdf",
    "title": "Multi-Machine Scaling Laws for Fuel and Impurity Puffing Rates   Sufficient for Detachment Access: a Systematic Review of Magnetic Confinement   Fusion Devices",
    "abstract": "From a database of 457 experimental and numerical data from 32 machines among solid-walled tokamaks, stellarators and linear plasma devices, we derive physics-informed multi-machine scaling laws predictive of fuel and impurity puffing rates sufficient to access plasma detachment -- leading candidate for a reactor-relevant solution to the open issue of plasma-wall interaction. Validation of our laws in up to 40 plasmas in low- and high-confinement mode also featuring advanced configurations demonstrates accuracy within a factor 1.5 in up to 50% of the instances, and within a factor 2 on average. Divertor volume alone is found to correlate to fuelling. The addition of plasma opaqueness leads to the empirically-calibrated law $\\Gamma_{\\text{D}}\\propto [n_{\\text{sep}}\\times a\\times(S_{\\text{div}}/V_{\\text{div}})^{-1.5}]^{1.05}$ valid across all toroidal devices. Its simplification to $\\Gamma_{\\text{D}}^{\\text{HDL}}\\propto 0.43\\times a^{1.58}\\times\\lambda_q^{-0.89}$ avoids a dependence on $n_{\\text{sep}}$ and bears intrinsic significance provided by the H/L density limit and the power fall-off length. Non-linearities of the impurity dynamics manifest in the seeding rate -- which the present work identifies both a generalised formula for, and the Greenwald-Eich-Scarabosio simplification $\\Gamma_{\\text{Z}}^{\\text{GES}}\\propto a^{1.51}\\times\\lambda_q^{-0.27}$. Similar relationships are defined for stellarators, closely following the mainstream but without providing data for validation -- which should stimulate further investigations. In the era of nuclear fusion reactor design, these results find immediate applicability in informing reactor fuel cycle design and edge plasma modelling. More generally, this study demonstrates that physics-based laws able to relate detachment to engineering actuators exist, and pave the way for analytical models bridging to the true inputs of experimental operation.",
    "authors": [
      "M. Moscheni",
      "A. Herrmann",
      "R. Kembleton",
      "M. Kryjak",
      "S. Lazerson",
      "F. Levi",
      "M. Siccinio",
      "P. Staniec",
      "T. Giegerich",
      "C. Tantos",
      "the Gauss Fusion GmbH Team"
    ],
    "published": "2025-07-28T05:11:10Z",
    "updated": "2025-07-28T05:11:10Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.20493v1",
    "url": "https://arxiv.org/abs/2507.20493v1",
    "pdf_url": "https://arxiv.org/pdf/2507.20493v1.pdf",
    "title": "Twinac: A Universal Framework for Virtual Accelerator Controls",
    "abstract": "We propose a universal framework for a system of virtual accelerator controls (Twinac), a standard toolkit for research institutions to design, maintain, and use a real-time, end-to-end \"digital twin\" of their particle accelerator facility. This virtual counterpart will mirror any physical accelerator to provide (1) predictive maintenance; (2) surveillance of hidden environmental factors, such as seasonal temperature variations, which could impact performance of power supplies, magnets, and other instruments; and (3) a capability to model novel ways to operate the accelerator without risking equipment damage. Twinac is envisioned as accelerator facility agnostic, allowing institutions to share and reuse myriad simulation approaches (analytics-based, A.I.-driven, or combinations of the like) across facilities. The Twinac system lays the groundwork for a collaborative network of institutions to maintain and update this shared virtual accelerator technology.",
    "authors": [
      "Tia Miceli",
      "Abhishek Pathak",
      "Aaron Sauers"
    ],
    "published": "2025-07-28T03:03:19Z",
    "updated": "2025-07-28T03:03:19Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.20413v1",
    "url": "https://arxiv.org/abs/2507.20413v1",
    "pdf_url": "https://arxiv.org/pdf/2507.20413v1.pdf",
    "title": "Electromagnetic Noise Characterization and Suppression in Low-Field MRI   Systems",
    "abstract": "Purpose: Low-field MRI systems operate at single MHz-range frequencies, where signal losses are primarily dominated by thermal noise from the radio-frequency (RF) receive coils. Achieving operation close to this limit is essential for maximizing imaging performance and signal-to-noise ratio (SNR). However, electromagnetic interference (EMI) from cabling, electronics, and patient loading often degrades system performance. Our goal is to develop and validate a practical protocol that guides users in identifying and suppressing electromagnetic noise in low-field MRI systems, enabling operation near the thermal noise limit.   Methods: We present a systematic, stepwise methodology that includes diagnostic measurements, hardware isolation strategies, and good practices for cabling and shielding. Each step is validated with corresponding noise measurements under increasingly complex system configurations, both unloaded and with a human subject present.   Results: Noise levels were monitored through the incremental assembly of a low-field MRI system, revealing key sources of EMI and quantifying their impact. Final configurations achieved noise within 1.5x the theoretical thermal bound with a subject in the scanner. Image reconstructions illustrate the direct relationship between system noise and image quality.   Conclusion: The proposed protocol enables low-field MRI systems to operate close to fundamental noise limits in realistic conditions. The framework also provides actionable guidance for the integration of additional system components, such as gradient drivers and automatic tuning networks, without compromising SNR.",
    "authors": [
      "Teresa Guallart-Naval",
      "Joseba Alonso"
    ],
    "published": "2025-07-27T21:13:27Z",
    "updated": "2025-07-27T21:13:27Z",
    "categories": [
      "physics.med-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.med-ph"
  },
  {
    "arxiv_id": "2507.20248v1",
    "url": "https://arxiv.org/abs/2507.20248v1",
    "pdf_url": "https://arxiv.org/pdf/2507.20248v1.pdf",
    "title": "Hybrid fluid-kinetic cylindrical equilibria with axial background   magnetic field",
    "abstract": "Self-consistent, one-dimensional quasineutral screw-pinch equilibria are constructed within a hybrid model that couples fluid electrons with kinetic ions governed by the Vlasov equation. The equilibria depend on the radial coordinate perpendicular to the cylindrical axis and include an axial background magnetic field. Adopting a three-parameter ion distribution function depending on the energy and the canonical momenta conjugate to the two ignorable coordinates, the problem is reduced to a set of four quasilinear ODEs which are solved numerically. Both static equilibria and equilibria with macroscopic ion sheared velocities are obtained. The pressure of the electron fluid is isotropic and the electron contribution to the current density is parallel to the magnetic field, while the kinetic ions are associated with a non-gyrotropic pressure tensor. By means of the solutions the various equilibrium quantities are calculated and the impact of the free parameters on the equilibrium characteristics is examined.",
    "authors": [
      "D. A. Kaltsas",
      "A. I. Kuiroukidis",
      "G. N. Throumoulopoulos"
    ],
    "published": "2025-07-27T12:25:23Z",
    "updated": "2025-07-27T12:25:23Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.16368v2",
    "url": "https://arxiv.org/abs/2506.16368v2",
    "pdf_url": "https://arxiv.org/pdf/2506.16368v2.pdf",
    "title": "Detection of twisted radiowaves with Rydberg atoms",
    "abstract": "The dynamics of the outer electron in an alkali atom in the presence of structured electromagnetic waves is described. The interaction of the alkali Rydberg atom with twisted radiowaves is considered. The two schemes for Rydberg-atom based detector of twisted radiowaves are proposed. According to the theoretical model for these detectors, they can record a source of twisted radiowaves with power down to several nW. The first scheme of the detector employs the nondipole transitions between Rydberg states induced by twisted radio photons. The second scheme involves the array of Rydberg-atom based antennas, every antenna measuring the dipole transitions excited by plane radiowaves comprising the twisted one.",
    "authors": [
      "P. O. Kazinski",
      "P. S. Korolev",
      "V. A. Ryakin"
    ],
    "published": "2025-06-19T14:42:53Z",
    "updated": "2025-07-27T12:04:45Z",
    "categories": [
      "physics.atom-ph",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2507.20244v1",
    "url": "https://arxiv.org/abs/2507.20244v1",
    "pdf_url": "https://arxiv.org/pdf/2507.20244v1.pdf",
    "title": "On the interplay between plasma triangularity and micro-tearing   turbulence",
    "abstract": "In this work, we study the interplay between triangularity and micro-tearing turbulence using linear and nonlinear flux tube GENE simulations. We consider scenarios with negative and positive triangularity plasma shaping taken from existing tokamaks (TCV, DIII-D, MAST-U and SMART) and EU-DEMO. The study of all these tokamaks reveals a coherent picture. Negative triangularity geometry is more susceptible to micro-tearing modes (MTM), which, when present, make transport much worse than in positive triangularity. At sufficiently large $\\beta$ (the ratio of plasma pressure over magnetic pressure), magnetic shear and ratio of electron to ion temperature gradient, all the scenarios with negative triangularity are dominated by MTM turbulence. In contrast, the corresponding scenarios with positive triangularity remain dominated by electrostatic turbulence and MTMs are subdominant or stable. We observe that conventional tokamaks usually operate in a parameter space far away from the onset of this MTM-dominated regime in negative triangularity, thus preserving the beneficial effect of negative triangularity on turbulent transport. In contrast, spherical tokamaks operate close to this regime and may ultimately exhibit worse transport at negative triangularity than positive triangularity. We find that lowering the magnetic shear in spherical tokamaks can preserve the beneficial effect of negative triangularity on electrostatic turbulence and prevent strong MTM transport. Finally, linear and nonlinear simulations reveal the reason for stronger MTMs: the magnetic drifts are faster in the negative triangularity geometry.",
    "authors": [
      "Alessandro Balestri",
      "Justin Ball",
      "Stefano Coda"
    ],
    "published": "2025-07-27T12:03:12Z",
    "updated": "2025-07-27T12:03:12Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.20242v1",
    "url": "https://arxiv.org/abs/2507.20242v1",
    "pdf_url": "https://arxiv.org/pdf/2507.20242v1.pdf",
    "title": "Radiation of twisted photons in elliptical multifrequency undulators",
    "abstract": "The theory of radiation of twisted photons in elliptical multifrequency undulators is developed. It is shown that helical multifrequency undulators can be employed as a bright and versatile source of photons in the states that are superpositions of the modes with definite projection of total angular momentum (TAM), amplitude, and relative phase. All these parameters of the state are readily controlled by the undulator design. The explicit expression for the amplitude of radiation of a twisted photon from a charged particle in the multifrequency undulator is derived. The energy spectrum of radiation and the selection rules for the TAM projection of radiated photons are described. The symmetry properties of the spectrum with respect to the TAM projection are established. The interpretation to the energy spectrum and to the selection rules is given in terms of virtual photons mediating between the charged particle and the undulator. The results obtained are also applicable to radiation of twisted photons produced by ultrarelativistic charged particles moving in plane multifrequency electromagnetic waves.",
    "authors": [
      "O. V. Bogdanov",
      "S. V. Bragin",
      "P. O. Kazinski",
      "V. A. Ryakin"
    ],
    "published": "2025-07-27T11:53:02Z",
    "updated": "2025-07-27T11:53:02Z",
    "categories": [
      "physics.acc-ph",
      "physics.optics"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2505.10669v3",
    "url": "https://arxiv.org/abs/2505.10669v3",
    "pdf_url": "https://arxiv.org/pdf/2505.10669v3.pdf",
    "title": "Enhanced energy gain through higher-order resonances during direct laser   acceleration with superluminal phase velocity",
    "abstract": "Ultra-high intensity laser-plasma interactions can produce ultra-relativistic electrons via direct laser acceleration, assisted by quasi-static plasma magnetic and electric fields. These fields transversely confine electron motion and induce betatron oscillations. The net energy gain is strongly influenced by the interplay between two frequencies: the betatron frequency and the frequency of laser field oscillations experienced by the electron. Prior work has shown that energy gain is enabled by a resonance between the betatron oscillations and the oscillations of the laser field. In particular, higher-order resonances occur when the laser field completes multiple cycles during one betatron oscillation, allowing additional regimes of energy transfer beyond the fundamental (betatron) resonance. In this work, we demonstrate that such resonances become particularly effective when the laser's phase velocity is superluminal. Although the two frequencies generally evolve differently with increasing electron energy, which leads to detuning, a superluminal phase velocity introduces a non-monotonic frequency ratio with a global minimum. This minimum allows sustained frequency matching over a broad energy range, thereby enabling enhanced energy gain. As the phase velocity increases, the betatron resonance becomes ineffective due to premature frequency detuning. At the same time, higher-order resonances become increasingly effective, emerging as the dominant mechanisms for enhanced energy gain in this regime of direct laser acceleration.",
    "authors": [
      "I-Lin Yeh",
      "Kavin Tangtartharakul",
      "Rohan Bhakta",
      "Hongmei Tang",
      "Louise Willingale",
      "Alexey Arefiev"
    ],
    "published": "2025-05-15T19:19:00Z",
    "updated": "2025-07-26T14:44:45Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2409.07015v4",
    "url": "https://arxiv.org/abs/2409.07015v4",
    "pdf_url": "https://arxiv.org/pdf/2409.07015v4.pdf",
    "title": "A Unified Phenomenology of Ion Heating in Low-$β$ Plasmas:   Test-Particle Simulations",
    "abstract": "We argue that stochastic and quasi-linear ion heating, often viewed as distinct processes in low-$\\beta$ collisionless plasmas, are the far limits of a continuum controlled by nonlinear broadening of turbulent fluctuations, and thus by the normalized cross helicity. We propose a simple empirical formula that captures both regimes, generalizing that commonly used to describe stochastic heating. Simulations of test ions interacting with turbulence confirm our scalings across a wide range of different ion and turbulence properties, including with a steep ion-kinetic transition range as seen in the solar wind. Our results provide a unified framework for understanding ion heating processes across diverse astrophysical environments from black-hole accretion disks to the solar corona, also providing a compact and versatile subgrid model for larger-scale simulations.",
    "authors": [
      "Zade Johnston",
      "Jonathan Squire",
      "Romain Meyrand"
    ],
    "published": "2024-09-11T05:15:36Z",
    "updated": "2025-07-26T07:09:18Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR",
    "doi": "10.1103/rp85-hhg4"
  },
  {
    "arxiv_id": "2505.00288v4",
    "url": "https://arxiv.org/abs/2505.00288v4",
    "pdf_url": "https://arxiv.org/pdf/2505.00288v4.pdf",
    "title": "Nyström Type Exponential Integrators for Strongly Magnetized Charged   Particle Dynamics",
    "abstract": "Calculating the dynamics of charged particles in electromagnetic fields (i.e. the particle pushing problem) is one of the most computationally intensive components of particle-in-cell (PIC) methods for plasma physics simulations. This task is especially challenging when the plasma is strongly magnetized, since in this case the particle motion consists of a wide range of temporal scales from highly oscillatory fast gyromotion to slow macroscopic behavior and the resulting numerical model is very stiff. Current state-of-the-art time integrators used to simulate particle motion have limitations given the severe numerical stiffness of the problem and more efficient methods are of interest. Recently, exponential integrators have been proposed as a promising new approach for these simulations and shown to offer computational advantages over commonly used schemes. Exponential methods can solve linear problems exactly and are $A$-stable. In this paper, the standard exponential algorithms framework is extended to derive Nystr\\\"om-type exponential methods that integrate the Newtonian equations of motion as a second-order differential equation. Specific Nystr\\\"om-type schemes of second and third orders are derived and applied to strongly magnetized particle pushing problems. Numerical experiments are presented to demonstrate that the Nystr\\\"om-type exponential integrators can provide significant improvement in computational efficiency over the standard exponential methods.",
    "authors": [
      "Tri P. Nguyen",
      "Ilon Joseph",
      "Mayya Tokman"
    ],
    "published": "2025-05-01T04:22:49Z",
    "updated": "2025-07-26T06:35:47Z",
    "categories": [
      "physics.comp-ph",
      "cs.NA",
      "math.NA",
      "physics.plasm-ph",
      "65L04, 78A35"
    ],
    "primary_category": "physics.comp-ph"
  },
  {
    "arxiv_id": "2507.19729v1",
    "url": "https://arxiv.org/abs/2507.19729v1",
    "pdf_url": "https://arxiv.org/pdf/2507.19729v1.pdf",
    "title": "Semi-Implicit Continuum Kinetic Modeling of Weakly Collisional Parallel   Transport in a Magnetic Mirror",
    "abstract": "We present implicit-explicit (IMEX) kinetic simulations of weakly collisional parallel plasma transport in magnetic mirror configurations using the continuum code \\textsc{COGENT}. The numerical scheme employs a Jacobian-free Newton--Krylov method with algebraic multigrid preconditioning to overcome the severe time-step limitations imposed by strong mirror forces in fully explicit schemes. Applied to parameters relevant to the WHAM mirror experiment, the IMEX approach enables time steps up to $2.5 \\times 10^4$ times larger than those permitted by explicit methods, resulting in a 2500x speedup in 1D--2V simulations of parallel transport with kinetic ions and Boltzmann electrons. Additionally, a reduced bounce-averaged model for a square mirror is implemented to support the computationally intensive fully kinetic simulations. The bounce-averaged formulation is used to evaluate the numerical convergence of the velocity-space discretization algorithms and to assess the role of the collision model by comparing simulations employing the nonlinear Fokker--Planck and the simplified Lenard--Bernstein--Dougherty collision operators.",
    "authors": [
      "M. Dorf",
      "M. Dorr",
      "V. Geyko",
      "D. Ghosh",
      "M. Umansky",
      "J. Angus"
    ],
    "published": "2025-07-26T01:04:25Z",
    "updated": "2025-07-26T01:04:25Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.19668v1",
    "url": "https://arxiv.org/abs/2507.19668v1",
    "pdf_url": "https://arxiv.org/pdf/2507.19668v1.pdf",
    "title": "Exploring the fusion power plant design space: comparative analysis of   positive and negative triangularity tokamaks through optimization",
    "abstract": "The optimal configuration choice between positive triangularity (PT) and negative triangularity (NT) tokamaks for fusion power plants hinges on navigating different operational constraints rather than achieving specific plasma performance metrics. This study presents a systematic comparison using constrained multi-objective optimization with the integrated FUsion Synthesis Engine (FUSE) framework. Over 200,000 integrated design evaluations were performed exploring the trade-offs between capital cost minimization and operational reliability (maximizing $q_{95}$) while satisfying engineering constraints including 250 $\\pm$ 50 MW net electric power, tritium breeding ratio $>$1.1, power exhaust limits and an hour flattop time. Both configurations achieve similar cost-performance Pareto fronts through contrasting design philosophies. PT, while demonstrating resilience to pedestal degradation (compensating for up to 40% reduction), are constrained to larger machines ($R_0$ $>$ 6.5 m) by the narrow operational window between L-H threshold requirements and the research-established power exhaust limit ($P_{sol}/R$ $<$ 15 MW/m). This forces optimization through comparatively reduced magnetic field ($\\sim$8T). NT configurations exploit their freedom from these constraints to access compact, high-field designs ($R_0 \\sim 5.5$ m, $B_0$ $>$ 12 T), creating natural synergy with advancing HTS technology. Sensitivity analyses reveal that PT's economic viability depends critically on uncertainties in L-H threshold scaling and power handling limits. Notably, a 50% variation in either could eliminate viable designs or enable access to the compact design space. These results suggest configuration selection should be risk-informed: PT offers the lowest-cost path when operational constraints can be confidently predicted, while NT is robust to large variations in constraints and physics uncertainties.",
    "authors": [
      "T. Slendebroek",
      "A. O. Nelson",
      "O. M. Meneghini",
      "G. Dose",
      "A. G. Ghiozzi",
      "J. Harvey",
      "B. C. Lyons",
      "J. McClenaghan",
      "T. F. Neiser",
      "D. B. Weisberg",
      "M. G. Yoo",
      "E. Bursch",
      "C. Holland"
    ],
    "published": "2025-07-25T20:46:43Z",
    "updated": "2025-07-25T20:46:43Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.19425v1",
    "url": "https://arxiv.org/abs/2507.19425v1",
    "pdf_url": "https://arxiv.org/pdf/2507.19425v1.pdf",
    "title": "Machine Learning Based Efficiency Calculator (MaLBEC) for Nuclear Fusion   Diagnostics",
    "abstract": "Diagnostics are critical for commercial and research fusion machines, since measuring and understanding plasma features is important to sustaining fusion reactions. The neutron flux (and therefore fusion power) can be indirectly calculated using neutron activation analyses, where potentially large numbers of activation foils are placed in the neutron flux, and delayed gammas from key reactions are measured via gamma spectrometry. In gamma spectrometry, absolute efficiency forms part of the activity calculation, and equals to the ratio of the total number of photons detected to the number emitted by a radioactive sample. Hence, it is imperative that they are calculated efficiently and accurately. This paper presents a novel digital efficiency calculation algorithm, the Machine Learning Based Efficiency Calculator (MaLBEC), that uses state-of-the-art supervised machine learning techniques to calculate efficiency values of a given sample, from only four inputs. In this paper, the performance of the MaLBEC is demonstrated with a fusion sample and compares the values to a traditional efficiency calculation method, Monte Carlo N-Particle (MCNP). The efficiencies from the MaLBEC were within an average 5\\% of the ones produced by MCNP, but with an exceptional reduction in computation time of 99.96\\%. When the efficiency values from both methods were used in the activity calculation, the MaLBEC was within 3\\% of the MCNP results.",
    "authors": [
      "Kimberley Lennon",
      "Chantal Shand",
      "Gemma Wilson",
      "Robin Smith"
    ],
    "published": "2025-07-25T16:44:46Z",
    "updated": "2025-07-25T16:44:46Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.19393v1",
    "url": "https://arxiv.org/abs/2507.19393v1",
    "pdf_url": "https://arxiv.org/pdf/2507.19393v1.pdf",
    "title": "Perturbative model for the saturation of energetic-particle-driven modes   limited by self-generated zonal modes",
    "abstract": "We present a simplified approach enforcing energy conservation to incorporate the effects of zonal modes alongside wave-particle nonlinearities in the determination of the saturation amplitude. The model assumes that the zonal perturbations grow at a rate twice that of the original (pump) wave, consistent with a beat-driven (or force-driven) generation mechanism. The evolution and saturation of the mode amplitude are investigated both analytically and numerically within our reduced model assumptions, in both the collisionless and scattering-dominated regimes. These studies underscore the crucial role of sources and sinks in accurately capturing the impact and the role of beat-driven zonal perturbations on mode evolution. In the realistic case of saturation set by sources and sinks, we discuss the role of a finite amplitude zonal mode in reducing microturbulent particle scattering, thus limiting the energy source for the resonant mode. We then discuss comparisons between the model predictions and simulation results. The model reproduces key features observed in gyrokinetic simulations as the reduction in saturated mode amplitude and the onset of wave-wave nonlinear effects as functions of mode growth rate and amplitude. Thanks to its simplicity, it can be readily implemented into codes based on reduced models, thereby improving their predictive capability for strongly driven instabilities.",
    "authors": [
      "Tommaso Barberis",
      "Vinícius N. Duarte",
      "Eamon J. Hartigan-O'Connor",
      "Nikolai N. Gorelenkov"
    ],
    "published": "2025-07-25T15:56:40Z",
    "updated": "2025-07-25T15:56:40Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2412.14962v2",
    "url": "https://arxiv.org/abs/2412.14962v2",
    "pdf_url": "https://arxiv.org/pdf/2412.14962v2.pdf",
    "title": "ThinCurr: An open-source 3D thin-wall eddy current modeling code for the   analysis of large-scale systems of conducting structures",
    "abstract": "In this paper we present a new thin-wall eddy current modeling code, ThinCurr, for studying inductively-coupled currents in 3D conducting structures -- with primary application focused on the interaction between currents flowing in coils, plasma, and conducting structures of magnetically-confined plasma devices. The code utilizes a boundary finite element method on an unstructured, triangular grid to accurately capture device structures. The new code, part of the broader Open FUSION Toolkit, is open-source and designed for ease of use without sacrificing capability and speed through a combination of Python, Fortran, and C/C++ components. Scalability to large models is enabled through use of hierarchical off-diagonal low-rank compression of the inductance matrix, which is otherwise dense. Ease of handling large models of complicated geometry is further supported by automatic determination of supplemental elements through a greedy homology approach. A detailed description of the numerical methods of the code and verification of the implementation of those methods using cross-code comparisons against the VALEN code and Ansys commercial analysis software is shown.",
    "authors": [
      "Christopher Hansen",
      "Alexander Battey",
      "Anson Braun",
      "Sander Miller",
      "Michael Lagieski",
      "Ian Stewart",
      "Ryan Sweeney",
      "Carlos Paz-Soldan"
    ],
    "published": "2024-12-19T15:42:52Z",
    "updated": "2025-07-25T15:19:25Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1016/j.cpc.2025.109713"
  },
  {
    "arxiv_id": "2507.19352v1",
    "url": "https://arxiv.org/abs/2507.19352v1",
    "pdf_url": "https://arxiv.org/pdf/2507.19352v1.pdf",
    "title": "Tensor Networks for Liquids in Heterogeneous Systems",
    "abstract": "Many-body correlations in strongly coupled liquids and plasmas are critical for many applications in nanofluids, biology, and fusion-related plasma physics, but their description in fully heterogeneous environments remains challenging due to the high-dimensional equations involved. Recently, tensor network decompositions have emerged as powerful tools for tackling such equations by reducing memory usage and computational complexity. In this paper, we solve for equilibrium density and density-density correlation functions of liquids in confined heterogeneous environments using tensor network methods. We demonstrate that these functions admit high compression when their lengthscale dependence is encoded via quantized tensor trains or when their spatial-coordinate dependence is represented in standard tensor-train format, but not with respect to their dependence on distinct particle coordinates.",
    "authors": [
      "Zachary A. Johnson",
      "Luciano G. Silvestri",
      "Pierson Guthrey",
      "Michael S. Murillo"
    ],
    "published": "2025-07-25T15:02:14Z",
    "updated": "2025-07-25T15:02:14Z",
    "categories": [
      "physics.comp-ph",
      "cond-mat.stat-mech",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.comp-ph"
  },
  {
    "arxiv_id": "2507.19337v1",
    "url": "https://arxiv.org/abs/2507.19337v1",
    "pdf_url": "https://arxiv.org/pdf/2507.19337v1.pdf",
    "title": "Multiscale Modeling of Positive Corona Discharges",
    "abstract": "In the field of corona discharges, the complex chemical mechanisms inside the ionization region have prompted the development of simplified models to replicate the macroscopic effects of ion generation, thereby reducing the computational effort, especially in two and three dimensional simulations. We propose a methodology that allows to replace the ionization process with appropriate boundary conditions used by a corona model solving the drift region. We refer to this model as macro-scale, since it does not solve the ionization region. Our approach begins with one dimensional computations in cylindrical coordinates of the whole discharge, where we include a fairly detailed model of the plasma region near the emitter. We refer to this model as full-scale, since all the spatial scales, including the ionization region, are properly taken into account. From these results it is possible to establish boundary conditions for macroscopic simulations. The idea is that, given an emitter radius, the boundary conditions can be used for a variety of geometries that leverage on that emitter as active electrode. Our results agree with available experimental data for positive corona discharges in different configurations and with simplified analytical models from literature.",
    "authors": [
      "Giuseppe Caliò",
      "Fabio Ragazzi",
      "Arturo Popoli",
      "Andrea Cristofolini",
      "Lorenzo Valdettaro",
      "Carlo De Falco",
      "Paolo Barbante"
    ],
    "published": "2025-07-25T14:46:19Z",
    "updated": "2025-07-25T14:46:19Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.18497v2",
    "url": "https://arxiv.org/abs/2507.18497v2",
    "pdf_url": "https://arxiv.org/pdf/2507.18497v2.pdf",
    "title": "Characterization of Lateral Amorphous Selenium Photodetectors for   Low-Photon and VUV Detection at Cryogenic Temperatures",
    "abstract": "The performance of amorphous selenium (a-Se) as a cryogenic photodetector material is evaluated through a series of experiments using laterally structured devices operated in a custom optical test stand. These studies investigate the response of a-Se detectors to low-photon fluxes at high electric fields near avalanche conditions, the linearity of the photoconductive response over a wide dynamic range and the direct detection of narrowband 130 nm vacuum ultraviolet (VUV) illumination. At 87 K, matched-filter analysis shows reliable single-shot detection with efficiencies greater than or equal to 80 percent and area under the curve (AUC) greater than or equal to 0.85 using as few as approximately 6800 incident 401 nm photons, corresponding to approximately 3400 photons within field-active regions after accounting for geometric constraints. Measurements are performed at cryogenic temperatures using calibrated photon fluxes derived from a silicon photomultiplier reference and a characterized optical filter stack. Additional experiments using a tellurium-doped a-Se (a-SeTe) device explore the material's behavior under identical test conditions and demonstrate that avalanche is achievable in a-SeTe at cryogenic temperatures. The results demonstrate reproducible low-noise operation, VUV sensitivity and field-dependent gain behavior in a lateral a-Se architecture, representing the first reported observation of avalanche multiplication in laterally structured a-Se and a-SeTe devices at cryogenic temperatures. These findings support the potential integration of laterally structured a-Se devices into next-generation pixelated liquid-argon time projection chambers (TPCs) requiring scalable, high-field-compatible photon detection systems.",
    "authors": [
      "M. Rooks",
      "S. Abbaszadeh",
      "J. Asaadi",
      "V. A. Chirayath",
      "M. Febbraro",
      "M. Á. García-Peris",
      "E. Gramellini",
      "K. Hellier",
      "B. Sudarsan",
      "I. Tzoka"
    ],
    "published": "2025-07-24T15:10:57Z",
    "updated": "2025-07-25T14:40:30Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.19319v1",
    "url": "https://arxiv.org/abs/2507.19319v1",
    "pdf_url": "https://arxiv.org/pdf/2507.19319v1.pdf",
    "title": "Enhanced performance in quasi-isodynamic max-$J$ stellarators with a   turbulent particle pinch",
    "abstract": "Recent stellarator reactor designs demonstrate mostly outward turbulent particle transport, which, without advanced fueling technology, inhibits the formation of density gradients needed for confinement. We introduce ``SQuID-$\\tau$'', a self-fueling quasi-isodynamic stellarator capable of sustaining density peaking through inward particle transport caused by turbulence. Temperature and density profile predictions based on high-fidelity gyrokinetic simulations demonstrate enhanced performance, significantly relaxing constraints on the size and magnetic field strength for reactor designs.",
    "authors": [
      "G. G. Plunk",
      "A. G. Goodman",
      "P. Xanthopoulos",
      "P. Costello",
      "H. M. Smith",
      "K. Aleynikova",
      "C. D. Beidler",
      "M. Drevlak",
      "P. Helander"
    ],
    "published": "2025-07-25T14:32:43Z",
    "updated": "2025-07-25T14:32:43Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.19311v1",
    "url": "https://arxiv.org/abs/2507.19311v1",
    "pdf_url": "https://arxiv.org/pdf/2507.19311v1.pdf",
    "title": "Design and Mechanical Integration of Scintillation Modules for   SUB-Millicharge ExperimenT (SUBMET)",
    "abstract": "We present a detailed description of the detector design for the SUB-Millicharge ExperimenT (SUBMET), developed to search for millicharged particles. The experiment probes a largely unexplored region of the charge-mass parameter space, focusing on particles with mass $m_\\chi < 1.6~\\textrm{GeV}/c^2$ and electric charge $Q < 10^{-3}e$. The detector has been optimized to achieve high sensitivity to interactions of such particles while maintaining effective discrimination against background events. We provide a comprehensive overview of the key detector components, including scintillation modules, photomultiplier tubes, and the mechanical support structure.",
    "authors": [
      "Claudio Campagnari",
      "Sungwoong Cho",
      "Suyong Choi",
      "Seokju Chung",
      "Matthew Citron",
      "Albert De Roeck",
      "Martin Gastal",
      "Seungkyu Ha",
      "Andy Haas",
      "Christopher Scott Hill",
      "Byeong Jin Hong",
      "Haeyun Hwang",
      "Insung Hwang",
      "Hoyong Jeong",
      "Hyunki Moon",
      "Jayashri Padmanaban",
      "Ryan Schmitz",
      "Changhyun Seo",
      "David Stuart",
      "Eunil Won",
      "Jae Hyeok Yoo",
      "Jinseok Yoo",
      "Ayman Youssef",
      "Ahmad Zaraket",
      "Haitham Zaraket"
    ],
    "published": "2025-07-25T14:26:52Z",
    "updated": "2025-07-25T14:26:52Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2502.12044v2",
    "url": "https://arxiv.org/abs/2502.12044v2",
    "pdf_url": "https://arxiv.org/pdf/2502.12044v2.pdf",
    "title": "A versatile experimental method to measure the traction forces at   interfaces",
    "abstract": "Measurement of surface forces, including cohesive forces and contact forces, is critical for understanding and controlling interactions at interfaces to optimize the interfacial performance of applications. The objective of this paper is to introduce a general in-situ method that enables the measurement of 3D micron-scale displacements and corresponding force distribution at interfaces in dry or wet environment. Stereo digital image correlation was used to measure the 3D-displacement of a soft and deformable substrate. The efficiency and accuracy of the technique were evaluated by applying compression to the substrate using a steel ball, with the measured 3D displacements aligning closely with finite element analysis simulations. To further assess the method's applicability, the wet adhesion between mussel plaques and substrate was tested under aqueous conditions. The interfacial displacements and forces at different stages during the test were measured. The application of the technique can be extended for varied circumstances regarding force range and substrate materials based on Winkler Spring model.",
    "authors": [
      "Yingwei Hou",
      "Tao Liu"
    ],
    "published": "2025-02-17T17:12:35Z",
    "updated": "2025-07-25T13:43:08Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mtrl-sci",
      "physics.bio-ph",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.19248v1",
    "url": "https://arxiv.org/abs/2507.19248v1",
    "pdf_url": "https://arxiv.org/pdf/2507.19248v1.pdf",
    "title": "Dynamically phase-separated states in driven binary dusty plasma",
    "abstract": "We comprehensively study external forcing-driven dynamical structure formation in a binary dusty plasma mixture. Using two-dimensional driven-dissipative molecular dynamics simulations, we demonstrate phase segregation into bands and lanes beyond a critical forcing threshold. The particles interact via the Debye-H\\\"uckel potential, with interaction strength serving as a control parameter for determining the critical forcing. During early evolution, the results exhibit features of two-stream instability. A steady-state phase-space diagram indicates that bands and lanes emerge beyond a critical forcing and coupling strength. Lanes predominantly form under high external forcing. Multiple independent diagnostics, including the order parameter, drift velocity, diffusion coefficients, domain size, and the final-to-initial coupling strength ratio, provide insight into phase segregation and help determine the critical forcing amplitude. Furthermore, we show that the time evolution of band and lane widths follows an exponent of 1/3 for both critical and off-critical mixtures. These findings contrast with the previously reported scaling of 1/2 for equilibrium phase separation in critical mixtures. These results help bridge the gap between dusty plasmas and colloidal systems and facilitate controlled dusty plasma experiments in this direction.",
    "authors": [
      "Farida Batool",
      "Sandeep Kumar",
      "Sanat Kumar Tiwari"
    ],
    "published": "2025-07-25T13:14:04Z",
    "updated": "2025-07-25T13:14:04Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2505.22097v2",
    "url": "https://arxiv.org/abs/2505.22097v2",
    "pdf_url": "https://arxiv.org/pdf/2505.22097v2.pdf",
    "title": "From the Rose-DuBois Ansatz of Hot Spot Fields to the Instanton   Solution: a Pedestrian Presentation",
    "abstract": "This paper gives a pedestrian presentation of some technical results recently published in mathematical physics with non-trivial implications for laser-plasma interaction. The aim is to get across the main results without going into the details of the calculations, nor offering a specialist's user guide, but by focusing conceptually on how these results modify the commonly-held description -- in terms of laser hot spot fields -- of backscattering instabilities with a spatially smoothed laser beam. The intended readers are plasma physicists as well as graduate students interested in laser-plasma interaction. No prior knowledge of scattering instabilities is required. Step by step, we explain how the laser hot spots are gradually replaced with other structures, called instantons, as the amplification of the scattered light increases. In the amplification range of interest for laser-plasma interaction, instanton--hot spot complexes tend to appear in the laser field (in addition to the expected hot spots), with a non-negligible probability. For even larger amplifications and systems longer than a hot spot length, the hot spot field description is clearly invalidated by the instanton takeover.",
    "authors": [
      "Philippe Mounaix"
    ],
    "published": "2025-05-28T08:18:42Z",
    "updated": "2025-07-25T09:01:19Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2502.17386v2",
    "url": "https://arxiv.org/abs/2502.17386v2",
    "pdf_url": "https://arxiv.org/pdf/2502.17386v2.pdf",
    "title": "Neural operator surrogate models of plasma edge simulations: feasibility   and data efficiency",
    "abstract": "The inclusion of high-fidelity simulations of SOL turbulence and transient MHD events such as ELMs in highly iterative applications remains computationally prohibitive, limiting their use in design and control workflows. Understanding these phenomena is vital, as they govern heat flux on plasma-facing components, influencing reactor performance and material lifetime. This study explored FNOs as surrogate models to accelerate plasma simulations from the JOREK MHD and STORM turbulence codes.   FNOs were trained on single-step rollouts and evaluated in terms of long-term predictive accuracy in an auto-regressive manner. To mitigate the computational burden of dataset generation, a transfer learning strategy was explored, leveraging low-fidelity simulations to improve performance on high-fidelity datasets. These results showed that FNOs effectively captured initial plasma evolution, including blob movement and density source localization. However, long rollouts accumulated errors and exhibited sensitivity to certain physical phenomena, leading to non-monotonic error spikes. Transfer learning significantly reduced errors for small dataset sizes and short rollouts, achieving an order-of-magnitude reduction when transfering from low- to high-fidelity datasets. However, its effectiveness diminished with longer rollouts and larger dataset sizes, especially when applied to datasets with significantly different dynamics. Attempts to transfer models to previously unseen variables in simulations were unsuccessful, underscoring the limitations in this context.   These findings demonstrate the promise of NOs for accelerating fusion-relevant PDE simulations. However, they also highlight key challenges: improving long-term accuracy to mitigate error accumulation, capturing critical physical behaviors, and developing robust surrogates that effectively leverage multi-fidelity, multi-physics datasets.",
    "authors": [
      "N. Carey",
      "L. Zanisi",
      "S. Pamela",
      "V. Gopakumar",
      "J. Omotani",
      "J. Buchanan",
      "J. Brandstetter",
      "F. Paischer",
      "G. Galletti",
      "P. Setinek"
    ],
    "published": "2025-02-24T18:13:10Z",
    "updated": "2025-07-25T09:00:25Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2505.24682v2",
    "url": "https://arxiv.org/abs/2505.24682v2",
    "pdf_url": "https://arxiv.org/pdf/2505.24682v2.pdf",
    "title": "Operation of a dual-phase xenon detector with wavelength sensitivity   from ultraviolet to infrared",
    "abstract": "Xenon, in both its gaseous and liquid phase, offers excellent scintillation and ionization properties, making it an ideal target medium for rare event searches. We report on measurements performed with a dual-phase xenon time projection chamber sensitive to wavelengths from 170 nm to 1700 nm. In addition to the well-established ultraviolet (UV) scintillation, we observe coincident signals in a photomultiplier tube sensitive to infrared (IR) light, associated with both prompt scintillation in the liquid and electroluminescence in the gas. We study the time response of the IR signals and their dependence on the applied amplification field in the gas. Our findings support the observation of IR emission from electroluminescence and reveal a time response distinct from that previously reported for $\\alpha$-particles in gas. The results suggest that IR scintillation could provide enhanced signal identification and background rejection in future xenon-based detectors.",
    "authors": [
      "Robert Hammann",
      "Kai Böse",
      "Steffen Form",
      "Luisa Hötzsch",
      "Teresa Marrodán Undagoitia"
    ],
    "published": "2025-05-30T15:08:05Z",
    "updated": "2025-07-25T08:31:50Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.3389/fdest.2025.1638362"
  },
  {
    "arxiv_id": "2507.19044v1",
    "url": "https://arxiv.org/abs/2507.19044v1",
    "pdf_url": "https://arxiv.org/pdf/2507.19044v1.pdf",
    "title": "Cosmic-ray transport in inhomogeneous media",
    "abstract": "A theory of cosmic-ray transport in multi-phase diffusive media is developed, with the specific application to cases in which the cosmic-ray diffusion coefficient has large spatial fluctuations that may be inherently multi-scale. We demonstrate that the resulting transport of cosmic rays is diffusive in the long-time limit, with an average diffusion coefficient equal to the harmonic mean of the spatially varying diffusion coefficient. Thus, cosmic-ray transport is dominated by areas of low diffusion even if these areas occupy a relatively small, but not infinitesimal, fraction of the volume. On intermediate time scales, the cosmic rays experience transient effective sub-diffusion, as a result of low-diffusion regions interrupting long flights through high-diffusion regions. In the simplified case of a two-phase medium, we show that the extent and extremity of the sub-diffusivity of cosmic-ray transport is controlled by the spectral exponent of the distribution of patch sizes of each of the phases. We finally show that, despite strongly influencing the confinement times, the multi-phase medium is only capable of altering the energy dependence of cosmic-ray transport when there is a moderate (but not excessive) level of perpendicular diffusion across magnetic-field lines.",
    "authors": [
      "Robert J. Ewart",
      "Patrick Reichherzer",
      "Shuzhe Ren",
      "Stephen Majeski",
      "Francesco Mori",
      "Michael L. Nastac",
      "Archie F. A. Bott",
      "Matthew W. Kunz",
      "Alexander A. Schekochihin"
    ],
    "published": "2025-07-25T07:59:41Z",
    "updated": "2025-07-25T07:59:41Z",
    "categories": [
      "astro-ph.HE",
      "cond-mat.stat-mech",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2507.18948v1",
    "url": "https://arxiv.org/abs/2507.18948v1",
    "pdf_url": "https://arxiv.org/pdf/2507.18948v1.pdf",
    "title": "Super-resolution femtosecond electron diffraction reveals electronic and   nuclear dynamics at conical intersections",
    "abstract": "Conical intersections play a pivotal role in excited-state quantum dynamics. Capturing transient molecular structures near conical intersections remains challenging due to the rapid timescales and subtle structural changes involved. We overcome this by combining the enhanced temporal resolution of mega-electron-volt ultrafast electron diffraction with a super-resolution real-space inversion algorithm, enabling visualization of nuclear and electronic motions at conical intersections with sub-angstrom resolution, surpassing the diffraction limit. We apply this technique to the textbook example of the ring-opening reaction of 1,3-cyclohexadiene, which proceeds through two conical intersections within 100 femtoseconds. The super-resolved transient structures near conical intersections reveal a C-C bond length difference of less than 0.4 angstrom and an approximately 30-femtosecond traversal time of the nuclear wave packet between them. These findings establish super-resolution ultrafast scattering as a transformative tool for uncovering quantum dynamics in molecules and open new avenues for studying light-matter interactions at the most fundamental level.",
    "authors": [
      "Hui Jiang",
      "Juanjuan Zhang",
      "Tianyu Wang",
      "Jiawei Peng",
      "Cheng Jin",
      "Xiao Zou",
      "Pengfei Zhu",
      "Tao Jiang",
      "Zhenggang Lan",
      "Haiwang Yong",
      "FengHe",
      "Dao Xiang"
    ],
    "published": "2025-07-25T04:35:52Z",
    "updated": "2025-07-25T04:35:52Z",
    "categories": [
      "physics.chem-ph",
      "physics.atm-clus",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "physics.chem-ph",
    "doi": "10.1038/s41467-025-61975-9"
  }
]