{
  "arxiv_id": "2505.12874v3",
  "url": "https://arxiv.org/abs/2505.12874v3",
  "pdf_url": "https://arxiv.org/pdf/2505.12874v3.pdf",
  "title": "Optimization of 3D diamond detectors with graphitized electrodes based on an innovative numerical simulation",
  "abstract": "Future experiments at hadron colliders require an evolution of the tracking sensors to ensure sufficient radiation hardness as well as space and time resolution to handle unprecedented particle fluxes. 3D diamond sensors with laser-graphitized electrodes are promising candidates due to their strong binding energy, small atomic number, and high carrier mobility. However, the high resistance of the engraved electrodes delays the propagation of the induced signals towards the readout electronics, thereby degrading the precision of the timing measurements. So far, this effect has been the dominant factor limiting the time resolution of these devices, with other contributions, such as those due to electric field inhomogeneities or electronic noise, typically neglected. Recent advancements in graphitization technology, however, motivate a renewed effort in modeling signal generation in 3D diamond detectors, to achieve more reliable predictions. To this purpose, we apply an extended version of the Ramo-Shockley theorem, describing the effect of signal propagation as a time-dependent weighting potential, obtained by numerically solving the Maxwell's equations in a quasi-static approximation. We developed a custom spectral method solver and validated it against COMSOL MultiPhysics. The response of the modeled sensor to a beam of particles is then simulated using Garfield++ and is compared to the data acquired in a beam test carried on in 2021 by the TimeSPOT Collaboration at the SPS, at CERN. Based on the results obtained with this simulation workflow, we conclude that reducing the resistivity of the graphitic columns remains the priority for significantly improving the time resolution of 3D diamond detectors. Once achieved, optimization of the detector geometry and readout electronics design will become equally important steps to further enhance the timing performance of these devices.",
  "authors": [
    "Lucio Anderlini",
    "Alessandro Bombini",
    "Clarissa Buti",
    "Djunes Janssens",
    "Stefano Lagomarsino",
    "Giovanni Passaleva",
    "Michele Veltri"
  ],
  "published": "2025-05-19T08:58:39Z",
  "updated": "2025-12-11T10:11:19Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}