{
  "arxiv_id": "2601.07682v1",
  "url": "https://arxiv.org/abs/2601.07682v1",
  "pdf_url": "https://arxiv.org/pdf/2601.07682v1.pdf",
  "title": "Sub-Pixel Electron Beam Alignment for Machine Learning Characterization of Hybrid Pixel Detectors",
  "abstract": "Due to their radiation hardness, kilohertz frame rates, and high dynamic range, hybrid pixel detectors have recently expanded their application range to electron diffraction and recently also electron imaging. However, these detectors typically have pixel sizes about ten times larger than those of direct electron detectors commonly used for imaging and more prominent electron multiple scattering effects. To overcome these limitations, machine learning approaches can be utilized to reconstruct the electron entrance point and achieve super-resolution. As this process is inherently stochastic, and machine learning relies on suitable training data, high-quality, representative training data are essential for developing models that achieve the best possible resolution. In this work, we present two novel experimental methods for generating such training data. The first method employs precise microscope alignment to scan the detector plane using a finely focused electron beam of 2 μm diameter, enabling controlled sub-pixel mapping. The second method utilizes specially designed aperture masks with sub-pixel-sized holes to accurately localize electron entry points. We developed and validated two experimental strategies for collecting training data at acceleration voltages of 60, 80, 120, and 200 keV, which enable sub-pixel labeling for hybrid pixel detectors. Notably, our methodology is broadly applicable to a wide range of hybrid pixel detectors.",
  "authors": [
    "Emiliya Poghosyan",
    "Xiangyu Xie",
    "Joakim Reuteler",
    "Kirsty A. Paton",
    "Luis Barba Flores",
    "Benjamin Béjar Haro",
    "Erik Fröjdh",
    "Anna Bergamaschi",
    "Elisabeth Müller"
  ],
  "published": "2026-01-12T16:14:14Z",
  "updated": "2026-01-12T16:14:14Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}