{
  "arxiv_id": "2601.07848v2",
  "url": "https://arxiv.org/abs/2601.07848v2",
  "pdf_url": "https://arxiv.org/pdf/2601.07848v2.pdf",
  "title": "Cyclotron Radiation Signal Characterization in Resonant Cavities for the Project 8 Neutrino Mass Experiment",
  "abstract": "Many experimental methods in physics require understanding radiation from single particles into non-trivial electromagnetic mode structures. Such characterization is critical for Cyclotron Radiation Emission Spectroscopy (CRES), an advancing new measurement technique that has the potential to greatly benefit fundamental physics measurements. In CRES, charged particles emit cyclotron radiation at frequencies that provide their energy measurement. As a notable example, the Project 8 experiment aims to kinematically infer the neutrino mass by measuring the energies of electrons emitted in tritium beta decay using CRES. In near-term realizations of Project 8, resonant cylindrical cavities will be used for CRES readout, in a configuration with a magnetic field oriented along the symmetry axis, and electrons following helical cyclotron trajectories confined to the cavity interior. The physics of electromagnetic radiation in these environments is complicated, since it involves both the motion of the emitting particle and the mode structure imposed by the cavity. In this work, we derive and validate an analytic model for how an oscillating, trapped electron radiates into cavity modes, and the power and frequency content of the radiation that can be read out from these events. These results can be used to guide the design of cavities for future CRES and other experiments.",
  "authors": [
    "A. Ashtari Esfahani",
    "S. Bhagvati",
    "H. P. Binney",
    "S. Böser",
    "M. J. Brandsema",
    "N. Buzinsky",
    "R. Cabral",
    "M. C. Carmona-Benitez",
    "C. Claessens",
    "L. de Viveiros",
    "A. El Boustani",
    "M. G. Elliott",
    "S. Enomoto",
    "M. Fertl",
    "J. A. Formaggio",
    "B. T. Foust",
    "J. K. Gaison",
    "P. Harmston",
    "K. M. Heeger",
    "B. J. P. Jones",
    "E. Karim",
    "K. Kazkaz",
    "P. T. Kolbeck",
    "A. Kurmus",
    "M. Li",
    "A. Lindman",
    "C. -Y. Liu",
    "T. Luo",
    "C. Matthé",
    "R. Mohiuddin",
    "B. Monreal",
    "B. Mucogllava",
    "R. Mueller",
    "A. Negi",
    "J. A. Nikkel",
    "E. Novitski",
    "N. S. Oblath",
    "M. Oueslati",
    "J. I. Peña",
    "W. Pettus",
    "A. W. P. Poon",
    "V. S. Ranatunga",
    "R. Reimann",
    "A. L. Reine",
    "R. G. H. Robertson",
    "G. Rybka",
    "L. Saldaña",
    "V. Sharma",
    "P. L. Slocum",
    "F. Spanier",
    "J. Stachurska",
    "Y. -H. Sun",
    "P. T. Surukuchi",
    "A. B. Telles",
    "F. Thomas",
    "L. A. Thorne",
    "T. Thümmler",
    "M. Turqueti",
    "W. Van De Pontseele",
    "B. A. VanDevender",
    "T. E. Weiss",
    "M. Wynne",
    "A. Ziegler"
  ],
  "published": "2026-01-07T21:31:03Z",
  "updated": "2026-01-14T18:13:15Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}