[
  {
    "arxiv_id": "2601.09675v1",
    "url": "https://arxiv.org/abs/2601.09675v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09675v1.pdf",
    "title": "Radiation tolerance tests on key components of the ePIC-dRICH readout card",
    "abstract": "The dual-radiator RICH detector of the ePIC experiment will employ over 300000 SiPM pixels as photosensors, organized into more than 1000 Photon Detection Units. Each PDU is a compact module, approximately 5x5x12 cm^3 in size, including four custom ASICs connected to 256 SiPMs and an FPGA-based readout card (RDO) responsible for data acquisition and control. Considering the moderately harsh radiation environment expected in the dRICH detector, this study reports on proton irradiation tests performed on key components of the RDO card to assess their tolerance to cumulative Total Ionizing Dose (TID) and Single Event Effects (SEE). All tested components demonstrated radiation tolerance beyond the TID levels expected for the dRICH environment, with the exception of the ATtiny417 microcontroller, which showed destructive failure. Furthermore, as expected, the observed Single Event Upset (SEU) rates call for appropriate mitigation strategies in the final system design.",
    "authors": [
      "S. Geminiani",
      "B. R. Achari",
      "N. Agrawal",
      "M. Alexeev",
      "C. Alice",
      "R. Ammendola",
      "P. Antonioli",
      "C. Baldanza",
      "L. Barion",
      "A. Biagioni",
      "A. Calivà",
      "M. Capua",
      "F. Capuani",
      "A. Ciardiello",
      "E. Cisbani",
      "M. Chiosso",
      "M. Contalbrigo",
      "F. Cossio",
      "M. Da Rocha Rolo",
      "A. De Caro",
      "D. De Gruttola",
      "G. Dellacasa",
      "D. Falchieri",
      "S. Fazio",
      "O. Frezza",
      "N. Funicello",
      "M. Garbini",
      "N. Jacazio",
      "F. Lo Cicero",
      "A. Lonardo",
      "R. Malaguti",
      "F. Mammoliti",
      "M. Martinelli",
      "M. Mignone",
      "C. Mingioni",
      "M. Nenni",
      "F. Noto",
      "L. Occhiuto",
      "A. Paladino",
      "D. Panzieri",
      "P. Perticaroli",
      "S. Plavully",
      "L. Polizzi",
      "L. Pontisso",
      "R. Preghenella",
      "R. Ricci",
      "L. Rignanese",
      "C. Ripoli",
      "C. Rossi",
      "E. Rovati",
      "N. Rubini",
      "M. Ruspa",
      "A. Saputi",
      "F. Simula",
      "F. Spizzo",
      "U. Tamponi",
      "E. Tassi",
      "G. Torromeo",
      "C. Tuvè",
      "G. M. Urciuoli",
      "S. Vallarino",
      "P. Vicini",
      "R. Wheadon"
    ],
    "published": "2026-01-14T18:18:23Z",
    "updated": "2026-01-14T18:18:23Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.16408v2",
    "url": "https://arxiv.org/abs/2511.16408v2",
    "pdf_url": "https://arxiv.org/pdf/2511.16408v2.pdf",
    "title": "Development & Characterization of Electrodes for large-scale Xenon Time Projection Chambers",
    "abstract": "Dual-phase liquid xenon time projection chambers are the core detector elements of many experiments that conduct searches for Dark Matter and rare events, as well as in neutrino and high-energy physics. As part of this detector technology, high-voltage electrodes are instrumental for the generation of observable signals and their physical interpretation. Thus, electrode design and manufacturing has to fulfill stringent requirements, and their production is associated with significant engineering challenges. In this work we describe the successful development of electrodes on the 1.5 m-scale, from their design and simulation to subsequent assembly and high-voltage testing in a gaseous argon environment. The produced electrodes were recently installed as an anode and a cathode during an upgrade to the XENONnT experiment.",
    "authors": [
      "A. Elykov",
      "S. Vetter",
      "V. H. S. Wu",
      "A. Deisting",
      "K. Eitel",
      "R. Gumbsheimer",
      "M. Kara",
      "S. Lichter",
      "S. Lindemann",
      "T. Luce",
      "Y. Ma",
      "J. Müller",
      "K. Müller",
      "K. Ni",
      "U. Oberlack",
      "M. Schumann",
      "P. Shagin",
      "K. Valerius",
      "M. Zhong"
    ],
    "published": "2025-11-20T14:29:16Z",
    "updated": "2026-01-14T18:13:53Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.07848v2",
    "url": "https://arxiv.org/abs/2601.07848v2",
    "pdf_url": "https://arxiv.org/pdf/2601.07848v2.pdf",
    "title": "Cyclotron Radiation Signal Characterization in Resonant Cavities for the Project 8 Neutrino Mass Experiment",
    "abstract": "Many experimental methods in physics require understanding radiation from single particles into non-trivial electromagnetic mode structures. Such characterization is critical for Cyclotron Radiation Emission Spectroscopy (CRES), an advancing new measurement technique that has the potential to greatly benefit fundamental physics measurements. In CRES, charged particles emit cyclotron radiation at frequencies that provide their energy measurement. As a notable example, the Project 8 experiment aims to kinematically infer the neutrino mass by measuring the energies of electrons emitted in tritium beta decay using CRES. In near-term realizations of Project 8, resonant cylindrical cavities will be used for CRES readout, in a configuration with a magnetic field oriented along the symmetry axis, and electrons following helical cyclotron trajectories confined to the cavity interior. The physics of electromagnetic radiation in these environments is complicated, since it involves both the motion of the emitting particle and the mode structure imposed by the cavity. In this work, we derive and validate an analytic model for how an oscillating, trapped electron radiates into cavity modes, and the power and frequency content of the radiation that can be read out from these events. These results can be used to guide the design of cavities for future CRES and other experiments.",
    "authors": [
      "A. Ashtari Esfahani",
      "S. Bhagvati",
      "H. P. Binney",
      "S. Böser",
      "M. J. Brandsema",
      "N. Buzinsky",
      "R. Cabral",
      "M. C. Carmona-Benitez",
      "C. Claessens",
      "L. de Viveiros",
      "A. El Boustani",
      "M. G. Elliott",
      "S. Enomoto",
      "M. Fertl",
      "J. A. Formaggio",
      "B. T. Foust",
      "J. K. Gaison",
      "P. Harmston",
      "K. M. Heeger",
      "B. J. P. Jones",
      "E. Karim",
      "K. Kazkaz",
      "P. T. Kolbeck",
      "A. Kurmus",
      "M. Li",
      "A. Lindman",
      "C. -Y. Liu",
      "T. Luo",
      "C. Matthé",
      "R. Mohiuddin",
      "B. Monreal",
      "B. Mucogllava",
      "R. Mueller",
      "A. Negi",
      "J. A. Nikkel",
      "E. Novitski",
      "N. S. Oblath",
      "M. Oueslati",
      "J. I. Peña",
      "W. Pettus",
      "A. W. P. Poon",
      "V. S. Ranatunga",
      "R. Reimann",
      "A. L. Reine",
      "R. G. H. Robertson",
      "G. Rybka",
      "L. Saldaña",
      "V. Sharma",
      "P. L. Slocum",
      "F. Spanier",
      "J. Stachurska",
      "Y. -H. Sun",
      "P. T. Surukuchi",
      "A. B. Telles",
      "F. Thomas",
      "L. A. Thorne",
      "T. Thümmler",
      "M. Turqueti",
      "W. Van De Pontseele",
      "B. A. VanDevender",
      "T. E. Weiss",
      "M. Wynne",
      "A. Ziegler"
    ],
    "published": "2026-01-07T21:31:03Z",
    "updated": "2026-01-14T18:13:15Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.11725v2",
    "url": "https://arxiv.org/abs/2510.11725v2",
    "pdf_url": "https://arxiv.org/pdf/2510.11725v2.pdf",
    "title": "Towards High-Efficiency Particle Detection Using Superconducting Microwire Arrays",
    "abstract": "We present a detailed study of an 8-channel $1\\times1$ mm$^{2}$ WSi superconducting microwire single photon detector (SMSPD) array exposed to 120 GeV hadron beam and 120 GeV muon beam at the CERN Super Proton Synchrotron H6 beamline. Following up on our first detailed characterization of the efficiency and response of an SMSPD fabricated on a 3 nm WSi film, we report measurements of enhanced particle detection efficiency using a sensor fabricated from a thicker 4.7nm-thick WSi film. We also report the first SMSPD detection efficiency measurement made for muons. Measurements are enabled by a silicon tracking telescope providing 10 $μ$m in-situ spatial resolution. The results show a fill factor-normalized detection efficiency of 75% and a time resolution of about 130 ps across pixels. These findings represent a significant advancement toward developing high-efficiency SMSPD charged particle tracking systems with simultaneous precision timing, with potential applications in future accelerator-based experiments such as the FCC-ee and Muon Collider.",
    "authors": [
      "Christina Wang",
      "Cristián Peña",
      "Adolf Bornheim",
      "Shuoxing Wu",
      "Alexander Albert",
      "Thomas Sievert",
      "Artur Apresyan",
      "Emanuel Knehr",
      "Boris Korzh",
      "Jamie Luskin",
      "Ludovico Mori",
      "Sahil Patel",
      "Guillermo Reales Gutiérrez",
      "Manish Sahu",
      "Ekkehart Schmidt",
      "Matthew Shaw",
      "Elise Sledge",
      "Maria Spiropulu",
      "Towsif Taher",
      "Si Xie"
    ],
    "published": "2025-10-08T13:01:48Z",
    "updated": "2026-01-14T17:05:59Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/12/P12033"
  },
  {
    "arxiv_id": "2507.13864v2",
    "url": "https://arxiv.org/abs/2507.13864v2",
    "pdf_url": "https://arxiv.org/pdf/2507.13864v2.pdf",
    "title": "Muon tracking in a LiquidO opaque scintillator detector",
    "abstract": "LiquidO is an innovative radiation detector concept. The core idea is to exploit stochastic light confinement in a highly scattering medium to self-segment the detector volume. In this paper, we demonstrate event-by-event muon tracking in a LiquidO opaque scintillator detector prototype. The detector consists of a 30 mm cubic scintillator volume instrumented with 64 wavelength-shifting fibres arranged in an 8$\\times$8 grid with a 3.2 mm pitch and read out by silicon photomultipliers. A wax-based opaque scintillator with a scattering length of approximately 0.5 mm is used. The tracking performance of this LiquidO detector is characterised with cosmic-ray muons and the position resolution is demonstrated to be 450 $μ$m per row of fibres. These results highlight the potential of LiquidO opaque scintillator detectors to achieve fine spatial resolution, enabling precise particle tracking and imaging.",
    "authors": [
      "LiquidO Collaboration",
      "J. Apilluelo",
      "L. Asquith",
      "E. F. Bannister",
      "N. P. Barradas",
      "C. L. Baylis",
      "J. L. Beney",
      "M. Berberan e Santos",
      "X. de la Bernardie",
      "T. J. C. Bezerra",
      "M. Bongrand",
      "C. Bourgeois",
      "D. Breton",
      "J. Busto",
      "A. Cabrera",
      "A. Cadiou",
      "E. Calvo",
      "M. de Carlos Generowicz",
      "E. Chauveau",
      "B. J. Cattermole",
      "M. Chen",
      "P. Chimenti",
      "D. F. Cowen",
      "S. Kr. Das",
      "S. Dusini",
      "A. Earle",
      "M. Felizardo",
      "C. Frigerio Martins",
      "J. Galán",
      "J. A. García",
      "A. Gibson-Foster",
      "C. Girard-Carillo",
      "W. C. Griffith",
      "J. J. Gómez-Cadenas",
      "M. Guitière",
      "F. Haddad",
      "J. Hartnell",
      "A. Holin",
      "I. G. Irastorza",
      "I. Jovanovic",
      "A. Kling",
      "L. Koch",
      "P. Lasorak",
      "J. F. Le Du",
      "F. Lefevre",
      "P. Loaiza",
      "J. A. Lock",
      "G. Luzón",
      "J. Maalmi",
      "J. P. Malhado",
      "F. Mantovani",
      "J. G. Marques",
      "C. Marquet",
      "M. Martínez",
      "J. T. Moffat",
      "D. Navas-Nicolás",
      "H. Nunokawa",
      "J. P. Ochoa-Ricoux",
      "T. Palmeira",
      "C. Palomares",
      "D. Petyt",
      "P. Pillot",
      "A. Pin",
      "J. C. C. Porter",
      "M. S. Pravikoff",
      "S. Richards",
      "N. Rodrigues",
      "M. Roche",
      "R. Rosero",
      "B. Roskovec",
      "M. L. Sarsa",
      "S. Schoppmann",
      "A. Serafini",
      "C. Shepherd-Themistocleous",
      "W. Shorrock",
      "M. Silva",
      "L. Simard",
      "S. R. Soleti",
      "D. Stocco",
      "V. Strati",
      "J. S. Stutzmann",
      "F. Suekane",
      "N. Tuccori",
      "A. Verdugo",
      "B. Viaud",
      "S. M. Wakely",
      "A. Weber",
      "G. Wendel",
      "A. S. Wilhelm",
      "A. W. R. Wong",
      "M. Yeh",
      "F. Yermia"
    ],
    "published": "2025-07-18T12:39:06Z",
    "updated": "2026-01-14T17:05:09Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/21/01/P01010"
  },
  {
    "arxiv_id": "2601.09629v1",
    "url": "https://arxiv.org/abs/2601.09629v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09629v1.pdf",
    "title": "Characterization of Silicon-Membrane TES Microcalorimeters for Large-Format X-ray Spectrometers with Integrated Microwave SQUID Readout",
    "abstract": "We present the electro-thermal characterization of transition-edge sensor (TES) detectors suspended on Si membranes fabricated using a silicon-on-insulator (SOI) wafer. The use of an all-silicon fabrication platform, in contrast to the more commonly used silicon nitride membranes, is compatible with monolithic fabrication of integrated TES and SQUID circuits. The all-silicon architecture additionally allows efficient use of focal plane area; the readout circuitry may be positioned out of the focal plane by bending a thinned portion of the chip. Compatibility with integrated fabrication and efficient use of focal plane area provide a path to an efficient soft X-ray spectrometer.   This work is motivated by our goal to develop a 10,000-pixel TES spectrometer to overcome critical measurement limitations in catalysis research. The characterization of fragile, carbon-based intermediates via techniques like Resonant Inelastic X-ray Scattering (RIXS) is often precluded by the slow, high-flux nature of existing technologies. The new instrument will allow for fast RIXS measurements to be made without causing sample damage. We verify the detector models and measure the energy resolution using a pulsed optical laser, demonstrating the viability of this approach for the final instrument to be deployed at the National Synchrotron Light Source II (NSLS-II).",
    "authors": [
      "Avirup Roy",
      "Robinjeet Singh",
      "Joel C. Weber",
      "W. B. Doriese",
      "Johnathon Gard",
      "Mark W. Keller",
      "John A. B. Mates",
      "Kelsey M. Morgan",
      "Nathan J. Ortiz",
      "Daniel S. Swetz",
      "Daniel R. Schmidt",
      "Joel N. Ullom",
      "Evan P. Jahrman",
      "Thomas C. Allison",
      "Sasawat Jamnuch",
      "John Vinson",
      "Charles J. Titus",
      "Cherno Jaye",
      "Daniel A. Fischer",
      "Galen C. O'Neil"
    ],
    "published": "2026-01-14T17:01:34Z",
    "updated": "2026-01-14T17:01:34Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.supr-con",
      "quant-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.09574v1",
    "url": "https://arxiv.org/abs/2601.09574v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09574v1.pdf",
    "title": "Square matrix-based six-dimensional convergence map for nonlinear beam dynamics analysis",
    "abstract": "The square matrix-based convergence map (CM) method has proven effective in characterizing nonlinear dynamics in several 4-D dynamical systems. However, when time-dependent perturbations, such as crabbing kicks in colliders, are present, a comprehensive 6-D analysis becomes essential to accurately capture the coupling between transverse and longitudinal motions. In this work, we extend the CM method to the full 6-D phase space by employing an eigen-decomposition-based formulation of the square matrix combined with iterative procedures. The proposed 6-D CM approach is first validated using a simplified crabbing map. We demonstrate that the 6-D CM preserves computational efficiency by using only one-turn map, while successfully resolving high-order resonance structures that remain unresolved by conventional frequency map analysis (FMA). This method is subsequently applied to the dynamic aperture (DA) study of the future Electron-Ion Collider (EIC). The results obtained from the CM analysis exhibit close agreement with those derived from FMA, demonstrating its potential as a powerful tool for nonlinear beam dynamics analysis and DA evaluation, as well as for broader applications in other nonlinear dynamical systems.",
    "authors": [
      "Jinyu Wan",
      "Yue Hao"
    ],
    "published": "2026-01-14T15:45:22Z",
    "updated": "2026-01-14T15:45:22Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.09408v1",
    "url": "https://arxiv.org/abs/2601.09408v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09408v1.pdf",
    "title": "The ePIC Silicon Vertex Tracker: Design and Status",
    "abstract": "The ePIC collaboration is developing a multidetector system to explore the fundamental properties of the strong interaction at the future Electron-Ion Collider (EIC), to be built at Brookhaven National Laboratory. A key component of the ePIC detector is the Silicon Vertex Tracker (SVT), which provides high-precision tracking and microvertex reconstruction. The SVT consists of the Inner Barrel (IB), the Outer Barrel (OB), and the Forward/Backward Disks, all based on Monolithic Active Pixel Sensors (MAPS) that combine high granularity, low power consumption, and minimal material budget. This paper presents a concise overview of the SVT design and its development status.",
    "authors": [
      "R. Turrisi"
    ],
    "published": "2026-01-14T11:53:37Z",
    "updated": "2026-01-14T11:53:37Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.22308v2",
    "url": "https://arxiv.org/abs/2511.22308v2",
    "pdf_url": "https://arxiv.org/pdf/2511.22308v2.pdf",
    "title": "Timing resolution from very thin LGAD sensors tested on particle beam down to 12 ps",
    "abstract": "The paper reports on the timing resolution obtained with the Low-Gain Avalanche Diode (LGAD) sensors for extreme fluences at the DESY Test Beam Facility with 4 GeV/c electrons. The LGADs adopt an $n$-in-$p$ technology with a $p^{+}$-type boron gain implant, co-implanted with carbon to mitigate acceptor deactivation. The substrate thickness of the sensors varies from 20 $μ$m to 45 $μ$m, with an active area spanning from 0.75 $\\times$ 0.75 to 1.28 $\\times$ 1.28 mm$^{2}$. A set of 30 $μ$m sensors irradiated with neutrons at fluences between 4 $\\times$ 10$^{14}$ and 2.5 $\\times$ 10$^{15}$ n$_{\\textrm{1 MeV eq.}}$cm$^{-2}$ were tested on the beam. The gain was measured between 7 and 40 across all non-irradiated sensors in the study, and between 7 and 30 in irradiated sensors. The experimental setup consisted of a 45 $μ$m-thick trigger sensor with an active area of 3.6 $\\times$ 3.6 mm$^{2}$, four device-under-test (DUT) planes, and a Photonis micro-channel plate photomultiplier tube (MCP) as a time reference. The timing resolution was calculated from Gaussian fitting of the difference in times of arrival of a particle at a DUT and the MCP, using the constant fraction discrimination technique. A timing resolution of 26.4 ps was achieved in 45 $μ$m sensors, and down to 16.6 ps in 20 $μ$m sensors. The combination of two 20 $μ$m LGAD sensors reached a timing resolution of 12.2 ps. A timing resolution of below 20 ps was obtained in all irradiated 30 $μ$m sensors.",
    "authors": [
      "Robert Stephen White",
      "Marco Ferrero",
      "Valentina Sola",
      "Anna Rita Altamura",
      "Roberta Arcidiacono",
      "Maurizio Boscardin",
      "Nicolo Cartglia",
      "Matteo Centis Vignali",
      "Tommaso Croci",
      "Matteo Durando",
      "Simone Galletto",
      "Alessandro Fondacci",
      "Leonardo Lanteri",
      "Luca Menzio",
      "Francesco Moscatelli",
      "Giovanni Paternoster",
      "Federico Siviero"
    ],
    "published": "2025-11-27T10:39:44Z",
    "updated": "2026-01-14T10:03:41Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.14884v2",
    "url": "https://arxiv.org/abs/2509.14884v2",
    "pdf_url": "https://arxiv.org/pdf/2509.14884v2.pdf",
    "title": "Applying reinforcement learning to optical cavity locking tasks: considerations on actor-critic architectures and real-time hardware implementation",
    "abstract": "This proceedings contains our considerations made during and after fruitful discussions held at EuCAIFCon 2025. We explore the use of deep reinforcement learning for autonomous locking of Fabry-Perot optical cavities in non-linear regimes, with relevance to gravitational-wave detectors. A custom Gymnasium environment with a time-domain simulator enabled training of agents such as deep deterministic policy gradient, achieving reliable lock acquisition for both low- and high-finesse cavities, including Virgo-like parameters. We also discuss possible improvements with Twin Delayed DDPG, Soft Actor Critic and meta-reinforcement learning, as well as strategies for low-latency execution and off-line policy updates to address hardware limitations. These studies lay the groundwork for future deployment of reinforcement learning-based control in real optical setups.",
    "authors": [
      "Mateusz Bawaj",
      "Andrea Svizzeretto"
    ],
    "published": "2025-09-18T12:06:40Z",
    "updated": "2026-01-14T10:01:13Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.05069v2",
    "url": "https://arxiv.org/abs/2507.05069v2",
    "pdf_url": "https://arxiv.org/pdf/2507.05069v2.pdf",
    "title": "Towards replacing detector simulation with heterogeneous GNNs in flavour physics analyses",
    "abstract": "Driven by the increasing volume of recorded data, the demand for simulation from experiments based at the Large Hadron Collider will rise sharply in the coming years. Addressing this demand solely with existing computationally intensive workflows is not feasible. This paper introduces a new fast simulation tool designed to address this demand at the LHCb experiment. This tool emulates the detector response to arbitrary multibody decay topologies at LHCb. Rather than memorising specific decay channels, the model learns generalisable patterns within the response, allowing it to interpolate to channels not present in the training data. Novel heterogeneous graph neural network architectures are employed that are designed to embed the physical characteristics of the task directly into the network structure. We demonstrate the performance of the tool across a range of decay topologies, showing the networks can correctly model the relationships between complex variables. The architectures and methods presented are generic and could readily be adapted to emulate workflows at other simulation-intensive particle physics experiments.",
    "authors": [
      "Guillermo Hijano",
      "Davide Lancierini",
      "Alexander Mclean Marshall",
      "Andrea Mauri",
      "Patrick Owen",
      "Mitesh Patel",
      "Konstantinos Petridis",
      "Shah Rukh Qasim",
      "Nicola Serra",
      "William Sutcliffe",
      "Hanae Tilquin"
    ],
    "published": "2025-07-07T14:51:19Z",
    "updated": "2026-01-14T09:04:42Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1103/k9ls-9pwc"
  },
  {
    "arxiv_id": "2601.09055v1",
    "url": "https://arxiv.org/abs/2601.09055v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09055v1.pdf",
    "title": "Multi parameter discrimination using multiple spectral troughs in a cascaded fiber sensor",
    "abstract": "Accurate monitoring of temperature, axial strain, and refractive index is critical for structural health monitoring, industrial process control, and environmental sensing. However, conventional optical fiber sensors are often limited by strong parameter cross sensitivity, poor discrimination capability, and increased system complexity when multiple sensing units are required. In this work, a compact multi-parameter optical fiber sensing platform is proposed based on a cascaded single-mode fiber, multimode fiber, and long-period fiber grating structure, combined with a wavelength-based spectral demodulation strategy. Within the cascaded configuration, multiple characteristic spectral troughs arising from distinct physical mechanisms coexist in a single transmission spectrum. Interference-induced troughs are generated by the multimode fiber section, while a resonance-induced trough is introduced by the long-period fiber grating. Although none of these troughs responds exclusively to a single parameter, each exhibits simultaneous and linearly independent responses to temperature, axial strain, and refractive index with distinct sensitivity magnitudes and trends. Consequently, each trough can be described by a unique sensitivity vector, enabling robust multi-parameter discrimination through multi-wavelength spectral demodulation.",
    "authors": [
      "Riming Xu",
      "Yanbo Li",
      "Xingnan Chen",
      "Jin Wang"
    ],
    "published": "2026-01-14T00:49:19Z",
    "updated": "2026-01-14T00:49:19Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2601.08934v1",
    "url": "https://arxiv.org/abs/2601.08934v1",
    "pdf_url": "https://arxiv.org/pdf/2601.08934v1.pdf",
    "title": "Hybrid-Contact Planar HPGe Process Vehicle Toward Ring-Contact Designs",
    "abstract": "Rare-event searches including dark matter, coherent elastic neutrino--nucleus scattering (CE$ν$NS), and neutrinoless double-beta decay (0$νββ$) require high-purity germanium (HPGe) detectors with ultralow noise, stable backgrounds, and electrode geometries that can scale to larger single-crystal masses. Ring-contact (ring-and-groove) designs address scalability by shaping the electric field to preserve low-capacitance readout, but their nonplanar topology motivates a lithium-contact process that is compatible with conformal deposition and robust high-voltage operation. As a process demonstration toward future ring-contact prototypes, we fabricate and characterize a hybrid-contact planar HPGe device, KL01. Here, ``hybrid'' denotes an $n^{+}$ contact formed by an in-house lithium-suspension paint followed by controlled thermal diffusion, combined with an AJA-developed a-Ge/Al $p^{+}$ contact and a-Ge sidewall passivation. At 77~K the device exhibits pA-scale leakage current under kV bias, a depletion plateau near $V_{\\mathrm{dep}}\\approx 1300$~V, and energy resolutions of 1.57~keV FWHM at 59.5~keV and 2.57~keV FWHM at 662~keV. These results validate the compatibility of the paint-and-diffuse lithium process with thin-film a-Ge/Al contacts and establish a practical fabrication workflow to be extended to ring-and-groove electrodes for next-generation rare-event HPGe modules.",
    "authors": [
      "Kunming Dong",
      "Dongming Mei",
      "Shasika Panamaldeniya",
      "Anupama Karki",
      "Patrick Burns",
      "Sanjay Bhataarai"
    ],
    "published": "2026-01-13T19:12:53Z",
    "updated": "2026-01-13T19:12:53Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.08910v1",
    "url": "https://arxiv.org/abs/2601.08910v1",
    "pdf_url": "https://arxiv.org/pdf/2601.08910v1.pdf",
    "title": "Towards a Self-Driving Trigger at the LHC: Adaptive Response in Real Time",
    "abstract": "Real-time data filtering and selection -- or trigger -- systems at high-throughput scientific facilities such as the experiments at the Large Hadron Collider (LHC) must process extremely high-rate data streams under stringent bandwidth, latency, and storage constraints. Yet these systems are typically designed as static, hand-tuned menus of selection criteria grounded in prior knowledge and simulation. In this work, we further explore the concept of a self-driving trigger, an autonomous data-filtering framework that reallocates resources and adjusts thresholds dynamically in real-time to optimize signal efficiency, rate stability, and computational cost as instrumentation and environmental conditions evolve. We introduce a benchmark ecosystem to emulate realistic collider scenarios and demonstrate real-time optimization of a menu including canonical energy sum triggers as well as modern anomaly-detection algorithms that target non-standard event topologies using machine learning. Using simulated data streams and publicly available collision data from the Compact Muon Solenoid (CMS) experiment, we demonstrate the capability to dynamically and automatically optimize trigger performance under specific cost objectives without manual retuning. Our adaptive strategy shifts trigger design from static menus with heuristic tuning to intelligent, automated, data-driven control, unlocking greater flexibility and discovery potential in future high-energy physics analyses.",
    "authors": [
      "Shaghayegh Emami",
      "Cecilia Tosciri",
      "Giovanna Salvi",
      "Zixin Ding",
      "Yuxin Chen",
      "Abhijith Gandrakota",
      "Christian Herwig",
      "David W. Miller",
      "Jennifer Ngadiuba",
      "Nhan Tran"
    ],
    "published": "2026-01-13T19:00:02Z",
    "updated": "2026-01-13T19:00:02Z",
    "categories": [
      "physics.ins-det",
      "cs.AI",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.08830v1",
    "url": "https://arxiv.org/abs/2601.08830v1",
    "pdf_url": "https://arxiv.org/pdf/2601.08830v1.pdf",
    "title": "Forbidden second harmonics in centrosymmetric bilayer crystals",
    "abstract": "Optical spectroscopy based on second-order nonlinearity is a critical technique for characterizing two-dimensional (2D) crystals as well as bioimaging and quantum optics. It is generally believed that second-harmonic generation (SHG) in centrosymmetric crystals, such as graphene and other bilayer 2D crystals, is negligible without externally breaking the inversion symmetry. Here, we show that with a new homodyne detection technique, we can apparently circumvent this symmetry-imposed constraint and observe robust SHG in pristine centrosymmetric crystals, without any symmetry-breaking field. With its exceptional sensitivity, we resolve polarization-resolved SHG in bilayer hexagonal boron nitride (h-BN), bilayer 2H-WSe$_2$, and remarkably, Bernal-stacked bilayer graphene, allowing us to unambiguously identify the crystallographic orientation in these crystals via SHG for the first time. We also demonstrate that the new technique can be used to non-invasively detect uniaxial strain and optical geometric phase in these crystals. The observed SHG in our experiments is attributed to second-order nonlinearity in the quadrupole channel, which is controlled by the presence of the $C_2$ symmetry instead of the inversion symmetry. Our new technique expands the capability of nonlinear optical spectroscopy to encompass a large class of centrosymmetric materials that could never be measured before, and can be used for quantum sensing of moiré materials and twisted epitaxial films.",
    "authors": [
      "Haoning Tang",
      "Zhitong Ding",
      "Tianyi Ruan",
      "Zeyu Hao",
      "Kenji Watanabe",
      "Takashi Taniguchi",
      "Haozhe Wang",
      "Ali Javey",
      "Feng Wang",
      "Yuan Cao"
    ],
    "published": "2026-01-13T18:59:53Z",
    "updated": "2026-01-13T18:59:53Z",
    "categories": [
      "cond-mat.mes-hall",
      "cond-mat.mtrl-sci",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "cond-mat.mes-hall"
  },
  {
    "arxiv_id": "2601.08817v1",
    "url": "https://arxiv.org/abs/2601.08817v1",
    "pdf_url": "https://arxiv.org/pdf/2601.08817v1.pdf",
    "title": "Commercial Accelerometers for Vibration Sensing at mK Temperatures in Dry Dilution Refrigerators",
    "abstract": "This article presents an evaluation of off-the-shelf commercial accelerometers at the mixing chamber stage of a cryogen-free dilution refrigerator at temperatures down to 8 mK. In addition, we present results of radioassay of accelerometer samples using a high purity germanium detector counting setup. Cryogen-free dilution refrigerators using pulse-tube cryocoolers (PTs)-due to recent advances in their cooling capacity, long-term stability, and operational costs-have become ubiquitous tools in a wide range of fields ranging from experimental particle physics to quantum information sciences. However, vibrations induced by PTs can negatively impact the experimental payload in these applications. This work demonstrates that commercially available accelerometers can not only measure vibrations at millikelvin cryogenic temperatures but also pave the way for continuous, in situ, real-time vibration monitoring of dry dilution refrigerators.",
    "authors": [
      "A. D'Addabbo",
      "S. D'Eramo",
      "S. H. Fu",
      "M. T. Hurst",
      "T. O'Donnell",
      "S. Petti",
      "V. Sharma",
      "P. T. Surukuchi",
      "A. Torres",
      "C. Wengappuliarachchige",
      "K. J. Vetter",
      "N. Brace"
    ],
    "published": "2026-01-13T18:53:13Z",
    "updated": "2026-01-13T18:53:13Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.07652v2",
    "url": "https://arxiv.org/abs/2601.07652v2",
    "pdf_url": "https://arxiv.org/pdf/2601.07652v2.pdf",
    "title": "Role of Shafranov shift, zonal structures on the behavior of TAEs, AAEs and microinstabilities in the presence of energetic particles",
    "abstract": "In future nuclear fusion reactors, even a small fraction of fusion-born energetic particles (EP) about 100 times hotter than the thermal bulk species, contributes substantially to the kinetic pressure and therefore affect the MHD equilibrium, mainly via the Shafranov shift. In this work, we perform first-principles numerical simulations using the gyrokinetic, electromagnetic, global code ORB5 to study the effect of a self-consistent finite $β$ equilibrium on the arising Alfvén Eigenmodes (destabilized by EPs), Ion Temperature Gradient (ITG), and Kinetic Ballooning Modes (KBM) microturbulence (destabilized by thermal species). Linearly, we explore the complex interplay between EP fraction, bulk gradients and a self-consistent Shafranov shift on the plasma stability. We choose single toroidal mode numbers to represent the system's instabilities and study the characteristic nonlinear evolutions of TAEs, KBMs and ITGs separately and including the axisymmetric field response to each mode separately. This study focuses on the impact of Shafranov shift equilibrium consistency, as well as the self-generated zonal ${E \\times B}$ flows, the saturation levels and resulting heat and particle fluxes. In the ITG cases including the $n=0$ perturbations reduces turbulent fluxes, as expected, however, for the TAE cases including the $n=0$ perturbations is shown to enhance the fluxes. We show for the first time that Axisymmetric Alfvén Eigenmodes (AAEs) play a role in this mechanism.",
    "authors": [
      "B. Rofman",
      "G. Di Giannatale",
      "A. Mishchenko",
      "E. Lanti",
      "A. Bottino",
      "T. Hayward-Schneider",
      "J. N. Sama",
      "A. Biancalani",
      "B. F. McMillan",
      "S. Brunner",
      "L. Villard"
    ],
    "published": "2026-01-12T15:33:13Z",
    "updated": "2026-01-13T18:38:01Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.08746v1",
    "url": "https://arxiv.org/abs/2601.08746v1",
    "pdf_url": "https://arxiv.org/pdf/2601.08746v1.pdf",
    "title": "Search for Cosmic Ray Electron Boosted Dark Matter with the CDEX-10 Experiment",
    "abstract": "We present new constraints on the cosmic ray electron boosted light dark matter (CReDM) using the 205.4 kg$\\cdot$day data of the CDEX-10 experiment located at the China Jinping Underground Laboratory. The cosmic ray electron spectrum and distribution in the Galaxy are generated by the $\\tt GALPROP$ code package. In the calculation process of DM-electron scattering process in the Galaxy, we consider the energy-dependency of the DM-electron scattering cross section. The constraints on CReDM are set for both heavy and light mediator scenarios using the CDEX-10 dataset. The result exceeds previous Standard Halo Model (SHM) limits for DM mass lower than 0.6 MeV in heavy mediator case and corresponds to the best sensitivity among all direct detection experiments from 1 keV to 0.5 MeV in the light mediator scenario.",
    "authors": [
      "R. Xu",
      "L. T. Yang",
      "Q. Yue",
      "K. J. Kang",
      "Y. J. Li",
      "H. P. An",
      "Greeshma C.",
      "J. P. Chang",
      "H. Chen",
      "Y. H. Chen",
      "J. P. Cheng",
      "J. Y. Cui",
      "W. H. Dai",
      "Z. Deng",
      "Y. X. Dong",
      "C. H. Fang",
      "H. Gong",
      "Q. J. Guo",
      "T. Guo",
      "X. Y. Guo",
      "L. He",
      "J. R. He",
      "H. X. Huang",
      "T. C. Huang",
      "S. Karmakar",
      "Y. S. Lan",
      "H. B. Li",
      "H. Y. Li",
      "J. M. Li",
      "J. Li",
      "M. C. Li",
      "Q. Y. Li",
      "R. M. J. Li",
      "X. Q. Li",
      "Y. L. Li",
      "Y. F. Liang",
      "B. Liao",
      "F. K. Lin",
      "S. T. Lin",
      "J. X. Liu",
      "R. Z. Liu",
      "S. K. Liu",
      "Y. D. Liu",
      "Y. Liu",
      "Y. Y. Liu",
      "H. Ma",
      "Y. C. Mao",
      "A. Mureed",
      "H. Pan",
      "N. C. Qi",
      "J. Ren",
      "X. C. Ruan",
      "M. B. Shen",
      "H. Y. Shi",
      "M. K. Singh",
      "T. X. Sun",
      "W. L. Sun",
      "C. J. Tang",
      "Y. Tian",
      "H. F. Wan",
      "G. F. Wang",
      "J. Z. Wang",
      "L. Wang",
      "Q. Wang",
      "Q. Wang",
      "Y. F. Wang",
      "Y. X. Wang",
      "H. T. Wong",
      "Y. C. Wu",
      "H. Y. Xing",
      "K. Z. Xiong",
      "Y. Xu",
      "T. Xue",
      "Y. L. Yan",
      "N. Yi",
      "C. X. Yu",
      "H. J. Yu",
      "X. Yu",
      "M. Zeng",
      "Z. Zeng",
      "F. S. Zhang",
      "P. Zhang",
      "P. Zhang",
      "Z. Y. Zhang",
      "M. G. Zhao",
      "J. F. Zhou",
      "Z. Y. Zhou",
      "J. J. Zhu"
    ],
    "published": "2026-01-13T17:25:00Z",
    "updated": "2026-01-13T17:25:00Z",
    "categories": [
      "hep-ex",
      "hep-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2505.10754v3",
    "url": "https://arxiv.org/abs/2505.10754v3",
    "pdf_url": "https://arxiv.org/pdf/2505.10754v3.pdf",
    "title": "Conservative velocity mappings for discontinuous Galerkin kinetics",
    "abstract": "Continuum computational kinetic plasma models evolve the distribution function of a plasma species $f_s$ on a phase-space grid over time. In many problems of interest the distribution function has limited extent in velocity space; hence, using a uniform, highly refined mesh would be costly and slow. Nonuniform velocity grids can reduce the computational cost by placing more degrees of freedom where $f_s$ is appreciable and fewer where it is not. In this work we introduce a first-of-its kind discontinuous Galerkin approach to nonuniform velocity-space discretization using mapped velocity coordinates. This new method is presented in the context of a gyrokinetic model used to study magnetized plasmas. We create discretizations of collisionless and collisional terms using mappings in a way that exactly conserves particles and energy. Numerical tests of such properties are presented, and we show that this new discretization can reproduce earlier gyrokinetic simulations using grids with up to 6-60 times fewer cells and 22X-60X speed-ups depending on dimensionality, geometry and plasma parameters.",
    "authors": [
      "Manaure Francisquez",
      "Petr Cagas",
      "Akash Shukla",
      "James Juno",
      "Gregory W. Hammett"
    ],
    "published": "2025-05-15T23:47:41Z",
    "updated": "2026-01-13T17:08:02Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.08589v1",
    "url": "https://arxiv.org/abs/2601.08589v1",
    "pdf_url": "https://arxiv.org/pdf/2601.08589v1.pdf",
    "title": "Bridging Theory and Experiment in Virtually Imaged Phased Array (VIPA) Spectrometers",
    "abstract": "Virtually imaged phased array (VIPA) spectrometers provide high resolution and fast acquisition in a compact design, but their performance as dispersive instruments is sensitive to fabrication tolerances, component dimensions, and alignment. Here, leveraging numerical simulations validated by experimental data, we present a framework to identify the parameters that limit VIPA spectrometer resolution. This framework is applied to the construction of a new mid infrared VIPA spectrometer, tested at wavelengths near 4.6 um with both continuous-wave and frequency-comb laser sources, with a resolving power predicted by analytical expressions to be as high as RP = 830 000 (corresponding to a resolution of 78 MHz). Validated numerical simulations, however, provided a more realistic estimate that captures limits set by all the optical components. By correcting aberrations and optimizing alignment, a resolving power of RP = 440 000 (150 MHz) was experimentally achieved, corresponding to 80% of the value predicted by numerical simulation of the entire spectrometer. These results bridge the gap between analytical design expressions and experimental results for compact, high-resolution VIPA spectrometers to enable more efficient fabrication and advanced design across critical areas like applied space optics, line-by-line pulse shaping, and broadband spectral sensors.",
    "authors": [
      "Kiumars Aryana",
      "D. Michelle Bailey",
      "Solomon I. Woods",
      "Adam J. Fleisher"
    ],
    "published": "2026-01-13T14:16:04Z",
    "updated": "2026-01-13T14:16:04Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2504.17988v3",
    "url": "https://arxiv.org/abs/2504.17988v3",
    "pdf_url": "https://arxiv.org/pdf/2504.17988v3.pdf",
    "title": "Observation of narrow-band $γ$ radiation from a boron-doped diamond superlattice with an 855 MeV electron beam",
    "abstract": "We report the first observation of narrow band 1.3 MeV $γ$ radiation from a crystalline micro-undulator. A diamond superlattice was grown with a periodical varying boron doping profile. Four sinusoidally deformed (110) planes resulted with a period length of 5.0 $μ$m and an amplitude of 0.098 nm. A channeling experiment was performed with the 855 MeV electron beam of the Mainz Microtron MAMI A accelerator facility. A clear peak was detected with a large sodium iodide scintillation detector close to the expected photon energy of 1.28 MeV. Key characteristics of the peak, including photon energy, width and intensity, were reproduced fairly well by Monte-Carlo simulation calculations. Based on the latter, optimized boron doping profiles were designed for the 1.6 GeV beam of MAMI C and a hypothetical 3 GeV beam, enabling preparation of highly directional $γ$-ray beams with photon energies of 4.2 and 14.5 MeV. The predicted spectral bandwidths are, respectively, about 18\\% and 13\\%, however, with a high energy continuum tail. The on-target photon flux at a beam current of 100 $μ$A would be about $10^{12}$/s for the 14.5 MeV photon beam.",
    "authors": [
      "Hartmut Backe",
      "José Baruchel",
      "Simon Bénichou",
      "Rébecca Dowek",
      "David Eon",
      "Pierre Everaere",
      "Lutz Kirste",
      "Pascal Klag",
      "Werner Lauth",
      "Patrik Straňák",
      "Thu Nhi Tran Caliste"
    ],
    "published": "2025-04-25T00:10:35Z",
    "updated": "2026-01-13T14:02:20Z",
    "categories": [
      "physics.ins-det",
      "physics.app-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2506.02202v2",
    "url": "https://arxiv.org/abs/2506.02202v2",
    "pdf_url": "https://arxiv.org/pdf/2506.02202v2.pdf",
    "title": "Magnetic field dynamics in presence of Hall conductivity and thermo-diffusion",
    "abstract": "Anisotropy of kinetic coefficients in presence of a magnetic field is   represented by Hall currents, which appear in a collisional medium due to action of the Lorentz force on the charged particles between collisions.   We derive equations, describing dynamics of the magnetic field in presence of thermo-diffusion with Hall currents, using a standard electrodynamic consideration. The influence of the Hall currents, at presence of thermo-diffusion, on the magnetic field structure is considered in simple models. The equation is derived, which includes additional term for a seed magnetic field creation in the non-magnetized plasma, due to thermo-diffusion. This equation describes the action of the seed magnetic field creation by the mechanism known as \"Biermann battery\".",
    "authors": [
      "G. S. Bisnovatyi-Kogan",
      "M. V. Glushikhina"
    ],
    "published": "2025-06-02T19:41:56Z",
    "updated": "2026-01-13T13:39:45Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.08532v1",
    "url": "https://arxiv.org/abs/2601.08532v1",
    "pdf_url": "https://arxiv.org/pdf/2601.08532v1.pdf",
    "title": "Enhanced Athermal Phonon Responsivity in a Kinetic Inductance Detector with Integrated Phonon Collectors",
    "abstract": "Cryogenic phonon detectors are adopted in light dark matter searches and coherent elastic neutrino-nucleus scattering experiments as they can achieve low energy thresholds. The phonon mediated sensing of silicon particle absorbers has already been proved with Kinetic Inductance Detectors (KIDs), acting both as sensors and athermal phonon absorbers at the same time. In this work we present the design and the performance of an improved detector, where the KID acts only as sensor and is coupled to dedicated phonon collectors. The separation between the detector and the collectors increases the variation of the quasi-particle density within the device, thereby enhancing its responsivity. The meander of the KID is composed of a 77nm trilayer wire of Aluminum-Titanium-Aluminum, while the phonon collectors are made of a 100nm Aluminum layer and act as quasi-particles funnels. Inside the collectors, the absorbed athermal phonons generate quasi-particles which, after diffusion, are trapped in the lower-gap superconducting trilayer. The performance of this setup is compared to that of a standard phonon-mediated KID, showing an increase in responsivity by around a factor of five.",
    "authors": [
      "Leonardo Pesce",
      "Alessio Ludovico De Santis",
      "Martino Calvo",
      "Matteo Cappelli",
      "Usasi Chowdhury",
      "Angelo Cruciani",
      "Giorgio Del Castello",
      "Daniele Delicato",
      "Matteo Folcarelli",
      "Matteo del Gallo Roccagiovine",
      "Alessandro Monfardini",
      "Davide Quaranta",
      "Marco Vignati"
    ],
    "published": "2026-01-13T13:17:19Z",
    "updated": "2026-01-13T13:17:19Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.08496v1",
    "url": "https://arxiv.org/abs/2601.08496v1",
    "pdf_url": "https://arxiv.org/pdf/2601.08496v1.pdf",
    "title": "Design and construction of a cryogenic subcooler-box for supplying single phase supercritical helium to dark matter and gravitational wave experiments",
    "abstract": "We report on the design, development, and installation of the ALPS Cryo-Platform Subcooler Box (ACPS), which is part of the cryogenic platform being established in the HERA North Hall at DESY to supply helium for cooling large-scale dark-matter and gravitational-wave experiments with very high heat loads. The ACPS is capable of subcooling supercritical helium supplied via the 1.6-km-long HERA transfer line by means of a pipe heat exchanger immersed in a subcooler bath filled with liquid helium produced through Joule-Thomson valves. It is also equipped with numerous cryogenic components, including control valves, flow meters, and safety valves, enabling experimental operation to be carried out directly by the ACPS itself and thereby reducing the cryogenic requirements imposed on the experiments. To support a wide range of experiments, the ACPS provides three transfer lines that deliver different levels of cooling power.",
    "authors": [
      "Udai Raj Singh",
      "Rajinikumar Ramalingam",
      "Christoph Reinhardt",
      "Olaf Korth",
      "Jörg Penning",
      "Jörn Schaffran",
      "Axel Lindner"
    ],
    "published": "2026-01-13T12:31:16Z",
    "updated": "2026-01-13T12:31:16Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.08413v1",
    "url": "https://arxiv.org/abs/2601.08413v1",
    "pdf_url": "https://arxiv.org/pdf/2601.08413v1.pdf",
    "title": "High-power beyond extreme ultraviolet FEL radiation with flexible polarization at SHINE",
    "abstract": "Linac-based free-electron lasers (FELs) feature high brightness, narrow bandwidth, controllable polarization, and wide wavelength tunability. With the rapid development of superconducting radio-frequency technology, linacs can now operate at MHz-level repetition rates, enabling FELs with both high repetition rates and high average power. Beyond extreme ultraviolet (BEUV) radiation is of great interest for scientific research and industrial applications, especially for next-generation lithography. Owing to the main design parameters of SHINE, the generation of BEUV radiation is a natural capability of the facility. The BEUV characteristics at SHINE are investigated and its achievable performance as a high-average-power light source is evaluated. By applying undulator tapering to enhance the energy extraction efficiency, kilowatt-level BEUV radiation with controllable polarization is shown to be achievable. These results demonstrate that SHINE can provide a high-performance BEUV source, offering a realistic pathway toward a high-average-power light source for next-generation high-resolution lithography.",
    "authors": [
      "Hanxiang Yang",
      "Zhangfeng Gao",
      "Bingyang Yan",
      "Wencai Cheng",
      "Nanshun Huang",
      "Haixiao Deng"
    ],
    "published": "2026-01-13T10:32:20Z",
    "updated": "2026-01-13T10:32:20Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.08400v1",
    "url": "https://arxiv.org/abs/2601.08400v1",
    "pdf_url": "https://arxiv.org/pdf/2601.08400v1.pdf",
    "title": "Near-axis quasi-isodynamic database",
    "abstract": "In this work, we investigate the landscape of quasi-isodynamic stellarators using the near-axis expansion of the magnetic field. Building on recent theoretical developments, we construct a database of more than 800,000 stable, approximately quasi-isodynamic vacuum magnetic configurations. These configurations span a range of field period numbers and other geometric control parameters, including the magnetic axis shape and plasma elongation. To evaluate each configuration, we use a broad set of measures, including effective ripple, sensitivity of the Shafranov shift to changes in plasma beta, the prevalence of maximum-J trapped particles, and the Rosenbluth-Hinton residual, among others. This enables an exhaustive, thorough and quantitative characterization of the database. Statistical analysis and modern machine learning techniques are then employed to find correlations, and identify key descriptors and heuristics to help understand tendencies that govern the behaviour of numerical optimization. The database provides baseline configurations for further studies, and to serve as tailored initial conditions for optimization. With this work we initiate a long term program to complete a systematic exploration of quasi-isodynamic stellarator design space.",
    "authors": [
      "Eduardo Rodriguez",
      "Gabriel G. Plunk"
    ],
    "published": "2026-01-13T10:15:40Z",
    "updated": "2026-01-13T10:15:40Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.08384v1",
    "url": "https://arxiv.org/abs/2601.08384v1",
    "pdf_url": "https://arxiv.org/pdf/2601.08384v1.pdf",
    "title": "Electric field-driven Rayleigh-Taylor-like instability in binary complex plasma",
    "abstract": "This study uses two-dimensional molecular dynamics simulations to explore Rayleigh-Taylor-like instability in a strongly coupled binary complex plasma, when heavier dust particles are positioned above the lighter ones, having the same charge-to-mass ratio, in a planar configuration. Langevin dynamics simulations are used to study the evolution of perturbations at the interface between these two distinct species of charged dust particles, subject to an externally applied electric field and an equilibrium charge density gradient. We have performed analytical calculations to determine the growth rate of instability under both strongly coupled and weakly coupled dusty plasma regimes. These theoretical predictions are subsequently validated through molecular dynamics simulations, enabling the reproduction of the instability in a strongly coupled binary complex plasma. The instability in these cases ultimately causes mixing among the charged species. The study comprehensively analyzes the growth rate as a function of various system parameters, and it offers deeper insight into the underlying physical mechanisms.",
    "authors": [
      "Priya Deshwal",
      "Hitendra K. Malik"
    ],
    "published": "2026-01-13T09:48:42Z",
    "updated": "2026-01-13T09:48:42Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.03857v2",
    "url": "https://arxiv.org/abs/2511.03857v2",
    "pdf_url": "https://arxiv.org/pdf/2511.03857v2.pdf",
    "title": "Challenges and strategies in verification of FastRICH ASIC for the LHCb RICH detector",
    "abstract": "The FastRICH ASIC provides high-precision, triggerless readout for the LS3 Enhancements and Upgrades II of the LHCb RICH detector. The demands of continuous data acquisition and varying hit rates across the detector impose unique challenges on the ASIC's design and verification. This work presents the verification strategy for FastRICH, focusing on functional correctness, timing performance, and operational robustness. The methodology includes simulations across occupancy scenarios, validation of timing precision, and stress testing under pile-up and high-rate conditions. Results demonstrate that FastRICH meets its performance requirements over the full range of expected occupancies. Key design and verification challenges specific to triggerless, fast-timing ASICs are discussed, along with lessons learned for future developments.",
    "authors": [
      "M. Lupi",
      "R. Ballabriga",
      "F. N. Bandi",
      "G. Bergamin",
      "D. Ceresa",
      "D. Gascon",
      "S. Gomez",
      "J. Kaplon",
      "R. Manera",
      "J. Mauricio",
      "A. Paternò",
      "D. Peninon-Herbaut",
      "A. Pulli",
      "S. Scarfì",
      "G. J. Wegrzyn",
      "K. Wyllie"
    ],
    "published": "2025-11-05T20:58:06Z",
    "updated": "2026-01-13T08:53:33Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.08329v1",
    "url": "https://arxiv.org/abs/2601.08329v1",
    "pdf_url": "https://arxiv.org/pdf/2601.08329v1.pdf",
    "title": "Velocity-Space Signatures of Energy Transfer for Ion-Acoustic Instabilities",
    "abstract": "Context. Observations by Parker Solar Probe (PSP) of electrostatic waves suggest that electrostatic instabilities, including the ion-ion-acoustic instability (IIAI) frequently observed in the inner heliosphere, play an important role in plasma heating and particle acceleration. Aims. Our aim is to explore the application of single spacecraft diagnostics to the IIAI, in anticipation of application to the current missions operating in the inner heliosphere, e.g. PSP and Solar Orbiter. Methods. We apply the field-particle correlation (FPC) technique to fully kinetic simulations of IIAI. We characterize the conversion of energy between the electric field and particle species, allowing the differentiation between oscillatory and secular energy transfer to and from the particles and highlighting the role of resonant energy exchange. We then identify the characteristic IIAI signatures for the proton and electron distributions, and relate them to our previous knowledge of IIAI onset and energy exchange mechanisms. Results. Applying the FPC technique to our simulations run in parameters regime compatible with solar wind conditions, we have identified IIAI signatures that would enable efficient recognition of IIAI in observations. This task is left for future missions, since the time scale over which IIAI signatures develop is too fast for the sampling rates of current missions.",
    "authors": [
      "Mahmoud Saad Afify",
      "Kristopher G. Klein",
      "Mihailo M. Martinović",
      "Maria Elena Innocenti"
    ],
    "published": "2026-01-13T08:32:19Z",
    "updated": "2026-01-13T08:32:19Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.08313v1",
    "url": "https://arxiv.org/abs/2601.08313v1",
    "pdf_url": "https://arxiv.org/pdf/2601.08313v1.pdf",
    "title": "Interstellar Medium Modulation of Nonlinear Kinetic Alfvén Morphology in Structured Galactic Environments",
    "abstract": "We present a spatially dependent framework for the existence and propagation of nonlinear kinetic Alfvén (KA) structures in the interstellar medium (ISM). Using a multi-component analytical model that incorporates the diffuse warm ionized medium together with localized H II regions, supernova remnants (SNR), and stellar-wind bubbles (SWB), we derive location-dependent coefficients governing KA dispersion and nonlinearity. The reductive perturbation method is applied to obtain Korteweg-de Vries (KdV) equations, enabling the characterization of solitons under realistic astrophysical conditions. Numerical analysis demonstrates how superthermality, plasma $β$, temperature, and density gradients modulate soliton amplitude, width, and stability. Our results reveal distinct exclusion zones (EZs) for KA solitons in high-$β$ HII regions and SWB/SNR interiors, as well as ultra low-$β$ regions near central pulsar wind nebulae. While H II regions exhibit simple Gaussian-driven depletions, the complex ``hole-and-shell\" morphologies of SWBs and SNRs imprint sharp spatial variations and discontinuities on soliton properties. This study establishes a direct link between macroscopic ISM morphology, ion-kinetic scale dissipation, and the emergence of coherent Alfvénic activity, with implications for radio scattering, pulsar scintillation, and fine-scale signatures in astrophysical observations.",
    "authors": [
      "Manpreet Singh",
      "Siming Liu",
      "N. S. Saini"
    ],
    "published": "2026-01-13T08:10:48Z",
    "updated": "2026-01-13T08:10:48Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.08138v1",
    "url": "https://arxiv.org/abs/2601.08138v1",
    "pdf_url": "https://arxiv.org/pdf/2601.08138v1.pdf",
    "title": "The effect of surface quenching coefficients of $O_2(a^{1}Δg)$ and $O_2(b^{1}Σg^{+})$ on capacitively coupled $Ar$/$O_2$ discharge: A global/equivalent circuit model study",
    "abstract": "Capacitively coupled discharges operated in mixtures of $Ar$ and $O_2$ are extensively utilized in plasma etching and deposition processes due to the oxidative properties and precursor functionality of the reactive species produced in the discharge. In $Ar$/$O_2$ discharges, the surface quenching coefficient of $O_2(a^{1}Δg)$ is known to affect this metastable density, which, in turn, affects the electronegativity and other important plasma characteristics. In this work, in addition to $O_2(a^{1}Δg)$, $O_2(b^{1}Σg^{+})$ and its associated reactions are incorporated into a global/equivalent circuit model of an $Ar$/$O_2$ discharge. By independently adjusting the quenching coefficients of both metastable species, changes of these surface coefficients are found to significantly affect the discharge characteristics, indicating that the role of $O_2(b^{1}Σg^{+})$ cannot be neglected. The effects of their respective surface quenching coefficients of these metastables based on various wall materials on the discharge are revealed including their effects on different particle species densities, plasma impedance, voltage drops across the sheaths, as well as plasma power absorption.",
    "authors": [
      "Wan Dong",
      "Yi Wang",
      "Yi-Fan Zhang",
      "Yuan-Hong Song"
    ],
    "published": "2026-01-13T01:59:59Z",
    "updated": "2026-01-13T01:59:59Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.00365v2",
    "url": "https://arxiv.org/abs/2601.00365v2",
    "pdf_url": "https://arxiv.org/pdf/2601.00365v2.pdf",
    "title": "Influence of Cathode Boundary and Initial Electron Swarm Width on Electron Swarm Parameter Determination with the Pulsed Townsend Experiment",
    "abstract": "The Pulsed Townsend experiment enables the extraction of relevant electron transport properties in different gases such as the electron drift velocity $W$ (or equivalently the mobility $μ$), the longitudinal diffusion coefficient $D_{\\mathrm{L}}$, and the effective ionization rate $R_{\\mathrm{net}}$ (or equivalently the effective ionization coefficient $α_{\\mathrm{eff}}$). Existing analysis techniques lack an accurate representation of the experimental initial and boundary conditions. This work aims to provide an improved evaluation approach by appropriately considering both initial and boundary conditions in order to extract more accurate swarm parameters from measurement data. Simulative and experimental measurement results verify an increased evaluation accuracy. Furthermore, the longitudinal diffusion coefficient $D_{\\mathrm{L}}$ can now be accurately extracted from Pulsed Townsend measurements. The developed curve fitting code is made publicly available.",
    "authors": [
      "Mücahid Akbas"
    ],
    "published": "2026-01-01T14:53:12Z",
    "updated": "2026-01-12T23:20:03Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.08054v1",
    "url": "https://arxiv.org/abs/2601.08054v1",
    "pdf_url": "https://arxiv.org/pdf/2601.08054v1.pdf",
    "title": "The Topological Origin of Bohm Resistivity in Magnetic Reconnection",
    "abstract": "The physical origin of 'anomalous' resistivity in magnetic reconnection remains one of the longest-standing problems in space plasma physics. While the empirical Bohm diffusion scaling ($η~\\propto~T/B$) is widely invoked to explain fast reconnection rates, it lacks a rigorous derivation from first principles. Here, we derive this scaling by modeling the magnetized electron fluid as an overdamped spintronic condensate governed by the Landau-Lifshitz-Gilbert equation. We demonstrate that the breakdown of the \"frozen-in\" condition is rigorously identified as an Adler-Ohmic bifurcation: a topological phase transition where electron gyro-axes lose synchronization with the magnetic field. By rigorously mapping the breakdown of adiabatic invariance to electron gyro axis slippage on the unit sphere, we show that the resulting resistivity naturally saturates at the Bohm limit. Numerical simulations of the $XY$ universality class confirm that the onset of this resistive state is explosive, following a logistic trigger consistent with the impulsive phase of solar flares. Furthermore, the topological defects in the condensate decay via a $t^{-0.75}$ power law, identifying magnetic island coalescence as the mechanism of anomalous transport. These results suggest that Bohm resistivity is a universal topological property of magnetized matter at the critical point of reconnection.",
    "authors": [
      "Magnus F Ivarsen"
    ],
    "published": "2026-01-12T22:48:40Z",
    "updated": "2026-01-12T22:48:40Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR",
      "cond-mat.soft",
      "cond-mat.stat-mech",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.08009v1",
    "url": "https://arxiv.org/abs/2601.08009v1",
    "pdf_url": "https://arxiv.org/pdf/2601.08009v1.pdf",
    "title": "Understanding microfabricated nanocalorimeter performance and responses to the energy fluxes from low-temperature plasma discharges",
    "abstract": "Plasma diagnostics have a shortage of fast and sensitive calorimetric sensors that can track substrate temperature during plasma-assisted microfabrication. In this work, energy fluxes from argon and oxygen radiofrequency (RF) glow discharges have been probed using a novel nanocalorimeter sensor. The probe consists of an ultrathin SiNx membrane (100 nm) with a lithographically defined Pt micro-strip (100 nm) that serves as a calibrated resistance thermometer. The sensor temperature can increase from room temperature to several hundred degrees within a second upon exposure to RF plasma, depending on the experiment's geometry and plasma parameters. Such sensitivity and response time are due to the pre-designed reduced heat capacity of the sensor and significantly reduced thermal conductance of the cooling channels. These features enable the sensitive detection of low-energy plasma fluxes on surfaces and their rapid discrimination, as in the case of ion and electron fluxes, by biasing the sensor at negative or positive potentials. These biased nanocalorimeter energy readings have been compared with ion and electron kinetic energy dissipations assessed using a Langmuir probe and retarding field energy analyzer (RFEA). Finally, the robustness of the plasma nanocalorimeter is discussed in terms of its baseline drifts, degradation, and longevity.",
    "authors": [
      "Carles Corbella",
      "Feng Yi",
      "Andrei Kolmakov"
    ],
    "published": "2026-01-12T21:24:43Z",
    "updated": "2026-01-12T21:24:43Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.00282v2",
    "url": "https://arxiv.org/abs/2510.00282v2",
    "pdf_url": "https://arxiv.org/pdf/2510.00282v2.pdf",
    "title": "Electron neural closure for turbulent magnetosheath simulations: energy channels",
    "abstract": "In this work, we introduce a non-local five-moment electron pressure tensor closure parametrized by a Fully Convolutional Neural Network (FCNN). Electron pressure plays an important role in generalized Ohm's law, competing with electron inertia. This model is used in the development of a surrogate model for a fully kinetic energy-conserving semi-implicit Particle-in-Cell simulation of decaying magnetosheath turbulence. We achieve this by training FCNN on a representative set of simulations with a smaller number of particles per cell and showing that our results generalise to a simulation with a large number of particles per cell. We evaluate the statistical properties of the learned equation of state, with a focus on pressure-strain interaction, which is crucial for understanding energy channels in turbulent plasmas. The resulting equation of state learned via FCNN significantly outperforms local closures, such as those learned by Multi-Layer Perceptron (MLP) or double adiabatic expressions. We report that the overall spatial distribution of pressure-strain and its conditional averages are reconstructed well. However, some small-scale features are missed, especially for the off-diagonal components of the pressure tensor. Nevertheless, the results are substantially improved with more training data, indicating favorable scaling and potential for improvement, which will be addressed in future work.",
    "authors": [
      "George Miloshevich",
      "Luka Vranckx",
      "Felipe Nathan de Oliveira Lopes",
      "Pietro Dazzi",
      "Giuseppe Arrò",
      "Giovanni Lapenta"
    ],
    "published": "2025-09-30T21:00:50Z",
    "updated": "2026-01-12T19:44:21Z",
    "categories": [
      "physics.plasm-ph",
      "cs.LG",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2408.06216v2",
    "url": "https://arxiv.org/abs/2408.06216v2",
    "pdf_url": "https://arxiv.org/pdf/2408.06216v2.pdf",
    "title": "CANISIUS The Austrian Neutron Spin Echo Interferometer",
    "abstract": "The broad band resonant spin echo interferometer, CANISIUS, is presented. CANISIUS is built in a versatile way, such that it can be operated in both a continuous broad band beam or a pulsed Time of Flight beam. This versatility also extends to the modes available to the instrument, such as Neutron Resonant Spin Echo, Spin Echo (Modulated) Small Angle Neutron Scattering and coherent averaging to produce structured wavefunctions for scattering. The instrument may also be used as an interferometer, to probe fundamental questions in quantum mechanics. In this paper we detail both the continuous and Time of Flight options of the instruments. In addition we demonstrate the applicability of our interferometer to ultra small angle scattering in a white beam. Finally we demonstrate a new spin echo interferometry tool, which uses incomplete recombination of the two path states to generate composite wavefunctions with special structure. In particular we show that this method produces neutron wavefunctions that exist in a superposition of two quantum mechanical OAM modes, l =+1 or -1 We illustrate that just as this method can be used to generate certain structured waves, it may also be used to characterize the structure of the input wavefunction.",
    "authors": [
      "Niels Geerits",
      "Simon Hack",
      "Lara Brukner",
      "Ad van Well",
      "Steven R. Parnell",
      "Hartmut Abele",
      "Stephan Sponar"
    ],
    "published": "2024-08-12T15:12:14Z",
    "updated": "2026-01-12T18:18:03Z",
    "categories": [
      "physics.ins-det",
      "physics.app-ph",
      "quant-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.17305v2",
    "url": "https://arxiv.org/abs/2511.17305v2",
    "pdf_url": "https://arxiv.org/pdf/2511.17305v2.pdf",
    "title": "Efficient calculation of magnetic fields from ferromagnetic materials near strong electromagnets, and application to stellarator coil optimization",
    "abstract": "In fusion reactor design, steels under consideration for the blanket are ferromagnetic, so the steel's effect on the plasma physics must be examined. For efficient calculation of these fields, we can exploit the fact that the magnetic material gives a small perturbation relative to the fields from the electromagnetic coils and plasma. Moreover the magnetization is saturated due to the strong fields in typical fusion systems. These approximations significantly reduce the nonlinearity of the problem, so the magnetic materials can be described by an array of point dipoles of known magnitude, oriented in the direction of the coil and plasma field. The approach is verified by comparison to finite-element calculations with commercial software and shown to be accurate. As no linear or nonlinear solve is required, only evaluation of Biot-Savart-type integrals, the method here is significantly simpler to implement than other methods, and extremely fast. The method is compatible with arbitrary CAD geometry, and also allows rapid computation of the magnetic forces. We demonstrate adding the ferromagnetic effects to free-boundary MHD equilibrium calculations, assessing the effect on plasma properties such as confinement and stability. Moreover, it is straightforward to differentiate through the model to get the derivative of the field with respect to the electromagnet parameters. We thereby demonstrate gradient-based coil optimization for a quasi-isodynamic stellarator in which the field contribution from a ferromagnetic blanket is included. Even a significant steel volume is found to have little impact on the plasma physics properties, with the main effects being a slight destabilization of ballooning modes and a radial shift of the edge islands due to decrease in rotational transform. Both issues are corrected by minor reoptimization of the coil shapes to account for the field from the steel.",
    "authors": [
      "Matt Landreman",
      "Humberto Torreblanca",
      "Antoine Cerfon"
    ],
    "published": "2025-11-21T15:19:49Z",
    "updated": "2026-01-12T17:57:34Z",
    "categories": [
      "physics.plasm-ph",
      "physics.app-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1016/j.fusengdes.2026.115627"
  },
  {
    "arxiv_id": "2512.03997v2",
    "url": "https://arxiv.org/abs/2512.03997v2",
    "pdf_url": "https://arxiv.org/pdf/2512.03997v2.pdf",
    "title": "Comment on \"Monochromatization interaction region optics design for direct s-channel Higgs production at FCC-ee\"",
    "abstract": "The original article [1] can be logically divided into two parts: 1) the selection of main parameters for monochromatization and 2) interaction region optics design; the comment pertains only to the first part. The authors of [1] state that \"The purpose of this paper is to report on the development of realistic IR optics designs for monochromatization at the FCC-ee\". However, the proposed parameters do not seem very realistic and raise many questions; due to space limitations, we will only consider the most important ones.",
    "authors": [
      "Dmitry Shatilov"
    ],
    "published": "2025-12-03T17:29:11Z",
    "updated": "2026-01-12T17:27:46Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.17288v3",
    "url": "https://arxiv.org/abs/2509.17288v3",
    "pdf_url": "https://arxiv.org/pdf/2509.17288v3.pdf",
    "title": "Nonlinear anisotropic equilibrium reconstruction in axisymmetric magnetic mirrors",
    "abstract": "Magnetic equilibrium reconstruction is a crucial simulation capability for interpreting diagnostic measurements of experimental plasmas. Equilibrium reconstruction has mostly been applied to systems with isotropic pressure and relatively low plasma $β= 2μ_0p/B^2$. This work extends nonlinear equilibrium reconstruction to high-$β$ plasmas with anisotropic pressure and applies it to the Wisconsin High Temperature Superconducting Axisymmetric Magnetic Mirror experiments to infer the presence of sloshing ions. A novel basis set for the plasma profiles and machine learning algorithm using scalable constrained Bayesian optimization allow accurate nonlinear reconstructions with uncertainty quantification to be made more quickly with fewer experimental diagnostics and improves the robustness of reconstructions at high $β$. In addition to WHAM and other mirrors, such reconstruction techniques are potentially attractive in high-performance devices with constrained diagnostic capabilities such as fusion power plants.",
    "authors": [
      "S. J. Frank",
      "I. Agarwal",
      "J. K. Anderson",
      "B. Biswas",
      "E. Claveau",
      "D. Endrizzi",
      "C. Everson",
      "R. W. Harvey",
      "S. Murdock",
      "Yu. V. Petrov",
      "J. Pizzo",
      "T. Qian",
      "K. Sanwalka",
      "K. Shih",
      "D. A. Sutherland",
      "A. Tran",
      "J. Viola",
      "D. Yakovlev",
      "M. Yu",
      "C. B. Forest"
    ],
    "published": "2025-09-22T00:00:18Z",
    "updated": "2026-01-12T16:57:13Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.07699v1",
    "url": "https://arxiv.org/abs/2601.07699v1",
    "pdf_url": "https://arxiv.org/pdf/2601.07699v1.pdf",
    "title": "Noise2Void for Denoising Atomic Resolution Scanning Transmission Electron Microscopy Images",
    "abstract": "The Noise2Void technique is demonstrated for successful denoising of atomic-resolution scanning transmission electron microscopy (STEM) images. The technique is applied to denoising atomic resolution images and videos of gold adatoms on a graphene surface within a graphene liquid cell, with the denoised experimental data qualitatively demonstrating improved visibility of both the Au adatoms and the graphene lattice. The denoising performance is quantified by comparison to similar simulated data and the approach is found to significantly outperform both total variation and simple Gaussian blurring. Compared to other denoising methods, the Noise2Void technique has the combined advantages that it requires no manual intervention during training or denoising, no prior knowledge of the sample and is compatible with real time data acquisition rates of at least 45 frames per second.",
    "authors": [
      "William Thornley",
      "Sam Sullivan-Allsop",
      "Rongsheng Cai",
      "Nick Clark",
      "Roman Gorbachev",
      "Sarah J. Haigh"
    ],
    "published": "2026-01-12T16:31:04Z",
    "updated": "2026-01-12T16:31:04Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "doi": "10.1038/s41524-025-01939-1"
  },
  {
    "arxiv_id": "2601.07682v1",
    "url": "https://arxiv.org/abs/2601.07682v1",
    "pdf_url": "https://arxiv.org/pdf/2601.07682v1.pdf",
    "title": "Sub-Pixel Electron Beam Alignment for Machine Learning Characterization of Hybrid Pixel Detectors",
    "abstract": "Due to their radiation hardness, kilohertz frame rates, and high dynamic range, hybrid pixel detectors have recently expanded their application range to electron diffraction and recently also electron imaging. However, these detectors typically have pixel sizes about ten times larger than those of direct electron detectors commonly used for imaging and more prominent electron multiple scattering effects. To overcome these limitations, machine learning approaches can be utilized to reconstruct the electron entrance point and achieve super-resolution. As this process is inherently stochastic, and machine learning relies on suitable training data, high-quality, representative training data are essential for developing models that achieve the best possible resolution. In this work, we present two novel experimental methods for generating such training data. The first method employs precise microscope alignment to scan the detector plane using a finely focused electron beam of 2 μm diameter, enabling controlled sub-pixel mapping. The second method utilizes specially designed aperture masks with sub-pixel-sized holes to accurately localize electron entry points. We developed and validated two experimental strategies for collecting training data at acceleration voltages of 60, 80, 120, and 200 keV, which enable sub-pixel labeling for hybrid pixel detectors. Notably, our methodology is broadly applicable to a wide range of hybrid pixel detectors.",
    "authors": [
      "Emiliya Poghosyan",
      "Xiangyu Xie",
      "Joakim Reuteler",
      "Kirsty A. Paton",
      "Luis Barba Flores",
      "Benjamin Béjar Haro",
      "Erik Fröjdh",
      "Anna Bergamaschi",
      "Elisabeth Müller"
    ],
    "published": "2026-01-12T16:14:14Z",
    "updated": "2026-01-12T16:14:14Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.05456v6",
    "url": "https://arxiv.org/abs/2507.05456v6",
    "pdf_url": "https://arxiv.org/pdf/2507.05456v6.pdf",
    "title": "Constraints on the magnetic field evolution in tokamak power plants",
    "abstract": "Tokamaks differ fundamentally from stellarators in the importance of the external coils for determining the magnetic field structure. Tokamak plasmas are in a self-organized state, especially when fusion rather than external heating dominates. Stellarator optimization focuses on the magnetic fields that can be produced by the coils. Tokamak optimization considers plasma profiles, which are largely determined by microturbulent transport and not easily controlled. A deviation of the profile of the plasma current over its full range of stability against disruptions produces only a small change, $\\sim 10\\%$, in the poloidal flux produced by the plasma current. This offers a simple explanation of why disruptions in tokamaks are so common, and why current-profile control though difficult may be required, especially during plasma shutdowns. The rapid temporal decay of $nτ_ET$ in high performance tokamak experiments shows the need for the careful control for other profiles. Here the focus is on the implications of Faraday's Law since important but new implications are easily derived. The context of the paper is twofold: (1) Simplified statements of the implications of the laws of physics, in particular Faraday's Law, which should be helpful in the design of tokamak power plants. (2) Thoughtful allocation of resources among the various fusion concepts to minimize the time and the cost to the achievement of practical fusion power.",
    "authors": [
      "Allen H Boozer"
    ],
    "published": "2025-07-07T20:17:20Z",
    "updated": "2026-01-12T15:25:23Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.07633v1",
    "url": "https://arxiv.org/abs/2601.07633v1",
    "pdf_url": "https://arxiv.org/pdf/2601.07633v1.pdf",
    "title": "Performance Benchmarks for 2-View and 3-View Fiber-Projection Fine-Grained Particle Detectors",
    "abstract": "Fine-grained scintillator detectors are critical for precision measurements in nuclear and particle physics, where accurate reconstruction of interaction vertices and secondary particle directions enables separation of signal from background events. A well-known design choice is the fiber readout geometry: traditional 2-View systems use orthogonal X and Y fibers, while next-generation 3-View designs add a third Z-fiber layer that provides unambiguous 3D voxel identification. The 2-View approach suffers from combinatorial ghost hits, that the false 3D candidates arising from fiber projection ambiguities, degrading reconstruction performance in high-multiplicity events. This paper presents comprehensive simulation benchmarks quantifying the performance difference between 2-View and 3-View geometries across key metrics. We find that the 3-View geometry reduces ghost hits by 30--90\\% depending on event topology, provides robust vertex resolution across complex topologies, and maintains superior angular resolution for shower direction reconstruction. These benchmarks inform the design optimization of future detectors and provide quantitative guidance for reconstruction algorithm development across a broad range of experiments including neutrino physics, rare kaon/pion decays, and collider calorimetry.",
    "authors": [
      "Haohui Che",
      "Guang Yang"
    ],
    "published": "2026-01-12T15:15:30Z",
    "updated": "2026-01-12T15:15:30Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.07587v1",
    "url": "https://arxiv.org/abs/2601.07587v1",
    "pdf_url": "https://arxiv.org/pdf/2601.07587v1.pdf",
    "title": "Performance of the Pair Spectrometer in Hall D at Jefferson Lab",
    "abstract": "This article describes the performance of the pair spectrometer installed in experimental Hall D at Jefferson Lab and its operation in multiple experiments with the GlueX detector. The primary purpose of the pair spectrometer is the precise determination of the flux of beam photons incident on the GlueX target, a critical input for physics analyses such as absolute cross-section measurements. The photon energy spectrum is determined by reconstructing electron-positron pairs produced in a thin converter inserted into the photon beam. The spectrometer is integrated into the GlueX trigger system, enabling continuous real-time monitoring of the photon flux and the recording of $e^+e^-$ pair candidates for offline analysis. In addition, the pair spectrometer provides a versatile test facility for evaluating calorimeter prototypes using leptons with well-defined energies produced via electromagnetic pair production.",
    "authors": [
      "Alexander Somov",
      "Sergey Somov",
      "Vladimir V. Berdnikov"
    ],
    "published": "2026-01-12T14:36:41Z",
    "updated": "2026-01-12T14:36:41Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.07580v1",
    "url": "https://arxiv.org/abs/2601.07580v1",
    "pdf_url": "https://arxiv.org/pdf/2601.07580v1.pdf",
    "title": "Large Language Models for Physics Instrument Design",
    "abstract": "We study the use of large language models (LLMs) for physics instrument design and compare their performance to reinforcement learning (RL). Using only prompting, LLMs are given task constraints and summaries of prior high-scoring designs and propose complete detector configurations, which we evaluate with the same simulators and reward functions used in RL-based optimization. Although RL yields stronger final designs, we find that modern LLMs consistently generate valid, resource-aware, and physically meaningful configurations that draw on broad pretrained knowledge of detector design principles and particle--matter interactions, despite having no task-specific training. Based on this result, as a first step toward hybrid design workflows, we explore pairing the LLMs with a dedicated trust region optimizer, serving as a precursor to future pipelines in which LLMs propose and structure design hypotheses while RL performs reward-driven optimization. Based on these experiments, we argue that LLMs are well suited as meta-planners: they can design and orchestrate RL-based optimization studies, define search strategies, and coordinate multiple interacting components within a unified workflow. In doing so, they point toward automated, closed-loop instrument design in which much of the human effort required to structure and supervise optimization can be reduced.",
    "authors": [
      "Sara Zoccheddu",
      "Shah Rukh Qasim",
      "Patrick Owen",
      "Nicola Serra"
    ],
    "published": "2026-01-12T14:30:54Z",
    "updated": "2026-01-12T14:30:54Z",
    "categories": [
      "physics.ins-det",
      "cs.AI",
      "cs.LG",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.19020v2",
    "url": "https://arxiv.org/abs/2508.19020v2",
    "pdf_url": "https://arxiv.org/pdf/2508.19020v2.pdf",
    "title": "Spatiotemporal shaping of attosecond X-rays with time-dependent orbital angular momentum",
    "abstract": "Attosecond X-ray pulses are indispensable for exploring ultrafast phenomena in matter on Angstrom and attosecond scales. Here we propose a new method to realize spatiotemporal shaping of attosecond X-rays through temporal control of the orbital angular momentum mode content using an X-ray free-electron laser. The method exploits transverse-mode-dependent frequency pulling in a deliberately detuned second stage, together with slippage between the seed and the amplified radiation. Three-dimensional simulations show a double-spike waveform in which the two spikes carry different dominant topological charges. The spike separation is tunable and can reach several hundred attoseconds. This provides a source-level route to spatiotemporally structured attosecond X-rays with controllable temporal structure and topological mode content.",
    "authors": [
      "Chenzhi Xu",
      "Jiawei Yan",
      "Gianluca Geloni",
      "Christoph Lechner",
      "Haixiao Deng"
    ],
    "published": "2025-08-26T13:40:41Z",
    "updated": "2026-01-12T14:16:50Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.05274v2",
    "url": "https://arxiv.org/abs/2507.05274v2",
    "pdf_url": "https://arxiv.org/pdf/2507.05274v2.pdf",
    "title": "Online Electron Reconstruction at CLAS12",
    "abstract": "Online reconstruction is key for monitoring purposes and real time analysis in High Energy and Nuclear Physics experiments. A necessary component of reconstruction algorithms is particle identification that combines information left by a particle passing through several detector components to identify the particle's type. Of particular interest to electroproduction Nuclear Physics experiments such as CLAS12 is electron identification which is used to trigger data recording. A machine learning approach was developed for CLAS12 to reconstruct and identify electrons by combining raw signals at the data acquisition level from several detector components. This approach achieves an electron identification purity above 75% whilst retaining an efficiency close to 100%. The machine learning tools are capable of running at high rates exceeding the data acquisition rates and will allow electron reconstruction in real time. This work enhances online analyses and monitoring and can contribute to improved triggering at CLAS12. This machine learning driven approach will also be crucial for experiments aiming to transition to streaming readout operations where online reconstruction will be a key component of the data taking paradigm.",
    "authors": [
      "Richard Tyson",
      "Gagik Gavalian"
    ],
    "published": "2025-07-03T21:09:27Z",
    "updated": "2026-01-12T13:39:50Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.07486v1",
    "url": "https://arxiv.org/abs/2601.07486v1",
    "pdf_url": "https://arxiv.org/pdf/2601.07486v1.pdf",
    "title": "A radiation two-phase flow model for simulating plasma-liquid interactions",
    "abstract": "In laser-produced plasma (LPP) extreme ultraviolet (EUV) sources, deformation of a tin droplet into an optimal target shape is governed by its interaction with a pre-pulse laser-generated plasma. This interaction is mediated by a transient ablation pressure, whose complex spatio-temporal evolution remains experimentally inaccessible. Existing modeling approaches are limited: Empirical pressure-impulse models neglect dynamic plasma feedback, while advanced radiation-hydrodynamic codes often fail to resolve late-time droplet hydrodynamics. To bridge this gap, we propose a radiation two-phase flow model based on a diffuse interface methodology. The model integrates radiation hydrodynamics for the plasma with the Euler equations for a weakly compressible liquid, extending a five-equation diffuse interface formulation to incorporate radiation transport, thermal conduction, and ionization. This formulation enforces pressure and velocity equilibrium across the diffuse interface region, with closure models constructed to ensure correct jump conditions at interfaces and asymptotically recover the pure-phase equations in bulk regions. Then, we apply the model to simulate a benchmark pre-pulse scenario, where a 50 micron tin droplet is irradiated by a 10 ns laser pulse. The simulations capture the rapid plasma expansion and subsequent inertial flattening of the droplet into a thin, curved sheet over microsecond timescales. Notably, the model reproduces experimentally observed features (such as an axial jet) rarely replicated in prior simulations. Quantitative agreement with experimental data for sheet dimensions and velocity validates the approach. The proposed model self-consistently couples laser-plasma physics with compressible droplet dynamics, providing a powerful tool for fundamental studies of plasma-liquid interactions in LPP-EUV source optimization.",
    "authors": [
      "Ke-Jian Qian",
      "Zhu-Jun Li",
      "Tao Tao",
      "De-Hua Zhang",
      "Rui Yan",
      "Hang Ding"
    ],
    "published": "2026-01-12T12:40:59Z",
    "updated": "2026-01-12T12:40:59Z",
    "categories": [
      "physics.plasm-ph",
      "physics.flu-dyn"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.02467v3",
    "url": "https://arxiv.org/abs/2511.02467v3",
    "pdf_url": "https://arxiv.org/pdf/2511.02467v3.pdf",
    "title": "Demonstration of Sub-Percent Energy Resolution in the NEXT-100 Detector",
    "abstract": "NEXT-100 is a high-pressure xenon time projection chamber with electroluminescent amplification, designed to operate with up to approximately 70.5 kg at 13.5 bar. It is the most recent detector developed by the NEXT collaboration to search for the neutrinoless double-beta decay ($ββ0ν$) of Xe-136. The NEXT gas TPC technology offers the best energy resolution near the Q-value of the decay ($Q_{ββ}$ = 2458 keV) among xenon detectors, which is set by design to be <1% FWHM. We report here the high-energy calibration of the detector using a Th-228 source, demonstrating linear response and an energy resolution of $(0.90 \\pm 0.02)$% FWHM at the Tl-208 photopeak (2615 keV). This performance extrapolates to a resolution at the double-beta decay end-point of $R(Q_{ββ})$ = $(0.93 \\pm 0.02)$% FWHM, confirming the detector's capability for precision energy measurement in the search for $ββ0ν$.",
    "authors": [
      "NEXT Collaboration",
      "M. Pérez Maneiro",
      "M. Martínez-Vara",
      "S. Torelli",
      "G. Martínez-Lema",
      "P. Novella",
      "J. A. Hernando Morata",
      "J. J. Gómez-Cadenas",
      "C. Adams",
      "H. Almazán",
      "V. Álvarez",
      "A. I. Aranburu",
      "L. Arazi",
      "I. J. Arnquist",
      "F. Auria-Luna",
      "S. Ayet",
      "Y. Ayyad",
      "C. D. R. Azevedo",
      "K. Bailey",
      "F. Ballester",
      "J. E. Barcelon",
      "M. del Barrio-Torregrosa",
      "A. Bayo",
      "J. M. Benlloch-Rodríguez",
      "F. I. G. M. Borges",
      "A. Brodoline",
      "N. Byrnes",
      "A. Castillo",
      "E. Church",
      "L. Cid",
      "M. Cid",
      "X. Cid",
      "C. A. N. Conde",
      "C. Cortes-Parra",
      "F. P. Cossío",
      "R. Coupe",
      "E. Dey",
      "P. Dietz",
      "C. Echeverria",
      "M. Elorza",
      "R. Esteve",
      "R. Felkai",
      "L. M. P. Fernandes",
      "P. Ferrario",
      "F. W. Foss",
      "Z. Freixa",
      "J. García-Barrena",
      "J. W. R. Grocott",
      "R. Guenette",
      "J. Hauptman",
      "C. A. O. Henriques",
      "P. Herrero-Gómez",
      "V. Herrero",
      "C. Hervés Carrete",
      "Y. Ifergan",
      "A. F. B. Isabel",
      "B. J. P. Jones",
      "F. Kellerer",
      "L. Larizgoitia",
      "A. Larumbe",
      "F. Lopez",
      "N. López-March",
      "R. Madigan",
      "R. D. P. Mano",
      "A. Marauri",
      "A. P. Marques",
      "J. Martín-Albo",
      "A. Martínez",
      "R. L. Miller",
      "K. Mistry",
      "J. Molina-Canteras",
      "F. Monrabal",
      "C. M. B. Monteiro",
      "F. J. Mora",
      "K. E. Navarro",
      "D. R. Nygren",
      "E. Oblak",
      "J. Palacio",
      "B. Palmeiro",
      "I. Parmaksiz",
      "A. Pazos",
      "J. Pelegrin",
      "M. Querol",
      "J. Renner",
      "I. Rivilla",
      "C. Rogero",
      "L. Rogers",
      "B. Romeo",
      "C. Romo-Luque",
      "E. Ruiz-Chóliz",
      "P. Saharia",
      "F. P. Santos",
      "J. M. F. dos Santos",
      "M. Seemann",
      "I. Shomroni",
      "A. L. M. Silva",
      "P. A. O. C. Silva",
      "A. Simón",
      "S. R. Soleti",
      "M. Sorel",
      "J. Soto-Oton",
      "J. M. R. Teixeira",
      "S. Teruel-Pardo",
      "J. F. Toledo",
      "C. Tonnelé",
      "J. Torrent",
      "A. Trettin",
      "P. R. G. Valle",
      "M. Vanga",
      "P. Vázquez Cabaleiro",
      "J. F. C. A. Veloso",
      "J. D. Villamil",
      "J. Waiton",
      "A. Yubero-Navarro"
    ],
    "published": "2025-11-04T10:50:29Z",
    "updated": "2026-01-12T12:14:14Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.07897v1",
    "url": "https://arxiv.org/abs/2601.07897v1",
    "pdf_url": "https://arxiv.org/pdf/2601.07897v1.pdf",
    "title": "Consideration for a gamma source at EupraXia",
    "abstract": "In this paper, we present the potentiality and the application of a Compton source driven by the electron beam of EuPRAXIA, in interaction with a commercially available infrared laser.",
    "authors": [
      "Luca Serafini",
      "Vittoria Petrillo",
      "Alessio DelDotto",
      "Illya Drebot",
      "Anna Giribono",
      "Andrea Ghigo",
      "Stefano Romeo",
      "Andrea Renato Rossi",
      "Cristina Vaccarezza",
      "Fabio Villa",
      "Massimo Ferrario"
    ],
    "published": "2026-01-12T11:41:05Z",
    "updated": "2026-01-12T11:41:05Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  }
]