{
  "arxiv_id": "2510.09978v1",
  "url": "https://arxiv.org/abs/2510.09978v1",
  "pdf_url": "https://arxiv.org/pdf/2510.09978v1.pdf",
  "title": "Studying the properties of reconnection-driven turbulence",
  "abstract": "Magnetic reconnection, often accompanied by turbulence interaction, is a ubiquitous phenomenon in astrophysical environments. However, the current understanding of the nature of turbulent magnetic reconnection remains insufficient. We investigate the statistical properties of reconnection turbulence in the framework of the self-driven reconnection. Using the open-source software package AMUN, we first perform numerical simulations of turbulent magnetic reconnection. We then obtain the statistical results of reconnection turbulence by traditional statistical methods such as the power spectrum and structure function. Our numerical results demonstrate: (1) the velocity spectrum of reconnection turbulence follows the classical Kolmogorov type of $E\\propto k^{-5/3}$, while the magnetic field spectrum is steeper than the Kolmogorov spectrum, which are independent of limited resistivity, guide field, and isothermal or adiabatic fluid states; (2) most of the simulations show the anisotropy cascade, except that the presence of a guide field leads to an isotropic cascade; (3) reconnection turbulence is incompressible in the adiabatic state, with energy distribution dominated by the velocity solenoidal component; (4) different from pure magnetohydrodynamic (MHD) turbulence, the intermittency of the velocity field is stronger than that of the magnetic field in reconnection turbulence. The steep magnetic field spectrum, together with the velocity spectrum of Kolmogorov type, can characterize the feature of the reconnection turbulence. In the case of the presence of the guide field, the isotropy of the reconnection turbulence cascade is also different from the cascade mode of pure MHD turbulence. Our experimental results provide new insights into the properties of reconnection turbulence, which will contribute to advancing the self-driven reconnection theory.",
  "authors": [
    "Shi-Min Liang",
    "Jian-Fu Zhang",
    "Na-Na Gao",
    "Nian-Yu Yi"
  ],
  "published": "2025-10-11T03:14:25Z",
  "updated": "2025-10-11T03:14:25Z",
  "categories": [
    "astro-ph.HE",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.HE"
}