{
  "arxiv_id": "2510.13502v1",
  "url": "https://arxiv.org/abs/2510.13502v1",
  "pdf_url": "https://arxiv.org/pdf/2510.13502v1.pdf",
  "title": "A New Method for Aperture Masking Interferometric Imaging: Demonstration   with the JWST",
  "abstract": "We present a new method for aperture masking interferometric (AMI) imaging at near-IR wavelengths using radio astronomical techniques. The method starts with derivation of interferometric visibilities from a Fourier transform of the interferograms. An iterative joint optimization process is then employed, using self-calibration of the interferometric element-based complex voltage gains (i.e. electric fields), and CLEAN deconvolution to obtain the source structure. We demonstrate the efficacy of the method using the NIRISS aperture masking interferometer on the James Webb Space Telescope (JWST) at 4.8~$\\mu$m and 3.8~$\\mu$m. Due to a number of effects (the large pixel size, charge migration, near-field optics), the method also requires an initial visibility-based amplitude normalization using observations of a well know point-source calibration star. We employ early science observations of the dusty binary Wolf-Rayet star WR137. Images with a dynamic range (peak/rms) of $\\sim 240$ on the target, and $\\sim 1000$ on the calibrator, are synthesized from a short integration. The self-calibration process determines the photon path-lengths through the optical system to each aperture using data on the target source itself, thereby representing an essentially 'real-time', precise wavefront error sensor. Four independent measures of the JWST mirror segment pistons (two wavelengths for two sources), agree to within 10~nm to 15~nm, comparable to the expected errors based on an analysis of closure phases on the calibrator star. Including a baseline-based phase correction improves the dynamic range of the final images by about 23\\%.",
  "authors": [
    "Christopher Carilli",
    "Bojan Nikolic",
    "Laura Torino",
    "N. Thyagarajan",
    "Ubaldo Iriso"
  ],
  "published": "2025-10-15T12:51:57Z",
  "updated": "2025-10-15T12:51:57Z",
  "categories": [
    "astro-ph.IM",
    "physics.acc-ph",
    "physics.optics"
  ],
  "primary_category": "astro-ph.IM"
}