{
  "arxiv_id": "2510.11504v3",
  "url": "https://arxiv.org/abs/2510.11504v3",
  "pdf_url": "https://arxiv.org/pdf/2510.11504v3.pdf",
  "title": "Towards polarization-enhanced PET: Study of random background in   polarization-correlated Compton events",
  "abstract": "Positron Emission Tomography (PET) is a medical imaging modality that utilizes positron-emitting isotopes, such as Ga-68 and F-18, for many diagnostic purposes. The positron annihilates with an electron from the surrounding area, creating two photons of 511 keV energy and opposite momenta, entangled in their orthogonal polarizations. When each photon undergoes a Compton scattering process, the difference of their azimuthal scattering angles reflects the initial orthogonality of their polarizations, peaking at $\\pm$90$^{\\circ}$. This type of correlation is not yet utilized in conventional PET scanners, but could potentially offer an energy-independent method for background reduction. Measurements of these kinds of correlations can be achieved using Compton polarimeters, built from a single layer of segmented scintillating crystals such as Gadolinium Aluminium Gallium Garnet doped with Cerium (GAGG:Ce), read out by silicon photomultipliers (SiPMs). In this paper, we study the signal-to-random background ratios in measurements of these correlated annihilation photons from coincidence time spectra across clinically relevant source activities, from $\\sim$200 MBq to $\\sim$378 MBq. These are then compared to the standard single-pixel (photoelectric) measurements. We find that the signal-to-random background ratios (SBRs) obtained from the polarization-correlated events for Compton scattering angles $\\theta_{1,2}\\in[72^{\\circ}, 90^{\\circ}]$ and azimuthal angle difference $\\Delta\\phi=90^{\\circ}\\pm20^{\\circ}$ are consistently higher than those from single-pixel events, with the ratio of their SBR values of 1.23. The SBR of the selected events also increases with the polarimetric modulation factor $\\mu$, gaining $\\sim$50\\% in value during the experiment.",
  "authors": [
    "Ana Marija Kožuljević",
    "Tomislav Bokulić",
    "Darko Grošev",
    "Siddharth Parashari",
    "Luka Pavelić",
    "Marinko Rade",
    "Marijan Žuvić",
    "Mihael Makek"
  ],
  "published": "2025-10-13T15:14:06Z",
  "updated": "2025-10-15T20:10:46Z",
  "categories": [
    "physics.ins-det",
    "physics.med-ph"
  ],
  "primary_category": "physics.ins-det"
}