[
  {
    "arxiv_id": "2510.11504v3",
    "url": "https://arxiv.org/abs/2510.11504v3",
    "pdf_url": "https://arxiv.org/pdf/2510.11504v3.pdf",
    "title": "Towards polarization-enhanced PET: Study of random background in   polarization-correlated Compton events",
    "abstract": "Positron Emission Tomography (PET) is a medical imaging modality that utilizes positron-emitting isotopes, such as Ga-68 and F-18, for many diagnostic purposes. The positron annihilates with an electron from the surrounding area, creating two photons of 511 keV energy and opposite momenta, entangled in their orthogonal polarizations. When each photon undergoes a Compton scattering process, the difference of their azimuthal scattering angles reflects the initial orthogonality of their polarizations, peaking at $\\pm$90$^{\\circ}$. This type of correlation is not yet utilized in conventional PET scanners, but could potentially offer an energy-independent method for background reduction. Measurements of these kinds of correlations can be achieved using Compton polarimeters, built from a single layer of segmented scintillating crystals such as Gadolinium Aluminium Gallium Garnet doped with Cerium (GAGG:Ce), read out by silicon photomultipliers (SiPMs). In this paper, we study the signal-to-random background ratios in measurements of these correlated annihilation photons from coincidence time spectra across clinically relevant source activities, from $\\sim$200 MBq to $\\sim$378 MBq. These are then compared to the standard single-pixel (photoelectric) measurements. We find that the signal-to-random background ratios (SBRs) obtained from the polarization-correlated events for Compton scattering angles $\\theta_{1,2}\\in[72^{\\circ}, 90^{\\circ}]$ and azimuthal angle difference $\\Delta\\phi=90^{\\circ}\\pm20^{\\circ}$ are consistently higher than those from single-pixel events, with the ratio of their SBR values of 1.23. The SBR of the selected events also increases with the polarimetric modulation factor $\\mu$, gaining $\\sim$50\\% in value during the experiment.",
    "authors": [
      "Ana Marija Kožuljević",
      "Tomislav Bokulić",
      "Darko Grošev",
      "Siddharth Parashari",
      "Luka Pavelić",
      "Marinko Rade",
      "Marijan Žuvić",
      "Mihael Makek"
    ],
    "published": "2025-10-13T15:14:06Z",
    "updated": "2025-10-15T20:10:46Z",
    "categories": [
      "physics.ins-det",
      "physics.med-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2506.23718v2",
    "url": "https://arxiv.org/abs/2506.23718v2",
    "pdf_url": "https://arxiv.org/pdf/2506.23718v2.pdf",
    "title": "High brightness multi-MeV photon source driven by a petawatt-scale laser   wakefield accelerator",
    "abstract": "We present an experimental demonstration of a bright multi-MeV gamma source driven by a petawatt laser. The source generates on average $(1.2\\pm0.6)\\times10^9$ photons above 1 MeV per pulse, exceeding those of previous all-optical sources by a hundred times, and reached a peak spectral brightness of $(3.9 \\pm 1.5)\\times 10^{22}$ photons/mm$^2$/mrad$^2$/s/0.1%BW at $\\epsilon_\\gamma\\approx11$ MeV. The source was produced by inverse Compton scattering of a laser wakefield accelerated GeV electron beam and its back-reflected driving laser pulse. Its performance is well described by a simple model of the laser and electron properties at the collision point that allows quantitative predictions and identifies clear strategies to further enhance radiation efficiency. Our results highlight the promise of this source for fundamental physics studies, as well as for applications of nuclear resonance fluorescence and nuclear transmutation.",
    "authors": [
      "E. Gerstmayr",
      "B. Kettle",
      "M. J. V. Streeter",
      "L. Tudor",
      "O. J. Finlay",
      "L. E. Bradley",
      "R. Fitzgarrald",
      "T. Foster",
      "P. Gellersen",
      "A. E. Gunn",
      "O. Lawrence",
      "P. P. Rajeev",
      "B. K. Russell",
      "D. R. Symes",
      "C. D. Murphy",
      "A. G. R. Thomas",
      "C. P. Ridgers",
      "G. Sarri",
      "S. P. D. Mangles"
    ],
    "published": "2025-06-30T10:46:45Z",
    "updated": "2025-10-15T17:10:43Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2503.20904v3",
    "url": "https://arxiv.org/abs/2503.20904v3",
    "pdf_url": "https://arxiv.org/pdf/2503.20904v3.pdf",
    "title": "Experimental evidence of production of directional muons from a   laser-wakefield accelerator",
    "abstract": "We report on experimental evidence of the generation of directional muons from a laser-wakefield accelerator driven by a PW-class laser. The muons were generated following the interaction of a GeV-scale high-charge electron beam with a 2cm-thick Pb target and were detected using a Timepix3 detector placed behind a suitable shielding configuration. Data analysis indicates a $(99.1\\pm0.5)$% confidence of muon detection over noise, in excellent agreement with numerical modelling. Extrapolation of the experimental setup to higher electron energies and charges suggests the potential to guide and separate from noise approximately $10^4$ muons/s onto cm$^2$-scale areas for applications using a 10 Hz PW laser. These results demonstrate the possibility of generating and transporting directional muon beams using high-power lasers and establish a foundation for the systematic application of laser-driven high-energy muon beams.",
    "authors": [
      "L. Calvin",
      "E. Gerstmayr",
      "C. Arran",
      "L. Tudor",
      "T. Foster",
      "K. Fleck",
      "B. Bergmann",
      "D. Doria",
      "B. Kettle",
      "H. Maguire",
      "V. Malka",
      "P. Manek",
      "S. P. D. Mangles",
      "P. McKenna",
      "R. E. Mihai",
      "C. Ridgers",
      "J. Sarma",
      "P. Smolyanskiy",
      "R. Wilson",
      "R. M. Deas",
      "G. Sarri"
    ],
    "published": "2025-03-26T18:19:07Z",
    "updated": "2025-10-15T16:52:10Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2501.04886v3",
    "url": "https://arxiv.org/abs/2501.04886v3",
    "pdf_url": "https://arxiv.org/pdf/2501.04886v3.pdf",
    "title": "Distributed network of smartphone sensors: a new tool for scientific   field measurements",
    "abstract": "Smartphones sensors are now commonly used by a worldwide audience thanks to their availability, high connectivity, and versatility. Here, we present a methodology to use a collection of smartphones, namely a fleet, as a distributed network of time-synchronized mechanical sensors. We first present the mechanical tests we develop to evaluate the smartphone sensor accuracy. We then describe how to use efficiently a distributed network of smartphones as autonomous sensors. We use a combination of an Android application hosted on each phone (Gobannos), and a server application (Phonefleet) on a controlling host to perform the tasks in parallel remotely. We detail the time synchronisation protocol we implemented, based on UDP communication. We achieved an accuracy of the time synchronisation of 60 microseconds, more than enough for all mechanical applications. Eventually, we present two test cases in which we use a smartphone fleet for mechanical wave measurements in field conditions.",
    "authors": [
      "J. Zhang",
      "N. Mokus",
      "J. Casoli",
      "A. Eddi",
      "S. Perrard"
    ],
    "published": "2025-01-08T23:53:22Z",
    "updated": "2025-10-15T16:22:14Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.13711v1",
    "url": "https://arxiv.org/abs/2510.13711v1",
    "pdf_url": "https://arxiv.org/pdf/2510.13711v1.pdf",
    "title": "Comparative Evaluation of Xilinx RFSoC Platform for Low-Level RF Systems",
    "abstract": "The rapid advancement of Radio Frequency System-onChip (RFSoC) technology from Xilinx (AMD) has enabled the integration of high-speed data converters and programmable logic within a single package. RFSoC platforms are already widely adopted in telecommunications, radar, and satellite communications, where they promise reductions in system footprint and power consumption. However, their suitability for Low-Level RF (LLRF) control systems in accelerator environments - where stability requirements are critical - has not been quantitatively evaluated. This paper presents a comparative measurement-based assessment of RFSoC-based and conventional LLRF designs, focusing on signal fidelity, phase noise, latency, system complexity, and integration challenges. The advantages and challenges of adopting RFSoC-based direct conversion architectures are discussed, providing guidance for future LLRF system implementations.",
    "authors": [
      "Shreeharshini Dharanesh Murthy",
      "Victoria Moore",
      "Qiang Du",
      "Angel Jurado",
      "Michael Chin",
      "Keith Penney",
      "David Nett",
      "Benjamin Flugstad"
    ],
    "published": "2025-10-15T16:11:18Z",
    "updated": "2025-10-15T16:11:18Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.13521v1",
    "url": "https://arxiv.org/abs/2510.13521v1",
    "pdf_url": "https://arxiv.org/pdf/2510.13521v1.pdf",
    "title": "Narrow Operator Models of Stellarator Equilibria in Fourier Zernike   Basis",
    "abstract": "Numerical computation of the ideal Magnetohydrodynamic (MHD) equilibrium magnetic field is at the base of stellarator optimisation and provides the starting point for solving more sophisticated Partial Differential Equations (PDEs) like transport or turbulence models. Conventional approaches solve for a single stationary point of the ideal MHD equations, which is fully defined by three invariants and the numerical scheme employed by the solver. We present the first numerical approach that can solve for a continuous distribution of equilibria with fixed boundary and rotational transform, varying only the pressure invariant. This approach minimises the force residual by optimising parameters of multilayer perceptrons (MLP) that map from a scalar pressure multiplier to the Fourier Zernike basis as implemented in the modern stellarator equilibrium solver DESC.",
    "authors": [
      "Timo Thun",
      "Rory Conlin",
      "Dario Panici",
      "Daniel Böckenhoff"
    ],
    "published": "2025-10-15T13:13:42Z",
    "updated": "2025-10-15T13:13:42Z",
    "categories": [
      "physics.plasm-ph",
      "cs.AI",
      "cs.LG"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.13505v1",
    "url": "https://arxiv.org/abs/2510.13505v1",
    "pdf_url": "https://arxiv.org/pdf/2510.13505v1.pdf",
    "title": "Attosecond Waveform Synthesis through Echo-enabled Harmonic Generation   Free-electron Lasers",
    "abstract": "Attosecond pulse trains (APTs) are indispensable for probing electron dynamics at their intrinsic timescales. High harmonic generation (HHG) has long been a successful and widely used technique in producing extreme ultraviolet APTs. While in the soft X-ray regime, HHG suffers from low conversion efficiency and lacking flexibility in the waveform and spectrum control. Here in this study, based on the waveform synthesis of the echo-enabled harmonic generation (EEHG) free-electron laser (FEL), we propose a novel method that can generate soft X-ray APTs with high temporal and spectral tunability. EEHG scheme is well-known in forming phase-locked high harmonic bunching combs down to the soft X-ray regime. And We can facilitate successive FEL lasing in several different harmonic numbers and then perform the coherent waveform synthesis to generate soft X-ray APTs. Three-dimensional simulation results indicate that reproducible generation of coherent APTs in the soft X-ray regime with peak power of 3.5 GW and micropulse duration of 160 as can be achieved by five-harmonic synthesis. And the micropulse duration together with the spectral components of the APTs can be adjusted easily according to the programmable high harmonic bunching combs in the EEHG scheme. This method has the potential to establish a robust platform for attosecond sciences in the soft X-ray regime, which can enable unprecedented studies of electron dynamics in physical and chemical reactions, biological systems and quantum materials.",
    "authors": [
      "Lanpeng Ni",
      "Junhao Liu",
      "Zheng Qi",
      "Chao Feng"
    ],
    "published": "2025-10-15T12:55:32Z",
    "updated": "2025-10-15T12:55:32Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.13502v1",
    "url": "https://arxiv.org/abs/2510.13502v1",
    "pdf_url": "https://arxiv.org/pdf/2510.13502v1.pdf",
    "title": "A New Method for Aperture Masking Interferometric Imaging: Demonstration   with the JWST",
    "abstract": "We present a new method for aperture masking interferometric (AMI) imaging at near-IR wavelengths using radio astronomical techniques. The method starts with derivation of interferometric visibilities from a Fourier transform of the interferograms. An iterative joint optimization process is then employed, using self-calibration of the interferometric element-based complex voltage gains (i.e. electric fields), and CLEAN deconvolution to obtain the source structure. We demonstrate the efficacy of the method using the NIRISS aperture masking interferometer on the James Webb Space Telescope (JWST) at 4.8~$\\mu$m and 3.8~$\\mu$m. Due to a number of effects (the large pixel size, charge migration, near-field optics), the method also requires an initial visibility-based amplitude normalization using observations of a well know point-source calibration star. We employ early science observations of the dusty binary Wolf-Rayet star WR137. Images with a dynamic range (peak/rms) of $\\sim 240$ on the target, and $\\sim 1000$ on the calibrator, are synthesized from a short integration. The self-calibration process determines the photon path-lengths through the optical system to each aperture using data on the target source itself, thereby representing an essentially 'real-time', precise wavefront error sensor. Four independent measures of the JWST mirror segment pistons (two wavelengths for two sources), agree to within 10~nm to 15~nm, comparable to the expected errors based on an analysis of closure phases on the calibrator star. Including a baseline-based phase correction improves the dynamic range of the final images by about 23\\%.",
    "authors": [
      "Christopher Carilli",
      "Bojan Nikolic",
      "Laura Torino",
      "N. Thyagarajan",
      "Ubaldo Iriso"
    ],
    "published": "2025-10-15T12:51:57Z",
    "updated": "2025-10-15T12:51:57Z",
    "categories": [
      "astro-ph.IM",
      "physics.acc-ph",
      "physics.optics"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2510.13482v1",
    "url": "https://arxiv.org/abs/2510.13482v1",
    "pdf_url": "https://arxiv.org/pdf/2510.13482v1.pdf",
    "title": "Low-impedance stripline kicker for the transverse instability   suppression system of the synchrotron radiation facility \"SKIF\" light source",
    "abstract": "Construction of the new fourth generation synchrotron radiation facility (SRF) \"SKIF\" near Novosibirsk is nearing completion. \"SKIF\" uniqueness is ultra-low 75 pm natural emittance at 400 mA beam current and 3 GeV beam energy.   Collective effects (beam interaction with the vacuum chamber) are the main obstacles of achieving such emittance and beam current. To suppress these effects the storage ring will be equipped with a bunch-by-bunch feedback system. Important components of the feedback system are a stripline (fast) kicker and a beam position monitor.   The paper describes design of the low-impedance stripline kicker for SRF \"SKIF\" storage ring, optimized for the manufacturing and for the uniformity of the imparted transverse kick. The kicker qualities such as S-parameters, imparted transverse momentum, transfer and beam impedances are presented. The chosen length of the stripline kicker allows its use as a beam position monitor.",
    "authors": [
      "M. A. Baistrukov",
      "E. A. Bekhtenev",
      "A. A. Krasnov",
      "D. A. Nikiforov",
      "P. A. Piminov"
    ],
    "published": "2025-10-15T12:32:30Z",
    "updated": "2025-10-15T12:32:30Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2503.20475v2",
    "url": "https://arxiv.org/abs/2503.20475v2",
    "pdf_url": "https://arxiv.org/pdf/2503.20475v2.pdf",
    "title": "An electron-hadron collider at the high-luminosity LHC",
    "abstract": "We discuss a concept of a lower-energy version of the Large Hadron-electron Collider (LHeC), delivering electron-hadron collisions concurrently to the hadron-hadron collisions at the high-luminosity LHC at CERN. Assuming the use of a 20 GeV electron Energy Recovery Linac (ERL), we report the results on the optimised beam dynamics, accelerator technologies, and detector constraints required for such a \"phase-one\" LHeC. Finally, we also discuss the ERL configurations and the possibility of delivering electron-hadron collisions during the planned {Run5} of the LHC, which opens excellent research capabilities - the unique scientific potential of the proposed facility is outlined.",
    "authors": [
      "Kevin David J André",
      "Laurent Forthomme",
      "Bernhard Holzer",
      "Krzysztof Piotrzkowski"
    ],
    "published": "2025-03-26T11:59:29Z",
    "updated": "2025-10-15T12:31:19Z",
    "categories": [
      "hep-ex",
      "physics.acc-ph"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2510.09437v3",
    "url": "https://arxiv.org/abs/2510.09437v3",
    "pdf_url": "https://arxiv.org/pdf/2510.09437v3.pdf",
    "title": "Long Living Hot and Dense Plasma from Relativistic Laser-Nanowire Array   Interaction",
    "abstract": "Long-living, hot and dense plasmas generated by ultra-intense laser beams are of critical importance for laser-driven nuclear physics, bright hard X-ray sources, and laboratory astrophysics. We report the experimental observation of plasmas with nanosecond-scale lifetimes, near-solid density, and keV-level temperatures, produced by irradiating periodic arrays of composite nanowires with ultra-high contrast, relativistically intense femtosecond laser pulses. Jet-like plasma structures extending up to 1~mm from the nanowire surface were observed, emitting K-shell radiation from He-like Ti$^{20+}$ ions. High-resolution X-ray spectra were analyzed using 3D Particle-in-Cell (PIC) simulations of the laser-plasma interaction combined with collisional--radiative modeling (FLYCHK). The results indicate that the jets consist of plasma with densities of $10^{20}$-$10^{22}$ cm$^{-3}$ and keV-scale temperatures, persisting for several nanoseconds. We attribute the formation of these jets to the generation of kiloTesla-scale global magnetic fields during the laser interaction, as predicted by PIC simulations. These fields may drive long-timescale current instabilities that sustain magnetic fields of several hundred tesla, sufficient to confine hot, dense plasma over nanosecond durations.",
    "authors": [
      "Ehsan Eftekhari-Zadeh",
      "Mikhail Gyrdymov",
      "Parysatis Tavana",
      "Robert Loetzsch",
      "Ingo Uschmann",
      "Thomas Siefke",
      "Thomas Käsebier",
      "Uwe Zeitner",
      "Adriana Szeghalmi",
      "Alexander Pukhov",
      "Dmitri Serebryakov",
      "Evgeni Nerush",
      "Igor Kostyukov",
      "Olga Rosmej",
      "Christian Spielmann",
      "Daniil Kartashov"
    ],
    "published": "2025-10-10T14:47:58Z",
    "updated": "2025-10-15T12:22:42Z",
    "categories": [
      "physics.plasm-ph",
      "hep-ex",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.09491v2",
    "url": "https://arxiv.org/abs/2510.09491v2",
    "pdf_url": "https://arxiv.org/pdf/2510.09491v2.pdf",
    "title": "Investigating Solid-Fluid Phase Coexistence in DC Plasma Bilayer   Crystals: The Role of Particle Pairing and Mode Coupling",
    "abstract": "This article presents a detailed investigation of solid-fluid phase coexistence in a bilayer dusty plasma crystal subjected to varying confinement ring bias voltages in a DC glow discharge argon plasma. Melamine formaldehyde particles were employed to form a stable, hexagonally ordered bilayer crystal within a confinement ring electrically isolated from the grounded cathode. By systematically adjusting the confinement ring bias, a distinct phase coexistence emerged: it is characterized by a fluid-like melted core surrounded by a solid crystalline periphery. Crucially, analysis of the phonon spectra revealed frequency shifts that deviate significantly from the predictions of classical monolayer Mode-Coupling Instability (MCI) theory. Stability analysis further demonstrated that dynamic interlayer particle pairing and non-reciprocal interactions play a pivotal role in destabilizing the bilayer structure. These findings highlight previously underappreciated mechanisms driving the melting transition in bilayer dusty plasmas, offering a more comprehensive understanding of phase behavior in complex plasma systems. The results underscore the importance of interlayer coupling and confinement effects in tuning structural transitions.",
    "authors": [
      "Siddhartha Mangamuri",
      "Surabhi Jaiswal",
      "Lénaïc Couëdel"
    ],
    "published": "2025-10-10T15:52:47Z",
    "updated": "2025-10-15T11:59:54Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.13421v1",
    "url": "https://arxiv.org/abs/2510.13421v1",
    "pdf_url": "https://arxiv.org/pdf/2510.13421v1.pdf",
    "title": "Development of fault identification pipeline for SPIRAL2 LLRF data",
    "abstract": "SPIRAL2 is a state-of-the-art superconducting linear accelerator for heavy ions. The radiofrequency operation of the linac can be disrupted by anomalies that affect its reliability. This work leverages fast, multivariate time series post-mortem data from the Low-Level Radio Frequency (LLRF) systems to differentiate anomaly groups. However, interpreting these anomalies traditionally relies on expert analysis, with certain behaviours remaining obscure even to experienced observers. By adopting the Time2Feat pipeline, this study explores the interpretability of anomalies through feature selection, paving the way for real-time state observers. Clustering dashboards are presented, allowing the use of multiple clustering algorithms easily configurable and tools to help for visualizing results. A case study on distinguishing electronic quenches and false quench alarms in postmortem data is highlighted. Thereby, a fast and reliable K-Nearest Neighbours (KNN) classifier is proposed.",
    "authors": [
      "Charly Lassalle",
      "Patrick Bonnay",
      "Frédéric Bouly",
      "Marco Di Giacomo",
      "Adnan Ghribi"
    ],
    "published": "2025-10-15T11:21:32Z",
    "updated": "2025-10-15T11:21:32Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2405.16972v4",
    "url": "https://arxiv.org/abs/2405.16972v4",
    "pdf_url": "https://arxiv.org/pdf/2405.16972v4.pdf",
    "title": "Chip-Scale Point-Source Sagnac Interferometer by Phase-Space Squeezing",
    "abstract": "Matter-wave interferometry plays a significant role in scientific research and technological applications. While position-momentum phase-space squeezing has been demonstrated to increase the coherence of atom sources by reducing momentum spread, we theoretically investigate the potential advantages of the opposite squeezing. As a case study, we analytically and numerically examine its effect on point source atom interferometry (PSI) for rotation sensing. Our analysis reveals that this squeezed PSI (SPSI) approach can significantly improve sensitivity and dynamic range while enabling shorter cycle times and higher repetition rates. Through simulations, we identify parameter spaces where sensitivity and dynamic range are enhanced by orders of magnitude. Under a specific definition of compactness, our calculations show that SPSI outperforms standard PSI by over four orders of magnitude. These theoretical findings suggest that SPSI could either enhance performance in standard-sized devices or maintain performance in miniaturized chip-scale devices, potentially paving the way for new practical applications.",
    "authors": [
      "Yiftach Halevy",
      "Yali Cina",
      "Omer Feldman",
      "David Groswasser",
      "Yonathan Japha",
      "Ron Folman"
    ],
    "published": "2024-05-27T09:08:16Z",
    "updated": "2025-10-15T10:59:38Z",
    "categories": [
      "physics.atom-ph",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2510.13346v1",
    "url": "https://arxiv.org/abs/2510.13346v1",
    "pdf_url": "https://arxiv.org/pdf/2510.13346v1.pdf",
    "title": "Introduction to Optics Design",
    "abstract": "This lecture provides an overview of the principles and methodologies involved in linear optics design. It aims to introduce key concepts such as the matrix formalism, the symplecticity, the quantities that are preserved in the single particle evolution, e.g., the Courant-Snyder invariant. It also covers the concept of beam emittance and matching conditions for an ensemble of particles. The goal is to equip readers with the foundational tools needed for both theoretical understanding and practical application in linear optics and accelerator design.",
    "authors": [
      "Guido Sterbini"
    ],
    "published": "2025-10-15T09:32:23Z",
    "updated": "2025-10-15T09:32:23Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.13304v1",
    "url": "https://arxiv.org/abs/2510.13304v1",
    "pdf_url": "https://arxiv.org/pdf/2510.13304v1.pdf",
    "title": "Evaluation of 3D pixel silicon sensors for the CMS Phase-2 Inner Tracker",
    "abstract": "The high-luminosity upgrade of the CERN LHC requires the replacement of the CMS tracking detector to cope with the increased radiation fluence while maintaining its excellent performance. An extensive R\\&D program, aiming at using 3D pixel silicon sensors in the innermost barrel layer of the detector, has been carried out by CMS in collaboration with the FBK (Trento, Italy) and CNM (Barcelona, Spain) foundries. The sensors will feature a pixel cell size of \\mbox{$25\\times100~\\mu m^2$}, with a centrally located electrode connected to the readout chip. The sensors are read out by the RD53A and CROCv1 chips, developed in 65~nm CMOS technology by the RD53 Collaboration, a joint effort between the ATLAS and CMS groups. This paper reports the results achieved in beam test experiments before and after irradiation, up to a fluence of approximately \\mbox{\\SI{2.6e16}{n_{eq}/\\cm^{2}}}. Measurements of assemblies irradiated to a fluence of \\mbox{\\SI{1e16}{n_{eq}/\\cm^{2}}} show a hit detection efficiency higher than 96\\% at normal incidence, with fewer than 2\\% of channels masked, across a bias voltage range greater than \\SI{50}{V}. Even after irradiation to a higher fluence of \\mbox{\\SI{1.6e16}{n_{eq}/\\cm^{2}}}, similar performance is maintained over a bias voltage range of \\SI{30}{V}, remaining well within CMS requirements.",
    "authors": [
      "The Tracker Group of the CMS Collaboration"
    ],
    "published": "2025-10-15T08:51:54Z",
    "updated": "2025-10-15T08:51:54Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.13192v1",
    "url": "https://arxiv.org/abs/2510.13192v1",
    "pdf_url": "https://arxiv.org/pdf/2510.13192v1.pdf",
    "title": "RFSoC Based LLRF System Design at ALS",
    "abstract": "The Advanced Light Source (ALS) at LBNL is upgrading several LLRF systems for its Linac and Sub-Harmonic Bunchers, where it is desired to have a unified LLRF system design to support various RF frequencies (at 125MHz, 500MHz and 3GHz) and configurations. This paper demonstrates an open-source, direct sampling RFSoC based LLRF system design, featuring: sample-to-sample Multi-Tile Synchronization, deterministic latency, digital up/down conversion, arbitrary waveform generation and acquisition, in-pulse closed loop control, timing and EPICS integration, modular RF frontend and hardware designs. Measured RF characteristics show that the RFSoC based LLRF system is able to meet the system requirements.",
    "authors": [
      "Qiang Du",
      "Shreeharshini Murthy",
      "Victoria Moore",
      "Angel Jurado Lopez",
      "Keith Penney",
      "Michael Chin",
      "Shree Subhasish Basak",
      "David Nett",
      "Benjamin Flugstad"
    ],
    "published": "2025-10-15T06:29:08Z",
    "updated": "2025-10-15T06:29:08Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.13173v1",
    "url": "https://arxiv.org/abs/2510.13173v1",
    "pdf_url": "https://arxiv.org/pdf/2510.13173v1.pdf",
    "title": "The BUTTON-30 detector at Boulby",
    "abstract": "The BUTTON-30 detector is a 30-tonne technology demonstrator designed to evaluate the potential of hybrid event detection, simultaneously exploiting both Cherenkov and scintillation light to detect particle produced in neutrino interactions. The detector is installed at a depth of 1.1 km in the Boulby Underground Laboratory allowing to test the performance of this new technology underground in a low background environment. This paper describes the design and construction of the experiment.",
    "authors": [
      "J. Bae",
      "M. Bergevin",
      "E. P. Bernard",
      "D. S. Bhattacharya",
      "J. Boissevain",
      "S. Boyd",
      "K. Bridges",
      "L. Capponi",
      "J. Coleman",
      "D. Costanzo",
      "T. Cunniffe",
      "S. A. Dazeley",
      "M. V. Diwan",
      "S. R. Durham",
      "E. Ellingwood",
      "A. Enqvist",
      "T. Gamble",
      "S. Gokhale",
      "J. Gooding",
      "C. Graham",
      "E. Gunger",
      "J. J. Hecla",
      "W. Hopkins",
      "I. Jovanovic",
      "T. Kaptanoglu",
      "E. Kneale",
      "L. Lebanowski",
      "K. Lester",
      "V. A. Li",
      "M. Malek",
      "C. Mauger",
      "N. McCauley",
      "C. Metelko",
      "R. Mills",
      "A. Morgan",
      "F. Muheim",
      "A. Murphy",
      "M. Needham",
      "K. Ogren",
      "G. D. Orebi Gann",
      "S. M. Paling",
      "A. F. Papatyi",
      "G. Pinkney",
      "J. Puputti",
      "S. Quillin",
      "B. Richards",
      "R. Rosero",
      "A. Scarff",
      "Y. Schnellbach",
      "P. R. Scovell",
      "B. Seitz",
      "L. Sexton",
      "O. Shea",
      "G. D. Smith",
      "R. Svoboda",
      "D. Swinnock",
      "A. Tarrant",
      "F. Thomson",
      "J. N. Tinsley",
      "C. Toth",
      "M. Vagins",
      "G. Yang",
      "M. Yeh",
      "E. Zhemchugov"
    ],
    "published": "2025-10-15T05:57:48Z",
    "updated": "2025-10-15T05:57:48Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2506.16512v2",
    "url": "https://arxiv.org/abs/2506.16512v2",
    "pdf_url": "https://arxiv.org/pdf/2506.16512v2.pdf",
    "title": "Galactic echoes",
    "abstract": "Gaia has revealed a variety of substructures in the phase space of stars in the Solar neighborhood, including the vertical `Snail' in $(z,v_z)$ space. Such substructures are often interpreted as the incompletely phase-mixed response of the disc stars to a single perturbation, such as an impulsive encounter with a satellite galaxy. In this paper we consider the possibility that such structures contain manifestations of phase space echoes. First established in plasma physics in the 1960s, echoes arise when a collisionless system is perturbed twice: the macroscopic responses to both perturbations mix to small scales in phase space, whereupon they couple nonlinearly, producing a third macroscopic `echo' response without the need for a third perturbation. We derive the galactic analogue of the plasma echo theory using angle-action variables and apply it to a one-dimensional model of vertical motion in the Milky Way. We verify the predicted echo behavior using idealized test particle simulations, both with and without the inclusion of diffusion through orbital scattering off molecular clouds. While we conclude that the Gaia Snail itself is unlikely a (pure) echo effect, the basic physics we uncover is sufficiently generic that we expect phase-space echoes to be common in disc galaxies.",
    "authors": [
      "Rimpei Chiba",
      "Jupiter Ding",
      "Chris Hamilton",
      "Matthew W. Kunz",
      "Scott Tremaine"
    ],
    "published": "2025-06-19T18:00:01Z",
    "updated": "2025-10-15T03:10:04Z",
    "categories": [
      "astro-ph.GA",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.GA",
    "doi": "10.1093/mnras/staf1463"
  },
  {
    "arxiv_id": "2504.13313v2",
    "url": "https://arxiv.org/abs/2504.13313v2",
    "pdf_url": "https://arxiv.org/pdf/2504.13313v2.pdf",
    "title": "Machine-learning Closure for Vlasov-Poisson Dynamics in Fourier-Hermite   Space",
    "abstract": "Accurate reduced models of turbulence are desirable to facilitate the optimization of magnetic-confinement fusion reactor designs. As a first step toward higher-dimensional turbulence applications, we use reservoir computing, a machine-learning (ML) architecture, to develop a closure model for a limiting case of electrostatic gyrokinetics. We implement a pseudo-spectral Eulerian code to solve the one-dimensional Vlasov-Poisson system on a basis of Fourier modes in configuration space and Hermite polynomials in velocity space. When cast onto the Hermite basis, the Vlasov equation becomes an infinitely coupled hierarchy of fluid moments, presenting a closure problem. We exploit the locality of interactions in the Hermite representation to introduce an ML closure model of the small-scale dynamics in velocity space. In the linear limit, when the kinetic Fourier-Hermite solver is augmented with the reservoir closure, the closure permits a reduction of the velocity resolution, with a relative error within two percent for the Hermite moment where the reservoir closes the hierarchy. In the strongly-nonlinear regime, the ML closure model more accurately resolves the low-order Fourier and Hermite spectra when compared to a na\\\"{i}ve closure by truncation and reduces the required velocity resolution by a factor of sixteen.",
    "authors": [
      "Nathaniel Barbour",
      "William Dorland",
      "Ian G. Abel",
      "Matt Landreman"
    ],
    "published": "2025-04-17T19:53:51Z",
    "updated": "2025-10-14T22:54:37Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.12960v1",
    "url": "https://arxiv.org/abs/2510.12960v1",
    "pdf_url": "https://arxiv.org/pdf/2510.12960v1.pdf",
    "title": "Master Oscillator and Phase Reference Line Design for the PIP-II Linac",
    "abstract": "The phase averaging reference line system provides the RF phase reference, LO and clock signals to the LLRF and other accelerator sub-systems. The PIP-II linac has RF systems at three frequencies - 162.5 MHz, 325 MHz and 650 MHz. A temperature-stabilized, low-phase-noise oscillator is used as the master oscillator. Phase reference signals at 162.5 MHz, 325 MHz, and 650 MHz, along with LO signals at 182.5 MHz, 345 MHz, 670 MHz and LLRF clocks at 1320 MHz and 1300 MHz, are generated in temperature-controlled RF modules at each frequency section. A phase reference from each module travels to the next section, where it is doubled to produce required frequencies. The reference also travels alongside the accelerating cavities in the tunnel, allowing cavity probe and reference cables to temperature track and reduce measurement errors from temperature changes or phase drift.",
    "authors": [
      "A. Syed",
      "B. Vaughn",
      "P. Varghese",
      "E. Cullerton",
      "S. Stevenson",
      "D. Pieper",
      "D. Peterson",
      "J. Holzbauer",
      "R. Madrak",
      "A. Mosher",
      "D. Klepec"
    ],
    "published": "2025-10-14T20:11:32Z",
    "updated": "2025-10-14T20:11:32Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.04768v3",
    "url": "https://arxiv.org/abs/2510.04768v3",
    "pdf_url": "https://arxiv.org/pdf/2510.04768v3.pdf",
    "title": "Experimental Reconstruction of Source 4D Phase Space Without Prior   Knowledge of Transfer Matrix",
    "abstract": "We experimentally demonstrate a method for reconstructing the transverse 4D phase space of an electron beam at the time of emission from downstream diagnostics of the 4D phase space. This method does not rely on detailed knowledge of the beamline transport, besides assuming that linearity and symplecticity are satisfied. We apply this method to measure the transverse position and momentum phase space of electrons emitted from a spatially-structured alkali-antimonide cathode. This method can uncover local correlations between emission location and momentum spread. We formulate this method analytically and investigate resolution limits.",
    "authors": [
      "Charles Zhang",
      "Elena Echeverria",
      "Abigail Flint",
      "William H Li",
      "Christopher M. Pierce",
      "Alice Galdi",
      "Chad Pennington",
      "Adam Bartnik",
      "Ivan Bazarov",
      "Jared Maxson"
    ],
    "published": "2025-10-06T12:42:12Z",
    "updated": "2025-10-14T19:39:25Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2406.06233v3",
    "url": "https://arxiv.org/abs/2406.06233v3",
    "pdf_url": "https://arxiv.org/pdf/2406.06233v3.pdf",
    "title": "Plasma screening in mid-charged ions observed by K-shell line emission",
    "abstract": "Dense plasma environment affects the electronic structure of ions via variations of the microscopic electrical fields, also known as plasma screening. This effect can be either estimated by simplified analytical models, or by computationally expensive and to date unverified numerical calculations. We have experimentally quantified plasma screening from the energy shifts of the bound-bound transitions in matter driven by the x-ray free electron laser (XFEL). This was enabled by identification of detailed electronic configurations of the observed K{\\alpha}, K\\b{eta} and K{\\gamma} lines. This work paves the way for improving plasma screening models including connected effects like ionization potential depression and continuum lowering, which will advance the understanding of atomic physics in Warm Dense Matter regime.",
    "authors": [
      "M. Šmıd",
      "O. Humphries",
      "C. Baehtz",
      "V. Bouffetier",
      "E. Brambrink",
      "T. Burian",
      "V. Cerantola",
      "M. S. Cho",
      "T. E. Cowan",
      "L. Gaus",
      "M. F. Gu",
      "V. Hájková",
      "L. Juha",
      "J. Kaa",
      "Z. Konopkova",
      "H. P. Le",
      "M. Makita",
      "X. Pan",
      "T. Preston",
      "A. Schropp",
      "J. P. Schwinkendorf",
      "H. A. Scott",
      "R. Štefanıková",
      "J. Vorberger",
      "W. Wang",
      "U. Zastrau",
      "K. Falk"
    ],
    "published": "2024-06-10T13:04:03Z",
    "updated": "2025-10-14T19:31:51Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.10657v2",
    "url": "https://arxiv.org/abs/2510.10657v2",
    "pdf_url": "https://arxiv.org/pdf/2510.10657v2.pdf",
    "title": "Unlocking New Frontiers: The Versatile Potential of the Brazilian   Multipurpose Reactor",
    "abstract": "The multipurpose nature of nuclear research reactors has been investigated. This class of reactors has gained momentum within the international community, given the multiple benefits of nuclear technology in medicine, agriculture, industry, and the development of new materials, being characterized by the simultaneous use of several applications. In this context, Brazil has recently joined the group of countries with multipurpose reactor projects. The Brazilian Multipurpose Reactor (RMB) will be Brazil's new neutron source, with a thermal power of $30$ $MW$, with a core flux on the order of $\\phi=4\\times 10^{14}$ $n/cm^{2}s$ and a power density of $312.5$ $W/cm^3$, ensuring the production of radioisotopes, material and fuel irradiation testing, and neutron beam applications. In this work, the demand for neutron fluxes in different irradiation targets is investigated by Monte Carlo simulations under a perturbation caused by a highly neutron-absorbing material, the Gadolinium-157 (Gd-157) isotope. The results show that Molybdenum-99 (Mo-99) production is not affected by the Gd-157 target, and the minimum proposed thermal neutron flux for the reactor's activity ($\\phi_{min}=5.1\\times 10^{12}$ $n/cm^{2}s$) is guaranteed even at maximum operational capacity. The potential production of Terbium (Tb) isotopes for nuclear medicine applications in the RMB is briefly discussed.",
    "authors": [
      "Luiz P. de Oliveira",
      "Alexandre P. S. Souza",
      "Carlos G. S. Santos",
      "Iberê R. S. Júnior",
      "Barbara P. G. Silva",
      "Marco A. S. Pereira",
      "Frederico A. Genezini",
      "José A. Perrotta"
    ],
    "published": "2025-10-12T15:25:24Z",
    "updated": "2025-10-14T19:31:43Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2408.15845v2",
    "url": "https://arxiv.org/abs/2408.15845v2",
    "pdf_url": "https://arxiv.org/pdf/2408.15845v2.pdf",
    "title": "Surrogate Models studies for laser-plasma accelerator electron source   design through numerical optimisation",
    "abstract": "Designing a high-quality plasma injector electron source driven by a laser beam relies on numerical parametric studies using particle-in-cell codes. The common input parameters to explore are laser characteristics, plasma species and density profiles produced by computational fluid dynamic studies. We demonstrate the construction of surrogate models using machine learning techniques for a laser-plasma injector (LPI) based on more than $3000$ particle-in-cell simulations of laser wakefield acceleration performed for sparsely spaced input parameters published by Drobniak [Phys. Rev. Accel. Beams, 26, 091302, (2023)]. Surrogate models are relevant for LPI design and optimisation, as they are approximately $10^7$ times faster than PIC simulations. Their speed enables more efficient design studies by allowing extensive exploration of the input-output relationship without significant computational cost. We develop and compare the performance of three surrogate models, namely, multilayer perceptron (MLP), decision trees (DT) and Gaussian processes (GP). We show that using a simple and frugal MLP-based model trained on a reasonable-size random scan data set of 500 particles in cell simulations, we can predict beam parameters with a coefficient determination score $R^2=0.93$ . The best surrogate model is used to quickly find optimal working points and stability regions and get targeted electron beam energy, charge, energy spread and emittance using different methods, namely random search, Bayesian optimisation and multi-objective Bayesian optimisation. This simple approach can serve more global design study of an LPI in a start-to-end linear laser-driven accelerator.on beam energy, charge and energy spread using different methods, namely random search, Bayesian optimisation and multi-objective Bayesian optimisation",
    "authors": [
      "G. Kane",
      "P. Drobniak",
      "S. Kazamias",
      "V. Kubytskyi",
      "M. Lenivenko",
      "B. Lucas",
      "J. Serhal",
      "K. Cassou",
      "A. Beck",
      "A. Specka",
      "F. Massimo"
    ],
    "published": "2024-08-28T15:07:12Z",
    "updated": "2025-10-14T18:04:37Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph",
      "physics.data-an",
      "68T05, 68T20"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.12873v1",
    "url": "https://arxiv.org/abs/2510.12873v1",
    "pdf_url": "https://arxiv.org/pdf/2510.12873v1.pdf",
    "title": "New Spallation Background Rejection Techniques to Greatly Improve the   Solar Neutrino Sensitivity of JUNO",
    "abstract": "While the potential of the Jiangmen Underground Neutrino Observatory (JUNO) to measure solar neutrinos is known, realizing this potential requires new techniques to reduce detector backgrounds. One of the most serious backgrounds is due to the beta decays of unstable nuclei produced through muon breakup (spallation) of nuclei. This background is much more significant in JUNO compared to Super-Kamiokande due to JUNO's shallower depth and its lack of directional information. We present the first detailed theoretical calculations of spallation backgrounds in JUNO, showing the underlying physical processes and new ways to cut backgrounds while preserving signals. A key point is showing the importance of neutron tagging to identify hadronic showers, which are rare but produce almost all of the dangerous isotopes. With our new techniques, JUNO will be able to reduce deadtime (signal loss) by a factor of five and to reduce the running time needed to meet sensitivity goals by a factor of two. This will give JUNO greatly improved sensitivity to $^8$B and $hep$ solar neutrinos, as we will explore in a separate paper.",
    "authors": [
      "Obada Nairat",
      "John F. Beacom",
      "Shirley Weishi Li"
    ],
    "published": "2025-10-14T18:00:01Z",
    "updated": "2025-10-14T18:00:01Z",
    "categories": [
      "hep-ph",
      "astro-ph.HE",
      "hep-ex",
      "nucl-ex",
      "nucl-th",
      "physics.ins-det"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2510.12869v1",
    "url": "https://arxiv.org/abs/2510.12869v1",
    "pdf_url": "https://arxiv.org/pdf/2510.12869v1.pdf",
    "title": "Unified kinetic theory of induced scattering: Compton, Brillouin, and   Raman processes in magnetized electron and positron pair plasma",
    "abstract": "We present a unified theoretical framework for induced (stimulated) scattering-parametric instabilities of electromagnetic waves, including induced Compton, stimulated Brillouin, and stimulated Raman scattering (SRS) in strongly magnetized electron-positron pair plasma. By solving the dispersion relations derived from kinetic theory, taking into account the ponderomotive force due to the beat of incident and scattered waves, we obtain analytical expressions for the linear growth rates of the ordinary, neutral, and charged modes of density fluctuations. Our results clarify which type of scattering dominates under different thermal coupling, resonance, and density conditions. In strong magnetic fields, scattering of perpendicularly polarized waves is generally suppressed, but by different powers of the cyclotron frequency. Moreover, SRS, which is forbidden in unmagnetized electron and positron pair plasma, becomes possible in the charged mode. This framework enables a comprehensive evaluation of induced scattering in extreme astrophysical and laboratory plasma, such as fast radio burst (FRB) emission and propagation in magnetar magnetospheres.",
    "authors": [
      "Rei Nishiura",
      "Shoma F. Kamijima",
      "Kunihito Ioka"
    ],
    "published": "2025-10-14T18:00:00Z",
    "updated": "2025-10-14T18:00:00Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2510.07485v2",
    "url": "https://arxiv.org/abs/2510.07485v2",
    "pdf_url": "https://arxiv.org/pdf/2510.07485v2.pdf",
    "title": "In-pixel integration of signal processing and AI/ML based data filtering   for particle tracking detectors",
    "abstract": "We present the first physical realization of in-pixel signal processing with integrated AI-based data filtering for particle tracking detectors. Building on prior work that demonstrated a physics-motivated edge-AI algorithm suitable for ASIC implementation, this work marks a significant milestone toward intelligent silicon trackers. Our prototype readout chip performs real-time data reduction at the sensor level while meeting stringent requirements on power, area, and latency. The chip is taped-out in 28nm TSMC CMOS bulk process, which has been shown to have sufficient radiation hardness for particle experiments. This development represents a key step toward enabling fully on-detector edge AI, with broad implications for data throughput and discovery potential in high-rate, high-radiation environments such as the High-Luminosity LHC.",
    "authors": [
      "Benjamin Parpillon",
      "Anthony Badea",
      "Danush Shekar",
      "Christian Gingu",
      "Giuseppe Di Guglielmo",
      "Tom Deline",
      "Adam Quinn",
      "Michele Ronchi",
      "Benjamin Weiss",
      "Jennet Dickinson",
      "Jieun Yoo",
      "Corrinne Mills",
      "Daniel Abadjiev",
      "Aidan Nicholas",
      "Eliza Howard",
      "Carissa Kumar",
      "Eric You",
      "Mira Littmann",
      "Karri DiPetrillo",
      "Arghya Ranjan Das",
      "Mia Liu",
      "David Jiang",
      "Mark S. Neubauer",
      "Morris Swartz",
      "Petar Maksimovic",
      "Alice Bean",
      "Ricardo Silvestre",
      "Jannicke Pearkes",
      "Keith Ulmer",
      "Nick Manganelli",
      "Chinar Syal",
      "Doug Berry",
      "Nhan Tran",
      "Lindsey Gray",
      "Farah Fahim"
    ],
    "published": "2025-10-08T19:35:15Z",
    "updated": "2025-10-14T16:08:40Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2506.07213v3",
    "url": "https://arxiv.org/abs/2506.07213v3",
    "pdf_url": "https://arxiv.org/pdf/2506.07213v3.pdf",
    "title": "AttoSHINE: Generation of continuous-wave terawatt-scale attosecond X-ray   pulses at SHINE",
    "abstract": "Attosecond X-ray pulses are a critical tool for tracking ultrafast electron dynamics in condensed matter, molecular systems, and strongly correlated materials. Recent breakthroughs have pushed X-ray free electron lasers (XFELs) into the attosecond domain, significantly surpassing their previous femtosecond capabilities. Building on these advancements, this work investigates the potential of the Shanghai High Repetition Rate XFEL and Extreme Light Facility (SHINE), China's first continuous-wave (CW) XFEL, to generate intense attosecond X-ray pulses, thereby offering transformative capabilities for X-ray science. Through comprehensive start-to-end simulations, we show that SHINE is capable of producing hard X-ray pulses with peak powers reaching the terawatt-scale and average pulse durations of approximately 300 as. This is achieved using a self-chirping scheme within the existing machine configuration, requiring no additional hardware. Our findings demonstrate that CW XFELs can generate intense attosecond X-ray pulses at megahertz repetition rates, opening new opportunities for real-time studies of electronic dynamics in complex systems.",
    "authors": [
      "Bingyang Yan",
      "Chenzhi Xu",
      "Si Chen",
      "Duan Gu",
      "Ye Chen",
      "Jiawei Yan",
      "Haixiao Deng"
    ],
    "published": "2025-06-08T16:32:35Z",
    "updated": "2025-10-14T13:47:09Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.12899v2",
    "url": "https://arxiv.org/abs/2507.12899v2",
    "pdf_url": "https://arxiv.org/pdf/2507.12899v2.pdf",
    "title": "Space-based cm/kg-scale Laser Interferometer for Quantum Gravity",
    "abstract": "The experimental verification of the quantum nature of gravity represents a milestone in quantum gravity research. Recently, interest has grown for testing it via gravitationally induced entanglement (GIE). Here, we propose a space-based interferometer inspired by the LISA Pathfinder (LPF). Our design employs two kg-scale gold-platinum test masses which, unlike in the LPF, are surrounded by a shield below 1 K and positioned side-by-side with a centimeter-scale separation. This configuration enables the detection of GIE through simultaneous measurements of differential and common-mode motions. To estimate the integration time required for GIE detection, we simulate quantum measurements of these modes, considering noise sources such as gas damping, black-body radiation, and cosmic-ray collisions. Our results show that GIE can be demonstrated with a few modifications to the LPF setup.",
    "authors": [
      "Nobuyuki Matsumoto",
      "Katsuta Sakai",
      "Kosei Hatakeyama",
      "Kiwamu Izumi",
      "Daisuke Miki",
      "Satoshi Iso",
      "Akira Matsumura",
      "Kazuhiro Yamamoto"
    ],
    "published": "2025-07-17T08:37:21Z",
    "updated": "2025-10-14T12:52:01Z",
    "categories": [
      "gr-qc",
      "astro-ph.IM",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "gr-qc"
  },
  {
    "arxiv_id": "2510.12432v1",
    "url": "https://arxiv.org/abs/2510.12432v1",
    "pdf_url": "https://arxiv.org/pdf/2510.12432v1.pdf",
    "title": "Comparison of MHD and gyrokinetic simulations of linear instabilities at   the q = 1 surface",
    "abstract": "Accurate modeling of core instabilities in tokamak plasmas is essential to understand the underlying physical mechanisms and their impact on plasma confinement. The ideal stability of the internal kink mode and the m = 1 collisionless tearing mode are analyzed numerically both with gyrokinetic and MHD codes. We compare the different models implemented in the codes and show that the gyrokinetic equations without collisions inherently contain the ideal MHD limit. The simulation results show that the stability of the internal kink mode strongly depends on the choice of several setup parameters like the inclusion of parallel magnetic field fluctuations, the tokamak aspect ratio, the drift- or gyrokinetic treatment of the ions and the electron mass. Furthermore, we demonstrate the stabilization of the instabilities by diamagnetic effects. Our results indicate that gyrokinetic and MHD models can be reconciled in the description of the internal kink mode by careful consideration of the simulation setup and model assumptions, but instabilities like the collisionless tearing mode require a more advanced treatment beyond MHD.",
    "authors": [
      "F. N. Antlitz",
      "X. Wang",
      "M. Hoelzl",
      "G. T. A. Huijsmans",
      "H. Zhang",
      "J. Puchmayr",
      "Ph. Lauber",
      "T. Hayward-Schneider",
      "B. F. McMillan",
      "A. Mishchenko",
      "E. Poli",
      "Z. X. Lu",
      "JOREK team"
    ],
    "published": "2025-10-14T12:10:46Z",
    "updated": "2025-10-14T12:10:46Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.12426v1",
    "url": "https://arxiv.org/abs/2510.12426v1",
    "pdf_url": "https://arxiv.org/pdf/2510.12426v1.pdf",
    "title": "Intense and Tunable Multi-color Terahertz Radiation from Laser-Shaped   Electron Beams",
    "abstract": "High-power multi-color terahertz (THz) radiation exhibits extraordinary scientific application prospects at various scientific frontiers, for its capacity to deliver THz excitation at multiple frequencies simultaneously. However, the generation of high-power multi-color THz radiation with tunable frequencies remains a challenge for existing techniques. Here, a technique by combining the multi-laser pulses frequency beating and coherent undulator amplification is proposed for generating high-power multi-color THz radiation with tunable frequency. Numerical simulations indicate that the proposed technique can produce multi-color THz radiation with three to six distinguished colors and a peak power up to hundreds of MW, and the temporally separated two-color pulses can also be produced by employing undulators with different resonance. Due to the intrinsic properties of the proposed technique, the THz frequencies, the color number and the frequency interval can be effectively controlled by simply adjusting the beating laser. This method paves the way for advanced application of THz pump-THz probe experiments for selective excitation of atomic multi-level systems and molecular fingerprint recognition.",
    "authors": [
      "Yin Kang",
      "Weiyi Yin",
      "Xianzhe Li",
      "Yixuan Liu",
      "Yue Wang",
      "Yuan Ma",
      "Kaiqing Zhang",
      "Chao Feng"
    ],
    "published": "2025-10-14T12:02:45Z",
    "updated": "2025-10-14T12:02:45Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2505.24611v2",
    "url": "https://arxiv.org/abs/2505.24611v2",
    "pdf_url": "https://arxiv.org/pdf/2505.24611v2.pdf",
    "title": "Electroluminescence and charge multiplication in liquid xenon with a   VCC-like Microstrip Plate",
    "abstract": "We report on the first observation of electroluminescence and charge amplification with a Virtual Cathode Chamber (VCC) microstrips plate immersed in liquid xenon. Both were observed in an intense non-uniform electric field in the vicinity of 2-$\\mu$m narrow anode strips deposited, with a 2~mm pitch, on a semiconductive glass substrate (S8900), with a cathode film on its backside. An initial light yield of $\\sim$460 VUV photons per drifting electron was measured, which degraded within tens of minutes stabilizing at (27.0~$\\pm$~3.1)~photons per electron. The electroluminescence was accompanied by electron multiplication with an estimated charge gain $<$10. Further investigations are necessary to understand and mitigate the light yield degradation phenomenon. We expect other substrate materials, including VUV-transparent ones, to provide large stable photon yields, compatible with our model predictions. The VCC configuration has demonstrated great potential in single-phase noble-liquid detectors, particularly for dark-matter searches, neutrino physics and other fields.",
    "authors": [
      "Gonzalo Martínez-Lema",
      "Vitaly Chepel",
      "Amos Breskin"
    ],
    "published": "2025-05-30T14:02:19Z",
    "updated": "2025-10-14T09:39:59Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.12142v1",
    "url": "https://arxiv.org/abs/2510.12142v1",
    "pdf_url": "https://arxiv.org/pdf/2510.12142v1.pdf",
    "title": "Polar Filaments Capture High Latitude Solar Poloidal Field Interactions   and can Foretell the Future Sunspot Cycle Amplitude before Polar Field   Precursors",
    "abstract": "Polar fields at the minimum of a sunspot cycle -- which are a manifestation of the radial component of the Sun's poloidal field -- are deemed to be the best indicator of the strength of the toroidal component, and hence the amplitude of the future sunspot cycle. However, the Sun's polar magnetic fields are difficult to constrain with ground-based or space-based observations from near the plane-of-ecliptic. In this context, polar filaments -- dark, elongated structures that overlie polarity inversion lines -- are known to offer critical insights into solar polar field dynamics. Through investigations of the long-term evolution of polar filament areas and length acquired from the Meudon Observatory and complimentary solar surface flux transport simulations, here we establish the common physical foundation connecting the Babcock-Leighton solar dynamo mechanism of solar polar field reversal and build-up with the origin and evolution of polar filaments. We discover a new relationship connecting the residual filament area of adjacent solar cycles with the amplitude of the next sunspot cycle -- which can serve as a new tool for solar cycle forecasts -- advancing the forecast window to earlier than polar field based precursors. We conclude that polar filament properties encapsulate the physics of interaction of the poloidal magnetic field of the previous and current sunspot cycles, the resultant of which is the net poloidal magnetic field at the end of the current cycle, thus encoding as a precursor the strength of the upcoming solar cycle.",
    "authors": [
      "Srinjana Routh",
      "Shaonwita Pal",
      "Dibyendu Nandy",
      "Subhamoy Chatterjee",
      "Dipankar Banerjee",
      "Mohd. Saleem Khan"
    ],
    "published": "2025-10-14T04:49:00Z",
    "updated": "2025-10-14T04:49:00Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2505.18067v2",
    "url": "https://arxiv.org/abs/2505.18067v2",
    "pdf_url": "https://arxiv.org/pdf/2505.18067v2.pdf",
    "title": "A Comprehensive Analytical Model of the Dynamic Z-Pinch",
    "abstract": "We present an analytical 1D axisymmetric model describing the evolution of the dynamic z-pinch. This model is capable of predicting the trajectories of the imploding sheath's magnetic piston and preceding shock front, along with the velocity, pressure, density, and magnetic field profiles, for any time-dependent current, spatially-varying initial density profile, and weak initial axial field. The implosion is divided into stages, with each stage described by a set of coupled ordinary differential equations derived from the ideal MHD equations. Comparison with experimental data from the COBRA pulsed-power facility is quite promising and implies this model could prove useful in designing and analyzing future pulsed-power experiments.",
    "authors": [
      "Alejandro Mesa Dame",
      "Eric S. Lavine",
      "David A. Hammer"
    ],
    "published": "2025-05-23T16:13:16Z",
    "updated": "2025-10-14T04:36:39Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.12068v1",
    "url": "https://arxiv.org/abs/2510.12068v1",
    "pdf_url": "https://arxiv.org/pdf/2510.12068v1.pdf",
    "title": "On three dimensional steady super-Alfvénic magnetohydrodynamics   shocks with aligned fields",
    "abstract": "The coupled motion between the hydrodynamic flow and magnetic field introduces significant complexity into the structure of the magnetohydrodynamic (MHD) equations. A key factor contributing to this complexity is the presence of Alfv\\'en waves, which critically influences the character of the flow and makes the problem considerably more challenging. Within the framework where the magnetic field is everywhere parallel to the flow velocity, we give an effective decomposition of the steady MHD equations in terms of the deformation tensor and the modified vorticity, where the modification in the vorticity is to record the effect of the Lorentz force on the velocity field. The existence and structural stability of the super-Alfv\\'{e}nic cylindrical transonic shock solutions for the steady MHD equations are established under three-dimensional perturbations of the incoming flow and the exit total pressure (kinetic plus magnetic).",
    "authors": [
      "Shangkun Weng",
      "Wengang Yang"
    ],
    "published": "2025-10-14T02:19:48Z",
    "updated": "2025-10-14T02:19:48Z",
    "categories": [
      "math.AP",
      "physics.plasm-ph"
    ],
    "primary_category": "math.AP"
  },
  {
    "arxiv_id": "2510.11950v1",
    "url": "https://arxiv.org/abs/2510.11950v1",
    "pdf_url": "https://arxiv.org/pdf/2510.11950v1.pdf",
    "title": "Digital Low-Level RF system for the Linac Electronics Modernization Plan   at LCLS",
    "abstract": "The LCLS began operations in 2009, utilizing SLAC's normal-conducting (NC) LINAC, which features control equipment dating back to the 1960s and 1980s. The Linac Electronics Modernization Plan (LEMP) aims to replace the legacy control equipment with a system based on the open-source Marble carrier board and Zest+ digitizer board, both of which are used in the LCLS-II HE LLRF system. Adaptation of the LLRF system developed for the continuous-wave (CW) superconducting RF (SRF) LCLS-II to the short-RF pulse NC LCLS includes leveraging the knowledge and experience gained from recent LLRF projects at SLAC and efficiently reusing the core functionality of the hardware and code base developed for previous projects, in collaboration with LBNL, FNAL and JLAB. A prototype has been deployed and tested at station 26-3, demonstrating RF generation/control, interlocks, triggers, and waveform capture. Here, we describe the hardware, firmware and software infrastructure, highlight key features, and present initial test results.",
    "authors": [
      "Nashat Sawai",
      "Jorge Diaz Cruz",
      "Andy Benwell",
      "Sonya Hoobler",
      "Qiang Du",
      "Shreeharshini Murthy",
      "Larry Doolittle"
    ],
    "published": "2025-10-13T21:23:23Z",
    "updated": "2025-10-13T21:23:23Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.11896v1",
    "url": "https://arxiv.org/abs/2510.11896v1",
    "pdf_url": "https://arxiv.org/pdf/2510.11896v1.pdf",
    "title": "Lagrangian Formulation of the Snowplow Model and Operating Point for Z   pinch Devices",
    "abstract": "We write down the lagrangian for the snowplow model of the Z pinch system. Then, we develop the Euler-Lagrange equations to find out the corresponding equations of motion. Next, we set a criterion for quantitatively estimating the performance of Z pinch devices. Finally, we apply this criterion to a specific Z pinch system.",
    "authors": [
      "Miguel Cárdenas",
      "Alejandro Nettle",
      "Leandro Núñez"
    ],
    "published": "2025-10-13T19:57:49Z",
    "updated": "2025-10-13T19:57:49Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.11890v1",
    "url": "https://arxiv.org/abs/2510.11890v1",
    "pdf_url": "https://arxiv.org/pdf/2510.11890v1.pdf",
    "title": "Loading non-Maxwellian Velocity Distributions in Particle Simulations",
    "abstract": "Numerical procedures for generating non-Maxwellian velocity distributions in particle simulations are presented. First, Monte Carlo methods for an $(r,q)$ distribution that generalizes flattop and kappa distributions are discussed. Then, two rejection methods for the regularized kappa distribution are presented, followed by a comparison in the $\\kappa$ space. A simple recipe is proposed for the subtracted kappa distribution. Properties and numerical recipes for the ring and shell distributions with a finite Gaussian width are discussed. The ring and shell Maxwellians are further introduced as alternatives to the ring and shell distributions. Finally, the super-Gaussian and the filled-shell distributions are presented.",
    "authors": [
      "Seiji Zenitani",
      "Shunsuke Usami",
      "Shuichi Matsukiyo"
    ],
    "published": "2025-10-13T19:49:16Z",
    "updated": "2025-10-13T19:49:16Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.11874v1",
    "url": "https://arxiv.org/abs/2510.11874v1",
    "pdf_url": "https://arxiv.org/pdf/2510.11874v1.pdf",
    "title": "Towards fully predictive gyrokinetic full-f simulations",
    "abstract": "Designing economical magnetic confinement fusion power plants motivates computational tools that can estimate plasma behavior from engineering parameters without direct reliance on experimental measurement of the plasma profiles. In this work, we present full-$f$ global gyrokinetic (GK) turbulence simulations of edge and scrape-off layer turbulence in tokamaks that use only magnetic geometry, heating power, and particle inventory as inputs. Unlike many modeling approaches that employ free parameters fitted to experimental data, raising uncertainties when extrapolating to reactor scales, his approach directly simulates turbulence and resulting profiles through GK without such empirical adjustments. This is achieved via an adaptive sourcing algorithm in Gkeyll that strictly controls energy injection and emulates particle sourcing due to neutral recycling. We show that the simulated kinetic profiles compare reasonably well with Thomson scattering and Langmuir probe data for Tokamak \\`{a} Configuration Variable (TCV) discharge #65125, and that the simulations reproduce characteristic features such as blob transport and self-organized electric fields. Applying the same framework to study triangularity effects suggests mechanisms contributing to the improved confinement reported for negative triangularity (NT). Simulations of TCV discharges #65125 and #65130 indicate that NT increases the $E \\times B$ flow shear (by about 20% in these cases), which correlates with reduced turbulent losses and a modest change in the distribution of power exhaust to the vessel wall. While the physical models contain approximations that can be refined in future work, the predictive capability demonstrated here, evolving multiple profile relaxation times with kinetic electron and ion models in hundreds of GPU hours, indicates the feasibility of using Gkeyll to support design studies of fusion devices.",
    "authors": [
      "A. C. D. Hoffmann",
      "T. N. Bernard",
      "M. Francisquez",
      "G. W. Hammett",
      "A. Hakim",
      "J. Boedo",
      "R. Rizkallah",
      "C. K. Tsui",
      "the TCV team"
    ],
    "published": "2025-10-13T19:32:56Z",
    "updated": "2025-10-13T19:32:56Z",
    "categories": [
      "physics.plasm-ph",
      "physics.app-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2501.12797v2",
    "url": "https://arxiv.org/abs/2501.12797v2",
    "pdf_url": "https://arxiv.org/pdf/2501.12797v2.pdf",
    "title": "A double multi-turn injection scheme for generating mixed helium and   carbon ion beams at medical synchrotron facilities",
    "abstract": "The low relative charge-to-mass ratio offset of 0.065% between fully ionized helium-4 and carbon-12 ions enables simultaneous acceleration in hadron therapy synchrotrons. At the same energy per mass, helium ions exhibit a stopping range approximately three times greater than carbon ions. They can therefore be exploited for online range verification downstream of the patient during carbon ion beam irradiation. One possibility for creating this mixed beam is accelerating the two ion species sequentially through the LINAC and subsequently \"mixing\" them at injection energy in the synchrotron with a double multi-turn injection scheme. This work reports the first successful generation, acceleration, and extraction of a mixed helium and carbon ion beam using this double multi-turn injection scheme, which was achieved at the MedAustron therapy accelerator in Austria. A description of the double multi-turn injection scheme, particle tracking simulations, and details on the implementation at the MedAustron accelerator facility are presented and discussed. Finally, measurements of the mixed beam at delivery in the irradiation room using a radiochromic film and a low-gain avalanche diode (LGAD) detector are presented.",
    "authors": [
      "Matthias Kausel",
      "Claus Schmitzer",
      "Andreas Gsponer",
      "Markus Wolf",
      "Hermann Fuchs",
      "Felix Ulrich-Pur",
      "Thomas Bergauer",
      "Albert Hirtl",
      "Nadia Gambino",
      "Elisabeth Renner"
    ],
    "published": "2025-01-22T11:01:15Z",
    "updated": "2025-10-13T18:02:54Z",
    "categories": [
      "physics.acc-ph",
      "physics.med-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.19393v2",
    "url": "https://arxiv.org/abs/2507.19393v2",
    "pdf_url": "https://arxiv.org/pdf/2507.19393v2.pdf",
    "title": "Perturbative model for the saturation of energetic-particle-driven modes   limited by self-generated zonal modes",
    "abstract": "We present a simplified approach enforcing energy conservation to incorporate the effects of zonal modes alongside wave-particle nonlinearities in the determination of the saturation amplitude. The model assumes that the zonal perturbations grow at a rate twice that of the original (pump) wave, consistent with a beat-driven (or force-driven) generation mechanism. The evolution and saturation of the mode amplitude are investigated both analytically and numerically within our reduced model assumptions, in both the collisionless and scattering-dominated regimes. These studies underscore the crucial role of sources and sinks in accurately capturing the impact and the role of beat-driven zonal perturbations on mode evolution. In the realistic case of saturation set by sources and sinks, we discuss the role of a finite amplitude zonal mode in reducing microturbulent particle scattering, thus limiting the energy source for the resonant mode. We then discuss comparisons between the model predictions and simulation results. The model reproduces key features observed in gyrokinetic simulations as the reduction in saturated mode amplitude and the onset of wave-wave nonlinear effects as functions of mode growth rate and amplitude. Thanks to its simplicity, it can be readily implemented into codes based on reduced models, thereby improving their predictive capability for strongly driven instabilities.",
    "authors": [
      "Tommaso Barberis",
      "Vinícius N. Duarte",
      "Eamon J. Hartigan-O'Connor",
      "Nikolai N. Gorelenkov"
    ],
    "published": "2025-07-25T15:56:40Z",
    "updated": "2025-10-13T15:47:24Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.11365v1",
    "url": "https://arxiv.org/abs/2510.11365v1",
    "pdf_url": "https://arxiv.org/pdf/2510.11365v1.pdf",
    "title": "Electromagnetic Observables of Weakly Collisional Black Hole Accretion",
    "abstract": "The black holes in the Event Horizon Telescope sources Messier 87* and Sagittarius A* (SgrA*) are embedded in a hot, collisionless plasma that is fully described in kinetic theory yet is usually modeled as an ideal, magnetized fluid. In this Letter, we present results from a new set of weakly collisional fluid simulations in which leading order kinetic effects are modeled as viscosity and heat conduction. Consistent with earlier, lower-resolution studies, we find that overall flow dynamics remain very similar between ideal and non-ideal models. For the first time, we synthesize images and spectra of SgrA* from weakly collisional models -- assuming an isotropic, thermal population of electrons -- and find that these remain largely indistinguishable from ideal fluid predictions. However, most weakly collisional models exhibit lower light curve variability, with all magnetically dominated models showing a small but systematic decrease in variability.",
    "authors": [
      "Vedant Dhruv",
      "Ben Prather",
      "Mani Chandra",
      "Abhishek V. Joshi",
      "Charles F. Gammie"
    ],
    "published": "2025-10-13T13:06:49Z",
    "updated": "2025-10-13T13:06:49Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2510.11174v1",
    "url": "https://arxiv.org/abs/2510.11174v1",
    "pdf_url": "https://arxiv.org/pdf/2510.11174v1.pdf",
    "title": "Machine Learning-Integrated Hybrid Fluid-Kinetic Framework for Quantum   Electrodynamic Laser Plasma Simulations",
    "abstract": "High-intensity laser plasma interactions create complex computational problems because they involve both fluid and kinetic regimes, which need models that maintain physical precision while keeping computational speed. The research introduces a machine learning-based three-dimensional hybrid fluid-particle-in-cell (PIC) system, which links relativistic plasma behavior to automatic regime transitions. The technique employs fluid approximations for stable areas but activates the PIC solver when SwitchNet directs it to unstable sections through its training on physics-based synthetic data. The model uses a smooth transition between Ammosov-Delone-Krainov (ADK) tunneling and multiphoton ionization rates to simulate ionization, while Airy-function approximations simulate quantum electrodynamic (QED) effects for radiation reaction and pair production. The convolutional neural network applies energy conservation through physics-based loss functions, which operate on normalized fields per channel. Monte Carlo dropout provides uncertainty measurement. The hybrid model produces precise predictions with coefficient of determination (R^2) values above 0.95 and mean squared errors below 10^-4 for all field components. This adaptive approach enhances the accuracy and scalability of laser-plasma simulations, providing a unified predictive framework for high-energy-density and particle acceleration applications.",
    "authors": [
      "Sadra Saremi",
      "Amirhossein Ahmadkhan Kordbacheh"
    ],
    "published": "2025-10-13T09:07:59Z",
    "updated": "2025-10-13T09:07:59Z",
    "categories": [
      "physics.plasm-ph",
      "cs.LG"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.09376v2",
    "url": "https://arxiv.org/abs/2510.09376v2",
    "pdf_url": "https://arxiv.org/pdf/2510.09376v2.pdf",
    "title": "A Living Review Pipeline for AI/ML Applications in Accelerator Physics",
    "abstract": "We present an open-source pipeline for generating a \\emph{living review} of artificial intelligence (AI) and machine learning (ML) applications in accelerator physics and technologies. Traditional review articles provide static snapshots that are quickly outdated by the rapid pace of research. The presented system automatically harvests publications from multiple bibliographic sources (arXiv, InspireHEP, HAL, OpenAlex, Crossref, and Springer), deduplicates entries, applies semantic filtering to ensure accelerator and ML relevance, and classifies papers into thematic categories. The resulting curated dataset was exported in JSON, HTML, PDF, and Bib\\TeX formats, enabling continuous updates and integration with web frameworks. We describe the methodology, including semantic similarity filtering using sentence-transformer embeddings, threshold calibration, and expert-informed classification. The results demonstrate the robust filtering of $\\sim$12000 raw papers/month into a focused corpus of $\\sim$2\\% relevant works. The pipeline provides the basis for an evolving community-driven review of AI/ML in accelerator science.",
    "authors": [
      "Adnan Ghribi"
    ],
    "published": "2025-10-10T13:31:46Z",
    "updated": "2025-10-13T07:54:38Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.10794v1",
    "url": "https://arxiv.org/abs/2510.10794v1",
    "pdf_url": "https://arxiv.org/pdf/2510.10794v1.pdf",
    "title": "Realizing the Scientific Program with Polarized Ion Beams at EIC",
    "abstract": "Polarized ion beams at the Electron Ion Collider are essential to address some of the most important open questions at the twenty-first century frontiers of understanding of the fundamental structure of matter. Here, we summarize the science case and identify polarized $^2$H, $^3$He, $^6$Li and $^7$Li ion beams as critical technology that will enable experiments which address the most important science. Further, we discuss the required ion polarimetry and spin manipulation in EIC. The current EIC accelerator design is presented. We identify a significant R\\&D effort involving both national laboratories and universities that is required over about a decade to realize the polarized ion beams and estimate (based on previous experience) that it will require about 20 FTE over 10 years (or a total of about 200 FTE-years) of personnel, including graduate students, postdoctoral researchers, technicians and engineers. Attracting, educating and training a new generation of physicists in experimental spin techniques will be essential for successful realization. AI/ML is seen as having significant potential for both acceleration of R\\&D and amplification of discovery in optimal realization of this unique quantum technology on a cutting-edge collider. The R\\&D effort is synergistic with research in atomic physics and fusion energy science.",
    "authors": [
      "Grigor Atoian",
      "Nigel Buttimore",
      "Giuseppe Ciullo",
      "Ian Cloet",
      "Marco Contalbrigo",
      "Jaydeep Datta",
      "Abhay Deshpande",
      "Shubham Dutta",
      "Oleg Eyser",
      "Muhammad Farooq",
      "Renee Fatemi",
      "Ishara Fernando",
      "Michael Finger",
      "Wolfram Fischer",
      "Dave Gaskell",
      "Prakash Gautam",
      "Ralf Gebel",
      "Boxing Gou",
      "Daoning Gu",
      "Yoshitaka Hatta",
      "Mohammad Hattawy",
      "Volker Hejny",
      "Kiel Hock",
      "Georg Hoffstaetter",
      "Haixin Huang",
      "Christopher Ianzano",
      "Jiangyong Jia",
      "Andro Kacharava",
      "Maggie Kerr",
      "Wolfgang Korsch",
      "Dario Lattuada",
      "Andreas Lehrach",
      "Minxiang Li",
      "Xiaqing Li",
      "Paolo Lenisa",
      "Win Lin",
      "James Maxwell",
      "Aleksei Melnikov",
      "Zein-Eddine Meziani",
      "Richard G. Milner",
      "William R. Milner",
      "Iurii Mitrankov",
      "Hamlet Mkrtchyan",
      "Prajwal MohanMurthy",
      "Christoph Montag",
      "Sergei Nagaitsev",
      "Charles-Joseph Naim",
      "Alexander Nass",
      "Dien Nguyen",
      "Nikolai Nikolaev",
      "Luciano Pappalardo",
      "Chao Peng",
      "Anna Piccoli",
      "Andrei Poblaguev",
      "Deepak Raparia",
      "Frank Rathmann",
      "Thomas Roser",
      "Premkumar Saganti",
      "Andrew Sandorfi",
      "Medani Sangroula",
      "Vincent Schoefer",
      "Yousif Shabaan El-Feky",
      "Rahul Shankar",
      "Vera Shmakova",
      "Evgeny Shulga",
      "Jamal Slim",
      "Dannie Steski",
      "Bernd Surrow",
      "Noah Wuerfel",
      "Yaojie Zhai"
    ],
    "published": "2025-10-12T20:24:34Z",
    "updated": "2025-10-12T20:24:34Z",
    "categories": [
      "nucl-ex",
      "nucl-th",
      "physics.acc-ph",
      "physics.ins-det"
    ],
    "primary_category": "nucl-ex"
  },
  {
    "arxiv_id": "2510.10112v1",
    "url": "https://arxiv.org/abs/2510.10112v1",
    "pdf_url": "https://arxiv.org/pdf/2510.10112v1.pdf",
    "title": "Thermal and Electrical Conductivities of Aluminum Up to 1000 eV: A   First-Principles Prediction",
    "abstract": "Accurate prediction of the thermal and electrical conductivities of materials under extremely high temperatures is essential in high-energy-density physics. These properties govern processes such as stellar core dynamics, planetary magnetic field generation, and laser-driven plasma evolution. However, first-principles methods like Kohn-Sham (KS) density functional theory (DFT) face challenges in predicting these properties due to prohibitively high computational costs. We propose a scheme that integrates the Kubo formalism with a mixed stochastic-deterministic DFT (mDFT) method, which substantially enhances efficiency in computing thermal and electrical conductivities of dense plasmas under extremely high temperatures. As a showcase, this approach enables {\\it ab initio} calculations of the thermal and electrical conductivities of Aluminum (Al) up to 1000 eV. Compared to traditional transport models, our first-principles results reveal significant deviations in the thermal and electrical conductivities of Al within the warm dense matter regime, underscoring the importance of accounting for quantum effects when investigating these transport properties of warm dense matter.",
    "authors": [
      "Qianrui Liu",
      "Xiantu He",
      "Mohan Chen"
    ],
    "published": "2025-10-11T08:43:18Z",
    "updated": "2025-10-11T08:43:18Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.09978v1",
    "url": "https://arxiv.org/abs/2510.09978v1",
    "pdf_url": "https://arxiv.org/pdf/2510.09978v1.pdf",
    "title": "Studying the properties of reconnection-driven turbulence",
    "abstract": "Magnetic reconnection, often accompanied by turbulence interaction, is a ubiquitous phenomenon in astrophysical environments. However, the current understanding of the nature of turbulent magnetic reconnection remains insufficient. We investigate the statistical properties of reconnection turbulence in the framework of the self-driven reconnection. Using the open-source software package AMUN, we first perform numerical simulations of turbulent magnetic reconnection. We then obtain the statistical results of reconnection turbulence by traditional statistical methods such as the power spectrum and structure function. Our numerical results demonstrate: (1) the velocity spectrum of reconnection turbulence follows the classical Kolmogorov type of $E\\propto k^{-5/3}$, while the magnetic field spectrum is steeper than the Kolmogorov spectrum, which are independent of limited resistivity, guide field, and isothermal or adiabatic fluid states; (2) most of the simulations show the anisotropy cascade, except that the presence of a guide field leads to an isotropic cascade; (3) reconnection turbulence is incompressible in the adiabatic state, with energy distribution dominated by the velocity solenoidal component; (4) different from pure magnetohydrodynamic (MHD) turbulence, the intermittency of the velocity field is stronger than that of the magnetic field in reconnection turbulence. The steep magnetic field spectrum, together with the velocity spectrum of Kolmogorov type, can characterize the feature of the reconnection turbulence. In the case of the presence of the guide field, the isotropy of the reconnection turbulence cascade is also different from the cascade mode of pure MHD turbulence. Our experimental results provide new insights into the properties of reconnection turbulence, which will contribute to advancing the self-driven reconnection theory.",
    "authors": [
      "Shi-Min Liang",
      "Jian-Fu Zhang",
      "Na-Na Gao",
      "Nian-Yu Yi"
    ],
    "published": "2025-10-11T03:14:25Z",
    "updated": "2025-10-11T03:14:25Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2507.22392v2",
    "url": "https://arxiv.org/abs/2507.22392v2",
    "pdf_url": "https://arxiv.org/pdf/2507.22392v2.pdf",
    "title": "Impact of coherent wiggler radiation impedance in Tau-Charm factories",
    "abstract": "Coherent synchrotron radiation (CSR) has long been recognized as a significant source of longitudinal impedance driving microwave instability in electron storage rings. In the pursuit of higher luminosity, next-generation circular $e^+e^-$ colliders operating in the few-GeV energy range, such as B-factories and Tau-Charm factories, are being designed with low-emittance beams and high beam currents. Damping wigglers are commonly introduced to reduce damping times and control beam emittance. In this study, we systematically investigate the impact of coherent wiggler radiation (CWR), a specific form of CSR generated within wigglers, on beam stability in Tau-Charm factories. We revisit the threshold conditions for CWR-induced microwave instability and evaluate its effects under realistic lattice configurations of collider rings. Furthermore, we examine theoretical models of longitudinal CWR impedance and identify improved formulations that better capture its influence. As an illustrative example, the developed CWR impedance models are applied to simulate beam stability in the Super Tau-Charm Facility currently under design in China.",
    "authors": [
      "Tianlong He",
      "Ye Zou",
      "Demin Zhou",
      "Hao Zhou",
      "Hangzhou Li",
      "Linhao Zhang",
      "Tao Liu",
      "Weiwei Li",
      "Jingyu Tang"
    ],
    "published": "2025-07-30T05:27:17Z",
    "updated": "2025-10-11T02:37:04Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.09889v1",
    "url": "https://arxiv.org/abs/2510.09889v1",
    "pdf_url": "https://arxiv.org/pdf/2510.09889v1.pdf",
    "title": "The Coming of Age of the Ultracold Electron Source: A Review",
    "abstract": "The ultracold electron source is a unique approach to the generation of high-brightness electron beams. We give an overview of its development over the past 20 years, including the underlying physical principles, technical details and recent experiments, and give a flavor of the exciting prospects that the future may hold.",
    "authors": [
      "Julius Huijts",
      "Jom Luiten"
    ],
    "published": "2025-10-10T22:11:05Z",
    "updated": "2025-10-10T22:11:05Z",
    "categories": [
      "physics.acc-ph",
      "physics.atom-ph"
    ],
    "primary_category": "physics.acc-ph"
  }
]