{
  "arxiv_id": "2506.11457v3",
  "url": "https://arxiv.org/abs/2506.11457v3",
  "pdf_url": "https://arxiv.org/pdf/2506.11457v3.pdf",
  "title": "Vibrational-Electron Heating in Plasma Flows: A Thermodynamically   Consistent Model",
  "abstract": "Accurate prediction of electron temperature ($T_{\\rm e}$) in non-equilibrium {plasma} flows is critical, yet hampered by inadequate models for electron heating from vibrationally excited states. Prior models often relied on ad-hoc scaling or flawed applications of detailed balance that failed to ensure the convergence of electron temperature and species-specific vibrational temperature ($T_{\\rm v}$) at thermal equilibrium. This paper introduces a novel, thermodynamically consistent electron heating model derived rigorously from the principle of detailed balance. By assuming a Boltzmann vibrational distribution and employing an effective activation energy, our approach yields a simple heating-to-cooling ratio of $\\exp(\\theta_{\\rm v}/T_{\\rm e}-\\theta_{\\rm v}/T_{\\rm v})$, where $\\theta_{\\rm v}$ is the characteristic vibrational temperature of the species under consideration. This formulation guarantees that $T_{\\rm e}$ correctly converges to $T_{\\rm v}$ at equilibrium. A key advantage is that our model can utilize total cooling rates determined from swarm experiments, leading to higher accuracy at low electron temperatures. For re-entry flows, the proposed approach predicts an electron temperature several times lower than previous models which results in improved agreement with some flight test data. These more reliable predictions can significantly enhance the modeling fidelity of plasma-assisted combustion, laser-induced plasmas, and various hypersonic plasma technologies such as electron transpiration cooling or magnetohydrodynamic force generators.",
  "authors": [
    "Felipe Martin Rodriguez Fuentes",
    "Bernard Parent"
  ],
  "published": "2025-06-13T04:28:10Z",
  "updated": "2025-09-20T05:54:35Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": "10.1063/5.0285170"
}