{
  "arxiv_id": "2506.10648v3",
  "url": "https://arxiv.org/abs/2506.10648v3",
  "pdf_url": "https://arxiv.org/pdf/2506.10648v3.pdf",
  "title": "Vortex-magnetic competition and regime transitions in antiparallel flux   tubes",
  "abstract": "Vortex-magnetic interactions shape magnetohydrodynamic (MHD) turbulence, influencing energy transfer in astrophysical, geophysical, and industrial systems. On the Sun, granular-scale vortex flows couple strongly with magnetic fields, channeling energy into the corona. At high Reynolds numbers, vorticity and magnetic fields are nearly frozen into the charged fluid, and MHD flows emerge from the Lorentz force mediated interactions between coherent vortex structures in matter and the field. To probe this competition in a controlled setting, we revisit the canonical problem of two antiparallel flux tubes. By varying the magnetic flux threading each tube--and thus sweeping the interaction parameter $N_i$, which gauges Lorentz-to-inertial force balance--we uncover three distinct regimes: vortex-dominated joint reconnection, instability-triggered cascade, and Lorentz-induced vortex disruption. At low $N_i$, classical vortex dynamics dominate, driving joint vortex-magnetic reconnection and amplifying magnetic energy via a dynamo effect. At moderate $N_i$, the system oscillates between vorticity-driven attraction and magnetic damping, triggering instabilities and nonlinear interactions that spawn secondary filaments and drive an energy cascade. At high $N_i$, Lorentz forces suppress vortex interactions, aligning the tubes axially while disrupting vortex cores and rapidly converting magnetic to kinetic energy. These findings reveal how the inertial-Lorentz balance governs energy transfer and coherent structure formation in MHD turbulence, offering insight into vortex-magnetic coevolution in astrophysical plasmas.",
  "authors": [
    "Weiyu Shen",
    "Rodolfo Ostilla-Mónico",
    "Xiaojue Zhu"
  ],
  "published": "2025-06-12T12:38:31Z",
  "updated": "2025-09-22T12:27:39Z",
  "categories": [
    "physics.flu-dyn",
    "astro-ph.SR",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.flu-dyn"
}