{
  "arxiv_id": "2507.20948v2",
  "url": "https://arxiv.org/abs/2507.20948v2",
  "pdf_url": "https://arxiv.org/pdf/2507.20948v2.pdf",
  "title": "Enhanced beam transport via space charge mitigation in a multistage   accelerator for fusion plasma diagnostics",
  "abstract": "Efficient transport of high-current negative ion beams is critical for accurate plasma potential diagnostics using heavy-ion beam probe (HIBP) systems in magnetically confined fusion plasmas. However, strong space-charge effects often degrade transport efficiency, particularly for heavy ions such as Au-. In this study, we demonstrate a substantial improvement in beam transport by introducing an electrostatic lens effect through optimized voltage allocation in a multistage acceleration system. Numerical simulations using IGUN, supported by experiments with the LHD-HIBP system, show that this approach effectively suppresses space-charge-induced beam divergence and loss. Without requiring mechanical modifications to the beamline, the optimized configuration enables a 2-3 fold increase in Au-beam current injected into the tandem accelerator. Consequently, plasma potential measurements were extended to higher-density plasmas, reaching line-averaged electron densities up to $1.75\\times 10^{19}$ m$^{-3}$ with improved signal-to-noise ratio. This technique offers a compact, practical, and highly effective solution for transporting high-current heavy-ion beams under space-charge-dominated conditions. Beyond its impact on plasma diagnostics, the method is broadly applicable to a wide range of accelerator systems, including those used in scientific and industrial applications where high-intensity beam transport is required.",
  "authors": [
    "M. Nishiura",
    "K. Nakamura",
    "K. Ueda",
    "A. Shimizu",
    "H. Takubo",
    "M. Kanda",
    "T. Ido",
    "M. Okamura"
  ],
  "published": "2025-07-28T15:59:15Z",
  "updated": "2025-09-20T05:15:13Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}