{
  "arxiv_id": "2509.17221v1",
  "url": "https://arxiv.org/abs/2509.17221v1",
  "pdf_url": "https://arxiv.org/pdf/2509.17221v1.pdf",
  "title": "Gas-jet target with online interferometric thickness measurement for   nuclear astrophysics",
  "abstract": "A new jet gas target system has been developed for the Felsenkeller 5 MV underground ion accelerator for nuclear astrophysics. It provides either a 1.5$\\times10^{18}$ cm$^{-2}$ thick cylindrical jet or a 7$\\times10^{17}$ cm$^{-2}$ thick wall of nitrogen gas, with a surface of 10$\\times$10 mm$^2$ to be seen by the ion beam. The system includes a de Laval type nozzle and altogether five pumping stages: In addition to the jet catcher and the jet chamber surrounding it, there are three stages connecting the jet to the ion accelerator. Behind the jet chamber, as seen from the ion beam, a windowless static-type gas target and, subsequently, a beam calorimeter have been installed.   This work describes the offline tests of the gas target system prior to its installation on the beam line of the Felsenkeller accelerator. The thickness of the jet has been determined using three different methods: By computational fluid dynamics simulations, with a Mach-Zehnder interferometer, and by $\\alpha$-energy loss using a mixed $\\alpha$ source. The three methods were shown to be in agreement. For 0-6 bar inlet gas pressure, a linear relationship between inlet pressure and jet thickness has been found. Different shapes of de Laval type inlet nozzles, both circular and slit-type, have been manufactured from fused silica glass or stainless steel and tested using measurements and simulations. The power and stability of the beam calorimeter have been tested. The interferometry has been shown to work reliably and to give two-dimensional projections of the gas jet with sub-mm resolution.",
  "authors": [
    "Anup Yadav",
    "Daniel Bemmerer",
    "Fabian Donat",
    "Juozas Dudutis",
    "Sören Göhler",
    "Maik Görler",
    "Maxim Hilz",
    "Arie Irman",
    "Migle Mackeviciute",
    "Konrad Schmidt",
    "Manfred Sobiella",
    "Vidmantas Tomkus",
    "Kai Zuber"
  ],
  "published": "2025-09-21T20:08:06Z",
  "updated": "2025-09-21T20:08:06Z",
  "categories": [
    "physics.ins-det",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det"
}