{
  "arxiv_id": "2509.17547v1",
  "url": "https://arxiv.org/abs/2509.17547v1",
  "pdf_url": "https://arxiv.org/pdf/2509.17547v1.pdf",
  "title": "Numerical Analysis of Ground Testing for the Intake Device of an   Atmosphere-Breathing Electric Propulsion",
  "abstract": "Atmosphere-breathing electric propulsion (ABEP) is a promising technology for long-term orbit maintenance in very-low-Earth orbit. The intake device plays a crucial role in capturing and supplying propellant, and its capture efficiency is a key indicator of drag-compensation feasibility. For experimental evaluation, an electric-propulsion (EP) plasma plume can be used as a particle-flow generator to simulate the VLEO atmosphere in ground facilities. This study numerically investigates the interaction of an EP plasma plume with an intake device to establish guidelines for measuring capture efficiency in conventional vacuum facilities. A hybrid PIC-DSMC method with ion-surface interaction models is employed to simulate the plasma plume incident on the intake. The composition of the captured flow is governed by beam-ion energy and species mass: lowering the energy and using lighter atmospheric constituents increase plume divergence and promote neutralization, yielding a neutral-dominated outlet flow. Sputtering of the intake surface becomes non-negligible at high energies but can be mitigated by operating at appropriately low beam energies. The results show that simultaneous ion and neutral diagnostics are required for reliable capture-efficiency evaluation when using EP plasma plumes in ground facilities.",
  "authors": [
    "Geonwoong Moon",
    "Eunji Jun",
    "Minwoo Yi",
    "Hyunjin Choi",
    "Kangmin Park",
    "Younho Kim",
    "Jaecheong Lee",
    "Jeongjae Lee",
    "Gahee Joo",
    "Seungho Shin",
    "Se Lee",
    "Yunhwang Jeong"
  ],
  "published": "2025-09-22T09:06:30Z",
  "updated": "2025-09-22T09:06:30Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}