{
  "arxiv_id": "2509.16441v1",
  "url": "https://arxiv.org/abs/2509.16441v1",
  "pdf_url": "https://arxiv.org/pdf/2509.16441v1.pdf",
  "title": "Impact of metallographic polishing on the RF properties of Niobium for   SRF applications",
  "abstract": "The performance of superconducting radio-frequency (SRF) cavities made of Niobium is tied to the quality of their inner surfaces exposed to the radio frequency (RF) waves. Future superconducting particle accelerators, because of their dimensions or the unprecedented stringent technical requirements, require the development of innovative surface processing techniques to improve processing reliability and if possible ecological footprint and cost, compared to conventional chemical processes. Metallographic polishing (MP) has emerged as a promising polishing technology to address these challenges. Previous studies focused on the characterization of the processed material surface at room temperature in the absence of RF waves. However, the evaluation of material properties, such as surface resistance under RF, at cryogenic temperature has failed, primarily due to the unavailability of devices capable of achieving the necessary resolution in the nanohm range. To overcome this limitation, a quadrupole resonator (QPR) has been utilized. The RF results demonstrate that the MP polishing, developed to preserve a high-quality niobium surface with very low surface resistance, is highly effective compared to conventional polishing. This conclusion is further supported by topography and microstructural analysis of the QPR top-hat samples, which revealed the clear superiority of the metallographic approach.",
  "authors": [
    "Oleksandr Hryhorenko",
    "Anne-Marie Valente-Feliciano",
    "David Longuevergne",
    "Claire Zylberajch Antoine",
    "Thomas Proslier",
    "Fabien Eozenou",
    "Oliver Kugele",
    "Sebastian Keckert",
    "Jens Knobloch"
  ],
  "published": "2025-09-19T21:40:43Z",
  "updated": "2025-09-19T21:40:43Z",
  "categories": [
    "physics.acc-ph",
    "physics.app-ph"
  ],
  "primary_category": "physics.acc-ph"
}