{
  "arxiv_id": "2509.16849v1",
  "url": "https://arxiv.org/abs/2509.16849v1",
  "pdf_url": "https://arxiv.org/pdf/2509.16849v1.pdf",
  "title": "Magnetic flux ropes within reconnection exhausts close to the centers of   heliospheric current sheets near the Sun",
  "abstract": "Understanding the relationship between magnetic flux ropes and magnetic reconnection is fundamental to both space and astrophysical plasma studies. In this study, we report on two consecutive heliospheric current sheet (HCS) crossings by Parker Solar Probe (PSP), separated by ~10.5 hours, at a heliocentric distance of ~12 solar radii. For each crossing, we identified a series of flux ropes embedded within reconnection exhausts on the sunward side of X-line. Their passage durations are <20sec, corresponding to spatial scales of a few thousands kilometers, still larger by three orders of magnitude than ion inertial length. This identification was possible particularly during intervals when PSP was closest to the HCS center. These flux ropes are distinguishable from the background exhausts by enhancements in magnetic field strength, significantly in the guide field component, travel speed slightly faster (typically by <10km/s) than surrounding outflows, and often accompanied by, though not always, increased density and reduced temperature. We attribute their origin to secondary reconnection within the exhausts and subsequent merging of smaller flux ropes into larger structures, consistent with predictions by various simulations. We suggest that such flux ropes are most readily identifiable at the HCS center where the background magnetic field is weakest so that the relative enhancement in flux rope field becomes most prominent. This observational advantage is particularly notable closer to the Sun where the high ambient magnetic field strength can otherwise obscure such structures unless the spacecraft trajectory remains within the HCS central region for a sufficient duration.",
  "authors": [
    "Dae-Young Lee",
    "Dooyoung Choi",
    "Kyung-Eun Choi",
    "Sung Jun Noh"
  ],
  "published": "2025-09-21T00:38:28Z",
  "updated": "2025-09-21T00:38:28Z",
  "categories": [
    "astro-ph.SR",
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.SR"
}