{
  "arxiv_id": "2509.17861v1",
  "url": "https://arxiv.org/abs/2509.17861v1",
  "pdf_url": "https://arxiv.org/pdf/2509.17861v1.pdf",
  "title": "Ion-scale Turbulence and Energy Cascade Rate in the Solar Corona and   Inner Heliosphere",
  "abstract": "Plasma turbulence cascading from MHD to kinetic scales in the heliospheric plasma is believed to play a key role in coronal heating and fast solar wind acceleration, but the properties of the turbulence remain poorly constrained by observations. Here we compare the ion-scale density fluctuation levels inferred from the properties of solar radio bursts with the magnetic field fluctuation levels obtained through in-situ measurements in the inner heliosphere. We find that the observed magnetic and density fluctuation amplitudes are consistent with excitation by kinetic Alfv\\'en waves and/or KAW structures over broad range of distances from the Sun. We then use the radio diagnostics and the KAW scenario to deduce the radial variation of magnetic fluctuation amplitudes in regions close to the Sun where in-situ measurements cannot be obtained. Further, we calculate the energy cascade rate (plasma heating rate) profile over a region that extends from the low corona ($\\sim 0.1$~R$_\\odot$) into the heliosphere (out to $\\sim 1$~au), and compare it to the energy deposition rate required to drive the solar wind. The cascade rate agrees with the available in-situ measurements and also provides predictions closer than $\\sim 10$~R$_\\odot$ where in-situ approaches are not available. The results provide unique diagnostics of the ion-scale plasma turbulence amplitude and energy cascade rate spanning over three orders of magnitude in solar distance.",
  "authors": [
    "Eduard P. Kontar",
    "A. Gordon Emslie",
    "Daniel L. Clarkson",
    "Alexander Pitna"
  ],
  "published": "2025-09-22T14:56:01Z",
  "updated": "2025-09-22T14:56:01Z",
  "categories": [
    "astro-ph.SR",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.SR"
}