{
  "arxiv_id": "2509.16471v1",
  "url": "https://arxiv.org/abs/2509.16471v1",
  "pdf_url": "https://arxiv.org/pdf/2509.16471v1.pdf",
  "title": "From Coated to Uncoated: Scanning Electron Microscopy Corrections to   Estimate True Surface Pore Size in Nanoporous Membranes",
  "abstract": "Scanning electron microscopy (SEM) is the premier method for characterizing the nanoscale surface pores in ultrafiltration (UF) membranes and the support layers of reverse osmosis (RO) membranes. Based on SEM, the conventional understanding is that membranes typically have low surface porosities of <10%. We hypothesized that high acceleration voltage during SEM imaging and sputter metal coatings required for SEM have led to systematic underestimations of porosity and pore size. We showed that imaging a commercial UF membrane at 1, 5, and 10 kV reduced measured porosity from 10.3% (1 kV) to 6.3% (10 kV), while increasing Pt coating thickness from 1.5 to 5 nm lowered porosity by 54% for the UF membrane (12.9% to 5.8%) and 46% for an RO support (13.1% to 7.0%). To account for coating thickness, we developed a digital correction method that simulates pore dilation, enabling the pore structure to be estimated for uncoated membranes. Dilation yielded uncoated porosity values of 23% for the UF membrane and 20% for the RO support, about 3-fold greater than values observed with a 4 nm coating. Mean pore diameters were 2-fold greater for the UF membrane and 1.5-fold greater for the RO support. Critically, dilation-derived pore-size distributions agreed with low-flux dextran-retention data fitted with the Bungay-Brenner model. Our results suggest that surface porosities and pore sizes of nanoporous membranes are much larger than previously understood, with major implications for structure/transport relationships. For future nanoscale pore analysis of membranes (and other nanoporous materials), we recommend low acceleration voltage (1 kV), minimal coatings (1-2 nm), and digital dilation to account for coating artifacts",
  "authors": [
    "Sima Zeinali Danalou",
    "Dian Yu",
    "Niher R. Sarker",
    "Hooman Chamani",
    "Jane Y. Howe",
    "Patrick C. Lee",
    "Jay R. Werber"
  ],
  "published": "2025-09-19T23:46:08Z",
  "updated": "2025-09-19T23:46:08Z",
  "categories": [
    "cond-mat.mtrl-sci",
    "cs.CV",
    "physics.app-ph",
    "physics.chem-ph",
    "physics.ins-det"
  ],
  "primary_category": "cond-mat.mtrl-sci"
}