[
  {
    "arxiv_id": "2509.16793v2",
    "url": "https://arxiv.org/abs/2509.16793v2",
    "pdf_url": "https://arxiv.org/pdf/2509.16793v2.pdf",
    "title": "Galilean Electromagnetic Particle-in-Cell Code",
    "abstract": "We introduce a Galilean electromagnetic particle-in-cell (GEM-PIC) algorithm, which transforms the full set of Maxwell equations and the Vlasov equation into the boosted coordinates. This approach preserves the electromagnetic structure of the interaction while exploiting scale separation for computational effi ciency. Unlike quasistatic methods, GEM-PIC does not have to distinguish between beam and streaming particles, allowing a self-consistent treatment of particle trapping. The EM-PIC algorithm allows for highly effi cient and accurate simulations of plasma-based wakefield acceleration.",
    "authors": [
      "Alexander Pukhov",
      "Nina Elkina"
    ],
    "published": "2025-09-20T19:48:17Z",
    "updated": "2025-09-23T07:37:04Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.18032v1",
    "url": "https://arxiv.org/abs/2509.18032v1",
    "pdf_url": "https://arxiv.org/pdf/2509.18032v1.pdf",
    "title": "Impact of nonthermal electron distributions on the triggering of the   ion-ion acoustic instability near the Sun: Kinetic simulations",
    "abstract": "Context. In a previous paper (Afify et al. 2024), we have investigated the stability threshold of the ion-ion acoustic instability (IIAI) in parameter regimes compatible with recent Parker Solar Probe (PSP, (Fox et al. 2016)) observations, in the presence of a Maxwellian electron distribution. We found that observed parameters are close to the instability threshold, but IIAI requires a higher electron temperature than observed. Aims. As electron distributions in the solar wind present clear non-Maxwellian features, we investigate here if deviations from the Maxwellian distribution could explain the observed IIAI. We address specifically the kappa ( $\\kappa$ ) and core-strahl distributions for the electrons. Methods. We perform analytical studies and kinetic simulations using a Vlasov-Poisson code in a parameter regime relevant to PSP observations. The simulated growth rates are validated against kinetic theory. Results. We show that the IIAI threshold changes in the presence of $\\kappa$ or core-strahl electron distributions, but not significantly. In the latter case, the expression of an effective temperature for an equivalent Maxwellian electron distribution given in Jones et al. (1975) is confirmed by simulations. Such an effective temperature could simplify stability assessment of future observations.",
    "authors": [
      "M. S. Afify",
      "J. Dreher",
      "S. O'Neill",
      "M. E. Innocenti"
    ],
    "published": "2025-09-22T17:06:28Z",
    "updated": "2025-09-22T17:06:28Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2509.17997v1",
    "url": "https://arxiv.org/abs/2509.17997v1",
    "pdf_url": "https://arxiv.org/pdf/2509.17997v1.pdf",
    "title": "Hybrid Electromagnetic Calorimeter Module: Enhanced Performance through   Integration of Silicon Pixel Layer into Scintillator Design",
    "abstract": "This study constructs a hybrid module with a multi-material collaborative detection architecture by integrating silicon pixel layers into the longitudinally segmented scintillating fiber sampling calorimeter module and optimizes the placement of the silicon layers. The module utilizes the pre-shower characteristics of the front-end scintillator units to ensure sufficient energy deposition in the silicon pixel layers, thereby maintaining its high-precision detection capability. A dedicated simulation framework combining Geant4 modeling for the scintillator section and a parameterized approach for the silicon pixel layer is employed for module verification and performance study. The hybrid module demonstrates overall performance enhancement. The maximum achievable improvements are 56\\% for position resolution and 26\\% for time resolution, respectively. These advancements also lead to significant increase of physics sensitivity, especially for physics channels with low-energy photons, for instance, a 16\\% boost in signal significance for $D^{*0}$ from the $B^-\\rightarrow D^{*0}(\\rightarrow D^0 \\gamma)\\pi^-$ decay",
    "authors": [
      "Jia-Le Fei",
      "Ao Yuan",
      "Chang-Heng Huang",
      "Liu-Pan An",
      "Ji-Ke Wang"
    ],
    "published": "2025-09-22T16:37:54Z",
    "updated": "2025-09-22T16:37:54Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.17934v1",
    "url": "https://arxiv.org/abs/2509.17934v1",
    "pdf_url": "https://arxiv.org/pdf/2509.17934v1.pdf",
    "title": "Superconducting Low-beta Nb$_3$Sn Cavity for ATLAS and Future Ion   Accelerators",
    "abstract": "We report on a Nb$_3$Sn-coated low-beta superconducting radio frequency (SRF) cavity intended for accelerating ions. We aim to apply the cavity in ATLAS, our Argonne National Laboratory user facility for nuclear physics studies with ion beams in the energy range of 5-20 MeV/u. The Nb$_3$Sn-coated cavity, a 145 MHz quarter-wave optimized for ions moving with velocity $\\beta$=v/c=0.08 exhibits an order-of-magnitude reduction in radiofrequency (RF) losses into helium at $4.4\\,\\mathrm{K}$ compared to a superconducting niobium (Nb) cavity at the same frequency and temperature. Experimentally measured fields are among the highest to date for any Nb$_3$Sn-coated cavity, reaching to the peak surface magnetic field of 105 mT. We also present a practical solution to the problem of cavity frequency tuning. Tuning by mechanical deformation has been a challenge with Nb$_3$Sn due to its brittle nature, however, using a set of techniques tailored to the properties of thin-film Nb$_3$Sn on Nb, we can repeatably tune the cavity to the ATLAS master clock frequency after it is cooled, while maintaining the excellent performance characteristics. The same Nb$_3$Sn cavity technology offers broad benefits for future ion accelerators.",
    "authors": [
      "T. Petersen",
      "G. Eremeev",
      "B. Tennis",
      "N. Tagdulanga",
      "Y. Zhou",
      "M. Kedzie",
      "B. Guilfoyle",
      "Y. Xu",
      "S. V. Kutsaev",
      "R. Agustsson",
      "E. Spranza",
      "P. Davis",
      "G. P. Zinkann",
      "T. Reid",
      "S. Posen",
      "M. P. Kelly"
    ],
    "published": "2025-09-22T15:54:44Z",
    "updated": "2025-09-22T15:54:44Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2504.08932v3",
    "url": "https://arxiv.org/abs/2504.08932v3",
    "pdf_url": "https://arxiv.org/pdf/2504.08932v3.pdf",
    "title": "AC-LGADs Fermilab Front-End Electronics Characterization",
    "abstract": "We characterized the front-end electronics used to process high-frequency signals from low-gain avalanche diodes (LGADs) at the Fermilab Test Beam Facility. LGADs are silicon detectors employed for charged particle tracking, offering exceptional spatial and temporal resolution. The purpose of this characterization was to understand how the time resolution is influenced by the front-end electronics. To achieve this, we developed a setup capable of generating input signals with varying amplitudes. The output results demonstrated that signal processing by the front-end electronics plays a crucial role in enhancing time resolution. We showed that the time resolution achieved by the FEE board is better than $2\\: ps$ at the $1\\sigma$ level.",
    "authors": [
      "René Ríos",
      "Esteban Felipe Molina Cardenas",
      "Cristian Peña",
      "Orlando Soto",
      "William Brooks",
      "Artur Apresyan",
      "Sergey Los",
      "Claudio San Martín"
    ],
    "published": "2025-04-11T19:19:11Z",
    "updated": "2025-09-22T15:12:03Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.17861v1",
    "url": "https://arxiv.org/abs/2509.17861v1",
    "pdf_url": "https://arxiv.org/pdf/2509.17861v1.pdf",
    "title": "Ion-scale Turbulence and Energy Cascade Rate in the Solar Corona and   Inner Heliosphere",
    "abstract": "Plasma turbulence cascading from MHD to kinetic scales in the heliospheric plasma is believed to play a key role in coronal heating and fast solar wind acceleration, but the properties of the turbulence remain poorly constrained by observations. Here we compare the ion-scale density fluctuation levels inferred from the properties of solar radio bursts with the magnetic field fluctuation levels obtained through in-situ measurements in the inner heliosphere. We find that the observed magnetic and density fluctuation amplitudes are consistent with excitation by kinetic Alfv\\'en waves and/or KAW structures over broad range of distances from the Sun. We then use the radio diagnostics and the KAW scenario to deduce the radial variation of magnetic fluctuation amplitudes in regions close to the Sun where in-situ measurements cannot be obtained. Further, we calculate the energy cascade rate (plasma heating rate) profile over a region that extends from the low corona ($\\sim 0.1$~R$_\\odot$) into the heliosphere (out to $\\sim 1$~au), and compare it to the energy deposition rate required to drive the solar wind. The cascade rate agrees with the available in-situ measurements and also provides predictions closer than $\\sim 10$~R$_\\odot$ where in-situ approaches are not available. The results provide unique diagnostics of the ion-scale plasma turbulence amplitude and energy cascade rate spanning over three orders of magnitude in solar distance.",
    "authors": [
      "Eduard P. Kontar",
      "A. Gordon Emslie",
      "Daniel L. Clarkson",
      "Alexander Pitna"
    ],
    "published": "2025-09-22T14:56:01Z",
    "updated": "2025-09-22T14:56:01Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2509.15383v2",
    "url": "https://arxiv.org/abs/2509.15383v2",
    "pdf_url": "https://arxiv.org/pdf/2509.15383v2.pdf",
    "title": "Integration and commissioning plan of Full Flow Purifier at Muon Campus",
    "abstract": "The Full Flow Purifier for Fermilab's Muon Campus uses a charcoal bed surrounded by a liquid nitrogen jacket to purify up to 240 g/s of helium gas. Fabrication by Ability Engineering Technology Inc. has been completed and the purifier delivered to Fermilab. It is the largest purifier to be used at Fermilab based on both capacity and size. A previous paper discussed the design of purifier for various operational conditions and horizontal shipping. The purifier is designed to withstand 5g force in vertical and 2g force in lateral and longitudinal directions. Transportation experience from vendor to Fermilab and within site is discussed. Integration of the purifier involved design and fabrication of a liquid nitrogen transfer line, regeneration system, and helium piping to connect it to Muon Campus cryogenic system. It also involved establishing electrical, instrumentation and controls connections to the system. Integration of the purifier is discussed in detail. The purifier is to be commissioned using up to 4 MYCOM helium compressors to supply helium and liquid nitrogen supplied by a 60,000-liter tank. Actual effectiveness of the 3-stream heat exchanger is to be estimated based on measured temperatures and flow rate. Impurity levels will be monitored at inlet and outlet of the purifier. Theoretical adsorption capacity of the purifier is calculated based on the measured temperatures and flowrates and is compared to actual adsorption capacity over time.",
    "authors": [
      "J. Subedi",
      "T. Tope",
      "B. Hansen",
      "M. White",
      "J. Tillman",
      "V. Patel",
      "W. Cyko",
      "J. Dong"
    ],
    "published": "2025-09-18T19:40:34Z",
    "updated": "2025-09-22T14:11:05Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2504.01525v3",
    "url": "https://arxiv.org/abs/2504.01525v3",
    "pdf_url": "https://arxiv.org/pdf/2504.01525v3.pdf",
    "title": "Rapid muon tomography for border security",
    "abstract": "Cosmic-ray muon tomography is a promising technique for border security applications, leveraging highly penetrating cosmic-ray muons and their interactions with various materials to generate 3D images of large and dense objects, such as shipping containers. Using scattering and absorption of muons as they pass through dense cargo materials, muon tomography provides a viable solution for customs and border security by enabling the verification of shipping container declarations and preventing illegal trafficking. In this study, we utilized Monte Carlo simulations to evaluate the effectiveness of muon tomography for cargo characterization and contraband detection in various smuggling scenarios. Our results demonstrate that muon tomography can offers a novel approach to cargo inspection, moving beyond traditional 3D image reconstruction. Instead, it analyzes muon scattering and absorption rates in real time during scanning, enabling the prompt detection of discrepancies between actual cargo contents and declared goods within just 10 to 20 seconds. This method is particularly effective for cargo consisting of uniform loads composed of a single material or product, a common practice in shipping. Unlike traditional X-ray radiography, which analyzes detailed 2D images, muon tomography begins evaluating scatter-absorption rates within the first few seconds of scanning. This early assessment enables cargo evaluation long before a statistically reliable 3D image is formed, significantly improving scanning throughput without disrupting trade flow.",
    "authors": [
      "Anzori Sh. Georgadze"
    ],
    "published": "2025-04-02T09:12:31Z",
    "updated": "2025-09-22T14:04:10Z",
    "categories": [
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.app-ph"
  },
  {
    "arxiv_id": "2509.10319v2",
    "url": "https://arxiv.org/abs/2509.10319v2",
    "pdf_url": "https://arxiv.org/pdf/2509.10319v2.pdf",
    "title": "The merger of spinning, accreting supermassive black hole binaries",
    "abstract": "Because they are likely to accrete substantial amounts of interstellar gas, merging supermassive binary black holes are expected to be strong multimessenger sources, radiating gravitational waves, photons from thermal gas, and photons from relativistic electrons energized by relativistic jets. Here we report on a numerical simulation that covers the late inspiral, merger, and initial postmerger phase of such a system where both black holes have the same mass and spin, and both spin axes are parallel to the orbital angular momentum. The simulation incorporates both 3D general relativistic magnetohydrodynamics and numerical relativity. The thermal photon power during the late inspiral, merger, and immediate postmerger phases is drawn from strong shocks rather than dissipation of turbulence inside a smoothly structured accretion disk as typically found around accreting single black holes. We find that the thermal photon and jet Poynting flux outputs are closely related in time, and we posit a mechanism that enforces this relation. The power radiated in both photons and jets diminishes gradually as merger is approached, but jumps sharply at merger to a noisy plateau. Such a distinct lightcurve should aid efforts to identify supermassive black hole mergers, with or without accompanying gravitational wave detections.",
    "authors": [
      "Lorenzo Ennoggi",
      "Manuela Campanelli",
      "Julian Krolik",
      "Scott C. Noble",
      "Yosef Zlochower",
      "Maria Chiara de Simone"
    ],
    "published": "2025-09-12T15:00:43Z",
    "updated": "2025-09-22T13:40:59Z",
    "categories": [
      "astro-ph.HE",
      "gr-qc",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2509.17716v1",
    "url": "https://arxiv.org/abs/2509.17716v1",
    "pdf_url": "https://arxiv.org/pdf/2509.17716v1.pdf",
    "title": "Validation of the Following Streamer mechanism for SF6 breakdown induced   by floating linear metal particles",
    "abstract": "A recently proposed Following Streamer mechanism (Feng et al. 2025 Phys. Rev. Applied 23 064039) seeks to explain how floating metal particles induce SF6 streamer breakdown in the combined gap. This mechanism is derived from a 2D axisymmetric fluid model, which has limitations in describing multiple streamer events in real-world 3D scenarios. To validate the Following Streamer mechanism, we experimentally investigate the discharge morphology of SF6 streamers induced by a floating linear metal particle under negative pulsed voltage. The results are then compared with those from 2D axisymmetric fluid simulations. The comparison reveals both consistencies and discrepancies. Regarding consistencies, experimentally observed features-such as streamer inception at both ends of the metal particle and the formation of subsequent following streamers-support the general idea of the Following Streamer mechanism. Regarding discrepancies, the experiments show a larger number of following streamers and off-axis propagation paths, which cannot be described in the 2D simulation. For scientific rigor, an extended physical model was proposed to improve the description of the Following Streamer mechanism.",
    "authors": [
      "Zihao Feng"
    ],
    "published": "2025-09-22T12:51:36Z",
    "updated": "2025-09-22T12:51:36Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.10648v3",
    "url": "https://arxiv.org/abs/2506.10648v3",
    "pdf_url": "https://arxiv.org/pdf/2506.10648v3.pdf",
    "title": "Vortex-magnetic competition and regime transitions in antiparallel flux   tubes",
    "abstract": "Vortex-magnetic interactions shape magnetohydrodynamic (MHD) turbulence, influencing energy transfer in astrophysical, geophysical, and industrial systems. On the Sun, granular-scale vortex flows couple strongly with magnetic fields, channeling energy into the corona. At high Reynolds numbers, vorticity and magnetic fields are nearly frozen into the charged fluid, and MHD flows emerge from the Lorentz force mediated interactions between coherent vortex structures in matter and the field. To probe this competition in a controlled setting, we revisit the canonical problem of two antiparallel flux tubes. By varying the magnetic flux threading each tube--and thus sweeping the interaction parameter $N_i$, which gauges Lorentz-to-inertial force balance--we uncover three distinct regimes: vortex-dominated joint reconnection, instability-triggered cascade, and Lorentz-induced vortex disruption. At low $N_i$, classical vortex dynamics dominate, driving joint vortex-magnetic reconnection and amplifying magnetic energy via a dynamo effect. At moderate $N_i$, the system oscillates between vorticity-driven attraction and magnetic damping, triggering instabilities and nonlinear interactions that spawn secondary filaments and drive an energy cascade. At high $N_i$, Lorentz forces suppress vortex interactions, aligning the tubes axially while disrupting vortex cores and rapidly converting magnetic to kinetic energy. These findings reveal how the inertial-Lorentz balance governs energy transfer and coherent structure formation in MHD turbulence, offering insight into vortex-magnetic coevolution in astrophysical plasmas.",
    "authors": [
      "Weiyu Shen",
      "Rodolfo Ostilla-Mónico",
      "Xiaojue Zhu"
    ],
    "published": "2025-06-12T12:38:31Z",
    "updated": "2025-09-22T12:27:39Z",
    "categories": [
      "physics.flu-dyn",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.flu-dyn"
  },
  {
    "arxiv_id": "2509.17653v1",
    "url": "https://arxiv.org/abs/2509.17653v1",
    "pdf_url": "https://arxiv.org/pdf/2509.17653v1.pdf",
    "title": "From real-time calibrations to smart HV tuning for FAIR",
    "abstract": "Real-time data processing of the next generation of experiments at FAIR requires reliable event reconstruction and thus depends heavily on in-situ calibration procedures. Previously, we developed a neural-network-based approach that predicts calibration parameters from continuously available environmental and operational data and validated it on the HADES Multiwire Drift Chambers (MDCs), achieving fast predictions as accurate as offline calibrations. In this work, we introduce several methodological improvements that enhance both accuracy and the ability to adapt to new data. These include changes to the input features, better offline calibration and trainable normalizations. Furthermore, by combining beam-time and cosmic-ray datasets, we demonstrate that the learned dependencies can be transferred between very different data-taking scenarios. This enables the network not only to provide real-time calibration predictions, but also to infer optimal high-voltage settings, thus establishing a practical framework for a real-time detector control during data acquisition process.",
    "authors": [
      "Valentin Kladov",
      "Johan Messchendorp",
      "James Ritman"
    ],
    "published": "2025-09-22T11:57:57Z",
    "updated": "2025-09-22T11:57:57Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.17547v1",
    "url": "https://arxiv.org/abs/2509.17547v1",
    "pdf_url": "https://arxiv.org/pdf/2509.17547v1.pdf",
    "title": "Numerical Analysis of Ground Testing for the Intake Device of an   Atmosphere-Breathing Electric Propulsion",
    "abstract": "Atmosphere-breathing electric propulsion (ABEP) is a promising technology for long-term orbit maintenance in very-low-Earth orbit. The intake device plays a crucial role in capturing and supplying propellant, and its capture efficiency is a key indicator of drag-compensation feasibility. For experimental evaluation, an electric-propulsion (EP) plasma plume can be used as a particle-flow generator to simulate the VLEO atmosphere in ground facilities. This study numerically investigates the interaction of an EP plasma plume with an intake device to establish guidelines for measuring capture efficiency in conventional vacuum facilities. A hybrid PIC-DSMC method with ion-surface interaction models is employed to simulate the plasma plume incident on the intake. The composition of the captured flow is governed by beam-ion energy and species mass: lowering the energy and using lighter atmospheric constituents increase plume divergence and promote neutralization, yielding a neutral-dominated outlet flow. Sputtering of the intake surface becomes non-negligible at high energies but can be mitigated by operating at appropriately low beam energies. The results show that simultaneous ion and neutral diagnostics are required for reliable capture-efficiency evaluation when using EP plasma plumes in ground facilities.",
    "authors": [
      "Geonwoong Moon",
      "Eunji Jun",
      "Minwoo Yi",
      "Hyunjin Choi",
      "Kangmin Park",
      "Younho Kim",
      "Jaecheong Lee",
      "Jeongjae Lee",
      "Gahee Joo",
      "Seungho Shin",
      "Se Lee",
      "Yunhwang Jeong"
    ],
    "published": "2025-09-22T09:06:30Z",
    "updated": "2025-09-22T09:06:30Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.17528v1",
    "url": "https://arxiv.org/abs/2509.17528v1",
    "pdf_url": "https://arxiv.org/pdf/2509.17528v1.pdf",
    "title": "Performance of a Large-Volume Cryogenic Pure CsI Detector for CEνNS   and Low-Energy Rare-Event Searches",
    "abstract": "A cryogenic detector system based on two 3.3 kg high-purity CsI crystals was developed and characterized at approximately 95 K. Each wedge-shaped crystal was coupled to dual-ended 3-inch photomultiplier tubes (PMTs) for scintillation readout. The measured light yields were $28.7 \\pm 0.9$ and $29.3 \\pm 1.0$ photoelectrons per keV electron-equivalent (PE/keV$_{ee}$) for the two crystals, with corresponding energy resolutions of 7.2 \\% and 7.7 \\% (FWHM) at 59.6 keV. The detector demonstrated excellent spatial uniformity, low intrinsic radioactivity, and stable operation over a continuous one-month period. Optical photon simulations using Geant4 reproduced the observed light collection trends, providing guidance for detector optimization. These results establish cryogenic pure CsI as a scalable technology for low-threshold rare-event searches.",
    "authors": [
      "Chen'guang Su",
      "Lingquan Kong",
      "Qian Liu",
      "Shi Chen",
      "Wenqian Huang",
      "Kimiya Moharrami",
      "Yangheng Zheng",
      "Jin Li"
    ],
    "published": "2025-09-22T08:50:46Z",
    "updated": "2025-09-22T08:50:46Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.17521v1",
    "url": "https://arxiv.org/abs/2509.17521v1",
    "pdf_url": "https://arxiv.org/pdf/2509.17521v1.pdf",
    "title": "Delta-Doped Diamond via in-situ Plasma-Distance Control",
    "abstract": "We present an approach for the CVD growth of diamond, where the sample is placed in a defined distance from the reactor baseplate, to which the plasma couples. We observe two previously unknown growth regimes. In the first case, the sample is positioned within three to five millimeters of the plasma, leading to a decreased growth rate, compared to a position inside the plasma and, additionally, to an increased nitrogen incorporation, allowing the fabrication of delta-doped layers with a thickness below 30 nm. In another regime, where the sample is more than 10 mm away from the plasma, no growth is observed. Instead, we assume a deposition of nitrogen-rich species on the diamond surface, which is incorporated during the growth of the following layer. All fabricated layers show NV emission, where the intensity correlates with the nitrogen incorporation. The growth techniques could allow the fabrication of highly doped thin films for quantum sensing applications, as well as layers with low NV concentration, for quantum computing. The new approaches are applicable not only for nitrogen incorporation but also for other defects, for example, phosphorus, which could open up new avenues for diamond-based electronics.",
    "authors": [
      "Philip Schätzle",
      "Felix Hoffmann",
      "Sven Mägdefessel",
      "Patrik Straňák",
      "Lutz Kirste",
      "Peter Knittel"
    ],
    "published": "2025-09-22T08:47:58Z",
    "updated": "2025-09-22T08:47:58Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2509.17453v1",
    "url": "https://arxiv.org/abs/2509.17453v1",
    "pdf_url": "https://arxiv.org/pdf/2509.17453v1.pdf",
    "title": "Modeling stopping power of ions in plasmas using parametric potentials",
    "abstract": "We present a study of the ion stopping power due to free and bound electrons in a warm dense plasma. Our main goal is to propose a method of stopping-power calculation expected to be valid for any ionization degree. The free-electron contribution is described by the Maynard-Deutsch-Zimmerman formula and the bound-electron one relies on the Bethe formula with corrections, in particular taking into account density and shell effects. The impact of the bound-state computation by three different parametric potentials is investigated within the Garbet formalism for the mean excitation energy. The first parametric potential is due to Green, Sellin and Zachor, the second one was proposed by Yunta, and the third one was introduced by Klapisch in the framework of atomic-structure computations. The results are compared to the ones of self-consistent average-atom calculations. This approach correctly bridges the limits of neutral and fully-ionized matter.",
    "authors": [
      "Tanguy Barges Delattre",
      "Sébastien Rassou",
      "Jean-Christophe Pain"
    ],
    "published": "2025-09-22T07:47:37Z",
    "updated": "2025-09-22T07:47:37Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.13372v3",
    "url": "https://arxiv.org/abs/2508.13372v3",
    "pdf_url": "https://arxiv.org/pdf/2508.13372v3.pdf",
    "title": "Free electron charging of microdroplets in a plasma at atmospheric   pressure",
    "abstract": "Gas-phase microdroplets have recently demonstrated exceptional chemical properties via suspected mechanisms such as contact electrification and surface charge pinning, producing high surface electric fields. Here, microdroplets are injected into a low-temperature atmospheric-pressure plasma and exposed to an excess free-electron flux. We report the first measurements of droplet charge in a fully collisional plasma, with averages up to 2.5 $\\times 10^{5}$ electrons for 15 $\\mu$m droplets, dependent on absorbed power. Simulations indicate solid particles under similar conditions acquire $\\sim$40\\% less charge, likely due to low-mobility water cluster ion formation around evaporating droplets, and predict surface electric fields up to $10^{7}$ V m$^{-1}$ for the smallest droplets (3 $\\mu$m). Plasma exposure also produces H$_{2}$O$_{2}$ in the liquid, with concentrations up to 33 mM, corresponding to remarkable generation rates exceeding 275 M s$^{-1}$. The system involves complex, not yet fully elucidated mechanisms. A controlled plasma environment enables defined charge levels and exposure times, allowing systematic study and enhancing droplet properties.",
    "authors": [
      "Nourhan Hendawy",
      "Harold McQuaid",
      "Somhairle Mag Uidhir",
      "David Rutherford",
      "Declan Diver",
      "Davide Mariotti",
      "Paul Maguire"
    ],
    "published": "2025-08-18T21:27:54Z",
    "updated": "2025-09-22T06:54:50Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.17379v1",
    "url": "https://arxiv.org/abs/2509.17379v1",
    "pdf_url": "https://arxiv.org/pdf/2509.17379v1.pdf",
    "title": "Negative charge acquisition by isolated single microdroplets from plasma   exposure at atmospheric pressure",
    "abstract": "Charged liquid microdroplets have generated significant interest recently due to the observation of chemical reaction rate enhancement by orders of magnitude. Droplet charging by plasma irradiation has been observed along with significantly enhanced reactions in liquid. In this paper we measure the charge on fixed size (47 $\\mu$m) individual droplets, exposed for approximately 4 ms to a low temperature RF-driven plasma operated at atmospheric pressure. The measured charge values (0.8--2.0 $\\times 10^{7}$ electrons) approached the Rayleigh limit for the given droplet diameter. Results were compared with finite element simulations of plasma charging which provided estimates of surface electric fields and charge fluxes to the droplet surface and helps advance the development of a theoretical framework for plasma-charged microreactors.",
    "authors": [
      "Nourhan Hendawy",
      "Harold McQuaid",
      "Somhairle Mag Uidhir",
      "David Rutherford",
      "Declan Diver",
      "Davide Mariotti",
      "Paul Maguire"
    ],
    "published": "2025-09-22T06:38:07Z",
    "updated": "2025-09-22T06:38:07Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.17373v1",
    "url": "https://arxiv.org/abs/2509.17373v1",
    "pdf_url": "https://arxiv.org/pdf/2509.17373v1.pdf",
    "title": "Radiation damage study of Belle II silicon strip sensors with 90 MeV   electron irradiation",
    "abstract": "The silicon strip sensors of the Belle II silicon vertex detector were irradiated with 90 MeV electron beams up to an equivalent 1-MeV-neutron fluence of $3.0\\times 10^{13}~{\\rm n}_{\\rm eq}/{\\rm cm^2}$. We measure changes in sensor properties induced by radiation damage in the semiconductor bulk. Electrons around this energy are a major source of beam-induced background during Belle II operation. We discuss observed changes in full depletion voltage, sensor leakage current, noise, and charge collection. The sensor bulk type inverts at an equivalent 1-MeV-neutron fluence of $6.0\\times 10^{12}~{\\rm n}_{\\rm eq}/{\\rm cm^2}$. The leakage current increases proportionally to the radiation dose. We determine a damage constant of $3.9 \\times 10^{-17}$ A/cm at 17 C$^\\circ$ immediately after irradiation, which drops significantly to approximately 40% of the initial value in 200 hours, then stabilizes to approximately 30% of the initial value in 1000 hours. We measure sensor noise and signal charge for a sensor irradiated with the equivalent 1-MeV-neutron fluence of $3.0\\times 10^{13}~{\\rm n}_{\\rm eq}/{\\rm cm^2}$. Noise increases by approximately 44% after irradiation, while signal charge does not change significantly when a sufficiently high bias voltage is applied.",
    "authors": [
      "K. Adamczyk",
      "H. Aihara",
      "K. Amos",
      "S. Bacher",
      "S. Bahinipati",
      "J. Baudot",
      "P. K. Behera",
      "S. Bettarini",
      "L. Bosisio",
      "A. Bozek",
      "F. Buchsteiner",
      "G. Casarosa",
      "C. Cheshta",
      "L. Corona",
      "S. B. Das",
      "G. Dujany",
      "C. Finck",
      "F. Forti",
      "M. Friedl",
      "A. Gabrielli",
      "V. Gautam",
      "B. Gobbo",
      "K. Hara",
      "T. Higuchi",
      "C. Irmler",
      "A. Ishikawa",
      "M. Kaleta",
      "A. B. Kaliyar",
      "K. H. Kang",
      "R. Kumar",
      "K. Lalwani",
      "J. Libby",
      "V. Lisovskyi",
      "L. Massaccesi",
      "G. B. Mohanty",
      "S. Mondal",
      "K. R. Nakamura",
      "Z. Natkaniec",
      "Y. Onuki",
      "F. Otani",
      "A. Paladino",
      "V. Raj",
      "K. Ravindran",
      "J. U. Rehman",
      "I. Ripp-Baudot",
      "G. Rizzo",
      "Y. Sato",
      "C. Schwanda",
      "J. Serrano",
      "T. Shimasaki",
      "S. Tanaka",
      "R. Thalmeier",
      "T. Tsuboyama",
      "Y. Uematsu",
      "L. Vitale",
      "S. J. Wang",
      "Z. Wang",
      "J. Wiechczynski",
      "H. Yin",
      "L. Zani",
      "F. Zeng"
    ],
    "published": "2025-09-22T06:24:26Z",
    "updated": "2025-09-22T06:24:26Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.13582v2",
    "url": "https://arxiv.org/abs/2508.13582v2",
    "pdf_url": "https://arxiv.org/pdf/2508.13582v2.pdf",
    "title": "Studies of simulation framework for NνDEx experiment",
    "abstract": "The N$\\nu$DEx experiment aims to search for the neutrinoless double beta decay of $^{82}$Se using a high-pressure $^{82}$SeF$_6$ gas time projection chamber (TPC). Under the assumption of two kinds of charge carriers would be formed, the difference in drift velocities between these ion species enables trigger-less event reconstruction and offers the potential for excellent energy resolution through direct charge collection.   In this study, we present a simulation framework for the N$\\nu$DEx ion TPC. The reduced mobilities of SeF$_5^-$ and SeF$_6^-$ ions in SeF$_6$ were calculated using density functional theory and two-temperature theory, yielding values of $0.444 \\pm 0.133$ and $0.430 \\pm 0.129$ cm$^2$V$^{-1}$s$^{-1}$, respectively.   The TPC geometry, featuring a cathode-focusing plane-anode structure and an 10,000-pixel readout array, was modeled with COMSOL to calculate the electric and weighting fields. Signal and background events were generated using BxDecay0 and Geant4. Garfield++ was used to simulate the transport of charge carriers and signal induction. The induced current was convolved with the transfer function to produce voltage signals, which were subsequently used to extract energy through amplitude. The 3D tracks are also reconstructed based on drift time differences and Breadth First search.   To enhance signal background separation, six topological variables were extracted from the reconstructed tracks and used to define optimized selection criteria. The Boosted Decision Trees is used for a preliminary analysis. This simulation framework serves as a crucial tool for design optimization and sensitivity studies in the N$\\nu$DEx experiment.",
    "authors": [
      "Tianyu Liang",
      "Hulin Wang",
      "Dongliang Zhang",
      "Chaosong Gao",
      "Xiangming Sun",
      "Feng Liu",
      "Jun Liu",
      "Chengui Lu",
      "Yichen Yang",
      "Chengxin Zhao",
      "Hao Qiu",
      "Kai Chen"
    ],
    "published": "2025-08-19T07:31:27Z",
    "updated": "2025-09-22T01:53:41Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.17288v1",
    "url": "https://arxiv.org/abs/2509.17288v1",
    "pdf_url": "https://arxiv.org/pdf/2509.17288v1.pdf",
    "title": "Nonlinear anisotropic equilibrium reconstruction in axisymmetric   magnetic mirrors",
    "abstract": "Magnetic equilibrium reconstruction is a crucial simulation capability for interpreting diagnostic measurements of experimental plasmas. Equilibrium reconstruction has mostly been applied to systems with isotropic pressure and relatively low plasma $\\beta = 2\\mu_0p/B^2$. This work extends nonlinear equilibrium reconstruction to high-$\\beta$ plasmas with anisotropic pressure and applies it to the Wisconsin High Temperature Superconducting Axisymmetric Magnetic Mirror experiments to infer the presence of sloshing ions. A novel basis set for the plasma profiles and machine learning algorithm using scalable constrained Bayesian optimization allow accurate nonlinear reconstructions to be made more quickly with fewer experimental diagnostics and improves the robustness of reconstructions at high $\\beta$. In addition to WHAM and other mirrors, such reconstruction techniques are potentially attractive in high-performance devices with constrained diagnostic capabilities such as fusion power plants.",
    "authors": [
      "S. J. Frank",
      "J. K. Anderson",
      "B. Biswas",
      "E. Claveau",
      "D. Endrizzi",
      "C. Everson",
      "R. W. Harvey",
      "I. Kemeny",
      "S. Murdock",
      "Yu. V. Petrov",
      "J. Pizzo",
      "T. Qian",
      "K. Sanwalka",
      "K. Shih",
      "D. A. Sutherland",
      "A. Tran",
      "J. Viola",
      "D. Yakovlev",
      "M. Yu",
      "C. B. Forest"
    ],
    "published": "2025-09-22T00:00:18Z",
    "updated": "2025-09-22T00:00:18Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.17255v1",
    "url": "https://arxiv.org/abs/2509.17255v1",
    "pdf_url": "https://arxiv.org/pdf/2509.17255v1.pdf",
    "title": "Agentic AI for Multi-Stage Physics Experiments at a Large-Scale User   Facility Particle Accelerator",
    "abstract": "We present the first language-model-driven agentic artificial intelligence (AI) system to autonomously execute multi-stage physics experiments on a production synchrotron light source. Implemented at the Advanced Light Source particle accelerator, the system translates natural language user prompts into structured execution plans that combine archive data retrieval, control-system channel resolution, automated script generation, controlled machine interaction, and analysis. In a representative machine physics task, we show that preparation time was reduced by two orders of magnitude relative to manual scripting even for a system expert, while operator-standard safety constraints were strictly upheld. Core architectural features, plan-first orchestration, bounded tool access, and dynamic capability selection, enable transparent, auditable execution with fully reproducible artifacts. These results establish a blueprint for the safe integration of agentic AI into accelerator experiments and demanding machine physics studies, as well as routine operations, with direct portability across accelerators worldwide and, more broadly, to other large-scale scientific infrastructures.",
    "authors": [
      "Thorsten Hellert",
      "Drew Bertwistle",
      "Simon C. Leemann",
      "Antonin Sulc",
      "Marco Venturini"
    ],
    "published": "2025-09-21T22:11:03Z",
    "updated": "2025-09-21T22:11:03Z",
    "categories": [
      "physics.acc-ph",
      "cs.AI"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.17245v1",
    "url": "https://arxiv.org/abs/2509.17245v1",
    "pdf_url": "https://arxiv.org/pdf/2509.17245v1.pdf",
    "title": "Relativistically-strong electromagnetic waves in magnetized plasmas",
    "abstract": "Using a two-fluid approach, we consider the properties of relativistically nonlinear (arbitrary $a_0$), circularly polarized electromagnetic waves propagating along magnetic field in electron-ion and pair plasmas. Dispersion relations depend on how wave intensity scales with frequency, $a_0 (\\omega)$. For superluminal branches, the nonlinear effects reduce the cut-off frequency, while the general form of the dispersion relations $\\omega(k)$ remains similar to the linear case. For subluminal waves, whistlers and Alfven, a new effect appears: dispersion curves effectively terminate at finite $\\omega^\\ast - k^\\ast$ due to current starvation. Qualitatively, subluminal modes with fluctuating electric field larger than the guide field, $E_w (\\omega) \\geq B_0$, cannot propagate.",
    "authors": [
      "Maxim Lyutikov"
    ],
    "published": "2025-09-21T21:37:50Z",
    "updated": "2025-09-21T21:37:50Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2509.17221v1",
    "url": "https://arxiv.org/abs/2509.17221v1",
    "pdf_url": "https://arxiv.org/pdf/2509.17221v1.pdf",
    "title": "Gas-jet target with online interferometric thickness measurement for   nuclear astrophysics",
    "abstract": "A new jet gas target system has been developed for the Felsenkeller 5 MV underground ion accelerator for nuclear astrophysics. It provides either a 1.5$\\times10^{18}$ cm$^{-2}$ thick cylindrical jet or a 7$\\times10^{17}$ cm$^{-2}$ thick wall of nitrogen gas, with a surface of 10$\\times$10 mm$^2$ to be seen by the ion beam. The system includes a de Laval type nozzle and altogether five pumping stages: In addition to the jet catcher and the jet chamber surrounding it, there are three stages connecting the jet to the ion accelerator. Behind the jet chamber, as seen from the ion beam, a windowless static-type gas target and, subsequently, a beam calorimeter have been installed.   This work describes the offline tests of the gas target system prior to its installation on the beam line of the Felsenkeller accelerator. The thickness of the jet has been determined using three different methods: By computational fluid dynamics simulations, with a Mach-Zehnder interferometer, and by $\\alpha$-energy loss using a mixed $\\alpha$ source. The three methods were shown to be in agreement. For 0-6 bar inlet gas pressure, a linear relationship between inlet pressure and jet thickness has been found. Different shapes of de Laval type inlet nozzles, both circular and slit-type, have been manufactured from fused silica glass or stainless steel and tested using measurements and simulations. The power and stability of the beam calorimeter have been tested. The interferometry has been shown to work reliably and to give two-dimensional projections of the gas jet with sub-mm resolution.",
    "authors": [
      "Anup Yadav",
      "Daniel Bemmerer",
      "Fabian Donat",
      "Juozas Dudutis",
      "Sören Göhler",
      "Maik Görler",
      "Maxim Hilz",
      "Arie Irman",
      "Migle Mackeviciute",
      "Konrad Schmidt",
      "Manfred Sobiella",
      "Vidmantas Tomkus",
      "Kai Zuber"
    ],
    "published": "2025-09-21T20:08:06Z",
    "updated": "2025-09-21T20:08:06Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.17061v1",
    "url": "https://arxiv.org/abs/2509.17061v1",
    "pdf_url": "https://arxiv.org/pdf/2509.17061v1.pdf",
    "title": "The Nature of Turbulence at Sub-Electron Scales in the Solar Wind",
    "abstract": "The nature of turbulence at sub-electron scales has remained an open question, central to understanding how electrons are heated in the solar wind. This is primarily because spacecraft measurements have been limited to magnetic field fluctuations alone. We resolve this by deriving new high-resolution density fluctuations from spacecraft potential measurements of Parker Solar Probe resolving scales smaller than the electron gyro-radius ($\\rho_e$). A systematic comparison of the density and magnetic spectra shows that both steepen near the electron scales. Notably, the density spectrum exhibits slopes close to $-10/3$, while the magnetic spectrum becomes consistently steeper than the density spectrum at scales smaller than $\\rho_e$, indicating that the turbulence becomes electrostatic. These results are consistent with theoretical predictions of an electron entropy cascade, which may explain the irreversible dissipation of turbulent energy at sub-$\\rho_e$ scales.",
    "authors": [
      "Shiladittya Mondal",
      "Christopher H. K. Chen",
      "Davide Manzini"
    ],
    "published": "2025-09-21T12:41:41Z",
    "updated": "2025-09-21T12:41:41Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2509.16849v1",
    "url": "https://arxiv.org/abs/2509.16849v1",
    "pdf_url": "https://arxiv.org/pdf/2509.16849v1.pdf",
    "title": "Magnetic flux ropes within reconnection exhausts close to the centers of   heliospheric current sheets near the Sun",
    "abstract": "Understanding the relationship between magnetic flux ropes and magnetic reconnection is fundamental to both space and astrophysical plasma studies. In this study, we report on two consecutive heliospheric current sheet (HCS) crossings by Parker Solar Probe (PSP), separated by ~10.5 hours, at a heliocentric distance of ~12 solar radii. For each crossing, we identified a series of flux ropes embedded within reconnection exhausts on the sunward side of X-line. Their passage durations are <20sec, corresponding to spatial scales of a few thousands kilometers, still larger by three orders of magnitude than ion inertial length. This identification was possible particularly during intervals when PSP was closest to the HCS center. These flux ropes are distinguishable from the background exhausts by enhancements in magnetic field strength, significantly in the guide field component, travel speed slightly faster (typically by <10km/s) than surrounding outflows, and often accompanied by, though not always, increased density and reduced temperature. We attribute their origin to secondary reconnection within the exhausts and subsequent merging of smaller flux ropes into larger structures, consistent with predictions by various simulations. We suggest that such flux ropes are most readily identifiable at the HCS center where the background magnetic field is weakest so that the relative enhancement in flux rope field becomes most prominent. This observational advantage is particularly notable closer to the Sun where the high ambient magnetic field strength can otherwise obscure such structures unless the spacecraft trajectory remains within the HCS central region for a sufficient duration.",
    "authors": [
      "Dae-Young Lee",
      "Dooyoung Choi",
      "Kyung-Eun Choi",
      "Sung Jun Noh"
    ],
    "published": "2025-09-21T00:38:28Z",
    "updated": "2025-09-21T00:38:28Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2402.03073v5",
    "url": "https://arxiv.org/abs/2402.03073v5",
    "pdf_url": "https://arxiv.org/pdf/2402.03073v5.pdf",
    "title": "Dark counts in optical superconducting transition-edge sensors for   rare-event searches",
    "abstract": "Superconducting transition-edge sensors (TESs) are a type of quantum sensor known for its high single-photon detection efficiency and low background. This makes them ideal for particle physics experiments searching for rare events. In this work, we present a comprehensive characterization of the background in optical TESs, distinguishing three types of events: electrical-noise, high-energy, and photonlike events. We introduce computational methods to automate the classification of events. For the first time, we experimentally verify and simulate the source of the high-energy events. We also isolate the photonlike events, the expected signal in dielectric haloscopes searching for dark matter dark photons, and achieve a record-low photonlike dark-count rate of $3.6 \\times 10^{-4}$ Hz in the 0.8-3.2 eV energy range.",
    "authors": [
      "Laura Manenti",
      "Carlo Pepe",
      "Isaac Sarnoff",
      "Tengiz Ibrayev",
      "Panagiotis Oikonomou",
      "Artem Knyazev",
      "Eugenio Monticone",
      "Hobey Garrone",
      "Fiona Alder",
      "Osama Fawwaz",
      "Alexander J. Millar",
      "Knut Dundas Morå",
      "Hamad Shams",
      "Francesco Arneodo",
      "Mauro Rajteri"
    ],
    "published": "2024-02-05T15:03:45Z",
    "updated": "2025-09-20T23:35:52Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.supr-con",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2506.20022v2",
    "url": "https://arxiv.org/abs/2506.20022v2",
    "pdf_url": "https://arxiv.org/pdf/2506.20022v2.pdf",
    "title": "Novel coincidence detection technique for precision measurement of   neutron-capture-induced nuclear recoils",
    "abstract": "The lattice dynamics following particle interactions remain not fully understood, and effects from nuclear-recoil interactions in conventional solid-state detectors - such as defect formation - can hinder accurate event-energy interpretation. Neutron capture $(n,\\gamma)$ can produce detectable, precise-energy nuclear recoils for detector calibration and solid-state physics studies. This paper proposes a first-of-its-kind experiment to measure the twin products of neutron capture - the postcapture deexcitation gamma and postcapture nuclear recoil. Simulations show that with a 1 mCi californium neutron source, a positive measurement with existing detector technologies is possible in 26.1 gram-days of exposure.",
    "authors": [
      "A J Biffl",
      "Gerardo D Gonzalez",
      "A N Villano",
      "N Mirabolfathi"
    ],
    "published": "2025-06-24T21:37:32Z",
    "updated": "2025-09-20T19:24:35Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1103/7bnf-mxjz"
  },
  {
    "arxiv_id": "2509.16741v1",
    "url": "https://arxiv.org/abs/2509.16741v1",
    "pdf_url": "https://arxiv.org/pdf/2509.16741v1.pdf",
    "title": "SASE X-ray Free-Electron Laser driven by Resonant Multi-Pulse Ionization   acceleration scheme",
    "abstract": "Laser wakefield accelerators are on the way to provide GeV scale high-brightness electron beams for multidisciplinary applications. In the present work, electron bunches are studied in the framework of a Free-Electron Laser driven by an accelerator in the Resonant Multi-Pulse Ionisation framework. The transport to the undulator is provided by a matched beam focusing with marginal beam quality degradation. Finally, using the CRESCO/ENEAGRID High Performance Computing infrastructure, 3D time-dependent simulations of the produced radiation show that about 10$^{10}$ photons with central wavelength of 0.15 nm will be delivered with the electron bunches under consideration.",
    "authors": [
      "Federico Nguyen",
      "Paolo Tomassini",
      "Leonida A. Gizzi",
      "Luca Giannessi",
      "Anna Giribono"
    ],
    "published": "2025-09-20T17:00:34Z",
    "updated": "2025-09-20T17:00:34Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.16574v1",
    "url": "https://arxiv.org/abs/2509.16574v1",
    "pdf_url": "https://arxiv.org/pdf/2509.16574v1.pdf",
    "title": "Measuring the locations and properties of VHF sources emitted from an   aircraft flying through high clouds",
    "abstract": "We show that it is possible to locate the few places on the body of an airplane, while it is flying through high clouds, from which broad-band, pulsed, radiation is emitted at Very High Frequency (VHF) radio frequencies. This serendipitous discovery was made whilst imaging a lightning flash using the Low-Frequency Array (LOFAR). This observation provides insights into the way the airplane sheds the electrical charge it acquires when flying through clouds. Furthermore, this observation allowed us to test and improve the precision and accuracy for our lightning observation techniques.   Our new results indicate that with the improved procedure the location precision for strong pulses is better than 50~cm, with the orientation of linear polarization being accurate to within 25$^\\circ$. For the present case of a Boeing 777-300ER, VHF emissions were observed exclusively associated with the two engines, as well as a specific spot on the tail. Despite the aircraft flying through clouds at an altitude of 8~km, we did not detect any emissions from electrostatic wicks.",
    "authors": [
      "Olaf Scholten",
      "Marten Lourens",
      "Stijn Buitink",
      "Steve Cummer",
      "Joe Dwyer",
      "Brian M. Hare",
      "Tim Huege",
      "Ningyu Liu",
      "Katie Mulrey",
      "Anna Nelles",
      "Chris Sterpka",
      "T. N. Gia Trinh",
      "Paulina Turekova",
      "Sander ter Veen"
    ],
    "published": "2025-09-20T08:25:36Z",
    "updated": "2025-09-20T08:25:36Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.IM",
      "physics.geo-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.22145v2",
    "url": "https://arxiv.org/abs/2507.22145v2",
    "pdf_url": "https://arxiv.org/pdf/2507.22145v2.pdf",
    "title": "High-Precision Relativistic Time Scales for Cislunar Navigation",
    "abstract": "We present a unified post-Newtonian framework for relativistic timing and coordinate transformations covering six time scales (TCB, TCG, TT, TDB, TCL, TL) and three reference systems (BCRS, GCRS, LCRS). Extending the IAU conventions, we define a Lunicentric Celestial Reference System (LCRS) metric that retains all contributions above a fractional threshold of 5 x 10^{-18} and timing terms above 0.1 ps by expanding the lunar gravity field to spherical-harmonic degree l=9 with Love number variations and including external tidal and inertial multipoles to the octupole. We derive closed-form mappings among TCB, TCG, TT, TCL and TL, yielding proper-to-coordinate time transformations and two-way time-transfer corrections at sub-picosecond accuracy. We evaluate secular rate constants and periodic perturbations arising from kinematic dilation, lunar monopole and multipoles, Earth tides and gravitomagnetic effects for clocks on the lunar surface, in very low and low lunar orbits (vLLO/LLO), in elliptical lunar frozen orbits (ELFOs), at the Earth-Moon L1 point, and in near-rectilinear halo orbits (NRHOs). Our analysis demonstrates that harmonics through l=9 and tides through l=8 are sufficient to achieve 5 x 10^{-18} fractional stability for deep cislunar regimes (e.g., NRHO, Earth-Moon L1), supporting sub-picosecond clock synchronization and centimeter-level navigation; near-surface and vLLO realizations generally require a much higher spherical-harmonic degree, l_max >= 300, to meet the same stability goal. This framework underpins high-precision time and frequency transfer, relativistic geodesy, quantum communication links and fundamental physics experiments beyond low Earth orbit.",
    "authors": [
      "Slava G. Turyshev"
    ],
    "published": "2025-07-29T18:21:03Z",
    "updated": "2025-09-20T06:19:29Z",
    "categories": [
      "gr-qc",
      "astro-ph.IM",
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "gr-qc"
  },
  {
    "arxiv_id": "2506.11457v3",
    "url": "https://arxiv.org/abs/2506.11457v3",
    "pdf_url": "https://arxiv.org/pdf/2506.11457v3.pdf",
    "title": "Vibrational-Electron Heating in Plasma Flows: A Thermodynamically   Consistent Model",
    "abstract": "Accurate prediction of electron temperature ($T_{\\rm e}$) in non-equilibrium {plasma} flows is critical, yet hampered by inadequate models for electron heating from vibrationally excited states. Prior models often relied on ad-hoc scaling or flawed applications of detailed balance that failed to ensure the convergence of electron temperature and species-specific vibrational temperature ($T_{\\rm v}$) at thermal equilibrium. This paper introduces a novel, thermodynamically consistent electron heating model derived rigorously from the principle of detailed balance. By assuming a Boltzmann vibrational distribution and employing an effective activation energy, our approach yields a simple heating-to-cooling ratio of $\\exp(\\theta_{\\rm v}/T_{\\rm e}-\\theta_{\\rm v}/T_{\\rm v})$, where $\\theta_{\\rm v}$ is the characteristic vibrational temperature of the species under consideration. This formulation guarantees that $T_{\\rm e}$ correctly converges to $T_{\\rm v}$ at equilibrium. A key advantage is that our model can utilize total cooling rates determined from swarm experiments, leading to higher accuracy at low electron temperatures. For re-entry flows, the proposed approach predicts an electron temperature several times lower than previous models which results in improved agreement with some flight test data. These more reliable predictions can significantly enhance the modeling fidelity of plasma-assisted combustion, laser-induced plasmas, and various hypersonic plasma technologies such as electron transpiration cooling or magnetohydrodynamic force generators.",
    "authors": [
      "Felipe Martin Rodriguez Fuentes",
      "Bernard Parent"
    ],
    "published": "2025-06-13T04:28:10Z",
    "updated": "2025-09-20T05:54:35Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1063/5.0285170"
  },
  {
    "arxiv_id": "2507.20948v2",
    "url": "https://arxiv.org/abs/2507.20948v2",
    "pdf_url": "https://arxiv.org/pdf/2507.20948v2.pdf",
    "title": "Enhanced beam transport via space charge mitigation in a multistage   accelerator for fusion plasma diagnostics",
    "abstract": "Efficient transport of high-current negative ion beams is critical for accurate plasma potential diagnostics using heavy-ion beam probe (HIBP) systems in magnetically confined fusion plasmas. However, strong space-charge effects often degrade transport efficiency, particularly for heavy ions such as Au-. In this study, we demonstrate a substantial improvement in beam transport by introducing an electrostatic lens effect through optimized voltage allocation in a multistage acceleration system. Numerical simulations using IGUN, supported by experiments with the LHD-HIBP system, show that this approach effectively suppresses space-charge-induced beam divergence and loss. Without requiring mechanical modifications to the beamline, the optimized configuration enables a 2-3 fold increase in Au-beam current injected into the tandem accelerator. Consequently, plasma potential measurements were extended to higher-density plasmas, reaching line-averaged electron densities up to $1.75\\times 10^{19}$ m$^{-3}$ with improved signal-to-noise ratio. This technique offers a compact, practical, and highly effective solution for transporting high-current heavy-ion beams under space-charge-dominated conditions. Beyond its impact on plasma diagnostics, the method is broadly applicable to a wide range of accelerator systems, including those used in scientific and industrial applications where high-intensity beam transport is required.",
    "authors": [
      "M. Nishiura",
      "K. Nakamura",
      "K. Ueda",
      "A. Shimizu",
      "H. Takubo",
      "M. Kanda",
      "T. Ido",
      "M. Okamura"
    ],
    "published": "2025-07-28T15:59:15Z",
    "updated": "2025-09-20T05:15:13Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.16535v1",
    "url": "https://arxiv.org/abs/2509.16535v1",
    "pdf_url": "https://arxiv.org/pdf/2509.16535v1.pdf",
    "title": "Data-Driven Reduced-Order Modeling of Phase Mixing Dynamics from   Particle Kinetic Simulation",
    "abstract": "Phase mixing is a fundamental kinetic process that governs dissipation and stability in collisionless plasmas, but its inherent filamentation in velocity space creates major challenges for both high-fidelity simulations and reduced-order modeling. This work presents the first exploratory evaluation of a joint Proper Orthogonal Decomposition and Sparse Identification of Nonlinear Dynamics (POD-SINDy) framework applied to particle-in-cell simulations of phase mixing. Simulation datasets were generated under progressively complex conditions, starting from a passive kinetic case without self-consistent electric fields, extending to self-consistent simulations with nonlinear electric field feedback, and finally to a noisy dataset with reduced particle resolution. In the passive kinetic regime, POD-SINDy achieved near-optimal reconstructions with only five modes, reproducing filamentation with errors below four percent. In self-consistent electrostatic cases, variance spread across more modes due to nonlinear interactions and noise, slowing singular value decay and making strict low-rank embeddings more demanding. Nevertheless, retaining ten modes was sufficient to recover the dominant structures, yielding reconstruction errors of about seven percent for the low-noise case and thirteen percent for the noisy dataset. Across all scenarios, SINDy provided sparse and interpretable equations for modal amplitudes that remained predominantly linear despite the underlying nonlinear data, while POD truncation effectively filtered particle noise and preserved coherent dynamics. These findings demonstrate that POD-SINDy constitutes a compact and interpretable approach to reduced-order modeling of phase mixing, capable of retaining essential physics across regimes of increasing complexity while achieving data compression from three to five orders of magnitude depending on dataset complexity.",
    "authors": [
      "Darian Figuera-Michal",
      "Sungpil Yum",
      "Jae-Min Kwon",
      "Eisung Yoon"
    ],
    "published": "2025-09-20T04:52:10Z",
    "updated": "2025-09-20T04:52:10Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.16471v1",
    "url": "https://arxiv.org/abs/2509.16471v1",
    "pdf_url": "https://arxiv.org/pdf/2509.16471v1.pdf",
    "title": "From Coated to Uncoated: Scanning Electron Microscopy Corrections to   Estimate True Surface Pore Size in Nanoporous Membranes",
    "abstract": "Scanning electron microscopy (SEM) is the premier method for characterizing the nanoscale surface pores in ultrafiltration (UF) membranes and the support layers of reverse osmosis (RO) membranes. Based on SEM, the conventional understanding is that membranes typically have low surface porosities of <10%. We hypothesized that high acceleration voltage during SEM imaging and sputter metal coatings required for SEM have led to systematic underestimations of porosity and pore size. We showed that imaging a commercial UF membrane at 1, 5, and 10 kV reduced measured porosity from 10.3% (1 kV) to 6.3% (10 kV), while increasing Pt coating thickness from 1.5 to 5 nm lowered porosity by 54% for the UF membrane (12.9% to 5.8%) and 46% for an RO support (13.1% to 7.0%). To account for coating thickness, we developed a digital correction method that simulates pore dilation, enabling the pore structure to be estimated for uncoated membranes. Dilation yielded uncoated porosity values of 23% for the UF membrane and 20% for the RO support, about 3-fold greater than values observed with a 4 nm coating. Mean pore diameters were 2-fold greater for the UF membrane and 1.5-fold greater for the RO support. Critically, dilation-derived pore-size distributions agreed with low-flux dextran-retention data fitted with the Bungay-Brenner model. Our results suggest that surface porosities and pore sizes of nanoporous membranes are much larger than previously understood, with major implications for structure/transport relationships. For future nanoscale pore analysis of membranes (and other nanoporous materials), we recommend low acceleration voltage (1 kV), minimal coatings (1-2 nm), and digital dilation to account for coating artifacts",
    "authors": [
      "Sima Zeinali Danalou",
      "Dian Yu",
      "Niher R. Sarker",
      "Hooman Chamani",
      "Jane Y. Howe",
      "Patrick C. Lee",
      "Jay R. Werber"
    ],
    "published": "2025-09-19T23:46:08Z",
    "updated": "2025-09-19T23:46:08Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "cs.CV",
      "physics.app-ph",
      "physics.chem-ph",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2509.16441v1",
    "url": "https://arxiv.org/abs/2509.16441v1",
    "pdf_url": "https://arxiv.org/pdf/2509.16441v1.pdf",
    "title": "Impact of metallographic polishing on the RF properties of Niobium for   SRF applications",
    "abstract": "The performance of superconducting radio-frequency (SRF) cavities made of Niobium is tied to the quality of their inner surfaces exposed to the radio frequency (RF) waves. Future superconducting particle accelerators, because of their dimensions or the unprecedented stringent technical requirements, require the development of innovative surface processing techniques to improve processing reliability and if possible ecological footprint and cost, compared to conventional chemical processes. Metallographic polishing (MP) has emerged as a promising polishing technology to address these challenges. Previous studies focused on the characterization of the processed material surface at room temperature in the absence of RF waves. However, the evaluation of material properties, such as surface resistance under RF, at cryogenic temperature has failed, primarily due to the unavailability of devices capable of achieving the necessary resolution in the nanohm range. To overcome this limitation, a quadrupole resonator (QPR) has been utilized. The RF results demonstrate that the MP polishing, developed to preserve a high-quality niobium surface with very low surface resistance, is highly effective compared to conventional polishing. This conclusion is further supported by topography and microstructural analysis of the QPR top-hat samples, which revealed the clear superiority of the metallographic approach.",
    "authors": [
      "Oleksandr Hryhorenko",
      "Anne-Marie Valente-Feliciano",
      "David Longuevergne",
      "Claire Zylberajch Antoine",
      "Thomas Proslier",
      "Fabien Eozenou",
      "Oliver Kugele",
      "Sebastian Keckert",
      "Jens Knobloch"
    ],
    "published": "2025-09-19T21:40:43Z",
    "updated": "2025-09-19T21:40:43Z",
    "categories": [
      "physics.acc-ph",
      "physics.app-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.16428v1",
    "url": "https://arxiv.org/abs/2509.16428v1",
    "pdf_url": "https://arxiv.org/pdf/2509.16428v1.pdf",
    "title": "A high-voltage MR-ToF mass spectrometer and separator for the study of   exotic isotopes at FRIB",
    "abstract": "The Facility for Rare Isotope Beams (FRIB) delivers a wide variety of rare isotopes as fast, stopped, or reaccelerated beams to enable forefront research in nuclear structure, astrophysics, and fundamental interactions. To expand the scientific potential of FRIB's stopped and reaccelerated beam programs, we are designing a Multi-Reflection Time-of-Flight mass spectrometer and separator (MR-ToF MS). It will enable high-precision mass measurements of short-lived isotopes, improve beam diagnostics, and deliver isobarically and isomerically purified beams to downstream experimental stations. It is designed to store ions at a kinetic energy of 30 keV, significantly enhancing ion throughput while maintaining high mass resolving power. We present the scientific motivation, technical design, and simulations demonstrating the expected performance of the system, which has the potential to significantly enhance FRIB's mass measurement, diagnostic, and mass separation capabilities.",
    "authors": [
      "F. M. Maier",
      "C. M. Ireland",
      "G. Bollen",
      "E. Dhayal",
      "T. Fowler-Davis",
      "E. Leistenschneider",
      "M. P. Reiter",
      "R. Ringle",
      "S. Schwarz",
      "A. Sjaarda"
    ],
    "published": "2025-09-19T21:10:00Z",
    "updated": "2025-09-19T21:10:00Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.16401v1",
    "url": "https://arxiv.org/abs/2509.16401v1",
    "pdf_url": "https://arxiv.org/pdf/2509.16401v1.pdf",
    "title": "Quantifying the Effects of Parameters in Widespread SEP Events with   EPREM",
    "abstract": "The Energetic Particle Radiation Environment Model (EPREM) solves the focused transport equation (FTE) on a Lagrangian grid in a frame co-moving with the solar wind plasma and simulates the acceleration and transport of solar energetic particles (SEP) in the heliosphere. When not coupled to an external magnetohydrodynamic model, EPREM functions in an uncoupled mode where an ideal cone-shock is injected into a homogeneous background solar wind. We carried out an analysis of the effects of multiple physical parameters in producing widespread SEP events simulated by the uncoupled EPREM using a relatively simple model of a strong magnetized shock propagating radially outward through the inner heliosphere to produce the requisite MHD quantities for EPREM's sophisticated model of proton acceleration and transport. We compared a baseline simulation with seven variations in which the value of a single parameter differed from its baseline value. All simulations exhibit complex profiles of SEP flux as a function of time and energy, with clear dependence on parameters related to diffusion, mean free path, and shock profile. Moreover, while all simulations exhibit significant longitudinal spread in SEP flux, for certain parameter values there exists a decrease or absence in SEP flux at observers located >=90 degrees from the shock origin. Relating the differences in SEP flux to the specific values of each parameter in the simulations provides insight into the morphology of observed SEP events and the state of the solar wind through which the driving CME propagates.",
    "authors": [
      "Matthew A. Young",
      "Bala Poduval"
    ],
    "published": "2025-09-19T20:23:20Z",
    "updated": "2025-09-19T20:23:20Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2509.16320v1",
    "url": "https://arxiv.org/abs/2509.16320v1",
    "pdf_url": "https://arxiv.org/pdf/2509.16320v1.pdf",
    "title": "Exponential Spectral Scaling: Robust and Efficient Stellarator Boundary   Optimization via Mode-Dependent Scaling",
    "abstract": "Stellarator boundary optimization faces a fundamental numerical challenge: the extreme disparity between low- and high-mode amplitudes creates an optimization landscape in which direct full-spectrum approaches typically converge to poor local minima. Traditionally, this challenge has been addressed through a computationally expensive, multi-step Fourier continuation, in which low Fourier modes are optimized first, followed by the gradual incorporation of higher modes. We present Exponential Spectral Scaling (ESS), a technique that applies a mode-dependent exponential scaling factor to each Fourier mode. Our primary implementation uses the $L_{\\infty}$ norm to determine the scaling pattern, creating a square spectral decay profile that effectively reduces the dynamic range of optimization variables from $10^{6}$--$10^{7}$ to $10^{2}$--$10^{3}$. This scaling aligns with the natural spectral decay of physically meaningful configurations and enables direct single-step optimization using the full spectrum of boundary Fourier modes. ESS eliminates arbitrary staging decisions and reduces computation time by a factor of $2$ to $5$ in benchmark cases. In addition to accelerating optimization, ESS improves robustness, reducing sensitivity to initial conditions and increasing confidence in avoiding local optima. We demonstrate the effectiveness of ESS across both quasi-axisymmetric (QA) and quasi-helically symmetric (QH) configurations, using two distinct optimization toolkits: SIMSOPT and DESC.",
    "authors": [
      "Byoungchan Jang",
      "Rory Conlin",
      "Matt Landreman"
    ],
    "published": "2025-09-19T18:03:03Z",
    "updated": "2025-09-19T18:03:03Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.16159v1",
    "url": "https://arxiv.org/abs/2509.16159v1",
    "pdf_url": "https://arxiv.org/pdf/2509.16159v1.pdf",
    "title": "A novel agile THz Pulsed Spectropolarimeter measuring 2D distributions   of the magnetic field, density and ion temperature of fusion reactor   equilibria",
    "abstract": "With the recent inception of intense pulsed THz sources via optical rectification using crystalline lithium niobate, non-perturbative measurements of the internal local magnetic field are now possible using Pulsed Polarimetry on any magnetic fusion device. Pulsed Polarimetry resolves the sightline magnetic field and density, analogous to RADAR measurements of the spatial distribution of precipitation. With a suitable sightline, the FRC midplane density and axial field profiles can be determined with the azimuthal current density given by Ampere's law. Pulsed Polarimetry can be enhanced to measure the sightline distributed electron temperature by adding spectroscopy. A THz Pulsed Spectropolarimeter using a heterodyne receiver is appropriate if collective Thomson backscatter is induced. In this case, electronic filtering provides spatial distributions of the ion spectral density function. The sightline bulk ion temperature as well as confined fast ion velocity distributions can be measured which is of particular importance to plasmas that are heated and sustained by NBI. The ability to steer the sightline without loss of alignment distinguishes this diagnostic from crossbeam diagnostics. The term, diagnostic agility denotes a diagnostic's ability to provide both temporal and spatial real-time feedback on demand across the poloidal plane analogous to 2D imaging Doppler RADAR. THz Pulsed Spectropolarimetry is extensively detailed along with simulated measurements on an FRC equilibrium. Comparisons are made with long pulse CTS crossbeam diagnostics. The role this technique can play within the wider MFE program towards future fusion reactors as an advanced diagnostic is explored. The nature and breadth of the measurements fulfills the mission of future diagnostics to maintain and optimize fusion reactor performance.",
    "authors": [
      "Roger J Smith"
    ],
    "published": "2025-09-19T17:10:22Z",
    "updated": "2025-09-19T17:10:22Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.16130v1",
    "url": "https://arxiv.org/abs/2509.16130v1",
    "pdf_url": "https://arxiv.org/pdf/2509.16130v1.pdf",
    "title": "On the enhanced Balmer emission of hydrogen in helium Capacitively   Coupled Radio Frequency (CCRF) plasma",
    "abstract": "The present study investigates the observation and enhancement in the intensity of the hydrogen Balmer series emission in a He CCRF plasma using optical emission spectroscopy (OES). In addition to the characteristic line emission of He atoms, the Balmer series of hydrogen and the molecular emission of N2 are also observed in the He discharge. These emissions were primarily attributed to the presence of water vapor in the chamber. In order to confirm the role of He, the study is also performed using air and Ar where no such Balmer series emissions is seen. Experimental evidence suggests that He metastables transfer energy to trace amount of water content present in the vacuum chamber. The results point towards the hypothesis that energy exchange between metastable He and water molecules could be the underlying mechanism. Since the energy of He metastables exceeds the ionization energy of H or H2O molecule, Penning ionization is expected to occur upon their interaction. The H ions formed as a result, consequently recombine with electrons in the plasma, emitting the Balmer series. Furthermore, the emission intensity of the Balmer series of H depends on the electron density of the He plasma. Experiments also show significant deviations in the intensity ratios of the Balmer series from conventional discharges, indicating difference in the underlying population mechanism. A Collisional Radiative (CR) model for measured plasma parameters was used to estimate the metastable population density to understand the mechanism behind the enhancement of the emission intensity. The increase in the metastable densities as well as the radiative recombination cross section appear to be responsible for the observed enhancement. We believe these results will be significant in terms of applications, in addition to providing a fundamental understanding of energy transfer between metastables of He and H2O.",
    "authors": [
      "Varsha S",
      "Prabhakar Srivastav",
      "Yukti Goel",
      "Milaan Patel",
      "Hem Chandra Joshi",
      "Jinto Thomas"
    ],
    "published": "2025-09-19T16:27:16Z",
    "updated": "2025-09-19T16:27:16Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.09722v2",
    "url": "https://arxiv.org/abs/2507.09722v2",
    "pdf_url": "https://arxiv.org/pdf/2507.09722v2.pdf",
    "title": "Compression and Reconnection Investigations of the MagnetoPause (CRIMP):   A Mission Concept to Uncover the Impact of Mesoscale Reconnection and Plasma   Outflow Processes at the Dayside Magnetopause",
    "abstract": "The Compression and Reconnection Investigations of the Magnetopause (CRIMP) mission is a Heliophysics Medium-Class Explorer (MIDEX) Announcement of Opportunity (AO) mission concept designed to study mesoscale structures and particle outflow along Earth's magnetopause using two identical spacecraft. CRIMP would uncover the impact of magnetosheath mesoscale drivers, dayside magnetopause mesoscale phenomenological processes and structures, and localized plasma outflows on magnetic reconnection and the energy transfer process in the dayside magnetosphere. CRIMP accomplishes this through uniquely phased spacecraft configurations that allow multipoint, contemporaneous measurements at the magnetopause. This enables an unparalleled look at mesoscale spatial differences along the dayside magnetopause on the scale of 1-3 Earth Radii (Re). Through these measurements, CRMIP will uncover how local mass density enhancements affect global reconnection, how mesoscale structures drive magnetopause dynamics, and if the magnetopause acts as a perfectly absorbing boundary for radiation belt electrons. This allows CRIMP to determine the spatial scale, extent, and temporal evolution of energy and mass transfer processes at the magnetopause - crucial measurements to determine how the solar wind energy input in the magnetosphere is transmitted between regions and across scales. This concept was conceived as a part of the 2024 NASA Heliophysics Mission Design School.",
    "authors": [
      "Jason M. H. Beedle",
      "Bryan C. Cline",
      "Samuel T. Badman",
      "Humberto Caldelas II",
      "Kelly Cantwell",
      "Alex Hoffmann",
      "Christian Hofmann",
      "India Jackson",
      "Tre'Shunda James",
      "Miguel Martinez-Ledesma",
      "Bruno Mattos",
      "Brett A. McCuen",
      "Sophie R. Phillips",
      "Bryan Reynolds",
      "Julie Rolla",
      "Orlando M. Romeo",
      "Frances A. Staples",
      "Michael J. Starkey",
      "Olga P. Verkhoglyadova",
      "Andres Romero-Wolf",
      "Alfred E. Nash"
    ],
    "published": "2025-07-13T17:40:42Z",
    "updated": "2025-09-19T15:11:46Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.EP",
      "astro-ph.IM",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2505.22097v3",
    "url": "https://arxiv.org/abs/2505.22097v3",
    "pdf_url": "https://arxiv.org/pdf/2505.22097v3.pdf",
    "title": "From the Rose-DuBois Ansatz of Hot Spot Fields to the Instanton   Solution: a Pedestrian Presentation",
    "abstract": "This paper gives a pedestrian presentation of some technical results recently published in mathematical physics with non-trivial implications for laser-plasma interaction. The aim is to get across the main results without going into the details of the calculations, nor offering a specialist's user guide, but by focusing conceptually on how these results modify the commonly-held description -- in terms of laser hot spot fields -- of backscattering instabilities with a spatially smoothed laser beam. The intended readers are plasma physicists as well as graduate students interested in laser-plasma interaction. No prior knowledge of scattering instabilities is required. Step by step, we explain how the laser hot spots are gradually replaced with other structures, called instantons, as the amplification of the scattered light increases. In the amplification range of interest for laser-plasma interaction, instanton--hot spot complexes tend to appear in the laser field (in addition to the expected hot spots), with a non-negligible probability. For even larger amplifications and systems longer than a hot spot length, the hot spot field description is clearly invalidated by the instanton takeover.",
    "authors": [
      "Philippe Mounaix"
    ],
    "published": "2025-05-28T08:18:42Z",
    "updated": "2025-09-19T13:13:35Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.15853v1",
    "url": "https://arxiv.org/abs/2509.15853v1",
    "pdf_url": "https://arxiv.org/pdf/2509.15853v1.pdf",
    "title": "Electron-positron pair generation using a single kJ-class laser pulse in   a foam-reflector setup",
    "abstract": "We investigate the process of creating electron-positron pairs from laser-matter interaction in pre-ionised foam targets using particle-in-cell simulations. A high-intensity laser pulse drives electrons via direct laser acceleration up to a cone-shaped reflector. The high-energy electrons interact with the reflected laser pulse, generating abundant pairs. The effects of the plasma-channel shape on the propagation of the laser pulse and subsequent pair production is studied. The results show that the number of Compton emission and Breit-Wheeler pair creation events is highly sensitive to the diffraction of the laser due to its interaction with the foam.",
    "authors": [
      "Oliver Mathiak",
      "Lars Reichwein",
      "Alexander Pukhov"
    ],
    "published": "2025-09-19T10:44:00Z",
    "updated": "2025-09-19T10:44:00Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.15821v1",
    "url": "https://arxiv.org/abs/2509.15821v1",
    "pdf_url": "https://arxiv.org/pdf/2509.15821v1.pdf",
    "title": "Modeling of runaway electron induced damage on boron-nitride tiles in   WEST",
    "abstract": "The runaway electron (RE) - induced damage on boron nitride (BN) tiles mounted on the inner bumpers of the WEST tokamak is modeled employing available empirical input and experimental constraints, concerning the post-mortem documentation of the damaged material topology and infra-red camera observations of the long-time decay of the surface temperature. A newly developed work-flow for the modeling of brittle failure due to RE impacts, recently validated against a controlled DIII-D experiment, is employed. Monte Carlo simulations of RE transport into BN provide volumetric heat source maps for finite-element simulations of the linear thermoelastic material response, while the brittle failure onset is predicted on the basis of the Rankine criterion. The physics of thermal stress driven failure and explosion are well captured by this model, which exhibits high sensitivity to RE impact parameters. Despite the accidental nature of the damage events, the workflow predicts failure in accordance with observations for realistic loading specifications expected in WEST disruptions.",
    "authors": [
      "Tommaso Rizzi",
      "Svetlana Ratynskaia",
      "Panagiotis Tolias",
      "Yann Corre",
      "Mathilde Diez",
      "Mehdi Firdaouss",
      "Jonathan Gerardin",
      "Raphael Mitteau",
      "Cedric Reux",
      "Artem Kulachenko",
      "the WEST team",
      "the EUROfusion Tokamak Exploitation Team"
    ],
    "published": "2025-09-19T09:53:10Z",
    "updated": "2025-09-19T09:53:10Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.15818v1",
    "url": "https://arxiv.org/abs/2509.15818v1",
    "pdf_url": "https://arxiv.org/pdf/2509.15818v1.pdf",
    "title": "Scalable CVD Graphene Field-Effect Transistor Platform for Viral   Detection: Application to COVID-19",
    "abstract": "The rapid and global spread of coronavirus disease 2019 (COVID-19), caused by the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), underscored the urgent need for fast, reliable, and adaptable diagnostic tools capable of responding to current and future viral threats. Early diagnosis is key to limiting transmission, and biosensors based on nanomaterials offer promising solutions for accurate and rapid bioanalyte detection. In this work, we present a scalable matrix of graphene-based field-effect transistors (GFETs) for the direct and rapid detection of the SARS-CoV-2 spike protein. High-quality graphene is functionalized in a single step with ACE2-His, enabling detection of the spike protein with a limit of detection as low as 1 fg/mL in phosphate-buffered saline (PBS). A robust statistical analysis, based on measurements from approximately 70 devices per analyte concentration, demonstrates the reproducibility and reliability of the platform. This label-free, scalable, and reproducible COVID-19 antigen sensor can be readily adapted to detect emerging SARS-CoV-2 variants or other viral pathogens, offering a flexible approach for future diagnostic applications.",
    "authors": [
      "Leonardo Martini",
      "Ylea Vlamidis",
      "Ileana Armando",
      "Domenica Convertino",
      "Vaidotas Mišeikis",
      "Valerio Voliani",
      "Camilla Coletti"
    ],
    "published": "2025-09-19T09:45:41Z",
    "updated": "2025-09-19T09:45:41Z",
    "categories": [
      "physics.bio-ph",
      "physics.chem-ph",
      "physics.ins-det",
      "physics.med-ph"
    ],
    "primary_category": "physics.bio-ph"
  },
  {
    "arxiv_id": "2507.14628v2",
    "url": "https://arxiv.org/abs/2507.14628v2",
    "pdf_url": "https://arxiv.org/pdf/2507.14628v2.pdf",
    "title": "Electromagnetic Flow Control in Hypersonic Rarefied Environment",
    "abstract": "The Unified Gas-Kinetic Wave-Particle (UGKWP) method, developed for multiscale simulation of partially ionized plasmas, has been extended to unstructured meshes, enabling the modeling of electromagnetic flows around a hemisphere across near-continuum to rarefied regimes. To the best of our knowledge, this work represents the first application of a multiscale plasma solver to this problem. In our approach, neutrals, ions, and electrons are treated as distinct species, with electrons modeled beyond the conventional fluid approximation. The numerical implementation is validated through comparison with reference solutions for neutral hypersonic flow around a sphere, as well as benchmarking against experimental data for a Mach 4.75 pre-ionized argon flow. In both cases, the UGKWP results show good agreement with the reference and experimental data. The findings reveal that rarefied effects play a significant role in the prediction of electromagnetic flow control, underscoring the necessity of multiscale modeling in plasma flow applications.",
    "authors": [
      "Zhigang Pu",
      "Kun Xu"
    ],
    "published": "2025-07-19T13:50:47Z",
    "updated": "2025-09-19T09:37:09Z",
    "categories": [
      "physics.plasm-ph",
      "physics.flu-dyn"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.07846v2",
    "url": "https://arxiv.org/abs/2508.07846v2",
    "pdf_url": "https://arxiv.org/pdf/2508.07846v2.pdf",
    "title": "Introducing a Markov Chain-Based Time Calibration Procedure for   Multi-Channel Particle Detectors: Application to the SuperFGD and ToF   Detectors of the T2K Experiment",
    "abstract": "Inter-channel mis-synchronisation can be a limiting factor to the time resolution of high performance timing detectors with multiple readout channels and independent electronics units. In these systems, time calibration methods employed must be able to efficiently correct for minimal mis-synchronisation between channels and achieve the best detector performance. We present an iterative time calibration method based on Markov Chains, suitable for detector systems with multiple readout channels. Starting from correlated hit pairs alone, and without requiring an external reference time measurement, the method solves for fixed per-channel offsets, with precision limited only by the intrinsic single-channel resolution. A mathematical proof that the method is able to find the correct time offsets to be assigned to each detector channel in order to achieve inter-channel synchronisation is given, and it is shown that the number of iterations to reach convergence within the desired precision is controllable with a single parameter. Numerical studies are used to confirm unbiased recovery of true offsets. Finally, the application of the calibration method to the Super Fine-Grained Detector (SuperFGD) and the Time of Flight (TOF) detector at the upgraded T2K near detector (ND280) shows good improvement in overall timing resolution, demonstrating the effectiveness in a real-world scenario and scalability.",
    "authors": [
      "S. Abe",
      "H. Alarakia-Charles",
      "I. Alekseev",
      "C. Alt",
      "T. Arai",
      "T. Arihara",
      "S. Arimoto",
      "A. M. Artikov",
      "Y. Awataguchi",
      "N. Babu",
      "V. Baranov",
      "G. Barr",
      "D. Barrow",
      "L. Bartoszek",
      "L. Bernardi",
      "L. Berns",
      "S. Bhattacharjee",
      "A. V. Boikov",
      "A. Blanchet",
      "A. Blondel",
      "A. Bonnemaison",
      "S. Bordoni",
      "M. H. Bui",
      "T. H. Bui",
      "F. Cadoux",
      "S. Cap",
      "A. Cauchois",
      "J. Chakrani",
      "P. S. Chong",
      "A. Chvirova",
      "P. Collard",
      "M. Danilov",
      "C. Davis",
      "V. Davouloury",
      "Yu. I. Davydov",
      "A. Dergacheva",
      "C. Domangue",
      "D. Douqa",
      "T. A. Doyle",
      "O. Drapier",
      "A. Eguchi",
      "J. Elias",
      "G. Erofeev",
      "Y. Favre",
      "D. Fedorova",
      "S. Fedotov",
      "D. Ferlewicz",
      "Y. Fujii",
      "R. Fujita",
      "Y. Furui",
      "F. Gastaldi",
      "A. Gendotti",
      "A. Germer",
      "L. Giannessi",
      "C. Giganti",
      "V. Glagolev",
      "R. Guillaumat",
      "G. Ha",
      "N. C. Hastings",
      "I. Heitkamp",
      "J. Hu",
      "C. Husi",
      "A. K. Ichikawa",
      "T. H. Ishida",
      "A. Izmaylov",
      "K. Iwamoto",
      "M. Jakkapu",
      "C. Jesús-Valls",
      "J. Y. Ji",
      "P. Jonsson",
      "C. K. Jung",
      "H. Kakuno",
      "V. S. Kasturi",
      "M. Kawaue",
      "P. T. Keener",
      "M. Khabibullin",
      "N. V. Khomutov",
      "A. Khotjantsev",
      "T. Kikawa",
      "H. Kikutani",
      "N. V. Kirichkov",
      "A. Klustová",
      "H. Kobayashi",
      "T. Kobayashi",
      "L. Koch",
      "S. Kodama",
      "A. O. Kolesnikov",
      "M. Kolupanova",
      "A. Korzenev",
      "T. Koto",
      "Y. Kudenko",
      "S. Kuribayashi",
      "T. Kutter",
      "M. Lachat",
      "K. Lachner",
      "M. Lamers James",
      "D. Last",
      "N. Latham",
      "M. Lawe",
      "T. A. Le",
      "D. Leon Silverio",
      "B. Li",
      "W. Li",
      "C. Lin",
      "M. Louzir",
      "T. Lux",
      "K. K. Mahtani",
      "S. Manly",
      "D. A. Martinez Caicedo",
      "N. Mashin",
      "T. Matsubara",
      "C. Mauger",
      "K. S. McFarland",
      "C. McGrew",
      "J. McKean",
      "A. Mefodiev",
      "E. Miller",
      "O. Mineev",
      "A. Minamino",
      "A. L. Moreno",
      "A. Muñoz",
      "T. Nakadaira",
      "K. Nakagiri",
      "T. Nakaya",
      "J. Nanni",
      "L. Nicolas",
      "A. D. Nguyen",
      "D. T. Nguyen",
      "H. Nguyen",
      "V. Nguyen",
      "E. Noah Messomo",
      "T. Nosek",
      "H. M. O'Keeffe",
      "T. Ogawa",
      "W. Okinaga",
      "L. Osu",
      "V. Paolone",
      "G. Pelleriti",
      "L. Pickering",
      "M. A. Ramírez",
      "M. Reh",
      "G. Reina",
      "C. Riccio",
      "S. Roth",
      "A. Rubbia",
      "F. Saadi",
      "K. Sakashita",
      "N. Sallin",
      "S. Samani",
      "F. Sanchez",
      "T. Schefke",
      "C. Schloesser",
      "D. Sgalaberna",
      "A. Shaikovskiy",
      "A. Shvartsman",
      "Y. Shiraishi",
      "N. Shvarev",
      "N. Skrobova",
      "D. Smyczek",
      "M. Smy",
      "A. Speers",
      "D. Svirida",
      "M. Ta",
      "S. Tairafune",
      "M. Tani",
      "H. Tanigawa",
      "A. Teklu",
      "S. Tereshchenko",
      "V. V. Tereshchenko",
      "T. Thaiduc",
      "T. Tsushima",
      "M. Tzanov",
      "Y. Uchida",
      "I. I. Vasilyev",
      "E. Villa",
      "T. Vladisavljevic",
      "D. Wakabayashi",
      "H. Wallace",
      "A. Weber",
      "N. Whitney",
      "C. Wret",
      "Y. Xu",
      "Y. Yang",
      "N. Yershov",
      "A. J. P. Yrey",
      "M. Yokoyama",
      "Y. Yoshimoto",
      "X. Y. Zhao",
      "H. Zheng",
      "H. Zhong",
      "T. Zhu",
      "E. D. Zimmerman",
      "M. Zito"
    ],
    "published": "2025-08-11T11:06:37Z",
    "updated": "2025-09-19T08:14:42Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.15729v1",
    "url": "https://arxiv.org/abs/2509.15729v1",
    "pdf_url": "https://arxiv.org/pdf/2509.15729v1.pdf",
    "title": "The Role of Phase and Spatial Modes in Wave-Induced Plasma Transport",
    "abstract": "We derive a two-dimensional symplectic map for particle motion at the plasma edge by modeling the electrostatic potential as a superposition of integer spatial harmonics with relative phase shift, then reduce it to a two-wave model to study the transport dependence on the perturbation amplitudes, relative phase, and spatial-mode choice. Using particle transmissivity as a confinement criterion, identical-mode pairs exhibit phase-controlled behavior: anti-phase waves produce destructive interference and strong confinement while in-phase waves add constructively and drive chaotic transport. Mode-mismatched pairs produce richer phase-space structure with higher-order resonances and sticky regions; the transmissivity boundaries become geometrically complex. Box-counting dimensions quantify this: integer dimension smooth boundaries for identical modes versus non-integer fractal-like dimension for distinct modes, demonstrating that phase and spectral content of waves jointly determine whether interference suppresses or promotes transport.",
    "authors": [
      "L. F. B. Souza",
      "Y. Elskens",
      "R. Egydio de Carvalho",
      "I. L. Caldas"
    ],
    "published": "2025-09-19T08:00:57Z",
    "updated": "2025-09-19T08:00:57Z",
    "categories": [
      "physics.plasm-ph",
      "nlin.CD"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.15721v1",
    "url": "https://arxiv.org/abs/2509.15721v1",
    "pdf_url": "https://arxiv.org/pdf/2509.15721v1.pdf",
    "title": "Runaway electrons during a coil quench in stellarators",
    "abstract": "It is shown that avalanches of runaway electrons can arise in stellarators, even if there is no net toroidal current in the plasma or the magnetic-field coils, if the current in the latter varies rapidly enough, e.g. due to a superconductor quench. In present-day devices such as W7-X, significant runaway generation is theoretically possible only at very low gas or plasma density in the vacuum vessel, e.g. between discharges, if a seed population of free electrons is present. In reactor-scale stellarators, more dangerous runaway generation may occur both between discharges and during low-density plasma operation. Since a radiation-induced seed population is necessarily present in an activated device, an accidental coil ramp-down could convert substantial magnetic energy into wall-damaging runaway currents. There is however much more time to mitigate such events than in tokamaks disruptions.",
    "authors": [
      "Pavel Aleynikov",
      "Per Helander",
      "Håkan M Smith"
    ],
    "published": "2025-09-19T07:52:49Z",
    "updated": "2025-09-19T07:52:49Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  }
]