{
  "arxiv_id": "2506.02104v3",
  "url": "https://arxiv.org/abs/2506.02104v3",
  "pdf_url": "https://arxiv.org/pdf/2506.02104v3.pdf",
  "title": "Collisionless relaxation to equilibrium distributions in cold dark   matter halos: origin of the NFW profile",
  "abstract": "Collisionless self-gravitating systems such as cold dark matter halos are known to harbor universal density profiles despite the intricate non-linear physics of hierarchical structure formation in the $\\Lambda$CDM paradigm. The origin of such states has been a persistent mystery, particularly because the physics of collisionless relaxation has remained poorly understood. To solve this long-standing problem, we develop a self-consistent quasilinear theory in action-angle space for the collisionless relaxation of inhomogeneous, self-gravitating systems by perturbing the governing Vlasov-Poisson equations. We obtain a quasilinear diffusion equation that describes the secular evolution of the mean coarse-grained distribution function $f_0$ of accreted matter in the fluctuating force field of a spherical isotropic halo. The diffusion coefficient not only depends on the fluctuation power spectrum but also on the evolving potential of the system, which reflects the self-consistency of the problem. Diffusive heating in the pre-assembled halo develops an $r^{-\\gamma}$ inner density cusp, accretion and relaxation in which develops an $r^{-\\beta}$ outer fall-off with $\\beta \\approx 5 - 2\\gamma$ in the quasi-steady state. Spherical collapse theory dictates that a quasi-steady outer halo must settle to $\\beta \\approx 3$, for which the mass enclosed within a shell barely changes with time. This implies that $\\gamma\\approx 1$, which is possible in the quasilinear framework only if (i) the pre-assembled halo harbors an $r^{-\\gamma_{\\mathrm{P}}}$ profile with $\\gamma_{\\mathrm{P}} \\gtrsim 0.5$, (ii) its fluctuations are correlated in time (red noise), and (iii) the initial value of $\\gamma$ is smaller than $1$, implying that the $r^{-1}$ cusp is a neutral equilibrium. We demonstrate for the first time how the Navarro-Frenk-White (NFW) profile emerges as a quasi-steady state of collisionless relaxation.",
  "authors": [
    "Uddipan Banik",
    "Amitava Bhattacharjee"
  ],
  "published": "2025-06-02T18:00:00Z",
  "updated": "2025-10-28T05:01:15Z",
  "categories": [
    "astro-ph.GA",
    "astro-ph.CO",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.GA"
}