{
  "arxiv_id": "2509.02041v2",
  "url": "https://arxiv.org/abs/2509.02041v2",
  "pdf_url": "https://arxiv.org/pdf/2509.02041v2.pdf",
  "title": "Characterization of SiPMs at 40 K for neutrino coherent detection based   on pure CsI",
  "abstract": "Silicon photomultiplier (SiPM), as the core photoelectric sensor for coherent neutrino detection in low-temperature pure CsI, its working performance directly determines the measurement accuracy of the scintillator light yield. Our previous research has fully demonstrated the performance of pure CsI at liquid nitrogen temperature. More intriguingly, its performance is expected to be even better at 40 K. However, the performance characteristics of SiPM in the 40 K temperature range still remain to be explored. In this study, a self-developed adjustable temperature control system ranging from 30 K to 293 K was built to investigate the key performance parameters of SiPM at different temperatures, such as single photoelectron spectrum, gain, breakdown voltage, dark count rate, after-pulse, internal crosstalk, and single photoelectron resolution. Special emphasis was placed on examining the key performance parameters of SiPM in the 40 K temperature range to evaluate its feasibility for light yield measurement in this temperature range. The results show that this study obtained the parameter variation trends and optimal working conditions of 3 types of SiPM at different temperatures, thereby improving the sensitivity of the detector. This research provides important technical support for low-temperature detection in neutrino physics experiments.",
  "authors": [
    "Tao Liu",
    "Xilei Sun",
    "Fengjiao Luo",
    "Jingbo Ye",
    "Bo Zheng",
    "Cong Guo",
    "Zhilong Hou",
    "Rongbin Zhou",
    "Aiqin Gao",
    "Lei Cao",
    "Bo Zhang",
    "Sijia Han"
  ],
  "published": "2025-09-02T07:35:40Z",
  "updated": "2025-10-28T08:33:46Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.1007/s41605-025-00599-5"
}