{
  "arxiv_id": "2510.23134v1",
  "url": "https://arxiv.org/abs/2510.23134v1",
  "pdf_url": "https://arxiv.org/pdf/2510.23134v1.pdf",
  "title": "THz mixing of high-order harmonics using $YBa_2Cu_3O_{7-δ}$   nanobridges",
  "abstract": "Superconducting materials are a key for technologies enabling a large number of devices including THz wave mixers and single photon detectors, though limited at very low temperatures for conventional superconductors. High temperature operation could in principle be offered using cuprate superconductors. However, the complexity of the material in thin film form, the extremely short coherence length and material stability, have hindered the realization of THz devices working at liquid nitrogen temperatures. $YBa_2Cu_3O_{7-{\\delta}}$ (YBCO) nanodevices have demonstrated non-linear properties typical of Josephson-like behavior, which have the potential for the mixing of AC signals in the THz range due to the large superconducting energy gap. Here, we present AC Josephson functionalities for terahertz waves utilizing Abrikosov vortex motion in nanoscale-confined fully planar YBCO thin film bridges. We observe Shapiro step-like features in the current voltage characteristics when irradiating the device with monochromatic sub-THz waves (100 GHz to 215 GHz) at 77 K. We further explore these nonlinear effects by detecting THz high-order harmonic mixing for signals from 200 GHz up to 1.4 THz using a local oscillator at 100 GHz. Our results open a path to an easy-fabricated HTS nonlinear nanodevice based on dimensional confinement suitable for terahertz applications.",
  "authors": [
    "Núria Alcalde-Herraiz",
    "Alessia Garibaldi",
    "Karn Rongrueangkul",
    "Alexei Kalaboukhov",
    "Floriana Lombardi",
    "Sergey Cherednichenko",
    "Thilo Bauch"
  ],
  "published": "2025-10-27T09:15:02Z",
  "updated": "2025-10-27T09:15:02Z",
  "categories": [
    "cond-mat.supr-con",
    "physics.ins-det"
  ],
  "primary_category": "cond-mat.supr-con"
}