{
  "arxiv_id": "2510.25438v1",
  "url": "https://arxiv.org/abs/2510.25438v1",
  "pdf_url": "https://arxiv.org/pdf/2510.25438v1.pdf",
  "title": "On Improving Nuclear Fuel Imaging Using Position Sensitive Detectors",
  "abstract": "Spent nuclear fuel imaging before disposal is of utmost importance before long term disposal in dedicated storage facilities. Passive Gamma Emission Tomography (PGET) is an approved method by the International Atomic Energy Agency. The present detection system is based on small CZT detectors behind a tungsten-based collimator consisting of a linear array of slits. Small scale CZT crystals limit the detection efficiency of high energetic gamma rays from the fuel rods, mainly the 662 keV emissions from Cs-137. In our study based on full Monte-Carlo simulations as well as on experiments, we explore the capabilities of large pixelated CZT detectors to be used for PGET. We will discuss the theoretical advantages and practical challenges of the larger crystals. We demonstrate that the larger crystals, depending on their orientation, will increase the detection efficiency by a factor of 7 to 13. Due to the pixelated sensor signal readout we also explore the possibility to employ Compton imaging to improve the information on the location of origin of gamma rays. In addition we explore the usefulness of commercial gamma-ray imagers for waste characterisation and decommissioning. In particular we report on the performance of the GeGI imager from PHDS Co and the H420 imager from H3D Inc in measuring nuclear waste drums at Svafo, Sweden.",
  "authors": [
    "Erik Brücken",
    "Peter Andersson",
    "Mihaela Bezak",
    "Peter Dendooven",
    "Sofia Godø",
    "Stefan Holm",
    "Matti Kalliokoski",
    "Aage Kalsæg",
    "Gustav Pettersson",
    "Anders Puranen",
    "Vikram Rathore",
    "Santeri Saariokari"
  ],
  "published": "2025-10-29T12:06:22Z",
  "updated": "2025-10-29T12:06:22Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}