[
  {
    "arxiv_id": "2510.25722v1",
    "url": "https://arxiv.org/abs/2510.25722v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25722v1.pdf",
    "title": "Intrinsic emittance properties of an Fe-doped Beta-Ga2O3(010)   photocathode: Ultracold electron emission at 300K and the polaron self-energy",
    "abstract": "Measurements of the spectral emission properties of an iron-doped Beta-Ga2O3(010) photocathode at 300K reveal the presence of ultracold electron emission with a 6meV mean transverse energy (MTE) in the 3.5-4.4eV photon energy range (282-354nm). This extreme sub-thermal photoemission signal is consistent with direct emission of electrons photoexcited from the Fe dopant states into the low effective mass and positive electron affinity primary conduction band, and it is superimposed on a stronger signal with a larger MTE associated with an (optical)phonon-mediated momentum resonant Franck-Condon (FC) emission process from a thermally populated and negative electron affinity upper conduction band. For photon energies above 4.5eV, a transition from a long to a short transport regime is forced by an absorption depth reduction to below 100nm and both MTE signals exhibit spectral trends consistent with phonon-mediated FC emission if the polaron formation self-energy is included in the initial photoexcited electron thermalization.",
    "authors": [
      "Louis A. Angeloni",
      "Ir-Jene Shan",
      "J. H. Leach",
      "W. Andreas Schroeder"
    ],
    "published": "2025-10-29T17:29:19Z",
    "updated": "2025-10-29T17:29:19Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.acc-ph",
      "physics.app-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2303.03411v3",
    "url": "https://arxiv.org/abs/2303.03411v3",
    "pdf_url": "https://arxiv.org/pdf/2303.03411v3.pdf",
    "title": "Electromagnetic radiation reaction and energy extraction from black   holes: The tail term cannot be ignored",
    "abstract": "We study electromagnetic radiation reaction in curved space and the dynamics of radiating charged particles. The equation of motion for such particles is the DeWitt-Brehme equation, and it contains a particularly complicated, non-local, tail term. It has been claimed that the tail term can be neglected in certain magnetized black hole spacetimes, and that radiation reaction may then lead to energy extraction (\"orbital widening\") in the absence of an ergoregion. We show that such claims are incorrect, at least in the Newtonian limit: the tail term can never be neglected consistently in the relevant scenarios, and when it is included the reported energy extraction no longer occurs. Thus, previous results are called into question by our work.",
    "authors": [
      "João S. Santos",
      "Vitor Cardoso",
      "José Natário"
    ],
    "published": "2023-03-06T19:00:02Z",
    "updated": "2025-10-29T17:00:05Z",
    "categories": [
      "gr-qc",
      "astro-ph.HE",
      "hep-th",
      "physics.acc-ph"
    ],
    "primary_category": "gr-qc",
    "doi": "10.1103/PhysRevD.107.064046"
  },
  {
    "arxiv_id": "2510.25673v1",
    "url": "https://arxiv.org/abs/2510.25673v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25673v1.pdf",
    "title": "Spatiotemporal control of laser intensity using differentiable   programming",
    "abstract": "Optical techniques for spatiotemporal control can produce laser pulses with custom amplitude, phase, or polarization structure. In nonlinear optics and plasma physics, the use of structured pulses typically follows a forward design approach, in which the efficacy of a known structure is analyzed for a particular application. Inverse approaches, in contrast, enable the discovery of new structures with the potential for superior performance. Here, an implementation of the unidirectional pulse propagation equation that supports automatic differentiation is combined with gradient-based optimization to design structured pulses with features that are advantageous for a range of nonlinear optical and plasma-based applications: (1) a longitudinally uniform intensity over an extended region, (2) a superluminal intensity peak that travels many Rayleigh ranges with constant duration, spot size, and amplitude, and (3) a laser pulse that ionizes a gas to form a uniform column of plasma. In the final case, optimizing the full spatiotemporal structure improves the performance by a factor of 15 compared to optimizing only spatial or only temporal structure, highlighting the advantage of spatiotemporal control.",
    "authors": [
      "Kyle G Miller",
      "Tomas E Gutierrez",
      "Archis S Joglekar",
      "Amanda Elliott",
      "Dustin H Froula",
      "John P Palastro"
    ],
    "published": "2025-10-29T16:42:00Z",
    "updated": "2025-10-29T16:42:00Z",
    "categories": [
      "physics.optics",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2510.25636v1",
    "url": "https://arxiv.org/abs/2510.25636v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25636v1.pdf",
    "title": "Observations of the Relationship between Magnetic Anisotropy and Mode   Composition in Low-$β$ Solar Wind Turbulence",
    "abstract": "Turbulence is a ubiquitous process that transfers energy across many spatial and temporal scales, thereby influencing particle transport and heating. Recent progress has improved our understanding of the anisotropy of turbulence with respect to the mean magnetic field; however, its exact form and implications for magnetic topology and energy transfer remain unclear. In this Letter, we investigate the nature of magnetic anisotropy in compressible magnetohydrodynamic (MHD) turbulence within low-$\\beta$ solar wind using Cluster spacecraft measurements. By decomposing small-amplitude fluctuations into Alfv\\'en and compressible modes, we reveal that the anisotropy is strongly mode dependent: quasi-parallel (`slab') energy contains both Alfv\\'en and compressible modes, whereas quasi-perpendicular (`two-dimensional'; 2D) energy is almost purely Alfv\\'enic, a feature closely linked to collisionless damping of compressible modes. These findings elucidate the physical origin of the long-standing `slab+2D' empirical model and offer a new perspective on the turbulence cascade across the full three-dimensional wavevector space.",
    "authors": [
      "Siqi Zhao",
      "Huirong Yan",
      "Terry Z. Liu",
      "Chuanpeng Hou"
    ],
    "published": "2025-10-29T15:49:52Z",
    "updated": "2025-10-29T15:49:52Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2405.02172v4",
    "url": "https://arxiv.org/abs/2405.02172v4",
    "pdf_url": "https://arxiv.org/pdf/2405.02172v4.pdf",
    "title": "All-fiber microendoscopic polarization sensing at single-photon level   aided by deep-learning",
    "abstract": "The polarization of light conveys crucial information about the spatial ordering and optical properties of a specimen. However, precise polarization measurement in challenging conditions, including constrained spaces, low light levels, and high-speed scenarios, remains a severe challenge. Addressing this problem, we introduce a real-time polarization measurement method that is accurate down to a single-photon level and provides complete information about the polarization state. Free of moving components, the polarization sensor utilizes a short rigid piece of few-mode fiber followed by a fiber array and a detector array. The calibration of the sensor relies on a neural network yielding unprecedented accuracy across all polarization states, including partially polarized light. We validate the approach by visualizing the polarization structure of biological specimens and the liquid crystal polymer sample (birefringent USAF test). Our method offers an efficient and reliable solution for real-time polarization sensing and microendoscopy under low-light conditions.",
    "authors": [
      "Martin Bielak",
      "Dominik Vašinka",
      "Miroslav Ježek"
    ],
    "published": "2024-05-03T15:22:04Z",
    "updated": "2025-10-29T15:45:22Z",
    "categories": [
      "physics.optics",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "physics.optics",
    "doi": "10.1002/lpor.202501775"
  },
  {
    "arxiv_id": "2507.21612v2",
    "url": "https://arxiv.org/abs/2507.21612v2",
    "pdf_url": "https://arxiv.org/pdf/2507.21612v2.pdf",
    "title": "First use of large area SiPM matrices coupled with NaI(Tl) scintillating   crystal for low energy dark matter search",
    "abstract": "The long-standing claim of dark matter detection by the DAMA experiment remains a crucial open question in astroparticle physics. A key step towards its independent verification is the development of NaI(Tl)-based detectors with improved sensitivity at low energies. The majority of NaI(Tl)-based experiments rely on conventional photomultiplier tubes (PMTs) as single photon detectors, which present technological limitations in terms of light collection, intrinsic radioactivity and a high noise contribution at keV energies. ASTAROTH is an R&D project developing a NaI(Tl)-based detector where the scintillation light is read out by silicon photomultipliers (SiPM) matrices. SiPMs exhibit high photon detection efficiency, negligible radioactivity, and, most importantly, a dark noise nearly two orders of magnitude lower than PMTs, when operated at cryogenic temperature. To this end, ASTAROTH features a custom-designed cryostat based on a bath of cryogenic fluid, able to safely operate the detector and the read-out electronics down to about 80K. We report the first experimental characterization of 360 g NaI(Tl) detector read out by a large area (5 cm x 5 cm) SiPM matrix. The photoelectron yield obtained with a preliminary configuration is 7.2 photoelectrons/keV, which is rather promising, also in light of several planned developments. The signal-to-noise ratio and the energy threshold attainable with SiPMs is expected to improve the sensitivity for dark matter searches beyond the reach of current-generation PMT-based detectors. This result is the first proof of the viability of this technology and sets a milestone toward the design of future large-scale experiments.",
    "authors": [
      "Edoardo Martinenghi",
      "Valerio Toso",
      "Fabrizio Bruno Armani",
      "Andrea Castoldi",
      "Giuseppe di Carlo",
      "Luca Frontini",
      "Niccolò Gallice",
      "Chiara Guazzoni",
      "Valentino Liberali",
      "Alberto Stabile",
      "Valeria Trabattoni",
      "Andrea Zani",
      "Davide D'Angelo"
    ],
    "published": "2025-07-29T09:10:39Z",
    "updated": "2025-10-29T15:44:57Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2506.14637v2",
    "url": "https://arxiv.org/abs/2506.14637v2",
    "pdf_url": "https://arxiv.org/pdf/2506.14637v2.pdf",
    "title": "A New cw-NMR Q-meter for Dynamically Polarized Targets for Particle   Physics",
    "abstract": "Polarized solid targets produced via Dynamic Nuclear Polarization rely on Continuous-Wave Nuclear Magnetism Resonance measurements to accurately determine the degree of polarization of bulk samples polarized to nearly 100%. Since the late 1970's phase sensitive detection methods have been utilized to observe the magnetization of a sample as a small change in inductance under RF excitation near the Larmor frequency of the nuclear species of interest, using a device known as a Q-meter. Liverpool Q-meters, produced in the UK in the 80's and 90's, have been the workhorse devices for these targets for decades, however their age and scarcity has meant new systems are needed. We describe a Q-meter system designed and built at Jefferson Lab in the Liverpool style to have comparable electronic performance with several improvements to update and adapt the devices for modern use.",
    "authors": [
      "J. D. Maxwell",
      "J. Brock",
      "C. Cuevas",
      "H. Dong",
      "C. D. Keith",
      "J. J. Pierce"
    ],
    "published": "2025-06-17T15:31:04Z",
    "updated": "2025-10-29T14:22:58Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.25532v1",
    "url": "https://arxiv.org/abs/2510.25532v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25532v1.pdf",
    "title": "Global Non-Axisymmetric Hall Instabilities in a Rotating Plasma",
    "abstract": "Non-axisymmetric, flow-driven instabilities in the incompressible Hall-MHD model are studied in a differentially rotating cylindrical plasma. It is found that in the Hall-MHD regime, both whistler waves and ion-cyclotron waves can extract energy from the flow shear, resulting in two distinct branches of global instability. The non-axisymmetric whistler modes grow significantly faster than non-axisymmetric, ideal MHD modes. A discussion of the whistler instability mechanism is presented in the large-ion-skin-depth, `electron-MHD' limit. It is observed that the effect of the Hall term on the non-axisymmetric modes can be appreciable when $d_i$ is on the order of a few % of the width of the cylindrical annulus. Distinct global modes emerge in the Hall-MHD regime at significantly stronger magnetic fields than those required for unstable global MHD modes.",
    "authors": [
      "Alexandre Sainterme",
      "Fatima Ebrahimi"
    ],
    "published": "2025-10-29T13:57:40Z",
    "updated": "2025-10-29T13:57:40Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2505.00042v2",
    "url": "https://arxiv.org/abs/2505.00042v2",
    "pdf_url": "https://arxiv.org/pdf/2505.00042v2.pdf",
    "title": "Characterisation of the neutron beam in the n_TOF-EAR2 experimental area   at CERN following the spallation target upgrade",
    "abstract": "The n_TOF facility at CERN has undergone a major upgrade after the installation of a new spallation target, designed to improve the features of both neutron beamlines at the experimental areas 1 and 2 (EAR1 and EAR2) and the commissioning of a new experimental area (NEAR). Due to improved coupling of the spallation target with the EAR2 beamline, the upgrade resulted in a significantly increased neutron flux and improved neutron energy resolution. This paper presents the results of the commissioning phase that followed to characterise the EAR2 neutron beamline and validate the FLUKA Monte Carlo simulations of the facility. The main features of the neutron beam, namely the neutron flux, spatial profile and energy resolution, are evaluated and compared to the previous target. The neutron flux presents a general increase of 20% below 1 eV, 40% between 1 eV and 100 keV and 50% between 100 keV and 10 MeV. The measured width of the beam profile was 3 cm (FWHM) at the reference position for neutron capture measurements. The energy resolution with the new spallation target shows a significant improvement compared to the previous one. Moreover, FLUKA Monte Carlo simulations present a good agreement with the measured neutron flux and profile within uncertainties, and a remarkable reproduction of the energy resolution.",
    "authors": [
      "J. A. Pavon-Rodriguez",
      "J. Lerendegui-Marco",
      "A. Manna",
      "S. Amaducci",
      "M. Sabate-Gilarte",
      "E. Musacchio-Gonzalez",
      "M. Bacak",
      "V. Alcayne",
      "M. A.",
      "Cortes-Giraldo",
      "V. Vlachoudis",
      "R. Zarrella",
      "F. Garcia-Infantes",
      "E. Stamati",
      "A. Casanovas",
      "N. Patronis",
      "L. Tassan-Got",
      "J. M. Quesada",
      "the n_TOF Collaboration"
    ],
    "published": "2025-04-29T21:19:07Z",
    "updated": "2025-10-29T13:45:45Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.24196v2",
    "url": "https://arxiv.org/abs/2510.24196v2",
    "pdf_url": "https://arxiv.org/pdf/2510.24196v2.pdf",
    "title": "Design and characterization of a photosensor system for the RELICS   experiment",
    "abstract": "In this paper, we present the design and characterization of a photosensor system developed for the RELICS experiment. A set of dynamic readout bases was designed to mitigate photomultiplier tube (PMT) saturation caused by intense cosmic muon backgrounds in the surface-level RELICS detector. The system employs dual readout from the anode and the seventh dynode to extend the PMT's linear response range. In particular, our characterization and measurements of Hamamatsu R8520-406 PMTs confirm stable operation under positive high-voltage bias, extending the linear response range by more than an order of magnitude. Furthermore, a model of PMT saturation and recovery was developed to evaluate the influence of cosmic muon signals in the RELICS detector. The results demonstrate the system's capability to detect coherent elastic neutrino-nucleus scattering (CE$\\nu$NS) signals under surface-level cosmic backgrounds, and suggest the potential to extend the scientific reach of RELICS to MeV-scale interactions.",
    "authors": [
      "Jijun Yang",
      "Ruize Li",
      "Chang Cai",
      "Guocai Chen",
      "Jiangyu Chen",
      "Huayu Dai",
      "Rundong Fang",
      "Fei Gao",
      "Jingfan Gu",
      "Xiaoran Guo",
      "Jiheng Guo",
      "Gaojun Jin",
      "Gaojun Ju",
      "Yanzhou Hao",
      "Yang Lei",
      "Kaihang Li",
      "Meng Li",
      "Minhua Li",
      "Shengchao Li",
      "Siyin Li",
      "Tao Li",
      "Qing Lin",
      "Jiajun Liu",
      "Sheng Lv",
      "Guang Luo",
      "Kangwei Ni",
      "Chuanping Shen",
      "Mingzhuo Song",
      "Lijun Tong",
      "Jun Wang",
      "Xiaoyu Wang",
      "Wei Wang",
      "Xiaoping Wang",
      "Zihu Wang",
      "Yuehuan Wei",
      "Liming Weng",
      "Xiang Xiao",
      "Lingfeng Xie",
      "Litao Yang",
      "Long Yang",
      "Jingqiang Ye",
      "Jiachen Yu",
      "Qian Yue",
      "Yuyong Yue",
      "Bingwei Zhang",
      "Yuming Zhang",
      "Yifei Zhao",
      "Chenhui Zhu"
    ],
    "published": "2025-10-28T09:03:00Z",
    "updated": "2025-10-29T13:00:24Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.25438v1",
    "url": "https://arxiv.org/abs/2510.25438v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25438v1.pdf",
    "title": "On Improving Nuclear Fuel Imaging Using Position Sensitive Detectors",
    "abstract": "Spent nuclear fuel imaging before disposal is of utmost importance before long term disposal in dedicated storage facilities. Passive Gamma Emission Tomography (PGET) is an approved method by the International Atomic Energy Agency. The present detection system is based on small CZT detectors behind a tungsten-based collimator consisting of a linear array of slits. Small scale CZT crystals limit the detection efficiency of high energetic gamma rays from the fuel rods, mainly the 662 keV emissions from Cs-137. In our study based on full Monte-Carlo simulations as well as on experiments, we explore the capabilities of large pixelated CZT detectors to be used for PGET. We will discuss the theoretical advantages and practical challenges of the larger crystals. We demonstrate that the larger crystals, depending on their orientation, will increase the detection efficiency by a factor of 7 to 13. Due to the pixelated sensor signal readout we also explore the possibility to employ Compton imaging to improve the information on the location of origin of gamma rays. In addition we explore the usefulness of commercial gamma-ray imagers for waste characterisation and decommissioning. In particular we report on the performance of the GeGI imager from PHDS Co and the H420 imager from H3D Inc in measuring nuclear waste drums at Svafo, Sweden.",
    "authors": [
      "Erik Brücken",
      "Peter Andersson",
      "Mihaela Bezak",
      "Peter Dendooven",
      "Sofia Godø",
      "Stefan Holm",
      "Matti Kalliokoski",
      "Aage Kalsæg",
      "Gustav Pettersson",
      "Anders Puranen",
      "Vikram Rathore",
      "Santeri Saariokari"
    ],
    "published": "2025-10-29T12:06:22Z",
    "updated": "2025-10-29T12:06:22Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.25376v1",
    "url": "https://arxiv.org/abs/2510.25376v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25376v1.pdf",
    "title": "Robust direct laser acceleration of electrons with flying-focus laser   pulses",
    "abstract": "Direct laser acceleration (DLA) offers a compact source of high-charge, energetic electrons for generating secondary radiation or neutrons. While DLA in high-density plasma optimizes the energy transfer from a laser pulse to electrons, it exacerbates nonlinear propagation effects, such as filamentation, that can disrupt the acceleration process. Here, we show that superluminal flying-focus pulses (FFPs) mitigate nonlinear propagation, thereby enhancing the number of high-energy electrons and resulting x-ray yield. Three-dimensional particle-in-cell simulations show that, compared to a Gaussian pulse of equal energy (1 J) and intensity (2x10^20 W/cm^2), an FFP produces 80x more electrons above 100 MeV, increases the electron cutoff energy by 20%, triples the high-energy x-ray yield, and improves x-ray collimation. These results illustrate the ability of spatiotemporally structured laser pulses to provide additional control in the highly nonlinear, relativistic regime of laser-plasma interactions.",
    "authors": [
      "Talia Meir",
      "Kale Weichman",
      "Alexey Arefiev",
      "John P. Palastro",
      "Ishay Pomerantz"
    ],
    "published": "2025-10-29T10:49:19Z",
    "updated": "2025-10-29T10:49:19Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.02488v2",
    "url": "https://arxiv.org/abs/2508.02488v2",
    "pdf_url": "https://arxiv.org/pdf/2508.02488v2.pdf",
    "title": "Commissioning of the NUCLEUS Experiment at the Technical University of   Munich",
    "abstract": "The NUCLEUS experiment aims to detect coherent elastic neutrino-nucleus scattering of reactor antineutrinos on CaWO$_4$ targets in the fully coherent regime, using gram-scale cryogenic calorimeters. The experimental apparatus will be installed at the Chooz nuclear power plant in France, in the vicinity of two 4.25 GW$_{\\text{th}}$ reactor cores. This work presents results from the commissioning of an essential version of the experiment at the shallow Underground Laboratory of the Technical University of Munich. For the first time, two cryogenic target detectors were tested alongside active and passive shielding systems. Over a period of two months all detector subsystems were operated with stable performance. Background measurements were conducted, providing important benchmarks for the modeling of background sources at the reactor site. Finally, we present ongoing efforts to upgrade the detector systems in preparation for a technical run at Chooz in 2026, and highlight the remaining challenges to achieving neutrino detection.",
    "authors": [
      "H. Abele",
      "G. Angloher",
      "B. Arnold",
      "M. Atzori Corona",
      "A. Bento",
      "E. Bossio",
      "F. Buchsteiner",
      "J. Burkhart",
      "F. Cappella",
      "M. Cappelli",
      "N. Casali",
      "R. Cerulli",
      "A. Cruciani",
      "G. Del Castello",
      "M. del Gallo Roccagiovine",
      "S. Dorer",
      "A. Erhart",
      "M. Friedl",
      "S. Fichtinger",
      "V. M. Ghete",
      "M. Giammei",
      "C. Goupy",
      "D. Hauff",
      "F. Jeanneau",
      "E. Jericha",
      "M. Kaznacheeva",
      "H. Kluck",
      "A. Langenkämper",
      "T. Lasserre",
      "D. Lhuillier",
      "M. Mancuso",
      "R. Martin",
      "B. Mauri",
      "A. Mazzolari",
      "L. McCallin",
      "H. Neyrial",
      "C. Nones",
      "L. Oberauer",
      "T. Ortmann",
      "L. Peters",
      "F. Petricca",
      "W. Potzel",
      "F. Pröbst",
      "F. Pucci",
      "F. Reindl",
      "M. Romagnoni",
      "J. Rothe",
      "N. Schermer",
      "J. Schieck",
      "S. Schönert",
      "C. Schwertner",
      "L. Scola",
      "G. Soum-Sidikov",
      "L. Stodolsky",
      "R. Strauss",
      "R. Thalmeier",
      "C. Tomei",
      "M. Vignati",
      "M. Vivier",
      "A. Wex"
    ],
    "published": "2025-08-04T14:58:53Z",
    "updated": "2025-10-29T09:06:46Z",
    "categories": [
      "hep-ex",
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1103/c95p-8kh2"
  },
  {
    "arxiv_id": "2510.25286v1",
    "url": "https://arxiv.org/abs/2510.25286v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25286v1.pdf",
    "title": "Advanced structural characterization of single-walled carbon nanotubes   with 4D-STEM",
    "abstract": "Single wall carbon nanotubes (SWCNT) exhibit remarkable optical and electrical properties making them one of the most promising materials for next generation electronic and optoelectronic devices. Their electronic properties strongly depend on their chirality, i.e., their structural configuration, as well as on the presence and nature of atomic defects. Currently, the lack of versatile and efficient structural characterization techniques limits SWCNT applications. Here, we report how four-dimensional scanning transmission electron microscopy (4D-STEM) can address critical challenges in SWCNT structural analysis. Using modern fast pixelated electron detectors, we were able to acquire rapidly a large number of low noise electron diffraction patterns of SWCNTs. The resulting 4D-STEM data allow to precisely determine the local chirality of multiple nanotubes at once, with limited electron dose (down to 1750 e-/{\\AA}^2) and nanometric spatial resolution (down to 3.1 nm). We also show how this approach enables to track the chirality along a single nanotube, while giving access to the strain distribution. Then, we report how 4D-STEM data enable to reconstruct high-resolution images with electron ptychography. With this second approach, structural information can be obtained with atomic scale spatial resolution allowing atomic defect imaging. Finally, we investigate how multi-slice electron ptychography could provide even further insight on nanotube defect structures thanks to its close to 3D imaging capabilities at atomic resolution.",
    "authors": [
      "Antonin Louiset",
      "Daniel Förster",
      "Vincent Jourdain",
      "Saïd Tahir",
      "Nicola Vigano",
      "Jean-Luc Rouvière",
      "Christophe Bichara",
      "Hanako Okuno"
    ],
    "published": "2025-10-29T08:42:34Z",
    "updated": "2025-10-29T08:42:34Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2510.25272v1",
    "url": "https://arxiv.org/abs/2510.25272v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25272v1.pdf",
    "title": "Characterization of the Li$_2$WO$_4$ crystal as a cryogenic   scintillating calorimeter",
    "abstract": "A wide range of scintillating bolometers is under investigation for applications in the search for rare events and processes beyond the Standard Model. In this work, we report the first measurement of a natural, non-molybdenum-doped, lithium tungstate (LWO) crystal operated underground as a scintillating cryogenic calorimeter. The detector achieved a baseline energy resolution of 0.5 keV RMS with a low-energy threshold of about 1.5 keV. The simultaneous readout of heat and light enabled particle identification, revealing a clear separation between $\\beta/\\gamma$, $\\alpha$, and nuclear recoil populations above 300 keV, with a light-yield-based particle discrimination better than $6\\sigma$. These results, fully comparable with those achieved with other compounds in the field, demonstrate that LWO is a promising candidate for rare-event searches. In particular, the combination of excellent radio-purity (with U/Th levels below 0.5 mBq/kg) and sensitivity to neutron interactions via the $^6$Li(n,$\\alpha$)$^3$H reaction makes this material an attractive option for next-generation experiments on dark matter, coherent elastic neutrino-nucleus scattering, and spin-dependent interactions.",
    "authors": [
      "D. L. Helis",
      "A. Melchiorre",
      "S. Nagorny",
      "M. Noia",
      "L. Pagnanini",
      "S. Pirro",
      "A. Puiu",
      "G. Benato",
      "P. Carniti",
      "R. Elleboro",
      "P. Gambacorta",
      "C. Gotti",
      "V. D. Grigorieva",
      "S. Nisi",
      "E. Olivieri",
      "G. Pessina",
      "S. Piacentini",
      "M. Shafiee",
      "V. N. Shlegel"
    ],
    "published": "2025-10-29T08:30:33Z",
    "updated": "2025-10-29T08:30:33Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.25264v1",
    "url": "https://arxiv.org/abs/2510.25264v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25264v1.pdf",
    "title": "Development of a new phase-retrieval algorithm from a single-shot image   for X-ray schlieren microscopy",
    "abstract": "In this paper, a new phase-retrieval algorithm from an X-ray schlieren image is proposed. The schlieren method allows phase-contrast imaging with an objective lens and a knife-edge filter placed at the back focal plane of the objective. This method finds a wide range of applications in the visible-light region for transparent specimen visualization. The schlieren contrast does not directly correspond to the phase shift. However, the phase map can be reconstructed from a single-shot schlieren image of a transparent and weak-phase object using the filtered Fourier transform method. A proof-of-principle experiment was performed in the hard-X-ray region at the AR-NE1A beamline of the Photon Factory facility at the High Energy Accelerator Research Organization (KEK).",
    "authors": [
      "Ryutaro Nishimura",
      "Yoshio Suzuki",
      "Hiroshi Sugiyama",
      "Daisuke Wakabayashi",
      "Yuki Shibazaki",
      "Keiichi Hirano",
      "Noriyuki Igarashi",
      "Nobumasa Funamori"
    ],
    "published": "2025-10-29T08:22:01Z",
    "updated": "2025-10-29T08:22:01Z",
    "categories": [
      "physics.ins-det",
      "physics.data-an",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1016/j.optcom.2025.132283"
  },
  {
    "arxiv_id": "2504.06409v2",
    "url": "https://arxiv.org/abs/2504.06409v2",
    "pdf_url": "https://arxiv.org/pdf/2504.06409v2.pdf",
    "title": "High-Precision Lunar Corner-Cube Retroreflectors: A Wave-Optics   Perspective",
    "abstract": "High-precision corner-cube retroreflectors (CCRs) are critical for advanced lunar laser ranging (LLR) because they enable sub-millimeter-scale measurements of the Earth-Moon distance -- a level of precision essential for rigorous tests of relativistic gravitation and for advancing our understanding of lunar geophysics. In this work, we develop a comprehensive two-dimensional Fourier-optics model for single CCRs with apertures ranging from 80-110 mm. Our model incorporates realistic thermal-mechanical wavefront errors, detailed diffraction effects, and velocity aberration offsets. Our analysis reveals a strong coupling between aperture size and aberration angular offset: while larger CCRs deliver high on-axis flux under near-ideal conditions, their narrow diffraction lobes suffer significant flux loss at moderate aberration offsets, thereby favoring smaller apertures with broader main lobes. Furthermore, comparisons between solid fused-silica and hollow silicon-carbide (SiC) CCRs show that hollow designs not only achieve competitive or superior photon return -- particularly at 1064 nm, where phase errors are relatively reduced -- but also offer nearly an order-of-magnitude mass reduction for the same aperture sizes. These results establish a robust quantitative framework for optimizing CCR designs to perform at the sub-millimeter level under realistic lunar conditions and underscore the advantages of precision hollow SiC CCRs for next-generation LLR operations.",
    "authors": [
      "Slava G. Turyshev"
    ],
    "published": "2025-04-08T20:07:54Z",
    "updated": "2025-10-29T06:23:45Z",
    "categories": [
      "physics.optics",
      "astro-ph.IM",
      "gr-qc",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2510.25196v1",
    "url": "https://arxiv.org/abs/2510.25196v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25196v1.pdf",
    "title": "Fast chaos indicator from auto-differentiation for dynamic aperture   optimization",
    "abstract": "Automatic differentiation provides an efficient means of computing derivatives of complex functions with machine precision, thereby enabling differentiable simulation. In this work, we propose the use of the norm of the tangent map, obtained from differentiable tracking of particle trajectories, as a computationally efficient indicator of chaotic behavior in phase space. In many cases, a one-turn or few-turn tangent map is sufficient for this purpose, significantly reducing the computational cost associated with dynamic aperture optimization. As an illustrative application, the proposed indicator is employed in the dynamic aperture optimization of an ALS-U lattice design.",
    "authors": [
      "Ji Qiang",
      "Jinyu Wan",
      "Allen Qiang",
      "Yue Hao"
    ],
    "published": "2025-10-29T06:03:48Z",
    "updated": "2025-10-29T06:03:48Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.24121v2",
    "url": "https://arxiv.org/abs/2510.24121v2",
    "pdf_url": "https://arxiv.org/pdf/2510.24121v2.pdf",
    "title": "Effect of flow-aligned external magnetic fields on mushroom instability",
    "abstract": "Mushroom instability (MI) is a shear instability considered responsible for generating and amplifying magnetic fields in relativistic jets. While astrophysical jets are usually magnetized, how MI acts in magnetized jets remains poorly understood. In this paper, we investigate the effect of a flow-aligned external magnetic field on MI, with both theoretical analyses and particle-in-cell (PIC) simulations. In the limit of a cold and collisionless plasma, we derive a generalized dispersion relation for linear growth rates of the magnetized MIs. Numerical solutions of the dispersion relation reveal that the external magnetic field always suppresses the growth of MI, though MIs are much more robust against the external magnetic field than electron-scale Kelvin-Helmholtz instabilities (ESKHIs). Analyses are also extended to instabilities with an arbitrary wavevector in the shear interface plane, where coupling effect is observed for sub-relativistic scenarios. Two-dimensional PIC simulations of single-mode MIs reach a good agreement with our analytical predictions, and we observe formation of a quasi-steady saturation structure in magnetized runs. In simulations with finite temperatures, we observe the competition and cooperation between MIs and a diffusion-induced DC magnetic field.",
    "authors": [
      "Y. Guo",
      "D. Wu",
      "J. Zhang"
    ],
    "published": "2025-10-28T06:47:49Z",
    "updated": "2025-10-29T04:19:44Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.25125v1",
    "url": "https://arxiv.org/abs/2510.25125v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25125v1.pdf",
    "title": "Automated Supervised Identification of Thunderstorm Ground Enhancements   (TGEs)",
    "abstract": "Thunderstorm Ground Enhancements (TGEs) are bursts of high-energy particle fluxes detected at Earth's surface, linked to the Relativistic Runaway Electron Avalanche (RREA) mechanism within thunderclouds. Accurate detection of TGEs is vital for advancing atmospheric physics and radiation safety, but event selection methods heavily rely on expert-defined thresholds. In this study, we use an automated supervised classification approach on a newly curated dataset of 2024 events from the Aragats Space Environment Center (ASEC). By combining a Tabular Prior-data Fitted Network (TabPFN) with SHAP-based interpretability, we attain 94.79% classification accuracy with 96% precision for TGEs. The analysis reveals data-driven thresholds for particle flux increases and environmental parameters that closely match the empirically established criteria used over the last 15 years. Our results demonstrate that modest but concurrent increases across multiple particle detectors, along with strong near-surface electric fields, are reliable indicators of TGEs. The framework we propose offers a scalable method for automated, interpretable TGE detection, with potential uses in real-time radiation hazard monitoring and multi-site atmospheric research.",
    "authors": [
      "Davit Aslanyan"
    ],
    "published": "2025-10-29T03:03:55Z",
    "updated": "2025-10-29T03:03:55Z",
    "categories": [
      "physics.ins-det",
      "physics.ao-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.25047v1",
    "url": "https://arxiv.org/abs/2510.25047v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25047v1.pdf",
    "title": "Magnetic Field Line Chaos, Cantori, and Turnstiles in Toroidal Plasmas",
    "abstract": "Although magnetic field line chaos, cantori, and turnstiles underlie the physics of tokamak disruptions, runaway electron damage, stellarator non-resonant divertors, and the most important electromagnetic correction to what are called electrostatic micro-instabilities, these concepts are not well known. These concepts will be defined and applications that illustrate their importance will be discussed.",
    "authors": [
      "Allen H Boozer"
    ],
    "published": "2025-10-29T00:16:43Z",
    "updated": "2025-10-29T00:16:43Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.24861v1",
    "url": "https://arxiv.org/abs/2510.24861v1",
    "pdf_url": "https://arxiv.org/pdf/2510.24861v1.pdf",
    "title": "A Semi-Lagrangian Adaptive Rank (SLAR) Method for High-Dimensional   Vlasov Dynamics",
    "abstract": "We extend our previous work on a semi-Lagrangian adaptive rank (SLAR) integrator, in the finite difference framework for nonlinear Vlasov-Poisson systems, to the general high-order tensor setting. The proposed scheme retains the high-order accuracy of semi-Lagrangian methods, ensuring stability for large time steps and avoiding dimensional splitting errors. The primary contribution of this paper is the novel extension of the algorithm from the matrix to the high-dimensional tensor setting, which enables the simulation of Vlasov models in up to six dimensions. The key technical components include (1) a third-order high-dimensional polynomial reconstruction that scales as $O(d^2)$, providing a point-wise approximation of the solution at the foot of characteristics in a semi-Lagrangian scheme; (2) a recursive hierarchical adaptive cross approximation of high-order tensors in a hierarchical Tucker format, characterized by a tensor tree; (3) a low-complexity Poisson solver in the hierarchical Tucker format that leverages the FFT for efficiency. The computed adaptive rank kinetic solutions exhibit low-rank structures within branches of the tensor tree resulting in substantial computational savings in both storage and time. The resulting algorithm achieves a computational complexity of $O(d^4 N r^{3+\\lceil\\log_2d\\rceil})$, where $N$ is the number of grid points per dimension, $d$ is the problem dimension, and $r$ is the maximum rank in the tensor tree, overcoming the curse of dimensionality. Through extensive numerical tests, we demonstrate the efficiency of the proposed algorithm and highlight its ability to capture complex solution structures while maintaining a computational complexity that scales linearly with $N$.",
    "authors": [
      "Nanyi Zheng",
      "William A. Sands",
      "Daniel Hayes",
      "Andrew J. Christlieb",
      "Jing-Mei Qiu"
    ],
    "published": "2025-10-28T18:07:18Z",
    "updated": "2025-10-28T18:07:18Z",
    "categories": [
      "math.NA",
      "cs.NA",
      "physics.comp-ph",
      "physics.plasm-ph",
      "65M70, 65F30, 35Q83, 65Y20, 82D10"
    ],
    "primary_category": "math.NA"
  },
  {
    "arxiv_id": "2510.24618v1",
    "url": "https://arxiv.org/abs/2510.24618v1",
    "pdf_url": "https://arxiv.org/pdf/2510.24618v1.pdf",
    "title": "Distributed Inter-Strand Coupling Current Model for Finite Element   Simulations of Rutherford Cables",
    "abstract": "In this paper, we present the Distributed Inter-Strand Coupling Current (DISCC) model. It is a finite element (FE) model based on a homogenization approach enabling efficient and accurate simulation of the transient magnetic response of superconducting Rutherford cables without explicitly representing individual strands. The DISCC model reproduces the inter-strand coupling current dynamics via a novel mixed FE formulation, and can be combined with the Reduced Order Hysteretic Magnetization (ROHM) and Flux (ROHF) models applied at the strand level in order to reproduce the internal strand dynamics: hysteresis, eddy, and inter-filament coupling currents, as well as ohmic effects. We first analyze the performance of the DISCC model alone, as a linear problem. We then extend the analysis to include the internal strand dynamics that make the problem nonlinear. In all cases, the DISCC model offers a massive reduction of the computational time compared to conventional fully detailed FE models while still accounting for all types of loss, magnetization and inductance contributions. Rutherford cables homogenized with the DISCC model can be directly included in FE models of magnet cross-sections for efficient electro-magneto-thermal simulations of their transient response. We present two possible FE formulations for the implementation of the DISCC model, a first one based on the h-phi-formulation, and a second one based on the h-phi-a-formulation, which is well suited for an efficient treatment of the ferromagnetic regions in magnet cross-sections.",
    "authors": [
      "Julien Dular",
      "Alexander Glock",
      "Arjan Verweij",
      "Mariusz Wozniak"
    ],
    "published": "2025-10-28T16:45:23Z",
    "updated": "2025-10-28T16:45:23Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2501.11698v2",
    "url": "https://arxiv.org/abs/2501.11698v2",
    "pdf_url": "https://arxiv.org/pdf/2501.11698v2.pdf",
    "title": "AstroPix: A Pixelated HVCMOS Sensor for Space-Based Gamma-Ray   Measurement",
    "abstract": "A next-generation medium-energy gamma-ray telescope targeting the MeV range would address open questions in astrophysics regarding how extreme conditions accelerate cosmic-ray particles, produce relativistic jet outflows, and more. One concept, AMEGO-X, relies upon the mission-enabling CMOS Monolithic Active Pixel Sensor silicon chip AstroPix. AstroPix is designed for space-based use, featuring low noise, low power consumption, and high scalability. Desired performance of the device include an energy resolution of 5 keV (or 10% FWHM) at 122 keV and a dynamic range per-pixel of 25-700 keV, enabled by the addition of a high-voltage bias to each pixel which supports a depletion depth of 500 um. This work reports on the status of the AstroPix development process with emphasis on the current version under test, version three (v3), and highlights of version two (v2). Version 3 achieves energy resolution of 10.4 +/- 3.2% at 59.5 keV and 94 +/- 6 um depletion in a low-resistivity test silicon substrate.",
    "authors": [
      "Amanda L. Steinhebel",
      "Regina Caputo",
      "Daniel P. Violette",
      "Anthony Affolder",
      "Autumn Bauman",
      "Carolyn Chinatti",
      "Aware Deshmukh",
      "Vitaliy Fadayev",
      "Yasushi Fukazawa",
      "Manoj Jadhav",
      "Carolyn Kierans",
      "Bobae Kim",
      "Jihee Kim",
      "Henry Klest",
      "Olivia Kroger",
      "Kavic Kumar",
      "Shin Kushima",
      "Jean-Marie Lauenstein",
      "Richard Leys",
      "Forest Martinez-Mckinney",
      "Jessica Metcalfe",
      "Zachary Metzler",
      "John W. Mitchell",
      "Norito Nakano",
      "Jennifer Ott",
      "Ivan Peric",
      "Jeremy S. Perkins",
      "Max R. Rudin",
      "Taylor",
      "Shin",
      "Grant Sommer",
      "Nicolas Striebig",
      "Yusuke Suda",
      "Hiroyasu Tajima",
      "Janeth Valverde",
      "Maria Zurek"
    ],
    "published": "2025-01-20T19:23:56Z",
    "updated": "2025-10-28T16:41:13Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2510.24567v1",
    "url": "https://arxiv.org/abs/2510.24567v1",
    "pdf_url": "https://arxiv.org/pdf/2510.24567v1.pdf",
    "title": "Phase-Space Shaping in Wakefield Accelerators due to Betatron Cooling",
    "abstract": "Plasma-based accelerators are beginning to employ relativistic beams with unprecedented charge and ultrashort durations. These dense driver beams can drive wakes even in high-density plasmas ($\\gtrsim10^{19}$ cm$^{-3}$), where betatron radiation becomes increasingly important and begins to affect the dynamics of the accelerated beam. In this Letter, we show that betatron cooling leads to a strong, structuring of the phase space of the beam. This gives rise to bunched, ring-like structures with positive radial position and momentum gradients, \\emph{i.e.}, population inversion of the amplitude of oscillation. We derive the characteristic timescales for this process analytically and confirm our predictions with multi-dimensional Particle-in-Cell simulations. The radiation-dominated regime of beam dynamics fundamentally alters the acceleration process and produces self-structured beams capable of triggering coherent betatron emission in ion channels.",
    "authors": [
      "Pablo J. Bilbao",
      "Thales Silva",
      "Luis O. Silva"
    ],
    "published": "2025-10-28T15:58:10Z",
    "updated": "2025-10-28T15:58:10Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.24445v1",
    "url": "https://arxiv.org/abs/2510.24445v1",
    "pdf_url": "https://arxiv.org/pdf/2510.24445v1.pdf",
    "title": "Noise Estimation and Suppression in Quantitative EMCD Measurements",
    "abstract": "Quantitative electron magnetic circular dichroism (EMCD) in transmission electron microscopy (TEM) enables the measurement of magnetic moments with elemental and atomic site sensitivity, but its practical application is fundamentally limited by noise. This study presents a comprehensive methodology for noise estimation and suppression in EMCD measurements, demonstrated on Ti-doped barium hexaferrite lamellae. By employing a classical three-beam geometry and long-term acquisition of electron energy-loss spectra, we systematically analyze the signal-to-noise ratio (SNR) across individual energy channels using bootstrap statistics. A robust energy alignment procedure based on the neighboring Ba-M4,5 edges with an adequate energy upsampling is introduced to minimize systematic errors from energy misalignment. The impact of detector noise, particularly from CMOS-based EELS cameras, is evaluated through variance-to-mean analysis and described by the noise amplification coefficients, revealing that detector-amplified shot noise is the dominant noise source. We recommend a stricter SNR threshold for reliable EMCD detection and quantification, ensuring that critical spectral features such as the Fe-L2,3 peaks meet the requirements for quantitative analysis. The approach also provides a framework for determining the minimum electron dose necessary for valid measurements and can be generalized to scintillator-based or direct electron detectors. This work advances the reliability of EMCD as a quantitative tool for magnetic characterization at the nanoscale with unknown magnetic structures. The proposed procedures lay the groundwork for improved error handling and SNR optimization in future EMCD studies.",
    "authors": [
      "Hitoshi Makino",
      "Bernd Rellinghaus",
      "Sebastian Schneider",
      "Axel Lubk",
      "Darius Pohl"
    ],
    "published": "2025-10-28T14:08:57Z",
    "updated": "2025-10-28T14:08:57Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2402.19372v4",
    "url": "https://arxiv.org/abs/2402.19372v4",
    "pdf_url": "https://arxiv.org/pdf/2402.19372v4.pdf",
    "title": "Miniaturized magnetic-field sensor based on nitrogen-vacancy centers",
    "abstract": "The nitrogen-vacancy (NV) center in diamond is a prime candidate for quantum sensing technologies. Here, we present a fully integrated and mechanically robust fiber-based endoscopic sensor with a tip diameter of $1.25 \\mathrm{mm}$. On its tip, a direct laser writing process is used to fixate a diamond containing NV centers above the fiber's core inside a polymer structure. Additionally, a metallic direct laser-written antenna structure next to the fiber facet allows efficient microwave manipulation of NV center spins. The sensor achieves a shot-noise-limited magnetic-field sensitivity of $5.9 \\mathrm{nT}/\\sqrt{\\mathrm{Hz}}$ using a $15 \\mathrm{\\mu m}$-sized microdiamond at a microwave power of $50 \\mathrm{mW}$ and optical power of $2.15 \\mathrm{mW}$. Using lock-in techniques, we measure a sensitivity of $51.8 \\mathrm{nT}/\\sqrt{\\mathrm{Hz}}$. Furthermore, we introduce a dual-fiber concept that enables, in combination with a direct laser-written structure, independent guiding of excitation and fluorescence light and thus reduces background autofluorescence. Moreover, controlled guiding of excitation light to the diamond while avoiding sample illumination may enable operation in light-sensitive environments such as biological tissue. While the demonstrated sensitivity is achieved using a single-fiber configuration, the dual-fiber approach provides a path towards integrating smaller diamonds, where autofluorescence would otherwise limit performance. We demonstrate the capability of vector magnetic field measurements in a magnetic field as used in state-of-the-art ultracold quantum gas experiments, opening a potential field in which high resolution and high sensitivity are necessary.",
    "authors": [
      "Stefan Johansson",
      "Dennis Lönard",
      "Isabel Cardoso Barbosa",
      "Jonas Gutsche",
      "Jonas Witzenrath",
      "Artur Widera"
    ],
    "published": "2024-02-29T17:20:13Z",
    "updated": "2025-10-28T13:44:22Z",
    "categories": [
      "physics.app-ph",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "physics.app-ph"
  },
  {
    "arxiv_id": "2510.24418v1",
    "url": "https://arxiv.org/abs/2510.24418v1",
    "pdf_url": "https://arxiv.org/pdf/2510.24418v1.pdf",
    "title": "ASTAROTH: A Novel Detector for Dark Matter Direct Detection Using   Cryogenic SiPMs",
    "abstract": "The DAMA experiment's long-standing claim of dark matter detection remains a key open issue in astroparticle physics. Independent verification requires NaI(Tl)-based detectors with enhanced low-energy sensitivity. Current detectors rely on photomultiplier tubes (PMTs) which features limited detection efficiency, intrinsic radioactivity, and high noise at keV energies. ASTAROTH is an R&D project that developed a proof of concept NaI(Tl) detector where siliconphotomultipliers (SiPMs) have been used instead of PMTs, offering higher photon detection efficiency, negligible radioactivity, and, most of all, a reduction of two orders of magnitude in the dark noise. The setup includes a custom cryostat operating at approximately 80 K. We report the first characterization of an approximately 360 g NaI(Tl) crystal coupled to a 5 x 5 cm SiPM matrix, yielding 4.5 photoelectrons\\keV after crosstalk correction. This promising result demonstrates the feasibility of SiPM-based readout for NaI(Tl) and paves the way for future large-scale dark matter experiments.",
    "authors": [
      "Edoardo Martinenghi",
      "Valerio Toso",
      "Fabrizio Bruno Armani",
      "Andrea Castoldi",
      "Giuseppe Di Carlo",
      "Luca Frontini",
      "Niccolò Gallice",
      "Chiara Guazzoni",
      "Valentino Liberali",
      "Lorenzo Rutigliani",
      "Alberto Stabile",
      "Krzysztof Szczepaniec",
      "Valeria Trabattoni",
      "Andrea Zani",
      "Davide D'Angelo"
    ],
    "published": "2025-10-28T13:35:01Z",
    "updated": "2025-10-28T13:35:01Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.24347v1",
    "url": "https://arxiv.org/abs/2510.24347v1",
    "pdf_url": "https://arxiv.org/pdf/2510.24347v1.pdf",
    "title": "Physics-Informed Visual MARFE Prediction on the HL-3 Tokamak",
    "abstract": "The Multifaceted Asymmetric Radiation From the Edge (MARFE) is a critical plasma instability that often precedes density-limit disruptions in tokamaks, posing a significant risk to machine integrity and operational efficiency. Early and reliable alert of MARFE formation is therefore essential for developing effective disruption mitigation strategies, particularly for next-generation devices like ITER. This paper presents a novel, physics-informed indicator for early MARFE prediction and disruption warning developed for the HL-3 tokamak. Our framework integrates two core innovations: (1) a high-fidelity label refinement pipeline that employs a physics-scored, weighted Expectation-Maximization (EM) algorithm to systematically correct noise and artifacts in raw visual data from cameras, and (2) a continuous-time, physics-constrained Neural Ordinary Differential Equation (Neural ODE) model that predicts the short-horizon ``worsening\" of a MARFE. By conditioning the model's dynamics on key plasma parameters such as normalized density ($f_G$, derived from core electron density) and core electron temperature ($T_e$), the predictor achieves superior performance in the low-false-alarm regime crucial for control. On a large experimental dataset from HL-3, our model demonstrates high predictive accuracy, achieving an Area Under the Curve (AUC) of 0.969 for 40ms-ahead prediction. The indicator has been successfully deployed for real-time operation with updates every 1 ms. This work lays a very foundation for future proactive MARFE mitigation.",
    "authors": [
      "Qianyun Dong",
      "Rongpeng Li",
      "Zongyu Yang",
      "Fan Xia",
      "Liang Liu",
      "Zhifeng Zhao",
      "Wulyu Zhong"
    ],
    "published": "2025-10-28T12:11:26Z",
    "updated": "2025-10-28T12:11:26Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.24245v1",
    "url": "https://arxiv.org/abs/2510.24245v1",
    "pdf_url": "https://arxiv.org/pdf/2510.24245v1.pdf",
    "title": "Development and Flight Trial of a UAV-based Gamma Ray and Neutron   Detection System for Large-Area Radioactivity Mapping and Source Activity   Estimation",
    "abstract": "Advances in scintillation crystal and Silicon PhotoMultiplier (SiPM) technologies have enabled the development of compact, lightweight, and low-power radiation detectors that are suitable for integration with Unmanned Aerial Vehicles (UAVs). This integration enables efficient and cost-effective large-area radiation monitoring while minimising occupational exposure. In this work, a SiPM-based NaIL scintillation detection payload was developed, characterised, and mounted on a multirotor UAV for gamma ray and neutron source localisation and activity estimation applications. To support these capabilities, an analytic radionuclide detection efficiency model was developed and used to estimate radioactivity on the ground from aerial energy spectrum measurements. The analytic expression for the detection efficiency incorporated physical phenomena, including the branching ratio, detector solid angle, air attenuation, and intrinsic peak efficiency, leading to agreement within 10% of experimental radionuclide detection efficiencies. The UAV-based radiation detection system was physically validated through a controlled indoor live radioactive source demonstration at 1.5 m, 3 m, and 4.5 m flight heights. Using the developed ground-level radioactivity estimation method, Cs-137 and Co-60 sources were successfully localised within 0.5 m, and their activities were estimated with errors on the order of 10% or less.",
    "authors": [
      "Lysander Miller",
      "Airlie Chapman",
      "James Kennedy",
      "Richard Hebden",
      "Jeremy M. C. Brown"
    ],
    "published": "2025-10-28T09:55:07Z",
    "updated": "2025-10-28T09:55:07Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.02041v2",
    "url": "https://arxiv.org/abs/2509.02041v2",
    "pdf_url": "https://arxiv.org/pdf/2509.02041v2.pdf",
    "title": "Characterization of SiPMs at 40 K for neutrino coherent detection based   on pure CsI",
    "abstract": "Silicon photomultiplier (SiPM), as the core photoelectric sensor for coherent neutrino detection in low-temperature pure CsI, its working performance directly determines the measurement accuracy of the scintillator light yield. Our previous research has fully demonstrated the performance of pure CsI at liquid nitrogen temperature. More intriguingly, its performance is expected to be even better at 40 K. However, the performance characteristics of SiPM in the 40 K temperature range still remain to be explored. In this study, a self-developed adjustable temperature control system ranging from 30 K to 293 K was built to investigate the key performance parameters of SiPM at different temperatures, such as single photoelectron spectrum, gain, breakdown voltage, dark count rate, after-pulse, internal crosstalk, and single photoelectron resolution. Special emphasis was placed on examining the key performance parameters of SiPM in the 40 K temperature range to evaluate its feasibility for light yield measurement in this temperature range. The results show that this study obtained the parameter variation trends and optimal working conditions of 3 types of SiPM at different temperatures, thereby improving the sensitivity of the detector. This research provides important technical support for low-temperature detection in neutrino physics experiments.",
    "authors": [
      "Tao Liu",
      "Xilei Sun",
      "Fengjiao Luo",
      "Jingbo Ye",
      "Bo Zheng",
      "Cong Guo",
      "Zhilong Hou",
      "Rongbin Zhou",
      "Aiqin Gao",
      "Lei Cao",
      "Bo Zhang",
      "Sijia Han"
    ],
    "published": "2025-09-02T07:35:40Z",
    "updated": "2025-10-28T08:33:46Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1007/s41605-025-00599-5"
  },
  {
    "arxiv_id": "2508.06293v2",
    "url": "https://arxiv.org/abs/2508.06293v2",
    "pdf_url": "https://arxiv.org/pdf/2508.06293v2.pdf",
    "title": "Vertex reconstruction in the TAO experiment",
    "abstract": "The Taishan Antineutrino Observatory (TAO) is a tonne-scale gadolinium-doped liquid scintillator satellite experiment of the Jiangmen Underground Neutrino Observatory (JUNO). It is designed to measure the reactor antineutrino energy spectrum with unprecedented energy resolution, better than 2% at 1 MeV. To fully achieve its designed performance, precise vertex reconstruction is crucial. This work reports two distinct vertex reconstruction methods, the charge center algorithm (CCA) and the deep learning algorithm (DLA). We describe the efforts in optimizing and improving these two methods and compare their reconstruction performance. The results show that the CCA and DLA methods can achieve vertex position resolutions better than 20mm (bias<5mm) and 12mm (bias<1.3mm) at 1 MeV, respectively, fully meeting the requirements of the TAO experiment. The reconstruction algorithms developed in this study not only prepare the TAO experiment for its upcoming real data but also hold significant potential for application in other similar experiments.",
    "authors": [
      "Hangyu Shi",
      "Jun Wang",
      "Guofu Cao",
      "Wei Wang",
      "Yuehuan Wei"
    ],
    "published": "2025-08-08T13:12:15Z",
    "updated": "2025-10-28T08:25:44Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2410.17137v3",
    "url": "https://arxiv.org/abs/2410.17137v3",
    "pdf_url": "https://arxiv.org/pdf/2410.17137v3.pdf",
    "title": "The XLZD Design Book: Towards the Next-Generation Liquid Xenon   Observatory for Dark Matter and Neutrino Physics",
    "abstract": "This report describes the experimental strategy and technologies for XLZD, the next-generation xenon observatory sensitive to dark matter and neutrino physics. In the baseline design, the detector will have an active liquid xenon target of 60 tonnes, which could be increased to 80 tonnes if the market conditions for xenon are favorable. It is based on the mature liquid xenon time projection chamber technology used in current-generation experiments, LZ and XENONnT. The report discusses the baseline design and opportunities for further optimization of the individual detector components. The experiment envisaged here has the capability to explore parameter space for Weakly Interacting Massive Particle (WIMP) dark matter down to the neutrino fog, with a 3$\\sigma$ evidence potential for WIMP-nucleon cross sections as low as $3\\times10^{-49}\\rm\\,cm^2$ (at 40 GeV/c$^2$ WIMP mass). The observatory will also have leading sensitivity to a wide range of alternative dark matter models. It is projected to have a 3$\\sigma$ observation potential of neutrinoless double beta decay of $^{136}$Xe at a half-life of up to $5.7\\times 10^{27}$ years. Additionally, it is sensitive to astrophysical neutrinos from the sun and galactic supernovae.",
    "authors": [
      "XLZD Collaboration",
      "J. Aalbers",
      "K. Abe",
      "M. Adrover",
      "S. Ahmed Maouloud",
      "D. S. Akerib",
      "A. K. Al Musalhi",
      "F. Alder",
      "L. Althueser",
      "D. W. P. Amaral",
      "C. S. Amarasinghe",
      "A. Ames",
      "B. Andrieu",
      "N. Angelides",
      "E. Angelino",
      "B. Antunovic",
      "E. Aprile",
      "H. M. Araújo",
      "J. E. Armstrong",
      "M. Arthurs",
      "M. Babicz",
      "A. Baker",
      "M. Balzer",
      "J. Bang",
      "E. Barberio",
      "J. W. Bargemann",
      "E. Barillier",
      "A. Basharina-Freshville",
      "L. Baudis",
      "D. Bauer",
      "M. Bazyk",
      "K. Beattie",
      "N. Beaupere",
      "N. F. Bell",
      "L. Bellagamba",
      "T. Benson",
      "A. Bhatti",
      "T. P. Biesiadzinski",
      "R. Biondi",
      "Y. Biondi",
      "H. J. Birch",
      "E. Bishop",
      "A. Bismark",
      "C. Boehm",
      "K. Boese",
      "A. Bolotnikov",
      "P. Brás",
      "R. Braun",
      "A. Breskin",
      "C. A. J. Brew",
      "S. Brommer",
      "A. Brown",
      "G. Bruni",
      "R. Budnik",
      "S. Burdin",
      "C. Cai",
      "C. Capelli",
      "G. Carini",
      "M. C. Carmona-Benitez",
      "M. Carter",
      "A. Chauvin",
      "A. Chawla",
      "H. Chen",
      "J. J. Cherwinka",
      "Y. T. Chin",
      "N. I. Chott",
      "A. P. Cimental Chavez",
      "K. Clark",
      "A. P. Colijn",
      "D. J. Colling",
      "J. Conrad",
      "M. V. Converse",
      "L. J. Cooper",
      "R. Coronel",
      "D. Costanzo",
      "A. Cottle",
      "G. Cox",
      "J. J. Cuenca-García",
      "D. Curran",
      "D. Cussans",
      "V. D'Andrea",
      "L. C. Daniel Garcia",
      "I. Darlington",
      "S. Dave",
      "A. David",
      "G. J. Davies",
      "M. P. Decowski",
      "A. Deisting",
      "J. Delgaudio",
      "S. Dey",
      "C. Di Donato",
      "L. Di Felice",
      "P. Di Gangi",
      "S. Diglio",
      "C. Ding",
      "J. E. Y. Dobson",
      "M. Doerenkamp",
      "G. Drexlin",
      "E. Druszkiewicz",
      "C. L. Dunbar",
      "K. Eitel",
      "A. Elykov",
      "R. Engel",
      "S. R. Eriksen",
      "S. Fayer",
      "N. M. Fearon",
      "A. D. Ferella",
      "C. Ferrari",
      "N. Fieldhouse",
      "H. Fischer",
      "H. Flaecher",
      "T. Flehmke",
      "M. Flierman",
      "E. D. Fraser",
      "T. M. A. Fruth",
      "K. Fujikawa",
      "W. Fulgione",
      "C. Fuselli",
      "P. Gaemers",
      "R. Gaior",
      "R. J. Gaitskell",
      "N. Gallice",
      "M. Galloway",
      "F. Gao",
      "N. Garroum",
      "A. Geffre",
      "J. Genovesi",
      "C. Ghag",
      "S. Ghosh",
      "R. Giacomobono",
      "R. Gibbons",
      "F. Girard",
      "R. Glade-Beucke",
      "F. Glück",
      "S. Gokhale",
      "L. Grandi",
      "J. Green",
      "J. Grigat",
      "M. G. D. van der Grinten",
      "R. Größle",
      "H. Guan",
      "M. Guida",
      "P. Gyorgy",
      "J. J. Haiston",
      "C. R. Hall",
      "T. Hall",
      "R. Hammann",
      "V. Hannen",
      "S. Hansmann-Menzemer",
      "N. Hargittai",
      "E. Hartigan-O'Connor",
      "S. J. Haselschwardt",
      "M. Hernandez",
      "S. A. Hertel",
      "A. Higuera",
      "C. Hils",
      "K. Hiraoka",
      "L. Hoetzsch",
      "M. Hoferichter",
      "G. J. Homenides",
      "N. F. Hood",
      "M. Horn",
      "D. Q. Huang",
      "S. Hughes",
      "D. Hunt",
      "M. Iacovacci",
      "Y. Itow",
      "E. Jacquet",
      "J. Jakob",
      "R. S. James",
      "F. Joerg",
      "S. Jones",
      "A. C. Kaboth",
      "F. Kahlert",
      "A. C. Kamaha",
      "Y. Kaminaga",
      "M. Kara",
      "P. Kavrigin",
      "S. Kazama",
      "M. Keller",
      "P. Kemp-Russell",
      "D. Khaitan",
      "P. Kharbanda",
      "B. Kilminster",
      "J. Kim",
      "R. Kirk",
      "M. Kleifges",
      "M. Klute",
      "M. Kobayashi",
      "D. Kodroff",
      "D. Koke",
      "A. Kopec",
      "E. V. Korolkova",
      "H. Kraus",
      "S. Kravitz",
      "L. Kreczko",
      "B. von Krosigk",
      "V. A. Kudryavtsev",
      "F. Kuger",
      "N. Kurita",
      "H. Landsman",
      "R. F. Lang",
      "C. Lawes",
      "J. Lee",
      "B. Lehnert",
      "D. S. Leonard",
      "K. T. Lesko",
      "L. Levinson",
      "A. Li",
      "I. Li",
      "S. Li",
      "S. Liang",
      "Z. Liang",
      "J. Lin",
      "Y. -T. Lin",
      "S. Lindemann",
      "S. Linden",
      "M. Lindner",
      "A. Lindote",
      "W. H. Lippincott",
      "K. Liu",
      "J. Loizeau",
      "F. Lombardi",
      "J. A. M. Lopes",
      "M. I. Lopes",
      "W. Lorenzon",
      "M. Loutit",
      "C. Lu",
      "G. M. Lucchetti",
      "T. Luce",
      "S. Luitz",
      "Y. Ma",
      "C. Macolino",
      "J. Mahlstedt",
      "B. Maier",
      "P. A. Majewski",
      "A. Manalaysay",
      "A. Mancuso",
      "L. Manenti",
      "R. L. Mannino",
      "F. Marignetti",
      "T. Marley",
      "T. Marrodán Undagoitia",
      "K. Martens",
      "J. Masbou",
      "E. Masson",
      "S. Mastroianni",
      "C. Maupin",
      "V. Mazza",
      "C. McCabe",
      "M. E. McCarthy",
      "D. N. McKinsey",
      "J. B. McLaughlin",
      "A. Melchiorre",
      "J. Menéndez",
      "M. Messina",
      "E. H. Miller",
      "B. Milosovic",
      "S. Milutinovic",
      "K. Miuchi",
      "R. Miyata",
      "E. Mizrachi",
      "A. Molinario",
      "C. M. B. Monteiro",
      "M. E. Monzani",
      "K. Morå",
      "S. Moriyama",
      "E. Morrison",
      "E. Morteau",
      "Y. Mosbacher",
      "B. J. Mount",
      "J. Müller",
      "M. Murdy",
      "A. St. J. Murphy",
      "M. Murra",
      "A. Naylor",
      "H. N. Nelson",
      "F. Neves",
      "J. L. Newstead",
      "A. Nguyen",
      "K. Ni",
      "J. O'Dell",
      "C. O'Hare",
      "U. Oberlack",
      "M. Obradovic",
      "I. Olcina",
      "K. C. Oliver-Mallory",
      "G. D. Orebi Gann",
      "J. Orpwood",
      "S. Ouahada",
      "K. Oyulmaz",
      "B. Paetsch",
      "K. J. Palladino",
      "J. Palmer",
      "Y. Pan",
      "M. Pandurovic",
      "N. J. Pannifer",
      "S. Paramesvaran",
      "S. J. Patton",
      "Q. Pellegrini",
      "B. Penning",
      "G. Pereira",
      "R. Peres",
      "E. Perry",
      "T. Pershing",
      "F. Piastra",
      "J. Pienaar",
      "A. Piepke",
      "M. Pierre",
      "G. Plante",
      "T. R. Pollmann",
      "F. Pompa",
      "L. Principe",
      "J. Qi",
      "K. Qiao",
      "Y. Qie",
      "J. Qin",
      "S. Radeka",
      "V. Radeka",
      "M. Rajado",
      "D. Ramírez García",
      "A. Ravindran",
      "A. Razeto",
      "J. Reichenbacher",
      "C. A. Rhyne",
      "A. Richards",
      "G. R. C. Rischbieter",
      "H. S. Riyat",
      "R. Rosero",
      "A. Roy",
      "T. Rushton",
      "D. Rynders",
      "R. Saakyan",
      "L. Sanchez",
      "P. Sanchez-Lucas",
      "D. Santone",
      "J. M. F. dos Santos",
      "G. Sartorelli",
      "A. B. M. R. Sazzad",
      "A. Scaffidi",
      "R. W. Schnee",
      "J. Schreiner",
      "P. Schulte",
      "H. Schulze Eißing",
      "M. Schumann",
      "A. Schwenck",
      "A. Schwenk",
      "L. Scotto Lavina",
      "M. Selvi",
      "F. Semeria",
      "P. Shagin",
      "S. Sharma",
      "S. Shaw",
      "W. Shen",
      "L. Sherman",
      "S. Shi",
      "S. Y. Shi",
      "T. Shimada",
      "T. Shutt",
      "J. J. Silk",
      "C. Silva",
      "H. Simgen",
      "G. Sinev",
      "R. Singh",
      "J. Siniscalco",
      "M. Solmaz",
      "V. N. Solovov",
      "Z. Song",
      "P. Sorensen",
      "J. Soria",
      "O. Stanley",
      "M. Steidl",
      "T. Stenhouse",
      "A. Stevens",
      "K. Stifter",
      "T. J. Sumner",
      "A. Takeda",
      "P. -L. Tan",
      "D. J. Taylor",
      "W. C. Taylor",
      "D. Thers",
      "T. Thümmler",
      "D. R. Tiedt",
      "F. Tönnies",
      "Z. Tong",
      "F. Toschi",
      "D. R. Tovey",
      "J. Tranter",
      "M. Trask",
      "G. Trinchero",
      "M. Tripathi",
      "D. R. Tronstad",
      "R. Trotta",
      "C. D. Tunnell",
      "P. Urquijo",
      "A. Usón",
      "M. Utoyama",
      "A. C. Vaitkus",
      "O. Valentino",
      "K. Valerius",
      "S. Vecchi",
      "V. Velan",
      "S. Vetter",
      "L. de Viveiros",
      "G. Volta",
      "D. Vorkapic",
      "A. Wang",
      "J. J. Wang",
      "Y. Wang",
      "D. Waters",
      "K. M. Weerman",
      "C. Weinheimer",
      "M. Weiss",
      "D. Wenz",
      "T. J. Whitis",
      "K. Wild",
      "M. Williams",
      "M. Wilson",
      "S. T. Wilson",
      "C. Wittweg",
      "J. Wolf",
      "F. L. H. Wolfs",
      "S. Woodford",
      "D. Woodward",
      "M. Worcester",
      "C. J. Wright",
      "V. H. S. Wu",
      "S. Wüstling",
      "M. Wurm",
      "Q. Xia",
      "Y. Xing",
      "D. Xu",
      "J. Xu",
      "Y. Xu",
      "Z. Xu",
      "M. Yamashita",
      "L. Yang",
      "J. Ye",
      "M. Yeh",
      "B. Yu",
      "G. Zavattini",
      "W. Zha",
      "M. Zhong",
      "K. Zuber"
    ],
    "published": "2024-10-22T16:09:13Z",
    "updated": "2025-10-28T06:18:30Z",
    "categories": [
      "hep-ex",
      "hep-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1140/epjc/s10052-025-14810-w"
  },
  {
    "arxiv_id": "2510.24090v1",
    "url": "https://arxiv.org/abs/2510.24090v1",
    "pdf_url": "https://arxiv.org/pdf/2510.24090v1.pdf",
    "title": "Tritiated methane reduction in the PandaX-4T experiment via purge and   cryogenic distillation processes",
    "abstract": "Tritium from tritiated methane (CH$_3$T) calibration is a significant impurity that restricts the sensitivity of the PandaX-4T dark matter detection experiment in the low-energy region. The CH$_3$T removal is essential for PandaX-4T and other liquid xenon dark matter direct detection experiments, as CH$_3$T serves as a critical component for low-energy calibration. To eliminate CH$_3$T, the xenon in the detector is suitably recuperated, leaving 1.8 bar of xenon gas inside, and the detector is flushed with heated xenon gas. Concurrently, leveraging the lower boiling point of methane relative to xenon, the PandaX-4T cryogenic distillation system is effectively utilized to extract CH$_3$T from xenon after optimizing the operational parameters. Following the commissioning run, 5.7 tons of xenon are purified via the distillation method. Recent data indicate that the CH$_3$T concentration reduces from $3.6\\times10^{-24}$ mol/mol to $5.9\\times10^{-25}$ mol/mol, demonstrating that gas purging and distillation are effective in removing CH$_3$T, even at concentrations on the order of $10^{-24}$ mol/mol.",
    "authors": [
      "Shuaijie Li",
      "Zhou Wang",
      "Xiangyi Cui",
      "Li Zhao",
      "Yonglin Ju",
      "Wenbo Ma",
      "Yingjie Fan",
      "Jianglai Liu",
      "Liqiang Liu",
      "Kai Kang"
    ],
    "published": "2025-10-28T06:03:51Z",
    "updated": "2025-10-28T06:03:51Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2506.02104v3",
    "url": "https://arxiv.org/abs/2506.02104v3",
    "pdf_url": "https://arxiv.org/pdf/2506.02104v3.pdf",
    "title": "Collisionless relaxation to equilibrium distributions in cold dark   matter halos: origin of the NFW profile",
    "abstract": "Collisionless self-gravitating systems such as cold dark matter halos are known to harbor universal density profiles despite the intricate non-linear physics of hierarchical structure formation in the $\\Lambda$CDM paradigm. The origin of such states has been a persistent mystery, particularly because the physics of collisionless relaxation has remained poorly understood. To solve this long-standing problem, we develop a self-consistent quasilinear theory in action-angle space for the collisionless relaxation of inhomogeneous, self-gravitating systems by perturbing the governing Vlasov-Poisson equations. We obtain a quasilinear diffusion equation that describes the secular evolution of the mean coarse-grained distribution function $f_0$ of accreted matter in the fluctuating force field of a spherical isotropic halo. The diffusion coefficient not only depends on the fluctuation power spectrum but also on the evolving potential of the system, which reflects the self-consistency of the problem. Diffusive heating in the pre-assembled halo develops an $r^{-\\gamma}$ inner density cusp, accretion and relaxation in which develops an $r^{-\\beta}$ outer fall-off with $\\beta \\approx 5 - 2\\gamma$ in the quasi-steady state. Spherical collapse theory dictates that a quasi-steady outer halo must settle to $\\beta \\approx 3$, for which the mass enclosed within a shell barely changes with time. This implies that $\\gamma\\approx 1$, which is possible in the quasilinear framework only if (i) the pre-assembled halo harbors an $r^{-\\gamma_{\\mathrm{P}}}$ profile with $\\gamma_{\\mathrm{P}} \\gtrsim 0.5$, (ii) its fluctuations are correlated in time (red noise), and (iii) the initial value of $\\gamma$ is smaller than $1$, implying that the $r^{-1}$ cusp is a neutral equilibrium. We demonstrate for the first time how the Navarro-Frenk-White (NFW) profile emerges as a quasi-steady state of collisionless relaxation.",
    "authors": [
      "Uddipan Banik",
      "Amitava Bhattacharjee"
    ],
    "published": "2025-06-02T18:00:00Z",
    "updated": "2025-10-28T05:01:15Z",
    "categories": [
      "astro-ph.GA",
      "astro-ph.CO",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.GA"
  },
  {
    "arxiv_id": "2510.21239v2",
    "url": "https://arxiv.org/abs/2510.21239v2",
    "pdf_url": "https://arxiv.org/pdf/2510.21239v2.pdf",
    "title": "Laboratory formation of scaled astrophysical outflows",
    "abstract": "Astrophysical systems exhibit a rich diversity of outflow morphologies, yet their mechanisms and existence conditions remain among the most persistent puzzles in the field. Here we present scaled laboratory experiments based on laser-driven plasma outflow into magnetized ambient gas, which mimic five basic astrophysical outflows regulated by interstellar medium, namely collimated jets, blocked jets, elliptical bubbles, as well as spherical winds and bubbles. Their morphologies and existence conditions are found to be uniquely determined by the external Alfvenic and sonic Mach numbers Me-a and Me-s, i.e. the relative strengths of the outflow ram pressure against the magnetic/thermal pressures in the interstellar medium, with transitions occurring at Me-a ~ 2 and 0.5, as well as Me-s ~ 1. These results are confirmed by magnetohydrodynamics simulations and should also be verifiable from existing and future astronomical observations. Our findings provide a quantitative framework for understanding astrophysical outflows.",
    "authors": [
      "Shun-yi Yang",
      "Tao Tao",
      "Guang-yue Hu",
      "Chao Xiong",
      "Tian-yi Li",
      "Xue-cheng Li",
      "Hui-bo Tang",
      "Shuo-ting Shao",
      "Xiang Lv",
      "Chen Zhang",
      "Ming-yang Yu"
    ],
    "published": "2025-10-24T08:20:07Z",
    "updated": "2025-10-28T03:46:55Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.23962v1",
    "url": "https://arxiv.org/abs/2510.23962v1",
    "pdf_url": "https://arxiv.org/pdf/2510.23962v1.pdf",
    "title": "Exploring an image-based $b$-jet tagging method using convolution neural   networks",
    "abstract": "Jet flavor tagging, the identification of jets originating from $c$-quarks, $b$-quarks, and other quarks (light quarks and gluons), is a crucial task in high-energy heavy-ion physics, as it enables the investigation of flavor-dependent responses within the hot and dense nuclear medium produced in heavy-ion collisions. Recently, several methods based on deep learning techniques, such as deep neural networks and graph neural networks, have been developed. These deep-learning-based methods demonstrate significantly improved performance compared to traditional methods that rely on track impact parameters and secondary vertices. In the tagging algorithms, various properties of jets and constituent charged particles are used as input parameters. We explore a new method based on images surrounding the primary vertex, utilizing charged particles within the jet cone, which can be measured using a silicon tracking system. For this initial experimental study, we assume the ideal performance of the tracking system. To analyze these images, we employed convolutional neural networks. The image-based flavor tagging method shows an 80-90% $b$-jet tagging efficiency for jets in the transverse momentum range from 20 to 100 GeV/$c$. This approach has the potential to significantly improve the accuracy of jet flavor tagging in high-energy nuclear physics experiments.",
    "authors": [
      "Hangil Jang",
      "Sanghoon Lim"
    ],
    "published": "2025-10-28T00:37:14Z",
    "updated": "2025-10-28T00:37:14Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1007/s40042-025-01506-3"
  },
  {
    "arxiv_id": "2506.06568v2",
    "url": "https://arxiv.org/abs/2506.06568v2",
    "pdf_url": "https://arxiv.org/pdf/2506.06568v2.pdf",
    "title": "Removal of spallation-induced tritium from silicon through diffusion",
    "abstract": "Tritium, predominantly produced through spallation reactions caused by cosmic ray interactions, is a significant radioactive background for silicon-based rare event detection experiments, such as dark matter searches. We have investigated the feasibility of removing cosmogenic tritium from high-purity silicon intended for use in low-background experiments. We demonstrate that significant tritium removal is possible through diffusion by subjecting silicon to high-temperature (> 400C) baking. Using an analytical model for the de-trapping and diffusion of tritium in silicon, our measurements indicate that cosmogenic tritium diffusion constants are comparable to previous measurements of thermally-introduced tritium, with complete de-trapping and removal achievable above 750C. This approach has the potential to alleviate the stringent constraints of cosmic ray exposure prior to device fabrication and significantly reduce the cosmogenic tritium backgrounds of silicon-based detectors for next-generation rare event searches.",
    "authors": [
      "R. Saldanha",
      "D. Reading",
      "P. E. Warwick",
      "A. E. Chavarria",
      "B. Loer",
      "P. Mitra",
      "L. Pagani",
      "P. Privitera"
    ],
    "published": "2025-06-06T22:49:35Z",
    "updated": "2025-10-27T23:11:24Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1103/42zr-nbvh"
  },
  {
    "arxiv_id": "2509.20995v2",
    "url": "https://arxiv.org/abs/2509.20995v2",
    "pdf_url": "https://arxiv.org/pdf/2509.20995v2.pdf",
    "title": "Three Dimensional Theory of the Ion Channel Laser",
    "abstract": "The ion channel laser (ICL) is a plasma-based alternative to the free electron laser (FEL) that uses the electric field of a uniform-density ion channel rather than the magnetic field of an undulator to induce transverse oscillations of electrons in an ultrarelativistic bunch and thereby produce coherent radiation via a collective electromagnetic instability. The powerful focusing of the ion channel generally yields significantly higher gain parameters in the ICL as compared to the FEL. This permits lasing in extremely short distances using electron bunches with an energy spread as large as a few percent; a value readily achievable with current plasma-based accelerators. ICLs, however, impose stringent transverse phase space requirements on the electron bunch beyond what is required in FELs. In this work, we present a novel 3D theory of the planar off-axis configuration of the ICL that accounts for a number of effects including diffraction, transverse radiation profile, frequency and betatron phase detuning, and nonzero spread in energy and undulator parameter. We derive the ICL pendulum and field equations, which we use to write down the 3D Maxwell-Klimontovich equations. After linearizing, we obtain an integro-differential equation describing the $z$-evolution of the radiation field. The 3D ICL dispersion relation is obtained using a Van Kampen normal mode expansion. We numerically solve the $z$-evolution equation to compute radiation power growth rates and transverse radiation profiles over a range of different ICL parameters. We examine the gain reduction due to 3D effects, energy spread, and emittance. Electron bunch phase space and emittance requirements for lasing are derived. Finally, we make general observations about the performance and feasibility of the ICL and discuss future prospects.",
    "authors": [
      "Claire Hansel",
      "Agostino Marinelli",
      "Zhirong Huang",
      "Michael Litos"
    ],
    "published": "2025-09-25T10:46:23Z",
    "updated": "2025-10-27T23:06:58Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.21036v2",
    "url": "https://arxiv.org/abs/2510.21036v2",
    "pdf_url": "https://arxiv.org/pdf/2510.21036v2.pdf",
    "title": "LLRF System Analysis for the Fermilab PIP-II Superconducting LINAC",
    "abstract": "PIP-II is a superconducting linac that is in the initial acceleration chain for the Fermilab accelerator complex. The RF system consists of a warm front-end with an RFQ and buncher cavities along with 25 superconducting cryo-modules comprised of cavities with five different acceleration \\(\\beta\\). The LLRF system for the linac has to provide field and resonance control for a total of 125 RF cavities. Various components of the LLRF system have been tested with and without beam at the PIP-II test stands. The LLRF system design is derived from the LCLS-II project with its self-excited loop architecture used in the majority of the cryo-modules. The PIP-II beam loading at 2 mA is much higher than the LCLS-II linac. The control system architecture is analyzed and evaluated for the operational limits of feedback gains and their ability to meet the project regulation requirements for cavity field amplitude and phase regulation.",
    "authors": [
      "P. Varghese",
      "S. Raman",
      "M. Guran",
      "L. Reyes",
      "L. Doolittle",
      "Q. Du",
      "S. Murthy"
    ],
    "published": "2025-10-23T22:40:26Z",
    "updated": "2025-10-27T22:26:35Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2506.18830v4",
    "url": "https://arxiv.org/abs/2506.18830v4",
    "pdf_url": "https://arxiv.org/pdf/2506.18830v4.pdf",
    "title": "Wave Topology in Hall MHD",
    "abstract": "Hall Magnetohydrodynamics (HMHD) extends ideal MHD by incorporating the Hall effect via the induction equation, making it more accurate for describing plasma behavior at length scales below the ion skin depth. Despite its importance, a comprehensive description of the eigenmodes in HMHD has been lacking. In this work, we derive the complete spectrum and eigenvectors of HMHD waves and identify their underlying topological structure. We prove that the HMHD wave spectrum is homotopic to that of ideal MHD, consisting of three distinct branches: the slow magnetosonic-Hall waves, the shear Alfv\\'en-Hall waves, and the fast magnetosonic-Hall waves, which continuously reduce to their ideal MHD counterparts in the limit of vanishing Hall parameter. Contrary to a recent claim, we find that HMHD does not admit any additional wave branches beyond those in ideal MHD. The key qualitative difference lies in the topological nature of the HMHD wave structure: it exhibits nontrivial topology characterized by a Weyl point-an isolated eigenmode degeneracy point-and associated nonzero Chern numbers of the eigenmode bundles over a 2-sphere in k-space surrounding the Weyl point.",
    "authors": [
      "Alejandro Mesa Dame",
      "Hong Qin",
      "Eric Palmerduca",
      "Yichen Fu"
    ],
    "published": "2025-06-23T16:46:34Z",
    "updated": "2025-10-27T20:57:42Z",
    "categories": [
      "physics.plasm-ph",
      "76W05, 57R22"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1103/c8dk-38fw"
  },
  {
    "arxiv_id": "2510.23839v1",
    "url": "https://arxiv.org/abs/2510.23839v1",
    "pdf_url": "https://arxiv.org/pdf/2510.23839v1.pdf",
    "title": "Hyperspectral Reconstruction using Discrete LED-Structured Illumination",
    "abstract": "We consider the use of digital signal processing to reconstruct continuous reflectance spectra using a small finite set of randomly illuminated light emitting diodes (LEDs). We simulate the use of LEDs having identical spectral distance and Gaussian bandwidth whose illumination overlaps its nearest neighbors. An object, whose reflectance spectrum is to be determined, is illuminated by a series of random spectral patterns consisting of randomly chosen LEDs with random intensity. We quantify the information within the illumination patterns using the singular value decomposition (SVD) and reconstruct reflectance spectra, specifically hemoglobin and several green vegetation spectra using the pseudoinverse of the SVD for a given amount of noise. We show that for sparse plant spectra, it is possible to reconstruct the continuous green vegetation spectra with RMSE less than 1% with as few as 25 LEDs. Our study demonstrates that reconstructing sparse reflectance spectra based on random structured illumination can enable low-cost LED-based cameras to perform equally well as expensive cameras, especially for dedicated applications.",
    "authors": [
      "John C. Howell",
      "Pieter H. Neethling",
      "Tjaart P. J. Kruger"
    ],
    "published": "2025-10-27T20:23:43Z",
    "updated": "2025-10-27T20:23:43Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2509.19794v2",
    "url": "https://arxiv.org/abs/2509.19794v2",
    "pdf_url": "https://arxiv.org/pdf/2509.19794v2.pdf",
    "title": "Controls Abstraction Towards Accelerator Physics: A Middle Layer Python   Package for Particle Accelerator Control",
    "abstract": "Control system middle layers act as a co-ordination and communication bridge between end users, including operators, system experts, scientists, and experimental users, and the low-level control system interface. This article describes a Python package -- Controls Abstraction Towards Acclerator Physics (CATAP) -- which aims to build on previous experience and provide a modern Python-based middle layer with explicit abstraction, YAML-based configuration, and procedural code generation. CATAP provides a structured and coherent interface to a control system, allowing researchers and operators to centralize higher-level control logic and device information. This greatly reduces the amount of code that a user must write to perform a task, and codifies system knowledge that is usually anecdotal. The CATAP design has been deployed at two accelerator facilities, and has been developed to produce a procedurally generated facility-specific middle layer package from configuration files to enable its wider dissemination across other machines.",
    "authors": [
      "M. King",
      "A. D. Brynes",
      "F. Jackson",
      "J. K. Jones",
      "N. Ziyan",
      "M. A. Johnson",
      "K. Baker",
      "D. J. Scott",
      "E. Yang",
      "T. Kabana",
      "C. Garnier",
      "S. Chowdhury",
      "N. Neveu",
      "R. Roussel"
    ],
    "published": "2025-09-24T06:28:18Z",
    "updated": "2025-10-27T19:25:05Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.09581v2",
    "url": "https://arxiv.org/abs/2510.09581v2",
    "pdf_url": "https://arxiv.org/pdf/2510.09581v2.pdf",
    "title": "Optimal Binning for Small-Angle Neutron Scattering Data Using the   Freedman-Diaconis Rule",
    "abstract": "Small-Angle Neutron Scattering (SANS) data analysis often relies on fixed-width binning schemes that overlook variations in signal strength and structural complexity. We introduce a statistically grounded approach based on the Freedman-Diaconis (FD) rule, which minimizes the mean integrated squared error between the histogram estimate and the true intensity distribution. By deriving the competing scaling relations for counting noise ($\\propto h^{-1}$) and binning distortion ($\\propto h^{2}$), we establish an optimal bin width that balances statistical precision and structural resolution. Application to synthetic data from the Debye scattering function of a Gaussian polymer chain demonstrates that the FD criterion quantitatively determines the most efficient binning, faithfully reproducing the curvature of $I(Q)$ while minimizing random error. The optimal width follows the expected scaling $h_{\\mathrm{opt}} \\propto N_{\\mathrm{total}}^{-1/3}$, delineating the transition between noise- and resolution-limited regimes. This framework provides a unified, physics-informed basis for adaptive, statistically efficient binning in neutron scattering experiments.",
    "authors": [
      "Jessie E. An",
      "Chi-Huan Tung",
      "Changwoo Do",
      "Wei-Ren Chen"
    ],
    "published": "2025-10-10T17:36:15Z",
    "updated": "2025-10-27T18:13:37Z",
    "categories": [
      "physics.data-an",
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.data-an"
  },
  {
    "arxiv_id": "2510.23690v1",
    "url": "https://arxiv.org/abs/2510.23690v1",
    "pdf_url": "https://arxiv.org/pdf/2510.23690v1.pdf",
    "title": "Quantum Kinetic Modeling of KEEN waves in a Warm-Dense Regime",
    "abstract": "We report a fully kinetic, quantum study of Kinetic Electrostatic Electron Nonlinear (KEEN) waves, showing that quantum diffraction systematically erodes the classical trapping mechanism, narrow harmonic locking to the fundamental, and hasten post-drive decay. Electrons are evolved with a second-order Strang-split 1D1V Wigner-Poisson solver that couples conservative semi-Lagrangian WENO advection to an analytic Fourier space update for the non-local Wigner term, while ions remain classical. Short, frequency-tuned ponderomotive pulses drive KEEN formation in a uniform Maxwellian plasma; as the dimensionless quantum parameter H rises from the classical limit to values relevant to warm-dense matter, doped semiconductors, and 2D electron systems, the drive threshold increases, higher harmonics are damped, trapped electron vortices diffuse, and the subplasma electrostatic energy relaxes to a lower stationary level, as confirmed by continuous wavelet analysis. These microscopic changes carry macroscopic weight. Ignition-scale capsules now compress matter to regimes where the electron de Broglie wavelength rivals the Debye length, making classical kinetic descriptions insufficient. By extending KEEN physics into this quantum domain, our results offer a potential diagnostic of nonequilibrium electron dynamics for next-generation inertial-confinement designs and high-energy-density platforms, indicating that predictive fusion modeling may benefit from the integration of kinetic fidelity with quantum effects.",
    "authors": [
      "F. Alejandro Padilla-Gomez",
      "Sining Gong",
      "Michael S. Murillo",
      "F. R. Graziani",
      "Andrew J. Christlieb"
    ],
    "published": "2025-10-27T17:34:42Z",
    "updated": "2025-10-27T17:34:42Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.23562v1",
    "url": "https://arxiv.org/abs/2510.23562v1",
    "pdf_url": "https://arxiv.org/pdf/2510.23562v1.pdf",
    "title": "Design of Backscatter Tailored Optical Fibers for distributed magnetic   field sensing using Fiber Optic Pulsed Polarimetry",
    "abstract": "Fiber optic pulsed polarimetry is a LIDAR-like fiber sensing technique that uses a backscatter enhanced single mode backscatter-tailored optical fiber(BTOF) to measure the distributed B fields on all Magnetic Fusion Energy devices. The BTOF has a series of wavelength resonant reflection fiber Bragg gratings written uniformly along its length. The fiber's Verdet constant determines the strength of the Faraday effect which effectuates the measurement of local B along the fiber placed intimately next to or within a magnetized plasma volume. A robust measurement of the field distribution along the fiber is obtained at high rep rates, 5 MHz, high spatial resolution(1-10cm), high B field accuracy(<1%) and temporal response (ns). Multipathing in the BTOF produces 3rd order reflections that contaminate the LIDAR signal. Algorithms are given for calculating the level of contamination for uniform and flat reflection designs, in particular and any reflection series in general. The contamination is bracketed giving confidence in designing and implementing a BTOF. Applications include magnetic fusion devices, rail guns, high temperature superconducting magnets and magnetized target fusion research.",
    "authors": [
      "Roger J Smith"
    ],
    "published": "2025-10-27T17:33:05Z",
    "updated": "2025-10-27T17:33:05Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.23417v1",
    "url": "https://arxiv.org/abs/2510.23417v1",
    "pdf_url": "https://arxiv.org/pdf/2510.23417v1.pdf",
    "title": "Filling the Gap: Atom Probe Tomography of Porous Structures Enabled by   Site Specific SEMGlu Curing",
    "abstract": "Porous microstructures, while central to many functional materials, remain difficult to characterize quantitatively by atom probe tomography (APT). Although several strategies have been proposed over the past decade, most remain constrained by significant practical or technical limitations. Here, we introduce an in situ pore filling approach that integrates seamlessly into conventional specimen preparation workflows. The method employs a vacuum compatible resin that is rapidly cured by the electron beam during standard ion beam based preparation, eliminating the need for additional instrumentation or extensive sample handling. We demonstrate the effectiveness of this approach using a porous SnSe + MXene electrode, a material system otherwise difficult to analyze via APT characterisation. This method offers a robust, accessible solution for extending APT analysis to porous materials",
    "authors": [
      "Lukas Worch",
      "James O. Douglas",
      "Kavin Arunasalam",
      "Baptiste Gault",
      "Valeria Nicolosi",
      "Michele Shelly Conroy"
    ],
    "published": "2025-10-27T15:22:09Z",
    "updated": "2025-10-27T15:22:09Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.23229v1",
    "url": "https://arxiv.org/abs/2510.23229v1",
    "pdf_url": "https://arxiv.org/pdf/2510.23229v1.pdf",
    "title": "Validation of field cage and cathode for low radioactivity operation   with the CYGNO experiment",
    "abstract": "Dark matter, which is considered to account for approximately the 27% of the Universe's energy-mass content, remains an open issue in modern particle physics along with its composition. The CYGNO Experiment aims to exploit an innovative approach applied to the direct detection search of low energy nuclear recoils possibly induced by cold particle-like dark matter candidates. CYGNO employs a directional detector based on a Time Projection Chamber (TPC) filled with a He:CF$_{4}$ gas mixture and equipped with an optical readout. Currently, the CYGNO Collaboration is constructing the detector demonstrator, CYGNO-04, in Hall F at Laboratori Nazionali del Gran Sasso (LNGS). This 0.4 m$^3$ detector has the goal of proving the scalability of the technology and assessing the physics and radiopurity capabilities. Given the low radioactivity requirements, especially in internal components such as field cage and cathode, the reduction of material while keeping the correct electrical behavior is paramount. In this paper, we present the validation of several internal components, mainly focusing on the field cage material and support structure. The tests included geometrical asymmetries in the electric field response, collection efficiency as well as measurement of known physical quantities. A preferred configuration is found with a structure based on Nylon material which supports a PET or Kapton sheet with copper strips deposited on.",
    "authors": [
      "F. D. Amaro",
      "R. Antonietti",
      "E. Baracchini",
      "L. Benussi",
      "S. Bianco",
      "A. Biondi",
      "C. Capoccia",
      "M. Caponero",
      "L. G. M. de Carvalho",
      "G. Cavoto",
      "I. A. Costa",
      "A. Croce",
      "M. D'Astolfo",
      "G. D'Imperio",
      "E. Danè",
      "G. Dho",
      "E. Di Marco",
      "J. M. F. dos Santos",
      "D. Fiorina",
      "F. Iacoangeli",
      "Z. Islam",
      "E. Kemp",
      "H. P. Lima Jr",
      "G. Maccarrone",
      "R. D. P. Mano",
      "D. J. G. Marques",
      "G. Mazzitelli",
      "A. G. McLean",
      "P. Meloni",
      "A. Messina",
      "C. M. B. Monteiro",
      "R. A. Nobrega",
      "I. F. Pains",
      "E. Paoletti",
      "L. Passamonti",
      "F. Petrucci",
      "S. Piacentini",
      "D. Piccolo",
      "D. Pierluigi",
      "D. Pinci",
      "A. Prajapati",
      "F. Renga",
      "F. Rosatelli",
      "A. Russo",
      "G. Saviano",
      "P. A. O. C. Silva",
      "N. J. Spooner",
      "R. Tesauro",
      "S. Tomassini",
      "S. Torelli",
      "D. Tozzi"
    ],
    "published": "2025-10-27T11:28:41Z",
    "updated": "2025-10-27T11:28:41Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.23134v1",
    "url": "https://arxiv.org/abs/2510.23134v1",
    "pdf_url": "https://arxiv.org/pdf/2510.23134v1.pdf",
    "title": "THz mixing of high-order harmonics using $YBa_2Cu_3O_{7-δ}$   nanobridges",
    "abstract": "Superconducting materials are a key for technologies enabling a large number of devices including THz wave mixers and single photon detectors, though limited at very low temperatures for conventional superconductors. High temperature operation could in principle be offered using cuprate superconductors. However, the complexity of the material in thin film form, the extremely short coherence length and material stability, have hindered the realization of THz devices working at liquid nitrogen temperatures. $YBa_2Cu_3O_{7-{\\delta}}$ (YBCO) nanodevices have demonstrated non-linear properties typical of Josephson-like behavior, which have the potential for the mixing of AC signals in the THz range due to the large superconducting energy gap. Here, we present AC Josephson functionalities for terahertz waves utilizing Abrikosov vortex motion in nanoscale-confined fully planar YBCO thin film bridges. We observe Shapiro step-like features in the current voltage characteristics when irradiating the device with monochromatic sub-THz waves (100 GHz to 215 GHz) at 77 K. We further explore these nonlinear effects by detecting THz high-order harmonic mixing for signals from 200 GHz up to 1.4 THz using a local oscillator at 100 GHz. Our results open a path to an easy-fabricated HTS nonlinear nanodevice based on dimensional confinement suitable for terahertz applications.",
    "authors": [
      "Núria Alcalde-Herraiz",
      "Alessia Garibaldi",
      "Karn Rongrueangkul",
      "Alexei Kalaboukhov",
      "Floriana Lombardi",
      "Sergey Cherednichenko",
      "Thilo Bauch"
    ],
    "published": "2025-10-27T09:15:02Z",
    "updated": "2025-10-27T09:15:02Z",
    "categories": [
      "cond-mat.supr-con",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.supr-con"
  },
  {
    "arxiv_id": "2509.21417v2",
    "url": "https://arxiv.org/abs/2509.21417v2",
    "pdf_url": "https://arxiv.org/pdf/2509.21417v2.pdf",
    "title": "Coherently Enhanced Axion-Photon Conversion via Seeded Photons for   Short-Pulse Axion Detection",
    "abstract": "We propose a seeded axion-photon conversion scheme to enhance the sensitivity of light-shining-through-a-wall (LSW) experiments for axion detection, where the axions are generated from short pulse lasers and the usual resonant cavity is not applicable. By injecting a weak, coherent seed electromagnetic (EM) field into the axion-photon conversion region, the axion-induced EM field can constructively interfere with the seed field, amplifying the number of regenerated photons to a level exceeding that of the unseeded scenario. We evaluate the expected signal enhancement, statistical limits from Poisson counting with seed fluctuations and background, and the potential improvement in coupling sensitivity. Compared to a standard LSW setup, the seeded scheme can achieve orders-of-magnitude higher photon yield per axion, potentially surpassing resonance-enhanced experiments in certain parameter regimes. This approach presents a promising pathway to extend the reach of laboratory axion searches, particularly in scenarios where the resonant cavities are impractical.",
    "authors": [
      "Xiangyan An",
      "Min Chen",
      "Jianglai Liu",
      "Yipeng Wu",
      "Peng Yuan",
      "Wenchao Yan",
      "Boyuan Li",
      "Feng Liu",
      "Zhengming Sheng",
      "Jie Zhang"
    ],
    "published": "2025-09-25T05:39:59Z",
    "updated": "2025-10-27T08:50:13Z",
    "categories": [
      "hep-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "hep-ph"
  }
]