{
  "arxiv_id": "2501.11029v2",
  "url": "https://arxiv.org/abs/2501.11029v2",
  "pdf_url": "https://arxiv.org/pdf/2501.11029v2.pdf",
  "title": "Laser-induced plasma formation and cavitation in water: from nanoeffects to extreme states of matter",
  "abstract": "We present an in-depth analysis of the energy dependence of optical breakdown in water by tightly focused laser pulses, from plasma formation to shock waves and cavitation. Laser pulses of fs to ns durations and UV to IR wavelengths are aberration-free focused through microscope objectives. Photography captures luminescent plasmas with submicrometer resolution, and bubble threshold and size are determined via probe beam scattering. The energy dependence of mechanical effects is quantified through the maximum bubble radius Rmax. We find three key scenarios depicting the interaction between multiphoton and avalanche ionization, recombination, and thermal ionization from nanoeffects near threshold to extreme energy densities. They include a previously unknown scenario that emerges with single-longitudinal-mode UV ns pulses from compact lasers. It enables cost-effective creation of nanoeffects, as demonstrated on corneal tissue and glass. High-resolution photography reveals new insights in the spatiotemporal dynamics of plasma formation, with an interplay of breakdown waves, string formation by local instabilities of avalanche ionization, and radiative energy transport. Plasma volume data from photographs together with absorption measurements show that the average energy density of luminescent fs and ns plasmas is similar, ranging between 10 and 40 kJ/cm^3 . However, small hot regions with up to 400 kJ/cm^3 are formed in ns breakdown. From the hot regions, energy is spread out via X-ray bremsstrahlung, forming a luminescent halo. Well above threshold, Rmax scales with E^(1/3) across all scenarios, with 15% - 20% conversion of laser energy into bubble energy. With increasing plasma energy density, an ever-larger energy fraction is converted into shock wave energy (75% at 40 kJ/cm^3 ). The results provide guidelines for parameter selection in laser surgery and material processing.",
  "authors": [
    "Norbert Linz",
    "Sebastian Freidank",
    "Xiao-Xuan Liang",
    "Alfred Vogel"
  ],
  "published": "2025-01-19T12:35:05Z",
  "updated": "2026-01-15T15:02:05Z",
  "categories": [
    "physics.flu-dyn",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.flu-dyn",
  "doi": "10.1088/1361-6633/adedb3"
}