{
  "arxiv_id": "2601.09963v1",
  "url": "https://arxiv.org/abs/2601.09963v1",
  "pdf_url": "https://arxiv.org/pdf/2601.09963v1.pdf",
  "title": "Near-Unity-Efficiency Gas Gratings for Ultraviolet, Visible, and Infrared High-Power Lasers",
  "abstract": "Interfering deep ultraviolet (DUV) lasers can induce substantial density modulations in an ozone-doped gas flow via photochemical reactions, creating volume diffraction gratings. These transient optics are immune to target debris and shrapnel and feature orders-of-magnitude higher damage thresholds than conventional solid optics, providing a promising method for efficiently manipulating high-energy lasers. In this work, we describe gas gratings that can efficiently diffract probe beams across a variety of wavelengths and pulse durations, ranging from deep ultraviolet to near-infrared and from nanosecond to femtosecond, achieving a full beam diffraction efficiency up to 99% while preserving the focusability and wavefront quality. In addition, we present a comprehensive characterization of the performance of the gas gratings under various experimental conditions, including imprint fluence, gas composition, and grating geometries, showing significant enhancement of this process with the addition of carbon dioxide. We also demonstrate stable performance over hours of operation. Our results validate a previously developed theoretical model and suggest optimal parameters to efficiently scale gas gratings to high-energy applications.",
  "authors": [
    "Ke Ou",
    "Harsha Rajesh",
    "Sida Cao",
    "Debolina Chakraborty",
    "Victor M. Perez-Ramirez",
    "Devdigvijay Singh",
    "Caleb Redshaw",
    "Pelin Dedeler",
    "Albertine Oudin",
    "Eugene Kur",
    "Michelle M. Wang",
    "Julia M. Mikhailova",
    "Livia Lancia",
    "Caterina Riconda",
    "Pierre Michel",
    "Matthew R. Edwards"
  ],
  "published": "2026-01-15T00:56:13Z",
  "updated": "2026-01-15T00:56:13Z",
  "categories": [
    "physics.optics",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.optics"
}