[
  {
    "arxiv_id": "2601.10509v2",
    "url": "https://arxiv.org/abs/2601.10509v2",
    "pdf_url": "https://arxiv.org/pdf/2601.10509v2.pdf",
    "title": "Reply to \"Comment on Nuclear Fusion 66, 016012 (2026) by Richard Fitzpatrick, A Simple Model of Current Ramp-Up and Ramp-Down in Tokamaks\" by A.H. Boozer",
    "abstract": "This report is a follow up to my paper \"A simple model of current ramp-up and ramp-down in tokamaks\" [Nucl. Fusion 66, 016012 (2026)] in the light of comments on the paper recently made by Dr. A.H. Boozer (arXiv:2601.05977).",
    "authors": [
      "Richard Fitzpatrick"
    ],
    "published": "2026-01-15T15:34:42Z",
    "updated": "2026-01-16T15:41:26Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.11361v1",
    "url": "https://arxiv.org/abs/2601.11361v1",
    "pdf_url": "https://arxiv.org/pdf/2601.11361v1.pdf",
    "title": "Vacuum in Accelerators for Mechanical & Materials Engineering",
    "abstract": "Vacuum systems are an intrinsic part of any accelerator around the world: all particles circulate under vacuum. This lecture gives rudiments on the fundamentals of vacuum science such as units, ideal gas law, partial pressure, mean free path, flow of molecules, conductance, pumping speed, and outgassing. An overview of standard vacuum instruments for pressure measurement and pumping is presented. Finally, the specificities of accelerator vacuum systems are introduced, discussing some design, construction, installation, and commissioning aspects, as well as fundamentals of beam-vacuum interactions with synchrotron radiation and electron cloud.",
    "authors": [
      "Vincent Baglin"
    ],
    "published": "2026-01-16T15:17:37Z",
    "updated": "2026-01-16T15:17:37Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.16630v4",
    "url": "https://arxiv.org/abs/2512.16630v4",
    "pdf_url": "https://arxiv.org/pdf/2512.16630v4.pdf",
    "title": "Photon Accelerator in Magnetized Plasma",
    "abstract": "Strong magnetic fields and plasmas are intrinsically linked in both terrestrial laboratory experiments and in space phenomena. One of the most profound consequences of that is the change in relationship between the frequency and the wave number of electromagnetic waves propagating in plasma in the presence of such magnetic fields when compared to the case without these fields. Furthermore, magnetic fields alter electromagnetic wave interaction with relativistic plasma waves, resulting in different outcomes for particle and radiation generation. For a relativistic plasma wave-based photon acceleration this leads to an increased frequency gain, and, thus, potentially to higher efficiency. The influence of a magnetic field leads to quantitative and qualitative change in the properties of photon acceleration, amplifying the increase in the electromagnetic wave frequency.",
    "authors": [
      "Sergei Bulanov",
      "Stepan Bulanov",
      "Timur Esirkepov",
      "Gianluca Gregori",
      "Gabriele Grittani",
      "Marcel Lamač",
      "Brandon Russell",
      "Alec Thomas",
      "Petr Valenta"
    ],
    "published": "2025-12-18T15:06:33Z",
    "updated": "2026-01-16T14:47:21Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.11302v1",
    "url": "https://arxiv.org/abs/2601.11302v1",
    "pdf_url": "https://arxiv.org/pdf/2601.11302v1.pdf",
    "title": "Introduction to the Mechanical Design of Accelerators",
    "abstract": "Particle accelerators represent some of the most sophisticated engineering achievements of our time. Their construction requires a unique combination of physics insight and mechanical engineering expertise. The aim of this paper is to provide young mechanical engineers with an introduction to the principles, methods, and challenges associated with the mechanical design of accelerators. The lecture upon which this proceeding is based emphasized the translation of functional requirements into engineering specifications, the critical importance of robust and reliable design, and the need for precisely defined drawings supported by international standards such as ISO GPS and GD&T. Through illustrative examples and a practical case inspired by CERN's existing components, the paper underlines the necessity of anticipating lifecycle demands, ensuring manufacturability, and safeguarding operational reliability. Particular emphasis is placed on the contractual value of 2D drawings, the practical application of functional dimensioning, and tolerance chain analysis. By reviewing common pitfalls and exploring best practices, the paper seeks to orient engineers towards design choices that balance cost, reliability, and performance.",
    "authors": [
      "Marc Timmins"
    ],
    "published": "2026-01-16T13:56:30Z",
    "updated": "2026-01-16T13:56:30Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.11276v1",
    "url": "https://arxiv.org/abs/2601.11276v1",
    "pdf_url": "https://arxiv.org/pdf/2601.11276v1.pdf",
    "title": "A new class of special functions arising in plasma linear susceptibility tensor calculations",
    "abstract": "We investigate some fundamental properties of a peculiar class of special functions strictly related to Bessel, Anger and Weber functions, whose introduction was originally motivated by linear susceptibility tensor calculations in a hot, magnetised plasma. We show that these functions are solutions of an inhomogeneous Bessel ODE, with specified initial conditions and a distinct right-hand-side term fulfilling the Nielsen's requirement. Beside deriving recurrence relations and an alternative representation involving incomplete Anger-Weber functions, we show that these functions admit a simple series expansion in terms of Bessel functions of integer order, obtained by resorting to the Jacobi-Anger formula. In plasma applications this eventually leads to expressions involving infinite sums of products of Bessel functions, not particularly apt to numerical evaluation ought to their slow convergence rate when the particle's gyro-radius is larger than the wavelength. By exploiting the previously determined recurrence properties of the new class of functions we present a particularly simple derivation of the linear susceptibility tensor that enables to avoid this inconvenience.",
    "authors": [
      "Roberto Ricci"
    ],
    "published": "2026-01-16T13:21:17Z",
    "updated": "2026-01-16T13:21:17Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.09458v2",
    "url": "https://arxiv.org/abs/2601.09458v2",
    "pdf_url": "https://arxiv.org/pdf/2601.09458v2.pdf",
    "title": "Breakeven in Nuclear Fusion via Electron-Free Target",
    "abstract": "Nuclear fusion promises a nearly limitless energy source, but achieving breakeven-where fusion output exceeds input-requires extreme plasma conditions and complex confinement systems. Here we propose an alternative approach based on beam-target interactions, introducing a simple energy-based criterion that compares fusion energy generation with energy loss. By creating electron-free targets, stopping power is drastically reduced, enabling conditions where fusion energy surpasses beam energy deposition under practical scenarios. This approach offers a viable alternative pathway to fusion energy without high-temperature plasma confinement and warrants further experimental investigation.",
    "authors": [
      "Tadafumi Kishimoto"
    ],
    "published": "2026-01-14T13:04:45Z",
    "updated": "2026-01-16T12:27:02Z",
    "categories": [
      "nucl-ex",
      "physics.plasm-ph"
    ],
    "primary_category": "nucl-ex"
  },
  {
    "arxiv_id": "2508.13858v5",
    "url": "https://arxiv.org/abs/2508.13858v5",
    "pdf_url": "https://arxiv.org/pdf/2508.13858v5.pdf",
    "title": "Numerical simulations of a RF-RF hybrid plasma torch with argon at atmospheric pressure",
    "abstract": "We report numerical results regarding the minimum sustaining coil excitation current for a RF-RF hybrid torch operating at two different frequencies. The first coil is excited at a high-frequency, while the second coil is set at a medium frequency. The filling gas is argon, at atmospheric pressure. We use the modeling software COMSOL Multiphysics to describe the evolution of key parameters when: (i) the distance between the two coils changes, (ii) the power of the high frequency coil changes. We discuss the radial temperature profiles, the axial velocities and the heat convected at the end of the medium-frequency coil. The latter is compared with the total heat conduction to the plasma confinement tube wall.",
    "authors": [
      "Loann Terraz",
      "Biruk Alemu",
      "Santiago Eizaguirre"
    ],
    "published": "2025-08-19T14:17:59Z",
    "updated": "2026-01-16T11:10:56Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.46298/ops.16373"
  },
  {
    "arxiv_id": "2412.09971v2",
    "url": "https://arxiv.org/abs/2412.09971v2",
    "pdf_url": "https://arxiv.org/pdf/2412.09971v2.pdf",
    "title": "Limitations of emittance and source size measurement of laser-accelerated electron beams using the pepper-pot mask method",
    "abstract": "The pepper-pot method is a widely used technique, originally proposed for measuring the emittance of space-charge-dominated electron beams from radio-frequency photoinjectors. With recent advances in producing high-brightness electron beams via laser wakefield acceleration (LWFA), the method has also been applied to evaluate emittance in this new regime. Here, the limitations of this method for measuring the emittance of LWFA electron beams are investigated, particularly in parameter regimes where the true beam emittance is overestimated. Conducting an experiment at the JETi200 laser system, we measured an upper bound for the geometric beam emittance of $(26.2 \\pm 7.3)$ $μ$m mrad using the pepper-pot method. This result is consistent with GEANT4 Monte Carlo simulation of the pepper-pot diagnostic, with an input beam-emittance parameter that matches both PIC simulations of the laser-plasma accelerator and an independent measurement using the transient optical grating method.",
    "authors": [
      "F. C. Salgado",
      "A. Kozan",
      "D. Seipt",
      "D. Hollatz",
      "P. Hilz",
      "M. Kaluza",
      "A. Sävert",
      "A. Seidel",
      "D. Ullmann",
      "Y. Zhao",
      "M. Zepf"
    ],
    "published": "2024-12-13T08:58:42Z",
    "updated": "2026-01-16T11:08:17Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.11014v1",
    "url": "https://arxiv.org/abs/2601.11014v1",
    "pdf_url": "https://arxiv.org/pdf/2601.11014v1.pdf",
    "title": "Study of circular cross-section plasmas in HL-2A tokamak: MHD equilibrium, stability and operational \\b{eta} limit",
    "abstract": "Circular cross-section plasma is the most basic form of tokamak plasma and the fundamental configuration for magnetic confinement fusion experiments. Based on the HL-2A limiter discharge experiments, the magnetohydrodynamic (MHD) equilibrium and MHD instability of circular cross-section tokamak plasmas are investigated in this work. The results show that when q_0=0.95, the internal kink mode of m/n=1/1 is always unstable. The increase in plasma \\b{eta} (the ratio of thermal pressure to magnetic pressure) can lead to the appearance of external kink modes. The combination of axial safety factor q_0 and edge safety factor q_a determines the equilibrium configuration of the plasma and also affects the MHD stability of the equilibrium, but its growth rate is also related to the size of \\b{eta}. Under the condition of q_a>2 and q_0 slightly greater than 1, the internal kink mode and surface kink mode can be easily stabilized. However the plasma becomes unstable again and the instability intensity increases as q_0 continues to increase when q_0 exceeds 1. As the poloidal beta (\\b{eta}_p) increases, the MHD instability develops, the equilibrium configuration of MHD elongates laterally, and the Shafranov displacement increases, which in turn has the effect on suppressing instability. Calculations have shown that the maximum \\b{eta} value imposed by the ideal MHD mode in a plasma with free boundary in tokamak experiments is proportional to the normalized current I_N (I_N=I_p (MA)/a(m)B_0 (T)), and the achievable maximum beta \\b{eta}(max) is calibrated to be 2.01I_N,i.e. \\b{eta}(max)~2.01I_N. The operational \\b{eta} limit of HL-2A circular cross-section plasma is approximately \\b{eta}_N^c~2.0. Too high a value of q_0 is not conducive to MHD stability and leads the \\b{eta} limit value to decrease. When q_0=1.3, we obtain a maximum value of \\b{eta}_N of approximately 1.8.",
    "authors": [
      "SHEN Yong",
      "DONG Jiaqi",
      "SHI Zhongbing",
      "HE Hongda",
      "ZHAO Kaijun",
      "PENG Xiaodong",
      "QU Hongpeng",
      "LI Jia",
      "SUN Aiping"
    ],
    "published": "2026-01-16T06:11:25Z",
    "updated": "2026-01-16T06:11:25Z",
    "categories": [
      "physics.plasm-ph",
      "physics.data-an"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.7498/aps.74.20250450"
  },
  {
    "arxiv_id": "2601.11003v1",
    "url": "https://arxiv.org/abs/2601.11003v1",
    "pdf_url": "https://arxiv.org/pdf/2601.11003v1.pdf",
    "title": "Generation and Enhancement of Persistent Nanoscale Magnetization in All-Dielectric Metasurfaces by Optically Injected and Localized Free Carriers",
    "abstract": "Time-varying dielectric metasurfaces supporting sharp optical resonances with a non-trivial electromagnetic field distribution represent a unique platform for realizing temporal interfaces for metasurface-guided waves (MGWs). Rapidly changing metasurface resonance enables frequency conversion and temporal scattering of a concurrently propagating MGW. Using analytical methods and electromagnetic simulations, we demonstrate that localized free-carrier generation can be engineered to produce frequency-shifted, time-refracted, and reflected infrared MGWs. Furthermore, we demonstrate that such time interfaces can be utilized to generate large, highly localized quasistatic magnetic fields within the metasurfaces. The resulting nanoscale magnetization, supported by the residual circulating currents, persists after the departure of the time-scattered MGWs. We further demonstrate that the initial electromagnetic energy of the injected MGWs is partitioned between the time-reflected/refracted MGWs, residual motion of the free carriers, and a quasistatic magnetic field.",
    "authors": [
      "Shivaksh Rawat",
      "Samyobrata Mukherjee",
      "Gennady Shvets"
    ],
    "published": "2026-01-16T05:35:11Z",
    "updated": "2026-01-16T05:35:11Z",
    "categories": [
      "physics.optics",
      "physics.app-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2401.04600v3",
    "url": "https://arxiv.org/abs/2401.04600v3",
    "pdf_url": "https://arxiv.org/pdf/2401.04600v3.pdf",
    "title": "Theoretical research on low-frequency drift Alfvén waves in general Tokamak equilibria",
    "abstract": "We developed kinetic models based on general fishbone-like dispersion relations. Firstly, a general model for arbitrary magnetic configuration and ion orbit width is presented. Then, by disregarding ion orbit width and approximating the magnetic geometry as circular, we introduce a simplified model that fully incorporates circulating/trapped ion effects. Finally, by considering the limit of ions being well-circulating or deeply trapped, the results directly revert to those observed in earlier theoretical studies.",
    "authors": [
      "Yang Li"
    ],
    "published": "2024-01-09T15:16:12Z",
    "updated": "2026-01-16T03:26:34Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.10898v1",
    "url": "https://arxiv.org/abs/2601.10898v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10898v1.pdf",
    "title": "U-Net-based surrogate modeling for attosecond X-ray free-electron lasers",
    "abstract": "Attosecond X-ray pulse generation in modern X-ray free-electron lasers relies on strongly compressed, precisely tailored electron bunches, making accurate diagnostics and control of the longitudinal phase space (LPS) essential. In the self-chirping scheme, collective effects in the linac generate a strong energy chirp that is converted into high peak current through pre-undulator compression, enabling isolated attosecond pulse generation. Reliable operation of this scheme depends on precise LPS control and fast diagnostics. In this work, we present a U-Net-based neural network surrogate that predicts two-dimensional LPS distributions directly from accelerator settings. The model exhibits excellent agreement with start-to-end simulation results. These results demonstrate the potential of neural network surrogates to facilitate real-time tuning and control in attosecond X-ray pulse generation.",
    "authors": [
      "Yufei Wei",
      "Bingyang Yan",
      "Chenzhi Xu",
      "Jiawei Yan",
      "Haixiao Deng"
    ],
    "published": "2026-01-15T22:53:15Z",
    "updated": "2026-01-15T22:53:15Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.10885v1",
    "url": "https://arxiv.org/abs/2601.10885v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10885v1.pdf",
    "title": "Learning collision operators from plasma phase space data using differentiable simulators",
    "abstract": "We propose a methodology to infer collision operators from phase space data of plasma dynamics. Our approach combines a differentiable kinetic simulator, whose core component in this work is a differentiable Fokker-Planck solver, with a gradient-based optimisation method to learn the collisional operators that best describe the phase space dynamics. We test our method using data from two-dimensional Particle-in-Cell simulations of spatially uniform thermal plasmas, and learn the collision operator that captures the self-consistent electromagnetic interaction between finite-size charged particles over a wide variety of simulation parameters. We demonstrate that the learned operators are more accurate than alternative estimates based on particle tracks, while making no prior assumptions about the relevant time-scales of the processes and significantly reducing memory requirements. We find that the retrieved operators, obtained in the non-relativistic regime, are in excellent agreement with theoretical predictions derived for electrostatic scenarios. Our results show that differentiable simulators offer a powerful and computational efficient approach to infer novel operators for a wide rage of problems, such as electromagnetically dominated collisional dynamics and stochastic wave-particle interactions.",
    "authors": [
      "Diogo D. Carvalho",
      "Pablo J. Bilbao",
      "Warren B. Mori",
      "Luis O. Silva",
      "E. Paulo Alves"
    ],
    "published": "2026-01-15T22:31:26Z",
    "updated": "2026-01-15T22:31:26Z",
    "categories": [
      "physics.plasm-ph",
      "cs.LG",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.10855v1",
    "url": "https://arxiv.org/abs/2601.10855v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10855v1.pdf",
    "title": "Vortex Solitons and Filamentation of Electromagnetic Beams in Relativistically Degenerate Plasmas",
    "abstract": "We study the propagation and stability of electromagnetic vortex beams in relativistically de generate plasmas. We show that such plasmas support localized vortex solitons carrying orbital angular momentum and analyze their linear and nonlinear stability. Vortex solitons undergo az imuthal symmetry-breaking instabilities whose growth rates depend on beam power, propagation constant, and topological charge, with the dominant mode determining the number of filaments formed during breakup. We further demonstrate that vortex solitons act as nonlinear attractors with a finite basin of attraction, while the vortex core remains topologically protected, maintaining a strictly zero field intensity at the beam center throughout the evolution. The results persist across a broad range of degeneracy parameters and are relevant to hard X-ray radiation propagating in dense astrophysical plasmas.",
    "authors": [
      "Nikolai Maltsev",
      "Vazha I. Berezhiani"
    ],
    "published": "2026-01-15T20:46:44Z",
    "updated": "2026-01-15T20:46:44Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.10694v1",
    "url": "https://arxiv.org/abs/2601.10694v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10694v1.pdf",
    "title": "Increasing the opening speed of the plasma opening switch on an direct action accelerator with an inductive energy storage device",
    "abstract": "To increase the voltage multiplication factor in a small-sized direct-acting electron accelerator DIN-2K with an inductive energy storage and a plasma opening switch, it is necessary to ensure an increase in the rate of change of the current and its amplitude during the POS opening for the purpose of obtaining an explosive electron emission with the formation of an electron beam and a virtual cathode. However, the opening process depends on many electrical parameters of the plant, and it re-quires determining their joint and individual effect on its dynamics. The purpose of this research is to study and determine the effects of electrical parameters, including those of the discharge voltages of the entire electrical circuit of the accelerator on the dynamics of the plasma opening switch, in particular opening speed, current amplitudes, and opening time, as well as to give recommendations on optimizing the operation of accelerators of this type and highlight possible ways to increase the voltage multiplication factor. Methodology. A method for determining the induced voltage according to experimental current oscillograms has been proposed. The methodology was verified by the coincidence of its data with the results of measurements by a capacitive voltage divider with the data spread of less than 20%. Scientific novelty. The rates of change in the current at the plasma switch opening stage were determined depending on the main electrical parameters of the DIN-2K accelerator. The diagnostics of the voltage induced during the POS opening were provided using no capacitive voltage divider in the internal volume of the accelerator, which enabled the removal of some diagnostic tools from the working volume of the chamber. Practical significance.",
    "authors": [
      "D. V. Vinnikov",
      "O. M. Ozerov",
      "V. V. Katrechko",
      "V. I. Tkachov",
      "O. V. Manuilenko",
      "I. N. Onishchenko"
    ],
    "published": "2026-01-15T18:52:26Z",
    "updated": "2026-01-15T18:52:26Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.10571v1",
    "url": "https://arxiv.org/abs/2601.10571v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10571v1.pdf",
    "title": "Corrections for systematic errors in slit-profiler transverse phase space measurements",
    "abstract": "In photo injectors, the transverse emittance is one of the key measures of beam quality as it defines the possible performance of the whole facility. As such it is important to measure the emittance in photo injectors and ensure the accuracy of these measurements. While there are many different methods of measuring the emittance, this paper focuses on quantifying the systematic errors present in transverse phase space measurements taken with slit-profiler methods, i.e. scanning a narrow slit over the beam and continually measuring the passed beamlets' divergence with a downstream profiler. The measurement errors include effects of the slit size, beamlet imaging, and residual space charge. While these effects are generally small, they can have significant impact on the measured emittance when the 2D phase space is strongly coupled. The systematic effects studied and corrections are demonstrated with simulations and measurements from the Photo Injector Test facility at DESY in Zeuthen (PITZ) using a slit-screen emittance scanner.",
    "authors": [
      "C. Richard",
      "M. Krasilnikov",
      "N. Aftab",
      "Z. Amirkhanyan",
      "D. Dmytriiev",
      "A. Hoffmann",
      "M. Gross",
      "X. -K. Li",
      "Z. Lotfi",
      "F. Stephan",
      "G. Vashchenko",
      "S. Zeeshan"
    ],
    "published": "2026-01-15T16:37:09Z",
    "updated": "2026-01-15T16:37:09Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.10570v1",
    "url": "https://arxiv.org/abs/2601.10570v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10570v1.pdf",
    "title": "Canonical Vorticity Perspective on Magnetogenesis: Unifying Weibel, Biermann, and Beyond",
    "abstract": "We briefly review the current status of magnetogenesis, a cross-disciplinary field that bridges cosmology and plasma physics, studying the origin of magnetic fields in the universe. We formulate a canonical vorticity framework to investigate kinetic plasma physics-based magnetogenesis processes in a collisionless plasma. By considering canonical vorticity, a weighted sum of the fluid vorticity and the magnetic field as the canonical variable, this framework unifies several magnetogenesis processes, including the Biermann battery, the Weibel instability, and predicts several new pressure tensorial configurations as the fundamental source of self-generated magnetic field and vorticity in plasma. The framework is further extended to relativistic regime where an additional source of canonical vorticity, termed as kineclinicity effect, is identified. The theoretical predictions are systematically validated using particle-in-cell simulations, highlighting their implications for laboratory and astrophysical plasma environments.",
    "authors": [
      "Modhuchandra Laishram",
      "Young Dae Yoon"
    ],
    "published": "2026-01-15T16:34:10Z",
    "updated": "2026-01-15T16:34:10Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2501.04619v2",
    "url": "https://arxiv.org/abs/2501.04619v2",
    "pdf_url": "https://arxiv.org/pdf/2501.04619v2.pdf",
    "title": "Fast physics-based launcher optimization for electron cyclotron current drive",
    "abstract": "With the increased urgency to design fusion pilot plants, fast optimization of electron cyclotron current drive (ECCD) launchers is paramount. Traditionally, this is done by coarsely sampling the 4-D parameter space of possible launch conditions consisting of (1) the launch location (constrained to lie along the reactor vessel), (2) the launch frequency, (3) the toroidal launch angle, and (4) the poloidal launch angle. For each initial condition, a ray-tracing simulation is performed to evaluate the ECCD efficiency. Unfortunately, this approach often requires a large number of simulations (sometimes millions in extreme cases) to build up a dataset that adequately covers the plasma volume, which must then be repeated every time the design point changes. Here we adopt a different approach. Rather than launching rays from the plasma periphery and hoping for the best, we instead directly reconstruct the optimal ray for driving current at a given flux surface using a reduced physics model coupled with a commercial ray-tracing code. Repeating this throughout the plasma volume requires only hundreds of simulations, constituting a significant speedup. The new method is validated on two separate example tokamak profiles, and is shown to reliably drive localized current at the specified flux surface with the same optimal efficiency as obtained from the traditional approach.",
    "authors": [
      "N A Lopez",
      "A Alieva",
      "S A M McNamara",
      "X Zhang"
    ],
    "published": "2025-01-08T17:03:08Z",
    "updated": "2026-01-15T16:26:44Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1088/1361-6587/adcae7"
  },
  {
    "arxiv_id": "2406.10979v2",
    "url": "https://arxiv.org/abs/2406.10979v2",
    "pdf_url": "https://arxiv.org/pdf/2406.10979v2.pdf",
    "title": "Collisional whistler instability and electron temperature staircase in inhomogeneous plasma",
    "abstract": "High-beta magnetized plasmas often exhibit anomalously structured temperature profiles, as seen from galaxy cluster observations and recent experiments. It is well known that when such plasmas are collisionless, temperature gradients along the magnetic field can excite whistler waves that efficiently scatter electrons to limit their heat transport. Only recently has it been shown that parallel temperature gradients can excite whistler waves also in collisional plasmas. Here we develop a Wigner--Moyal theory for the collisional whistler instability starting from Braginskii-like fluid equations in a slab geometry. This formalism is necessary because, for a large region in parameter space, the fastest-growing whistler waves have wavelengths comparable to the background temperature gradients. We find additional damping terms in the expression for the instability growth rate involving inhomogeneous Nernst advection and resistivity. They (i) enable whistler waves to re-arrange the electron temperature profile via growth, propagation, and subsequent dissipation, and (ii) allow non-constant temperature profiles to exist stably. For high-beta plasmas, the marginally stable solutions take the form of a temperature staircase along the magnetic field lines. The electron heat flux can also be suppressed by the Ettingshausen effect when the whistler intensity profile is sufficiently peaked and oriented opposite the background temperature gradient. This mechanism allows cold fronts without magnetic draping, might reduce parallel heat losses in inertial fusion experiments, and generally demonstrates that whistler waves can regulate transport even in the collisional limit.",
    "authors": [
      "N. A. Lopez",
      "A. F. A. Bott",
      "A. A. Schekochihin"
    ],
    "published": "2024-06-16T15:30:15Z",
    "updated": "2026-01-15T16:19:52Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1017/S0022377825000078"
  },
  {
    "arxiv_id": "2501.11029v2",
    "url": "https://arxiv.org/abs/2501.11029v2",
    "pdf_url": "https://arxiv.org/pdf/2501.11029v2.pdf",
    "title": "Laser-induced plasma formation and cavitation in water: from nanoeffects to extreme states of matter",
    "abstract": "We present an in-depth analysis of the energy dependence of optical breakdown in water by tightly focused laser pulses, from plasma formation to shock waves and cavitation. Laser pulses of fs to ns durations and UV to IR wavelengths are aberration-free focused through microscope objectives. Photography captures luminescent plasmas with submicrometer resolution, and bubble threshold and size are determined via probe beam scattering. The energy dependence of mechanical effects is quantified through the maximum bubble radius Rmax. We find three key scenarios depicting the interaction between multiphoton and avalanche ionization, recombination, and thermal ionization from nanoeffects near threshold to extreme energy densities. They include a previously unknown scenario that emerges with single-longitudinal-mode UV ns pulses from compact lasers. It enables cost-effective creation of nanoeffects, as demonstrated on corneal tissue and glass. High-resolution photography reveals new insights in the spatiotemporal dynamics of plasma formation, with an interplay of breakdown waves, string formation by local instabilities of avalanche ionization, and radiative energy transport. Plasma volume data from photographs together with absorption measurements show that the average energy density of luminescent fs and ns plasmas is similar, ranging between 10 and 40 kJ/cm^3 . However, small hot regions with up to 400 kJ/cm^3 are formed in ns breakdown. From the hot regions, energy is spread out via X-ray bremsstrahlung, forming a luminescent halo. Well above threshold, Rmax scales with E^(1/3) across all scenarios, with 15% - 20% conversion of laser energy into bubble energy. With increasing plasma energy density, an ever-larger energy fraction is converted into shock wave energy (75% at 40 kJ/cm^3 ). The results provide guidelines for parameter selection in laser surgery and material processing.",
    "authors": [
      "Norbert Linz",
      "Sebastian Freidank",
      "Xiao-Xuan Liang",
      "Alfred Vogel"
    ],
    "published": "2025-01-19T12:35:05Z",
    "updated": "2026-01-15T15:02:05Z",
    "categories": [
      "physics.flu-dyn",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.flu-dyn",
    "doi": "10.1088/1361-6633/adedb3"
  },
  {
    "arxiv_id": "2601.10472v1",
    "url": "https://arxiv.org/abs/2601.10472v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10472v1.pdf",
    "title": "From Weibel seeds to collisionless dynamos beyond pair-plasmas",
    "abstract": "Bridging the spatiotemporal scales of magnetic seed field generation and subsequent dynamo amplification in the weakly collisional intracluster medium presents an extreme numerical challenge. We perform collisionless turbulence simulations with initially unmagnetized electrons that capture both magnetic seed generation via the electron Weibel instability and the ensuing dynamo amplification. Going beyond existing pair-plasma studies, we use an ion-to-electron mass ratio of 100 for which we find electron and ion dynamics are sufficiently decoupled. These simulations are enabled by the 10-moment collisionless fluid solver of Gkeyll, which evolves the full pressure tensor for all species. The electron heat-flux closure regulates pressure isotropization and effectively sets the magnetic Reynolds number. We investigate how the strength of of the closure influences the transition between a regime reminiscent of previous kinetic pair-plasma simulations and a more MHD-like dynamo regime.",
    "authors": [
      "Lise Hanebring",
      "James Juno",
      "Ammar Hakim",
      "Jason M. TenBarge",
      "Istvan Pusztai"
    ],
    "published": "2026-01-15T14:57:57Z",
    "updated": "2026-01-15T14:57:57Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.CO"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.10430v1",
    "url": "https://arxiv.org/abs/2601.10430v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10430v1.pdf",
    "title": "Active interrogation of underground piezoelectric fabrics using high energy muon beams propagating across seismogenic faults",
    "abstract": "In this paper we extend a previous analysis of a newly conceived technique based on active interrogation of tectonic stress evolution in regions hosting active seismogenic faults. The aim is to monitor and detect stable and reliable precursor signals on an adequate time scale, well before an earthquake event, that can play a crucial role in activating alarms for civil protection systems. The precursor signal relies on continuous measurements of the time evolution of tectonic stress, obtained by interrogating underground, with a high energy collimated muon beam, the piezoelectric fabrics present in quartz rich granite like rocks surrounding a known seismogenic fault in the Earth crust. Beam propagation through the rock across the active fault conveys to a detector at the exit of the traversal information on the amplitude of the piezoelectric field, which scales with the tectonic stress applied to quartz crystals embedded in the rock. The system, named ERMES (Earthquake Reconnaissance using Muon beam Evolution in Silicon dioxide), differs from other techniques under study detecting electromagnetic signals generated by piezoelectricity outside the Earth crust, as it probes piezoelectric effects directly inside the source region of the associated electromagnetic field, namely the near field within quartz crystals rather than the far field in open space. We present a focused analysis of muon beam manipulation after rock traversal and before detection using a newly conceived muonic lens, and we explore the maximum rock penetration capability of a high energy muon beam, reaching about 3 km of rock thickness for a 10 TeV beam. Owing to the peculiarity of muon propagation through such kilometer scale targets, we cross checked previous FLUKA Monte Carlo simulations with Geant4 to clarify the secondary muons role generated by primary muon interactions in solid matter over long propagation lengths.",
    "authors": [
      "L. Serafini",
      "A. Bacci",
      "L. Bandiera",
      "F. Broggi",
      "I. Drebot",
      "A. Frazzitta",
      "A. M. Marotta",
      "G. Muttoni",
      "G. Paternò",
      "V. Petrillo",
      "M. Rossetti Conti",
      "A. R. Rossi",
      "S. Samsam",
      "M. Voltolini",
      "M. Zucali"
    ],
    "published": "2026-01-15T14:26:10Z",
    "updated": "2026-01-15T14:26:10Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.06651v5",
    "url": "https://arxiv.org/abs/2512.06651v5",
    "pdf_url": "https://arxiv.org/pdf/2512.06651v5.pdf",
    "title": "A Capacitor Model of the Helical Deflector: Revisiting Shamaev's Proposal and the Textbook Model",
    "abstract": "An RF helical deflector is a type of electron and ion optics device that applies a time-dependent rotating transverse electric or magnetic field by means of time-dependent RF voltage applied on two opposite conducting helical structures (wires, ribbons or other) to deflect charged particles (a single, bunch or beam) in a circular or spiral path. It is a perspective indirect timing system being concurrent for reaching picosecond time resolution, and have promise being excellent candidate for high precision time-of-flight detection. As a timing system, it converts the temporal structure of an electron beam into a spatial pattern -- particularly, an ellipse in the case of a single-frequency RF voltage and continuous electron pencil beam.   I propose a capacitor model of an RF helical deflector and compare it with the existing textbook model \\cite{ZhigarevBook, Gevorgian2015}, interpret them and provide understanding of them. Furthermore, I analyze the latter, finding analytical formulas for the applied electric field, ellipse sizes (semi-axes) and rotation angle, lengths of the ellipse line, corresponding to the duration of electron pencil bunches or beams. The present article touches the topics of getting circle on resonance limit and of deflection sensitivity.",
    "authors": [
      "Hayk Lekdar Gevorgyan"
    ],
    "published": "2025-12-07T04:27:08Z",
    "updated": "2026-01-15T11:50:43Z",
    "categories": [
      "physics.acc-ph",
      "physics.app-ph",
      "physics.class-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.10295v1",
    "url": "https://arxiv.org/abs/2601.10295v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10295v1.pdf",
    "title": "Design, Fabrication and Testing of a D-Shaped High Temperature Superconducting Magnet",
    "abstract": "High-temperature technical superconductors are potential candidates for compact and high-field tokamak magnets. The demand for higher fusion power can be met with an on-axis high magnetic field due to toroidal magnets. An R&D activity has been initiated at the Institute for Plasma Research, India, to develop a compact D-shaped superconducting magnet utilizing REBCO high-temperature superconducting tapes. Under this initiative, a toroidal configuration with a major radius of 0.42 m, consisting of eight D-shaped, four poloidal field, and a central solenoid high-temperature superconducting magnets producing an on-axis toroidal magnetic field of 0.23 T has been conceptualized. The fabrication feasibility of a D-shaped coil for this toroidal configuration also envisaged using stacked high-temperature superconducting cable. In this paper, we report the design of a compact D-shaped coil, the fabrication of a long length HTS cable, a winding pack, and its integration with a cryogenic casing and vacuum enclosure. The winding pack terminations, joints, its interfacing with the power supply, and performance testing are also reported in this paper.",
    "authors": [
      "Upendra Prasad",
      "Mahesh Ghate",
      "Piyush Raj",
      "Deven Kanabar",
      "Pankaj Varmora",
      "Swati Roy",
      "Arun Panchal",
      "Dhaval Bhavsar",
      "Anees Bano",
      "Nitish Kumar",
      "Bhadresh Parghi",
      "Akhilesh Yadav",
      "Mohd. Umer",
      "Vijay Vasava",
      "Raton Mandal",
      "Rajkumar Ahirwar",
      "Megha Thaker"
    ],
    "published": "2026-01-15T11:13:18Z",
    "updated": "2026-01-15T11:13:18Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.10293v1",
    "url": "https://arxiv.org/abs/2601.10293v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10293v1.pdf",
    "title": "Updated electrical design of the Diagnostic Neutral Beam Injector in RFX-mod2",
    "abstract": "The Diagnostic Neutral Beam Injector of the RFX-mod2 experiment (Consorzio RFX, Padova) is expected to provide novel and significant information about the Reversed Field Pinch confinement of fusion plasmas. The injection of the hydrogen beam in the plasma will allow Charge Exchange Recombination Spectroscopy (CXRS) and Motional Stark Effect diagnostics (MSE) to measure several quantities: ion speed, ion temperature, impurity content, intensity and pitch of the magnetic field. The DNBI is of particular importance for allowing the determination of these quantities at the core of the plasma. The present DNBI, built by the Budker Institute of Plasma Physics, features an arc discharge H+ source, coupled to a 4-grid 50 keV acceleration system. The 50 ms, 5 A ion beam is neutralized by charge exchange by means of a gas target; residual ions are then deflected by a magnetic field before injection in the torus chamber. The beam can be modulated at maximum 250 Hz. The DNBI will undergo extraordinary maintenance and a structural upgrade to improve its reliability and safety. This contribution presents the latest upgrades of the electrical plants and of the control system of the DNBI.",
    "authors": [
      "Marco Barbisan",
      "Bruno Laterza",
      "Luca Cinnirella",
      "Lionello Marrelli",
      "Federico Molon",
      "Simone Peruzzo",
      "Enrico Zampiva"
    ],
    "published": "2026-01-15T11:11:05Z",
    "updated": "2026-01-15T11:11:05Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.10039v1",
    "url": "https://arxiv.org/abs/2601.10039v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10039v1.pdf",
    "title": "Effects of parallel magnetic fields on sheaths near biased electrodes in a highly collisional Z-pinch plasma",
    "abstract": "Sheath formation near biased electrodes in magnetic fields parallel to the wall is an understudied topic, especially within the context of Z-pinch fusion experiments. We perform 1X-2V Boltzmann-Poisson simulations of an axial cut at the pinch radius of a Z-pinch plasma between two biased electrodes with a magnetic field parallel to the wall. The collision frequencies are artificially increased to enhance thermalization of the plasma in the smaller simulation domain versus the actual experiment size; this increases the perpendicular mobility and partially de-magnetizes the ions resulting in non-monotonic sheath profiles with the potential increasing away from the wall to a peak before decaying. A classical sheath forms within an electron gyroradius from the wall not due to the natural thermal motion of the electrons, but due to the magnetized electrons gyrating into the wall; therefore, the sheath structure does not significantly change with bias potential or between electrodes. With increasing bias potential, a current is induced perpendicular to the wall due to changes in ion flow, differing from unmagnetized cases where current is induced by changes in electron flow. The magnetic field acts as a high resistivity with the perpendicular current density being three orders of magnitude lower than unmagnetized theoretical predictions. There is, however, significant flow parallel to the wall from the force balance between the pressure tensor and Lorentz force. These parallel flows induce a parallel current density three orders of magnitude larger than the perpendicular current density.",
    "authors": [
      "C. R. Skolar",
      "B. Srinivasan"
    ],
    "published": "2026-01-15T03:34:07Z",
    "updated": "2026-01-15T03:34:07Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.09963v1",
    "url": "https://arxiv.org/abs/2601.09963v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09963v1.pdf",
    "title": "Near-Unity-Efficiency Gas Gratings for Ultraviolet, Visible, and Infrared High-Power Lasers",
    "abstract": "Interfering deep ultraviolet (DUV) lasers can induce substantial density modulations in an ozone-doped gas flow via photochemical reactions, creating volume diffraction gratings. These transient optics are immune to target debris and shrapnel and feature orders-of-magnitude higher damage thresholds than conventional solid optics, providing a promising method for efficiently manipulating high-energy lasers. In this work, we describe gas gratings that can efficiently diffract probe beams across a variety of wavelengths and pulse durations, ranging from deep ultraviolet to near-infrared and from nanosecond to femtosecond, achieving a full beam diffraction efficiency up to 99% while preserving the focusability and wavefront quality. In addition, we present a comprehensive characterization of the performance of the gas gratings under various experimental conditions, including imprint fluence, gas composition, and grating geometries, showing significant enhancement of this process with the addition of carbon dioxide. We also demonstrate stable performance over hours of operation. Our results validate a previously developed theoretical model and suggest optimal parameters to efficiently scale gas gratings to high-energy applications.",
    "authors": [
      "Ke Ou",
      "Harsha Rajesh",
      "Sida Cao",
      "Debolina Chakraborty",
      "Victor M. Perez-Ramirez",
      "Devdigvijay Singh",
      "Caleb Redshaw",
      "Pelin Dedeler",
      "Albertine Oudin",
      "Eugene Kur",
      "Michelle M. Wang",
      "Julia M. Mikhailova",
      "Livia Lancia",
      "Caterina Riconda",
      "Pierre Michel",
      "Matthew R. Edwards"
    ],
    "published": "2026-01-15T00:56:13Z",
    "updated": "2026-01-15T00:56:13Z",
    "categories": [
      "physics.optics",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2601.09906v1",
    "url": "https://arxiv.org/abs/2601.09906v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09906v1.pdf",
    "title": "A feasibility study for a Doppler Reflectometer System in the JT-60SA tokamak",
    "abstract": "In this work we present a study on the viability and practicality of installing a Doppler reflectometer (DR) system in the JT-60SA advanced tokamak. First, we discuss its scientific scope in the context of the JT-60SA research plan. We identify a number of fields in which a DR would be very relevant for the accomplishment of said plan and outline a scientific program for the diagnostic. Then, starting from a number of design hypothesis, we use a ray tracing code to carry out a feasibility study for a number of relevant scenarios and identify a geometric solution for the installation of a DR such that both core and edge can be probed in the prescribed wave number range, thus achieving the proposed scientific objectives. Finally, we perform a preliminary discussion on the different possibilities for a conceptual design (including a minimum viable system and a baseline system) and their requirements in terms of components and space. We conclude that a viable conceptual design could be carried out using a small fraction of a horizontal port, leaving room for additional diagnostic systems.",
    "authors": [
      "D. Carralero",
      "T. Happel",
      "T. Estrada",
      "T. Tokuzawa",
      "J. Martínez",
      "E. de la Luna",
      "A. Cappa",
      "J. García"
    ],
    "published": "2026-01-14T22:29:05Z",
    "updated": "2026-01-14T22:29:05Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1016/j.fusengdes.2021.112803."
  },
  {
    "arxiv_id": "2510.00493v2",
    "url": "https://arxiv.org/abs/2510.00493v2",
    "pdf_url": "https://arxiv.org/pdf/2510.00493v2.pdf",
    "title": "Correlation function metrology for warm dense matter: Recent developments and practical guidelines",
    "abstract": "X-ray Thomson scattering (XRTS) has emerged as a valuable diagnostic for matter under extreme conditions, as it captures the intricate many-body physics of the probed sample. Recent advances, such as the model-free temperature diagnostic of Dornheim et al. [Nat.Commun. 13, 7911 (2022)], have demonstrated how much information can be extracted directly within the imaginary-time formalism. However, since the imaginary-time formalism is a concept often difficult to grasp, we provide here a systematic overview of its theoretical foundations and explicitly demonstrate its practical applications to temperature inference, including relevant subtleties. Furthermore, we present recent developments that enable the determination of the absolute normalization, Rayleigh weight, and density from XRTS measurements without reliance on uncontrolled model assumptions. Finally, we outline a unified workflow that guides the extraction of these key observables, offering a practical framework for applying the method to interpret experimental measurements.",
    "authors": [
      "Maximilian Peter Böhme",
      "Willow Martin",
      "Hannah Bellenbaum",
      "Margaret Berrens",
      "Jan Vorberger",
      "Sebastian Schwalbe",
      "Zhandos Moldabekov",
      "Thomas Gawne",
      "Sebastien Hamel",
      "Brianna Aguilar-Solis",
      "Abhiraj Sharma",
      "Frank Graziani",
      "Tilo Döppner",
      "Siegfried Glenzer",
      "Tobias Dornheim",
      "David Bishel"
    ],
    "published": "2025-10-01T04:22:31Z",
    "updated": "2026-01-14T19:30:23Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.09617v1",
    "url": "https://arxiv.org/abs/2601.09617v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09617v1.pdf",
    "title": "Comparison of plasma response models for RMP effects on the divertor and scrape-off layer in KSTAR",
    "abstract": "Resonant magnetic perturbations (RMPs) are beneficial for control of edge localized modes (ELMs) in tokamaks. Nevertheless, a side effect is the appearance of a helical striations in the particle and heat loads onto divertor targets. The extent and field line connection of these striations is significantly altered by the plasma response to external perturbations. For an ELM suppressed H-mode plasma at KSTAR, magnetic footprints are computed by FLARE based on plasma response from GPEC, MARS-F, M3D-C1 and JOREK with substantial differences in the resulting footprints (from 2 cm to 14 cm). This is reflected in EMC3-EIRENE simulations of the resulting heat loads: it is found that either the peak value or the extent of the striations appear to be overestimated compared to IRTV measurements. Reasonable agreement can only be achieved for the smallest footprint for lower input power and lower cross-field transport, or for higher upstream density and radiative power losses.",
    "authors": [
      "H. Frerichs",
      "J. Van Blarcum",
      "T. Cote",
      "S. K. Kim",
      "Y. Q. Liu",
      "S. M. Yang"
    ],
    "published": "2026-01-14T16:41:37Z",
    "updated": "2026-01-14T16:41:37Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.09596v1",
    "url": "https://arxiv.org/abs/2601.09596v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09596v1.pdf",
    "title": "Plasma wakes driven by Compton scattering: Non-linear regime and particle acceleration",
    "abstract": "We investigate plasma wake generation via Compton scattering from photon bursts, a non-ponderomotive process relevant when the photon wavelength is smaller than the interparticle distance but larger than the Compton wavelength. In this regime, electrons can reach relativistic velocities. We extend linear theory to the nonlinear regime, showing that plasma waves can reach the wave-breaking limit. Perfectly collimated drivers produce wakes propagating at the speed of light, allowing electron phase-locking (limited by driver depletion). Non-collimated drivers induce subluminal phase velocities, limiting acceleration via dephasing. Two-dimensional simulations reveal unique transverse fields compared to laser wakefields, with a DC magnetic field leading to consistent focusing. The work considers observational prospects in laboratory and astrophysical scenarios such as around highly luminous compact objects (e.g., pulsars, gamma-ray bursts) interacting with tenuous interstellar or intergalactic plasmas, where conditions favor Comptondominated wakefield acceleration.",
    "authors": [
      "Thomas Grismayer",
      "Fabrizio Del Gaudio",
      "Luís O. Silva"
    ],
    "published": "2026-01-14T16:14:00Z",
    "updated": "2026-01-14T16:14:00Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.09574v1",
    "url": "https://arxiv.org/abs/2601.09574v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09574v1.pdf",
    "title": "Square matrix-based six-dimensional convergence map for nonlinear beam dynamics analysis",
    "abstract": "The square matrix-based convergence map (CM) method has proven effective in characterizing nonlinear dynamics in several 4-D dynamical systems. However, when time-dependent perturbations, such as crabbing kicks in colliders, are present, a comprehensive 6-D analysis becomes essential to accurately capture the coupling between transverse and longitudinal motions. In this work, we extend the CM method to the full 6-D phase space by employing an eigen-decomposition-based formulation of the square matrix combined with iterative procedures. The proposed 6-D CM approach is first validated using a simplified crabbing map. We demonstrate that the 6-D CM preserves computational efficiency by using only one-turn map, while successfully resolving high-order resonance structures that remain unresolved by conventional frequency map analysis (FMA). This method is subsequently applied to the dynamic aperture (DA) study of the future Electron-Ion Collider (EIC). The results obtained from the CM analysis exhibit close agreement with those derived from FMA, demonstrating its potential as a powerful tool for nonlinear beam dynamics analysis and DA evaluation, as well as for broader applications in other nonlinear dynamical systems.",
    "authors": [
      "Jinyu Wan",
      "Yue Hao"
    ],
    "published": "2026-01-14T15:45:22Z",
    "updated": "2026-01-14T15:45:22Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.10107v2",
    "url": "https://arxiv.org/abs/2509.10107v2",
    "pdf_url": "https://arxiv.org/pdf/2509.10107v2.pdf",
    "title": "Experimental Evidence for the Breakdown of Uniform-Electron-Gas Models in Warm Dense Aluminium",
    "abstract": "The robust diagnosis of thermodynamic conditions in warm dense matter experiments remains a central challenge. We report angle-resolved femtosecond x-ray Thomson scattering measurements of shock-compressed aluminum at approximately 50 GPa over a wide range of scattering wavevectors at the European XFEL. The measured plasmon dispersion and line shape demonstrate that the standard analysis of x-ray Thomson scattering spectra based on uniform electron gas models systematically overestimates the plasmon resonance energy by up to 8 eV. In contrast, an analysis based on ab initio calculations reproduces both the dispersion and spectral shape within experimental uncertainty. Our results show that shock-induced disorder plays a critical role in the interpretation of x-ray Thomson scattering from compressed solids and provide direct evidence that ab initio approaches are required for reliable inference of thermodynamic conditions in warm dense aluminum.",
    "authors": [
      "Dmitrii S. Bespalov",
      "Ulf Zastrau",
      "Zhandos A. Moldabekov",
      "Thomas Gawne",
      "Tobias Dornheim",
      "Moyassar Meshhal",
      "Alexis Amouretti",
      "Michal Andrzejewski",
      "Karen Appel",
      "Carsten Baehtz",
      "Erik Brambrink",
      "Khachiwan Buakor",
      "Carolina Camarda",
      "David Chin",
      "Gilbert Collins",
      "Céline Crépeisson",
      "Adrien Descamps",
      "Jon Eggert",
      "Luke Fletcher",
      "Alessandro Forte",
      "Gianluca Gregori",
      "Marion Harmand",
      "Oliver S. Humphries",
      "Hauke Höppner",
      "Jonas Kuhlke",
      "William Lynn",
      "Julian Lütgert",
      "Masruri Masruri",
      "Emma M. McBride",
      "Ryan Stewart McWilliams",
      "Alan Augusto Sanjuan Mora",
      "Jean-Paul Naedler",
      "Paul Neumayer",
      "Charlotte Palmer",
      "Alexander Pelka",
      "Lea Pennacchioni",
      "Calum Prestwood",
      "Natalia A. Pukhareva",
      "Chongbing Qu",
      "Divyanshu Ranjan",
      "Ronald Redmer",
      "Michael Roper",
      "Christoph Sahle",
      "Samuel Schumacher",
      "Jan-Patrick Schwinkendorf",
      "Melanie J. Sieber",
      "Madison Singleton",
      "Ethan Smith",
      "Christian Sternemann",
      "Thomas Stevens",
      "Michael Stevenson",
      "Cornelius Strohm",
      "Minxue Tang",
      "Monika Toncian",
      "Toma Toncian",
      "Thomas Tschentscher",
      "Sam M. Vinko",
      "Justin S. Wark",
      "Max Wilke",
      "Dominik Kraus",
      "Thomas R. Preston"
    ],
    "published": "2025-09-12T09:57:49Z",
    "updated": "2026-01-14T13:31:03Z",
    "categories": [
      "physics.plasm-ph",
      "cond-mat.str-el"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.09368v1",
    "url": "https://arxiv.org/abs/2601.09368v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09368v1.pdf",
    "title": "Analysis of wave processes using beam-driven Langmuir/$\\mathcal{Z}$-mode waveforms generated in Particle-In-Cell simulations",
    "abstract": "During Type III solar radio bursts, beam-driven upper-hybrid wave turbulence is converted into electromagnetic emissions at the fundamental plasma frequency and its harmonic, through a chain of various linear and nonlinear wave processes. In this work, we mainly investigate the relative roles and interplay of two key mechanisms: the nonlinear decay of Langmuir/$\\mathcal Z$-mode waves and their linear transformations on random density fluctuations and, in particular, their mode conversion at constant frequency into electromagnetic waves. Using two-dimensional Particle-In-Cell simulations, we employ a diagnostic approach based on large ensembles of virtual satellites that record local waveforms, enabling detailed temporal and spatial characterization of wave processes in randomly inhomogeneous plasmas. This method allows robust statistical analysis and direct comparison with spacecraft observations. The study focuses on the dependence of wave dynamics on the average level of density fluctuations and the plasma magnetization. Our results quantify the occurrence rate of decay under varying physical conditions and demonstrate how developed plasma density turbulence can significantly alter the balance between nonlinear wave-wave interactions and linear wave transformations. These findings provide new insights into the mechanisms responsible for electromagnetic emissions during type III radio bursts and strengthen the connection between numerical simulations and in situ solar wind measurements, offering a valuable framework for the interpretation of future space-based waveform observations.",
    "authors": [
      "Francisco Javier Polanco-Rodríguez",
      "Catherine Krafft",
      "Philippe Savoini"
    ],
    "published": "2026-01-14T10:50:35Z",
    "updated": "2026-01-14T10:50:35Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.18384v3",
    "url": "https://arxiv.org/abs/2510.18384v3",
    "pdf_url": "https://arxiv.org/pdf/2510.18384v3.pdf",
    "title": "Diagnostics of a Multicusp-Assisted Inductively-Coupled Radio-Frequency Plasma Source for Plasma Immersion Ion Implantation",
    "abstract": "In this article, we present a detailed characterisation of a multicusp-assisted inductively coupled RF plasma source for plasma immersion ion implantation (PIII). Using laser-induced fluorescence (LIF) and RF-compensated Langmuir probe diagnostics, we measured ion temperature T i and drift velocity v z in argon plasmas near an immersed electrode. The multicusp configuration enhances plasma density at low pressure, enabling stable operation down to 0.8 mTorr. Timeaveraged measurements show no detectable perturbation near the pulsed electrode, indicating full plasma recovery between high-voltage pulses. LIF-derived potential profiles match Riemann's presheath theory, and ion velocity distributions reveal acceleration consistent with sheath dynamics. These results support the use of LIF for steady-state characterisation of the bulk and presheath regions in PIII systems.",
    "authors": [
      "Moreno Joel",
      "Jimenez Marilyn",
      "Okerstrom Daniel",
      "Bradley Michael P.",
      "Couëdel Lénaïc"
    ],
    "published": "2025-10-21T08:03:30Z",
    "updated": "2026-01-14T10:45:18Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.08054v2",
    "url": "https://arxiv.org/abs/2601.08054v2",
    "pdf_url": "https://arxiv.org/pdf/2601.08054v2.pdf",
    "title": "The Topological Origin of Bohm Resistivity in Magnetic Reconnection",
    "abstract": "The physical origin of 'anomalous' resistivity in magnetic reconnection remains one of the longest-standing problems in space plasma physics. While the empirical Bohm diffusion scaling ($η~\\propto~T/B$) is widely invoked to explain fast reconnection rates, it lacks a rigorous derivation from first principles. Here, we derive this scaling by modeling the magnetized electron fluid as an overdamped spintronic condensate governed by the Landau-Lifshitz-Gilbert equation. We demonstrate that the breakdown of the \"frozen-in\" condition is rigorously identified as an Adler-Ohmic bifurcation in the model: a topological phase transition where electron gyro-axes lose synchronization with the magnetic field. By rigorously mapping the breakdown of adiabatic invariance to electron gyro axis slippage on the unit sphere, we show that the resulting resistivity naturally saturates at the Bohm limit. Numerical simulations of the $XY$ universality class confirm that the onset of this resistive state is explosive, following a logistic trigger consistent with the impulsive phase of solar flares. Furthermore, the topological defects in the condensate decay via a $t^{-0.75}$ power law, consistent with magnetic island coalescence as the mechanism of anomalous transport. These results suggest that Bohm resistivity is a universal topological property of magnetized matter at the critical point of reconnection.",
    "authors": [
      "Magnus F Ivarsen"
    ],
    "published": "2026-01-12T22:48:40Z",
    "updated": "2026-01-14T08:52:37Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR",
      "cond-mat.soft",
      "cond-mat.stat-mech",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.09189v1",
    "url": "https://arxiv.org/abs/2601.09189v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09189v1.pdf",
    "title": "Experimental verification of the conservation of the magnetic moment and the longitudinal invariant",
    "abstract": "Adiabatic invariants are fundamental to plasma physics but are often treated as purely theoretical concepts in undergraduate courses due to the difficulty of experimentally demonstrating them. This paper presents a pedagogical experiment to visualize and quantitatively verify the conservation of the magnetic moment ($μ$) and the longitudinal invariant ($J$) using a standard educational electron charge-to-mass ratio apparatus configured as a magnetic bottle. By analyzing long-exposure photographs of the electron beam trajectory, we reconstructed the helical motion and calculated the invariants under different magnetic field configurations. Our results verify the conservation of the longitudinal invariant ($J$) with a ratio of 0.98 between configurations. The magnetic moment ($μ$) exhibited a coefficient of variation of approximately 7\\%, a deviation consistent with the presence of collisional effects in the tube. These findings demonstrate that complex plasma dynamics can be effectively studied using accessible laboratory equipment, providing a valuable bridge between theory and experiment for physics students.",
    "authors": [
      "Juan Carlos Agurto",
      "Felipe Darmazo",
      "Amanda Guerra",
      "Erick Burgos-Parra"
    ],
    "published": "2026-01-14T05:42:02Z",
    "updated": "2026-01-14T05:42:02Z",
    "categories": [
      "physics.ed-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.ed-ph"
  },
  {
    "arxiv_id": "2601.09135v1",
    "url": "https://arxiv.org/abs/2601.09135v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09135v1.pdf",
    "title": "Transient fields in oblique scattering from an infinite planar dielectric interface -- a qubit lattice simulation",
    "abstract": "An initial value algorithm is utilized to examine the time dependent evolution of the electromagnetic fields arising from oblique scattering of bounded pulses from an infinite planar dielectric interface. Since the qubit lattice algorithm (QLA) is almost fully unitary, one finds excellent conservation of electromagnetic energy. Various Gaussian envelope pulses are considered in regimes where the incident angle is below that needed for total internal reflection. While the reflected pulse retains its overall Gaussian shape, the transmitted pulse exhibits a combination of a Gaussian envelope along with Huygen-like emitted wave fronts from the collision point of the initial pulse with the infinite dielectric interface. The strength of these Huygen wavefronts depends on the width of the incident pulse.",
    "authors": [
      "Min Soe",
      "George Vahala",
      "Linda Vahala",
      "Efstratios Koukoutsis",
      "Abhay K. Ram",
      "Kyriakos Hizanidis"
    ],
    "published": "2026-01-14T04:18:42Z",
    "updated": "2026-01-14T04:18:42Z",
    "categories": [
      "quant-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2601.09047v1",
    "url": "https://arxiv.org/abs/2601.09047v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09047v1.pdf",
    "title": "Unperturbed-orbit integration and the 3D kinetic dispersion relation of the electron cyclotron drift instability",
    "abstract": "High-frequency instabilities in crossed-field ($\\bm E\\times\\bm B$) plasmas are widely implicated in anomalous cross-field electron transport in Hall thrusters and related devices. Building on the fully kinetic 3D electrostatic dispersion relations reported by Ducrocq \\emph{et al.} and later by Lafleur \\emph{et al.}, we provide a concise, self-contained derivation of the key missing step: the magnetized-electron density perturbation $n_{e1}$ obtained from the linearized Vlasov equation via a retarded integration along unperturbed orbits, including finite-Larmor-radius effects and cyclotron harmonics. We collect the required mathematical identities in appendices and clarify the mapping between the Ducrocq Poisson-form and the Lafleur dielectric-form representations, including ion closures (cold-fluid versus kinetic Landau response). We conclude with a brief discussion of the assumptions and possible extensions toward more realistic configurations.",
    "authors": [
      "Yinjian Zhao"
    ],
    "published": "2026-01-14T00:30:22Z",
    "updated": "2026-01-14T00:30:22Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.11890v2",
    "url": "https://arxiv.org/abs/2510.11890v2",
    "pdf_url": "https://arxiv.org/pdf/2510.11890v2.pdf",
    "title": "Loading non-Maxwellian Velocity Distributions in Particle Simulations",
    "abstract": "Numerical procedures for generating non-Maxwellian velocity distributions in particle simulations are presented. First, Monte Carlo methods for an $(r,q)$ distribution that generalizes flattop and kappa distributions are discussed. Then, two rejection methods for the regularized kappa distribution are presented, followed by a comparison in the $κ$ space. A simple recipe is proposed for the subtracted kappa distribution. Properties and numerical recipes for the ring and shell distributions with a finite Gaussian width are discussed. The ring and shell Maxwellians are further introduced as alternatives to the ring and shell distributions. Finally, methods for the super-Gaussian and the filled-shell distributions are presented.",
    "authors": [
      "Seiji Zenitani",
      "Shunsuke Usami",
      "Shuichi Matsukiyo"
    ],
    "published": "2025-10-13T19:49:16Z",
    "updated": "2026-01-13T23:25:44Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.07652v2",
    "url": "https://arxiv.org/abs/2601.07652v2",
    "pdf_url": "https://arxiv.org/pdf/2601.07652v2.pdf",
    "title": "Role of Shafranov shift, zonal structures on the behavior of TAEs, AAEs and microinstabilities in the presence of energetic particles",
    "abstract": "In future nuclear fusion reactors, even a small fraction of fusion-born energetic particles (EP) about 100 times hotter than the thermal bulk species, contributes substantially to the kinetic pressure and therefore affect the MHD equilibrium, mainly via the Shafranov shift. In this work, we perform first-principles numerical simulations using the gyrokinetic, electromagnetic, global code ORB5 to study the effect of a self-consistent finite $β$ equilibrium on the arising Alfvén Eigenmodes (destabilized by EPs), Ion Temperature Gradient (ITG), and Kinetic Ballooning Modes (KBM) microturbulence (destabilized by thermal species). Linearly, we explore the complex interplay between EP fraction, bulk gradients and a self-consistent Shafranov shift on the plasma stability. We choose single toroidal mode numbers to represent the system's instabilities and study the characteristic nonlinear evolutions of TAEs, KBMs and ITGs separately and including the axisymmetric field response to each mode separately. This study focuses on the impact of Shafranov shift equilibrium consistency, as well as the self-generated zonal ${E \\times B}$ flows, the saturation levels and resulting heat and particle fluxes. In the ITG cases including the $n=0$ perturbations reduces turbulent fluxes, as expected, however, for the TAE cases including the $n=0$ perturbations is shown to enhance the fluxes. We show for the first time that Axisymmetric Alfvén Eigenmodes (AAEs) play a role in this mechanism.",
    "authors": [
      "B. Rofman",
      "G. Di Giannatale",
      "A. Mishchenko",
      "E. Lanti",
      "A. Bottino",
      "T. Hayward-Schneider",
      "J. N. Sama",
      "A. Biancalani",
      "B. F. McMillan",
      "S. Brunner",
      "L. Villard"
    ],
    "published": "2026-01-12T15:33:13Z",
    "updated": "2026-01-13T18:38:01Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2505.10754v3",
    "url": "https://arxiv.org/abs/2505.10754v3",
    "pdf_url": "https://arxiv.org/pdf/2505.10754v3.pdf",
    "title": "Conservative velocity mappings for discontinuous Galerkin kinetics",
    "abstract": "Continuum computational kinetic plasma models evolve the distribution function of a plasma species $f_s$ on a phase-space grid over time. In many problems of interest the distribution function has limited extent in velocity space; hence, using a uniform, highly refined mesh would be costly and slow. Nonuniform velocity grids can reduce the computational cost by placing more degrees of freedom where $f_s$ is appreciable and fewer where it is not. In this work we introduce a first-of-its kind discontinuous Galerkin approach to nonuniform velocity-space discretization using mapped velocity coordinates. This new method is presented in the context of a gyrokinetic model used to study magnetized plasmas. We create discretizations of collisionless and collisional terms using mappings in a way that exactly conserves particles and energy. Numerical tests of such properties are presented, and we show that this new discretization can reproduce earlier gyrokinetic simulations using grids with up to 6-60 times fewer cells and 22X-60X speed-ups depending on dimensionality, geometry and plasma parameters.",
    "authors": [
      "Manaure Francisquez",
      "Petr Cagas",
      "Akash Shukla",
      "James Juno",
      "Gregory W. Hammett"
    ],
    "published": "2025-05-15T23:47:41Z",
    "updated": "2026-01-13T17:08:02Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.02202v2",
    "url": "https://arxiv.org/abs/2506.02202v2",
    "pdf_url": "https://arxiv.org/pdf/2506.02202v2.pdf",
    "title": "Magnetic field dynamics in presence of Hall conductivity and thermo-diffusion",
    "abstract": "Anisotropy of kinetic coefficients in presence of a magnetic field is   represented by Hall currents, which appear in a collisional medium due to action of the Lorentz force on the charged particles between collisions.   We derive equations, describing dynamics of the magnetic field in presence of thermo-diffusion with Hall currents, using a standard electrodynamic consideration. The influence of the Hall currents, at presence of thermo-diffusion, on the magnetic field structure is considered in simple models. The equation is derived, which includes additional term for a seed magnetic field creation in the non-magnetized plasma, due to thermo-diffusion. This equation describes the action of the seed magnetic field creation by the mechanism known as \"Biermann battery\".",
    "authors": [
      "G. S. Bisnovatyi-Kogan",
      "M. V. Glushikhina"
    ],
    "published": "2025-06-02T19:41:56Z",
    "updated": "2026-01-13T13:39:45Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.08413v1",
    "url": "https://arxiv.org/abs/2601.08413v1",
    "pdf_url": "https://arxiv.org/pdf/2601.08413v1.pdf",
    "title": "High-power beyond extreme ultraviolet FEL radiation with flexible polarization at SHINE",
    "abstract": "Linac-based free-electron lasers (FELs) feature high brightness, narrow bandwidth, controllable polarization, and wide wavelength tunability. With the rapid development of superconducting radio-frequency technology, linacs can now operate at MHz-level repetition rates, enabling FELs with both high repetition rates and high average power. Beyond extreme ultraviolet (BEUV) radiation is of great interest for scientific research and industrial applications, especially for next-generation lithography. Owing to the main design parameters of SHINE, the generation of BEUV radiation is a natural capability of the facility. The BEUV characteristics at SHINE are investigated and its achievable performance as a high-average-power light source is evaluated. By applying undulator tapering to enhance the energy extraction efficiency, kilowatt-level BEUV radiation with controllable polarization is shown to be achievable. These results demonstrate that SHINE can provide a high-performance BEUV source, offering a realistic pathway toward a high-average-power light source for next-generation high-resolution lithography.",
    "authors": [
      "Hanxiang Yang",
      "Zhangfeng Gao",
      "Bingyang Yan",
      "Wencai Cheng",
      "Nanshun Huang",
      "Haixiao Deng"
    ],
    "published": "2026-01-13T10:32:20Z",
    "updated": "2026-01-13T10:32:20Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.08400v1",
    "url": "https://arxiv.org/abs/2601.08400v1",
    "pdf_url": "https://arxiv.org/pdf/2601.08400v1.pdf",
    "title": "Near-axis quasi-isodynamic database",
    "abstract": "In this work, we investigate the landscape of quasi-isodynamic stellarators using the near-axis expansion of the magnetic field. Building on recent theoretical developments, we construct a database of more than 800,000 stable, approximately quasi-isodynamic vacuum magnetic configurations. These configurations span a range of field period numbers and other geometric control parameters, including the magnetic axis shape and plasma elongation. To evaluate each configuration, we use a broad set of measures, including effective ripple, sensitivity of the Shafranov shift to changes in plasma beta, the prevalence of maximum-J trapped particles, and the Rosenbluth-Hinton residual, among others. This enables an exhaustive, thorough and quantitative characterization of the database. Statistical analysis and modern machine learning techniques are then employed to find correlations, and identify key descriptors and heuristics to help understand tendencies that govern the behaviour of numerical optimization. The database provides baseline configurations for further studies, and to serve as tailored initial conditions for optimization. With this work we initiate a long term program to complete a systematic exploration of quasi-isodynamic stellarator design space.",
    "authors": [
      "Eduardo Rodriguez",
      "Gabriel G. Plunk"
    ],
    "published": "2026-01-13T10:15:40Z",
    "updated": "2026-01-13T10:15:40Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.08384v1",
    "url": "https://arxiv.org/abs/2601.08384v1",
    "pdf_url": "https://arxiv.org/pdf/2601.08384v1.pdf",
    "title": "Electric field-driven Rayleigh-Taylor-like instability in binary complex plasma",
    "abstract": "This study uses two-dimensional molecular dynamics simulations to explore Rayleigh-Taylor-like instability in a strongly coupled binary complex plasma, when heavier dust particles are positioned above the lighter ones, having the same charge-to-mass ratio, in a planar configuration. Langevin dynamics simulations are used to study the evolution of perturbations at the interface between these two distinct species of charged dust particles, subject to an externally applied electric field and an equilibrium charge density gradient. We have performed analytical calculations to determine the growth rate of instability under both strongly coupled and weakly coupled dusty plasma regimes. These theoretical predictions are subsequently validated through molecular dynamics simulations, enabling the reproduction of the instability in a strongly coupled binary complex plasma. The instability in these cases ultimately causes mixing among the charged species. The study comprehensively analyzes the growth rate as a function of various system parameters, and it offers deeper insight into the underlying physical mechanisms.",
    "authors": [
      "Priya Deshwal",
      "Hitendra K. Malik"
    ],
    "published": "2026-01-13T09:48:42Z",
    "updated": "2026-01-13T09:48:42Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.08329v1",
    "url": "https://arxiv.org/abs/2601.08329v1",
    "pdf_url": "https://arxiv.org/pdf/2601.08329v1.pdf",
    "title": "Velocity-Space Signatures of Energy Transfer for Ion-Acoustic Instabilities",
    "abstract": "Context. Observations by Parker Solar Probe (PSP) of electrostatic waves suggest that electrostatic instabilities, including the ion-ion-acoustic instability (IIAI) frequently observed in the inner heliosphere, play an important role in plasma heating and particle acceleration. Aims. Our aim is to explore the application of single spacecraft diagnostics to the IIAI, in anticipation of application to the current missions operating in the inner heliosphere, e.g. PSP and Solar Orbiter. Methods. We apply the field-particle correlation (FPC) technique to fully kinetic simulations of IIAI. We characterize the conversion of energy between the electric field and particle species, allowing the differentiation between oscillatory and secular energy transfer to and from the particles and highlighting the role of resonant energy exchange. We then identify the characteristic IIAI signatures for the proton and electron distributions, and relate them to our previous knowledge of IIAI onset and energy exchange mechanisms. Results. Applying the FPC technique to our simulations run in parameters regime compatible with solar wind conditions, we have identified IIAI signatures that would enable efficient recognition of IIAI in observations. This task is left for future missions, since the time scale over which IIAI signatures develop is too fast for the sampling rates of current missions.",
    "authors": [
      "Mahmoud Saad Afify",
      "Kristopher G. Klein",
      "Mihailo M. Martinović",
      "Maria Elena Innocenti"
    ],
    "published": "2026-01-13T08:32:19Z",
    "updated": "2026-01-13T08:32:19Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.08313v1",
    "url": "https://arxiv.org/abs/2601.08313v1",
    "pdf_url": "https://arxiv.org/pdf/2601.08313v1.pdf",
    "title": "Interstellar Medium Modulation of Nonlinear Kinetic Alfvén Morphology in Structured Galactic Environments",
    "abstract": "We present a spatially dependent framework for the existence and propagation of nonlinear kinetic Alfvén (KA) structures in the interstellar medium (ISM). Using a multi-component analytical model that incorporates the diffuse warm ionized medium together with localized H II regions, supernova remnants (SNR), and stellar-wind bubbles (SWB), we derive location-dependent coefficients governing KA dispersion and nonlinearity. The reductive perturbation method is applied to obtain Korteweg-de Vries (KdV) equations, enabling the characterization of solitons under realistic astrophysical conditions. Numerical analysis demonstrates how superthermality, plasma $β$, temperature, and density gradients modulate soliton amplitude, width, and stability. Our results reveal distinct exclusion zones (EZs) for KA solitons in high-$β$ HII regions and SWB/SNR interiors, as well as ultra low-$β$ regions near central pulsar wind nebulae. While H II regions exhibit simple Gaussian-driven depletions, the complex ``hole-and-shell\" morphologies of SWBs and SNRs imprint sharp spatial variations and discontinuities on soliton properties. This study establishes a direct link between macroscopic ISM morphology, ion-kinetic scale dissipation, and the emergence of coherent Alfvénic activity, with implications for radio scattering, pulsar scintillation, and fine-scale signatures in astrophysical observations.",
    "authors": [
      "Manpreet Singh",
      "Siming Liu",
      "N. S. Saini"
    ],
    "published": "2026-01-13T08:10:48Z",
    "updated": "2026-01-13T08:10:48Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.08138v1",
    "url": "https://arxiv.org/abs/2601.08138v1",
    "pdf_url": "https://arxiv.org/pdf/2601.08138v1.pdf",
    "title": "The effect of surface quenching coefficients of $O_2(a^{1}Δg)$ and $O_2(b^{1}Σg^{+})$ on capacitively coupled $Ar$/$O_2$ discharge: A global/equivalent circuit model study",
    "abstract": "Capacitively coupled discharges operated in mixtures of $Ar$ and $O_2$ are extensively utilized in plasma etching and deposition processes due to the oxidative properties and precursor functionality of the reactive species produced in the discharge. In $Ar$/$O_2$ discharges, the surface quenching coefficient of $O_2(a^{1}Δg)$ is known to affect this metastable density, which, in turn, affects the electronegativity and other important plasma characteristics. In this work, in addition to $O_2(a^{1}Δg)$, $O_2(b^{1}Σg^{+})$ and its associated reactions are incorporated into a global/equivalent circuit model of an $Ar$/$O_2$ discharge. By independently adjusting the quenching coefficients of both metastable species, changes of these surface coefficients are found to significantly affect the discharge characteristics, indicating that the role of $O_2(b^{1}Σg^{+})$ cannot be neglected. The effects of their respective surface quenching coefficients of these metastables based on various wall materials on the discharge are revealed including their effects on different particle species densities, plasma impedance, voltage drops across the sheaths, as well as plasma power absorption.",
    "authors": [
      "Wan Dong",
      "Yi Wang",
      "Yi-Fan Zhang",
      "Yuan-Hong Song"
    ],
    "published": "2026-01-13T01:59:59Z",
    "updated": "2026-01-13T01:59:59Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.00365v2",
    "url": "https://arxiv.org/abs/2601.00365v2",
    "pdf_url": "https://arxiv.org/pdf/2601.00365v2.pdf",
    "title": "Influence of Cathode Boundary and Initial Electron Swarm Width on Electron Swarm Parameter Determination with the Pulsed Townsend Experiment",
    "abstract": "The Pulsed Townsend experiment enables the extraction of relevant electron transport properties in different gases such as the electron drift velocity $W$ (or equivalently the mobility $μ$), the longitudinal diffusion coefficient $D_{\\mathrm{L}}$, and the effective ionization rate $R_{\\mathrm{net}}$ (or equivalently the effective ionization coefficient $α_{\\mathrm{eff}}$). Existing analysis techniques lack an accurate representation of the experimental initial and boundary conditions. This work aims to provide an improved evaluation approach by appropriately considering both initial and boundary conditions in order to extract more accurate swarm parameters from measurement data. Simulative and experimental measurement results verify an increased evaluation accuracy. Furthermore, the longitudinal diffusion coefficient $D_{\\mathrm{L}}$ can now be accurately extracted from Pulsed Townsend measurements. The developed curve fitting code is made publicly available.",
    "authors": [
      "Mücahid Akbas"
    ],
    "published": "2026-01-01T14:53:12Z",
    "updated": "2026-01-12T23:20:03Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  }
]