{
  "arxiv_id": "2509.15320v2",
  "url": "https://arxiv.org/abs/2509.15320v2",
  "pdf_url": "https://arxiv.org/pdf/2509.15320v2.pdf",
  "title": "Anisotropic Cosmic Ray Transport in strong MHD Turbulence due to Magnetic Mirroring and Resonant Curvature Scattering",
  "abstract": "The transport of cosmic rays through turbulent astrophysical plasmas still constitutes an open problem. Building on recent progress, we study the combined effect of magnetic mirroring and resonant curvature scattering on parallel and perpendicular transport. We conduct test-particle simulations in snapshots of an anisotropic magnetohydrodynamics simulation with $δB/B_0\\sim 1$ and record magnetic moment variation and field line curvature around pitch-angle reversals. We find for strongly magnetized particles that (i) pitch-angle reversals may occur either in coherent regions of the field with small variation of the magnetic moment via magnetic mirroring or in chaotic regions of the field with strong variation of the magnetic moment via resonant curvature scattering; (ii) parallel transport can be modeled as a Lévy walk with a truncated power-law distribution based on pitch-angle reversal times; and (iii) perpendicular transport is enhanced by resonant curvature scattering in synergy with chaotic field line separation and diminished by magnetic mirroring due to confinement in locally ordered field line bundles. While magnetic mirroring constitutes the bulk of reversal events, resonant curvature scattering additionally acts on trajectories that fall in the loss cones of typical mirroring structures and thus provides the cut-off for the reversal time distribution. Our results, which highlight the role of the magnetic field line geometry in cosmic-ray transport processes, are consistent with energy-independent diffusion coefficients. We conclude by considering how energy-dependent observations could arise from an intermittently inhomogeneous interstellar medium.",
  "authors": [
    "Jeremiah Lübke",
    "Frederic Effenberger",
    "Mike Wilbert",
    "Horst Fichtner",
    "Rainer Grauer"
  ],
  "published": "2025-09-18T18:09:56Z",
  "updated": "2025-11-24T17:44:18Z",
  "categories": [
    "astro-ph.HE",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.HE"
}