{
  "arxiv_id": "2511.20979v1",
  "url": "https://arxiv.org/abs/2511.20979v1",
  "pdf_url": "https://arxiv.org/pdf/2511.20979v1.pdf",
  "title": "A Hands-On Workshop for Constructing a Low-Field MRI System in Three Days",
  "abstract": "Access to Magnetic Resonance Imaging system assembly knowledge can be expanded by leveraging open-source hardware and software, simplified installation requirements, and collaborative training initiatives. To this end, we conducted a three-day workshop to construct an operational 0.27T MRI scanner. The workshop hosted 16 participants, including faculty, postdoctoral fellows, trainers, and students, who collaborated to build the scanner using open-source hardware and software components. Teams were designated to focus on various subsystems, including the magnet, passive shimming, radiofrequency (RF) coils, gradient coils, data acquisition, and reconstruction. Pre-workshop preparation involved simulation-based design processes and fabrication techniques, which incorporated configuring MaRCoS and PyPulseq libraries, CNC machining, and 3D printing. During the workshop, participants assembled an H-shaped magnet, which achieved a peak magnetic field strength of 0.269T. Passive shimming effectively reduced the field inhomogeneity from 3mT to 2mT. A 3 cm diameter RF solenoid was built and tuned to 11.4 MHz. The gradients exhibited less than 5% non-linearity in simulations and were fabricated by CNC machining copper plates. The assembled system was used to acquire a 2D spin echo of a water phantom. Following the workshop, the system was further optimized to scan relaxometry phantoms. A post-workshop survey was carried out, revealing over 87% satisfaction. The constructed scanner represents a valuable platform for educational initiatives, pulse sequence development, and preclinical research imaging efforts.",
  "authors": [
    "Ivan Etoku Oiye",
    "Ajay Sharma",
    "Zinia Mohanta",
    "Dinil Sasi Sankaralayam",
    "Yuto Uchida",
    "Teni Akinwale",
    "Kexin Wang",
    "Zechen Xu",
    "Yifan Shuai",
    "Vu Dinh",
    "Sun Yuanqi",
    "Aruna Singh",
    "Dillip K. Senapati",
    "Luke Ikard",
    "Sandeep K. Ganji",
    "Joseph Reilly",
    "Michael Mcmahon",
    "Hanzhang Lu",
    "Peter Barker",
    "Jennifer Morrison",
    "Steven M. Ross",
    "Zaver Bhujwalla",
    "Sairam Geethanath"
  ],
  "published": "2025-11-26T02:13:09Z",
  "updated": "2025-11-26T02:13:09Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}