{
  "arxiv_id": "2511.20400v1",
  "url": "https://arxiv.org/abs/2511.20400v1",
  "pdf_url": "https://arxiv.org/pdf/2511.20400v1.pdf",
  "title": "Optimization of the X-Arapuca Photon Collection Efficiency for the DUNE Horizontal Drift Far Detector",
  "abstract": "The Deep Underground Neutrino Experiment (DUNE) Far Detector (FD) Photon Detection System (PDS) employs the X-Arapuca concept, a photon trapping system relying on reflective surfaces and dichroic filters. In this paper are reported measurements, performed at the University of Milano-Bicocca, aimed at increasing the FD Horizontal Drift (HD) PDS module efficiency. The baseline implementation of the X-Arapuca concept for the FD-HD PDS module is close to the DUNE requirements as demonstrated in the collaborations laboratory testing. However, an increased performance would provide a safety margin for a detector planned to be operated for 30 years, without possibility of performing maintenance. A higher detector performance would also benefit the DUNE low energy physics program. The already proven Milano-Bicocca setup has been utilized to test different PDS module configurations comparing them to the original baseline. Exploiting prior knowledge of the X-Arapuca components and Geant4 based optical simulations it has been possible to achieve up to an ~84% performance increase over the baseline design. In the following it is presented the testing procedure, the performed measurements and a brief discussion on the obtained results.",
  "authors": [
    "E. Bertolini",
    "C. Brizzolari",
    "F. Bruni",
    "P. Carniti",
    "C. M. Cattadori",
    "S. Copello",
    "E. Cristaldo",
    "M. Delgado",
    "F. Galizzi",
    "C. Gotti",
    "D. Guffanti",
    "A. A. Machado",
    "L. Malinverni",
    "L. Meazza",
    "F. Meinardi",
    "G. Pessina",
    "G. Raselli",
    "M. Rossella",
    "E. Segreto",
    "H. Souza",
    "F. Terranova",
    "D. Warner"
  ],
  "published": "2025-11-25T15:27:39Z",
  "updated": "2025-11-25T15:27:39Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}