[
  {
    "arxiv_id": "2307.06413v5",
    "url": "https://arxiv.org/abs/2307.06413v5",
    "pdf_url": "https://arxiv.org/pdf/2307.06413v5.pdf",
    "title": "Measurement of three-dimensional inclusive muon-neutrino charged-current cross sections on argon with the MicroBooNE detector",
    "abstract": "We report the measurement of the differential cross section $d^{2}σ(E_ν)/ d\\cos(θ_μ) dP_μ$ for inclusive muon-neutrino charged-current scattering on argon. This measurement utilizes data from 6.4$\\times10^{20}$ protons on target of exposure collected using the MicroBooNE liquid argon time projection chamber located along the Fermilab Booster Neutrino Beam with a mean neutrino energy of approximately 0.8~GeV. The mapping from reconstructed kinematics to truth quantities, particularly from reconstructed to true neutrino energy, is validated within uncertainties by comparing the distribution of reconstructed hadronic energy in data to that of the model prediction in different muon scattering angle bins after applying a conditional constraint from the muon momentum distribution in data. The success of this validation gives confidence that the missing energy in the MicroBooNE detector is well-modeled within uncertainties in simulation, enabling the unfolding to a three-dimensional measurement over muon momentum, muon scattering angle, and neutrino energy. The unfolded measurement covers an extensive phase space, providing a wealth of information useful for future liquid argon time projection chamber experiments measuring neutrino oscillations. Comparisons against a number of commonly used model predictions are included and their performance in different parts of the available phase-space is discussed.",
    "authors": [
      "MicroBooNE Collaboration",
      "P. Abratenko",
      "O. Alterkait",
      "D. Andrade Aldana",
      "L. Arellano",
      "J. Asaadi",
      "A. Ashkenazi",
      "S. Balasubramanian",
      "B. Baller",
      "G. Barr",
      "D. Barrow",
      "J. Barrow",
      "V. Basque",
      "O. Benevides Rodrigues",
      "S. Berkman",
      "A. Bhanderi",
      "A. Bhat",
      "M. Bhattacharya",
      "M. Bishai",
      "A. Blake",
      "B. Bogart",
      "T. Bolton",
      "J. Y. Book",
      "L. Camilleri",
      "Y. Cao",
      "D. Caratelli",
      "I. Caro Terrazas",
      "F. Cavanna",
      "G. Cerati",
      "Y. Chen",
      "J. M. Conrad",
      "M. Convery",
      "L. Cooper-Troendle",
      "J. I. Crespo-Anadon",
      "M. Del Tutto",
      "S. R. Dennis",
      "P. Detje",
      "A. Devitt",
      "R. Diurba",
      "Z. Djurcic",
      "R. Dorrill",
      "K. Duffy",
      "S. Dytman",
      "B. Eberly",
      "P. Englezos",
      "A. Ereditato",
      "J. J. Evans",
      "R. Fine",
      "O. G. Finnerud",
      "B. T. Fleming",
      "N. Foppiani",
      "W. Foreman",
      "D. Franco",
      "A. P. Furmanski",
      "D. Garcia-Gamez",
      "S. Gardiner",
      "G. Ge",
      "S. Gollapinni",
      "O. Goodwin",
      "E. Gramellini",
      "P. Green",
      "H. Greenlee",
      "W. Gu",
      "R. Guenette",
      "P. Guzowski",
      "L. Hagaman",
      "O. Hen",
      "R. Hicks",
      "C. Hilgenberg",
      "G. A. Horton-Smith",
      "Z. Imani",
      "B. Irwin",
      "R. Itay",
      "C. James",
      "X. Ji",
      "L. Jiang",
      "J. H. Jo",
      "R. A. Johnson",
      "Y. J. Jwa",
      "D. Kalra",
      "N. Kamp",
      "G. Karagiorgi",
      "W. Ketchum",
      "M. Kirby",
      "T. Kobilarcik",
      "I. Kreslo",
      "M. B. Leibovitch",
      "I. Lepetic",
      "J. -Y. Li",
      "K. Li",
      "Y. Li",
      "K. Lin",
      "B. R. Littlejohn",
      "H. Liu",
      "W. C. Louis",
      "X. Luo",
      "C. Mariani",
      "D. Marsden",
      "J. Marshall",
      "N. Martinez",
      "D. A. Martinez Caicedo",
      "A. Mastbaum",
      "N. McConkey",
      "V. Meddage",
      "J. Micallef",
      "K. Miller",
      "K. Mistry",
      "T. Mohayai",
      "A. Mogan",
      "M. Mooney",
      "A. F. Moor",
      "C. D. Moore",
      "L. Mora Lepin",
      "M. Moudgalya",
      "S. Mulleria Babu",
      "D. Naples",
      "A. Navrer-Agasson",
      "N. Nayak",
      "M. Nebot-Guinot",
      "J. Nowak",
      "N. Oza",
      "O. Palamara",
      "N. Pallat",
      "V. Paolone",
      "A. Papadopoulou",
      "V. Papavassiliou",
      "H. Parkinson",
      "S. F. Pate",
      "N. Patel",
      "Z. Pavlovic",
      "E. Piasetzky",
      "I. Ponce-Pinto",
      "I. Pophale",
      "S. Prince",
      "X. Qian",
      "J. L. Raaf",
      "V. Radeka",
      "A. Rafique",
      "M. Reggiani-Guzzo",
      "L. Ren",
      "L. Rochester",
      "J. Rodriguez Rondon",
      "M. Rosenberg",
      "M. Ross-Lonergan",
      "C. Rudolph von Rohr",
      "I. Safa",
      "G. Scanavini",
      "D. W. Schmitz",
      "A. Schukraft",
      "W. Seligman",
      "M. H. Shaevitz",
      "R. Sharankova",
      "J. Shi",
      "E. L. Snider",
      "M. Soderberg",
      "S. Soldner-Rembold",
      "J. Spitz",
      "M. Stancari",
      "J. St. John",
      "T. Strauss",
      "A. M. Szelc",
      "W. Tang",
      "N. Taniuchi",
      "K. Terao",
      "C. Thorpe",
      "D. Torbunov",
      "D. Totani",
      "M. Toups",
      "Y. -T. Tsai",
      "J. Tyler",
      "M. A. Uchida",
      "T. Usher",
      "B. Viren",
      "M. Weber",
      "H. Wei",
      "A. J. White",
      "Z. Williams",
      "S. Wolbers",
      "T. Wongjirad",
      "M. Wospakrik",
      "K. Wresilo",
      "N. Wright",
      "W. Wu",
      "E. Yandel",
      "T. Yang",
      "L. E. Yates",
      "H. W. Yu",
      "G. P. Zeller",
      "J. Zennamo",
      "C. Zhang"
    ],
    "published": "2023-07-12T19:11:52Z",
    "updated": "2025-11-26T18:56:23Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1016/j.physletb.2025.139939"
  },
  {
    "arxiv_id": "2508.10685v2",
    "url": "https://arxiv.org/abs/2508.10685v2",
    "pdf_url": "https://arxiv.org/pdf/2508.10685v2.pdf",
    "title": "Towards controlling electron charge with nanoparticle assisted laser wakefield accelerators",
    "abstract": "This study explores nanoparticle-assisted electron injection as a method for controlling beam charge in laser wakefield acceleration through particle-in-cell simulations. We systematically investigate how the material (Li through Au) and size (50-200 nm) of nanoparticles influence electron injection dynamics and beam charge. Our results demonstrate that beam charge (10-600 pC) can be effectively controlled by adjusting these parameters. We identify a saturation threshold in the nanoparticle electric field strength, beyond which beam charge depends on the total number of atoms in the nanoparticle rather than on the electron density after ionization. Significant electron injection occurs across multiple plasma wave periods with distribution patterns influenced by nanoparticle properties leading to increased beam charge but a broader energy spread. These findings offer practical guidelines for experimental implementation of nanoparticle-assisted injection in laser wakefield accelerators to tailor electron beam characteristics for various applications.",
    "authors": [
      "Alžběta Špádová",
      "Petr Valenta",
      "Sebastian Lorenz",
      "Michal Nevrkla",
      "Jaroslav Nejdl",
      "Gabriele M. Grittani",
      "Sergei V. Bulanov"
    ],
    "published": "2025-08-14T14:27:43Z",
    "updated": "2025-11-26T12:35:33Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.19583v2",
    "url": "https://arxiv.org/abs/2506.19583v2",
    "pdf_url": "https://arxiv.org/pdf/2506.19583v2.pdf",
    "title": "ConStellaration: A dataset of QI-like stellarator plasma boundaries and optimization benchmarks",
    "abstract": "Stellarators are magnetic confinement devices under active development to deliver steady-state carbon-free fusion energy. Their design involves a high-dimensional, constrained optimization problem that requires expensive physics simulations and significant domain expertise. Recent advances in plasma physics and open-source tools have made stellarator optimization more accessible. However, broader community progress is currently bottlenecked by the lack of standardized optimization problems with strong baselines and datasets that enable data-driven approaches, particularly for quasi-isodynamic (QI) stellarator configurations, considered as a promising path to commercial fusion due to their inherent resilience to current driven disruptions. Here, we release an open dataset of diverse QI-like stellarator plasma boundary shapes, paired with their ideal magnetohydrodynamic (MHD) equilibria and performance metrics. We generated this dataset by sampling a variety of QI fields and optimizing corresponding stellarator plasma boundaries. We introduce three optimization benchmarks of increasing complexity: (1) a single objective geometric optimization problem, (2) a \"simple-to-build\" QI stellarator, and (3) a multi-objective ideal-MHD stable QI stellarator that investigates trade-offs between compactness and coil simplicity. For every benchmark, we provide reference code, evaluation scripts, and strong baselines based on classical optimization techniques. Finally, we show how learned models trained on our dataset can efficiently generate novel, feasible configurations without querying expensive physics oracles. By openly releasing the dataset along with benchmark problems and baselines, we aim to lower the entry barrier for optimization and machine learning researchers to engage in stellarator design and to accelerate cross-disciplinary progress toward bringing fusion energy to the grid.",
    "authors": [
      "Santiago A. Cadena",
      "Andrea Merlo",
      "Emanuel Laude",
      "Alexander Bauer",
      "Atul Agrawal",
      "Maria Pascu",
      "Marija Savtchouk",
      "Enrico Guiraud",
      "Lukas Bonauer",
      "Stuart Hudson",
      "Markus Kaiser"
    ],
    "published": "2025-06-24T12:49:00Z",
    "updated": "2025-11-26T11:13:25Z",
    "categories": [
      "cs.LG",
      "physics.plasm-ph"
    ],
    "primary_category": "cs.LG"
  },
  {
    "arxiv_id": "2511.21154v1",
    "url": "https://arxiv.org/abs/2511.21154v1",
    "pdf_url": "https://arxiv.org/pdf/2511.21154v1.pdf",
    "title": "Impact of Cosmic Ray Distribution on the Growth and Saturation of Bell Instability",
    "abstract": "Cosmic rays (CRs) streaming in weakly magnetized plasmas can drive large-amplitude magnetic fluctuations via nonresonant streaming instability (NRSI), or Bell instability. Using one-dimensional kinetic simulations, we investigate how mono-energetic and power-law CR momentum distributions influence the growth and saturation of NRSI. The linear growth is governed solely by the CR current and is largely insensitive to the CR distribution. However, the saturation depends strongly on the CR distribution and is achieved through CR isotropization, which quenches the driving current. Mono-energetic CRs effectively amplify the magnetic field and isotropize. For power-law distributions, the lowest-energy CRs dominate current relaxation and magnetic growth, while the highest-energy CRs remain weakly scattered, limiting their contribution to saturation. In the absence of low-energy CRs, high-energy particles amplify magnetic fields effectively and isotropize. We provide a modified saturation prescription accounting for these effects and propose a layered CR-confinement scenario upstream of astrophysical shocks, relevant to particle acceleration to high energies.",
    "authors": [
      "Saikat Das",
      "Siddhartha Gupta",
      "Prateek Sharma"
    ],
    "published": "2025-11-26T08:14:02Z",
    "updated": "2025-11-26T08:14:02Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2511.20979v1",
    "url": "https://arxiv.org/abs/2511.20979v1",
    "pdf_url": "https://arxiv.org/pdf/2511.20979v1.pdf",
    "title": "A Hands-On Workshop for Constructing a Low-Field MRI System in Three Days",
    "abstract": "Access to Magnetic Resonance Imaging system assembly knowledge can be expanded by leveraging open-source hardware and software, simplified installation requirements, and collaborative training initiatives. To this end, we conducted a three-day workshop to construct an operational 0.27T MRI scanner. The workshop hosted 16 participants, including faculty, postdoctoral fellows, trainers, and students, who collaborated to build the scanner using open-source hardware and software components. Teams were designated to focus on various subsystems, including the magnet, passive shimming, radiofrequency (RF) coils, gradient coils, data acquisition, and reconstruction. Pre-workshop preparation involved simulation-based design processes and fabrication techniques, which incorporated configuring MaRCoS and PyPulseq libraries, CNC machining, and 3D printing. During the workshop, participants assembled an H-shaped magnet, which achieved a peak magnetic field strength of 0.269T. Passive shimming effectively reduced the field inhomogeneity from 3mT to 2mT. A 3 cm diameter RF solenoid was built and tuned to 11.4 MHz. The gradients exhibited less than 5% non-linearity in simulations and were fabricated by CNC machining copper plates. The assembled system was used to acquire a 2D spin echo of a water phantom. Following the workshop, the system was further optimized to scan relaxometry phantoms. A post-workshop survey was carried out, revealing over 87% satisfaction. The constructed scanner represents a valuable platform for educational initiatives, pulse sequence development, and preclinical research imaging efforts.",
    "authors": [
      "Ivan Etoku Oiye",
      "Ajay Sharma",
      "Zinia Mohanta",
      "Dinil Sasi Sankaralayam",
      "Yuto Uchida",
      "Teni Akinwale",
      "Kexin Wang",
      "Zechen Xu",
      "Yifan Shuai",
      "Vu Dinh",
      "Sun Yuanqi",
      "Aruna Singh",
      "Dillip K. Senapati",
      "Luke Ikard",
      "Sandeep K. Ganji",
      "Joseph Reilly",
      "Michael Mcmahon",
      "Hanzhang Lu",
      "Peter Barker",
      "Jennifer Morrison",
      "Steven M. Ross",
      "Zaver Bhujwalla",
      "Sairam Geethanath"
    ],
    "published": "2025-11-26T02:13:09Z",
    "updated": "2025-11-26T02:13:09Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.20951v1",
    "url": "https://arxiv.org/abs/2511.20951v1",
    "pdf_url": "https://arxiv.org/pdf/2511.20951v1.pdf",
    "title": "Isotope Production in Muon-Catalyzed-Fusion Systems",
    "abstract": "Producing valuable isotopes with high-flux high-energy neutrons generated by muon-catalyzed fusion ($μ$CF) reactions could substantially improve the economic prospects for muon-catalyzed fusion. Because no external heating is required for $μ$CF, heat flux constraints are significantly relaxed compared with fusion systems requiring external heating. This could allow $μ$CF to attain much higher neutron flux without breaching material heat flux limits. If muon production rates can be increased, $μ$CF systems employing transmutation could be viable well before energy breakeven is possible. For $μ$CF systems transmuting valuable isotopes, the required number of catalyzed fusion events per muon and muon energy generation cost can be relaxed by several orders of magnitude, making $μ$CF an attractive intense neutron source. We show an example $μ$CF system with a modest muon rate of $10^8$ muons / second could produce up to 0.5 mg of $^{225}$Ac per year - ten times current global supply - with a 10 gram $^{226}$Ra feedstock. As higher muon rate beams become available, many other radioisotope transmutation pathways become viable. These findings motivate the accelerated development of $μ$CF systems for neutron-driven isotope production before net energy generation is possible.",
    "authors": [
      "J. F. Parisi",
      "A. Rutkowski"
    ],
    "published": "2025-11-26T01:12:23Z",
    "updated": "2025-11-26T01:12:23Z",
    "categories": [
      "physics.plasm-ph",
      "nucl-ex",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.07127v3",
    "url": "https://arxiv.org/abs/2507.07127v3",
    "pdf_url": "https://arxiv.org/pdf/2507.07127v3.pdf",
    "title": "Amplitude Walk in Fast Timing: The Role of Dual Thresholds",
    "abstract": "We apply lessons from fast timing detector R$\\&$D to strategies for initial calibration of large timing arrays at future colliders. Detector R$\\&$D often benefits from detailed information about the sensor and front-end signal (waveform capture) as well as a quality time reference and tracking. On the other hand, the systems for charged particle (MIP) timing under construction for the CERN High Luminosity LHC log only limited information for each timing channel- usually amplitude and the time of the leading edge. Furthermore the high event rates certainly present a challenge for \\textit{in situ }calibration of the large (compared to intrinsic) time jitter of the leading edge with pulse amplitude- amplitude walk. In the examples presented here we find a simple linear dependence of walk on the inverse of the pulse slope at threshold for the dynamic range (in amplitude) suitable to charged particle timing. We present a straightforward calibration method for the small variation in the corresponding coefficient from channel-to-channel.",
    "authors": [
      "Sebastian White",
      "Alessio Boletti"
    ],
    "published": "2025-07-08T19:25:02Z",
    "updated": "2025-11-26T00:18:11Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.20912v1",
    "url": "https://arxiv.org/abs/2511.20912v1",
    "pdf_url": "https://arxiv.org/pdf/2511.20912v1.pdf",
    "title": "Analytical Approximations for Beamstrahlung at Very High Energy Electron-Positron Colliders",
    "abstract": "Among the many effects that occur in beam-beam electron-positron collisions at TeV energies, emission of hard synchrotron radiation, or beamstrahlung, has special importance. Beamstrahlung determines the energy spectrum of the most energetic electrons, positrons, and photons and supplies the initial condition for the calculation of all other QED processes. In this paper, we show that the description of beamstrahlung simplifies in the limit of large quantum parameter $Υ$, which is realized in 10 TeV collider designs. The beamstrahlung spectra for electrons and photons are given in terms of universal functions. We supply approximations to these functions that will be useful for more general studies of the beam-beam interaction at very high energies.",
    "authors": [
      "Dongxing He",
      "Arianna Formenti",
      "Spencer Gessner",
      "Michael Peskin"
    ],
    "published": "2025-11-25T23:01:18Z",
    "updated": "2025-11-25T23:01:18Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.20879v1",
    "url": "https://arxiv.org/abs/2511.20879v1",
    "pdf_url": "https://arxiv.org/pdf/2511.20879v1.pdf",
    "title": "Evaluating the Effective Segregation Coefficient in High-Purity Germanium (HPGe) Crystals for Ge Detector Development in Rare-Event Searches",
    "abstract": "The performance and scalability of rare-event physics experiments depend on large-volume, detector-grade high-purity germanium (HPGe) crystals with precise control of impurity segregation during growth. We report a detailed study of impurity distribution in a single Czochralski-grown HPGe crystal produced at University of South Dakota (USD). The crystal was sectioned longitudinally into 37 segments, enabling the first high-resolution and systematic mapping of dopant profiles along the length of a detector-grade HPGe boule. Hall-effect measurements were used to extract impurity concentrations for boron (B), aluminum (Al), gallium (Ga), and phosphorus (P) in each segment. From these data, we determine effective segregation coefficients ($K_{eff}$) and initial melt concentrations ($C_0$) for the dominant dopants and compare them with classical Burton-Prim-Slichter expectations. The results provide quantitative insight into impurity transport and melt-solid partitioning under realistic detector growth conditions. These findings inform process-optimization strategies for HPGe crystal pulling, improve impurity control along the boule, and support the reliable fabrication of large, low-background HPGe detectors for next-generation rare-event searches.",
    "authors": [
      "S. Chhetri",
      "D. -M. Mei",
      "S. Bhattarai",
      "N. Budhathoki",
      "A. Warren",
      "K. -M. Dong",
      "S. A. Panamaldeniya",
      "A. Prem"
    ],
    "published": "2025-11-25T21:50:58Z",
    "updated": "2025-11-25T21:50:58Z",
    "categories": [
      "physics.ins-det",
      "physics.app-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.20868v1",
    "url": "https://arxiv.org/abs/2511.20868v1",
    "pdf_url": "https://arxiv.org/pdf/2511.20868v1.pdf",
    "title": "Tungsten Germanide Single-Photon Detectors with Saturated Internal Detection Efficiency at Wavelengths up to 29 μm",
    "abstract": "Superconducting nanowire single-photon detectors (SNSPDs) are among the most sensitive single-photon detectors available and have the potential to transform fields ranging from infrared astrophysics to molecular spectroscopy. However, extending their performance into the mid-infrared spectral region - crucial for applications such as exoplanet transit spectroscopy and vibrational fingerprinting of molecules - has remained a major challenge, primarily due to material limitations and scalability constraints. Here, we report on the development of SNSPDs based on tungsten germanide, a novel material system that combines high infrared sensitivity with compatibility for large-scale fabrication. Our detectors exhibit saturated internal detection efficiency at wavelengths up to 29 $\\mathrm{μm}$. This advance enables scalable, high-performance single-photon detection in a spectral region that was previously inaccessible, opening new frontiers in remote sensing, thermal imaging, environmental monitoring, molecular physics, and astronomy.",
    "authors": [
      "Benedikt Hampel",
      "Daniel Kuznesof",
      "Andrew S. Mueller",
      "Sahil R. Patel",
      "Robert H. Hadfield",
      "Emma E. Wollman",
      "Matthew D. Shaw",
      "Dirk Schwarzer",
      "Alec M. Wodtke",
      "Khalid Hossain",
      "Allison V. Mis",
      "Alexana Roshko",
      "Richard P. Mirin",
      "Sae Woo Nam",
      "Varun B. Verma"
    ],
    "published": "2025-11-25T21:29:38Z",
    "updated": "2025-11-25T21:29:38Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.supr-con",
      "physics.app-ph",
      "physics.optics",
      "quant-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.20864v1",
    "url": "https://arxiv.org/abs/2511.20864v1",
    "pdf_url": "https://arxiv.org/pdf/2511.20864v1.pdf",
    "title": "Investigating the Timing Behavior of Compton Scattering in BGO for Time-of-Flight PET",
    "abstract": "Bismuth germanate (BGO) is gaining renewed attention as a viable material for hybrid Cherenkov/scintillation time-of-flight positron emission tomography (TOF-PET) detectors. While single-crystal studies have demonstrated excellent timing resolution by leveraging prompt Cherenkov photons, practical detector modules based on pixelated arrays introduce a high prevalence of inter-crystal scattering (InterCS) events, complicating timing accuracy. In this study, we experimentally investigated the impact of InterCS on BGO Cherenkov timing using a dual-pixel detector coupled to a segmented SiPM readout. Events were classified into full-energy deposition (FED; primary crystal 511 keV absorption), InterCS, and penetration types via energy-weighted positioning and validated using GATE simulations, which also revealed that over 25% of the experimentally identified full-energy events involved intra-crystal scatter (IntraCS). For InterCS events, the optimal timestamp selection was achieved by choosing the earlier of the two timestamps, yielding a coincidence timing resolution of 221 ps FWHM (831 ps FWTM)-markedly worse than the 184 ps (603 ps FWTM) obtained for FED events. Furthermore, prompt photon yield was found to decrease measurably due to energy splitting: InterCS events averaged 4.73 detected photons in the first 1 ns, compared to 5.76 for FED events. These results emphasize the importance of incorporating time-aware, per-pixel timestamping strategies in pixelated BGO TOF-PET systems to maintain optimal timing performance in the presence of scatter.",
    "authors": [
      "Minseok Yi",
      "Daehee Lee",
      "Alberto Gola",
      "Stefano Merzi",
      "Michele Penna",
      "Simon R. Cherry",
      "Jae Sung Lee",
      "Sun Il Kwon"
    ],
    "published": "2025-11-25T21:25:25Z",
    "updated": "2025-11-25T21:25:25Z",
    "categories": [
      "physics.ins-det",
      "physics.med-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.05791v2",
    "url": "https://arxiv.org/abs/2509.05791v2",
    "pdf_url": "https://arxiv.org/pdf/2509.05791v2.pdf",
    "title": "Energy partitioning in electrostatic discharge with variable series load resistor",
    "abstract": "This paper presents an experimental investigation into the energy partitioning of quasi-static electrostatic discharge (ESD) events in air, a scenario in which the discharge occurs across a fixed gap. We systematically characterize the energy transferred to a series victim load across a broad range of resistances (0.1 to 10,000Ohm) and circuit parameters, including capacitance and gap length. Our results show that the fraction of stored energy delivered to the victim load is largely independent of gap length. We demonstrate that the classic Rompe-Weizel spark resistance model effectively predicts the scaling of this energy transfer, establishing a clear link between spark resistance and energy partitioning. These findings provide a valuable, predictive framework for guiding safety requirements for sensitive electronic components and energetic materials and will inform the development of more accurate circuit models for ESD events.",
    "authors": [
      "Claudia A. M. Schrama",
      "Calvin Bavor",
      "P. David Flammer",
      "Charles G. Durfee"
    ],
    "published": "2025-09-06T17:59:03Z",
    "updated": "2025-11-25T20:45:26Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.16005v2",
    "url": "https://arxiv.org/abs/2508.16005v2",
    "pdf_url": "https://arxiv.org/pdf/2508.16005v2.pdf",
    "title": "Demonstrating a broadband Photon Detection Efficiency model on VUV sensitive Silicon Photomultipliers",
    "abstract": "We present a versatile analytic model describing Photon Detection Efficiency (PDE) for P-on-N silicon photomultipliers, with possible applications in device characterization, PDE extrapolation from limited data, simulation and design optimization. Using device specific parameters, SiPM PDE is modeled as a function of wavelength, angle of incidence, voltage, and a range of temperatures. By factoring the PDE into transmission and internal efficiency, the efficiency in liquid nobles or other dense media can be predicted. We present the measurement of the absolute PDE from 350 to 830~nm at 163~K for two VUV sensitive SiPMs: a Hamamatsu VUV4 and Fondazione Bruno Kessler VUV-HD Technology. Additional measurements of relative PDE versus angle are also included. We successfully fit the model to the data, compare with literature and show the model's predictive power by extrapolating PDE to new wavelengths and operation in liquid xenon and argon, which is useful for estimating the impact of external cross-talk in future large-scale experiments. Lastly we use the model investigate optimizing efficiency for specific applications in astroparticle physics and quantum computing.",
    "authors": [
      "Austin de St Croix",
      "Harry Lewis",
      "Kurtis Raymond",
      "Fabrice Retière",
      "Maia Henriksson-Ward",
      "Giacomo Gallina",
      "Nicholas Morrison",
      "Aileen Zhang"
    ],
    "published": "2025-08-21T23:44:27Z",
    "updated": "2025-11-25T19:25:19Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.20445v1",
    "url": "https://arxiv.org/abs/2511.20445v1",
    "pdf_url": "https://arxiv.org/pdf/2511.20445v1.pdf",
    "title": "Diffusion for Fusion: Designing Stellarators with Generative AI",
    "abstract": "Stellarators are a prospective class of fusion-based power plants that confine a hot plasma with three-dimensional magnetic fields. Typically framed as a PDE-constrained optimization problem, stellarator design is a time-consuming process that can take hours to solve on a computing cluster. Developing fast methods for designing stellarators is crucial for advancing fusion research. Given the recent development of large datasets of optimized stellarators, machine learning approaches have emerged as a potential candidate. Motivated by this, we present an open inverse problem to the machine learning community: to rapidly generate high-quality stellarator designs which have a set of desirable characteristics. As a case study in the problem space, we train a conditional diffusion model on data from the QUASR database to generate quasisymmetric stellarator designs with desirable characteristics (aspect ratio and mean rotational transform). The diffusion model is applied to design stellarators with characteristics not seen during training. We provide evaluation protocols and show that many of the generated stellarators exhibit solid performance: less than 5% deviation from quasisymmetry and the target characteristics. The modest deviation from quasisymmetry highlights an opportunity to reach the sub 1% target. Beyond the case study, we share multiple promising avenues for generative modeling to advance stellarator design.",
    "authors": [
      "Misha Padidar",
      "Teresa Huang",
      "Andrew Giuliani",
      "Marina Spivak"
    ],
    "published": "2025-11-25T16:17:12Z",
    "updated": "2025-11-25T16:17:12Z",
    "categories": [
      "cs.LG",
      "physics.plasm-ph"
    ],
    "primary_category": "cs.LG"
  },
  {
    "arxiv_id": "2511.20444v1",
    "url": "https://arxiv.org/abs/2511.20444v1",
    "pdf_url": "https://arxiv.org/pdf/2511.20444v1.pdf",
    "title": "Benchmarking the Use of BPM Quadrupole Moments to Measure Emittance",
    "abstract": "For the PIP-II program, transverse emittance in the Fermilab Booster must remain well controlled at higher bunch intensities. 4-plate beam position monitors (BPMs) have a small but measurable quadrupole moment, making it possible to infer transverse emittance. By compositing many BPMs together, it becomes possible to improve the quality of the quadrupole signal. The Fermilab Booster BPM system has been used to measure these quadrupole moments in the past year and derive emittances from them. Recent benchmarks show that the derived BPM emittances show similar emittance evolution and value to IPM and Multiwire data. This approach can both supplement and complement existing non-intercepting emittance monitors in accelerators.",
    "authors": [
      "M. A. Balcewicz",
      "C. Y. Tan"
    ],
    "published": "2025-11-25T16:17:05Z",
    "updated": "2025-11-25T16:17:05Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.18429/JACoW-NAPAC2025-MOP016"
  },
  {
    "arxiv_id": "2508.14917v2",
    "url": "https://arxiv.org/abs/2508.14917v2",
    "pdf_url": "https://arxiv.org/pdf/2508.14917v2.pdf",
    "title": "Scalable FPGA Framework for Real-Time Denoising in High-Throughput Imaging: A DRAM-Optimized Pipeline using High-Level Synthesis",
    "abstract": "High-throughput imaging workflows, such as Parallel Rapid Imaging with Spectroscopic Mapping (PRISM), generate data at rates that exceed conventional real-time processing capabilities. We present a scalable FPGA-based preprocessing pipeline for real-time denoising, implemented via High-Level Synthesis (HLS) and optimized for DRAM-backed buffering. Our architecture performs frame subtraction and averaging directly on streamed image data, minimizing latency through burst-mode AXI4 interfaces. The resulting kernel operates below the inter-frame interval, enabling inline denoising and reducing dataset size for downstream CPU/GPU analysis. Validated under PRISM-scale acquisition, this modular FPGA framework offers a practical solution for latency-sensitive imaging workflows in spectroscopy and microscopy.",
    "authors": [
      "Weichien Liao"
    ],
    "published": "2025-08-15T13:22:29Z",
    "updated": "2025-11-25T16:00:05Z",
    "categories": [
      "cs.AR",
      "cs.CV",
      "cs.DC",
      "eess.IV",
      "eess.SP",
      "physics.ins-det"
    ],
    "primary_category": "cs.AR"
  },
  {
    "arxiv_id": "2511.20424v1",
    "url": "https://arxiv.org/abs/2511.20424v1",
    "pdf_url": "https://arxiv.org/pdf/2511.20424v1.pdf",
    "title": "Planar Josephson junctions for sensors and electronics:Different geometry, new functionality",
    "abstract": "Josephson junctions are key elements in superconducting electronics. The most common type is the overlap (sandwich-type) junction, formed by vertically stacking two superconducting layers. In contrast, planar junctions are fabricated without overlap, at the edge of two superconducting films within a single plane. This geometric distinction has a significant impact on their physical properties. The planar geometry greatly enhances sensitivity to magnetic fields and improves impedance matching for terahertz (THz) devices. Its two-dimensional structure allows for simple and flexible electronic component design, enabling drastic miniaturization. Here I highlight recent advances in the application of planar junctions for novel technologies, including junction-on-cantilever sensors for super-resolution magnetic imaging, vortex-based memory cells, and programmable superconducting diodes. I will also discuss the general requirements, future perspectives, and key challenges in the evolving field of superconducting electronics.",
    "authors": [
      "Vladimir M. Krasnov"
    ],
    "published": "2025-11-25T15:51:19Z",
    "updated": "2025-11-25T15:51:19Z",
    "categories": [
      "cond-mat.supr-con",
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.supr-con"
  },
  {
    "arxiv_id": "2511.20417v1",
    "url": "https://arxiv.org/abs/2511.20417v1",
    "pdf_url": "https://arxiv.org/pdf/2511.20417v1.pdf",
    "title": "Future Colliders Comparative Evaluation -- Working Group Report",
    "abstract": "In anticipation of the completion of the High-Luminosity Large Hadron Collider (HL-LHC) programme by the end of 2041, CERN is preparing to launch a new major facility in the mid-2040s. According to the 2020 European Strategy for Particle Physics (ESPP), the highest-priority next collider is an electron-positron Higgs factory, followed in the longer term by a hadron-hadron collider at the highest achievable energy. The CERN directorate established a Future Colliders Comparative Evaluation working group in June 2023. This group brings together project leaders and domain experts to conduct a consistent evaluation of the Future Circular Collider (FCC) and alternative scenarios based on shared assumptions and standardized criteria. This report presents a comparative evaluation of proposed future collider projects submitted as input for the Update of the European Strategy for Particle Physics. These proposals are compared considering main performance parameters, environmental impact and sustainability, technical maturity, cost of construction and operation, required human resources, and realistic implementation timelines. An overview of the international collider projects within a similar timeframe, notably the CEPC in China and the ILC in Japan is also presented, as well as a short review of the status and prospects of new accelerator techniques.",
    "authors": [
      "G. Arduini",
      "M. Benedikt",
      "F. Gianotti",
      "K. Jakobs",
      "M. Lamont",
      "R. Losito",
      "M. Meddahi",
      "J. Mnich",
      "N. Mounet",
      "D. Schulte",
      "F. Sonnemann",
      "S. Stapnes",
      "F. Zimmermann"
    ],
    "published": "2025-11-25T15:41:09Z",
    "updated": "2025-11-25T15:41:09Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.02301v2",
    "url": "https://arxiv.org/abs/2510.02301v2",
    "pdf_url": "https://arxiv.org/pdf/2510.02301v2.pdf",
    "title": "Relativistic Jets and Winds in Radio-Identified Supermassive Black Hole Binary Candidates",
    "abstract": "Supermassive black hole binary systems (SMBHBs) are thought to emit the recently discovered nHz gravitational wave background; however, not a single individual nHz source has been confirmed to date. Long-term radio-monitoring at the Owens Valley Radio Observatory has revealed two potential SMBHB candidates: blazars PKS 2131-021 and PKS J0805-0111. These sources show periodic flux density variations across the electromagnetic spectrum, signaling the presence of a good clock. To explain the emission, we propose a generalizable jet model, where a mildly relativistic wind creates an outward-moving helical channel, along which the ultra-relativistic jet propagates. The observed flux variation from the jet is mostly due to aberration. The emission at lower frequency arises at larger radius and its variation is consequently delayed, as observed. Our model reproduces the main observable features of both sources and can be applied to other sources as they are discovered. We make predictions for radio polarization, direct imaging, and emission line variation, which can be tested with forthcoming observations. Our results motivate future numerical simulations of jetted SMBHB systems and have implications for the fueling, structure, and evolution of blazar jets.",
    "authors": [
      "Andrew G. Sullivan",
      "Roger D. Blandford",
      "Anna Synani",
      "Philipe V. de la Parra",
      "Noémie Globus",
      "Mitchell C. Begelman",
      "Anthony C. S. Readhead"
    ],
    "published": "2025-10-02T17:59:08Z",
    "updated": "2025-11-25T15:33:33Z",
    "categories": [
      "astro-ph.HE",
      "astro-ph.GA",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2511.20400v1",
    "url": "https://arxiv.org/abs/2511.20400v1",
    "pdf_url": "https://arxiv.org/pdf/2511.20400v1.pdf",
    "title": "Optimization of the X-Arapuca Photon Collection Efficiency for the DUNE Horizontal Drift Far Detector",
    "abstract": "The Deep Underground Neutrino Experiment (DUNE) Far Detector (FD) Photon Detection System (PDS) employs the X-Arapuca concept, a photon trapping system relying on reflective surfaces and dichroic filters. In this paper are reported measurements, performed at the University of Milano-Bicocca, aimed at increasing the FD Horizontal Drift (HD) PDS module efficiency. The baseline implementation of the X-Arapuca concept for the FD-HD PDS module is close to the DUNE requirements as demonstrated in the collaborations laboratory testing. However, an increased performance would provide a safety margin for a detector planned to be operated for 30 years, without possibility of performing maintenance. A higher detector performance would also benefit the DUNE low energy physics program. The already proven Milano-Bicocca setup has been utilized to test different PDS module configurations comparing them to the original baseline. Exploiting prior knowledge of the X-Arapuca components and Geant4 based optical simulations it has been possible to achieve up to an ~84% performance increase over the baseline design. In the following it is presented the testing procedure, the performed measurements and a brief discussion on the obtained results.",
    "authors": [
      "E. Bertolini",
      "C. Brizzolari",
      "F. Bruni",
      "P. Carniti",
      "C. M. Cattadori",
      "S. Copello",
      "E. Cristaldo",
      "M. Delgado",
      "F. Galizzi",
      "C. Gotti",
      "D. Guffanti",
      "A. A. Machado",
      "L. Malinverni",
      "L. Meazza",
      "F. Meinardi",
      "G. Pessina",
      "G. Raselli",
      "M. Rossella",
      "E. Segreto",
      "H. Souza",
      "F. Terranova",
      "D. Warner"
    ],
    "published": "2025-11-25T15:27:39Z",
    "updated": "2025-11-25T15:27:39Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.01957v2",
    "url": "https://arxiv.org/abs/2510.01957v2",
    "pdf_url": "https://arxiv.org/pdf/2510.01957v2.pdf",
    "title": "Numerical tests of formulae for volume enclosed by flux surfaces of integrable magnetic fields",
    "abstract": "Numerical tests of volume formulae are presented to compute efficiently the volume enclosed between flux surfaces for integrable 3D vector fields with various degrees of symmetry. In the process, a new case is proposed and tested.",
    "authors": [
      "David Martinez-del-Rio",
      "Robert S. MacKay"
    ],
    "published": "2025-10-02T12:24:41Z",
    "updated": "2025-11-25T15:05:27Z",
    "categories": [
      "math.DS",
      "physics.plasm-ph"
    ],
    "primary_category": "math.DS",
    "doi": "10.3390/math13233772"
  },
  {
    "arxiv_id": "2406.12869v3",
    "url": "https://arxiv.org/abs/2406.12869v3",
    "pdf_url": "https://arxiv.org/pdf/2406.12869v3.pdf",
    "title": "Graph Neural Network-Based Pipeline for Track Finding in the Velo at LHCb",
    "abstract": "Over the next decade, increases in instantaneous luminosity and detector granularity will amplify the amount of data that has to be analysed by high-energy physics experiments, whether in real time or offline, by an order of magnitude. The reconstruction of charged particle tracks, which has always been a crucial element of offline data processing pipelines, must increasingly be deployed from the very first stages of the real time processing to enable experiments to achieve their physics goals. Graph Neural Networks (GNNs) have received a great deal of attention in the community because their computational complexity scales nearly linearly with the number of hits in the detector, unlike conventional algorithms which often scale quadratically or worse. This paper presents ETX4VELO, a GNN-based track-finding pipeline tailored for the Run 3 LHCb experiment's Vertex Locator, in the context of LHCb's fully GPU-based first-level trigger system, Allen. Currently implemented in Python, ETX4VELO offers the ability to reconstruct tracks with shared hits using a novel triplet-based method. When benchmarked against the traditional track-finding algorithm in Allen, this GNN-based approach not only matches but occasionally surpasses its physics performance. In particular, the fraction of fake tracks is reduced from over 2% to below 1% and the efficiency to reconstruct electrons is improved. While achieving comparable physics performance is a milestone, the immediate priority remains implementing ETX4VELO in Allen in order to determine and optimise its throughput, to meet the demands of this high-rate environment.",
    "authors": [
      "Anthony Correia",
      "Fotis I. Giasemis",
      "Nabil Garroum",
      "Vladimir Vava Gligorov",
      "Bertrand Granado"
    ],
    "published": "2024-04-23T14:34:01Z",
    "updated": "2025-11-25T14:38:23Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "physics.data-an"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.20346v1",
    "url": "https://arxiv.org/abs/2511.20346v1",
    "pdf_url": "https://arxiv.org/pdf/2511.20346v1.pdf",
    "title": "Microphysical boundary condition for the electron kinetics of a plasma",
    "abstract": "We derive and implement a suitable boundary condition for the kinetic description of the electrons inside a plasma, which takes into account microphysical processes inside the wall. It is based on the surface scattering kernel, which describes the scattering cascade of the electron in the solid and the excitation of secondary electrons. The resulting boundary condition is inelastic, angle- and energy-dependent. The implementation for a Boltzmann equation solved by a Legendre polynomial expansion method is presented, elucidating the modest additional computational cost of the new boundary condition. Results, indicating the influence of the inelasticity, are shown for the example of a silicon wall facing argon, helium and oxygen plasmas, but the described construction is also valid for other materials. An effective reflection coefficient is defined to compare the results with previously used boundary conditions.",
    "authors": [
      "Felix Willert",
      "Clemens Hoyer",
      "Gordon K. Grubert",
      "Franz X. Bronold"
    ],
    "published": "2025-11-25T14:25:15Z",
    "updated": "2025-11-25T14:25:15Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.20337v1",
    "url": "https://arxiv.org/abs/2511.20337v1",
    "pdf_url": "https://arxiv.org/pdf/2511.20337v1.pdf",
    "title": "The PLUTO Code on GPUs: A First Look at Eulerian MHD Methods",
    "abstract": "We present preliminary performance results of gPLUTO, the new GPU-optimized implementation of the PLUTO code for computational plasma astrophysics. Like its predecessor, gPLUTO employs a finite-volume formulation to numerically solve the equations of magnetohydrodynamics (MHD) in multiple spatial dimensions. Still, this new implementation is a complete rewrite in C++ and leverages the OpenACC programming model to achieve acceleration on NVIDIA GPUs. While a more comprehensive description of the code and its several other modules will be presented in a future paper, here we focus on some preparatory results that demonstrate the code potential and performance on pre exa-scale parallel architectures.",
    "authors": [
      "Marco Rossazza",
      "Andrea Mignone",
      "Matteo Bugli",
      "Stefano Truzzi",
      "Lubomir Riha",
      "Tomas Panoc",
      "Ondrej Vysocky",
      "Nitin Shukla",
      "Alessandro Romeo",
      "Vittoria Berta"
    ],
    "published": "2025-11-25T14:15:25Z",
    "updated": "2025-11-25T14:15:25Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.20219v1",
    "url": "https://arxiv.org/abs/2511.20219v1",
    "pdf_url": "https://arxiv.org/pdf/2511.20219v1.pdf",
    "title": "Evaluating a Transition-jump System for the Fermilab Main Injector Using Xsuite",
    "abstract": "We describe an Xsuite simulation framework for the Fermilab Main Injector (MI) along with an evaluation of transition-crossing behaviors in the accelerator. In particular, we studied the introduction of quadrupole magnets into the lattice as part of a transition-jump system that will be implemented through the $2^{nd}$ Proton Improvement Plan (PIP-II). Simulated beam losses spurred by transition-induced instabilities were assessed under several systematic effects, including MI quad errors, magnet-to-magnet variability in the jump magnets, power-supply errors, and timing jitter.",
    "authors": [
      "A. P. Schreckenberger",
      "R. Ainsworth",
      "M. Xiao"
    ],
    "published": "2025-11-25T11:47:06Z",
    "updated": "2025-11-25T11:47:06Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.18429/JACoW-NAPAC2025-THP031"
  },
  {
    "arxiv_id": "2504.20128v2",
    "url": "https://arxiv.org/abs/2504.20128v2",
    "pdf_url": "https://arxiv.org/pdf/2504.20128v2.pdf",
    "title": "Gas-cell development for nuclear astrophysics motivated studies on noble gas targets and the $^3$He($α$,$γ$)$^7$Be reaction",
    "abstract": "In many astrophysical scenarios, alpha induced reactions on noble gas nuclei play a crucial role. Studying these reactions in the laboratory requires the noble gas atoms to be confined in a sufficient amount to allow the reactions. At Atomki thin-windowed gas-cell targets were developed and improved for studying alpha induced reactions on noble gases. Several stages of the gas-cell design used for activation experiments and lately a version to be used for particle scattering experiments will be presented.   A new experimental study of the $^3$He($α$,$γ$)$^7$Be reaction with one of the activation gas-cell targets was performed. This reaction plays an important role both in the solar pp-chains and in big bang nucleosynthesis. The reaction cross section was measured in the past in several works, however, there are still energy regions lacking experimental data, rendering the extrapolations towards the astrophysically relevant energies uncertain. New experimental total cross section of the $^3$He($α$,$γ$)$^7$Be reaction was thus determined here in the energy range of $E_\\mathrm{c.m.} = 2600-3000$ keV in about 50 keV energy steps. These results confirm the overall trend, and also the absolute scale set by the only one previous measurement in this energy range.   In addition, two pilot experiments with the scattering cell were performed aiming to study the $^4$He($α$,$α$)$^4$He and $^{124}$Xe($α$,$α$)$^{124}$Xe reactions at $E_α= 18$ MeV. These studies benchmark the performance of the cell and detection system both for light and heavy noble gas targets.",
    "authors": [
      "Á. Tóth",
      "Z. Elekes",
      "Zs. Fülöp",
      "Gy. Gyürky",
      "Z. Halász",
      "M. M. Juhász",
      "G. G. Kiss",
      "S. R. Kovács",
      "Zs. Mátyus",
      "T. N. Szegedi",
      "T. Szücs"
    ],
    "published": "2025-04-28T17:11:10Z",
    "updated": "2025-11-25T10:49:12Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2503.11285v3",
    "url": "https://arxiv.org/abs/2503.11285v3",
    "pdf_url": "https://arxiv.org/pdf/2503.11285v3.pdf",
    "title": "Knock Out Slow Extraction Using Betatron Sidebands at High Harmonics",
    "abstract": "Radio frequency knock out resonant slow extraction is a standard method for extracting stored particle beams from synchrotrons by transverse excitation. Excitation signals comprising many betatron sidebands have shown to reduce intensity fluctuations of the extracted beam spill and are used at several facilities. In this contribution, the effect of individual sidebands at different harmonics on the spill quality is systematically studied using efficient noise excitation signals fully covering the respective sidebands. Particle tracking simulations show a clear correlation between the chosen excitation frequency and the spill quality. This relation is attributed to the spectrum of particle motion shortly before their extraction, and an empiric relation between the spectrum, the excitation frequency, and the resulting spill quality is given. Experiments show an additional reduction of pile-up when using higher excitation frequencies. These insights have implications for an optimal design of excitation waveforms and hardware for Knock Out extraction systems.",
    "authors": [
      "Philipp Niedermayer",
      "Rahul Singh",
      "Eike Feldmeier",
      "Christian Schömers",
      "Marcel Hun"
    ],
    "published": "2025-03-14T10:46:10Z",
    "updated": "2025-11-25T08:56:06Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.20040v1",
    "url": "https://arxiv.org/abs/2511.20040v1",
    "pdf_url": "https://arxiv.org/pdf/2511.20040v1.pdf",
    "title": "Collisionless Shocks Mediated by Shear-Flow Magnetic Fields in Ultraintense-Laser-Produced Counter-Streaming Plasmas",
    "abstract": "The formation of ion-Weibel-mediated collisionless shocks (IW-CSs) in ultraintense-laser-produced counter-streaming plasmas is investigated using particle-in-cell simulations. Analysis of the underlying microphysics reveals that a shear-flow ion-Weibel instability generates magnetic fields, which isotropize the incoming flow and mediate shock formation. An analytical expression for the shear-flow magnetic field is derived, and a scaling law relating the magnetic field amplitude to the laser intensity is established. This mechanism reduces the shock formation time and the required laser energy by three and two orders of magnitude, respectively, compared to high-power laser experiments, making it feasible to produce IW-CSs using existing multi-kilojoule, picosecond ultraintense laser facilities.",
    "authors": [
      "Jun-Yi Lu",
      "Kai Wang",
      "Jin-Long Jiao"
    ],
    "published": "2025-11-25T08:10:07Z",
    "updated": "2025-11-25T08:10:07Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.20024v1",
    "url": "https://arxiv.org/abs/2511.20024v1",
    "pdf_url": "https://arxiv.org/pdf/2511.20024v1.pdf",
    "title": "Investigation of Inverse Bremsstrahlung Heating Driven by Broadband Lasers",
    "abstract": "Broadband lasers have become a key strategy for mitigating laser plasma instabilities in inertial confinement fusion, yet their impact on collisional inverse bremsstrahlung (IB) heating remains unclear. Using one-dimensional collisional particle-in-cell simulations, we systematically examine the effect of bandwidth-induced temporal incoherence on IB absorption in Au plasmas. The simulations are first benchmarked against classical absorption theory, verifying that the implemented Coulomb collision model accurately reproduces the theoretical IB heating rate. A direct comparison of the electron temperature evolution in the broadband and monochromatic cases shows that, although spectral broadening introduces transient picosecond-scale oscillations in the heating rate driven by stochastic intensity fluctuations, the long-term averaged heating and net IB absorption remain essentially unchanged.",
    "authors": [
      "Xiaoran Li",
      "Jie Qiu",
      "Liang Hao",
      "Chen Wang",
      "Lifeng Wang",
      "Shiyang Zou"
    ],
    "published": "2025-11-25T07:50:13Z",
    "updated": "2025-11-25T07:50:13Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.19817v1",
    "url": "https://arxiv.org/abs/2511.19817v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19817v1.pdf",
    "title": "Calibration Plan for the SBC 10-kg Liquid Argon Detector with 100 eV Target Threshold",
    "abstract": "The Scintillating Bubble Chamber (SBC) Collaboration is designing a new generation of low background, noble liquid bubble chamber experiments with sub-keV nuclear recoil threshold. These experiments combine the electronic recoil blindness of a bubble chamber with the energy resolution of noble liquid scintillation, and maintain electron recoil discrimination at higher degrees of superheat (lower nuclear recoil thresholds) than Freon-based bubble chambers. A 10-kg liquid argon bubble chamber has the potential to set world leading limits on the dark matter nucleon cross-section for $O(\\mathrm{GeV}/c^{2})$ masses, and to perform a high statistics coherent elastic neutrino nuclear scattering measurement with reactor neutrinos. This work presents a detailed calibration plan to measure the detector response of these experiments, combining photoneutron scattering with two new techniques to induce sub-keV nuclear recoils: nuclear Thomson scattering and thermal neutron capture.",
    "authors": [
      "SBC collaboration"
    ],
    "published": "2025-11-25T01:14:36Z",
    "updated": "2025-11-25T01:14:36Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.19807v1",
    "url": "https://arxiv.org/abs/2511.19807v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19807v1.pdf",
    "title": "Beam Steering and Radiation Generation of Electrons in Bent Crystals in the Sub-GeV Domain",
    "abstract": "We present an investigation into beam steering and radiation emission by sub-GeV electrons traversing bent silicon crystals. Using 855, 600, and 300~MeV electron beams at the Mainz Microtron (MAMI), we explored orientational coherent effects and particle dynamics in a 15~$μ$m-thick crystal bent along the (111) planes. Combined experimental and simulation analyses enabled the classification and quantitative assessment of the contributions from channeling, dechanneling, rechanneling, and volume capture to both beam deflection and radiation emission. Crystal steering remained effective even at 300~MeV, with measured channeling efficiencies exceeding 50\\%, a record at such low energy. Channeling and volume reflection enhanced radiation emission by up to a factor of six compared to the misaligned orientation, highlighting strong orientational coherence effects in the sub-GeV regime. These findings confirm the feasibility of using bent crystals for efficient beam manipulation and high-intensity photon generation at low energies, supporting the development of novel light sources and beam control strategies at accelerator facilities operating in this energy range.",
    "authors": [
      "R. Negrello",
      "M. Romagnoni",
      "A. Sytov",
      "N. Canale",
      "D. De Salvador",
      "P. Fedeli",
      "V. Guidi",
      "V. V. Haurylavets",
      "P. Klag",
      "W. Lauth",
      "L. Malagutti",
      "A. Mazzolari",
      "G. Paternò",
      "F. Sgarbossa",
      "M. Soldani",
      "V. V. Tikhomirov",
      "D. Valzani",
      "L. Bandiera"
    ],
    "published": "2025-11-25T00:27:49Z",
    "updated": "2025-11-25T00:27:49Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.19772v1",
    "url": "https://arxiv.org/abs/2511.19772v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19772v1.pdf",
    "title": "Analog Signal Multiplexing System for the Iota Proton Injector",
    "abstract": "The Fermilab Accelerator Science and Technology (FAST) Facility at FNAL is a dedicated research and development center focused on advancing particle accelerator technologies for future applications worldwide. Currently, a key objective of FAST Operations is to commission the 2.5&#8239;MeV IOTA Proton Injector (IPI) and enable proton injection into the Integrable Optics Test Accelerator (IOTA) storage ring. The low and medium-energy sections of the IPI include four frame-style dipole trims and two multi-function correctors with independently controlled coils, requiring readout of 32 analog channels for current and voltage monitoring in total. To reduce cost and optimize rack space within the PLC-based control system, a 32-to-4 analog signal multiplexing system was designed and implemented. This system enables real-time readback of excitation parameters from all magnetic correctors. This paper presents the design, construction, implementation, and performance of the multiplexing system.",
    "authors": [
      "Daniel R. MacLean",
      "Dean R. Edstrom"
    ],
    "published": "2025-11-24T22:57:09Z",
    "updated": "2025-11-24T22:57:09Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.18429/JACoW-NAPAC2025-MOP004"
  },
  {
    "arxiv_id": "2302.11369v2",
    "url": "https://arxiv.org/abs/2302.11369v2",
    "pdf_url": "https://arxiv.org/pdf/2302.11369v2.pdf",
    "title": "Direct Optimization of Fast-Ion Confinement in Stellarators",
    "abstract": "Confining energetic ions such as alpha particles is a prime concern in the design of stellarators. However, directly measuring alpha confinement through numerical simulation of guiding-center trajectories has been considered to be too computationally expensive and noisy to include in the design loop, and instead has been most often used only as a tool to assess stellarator designs post hoc. In its place, proxy metrics, simplified measures of confinement, have often been used to design configurations because they are computationally more tractable and have been shown to be effective. Despite the success of proxies, it is unclear what is being sacrificed by using them to design the device rather than relying on direct trajectory calculations. In this study, we optimize stellarator designs for improved alpha particle confinement without the use of proxy metrics. In particular, we numerically optimize an objective function that measures alpha particle losses by simulating alpha particle trajectories. While this method is computationally expensive, we find that it can be used successfully to generate configurations with low losses.",
    "authors": [
      "David Bindel",
      "Matt Landreman",
      "Misha Padidar"
    ],
    "published": "2023-02-22T13:39:33Z",
    "updated": "2025-11-24T20:06:13Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1088/1361-6587/acd141"
  },
  {
    "arxiv_id": "2511.19658v1",
    "url": "https://arxiv.org/abs/2511.19658v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19658v1.pdf",
    "title": "Mechanical Design of the PIP-II ORBUMP Pulsed Dipole Magnet",
    "abstract": "The Proton Improvement Plan II (PIP-II) project is a vital upgrade to the Fermilab accelerator complex. The magnet pulse rate of the PIP-II Injection system requires an increase from the current rate of 15 Hz to 20 Hz as well as a roughly 30% increase in the magnetic field of the new Orbital Bump (ORBUMP) pulsed dipole magnets in the Booster. The ORBUMP magnet mechanical design is presented in this paper. The ORBUMP magnet is secured in a vacuum box and the core is made up of 0.127 mm thick, low carbon steel laminations with a C-5 inorganic magnesium phosphate coating. The core is clamped using external tie bars welded to the core end plates. ANSYS Finite Element Analysis (FEA) was used to evaluate the clamping design to minimize the deflection of the core post welding of the tie bars. The water-cooled, single turn coil, which shapes the magnetic field by acting as the pole tips, is critical for the integrated field homogeneity. The coil manufacturing tolerances and fabrication techniques were evaluated to ensure the magnetic properties of the magnet could be obtained. The coil is electrically isolated from the core using virgin Polyether ether ketone (PEEK) insulating material in the gap. An investigation into the high voltage performance of the virgin PEEK insulator was conducted via partial discharge testing using a 1:1 scale sample.",
    "authors": [
      "D. Karas",
      "K. Badgley",
      "Z. Chen",
      "V. Chernenok",
      "M. Davidson",
      "D. Harding",
      "D. Johnson",
      "V. Kashikhin",
      "W. Robotham",
      "T. Strauss",
      "B. Szabo",
      "J. Vander Meulen"
    ],
    "published": "2025-11-24T19:44:58Z",
    "updated": "2025-11-24T19:44:58Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2109.08873v3",
    "url": "https://arxiv.org/abs/2109.08873v3",
    "pdf_url": "https://arxiv.org/pdf/2109.08873v3.pdf",
    "title": "Formulation and verification of multiscale gyrokinetic simulation of kinetic-MHD processes in toroidal plasmas",
    "abstract": "A comprehensive gyrokinetic simulation model has been implemented in the global toroidal gyrokinetic code (GTC) and verified for studying low-frequency waves and turbulence in magnetic fusion plasmas by treating all kinetic-MHD processes on an equal footing. A theoretical framework has been formulated to unify various methods for efficiently solving the electron drift kinetic equation in multiscale simulations by separating electron responses into analytic and non-analytic parts based on the smallness parameter of electron-to-ion mass ratio. The model can be reduced to the ideal MHD model with both the linear dispersion relation and the nonlinear ponderomotive force in theory and simulation. The model is used for the verification and validation of simulating internal kink modes in the DIII-D tokamak with accurate calculations of equilibrium parallel current and compressible magnetic perturbation. A large simulation database has been generated to train a surrogate model to predict the kink instability. Statistical analysis shows that the radial location of safety factor q=1 flux-surface and the plasma beta inside the q=1 surface are the most important parameters for predicting the kink instability.",
    "authors": [
      "Xishuo Wei",
      "Pengfei Liu",
      "Gyungjin Choi",
      "Guillaume Brochard",
      "Jian Bao",
      "Javier H Nicolau",
      "Yuehao Ma",
      "Haotian Chen",
      "Handi Huang",
      "Shuying Sun",
      "Yangyang Yu",
      "Ethan Green",
      "Fernando Eizaguirre",
      "Zhihong Lin"
    ],
    "published": "2021-09-18T08:17:02Z",
    "updated": "2025-11-24T18:43:38Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.15320v2",
    "url": "https://arxiv.org/abs/2509.15320v2",
    "pdf_url": "https://arxiv.org/pdf/2509.15320v2.pdf",
    "title": "Anisotropic Cosmic Ray Transport in strong MHD Turbulence due to Magnetic Mirroring and Resonant Curvature Scattering",
    "abstract": "The transport of cosmic rays through turbulent astrophysical plasmas still constitutes an open problem. Building on recent progress, we study the combined effect of magnetic mirroring and resonant curvature scattering on parallel and perpendicular transport. We conduct test-particle simulations in snapshots of an anisotropic magnetohydrodynamics simulation with $δB/B_0\\sim 1$ and record magnetic moment variation and field line curvature around pitch-angle reversals. We find for strongly magnetized particles that (i) pitch-angle reversals may occur either in coherent regions of the field with small variation of the magnetic moment via magnetic mirroring or in chaotic regions of the field with strong variation of the magnetic moment via resonant curvature scattering; (ii) parallel transport can be modeled as a Lévy walk with a truncated power-law distribution based on pitch-angle reversal times; and (iii) perpendicular transport is enhanced by resonant curvature scattering in synergy with chaotic field line separation and diminished by magnetic mirroring due to confinement in locally ordered field line bundles. While magnetic mirroring constitutes the bulk of reversal events, resonant curvature scattering additionally acts on trajectories that fall in the loss cones of typical mirroring structures and thus provides the cut-off for the reversal time distribution. Our results, which highlight the role of the magnetic field line geometry in cosmic-ray transport processes, are consistent with energy-independent diffusion coefficients. We conclude by considering how energy-dependent observations could arise from an intermittently inhomogeneous interstellar medium.",
    "authors": [
      "Jeremiah Lübke",
      "Frederic Effenberger",
      "Mike Wilbert",
      "Horst Fichtner",
      "Rainer Grauer"
    ],
    "published": "2025-09-18T18:09:56Z",
    "updated": "2025-11-24T17:44:18Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2511.02814v2",
    "url": "https://arxiv.org/abs/2511.02814v2",
    "pdf_url": "https://arxiv.org/pdf/2511.02814v2.pdf",
    "title": "Production of High-Specific-Activity Radioisotopes Using High-Energy Fusion Neutrons",
    "abstract": "We show that transmutation driven by high-energy neutrons from deuterium-tritium (D-T) fusion reactions can produce many important medical radioisotopes - including $^{32}$P, $^{60}$Co, $^{64}$Cu, $^{89}$Sr, $^{90}$Y, $^{89}$Zr, $^{99}$Mo/$^{99\\mathrm{m}}$Tc, $^{103}$Pd, $^{111}$In, $^{117}$In/$^{117\\mathrm{m}1}$Sn, $^{123}$I, $^{125}$I, $^{131}$I, $^{133}$Xe, $^{153}$Sm, $^{166}$Ho, $^{177}$Lu, $^{188}$Re, and $^{192}$Ir-and emerging isotopes such as $^{47}$Sc, $^{67}$Cu, $^{103}$Ru/$^{103\\mathrm{m}}$Rh, $^{103}$Pd/$^{103\\mathrm{m}}$Rh, $^{119}$Sb, $^{124}$I, $^{155}$Tb, $^{161}$Tb, $^{195\\mathrm{m}1}$Ir/$^{195\\mathrm{m}}$Pt, and $^{225}$Ac with high specific activity and in large quantities. These reactions involve stable, abundant feedstocks and non-fission transmutation channels that change the proton number, enabling chemical separation of the product. Fusion-based transmutation could provide a flexible and proliferation-resistant platform for supply of high-purity isotopes. A D-T neutron source operating at a few megawatts of fusion power could meet or exceed global demand for most major radioisotopes. Further research is required to develop tailored approaches for feedstock processing and product extraction.",
    "authors": [
      "J. F. Parisi",
      "A. Rutkowski",
      "J. Harter",
      "J. A. Schwartz",
      "S. Chen"
    ],
    "published": "2025-11-04T18:38:38Z",
    "updated": "2025-11-24T17:09:37Z",
    "categories": [
      "nucl-ex",
      "physics.med-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "nucl-ex"
  },
  {
    "arxiv_id": "2511.19281v1",
    "url": "https://arxiv.org/abs/2511.19281v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19281v1.pdf",
    "title": "Two-Stream Instability and Bernstein-Greene-Kruskal Mode Formation in Coulomb One Component Plasma",
    "abstract": "We investigate the Two-Stream Instability in a strongly coupled plasma using classical molecular dynamics simulations with long-range Coulomb interactions between particles. The nonlinear evolution of the instability is identified by the emergence of a Bernstein-Greene-Kruskal (BGK) mode. Our simulations capture key microscopic effects, such as inter-particle correlations, collisional dynamics, and coherent wave-particle interactions-features often absent in traditional fluid and kinetic models, including Particle-In-Cell and Vlasov approaches. In the linear regime, the instability grows rapidly and saturates within a few tens of plasma periods. As the system transitions into the nonlinear saturation phase, a single BGK mode emerges. This mode (or phase-space hole) becomes dynamically unstable in the nonlinear regime, characterized by a continuous decay of electrostatic energy over time. An energy budget analysis reveals a bump in an otherwise thermal spectrum, indicating the excitation of a coherent mode, further confirmed through a numerical rendering of the dispersion relation. The pairwise interaction plays a crucial role: pronounced instability and BGK mode formation occur with long-range Coulomb forces, while such structures are suppressed under shielded Coulomb interactions. We observe the emergence of a single BGK mode across all coupling strengths in the fluid regime, provided the streaming velocity exceeds a critical threshold.",
    "authors": [
      "Ajaz Mir",
      "Rauoof Wani",
      "Sanat Tiwari",
      "Abhijit Sen"
    ],
    "published": "2025-11-24T16:30:38Z",
    "updated": "2025-11-24T16:30:38Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.19230v1",
    "url": "https://arxiv.org/abs/2511.19230v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19230v1.pdf",
    "title": "FPGA-Based Spill Regulation System for the Muon Delivery Ring at Fermilab",
    "abstract": "The Muon to Electron Experiment (Mu2e) requires a uniform beam profile from the Muon Delivery Ring to meet their experimental needs. A specialized Spill Regulation System (SRS) has been developed to help achieve consistent spill uniformity. The system is based on a custom-designed carrier board featuring an Arria 10 SoC, capable of executing real-time feedback control. The FPGA processes beam pulses of approximately 200 ns every 1.695 $μ$s, allowing for continuous monitoring of the extracted spill intensity through fast bunch integration. The system directly controls three quadrupole magnets, which work in conjunction with sextupole magnets to achieve third-order resonant extraction. Furthermore, the board interfaces with Fermilab's Accelerator Control Network (ACNET), enabling operators to modify spill regulation settings in real-time via the control network while providing diagnostic waveforms. These waveforms help operators monitor the process and fine-tune the feedback mechanisms. This paper presents an overview of the board's architecture and its initial progress toward regulating beam extraction. This initial version of the regulation system aims to evaluate baseline performance to inform future system improvements.",
    "authors": [
      "J. R. Berlioz",
      "D. Bracey",
      "B. Fellenz",
      "M. A. Ibrahim",
      "V. Nagaslaev",
      "A. Narayanan",
      "P. Prieto",
      "K. Danison-Fieldhouse",
      "W. Sullivan"
    ],
    "published": "2025-11-24T15:43:35Z",
    "updated": "2025-11-24T15:43:35Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.18429/JACoW-NAPAC2025-MOP042"
  },
  {
    "arxiv_id": "2511.19195v1",
    "url": "https://arxiv.org/abs/2511.19195v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19195v1.pdf",
    "title": "Insights into neutron transport in a new multipurpose nuclear reactor",
    "abstract": "Neutron transport inside the reflector tank of the new Brazilian nuclear reactor, called the RMB (Brazilian Multipurpose Reactor), is investigated using the stochastic Monte Carlo method. One of the main characteristics of research nuclear reactors is the core power density, which is proportional to the neutron flux generated in the fission reaction. The RMB is part of the new generation of multipurpose reactors, and studying neutron transport is essential for the project to meet its objectives of producing radioisotopes, irradiating materials, and generating neutron beams for scientific investigations. The neutron moderation process in the reflector tank is very well described by Maxwellian distributions, which provide temperatures ranging from T = 331.5 K in the core to T = 266.8 K in the peripheral regions. The relative proportions reveal the predominance (52%) of epithermal neutrons in the reactor core, followed by thermal (29%) and fast (19%) neutrons. The moderation process proves to be effective, considering that 100% of the neutrons fall within the thermal spectrum near the reflector tank wall. The fits using Maxwellian distributions reveal another effect of neutron moderation, a shift in the peak wavelength from 1.07 Å to 1.19 Å. The same effect is observed along the tube that supplies a neutron beam to the RMB imaging instrument, with $λ_{peak}$ = 1.18 Å increasing to $λ_{peak}$ = 1.21 Å.",
    "authors": [
      "Luiz Paulo de Oliveira",
      "Alexandre Pinho dos Santos Souza",
      "Carlos Gabriel da Silva Santos",
      "Iberê Souza Ribeiro Júnior",
      "Barbara Perez Gonçalves Silva",
      "Marco Antonio Stanojev Pereira",
      "Frederico Antonio Genezini"
    ],
    "published": "2025-11-24T15:05:04Z",
    "updated": "2025-11-24T15:05:04Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2505.11473v2",
    "url": "https://arxiv.org/abs/2505.11473v2",
    "pdf_url": "https://arxiv.org/pdf/2505.11473v2.pdf",
    "title": "Application of the Portable Diagnostic Package to the Wisconsin High-temperature-superconducting Axisymmetric Mirror (WHAM)",
    "abstract": "We present an application of the Portable Diagnostic Package (PDP) on the Wisconsin HTS Axisymmetric Mirror (WHAM), which integrates an optical emission spectroscopy (OES) system and an active Thomson scattering (TS) system. Due to the designed portability of our system, we realized the installation of the PDP OES and TS measurements on WHAM in $\\sim$6 months. The OES system facilitates a comprehensive impurity line survey and enables flow measurements through the Doppler effect observed on impurity lines. Notably, plasma rotation profiles were successfully derived from doubly charged carbon lines. In addition, the TS system enabled the first measurements of the electron temperature in commissioning plasmas on WHAM. These successes underscore the diagnostic package's potential for advancing experimental plasma studies.",
    "authors": [
      "Keisuke Fujii",
      "Douglass Endrizzi",
      "Jay K. Anderson",
      "Cary B. Forest",
      "Jonathan Pizzo",
      "Tony Qian",
      "Mason Yu",
      "Theodore M. Biewer"
    ],
    "published": "2025-05-16T17:29:55Z",
    "updated": "2025-11-24T14:54:21Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1063/5.0281806"
  },
  {
    "arxiv_id": "2511.09863v2",
    "url": "https://arxiv.org/abs/2511.09863v2",
    "pdf_url": "https://arxiv.org/pdf/2511.09863v2.pdf",
    "title": "Topmetal-L: A Low Noise Charge-Sensitive Pixel Sensor for POLAR2/LPD",
    "abstract": "POLAR-2 is a next-generation space astronomy platform led by China, with its core scientific objective focused on high-precision polarization measurements of gamma-ray bursts. As one of its key payloads, the Low-energy Polarization Detector (LPD) is designed to perform wide-field surveys to capture X-ray polarization information from gamma-ray bursts in the 2$\\sim$10 keV energy range. This paper presents Topmetal-L, a dedicated charge-sensitive pixel sensor developed for the LPD prototype upgrade. Fabricated in a 130 nm CMOS process in 2024, the chip integrates a 356 $\\times$ 512 pixel array with a pixel pitch of 45 $μ$m. Each pixel incorporates a 26 $\\times$ 26 $μ$m$^2$ charge-collecting window and is capable of simultaneously outputting both energy and position information of deposited charges. Topmetal-L has been systematically optimized for power consumption, noise performance, and readout efficiency. It exhibits an input dynamic range of 0$\\sim$4 ke$^{-}$, a typical charge-to-voltage conversion gain of 76.04 $μ$V/e$^{-}$, an average equivalent noise charge of approximately 22.8 e$^{-}$, a sensitive area exceeding 3.69 cm$^2$, and a total power consumption of 720 mW per chip. To meet the requirements of large-area, high-frame-rate readout for gas-based polarization detectors, a sentinel readout scheme is proposed, reducing the full-frame readout time to 730 $μ$s. A prototype Topmetal-L-based gas polarization detection system was evaluated across key energies: it exhibited a residual modulation of 0.26% $\\pm$ 0.45% at 5.90 keV, a modulation factor of 66.67% $\\pm$ 0.45% for a linearly polarized 8.05 keV source, and a count rate saturated at 15 k counts$\\cdot$cm$^{-2}$$\\cdot$s$^{-1}$ when tested at 5.40 keV.",
    "authors": [
      "Li-rong Xie",
      "Shi-Qiang Zhou",
      "Di-Fan Yi",
      "Huan-Bo Feng",
      "Zhu-Ke Feng",
      "Dong Wang",
      "Chao-song Gao",
      "En-Wei Liang",
      "Xiang-Ming Sun",
      "Hong-Bang Liu"
    ],
    "published": "2025-11-13T01:43:37Z",
    "updated": "2025-11-24T14:26:15Z",
    "categories": [
      "astro-ph.IM",
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2511.19144v1",
    "url": "https://arxiv.org/abs/2511.19144v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19144v1.pdf",
    "title": "Approximate resolution convolution function for fitting a dispersion gap measured on a triple-axis spectrometer",
    "abstract": "We present an analytic convoluted-gap function, eq. 11 in the manuscript, for fitting dispersion gaps measured on triple-axis spectrometers (TAS). At the gap, the instrumental resolution skews the signal, producing a high-energy tail that complicates fitting. Our function assumes an instrumental $Q$-resolution with two equal wide and one narrow direction (typical of focused TAS instruments), and a parabolic dispersion at the gap, which is exact for quadratic and accurate for linear dispersions if the resolution is moderate. We demonstrate, that our function outperforms previous methods of fitting a gap, by giving a better fit and more accurate gap determination, seen in figure 4. Here, the anti-ferromagnetically gapped material; MnF$_2$ is simulated in a double-focusing TAS instrument. We also tested our function on experimental data on MnF$_2$ from a TAS-like instrument, where we reproduce the gap size from previous accurate experimentally determined measurements. The function is simple to implement, converges reliably, and we recommend its use for future gap fitting on TAS data.",
    "authors": [
      "Emma Y. Lenander",
      "Silas B. Schack",
      "Kim Lefmann",
      "Henrik M. Rønnow"
    ],
    "published": "2025-11-24T14:08:52Z",
    "updated": "2025-11-24T14:08:52Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.other"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.19141v1",
    "url": "https://arxiv.org/abs/2511.19141v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19141v1.pdf",
    "title": "Automated RF Phase Adjustment for Beam Stabilization in the Fermilab Linac",
    "abstract": "The Fermilab Linac experiences longitudinal beam phase drift, leading to increased particle loss, conventionally corrected through labor-intensive manual RF adjustments. This project explores machine learning-based automation for drift correction, employing a prototype-based classification approach. Our model utilizes a 34-dimensional feature set (RF settings and BPM readings) and leverages a 7x27 response matrix for system modeling. To overcome limited real-world data, we generate synthetic data, enhancing model training and generalizability. Custom loss functions, including a surrogate energy-consistent loss and a temporal smoothness constraint, ensure physically plausible drift predictions. The goal is a robust system for autonomous phase adjustments, ensuring stable beam acceleration and reduced manual intervention.",
    "authors": [
      "R. R. Chichili",
      "J. A. Sulskis",
      "R. Sharankova",
      "B. Vamanan",
      "S. Ravi"
    ],
    "published": "2025-11-24T14:06:20Z",
    "updated": "2025-11-24T14:06:20Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.18429/JACoW-NAPAC2025-MOP011"
  },
  {
    "arxiv_id": "2511.19136v1",
    "url": "https://arxiv.org/abs/2511.19136v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19136v1.pdf",
    "title": "Abnormal Polarity Effect on the DC Breakdown Voltage in Short SF6 Gap",
    "abstract": "In this Letter, through the comparison between experiment and numerical simulation, we reveal the dynamic mechanism underlying the abnormal polarity effect in SF6 short-gap DC breakdown, as well as a novel criterion for predicting negative breakdown voltage. Using the traditional single-streamer breakdown criterion, the simulated positive breakdown voltage agrees well with experimental measurements, whereas the simulated negative breakdown voltage deviates markedly from the experiments, so the single-streamer breakdown criterion fails to reproduce the abnormal polarity effect observed experimentally. In addressing this, we propose an ion-ion plasma breakdown criterion for negative breakdown voltage. When this novel criterion is applied, the simulated negative breakdown voltage agrees with the experiments and reflects the abnormal polarity effect. Analysis of the spatiotemporal evolution of key physical parameters reveals that, the dynamic mechanism for ion-ion plasma breakdown for negative polarity can be divided into four stages: primary streamer stage, ion accumulation stage, reconstructive ionization stage, and ion-ion plasma propagation stage. Notably, the ion-ion plasma propagation stage is dominated by photoionization-driven negative-ion accumulation rather than conventional impact ionization.",
    "authors": [
      "Zihao Feng"
    ],
    "published": "2025-11-24T13:59:44Z",
    "updated": "2025-11-24T13:59:44Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.19114v1",
    "url": "https://arxiv.org/abs/2511.19114v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19114v1.pdf",
    "title": "Physics-informed Neural Operator Learning for Nonlinear Grad-Shafranov Equation",
    "abstract": "As artificial intelligence emerges as a transformative enabler for fusion energy commercialization, fast and accurate solvers become increasingly critical. In magnetic confinement nuclear fusion, rapid and accurate solution of the Grad-Shafranov equation (GSE) is essential for real-time plasma control and analysis. Traditional numerical solvers achieve high precision but are computationally prohibitive, while data-driven surrogates infer quickly but fail to enforce physical laws and generalize poorly beyond training distributions. To address this challenge, we present a Physics-Informed Neural Operator (PINO) that directly learns the GSE solution operator, mapping shape parameters of last closed flux surface to equilibrium solutions for realistic nonlinear current profiles. Comprehensive benchmarking of five neural architectures identifies the novel Transformer-KAN (Kolmogorov-Arnold Network) Neural Operator (TKNO) as achieving highest accuracy (0.25% mean L2 relative error) under supervised training (only data-driven). However, all data-driven models exhibit large physics residuals, indicating poor physical consistency. Our unsupervised training can reduce the residuals by nearly four orders of magnitude through embedding physics-based loss terms without labeled data. Critically, semi-supervised learning--integrating sparse labeled data (100 interior points) with physics constraints--achieves optimal balance: 0.48% interpolation error and the most robust extrapolation performance (4.76% error, 8.9x degradation factor vs 39.8x for supervised models). Accelerated by TensorRT optimization, our models enable millisecond-level inference, establishing PINO as a promising pathway for next-generation fusion control systems.",
    "authors": [
      "Siqi Ding",
      "Zitong Zhang",
      "Guoyang Shi",
      "Xingyu Li",
      "Xiang Gu",
      "Yanan Xu",
      "Huasheng Xie",
      "Hanyue Zhao",
      "Yuejiang Shi",
      "Tianyuan Liu"
    ],
    "published": "2025-11-24T13:46:38Z",
    "updated": "2025-11-24T13:46:38Z",
    "categories": [
      "physics.plasm-ph",
      "cs.AI"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.19099v1",
    "url": "https://arxiv.org/abs/2511.19099v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19099v1.pdf",
    "title": "Fast Adaptive Neural Control of Resonant Extraction at Fermilab",
    "abstract": "We present progress on the development of a machine learning (ML) regulation system for third-order resonant extraction of the beam delivered to the Mu2e experiment at Fermilab. We consider classical and ML-based controllers optimized on semi-analytic simulations and provide performance comparisons for several models. Additionally, we discuss the efficiency of each model in training, which has implications for future work on adaptive control. We also discuss progress on developing optimized implementations of ML models for edge-based inference.",
    "authors": [
      "A. Whitbeck",
      "J. Berlioz",
      "K. Danison-Fieldhouse",
      "K. Hazelwood",
      "M. Khan",
      "J. Mitrevski",
      "A. Narayanan",
      "J. St. John",
      "N. Tran",
      "J. Ji",
      "M. Walter"
    ],
    "published": "2025-11-24T13:36:34Z",
    "updated": "2025-11-24T13:36:34Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.18429/JACoW-NAPAC2025-MOP039"
  },
  {
    "arxiv_id": "2511.19095v1",
    "url": "https://arxiv.org/abs/2511.19095v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19095v1.pdf",
    "title": "Cryogenic characterization of FBK NUV-HD-Cryo 3T SiPM sensors for the DUNE photon detection system",
    "abstract": "The Deep Underground Neutrino Experiment (DUNE) is a long-baseline neutrino experiment based in the USA and composed of a Near Detector (ND) complex at Fermi National Laboratory (FNAL), and a Far Detector (FD) complex located at the Sanford Underground Research Facility (SURF) $\\sim$1300\\,km distant. DUNE will study neutrino oscillations looking for unresolved issues of the Standard Model of particle physics (SM) such as CP violation in the leptonic sector, neutrino mass ordering and others, starting from the early 2030s. The FD, with a mass of $\\sim$17\\,kt, that will exploit both ionization and scintillation signals to detect neutrino interactions with Argon. Scintillating photons in LAr will be detected by the photon detection system (PDS) based on light collectors coupled to Silicon Photomultipliers (SiPMs). During a test campaign, different laboratories of the collaboration performed an investigation of the best SiPM candidates that fulfill the DUNE FD requirements. We identified two models of SiPM, produced by Hamamatsu Photonics K.K. (HPK) and Fondazione Bruno Kessler (FBK), respectively. In this paper, we focus on the FBK selected model showing its main features. We will describe the characterization protocol, the results at both room and cryogenic temperatures and the photon detection efficiency measurements.",
    "authors": [
      "F. Acerbi",
      "M. Andreotti",
      "A. Balboni",
      "E. Bertolini",
      "S. Bertolucci",
      "G. Botogoske",
      "F. Bramati",
      "A. Branca",
      "C. Brizzolari",
      "G. Brunetti",
      "R. Calabrese",
      "E. Calvo",
      "N. Canci",
      "P. Carniti",
      "D. Casazza",
      "C. Cattadori",
      "A. Cervera",
      "F. Chiapponi",
      "S. Chiozzi",
      "V. Cicero",
      "A. Cotta Ramusino",
      "E. Cristaldo Morales",
      "C. Cuesta",
      "R. D Amico",
      "L. Degli Esposti",
      "M. Delgado Gonzalez",
      "F. Di Capua",
      "D. Di Ferdinando",
      "A. Dyshkant",
      "M. Eads",
      "A. Falcone",
      "E. Fialova",
      "A. Ficorella",
      "P. Filip",
      "G. Fiorillo",
      "M. Fiorini",
      "K. Francis",
      "A. Gabrielli",
      "F. Galizzi",
      "G. Gallina",
      "D. Garcia-Gamez",
      "M. A. Garcia-Peris",
      "T. Giammaria",
      "I. Gil-Botella",
      "A. Gola",
      "C. Gotti",
      "M. Guarise",
      "D. Guffanti",
      "G. Ingratta",
      "I. Lax",
      "I. Lopez de Rego",
      "E. Luppi",
      "S. Manthey",
      "J. Martin-Albo",
      "N. Mauri",
      "L. Meazza",
      "A. Mengarelli",
      "A. Minotti",
      "E. Montagna",
      "A. Montanari",
      "I. Neri",
      "F. J. Nicolas-Arnaldos",
      "C. Palomares",
      "L. Parellada-Monreal",
      "L. Pasqualini",
      "G. Paternoster",
      "L. Perez-Molina",
      "G. Pessina",
      "V. Pia",
      "L. Pierini",
      "F. Poppi",
      "M. Pozzato",
      "M. Querol",
      "F. Retiere",
      "J. Rocabado",
      "A. Ruggeri",
      "A. Saadana",
      "A. Sanchez-Castillo",
      "P. Sanchez-Lucas",
      "A. Scanu",
      "F. S. Schifano",
      "G. Sirri",
      "J. Smolik",
      "M. Tenti",
      "F. Terranova",
      "V. Togo",
      "L. Tomassetti",
      "M. Torti",
      "N. Tosi",
      "C. Valieri",
      "A. Verdugo de Osa",
      "H. Vieira de Souza",
      "J. Zalesak",
      "B. Zamorano",
      "S. Zucchelli",
      "V. Zutshi"
    ],
    "published": "2025-11-24T13:34:06Z",
    "updated": "2025-11-24T13:34:06Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.19081v1",
    "url": "https://arxiv.org/abs/2511.19081v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19081v1.pdf",
    "title": "Simulating neutron diffraction from deformed mosaic crystals in McStas",
    "abstract": "Monochromator and analyzer systems that rely on bent single crystals are in use throughout the neutron scattering community. We here introduce a new component to the neutron simulation software package McStas, that simulates these bent single crystals. We then compare the performance of this component to like software in SIMRES, and Ncrystal. These simulations show excellent agreement across the different software programs. Finally we compare simulations of the new McStas component with analytical calculations of secondary extinction, based on the Darwin transfer equations. Here we also find excellent agreement, further validating this new component.",
    "authors": [
      "Daniel Lomholt Christensen",
      "Sandra Cabeza",
      "Thilo Pirling",
      "Kim Lefmann",
      "Jan Saroun"
    ],
    "published": "2025-11-24T13:22:30Z",
    "updated": "2025-11-24T13:22:30Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.19028v1",
    "url": "https://arxiv.org/abs/2511.19028v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19028v1.pdf",
    "title": "Bell Plesset Effects on Rayleigh Taylor Instability of Three Dimensional Spherical Geometry",
    "abstract": "We develop a weakly nonlinear, multi-mode theory for the Rayleigh-Taylor instability (RTI) on a time-varying spherical interface, fully incorporating mode couplings and the Bell-Plesset (BP) effects arising from interface convergence. Our model extends prior analyses, which have been largely restricted to static backgrounds, 2D cylindrical geometries, or single-mode initial conditions. We present a framework capable of evolving arbitrary, fully three-dimensional initial perturbations on a dynamic background. At the first order, mode amplitudes respond to the time-varying interface acceleration with an exponential-like growth, in qualitative agreement with classic static results. At second order, nonlinear mode coupling reveals a powerful selection rule: energy is preferentially channeled into axisymmetric (m=0) modes. We find that the BP effects dramatically amplify the instability growth by a few orders of magnitude, with this amplification being even more significant for second order couplings. Despite this strong channeling, the second order amplitudes remain small relative to the first order, validating the perturbative approach. These findings offer new physical insights into time-dependent interface instabilities relevant to applications such as astrophysical shell collapse and inertial confinement fusion, highlighting the uniquely dominant role of axisymmetric modes in BP-driven convergent flows.",
    "authors": [
      "Xilai Li",
      "Yilin Wu",
      "Zhengnuo Chen",
      "Mengqi Yang",
      "Jie Zhang"
    ],
    "published": "2025-11-24T12:03:23Z",
    "updated": "2025-11-24T12:03:23Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  }
]