{
  "arxiv_id": "2511.03139v1",
  "url": "https://arxiv.org/abs/2511.03139v1",
  "pdf_url": "https://arxiv.org/pdf/2511.03139v1.pdf",
  "title": "α/γ discrimination method for bulky BaF2 detector used in   γ total absorption facility",
  "abstract": "The gamma-ray total absorption facility (GTAF) composed of 40 BaF2 detection units is designed to measure the cross section data of neutron radiation capture reaction online, in order to comply with the experimental nuclear data sheet.We have found that one of the most important sources of experimental background is the initial alpha particles emitted by the BaF2 crystal. Developing data analysis algorithms to eliminate the influence of alpha particles in experimental data has become a key aspect. In this work, in order to meet the needs of data acquisition, online measurement and analysis of neutron radiation cross section, the GTAF data acquisition system adopts a full waveform acquisition method, which results in a large number of data recorded, transmitted, and stored during experiment, which also affects the uncertainty of the cross-section data.Based on the signal waveform characteristics of the BaF2 detection unit, in order to solve the aforementioned problems, three methods, namely the ratio of fast component to total component, pulse width, and time decay constant, are used to identify and distinguish alpha particles and gamma rays. The quality factor FOM is utilized as an evaluation value and several experiments are conducted using three radioactive sources (22Na, 137Cs, 60Co) for verification.",
  "authors": [
    "Chong Zou",
    "Qiwei Zhang",
    "Guangyuan Luan",
    "Hongyi Wu",
    "Haotian Luo",
    "Xuanbo Chen",
    "Xiaoyu Wang",
    "Guozhu He",
    "Jie Ren",
    "Hanxiong Huang",
    "Xichao Ruan",
    "Jie Bao",
    "Xinghua Zhu"
  ],
  "published": "2025-11-05T03:06:17Z",
  "updated": "2025-11-05T03:06:17Z",
  "categories": [
    "physics.ins-det",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.7498/aps.74.20250017"
}