{
  "arxiv_id": "2511.04463v1",
  "url": "https://arxiv.org/abs/2511.04463v1",
  "pdf_url": "https://arxiv.org/pdf/2511.04463v1.pdf",
  "title": "The Moving Beam Diffraction Geometry: the DIAD Application of a   Diffraction Scanning-Probe",
  "abstract": "Understanding the interactions between microstructure, strain, phase, and material behavior is crucial in many scientific fields. However, quantifying these correlations is challenging, as it requires the use of multiple instruments and techniques, often separated by space and time. The Dual Imaging And Diffraction (DIAD) beamline at Diamond is designed to address this challenge. DIAD allows its users to visualize internal structures, identify compositional/phase changes, and measure strain. DIAD provides two independent beams combined at one sample position, allowing quasi-simultaneous X-ray Computed Tomography and X-ray Powder Diffraction. A unique functionality of the DIAD configuration is the ability to perform image-guided diffraction, where the micron-sized diffraction beam is scanned over the complete area of the imaging field of view without moving the specimen. This moving beam diffraction geometry enables the study of fast-evolving and motion-susceptible processes and samples. Here, we discuss the novel moving beam diffraction geometry presenting the latest findings on the reliability of both geometry calibration and data reduction routines used. Our measures confirm diffraction is most sensitive to the moving geometry for the detector position downstream normal to the incident beam. The observed data confirm that the motion of the KB mirror coupled with a fixed aperture slit results in a rigid translation of the beam probe, without affecting the angle of the incident beam path to the sample. Our measures demonstrate a nearest-neighbour calibration can achieve the same accuracy as a self-calibrated geometry when the distance between calibrated and probed sample region is smaller or equal to the beam spot size. We show the absolute error of the moving beam diffraction geometry remains below 0.0001, which is the accuracy we observe for the beamline with stable beam operation.",
  "authors": [
    "Alberto Leonardi",
    "Andrew James",
    "Christina Reinhard",
    "Michael Drakopoulos",
    "Ben Williams",
    "Hans Dehyle",
    "Jacob Filik",
    "Liam Perera",
    "Sharif Ahmed"
  ],
  "published": "2025-11-06T15:33:48Z",
  "updated": "2025-11-06T15:33:48Z",
  "categories": [
    "cond-mat.mtrl-sci",
    "physics.data-an",
    "physics.ins-det"
  ],
  "primary_category": "cond-mat.mtrl-sci"
}