{
  "arxiv_id": "2511.04386v1",
  "url": "https://arxiv.org/abs/2511.04386v1",
  "pdf_url": "https://arxiv.org/pdf/2511.04386v1.pdf",
  "title": "Mitigating effects of nonlinearities in homodyne quadrature   interferometers",
  "abstract": "Homodyne Quadrature interferometers (HoQI) are an interferometric displacement sensing scheme proven to have excellent noise performance, making them a strong candidate for sensing and control schemes in gravitational wave detector seismic isolation. Like many interferometric schemes, HoQIs are prone to nonlinear effects when measuring displacements. These nonlinearities, if left unsuppressed, would substantially limit the use cases of HoQIs. This paper first shows a means of measuring and quantifying nonlinearities using a working HoQI and a mechanical resonator. We then demonstrate a method for real-time correction of these nonlinearities and several approaches for accurately calibrating the correction technique. By correcting in real time, we remove one of the biggest obstacles to including HoQIs in upgrades to future gravitational wave detectors. Finally, we discuss how to post correct data from HoQIs, suppressing even further the nonlinearity-induced errors, broadening the appeal of such sensors to other applications where measurement data can be reconstructed after the fact. We demonstrate all of this on a working HoQI system and show the measured suppression of nonlinear effects from each of these methods. Our work makes HoQIs a more broadly applicable tool for displacement sensing.",
  "authors": [
    "Johannes Lehmann",
    "Artem Basalaev",
    "Jonathan J. Carter",
    "Matteo Carlassara",
    "Harald Lück",
    "Gabriella Chiarini",
    "Pritam Sarkar",
    "Firoz Khan",
    "Satoru Takano",
    "Sara Al-Kershi",
    "Sina M. Koehlenbeck",
    "Pascal Birckigt",
    "Sarah L. Kranzhoff",
    "Juliane von Wrangel",
    "David S. Wu"
  ],
  "published": "2025-11-06T14:10:35Z",
  "updated": "2025-11-06T14:10:35Z",
  "categories": [
    "physics.ins-det",
    "astro-ph.IM"
  ],
  "primary_category": "physics.ins-det"
}