{
  "arxiv_id": "2511.03930v1",
  "url": "https://arxiv.org/abs/2511.03930v1",
  "pdf_url": "https://arxiv.org/pdf/2511.03930v1.pdf",
  "title": "Modeling of Injected Current Stream-Induced 3D Perturbations in Local   Helicity Injection Plasmas",
  "abstract": "Solenoid-free tokamak startup techniques are essential for spherical tokamaks and offer a pathway to cost reduction and design simplification in fusion energy systems. Local helicity injection (LHI) is one such approach, employing compact edge current sources to drive open field line current that initiates and sustains tokamak plasmas. The recently commissioned Pegasus-III spherical tokamak provides a platform for advancing this and other solenoid-free startup methods. This study investigates the effect of LHI on magnetic topology in Pegasus-III plasmas. A helical filament model represents the injected current, and the linear plasma response to its 3D field is calculated with M3D-C1. Poincar\\'e mapping reveals substantial flux surface degradation in all modeled cases. The onset of overlapping magnetic structures and large-scale surface deformation begins at $\\Psi_{N} \\approx 0.37$, indicating a broad region of perturbed topology extending toward the edge. In rotating plasmas, both single-fluid and two-fluid models exhibit partial screening of the $n = 1$ perturbation, with two-fluid calculations showing stronger suppression near the edge. In contrast, the absence of rotation leads to strong resonant field amplification in the single-fluid case, while the two-fluid case with zero electron rotation mitigates this amplification and preserves edge screening. Magnetic probe measurements indicate that modeling the stream with spatial spreading$-$representing distributed current and/or oscillatory motion$-$better reproduces measured magnetic power profiles than a rigid filament model. The results underscore the role of rotation and two-fluid physics in screening stream perturbations and point to plasma flow measurements and refined stream models as key steps toward improving predictive fidelity.",
  "authors": [
    "C. E. Schaefer",
    "A. C. Sontag",
    "N. M. Ferraro",
    "J. D. Weberski",
    "S. J. Diem"
  ],
  "published": "2025-11-06T00:14:34Z",
  "updated": "2025-11-06T00:14:34Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}