{
  "arxiv_id": "2508.10602v1",
  "url": "https://arxiv.org/abs/2508.10602v1",
  "pdf_url": "https://arxiv.org/pdf/2508.10602v1.pdf",
  "title": "Development of superfluid helium-3 bolometry using nanowire resonators   with SQUID readout for the QUEST-DMC experiment",
  "abstract": "Superfluid helium-3 bolometers can be utilised for dark matter direct detection searches. The extremely low heat capacity of the B phase of the superfluid helium-3 at ultra-low temperatures offers the potential to reach world leading sensitivity to spin dependent interactions of dark matter in the sub-GeV/c$^2$ mass range. Here, we describe the development of bolometry using both micron scale and sub-micron diameter vibrating wire resonators, with a SQUID amplifier-based readout scheme. Characterisation of the resonators and bolometer measurements are shown, including the use of non-linear operation and the corresponding corrections. The bolometer contains two vibrating wire resonators, enabling heat injection calibration and simultaneous bolometer tracking measurements. Coincident events measured on both vibrating wire resonators verify their response. We also demonstrate proof of concept frequency multiplexed readout. Development of these measurement techniques lays the foundations for the use of superfluid helium-3 bolometers, instrumented with vibrating nano-mechanical resonators, for future low threshold dark matter searches.",
  "authors": [
    "QUEST-DMC Collaboration",
    ":",
    "E. Leason",
    "L. V. Levitin",
    "S. Autti",
    "E. Bloomfield",
    "A. Casey",
    "N. Darvishi",
    "N. Eng",
    "P. Franchini",
    "R. P. Haley",
    "P. J. Heikkinen",
    "A. Jennings",
    "A. Kemp",
    "J. March-Russell",
    "A. Mayer",
    "J. Monroe",
    "D. Münstermann",
    "M. T. Noble",
    "J. R. Prance",
    "X. Rojas",
    "T. Salmon",
    "J. Saunders",
    "J. Smirnov",
    "R. Smith",
    "M. D. Thompson",
    "A. Thomson",
    "A. Ting",
    "V. Tsepelin",
    "S. M. West",
    "L. Whitehead",
    "D. E. Zmeev"
  ],
  "published": "2025-08-14T12:43:12Z",
  "updated": "2025-08-14T12:43:12Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}