{
  "arxiv_id": "2509.08081v1",
  "url": "https://arxiv.org/abs/2509.08081v1",
  "pdf_url": "https://arxiv.org/pdf/2509.08081v1.pdf",
  "title": "Particle-In-Cell Informed Kinetic Modeling of Nonlinear Skin Effects in   Low-Frequency Inductively Coupled Plasmas",
  "abstract": "We perform extensive 2D Particle-In-Cell (PIC) electromagnetic simulations of low pressure Inductively Coupled Plasma (ICP) discharges with various coil current and driving frequencies. Our simulations show that in low-frequency cases, electrons in the skin region near the coil can be predominantly magnetized by the Radio Frequency (RF) magnetic field. More specifically, the electrons are trapped in the combined potential well formed by the vector and electrostatic potentials, where they oscillate for most of the RF period while drifting perpendicular to the RF magnetic field. When the magnetic field weakens, electrons shortly demagnetize, leading to jet-like currents and periodic bursts of energy deposition. Based on the newly discovered electron trajectories, we develop a new kinetic theory for the plasma skin effect in low-frequency Inductively Coupled Plasma (ICP) discharges, incorporating nonlinear electron motion in an RF magnetic field by integrating Vlasov equation along the unperturbed particle trajectory. This theory successfully predicts the time evolution of electron currents in low-frequency ICP plasmas, as well as a nonlinear relation between electron current and the RF inductive electric field in the new regime we found. Furthermore, by coupling this new kinetic theory with a global model, we provide a straightforward method for estimating equilibrium electron temperature, plasma density and electron current. These analytical predictions match well with our 2D PIC simulations and can be validated through future experimental studies.",
  "authors": [
    "Haomin Sun",
    "Jian Chen",
    "Alexander Khrabrov",
    "Igor D. Kaganovich",
    "Wei Yang",
    "Dmytro Sydorenko",
    "Stephan Brunner"
  ],
  "published": "2025-09-09T18:37:47Z",
  "updated": "2025-09-09T18:37:47Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}