{
  "arxiv_id": "2509.08106v1",
  "url": "https://arxiv.org/abs/2509.08106v1",
  "pdf_url": "https://arxiv.org/pdf/2509.08106v1.pdf",
  "title": "Proton-Acoustic Wave Effects on the Relaxation of Proton Transverse   Heating in Magnetized Plasmas",
  "abstract": "Transverse electromagnetic and electrostatic plasma wave modes propagating along a background magnetic field $\\vec{B}_0$ are independent according to linear kinetic theory. However, resonant interactions and energy exchange between waves and particles break this linear decoupling. This work tracks the coupled evolution of Alfv\\'en-cyclotron (ACWs) and Ion-acoustic waves (IAWs) by solving moment-based quasilinear equations for a collisionless plasma of bi-Maxwellian protons and Maxwellian electrons. Unlike earlier quasilinear studies that adopt the cold-electron limit, our formulation retains the full kinetic response of both species, treating the electrons as a thermal reservoir to isolate proton heating. A parameter survey over $0.01\\leq\\beta_{\\parallel p}\\leq10$ and $1\\le T_e/T_p\\le10$ shows that an ambient spectrum of ACWs can drive significant perpendicular proton heating and raise the temperature anisotropy from initially isotropic conditions at low $\\beta_{\\parallel p}\\lesssim0.1$, thereby triggering cyclotron instabilities. The quasilinear evolution self-regulates the ACW, driving the system toward a quasi-stationary state with $\\gamma/\\Omega_p<10^{-1}$ and reduced anisotropy. As $T_e/T_p$ increases, IAWs become less damped and absorb a larger share of the fluctuation energy through Landau resonance, reducing the efficiency of ACW-driven proton heating and thus regulating the instability. For sufficiently large $\\beta_{\\parallel p}$ or $T_e/T_p\\gtrsim5$, ACWs become inefficient drivers of perpendicular heating, leaving IAWs as the dominant dissipation channel. These results explain how modest electrostatic activity in low-$\\beta$ environments such as the inner heliosphere and planetary magnetosheaths can regulate, but not indefinitely sustain, cyclotron instabilities.",
  "authors": [
    "Martín A. Quijada",
    "Pablo S. Moya",
    "Roberto E. Navarro"
  ],
  "published": "2025-09-09T19:32:51Z",
  "updated": "2025-09-09T19:32:51Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}