[
  {
    "arxiv_id": "2509.09308v2",
    "url": "https://arxiv.org/abs/2509.09308v2",
    "pdf_url": "https://arxiv.org/pdf/2509.09308v2.pdf",
    "title": "New results from fast timing iLGAD sensor on Timepix4",
    "abstract": "With the High-Luminosity Large Hadron Collider (HL-LHC) the number of collisions per bunch crossing increases. To cope with these high rates in the pixel trackers, per-pixel time measurements are required, which implies the need for fast sensors. The inverse Low-Gain Avalanche Detector (iLGAD) is one of the fast sensor options that is being investigated. This paper will show the results of an inverse Low-Gain Avalanche Detector (iLGAD) with a pitch of 55 $\\mu$m, a thickness of 250~$\\mu$m and a large-area (2~cm$^2$), bump bonded to a Timepix4 ASIC. Timepix4 has 195~ps time binning on each pixel and therefore an excellent ASIC to test the sensor. The sensor is characterised with radio-active source measurements in the lab, and during beam test at the CERN SPS North Area H8 beamline, where the Timepix4 telescope was used. The telescope has a time reference of 12~ps and a pointing resolution of 2.4 $\\pm$ 0.1~$\\mu$m. The iLGAD shows an almost uniform gain of approximately 4 and an efficiency of 99.6 $\\pm$ 0.1\\%. Without any corrections the obtained time resolution is about 750~ps. After timewalk and clock corrections the time resolution becomes 377 $\\pm$ 7~ps. Grazing angle measurements have been done, which allow to measure the time resolution as function of depth of the charge deposition in the sensor. This provides more insight for the perpendicular time resolution.",
    "authors": [
      "Daan Oppenhuis"
    ],
    "published": "2025-09-11T09:51:37Z",
    "updated": "2025-09-12T06:04:21Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.09511v1",
    "url": "https://arxiv.org/abs/2509.09511v1",
    "pdf_url": "https://arxiv.org/pdf/2509.09511v1.pdf",
    "title": "Chromatic Calorimetry -- A Novel Approach to Validate Energy Resolution   and Particle Discrimination",
    "abstract": "Chromatic calorimetry (CCAL) analyses particle detection by utilizing scintillators with distinct emission wavelengths to measure the longitudinal energy deposition of particle showers in high-energy physics, improving particle identification (PID) and energy resolution. By stacking scintillators in order of decreasing emission wavelength, CCAL enables layer-specific energy measurements, analyzed via amplitude fractions ($f_i = A_i / \\sum_j A_j$) and center of gravity ($\\langle z_{\\text{cog}} \\rangle = \\sum_i z_i E_i / \\sum_i E_i$). This thesis presents results from two CERN Super Proton Synchrotron (SPS) experiments conducted in 2023 and 2024, complemented by GEANT4 simulations of a quantum dot (QD)-based CCAL design, to validate its potential for future colliders such as the Future Circular Collider (FCC).",
    "authors": [
      "Devanshi Arora"
    ],
    "published": "2025-09-11T14:52:18Z",
    "updated": "2025-09-11T14:52:18Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2509.09487v1",
    "url": "https://arxiv.org/abs/2509.09487v1",
    "pdf_url": "https://arxiv.org/pdf/2509.09487v1.pdf",
    "title": "Vorticity Packing Effects on Turbulent Transport in Decaying 2D   Incompressible Navier-Stokes Fluids",
    "abstract": "This paper investigates the role of initial vorticity packing fractions on the transport properties of decaying incompressible two-dimensional Navier-Stokes turbulence at very high Reynolds numbers and spatial resolutions. Turbulence is initiated via the Kelvin-Helmholtz instability and evolves through nonlinear inverse energy cascades, forming large-scale coherent structures that dominate the flow over long eddy turnover times. The initial vorticity packing fraction and circulation direction lead to qualitatively distinct turbulence dynamics and transport behaviors. Tracer particle trajectories are computed in the fluid field obtained using the Eulerian framework, with transport and mixing quantified using statistical measures such as absolute dispersion, position probability distribution functions (PDFs), and velocity PDFs. In the early stages, the onset of turbulence is primarily governed by the instability growth rate, which increases with vorticity packing fraction. As the flow evolves, transport exhibits a range of behaviors-subdiffusive, diffusive, or superdiffusive-and transitions between anisotropic and isotropic regimes, depending on the initial vorticity packing, flow structure, and stage of evolution. At later times, transport is dominated by the motion of large-scale coherent vortices, whose dynamics are also influenced by the initial vorticity packing ranging from subdiffusive trapping rotational motion and random walks, and L\\'evy flight-like events. These findings offer insights into transport in quasi-2D systems-ranging from laboratory-scale flows to geophysical phenomena and astrophysical structures-through analogies with 2D Navier-Stokes turbulence.",
    "authors": [
      "Snehanshu Maiti",
      "Shishir Biswas",
      "Rajaraman Ganesh"
    ],
    "published": "2025-09-11T14:21:41Z",
    "updated": "2025-09-11T14:21:41Z",
    "categories": [
      "physics.flu-dyn",
      "nlin.CD",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.flu-dyn"
  },
  {
    "arxiv_id": "2503.19862v3",
    "url": "https://arxiv.org/abs/2503.19862v3",
    "pdf_url": "https://arxiv.org/pdf/2503.19862v3.pdf",
    "title": "Early Career Researcher Input to the European Strategy for Particle   Physics Update: White Paper",
    "abstract": "This document, written by early career researchers (ECRs) in particle physics, aims to represent the perspectives of the European ECR community and serves as input for the 2025--2026 update of the European Strategy for Particle Physics. With input from a community-wide survey, it highlights key challenges faced by ECRs -- career stability, funding access and long-term research opportunities -- while proposing policy recommendations and targeted initiatives. It underscores the importance of practices fostering diverse, equitable, inclusive and healthy workplaces, as well as of stronger ECR communities, and highlights how effective communication and interdisciplinary collaborations reinforce the societal relevance of particle physics and promote continued support for large-scale and long-term projects. Finally, the future of both collider and beyond-collider experiments is addressed, emphasising the critical role of ECRs in shaping future projects. The ECR contribution is formed of two parts: the ten-page executive summary submitted as input to the European Strategy for Particle Physics Update and, as backup document, this extended white paper providing additional context.",
    "authors": [
      "Jan-Hendrik Arling",
      "Alexander Burgman",
      "Christina Dimitriadi",
      "Ulrich Einhaus",
      "Axel Gallén",
      "Abdelhamid Haddad",
      "Laura Huhta",
      "Armin Ilg",
      "Jan Klamka",
      "Elizabeth Long",
      "Thomas Madlener",
      "Arnau Morancho Tardà",
      "Emanuela Musumeci",
      "Krzysztof Mękała",
      "Elena Pompa Pacchi",
      "Marvin Pfaff",
      "Daniel Reichelt",
      "Leonhard Reichenbach",
      "Birgit Stapf",
      "Francesco P. Ucci",
      "Erik Wallin",
      "Harriet Watson",
      "Sagar Vidya Addepalli",
      "Bruno Alves",
      "Robert Mihai Amarinei",
      "Ricardo Barrué",
      "Lydia Brenner",
      "Giacomo Da Molin",
      "Arturo de Giorgi",
      "Bohdan Dudar",
      "Francesco Giuli",
      "Andrea Gurgone",
      "César Jesús-Valls",
      "Antoine Laudrain",
      "Martin J. Losekamm",
      "Rafał Masełek",
      "Wrishik Naskar",
      "Miquel Nebot-Guinot",
      "Marko Pesut",
      "Thomas Pöschl",
      "Efrain P. Segarra",
      "Rebecca Taylor",
      "Pavel Vana",
      "Hannah Wakeling",
      "Aidan R. Wiederhold"
    ],
    "published": "2025-03-25T17:29:10Z",
    "updated": "2025-09-11T13:51:23Z",
    "categories": [
      "hep-ex",
      "hep-ph",
      "hep-th",
      "physics.acc-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2508.09509v2",
    "url": "https://arxiv.org/abs/2508.09509v2",
    "pdf_url": "https://arxiv.org/pdf/2508.09509v2.pdf",
    "title": "A hyperbolic finite difference scheme for anisotropic diffusion   equations: preserving the discrete maximum principle",
    "abstract": "A hyperbolic system approach is proposed for robust computation of anisotropic diffusion equations that appear in quasineutral plasmas. Though the approach exhibits merits of high extensibility and accurate flux computation, the monotonicity of the scheme for anisotropic diffusion cases has not been understood. In this study, the discrete maximum principle (DMP) of the hyperbolic system approach is analyzed and tested in various anisotropic diffusion cases. A mathematical analysis is conducted to obtain an optimal condition of an arbitrary parameter to guarantee the DMP, and numerical experiments reveal an adoptive selection of the parameter for DMP-preserving results. It is confirmed that, with an appropriate preconditioning matrix and parameter choice, the hyperbolic system approach preserves the DMP even with a linear discretization.",
    "authors": [
      "Tokuhiro Eto",
      "Rei Kawashima"
    ],
    "published": "2025-08-13T05:44:45Z",
    "updated": "2025-09-11T13:43:09Z",
    "categories": [
      "math.NA",
      "cs.NA",
      "physics.plasm-ph",
      "35K20, 65M12, 65N06"
    ],
    "primary_category": "math.NA"
  },
  {
    "arxiv_id": "2508.09335v2",
    "url": "https://arxiv.org/abs/2508.09335v2",
    "pdf_url": "https://arxiv.org/pdf/2508.09335v2.pdf",
    "title": "Geometric Optical Throughput and Etendue Revisited: Introducing the   Optogeometric Factor for Pixel Level Quantitative Imaging",
    "abstract": "This paper formally defines the optogeometric factor $F_{\\mathrm{opg}}$ as a pixel level quantity of geometric optical throughput, with units of $\\text{m}^2\\cdot\\text{sr}$ (or $\\text{m}^2$ in reduced form), derived from \\'etendue. Whereas \\'etendue is conventionally used to characterise the throughput of entire optical systems, the optogeometric factor is localised to the level of a single detector pixel, providing a new way to link scene radiance to the radiant flux actually collected by that pixel.   Although examples are drawn from infrared thermography, the formulation is general and applies equally to visible, ultraviolet, and Xray imaging systems.   The underlying radiometric principle is well established: classical radiometry already relates radiance, area, and solid angle. The new contribution of this work is to isolate that pixel level term, to name it as $F_{\\mathrm{opg}}$, and to derive its explicit forms. In this way, $F_{\\mathrm{opg}}$ acts as a compact and universal descriptor of pixel level radiometric throughput.   The present study builds on an earlier quantitative thermography equation that already expressed the radiant flux collected by an individual pixel. In that formulation, the scene based form of the optogeometric factor was present only implicitly, embedded in the derivation. Here, $F_{\\mathrm{opg}}$ is made explicit as an independent radiometric quantity, providing a more transparent and general framework that links pixel level geometry to radiometric throughput.   Two formulations of $F_{\\mathrm{opg}}$ are derived: a scene based form, expressed through the pixel footprint area and instantaneous field of view, and a sensor based form, expressed through the pixel pitch and optical $f$number. They coincide numerically under the paraxial approximation and other conditions discussed in this work.",
    "authors": [
      "Jan Sova",
      "Marie Kolaříková"
    ],
    "published": "2025-08-12T20:45:23Z",
    "updated": "2025-09-11T13:19:29Z",
    "categories": [
      "physics.optics",
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2509.09316v1",
    "url": "https://arxiv.org/abs/2509.09316v1",
    "pdf_url": "https://arxiv.org/pdf/2509.09316v1.pdf",
    "title": "Novel Room-Temperature Synthesis of Tellurium-Loaded Liquid   Scintillators for Neutrinoless Double Beta Decay Search",
    "abstract": "This study establishes an innovative room-temperature synthesis approach for tellurium-diol (Te-diol) compounds, which are crucial components in tellurium-loaded liquid scintillator (Te-LS). The synthesis involves the direct reaction of telluric acid with diols (e.g., 1,2-hexanediol) in methanol under ambient conditions (20$\\pm$5{\\deg}C) , with the key features of lower energy consumption, enhanced safety, and improved scalability. Mechanistic studies reveal that methanol serves not merely as a solvent but also as a catalyst, playing a critical role in the room-temperature synthesis. The organic amine N,N-dimethyldodecylamine demonstrates dual functionality as both catalyst and stabilizer. The Te-diol compounds enable fabrication of high-performance Te-LS exhibiting exceptional optical transparency ($\\Delta Abs$(430nm) $\\leq$ 0.0003 per 1% Te loading), achieving long-term spectral stability exceeding or approaching one year for both 1% and 3% Te formulations, and demonstrating a light yield comparable to that achieved by the azeotropic distillation method. The developed protocol offers a green, efficient alternative for large-scale Te-LS production, particularly valuable for next-generation neutrinoless double-beta decay experiments.",
    "authors": [
      "Yayun Ding",
      "Mengchao Liu",
      "Gaosong Li",
      "Liangjian Wen",
      "Fei Liu",
      "Feng Liu",
      "Jiayu Jiang",
      "Zhiqi Zhang",
      "Wenjie Li",
      "Zhiyong Zhang"
    ],
    "published": "2025-09-11T10:01:29Z",
    "updated": "2025-09-11T10:01:29Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.09260v1",
    "url": "https://arxiv.org/abs/2509.09260v1",
    "pdf_url": "https://arxiv.org/pdf/2509.09260v1.pdf",
    "title": "Study of a Compact Device for Water Attenuation Length Measurements",
    "abstract": "This study presents the development and validation of a compact device for measuring the water attenuation length (WAL), utilizing photomultiplier tubes (PMTs), optical fibers, and LEDs. An 8 m water tank and the device was constructed and validated in the laboratory. The device is capable of measuring WAL values up to 50 m. The stray light was blocked mainly by a custom-designed shutter. Toy Monte Carlo simulations were employed to evaluate the measurement uncertainty, which was found to be within reasonable limits. These simulations further indicate that the uncertainty can be reduced and more accurately predicted for a larger-scale device with a length of 30 m. Real-time monitoring was achieved by integrating the device into a water purification circulation system, providing a practical, scalable solution for WAL measurement in future large-scale water Cherenkov detectors.",
    "authors": [
      "Junyou Chen",
      "Jilei Xu",
      "Yongbo Huang",
      "Sibo Wang",
      "Chuanshi Dong",
      "Haoqi Lu",
      "Changgen Yang",
      "Yongpeng Zhang",
      "Yi Wang"
    ],
    "published": "2025-09-11T08:44:16Z",
    "updated": "2025-09-11T08:44:16Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.09187v1",
    "url": "https://arxiv.org/abs/2509.09187v1",
    "pdf_url": "https://arxiv.org/pdf/2509.09187v1.pdf",
    "title": "TCT-based monitoring of LGAD radiation hardness for ATLAS-HGTD   production",
    "abstract": "Production of the High Granularity Timing Detector for the ATLAS experiment at High Luminosity LHC requires over 21000 silicon sensors based on Low Gain Avalanche Diode (LGAD) technology. Their radiation hardness is monitored as a part of the production quality control. Dedicated test structures from each wafer are irradiated with neutrons and a fast and comprehensive characterization is required. We introduce a new test method based on Transient Current Technique (TCT) performed in the interface region of two LGAD devices. The measurement enables extraction of numerous sensor performance parameters, such as LGAD gain layer depletion voltage, LGAD gain dependence on bias voltage, sensor leakage current and effective interpad distance. Complementary capacitance-voltage measurements and charge collection measurements with 90Sr on the same samples have been performed to calibrate the TCT results in terms of charge collection and define acceptance criteria for wafer radiation hardness in the ATLAS-HGTD project.",
    "authors": [
      "Iskra Velkovska",
      "Bojan Hiti"
    ],
    "published": "2025-09-11T06:55:23Z",
    "updated": "2025-09-11T06:55:23Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2403.03156v6",
    "url": "https://arxiv.org/abs/2403.03156v6",
    "pdf_url": "https://arxiv.org/pdf/2403.03156v6.pdf",
    "title": "The Fast Stochastic Matching Pursuit for Neutrino and Dark Matter   Experiments",
    "abstract": "Photomultiplier tubes (PMTs) are widely deployed at neutrino and dark matter experiments for photon counting. When multiple photons hit a PMT consecutively, their photo-electron (PE) pulses pile up to hinder the precise measurements of the count and timings. We introduce Fast Stochastic Matching Pursuit (FSMP) to analyze the PMT signal waveforms into individual PEs with the strategy of reversible-jump Markov-chain Monte Carlo. We demonstrate that FSMP improves the energy and time resolution of PMT-based experiments and gains acceleration on GPUs. It is suitable for dynode PMTs, and is extensible to microchannel-plate (MCP) PMTs. In the condition of our laboratory characterization of 8-inch MCP-PMTs, FSMP improves the energy resolution by up to 10% from the conventional method of waveform integration.",
    "authors": [
      "Yuyi Wang",
      "Aiqiang Zhang",
      "Yiyang Wu",
      "Benda Xu",
      "Xuewei Liu",
      "Jiajie Chen",
      "Zhe Wang",
      "Shaomin Chen"
    ],
    "published": "2024-03-05T17:49:06Z",
    "updated": "2025-09-11T04:54:31Z",
    "categories": [
      "hep-ex",
      "physics.data-an",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1016/j.nima.2025.170986"
  },
  {
    "arxiv_id": "2509.09126v1",
    "url": "https://arxiv.org/abs/2509.09126v1",
    "pdf_url": "https://arxiv.org/pdf/2509.09126v1.pdf",
    "title": "Exploration on the Two-stream Instability in the Polar Cusp Under Solar   Storm Disturbances and its Potential Impacts on Spacecraft",
    "abstract": "During solar storms, the polar cusp often exhibits electron populations with distinct velocity distributions, which may be associated with the two-stream instability. This study reveals the evolution of the two-stream instability associated with electron velocities and the interaction between the growth phase of the two-stream instability and the electrostatic solitary waves (ESWs). The results from particle-in-cell (PIC) simulations are compared with satellite observational data and computational outcomes. The potential risks associated with two-stream instability, including surface charge accumulation and communication system interference on spacecraft, are also explored. The findings show that, in the high-latitude polar cusp region, the interaction between the solar wind plasma propagating along magnetic field lines and the upward-moving ionospheric plasma could drive two-stream instability, leading to the formation of electron hole structures in phase space and triggering a bipolar distribution of ESWs. When the spatial magnetic field and wave vector meet specific conditions, the enhanced electron cyclotron motion could suppress the formation of two-stream instability and electron hole structures, leading to a reduction in the amplitude of the ESWs. The results offer valuable insights for a deeper understanding of the impact of solar storms on the polar cusp environment, as well as for monitoring electromagnetic environment and ensuring the stable operation of spacecraft.",
    "authors": [
      "Jikai Sun",
      "Lei Chang",
      "Yu Liu",
      "Guojun Wang",
      "Zichen Kan",
      "Shijie Zhang",
      "Jingjing Ma",
      "Dingzhou Li",
      "Yingxin Zhao"
    ],
    "published": "2025-09-11T03:42:32Z",
    "updated": "2025-09-11T03:42:32Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.09104v1",
    "url": "https://arxiv.org/abs/2509.09104v1",
    "pdf_url": "https://arxiv.org/pdf/2509.09104v1.pdf",
    "title": "Exploration of novel ICP using helicon antennas with zero magnetic field",
    "abstract": "Inductively coupled plasma (ICP) attracts great attention from aspects of fundamental research and practical applications, and efficient power coupling is highly desirable for both of them. The present study explores a novel strategy for efficient ICP through using helicon antennas with zero external magnetic field. Specific research is devoted to the effects of antenna geometry (loop, half-helix, Boswell, Nagoya III), driving frequency (13.56-54.24 MHz) and radial density profile (Gaussian and parabolic) on power coupling. Findings reveal that: loop antenna yields higher power deposition efficiency than half-helix, Boswell, and Nagoya III antennas, driving frequency gives negligible effects, and parabolic density profile results in more efficient power coupling than Gaussian density profile especially in the radial direction, for the conditions employed here. Therefore, it is suggested that for this novel ICP strategy one should use loop antenna with parabolic density profile, and the industrial frequency of 13.56 MHz can work well. This study provides a valuable reference for the novel design of efficient ICP sources, which could be used for material processing and space propulsion, etc. Key words: Inductively coupled plasma; Antenna Geometry; Power Deposition; Driving Frequency",
    "authors": [
      "Ye Tao",
      "Lei Chang",
      "Dingzhou Li",
      "Yingxin Zhao"
    ],
    "published": "2025-09-11T02:29:56Z",
    "updated": "2025-09-11T02:29:56Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.09057v1",
    "url": "https://arxiv.org/abs/2509.09057v1",
    "pdf_url": "https://arxiv.org/pdf/2509.09057v1.pdf",
    "title": "Unraveling the emission mechanism powering long period radio transients   from interacting white dwarf binaries via kinetic plasma simulations",
    "abstract": "Recent observations of long period radio transients, such as GLEAM-X J0704-37 and ILTJ1101 + 5521, have revealed a previously unrecognized population of galactic radio transient sources associated with white dwarf - M dwarf binaries. It is an open question how to produce coherent radio emission in these systems, though a model driven by binary interaction seems likely given the nature and correlation of the emission with the binaries' orbital period. Using kinetic plasma simulations, we demonstrate that the relativistic electron cyclotron maser instability (ECMI) is a viable mechanism for generating radio pulses in white dwarf - M dwarf systems, akin to planetary radio emission, such as that from the Jupiter-Io system. We quantify the relativistic ECMI in the nonlinear regime under conditions relevant for white dwarf radio emission for the first time. Our simulations demonstrate that the ECMI can intrinsically produce partially linearly polarized emission relevant to explaining the observed emission spectrum of the two galactic sources, though the precise details will depend on the plasma composition. Our work paves the way for a systematic and fully nonlinear computational modeling of radio emission from interacting white dwarf sources.",
    "authors": [
      "Yici Zhong",
      "Elias R. Most"
    ],
    "published": "2025-09-10T23:33:04Z",
    "updated": "2025-09-10T23:33:04Z",
    "categories": [
      "astro-ph.HE",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2509.09040v1",
    "url": "https://arxiv.org/abs/2509.09040v1",
    "pdf_url": "https://arxiv.org/pdf/2509.09040v1.pdf",
    "title": "Suppression of pair beam instabilities in a laboratory analogue of   blazar pair cascades",
    "abstract": "The generation of dense electron-positron pair beams in the laboratory can enable direct tests of theoretical models of $\\gamma$-ray bursts and active galactic nuclei. We have successfully achieved this using ultra-relativistic protons accelerated by the Super Proton Synchrotron at CERN. In the first application of this experimental platform, the stability of the pair beam is studied as it propagates through a metre-length plasma, analogous to TeV $\\gamma$-ray induced pair cascades in the intergalactic medium. It has been argued that pair beam instabilities disrupt the cascade, thus accounting for the observed lack of reprocessed GeV emission from TeV blazars. If true this would remove the need for a moderate strength intergalactic magnetic field to explain the observations. We find that the pair beam instability is suppressed if the beam is not perfectly collimated or monochromatic, hence the lower limit to the intergalactic magnetic field inferred from $\\gamma$-ray observations of blazars is robust.",
    "authors": [
      "Charles D. Arrowsmith",
      "Francesco Miniati",
      "Pablo J. Bilbao",
      "Pascal Simon",
      "Archie F. A. Bott",
      "Stephane Burger",
      "Hui Chen",
      "Filipe D. Cruz",
      "Tristan Davenne",
      "Anthony Dyson",
      "Ilias Efthymiopoulos",
      "Dustin H. Froula",
      "Alice Goillot",
      "Jon T. Gudmundsson",
      "Dan Haberberger",
      "Jack W. D. Halliday",
      "Tom Hodge",
      "Brian T. Huffman",
      "Sam Iaquinta",
      "Graham Marshall",
      "Brian Reville",
      "Subir Sarkar",
      "Alexander A. Schekochihin",
      "Luis O. Silva",
      "Raspberry Simpson",
      "Vasiliki Stergiou",
      "Raoul M. G. M. Trines",
      "Thibault Vieu",
      "Nikolaos Charitonidis",
      "Robert Bingham",
      "Gianluca Gregori"
    ],
    "published": "2025-09-10T22:21:43Z",
    "updated": "2025-09-10T22:21:43Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2509.09010v1",
    "url": "https://arxiv.org/abs/2509.09010v1",
    "pdf_url": "https://arxiv.org/pdf/2509.09010v1.pdf",
    "title": "Cryogenic geometric anti-spring vibration isolation system",
    "abstract": "The combination of low temperature and low vibration levels is key for ultrasensitive sensing applications such as scanning probe microscopy, large-mass quantum mechanics, and gravitational wave detection. Unfortunately, closed-cycle cryostats using pulse tube or GM coolers introduce strong low-frequency vibrations starting at 1 Hz. Mass-spring systems allow passive isolation, but for low-frequency applications the required spring constants and masses become impractical. Blade-based geometric anti-spring systems are compact isolators that operate from sub-Hz frequencies, but have not been demonstrated at cryogenic temperatures. Here, we characterize a geometric anti-spring system tuned to operate at cryogenic temperatures. Our cryogenic filter uses radially arranged titanium blade springs whose effective spring constant can be tuned in-situ using a magnetic actuator. Our system achieves a vertical resonance frequency of 185 mHz at 7K, which allows reduction of vibrations at the problematic 1 Hz cooler frequency by an order of magnitude.",
    "authors": [
      "L. Feenstra",
      "S. Domínguez-Calderón",
      "K. van Oosten",
      "H. S. M. Bohemen",
      "T. Benschop",
      "M. Brinkman",
      "M. Li",
      "E. Hennes",
      "R. Cornelissen",
      "B. J. Hensen",
      "A. Bertolini",
      "M. P. Allan"
    ],
    "published": "2025-09-10T21:13:37Z",
    "updated": "2025-09-10T21:13:37Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.08987v1",
    "url": "https://arxiv.org/abs/2509.08987v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08987v1.pdf",
    "title": "HitPix3 -- a new HV-CMOS active pixel sensor for ion beam therapy",
    "abstract": "Particle therapy is a well-established clinical treatment of tumors and so far, more than one hundred centers are in operation around the world. High accuracy on position and dose rate in beam monitoring are major cornerstones of clinical success in particle therapy. A high voltage CMOS (HV-CMOS) monolithic active pixel sensor was developed for this beam monitoring system. The HV-CMOS technology has demonstrated many advantages over other technologies in dealing with radiation tolerance. This HV-CMOS sensor was produced with a 180 nm commercial technology on high-resistivity substrate. The HitPix sensor features several specific design details for operation in a high-intensity ion beam environment: hit-counting pixels, on-sensor projection calculation, radiation tolerant design and frame-based readout. It has a 9775 $\\mu$m $\\times$ 10110 $\\mu$m sensor area with 200 $\\mu$m $\\times$ 200 $\\mu$m pixel size. The new HitPix3 has a number of improvements, including a modified in-pixel amplifier, on-sensor calculation of beam profile projection in two dimensions, and in-pixel threshold tuning capacity. The functionality of these features was confirmed in laboratory tests of unirradiated HitPix3 sensors, making the HitPix3 an important step in developing a sensor for use in ion beam monitoring.",
    "authors": [
      "Hui Zhang",
      "Bogdan Topko",
      "Ivan Perić"
    ],
    "published": "2025-09-10T20:35:47Z",
    "updated": "2025-09-10T20:35:47Z",
    "categories": [
      "physics.ins-det",
      "physics.med-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.08931v1",
    "url": "https://arxiv.org/abs/2509.08931v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08931v1.pdf",
    "title": "Fabrication of thin planar radiopure foils with 82Se for the SuperNEMO   Demonstrator",
    "abstract": "The SuperNEMO Demonstrator, designed to search for double beta decay using enriched 82Se, has been assembled in the Modane Underground Laboratory under the French Alps. Thin foils with radio - purified and enriched 82Se are installed centrally in the detector. A novel foil fabrication method has been developed, improving the radiopurity achieved in the previous generation experiment. It consists of wrapping standalone selenium pads in raw Mylar, combined with selenium purified by a new reverse-chromatography method. This paper describes the features of these foils, their fabrication process, the characterization results, and the integration of the foils into the SuperNEMO Demonstrator.",
    "authors": [
      "X. Aguerre",
      "A. Barabash",
      "A. Basharina-Freshville",
      "M. Bongrand",
      "Ch. Bourgeois",
      "D. Breton",
      "R. Breier",
      "J. Busto",
      "C. Cerna",
      "J. Cesar",
      "M. Ceschia",
      "E. Chauveau",
      "S. De Capua",
      "D. Duchesneau",
      "J. J. Evans",
      "D. V. Filosofov",
      "M. Granjon",
      "M. Hoballah",
      "R. Hodák",
      "J. Horkley",
      "A. Jeremie",
      "S. Jullian",
      "J. Kaizer",
      "A. A. Klimenko",
      "O. Kochetov",
      "F. Koňařík",
      "S. Konovalov",
      "T. Křižák",
      "A. Lahaie",
      "K. Lang",
      "Y. Lemière",
      "T. Le Noblet",
      "P. Li",
      "P. Loaiza",
      "J. Maalmi",
      "M. Macko",
      "F. Mamedov",
      "C. Marquet",
      "F. Mauger",
      "A. Mendl",
      "B. Morgan",
      "I. Nemchenok",
      "V. Palušová",
      "C. Patrick",
      "F. Perrot",
      "M. Petro",
      "F. Piquemal",
      "P. Povinec",
      "S. Pratt",
      "M. Proga",
      "W. S. Quinn",
      "A. V. Rakhimov",
      "Y. R amachers",
      "A. Remoto",
      "N. I. Rukhadze",
      "R. Saakyan",
      "R. Salazar",
      "J. Sedgbeer",
      "Y. Shitov",
      "L. Simard",
      "F. Šimkovic",
      "A. A. Smolnikov",
      "S. Söldner-Rembold",
      "I. Štekl",
      "J. Suhonen",
      "H. Tedjditi",
      "J. Thomas",
      "V. Timkin",
      "V. Tretyak",
      "V. I. Tretyak",
      "G. Turnbull",
      "Y. Vereshchaka",
      "G. Warot",
      "D. Waters",
      "V. Yumatov"
    ],
    "published": "2025-09-10T18:51:47Z",
    "updated": "2025-09-10T18:51:47Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2410.21162v3",
    "url": "https://arxiv.org/abs/2410.21162v3",
    "pdf_url": "https://arxiv.org/pdf/2410.21162v3.pdf",
    "title": "Phase space compression of a positive muon beam in two spatial   dimensions",
    "abstract": "We present the first demonstration of simultaneous phase space compression in two spatial dimensions of a positive muon beam, the first stage of the novel high-brightness muon beam under development by the muCool collaboration at the Paul Scherrer Institute. The keV-energy, sub-mm size beam would enable a factor 10$^5$ improvement in brightness for precision muSR, and atomic and particle physics measurements with positive muons. This compression is achieved within a cryogenic helium gas target with a strong density gradient, placed in a homogeneous magnetic field, under the influence of a complex electric field. In the next phase, the muon beam will be extracted into vacuum.",
    "authors": [
      "A. Antognini",
      "N. J. Ayres",
      "I. Belosevic",
      "V. Bondar",
      "A. Eggenberger",
      "M. Hildebrandt",
      "R. Iwai",
      "K. Kirch",
      "A. Knecht",
      "G. Lospalluto",
      "J. Nuber",
      "A. Papa",
      "M. Sakurai",
      "I. Solovyev",
      "D. Taqqu",
      "T. Yan"
    ],
    "published": "2024-10-28T16:03:41Z",
    "updated": "2025-09-10T18:40:15Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2503.07941v2",
    "url": "https://arxiv.org/abs/2503.07941v2",
    "pdf_url": "https://arxiv.org/pdf/2503.07941v2.pdf",
    "title": "Gain characterization of LGAD sensors with beta particles and 28-MeV   protons",
    "abstract": "Low Gain Avalanche Diodes, also known as LGADs, are widely considered for fast-timing applications in high energy physics, nuclear physics, space science, medical imaging, and precision measurements of rare processes. Such devices are silicon-based and feature an intrinsic gain due to a $p{^+}$-doped layer that allows the production of a controlled avalanche of carriers, with multiplication on the order of 10-100. This technology can provide time resolution on the order of 20-30 ps, and variants of this technology can provide precision tracking too. The characterization of LGAD performance has so far primarily been focused on the interaction of minimum ionizing particles for high energy and nuclear physics applications. This article expands the study of LGAD performance to highly-ionizing particles, such as 28-MeV protons, which are relevant for several future scientific applications, e.g. in biology and medical physics, among others. These studies were performed with a beam of 28-MeV protons from a tandem Van de Graaff accelerator at Brookhaven National Laboratory and beta particles from a $^{90}{\\rm Sr}$ source; these were used to characterize the response and the gain of an LGAD as a function of bias voltage and collected charge. The experimental results are also compared to TCAD simulations.",
    "authors": [
      "Mohamed Hijas Mohamed Farook",
      "Gabriele Giacomini",
      "Gabriele DAmen",
      "Giovanni Pinaroli",
      "Enrico Rossi",
      "Sally Seidel",
      "Alessandro Tricoli"
    ],
    "published": "2025-03-11T00:47:10Z",
    "updated": "2025-09-10T18:37:55Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex",
      "physics.app-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.08810v1",
    "url": "https://arxiv.org/abs/2509.08810v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08810v1.pdf",
    "title": "Euclid: Methodology for derivation of IPC-corrected conversion gain of   nonlinear CMOS APS",
    "abstract": "We introduce a fast method to measure the conversion gain in Complementary Metal-Oxide-Semiconductors (CMOS) Active Pixel Sensors (APS), which accounts for nonlinearity and interpixel capacitance (IPC). The standard 'mean-variance' method is biased because it assumes pixel values depend linearly on signal, and existing methods to correct for nonlinearity are still introducing significant biases. While current IPC correction methods are prohibitively slow for a per-pixel application, our new method uses separate measurements of the IPC kernel to make an almost instantaneous calculation of gain. Validated using test data from a flight detector from the ESA Euclid mission, the IPC correction recovers the results of slower methods within 0.1% accuracy. Meanwhile the nonlinearity correction ensures an estimation of the gain that is independent of signal, correcting a bias of more than 2.5% on gain estimation.",
    "authors": [
      "J. Le Graet",
      "A. Secroun",
      "M. Tourneur-Silvain",
      "W. Gillard",
      "N. Fourmanoit",
      "S. Escoffier",
      "E. Kajfasz",
      "S. Kermiche",
      "B. Kubik",
      "J. Zoubian",
      "S. Andreon",
      "M. Baldi",
      "S. Bardelli",
      "P. Battaglia",
      "D. Bonino",
      "E. Branchini",
      "M. Brescia",
      "J. Brinchmann",
      "A. Caillat",
      "S. Camera",
      "V. Capobianco",
      "C. Carbone",
      "J. Carretero",
      "S. Casas",
      "M. Castellano",
      "G. Castignani",
      "S. Cavuoti",
      "A. Cimatti",
      "C. Colodro-Conde",
      "G. Congedo",
      "C. J. Conselice",
      "L. Conversi",
      "Y. Copin",
      "F. Courbin",
      "H. M. Courtois",
      "A. Da Silva",
      "J. Dinis",
      "M. Douspis",
      "F. Dubath",
      "C. A. J. Duncan",
      "X. Dupac",
      "S. Dusini",
      "A. Ealet",
      "M. Farina",
      "S. Farrens",
      "F. Faustini",
      "S. Ferriol",
      "M. Frailis",
      "E. Franceschi",
      "S. Galeotta",
      "B. Gillis",
      "C. Giocoli",
      "F. Grupp",
      "S. V. H. Haugan",
      "W. Holmes",
      "F. Hormuth",
      "A. Hornstrup",
      "P. Hudelot",
      "K. Jahnke",
      "M. Jhabvala",
      "A. Kiessling",
      "M. Kilbinger",
      "R. Kohley",
      "H. Kurki-Suonio",
      "P. B. Lilje",
      "V. Lindholm",
      "I. Lloro",
      "G. Mainetti",
      "D. Maino",
      "E. Maiorano",
      "O. Mansutti",
      "O. Marggraf",
      "K. Markovic",
      "N. Martinet",
      "F. Marulli",
      "R. Massey",
      "E. Medinaceli",
      "S. Mei",
      "M. Meneghetti",
      "G. Meylan",
      "M. Moresco",
      "L. Moscardini",
      "S. -M. Niemi",
      "J. W. Nightingale",
      "C. Padilla",
      "S. Paltani",
      "F. Pasian",
      "K. Pedersen",
      "V. Pettorino",
      "S. Pires",
      "G. Polenta",
      "M. Poncet",
      "L. A. Popa",
      "F. Raison",
      "A. Renzi",
      "J. Rhodes",
      "G. Riccio",
      "E. Romelli",
      "M. Roncarelli",
      "E. Rossetti",
      "R. Saglia",
      "D. Sapone",
      "B. Sartoris",
      "J. A. Schewtschenko",
      "M. Schirmer",
      "G. Seidel",
      "M. Seiffert",
      "C. Sirignano",
      "G. Sirri",
      "L. Stanco",
      "J. Steinwagner",
      "P. Tallada-Crespí",
      "D. Tavagnacco",
      "A. N. Taylor",
      "H. I. Teplitz",
      "I. Tereno",
      "R. Toledo-Moreo",
      "F. Torradeflot",
      "I. Tutusaus",
      "L. Valenziano",
      "T. Vassallo",
      "A. Veropalumbo",
      "Y. Wang",
      "J. Weller"
    ],
    "published": "2025-09-10T17:42:51Z",
    "updated": "2025-09-10T17:42:51Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2501.17382v4",
    "url": "https://arxiv.org/abs/2501.17382v4",
    "pdf_url": "https://arxiv.org/pdf/2501.17382v4.pdf",
    "title": "The nonmodal kinetic theory of the macroscale convective flows of   magnetized plasma, generated by the inhomogeneous microturbulenc",
    "abstract": "In this paper, we present the nonmodal kinetic theory of the macroscale two-dimensional compressed-sheared non-diffusive convective flows of a magnetized plasma generated by the inhomogeneous microturbulence. This theory bases on the two-scales approach to the solution of the Vlasov-Poisson system of equations for magnetized plasma, in which the self-consistent evolution of the plasma and of the electrostatic field on the microscales, commensurable with the wavelength of the microscale instabilities and of the ion gyroradius, as well as on the macroscales of a bulk of plasma, is accounted for. It includes the theory of the formation of the macroscale spatially inhomogeneous compressed-sheared convective flows by the inhomogeneous microturbulence, the theory of the back reaction of the macroscale convected flows on the microturbulence, and of the slow macroscale responce of a bulk of plasma on the development of the compressed-sheared convective flows.",
    "authors": [
      "V. V. Mikhailenko",
      "V. S. Mikhailenko",
      "Hae June Lee"
    ],
    "published": "2025-01-29T02:29:31Z",
    "updated": "2025-09-10T17:18:09Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2504.21820v2",
    "url": "https://arxiv.org/abs/2504.21820v2",
    "pdf_url": "https://arxiv.org/pdf/2504.21820v2.pdf",
    "title": "Two lock-in amplifiers based $3ω$ technique: a practical guide for   thermal conductivity experiments in bulk samples",
    "abstract": "The accurate determination of thermal conductivity $\\kappa(T)$ in bulk materials at room temperature and above is crucial for evaluating their compatibility for specific applications. The 3$\\omega$ technique is an established methodology for studying the thermal conductivity of thin films, becoming particularly suitable in the case of bulk specimens for $T\\gtrsim$300K, where standard stationary techniques require significant corrections for radiative losses. Although this method has been employed in several works, it remains not widely adopted because its implementation demands considerable sophistication, including experiment design, thin film deposition techniques, and choices of the geometry of the current/heat transducer, electronics, and analytical treatment of the signals. Based on a critical review of the technique's key technical aspects, this work provides practical support for a rapid and user-friendly implementation, from the design phase through to execution and analysis. We release a Python-based graphical user interface that supports a quantitative estimation of the investigated temperature profiles based on the geometrical parameters (width/length) of the deposited transducer (heater/thermometer metal line) before an experiment, guaranteeing an optimal design of the experimental conditions for each given material under scrutiny.",
    "authors": [
      "Alexandre Henriques",
      "Murilo Santoma",
      "Steffen Wirth",
      "Julio Larrea Jiménez",
      "Valentina Martelli"
    ],
    "published": "2025-04-30T17:24:55Z",
    "updated": "2025-09-10T16:03:38Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2509.08695v1",
    "url": "https://arxiv.org/abs/2509.08695v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08695v1.pdf",
    "title": "Above and beyond the laser induced anti Stokes broadband white light   emission in rare earth manganese perovskites",
    "abstract": "Herein, an experimental and theoretical analysis of broadband laser-induced white light emission (LIWE) in lead-free perovskite under near-infrared excitation is reported. LIWE is a tunable emission influenced by excitation wavelength, power density, pressure, and temperature. The radiance profile presented in this work closely resembles the solar spectral distribution, suggesting potential for solid-state lighting and photovoltaic applications. Based on theoretical modelling, along with photophysical and photoconductivity characterisations, a mathematical description of the LIWE generation is presented. This model describes LIWE as a dynamical process that explains the supralinear dependence of the integrated emission intensity on laser power density, pressure, photophysical kinetics, and photocurrent associated with the emission phenomena under excitation at high laser power densities.",
    "authors": [
      "Talita J. S. Ramos",
      "Agata Musialek",
      "Robert Tomala",
      "Wieslaw Strek"
    ],
    "published": "2025-09-10T15:38:40Z",
    "updated": "2025-09-10T15:38:40Z",
    "categories": [
      "physics.optics",
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2508.13105v2",
    "url": "https://arxiv.org/abs/2508.13105v2",
    "pdf_url": "https://arxiv.org/pdf/2508.13105v2.pdf",
    "title": "Eliminating Tokamak Disruptions with Feedback",
    "abstract": "Many disruptions are caused by resistive wall tearing modes (RWTM). A database of DIII-D locked mode disruptions provides two main disruption criteria, which are shown to be signatures of RWTMs. The first is that the q = 2 rational surface must be sufficiently close the resistive wall surrounding the plasma to interact with it. If active feedback is used, this implies that RWTMs can be prevented from causing major disruptions. This is demonstrated in simulations. The second criterion is that the current profile is sufficiently peaked. This is caused by edge cooling, such as by impurity radiation and turbulence, which suppress edge current and temperature. This implies the disruptions are not caused by neoclassical tearing modes (NTM), because the bootstrap current is also suppressed. The dependence of the critical internal inductance on elongation is given, which suggests that elongation might be used as an actuator to prevent disruptions. At high $\\beta,$ resistive wall modes (RWM) can be stabilized with feedback. Feedback also stabilizes high $\\beta$ RWTMs, as shown in NSTX data and in simulations. These results suggest that RWTM disruptions in ITER might be prevented using the resonant magnetic perturbation (RMP) coils.",
    "authors": [
      "H. R. Strauss"
    ],
    "published": "2025-08-18T17:13:39Z",
    "updated": "2025-09-10T13:28:37Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.08562v1",
    "url": "https://arxiv.org/abs/2509.08562v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08562v1.pdf",
    "title": "Enhanced water Cherenkov detector for soil moisture detection",
    "abstract": "This work evaluates the ability of a water Cherenkov detector to measure thermal neutrons and explores its application to soil-moisture monitoring. We study a NaCl-doped detector and model its response to (i) monochromatic thermal neutrons and (ii) the natural thermal-neutron flux expected from dry soil at the elevation of Bucaramanga, Colombia. The ambient flux is estimated with the ARTI framework, and the detector response is simulated with MEIGA in Geant4. Doping with NaCl introduces additional capture channels on $^{35,37}\\mathrm{Cl}$ and $^{23}\\mathrm{Na}$; in particular, $^{35}\\mathrm{Cl}$ has a thermal-neutron absorption cross section up to two orders of magnitude larger than hydrogen, boosting the capture signal. Our results indicate that water Cherenkov detectors can detect thermal neutrons with practical sensitivity under field conditions, enabling their integration into precision agriculture networks for soil moisture sensing. More broadly, this approach extends the cosmic-ray detection range of Cherenkov detectors using non-toxic, low-cost materials.",
    "authors": [
      "J. Betancourt",
      "C. Sarmiento-Cano",
      "I. Sidelnik",
      "H. Asorey",
      "Y. Domínguez-Ballesteros",
      "L. Miranda-Leuro",
      "Luis A. Núñez"
    ],
    "published": "2025-09-10T13:06:34Z",
    "updated": "2025-09-10T13:06:34Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.HE",
      "astro-ph.IM",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.08525v1",
    "url": "https://arxiv.org/abs/2509.08525v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08525v1.pdf",
    "title": "Optimal Landau-type closure parameters for two-fluid simulations of   plasma turbulence at kinetic scales",
    "abstract": "Two fluid simulations using local Landau-fluid closures derived from linear theory provide an efficient computational framework for plasma modelling, since they bridge the gap between computationally intensive kinetic simulations and fluid descriptions. Their accuracy in representing kinetic effects depends critically on the validity of the linear approximation used in the derivation: the plasma should not be too far from local thermodynamic equilibrium, LTE. However, many of the problems where these models are of particular interest (such as plasma turbulence and instabilities) are in fact quite far from LTE. The question then arises, if kinetic scale processes are still sufficiently well captured outside of the theoretical regime of applicability of the closure. In this paper, we show that two fluid simulations with Landau fluid closures can effectively reproduce the energy spectra obtained with fully kinetic Vlasov simulations, used as references, as long as the local closure parameter is appropriately chosen. Our findings validate the usage of two fluid simulations with Landau-fluid closure as a possible alternative to fully kinetic simulations of turbulence, in cases where being able to simulate extremely large domains is of particular interest.",
    "authors": [
      "Simon Lautenbach",
      "Jeremiah Lübke",
      "Maria Elena Innocenti",
      "Katharina Kormann",
      "Rainer Grauer"
    ],
    "published": "2025-09-10T12:09:21Z",
    "updated": "2025-09-10T12:09:21Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.08474v1",
    "url": "https://arxiv.org/abs/2509.08474v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08474v1.pdf",
    "title": "Restarting the Numerical Flow Iteration through low rank tensor   approximations",
    "abstract": "The numerical flow iteration method has recently been proposed as a memory-slim solution method for the Vlasov-Poisson equation. It stores the temporal evolution of the electric field and reconstructs the solution in each time step by following the characteristics backwards in time and reconstructing the solution from the initial distribution. If the number of time steps gets large, the computational cost of this reconstruction may get prohibitive. Given a representation of the intermediate solution, the time intervals over which the characteristic curves need to be solved backwards in time can be reduced by restarting the numerical flow iteration after certain time intervals. In this paper, we propose an algorithm that reconstructs a low-rank representation of the solution at the restart times using the blackbox approximation. The proposed algorithm reduces the computational complexity compared to the pure numerical flow iteration from quadratic to linear in the number of times step while still keeping its memory complexity. On the other hand, our numerical results demonstrate that the methods preserves the property of the numerical flow iteration of showing much less dissipation of filaments compared to the semi-Lagrangian method.",
    "authors": [
      "Rostislav-Paul Wilhelm",
      "Katharina Kormann"
    ],
    "published": "2025-09-10T10:27:12Z",
    "updated": "2025-09-10T10:27:12Z",
    "categories": [
      "math.NA",
      "cs.NA",
      "physics.plasm-ph"
    ],
    "primary_category": "math.NA"
  },
  {
    "arxiv_id": "2509.08866v1",
    "url": "https://arxiv.org/abs/2509.08866v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08866v1.pdf",
    "title": "Uplink Pre-Compensation for Ground-to-Space Optical Communications Using   Downlink Tomographic Reconstruction",
    "abstract": "Uplink pre-compensation in ground-to-satellite optical links remains a problem, with an appropriate measurement of the wavefront error in the uplink path often not being available. We present a method that uses successive measurements of the readily accessible downlink beam to perform a tomographic reconstruction of the volume of atmosphere common to the downlink beam and the ground-station field-of-view. These measurements are done through the existing downlink wavefront sensor. From here, an estimate of the wavefront error along the uplink path can be obtained. We evaluate this method in simulation over representative atmospheric conditions and find good performance, especially for situations where the satellite point-ahead angle is many times greater than the atmosphere's isoplanatic angle. Compared to pre-compensation directly using the downlink phase, we find that this method estimates the uplink path with a residual mean-square wavefront error that is up to 8.6 times less. The hardware simplicity of this method makes it a promising solution for uplink pre-compensation implementations targeted at optical communications.",
    "authors": [
      "Alex Frost",
      "Nicolas Maron",
      "Shane Walsh",
      "Benjamin Dix-Matthews",
      "Sascha Schediwy",
      "Michael Hart"
    ],
    "published": "2025-09-10T09:11:50Z",
    "updated": "2025-09-10T09:11:50Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.14657v3",
    "url": "https://arxiv.org/abs/2508.14657v3",
    "pdf_url": "https://arxiv.org/pdf/2508.14657v3.pdf",
    "title": "Phase space transport, quasilinear diffusion and locality in phase   velocity",
    "abstract": "In this paper, we address the motion of charged particles subjected to a discrete spectrum of electrostatic waves. We focus on situations when transport dominates, leading to significant variations in particle velocity. Nonetheless, these velocity changes remain finite due to the presence of KAM tori bounding phase space. We analyze the conditions under which transport can be modeled as a diffusion process and evaluate the relevance of the so-called quasilinear value of the diffusion coefficient. We distinguish between traditional quasilinear diffusion, when wave-particle interaction is perturbative, and the so-called chaotic regime of diffusion, when the particle motion looks erratic. In the perturbative regime, we demonstrate both numerically and theoretically that diffusion occurs only when wave-particle interaction is local in phase velocity; that is, when wave contributions from phase velocities far from the particles instantaneous velocities are negligible. Conversely, numerical results indicate that chaotic diffusion can occur even when wave-particle interaction is not local. Furthermore, in regimes when quasilinear diffusion is applicable, we introduce a simple analytical expression for the time evolution of the velocity distribution function, that accounts for phase space boundaries.",
    "authors": [
      "Didier Bénisti"
    ],
    "published": "2025-08-20T12:16:51Z",
    "updated": "2025-09-10T09:11:00Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.08420v1",
    "url": "https://arxiv.org/abs/2509.08420v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08420v1.pdf",
    "title": "Slice Emittance Preservation and Focus Control in a Passive Plasma Lens",
    "abstract": "Strong, symmetrically focusing plasma lenses are promising for accommodating the small beams associated with plasma-based accelerators and collider final foci. However, while focusing with active and passive plasma lenses has been experimentally demonstrated, compatibility with high-brightness beams relevant for applications has not. In this Letter, we show experimentally that passive plasma lenses can preserve free-electron-laser-quality slice emittance while focusing two orders of magnitude more strongly than quadrupole magnets, and that the focal parameters can be controlled.",
    "authors": [
      "J. Björklund Svensson",
      "J. Beinortaitė",
      "L. Boulton",
      "B. Foster",
      "J. M. Garland",
      "P. González Caminal",
      "M. Huck",
      "H. Jones",
      "A. Kanekar",
      "G. Loisch",
      "J. Osterhoff",
      "F. Peña",
      "S. Schröder",
      "M. Thévenet",
      "S. Wesch",
      "M. Wing",
      "J. C. Wood",
      "R. D'Arcy"
    ],
    "published": "2025-09-10T09:06:31Z",
    "updated": "2025-09-10T09:06:31Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.08406v1",
    "url": "https://arxiv.org/abs/2509.08406v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08406v1.pdf",
    "title": "Simplified Analytical Models for Temperature-Dependent Characteristics   of Ultra-Fast Avalanche Detectors",
    "abstract": "Ultra-fast detectors have advanced the time resolution of semiconductor sensors to tens of picoseconds, while avalanche-type detectors, with internal gain, enable the detection of weak signals. In this work, we investigate the temperature dependence of ultra-fast avalanche detectors. Building on semiconductor theory and some empirical formulations, we establish a set of models to characterize key electrical properties and performance metrics such as gain and time resolution, and validate them through dedicated experiments. The results show good agreement between model predictions and experimental data, demonstrating the validity of the proposed models. This approach provides an efficient and physics-based method for rapid detector optimization and design.",
    "authors": [
      "Weiyi Sun",
      "Mengzhao Li",
      "Mei Zhao",
      "Zhijun Liang"
    ],
    "published": "2025-09-10T08:54:10Z",
    "updated": "2025-09-10T08:54:10Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.08321v1",
    "url": "https://arxiv.org/abs/2509.08321v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08321v1.pdf",
    "title": "Cepstral Strain Mapping for Small Pixel-Count Detectors",
    "abstract": "With the decreasing sizes of integrated-circuit components, the semiconductor industry is in growing need of high-throughput strain mapping techniques that offer high precision and spatial resolution, with desired industry goals of 0.01-0.1% and 1 nm respectively. As the fundamental limitation on the measurement precision is set by the Poisson noise, pixel array detectors with high saturation current, high dynamic range and fast readout are ideally suited for this purpose. However, due to the limited pixel count on these detectors, they do not work well with traditional strain mapping algorithms that were optimized to work on datasets with a large pixel count. Here, we evaluate the cepstral transform that was designed to address this problem, with the precision determined by the convergence, collection angles and dose while remaining insensitive to the pixel count. We test the performance of our method on silicon wedges and Si-SiGe multilayers, and using datasets collected at different conditions, we show how the measured strain precision scales as a function of dose, aperture size and sample thickness. Using precession gives a further improvement in precision by about 1.5-2x, whereas energy filtering does not have a significant impact on the cepstral method for device-relevant sample thickness ranges.",
    "authors": [
      "Harikrishnan KP",
      "Dasol Yoon",
      "Yu-Tsun Shao",
      "Zhaslan Baraissov",
      "Luigi Mele",
      "Christoph Mitterbauer",
      "Erik Kieft",
      "Stefano Vespucci",
      "David A. Muller"
    ],
    "published": "2025-09-10T06:56:01Z",
    "updated": "2025-09-10T06:56:01Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mtrl-sci",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.01249v2",
    "url": "https://arxiv.org/abs/2509.01249v2",
    "pdf_url": "https://arxiv.org/pdf/2509.01249v2.pdf",
    "title": "An Innovative Photon-Driven Subcritical Reactor Concept Powered by   Synchrotron Radiation Source",
    "abstract": "This paper introduces the conceptual design of a Photon Driven Reactor (PDR), an innovative subcritical reactor designed for energy generation driven by a synchrotron radiation. The PDR concept overcomes key technological challenges of conventional accelerator-driven systems, particularly the target's structural durability and its thermal management, by employing synchrotron photons directly interacting with fissile material to induce photonuclear reactions. Computational analyses involved criticality and fixed-source simulation using MCNPx and SERPENT Monte Carlo codes, providing robust evaluation of the neutron production, moderation, and multiplication mechanisms. The main focus of this study was to evaluate the system's capability to achieve a positive net energy gain, specifically assessing the thermal power output agains the electrical power absorbed from the grid. Furthermore, the adoption of spent nuclear fuel for the subcritical reactor core loading has been investigated, highlighting the sustainability and environmental benefits of the proposed PDR design. The proposed system is able to exploit a modularity feature. For each large synchrotron, up to fifty beam lines may be operated simultaneously, each delivering photons to an independent subcritical reactor core. With a photon flux on the order of $8.8 \\times 10^{17}$ photons per second in each beamline, the results indicate that each individual reactor can achieve a thermal output up to 8 MW, while requiring about 435-660 kW of electrical input from the grid, thereby demonstrating the feasibility of energy amplification in the PDR.",
    "authors": [
      "Antonio Cammi",
      "Lorenzo Loi",
      "Andrea Missaglia",
      "David Alesini",
      "Hans-Heinrich Braun"
    ],
    "published": "2025-09-01T08:41:41Z",
    "updated": "2025-09-10T06:53:36Z",
    "categories": [
      "physics.acc-ph",
      "physics.app-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2409.19704v2",
    "url": "https://arxiv.org/abs/2409.19704v2",
    "pdf_url": "https://arxiv.org/pdf/2409.19704v2.pdf",
    "title": "Reduced dimensional description of hydromagnetic turbulence capturing   higher order fluid moments",
    "abstract": "In this paper, Chandrasekhar's deductive theory of turbulence is extended to the case of hydrodynamics and hydromagnetics, with higher order fluid moments. We include the contributions from correlation tensors at two different points of space and two different points in time to account for the energy transfer between Fourier modes with different $k$ values. We start with three governing equations using the first three moments of Vlasov equation, which gives us particle, momentum and energy conservation relations, respectively. We obtain the scalar representations of correlation tensors for hydrodynamics as well as hydromagnetics. Finally we pick an example from literature where the energy spectra alone was not capable of explaining the observations reported by the authors.",
    "authors": [
      "Arindam Saikia",
      "Rupak Mukherjee"
    ],
    "published": "2024-09-29T13:38:45Z",
    "updated": "2025-09-10T04:36:10Z",
    "categories": [
      "physics.flu-dyn",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.flu-dyn"
  },
  {
    "arxiv_id": "2509.08178v1",
    "url": "https://arxiv.org/abs/2509.08178v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08178v1.pdf",
    "title": "Modeling of convective cells, turbulence, and transport induced by a   radio-frequency antenna in the tokamak boundary plasma",
    "abstract": "The edge turbulence model Hermes (Dudson et al., 2017 Plasma Phys. Control. Fusion 59 05401) is set up for plasma boundary simulations with an RF antenna, using parameters characteristic of a tokamak edge. Cartesian slab geometry is used with thin plate limiters representing the ICRF antenna side-wall limiters. Ad-hoc DC electric biasing of the limiters, motivated by calculations with VSim (Nieter et al., J. Comput. Phys. 196, 448 (2004)), represents an induced RF sheath rectified potential in the plasma turbulence model. Flux-driven turbulence simulations demonstrate a realistic distribution of plasma profiles and fluctuations. There is a clear effect of the antenna sheath voltage leading to formation of convective cells; bias-induced convective transport flattens the SOL density profile and fluctuations penetrate into the shadow region of the limiters as the bias voltage increases. Turbulent transport for impurity ions is inferred by following ion trajectories in the simulated plasma turbulence fields, showing Bohm-like effective diffusion rates. All in all, the model elucidates the key physical phenomena governing the effects of ICRF-induced antenna biasing on the tokamak boundary plasma.",
    "authors": [
      "M. V. Umansky",
      "B. D. Dudson",
      "T. G. Jenkins",
      "J. R. Myra",
      "D. N. Smithe"
    ],
    "published": "2025-09-09T22:58:28Z",
    "updated": "2025-09-09T22:58:28Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.08170v1",
    "url": "https://arxiv.org/abs/2509.08170v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08170v1.pdf",
    "title": "Dynamic control of laser driven electron acceleration in a photonic   structure using programmable optical pulses",
    "abstract": "Progress in optical techniques has made precision control of the phase profile in optical pulses common and accessible in scientific laboratories. Carefully shaping the field profile of a laser pulse can be used to master the dynamics of electrons traveling in photonic accelerating structures such as the ones obtained by precisely aligning two dielectric gratings. Here we show that by applying a liquid-crystal-mask to program the phase and amplitude of an infrared laser pulse in combination with a pulse front tilt scheme, it is possible to implement dynamic control on a laser accelerator. This results in a nearly limitless live tuning capability of the accelerator beam dynamics, allowing the demonstration software-based correction of structure and optical front imperfections, implementation of transverse focusing schemes, control of the energy and charge of the output beam, and ultimately optimization of the interaction length, leading to measured energy gains of up to 0.55 MeV.",
    "authors": [
      "Sophie Crisp",
      "R. Joel England",
      "Alexander Ody",
      "Pietro Musumeci"
    ],
    "published": "2025-09-09T22:11:57Z",
    "updated": "2025-09-09T22:11:57Z",
    "categories": [
      "physics.acc-ph",
      "physics.optics"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.05456v5",
    "url": "https://arxiv.org/abs/2507.05456v5",
    "pdf_url": "https://arxiv.org/pdf/2507.05456v5.pdf",
    "title": "Constraints on the magnetic field evolution in tokamak power plants",
    "abstract": "Tokamaks differ fundamentally from stellarators in the importance of the external coils in determining the magnetic field structure. Tokamak plasmas are in a self-organized state, especially when fusion rather than external heating dominates. Stellarator optimization focuses on the magnetic fields produced by the coils. Tokamak optimization considers plasma profiles, which are not easily controlled. A deviation of the profile of the plasma current over its full stability range produces only a small change, $\\sim 16\\%$, in the poloidal flux produced by the plasma current. This offers a simple explanation of why disruptions in tokamaks are so common, and why current-profile control though difficult seems to be required, especially during shutdown. The rapid temporal decay of $n\\tau_ET$ in high performance tokamak experiments shows the need for the careful control for other profiles. Here the focus is on the implications of Faraday's Law since important but new implications are easily derived. The context of the paper is twofold: (1) Simplified statements of the implications of the laws of physics, in particular Faraday's Law, should be helpful in the design of tokamak power plants. (2) Thoughtful allocation of resources among the various fusion concepts is needed to minimize the time and the cost to the achievement of practical fusion power.",
    "authors": [
      "Allen H Boozer"
    ],
    "published": "2025-07-07T20:17:20Z",
    "updated": "2025-09-09T20:48:03Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.08138v1",
    "url": "https://arxiv.org/abs/2509.08138v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08138v1.pdf",
    "title": "Spatial resolution studies with the BabyIAXO Micromegas prototype",
    "abstract": "The spatial resolution of the Micromegas prototype developed for the BabyIAXO experiment was evaluated using a low-energy X-ray beam at the SOLEIL synchrotron facility. BabyIAXO, currently under construction, aims to search for hypothetical solar axions. A key component of the experiment is a low-background X-ray detector with high efficiency in the 1-10 keV energy range and stringent background rejection capabilities. Achieving a spatial resolution on the order of, or better than, 1 mm is critical for accurately reconstructing signal shapes and positions, and for effectively discriminating between signal and background events. Therefore, a precise characterization of the detector's spatial resolution is essential to validate its suitability for the experiment. This study involved scanning the IAXO-D1 Micromegas detector under various beam energies, positions, and drift field configurations to evaluate their influence on spatial resolution. A resolution of approximately 100 $\\mu$m at 6 keV was achieved, confirming the strong potential of this technology for application in the final BabyIAXO setup.",
    "authors": [
      "A. Quintana",
      "J. Castel",
      "S. Cebrián",
      "T. Dafni",
      "D. Díez-Ibáñez",
      "E. Ferrer-Ribas",
      "A. Ezquerro",
      "J. Galán",
      "J. A. García",
      "A. Giganon",
      "C. Goblin",
      "N. Goyal",
      "F. J. Iguaz",
      "I. G Irastorza",
      "C. Loiseau",
      "G. Luzón",
      "C. Margalejo",
      "H. Mirallas",
      "L. Obis",
      "T. Papaevangelou",
      "O. Pérez",
      "J. Porrón",
      "M. J. Puyuelo"
    ],
    "published": "2025-09-09T20:42:48Z",
    "updated": "2025-09-09T20:42:48Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.13112v3",
    "url": "https://arxiv.org/abs/2508.13112v3",
    "pdf_url": "https://arxiv.org/pdf/2508.13112v3.pdf",
    "title": "Quantum sensing of electron beams using solid-state spins",
    "abstract": "Scattering experiments with energetic particles, such as free electrons, have been historically used to reveal the quantum structure of matter. However, realizing coherent interactions between free-electron beams and solid-state quantum systems has remained out of reach, owing to their intrinsically weak coupling. Realizing such coherent control would open up opportunities for hybrid quantum platforms combining free electrons and solid-state qubits for coincident quantum information processing and nanoscale sensing. Here, we present a framework that employs negatively charged nitrogen-vacancy centers (NV-) in diamond as quantum sensors of a bunched electron beam. We develop a Lindblad master equation description of the magnetic free-electron--qubit interactions and identify spin relaxometry as a sensitive probe of the interaction. Experimentally, we integrate a confocal fluorescence microscopy setup into a microwave-bunched electron beam line. We monitor charge-state dynamics and assess their impact on key sensing performance metrics (such as spin readout contrast), defining safe operating parameters for quantum sensing experiments. By performing $T_1$ relaxometry under controlled electron beam exposure, we establish an upper bound on the free-electron--spin coupling strength. Our results establish NV- centers as quantitative probes of free electrons, providing a metrological benchmark for free-electron--qubit coupling under realistic conditions, and chart a route toward solid-state quantum control with electron beams.",
    "authors": [
      "Jakob M. Grzesik",
      "Dominic Catanzaro",
      "Charles Roques-Carmes",
      "Eric I. Rosenthal",
      "Guido L. van de Stolpe",
      "Aviv Karnieli",
      "Giovanni Scuri",
      "Souvik Biswas",
      "Kenneth J. Leedle",
      "Dylan S. Black",
      "Robert L. Byer",
      "Ido Kaminer",
      "R. Joel England",
      "Shanhui Fan",
      "Olav Solgaard",
      "Jelena Vučković"
    ],
    "published": "2025-08-18T17:19:12Z",
    "updated": "2025-09-09T20:08:32Z",
    "categories": [
      "quant-ph",
      "physics.acc-ph",
      "physics.optics"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2509.08106v1",
    "url": "https://arxiv.org/abs/2509.08106v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08106v1.pdf",
    "title": "Proton-Acoustic Wave Effects on the Relaxation of Proton Transverse   Heating in Magnetized Plasmas",
    "abstract": "Transverse electromagnetic and electrostatic plasma wave modes propagating along a background magnetic field $\\vec{B}_0$ are independent according to linear kinetic theory. However, resonant interactions and energy exchange between waves and particles break this linear decoupling. This work tracks the coupled evolution of Alfv\\'en-cyclotron (ACWs) and Ion-acoustic waves (IAWs) by solving moment-based quasilinear equations for a collisionless plasma of bi-Maxwellian protons and Maxwellian electrons. Unlike earlier quasilinear studies that adopt the cold-electron limit, our formulation retains the full kinetic response of both species, treating the electrons as a thermal reservoir to isolate proton heating. A parameter survey over $0.01\\leq\\beta_{\\parallel p}\\leq10$ and $1\\le T_e/T_p\\le10$ shows that an ambient spectrum of ACWs can drive significant perpendicular proton heating and raise the temperature anisotropy from initially isotropic conditions at low $\\beta_{\\parallel p}\\lesssim0.1$, thereby triggering cyclotron instabilities. The quasilinear evolution self-regulates the ACW, driving the system toward a quasi-stationary state with $\\gamma/\\Omega_p<10^{-1}$ and reduced anisotropy. As $T_e/T_p$ increases, IAWs become less damped and absorb a larger share of the fluctuation energy through Landau resonance, reducing the efficiency of ACW-driven proton heating and thus regulating the instability. For sufficiently large $\\beta_{\\parallel p}$ or $T_e/T_p\\gtrsim5$, ACWs become inefficient drivers of perpendicular heating, leaving IAWs as the dominant dissipation channel. These results explain how modest electrostatic activity in low-$\\beta$ environments such as the inner heliosphere and planetary magnetosheaths can regulate, but not indefinitely sustain, cyclotron instabilities.",
    "authors": [
      "Martín A. Quijada",
      "Pablo S. Moya",
      "Roberto E. Navarro"
    ],
    "published": "2025-09-09T19:32:51Z",
    "updated": "2025-09-09T19:32:51Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.08098v1",
    "url": "https://arxiv.org/abs/2509.08098v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08098v1.pdf",
    "title": "Geometrical optics in phase space",
    "abstract": "Geometrical optics (GO) is widely used for reduced modeling of waves in plasmas but fails near reflection points, where it predicts a spurious singularity of the wave amplitude. We show how to avoid this singularity by adopting a different representation of the wave equation. Instead of the physical space $x$ and the wavevector $k$, we use the ray time $\\tau$ as the new canonical coordinate and the ray energy $h$ as the associated canonical momentum. To derive the envelope equation in the $\\tau$-representation, we construct the Weyl symbol calculus on the $(\\tau, h)$ space and show that the corresponding Weyl symbols are related to their $(x, k)$ counterparts by the Airy transform. This allows us to express the coefficients in the envelope equation through the known properties of the original dispersion operator. When necessary, solutions of this equation can be mapped to the $x$-space using a generalised metaplectic transform. But the field per se might not even be needed in practice. Instead, knowing the corresponding Wigner function usually suffices for linear and quasilinear calculations. As a Weyl symbol itself, the Wigner function can be mapped analytically, using the aforementioned Airy transform. We show that the standard Airy patterns that form in regions where conventional GO fails are successfully reproduced within MGO simply by remapping the field from the $\\tau$-space to the $x$-space. An extension to mode-converting waves is also presented. This formulation, which we call generalised metaplectic GO (MGO) offers a promising tool, for example, for reduced modeling of the O--X conversion in inhomogeneous plasma near the critical density, an effect that is important for fusion applications and also occurs in the ionosphere. Aside from better handling reflection, MGO is similar to GO and can replace it for any practical purposes.",
    "authors": [
      "I. Y. Dodin",
      "N. A. Lopez",
      "Tingjing Xing",
      "Rune Højlund Marholt",
      "Valerian H. Hall-Chen"
    ],
    "published": "2025-09-09T19:15:56Z",
    "updated": "2025-09-09T19:15:56Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.08081v1",
    "url": "https://arxiv.org/abs/2509.08081v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08081v1.pdf",
    "title": "Particle-In-Cell Informed Kinetic Modeling of Nonlinear Skin Effects in   Low-Frequency Inductively Coupled Plasmas",
    "abstract": "We perform extensive 2D Particle-In-Cell (PIC) electromagnetic simulations of low pressure Inductively Coupled Plasma (ICP) discharges with various coil current and driving frequencies. Our simulations show that in low-frequency cases, electrons in the skin region near the coil can be predominantly magnetized by the Radio Frequency (RF) magnetic field. More specifically, the electrons are trapped in the combined potential well formed by the vector and electrostatic potentials, where they oscillate for most of the RF period while drifting perpendicular to the RF magnetic field. When the magnetic field weakens, electrons shortly demagnetize, leading to jet-like currents and periodic bursts of energy deposition. Based on the newly discovered electron trajectories, we develop a new kinetic theory for the plasma skin effect in low-frequency Inductively Coupled Plasma (ICP) discharges, incorporating nonlinear electron motion in an RF magnetic field by integrating Vlasov equation along the unperturbed particle trajectory. This theory successfully predicts the time evolution of electron currents in low-frequency ICP plasmas, as well as a nonlinear relation between electron current and the RF inductive electric field in the new regime we found. Furthermore, by coupling this new kinetic theory with a global model, we provide a straightforward method for estimating equilibrium electron temperature, plasma density and electron current. These analytical predictions match well with our 2D PIC simulations and can be validated through future experimental studies.",
    "authors": [
      "Haomin Sun",
      "Jian Chen",
      "Alexander Khrabrov",
      "Igor D. Kaganovich",
      "Wei Yang",
      "Dmytro Sydorenko",
      "Stephan Brunner"
    ],
    "published": "2025-09-09T18:37:47Z",
    "updated": "2025-09-09T18:37:47Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.08063v1",
    "url": "https://arxiv.org/abs/2509.08063v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08063v1.pdf",
    "title": "Modeling Low-Temperature Plasmas Simulating Titan's Atmosphere",
    "abstract": "In the study presented here, we model the gas phase chemistry induced by plasma discharge at low temperature (150 K) in the NASA Ames COSmIC Simulation Chamber (COSmIC) using a 1-dimensional multi-fluid plasma model named CO-PRISM (COSmIC Plasma Reactivity and Ionization Simulation Model). Our model incorporates an extensive chemical reaction network to simulate the neutral-neutral and ion-neutral reactions occurring in the COSmIC experiments when using N2-CH4-based gas mixtures relevant to Titan's atmosphere. Our reaction network now includes crucial reactions involving the first electronically-excited state of atomic nitrogen, recent electron collision cross-sections, and radical chemistry. In particular, we have investigated the influence of C2H2 on the gas phase polymeric growth and the elemental composition of the chemical products, and we have compared our findings to recently published solid phase analyses. The modeling results are consistent with experimental measurements of N2-CH4-C2H2 plasmas on COSmIC, showing the production of C6Hx intermediates and precursors of larger organics, as well as methanimine in small concentration. Our numerical results point to cationic pathways enabling efficient intermediate-sized and nitrogen-rich \\ce{C2H2}-driven chemistry driving tholin production. Comparison of the modeled gas phase elemental composition with elemental composition of the solid phase samples produced in COSmIC reveal similar trends, with C/N increasing when C2H2 is present in the gas mixture. Finally, our results demonstrate the importance of such synergistic studies using low-temperature plasma chemistry experiments combined with modeling efforts to improve our understanding of cold planetary environments.",
    "authors": [
      "David Dubois",
      "Alexander W. Raymond",
      "Ella Sciamma-O'Brien",
      "Farid Salama"
    ],
    "published": "2025-09-09T18:04:17Z",
    "updated": "2025-09-09T18:04:17Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.EP",
      "astro-ph.IM"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.08061v1",
    "url": "https://arxiv.org/abs/2509.08061v1",
    "pdf_url": "https://arxiv.org/pdf/2509.08061v1.pdf",
    "title": "Acceleration of Heavy Ions at Non-Relativistic Collisionless Shocks",
    "abstract": "We investigate the process of Diffusive Shock Acceleration (DSA) of particles with mass number to charge number ratios $A/Q > 1$, e.g., partially-ionized heavy ions. To this end, we introduce helium- and carbon-like ions at solar abundances into two-dimensional hybrid (kinetic ions--fluid electrons) simulations of non-relativistic collisionless shocks. This study yields three main results: 1) Heavy ions are preferentially accelerated compared to hydrogen. For typical solar abundances, the energy transferred to accelerated helium ions is comparable to, or even exceeds, that of hydrogen, thereby enhancing the overall shock acceleration efficiency. 2) Accelerated helium ions contribute to magnetic field amplification, which increases the maximum attainable particle energy and steepen the spectra of accelerated particles. 3) The efficient acceleration of helium significantly enhances the production of hadronic gamma rays and neutrinos, likely dominating the one due to hydrogen. These effects should be taken into account, especially when modeling strong space and astrophysical shocks.",
    "authors": [
      "Damiano Caprioli",
      "Luca Orusa",
      "Miha Cernetic",
      "Colby C. Haggerty",
      "Bricker Ostler"
    ],
    "published": "2025-09-09T18:02:22Z",
    "updated": "2025-09-09T18:02:22Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2409.06389v2",
    "url": "https://arxiv.org/abs/2409.06389v2",
    "pdf_url": "https://arxiv.org/pdf/2409.06389v2.pdf",
    "title": "Contemporaneous Appearances of Auroral Spiral and Transpolar Arc: Polar   UVI Observations and Global MHD Simulations",
    "abstract": "A local vortex-structured aurora and a large-scale transpolar arc (TPA) were contemporaneously observed by the Polar ultraviolet imager (UVI) when a substorm almost recovered, and the associated interplanetary magnetic field (IMF)BY and BZ polarities were negative and negative-to-positive. The TPA grew along the dawnside auroral oval from the nightside to the dayside, and an auroral spiral and several spots were located azimuthally near the poleward edge of the nightside auroral oval. Both auroras had tailward elongated source regions with scales of ~30 RE (spiral) and more than ~45 RE (TPA). To examine their magnetospheric and ionospheric field-aligned current (FAC) profiles, we performed global magnetohydrodynamic (MHD) simulations, using two different types of code: Block-Adaptive-Tree Solar-wind Roe Upwind Scheme (BATS-R-US) and improved REProduce Plasma Universe (REPPU). Both MHD simulations reproduced the tailward elongated TPA-associated FAC structures. The spiral-associated FAC intensity was, however, approximately three orders of magnitude weaker than the TPA-associated FAC intensity. Only improved REPPU simulation replicated faint but continuous poleward extending streak-like structures without evident FACs, instead of the auroral spiral. Geomagnetic field measurements showed that the spiral had upward (from the ionosphere to the magnetosphere) FACs, and its appearance might be accompanied by ultra-low-frequency Pc5 waves. Our results suggest that 1) a local-scale spiral might be formed with much weaker magnetotail FACs than global-scale TPA-associated FACs, although the spiral source region is elongated tailward, and 2) a solar wind-magnetosphere-ionosphere coupling system with minimal or no significant substorm effects is required to form the spiral with the weak magnetotail FACs.",
    "authors": [
      "Motoharu Nowada",
      "Yukinaga Miyashita",
      "Aoi Nakamizo",
      "Noora Partamies",
      "Quan-Qi Shi"
    ],
    "published": "2024-09-10T10:11:14Z",
    "updated": "2025-09-09T17:48:57Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2509.07927v1",
    "url": "https://arxiv.org/abs/2509.07927v1",
    "pdf_url": "https://arxiv.org/pdf/2509.07927v1.pdf",
    "title": "Unifying Kappa Distribution Models for Non-Equilibrium Space Plasmas: A   Superstatistical Approach Based on Moments",
    "abstract": "From the perspective of non-equilibrium statistical mechanics, modeling the velocity distribution of particles in non-equilibrium, steady-state plasmas presents a significant challenge. Under this context, a family of kappa distributions has been widely used to capture the high-energy tails in space plasmas. These distributions deviate from the canonical Maxwell-Boltzmann statistics and vary significantly in their interpretation of the temperature of an out-of-equilibrium system. In this letter, we establish the validity of any kappa distribution from the standpoint of superstatistics. This study unifies these models by introducing a new kappa distribution based on superstatistical parameters, providing a more general and fundamental framework to connect these distributions and the superstatistical temperature of a system. We demonstrate that the general distribution depends on the thermal characteristics of the modeled temperature distribution population. Furthermore, we present a moment-based velocity distribution that bypasses the traditional temperature debate, relying on the velocity moments. Our findings enhance the understanding of kappa distributions and offer a robust model for non-equilibrium space plasmas.",
    "authors": [
      "Abiam Tamburrini",
      "Sergio Davis",
      "Pablo S. Moya"
    ],
    "published": "2025-09-09T17:12:43Z",
    "updated": "2025-09-09T17:12:43Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.07910v1",
    "url": "https://arxiv.org/abs/2509.07910v1",
    "pdf_url": "https://arxiv.org/pdf/2509.07910v1.pdf",
    "title": "PWFA linear collider improvements -- from previous concepts to HALHF",
    "abstract": "This note summarizes the major design changes from the plasma wakefield linear collider concept presented at Snowmass 2013 to the most recent HALHF 2.0 baseline.",
    "authors": [
      "Erik Adli",
      "Carl A. Lindstrøm"
    ],
    "published": "2025-09-09T16:53:53Z",
    "updated": "2025-09-09T16:53:53Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.07880v1",
    "url": "https://arxiv.org/abs/2509.07880v1",
    "pdf_url": "https://arxiv.org/pdf/2509.07880v1.pdf",
    "title": "Measurement of ion acceleration and diffusion in a laser-driven   magnetized plasma",
    "abstract": "Here we present results from an experiment performed at the GSI Helmholtz Centre for Heavy Ion Research. A mono-energetic beam of chromium ions with initial energies of $\\sim 450$ MeV was fired through a magnetized interaction region formed by the collision of two counter-propagating laser-ablated plasma jets. While laser interferometry revealed the absence of strong fluid-scale turbulence, acceleration and diffusion of the beam ions was driven by wave-particle interactions. A possible mechanism is particle acceleration by electrostatic, short scale length kinetic turbulence, such as the lower-hybrid drift instability.",
    "authors": [
      "J. T. Y. Chu",
      "J. W. D. Halliday",
      "C. Heaton",
      "K. Moczulski",
      "A. Blazevic",
      "D. Schumacher",
      "M. Metternich",
      "H. Nazary",
      "C. D. Arrowsmith",
      "A. R. Bell",
      "K. A. Beyer",
      "A. F. A. Bott",
      "T. Campbell",
      "E. Hansen",
      "D. Q. Lamb",
      "F. Miniati",
      "P. Neumayer",
      "C. A. J. Palmer",
      "B. Reville",
      "A. Reyes",
      "S. Sarkar",
      "A. Scopatz",
      "C. Spindloe",
      "C. B. Stuart",
      "H. Wen",
      "P. Tzeferacos",
      "R. Bingham",
      "G. Gregori"
    ],
    "published": "2025-09-09T16:00:07Z",
    "updated": "2025-09-09T16:00:07Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2412.14311v2",
    "url": "https://arxiv.org/abs/2412.14311v2",
    "pdf_url": "https://arxiv.org/pdf/2412.14311v2.pdf",
    "title": "Performance envelope of laser wakefield accelerators",
    "abstract": "Laser wakefield accelerator experiments have made enormous progress over the past $\\sim 20$ years, but their promise to revolutionize high-energy particle sources is only beginning to be realized. To make the next step toward engineering LWFAs for different accelerator outcomes, we need more reliable and quantitative models to predict performance. Using the data from $>50$ published experiments, we estimate scalings and the performance envelope. We compare the observed scalings with several models in the literature. We find that the total beam energy (centroid energy times beam charge) scales almost linearly with laser energy, supporting the value of investment in progressively higher energy driver lasers. The dataset includes pulse durations from 8 to 160 fs, but only laser wavelengths of 800 nm and 1 \\si{\\micro\\meter}, meaning we could not check proposed wavelength scalings for alternative laser technologies. As a benchmark next-generation case, the observed scalings suggest that achieving a 100-GeV LWFA stage will require a $\\gtrsim 30$ PW laser operating at electron density $<10^{17}/$cm$^3$.",
    "authors": [
      "Lance Labun",
      "Miguel Gracia-Linares",
      "Ou Z. Labun",
      "Stephen V. Milton"
    ],
    "published": "2024-12-18T20:24:03Z",
    "updated": "2025-09-09T15:53:19Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.1016/j.nima.2025.170468"
  },
  {
    "arxiv_id": "2507.11801v2",
    "url": "https://arxiv.org/abs/2507.11801v2",
    "pdf_url": "https://arxiv.org/pdf/2507.11801v2.pdf",
    "title": "Subspace Approximation to the Focused Transport Equation. II. The   Modified Form",
    "abstract": "The transport of energetic particles in a spatially varying magnetic field is described by the focused transport equation. In the past two versions of this equation were investigated. The more commonly used standard form described a pitch-angle isotropization process but does not conserve the norm. In the current paper we consider the focused transport equation in conservative form also called modified focused transport equation. This equation conserves the norm but does not describe pitch-angle isotropization. We use the previously developed subspace method to solve the focused transport equation analytically and numerically. For a pure analytical treatment we employ the two-dimensional subspace approximation. Furthermore, we consider a higher dimensionality for which one needs to evaluate occurring matrix exponentials numerically. This type of semi-numerical approach is much faster than traditional solvers and, therefore, it is very useful.",
    "authors": [
      "B. Klippenstein",
      "A. Shalchi"
    ],
    "published": "2025-07-15T23:49:51Z",
    "updated": "2025-09-09T15:23:56Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR",
    "doi": "10.33232/001c.144238"
  }
]