{
  "arxiv_id": "2508.06462v1",
  "url": "https://arxiv.org/abs/2508.06462v1",
  "pdf_url": "https://arxiv.org/pdf/2508.06462v1.pdf",
  "title": "Characterization and automated optimization of laser-driven proton beams   from converging liquid sheet jet targets",
  "abstract": "Compact, stable, and versatile laser-driven ion sources hold great promise for applications ranging from medicine to materials science and fundamental physics. While single-shot sources have demonstrated favorable beam properties, including the peak fluxes necessary for several applications, high repetition rate operation will be necessary to generate and sustain the high average flux needed for many of the most exciting applications of laser-driven ion sources. Further, to navigate through the high-dimensional space of laser and target parameters towards experimental optima, it is essential to develop ion acceleration platforms compatible with machine learning learning techniques and capable of autonomous real-time optimization. Here we present a multi-Hz ion acceleration platform employing a liquid sheet jet target. We characterize the laser-plasma interaction and the laser-driven proton beam across a variety of key parameters governing the interaction using an extensive suite of online diagnostics. We also demonstrate real-time, closed-loop optimization of the ion beam maximum energy by tuning the laser wavefront using a Bayesian optimization scheme. This approach increased the maximum proton energy by 11% compared to a manually-optimized wavefront by enhancing the energy concentration within the laser focal spot, demonstrating the potential for closed-loop optimization schemes to tune future ion accelerators for robust high repetition rate operation.",
  "authors": [
    "G. D. Glenn",
    "F. Treffert",
    "H. Ahmed",
    "S. Astbury",
    "M. Borghesi",
    "N. Bourgeois",
    "C. B. Curry",
    "S. J. D. Dann",
    "S. DiIorio",
    "N. P. Dover",
    "T. Dzelzainis",
    "O. Ettlinger",
    "M. Gauthier",
    "L. Giuffrida",
    "R. J. Gray",
    "J. S. Green",
    "G. S. Hicks",
    "C. Hyland",
    "V. Istokskaia",
    "M. King",
    "B. Loughran",
    "D. Margarone",
    "O. McCusker",
    "P. McKenna",
    "Z. Najmudin",
    "C. Parisuaña",
    "P. Parsons",
    "C. Spindloe",
    "M. J. V. Streeter",
    "D. R. Symes",
    "A. G. R. Thomas",
    "N. Xu",
    "S. H. Glenzer",
    "C. A. J. Palmer"
  ],
  "published": "2025-08-08T17:11:00Z",
  "updated": "2025-08-08T17:11:00Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}