{
  "arxiv_id": "2508.06158v1",
  "url": "https://arxiv.org/abs/2508.06158v1",
  "pdf_url": "https://arxiv.org/pdf/2508.06158v1.pdf",
  "title": "Constraining Active Galactic Nucleus Jets with Spectrum and Core Shift:   The Case of M87",
  "abstract": "We analytically model stationary and axisymmetric active galactic nucleus jets, assuming energy conservation along each magnetic flux tube. Using very-long-baseline interferometry (VLBI) observations and published general relativistic magnetohydrodynamic simulations, we constrain the evolution of the bulk Lorentz factor, the magnetization parameter, and the magnetic field strength along the jet. We then infer the electron density, emission coefficient, and absorption coefficient at each point, and integrate the radiative transfer equation to compute the spectral energy distribution (SED) and the core shift of the synchrotron emission from the relativistic jet. Applying the method to the M87 jet, we find that the hot plasmas are injected at the altitude of seven Schwarzschild radii from the black hole (BH), that the M87 jet is likely composed of a pair plasma, and that the jet flowline geometry is quasi-parabolic as reported at much greater distances. Fitting the nonthermal fraction of the leptonic jet as a function of position, we also find that most of the radio photons are emitted within 1000 Schwarzschild radii from the BH. Although hadronic jets do not reproduce all the VLBI observations consistently in our model, we also discuss that their heavy mass allows a stronger magnetic field within the observational constraints, leading to an inverted SED in sub-millimeter wavelengths by the thermal emission from the jet base. It is therefore implied that contemporaneous observations of the M87 jet with Atacama Large Millimeter/submillimeter Array (ALMA) and VLBI could discriminate the jet composition and its collimation within the central 100 Schwarzschild radii.",
  "authors": [
    "Kouichi Hirotani",
    "Hsien Shang",
    "Ruben Krasnopolsky",
    "Satoki Matsushita",
    "Britton Jeter",
    "Keiichi Asada"
  ],
  "published": "2025-08-08T09:27:49Z",
  "updated": "2025-08-08T09:27:49Z",
  "categories": [
    "astro-ph.HE",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.HE"
}