{
  "arxiv_id": "2508.05943v1",
  "url": "https://arxiv.org/abs/2508.05943v1",
  "pdf_url": "https://arxiv.org/pdf/2508.05943v1.pdf",
  "title": "Spatiotemporal shaping of broadband helical light pulses at relativistic   intensities",
  "abstract": "Spatiotemporal control of laser pulses at relativistic intensities is a longstanding goal with broad implications in laser-plasma acceleration, high-brightness radiation sources, and extreme-field science. Laser pulses with helical spatiotemporal intensity profiles, often referred to as light springs, carry multiple spectral and orbital angular momentum (OAM) modes, producing a rotating intensity profile capable of coupling directly to helical plasma waves. Until now, light springs have only been realized on low-power systems, limited by optical damage thresholds and large-aperture beamline constraints. Here, we report the first experimental realization of light springs at relativistic intensities, achieving peak intensities above $1.4\\times10^{18}$ W/cm$^{2}$. Our approach spectrally splits a high-power laser pulse, imprints distinct helical phases on each component, and coherently recombines them. Hyperspectral imaging, off-axis holography, and spectral phase reconstruction confirm excellent agreement with theory and reveal the potential to drive superluminal rotational velocities. Introducing spectral chirp demonstrates further control of the temporal evolution of the transverse mode structure. This platform opens new regimes of ultra-intense laser-plasma interaction where laser OAM can directly couple to plasma OAM.",
  "authors": [
    "Andrew Longman",
    "Danny Attiyah",
    "Elizabeth Grace",
    "Christopher Gardner",
    "Tayyab Suratwala",
    "Gary Tham",
    "Colin Harthcock",
    "Robert Fedosejevs",
    "Franklin Dollar"
  ],
  "published": "2025-08-08T02:10:35Z",
  "updated": "2025-08-08T02:10:35Z",
  "categories": [
    "physics.optics",
    "physics.plasm-ph"
  ],
  "primary_category": "physics.optics"
}