{
  "arxiv_id": "2508.06100v1",
  "url": "https://arxiv.org/abs/2508.06100v1",
  "pdf_url": "https://arxiv.org/pdf/2508.06100v1.pdf",
  "title": "Development and performance test of p-type Silicon pad array detector",
  "abstract": "This article reports on the development and comprehensive evaluation of p-type silicon detector arrays fabricated at the Semi-Conductor Laboratory (SCL), Mohali, India. The detectors consist of an 8~$\\times$~9 array of 1~$\\times$~1~cm$^2$ pads fabricated on 6-inch wafers and read out using the High Granularity Calorimeter Readout Chip (HGCROC). Electrical characterization of the detector through current vs. voltage (IV) and capacitance vs. voltage (CV) measurements demonstrated consistent breakdown and full depletion voltages across all pads, in agreement with Technology Computer-Aided Design (TCAD) device simulations. Laboratory measurements with a $^{90}$Sr source and beam tests at PS, CERN with 10 GeV pions, showed a clear Minimum Ionizing Particle (MIP) signal, well separated from the pedestal and uniform response of the pads with an average signal-to-noise (S/N) ratio above 5.5. The measured shower profiles with 2-4 GeV positron beams for various thicknesses of a tungsten absorber placed in front of the detector are found to be in agreement with the corresponding Geant4 simulations. The performance test results for the detector show that it is a promising candidate for the future ALICE upgrade detector named Forward Calorimeter (FoCal). The FoCal will have alternating layers of low and high-granularity silicon pad detectors with absorbers as a part of the electromagnetic segment, and along with its hadronic segment, will study the direct photons, neutral hadrons, vector mesons, and jets production in the low Bjorken-x region.",
  "authors": [
    "Sawan",
    "G. Tambave",
    "S. Das",
    "A. Chaudhry",
    "R. Gupta",
    "V. K. S. Kashyap",
    "B. Mohanty",
    "M. M. Mondal",
    "S. Mathur",
    "A. Puri",
    "K. P. Sharma",
    "R. Sharma",
    "R. Singh"
  ],
  "published": "2025-08-08T07:58:44Z",
  "updated": "2025-08-08T07:58:44Z",
  "categories": [
    "physics.ins-det",
    "hep-ex",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det"
}