[
  {
    "arxiv_id": "2508.09086v2",
    "url": "https://arxiv.org/abs/2508.09086v2",
    "pdf_url": "https://arxiv.org/pdf/2508.09086v2.pdf",
    "title": "Direct Measurement of Electron Heating in Electron-Only Reconnection in   a Laboratory Mini-Magnetosphere",
    "abstract": "We report on the experimental observation of electron heating in electron-only magnetic reconnection in laser-driven laboratory mini-magnetospheres on the Large Plasma Device (LAPD) at the University of California, Los Angeles. In this experiment, a fast-flowing plasma impacts a pulsed magnetic dipole embedded within LAPD's magnetized ambient plasma, creating an ion-scale magnetosphere and driving electron-only magnetic reconnection between the background and dipole field lines. The electron velocity distribution is measured across the reconnection region using non-collective Thomson scattering, enabling determination of electron temperature and density. Significant electron heating is observed in the electron diffusion region, increasing from an initial temperature of 1.8 eV to 9.5 eV, corresponding to a 40\\% conversion of Poynting flux into electron enthalpy flux. Particle-in-cell simulations that provide insights into the heating mechanisms are also presented.",
    "authors": [
      "Lucas Rovige",
      "Filipe D. Cruz",
      "Timothy Van Hoomisen",
      "Robert S. Dorst",
      "Carmen G. Constantin",
      "Stephen Vincena",
      "Luis O. Silva",
      "Christoph Niemann",
      "Derek B. Schaeffer"
    ],
    "published": "2025-08-12T17:07:43Z",
    "updated": "2025-08-13T16:14:51Z",
    "categories": [
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.18687v3",
    "url": "https://arxiv.org/abs/2506.18687v3",
    "pdf_url": "https://arxiv.org/pdf/2506.18687v3.pdf",
    "title": "External charged debris in a flowing plasma : charge fluctuation induced   complexity",
    "abstract": "In this work, we investigate the response of a flowing e-i plasma to embedded external charged debris, focusing on the periodic debris charge fluctuations that can trigger complex phenomena such as chaos and nonlinear Landau damping. We employ both kinetic and fluid simulations to analyse the plasma response to the time-dependent debris charge. Our findings indicate that the nature of the nonlinear response can be considerably different for fluctuating positively charged external debris from negatively charged debris. The simulations show that the debris charge fluctuation causes damping of the ion-acoustic wave as the debris velocity nears the ion-acoustic speed through nonlinear Landau damping and wave-wave interactions. We also present a theoretical framework to support the simulation findings. Our findings provide critical insights into debris-plasma interactions, which may be useful in applications involving space debris management.",
    "authors": [
      "Bikramjit Joardar",
      "Hitendra Sarkar",
      "Madhurjya P. Bora"
    ],
    "published": "2025-06-23T14:27:52Z",
    "updated": "2025-08-12T16:48:21Z",
    "categories": [
      "physics.plasm-ph",
      "nlin.CD",
      "nlin.PS"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.09067v1",
    "url": "https://arxiv.org/abs/2508.09067v1",
    "pdf_url": "https://arxiv.org/pdf/2508.09067v1.pdf",
    "title": "Characteristics of monotonic sheaths near a wall with grazing magnetic   incidence",
    "abstract": "We consider a magnetised plasma in contact with an absorbing planar wall, where the angle $\\alpha$ between the magnetic field and the wall is small, $\\alpha \\ll 1$ (in radians) and the system is symmetric tangential to the wall. The finite ratio $\\gamma$ of the characteristic electron gyroradius $\\rho_{\\rm e}$ to the Debye length $\\lambda_{\\rm D}$, $\\gamma = \\rho_{\\rm e} / \\lambda_{\\rm D}$, is retained via a grazing-incidence ($\\alpha \\ll 1$) gyrokinetic treatment [1,2]. Building on a previously developed iterative scheme [2,3] to solve for the steady-state electrostatic potential in the quasineutral magnetic presheath of width $\\sim \\rho_{\\rm S}$, we developed a scheme that simultaneously solves for both the presheath and the non-neutral Debye sheath of width $\\sim \\lambda_{\\rm D}$ in the limit $\\lambda_{\\rm D} / \\rho_{\\rm S} \\rightarrow 0$. The code, called GYRAZE, thus provides the energy-angle distribution of ions at the wall and the velocity distributions of electrons reflected by the wall for different values of wall potential. A monotonic electrostatic potential profile, assumed in this work, can only exist for magnetic field angles larger than a critical value [3]. While the critical angle is shown here to significantly increase with $\\gamma$, it is still typically smaller than the magnetic field angle at divertor targets of a fusion device.",
    "authors": [
      "Alessandro Geraldini",
      "Robert J. Ewart",
      "Stephan Brunner",
      "Felix I. Parra"
    ],
    "published": "2025-08-12T16:36:53Z",
    "updated": "2025-08-12T16:36:53Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2502.06550v2",
    "url": "https://arxiv.org/abs/2502.06550v2",
    "pdf_url": "https://arxiv.org/pdf/2502.06550v2.pdf",
    "title": "Developing a Linear Fluid Plasma Model with Accurate Kinetic Bernstein   Waves: A First Step",
    "abstract": "Kinetic models provide highly accurate descriptions of plasma waves but involve complex integrals that are computationally expensive to solve. To facilitate a fluid-like treatment of the system, we propose rational approximations for both the plasma dispersion function in the parallel integral and the Bessel function in the perpendicular integral, ensuring that the system remains rational with respect to all three variables: wave frequency $\\omega$, parallel wavevector $k_\\parallel$, and perpendicular wavevector $k_\\perp$. By accurately approximating the Bessel function over a wide range of Larmor radius $\\rho_{cs}$ values, from $k_\\perp\\rho_{cs} \\to 0$ to $k_\\perp\\rho_{cs} \\to \\infty$, we present an initial attempt to incorporate kinetic Bernstein waves into a fluid model. As an application, we employ this model to analyze { electromagnetic plasma} wave propagation conditions (i.e., accessibility) by solving for the complex perpendicular wavevector $k_\\perp$ using a matrix eigenvalue method with given input parameters. This work may contribute to studies of electron cyclotron resonance heating (ECRH) and ion cyclotron resonance frequency (ICRF) heating in magnetized confinement plasmas.",
    "authors": [
      "Huasheng Xie"
    ],
    "published": "2025-02-10T15:18:49Z",
    "updated": "2025-08-12T15:42:29Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1063/5.0274495"
  },
  {
    "arxiv_id": "2508.08981v1",
    "url": "https://arxiv.org/abs/2508.08981v1",
    "pdf_url": "https://arxiv.org/pdf/2508.08981v1.pdf",
    "title": "A 28nm Multiply-Accumulate ASIC Architecture for On-Chip Data   Compression in MHz Frame Rate X-ray and Electron Pixel Detectors",
    "abstract": "Modern X-ray detector systems urgently require compact, efficient, and fast data compression schemes to handle the transmission of big data from pixel arrays, enabling frame rates in the MHz regime. In this work, a data compression ASIC that implements a streaming fixed-length lossy compression scheme is introduced and analyzed, proving the feasibility and benefits of on-chip compression. The compression scheme utilizes a vector matrix product logic, which performs a number of floating-point multiplications, additions, and accumulations. The logic is verified, synthesized, and shown to fit in the area resource available for the X-ray detector under study, which comprises 192 x 168 pixels each of 12-bit width, and having a total area of 20 mm x 20 mm, about 2 mm x 20 mm of which are available for the digital logic. Several system architectures, precisions, and compression ratios ranging from 100 to 250 were analyzed to pave the way for on-chip fixed-length compression (e.g., principal component analysis, singular value decomposition) and data reduction (e.g., azimuthal integration) for X-ray and electron detectors.",
    "authors": [
      "Rami Rasheedi",
      "Nicholas Contini",
      "Mohamed Adel Gharib",
      "Sebastian Strempfer",
      "Senthil Gnanasekaran",
      "Salma Abdelzaher",
      "Tejas Guruswamy",
      "Kazutomo Yoshii",
      "Mike Hammer",
      "Henry Shi",
      "Yu-Sheng Chen",
      "Lorenzo Rota",
      "Dionisio Doering",
      "Angelo Dragone",
      "Tao Zhou",
      "Antonino Miceli"
    ],
    "published": "2025-08-12T14:47:43Z",
    "updated": "2025-08-12T14:47:43Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2504.16177v2",
    "url": "https://arxiv.org/abs/2504.16177v2",
    "pdf_url": "https://arxiv.org/pdf/2504.16177v2.pdf",
    "title": "Turbulent heating in collisionless low-beta plasmas: imbalance, Landau   damping, and electron-ion energy partition",
    "abstract": "An understanding of how turbulent energy is partitioned between ions and electrons in weakly collisional plasmas is crucial for modelling many astrophysical systems. Using theory and simulations of a four-dimensional reduced model of low-beta gyrokinetics (the `Kinetic Reduced Electron Heating Model'), we investigate the dependence of collisionless heating processes on plasma beta and imbalance (normalised cross-helicity). These parameters are important because they control the helicity barrier, the formation of which divides the parameter space into two distinct regimes with remarkably different properties. In the first, at lower beta and/or imbalance, the absence of a helicity barrier allows the cascade of injected power to proceed to small (perpendicular) scales, but its slow cascade rate makes it susceptible to significant electron Landau damping, in some cases leading to a marked steepening of the magnetic spectra on scales above the ion Larmor radius. In the second, at higher beta and/or imbalance, the helicity barrier halts the cascade, confining electron Landau damping to scales above the steep `transition-range' spectral break, resulting in dominant ion heating. We formulate quantitative models of these processes that compare well to simulations in each regime, and combine them with results of previous studies to construct a simple formula for the electron-ion heating ratio as a function of beta and imbalance. This model predicts a `winner takes all' picture of low-beta plasma heating, where a small change in the fluctuations' properties at large scales (the imbalance) can cause a sudden switch between electron and ion heating.",
    "authors": [
      "T. Adkins",
      "R. Meyrand",
      "J. Squire"
    ],
    "published": "2025-04-22T18:06:20Z",
    "updated": "2025-08-12T13:17:24Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.17072v2",
    "url": "https://arxiv.org/abs/2506.17072v2",
    "pdf_url": "https://arxiv.org/pdf/2506.17072v2.pdf",
    "title": "A low-cost plasma source aimed for medical applications using Ar as the   working gas",
    "abstract": "Due to advances in equipment and intense research on plasma biomedical applications over the past few years, plasma devices are now suitable for clinical use. It has been demonstrated that plasma sources can be designed in a way that ensures their safe operation and application whilst preserving the relevant clinical results. However, the manufacturing and operating costs of such plasma devices remain high, which can be decisive for their adoption in medical procedures. In this work, a simple modification of a low-cost plasma jet configuration is proposed in order to evaluate the device's viability for medical applications using argon as working gas. Typically, plasma jets operating with argon (Ar) generate high electrical currents, which makes them unsuitable for medical applications. With the proposed device modification, the treatment is no longer carried out using the plasma jet directly, but rather with the post-discharge effluent enriched with reactive oxygen and nitrogen species. As a result, the electrical current reaching the target remains below the safety threshold established for plasma applications in humans. Tests on water activation by plasma jets with and without the proposed modification indicate that both devices can yield comparable outcomes.",
    "authors": [
      "Fellype do Nascimento",
      "Bruno Henrique da Silva Leal",
      "Konstantin Georgiev Kostov"
    ],
    "published": "2025-06-20T15:21:02Z",
    "updated": "2025-08-12T12:24:41Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.08546v1",
    "url": "https://arxiv.org/abs/2508.08546v1",
    "pdf_url": "https://arxiv.org/pdf/2508.08546v1.pdf",
    "title": "Fluorescence time profile measurement of LAB based liquid scintillator   in response to medium relativistic ion particles",
    "abstract": "Liquid scintillator is widely used in particle physics experiments due to its high light yield, good timing resolution, scalability and low cost. Certain liquid scintillators exhibit pulse shape discrimination capabilities because of difference in fluorescence timing properties induced by different particles. Its fluoresence timing properties have been measured mostly for radioactive decay sources at MeV energies. We present a novel measurement of fluorescence time properties of LAB based liquid scintillator in response to high-energy ions of hydrogen (Z = 1), helium (Z = 2) and Krypton at around 200-300 MeV/u for the first time. We compared the results to those from radioactive sources and observed a distinct $dE/dX$ dependence, regardless of the particle type. These findings are essential for physics searches such as the diffuse supernova neutrino background in large liquid scintillator detectors like JUNO, and are also critical towards understanding the underlying scintillation timing mechanism.",
    "authors": [
      "Xiaojie Luo",
      "Shuya Jin",
      "Gaosong Li",
      "Zepeng Li",
      "Fenhua Lu",
      "Yazhou Sun",
      "Shitao Wang",
      "Yaoguang Wang",
      "Yifang Wang",
      "Xiaobao Wei",
      "Liangjian Wen"
    ],
    "published": "2025-08-12T01:19:10Z",
    "updated": "2025-08-12T01:19:10Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.08533v1",
    "url": "https://arxiv.org/abs/2508.08533v1",
    "pdf_url": "https://arxiv.org/pdf/2508.08533v1.pdf",
    "title": "Transition to Petschek Reconnection in Subrelativistic Pair Plasmas:   Implications for Particle Acceleration",
    "abstract": "While relativistic magnetic reconnection in pair plasmas has emerged in recent years as a candidate for the origin of radiation from extreme astrophysical environments, the corresponding subrelativistic pair plasma regime has remained less explored, leaving open the question of how relativistic physics affects reconnection. In this paper, we investigate the differences between these regimes by contrasting 2D particle-in-cell simulations of reconnection in pair plasmas with relativistic magnetization ($\\sigma \\gg 1$) and subrelativistic magnetization ($\\sigma < 1$). By utilizing unprecedentedly large domain sizes and outflow boundary conditions, we demonstrate that lowering the magnetization results in a change in the reconnection geometry from a plasmoid chain to a Petschek geometry, where laminar exhausts bounded by slow-mode shocks emanate from a single diffusion region. We attribute this change to the reduced plasmoid production rate in the low-$\\sigma$ case: when the secondary tearing rate is sufficiently low, plasmoids are too few in number to prevent the system from relaxing into a stable Petschek configuration. This geometric change also affects particle energization: we show that while high-$\\sigma$ plasmoid chains generate power-law energy spectra, low-$\\sigma$ Petschek exhausts merely heat incoming plasma and yield negligible nonthermal acceleration. These results have implications for predicting the global current sheet geometry and the resulting energy spectrum in a variety of systems.",
    "authors": [
      "Adam Robbins",
      "Anatoly Spitkovsky"
    ],
    "published": "2025-08-12T00:22:43Z",
    "updated": "2025-08-12T00:22:43Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.08530v1",
    "url": "https://arxiv.org/abs/2508.08530v1",
    "pdf_url": "https://arxiv.org/pdf/2508.08530v1.pdf",
    "title": "A High-Order Low-Order extended moment method for the Vlasov-Darwin   particle-in-cell system",
    "abstract": "In this study, we develop an extended implicit moment method, namely, a coupled high-order low-order (HOLO) method and apply it to the electromagnetic Vlasov-Darwin model. The high-order (HO) system evolves particles in a manner that conserves charge, energy, and canonical momentum, while the low-order (LO) system solves the fluid moment and Darwin equations, acting as an algorithmic convergence accelerator to the HO system. We demonstrate the HOLO method's ability to take timesteps far larger than the explicit limit, and accurately recover the system's evolution so long as its dynamical timescale is respected. Also, we find that the choice of LO fluid moment equations has a strong impact on the nonlinear convergence of the coupled particle-field system. The HOLO algorithm is benchmarked against electrostatic Landau damping and the electromagnetic electron and ion Weibel instabilities.",
    "authors": [
      "Derek A. Kuldinow",
      "William T. Taitano",
      "Kentaro Hara"
    ],
    "published": "2025-08-11T23:59:02Z",
    "updated": "2025-08-11T23:59:02Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2503.13997v2",
    "url": "https://arxiv.org/abs/2503.13997v2",
    "pdf_url": "https://arxiv.org/pdf/2503.13997v2.pdf",
    "title": "Characterizing Beam Profiles in Accelerator Neutrino Experiments through   Off-Axis Neutrino Interactions",
    "abstract": "We introduce a novel approach that utilizes neutrino events from the off-axis near detector to investigate the beam profile in long-baseline neutrino experiments. Understanding the dynamics of the neutrino beam is crucial for improving the precision of neutrino oscillation measurements. We demonstrate that certain observables related to the azimuthal angle of the neutrino direction are useful for determining the average neutrino production point from experimental data, providing a valuable cross-check against Monte Carlo simulations. Additionally, these observables can help identify potential alignment issues between the detector and the decay volume. In future neutrino experiments with significantly higher statistics, these observables will become essential to ensure the accuracy and stability of the beam profile.",
    "authors": [
      "Svetlana Karpova",
      "Federico Sánchez",
      "Dana Douqa"
    ],
    "published": "2025-03-18T08:03:58Z",
    "updated": "2025-08-11T22:24:17Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2508.08361v1",
    "url": "https://arxiv.org/abs/2508.08361v1",
    "pdf_url": "https://arxiv.org/pdf/2508.08361v1.pdf",
    "title": "Universal power-law distribution functions in an electromagnetic kinetic   plasma: implications for the inverted temperature profile in the solar corona",
    "abstract": "We develop a self-consistent quasilinear theory for the relaxation of electromagnetic kinetic plasmas, and demonstrate that the mean distribution functions of both electrons and ions tend to relax to a universal $v^{-5}$ tail. Large-scale electromagnetic (EM) fields efficiently accelerate the unscreened, fast particles but not the screened, slow ones. This non-thermal tail may arise in the solar corona from EM turbulence despite collisions, allowing suprathermal particles to escape the sun's gravity (velocity filtration) and inverting the temperature $(T)$ profile with $T$ rising to $10^6$ K.",
    "authors": [
      "Uddipan Banik",
      "Amitava Bhattacharjee"
    ],
    "published": "2025-08-11T18:00:01Z",
    "updated": "2025-08-11T18:00:01Z",
    "categories": [
      "astro-ph.SR",
      "astro-ph.HE",
      "cond-mat.stat-mech",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2506.15164v2",
    "url": "https://arxiv.org/abs/2506.15164v2",
    "pdf_url": "https://arxiv.org/pdf/2506.15164v2.pdf",
    "title": "Dark Count Rate Stability of JUNO 20-inch PMTs in Mass Testing",
    "abstract": "The Jiangmen Underground Neutrino Observatory (JUNO) is an ambitious multipurpose neutrino experiment designed to determine the neutrino mass ordering, with an impressive energy resolution goal of at least 3% at 1 MeV. To achieve a photon detection coverage of approximately 75%, JUNO will utilize two types of 20-inch photomultiplier tubes (PMTs): the large PMT (LPMT) and the microchannel plate PMT (MCP-PMT). A significant concern in high-precision neutrino measurements is the dark count rate (DCR) of PMTs, which introduces noise that can adversely affect energy measurement accuracy. During the mass testing phase of the JUNO 20-inch PMTs, comprehensive measurements of the DCR were undertaken. These measurements not only captured the DCR values of individual PMTs but also examined the stability and temperature dependence of the DCR at an operating gain of (1x10^7). This paper presents a detailed characterization of the DCR of the JUNO 20-inch PMTs, investigating factors such as cooling time, temperature variations, and long-term stability using the JUNO Pan-Asia PMT testing facilities. The results reveal distinct DCR characteristics between the two types of PMTs, providing valuable insights into the nature of DCR and its implications for JUNO's scientific objectives. In addition to performance characterization, we implemented a monitoring system to track DCR stability over time. Notably, several spikes in DCR were identified, prompting a preliminary investigation into their causes. Potential factors contributing to these spikes, such as flasher events, were explored using coincidence rate analysis and complementary imaging techniques. The findings from this study are crucial for optimizing the performance of PMTs in JUNO, ultimately aiding the experiment in achieving its goals related to neutrino physics.",
    "authors": [
      "Min Li",
      "Narongkiat Rodphai",
      "Caimei Liu",
      "Zhimin Wang",
      "Zhaoyuan Peng",
      "Jun Wang",
      "Nikolay Anfimov",
      "Denis Korablev",
      "Tobias Lachenmaier",
      "Alexander G. Olshevskiy",
      "Zhonghua Qin",
      "Tobias Sterr",
      "Alexander Felix Tietzsch",
      "Rong Zhao",
      "Wei Wang",
      "Kaile Wen",
      "Bjoern Soenke Wonsak",
      "Wan Xie",
      "Meihang Xu",
      "Yu Zhang"
    ],
    "published": "2025-06-18T06:26:21Z",
    "updated": "2025-08-11T17:50:50Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.03561v2",
    "url": "https://arxiv.org/abs/2508.03561v2",
    "pdf_url": "https://arxiv.org/pdf/2508.03561v2.pdf",
    "title": "A Simple Model of Current Ramp-Up and Ramp-Down in Tokamaks",
    "abstract": "A simple model of the ramp-up and ramp-down of the toroidal current in a tokamak plasma is developed. Faraday's law of electric induction is found to limit how rapidly the current can be safety ramped up or down. It is estimated that the minimum safe ramp-up/down times for the JET, SPARC, and ITER tokamaks are 4.2, 2.0, and 14.7 seconds, respectively. The JET ramp time is in accordance with operational experience. The SPARC and ITER minimum safe ramp times are less than the ramp times in the respective designs. Hence, there is no indication that the design ramp times are infeasible, as was recently suggested in arXiv:2507.05456 (2025). The typical ratios of the inductive electric field to the Connor-Hastie field in SPARC and ITER are found to be less than those in JET. Thus, the fact that the JET tokamak was able to operate successfully without encountering runaway electron problems during current ramps suggests that the future SPARC and ITER tokamaks should also be able to avoid such problems.",
    "authors": [
      "R. Fitzpatrick"
    ],
    "published": "2025-08-05T15:28:56Z",
    "updated": "2025-08-11T16:25:16Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.08121v1",
    "url": "https://arxiv.org/abs/2508.08121v1",
    "pdf_url": "https://arxiv.org/pdf/2508.08121v1.pdf",
    "title": "Sensitivity of an Early Dark Matter Search using the Electromagnetic   Calorimeter as a Target for the Light Dark Matter eXperiment",
    "abstract": "The Light Dark Matter eXperiment (LDMX) is proposed to employ a thin tungsten target and a multi-GeV electron beam to carry out a missing momentum search for the production of dark matter candidate particles. We study the sensitivity for a complementary missing-energy-based search using the LDMX Electromagnetic Calorimeter as an active target with a focus on early running. In this context, we construct an event selection from a limited set of variables that projects sensitivity into previously-unexplored regions of light dark matter phase space -- down to an effective dark photon interaction strength $y$ of approximately $2\\times10^{-13}$ ($5\\times10^{-12}$) for a 1MeV (10MeV) dark matter candidate mass.",
    "authors": [
      "LDMX Collaboration",
      "Torsten Åkesson",
      "Elizabeth Berzin",
      "Cameron Bravo",
      "Liam Brennan",
      "Lene Kristian Bryngemark",
      "Pierfrancesco Butti",
      "Filippo Delzanno",
      "E. Craig Dukes",
      "Valentina Dutta",
      "Bertrand Echenard",
      "Ralf Ehrlich",
      "Thomas Eichlersmith",
      "Einar Elén",
      "Andrew Furmanski",
      "Victor Gomez",
      "Matt Graham",
      "Chiara Grieco",
      "Craig Group",
      "Hannah Herde",
      "Christian Herwig",
      "David G. Hitlin",
      "Tyler Horoho",
      "Joseph Incandela",
      "Nathan Jay",
      "Asahi Jige",
      "Wesley Ketchum",
      "Gordan Krnjaic",
      "Amina Li",
      "Zihan Ma",
      "Jeremiah Mans",
      "Cristina Mantilla Suarez",
      "Sanjit Masanam",
      "Phillip Masterson",
      "Steven Metallo",
      "Sophie Middleton",
      "Joseph Muse",
      "Timothy Nelson",
      "Rory O'Dwyer",
      "James Oyang",
      "Jessica Pascadlo",
      "Emrys Peets",
      "Luis Sarmiento Pico",
      "Ruth Pöttgen",
      "Philip Schuster",
      "Chris Sellgren",
      "Lauren Tompkins",
      "Natalia Toro",
      "Nhan Tran",
      "Tamas Vami",
      "Erik Wallin",
      "Yuxuan Wang",
      "Andrew Whitbeck",
      "Duncan Wilmot",
      "Xinyi Xu",
      "Danyi Zhang"
    ],
    "published": "2025-08-11T15:59:20Z",
    "updated": "2025-08-11T15:59:20Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2508.07929v1",
    "url": "https://arxiv.org/abs/2508.07929v1",
    "pdf_url": "https://arxiv.org/pdf/2508.07929v1.pdf",
    "title": "AC Magnetometry Loop Tracer Compatible with Magnetic Calorimetry for   Power Loss Analysis",
    "abstract": "Magnetic nanoparticles (MNPs) have garnered significant attention for various applications in the high-kHz-to-MHz range, although their magnetic characterization at these operational conditions has been limited. However, a number of recent studies have showcased high-frequency and high-field amplitude AC magnetometry loop tracers capable of retrieving the magnetic AC hysteresis curve and the associated magnetic properties. In this paper, we present an easily constructable loop tracer that is retrofitted into an existing AC calorimetry setup. This enables the loop tracer to function simultaneously with the AC calorimetry setup and also to be run as a high-frequency AC susceptometer. The loop tracer is shown to work in the frequency range 160-922 kHz with maximum applied fields from 18 to 46 mT depending on the frequency. An iron oxide nanoflower sample is used to test the loop tracer, showcasing high reproducibility in measured magnetic parameters as well as quantitative agreement between the different measurement methods in the setup.",
    "authors": [
      "Thomas Veile",
      "Michael Harmel",
      "Mathias Zambach",
      "Philip Holm",
      "Frederik L. Durhuus",
      "Cathrine Frandsen"
    ],
    "published": "2025-08-11T12:42:12Z",
    "updated": "2025-08-11T12:42:12Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.07846v1",
    "url": "https://arxiv.org/abs/2508.07846v1",
    "pdf_url": "https://arxiv.org/pdf/2508.07846v1.pdf",
    "title": "Introducing a Markov Chain-Based Time Calibration Procedure for   Multi-Channel Particle Detectors: Application to the SuperFGD and ToF   Detectors of the T2K Experiment",
    "abstract": "Inter-channel mis-synchronisation can be a limiting factor to the time resolution of high performance timing detectors with multiple readout channels and independent electronics units. In these systems, time calibration methods employed must be able to efficiently correct for minimal mis-synchronisation between channels and achieve the best detector performance. We present an iterative time calibration method based on Markov Chains, suitable for detector systems with multiple readout channels. Starting from correlated hit pairs alone, and without requiring an external reference time measurement, the method solves for fixed per-channel offsets, with precision limited only by the intrinsic single-channel resolution. A mathematical proof that the method is able to find the correct time offsets to be assigned to each detector channel in order to achieve inter-channel synchronisation is given, and it is shown that the number of iterations to reach convergence within the desired precision is controllable with a single parameter. Numerical studies are used to confirm unbiased recovery of true offsets. Finally, the application of the calibration method to the Super Fine-Grained Detector (SuperFGD) and the Time of Flight (TOF) detector at the upgraded T2K near detector (ND280) shows good improvement in overall timing resolution, demonstrating the effectiveness in a real-world scenario and scalability.",
    "authors": [
      "S. Abe",
      "H. Alarakia-Charles",
      "I. Alekseev",
      "C. Alt",
      "T. Arai",
      "T. Arihara",
      "S. Arimoto",
      "A. M. Artikov",
      "Y. Awataguchi",
      "N. Babu",
      "V. Baranov",
      "G. Barr",
      "D. Barrow",
      "L. Bartoszek",
      "L. Bernardi",
      "L. Berns",
      "S. Bhattacharjee",
      "A. V. Boikov",
      "A. Blanchet",
      "A. Blondel",
      "A. Bonnemaison",
      "S. Bordoni",
      "M. H. Bui",
      "T. H. Bui",
      "F. Cadoux",
      "S. Cap",
      "A. Cauchois",
      "J. Chakrani",
      "P. S. Chong",
      "A. Chvirova",
      "P. Collard",
      "M. Danilov",
      "C. Davis",
      "V. Davouloury",
      "Yu. I. Davydov",
      "A. Dergacheva",
      "C. Domangue",
      "D. Douqa",
      "T. A. Doyle",
      "O. Drapier",
      "A. Eguchi",
      "J. Elias",
      "G. Erofeev",
      "Y. Favre",
      "D. Fedorova",
      "S. Fedotov",
      "D. Ferlewicz",
      "Y. Fujii",
      "R. Fujita",
      "Y. Furui",
      "F. Gastaldi",
      "A. Gendotti",
      "A. Germer",
      "L. Giannessi",
      "C. Giganti",
      "V. Glagolev",
      "R. Guillaumat",
      "G. Ha",
      "N. C. Hastings",
      "I. Heitkamp",
      "J. Hu",
      "C. Husi",
      "A. K. Ichikawa",
      "T. H. Ishida",
      "A. Izmaylov",
      "K. Iwamoto",
      "M. Jakkapu",
      "C. Jesús-Valls",
      "J. Y. Ji",
      "P. Jonsson",
      "C. K. Jung",
      "H. Kakuno",
      "V. S. Kasturi",
      "M. Kawaue",
      "P. T. Keener",
      "M. Khabibullin",
      "N. V. Khomutov",
      "A. Khotjantsev",
      "T. Kikawa",
      "H. Kikutani",
      "N. V. Kirichkov",
      "A. Klustová",
      "H. Kobayashi",
      "T. Kobayashi",
      "L. Koch",
      "S. Kodama",
      "A. O. Kolesnikov",
      "M. Kolupanova",
      "A. Korzenev",
      "T. Koto",
      "Y. Kudenko",
      "S. Kuribayashi",
      "T. Kutter",
      "M. Lachat",
      "K. Lachner",
      "M. Lamers James",
      "D. Last",
      "N. Latham",
      "M. Lawe",
      "T. A. Le",
      "D. Leon Silverio",
      "B. Li",
      "W. Li",
      "C. Lin",
      "M. Louzir",
      "T. Lux",
      "K. K. Mahtani",
      "S. Manly",
      "D. A. Martinez Caicedo",
      "N. Mashin",
      "T. Matsubara",
      "C. Mauger",
      "K. S. McFarland",
      "C. McGrew",
      "J. McKean",
      "A. Mefodiev",
      "E. Miller",
      "O. Mineev",
      "A. Minamino",
      "A. L. Moreno",
      "A. Muñoz",
      "T. Nakadaira",
      "K. Nakagiri",
      "T. Nakaya",
      "J. Nanni",
      "L. Nicolas",
      "A. D. Nguyen",
      "D. T. Nguyen",
      "H. Nguyen",
      "V. Nguyen",
      "E. Noah Messomo",
      "T. Nosek",
      "H. M. O'Keeffe",
      "T. Ogawa",
      "W. Okinaga",
      "L. Osu",
      "V. Paolone",
      "G. Pelleriti",
      "L. Pickering",
      "M. A. Ramírez",
      "M. Reh",
      "G. Reina",
      "C. Riccio",
      "S. Roth",
      "A. Rubbia",
      "F. Saadi",
      "K. Sakashita",
      "N. Sallin",
      "S. Samani",
      "F. Sanchez",
      "T. Schefke",
      "C. Schloesser",
      "D. Sgalaberna",
      "A. Shaikovskiy",
      "A. Shvartsman",
      "Y. Shiraishi",
      "N. Shvarev",
      "N. Skrobova",
      "D. Smyczek",
      "M. Smy",
      "A. Speers",
      "D. Svirida",
      "M. Ta",
      "S. Tairafune",
      "M. Tani",
      "H. Tanigawa",
      "A. Teklu",
      "S. Tereshchenko",
      "V. V. Tereshchenko",
      "T. Thaiduc",
      "T. Tsushima",
      "M. Tzanov",
      "Y. Uchida",
      "I. I. Vasilyev",
      "E. Villa",
      "T. Vladisavljevic",
      "D. Wakabayashi",
      "H. Wallace",
      "A. Weber",
      "N. Whitney",
      "C. Wret",
      "Y. Xu",
      "Y. Yang",
      "N. Yershov",
      "A. J. P. Yrey",
      "M. Yokoyama",
      "Y. Yoshimoto",
      "X. Y. Zhao",
      "H. Zheng",
      "H. Zhong",
      "T. Zhu",
      "E. D. Zimmerman",
      "M. Zito"
    ],
    "published": "2025-08-11T11:06:37Z",
    "updated": "2025-08-11T11:06:37Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2502.17413v4",
    "url": "https://arxiv.org/abs/2502.17413v4",
    "pdf_url": "https://arxiv.org/pdf/2502.17413v4.pdf",
    "title": "Spatiotemporal optical vortex (STOV) polariton",
    "abstract": "We confirm the existence of a new bulk medium quasiparticle with transverse orbital angular momentum (tOAM) and elucidate its physical origin. The tOAM structure is driven by torques induced by the ponderomotive force of the light in the medium, originating from the magnetic Lorentz force, even for weak light fields. There are two contributions to the material tOAM: one part depends on the pulse spatial shape change as it passes through an interface, and the other part depends on dispersion. The results, from first principles particle-in-cell simulations of a simple plasma, are in excellent agreement with our theory for general dielectric media [S. W. Hancock et al., Phys. Rev. Lett. 127, 193901 (2021)]. For plasma, there is agreement up to near-critical densities and near-relativistic field strengths.",
    "authors": [
      "M. S. Le",
      "S. W. Hancock",
      "N. Tripathi",
      "H. M. Milchberg"
    ],
    "published": "2025-02-24T18:46:40Z",
    "updated": "2025-08-11T10:25:52Z",
    "categories": [
      "physics.plasm-ph",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2409.02769v2",
    "url": "https://arxiv.org/abs/2409.02769v2",
    "pdf_url": "https://arxiv.org/pdf/2409.02769v2.pdf",
    "title": "Magnetic, Kinetic, and Transition Regime: Spatially-Segregated Structure   of Compressive MHD Turbulence",
    "abstract": "Turbulence is a complex physical process prevalent in modern physics, particularly in ionized environments like interstellar gas, where magnetic fields play a dynamic role. However, the precise influence of magnetic fields in such settings remains unclear. We employ the Alfv\\'{e}n Mach number, ${M}_{\\mathrm{A}} = \\sqrt{E_{\\mathrm{k}}/E_{\\mathrm{B}}}$, to gauge the magnetic field's significance relative to turbulent motion, uncovering diverse interaction patterns. In the low-${M}_{\\mathrm{A}}$ magnetic regime, the field is force-free, yet gas motion does not align with it. At intermediate ${M}_{\\mathrm{A}}$ (magnetic-kinetic transition regime), velocity and magnetic fields show peak alignment, likely due to rapid relaxation. In the high-${M}_{\\mathrm{A}}$ kinetic regime, both fields are irregular and unaligned. These regimes find observational counterparts in interstellar gas, highlighting the multifaceted nature of MHD turbulence and aiding future astrophysical interpretations.",
    "authors": [
      "Guang-Xing Li",
      "Mengke Zhao"
    ],
    "published": "2024-09-04T14:48:42Z",
    "updated": "2025-08-11T08:45:12Z",
    "categories": [
      "astro-ph.GA",
      "astro-ph.SR",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.GA"
  },
  {
    "arxiv_id": "2507.18191v2",
    "url": "https://arxiv.org/abs/2507.18191v2",
    "pdf_url": "https://arxiv.org/pdf/2507.18191v2.pdf",
    "title": "Characterisation of the signal to noise ratio of 2-photon microscopes",
    "abstract": "Signal to noise ratio (SNR) is a key performance metric of an imaging instrument. Here we describe characterisation of SNR of a custom 2-photon microscope and compare the SNR performance of our microscope with selected commercial 2-photon microscopes. The methodology described in this paper can serve as guidance for others wishing to characterise and benchmark their 2-photon or other point-scanning microscopes.",
    "authors": [
      "Radek Macháň",
      "Shau Poh Chong",
      "Khee Leong Lee",
      "Peter Török"
    ],
    "published": "2025-07-24T08:43:25Z",
    "updated": "2025-08-11T03:09:13Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2508.07549v1",
    "url": "https://arxiv.org/abs/2508.07549v1",
    "pdf_url": "https://arxiv.org/pdf/2508.07549v1.pdf",
    "title": "Start-To-End Simulations of a Compact, Linac-Based Positron Source",
    "abstract": "Slow positrons are increasingly important to the study of material surfaces. For these kinds of studies, the positrons must have low emittance and relatively high brightness. Unfortunately, fast positron sources like radioactive capsules or linac driven sources have broad energy and angular spread, which make them difficult to capture and use. Moderators are materials that produce slow, mono-energetic positrons from a fast positron beam. Since their efficiencies are typically less than $10^{-3}$ slow $e^+$ per fast $e^+$, research into how to maximize efficiency is of great interest. Previous work has shown that using a linac, one can decelerate the fast positron beam in order to greatly increase moderation efficiency. We present here start-to-end simulations using G4beamline to model a 100 MeV electron beam incident upon a Tungsten target, focused by an adiabatic matching device, and decelerated by a 1.3 GHz, 5-cell pillbox cavity. We show that by decelerating the positrons after their creation we can increase the number of positrons under 500 keV by 15 times, translating to a 16.3 times improvement in moderation efficiency, and therefore leading to a brighter positron source.",
    "authors": [
      "Sophie Crisp",
      "Ryland Goldman",
      "Arif Ismail",
      "Spencer Gessner"
    ],
    "published": "2025-08-11T02:12:16Z",
    "updated": "2025-08-11T02:12:16Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.07525v1",
    "url": "https://arxiv.org/abs/2508.07525v1",
    "pdf_url": "https://arxiv.org/pdf/2508.07525v1.pdf",
    "title": "Experimental search for neutron-antineutron oscillation with use of   ultra-cold neutrons revisited",
    "abstract": "Neutron-antineutron oscillation (nnbar-osc) is a baryon-number-violating process and a sensitive probe for physics beyond the Standard Model. Ultra-cold neutrons (UCNs) are attractive for nnbar-osc searches because of their long storage time, but earlier analyses indicated that phase shifts on wall reflection differ for neutron and antineutron, leading to severe decoherence and loss of sensitivity. Here we revisit this problem by numerically solving the time-dependent Schroedinger equation for the two-component n/nbar wave function, explicitly including wall interactions. We show that decoherence can be strongly suppressed by selecting a wall material whose neutron and antineutron optical potentials are nearly equal. Using coherent scattering length data and estimates for antineutrons, we identify a Ni-Al alloy composition that matches the potentials within a few percent while providing a high absolute value, enabling long UCN storage. With such a bottle and an improved UCN source, the sensitivity could reach an oscilla-tion period tau_nnbar of order 10^10 s, covering most of the range predicted by certain grand-unified models. This approach revives the feasibility of high-sensitivity nnbar-osc searches using stored UCNs and offers a clear path to probe baryon-number violation far beyond existing limits.",
    "authors": [
      "Tatsushi Shima"
    ],
    "published": "2025-08-11T01:02:33Z",
    "updated": "2025-08-11T01:02:33Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2508.07500v1",
    "url": "https://arxiv.org/abs/2508.07500v1",
    "pdf_url": "https://arxiv.org/pdf/2508.07500v1.pdf",
    "title": "Ionization rate vs. laser intensity determined from ion count vs. peak   intensity due to neutral gas exposure to an 800 nm ultrashort pulsed laser",
    "abstract": "The optical cycle-averaged ionization rate of Ar, O$_{2}$, and N$_{2}$ vs. local instantaneous laser intensity $I$ for linear polarized $800$ nm light is determined up to approx. $300$ TW/cm$^{2}$ by numerically inverting published time-of-flight ion spectrometer data. The published Ar$^{+}$ collection efficiency of the microchannel plate (MCP) at the end of the spectrometer and its $I_{0}$ scale are recalibrated by fitting it to its high $I_{0}$ solution. The relative collection efficiencies of the other species are determined by published MCP cathode data. Results for O$_2$ are consistent with a reevaluation of published data used to determine its cross section $\\sigma_8$ in the multiphoton (low $I$) regime.",
    "authors": [
      "Edward L. Ruden"
    ],
    "published": "2025-08-10T22:26:18Z",
    "updated": "2025-08-10T22:26:18Z",
    "categories": [
      "physics.atom-ph",
      "physics.optics",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2508.07418v1",
    "url": "https://arxiv.org/abs/2508.07418v1",
    "pdf_url": "https://arxiv.org/pdf/2508.07418v1.pdf",
    "title": "Beam-Beam Fields with Full Six-Dimensional Coupling: Theory and   Computational Methods",
    "abstract": "This work presents a generalized theoretical framework for calculating beam-beam fields induced by a Gaussian beam with full six-dimensional coupling. We also develop computational techniques for evaluating these fields. A case study based on the Electron-Ion Collider (EIC) electron storage ring illustrates the practical application of the framework. Our results suggest that the standard slice model for the beam-beam kick can significantly underestimate the longitudinal field. The proposed theory may provide a foundation for developing improved simulation models and guiding future design studies.",
    "authors": [
      "Yi-Kai Kan",
      "Derong Xu"
    ],
    "published": "2025-08-10T16:29:21Z",
    "updated": "2025-08-10T16:29:21Z",
    "categories": [
      "physics.acc-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2506.16676v6",
    "url": "https://arxiv.org/abs/2506.16676v6",
    "pdf_url": "https://arxiv.org/pdf/2506.16676v6.pdf",
    "title": "Fast solvers for Tokamak fluid models with PETSC",
    "abstract": "This work begins the development of fast, scalable solvers for scientific and engineering-relevant magnetohydrodynamics (MHD) models of tokamaks using multigrid methods. These models are characterized by a distinguished direction following the magnetic field around the torus, which dominates the plasma dynamics. All tokamak models exploit this structure, for example, NIMROD uses 2D, unstructured, high-order finite elements in the poloidal plane with Fourier modes in the toroidal coordinate, and the 3D, extended MHD code M3D-C1 uses 2D, unstructured C1 elements in the poloidal plane with cubic Hermite functions in the toroidal direction and a regular grid that is partially aligned with the magnetic field. This structure suggests addressing the toroidal coordinate first, which NIMROD does at the formulation level, but M3D-C1 uses a full 3D discretization. The resulting algebraic system is solved at each time step in an implicit time integrator. This work addressed the toroidal coordinate in the M3D-C1 velocity solve by adding semi-coarsening multigrid to the existing PETSC - Portable, Extensible Toolkit for Scientific Computation - block Jacobi solver, with the addition of little new code. Competitive performance of this new solver configuration is demonstrated on a self-consistent runaway electron model of a SPARC4 disruption, and the next steps in the development of this solver are outlined.",
    "authors": [
      "Mark F. Adams",
      "Jin Chen",
      "Benjamin Sturdevant"
    ],
    "published": "2025-06-20T01:36:08Z",
    "updated": "2025-08-10T14:46:04Z",
    "categories": [
      "physics.plasm-ph",
      "cs.PF"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.04483v2",
    "url": "https://arxiv.org/abs/2507.04483v2",
    "pdf_url": "https://arxiv.org/pdf/2507.04483v2.pdf",
    "title": "Analytical and Numerical Studies of Dark Current in Radiofrequency   Structures for Short-Pulse High-Gradient Acceleration",
    "abstract": "High-gradient acceleration is a key research area that could enable compact linear accelerators for future colliders, light sources, and other applications. In the pursuit of high-gradient operation, RF breakdown limits the attainable accelerating gradient in normal-conducting RF structures. Recent experiments at the Argonne Wakefield Accelerator suggest a promising approach: using short RF pulses with durations of a few nanoseconds. Experimental studies show that these O(1 ns) RF pulses can mitigate breakdown limitations, resulting in higher gradients. For example, an electric field of nearly 400 MV/m was achieved in an X-band photoemission gun driven by 6-ns-long RF pulses, with rapid RF conditioning and low dark current observed. Despite these promising results, the short-pulse regime remains an under-explored parameter space, and RF breakdown physics under nanosecond-long pulses requires further investigation. In this paper, we present analytical and numerical simulations of dark current dynamics in accelerating cavities operating in the short-pulse regime. We study breakdown-associated processes spanning different time scales, including field emission, multipacting, and plasma formation, using simulations of the X-band photogun cavities. The results reveal the advantages of using short RF pulses to reduce dark current and mitigate RF breakdown, offering a path toward a new class of compact accelerators with enhanced performance and reduced susceptibility to breakdown.",
    "authors": [
      "Gaurab Rijal",
      "Michael Shapiro",
      "Xueying Lu"
    ],
    "published": "2025-07-06T17:44:35Z",
    "updated": "2025-08-10T01:37:29Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.01023v3",
    "url": "https://arxiv.org/abs/2508.01023v3",
    "pdf_url": "https://arxiv.org/pdf/2508.01023v3.pdf",
    "title": "Malter-Driven Electron Emission as a Source of Noise in LXe TPCs",
    "abstract": "Persistent single-electron emission (\"hot spots\") has been observed in multiple liquid xenon (LXe) time projection chambers (TPCs), often persisting long after ionizing events. Although typically discussed in operational terms, the behavior is consistent with Malter-type emission triggered by ion accumulation on resistive oxide surfaces. In this note, we discuss such effects and recommend material choices and design strategies to mitigate them in future detectors. This mechanism is especially relevant to experiments targeting ultra-low energy thresholds, where even small background emissions can limit sensitivity.",
    "authors": [
      "J. Va'vra"
    ],
    "published": "2025-08-01T18:48:59Z",
    "updated": "2025-08-09T18:21:13Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2503.14670v3",
    "url": "https://arxiv.org/abs/2503.14670v3",
    "pdf_url": "https://arxiv.org/pdf/2503.14670v3.pdf",
    "title": "Enhanced UV Detection in GaN-Based Photodetectors through InN/AlN   Heterostructure Integration and Doping-Engineered PIN Architecture",
    "abstract": "This study presents a comprehensive simulation-based optimization of gallium nitride (GaN)-based metal-semiconductor-metal (MSM) photodetectors designed for ultraviolet (UV) applications. The proposed device architecture incorporates a novel indium nitride/gallium nitride/aluminum nitride (InN/GaN/AlN) heterostructure integrated on a sapphire substrate, combined with refined doping strategies and interdigitated electrode geometry. By systematically analyzing the effects of mesa layer thickness, buffer layers, substrate type, and doping concentrations, we demonstrate significant enhancements in photocurrent generation, photoabsorption rate, and spectral responsivity. Notably, replacing the conventional sapphire substrate with silicon carbide (SiC) and introducing low-level p-type and n-type (p-n) doping into the GaN region enables p-i-n diode-like behavior, contributing to reduced dark current and improved UV selectivity. Building upon these structural enhancements, the final geometric optimization of the nickel/gold (Ni/Au) electrode fingers led to an approximately eight-fold increase in photocurrent compared to the initial design, representing the most significant contribution to the improvement in absorption efficiency. These findings offer an effective route for designing next-generation MSM photodetectors with improved sensitivity, noise performance, and thermal compatibility, suitable for high-performance ultraviolet detection applications.",
    "authors": [
      "M. Kilin",
      "O. Tanriverdi",
      "B. Karahan",
      "F. Yasar"
    ],
    "published": "2025-03-18T19:23:20Z",
    "updated": "2025-08-09T08:32:32Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.06761v1",
    "url": "https://arxiv.org/abs/2508.06761v1",
    "pdf_url": "https://arxiv.org/pdf/2508.06761v1.pdf",
    "title": "Polywell Revisited",
    "abstract": "The Polywell fusion concept, originally proposed by Robert W. Bussard in 1985, has been investigated for over four decades as a potential solution for achieving net fusion energy in a compact and economically viable reactor. It combines two distinct approaches: high-beta magnetic cusp confinement of electrons using polyhedral coil configurations and electrostatic ion confinement via a potential well formed by injected electron beams. While the hybrid nature of the Polywell system offers advantages in plasma stability and engineering simplicity, previous efforts have been limited by persistent challenges in achieving sufficient plasma confinement required to generate a net energy gain. In this study, we examine previous work and identify limitations of several Polywell embodiments that have historically impeded progress. We present an updated Polywell physics model incorporating experimental findings and recent first-principles particle-in-cell simulations. This updated model outlines a credible path toward overcoming confinement losses and achieving net energy gain using deuterium-tritium (D-T) fuels. Our findings provide a renewed scientific basis for the continued development of the Polywell fusion concept as a practical and scalable approach to fusion energy.",
    "authors": [
      "Jaeyoung Park",
      "Nicholas A. Krall",
      "Giovanni Lapenta",
      "Masayuki Ono"
    ],
    "published": "2025-08-09T00:23:55Z",
    "updated": "2025-08-09T00:23:55Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.06749v1",
    "url": "https://arxiv.org/abs/2508.06749v1",
    "pdf_url": "https://arxiv.org/pdf/2508.06749v1.pdf",
    "title": "Investigation of Low-Energy Particle Remnants in High-Energy Collisions   at the LHC with a Skipper-CCD detector",
    "abstract": "We deployed MOSKITA $\\sim$33 m away from the CMS collision point, the first skipper-CCD detector probing low-energy particles produced in high-energy collisions at the Large Hadron Collider (LHC). In this work, we search for beam-related events using data collected in 2024 during beam-on and beam-off periods. The dataset corresponds to integrated luminosities of 113.3 fb$^{-1}$ and 1.54 nb$^{-1}$ for the proton-proton and Pb-Pb collision periods, respectively. We report observed event rates in a model-independent framework across two ionization regions: $\\leq20e^-$ and $>20e^-$. For the low-energy region, we perform a likelihood analysis to test the null hypothesis of no beam-correlated signal. We found no significant correlation during proton-proton and Pb-Pb collisions. For the high-energy region, we present the energy spectra for both collision periods and compare event rates for images with and without luminosity. We observe a slight increase in the event rate following the Pb-Pb collisions, coinciding with a rise in the single-electron rate, which will be investigated in future work. Using the low-energy proton-proton results, we place 95% C.L. constraints on the mass-millicharge parameter space of millicharged particles. Overall, the results in this work demonstrate the viability of skipper-CCD technology to explore new physics at high-energy colliders and motivate future searches with more massive detectors.",
    "authors": [
      "Brenda A. Cervantes-Vergara",
      "Santiago E. Perez",
      "Nicola Bacchetta",
      "Nuria Castello-Mor",
      "Juan Estrada",
      "Marcos Fernandez Garcia",
      "Petra Merkel",
      "Maria Perez Martinez",
      "Dario Rodrigues",
      "Javier Tiffenberg",
      "Rocio Vilar Cortabitarte"
    ],
    "published": "2025-08-08T23:24:59Z",
    "updated": "2025-08-08T23:24:59Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2508.06733v1",
    "url": "https://arxiv.org/abs/2508.06733v1",
    "pdf_url": "https://arxiv.org/pdf/2508.06733v1.pdf",
    "title": "Laser Resonance Ionization Spectroscopy of Thorium",
    "abstract": "High-lying Rydberg and autoionizing (AI) states of thorium (Th) have been studied via resonance laser ionization spectroscopy at both TRIUMF Canada's particle accelerator centre and Oak Ridge National Lab (ORNL). Multiple Rydberg series converging to the ionization potential (IP) were observed via different stepwise laser excitation schemes and were assigned to be the $6d^27s (^4F_{3/2})$ $np$, $nd$, and $nf$ series. Analysis of these series enabled the determination of the IP to be 50868.735(54) cm$^{-1}$, which improved the precision by two orders of magnitude over the current adopted NIST value of 50867(2) cm$^{-1}$. Additionally, four AI Rydberg series were identified and assigned to $nf$ and $nd$ series converging to the $6d^27s$ $^4F_{5/2}$ and $6d^27s$ $^2D_{3/2}$ metastable states of Th$^+$. The measured energies of the Rydberg and AI Rydberg states are reported, and observed perturbations within the series are discussed.",
    "authors": [
      "Ruohong Li",
      "Yuan Liu",
      "Dan W. Stracener",
      "Jens Lassen"
    ],
    "published": "2025-08-08T22:15:49Z",
    "updated": "2025-08-08T22:15:49Z",
    "categories": [
      "physics.atom-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2502.21198v2",
    "url": "https://arxiv.org/abs/2502.21198v2",
    "pdf_url": "https://arxiv.org/pdf/2502.21198v2.pdf",
    "title": "AI-Enhanced Self-Triggering for Extensive Air Showers: Performance and   FPGA Feasibility",
    "abstract": "Autonomous self-triggering for radio detection of extensive air showers remains challenging in realistic environments dominated by strong and variable radio-frequency interference. Traditional radio-array operations rely on external particle-detector triggers, limiting sensitivity and increasing system complexity. In this work, I present a proof-of-principle study demonstrating that deep-learning-based triggering can operate in such high-noise conditions and can be implemented within the strict latency constraints of large-scale radio observatories. Using measured high-interference noise traces combined with simulated cosmic-ray pulses, a fully convolutional network classifier was trained and optimised for robust separation of signals from background at MHz-scale trigger-trial rates. The trained model was quantised with HLS4ML to fixed-point precision and synthesised using Vitis HLS for multiple FPGA targets. The quantised implementation preserves the floating-point model performance (AUC_float = 0.997, AUC_quant = 0.996) while achieving microsecond-scale inference latencies. These results show that modern FPGA-based AI inference, enabled by high-level synthesis, can provide low-latency, radio-only triggering for next-generation cosmic-ray observatories, potentially removing the need for external trigger systems and reducing array complexity.",
    "authors": [
      "Qader Dorosti"
    ],
    "published": "2025-02-28T16:15:20Z",
    "updated": "2025-08-08T18:57:06Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2508.06645v1",
    "url": "https://arxiv.org/abs/2508.06645v1",
    "pdf_url": "https://arxiv.org/pdf/2508.06645v1.pdf",
    "title": "AI-driven neutrino diagnostics and radiation-hard beam instrumentation   for next-generation neutrino experiments",
    "abstract": "The Long Baseline Neutrino Facility (LBNF) at Fermilab will deliver a high-intensity, multi-megawatt neutrino beam to the Deep Underground Neutrino Experiment (DUNE), enabling precision tests of the three-neutrino paradigm, CP violation searches, neutrino mass ordering determination, and supernova neutrino studies. In order to accelerate DUNE's physics reach and ensure robust beam operations, we propose an integrated AI-driven framework with real-time diagnostics and radiation-hardened instrumentation. A physics-informed digital twin is at the heart of this Real-Time Beam Integrity Monitor. By reconstructing pion phase space from muon profiles and exploiting magnetic horn optic linearity, it enables spill-by-spill beam correction and flux stabilization. By using this approach, flux-related systematics could be reduced from 5\\% to 1\\%, potentially accelerating the discovery of CP violations by four to six years. Complementing this, a US-Japan R\\&D effort will deploy a LGAD-based muon monitor in the NuMI beamline. Time of Flight (ToF) measurements can be acquired with picosecond precision using this radiation-hard system, enhancing sensitivity to horn chromatic effects. Simulations confirm strong responses to these effects. Machine learning models can predict beam quality and horn current with sub-percent accuracy. This scalable, AI-enabled strategy improves beam fidelity and reduces systematics, transforming high-power accelerator operations.",
    "authors": [
      "S. Ganguly"
    ],
    "published": "2025-08-08T18:46:47Z",
    "updated": "2025-08-08T18:46:47Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.06631v1",
    "url": "https://arxiv.org/abs/2508.06631v1",
    "pdf_url": "https://arxiv.org/pdf/2508.06631v1.pdf",
    "title": "Einstein Telescope: Ferromagnetic Shielding for Magnetic Noise   Mitigation",
    "abstract": "The Einstein Telescope is the next-generation gravitational wave interferometer which, compared to current detectors, will enable the observation of gravitational signals at lower frequencies with a sensitivity improved by approximately two orders of magnitude. Achieving such exceptional sensitivity requires minimizing all sources of noise. In the low-frequency regime, magnetic noise is one of the dominant. This article examines the effectiveness and limitations of a passive mitigation technique: ferromagnetic shielding.",
    "authors": [
      "Federico Armato",
      "Barbara Garaventa",
      "Andrea Chincarini"
    ],
    "published": "2025-08-08T18:29:09Z",
    "updated": "2025-08-08T18:29:09Z",
    "categories": [
      "physics.ins-det",
      "gr-qc"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2504.16190v3",
    "url": "https://arxiv.org/abs/2504.16190v3",
    "pdf_url": "https://arxiv.org/pdf/2504.16190v3.pdf",
    "title": "Simulating X-point radiator turbulence",
    "abstract": "Coupling a high-performance burning plasma core to a detached boundary solution is critical for realizing magnetic confinement fusion power. Predictive simulations of the edge and scrape-off layer are therefore essential and must self-consistently account for turbulence and the interplay between the plasma, neutral gas, and impurities. We present results on controlled full detachment in ASDEX Upgrade with an X-point radiator (XPR), obtained with the edge turbulence code GRILLIX. Assuming a fixed nitrogen concentration (in terms of the electron density) in coronal equilibrium, two simulations are discussed: they exhibit dense nitrogen radiation fronts, located 5 and 12 cm above the X-point, accounting for 80 % of the input heating power. In validations against density, temperature, and bolometry measurements, the simulations show good agreement and reproduce the detached divertor conditions observed in the experiment. Neutral gas is critical for achieving detachment and modulating the height of the XPR front, in agreement with previous SOLPS-ITER transport modeling and analytical power balance studies. In addition, the front structure is highly dynamic due to turbulence, consisting of ionizing and radiative mantles surrounding intermittent cold spots of recombining plasma. Near the detachment front, density and temperature fluctuation amplitudes exceed the background by more than 400 %, compared to 40 % in an attached reference case. The radial electric field shifts inward, poloidal symmetry of the electrostatic potential is broken (inducing strong radial flows around the XPR), and radial particle and heat transport into the low-field side scrape-off layer increases. These effects may explain the ELM suppression observed in the H-mode XPR regime.",
    "authors": [
      "K. Eder",
      "W. Zholobenko",
      "A. Stegmeir",
      "M. Bernert",
      "D. Coster",
      "F. Jenko",
      "the ASDEX Upgrade Team",
      "the EUROfusion Tokamak Exploitation Team"
    ],
    "published": "2025-04-22T18:27:11Z",
    "updated": "2025-08-08T18:21:42Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1088/1741-4326/adf901"
  },
  {
    "arxiv_id": "2508.06462v1",
    "url": "https://arxiv.org/abs/2508.06462v1",
    "pdf_url": "https://arxiv.org/pdf/2508.06462v1.pdf",
    "title": "Characterization and automated optimization of laser-driven proton beams   from converging liquid sheet jet targets",
    "abstract": "Compact, stable, and versatile laser-driven ion sources hold great promise for applications ranging from medicine to materials science and fundamental physics. While single-shot sources have demonstrated favorable beam properties, including the peak fluxes necessary for several applications, high repetition rate operation will be necessary to generate and sustain the high average flux needed for many of the most exciting applications of laser-driven ion sources. Further, to navigate through the high-dimensional space of laser and target parameters towards experimental optima, it is essential to develop ion acceleration platforms compatible with machine learning learning techniques and capable of autonomous real-time optimization. Here we present a multi-Hz ion acceleration platform employing a liquid sheet jet target. We characterize the laser-plasma interaction and the laser-driven proton beam across a variety of key parameters governing the interaction using an extensive suite of online diagnostics. We also demonstrate real-time, closed-loop optimization of the ion beam maximum energy by tuning the laser wavefront using a Bayesian optimization scheme. This approach increased the maximum proton energy by 11% compared to a manually-optimized wavefront by enhancing the energy concentration within the laser focal spot, demonstrating the potential for closed-loop optimization schemes to tune future ion accelerators for robust high repetition rate operation.",
    "authors": [
      "G. D. Glenn",
      "F. Treffert",
      "H. Ahmed",
      "S. Astbury",
      "M. Borghesi",
      "N. Bourgeois",
      "C. B. Curry",
      "S. J. D. Dann",
      "S. DiIorio",
      "N. P. Dover",
      "T. Dzelzainis",
      "O. Ettlinger",
      "M. Gauthier",
      "L. Giuffrida",
      "R. J. Gray",
      "J. S. Green",
      "G. S. Hicks",
      "C. Hyland",
      "V. Istokskaia",
      "M. King",
      "B. Loughran",
      "D. Margarone",
      "O. McCusker",
      "P. McKenna",
      "Z. Najmudin",
      "C. Parisuaña",
      "P. Parsons",
      "C. Spindloe",
      "M. J. V. Streeter",
      "D. R. Symes",
      "A. G. R. Thomas",
      "N. Xu",
      "S. H. Glenzer",
      "C. A. J. Palmer"
    ],
    "published": "2025-08-08T17:11:00Z",
    "updated": "2025-08-08T17:11:00Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.06371v1",
    "url": "https://arxiv.org/abs/2508.06371v1",
    "pdf_url": "https://arxiv.org/pdf/2508.06371v1.pdf",
    "title": "Template masks for 4D-STEM",
    "abstract": "We present a new analysis method for atomic resolution four-dimensional scanning transmission electron microscopy (4D-STEM, in which a diffraction pattern is collected at each point of a raster scan of a focused electron beam across the specimen). In 4D-STEM, each measured intensity has a dual character, forming a pixel in a diffraction pattern and, equally, forming a pixel in a STEM image. Applying a mask to the data to obtain a \"virtual\" bright field or dark field image is widely used and understood. However, there is a complementary procedure, in which an image (template) is applied to the data to obtain a mask. This mask shows the correlation between the data and the template and, when applied to atomic resolution 4D-STEM data produces an image optimised for the template. This allows, for example, imaging of specific atom columns and is a significant improvement over user-defined masks such as virtual annular bright field imaging. We demonstrate the capability of the approach, separately imaging Li and O atom columns in LiFePO4 and O, Pb and Ti across a domain wall in PbTiO3.These template masks provide a computationally straightforward and general method to probe 4D-STEM data. They are particularly effective for specimens of moderate thickness where multiple scattering produces strong and specific correlations in diffraction patterns.",
    "authors": [
      "Yining Xie",
      "Eoin Moynihan",
      "Marin Alexe",
      "Louis Piper",
      "Ana Sanchez",
      "Richard Beanland"
    ],
    "published": "2025-08-08T15:02:11Z",
    "updated": "2025-08-08T15:02:11Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.06293v1",
    "url": "https://arxiv.org/abs/2508.06293v1",
    "pdf_url": "https://arxiv.org/pdf/2508.06293v1.pdf",
    "title": "Vertex reconstruction in the TAO experiment",
    "abstract": "The Taishan Antineutrino Observatory (TAO) is a tonne-scale gadolinium-doped liquid scintillator satellite experiment of the Jiangmen Underground Neutrino Observatory (JUNO). It is designed to measure the reactor antineutrino energy spectrum with unprecedented energy resolution, better than 2% at 1 MeV. To fully achieve its designed performance, precise vertex reconstruction is crucial. This work reports two distinct vertex reconstruction methods, the charge center algorithm (CCA) and the deep learning algorithm (DLA). We describe the efforts in optimizing and improving these two methods and compare their reconstruction performance. The results show that the CCA and DLA methods can achieve vertex position resolutions better than 20mm (bias<5mm) and 12mm (bias<1.3mm) at 1 MeV, respectively, fully meeting the requirements of the TAO experiment. The reconstruction algorithms developed in this study not only prepare the TAO experiment for its upcoming real data but also hold significant potential for application in other similar experiments.",
    "authors": [
      "Hangyu Shi",
      "Jun Wang",
      "Guofu Cao",
      "Wei Wang",
      "Yuehuan Wei"
    ],
    "published": "2025-08-08T13:12:15Z",
    "updated": "2025-08-08T13:12:15Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.06282v1",
    "url": "https://arxiv.org/abs/2508.06282v1",
    "pdf_url": "https://arxiv.org/pdf/2508.06282v1.pdf",
    "title": "Studies on the effect of low-fluence proton and neutron irradiation on   n-type LGADs",
    "abstract": "The presented study investigates the effects of low fluences from $5\\times10^{12}$ up to $1\\times10^{14}$ particles/cm$^{2}$ of 60MeV proton and neutron irradiation on n-type Low Gain Avalanche Detectors (nLGADs). An nLGAD is a silicon sensor with a highly doped gain layer that enables controlled charge multiplication via impact ionization. In contrast to the well-established p-type LGADs for high-energy physics (HEP) applications, nLGADs are optimized for the detection of low-penetrating particles such as UV photons and soft X-rays. In addition to studying their potential application in environments with radiation backgrounds, these novel devices also enable the exploration of the underlying phenomenology arising from the combination of n-type bulk material with a gain layer, which degradation was previously studied predominantly in the context of p-type LGADs. The irradiation effects were characterized through measurements of the leakage current and capacitance with increasing bias voltage (I-V and C-V), revealing systematic and fluence-dependent behavior related to space charge sign inversion (SCSI) of the n-type bulk material, which especially alters the electric field in the sensor and thus the depletion behavior. Additionally, annealing studies were performed to assess both beneficial and reverse annealing regimes with isothermal and isochronal annealing. The findings are consistent with previous high-energy proton studies and contribute to a deeper understanding of the fundamental behavior of nLGADs under irradiation.",
    "authors": [
      "Veronika Kraus",
      "Marcos Fernandez Garcia",
      "Salvador Hidalgo",
      "Michael Moll",
      "Jairo Villegas"
    ],
    "published": "2025-08-08T13:03:10Z",
    "updated": "2025-08-08T13:03:10Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.06593v1",
    "url": "https://arxiv.org/abs/2508.06593v1",
    "pdf_url": "https://arxiv.org/pdf/2508.06593v1.pdf",
    "title": "Morphological Granulometric Analysis of Particle Imagery from   Microgravity Experiments",
    "abstract": "The aim of our work is to analyze size distributions of particles and their agglomerates in imagery from astrophysical microgravity experiments. The data acquired in these experiments are given by sequences consisting of several hundred images. It is desirable to establish an automated routine that helps to assess size distributions of important image structures and their dynamics in a statistical way.   The main technique we adopt to this end is the morphological granulometry. After preprocessing steps that facilitate granulometric analysis, we show how to extract useful information on size of particle agglomerates as well as underlying dynamics. At hand of the discussion of two different microgravity key experiments we demonstrate that the granulometric analysis enables to assess important experimental aspects. We conjecture that our developments are a useful basis for the quantitative assessment of microgravity particle experiments.",
    "authors": [
      "Shima Shabani",
      "Michael Breuß",
      "Marvin Kahra",
      "Jens Teiser",
      "Gretha Swantje Völke",
      "Nico Wenders"
    ],
    "published": "2025-08-08T11:51:47Z",
    "updated": "2025-08-08T11:51:47Z",
    "categories": [
      "physics.ins-det",
      "68U10, 68T30"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2405.10716v2",
    "url": "https://arxiv.org/abs/2405.10716v2",
    "pdf_url": "https://arxiv.org/pdf/2405.10716v2.pdf",
    "title": "Scanning Acoustic Microscopy for Quantifying Bubble Evolution in   Alkaline Water Electrolyzers",
    "abstract": "Improved understanding of gas/liquid transport in electrochemical gas-evolving systems is increasingly demanded for optimizing device performance. However, high-resolution measurement techniques for in-situ imaging remain limited. This work demonstrates the use of volumetric scanning acoustic microscopy (SAM) for quantifying hydrogen bubble evolution in porous nickel electrodes in a customized alkaline water electrolysis cell. By using high-frequency focused ultrasound, SAM enables volumetric imaging with high spatial resolution in the range of tens of micrometers. This allows the distribution of gas bubbles within the complex 3D architecture of porous electrodes to be resolved. Digital image processing methods are used to segment and quantify the gas content in the electrode. Thus, non-destructive SAM imaging is demonstrated to be an accessible and scalable analytical tool for the quantitative investigation of bubble evolution in operando electrochemical environments. Here, a solid foundation is established for future studies aimed at optimizing bubble dynamics and cell design under practically relevant operating conditions, ultimately contributing to higher electrolysis efficiencies.",
    "authors": [
      "Zehua Dou",
      "Hannes Rox",
      "Zyzi Ramos",
      "Robert Baumann",
      "Rachappa Ravishankar",
      "Peter Czurratis",
      "Xuegeng Yang",
      "Andrés Fabian Lasagni",
      "Kerstin Eckert",
      "Juergen Czarske",
      "David Weik"
    ],
    "published": "2024-05-17T11:58:11Z",
    "updated": "2025-08-08T11:32:43Z",
    "categories": [
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.app-ph"
  },
  {
    "arxiv_id": "2508.06158v1",
    "url": "https://arxiv.org/abs/2508.06158v1",
    "pdf_url": "https://arxiv.org/pdf/2508.06158v1.pdf",
    "title": "Constraining Active Galactic Nucleus Jets with Spectrum and Core Shift:   The Case of M87",
    "abstract": "We analytically model stationary and axisymmetric active galactic nucleus jets, assuming energy conservation along each magnetic flux tube. Using very-long-baseline interferometry (VLBI) observations and published general relativistic magnetohydrodynamic simulations, we constrain the evolution of the bulk Lorentz factor, the magnetization parameter, and the magnetic field strength along the jet. We then infer the electron density, emission coefficient, and absorption coefficient at each point, and integrate the radiative transfer equation to compute the spectral energy distribution (SED) and the core shift of the synchrotron emission from the relativistic jet. Applying the method to the M87 jet, we find that the hot plasmas are injected at the altitude of seven Schwarzschild radii from the black hole (BH), that the M87 jet is likely composed of a pair plasma, and that the jet flowline geometry is quasi-parabolic as reported at much greater distances. Fitting the nonthermal fraction of the leptonic jet as a function of position, we also find that most of the radio photons are emitted within 1000 Schwarzschild radii from the BH. Although hadronic jets do not reproduce all the VLBI observations consistently in our model, we also discuss that their heavy mass allows a stronger magnetic field within the observational constraints, leading to an inverted SED in sub-millimeter wavelengths by the thermal emission from the jet base. It is therefore implied that contemporaneous observations of the M87 jet with Atacama Large Millimeter/submillimeter Array (ALMA) and VLBI could discriminate the jet composition and its collimation within the central 100 Schwarzschild radii.",
    "authors": [
      "Kouichi Hirotani",
      "Hsien Shang",
      "Ruben Krasnopolsky",
      "Satoki Matsushita",
      "Britton Jeter",
      "Keiichi Asada"
    ],
    "published": "2025-08-08T09:27:49Z",
    "updated": "2025-08-08T09:27:49Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2508.06116v1",
    "url": "https://arxiv.org/abs/2508.06116v1",
    "pdf_url": "https://arxiv.org/pdf/2508.06116v1.pdf",
    "title": "Multiscale turbulence in stellarators",
    "abstract": "We present the first gyrokinetic simulations of multiscale turbulence in a stellarator, using the magnetic geometry of Wendelstein 7-X (W7-X) and experimentally relevant parameters. A broad range of scenarios is explored, including regimes where electron-temperature-gradient (ETG) turbulence coexists with varying levels of ion-temperature-gradient (ITG) turbulence, as well as cases involving microtearing modes (MTMs) relevant to high-$\\beta$ and reactor-like conditions. Notably, while ETG turbulence does not form radial streamers as in tokamaks, it can still drive significant transport and interact with ion-scale turbulence. In electrostatic ITG-dominated regimes, electron-scale fluctuations erode zonal flows, enhancing ion-scale transport, while ion-scale turbulence suppresses ETG activity. In contrast, under electromagnetic MTM conditions, the isotropic nature of ETG turbulence limits its suppressive effect, allowing MTMs to persist. These findings underscore the critical role of cross-scale effects for accurate transport predictions in W7-X and future stellarators.",
    "authors": [
      "G. Merlo",
      "A. Bañón Navarro",
      "T. Görler",
      "F. Jenko",
      "F. Wilms"
    ],
    "published": "2025-08-08T08:31:20Z",
    "updated": "2025-08-08T08:31:20Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.06100v1",
    "url": "https://arxiv.org/abs/2508.06100v1",
    "pdf_url": "https://arxiv.org/pdf/2508.06100v1.pdf",
    "title": "Development and performance test of p-type Silicon pad array detector",
    "abstract": "This article reports on the development and comprehensive evaluation of p-type silicon detector arrays fabricated at the Semi-Conductor Laboratory (SCL), Mohali, India. The detectors consist of an 8~$\\times$~9 array of 1~$\\times$~1~cm$^2$ pads fabricated on 6-inch wafers and read out using the High Granularity Calorimeter Readout Chip (HGCROC). Electrical characterization of the detector through current vs. voltage (IV) and capacitance vs. voltage (CV) measurements demonstrated consistent breakdown and full depletion voltages across all pads, in agreement with Technology Computer-Aided Design (TCAD) device simulations. Laboratory measurements with a $^{90}$Sr source and beam tests at PS, CERN with 10 GeV pions, showed a clear Minimum Ionizing Particle (MIP) signal, well separated from the pedestal and uniform response of the pads with an average signal-to-noise (S/N) ratio above 5.5. The measured shower profiles with 2-4 GeV positron beams for various thicknesses of a tungsten absorber placed in front of the detector are found to be in agreement with the corresponding Geant4 simulations. The performance test results for the detector show that it is a promising candidate for the future ALICE upgrade detector named Forward Calorimeter (FoCal). The FoCal will have alternating layers of low and high-granularity silicon pad detectors with absorbers as a part of the electromagnetic segment, and along with its hadronic segment, will study the direct photons, neutral hadrons, vector mesons, and jets production in the low Bjorken-x region.",
    "authors": [
      "Sawan",
      "G. Tambave",
      "S. Das",
      "A. Chaudhry",
      "R. Gupta",
      "V. K. S. Kashyap",
      "B. Mohanty",
      "M. M. Mondal",
      "S. Mathur",
      "A. Puri",
      "K. P. Sharma",
      "R. Sharma",
      "R. Singh"
    ],
    "published": "2025-08-08T07:58:44Z",
    "updated": "2025-08-08T07:58:44Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.06045v1",
    "url": "https://arxiv.org/abs/2508.06045v1",
    "pdf_url": "https://arxiv.org/pdf/2508.06045v1.pdf",
    "title": "High-Energy Photon Generation from Self-Organized Plasma Cavities in   Field-Enhanced Laser-Preplasma Interactions",
    "abstract": "The interaction of an ultraintense Nd:glass laser pulse with a near-critical plasma self-organizes into a highly efficient $\\gamma$-ray source. Three-dimensional particle-in-cell simulations demonstrate that relativistic self-focusing, aided by a self-generated electron cavity, enhances the laser intensity by more than an order of magnitude, driving the system into the radiation-reaction-dominated regime, i.e. one where the electrons lose a substantial amount of their energy as hard radiation. Peak photon emission occurs near $0.5$ times the relativistic critical density, with a $\\gamma$-photon yield exceeding $20\\%$ of the laser energy. Compared to Ti:Sa lasers of the same power, the longer duration of Nd:glass laser pulses leads to an order of magnitude increase in $\\gamma$-photon number in the extreme conversion efficiency regime, making them particularly well-suited for photonuclear physics applications. These findings point to a robust and scalable mechanism for compact, ultra-bright $\\gamma$-ray generation in the multi-petawatt regime.",
    "authors": [
      "Prokopis Hadjisolomou",
      "Rashid Shaisultanon",
      "Tae Moon Jeong",
      "Christopher Paul Ridgers",
      "Sergei Vladimirovich Bulanov"
    ],
    "published": "2025-08-08T06:09:17Z",
    "updated": "2025-08-08T06:09:17Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.17523v2",
    "url": "https://arxiv.org/abs/2506.17523v2",
    "pdf_url": "https://arxiv.org/pdf/2506.17523v2.pdf",
    "title": "Two Types of $1/f$ Range in Solar Wind Turbulence",
    "abstract": "The $1/f$ noise is a ubiquitous phenomenon in natural systems. Since the advent of space exploration, the $1/f$ range has been consistently observed in \\textit{in situ} solar wind measurements throughout the heliosphere, sparking decades of debate regarding its origin. Recent Parker Solar Probe (PSP) observations near the Alfv\\'en surface have revealed a systematic absence of the $1/f$ range in pristine solar wind, providing a unique opportunity to investigate its origin in solar wind turbulence. Despite numerous observations of the $1/f$ range at varying frequencies, no study has systematically examined its properties across different solar wind conditions. Here, we identify two distinct types of $1/f$ ranges in solar wind turbulence: the fast/Alfv\\'enic wind type and the slow/mixed wind type. The fast/Alfv\\'enic type appears to be an intrinsic feature of Alfv\\'enic turbulence, while the slow/mixed type resembles classical flicker noise. For the fast/Alfv\\'enic type, we find a near-perfect WKB evolution of the frequency-averaged fluctuation amplitude and an intriguing migration pattern in frequency space. For the slow/mixed type, we examine the solar cycle dependence of the $1/f$ noise using the OMNI-LRO dataset spanning solar cycles 22 to 25. We also analyze the autocorrelation function of the magnetic field vectors and identify a clear relationship between the $1/f$ range and the decline in correlation, as well as unexpected resonance peaks in the autocorrelation function.",
    "authors": [
      "Zesen Huang",
      "Marco Velli",
      "B. D. G. Chandran",
      "Chen Shi",
      "Yuliang Ding",
      "Lorenzo Matteini",
      "Kyung-Eun Choi"
    ],
    "published": "2025-06-21T00:21:41Z",
    "updated": "2025-08-08T05:49:30Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2508.06013v1",
    "url": "https://arxiv.org/abs/2508.06013v1",
    "pdf_url": "https://arxiv.org/pdf/2508.06013v1.pdf",
    "title": "Transverse Phase Space Tomography at FACET-II",
    "abstract": "We present transverse phase space tomographic reconstruction of the two-bunch configuration at FACET-II. We demonstrate diagnosing two superimposed electron bunches with different transverse phase spaces using a single quadrupole scan. Tuning the bunch charge revealed unexpected space-charge-dominated dynamics.",
    "authors": [
      "Yiheng Ye",
      "Spencer Gessner"
    ],
    "published": "2025-08-08T04:56:23Z",
    "updated": "2025-08-08T04:56:23Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.05943v1",
    "url": "https://arxiv.org/abs/2508.05943v1",
    "pdf_url": "https://arxiv.org/pdf/2508.05943v1.pdf",
    "title": "Spatiotemporal shaping of broadband helical light pulses at relativistic   intensities",
    "abstract": "Spatiotemporal control of laser pulses at relativistic intensities is a longstanding goal with broad implications in laser-plasma acceleration, high-brightness radiation sources, and extreme-field science. Laser pulses with helical spatiotemporal intensity profiles, often referred to as light springs, carry multiple spectral and orbital angular momentum (OAM) modes, producing a rotating intensity profile capable of coupling directly to helical plasma waves. Until now, light springs have only been realized on low-power systems, limited by optical damage thresholds and large-aperture beamline constraints. Here, we report the first experimental realization of light springs at relativistic intensities, achieving peak intensities above $1.4\\times10^{18}$ W/cm$^{2}$. Our approach spectrally splits a high-power laser pulse, imprints distinct helical phases on each component, and coherently recombines them. Hyperspectral imaging, off-axis holography, and spectral phase reconstruction confirm excellent agreement with theory and reveal the potential to drive superluminal rotational velocities. Introducing spectral chirp demonstrates further control of the temporal evolution of the transverse mode structure. This platform opens new regimes of ultra-intense laser-plasma interaction where laser OAM can directly couple to plasma OAM.",
    "authors": [
      "Andrew Longman",
      "Danny Attiyah",
      "Elizabeth Grace",
      "Christopher Gardner",
      "Tayyab Suratwala",
      "Gary Tham",
      "Colin Harthcock",
      "Robert Fedosejevs",
      "Franklin Dollar"
    ],
    "published": "2025-08-08T02:10:35Z",
    "updated": "2025-08-08T02:10:35Z",
    "categories": [
      "physics.optics",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2505.23110v2",
    "url": "https://arxiv.org/abs/2505.23110v2",
    "pdf_url": "https://arxiv.org/pdf/2505.23110v2.pdf",
    "title": "Linear Landau damping, Schrödinger equation, and fluctuation theorem",
    "abstract": "A linearized Vlasov-Poisson system of equations is transformed into a Schr\\\"{o}dinger equation, which is used to demonstrate that the fluctuation theorem holds for the relative stochastic entropy, defined in terms of the probability density functional of the particle velocity distribution function in the Landau damping process. The difference between the energy perturbation, normalized by the equilibrium temperature, and the entropy perturbation constitutes a time-independent invariant of the system. This invariant takes the quadratic form of the perturbed velocity distribution function and corresponds to the squared amplitude of the state vector that satisfies the Schr\\\"{o}dinger equation. Exact solutions, constructed from a discrete set of Hamiltonian eigenvectors, are employed to formulate and numerically validate the fluctuation theorem for the Landau damping process. The results offer new insights into the formulations of collisionless plasma processes within the framework of nonequilibrium statistical mechanics.",
    "authors": [
      "Hideo Sugama"
    ],
    "published": "2025-05-29T05:24:39Z",
    "updated": "2025-08-08T01:12:50Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.05900v1",
    "url": "https://arxiv.org/abs/2508.05900v1",
    "pdf_url": "https://arxiv.org/pdf/2508.05900v1.pdf",
    "title": "Energetics and limitations of passive electron transpiration cooling for   hypersonic leading edges",
    "abstract": "Electron transpiration cooling (ETC) offers a promising approach for thermal management of hypersonic vehicles by leveraging thermionic emission from the leading edge. While emitted electrons cool the surface, subsequent collection of flowfield electrons induces heating, limiting ETC effectiveness unless collection occurs in cooler aftbody regions. Most existing ETC studies neglect this heating contribution, assuming ideal downstream collection. This work integrates a one-dimensional collisionless plasma sheath model into a discretized leading-edge framework to predict surface potentials and charged-particle fluxes. A parametric study examines how plasma and vehicle properties affect ETC performance. Results reveal that passive ETC is susceptible to thermionic space-charge overcompensation, which can reverse the intended cooling effect and cause surface heating at high plasma densities. Flowfield electron heating can be mitigated but not eliminated by using dielectric coatings or blunt geometries. The same mechanisms that protect blunt bodies from adverse electrical conduction and flowfield heating also preclude incorporation of ETC-based cooling in those vehicle geometries.",
    "authors": [
      "Bryce Boyer",
      "Timothy S. Fisher"
    ],
    "published": "2025-08-07T23:24:51Z",
    "updated": "2025-08-07T23:24:51Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  }
]