{
  "arxiv_id": "2511.02075v2",
  "url": "https://arxiv.org/abs/2511.02075v2",
  "pdf_url": "https://arxiv.org/pdf/2511.02075v2.pdf",
  "title": "Detecting Shearless Phase-Space Transport Barriers in Global Gyrokinetic Turbulence Simulations with Test Particle Map Models",
  "abstract": "In magnetically confined fusion plasmas, the role played by zonal E$\\times$B flow shear layers in the suppression of turbulent transport is relatively well-understood. However, less is understood about the role played by the weak shear regions that arise in the non-monotonic radial electric field profiles often associated with these shear layers. In electrostatic simulations from the global total-f gyrokinetic particle-in-cell code XGC, we demonstrate how shearless regions with non-zero flow curvature form zonal \"jets\" that, in conjunction with neighboring regions of shear, can act as robust barriers to particle transport and turbulence spreading. By isolating quasi-coherent fluctuations radially localized to the zonal jets, we construct a map model for the Lagrangian dynamics of gyrokinetic test particles in the presence of drift waves. We identify the presence of shearless invariant tori in this model and verify that these tori act as partial phase-space transport barriers in the simulations. We also demonstrate how avalanches impinging on these shearless tori cause reconnection events that form \"cold/warm core ring\" structures analogous to those found in oceanic jets, facilitating transport across the barriers without destroying them completely. We discuss how shearless tori may generically arise from tertiary instabilities or other types of discrete eigenmodes, suggesting their potential relevance to broader classes of turbulent fluctuations.",
  "authors": [
    "Norman M. Cao",
    "Hongxuan Zhu",
    "Gabriel C. Grime",
    "Timothy Stoltzfus-Dueck"
  ],
  "published": "2025-11-03T21:25:43Z",
  "updated": "2026-02-26T16:51:40Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": "10.1017/S0022377826101305"
}