{
  "arxiv_id": "2602.21489v1",
  "url": "https://arxiv.org/abs/2602.21489v1",
  "pdf_url": "https://arxiv.org/pdf/2602.21489v1.pdf",
  "title": "A novel perspective on crystal electromagnetic calorimeter design for the CEPC",
  "abstract": "Crystal electromagnetic calorimeters (ECALs) are essential for high-precision measurements of electrons and photons in particle physics experiments. However, the conventional design, in which long crystal bars point radially toward the interaction region and lack longitudinal segmentation, is incompatible with the three-dimensional shower imaging required by Particle Flow Approach (PFA). We propose a novel perspective on crystal ECAL design to address this limitation. The key innovation is a geometric reconfiguration in which crystal bars are oriented to face the interaction region and arranged orthogonally in adjacent longitudinal layers. This layout achieves fine spatial segmentation of energy deposits by correlating measurements of orthogonal crystal bars. An interleaved structure of regular and inverted trapezoidal modules is incorporated to maximize structural uniformity and detector hermeticity. This design is engineered to preserve the excellent intrinsic energy resolution of crystal ECALs while simultaneously providing the detailed three-dimensional shower imaging essential for PFA. Simulation results confirm the feasibility of achieving excellent energy resolution of $1.14\\%/\\sqrt{E} \\oplus 0.44\\%$. Consequently, the proposed design repositions crystal ECAL as a foundational component for PFA-oriented detector systems at facilities such as the Circular Electron Positron Collider (CEPC), offering a new technical pathway to advance the physics goals of future colliders.",
  "authors": [
    "Weizheng Song",
    "Yang Zhang",
    "Shengsen Sun",
    "Fangyi Guo",
    "Yuanzhan Wang",
    "Linghui Wu",
    "Jie Guo",
    "Shaojing Hou",
    "Yong Liu",
    "Quan Ji",
    "Jinfan Chang",
    "Yifang Wang"
  ],
  "published": "2026-02-25T01:39:57Z",
  "updated": "2026-02-25T01:39:57Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}