{
  "arxiv_id": "2602.22841v1",
  "url": "https://arxiv.org/abs/2602.22841v1",
  "pdf_url": "https://arxiv.org/pdf/2602.22841v1.pdf",
  "title": "Experimental Demonstration of Beam-Driven Wakefield Acceleration in Laser-Plasma Filament",
  "abstract": "Self-guided femtosecond laser pulses propagating in low-pressure gas can generate plasma filaments, establishing a new framework for plasma wakefield acceleration. Unlike conventional schemes relying on mechanically confined or preformed plasma channels, this method exploits the intrinsic non-linear light-matter interaction, greatly reducing the energy required to generate plasma. This, in turn, allows to realise tunable stages, potentially operating above kHz repetition rate and with meter-scale interaction lengths and transverse sizes down to a few tens of micrometres. Moreover, the laser-plasma filament reproducibility is intrinsically higher than state-of-the-art discharge-plasmas, where the breakdown process is initiated in a stochastic and uncontrolled manner. As a result, laser-based plasma formation offers improved reliability and control over plasma parameters. Here we report a proof-of-principle experimental demonstration of beam-driven wakefield acceleration of electron bunches with an accelerating field exceeding 250 MV/m in a laser-generated plasma filament. The results are cross-checked with numerical simulation, showing an excellent agreement and providing a complete picture of the physical process. Beyond particle acceleration, the concept bridges laser filamentation physics, advanced plasma photonics and compact accelerator technologies, offering a promising route towards sustainable, high-repetition-rate plasma-based facilities.",
  "authors": [
    "M. Galletti",
    "L. Verra",
    "A. Biagioni",
    "M. Carillo",
    "L. Crincoli",
    "R. Demitra",
    "G. Parise",
    "G. Di Pirro",
    "R. Pompili",
    "F. Stocchi",
    "F. Villa",
    "A. Zigler",
    "M. Ferrario"
  ],
  "published": "2026-02-26T10:28:54Z",
  "updated": "2026-02-26T10:28:54Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}