{
  "arxiv_id": "2602.21151v2",
  "url": "https://arxiv.org/abs/2602.21151v2",
  "pdf_url": "https://arxiv.org/pdf/2602.21151v2.pdf",
  "title": "A coherent structure transport model for scrape-off layer turbulence",
  "abstract": "Understanding the locality of high-temperature plasma energy deposition on material surfaces in fusion reactors is critical for design. Here, we utilize the Gyrokinetic ElectroMagnetic turbulence including X-points (GEMX) simulation, together with SOLPS-ITER solutions for the background equilibrium electric field including drifts, to model the heat flux at the divertor plate and characterize the heat load width using realistic X-point geometry. We use a theory-based blobby transport model called the \"Coherent Structure Transport\" (CST) model to include the effect of plasma transport in the edge scrape-off layer. The CST model is extremely fast and can be used to quickly analyze any SOLPS-ITER solution. SOLPS-ITER provides the steady state, or equilibrium on which we superimpose blobby turbulence characterized by blob size, amplitude and frequency. We obtain the $1/B_p$ scaling of the heat load exponential decay width $λ_q$, in agreement with the Eich empirical scaling and with the Goldston heuristic theory. When including blobby turbulence in combination with the SOLPS-ITER electric field, we find a secondary peak in the heat flux radial profile, outwardly displaced from the strike point radius, with a relative amplitude that increases with the initial blob density. We describe the CST model in detail and provide initial investigations of the scaling of $λ_q$ and the secondary heat flux peak with blob size and amplitude.",
  "authors": [
    "Zhichen Feng",
    "James Myra",
    "Junyi Cheng",
    "Calder Haubrich",
    "Yang Chen",
    "Xinxing Ma",
    "Darin R. Ernst",
    "Scott Parker"
  ],
  "published": "2026-02-24T17:53:11Z",
  "updated": "2026-02-25T02:52:31Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}