[
  {
    "arxiv_id": "2602.23338v1",
    "url": "https://arxiv.org/abs/2602.23338v1",
    "pdf_url": "https://arxiv.org/pdf/2602.23338v1.pdf",
    "title": "CubeSounder: Low SWaP-C 180 GHz Radiometer for Atmospheric Sensing Tested on High Altitude Balloons",
    "abstract": "Microwave sounding is the leading driver of global numerical weather forecasting, but is limited by the scalability of such instruments. With modern machining and commercial microwave components, it is now possible to design low size, weight, power, and cost (SWaP-C) microwave spectrometers while maintaining wide bandwidth performance. Here we report on the status of CubeSounder, a spectrometer tailored for water vapor radiometry that utilizes passive wave guide filter banks. After developing a prototype and high altitude balloon payload, we demonstrated CubeSounder on commercial stratospheric balloon flights. We report on our design process, especially the simulation and fabrication of the custom millimeter-wave filter banks. We also report the initial results of the data collected from the balloon flights.",
    "authors": [
      "Kyle D. Massingill",
      "Tyler M. Karasinski",
      "Sean Bryan",
      "Michael Baricuatro",
      "Daniel Bliss",
      "Delondrae Carter",
      "Walter Goodwin",
      "Jonathan Greenfield",
      "Christopher Groppi",
      "Jae Joiner",
      "Philip Mauskopf",
      "Philip Rybak",
      "Scott Smas",
      "Roshni Suresh",
      "Joesph Tinlin",
      "Bianca Wullen",
      "Peter Wullen"
    ],
    "published": "2026-02-26T18:42:38Z",
    "updated": "2026-02-26T18:42:38Z",
    "categories": [
      "eess.SP",
      "physics.ins-det"
    ],
    "primary_category": "eess.SP"
  },
  {
    "arxiv_id": "2602.23263v1",
    "url": "https://arxiv.org/abs/2602.23263v1",
    "pdf_url": "https://arxiv.org/pdf/2602.23263v1.pdf",
    "title": "Imprints of primordial magnetic fields on the late-time Universe",
    "abstract": "Primordial magnetic fields (PMFs) generated in the early Universe may leave observable imprints in the present-day large-scale structure. However, it remains unclear on which spatial scales primordial signatures can survive the nonlinear processes accompanying structure formation. The aim of this study is to investigate the evolution of PMFs during gravitational collapse and to determine the spatial scales on which primordial signatures can persist. We perform a suite of high-resolution direct numerical simulations of self-gravitating, magnetized halos. By varying the viscosity, we probe different Reynolds-number regimes and follow the coupled evolution of gravitational collapse and magnetohydrodynamic turbulence. At sufficiently high Reynolds numbers, turbulence generated during collapse triggers the onset of a small-scale dynamo, which amplifies magnetic energy below the Jeans scale and modifies the magnetic energy spectrum significantly. Whether dynamo amplification dominates the magnetic field evolution is determined by the competition between the dynamo growth time and the free-fall time. Our results highlight the importance of resolving the Jeans scale and the associated turbulent inertial range in cosmological MHD simulations to accurately capture the interplay between gravitational compression and dynamo amplification and to assess which structures retain memory of primordial fields.",
    "authors": [
      "Jennifer Schober",
      "Molly Abramson",
      "Sayan Mandal",
      "Salome Mtchedlidze",
      "Tina Kahniashvili"
    ],
    "published": "2026-02-26T17:37:05Z",
    "updated": "2026-02-26T17:37:05Z",
    "categories": [
      "astro-ph.CO",
      "astro-ph.GA",
      "hep-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.CO"
  },
  {
    "arxiv_id": "2512.19892v2",
    "url": "https://arxiv.org/abs/2512.19892v2",
    "pdf_url": "https://arxiv.org/pdf/2512.19892v2.pdf",
    "title": "Superluminal Wave Activation at Relativistic Magnetized Shocks",
    "abstract": "Fast radio bursts (FRBs) are extremely energetic radio transients, some are generated in magnetar magnetospheres and winds. Despite a growing number of observations, their emission mechanisms remain elusive. It has recently been proposed that Alfvénic perturbations can convert into superluminal O-modes at magnetized shocks and propagate downstream as a radio signal. We validate this superluminal wave activation mechanism using pair-plasma theory and particle-in-cell simulations. Theory predicts two different downstream modes: nonpropagating Alfvénic perturbations and propagating superluminal O-modes. Superluminal wave activation occurs if the frequency of upstream perturbations in the shock frame exceeds the downstream plasma frequency. 1D particle-in-cell simulations confirm wavenumber and frequency jumps across the shock for upstream perturbations with frequencies well above the plasma frequency. Our simulations model both monochromatic upstream waves and broadband spectra with the downstream plasma frequency acting like a high-pass filter for superluminal O-modes. We discuss implications for FRB generation in relativistic magnetized winds.",
    "authors": [
      "Jens F. Mahlmann",
      "Logan Eskildsen",
      "Arno Vanthieghem",
      "Dawei Dai",
      "Lorenzo Sironi"
    ],
    "published": "2025-12-22T21:34:32Z",
    "updated": "2026-02-26T17:35:23Z",
    "categories": [
      "astro-ph.HE",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE",
    "doi": "10.3847/2041-8213/ae4510"
  },
  {
    "arxiv_id": "2602.23215v1",
    "url": "https://arxiv.org/abs/2602.23215v1",
    "pdf_url": "https://arxiv.org/pdf/2602.23215v1.pdf",
    "title": "RF Basics I & II",
    "abstract": "This lecture starts with a brief historical introduction and an explanation how to get from Maxwell's Equations to a simple cavity. After simplifying and adapting the equations for their application to Radio Frequency problems, the most important formulae and characteristics for cavities and wave-guides are derived. The most common figures of merit are explained and some of the different cavity types are introduced. The alternative description of cavities as a lumped circuit model is then introduced, which is often used to characterise the cavity-coupler-generator interplay.",
    "authors": [
      "Frank Gerigk"
    ],
    "published": "2026-02-26T16:59:10Z",
    "updated": "2026-02-26T16:59:10Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.02075v2",
    "url": "https://arxiv.org/abs/2511.02075v2",
    "pdf_url": "https://arxiv.org/pdf/2511.02075v2.pdf",
    "title": "Detecting Shearless Phase-Space Transport Barriers in Global Gyrokinetic Turbulence Simulations with Test Particle Map Models",
    "abstract": "In magnetically confined fusion plasmas, the role played by zonal E$\\times$B flow shear layers in the suppression of turbulent transport is relatively well-understood. However, less is understood about the role played by the weak shear regions that arise in the non-monotonic radial electric field profiles often associated with these shear layers. In electrostatic simulations from the global total-f gyrokinetic particle-in-cell code XGC, we demonstrate how shearless regions with non-zero flow curvature form zonal \"jets\" that, in conjunction with neighboring regions of shear, can act as robust barriers to particle transport and turbulence spreading. By isolating quasi-coherent fluctuations radially localized to the zonal jets, we construct a map model for the Lagrangian dynamics of gyrokinetic test particles in the presence of drift waves. We identify the presence of shearless invariant tori in this model and verify that these tori act as partial phase-space transport barriers in the simulations. We also demonstrate how avalanches impinging on these shearless tori cause reconnection events that form \"cold/warm core ring\" structures analogous to those found in oceanic jets, facilitating transport across the barriers without destroying them completely. We discuss how shearless tori may generically arise from tertiary instabilities or other types of discrete eigenmodes, suggesting their potential relevance to broader classes of turbulent fluctuations.",
    "authors": [
      "Norman M. Cao",
      "Hongxuan Zhu",
      "Gabriel C. Grime",
      "Timothy Stoltzfus-Dueck"
    ],
    "published": "2025-11-03T21:25:43Z",
    "updated": "2026-02-26T16:51:40Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1017/S0022377826101305"
  },
  {
    "arxiv_id": "2602.23195v1",
    "url": "https://arxiv.org/abs/2602.23195v1",
    "pdf_url": "https://arxiv.org/pdf/2602.23195v1.pdf",
    "title": "A Lorentz-Covariant Spectral Universality of Stochastic Fields",
    "abstract": "We derive a Lorentz-covariant spectral universality for stationary stochastic fields in Minkowski spacetime. We show that no covariant local mapping can relate temporal and spatial power spectra in more than one spatial dimension. For Lorentz homogeneous spectra, the temporal index is symmetry protected, observer invariant, and offset from the spatial index by a universal geometric factor set by effective momentum space dimensionality. We show how spectral universality breaks down for anisotropic scaling and dispersion dominated spectra, establishing the necessity of a Lorentz-covariant formulation of relativistic spectral inference.",
    "authors": [
      "Alexander G. Tevzadze"
    ],
    "published": "2026-02-26T16:47:59Z",
    "updated": "2026-02-26T16:47:59Z",
    "categories": [
      "astro-ph.HE",
      "gr-qc",
      "hep-th",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2602.23186v1",
    "url": "https://arxiv.org/abs/2602.23186v1",
    "pdf_url": "https://arxiv.org/pdf/2602.23186v1.pdf",
    "title": "The transient behavior of superconducting multi-cell accelerating cavities",
    "abstract": "We employ an equivalent-circuit model of a multi-cell cavity to explore its time-dependent behavior in order to understand differences between the multi-cell model and the commonly-used model of a single-cell resonator. Furthermore, we address tolerances that arise from manufacturing imperfections.",
    "authors": [
      "Volker Ziemann"
    ],
    "published": "2026-02-26T16:42:40Z",
    "updated": "2026-02-26T16:42:40Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.23139v1",
    "url": "https://arxiv.org/abs/2602.23139v1",
    "pdf_url": "https://arxiv.org/pdf/2602.23139v1.pdf",
    "title": "Charge collection parameterization of MALTA2, a depleted monolithic active pixel sensor",
    "abstract": "A fast simulation method is presented for a depleted monolithic active pixel sensor, which uses a data driven parameterization of the charge collection and propagation. This approach provides an efficient alternative to TCAD simulations, particularly for sensors whose proprietary process details - such as doping profiles or implant geometries - are unavailable. Data was obtained with a MALTA2 sensor fabricated in a 180 nm CMOS imaging technology on 30 μm epitaxial silicon using the MALTA beam telescope at CERN SPS. The model reproduces the measured inpixel efficiency with high accuracy and enables a realistic yet computationally lightweight analog pixel simulation. This method will be further employed in optimizing the digital sensor design for applications in high-rate particle tracking and high-granularity calorimetry.",
    "authors": [
      "L. Fasselt",
      "P. Behera",
      "D. V. Berlea",
      "D. Bortoletto",
      "C. Buttar",
      "T. Chembakan",
      "V. Dao",
      "G. Dash",
      "S. Haberl",
      "T. Inada",
      "F. K. Isik",
      "P. Jana",
      "X. Li",
      "L. Li",
      "H. Pernegger",
      "P. Riedler",
      "W. Snoeys",
      "C. A. Solans Sánchez",
      "A. Swoboda",
      "I. Turk Cakir",
      "M. van Rijnbach",
      "M. Vázquez Núñez",
      "A. Vijay",
      "J. Weick",
      "S. Worm"
    ],
    "published": "2026-02-26T16:02:22Z",
    "updated": "2026-02-26T16:02:22Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.23104v1",
    "url": "https://arxiv.org/abs/2602.23104v1",
    "pdf_url": "https://arxiv.org/pdf/2602.23104v1.pdf",
    "title": "Analytic Expressions for Shielded Halbach Multipoles",
    "abstract": "We employ the method of images to derive analytic expressions for the magnetic field of Halbach multipoles that are enclosed in high-permeability shielding.",
    "authors": [
      "Volker Ziemann"
    ],
    "published": "2026-02-26T15:17:48Z",
    "updated": "2026-02-26T15:17:48Z",
    "categories": [
      "physics.acc-ph",
      "hep-ph",
      "physics.app-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.23007v1",
    "url": "https://arxiv.org/abs/2602.23007v1",
    "pdf_url": "https://arxiv.org/pdf/2602.23007v1.pdf",
    "title": "Merging of zonal flows in gyrofluid resistive drift-wave turbulence",
    "abstract": "Non-linear dynamics of zonal flows is investigated in the context of the gyrofluid modified Hasegawa-Wakatani model. Merging of zonal flows and the chaotic developement of the initial zonal flow pattern is explored. Conservation equations for zonal flow momentum and energy with consistent finite Larmor radius (FLR) effects are derived and used for a quantitative analysis of zonal flow mergers in numerical simulations. The nonlinear local Reynolds stress transfer as opposed to (hyper)viscous dissipation is found to be the main cause of merging. The applicability of the concept of a phase transition in the strict thermodynamical sense is discussed in context of zonal flow transition hysteresis.",
    "authors": [
      "Fabian Grander",
      "Tobias Gröfler",
      "Franz Ferdinand Locker",
      "Manuel Rinner",
      "Alexander Kendl"
    ],
    "published": "2026-02-26T13:50:37Z",
    "updated": "2026-02-26T13:50:37Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.22992v1",
    "url": "https://arxiv.org/abs/2602.22992v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22992v1.pdf",
    "title": "Hard X-Ray Zernike-Type Phase-Contrast Imaging with a Two-Block Crystal System",
    "abstract": "A novel scheme for Zernike-type hard X-ray phase-contrast imaging is proposed. The scheme relies on X-ray dynamical diffraction in a two-block crystal system with parallel crystal plates of equal thickness. A phase shifter providing a $π/2$ phase shift is placed in the inter-block gap of the crystal system. The method operates in a scanning geometry. The proposed imaging setup is compact and does not require conventional focusing optics. Numerical simulations of phase-contrast image formation are performed.",
    "authors": [
      "Levon Haroutunyan"
    ],
    "published": "2026-02-26T13:35:56Z",
    "updated": "2026-02-26T13:35:56Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2602.22970v1",
    "url": "https://arxiv.org/abs/2602.22970v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22970v1.pdf",
    "title": "Demonstrating Single Photon Counting with Kinetic Inductance Detectors from 3.8 to 25 $μ$m",
    "abstract": "One of the primary objectives of modern astronomy is the atmospheric characterization of Earth-like exoplanets at visible and infrared wavelengths. Achieving this goal requires extremely sensitive detectors capable of measuring faint signal of the exoplanet at the single-photon level while maintaining near-zero dark count rates. In the infrared, however, conventional semiconducting detector technologies struggle to meet these stringent requirements. In this work we demonstrate single-photon counting with superconducting Microwave Kinetic Inductance Detectors at the wavelengths 3.8, 8.5, 18.5, and 25 $μ$m and measure resolving powers ($E/δE$) of 9.9, 5.9, 3.2, and 3.3, respectively, with corresponding dark count rates of 4, 8, 34, and 48 mHz. Our membrane-based devices reach phonon-loss limited performance at 3.8 $μ$m, more than doubling the performance attainable with comparable solid-substrate devices. These results showcase the detector technology in the mid-infrared and the intricate measurement setup required for these sensitive detectors. We discuss how the detector design and measurement setup can be further optimized to increase the detector performance in the mid-infrared.",
    "authors": [
      "Wilbert G. Ras-Vinke",
      "Kevin Kouwenhoven",
      "Jochem J. A. Baselmans",
      "Kenichi Karatsu",
      "David J. Thoen",
      "Vignesh Murugesan",
      "Pieter J. de Visser"
    ],
    "published": "2026-02-26T13:08:43Z",
    "updated": "2026-02-26T13:08:43Z",
    "categories": [
      "astro-ph.IM",
      "cond-mat.supr-con",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2602.22951v1",
    "url": "https://arxiv.org/abs/2602.22951v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22951v1.pdf",
    "title": "Growth-controlled photochromism in yttrium oxyhydride thin films deposited by HiPIMS and pulsed-DC magnetron sputtering",
    "abstract": "The present study investigates photochromic oxygen-containing yttrium hydride (YHO) thin films deposited by reactive high power impulse magnetron sputtering (HiPIMS) and compares their photochromic, optical, and structural properties with those of films synthesized by reactive pulsed direct current magnetron sputtering (pulsed-DCMS). Optical emission spectroscopy reveals that, unlike pulsed-DCMS where Ar$^{+}$ ions dominate, HiPIMS discharges are characterised by strong Y$^{+}$ emission, evidencing high yttrium ionisation and substantial self-sputter recycling. The critical working pressure (P$_c$) required to obtain transparent and photochromic films is higher for HiPIMS (Pc $\\approx$ 1.0 Pa) than for pulsed-DCMS (Pc $\\approx$ 0.5 Pa). Although films deposited near Pc exhibit similar solar transmittance (~72 %) and lattice parameters (5.38--5.39 Å), the pulsed-DCMS film shows a substantially higher relative photochromic contrast (34 %) and a lower optical band gap (2.70 eV) compared with the HiPIMS film (9 % contrast and 2.94 eV). This difference is partly attributed to a lower oxygen-to-hydrogen atomic ratio in the pulsed-DCMS film. Structurally, HiPIMS films are largely polycrystalline with random out-of-plane crystallographic orientation, whereas pulsed-DCMS films exhibit a pronounced <100> out-of-plane preferred orientation. These results demonstrate that, beyond composition, thin-film growth conditions and microstructure play a crucial role in governing the photochromic performance of YHO.",
    "authors": [
      "M. Zubkins",
      "E. Letko",
      "E. Strods",
      "V. Vibornijs",
      "D. Moldarev",
      "K. Sarakinos",
      "K. Mizohata",
      "K. Kundzins",
      "J. Purans"
    ],
    "published": "2026-02-26T12:43:26Z",
    "updated": "2026-02-26T12:43:26Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.app-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "doi": "10.1016/j.vacuum.2026.115214"
  },
  {
    "arxiv_id": "2602.22849v1",
    "url": "https://arxiv.org/abs/2602.22849v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22849v1.pdf",
    "title": "Testing beyond the Standard Model scenarios in next-generation long-baseline neutrino oscillation experiments",
    "abstract": "In this thesis, we assess the sensitivity of next-generation long-baseline neutrino oscillation experiments, DUNE, T2HK, and T2HKK, to three popular beyond the Standard Model (BSM) scenarios. Within the three BSM studies, we examine: (i) long-range neutrino-matter interactions induced by flavor-dependent, anomaly-free gauged baryon-lepton symmetries mediated by ultra-light vector boson, showing that DUNE and T2HK can constrain, discover, and in some favorable cases distinguish among different symmetries; (ii) Lorentz invariance violation (LIV), where we derive analytical dependencies of CPT-conserving and CPT-violating LIV parameters on baseline and energy, highlighting the superior reach of DUNE in probing all the LIV parameters, in contrast to T2HK, which is essentially blind to the CPT-conserving LIV parameters; and (iii) active-sterile oscillations over a broad range of $Δm^2_{41}$, where we derive sensitivity to CP phases for benchmark choices of $Δm^2_{41}$ and establish exclusion limits, emphasizing the role of near detectors. Together, these studies show that future long-baseline facilities not only resolve the neutrino mass ordering, value of $δ_{\\rm CP}$, and $θ_{23}$ octant, but also provide powerful probes of BSM physics.",
    "authors": [
      "Pragyanprasu Swain"
    ],
    "published": "2026-02-26T10:38:08Z",
    "updated": "2026-02-26T10:38:08Z",
    "categories": [
      "hep-ph",
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2602.22841v1",
    "url": "https://arxiv.org/abs/2602.22841v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22841v1.pdf",
    "title": "Experimental Demonstration of Beam-Driven Wakefield Acceleration in Laser-Plasma Filament",
    "abstract": "Self-guided femtosecond laser pulses propagating in low-pressure gas can generate plasma filaments, establishing a new framework for plasma wakefield acceleration. Unlike conventional schemes relying on mechanically confined or preformed plasma channels, this method exploits the intrinsic non-linear light-matter interaction, greatly reducing the energy required to generate plasma. This, in turn, allows to realise tunable stages, potentially operating above kHz repetition rate and with meter-scale interaction lengths and transverse sizes down to a few tens of micrometres. Moreover, the laser-plasma filament reproducibility is intrinsically higher than state-of-the-art discharge-plasmas, where the breakdown process is initiated in a stochastic and uncontrolled manner. As a result, laser-based plasma formation offers improved reliability and control over plasma parameters. Here we report a proof-of-principle experimental demonstration of beam-driven wakefield acceleration of electron bunches with an accelerating field exceeding 250 MV/m in a laser-generated plasma filament. The results are cross-checked with numerical simulation, showing an excellent agreement and providing a complete picture of the physical process. Beyond particle acceleration, the concept bridges laser filamentation physics, advanced plasma photonics and compact accelerator technologies, offering a promising route towards sustainable, high-repetition-rate plasma-based facilities.",
    "authors": [
      "M. Galletti",
      "L. Verra",
      "A. Biagioni",
      "M. Carillo",
      "L. Crincoli",
      "R. Demitra",
      "G. Parise",
      "G. Di Pirro",
      "R. Pompili",
      "F. Stocchi",
      "F. Villa",
      "A. Zigler",
      "M. Ferrario"
    ],
    "published": "2026-02-26T10:28:54Z",
    "updated": "2026-02-26T10:28:54Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2503.01764v3",
    "url": "https://arxiv.org/abs/2503.01764v3",
    "pdf_url": "https://arxiv.org/pdf/2503.01764v3.pdf",
    "title": "Design and Development of Portable RPC-Based Cosmic Muon Tracker",
    "abstract": "Primary cosmic rays when interact with our atmosphere, produce a cascade of lighter secondary particles namely pion, kaon, neutrons, muons, electrons, positrons and neutrinos. Muons are one of the most abundant and easily detectable particles at the ground surface using a large variety of particle detectors. Resistive Plate Chambers (RPCs) of 2m x 2m in dimension were developed to be used in large scale as the active detector elements in the Iron Calorimeter (ICAL) which was planned to be built by the India-based Neutrino Observatory (INO). As a spin-off of this work, a portable stack of eight, one square foot RPC detectors is developed named as Cosmic Muon Tracker (CMT). It could be used to conduct small-scale particle detector experiments as well as training Students. We will discuss design, integration, characterisation and some of the applications of this detector in this paper.",
    "authors": [
      "Yuvaraj Elangovan",
      "B. Satyanarayana",
      "Ravindra Shinde",
      "Mandar Saraf",
      "Pathaleswar",
      "S. Thoi Thoi",
      "Gobinda Majumder",
      "S. R. Joshi",
      "Piyush Verma",
      "Honey Khindri",
      "Umesh L"
    ],
    "published": "2025-03-03T17:38:15Z",
    "updated": "2026-02-26T09:51:23Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2503.02751v2",
    "url": "https://arxiv.org/abs/2503.02751v2",
    "pdf_url": "https://arxiv.org/pdf/2503.02751v2.pdf",
    "title": "Design and Implementation of a UDP-Based Command Interface for the INO ICAL Experiment",
    "abstract": "Efficient command interface is a critical requirement for experiments employing a large number of front-end DAQ modules and control servers. In the context of the INOICAL (India-based Neutrino Observatory Iron Calorimeter) experiment, this involves 28,800 Resistive Plate Chamber(RPC), charged particle detectors. The acquisition and control of these detectors are facilitated through Front End data acquisition modules known as RPC-DAQs. These modules consists of Ethernet interfaces for data and command connectivity to a server. Each module acts as a network node with a unique IP address. The collective group of hundreds of modules is controlled by a common server over a Local Area Network (LAN). UDP (User Datagram Protocol) is the most commonly used networking protocol which supports Multicast as well as Unicast, can be easily adapted to INO ICAL Experiment. A server can send commands to group of DAQs or any particular DAQ. But UDP may have the problem of packet loss and reliability. To mitigate these issues, this paper suggests a simpler approach that modifies the UDP protocol by implementing a handshaking scheme and checksum, similar to those found in more reliable protocols like TCP. The proposed solution optimizes the use of UDP as a reliable command interface in the INO ICAL experiment, ensuring seamless data acquisition and control. Also, this paper shows the performance study of the custom hybrid UDP Command Interface in the prototype ICAL experiment called Mini Iron Calorimeter (Mini ICAL) which houses 20 units of RPCs and electronics. This work not only addresses the challenges of the INO ICAL experiment but also underscores the adaptability and robustness of the proposed protocol for usage in mini-ICAL and beyond.",
    "authors": [
      "Yuvaraj Elangovan",
      "Mandar Saraf",
      "B. Satyanarayana",
      "S. S. Upadhya",
      "Nagaraj Panyam",
      "Ravindra Shinde",
      "Gobinda Majumder",
      "D. Sil",
      "Pathaleswar",
      "K. C. Ravindran",
      "Upendra Gokhale",
      "Pavan Kumar"
    ],
    "published": "2025-03-04T16:17:15Z",
    "updated": "2026-02-26T09:45:22Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.11304v2",
    "url": "https://arxiv.org/abs/2510.11304v2",
    "pdf_url": "https://arxiv.org/pdf/2510.11304v2.pdf",
    "title": "In-situ Radiation Damage Study of Silicon Carbide Detectors Subjected to Clinical Proton Beams",
    "abstract": "Silicon carbide (SiC) planar PiN diodes from two different manufacturers were irradiated with 252.7 MeV protons from a medical synchrotron. Over the course of two 8h irradiation shifts, the samples were exposed to increasing fluences ranging from 1.4e+11 to 3.5e+13 p+/cm^2. Electrical characterizations, including IV and CV measurements, were performed both before and after irradiation using probe stations, and for selected samples even in-situ between fluence steps directly at the irradiation facility. The results show a gradual compensation of the effective epitaxial doping concentration with each incremental fluence step, observed as a reduction in capacitance before full depletion and confirmed by the extracted effective doping concentration. From these measurements, linear donor removal rates are determined for all sample groups, with values ranging from 4.2/cm to 6.4/cm. These findings provide a quantitative basis for understanding radiation-induced charge carrier removal in 4H-SiC devices and are relevant for predicting the performance and lifetime of future radiation-hard detector technologies, including 4H-SiC LGADs.",
    "authors": [
      "Daniel Radmanovac",
      "Andreas Gsponer",
      "Simon Waid",
      "Sebastian Onder",
      "Matthias Knopf",
      "Juergen Burin",
      "Stefan Gundacker",
      "Thomas Bergauer"
    ],
    "published": "2025-10-13T11:50:02Z",
    "updated": "2026-02-26T08:35:48Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/21/01/C01033"
  },
  {
    "arxiv_id": "2602.22656v1",
    "url": "https://arxiv.org/abs/2602.22656v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22656v1.pdf",
    "title": "Gyrokinetic turbulent transport simulations on steady burning condition in D-T-He plasmas",
    "abstract": "Ion temperature gradient(ITG) and trapped electron modes(TEM) driven turbulent transport in an ITER-like plasma is investigated by means of multi-species gyrokinetic Vlasov simulations with D, T, He, and real-mass kinetic electrons including their inter-species collisions. Beyond the conventional zero-dimensional power balance analysis presuming the global energy and particle confinement times, gyrokinetic-simulation-based evaluation of a steady burning condition with He-ash exhaust and D-T fuel inward pinch is demonstrated. It is clarified that a significant imbalance appears in the turbulent particle flux for the fuel ions of D and T, depending on the D-T density ratio and the He-ash accumulation. Then several profile regimes to satisfy Reiter's steady burning condition are, for the first time, identified by the gyrokinetic simulation. Also, the impacts of zonal flows and nonthermal He-ash on the optimal profile regimes are examined.",
    "authors": [
      "Motoki Nakata",
      "Mitsuru Honda"
    ],
    "published": "2026-02-26T06:13:55Z",
    "updated": "2026-02-26T06:13:55Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1585/pfr.17.1403083"
  },
  {
    "arxiv_id": "2602.22655v1",
    "url": "https://arxiv.org/abs/2602.22655v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22655v1.pdf",
    "title": "Isotope Effects on TEM-driven Turbulence and Zonal Flows in Helical and Tokamak Plasmas",
    "abstract": "Impacts of isotope ion mass on trapped electron mode (TEM) driven turbulence and zonal flows in magnetically confined fusion plasmas are investigated. Gyrokinetic simulations of TEM-driven turbulence in three-dimensional magnetic configuration of LHD plasmas with hydrogen isotope ions and real-mass kinetic electrons are realized for the first time, and the linear and the nonlinear nature of the isotope and collisional effects on the turbulent transport and zonal-flow generation is clarified. It is newly found that combined effects of the collisional TEM stabilization by the isotope ions and the associated increase in the impacts of the steady zonal flows at the near-marginal linear stability lead to the significant transport reduction with the opposite ion mass dependence in comparison to the conventional gyro-Bohm scaling. The universal nature of the isotope effects on the TEM-driven turbulence and zonal flows is verified for a wide variety of toroidal plasmas, e.g., axisymmetric tokamak and non-axisymmetric helical/stellarator systems.",
    "authors": [
      "Motoki Nakata",
      "Masanori Nunami",
      "Hideo Sugama",
      "Tomo-Hiko Watanabe"
    ],
    "published": "2026-02-26T06:13:38Z",
    "updated": "2026-02-26T06:13:38Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1103/PhysRevLett.118.165002"
  },
  {
    "arxiv_id": "2602.22653v1",
    "url": "https://arxiv.org/abs/2602.22653v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22653v1.pdf",
    "title": "Nonlinear entropy transfer via zonal flows in gyrokinetic plasma turbulence",
    "abstract": "Nonlinear entropy transfer processes in toroidal ion temperature gradient (ITG) and electron temperature gradient (ETG) driven turbulence are investigated based on the gyrokinetic entropy balance relations for zonal and non-zonal modes, which are coupled through the entropy transfer function regarded as a kinetic extension of the zonal-flow production due to the Reynolds stress. Spectral analyses of the \"triad\" entropy transfer function introduced in this study reveal not only the nonlinear interactions among the zonal and non-zonal modes, but also their effects on the turbulent transport level. Different types of the entropy transfer processes between the ITG and ETG turbulence are found: The entropy transfer from non-zonal to zonal modes is substantial in the saturation phase of the ITG instability, while, once the strong zonal flow is generated, the entropy transfer to the zonal modes becomes quite weak in the steady turbulence state. Instead, the zonal flows mediate the entropy transfer from non-zonal modes with low radial-wavenumbers (with contribution to the heat flux) to the other non-zonal modes with higher radial-wavenumbers (but with less contribution to the heat flux) through the triad interaction. The successive entropy transfer processes to the higher radial-wavenumber modes are associated with transport regulation in the steady turbulence state. In contrast, in both the instability-saturation and steady phases of the ETG turbulence, the entropy transfer processes among low-wavenumber non-zonal modes are dominant rather than the transfer via zonal modes.",
    "authors": [
      "Motoki Nakata",
      "Tomo-Hiko Watanabe",
      "Hideo Sugama"
    ],
    "published": "2026-02-26T06:13:19Z",
    "updated": "2026-02-26T06:13:19Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1063/1.3675855"
  },
  {
    "arxiv_id": "2602.22618v1",
    "url": "https://arxiv.org/abs/2602.22618v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22618v1.pdf",
    "title": "Advancing accelerator virtual beam diagnostics through latent evolution modeling: an integrated solution to forward, inverse, tuning, and UQ problems",
    "abstract": "Virtual beam diagnostics relies on computationally intensive beam dynamics simulations where high-dimensional charged particle beams evolve through the accelerator. We propose Latent Evolution Model (LEM), a hybrid machine learning framework with an autoencoder that projects high-dimensional phase spaces into lower-dimensional representations, coupled with transformers to learn temporal dynamics in the latent space. This approach provides a common foundational framework addressing multiple interconnected challenges in beam diagnostics. For \\textit{forward modeling}, a Conditional Variational Autoencoder (CVAE) encodes 15 unique projections of the 6D phase space into a latent representation, while a transformer predicts downstream latent states from upstream inputs. For \\textit{inverse problems}, we address two distinct challenges: (a) predicting upstream phase spaces from downstream observations by utilizing the same CVAE architecture with transformers trained on reversed temporal sequences along with aleatoric uncertainty quantification, and (b) estimating RF settings from the latent space of the trained LEM using a dedicated dense neural network that maps latent representations to RF parameters. For \\textit{tuning problems}, we leverage the trained LEM and RF estimator within a Bayesian optimization framework to determine optimal RF settings that minimize beam loss. This paper summarizes our recent efforts and demonstrates how this unified approach effectively addresses these traditionally separate challenges.",
    "authors": [
      "Mahindra Rautela",
      "Alexander Scheinker"
    ],
    "published": "2026-02-26T04:46:26Z",
    "updated": "2026-02-26T04:46:26Z",
    "categories": [
      "physics.acc-ph",
      "cs.LG"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.18429/JACoW-NAPAC2025-MOP002"
  },
  {
    "arxiv_id": "2602.22614v1",
    "url": "https://arxiv.org/abs/2602.22614v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22614v1.pdf",
    "title": "A Multi-Diagnostic Observational Framework for Magnetosonic Solitary Waves During Geomagnetic Storms in Solar Cycles 24 and 25 using Cluster II Mission",
    "abstract": "Solitary structures, commonly known as solitons, are a class of nonlinear plasma waves that are abundantly found in near-Earth plasmas and planetary magnetospheres. They are nonlinear, localized plasma waves that maintain their shape and velocity over time and distance. While their occurrence in various space plasma environments has been extensively reported, their observation during geomagnetic storms, large-scale disturbances driven by interactions between the solar wind and Earth's magnetosphere, remains limited. In this study, we present a comparative investigation of magnetosonic soliton signatures during geomagnetic storms associated with Solar Cycles 24 and 25. Using high-resolution in-situ magnetic field measurements from the Cluster II mission, we systematically examine the plasma conditions favorable for soliton generation and their evolution during storm-time dynamics. A comprehensive multi-diagnostic observational framework, incorporating several state-of-the-art analytical techniques, is developed to reliably detect and characterize magnetosonic solitons. The results demonstrate that solitary structures in both storms predominantly occur during the early storm intervals, prior to the main phase, suggesting that they may serve as potential precursor signatures of enhanced geomagnetic activity.",
    "authors": [
      "Murchana Khusroo",
      "Yimnasangla"
    ],
    "published": "2026-02-26T04:39:35Z",
    "updated": "2026-02-26T04:39:35Z",
    "categories": [
      "astro-ph.SR",
      "astro-ph.EP",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2602.22541v1",
    "url": "https://arxiv.org/abs/2602.22541v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22541v1.pdf",
    "title": "Optimizing Doppler laser cooling protocols for quantum sensing with 3D ion crystals in a Penning trap",
    "abstract": "Large, 3D trapped ion crystals offer improved sensitivity in quantum sensing protocols, and are expected to be implemented as platforms in near-future experiments. However, numerical techniques used to study the laser cooling of such crystals are inefficient as the number of ions, $N$, in the crystal increases. Here we develop a powerful numerical framework to simulate laser cooling of up to $10^5$ ions stored in a Penning trap. We apply this framework to characterize and optimize the cooling of ellipsoidal 3D crystals. We document new pathways to enhanced cooling based on the addition of an axial component to the potential energy-dominated $\\boldsymbol{E}\\times\\boldsymbol{B}$ modes. Furthermore, we observe greatly enhanced cooling of the perpendicular kinetic energy to below 1 mK in prolate ion crystals, enabling a simplified cooling beam setup for such crystals. We propose specific values of trap and laser beam parameters which lead to optimal cooling in a variety of examples. This work illustrates the feasibility of preparing large 3D crystals for high-sensitivity quantum science protocols, motivating their use in future experiments.",
    "authors": [
      "John Zaris",
      "Wes Johnson",
      "Athreya Shankar",
      "John J. Bollinger",
      "Allison L. Carter",
      "Daniel H. E. Dubin",
      "Scott E. Parker"
    ],
    "published": "2026-02-26T02:30:09Z",
    "updated": "2026-02-26T02:30:09Z",
    "categories": [
      "quant-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2511.13084v2",
    "url": "https://arxiv.org/abs/2511.13084v2",
    "pdf_url": "https://arxiv.org/pdf/2511.13084v2.pdf",
    "title": "Electron Recoil via Sample Momentum Transfer under Optical-Mode Excitation",
    "abstract": "The interaction between free electrons and optical modes underlies a variety of quantum and nanoscale light-matter phenomena, yet the associated momentum exchange with the sample largely remained overlooked. Here, we experimentally demonstrate the momentum transfer from free electrons to planar samples during optical mode excitation using momentum-resolved electron energy-loss spectroscopy. The momentum transfer to the sample modifies the apparent dispersion relation which is significant when the planner sample is tilted. Under specific conditions, the sample receives momentum opposite to the electron beam direction.",
    "authors": [
      "Akira Yasuhara",
      "Yamato Kirii",
      "Takumi Sannomiya"
    ],
    "published": "2025-11-17T07:33:20Z",
    "updated": "2026-02-26T01:48:51Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2602.20317v2",
    "url": "https://arxiv.org/abs/2602.20317v2",
    "pdf_url": "https://arxiv.org/pdf/2602.20317v2.pdf",
    "title": "TokEye: Fast Signal Extraction for Fluctuating Time Series via Offline Self-Supervised Learning From Fusion Diagnostics to Bioacoustics",
    "abstract": "Next-generation fusion facilities like ITER face a \"data deluge,\" generating petabytes of multi-diagnostic signals daily that challenge manual analysis. We present a \"signals-first\" self-supervised framework for the automated extraction of coherent and transient modes from high-noise time-frequency data across a variety of sensors. We also develop a general-purpose method and tool for extracting coherent, quasi-coherent, and transient modes for fluctuation measurements in tokamaks by employing non-linear optimal techniques in multichannel signal processing with a fast neural network surrogate on fast magnetics, electron cyclotron emission, CO2 interferometers, and beam emission spectroscopy measurements from DIII-D. Results are tested on data from DIII-D, TJ-II, and non-fusion spectrograms. With an inference latency of 0.5 seconds, this framework enables real-time mode identification and large-scale automated database generation for advanced plasma control. Repository is in https://github.com/PlasmaControl/TokEye.",
    "authors": [
      "Nathaniel Chen",
      "Kouroche Bouchiat",
      "Peter Steiner",
      "Andrew Rothstein",
      "David Smith",
      "Max Austin",
      "Mike van Zeeland",
      "Azarakhsh Jalalvand",
      "Egemen Kolemen"
    ],
    "published": "2026-02-23T20:03:10Z",
    "updated": "2026-02-26T01:13:38Z",
    "categories": [
      "eess.SP",
      "cs.AI",
      "physics.plasm-ph"
    ],
    "primary_category": "eess.SP"
  },
  {
    "arxiv_id": "2602.22477v1",
    "url": "https://arxiv.org/abs/2602.22477v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22477v1.pdf",
    "title": "Fused-Silica Activation Cherenkov Detector for Pulsed D--T Fusion Yields",
    "abstract": "We demonstrate a compact, non-toxic, low-cost neutron-yield diagnostic for pulsed D--T fusion systems using an undoped fused-silica (SiO$2$) rod as both activation target and Cherenkov radiator. D--T neutrons (14.1 MeV) activate $^{28}$Si and $^{16}$O to produce short-lived $^{28}$Al ($T{1/2}=134,\\mathrm{s}$) and $^{16}$N ($T_{1/2}=7.13,\\mathrm{s}$). The resulting $β^-$ particles exceed the Cherenkov threshold and generate UV--visible light detected by a fast photomultiplier tube. A SiO$_2$ rod of dimensions $6,\\mathrm{in}\\times1,\\mathrm{in}$ (length $\\times$ diameter) is optically coupled and read out with a CAEN DT5730 digitizer operating in list mode with digital pulse processing. The post-pulse count rate is fit using fixed $^{16}$N and $^{28}$Al half-lives together with background terms to infer neutron fluence. Testing at the ZEUS D--T Dense Plasma Focus established a reference calibration and agreement with a praseodymium-calibrated silver activation detector. Measurements near a D--D Dense Plasma Focus show no activation signal, confirming D--T selectivity. The diagnostic enables pulse-to-pulse yield measurements within minutes following a pulse and is being deployed on Helion Energy's seventh fusion prototype, Polaris.",
    "authors": [
      "N. Kaneshige",
      "S. Alawabdeh",
      "W. Hennig",
      "D. Cech",
      "M. Hua",
      "R. Grazioso"
    ],
    "published": "2026-02-25T23:33:32Z",
    "updated": "2026-02-25T23:33:32Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.23433v2",
    "url": "https://arxiv.org/abs/2512.23433v2",
    "pdf_url": "https://arxiv.org/pdf/2512.23433v2.pdf",
    "title": "Non-equilibrium classical recombination in the expanding ultracold plasmas",
    "abstract": "The efficiency of recombination is of crucial importance for the existence of ultracold plasmas (UCP), particularly, the ones formed in the magneto-optical traps. Unfortunately, the equilibrium thermodynamic treatment of the ionization-recombination processes is inappropriate for the evolving UCP clouds, while the straightforward kinetic simulation encounters the problem of huge difference in the spatial and temporal scales for free and bound motion of the electrons. As a result, only the \"virtual\" electron-ion pairs are usually reproduced in such modeling, and it is necessary to employ some heuristic criteria to identify them with the recombined atoms. It is the aim of this paper to present the first successful \"ab initio\" simulation of the non-equilibrium recombination in the evolving UCP plasmas. We employed a special algorithm, which is based on using the \"scalable\" reference frame, co-moving with the expanding substance. Then, the recombination events are identified by a series of sharp equidistant peaks in the kinetic and/or potential energies, which are caused by the captured electrons passing near the pericenters of their orbits; and this is confirmed by a detailed inspection of their trajectories. Thereby, we were able to trace the real - rather than \"virtual\" - electron-ion pairs, and the total efficiency of their formation was found to be about 20%, which is in agreement with the laboratory measurements.",
    "authors": [
      "Yurii V. Dumin",
      "Ludmila M. Svirskaya"
    ],
    "published": "2025-12-29T12:51:53Z",
    "updated": "2026-02-25T23:12:11Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.22464v1",
    "url": "https://arxiv.org/abs/2602.22464v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22464v1.pdf",
    "title": "The 2027-2034 Vision for Nuclear Physics in Canada, with an outlook to 2041",
    "abstract": "The Canadian subatomic physics community establishes its scientific, and thus funding, priorities through periodic Long-Range Plans (LRP). The community is now putting together a new LRP, which will be in effect from 2027 through 2034, with its scope extending through 2041. As part of this process, the Canadian Institute of Nuclear Physics (CINP) has put together a strategic report, following an extensive consultation process. The report describes the broad and ambitious research program undertaken by the Canadian nuclear physics research community, both onshore and abroad, touching on key questions regarding the origin, evolution, and structure of visible matter in the universe. This document provides a grid of different Canadian nuclear physics projects undertaken now and in the future, and their associated timelines. It concludes with specific recommendations for maximizing Canadian scientific output in nuclear physics.",
    "authors": [
      "Corina Andreoiu",
      "Svetlana Barkanova",
      "Gregory Christian",
      "Alexandros Gezerlis",
      "Garth Huber",
      "Jeffery W. Martin",
      "Ruben Sandapen"
    ],
    "published": "2026-02-25T22:52:49Z",
    "updated": "2026-02-25T22:52:49Z",
    "categories": [
      "nucl-ex",
      "astro-ph.SR",
      "hep-ex",
      "nucl-th",
      "physics.ins-det"
    ],
    "primary_category": "nucl-ex"
  },
  {
    "arxiv_id": "2509.02916v2",
    "url": "https://arxiv.org/abs/2509.02916v2",
    "pdf_url": "https://arxiv.org/pdf/2509.02916v2.pdf",
    "title": "Initial results of the TRIUMF ultracold advanced neutron source",
    "abstract": "We report the first results on ultracold neutron production from a new spallation-driven superfluid $^4$He (He-II) source at TRIUMF, which is being prepared for a new, precise measurement of the neutron electric dipole moment. A total of $(9.3 \\pm 0.8)\\times 10^{5}$ ultracold neutrons were observed at a proton beam current of \\SI{37}{\\uA}, when the target was irradiated for a period of \\SI{60}{\\s}. The results are in fair agreement with expectations based on a detailed simulation of neutron transport and ultracold neutron source cryogenics. There is some indication that the new source might not be as limited by the conduction of heat through the He-II as originally expected. The results indicate that the source is likely to make its ultimate production goals, once the liquid deuterium cold moderator system is completed, with the expectation that $5.7\\times 10^7$~UCNs would be detected in the same experiment with full liquid levels. This would, for example, correspond to delivery of $1.4\\times 10^6$~UCNs delivered to each of two nEDM measurement cells, and a statistical uncertainty of $1\\times 10^{-27}~e$cm on the neutron EDM in 280 days of running.",
    "authors": [
      "B. Algohi",
      "D. Anthony",
      "L. Barrón-Palos",
      "M. Bossé",
      "M. P. Bradley",
      "A. Brossard",
      "T. Bui",
      "J. Chak",
      "R. Chiba",
      "C. Davis",
      "R. de Vries",
      "K. Drury",
      "B. Franke",
      "D. Fujimoto",
      "R. Fujitani",
      "M. Gericke",
      "P. Giampa",
      "C. Gibson",
      "R. Golub",
      "K. Hatanaka",
      "T. Hepworth",
      "T. Higuchi",
      "G. Ichikawa",
      "I. Ide",
      "S. Imajo",
      "A. Jaison",
      "B. Jamieson",
      "M. Katotoka",
      "S. Kawasaki",
      "M. Kitaguchi",
      "W. Klassen",
      "E. Korkmaz",
      "E. Korobkina",
      "F. Kuchler",
      "M. Lavvaf",
      "T. Lindner",
      "N. Lo",
      "S. Longo",
      "K. W. Madison",
      "Y. Makida",
      "J. Malcolm",
      "J. Mammei",
      "R. Mammei",
      "Z. Mao",
      "C. Marshall",
      "J. W. Martin",
      "R. Matsumiya",
      "M. McCrea",
      "E. Miller",
      "M. Miller",
      "K. Mishima",
      "T. Mohammadi",
      "T. Momose",
      "M. Nalbandian",
      "T. Okamura",
      "S. Pankratz",
      "R. Patni",
      "R. Picker",
      "K. Qiao",
      "W. D. Ramsay",
      "W. Rathnakela",
      "T. Reimer",
      "D. Salazar",
      "J. Sato",
      "W. Schreyer",
      "T. Shima",
      "H. M. Shimizu",
      "S. Sidhu",
      "S. Stargardter",
      "R. Stutters",
      "P. Switzer",
      "I. Tanihata",
      "Tushar",
      "S. Vanbergen",
      "W. T. H. van Oers",
      "N. Yazdandoost",
      "Q. Ye",
      "A. Zahra",
      "M. Zhao"
    ],
    "published": "2025-09-03T01:00:39Z",
    "updated": "2026-02-25T22:00:34Z",
    "categories": [
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "nucl-ex"
  },
  {
    "arxiv_id": "2602.22370v1",
    "url": "https://arxiv.org/abs/2602.22370v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22370v1.pdf",
    "title": "The Effect of Magnetization on Electron Heating in Low-Density Ultracold Neutral Plasmas",
    "abstract": "Ultracold neutral plasmas provide a useful system for studying extreme parameter regimes plasma physics in an accessible laboratory setting. The parameter space of plasma physics can be characterized in part by coupling strength and degree of magnetization. The range of achievable strong coupling is determined in part by the lowest possible temperatures that can be achieved. This work examines the early-lifetime electron heating of moderately coupled, strongly magnetized plasmas. This heating is dominated by disorder-induced heating and heating due to Rydberg atom formation. By using experimentally informed simulations, it is found that disorder-induced heating has a large influence in electron temperature well into the plasma lifetime. Additionally, the dependence of the minimum achievable electron temperature on magnetization and initial electron energy is examined. In this work, we find electron temperatures as low as $0.52^{+.10}_{-.05}\\ \\mathrm{K}$ (for electron density, $n_{e}$, of $6.1 \\times 10^{12}\\ \\mathrm{m^{-3}}$), which determines the maximum coupling strength for the measured experimental conditions.",
    "authors": [
      "Ryan C. Baker",
      "Bridget O'Mara",
      "Jacob L. Roberts"
    ],
    "published": "2026-02-25T20:07:12Z",
    "updated": "2026-02-25T20:07:12Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.22177v1",
    "url": "https://arxiv.org/abs/2602.22177v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22177v1.pdf",
    "title": "Runaway electron generation in ITER mitigated disruptions with improved physics models",
    "abstract": "We assess runaway-electron (RE) generation in ITER disruptions mitigated by shattered pellet injection (SPI) using improved physics modelling in the 1D disruption simulation framework Dream. To this end, we extend Dream with four ITER-relevant physics models: (i) a reduced model for RE scrape- off associated with the vertical plasma motion, (ii) a semi-analytical plasmoid- drift model for material deposition, (iii) an adaptive hyper-resistive transport model to suppress unphysical thin-current channels during the current quench (CQ), and (iv) an updated Compton RE generation seed calculated for the new ITER tungsten first-wall design. We simulate full-current 15 MA L-mode (H26, non-nuclear) and H-mode (DTHmode24, nuclear) scenarios, and an intermediate- current 7.5 MA H-mode non-nuclear case, from realistic ITER inputs. Complete avoidance of a multi-MA RE beam is found to require a long pre-thermal quench (TQ) duration to thermalize the hot-tail electrons, high deuterium assimilation with limited neon, and a representative seed current comparable to a single RE in ITER. As previously found with lower fidelity setups [Vallhagen et al, Nucl. Fusion 64 (2024)], these conditions are met by staggered or low-Ne injections in H26, but are typically violated in DT H-mode when nuclear seeds are present. In addition to analyzing the effect of the new models, we investigate the role of the current spike associated with the TQ and importance of radial transport of runaways in the CQ. After incorporating these additional physical effects into a comprehensive disruption model and analyzing their impact, we present a representative ITER DT H-mode SPI scenario which provides a theoretically viable route to tolerable RE currents in ITER fusion power operation.",
    "authors": [
      "L. Votta",
      "F. J. Artola",
      "E. Nardon",
      "O. Vallhagen",
      "M. Hoppe"
    ],
    "published": "2026-02-25T18:25:29Z",
    "updated": "2026-02-25T18:25:29Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.22172v1",
    "url": "https://arxiv.org/abs/2602.22172v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22172v1.pdf",
    "title": "Effects of realistic laser intensity and phase distribution on high-charge laser wakefield acceleration",
    "abstract": "Laser wakefield acceleration (LWFA) can produce relativistic electron beams and various secondary particles in centimeter-long plasmas, making it a valuable particle source with important applications in many disciplines. In this work, we examine the effects of non-ideal transverse intensity and phase distribution of laser pulses on LWFA through both experimental measurements and particle-in-cell simulations. The complex transverse profile of the 75 TW laser pulses reduces the self-focused intensity in plasma compared with a transversely Gaussian laser. Furthermore, the sheath structure of the nonlinear plasma wake excited by realistic laser pulses is wider and more complicated than that of a Gaussian laser. These hinder the injection of the plasma electrons. As the laser pulse propagates through the plasma, its intensity profile gradually becomes elliptical and drives a plasma wake with a sharp sheath near the azimuths of the major axis, leading to an injection. When using a realistic laser profile in simulations, both the charge and energy of injected electrons closely match experimental results ($\\sim200$ pC of charge and $\\sim 200$ MeV peak energy), whereas the Gaussian laser simulations produce much higher charge ($\\sim500$ pC). Our findings reveal the difference in injection dynamics between LWFA driven by non-ideal laser pulses and those driven by Gaussian pulses, and are useful for applications of LWFA which demand high-charge electron beams.",
    "authors": [
      "Yuhui Xia",
      "Zhenan Wang",
      "Ziyao Tang",
      "Jianghao Hu",
      "Qianyi Ma",
      "Yuekai Chen",
      "Letian Liu",
      "Zhiyan Yang",
      "Hui Zhang",
      "Chenxu Wang",
      "Haoyang Lan",
      "Di Wu",
      "Xiuhong Yang",
      "Yixing Geng",
      "Yanying Zhao",
      "Xueqin Yan",
      "Xinlu Xu"
    ],
    "published": "2026-02-25T18:18:18Z",
    "updated": "2026-02-25T18:18:18Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.22165v1",
    "url": "https://arxiv.org/abs/2602.22165v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22165v1.pdf",
    "title": "Whistler-Alfvén turbulence in a non-neutral ultrarelativistic pair plasma",
    "abstract": "The large-scale dynamics of most conventional space and astrophysical plasmas are predominantly governed by Alfvén modes, which are low-frequency magnetohydrodynamic modes existing in magnetized media. At scales smaller than the ion gyroscale or frequencies exceeding the ion cyclotron frequency, the Alfvén modes transform into kinetic-Alfvén or whistler modes that significantly contribute to plasma dynamics. However, this scenario reverses in non-neutral pair plasmas, such as those found in the magnetospheres of pulsars and magnetars, around rotating black holes and in their relativistic jets, as well as in certain laboratory plasmas. In these systems, the large-scale dynamics is governed by hybrid whistler-Alfvén modes, which transform into pure Alfvén modes at smaller scales. We derive the nonlinear equations that describe the dynamics of whistler-Alfvén modes in ultrarelativistic non-neutral magnetically dominated pair plasma and discuss the spectrum of turbulence governed by these equations.",
    "authors": [
      "Stanislav Boldyrev",
      "Mikhail Medvedev"
    ],
    "published": "2026-02-25T18:14:29Z",
    "updated": "2026-02-25T18:14:29Z",
    "categories": [
      "astro-ph.HE",
      "astro-ph.GA",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE",
    "doi": "10.3847/1538-4357/ae30e1"
  },
  {
    "arxiv_id": "2602.22064v1",
    "url": "https://arxiv.org/abs/2602.22064v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22064v1.pdf",
    "title": "Effects of Screening and Pressure Ionization on the Electron Broadening of Spectral Lines in Dense Plasmas",
    "abstract": "Collisions between electrons and radiating atoms broaden spectral absorption and emission lines in dense plasmas. High densities also introduce screening and pressure ionization effects that distort the wavefunctions of both bound and free electrons. In order to study how dense plasma effects influence the electron broadening of spectral lines, this paper incorporates electron wavefunctions from an average-atom (AA) model to calculate the line width of the B III $2p-2s$ transition at $T = 10$ eV for mass densities ranging from $ρ=10^{-4}-0.4$ g/cc. The calculation method uses the impact approximation, allowing the line width to be written in terms of electron-collision cross sections and an interference term. Compared to an otherwise identical calculation that uses Coulomb free wavefunctions, the AA method is found to modify both the cross sections and the resulting line width at sufficiently high density by introducing screening and pressure ionized bound states. Screening lowers the cross sections at low energies and near electron excitation thresholds, while pressure ionized bound states introduce resonances into the continuum. Thus, as the density increases, the relative line width between the AA and Coulomb calculations follows a general decrease because of screening, with sharp increases at various intervals due to pressure ionization. The AA results are also compared with a common approach to introduce screening through the interaction potential and reduced models that use the Bethe formula for the inelastic electron-collision cross sections.",
    "authors": [
      "Julian P. Kinney",
      "Stephanie B. Hansen",
      "Thomas A. Gomez",
      "Scott D. Baalrud"
    ],
    "published": "2026-02-25T16:10:41Z",
    "updated": "2026-02-25T16:10:41Z",
    "categories": [
      "physics.plasm-ph",
      "physics.atom-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.21990v1",
    "url": "https://arxiv.org/abs/2602.21990v1",
    "pdf_url": "https://arxiv.org/pdf/2602.21990v1.pdf",
    "title": "Proof-of-principle experiment of a novel beam extraction over millions of turns using stable resonance islands and bent crystal",
    "abstract": "A recent study [1] has introduced an advanced method aimed at extracting from a circular particle accelerator over millions of turns using stable islands and a bent crystal. This technique leverages the strength of non-linear beam dynamics along with adiabatic trapping and transport within stable islands, in combination with a bent silicon crystal, to provide an efficient extraction of hadron beams over millions of turns. The positive and encouraging results of the comprehensive numerical simulations were validated through a successful proof-of-principle experiment at the CERN Super Proton Synchrotron, which demonstrated the feasibility of the technique. This paper presents a detailed discussion and analysis of the experimental results.",
    "authors": [
      "D. E. Veres",
      "P. Arrutia",
      "S. Cettour Cave",
      "B. H. F. Lindström",
      "M. Giovannozzi",
      "L. E. Pauwels",
      "F. F. Van der Veken",
      "F. M. Velotti",
      "G. Franchetti"
    ],
    "published": "2026-02-25T15:10:36Z",
    "updated": "2026-02-25T15:10:36Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.21710v1",
    "url": "https://arxiv.org/abs/2602.21710v1",
    "pdf_url": "https://arxiv.org/pdf/2602.21710v1.pdf",
    "title": "Out-of-time-ordered correlators for turbulent fields: a quantum-classical correspondence",
    "abstract": "An extended formulation of out-of-time-ordered correlators (OTOCs), which quantify noncommutative operator growth and information scrambling in quantum many-body systems, is developed for turbulence dynamics as a representative of non-canonical Hamiltonian systems. Based on the Wigner-Weyl transform and the Moyal bracket formalism, the semiclassical limit of OTOC for turbulent plasmas governed by the Hasegawa-Mima equation is derived as an ensemble-averaged squared Lie-Poisson bracket between two chosen functionals of the turbulent fields. The classical-limit OTOC provides a quantitative measure of how a variational perturbation applied to one functional propagates across scales in the turbulent dynamics and how it affects another functional at a later time, thereby capturing scale-dependent or field-dependent transfer processes. In a quasilinear approximation with a strong zonal flow, we derive an inverse-square decay of the OTOC with the time lag, indicating an algebraic suppression of the zonal-mode response to perturbations of the non-zonal fields. This behavior is attributed to zonal-flow shearing, which rapidly scrambles the non-zonal perturbation toward higher wavenumbers, and consequently reduces the low-wavenumber non-zonal content that can feed back onto large-scale zonal modes.",
    "authors": [
      "Motoki Nakata"
    ],
    "published": "2026-02-25T09:16:31Z",
    "updated": "2026-02-25T09:16:31Z",
    "categories": [
      "physics.plasm-ph",
      "physics.flu-dyn"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.21694v1",
    "url": "https://arxiv.org/abs/2602.21694v1",
    "pdf_url": "https://arxiv.org/pdf/2602.21694v1.pdf",
    "title": "Towards Low-Energy Electron High-Resolution Spectroscopy with Transition-Edge Sensors",
    "abstract": "We present a study of the energy resolution of transition-edge sensors (TESs) for the detection of electrons in the 100 eV kinetic energy range. The TES is a Ti-Au bilayer with an active area of $(60 \\times 60)$ $μ\\text{m}^2$ and a critical temperature of $\\sim$ 80 mK. The electron source is based on vertically-aligned multiwall carbon nanotubes located inside the cryostat, with electrons generated via field emission. For electrons in the (92 - 99) eV kinetic energy range, we obtain a Gaussian energy resolution for fully-absorbed electrons of (0.479 $\\pm$ 0.041 $\\pm$ 0.055) eV. When considering the full-width at half-maximum of the peak, the corresponding resolution is of (1.44 $\\pm$ 0.17 $\\pm$ 0.27) eV. The former represents an improvement of (46 - 60)% with respect to previous results, and is mainly attributed to the reduction in the TES active area. The latter is instead an improvement of over a factor of 20, and is mainly due to the reduction in the emitting area of the electron source, which significantly suppresses electron back-scattering in proximity of the TES. These results represent a major milestone toward high-precision spectroscopy on low-energy electrons, which is a key objective for the PTOLEMY experiment.",
    "authors": [
      "R. Ammendola",
      "A. Apponi",
      "G. Benato",
      "M. G. Betti",
      "R. Biondi",
      "P. Bos",
      "M. Cadeddu",
      "A. Casale",
      "O. Castellano",
      "G. Cavoto",
      "L. Cecchini",
      "E. Celasco",
      "M. Chirico",
      "W. Chung",
      "A. G. Cocco",
      "A. P. Colijn",
      "B. Corcione",
      "N. D'Ambrosio",
      "M. D'Incecco",
      "G. De Bellis",
      "M. De Deo",
      "N. de Groot",
      "A. Esposito",
      "M. Farino",
      "S. Farinon",
      "A. D. Ferella",
      "L. Ferro",
      "L. Ficcadenti",
      "G. Galbato Muscio",
      "S. Gariazzo",
      "H. Garrone",
      "F. Gatti",
      "F. Malnati",
      "G. Mangano",
      "L. E. Marcucci",
      "C. Mariani",
      "J. Mead",
      "G. Menichetti",
      "M. Messina",
      "E. Monticone",
      "M. Naafs",
      "S. Nagorny",
      "V. Narcisi",
      "F. Pandolfi",
      "R. Pavarani",
      "C. Pepe",
      "C. Perez de los Heros",
      "O. Pisanti",
      "F. M. Pofi",
      "A. D. Polosa",
      "I. Rago",
      "M. Rajteri",
      "S. Ritarossi",
      "N. Rossi",
      "A. Ruocco",
      "G. Salina",
      "A. Santucci",
      "M. Sestu",
      "A. Tan",
      "V. Tozzini",
      "C. G. Tully",
      "I. van Rens",
      "F. Virzi",
      "G. Visser",
      "M. Viviani"
    ],
    "published": "2026-02-25T08:58:11Z",
    "updated": "2026-02-25T08:58:11Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.22272v1",
    "url": "https://arxiv.org/abs/2602.22272v1",
    "pdf_url": "https://arxiv.org/pdf/2602.22272v1.pdf",
    "title": "Fluctuating polytropic processes, turbulence, and heating",
    "abstract": "This paper explores the thermodynamics of fluctuating polytropic processes and their connection to turbulence. It is shown that random fluctuations of polytropic processes produce a nonzero overall heating of a particle system, e.g., solar wind plasma flowing out through the heliosphere; while any nonturbulent heating can be thermodynamically described by typical nonfluctuating polytropic processes, turbulent heating can be thermodynamically described through fluctuating polytropic processes. First, we derive the expression of the overall process and find that polytropic fluctuations lead to heat entering the system even if the respective nonfluctuating process is adiabatic. The temperature of the solar wind plasma protons decreases with heliospheric distance less than the adiabatic cooling, again, similar to when heating enters the system; this subadiabatic cooling is proportional to the variance of the fluctuations. We derive the heliospheric radial profiles of the thermodynamic expressions of the polytropic index, temperature, and heating rates. Then, we show that the analytical profiles of heating of fluctuating polytropic processes and of turbulent heating are identical, suggesting that turbulence heats plasma particle populations by fluctuating their polytropic processes. We apply the thermodynamics of fluctuating polytropic processes to the energy transfer from pickup ions (PUIs) to solar wind plasma protons, and derive the analytical expressions of PUI turbulent and nonturbulent heating rates, which are well fitted to the respective observations. Finally, we apply the thermodynamic model to the radial profile of PUI energy transfer to the solar wind plasma protons, where we derive the portion of PUI turbulent vs. nonturbulent heating rates.",
    "authors": [
      "G. Livadiotis",
      "D. J. McComas"
    ],
    "published": "2026-02-25T08:48:12Z",
    "updated": "2026-02-25T08:48:12Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2406.01293v2",
    "url": "https://arxiv.org/abs/2406.01293v2",
    "pdf_url": "https://arxiv.org/pdf/2406.01293v2.pdf",
    "title": "A time-to-digital converter with steady calibration through single-photon detection",
    "abstract": "Time-to-Digital Converters (TDCs) are a crucial tool in a wide array of fields, in particular for quantum communication, where time taggers performance can severely affect the quality of the entire application. Nowadays, FPGA-based TDCs present a viable alternative to ASIC ones, once the non-linear behavior due to the intrinsic nature of the device is properly mitigated. To compensate for said nonlinearities, a calibration procedure is required, which should be maintained throughout its runtime. Here we present the design and the demonstration of a TDC that is FPGA-based showing a residual FWHM jitter of 27 ps, that is scalable for multichannel operation. The target application in Quantum Key Distribution (QKD) is discussed with a calibration method based on the exploitation of single-photon detection that does not require stopping the data acquisition or using any estimation methods, thus increasing accuracy and removing data loss. The calibration was tested in a relevant environment, investigating the behavior of the device between 5 °C and 80 °C. Moreover, our design is capable of continuously streaming up to 12 Mevents/s for up to ~1 week without the TDC overflowing making it ready for a real-life scenario deployment.",
    "authors": [
      "Matías Rubén Bolaños",
      "Daniele Vogrig",
      "Paolo Villoresi",
      "Giuseppe Vallone",
      "Andrea Stanco"
    ],
    "published": "2024-06-03T13:03:59Z",
    "updated": "2026-02-25T08:40:17Z",
    "categories": [
      "eess.SP",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "eess.SP",
    "doi": "10.1109/TIM.2025.3601244"
  },
  {
    "arxiv_id": "2602.21571v1",
    "url": "https://arxiv.org/abs/2602.21571v1",
    "pdf_url": "https://arxiv.org/pdf/2602.21571v1.pdf",
    "title": "Collisional-radiative data for tokamak disruption mitigation modeling",
    "abstract": "Effective tokamak disruption mitigation is crucial for ensuring the safety and integrity of fusion power reactors. Accurate collisional-radiative (CR) modeling of a radiative plasma is a critical component in predictive disruption mitigation design. In this paper, we focus on quasi-steady-state CR modeling applicable to the current quench phase of a tokamak disruption. We employ the ATOMIC collisional-radiative code from the Los Alamos suite and the newly developed Fusion Collisional-Radiative (FCR) code to model the atomic processes, providing high-fidelity data for radiative power loss, as well as average and effective charge states for hydrogen, helium, neon, and argon plasma species over a wide range of tokamak-relevant electron temperatures and electron densities. Fine-structure-resolved CR models are used for hydrogen and helium plasma species, while configuration-average CR models are implemented for neon and argon plasma species. The calculated values are compared with the superconfiguration CR model (FLYCHK) and the commonly used coronal equilibrium approximation to demonstrate the advantages and limitations of each model. To facilitate coupling of high-fidelity CR data to plasma simulation models, we represent the ATOMIC/FCR results over the relevant plasma parameter range using a smooth tensor product B-spline surface in electron temperature and electron density. This approach yields compact coefficient tables that can be evaluated efficiently while preserving spline smoothness across the domain. These data were previously used to examine ways to minimize runaway electrons in a tokamak current quench, and they are now made available in easy-to-use forms for community use and benchmarking.",
    "authors": [
      "Prashant Sharma",
      "Christopher J. Fontes",
      "Dmitry V. Fursa",
      "Igor Bray",
      "Mark Zammit",
      "James Colgan",
      "Hyun-Kyung Chung",
      "Nathan Garland",
      "Xian-Zhu Tang"
    ],
    "published": "2026-02-25T04:49:33Z",
    "updated": "2026-02-25T04:49:33Z",
    "categories": [
      "physics.plasm-ph",
      "physics.atom-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.21151v2",
    "url": "https://arxiv.org/abs/2602.21151v2",
    "pdf_url": "https://arxiv.org/pdf/2602.21151v2.pdf",
    "title": "A coherent structure transport model for scrape-off layer turbulence",
    "abstract": "Understanding the locality of high-temperature plasma energy deposition on material surfaces in fusion reactors is critical for design. Here, we utilize the Gyrokinetic ElectroMagnetic turbulence including X-points (GEMX) simulation, together with SOLPS-ITER solutions for the background equilibrium electric field including drifts, to model the heat flux at the divertor plate and characterize the heat load width using realistic X-point geometry. We use a theory-based blobby transport model called the \"Coherent Structure Transport\" (CST) model to include the effect of plasma transport in the edge scrape-off layer. The CST model is extremely fast and can be used to quickly analyze any SOLPS-ITER solution. SOLPS-ITER provides the steady state, or equilibrium on which we superimpose blobby turbulence characterized by blob size, amplitude and frequency. We obtain the $1/B_p$ scaling of the heat load exponential decay width $λ_q$, in agreement with the Eich empirical scaling and with the Goldston heuristic theory. When including blobby turbulence in combination with the SOLPS-ITER electric field, we find a secondary peak in the heat flux radial profile, outwardly displaced from the strike point radius, with a relative amplitude that increases with the initial blob density. We describe the CST model in detail and provide initial investigations of the scaling of $λ_q$ and the secondary heat flux peak with blob size and amplitude.",
    "authors": [
      "Zhichen Feng",
      "James Myra",
      "Junyi Cheng",
      "Calder Haubrich",
      "Yang Chen",
      "Xinxing Ma",
      "Darin R. Ernst",
      "Scott Parker"
    ],
    "published": "2026-02-24T17:53:11Z",
    "updated": "2026-02-25T02:52:31Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.21489v1",
    "url": "https://arxiv.org/abs/2602.21489v1",
    "pdf_url": "https://arxiv.org/pdf/2602.21489v1.pdf",
    "title": "A novel perspective on crystal electromagnetic calorimeter design for the CEPC",
    "abstract": "Crystal electromagnetic calorimeters (ECALs) are essential for high-precision measurements of electrons and photons in particle physics experiments. However, the conventional design, in which long crystal bars point radially toward the interaction region and lack longitudinal segmentation, is incompatible with the three-dimensional shower imaging required by Particle Flow Approach (PFA). We propose a novel perspective on crystal ECAL design to address this limitation. The key innovation is a geometric reconfiguration in which crystal bars are oriented to face the interaction region and arranged orthogonally in adjacent longitudinal layers. This layout achieves fine spatial segmentation of energy deposits by correlating measurements of orthogonal crystal bars. An interleaved structure of regular and inverted trapezoidal modules is incorporated to maximize structural uniformity and detector hermeticity. This design is engineered to preserve the excellent intrinsic energy resolution of crystal ECALs while simultaneously providing the detailed three-dimensional shower imaging essential for PFA. Simulation results confirm the feasibility of achieving excellent energy resolution of $1.14\\%/\\sqrt{E} \\oplus 0.44\\%$. Consequently, the proposed design repositions crystal ECAL as a foundational component for PFA-oriented detector systems at facilities such as the Circular Electron Positron Collider (CEPC), offering a new technical pathway to advance the physics goals of future colliders.",
    "authors": [
      "Weizheng Song",
      "Yang Zhang",
      "Shengsen Sun",
      "Fangyi Guo",
      "Yuanzhan Wang",
      "Linghui Wu",
      "Jie Guo",
      "Shaojing Hou",
      "Yong Liu",
      "Quan Ji",
      "Jinfan Chang",
      "Yifang Wang"
    ],
    "published": "2026-02-25T01:39:57Z",
    "updated": "2026-02-25T01:39:57Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.21458v1",
    "url": "https://arxiv.org/abs/2602.21458v1",
    "pdf_url": "https://arxiv.org/pdf/2602.21458v1.pdf",
    "title": "Precision measurements of 2-3 oscillation parameters in the next-generation long-baseline experiments",
    "abstract": "Over the past few decades, data from leading neutrino experiments have firmly established neutrino oscillation, implying non-zero neutrino masses and leptonic mixing and thereby providing confirmed evidence of physics beyond the Standard Model. On the backdrop of the precision era of neutrino oscillation, this thesis underscores its relevance by demonstrating the physics reach of the forthcoming long-baseline experiments -- Deep Underground Neutrino Experiment (DUNE) and Hyper-Kamiokande (Hyper-K) -- to establish non-maximal $θ_{23}$, resolve the correct $θ_{23}$ octant, and improve the precision on $θ_{23}$ and $Δm^2_{31}$ by efficiently breaking parameter degeneracies. This is enabled by DUNE's high-resolution LArTPC detector and its wide-band beam, achieving sensitivity at a high confidence level compared to the global fits of world neutrino data. The combined analysis of DUNE and Hyper-K not only significantly enhances sensitivity to these phenomenological studies but also demonstrates their capabilities at lower exposures when operated together, relative to their nominal individual exposures. In addition, we investigate the impact of flavor-dependent long-range interactions arising from anomaly-free U(1)' extensions of the Standard Model, showing that although subdominant long-range interactions can substantially influence the sensitivity and precision of oscillation parameter measurements, the complementary strengths of DUNE and Hyper-K mitigate these challenges to a large extent.",
    "authors": [
      "Ritam Kundu"
    ],
    "published": "2026-02-25T00:22:48Z",
    "updated": "2026-02-25T00:22:48Z",
    "categories": [
      "hep-ph",
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2602.21422v1",
    "url": "https://arxiv.org/abs/2602.21422v1",
    "pdf_url": "https://arxiv.org/pdf/2602.21422v1.pdf",
    "title": "Unstable magnetic reconnection self-generates turbulence",
    "abstract": "Magnetic reconnection and turbulence are deeply intertwined in magnetohydrodynamic flows, yet how reconnection self-generates turbulence remains unclear. Using an ensemble of high-resolution three-dimensional direct numerical simulations of an unstable magnetised jet with an initially weak mean field, we demonstrate a self-sustained transition from laminar reconnection to fully developed turbulence in the absence of external forcing. We show that a three-dimensional current-sheet instability triggers stochastic reconnection, leading to persistent turbulent energy injection. Energy-budget analysis reveals that the coupling between the turbulent electromotive force and the magnetic mean shear dominates turbulent production, with magnetic fluctuations subsequently transferring energy to the kinetic field through a nonlinear cascade.",
    "authors": [
      "Nick Williams",
      "Alessandro De Rosis",
      "Alex Skillen"
    ],
    "published": "2026-02-24T22:49:36Z",
    "updated": "2026-02-24T22:49:36Z",
    "categories": [
      "physics.plasm-ph",
      "physics.flu-dyn"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.21375v1",
    "url": "https://arxiv.org/abs/2602.21375v1",
    "pdf_url": "https://arxiv.org/pdf/2602.21375v1.pdf",
    "title": "Passive freeze-out of the Richtmyer-Meshkov instability",
    "abstract": "The Richtmyer-Meshkov instability (RMI) poses a major challenge in inertial confinement fusion (ICF) due to its role in mixing and performance degradation. We report the first experimental observation of passive freeze-out of RMI in a low-pressure surrogate regime; an instability stagnation effect induced without modifying the driving pressure pulse or the target surface geometry. Using additively manufactured sub-surface voids in a sinusoidal target, we convert a single shock into a sequence of weaker shocks that suppress instability growth upstream of the surface by over 70%. High-speed X-ray imaging and hydrodynamic simulations suggest that this suppression arises primarily from temporal shaping, with lesser contributions from spatial curvature and shock weakening. Our results demonstrate a driver-independent pathway for controlling shock-driven hydrodynamic instabilities relevant to ICF and other high energy density systems.",
    "authors": [
      "J. Strucka",
      "D. M. Sterbentz",
      "B. Lukic",
      "K. Mughal",
      "Y. Yao",
      "K. Marrow",
      "W. J. Schill",
      "C. F. Jekel",
      "D. A. White",
      "N. Asmedianov",
      "R. Grikshtas",
      "O. Belozerov",
      "S. Efimov",
      "J. Skidmore",
      "A. Rack",
      "Ya. E. Krasik",
      "J. L. Belof",
      "J. P. Chittenden",
      "S. N. Bland"
    ],
    "published": "2026-02-24T21:14:20Z",
    "updated": "2026-02-24T21:14:20Z",
    "categories": [
      "physics.plasm-ph",
      "physics.flu-dyn"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.05977v2",
    "url": "https://arxiv.org/abs/2601.05977v2",
    "pdf_url": "https://arxiv.org/pdf/2601.05977v2.pdf",
    "title": "Comment on Nuclear Fusion 66, 016012 (2026) and arXiv:2508.03561 by Richard Fitzpatrick, A Simple Model of Current Ramp-Up and Ramp-Down in Tokamaks",
    "abstract": "The article Nuclear Fusion \\textbf{66}, 016012 (2026) by Richard Fitzpatrick is based on fundamental errors in the physics of the poloidal magnetic flux in tokamaks. His paper was inspired by an article that I posted on arXiv in various versions, $\\big<$arxiv.org/abs/2507.05456$\\big>$. The September 9, 2025 version was submitted to the Physics of Plasmas, which flatly rejected the article. Before I can resubmit, the Physics of Plasmas stated that the issues with the Fitzpatrick article must be explained. Not only did Fitzpatrick make numerous fundamental errors in science, he totally misrepresented my views as clearly stated in my article and even more explicitly in email exchanges, called ``private communication\" in his paper.",
    "authors": [
      "Allen H Boozer"
    ],
    "published": "2026-01-09T17:53:04Z",
    "updated": "2026-02-24T19:23:18Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.21303v1",
    "url": "https://arxiv.org/abs/2602.21303v1",
    "pdf_url": "https://arxiv.org/pdf/2602.21303v1.pdf",
    "title": "Beam tube boundary effects in stray light modeling of long Fabry-Perot arm cavities for third-generation gravitational-wave detectors",
    "abstract": "Next-generation gravitational-wave detectors such as Cosmic Explorer and the Einstein Telescope will operate 10-40 km Fabry-Perot arm cavities inside vacuum beam tubes. FFT-based paraxial tools treat propagation in free space and therefore do not explicitly enforce beam tube boundary conditions. We introduce a waveguide-like mode description of the optical field that incorporates an imposed beam tube boundary condition and enables an independent benchmark of free-space FFT tools We derive the associated modal-mixing matrices for mirrors and baffles, including a closed-form series for axisymmetric circular apertures. We quantify the strain-equivalent couplings from baffle miscentering and from a localized near-wall tube defect, and show that they are suppressed as baffle density increases. In the relevant regime of densely baffled cavities and small perturbations, beam tube boundary effects are subdominant, which supports the continued use of FFT-based codes to guide the design of 3G detectors.",
    "authors": [
      "M. Andrés-Carcasona",
      "M. Evans"
    ],
    "published": "2026-02-24T19:14:01Z",
    "updated": "2026-02-24T19:14:01Z",
    "categories": [
      "gr-qc",
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "gr-qc"
  },
  {
    "arxiv_id": "2602.21290v1",
    "url": "https://arxiv.org/abs/2602.21290v1",
    "pdf_url": "https://arxiv.org/pdf/2602.21290v1.pdf",
    "title": "Global Magnetohydrodynamic Simulations of Monster Shocks in Neutron Star Magnetospheres",
    "abstract": "Waves launched from the neutron star surface or inner magnetosphere propagate through the magnetosphere as small perturbations, but can grow relative to the background magnetic field and steepen into ``monster shocks'' -- ultra-relativistic magnetized shocks which can power high-energy emission from magnetars, neutron star mergers and collapse. They occur in magnetically dominated plasma and are described by relativistic magnetohydrodynamics (MHD). We present global relativistic MHD simulations of monster shocks in unperturbed and perturbed (``wrinkled'') backgrounds with a global dipolar geometry. Our simulations confirm analytical predictions for equatorial shocks and provide new insight into the behavior of oblique shocks off the equator. Simulations where the shock is formed through Alfvén mode to fast mode conversion are also presented, demonstrating the generic nature of the monster shock mechanism. We explore how the presence of additional modes in the magnetosphere modifies the shock behavior. Modes of comparable amplitude can fragment the shock front, substantially reduce the magnetization, produce localized enhancements in the Lorentz factor relative to an unperturbed dipole background, and intermittently generate additional shocks along a line of sight.",
    "authors": [
      "Michael P. Grehan",
      "Bart Ripperda",
      "Andrei M. Beloborodov",
      "Christopher Thompson",
      "Elias R. Most"
    ],
    "published": "2026-02-24T19:00:04Z",
    "updated": "2026-02-24T19:00:04Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2602.21177v1",
    "url": "https://arxiv.org/abs/2602.21177v1",
    "pdf_url": "https://arxiv.org/pdf/2602.21177v1.pdf",
    "title": "Low-Energy Radon Backgrounds from Electrode Grids in Dual-Phase Xenon TPCs",
    "abstract": "The dual-phase xenon time projection chamber (TPC) is a powerful technology to detect rare interactions such as scatters of dark matter particles on nuclei. In particular, the built-in gain of ionization signals in a dual-phase TPC makes it sensitive to events in the few-electron regime, as expected from low-mass dark matter interactions. The pursuit of this low-energy sensitivity through ionization-only signal detection has so far been hindered by excessive electron backgrounds observed across experiments. Much of this background is attributed to the plate-out of $^{222}$Rn decay chain isotopes on the high voltage electrode grid surfaces that span the full cross section of the TPC. This work presents a first-principle model constructed for this background, the predictions of which are consistent with data from the LZ and LUX experiments. We then discuss mitigation strategies of this background in future dual-phase TPCs and the possibility of applying this grid background model to ionization-only dark matter searches.",
    "authors": [
      "D. S. Akerib",
      "A. K. Al Musalhi",
      "F. Alder",
      "B. J. Almquist",
      "S. Alsum",
      "C. S. Amarasinghe",
      "A. Ames",
      "T. J. Anderson",
      "N. Angelides",
      "H. M. Araújo",
      "J. E. Armstrong",
      "M. Arthurs",
      "X. Bai",
      "A. Baker",
      "J. Balajthy",
      "S. Balashov",
      "J. Bang",
      "J. W. Bargemann",
      "E. E. Barillier",
      "A. Baxter",
      "K. Beattie",
      "T. Benson",
      "E. P. Bernard",
      "A. Bernstein",
      "A. Bhatti",
      "T. P. Biesiadzinski",
      "H. J. Birch",
      "E. Bishop",
      "G. M. Blockinger",
      "E. M. Boulton",
      "B. Boxer",
      "C. A. J. Brew",
      "P. Brás",
      "S. Burdin",
      "D. Byram",
      "M. C. Carmona-Benitez",
      "M. Carter",
      "C. Chan",
      "A. Chawla",
      "H. Chen",
      "Y. T. Chin",
      "N. I. Chott",
      "S. Contreras",
      "M. V. Converse",
      "R. Coronel",
      "A. Cottle",
      "G. Cox",
      "D. Curran",
      "J. E. Cutter",
      "C. E. Dahl",
      "I. Darlington",
      "S. Dave",
      "A. David",
      "J. Delgaudio",
      "S. Dey",
      "L. de Viveiros",
      "L. Di Felice",
      "C. Ding",
      "J. E. Y. Dobson",
      "E. Druszkiewicz",
      "S. Dubey",
      "C. L. Dunbar",
      "S. R. Eriksen",
      "A. Fan",
      "N. M. Fearon",
      "N. Fieldhouse",
      "S. Fiorucci",
      "H. Flaecher",
      "E. D. Fraser",
      "T. M. A. Fruth",
      "P. W. Gaemers",
      "R. J. Gaitskell",
      "A. Geffre",
      "J. Genovesi",
      "C. Ghag",
      "J. Ghamsari",
      "A. Ghosh",
      "S. Ghosh",
      "R. Gibbons",
      "M. G. D. Gilchriese",
      "S. Gokhale",
      "J. Green",
      "M. G. D. van der Grinten",
      "C. Gwilliam",
      "J. J. Haiston",
      "C. R. Hall",
      "T. Hall",
      "R. H Hampp",
      "E. Hartigan-O'Connor",
      "S. J. Haselschwardt",
      "M. A. Hernandez",
      "S. A. Hertel",
      "D. P. Hogan",
      "G. J. Homenides",
      "M. Horn",
      "D. Q. Huang",
      "D. Hunt",
      "C. M. Ignarra",
      "R. G. Jacobsen",
      "E. Jacquet",
      "O. Jahangir",
      "R. S. James",
      "K. Jenkins",
      "W. Ji",
      "A. C. Kaboth",
      "A. C. Kamaha",
      "K. Kamdin",
      "M. K. Kannichankandy",
      "K. Kazkaz",
      "D. Khaitan",
      "A. Khazov",
      "J. Kim",
      "Y. D. Kim",
      "J. Kingston",
      "D. Kodroff",
      "E. V. Korolkova",
      "H. Kraus",
      "S. Kravitz",
      "L. Kreczko",
      "V. A. Kudryavtsev",
      "C. Lawes",
      "E. Leason",
      "D. S. Leonard",
      "K. T. Lesko",
      "C. Levy",
      "J. Liao",
      "J. Lin",
      "A. Lindote",
      "R. Linehan",
      "W. H. Lippincott",
      "J. Long",
      "M. I. Lopes",
      "W. Lorenzon",
      "C. Lu",
      "S. Luitz",
      "W. Ma",
      "V. Mahajan",
      "P. A. Majewski",
      "A. Manalaysay",
      "R. L. Mannino",
      "N. Marangou",
      "R. J. Matheson",
      "C. Maupin",
      "M. E. McCarthy",
      "G. McDowell",
      "D. N. McKinsey",
      "J. McLaughlin",
      "J. B. McLaughlin",
      "R. McMonigle",
      "D. -M. Mei",
      "B. Mitra",
      "E. Mizrachi",
      "M. E. Monzani",
      "K. Morå",
      "J. A. Morad",
      "E. Morrison",
      "B. J. Mount",
      "M. Murdy",
      "A. St. J. Murphy",
      "A. Naylor",
      "C. Nehrkorn",
      "H. N. Nelson",
      "F. Neves",
      "A. Nguyen",
      "A. Nilima",
      "C. L. O'Brien",
      "F. H. O'Shea",
      "I. Olcina",
      "K. C. Oliver-Mallory",
      "J. Orpwood",
      "K. Y Oyulmaz",
      "K. J. Palladino",
      "N. J. Pannifer",
      "N. Parveen",
      "S. J. Patton",
      "B. Penning",
      "G. Pereira",
      "E. Perry",
      "T. Pershing",
      "A. Piepke",
      "S. S. Poudel",
      "Y. Qie",
      "J. Reichenbacher",
      "C. A. Rhyne",
      "Q. Riffard",
      "G. R. C. Rischbieter",
      "E. Ritchey",
      "H. S. Riyat",
      "R. Rosero",
      "P. Rossiter",
      "N. J. Rowe",
      "T. Rushton",
      "D. Rynders",
      "S. Saltão",
      "D. Santone",
      "A. B. M. R. Sazzad",
      "R. W. Schnee",
      "G. Sehr",
      "B. Shafer",
      "S. Shaw",
      "W. Sherman",
      "K. Shi",
      "T. Shutt",
      "C. Silva",
      "G. Sinev",
      "J. Siniscalco",
      "A. M. Slivar",
      "R. Smith",
      "A. M. Softley-Brown",
      "M. Solmaz",
      "V. N. Solovov",
      "P. Sorensen",
      "J. Soria",
      "A. Stevens",
      "T. J. Sumner",
      "A. Swain",
      "N. Swanson",
      "M. Szydagis",
      "D. J. Taylor",
      "R. Taylor",
      "W. C. Taylor",
      "B. P. Tennyson",
      "P. A. Terman",
      "D. R. Tiedt",
      "M. Timalsina",
      "W. H. To",
      "Z. Tong",
      "D. R. Tovey",
      "J. Tranter",
      "M. Trask",
      "K. Trengove",
      "M. Tripathi",
      "L. Tvrznikova",
      "U. Utku",
      "A. Usón",
      "A. Vacheret",
      "A. C. Vaitkus",
      "O. Valentino",
      "V. Velan",
      "A. Wang",
      "J. J. Wang",
      "Y. Wang",
      "R. C. Webb",
      "L. Weeldreyer",
      "J. T. White",
      "T. J. Whitis",
      "K. Wild",
      "M. Williams",
      "J. Winnicki",
      "M. S. Witherell",
      "L. Wolf",
      "F. L. H. Wolfs",
      "S. Woodford",
      "D. Woodward",
      "C. J. Wright",
      "Q. Xia",
      "X. Xiang",
      "J. Xu",
      "Y. Xu",
      "M. Yeh",
      "D. Yeum",
      "J. Young",
      "W. Zha",
      "C. Zhang",
      "H. Zhang",
      "T. Zhang",
      "Y. Zhou"
    ],
    "published": "2026-02-24T18:27:25Z",
    "updated": "2026-02-24T18:27:25Z",
    "categories": [
      "hep-ex",
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  }
]