{
  "arxiv_id": "2509.14320v1",
  "url": "https://arxiv.org/abs/2509.14320v1",
  "pdf_url": "https://arxiv.org/pdf/2509.14320v1.pdf",
  "title": "Probing the meV QCD Axion with the $\\texttt{SQWARE}$ Quantum   Semiconductor Haloscope",
  "abstract": "We propose the Semiconductor-Quantum-Well Axion Radiometer Experiment ($\\texttt{SQWARE}$) -- a new experimental platform for direct detection of axion dark matter in the meV mass range -- based on resonantly enhanced axion-photon conversion through the inverse Primakoff effect in engineered quantum semiconductor heterostructures. The core of the radiometer is a GaAs/AlGaAs multiple quantum well structure forming a magnetoplasmonic cavity, containing an ultrahigh-mobility two-dimensional electron gas, which realizes a tunable epsilon-near-zero resonance in the terahertz frequency range. By controlling the orientation of the cavity within a strong external magnetic field, both the resonance frequency and the axion-induced current are optimized $\\textit{in situ}$, enabling efficient scanning across a broad mass range without complex mechanical adjustment. The axion-induced electromagnetic signal radiatively emitted from the magnetoplasmonic cavity is detected by a state-of-the-art photodetector. We present the theoretical basis for resonant enhancement, detail the experimental design and benchmarks through extensive simulations, and project the sensitivity of $\\texttt{SQWARE}$ for several realistic configurations. Our results demonstrate that $\\texttt{SQWARE}$ can probe the well-motivated quantum chromodynamics axion parameter space and close a critical gap in direct searches at meV masses.",
  "authors": [
    "Jaanita Mehrani",
    "Tao Xu",
    "Andrey Baydin",
    "Michael J. Manfra",
    "Henry O. Everitt",
    "Andrew J. Long",
    "Kuver Sinha",
    "Junichiro Kono",
    "Shengxi Huang"
  ],
  "published": "2025-09-17T18:00:10Z",
  "updated": "2025-09-17T18:00:10Z",
  "categories": [
    "hep-ph",
    "astro-ph.CO",
    "cond-mat.mes-hall",
    "physics.ins-det",
    "quant-ph"
  ],
  "primary_category": "hep-ph"
}