{
  "arxiv_id": "2601.14471v1",
  "url": "https://arxiv.org/abs/2601.14471v1",
  "pdf_url": "https://arxiv.org/pdf/2601.14471v1.pdf",
  "title": "Understanding Carbon Sourcing and Transport Originating from the Helicon Antenna Surfaces During High-Power Helicon Discharge in DIII-D Tokamak",
  "abstract": "The high-power helicon wave system in the DIII-D tokamak introduces new plasma--material interaction (PMI) challenges due to rectified RF sheath potentials forming near antenna structures and surrounding tiles. Using the STRIPE modeling framework-which integrates SOLPS-ITER, COMSOL, RustBCA, and GITR/GITRm-we simulate carbon erosion, re-deposition, and global impurity transport in two H-mode discharges with varying antenna--plasma gaps and RF powers. COMSOL predicts rectified sheath potentials of 1-5 kV, localized near the bottom of the antenna where magnetic field lines intersect at grazing angles. Erosion is dominated by carbon self-sputtering, with RF-accelerated D+ ions contributing up to 1 % of the total erosion flux. GITRm simulations show that in the small-gap case, only ~ 13 % of eroded carbon is re-deposited locally, with 58 % transported into the core. In contrast, the large-gap case exhibits lower total erosion, along with reduced core penetration (~ 35 %) and weaker re-deposition (~ 4 %), consistent with lower collisionality and limited plasma contact. The simulation trends are consistent with experimental observations, which have not shown elevated core impurity levels during helicon operation in the present graphite-wall configuration. However, under certain plasma conditions and magnetic configurations, the helicon antenna may still act as a finite source of net erosion and core-directed impurity transport, potentially influencing the overall core impurity balance. These findings emphasize the need for sheath-aware antenna designs and predictive impurity transport modeling to support future high-power RF systems with high-Z first wall materials in fusion devices.",
  "authors": [
    "A. Kumar",
    "D. Nath",
    "W. Tierens",
    "J. D. Lore",
    "R. Wilcox",
    "G. Ronchi",
    "M. Shafer",
    "A. Y. Joshi",
    "O. Sahni",
    "M. S. Shephard",
    "B. Van Compernolle",
    "R. I. Pinsker",
    "A. Demby",
    "O. Schmitz"
  ],
  "published": "2026-01-20T20:52:33Z",
  "updated": "2026-01-20T20:52:33Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}