{
  "arxiv_id": "2601.11603v2",
  "url": "https://arxiv.org/abs/2601.11603v2",
  "pdf_url": "https://arxiv.org/pdf/2601.11603v2.pdf",
  "title": "The use of spectral indices in environmental monitoring of smouldering coal-waste dumps",
  "abstract": "The study aimed to evaluate the applicability of environmental indices in the monitoring of smouldering coal-waste dumps. A dump located in the Upper Silesian Coal Basin served as the research site for a multi-method analysis combining remote sensing and field-based data. Two UAV survey campaigns were conducted, capturing RGB, infrared, and multispectral imagery. These were supplemented with direct ground measurements of subsurface temperature and detailed vegetation mapping. Additionally, publicly available satellite data from the Landsat and Sentinel missions were analysed. A range of vegetation and fire-related indices (NDVI, SAVI, EVI, BAI, among others) were calculated to identify thermally active zones and assess vegetation conditions within these degraded areas. The results revealed strong seasonal variability in vegetation indices on thermally active sites, with evidence of disrupted vegetation cycles, including winter greening in moderately heated root zones - a pattern indicative of stress and degradation processes. While satellite data proved useful in reconstructing the fire history of the dump, their spatial resolution was insufficient for detailed monitoring of small-scale thermal anomalies. The study highlights the diagnostic potential of UAV-based remote sensing in post-industrial environments undergoing land degradation but emphasises the importance of field validation for accurate environmental assessment.",
  "authors": [
    "Anna Abramowicz",
    "Michal Laska",
    "Adam Nadudvari",
    "Oimahmad Rahmonov"
  ],
  "published": "2026-01-08T16:44:21Z",
  "updated": "2026-01-21T09:15:21Z",
  "categories": [
    "physics.geo-ph",
    "physics.ins-det",
    "stat.AP"
  ],
  "primary_category": "physics.geo-ph",
  "doi": "10.1016/j.rsase.2025.101865"
}