[
  {
    "arxiv_id": "2601.03620v2",
    "url": "https://arxiv.org/abs/2601.03620v2",
    "pdf_url": "https://arxiv.org/pdf/2601.03620v2.pdf",
    "title": "On flying through the base of a pseudo-streamer",
    "abstract": "Near the 10 solar radius perihelion of Parker Solar Probe orbit 24, a confined region containing an enhanced plasma density of 25,000 particles per cubic centimeter and broadband electrostatic waves was encountered. The solar wind velocity of 200 kilometers per second and ion temperature of 25 eV were significantly reduced as compared to their values in the ambient solar wind. These anomalous plasma conditions were observed on closed magnetic field lines, as determined from observations of the suprathermal electron strahl. Because the polarity of the radial magnetic field did not change sign on the two sides of the crossing and the crossed region contained a double-peaked plasma structure, the spacecraft must have passed through the base of a pseudo-streamer whose structure extended out to 10 solar radii. In the plasma frame, an electric field as large as 400 millivolts per meter was detected during the crossing. The current associated with this electric field was less than one milliampere per square meter, corresponding to a drift velocity less than 2.5 kilometers per second. It also contained a turbulent plasma with density fluctuations divided by density as large as 0.3, suggesting that the resistive term in the generalized ohm's law was significant. Also, the density as a function of time had a non-zero slope when the electric field was non-zero, suggesting that the pressure gradient term also mattered. As compared to earlier remote sensing and theoretical results, it is surprising that the plasma in this pseudo-streamer had a remarkably low flow velocity and that the pseudo-streamer base extended out to 10 solar radii.",
    "authors": [
      "Forrest Mozer",
      "Oleksiy Agapitov",
      "Kyungeun Choi",
      "Andrii Voshchepynets"
    ],
    "published": "2026-01-07T06:01:19Z",
    "updated": "2026-01-22T17:50:52Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2512.20468v2",
    "url": "https://arxiv.org/abs/2512.20468v2",
    "pdf_url": "https://arxiv.org/pdf/2512.20468v2.pdf",
    "title": "Calibration Method of Spacecraft-Inertial Sensor Center-of-Mass Offset for the Taiji Gravitational Wave Detection Mission under Science Mode",
    "abstract": "Accurately calibrating the center-of-mass (CoM) offset between the spacecraft (SC) and the inertial sensor test mass (TM) is crucial for space-based gravitational-wave (GW) antennas, such as LISA and Taiji. Current calibration methods require additional spacecraft maneuvers that disrupt science data continuity and inter-satellite links, compromising the coherence of gravitational wave signals. Here, we present a maneuver-free calibration scheme that directly estimates the CoM offset vector using only standard science-mode measurements from inertial sensors, interferometers, and differential wavefront sensors. By embedding the CoM offset induced coupling acceleration as an extended state in a model-based adaptive Kalman filter, we achieve estimation accuracy of 0.01-1.5 mm across all axes with a maximum error below 1%. This approach enables continuous, high-precision calibration during nominal observation runs, ensuring continuous and coherent gravitational wave data collection while maintaining the required precision, and also facilitating advanced DFACS functions such as performance evaluations and fault diagnosis. For LISA-like missions, where data continuity is paramount for detecting faint gravitational wave signals, this method will enhance scientific output and reliability.",
    "authors": [
      "Haoyue Zhang",
      "Dong Ye",
      "Peng Xu",
      "Yunhai Geng",
      "Li-E Qiang",
      "Ziren Luo"
    ],
    "published": "2025-12-23T16:03:18Z",
    "updated": "2026-01-22T16:24:55Z",
    "categories": [
      "gr-qc",
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "gr-qc"
  },
  {
    "arxiv_id": "2601.16049v1",
    "url": "https://arxiv.org/abs/2601.16049v1",
    "pdf_url": "https://arxiv.org/pdf/2601.16049v1.pdf",
    "title": "Gain-Layer Project",
    "abstract": "Gain-layer degradation from exposure to radiation limits the use of Low-Gain Avalanche Diodes (LGADs) in high energy particle physics detector experiments. Proper understanding of how the gain-layer is destroyed is not available on a defect level. Only measurements for materials with much lower effective doping concentrations are available. The direct study of the gain-layer is not possible with typical defect spectroscopy measurements like Thermally Stimulated Currents (TSC) and Deep-Level Transient Spectroscopy (DLTS). To combat this problem and gain a better understanding of the processes which degrade LGADs, the Gain-Layer Project was started.   This project produced 19050 diodes with various Boron, Phosphorus, Oxygen and Carbon concentrations. The material used is low-resistivity p-type Silicon. The effective doping concentrations are in the order of a LGAD gain-layer. These diodes will serve the defect community in the coming years for various studies. This article introduces this project with detailed descriptions of the diodes, their flavours and their processing, and reports on results from I-V, C-V, SIMS and DLTS measurements on unirradiated diodes.",
    "authors": [
      "Niels G. Sorgenfrei",
      "Anna Rita Altamura",
      "Cristina Besleaga",
      "Georgia Andra Boni",
      "Tomas Ceponis",
      "Paul Erberk",
      "Eckhart Fretwurst",
      "Yana Gurimskaya",
      "Kevin Lauer",
      "Ludovico Massaccesi",
      "Luca Menzio",
      "Michael Moll",
      "Marie Muehlnikel",
      "Andrei Nitescu",
      "Ulrich Parzefall",
      "Roxana-Elena Patru",
      "Jevgenij Pavlov",
      "Ioana Pintilie",
      "Stephanie Reiss",
      "Joern Schwandt",
      "Valentina Sola"
    ],
    "published": "2026-01-22T15:28:55Z",
    "updated": "2026-01-22T15:28:55Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.15998v1",
    "url": "https://arxiv.org/abs/2601.15998v1",
    "pdf_url": "https://arxiv.org/pdf/2601.15998v1.pdf",
    "title": "Application of zone refining to the development of NaI(Tl) detectors for SABRE North",
    "abstract": "The SABRE North experiment is developing ultra-high radiopurity NaI(Tl) detectors to investigate dark matter. To achieve this, SABRE North utilizes the technique called zone refining for NaI powder purification. This work details the mathematical model developed to describe the purification process. By comparing this model to the results of the commissioning and production runs conducted prior to crystal growth, the distribution coefficients were determined for various impurities, contained in the powder at the parts-per-billion (ppb) level. Furthermore, the synthesis of data from both zone refining and normal freezing is discussed. These findings can be used to predict the SABRE North detectors background level in the energy region-of-interest for dark matter search and to optimize the production of ultra-high purity crystals through multiple purification strategies.",
    "authors": [
      "C. Ananna",
      "F. B. Armani",
      "G. Cataldi",
      "D. D'Angelo",
      "G. D'Imperio",
      "M. L. De Giorgi",
      "G. Di Carlo",
      "M. Diemoz",
      "A. Ianni",
      "S. G. Khattak",
      "E. Martinenghi",
      "A. Miccoli",
      "M. Misiaszek",
      "D. Montanino",
      "V. Pettinacci",
      "L. Pietrofaccia",
      "S. Rahatlou",
      "K. Szczepaniec",
      "C. Tomei",
      "V. Toso",
      "C. Vignoli",
      "S. Zuhra",
      "L. Cid",
      "A. Mellen-Spencer",
      "S. Nisi",
      "J. Tower"
    ],
    "published": "2026-01-22T14:18:29Z",
    "updated": "2026-01-22T14:18:29Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.15981v1",
    "url": "https://arxiv.org/abs/2601.15981v1",
    "pdf_url": "https://arxiv.org/pdf/2601.15981v1.pdf",
    "title": "Mid-infrared high-sensitive cavity-free in-situ CO gas sensing based on up-conversion detection",
    "abstract": "Carbon monoxide (CO) is a significant indicator gas with considerable application value in atmospheric monitoring, industrial production and medical diagnosis. Its fundamental vibrational band locates around 4.6 $\\upmu$m and has larger absorption line strength than that of overtone band, which is more suitable for the precise identification and concentration detection of CO. In this paper, the up-conversion detection is employed to convert the mid-infrared absorption signal obtained by TDLAS to the visible light band, then a silicon-based detector is utilized for detection. By which, we can achieve the highest sensitivity of 79.6 ppb under the condition of cavity-free in-situ with an absorption range length of only 0.14 m. Furthermore, the single-photon level real-time detection of CO concentration after the diffuse reflection is realized by using SPAD. This work demonstrates the merits of the up-conversion detection in terms of its functionality at room temperature and capacity for sensitivity detection. Furthermore, it presents a design and optimization methodology that has the potential to underpin the advancement of the method towards more practical applications, like industrial process monitoring, medical diagnosis and so on.",
    "authors": [
      "Zhao-Qi-Zhi Han",
      "He Zhang",
      "Fan Yang",
      "Xiao-Hua Wang",
      "Bo-Wen Liu",
      "Jin-Peng Li",
      "Zheng-He Zhou",
      "Yin-Hai Li",
      "Yan Li",
      "Zhi-Yuan Zhou",
      "Bao-Sen Shi"
    ],
    "published": "2026-01-22T14:03:56Z",
    "updated": "2026-01-22T14:03:56Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2601.15971v1",
    "url": "https://arxiv.org/abs/2601.15971v1",
    "pdf_url": "https://arxiv.org/pdf/2601.15971v1.pdf",
    "title": "Reaching the intrinsic performance limits of superconducting strip photon detectors up to 0.1 mm wide",
    "abstract": "Superconducting nanowire single-photon detectors (SNSPDs) have emerged as the highest performing photon-counting detectors, making them a critical technology in quantum photonics and photon-starved optical sensing. However, the performance of SNSPDs is limited not by the intrinsic properties of the superconducting film, but by edge-induced current crowding. Despite extensive materials optimization and increasingly demanding fabrication strategies aimed at mitigating this edge-limited behavior, the device edges continue to limit the maximum device operating current, thereby degrading key performance metrics. Here, we demonstrate for the first time in situ tuning of a detector from an edge-limited to a bulk-limited regime, allowing the device to reach its intrinsic performance limit. Our approach is based on current-biased superconducting \"rails\" placed on either side of the detector to suppress current crowding at the edges. We show that activation of the rails reduces the dark count rate by nine orders of magnitude and extends the photon detection plateau at 1550 nm by more than 40%. These results are demonstrated on detectors up to 0.1 mm wide, establishing an entirely new class of ultra-wide strip detectors that we call superconducting strip photon detectors (SSPD). Moreover, the ability to suppress edge current crowding using the rails provides a pathway toward SSPDs with strip widths extending into the mm-scale. Such devices will enable large-area, high efficiency SSPD arrays with infrared sensitivity and open new opportunities in applications ranging from biomedical imaging to deep space optical communication.",
    "authors": [
      "Kristen M. Parzuchowski",
      "Eli Mueller",
      "Bakhrom G. Oripov",
      "Benedikt Hampel",
      "Ravin A. Chowdhury",
      "Sahil R. Patel",
      "Daniel Kuznesof",
      "Emma K. Batson",
      "Ryan Morgenstern",
      "Robert H. Hadfield",
      "Varun B. Verma",
      "Matthew D. Shaw",
      "Jason P. Allmaras",
      "Martin J. Stevens",
      "Alex Gurevich",
      "Adam N. McCaughan"
    ],
    "published": "2026-01-22T13:51:49Z",
    "updated": "2026-01-22T13:51:49Z",
    "categories": [
      "cond-mat.supr-con",
      "physics.app-ph",
      "physics.ins-det",
      "physics.optics",
      "quant-ph"
    ],
    "primary_category": "cond-mat.supr-con"
  },
  {
    "arxiv_id": "2601.15947v1",
    "url": "https://arxiv.org/abs/2601.15947v1",
    "pdf_url": "https://arxiv.org/pdf/2601.15947v1.pdf",
    "title": "Multimodal Imaging System Combining Hyperspectral and Laser Speckle Imaging for In Vivo Hemodynamic and Metabolic Monitoring",
    "abstract": "We present the development and validation of a novel multimodal optical imaging platform that integrates hyperspectral imaging (HSI) and laser speckle contrast imaging (LSCI) to enable real-time, non-invasive mapping of tissue oxygenation, perfusion and metabolism, via blood flowmetry and targeting of oxy- (HbO2), deoxyhemoglobin (HHb), as well as oxidized cytochrome-c-oxidase (oxCCO). The system architecture features a single high-speed camera and dual optical path, with synchronized alternating illumination: a filtered, supercontinuum laser for HSI and a He-Ne laser for LSCI. The system performances were evaluated through in vivo experiments on rat spinal cord under normoxic and hypoxic conditions, revealing coherent physiological changes in hemodynamics, metabolism and relative blood flow index (rBFI). These results demonstrate the potential of the platform for functional tissue imaging and quantitative dynamic monitoring of both oxygen delivery and consumption.",
    "authors": [
      "Junda Wang",
      "Luca Giannoni",
      "Ayse Gertrude Yenicelik",
      "Eleni Giama",
      "Frederic Lange",
      "Kenneth J. Smith",
      "Ilias Tachtsidis"
    ],
    "published": "2026-01-22T13:32:34Z",
    "updated": "2026-01-22T13:32:34Z",
    "categories": [
      "physics.med-ph",
      "physics.app-ph",
      "physics.bio-ph",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "physics.med-ph"
  },
  {
    "arxiv_id": "2601.15938v1",
    "url": "https://arxiv.org/abs/2601.15938v1",
    "pdf_url": "https://arxiv.org/pdf/2601.15938v1.pdf",
    "title": "Operating a large-diameter dual-phase liquid xenon TPC in the unshielded PANCAKE facility",
    "abstract": "Future liquid-xenon (LXe) based observatories for rare processes, such as XLZD, require testing of large components and sub-assemblies in cryogenic liquid or gaseous xenon environments. Here we present results from the stable operation of a shallow dual-phase LXe TPC with an inner diameter of 133.4\\,cm and a height of 3.1\\,cm in the unshielded PANCAKE platform, without underground suppression of cosmic-ray backgrounds. A total of 340\\,kg of xenon was used in the experiment, of which 127\\,kg constituted the active TPC mass. Measurements of the LXe purity-dependent electron lifetime and the electron drift velocity in LXe demonstrate that sensitive measurements to characterize the TPC performance are possible in a high-background environment, even with a very basic PMT-based light detection system. Improving this will straightforwardly reduce the TPC threshold, which was observed to be around 15\\,keV for electronic recoils in TPC operation.",
    "authors": [
      "Julia Müller",
      "Jaron Grigat",
      "Robin Glade-Beucke",
      "Sebastian Lindemann",
      "Tiffany Luce",
      "Gnanesh Chandra Madduri",
      "Jens Reininghaus",
      "Marc Schumann",
      "Adam Softley-Brown",
      "Andrew Stevens"
    ],
    "published": "2026-01-22T13:18:41Z",
    "updated": "2026-01-22T13:18:41Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.15937v1",
    "url": "https://arxiv.org/abs/2601.15937v1",
    "pdf_url": "https://arxiv.org/pdf/2601.15937v1.pdf",
    "title": "OPTIMA, a board dedicated to Optimized Precision Timing for Multichannel Acquisition",
    "abstract": "In the new era of HL-LHC experiments, fast-timing detectors are emerging as critical tools for background rejection. Typical requirements include a temporal hit resolution of about 50 ps, a spatial resolution of around 12 $μ$m, and radiation hardness up to $10^{17}$n$_\\text{eq}$/cm$^2$. To address these challenges, the development of non-standard sensor designs and advanced fast readout electronics is required. The OPTIMA multichannel board addresses the need for testing small sensor demonstrators when they cannot yet be bonded to dedicated readout ASICs. It provides fast readout of up to 16 channels and can be integrated into various test setups, including test beam environments. This contribution presents the design of the OPTIMA board, its integration in test beams, and the first experimental results.",
    "authors": [
      "Federico De Benedetti",
      "Victor Coco",
      "Paula Collins",
      "Raphael Dumps",
      "Edgar Lemos Cid",
      "Alfonso Puicercus Gomez",
      "Efren Rodriguez Rodriguez",
      "Morag Williams"
    ],
    "published": "2026-01-22T13:18:36Z",
    "updated": "2026-01-22T13:18:36Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.15868v1",
    "url": "https://arxiv.org/abs/2601.15868v1",
    "pdf_url": "https://arxiv.org/pdf/2601.15868v1.pdf",
    "title": "Large-scale real-time signal processing in physics experiments: The ALICE TPC FPGA pipeline",
    "abstract": "For LHC Run 3, the ALICE Time Projection Chamber was upgraded to operate in continuous readout mode. Interaction rates of up to 50 kHz in Pb-Pb collisions require real-time processing of more than 3 TB/s of raw detector data. This requirement is met by a custom FPGA-based processing pipeline that performs the complete front-end data treatment fully in-stream, including common-mode correction, pedestal subtraction, ion-tail filtering, zero suppression, and dense data packing.   A central element of the design is a highly parallel common-mode correction algorithm operating directly on the streaming data. It robustly identifies signal-free readout channels on a time-bin basis and applies pad-dependent scaling to compensate for local variations in capacitive coupling in the GEM readout. In combination with pedestal subtraction and ion-tail filtering, this enables accurate baseline restoration under extreme high-occupancy conditions, preventing signal loss while efficiently suppressing noise prior to zero suppression.   The pipeline operates continuously at the full detector bandwidth and reduces the raw input rate to about 900 GB/s for Pb-Pb collisions at the target interaction rate. Overall, it represents a large-scale FPGA-based real-time signal-processing implementation for high-energy physics detector readout.",
    "authors": [
      "J. Alme",
      "T. Alt",
      "C. Andrei",
      "V. Anguelov",
      "H. Appelshäuser",
      "M. Arslandok",
      "R. Averbeck",
      "M. Ball",
      "G. G. Barnaföldi",
      "P. Becht",
      "R. Bellwied",
      "A. Berdnikova",
      "B. Blidaru",
      "L. Boldizsár",
      "L. Bratrud",
      "P. Braun-Munzinger",
      "M. Bregant",
      "C. L. Britton",
      "H. Büsching",
      "H. Caines",
      "P. Chatzidaki",
      "P. Christiansen",
      "T. M. Cormier",
      "L. Döpper",
      "R. Ehlers",
      "L. Fabbietti",
      "F. Flor",
      "J. J. Gaardhøje",
      "M. G. Munhoz",
      "C. Garabatos",
      "P. Gasik",
      "Á. Gera",
      "P. Glässel",
      "N. Grünwald",
      "T. Gündem",
      "T. Gunji",
      "H. Hamagaki",
      "J. W. Harris",
      "P. Hauer",
      "E. Hellbär",
      "H. Helstrup",
      "A. Herghelegiu",
      "H. D. Hernandez Herrera",
      "Y. Hou",
      "C. Hughes",
      "M. Ivanov",
      "J. Jäger",
      "Y. Ji",
      "J. Jung",
      "M. Jung",
      "B. Ketzer",
      "S. Kirsch",
      "M. Kleiner",
      "A. G. Knospe",
      "M. Korwieser",
      "M. Kowalski",
      "L. Lautner",
      "M. Lesch",
      "C. Lippmann",
      "G. Mantzaridis",
      "R. D. Majka",
      "A. Marin",
      "C. Markert",
      "S. Masciocchi",
      "A. Matyja",
      "M. Meres",
      "D. L. Mihaylov",
      "D. Miśkowiec",
      "R. H. Munzer",
      "H. Murakami",
      "K. Münning",
      "A. Nassirpour",
      "C. Nattrass",
      "B. S. Nielsen",
      "W. A. V. Noije",
      "A. C. Oliveira Da Silva",
      "A. Oskarsson",
      "K. Oyama",
      "L. Österman",
      "Y. Pachmayer",
      "G. Paić",
      "M. Petris",
      "M. Petrovici",
      "M. Planinic",
      "J. Rasson",
      "K. F. Read",
      "A. Rehman",
      "R. Renfordt",
      "A. Riedel",
      "K. Røed",
      "D. Röhrich",
      "E. Rubio",
      "A. Rusu",
      "S. Sadhu",
      "B. C. S. Sanches",
      "J. Schambach",
      "A. Schmah",
      "C. Schmidt",
      "A. Schmier",
      "K. Schweda",
      "D. Sekihata",
      "D. Silvermyr",
      "B. Sitar",
      "N. Smirnov",
      "H. K. Soltveit",
      "C. Sonnabend",
      "S. P. Sorensen",
      "J. Stachel",
      "L. Šerkšnytė",
      "G. Tambave",
      "K. Ullaland",
      "B. Ulukutlu",
      "D. Varga",
      "O. Vazquez Rueda",
      "B. Voss",
      "J. Wiechula",
      "B. Windelband",
      "J. Wilkinson",
      "J. Witte",
      "A. Yadav",
      "F. Zanone",
      "S. Zhu"
    ],
    "published": "2026-01-22T11:16:21Z",
    "updated": "2026-01-22T11:16:21Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.15818v1",
    "url": "https://arxiv.org/abs/2601.15818v1",
    "pdf_url": "https://arxiv.org/pdf/2601.15818v1.pdf",
    "title": "Muon beams towards muonium physics: progress and prospects",
    "abstract": "Advances in accelerator technology have led to significant improvements in the quality of muon beams over the past decades. Investigations of the muon and muonium enable precise measurements of fundamental constants, as well as searching for new physics beyond the Standard Model. Furthermore, by utilizing muon beams with high intensity and polarization, studies of the dynamics of the muon and muonium within atom level can offer valuable insights into material science. This review presents recent progress and prospects at the frontiers of muon beams and high-precision muonium physics. It also provides an overview of novel methods and detection techniques to achieve high sensitivities in different areas, including particle physics, nuclear physics, materials science and beyond.",
    "authors": [
      "Siyuan Chen",
      "Mingchen Sun",
      "Jian Tang"
    ],
    "published": "2026-01-22T10:05:19Z",
    "updated": "2026-01-22T10:05:19Z",
    "categories": [
      "hep-ex",
      "cond-mat.mtrl-sci",
      "physics.acc-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2503.19131v2",
    "url": "https://arxiv.org/abs/2503.19131v2",
    "pdf_url": "https://arxiv.org/pdf/2503.19131v2.pdf",
    "title": "Turbulent dynamos in a collapsing cloud",
    "abstract": "The amplification of magnetic fields is crucial for understanding the observed magnetization of stars and galaxies. Turbulent dynamo is the primary mechanism responsible for that but the understanding of its action in a collapsing environment is still rudimentary and relies on limited numerical experiments. We develop an analytical framework and perform numerical simulations to investigate the behavior of small-scale and large-scale dynamos in a collapsing turbulent cloud. This approach is also applicable to expanding environments and facilitates the application of standard dynamo theory to evolving systems. Using a supercomoving formulation of the magnetohydrodynamic (MHD) equations, we demonstrate that dynamo action in a collapsing background leads to a super-exponential growth of magnetic fields in time, significantly faster than the exponential growth seen in stationary turbulence. The enhancement is mainly due to the increasing eddy turnover rate during the collapse, which boosts the instantaneous growth rate of the dynamo. We also show that the scaling of final saturated magnetic field strength with density robustly exceeds the expectation from considerations of pure flux-freezing. Apart from establishing a formal framework for studying magnetic field evolution in collapsing (or expanding) turbulent plasmas, these findings suggest that during star and galaxy formation magnetic fields can become dynamically relevant much earlier than previously thought.",
    "authors": [
      "Muhammed Irshad P",
      "Pallavi Bhat",
      "Kandaswamy Subramanian",
      "Anvar Shukurov"
    ],
    "published": "2025-03-24T20:32:17Z",
    "updated": "2026-01-22T06:28:22Z",
    "categories": [
      "astro-ph.GA",
      "astro-ph.CO",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.GA",
    "doi": "10.1103/fp1v-xrr5"
  },
  {
    "arxiv_id": "2601.15661v1",
    "url": "https://arxiv.org/abs/2601.15661v1",
    "pdf_url": "https://arxiv.org/pdf/2601.15661v1.pdf",
    "title": "Non-Ambipolarity of Microturbulent Transport",
    "abstract": "Even what is called electrostatic microturbulence produces a plasma-beta-dependent turbulent magnetic field $\\tilde{B}$, which makes the magnetic field lines chaotic. Quasi-neutrality along the chaotic magnetic field lines requires a potential that obeys $\\vec{B}\\cdot \\vec{\\nabla} Φ= \\vec{B}\\cdot \\vec{\\nabla} p_e$, where $p_e$ is the electron pressure. This potential produces radial transport similar to that of diffusion coefficient $D_{ef}= (Δ/a_T)T_e/eB$. $Δ$ is the radial distance over which the potential $Φ$ is correlated by the electron motion along the chaotic magnetic field, and $|dT_e/dr| = T_e/a_T$. The chaos-produced electron transport gives an effective viscosity on the electron flow, which can counter balance a non-ambipolar part of the ion radial particle diffusion $f_{na}$. This non-ambipolarity would otherwise require a radial electric field that confines ions and hence impurities. The maximum $f_{na}$ that can be counterbalanced and the required plasma beta to avoid shielding the magnetic perturbations $\\tilde{B}$ are calculated.",
    "authors": [
      "Allen H Boozer"
    ],
    "published": "2026-01-22T05:20:38Z",
    "updated": "2026-01-22T05:20:38Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.18769v2",
    "url": "https://arxiv.org/abs/2512.18769v2",
    "pdf_url": "https://arxiv.org/pdf/2512.18769v2.pdf",
    "title": "Quantitative mobile gamma-ray spectrometry through Bayesian inference",
    "abstract": "Accurate quantitative mapping of gamma-ray sources is critical for applications ranging from radiological emergency response and environmental monitoring to nuclear security and deep space exploration. Here, we show that integrating high-fidelity, platform-dynamic Monte Carlo simulations and Bayesian inference with mobile gamma-ray spectrometry enables rapid and accurate quantification of distributed and point-like gamma-ray sources. Validated against laboratory and field assays, our framework quantifies natural and anthropogenic gamma-ray sources that conventional methods cannot resolve in $1\\,$s with $\\sim\\!\\!1\\,\\%$ error. The developed method marks a critical advance in quantitative gamma-ray sensing, enabling improved radiological situational awareness, enhanced terrestrial geophysical and geochemical mapping, as well as more robust constraints on radionuclide abundances on extraterrestrial bodies across the Solar System.",
    "authors": [
      "David Breitenmoser",
      "Alberto Stabilini",
      "Malgorzata Magdalena Kasprzak",
      "Sabine Mayer"
    ],
    "published": "2025-12-21T15:17:52Z",
    "updated": "2026-01-22T04:48:09Z",
    "categories": [
      "physics.ins-det",
      "physics.app-ph",
      "physics.comp-ph",
      "physics.data-an",
      "physics.geo-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.11768v2",
    "url": "https://arxiv.org/abs/2512.11768v2",
    "pdf_url": "https://arxiv.org/pdf/2512.11768v2.pdf",
    "title": "A low-cost ice melt monitoring system using wind-induced motion of mass-balance stakes",
    "abstract": "Surface ablation measurements of glaciers are critical for understanding mass change over time. Mass-balance stakes are commonly used for localized measurements, with the exposed length typically measured manually at infrequent intervals. This paper presents the design and validation of new instrumentation that automates mass-balance stake readings, thus enabling continuous measurements with high temporal resolution. The instrumentation comprises readout electronics that are mounted on mass-balance stakes to measure wind-induced vibrations. The stake vibrational frequency depends sensitively on the exposed length, and changes in the measured frequency therefore probe glacier surface melt and accumulation. Initial instrumentation field tests conducted at Color Lake on Umingmat Nunaat (Axel Heiberg Island), Nunavut, demonstrate centimeter-level precision on length measurements. The instrumentation can be attached to existing mass-balance stakes and is low-cost (~ $50 USD) in comparison to many other systems that perform automated surface ablation measurements. The accessibility of this instrumentation opens new possibilities for localized, high temporal resolution measurements of glacier surface activity at any locations where mass balance stakes are deployed.",
    "authors": [
      "Felix St-Amour",
      "H. Cynthia Chiang",
      "Jamie Cox",
      "Eamon Egan",
      "Ian Hendricksen",
      "Jonathan Sievers",
      "Laura Thomson"
    ],
    "published": "2025-12-12T18:29:29Z",
    "updated": "2026-01-22T04:41:13Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.15613v1",
    "url": "https://arxiv.org/abs/2601.15613v1",
    "pdf_url": "https://arxiv.org/pdf/2601.15613v1.pdf",
    "title": "A kinetic-moment framework for electron energy dynamics in capacitively coupled plasmas: absorption, conversion, transport, and dissipation",
    "abstract": "Understanding electron energy dynamics in low-temperature plasmas such as capacitively coupled plasmas (CCPs), including energy absorption, conversion, transport, and dissipation, is essential for interpreting discharge physics and process applications. We propose a kinetic-moment framework based on particle-in-cell/Monte Carlo collision (PIC/MCC) simulations. The framework reconstructs the first three velocity moments of the Boltzmann equation directly from PIC/MCC data and enables a quantitative, self-consistent description of electron energy dynamics in low-pressure CCPs. To clarify energy conversion among electromagnetic energy, electron fluid kinetic (mechanical) energy, and electron thermal (internal) energy, we further separate the total energy transport equation into kinetic- and thermal-energy equations. We find that, at low pressure, electrons gain directed kinetic energy in the sheath and convert it locally into thermal energy through pressure-strain interaction and collisions. Thermal energy is then transported into the bulk and is dissipated mainly by inelastic electron-neutral collisions. We further decompose pressure-strain interaction into reversible pressure dilatation and irreversible viscous-like dissipation, which correspond to conversion driven by volumetric compression or expansion and by shear deformation, respectively. This decomposition reveals a significant thermalization channel beyond collisions. More broadly, the results show coexistence of localized kinetic-to-thermal conversion near the sheath and nonlocal energy transport from the sheath to the bulk dominated by microscopic heat flux. The heat flux deviates strongly from Fourier's law based on local temperature gradients. This framework provides a clear fluid description with kinetic fidelity and offers a practical tool for analyzing energy evolution in nonequilibrium plasmas.",
    "authors": [
      "Jianxiong Yao",
      "Zeduan Zhang",
      "Feng He",
      "Jinsong Miao",
      "Jiting Ouyang",
      "Bocong Zheng"
    ],
    "published": "2026-01-22T03:29:10Z",
    "updated": "2026-01-22T03:29:10Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.02729v2",
    "url": "https://arxiv.org/abs/2601.02729v2",
    "pdf_url": "https://arxiv.org/pdf/2601.02729v2.pdf",
    "title": "The Future of Higgs Physics",
    "abstract": "In this lecture, I discuss measurements of the properties of the Higgs boson and related observables in the era of Higgs factories. This highly motivated experimental program is the challenge for the next generation of particle physicists.",
    "authors": [
      "Michael E. Peskin"
    ],
    "published": "2026-01-06T05:47:51Z",
    "updated": "2026-01-22T02:52:26Z",
    "categories": [
      "hep-ph",
      "hep-ex",
      "physics.acc-ph"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2601.15590v1",
    "url": "https://arxiv.org/abs/2601.15590v1",
    "pdf_url": "https://arxiv.org/pdf/2601.15590v1.pdf",
    "title": "Density Limit Experiments and Core-localized Kinetic MHD Activities in HL-2A Ohmic Heating Plasmas",
    "abstract": "The density limit is a mysterious barrier to magnetic confinement nuclear fusion, and is still an unresolved issue. In this paper, we will present the experimental results of the density limit and core-localized kinetic MHD instabilities on HL-2A. Firstly, the high density shots with $ne/ne_G>1$ have been achieved by the conventional gas-puff fuelling method in Ohmic heating plasmas, and the corresponding duration time is close to $t\\sim500$ ms ($\\sim$ $30τ_E$), where $τ_E$ is the global energy confinement time. Secondly, it is found for the first time that there are kinetic MHD instabilities in the core plasmas while $ne/ne_G\\sim1$. The analysis suggests that the core-localized MHD activities belong to Alfv{é}nic ion temperature gradient (AITG) modes or kinetic ballooning modes (KBM), and firstly it is found on experiment that they trigger the minor or major disruption of bulk plasmas while the density profile is peaked. These new findings are of great importance to figure out and understand the origin of the density limit.",
    "authors": [
      "L. W. Hu",
      "W. Chen",
      "P. W. Shi",
      "T. Long",
      "J. Q. Xu",
      "R. R. Ma",
      "Y. G. Li",
      "L. M. Yu",
      "X. Yu",
      "M. Jiang",
      "T. F. Sun",
      "J. M. Gao",
      "Y. B. Dong",
      "X. L. Zhu",
      "Z. B. Shi"
    ],
    "published": "2026-01-22T02:27:45Z",
    "updated": "2026-01-22T02:27:45Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.20091v2",
    "url": "https://arxiv.org/abs/2512.20091v2",
    "pdf_url": "https://arxiv.org/pdf/2512.20091v2.pdf",
    "title": "Precision Bounds for Characterising Quantum Measurements",
    "abstract": "Quantum measurements, alongside quantum states and processes, form a cornerstone of quantum information processing. However, unlike states and processes, their efficient characterisation remains relatively unexplored. We resolve this asymmetry by introducing a comprehensive framework for efficient detector estimation that reveals the fundamental limits to extractable parameter information and errors arising in detector analysis - the detector quantum Fisher information. Our development eliminates the need to optimise for the best probe state, while highlighting aspects of detector analysis that fundamentally differ from quantum state estimation. Through proofs, examples and experimental validation, we demonstrate the relevance and robustness of our proposal for current quantum detector technologies. By formalising a dual perspective to state estimation, our framework completes and connects the triad of efficient state, process, and detector tomography, advancing quantum information theory with broader implications for emerging technologies reliant on precisely calibrated measurements.",
    "authors": [
      "Aritra Das",
      "Simon K. Yung",
      "Lorcan O. Conlon",
      "Ozlem Erkilic",
      "Angus Walsh",
      "Yong-Su Kim",
      "Ping K. Lam",
      "Syed M. Assad",
      "Jie Zhao"
    ],
    "published": "2025-12-23T06:33:50Z",
    "updated": "2026-01-22T01:44:12Z",
    "categories": [
      "quant-ph",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "quant-ph",
    "doi": "10.1038/s41467-026-68529-7"
  },
  {
    "arxiv_id": "2601.15567v1",
    "url": "https://arxiv.org/abs/2601.15567v1",
    "pdf_url": "https://arxiv.org/pdf/2601.15567v1.pdf",
    "title": "Discovery of Density Limit Disruption Induced by Core-localized Alfv${é}$nic Ion Temperature Gradient Instabilities in a Tokamak Plasma",
    "abstract": "To achieve a high energy gain, the fusion reactor plasma must reach a very high density. However, the tokamak plasmas ofen undergo disruption when the density exceeds the Greenwald density. The density limit disruption in tokamak plasmas is a mysterious barrier to magnetic confinement nuclear fusion, and hitherto, is still an unresolved issue. Over the past several years, the high density experiments with Greenwald density ratio $n_e/n_{eG}\\sim1$ has been carried out using the conventional gas-puff fuelling method in HL-2A NBI and Ohmically heated plasmas. It is found for the first time that there are multiple-branch MHD instabilities in the core plasmas while $n_e/n_{eG}>0.85$. The simulation analysis suggests that the core-localized magnetohydrodynamics (MHD) activities belong to Alfv${é}$nic ion temperature gradient (AITG) modes, and on experiment firstly, it is discovered that they trigger the minor or major disruption of bulk plasmas while the density is peaked. These new findings are of great importance to figure out and understand the origin of density limit disruptions, as well as to forecast and avoid them for future fusion rectors.",
    "authors": [
      "Wei Chen",
      "Liwen Hu",
      "Jianqiang Xu",
      "Ruirui Ma",
      "Peiwan Shi",
      "Rui Ke",
      "Ting Long",
      "Zhiyong Qiu",
      "Haotian Chen",
      "Xiaoxue He",
      "Yonggao Li",
      "Liming Yu",
      "Wenping Guo",
      "Min Jiang",
      "Jinming Gao",
      "Xin Yu",
      "Zhengji Li",
      "Huiling Wei",
      "Deliang Yu",
      "Zhongbing Shi"
    ],
    "published": "2026-01-22T01:12:54Z",
    "updated": "2026-01-22T01:12:54Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2504.10192v3",
    "url": "https://arxiv.org/abs/2504.10192v3",
    "pdf_url": "https://arxiv.org/pdf/2504.10192v3.pdf",
    "title": "Picogram-Level Nanoplastic Analysis with Nanoelectromechanical System Fourier Transform Infrared Spectroscopy: NEMS-FTIR",
    "abstract": "We present a photothermal infrared spectroscopy-based approach for the chemical characterization and quantification of nanoplastics. By combining the high sensitivity of nanoelectromechanical systems (NEMS) with the wide spectral range and ubiquity of commercially available Fourier transform infrared (FTIR) spectrometers, NEMS-FTIR offers a time-efficient and cryogen-free option for the rapid, routine analysis of nanoplastics in aqueous samples. Polypropylene, polystyrene, and polyvinyl chloride nanoplastics with nominal diameters ranging from 54 to 262 nm were analyzed by NEMS-FTIR with limits of detection ranging from 101 pg to 353 pg, one order of magnitude lower than values reported for pyrolysis-gas chromatography-mass spectrometry of nanoplastics. The absorptance measured by NEMS-FTIR could be further converted to absolute sample mass using the attenuation coefficient, as demonstrated for polystyrene. Thanks to the wide spectral range of NEMS-FTIR, nanoplastic particles from different polymers could be readily identified, even when present in a mixture. The potential of NEMS-FTIR for the analysis of real samples was demonstrated by identifying the presence of nanoplastics released in water during tea brewing. Polyamide leachates in the form of fragments and smaller oligomers could be identified in the brewing water without sample pre-concentration, even in the presence of an organic matrix. Accelerated aging of the nylon teabags under elevated temperature and UV radiation showed further release of polyamide over time.",
    "authors": [
      "Jelena Timarac-Popović",
      "Johannes Hiesberger",
      "Eldira Šesto",
      "Niklas Luhmann",
      "Ariane Giesriegl",
      "Hajrudin Bešić",
      "Josiane P. Lafleur",
      "Silvan Schmid"
    ],
    "published": "2025-04-14T12:53:59Z",
    "updated": "2026-01-21T19:20:21Z",
    "categories": [
      "physics.ins-det",
      "physics.app-ph",
      "physics.atm-clus",
      "physics.chem-ph",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.15391v1",
    "url": "https://arxiv.org/abs/2601.15391v1",
    "pdf_url": "https://arxiv.org/pdf/2601.15391v1.pdf",
    "title": "Asymptotic scaling theory of electrostatic turbulent transport in magnetised fusion plasmas",
    "abstract": "Turbulent transport remains one of the principal obstacles to achieving efficient magnetic confinement in fusion devices. Two of the dominant drivers of the turbulence are microscale instabilities fuelled by electron- and ion-temperature gradients (ETG and ITG), whose nonlinear saturation determines the cross-field transport of particles and energy. Despite decades of study, predictive modelling of this turbulence has been limited either to expensive gyrokinetic simulations or to reduced models calibrated by fitting to numerical or experimental data, restricting their utility for reactor design. Here we present a simple asymptotic scaling theory that unifies ETG- and ITG-driven turbulence within a common framework. By balancing the fundamental time scales of linear growth, nonlinear decorrelation, and parallel propagation, the theory isolates the dependence of the heat flux on equilibrium parameters to two key quantities: the parallel system scale and the outer-scale aspect ratio. We show that these quantities encapsulate the essential physics of saturation, leading to distinct predictions for ETG and ITG transport: a cubic scaling with the temperature gradient in the electron channel, and a linear scaling in the ion channel. Extensive nonlinear gyrokinetic simulations confirm that these theoretical predictions hold irrespective of the magnetic geometry (slab, tokamak, or stellarator), including the first numerical confirmation of the cubic ETG scaling anticipated by earlier theory. By isolating the dependence on just the parallel system scale and the outer-scale aspect ratio, our framework provides a physics-based foundation for fast, geometry-aware transport models, offering a pathway toward reactor optimisation in both tokamaks and stellarators.",
    "authors": [
      "T. Adkins",
      "I. G. Abel",
      "M. Barnes",
      "S. Buller",
      "W. Dorland",
      "P. G. Ivanov",
      "R. Meyrand",
      "F. I. Parra",
      "A. A. Schekochihin",
      "J. Squire"
    ],
    "published": "2026-01-21T19:03:08Z",
    "updated": "2026-01-21T19:03:08Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2503.12235v2",
    "url": "https://arxiv.org/abs/2503.12235v2",
    "pdf_url": "https://arxiv.org/pdf/2503.12235v2.pdf",
    "title": "A magnetic avalanche as the central engine powering a solar flare",
    "abstract": "Solar flares are the most powerful, magnetically driven, explosions in the heliosphere. The nature of magnetic energy release in the solar corona that heats the plasma and accelerates particles in a flare, however, remains poorly understood. Here, we report high-resolution coronal observations of a flare by the Solar Orbiter mission that reveal initially weaker but rapid reconnection events, on timescales of a few seconds at most, leading to a more prominent activity of a similar nature that explosively causes a flare. Signatures of this process are further imprinted on the widespread raining plasma blobs with short lifetimes, giving rise to the characteristic ribbon-like emission pattern associated with the flare. Our observations unveil the central engine of a flare and emphasize the crucial role of an avalanche-like magnetic energy release mechanism at work.",
    "authors": [
      "L. P. Chitta",
      "D. I. Pontin",
      "E. R. Priest",
      "D. Berghmans",
      "E. Kraaikamp",
      "L. Rodriguez",
      "C. Verbeeck",
      "A. N. Zhukov",
      "S. Krucker",
      "R. Aznar Cuadrado",
      "D. Calchetti",
      "J. Hirzberger",
      "H. Peter",
      "U. Schühle",
      "S. K. Solanki",
      "L. Teriaca",
      "A. S. Giunta",
      "F. Auchère",
      "L. Harra",
      "D. Müller"
    ],
    "published": "2025-03-15T19:11:21Z",
    "updated": "2026-01-21T18:54:19Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR",
    "doi": "10.1051/0004-6361/202557253"
  },
  {
    "arxiv_id": "2601.13517v2",
    "url": "https://arxiv.org/abs/2601.13517v2",
    "pdf_url": "https://arxiv.org/pdf/2601.13517v2.pdf",
    "title": "Demonstration of a novel phase space painting method in a coupled lattice to mitigate space charge in high-intensity hadron beams",
    "abstract": "Multi-turn charge-exchange injection is the primary method of creating high-intensity hadron beams in circular accelerators, and phase space painting during injection enables tailoring of the accumulated phase space distribution. A technique we call eigenpainting allows injection of particles into a single mode of a coupled ring, providing full four-dimensional control of the phase space distribution. Under ideal conditions, uniform eigenpainting generates a linear-force equilibrium distribution in the transverse plane, with zero volume in four-dimensional transverse phase space, even including space charge. We have implemented eigenpainting for the first time in the Spallation Neutron Source (SNS) Accumulator Ring. Injecting 8.8 $μ$C of 800 MeV beam, we obtain a final ratio of intrinsic transverse emittances of $\\approx$2.4. We analyze the effect of space charge on the final distribution through comparison of the reconstructed phase space to particle-in-cell simulations.",
    "authors": [
      "Nicholas J. Evans",
      "Austin Hoover",
      "Timofey Gorlov",
      "Vasiliy Morozov"
    ],
    "published": "2026-01-20T02:10:00Z",
    "updated": "2026-01-21T18:02:30Z",
    "categories": [
      "physics.acc-ph",
      "physics.app-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2506.06814v2",
    "url": "https://arxiv.org/abs/2506.06814v2",
    "pdf_url": "https://arxiv.org/pdf/2506.06814v2.pdf",
    "title": "An analytical optimization of plasma density profiles for downramp injection in laser wake-field acceleration",
    "abstract": "We propose and detail a multi-step analytical procedure, based on an improved fully relativistic plane model for Laser Wake Field Acceleration, to tailor the initial density of a cold diluted plasma to the laser pulse profile, so as to control and optimize the partial wave-breaking of the plasma wave and maximize the acceleration of small bunches of electrons self-injected by the first wave-breaking at the density down-ramp, at least in the first stages of their acceleration phase. We find an excellent agreement with the results of Particle In Cell simulations obtained with the same input data.",
    "authors": [
      "Gaetano Fiore",
      "Paolo Tomassini"
    ],
    "published": "2025-06-07T14:45:03Z",
    "updated": "2026-01-21T17:48:08Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.02940v2",
    "url": "https://arxiv.org/abs/2511.02940v2",
    "pdf_url": "https://arxiv.org/pdf/2511.02940v2.pdf",
    "title": "Evolution of an Alfvén Wave-Driven Proton Beam in the Expanding Solar Wind",
    "abstract": "We investigate the self-consistent formation and long-term evolution of proton beams in the expanding solar wind using an ensemble of one-dimensional hybrid expanding box simulations. Initial conditions are chosen to represent a range of plasma states observed by the Helios spacecraft at 0.3 AU, including an amplitude-modulated Alfvén wave that nonlinearly drives a proton beam aligned with the magnetic field. We compare simulation results with solar wind data out to 1.5 AU and show that our model reproduces key observed features of proton beams on average, such as the radial evolution of the drift and the relative core-to-beam density ratio. These findings support the theory that the observed evolution of the proton beam drift in the solar wind is determined by kinetic instabilities. More broadly, our results indicate that the interplay between nonlinear Alfvén wave dynamics, expansion effects and kinetic instabilities plays a fundamental role in solar wind dynamics, with implications for interpreting solar wind heating rate estimates.",
    "authors": [
      "J. S. Bianco",
      "A. Tenerani",
      "C. Gonzalez",
      "L. Matteini",
      "K. G. Klein"
    ],
    "published": "2025-11-04T19:42:03Z",
    "updated": "2026-01-21T17:07:33Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2509.18564v2",
    "url": "https://arxiv.org/abs/2509.18564v2",
    "pdf_url": "https://arxiv.org/pdf/2509.18564v2.pdf",
    "title": "Impact of Nitrogen and Oxygen Interstitials on Niobium SRF Cavity Performance",
    "abstract": "Superconducting radiofrequency (SRF) cavities are the leading technology for highly efficient particle acceleration, and their performance can be significantly enhanced through the controlled introduction of interstitial impurities into bulk niobium. Nitrogen doping has demonstrated a substantial reduction in surface resistance, which improves the quality factor of the cavities. More recently, oxygen doping has emerged as a promising alternative, demonstrating comparable reductions in surface resistance. In this study, we combine cavity measurements on 1.3 GHz niobium SRF cavities subjected to a range of nitrogen- and oxygen-based treatments with material characterizations performed on cavity cutouts processed under identical conditions. This approach allows us to quantitatively assess the contribution of each impurity to the reduction of surface resistance. We find that nitrogen is ten times more effective than oxygen in reducing surface resistance at 16 MV/m. We also observe an additive effect of O and N impurities in reducing R$_\\mathrm{T}$. We discuss these results in the context of field dependent nonequilibrium superconductivity, gap enhancement, and hydrogen trapping mechanisms.",
    "authors": [
      "Hannah Hu",
      "Young-Kee Kim",
      "Daniel Bafia"
    ],
    "published": "2025-09-23T02:41:21Z",
    "updated": "2026-01-21T17:05:03Z",
    "categories": [
      "physics.acc-ph",
      "cond-mat.supr-con"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.15181v1",
    "url": "https://arxiv.org/abs/2601.15181v1",
    "pdf_url": "https://arxiv.org/pdf/2601.15181v1.pdf",
    "title": "Single-laser scheme for reaching strong field QED regime via direct laser acceleration",
    "abstract": "We investigate a single-laser scheme for reaching the strong-field QED regime based on direct laser acceleration (DLA) of electrons followed by their head-on collision with the same laser pulse reflected from an overdense foil. In this configuration, electrons are first accelerated inside an underdense plasma by a relativistic laser pulse and subsequently interact with the reflected laser field, emitting high-energy photons via nonlinear Compton scattering which decay into electron-positron pairs through the nonlinear Breit-Wheeler process. Using analytical scalings supported by quasi-3D particle-in-cell simulations including QED effects, we demonstrate that a laser pulse with power as low as 2 PW is sufficient to reach the quantum regime characterized by $χ_e> 1$ . For higher powers, we observe a rapid nonlinear increase in the number of generated positrons, reaching more than 2 nC for a 10 PW laser pulse with energy of approximately 1.1 kJ. A semi-analytical model is employed to estimate the positron yield, showing good agreement with simulation results. We further study the influence of laser depletion and the positioning of the reflecting foil on the efficiency of pair production. The presented scheme provides an experimentally feasible platform for probing strong-field QED effects using currently available multi-petawatt laser systems.",
    "authors": [
      "Robert Babjak",
      "Marija Vranic"
    ],
    "published": "2026-01-21T16:59:44Z",
    "updated": "2026-01-21T16:59:44Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2409.20446v2",
    "url": "https://arxiv.org/abs/2409.20446v2",
    "pdf_url": "https://arxiv.org/pdf/2409.20446v2.pdf",
    "title": "Phase projection errors in rf-driven optically pumped magnetometers",
    "abstract": "We investigate the phase relationship between the oscillating (rf) excitation field and the detected (light) power modulation in scalar rf-driven optically pumped magnetometers (OPMs), in particular in the $M_x$ configuration. While the static dependence of the demodulation phase on the direction of the external static magnetic field vector can be largely mitigated by aligning the oscillating rf field along the light propagation direction, we demonstrate that a dynamic (transient) phase response arises under magnetic field tilts. We analytically solve the corresponding modified Bloch equation and confirm agreement with experimental observations obtained using an $M_x$ magnetometer incorporating a paraffin-coated Cs vapor cell. The results reveal fundamental limitations of $M_x$ magnetometers regarding response time and accuracy, in particular when employed with active electronic feedback, such as a phase-locked loop. Therefore, this work is highly relevant to important magnetometry applications where the direction of the quasi-static magnetic field of interest is unknown \\textit{a priori} or varies over time, or in measurements requiring a large detection bandwidth. Such conditions are encountered in applications such as geomagnetic surveying, particularly with mobile platforms.",
    "authors": [
      "Zoran D. Grujić",
      "Marija Ćurĉić",
      "Aleksandra Kocić",
      "Antoine Weis",
      "Theo Scholtes"
    ],
    "published": "2024-09-30T16:05:10Z",
    "updated": "2026-01-21T14:21:12Z",
    "categories": [
      "physics.atom-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2601.14992v1",
    "url": "https://arxiv.org/abs/2601.14992v1",
    "pdf_url": "https://arxiv.org/pdf/2601.14992v1.pdf",
    "title": "Ab initio path-integral Monte Carlo results for the one-particle spectral function of the warm dense electron gas",
    "abstract": "We compute quasi-exact \\emph{ab initio} path-integral Monte Carlo results for the Matsubara Green's function of the uniform electron gas (UEG) at finite temperature over a broad range of coupling strengths ($r_s=1,\\dots,10)$. This allows us to present approximation-free results for the static self-energy $Σ_\\infty(p)$ and spectral function $A(p,ω)$, and to benchmark previous approximate results for the UEG. In addition, our work opens up intriguing avenues to study the single-particle spectrum and density of states of real warm dense matter systems based on truly first principles.",
    "authors": [
      "Paul Hamann",
      "Michael Bonitz",
      "Jan Vorberger",
      "Tobias Dornheim"
    ],
    "published": "2026-01-21T13:48:27Z",
    "updated": "2026-01-21T13:48:27Z",
    "categories": [
      "cond-mat.quant-gas",
      "physics.chem-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.quant-gas"
  },
  {
    "arxiv_id": "2601.14989v1",
    "url": "https://arxiv.org/abs/2601.14989v1",
    "pdf_url": "https://arxiv.org/pdf/2601.14989v1.pdf",
    "title": "Dielectric formalism of the 2D uniform electron gas at finite temperatures",
    "abstract": "We present a comprehensive analysis of the two-dimensional uniform electron gas (2D-UEG or more commonly 2DEG) at finite temperature, spanning a broad range of densities / coupling strengths ($0.01\\le{r}_s\\le20$) and temperatures / degeneracy parameters ($0.01\\leΘ= k_B T/E_F \\le 10$). Within the self-consistent dielectric formalism, we construct two-dimensional versions of the Singwi-Tosi-Land-Sjölander (STLS) and hypernetted-chain (HNC) approximation based schemes. We benchmark the accuracy of the STLS and the HNC schemes against new state-of-the-art path-integral Monte Carlo data. We also report structural and thermodynamic properties across the full $(r_s,Θ)$ phase diagram domain studied, identify regimes in which these schemes remain quantitatively reliable, and provide an accurate parametrization of the exchange--correlation free energy of the finite-temperature 2DEG.",
    "authors": [
      "Fotios Kalkavouras",
      "Tobias Dornheim",
      "Paul Hamann",
      "Panagiotis Tolias"
    ],
    "published": "2026-01-21T13:36:51Z",
    "updated": "2026-01-21T13:36:51Z",
    "categories": [
      "cond-mat.str-el",
      "cond-mat.quant-gas",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.str-el"
  },
  {
    "arxiv_id": "2601.14924v1",
    "url": "https://arxiv.org/abs/2601.14924v1",
    "pdf_url": "https://arxiv.org/pdf/2601.14924v1.pdf",
    "title": "Ring oscillator performance of the ATLAS inner tracker pixel readout chip",
    "abstract": "This paper presents experimental and simulation data to characterize the Ring Oscillators (RO) produced in 65-nm CMOS technology for the next promising generation of readout chips for the pixel detector in the Inner Tracker (ITk) at the ATLAS experiment at CERN. To enable a better understanding of the RO block embedded in ITkPixV1.1 single chip card (SCC), tests at various temperatures, voltages, accumulated total ionizing dose (TID) with X-ray irradiation, and high-temperature annealing will be presented. The objective of this study is to examine the RO output dependency based on different variable conditions and provide simulation data using Cadence, an electronic design automation (EDA) software to validate the experimental outcomes.",
    "authors": [
      "Yahya Khwaira",
      "Abdenour Lounis",
      "Maurice Cohen-Solal",
      "Mohsine Menouni",
      "Pierre Barrillon",
      "Denis Fougeron"
    ],
    "published": "2026-01-21T12:11:32Z",
    "updated": "2026-01-21T12:11:32Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.14886v1",
    "url": "https://arxiv.org/abs/2601.14886v1",
    "pdf_url": "https://arxiv.org/pdf/2601.14886v1.pdf",
    "title": "Piecewise omnigenous magnetohydrodynamic equilibria as fusion reactor candidates",
    "abstract": "In piecewise omnigenous magnetic fields, charged particles remain perfectly confined in the abscence of collisions and turbulence. This concept extends the traditional notion of omnigenity, the theoretical principle upon which most of existing magnetic fusion reactor designs, including tokamaks, are based. While piecewise omnigenity broadens the range of potentially viable stellarator reactor candidates, it is achieved by relaxing the requirement of continuity in the magnetic field strength, which could appear to pose significant challenges for the design of magnetohydrodynamic equilibria. In this work, a stellarator magnetic configuration is presented that satisfies the ideal magnetohydrodynamic equilibrium equation and that achieves unprecedented levels of piecewise omnigenity. As a result, it exhibits favorable transport characteristics, including reduced bulk radial (neoclassical and turbulent transport), bootstrap current and fast ion losses. In addition, the configuration displays robust MHD stability across a range of \\b{eta} values and possesses a rotational transform profile compatible with an island divertor. Collectively, these features satisfy the standard set of physics criteria required for a viable reactor candidate which, until now, were believed to be attainable only by certain types of omnigenous stellarators.",
    "authors": [
      "V. Fernández-Pacheco",
      "J. L. Velasco",
      "E. Sánchez",
      "R. Gaur",
      "J. M. García-Regaña",
      "J. A. Alonso",
      "I. Calvo",
      "D. Carralero"
    ],
    "published": "2026-01-21T11:17:38Z",
    "updated": "2026-01-21T11:17:38Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.14834v1",
    "url": "https://arxiv.org/abs/2601.14834v1",
    "pdf_url": "https://arxiv.org/pdf/2601.14834v1.pdf",
    "title": "Electric field induced by radial redistribution of the energetic ion pressure in a fusion plasma",
    "abstract": "It is found by using the gyrokinetic theory that significant radial electric fields, or zonal flows, can be generated by the radial redistribution of energetic ion pressure in a tokamak fusion device. Trapped energetic ions are more effective to generate the radial electric field than the isotropic energetic ions. This suggests that the energetic $α$ particles produced by DT fusion may induce significant radial electric field and thus help to improve the core plasma confinement in a fusion reactor.",
    "authors": [
      "Shaojie Wang"
    ],
    "published": "2026-01-21T10:01:03Z",
    "updated": "2026-01-21T10:01:03Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.24851v2",
    "url": "https://arxiv.org/abs/2509.24851v2",
    "pdf_url": "https://arxiv.org/pdf/2509.24851v2.pdf",
    "title": "The development of a high granular crystal calorimeter prototype of VLAST",
    "abstract": "Very Large Area gamma-ray Space Telescope (VLAST) is the next-generation flagship space observatory for high-energy gamma-ray detection proposed by China. The observation energy range covers from MeV to TeV and beyond, with acceptance of 10 m^2sr. The calorimeter serves as a crucial subdetector of VLAST, responsible for high-precision energy measurement and electron/proton discrimination. This discrimination capability is essential for accurately identifying gamma-ray events among the background of charged particles. To accommodate such an extensive energy range, a high dynamic range readout scheme employing dual avalanche photodiodes (APDs) has been developed, achieving a remarkable dynamic range of 10^6. Furthermore, a high granular prototype based on bismuth germanate (BGO) cubic scintillation crystals has been developed. This high granularity enables detailed imaging of the particle showers, improving both energy resolution and particle identification. The prototype's performance is evaluated through cosmic ray testing, providing valuable data for optimizing the final calorimeter design for VLAST.",
    "authors": [
      "Yanshuo Zhang",
      "Qian Chen",
      "Dengyi Chen",
      "Jianguo Liu",
      "Yiming Hu",
      "Yunlong Zhang",
      "Yifeng Wei",
      "Zhongtao Shen",
      "Changqing Feng",
      "Jianhua Guo",
      "Shubin Liu",
      "Guangshun Huang",
      "Xiaolian Wang",
      "Zizong Xu"
    ],
    "published": "2025-09-29T14:38:01Z",
    "updated": "2026-01-21T09:29:53Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.11603v2",
    "url": "https://arxiv.org/abs/2601.11603v2",
    "pdf_url": "https://arxiv.org/pdf/2601.11603v2.pdf",
    "title": "The use of spectral indices in environmental monitoring of smouldering coal-waste dumps",
    "abstract": "The study aimed to evaluate the applicability of environmental indices in the monitoring of smouldering coal-waste dumps. A dump located in the Upper Silesian Coal Basin served as the research site for a multi-method analysis combining remote sensing and field-based data. Two UAV survey campaigns were conducted, capturing RGB, infrared, and multispectral imagery. These were supplemented with direct ground measurements of subsurface temperature and detailed vegetation mapping. Additionally, publicly available satellite data from the Landsat and Sentinel missions were analysed. A range of vegetation and fire-related indices (NDVI, SAVI, EVI, BAI, among others) were calculated to identify thermally active zones and assess vegetation conditions within these degraded areas. The results revealed strong seasonal variability in vegetation indices on thermally active sites, with evidence of disrupted vegetation cycles, including winter greening in moderately heated root zones - a pattern indicative of stress and degradation processes. While satellite data proved useful in reconstructing the fire history of the dump, their spatial resolution was insufficient for detailed monitoring of small-scale thermal anomalies. The study highlights the diagnostic potential of UAV-based remote sensing in post-industrial environments undergoing land degradation but emphasises the importance of field validation for accurate environmental assessment.",
    "authors": [
      "Anna Abramowicz",
      "Michal Laska",
      "Adam Nadudvari",
      "Oimahmad Rahmonov"
    ],
    "published": "2026-01-08T16:44:21Z",
    "updated": "2026-01-21T09:15:21Z",
    "categories": [
      "physics.geo-ph",
      "physics.ins-det",
      "stat.AP"
    ],
    "primary_category": "physics.geo-ph",
    "doi": "10.1016/j.rsase.2025.101865"
  },
  {
    "arxiv_id": "2601.14782v1",
    "url": "https://arxiv.org/abs/2601.14782v1",
    "pdf_url": "https://arxiv.org/pdf/2601.14782v1.pdf",
    "title": "Introducing Timepix2-Lite: A Miniaturized Readout Interface Enabling Nanosecond-Scale Half-Life Measurement",
    "abstract": "This paper presents Timepix2 Lite, a compact readout interface for the Timepix2 hybrid pixel detector, designed to provide high spatial and temporal resolution in a wide range of radiation detection applications. The Timepix2 Lite enables simultaneous energy and precise timing measurements on the nanosecond scale and supports advanced real-time data acquisition and visualization through the TrackLab software framework. Its compact and flexible architecture, enabled by the miniaturized design, allows seamless integration into diverse experimental setups, including nuclear spectroscopy, stratospheric balloon missions, and nanosecond-scale half-life measurements. As a case study, the half-life of the second excited state in 237Np was determined to be 67.5(7) ns for the 59.5 keV transition, consistent with previously reported results.",
    "authors": [
      "O. Pavlas",
      "B. Bergmann",
      "M. Holik",
      "M. Malich",
      "S. Pospisil",
      "P. Smolyanskiy",
      "V. Vicha",
      "R. Filgas"
    ],
    "published": "2026-01-21T09:04:24Z",
    "updated": "2026-01-21T09:04:24Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.14768v1",
    "url": "https://arxiv.org/abs/2601.14768v1",
    "pdf_url": "https://arxiv.org/pdf/2601.14768v1.pdf",
    "title": "Efficient and precise Cherenkov-based charged particle timing using SiPMs",
    "abstract": "Dedicated R&D efforts are currently underway to couple a thin Cherenkov radiator to Silicon Photomultiplier (SiPM) arrays for precise charged particle Time-of-Flight (ToF) measurements. The prompt nature of Cherenkov radiation makes it an ideal candidate for achieving ultimate timing performance in a ToF detector. Using a thin radiator with a high refractive index, such as fused silica, enables the generation of a fast signal from charged particles that exceed the Cherenkov threshold. A crucial requirement for approaching the target time resolution is the optimization of both the radiator material and thickness, as well as the optical coupling to the SiPM arrays. In this work, we present the main factors that affect the time resolution and the expected performance achieved through a detailed Monte Carlo simulation and the comparison with beam test results.",
    "authors": [
      "M. N. Mazziotta",
      "A. Di Mauro",
      "M. Giliberti",
      "A. Liguori",
      "L. Lorusso",
      "E. Nappi",
      "N. Nicassio",
      "G. Panzarini",
      "R. Pillera",
      "G. Volpe"
    ],
    "published": "2026-01-21T08:44:45Z",
    "updated": "2026-01-21T08:44:45Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.14767v1",
    "url": "https://arxiv.org/abs/2601.14767v1",
    "pdf_url": "https://arxiv.org/pdf/2601.14767v1.pdf",
    "title": "A SiPM-Based RICH Detector with Timing Capabilities for Isotope Identification",
    "abstract": "In this work, we present a novel compact particle identification (PID) detector concept based on Silicon Photomultipliers (SiPMs) optimized to perform combined Ring-Imaging Cherenkov (RICH) and Time-of-Flight (TOF) measurements using a common photodetector layer. The system consists of a Cherenkov radiator layer separated from a photosensitive surface equipped with SiPMs by an expansion gap. A thin glass slab, acting as a second Cherenkov radiator, is coupled to the SiPMs to perform Cherenkov-based charged particle timing measurements. We assembled a small-scale prototype instrumented with various Hamamatsu SiPM array sensors with pixel pitches ranging from 2 to 3 mm and coupled with 1 mm thick fused silica window. The RICH radiator consisted of a 2 cm thick aerogel tile with a refractive index of 1.03 at 400 nm. The prototype was successfully tested in beam test campaigns at the CERN PS T10 beam line with pions and protons. We measured a single-hit angular resolution of about 4 mrad at the Cherenkov angle saturation value and a time resolution better than 50 ps RMS for charged particles with Z = 1. The present technology makes the proposed SiPM-based PID system particularly attractive for space applications due to the limited detector volumes available. In this work, we present beam test results obtained with the detector prototype and we discuss possible configurations optimized for the identification of ions in space applications.",
    "authors": [
      "M. N. Mazziotta",
      "L. Congedo",
      "G. De Robertis",
      "M. Giliberti",
      "F. Licciulli",
      "A. Liguori",
      "L. Lorusso",
      "N. Nicassio",
      "G. Panzarini",
      "R. Pillera"
    ],
    "published": "2026-01-21T08:43:53Z",
    "updated": "2026-01-21T08:43:53Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.3390/particles8040094"
  },
  {
    "arxiv_id": "2601.14749v1",
    "url": "https://arxiv.org/abs/2601.14749v1",
    "pdf_url": "https://arxiv.org/pdf/2601.14749v1.pdf",
    "title": "Triggers for plasma detachment bifurcation in the edge divertor region of tokamaks",
    "abstract": "We report the discovery of the trigger for detachment bifurcation phenomenon in tokamak divertors, revealed through steady-state and time-dependent UEDGE simulations: The observed electron temperature cliff at the outer target in DIII-D H-mode plasmas with ion $B\\times \\nabla B$ drift driven into the active divertor results from a bifurcation-induced $T_e$ drop above the X-point accompanied by reversal of the $E\\times B$ flow pattern in the private flux region. Time-dependent simulations reveal a two-phase transition mechanism: the high-field-side radiation front first extends across the last closed flux surface and stabilizes above the X-point, causing local $T_e$ to drop from $\\sim 70\\,\\mathrm{eV}$ to $\\sim 10\\,\\mathrm{eV}$ and inducing $E\\times B$ flow reversal in a thin layer below the X-point, which lasts $< 0.5\\,\\mathrm{ms}$; Flow reversal below the X-point subsequently triggers the sharp drop in outer target temperature on a timescale of $1-2\\,\\mathrm{ms}$, establishing deep detachment a few ms thereafter. A bifurcation transition occurs when the high-field-side radiation front crosses the separatrix while the outer divertor remains attached, with the $T_e$ cliff manifesting distinctly when the outer target $T_e \\gtrsim 10\\,\\mathrm{eV}$ prior to the bifurcation. These results demonstrate that the bifurcation is linked to in-out divertor asymmetry and asymmetric radiation front evolution.",
    "authors": [
      "Menglong Zhao",
      "Thomas Rognlien",
      "Ben Zhu",
      "Filippo Scotti",
      "Xinxing Ma",
      "Adam McLean"
    ],
    "published": "2026-01-21T08:08:17Z",
    "updated": "2026-01-21T08:08:17Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.14670v1",
    "url": "https://arxiv.org/abs/2601.14670v1",
    "pdf_url": "https://arxiv.org/pdf/2601.14670v1.pdf",
    "title": "In-Situ Inverse Design of a Plasma Metamaterial Beam Steering Device",
    "abstract": "Inverse design is a commonly used methodology for creating devices that manipulate electromagnetic (EM) waves by algorithmically modifying device parameters to achieve a desired functionality. Utilizing plasma, a dynamically tunable medium, allows the optimization of the design process to be conducted directly on the experimental hardware (in-situ). A key advantage of this method is the creation of devices that are inherently switchable and dynamically reconfigurable. Bayesian optimization is used to tune the plasma density of 91 independent discharges that make up a plasma metamaterial (PMM) device to steer incoming EM waves to desired exit waveguides. Measurements were conducted in an automated loop where a vector network analyzer records the PMM transmission characteristics for each device setting. By relying only on measured scattering parameters, this gradient-free approach is robust to experimental drift and noise and does not require complex full-wave models. Significant performance improvements over traditional simulation-based (in-silico) inverse design are demonstrated, with in-situ Bayesian optimization achieving up to 10,000x higher isolation between ports than the best in-silico design at the same target frequency. This work also presents guidelines for applying Bayesian optimization to noisy, high-dimensional physical systems.",
    "authors": [
      "Katherine P. Bronstein",
      "Noah A. Harris",
      "Aleczander J. Harder",
      "Jennay L. Edmondson",
      "Jesse A. Rodríguez"
    ],
    "published": "2026-01-21T05:30:03Z",
    "updated": "2026-01-21T05:30:03Z",
    "categories": [
      "physics.optics",
      "physics.app-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2601.12614v2",
    "url": "https://arxiv.org/abs/2601.12614v2",
    "pdf_url": "https://arxiv.org/pdf/2601.12614v2.pdf",
    "title": "Deterministic and probabilistic neural surrogates of global hybrid-Vlasov simulations",
    "abstract": "Hybrid-Vlasov simulations resolve ion-kinetic effects for modeling the solar wind-magnetosphere interaction, but even 5D (2D + 3V) simulations are computationally expensive. We show that graph-based machine learning emulators can learn the spatiotemporal evolution of electromagnetic fields and lower order moments of ion velocity distribution in the near-Earth space environment from four 5D Vlasiator runs performed with identical steady solar wind conditions. The initial ion number density is systematically varied, while the grid spacing is held constant, to scan the ratio of the characteristic ion skin depth to the numerical grid size. Using a graph neural network architecture operating on the 2D spatial simulation grid comprising 670k cells, we demonstrate that both a deterministic forecasting model (Graph-FM) and a probabilistic ensemble forecasting model (Graph-EFM) based on a latent variable formulation are capable of producing accurate predictions of future plasma states. A divergence penalty is incorporated during training to encourage divergence-freeness in the magnetic fields and improve physical consistency. For the probabilistic model, a continuous ranked probability score objective is added to improve the calibration of the ensemble forecasts. When trained, the emulators achieve more than two orders of magnitude speedup in generating the next time step relative to the original simulation on a single GPU compared to 100 CPUs for the Vlasiator runs, while closely matching physical magnetospheric response of the different runs. These results demonstrate that machine learning offers a way to make hybrid-Vlasov simulation tractable for real-time use while providing forecast uncertainty.",
    "authors": [
      "Daniel Holmberg",
      "Ivan Zaitsev",
      "Markku Alho",
      "Ioanna Bouri",
      "Fanni Franssila",
      "Haewon Jeong",
      "Minna Palmroth",
      "Teemu Roos"
    ],
    "published": "2026-01-18T23:13:23Z",
    "updated": "2026-01-21T04:43:49Z",
    "categories": [
      "physics.space-ph",
      "cs.LG",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2510.17856v3",
    "url": "https://arxiv.org/abs/2510.17856v3",
    "pdf_url": "https://arxiv.org/pdf/2510.17856v3.pdf",
    "title": "Carrier envelope phase and laser pulse shape effects on Schwinger vacuum pair production in super-Gaussian asymmetric electric fields",
    "abstract": "We investigate the combined effects of carrier envelope phase and laser pulse shape on electron-positron pair production in the presence of an external asymmetric super-Gaussian electric field by solving the quantum Vlasov equation. By varying the field asymmetry, the pulse shape from Gaussian to super-Gaussian, and the carrier envelope phase, we show the momentum distribution and the number density of created pairs to exhibit extreme sensitivity to these field characteristics. The effects are also qualitatively explained by analyzing the turning-point structures within the WKB formalism. We observed that multiphoton pair production dominates in the case of long falling-pulse asymmetry. For a short falling pulse with a flat-top super-Gaussian laser profile, pair production is further facilitated. For certain field parameters, we demonstrate that the number density can be enhanced by two to three orders of magnitude.",
    "authors": [
      "Abhinav Jangir",
      "Anees Ahmed"
    ],
    "published": "2025-10-15T05:58:06Z",
    "updated": "2026-01-21T03:55:20Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.21170v2",
    "url": "https://arxiv.org/abs/2510.21170v2",
    "pdf_url": "https://arxiv.org/pdf/2510.21170v2.pdf",
    "title": "Inhomogeneous mixing: From microscopic dynamics to mesoscopic staircases",
    "abstract": "Inhomogeneous mixing and the consequent mesoscopic layered structure have been observed in many physical systems, including magnetically confined fusion plasmas. Especially, in plasmas, mixing can be enhanced through turbulence spreading by intermittent coherent structures (blobs/voids), or suppressed due to the formation of transport barriers (sheared zonal flows). Interestingly, blobs/voids and zonal flows are not independent, and they can co-exist in a state of inhomogeneous mixing, often called the E x B staircase. In this paper, we first introduce recent experimental progress on the physics of blobs/voids: how turbulence spreading by blobs/voids occurs, the consequences of enhanced turbulence spreading for the scrape-off layer (SOL) power decay length, and the interaction between blobs/voids and zonal flows. Then, we provide a brief review of experimental results on staircases, or more generally layered mesoscopic transport barriers. Staircases are often elusive in experiments, requiring integrating multi-diagnostic data, utilizing high-dimensional diagnostics, or extracting hidden information from signals for their identification. Our understanding is still incomplete. This paper serves as an initial step toward applying insights gained from inhomogeneous mixing due to blobs/voids to the understanding of a staircase.",
    "authors": [
      "T. Long",
      "M. J. Choi",
      "P. H. Diamond"
    ],
    "published": "2025-10-24T05:50:33Z",
    "updated": "2026-01-21T02:07:09Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.14583v1",
    "url": "https://arxiv.org/abs/2601.14583v1",
    "pdf_url": "https://arxiv.org/pdf/2601.14583v1.pdf",
    "title": "Two-port CW measurements on RF cavities: Notes on self-consistency assessment and indirect methods",
    "abstract": "In the case of a radio-frequency (RF) cavity with a mismatched input coupler, a direct calculation of the power dissipation in the cavity and the intrinsic quality factor from continuous-wave (CW) measurements may have uncertainty due to systematic errors. Formulae for an indirect calculation of these quantities are derived for the case of a cavity with two couplers of fixed coupling strength. In this approach, the signal from the pickup coupler is used to infer the amplitude of the \"emitted wave\" from the input coupler. A graphical method for self-consistency assessment is evaluated. The impact of frequency offsets is considered. Applications of these methods are presented, drawing on cold tests of superconducting cavities produced for the Facility for Rare Isotope Beams.",
    "authors": [
      "Walter H. Hartung",
      "Wei Chang",
      "Sang-Hoon Kim",
      "Taro Konomi",
      "Ting Xu"
    ],
    "published": "2026-01-21T01:45:25Z",
    "updated": "2026-01-21T01:45:25Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.14508v1",
    "url": "https://arxiv.org/abs/2601.14508v1",
    "pdf_url": "https://arxiv.org/pdf/2601.14508v1.pdf",
    "title": "Super Time Stepping Methods for Diffusion using Discontinuous-Galerkin Spatial Discretizations",
    "abstract": "Super-time-stepping (STS) methods provide an attractive approach for enabling explicit time integration of parabolic operators, particularly in large-scale, higher-dimensional kinetic simulations where fully implicit schemes are impractical. In this work, we present an explicit STS framework tailored for diffusion operators in gyrokinetic models, motivated by the fact that constructing and storing a Jacobian is often infeasible due to strong nonlocal couplings, high dimensionality, and memory constraints. We investigate the performance of several STS methods, including Runge-Kutta-Chebyshev (RKC) and Runge-Kutta-Legendre (RKL) schemes, applied to a diffusion equation discretized using both discontinuous Galerkin (DG) and finite-difference methods. To support time adaptivity, we introduce a novel error norm designed to more accurately track temporal error arising from DG spatial discretizations, in which degrees of freedom contribute unevenly to the solution error. Finally, we assess the performance of an automatic eigenvalue estimation algorithm for determining the required number of STS stages and compare it against an analytical estimation formula.",
    "authors": [
      "Mustafa Aggul",
      "Manaure Francisquez",
      "Daniel R. Reynolds",
      "Sylvia Amihere"
    ],
    "published": "2026-01-20T22:00:44Z",
    "updated": "2026-01-20T22:00:44Z",
    "categories": [
      "math.NA",
      "physics.plasm-ph"
    ],
    "primary_category": "math.NA"
  },
  {
    "arxiv_id": "2601.14471v1",
    "url": "https://arxiv.org/abs/2601.14471v1",
    "pdf_url": "https://arxiv.org/pdf/2601.14471v1.pdf",
    "title": "Understanding Carbon Sourcing and Transport Originating from the Helicon Antenna Surfaces During High-Power Helicon Discharge in DIII-D Tokamak",
    "abstract": "The high-power helicon wave system in the DIII-D tokamak introduces new plasma--material interaction (PMI) challenges due to rectified RF sheath potentials forming near antenna structures and surrounding tiles. Using the STRIPE modeling framework-which integrates SOLPS-ITER, COMSOL, RustBCA, and GITR/GITRm-we simulate carbon erosion, re-deposition, and global impurity transport in two H-mode discharges with varying antenna--plasma gaps and RF powers. COMSOL predicts rectified sheath potentials of 1-5 kV, localized near the bottom of the antenna where magnetic field lines intersect at grazing angles. Erosion is dominated by carbon self-sputtering, with RF-accelerated D+ ions contributing up to 1 % of the total erosion flux. GITRm simulations show that in the small-gap case, only ~ 13 % of eroded carbon is re-deposited locally, with 58 % transported into the core. In contrast, the large-gap case exhibits lower total erosion, along with reduced core penetration (~ 35 %) and weaker re-deposition (~ 4 %), consistent with lower collisionality and limited plasma contact. The simulation trends are consistent with experimental observations, which have not shown elevated core impurity levels during helicon operation in the present graphite-wall configuration. However, under certain plasma conditions and magnetic configurations, the helicon antenna may still act as a finite source of net erosion and core-directed impurity transport, potentially influencing the overall core impurity balance. These findings emphasize the need for sheath-aware antenna designs and predictive impurity transport modeling to support future high-power RF systems with high-Z first wall materials in fusion devices.",
    "authors": [
      "A. Kumar",
      "D. Nath",
      "W. Tierens",
      "J. D. Lore",
      "R. Wilcox",
      "G. Ronchi",
      "M. Shafer",
      "A. Y. Joshi",
      "O. Sahni",
      "M. S. Shephard",
      "B. Van Compernolle",
      "R. I. Pinsker",
      "A. Demby",
      "O. Schmitz"
    ],
    "published": "2026-01-20T20:52:33Z",
    "updated": "2026-01-20T20:52:33Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.14463v1",
    "url": "https://arxiv.org/abs/2601.14463v1",
    "pdf_url": "https://arxiv.org/pdf/2601.14463v1.pdf",
    "title": "Lumped-Element Model of THz HEB Mixer Based on Sputtered MgB2 Thin Film",
    "abstract": "We present a comprehensive analysis and experimental study of THz hot-electron bolometer (HEB) mixers made from 40-nm-thick sputtered magnesium diboride (MgB2) thin films on high-resistivity silicon substrates. Using a lumped-element bolometric model, we achieve strong quantitative agreement with measurements of conversion gain, noise temperature, and local-oscillator (LO) coupling to the HEB devices. Our analysis shows that the sensitivity of current HEB devices is primarily limited by on-chip optical losses, with both Johnson and thermal-fluctuation noise contributing significantly to the overall noise temperature. Simulations of an optimized device with near-ideal optical coupling suggest that Johnson noise remains a substantial factor even with improved coupling. Further reduction of the noise temperature may require additional suppression of Johnson noise (via improved intrinsic conversion gain) beyond optimizing optical coupling efficiency. We emphasize the importance of accurate modeling to achieve good numerical agreement with experiments, thereby enabling understanding of the causes of sensitivity loss.",
    "authors": [
      "Changyun Yoo",
      "Changsub Kim",
      "Daniel P. Cunnane",
      "Boris S. Karasik"
    ],
    "published": "2026-01-20T20:35:50Z",
    "updated": "2026-01-20T20:35:50Z",
    "categories": [
      "cond-mat.supr-con",
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.supr-con"
  },
  {
    "arxiv_id": "2407.13938v2",
    "url": "https://arxiv.org/abs/2407.13938v2",
    "pdf_url": "https://arxiv.org/pdf/2407.13938v2.pdf",
    "title": "Ionization Dynamics in Intense Laser-Produced Plasmas",
    "abstract": "The ionization dynamic of argon plasma irradiated by an intense laser is investigated to understand transient physics in dynamic systems. This study demonstrates that significant delayed ionization responses and stepwise ionization processes are crucial factors in determining the ionization state of such systems. When an intense laser begins to ionize an initially cold argon plasma, the conditions change rapidly, leading to a delayed response in ionization. Consequently, the dynamics do not reach a steady state, even if the electron temperature and density appear unchanged, particularly when the atomic transition process is not sufficiently rapid compared to the relevant time scales. Furthermore, in this case, numerous highly excited states are created primarily through collisional excitation. Thus, even low-energy photons can predominantly ionize plasmas, challenging the conventional belief that such photon energies insufficient to overcome the binding energy of bound electrons typically contribute less to the ionization. These findings underscore the necessity of incorporating these processes in ionization modeling within radiation hydrodynamic simulations for various laser-plasma experiments.",
    "authors": [
      "M. S. Cho",
      "A. L. Milder",
      "W. Rozmus",
      "H. P. Le",
      "H. A. Scott",
      "D. T. Bishel",
      "D. Turnbull",
      "S. B. Libby",
      "M. E. Foord"
    ],
    "published": "2024-07-18T23:33:06Z",
    "updated": "2026-01-20T20:33:28Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1103/PhysRevLett.134.185101"
  },
  {
    "arxiv_id": "2601.14028v1",
    "url": "https://arxiv.org/abs/2601.14028v1",
    "pdf_url": "https://arxiv.org/pdf/2601.14028v1.pdf",
    "title": "XFEL Imaging Techniques for High Energy Density and Inertial Fusion Energy Research at HED-HiBEF",
    "abstract": "The imaging platform developed at the High Energy Density - Helmholtz International Beamline for Extreme Fields (HED-HiBEF) instrument at the European XFEL and its applications to high energy density and fusion related research are presented. The platform combines the XFEL beam with the high-intensity short-pulse laser ReLaX and the high-energy nanosecond-pulse laser DiPOLE-100X. The spatial resolution is better than 500 nm and the temporal resolution of the order of 50 fs. We show examples of blast waves and converging cylindrical shocks in aluminium, resonant absorption measurements of specific charged states in copper with ReLaX and planar shocks in polystyrene material generated by DiPOLE-100X. We also discuss the possibilities introduced by combining this imaging platform with a kJ-class laser.",
    "authors": [
      "Alejandro Laso Garcia",
      "Mikhail Mishchenko",
      "Victorien Bouffetier",
      "Gabriel Perez-Callejo",
      "Karen Appel",
      "Alexey Arefiev",
      "Carsten Baehtz",
      "Erik Brambrink",
      "Mihail Cernaianu",
      "Domenico Doria",
      "Tobias Dornheim",
      "Gillis M. Dyer",
      "Nicolas Fefeu",
      "Eric Galtier",
      "Thomas Gawne",
      "Petru V. Ghenuche",
      "Sebastian Goede",
      "Johannes Hagemann",
      "Marie-Luise Herbert",
      "Hauke Höppner",
      "Lingen Huang",
      "Oliver Humphries",
      "Mae Jones",
      "Dimitri Khaghani",
      "Thomas Kluge",
      "Jayanath Koliyadu",
      "Dominik Kraus",
      "Hae Ja Lee",
      "Julian Lütgert",
      "Mikako Makita",
      "Jean-Paul Naedler",
      "Bob Nagler",
      "Motoaki Nakatsutsumi",
      "Quynh Nguyen",
      "Alexander Pelka",
      "Thomas R. Preston",
      "Chong Bing Qu",
      "Sripati V. Rahul",
      "Lisa Randolph",
      "Ronald Redmer",
      "Martin Rehwald",
      "Hans G. Rinderknecht",
      "Angel Rodriguez-Fernandez",
      "Joao J. Santos",
      "Ulrich Schramm",
      "Michal Smid",
      "Cornelius Strohm",
      "Jergus Strucka",
      "Minxue Tang",
      "Patrik Vagovic",
      "Milenko Vescovi",
      "Long Yang",
      "Karl Zeil",
      "Ulf Zastrau",
      "Thomas E. Cowan",
      "Toma Toncian"
    ],
    "published": "2026-01-20T14:52:33Z",
    "updated": "2026-01-20T14:52:33Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  }
]