{
  "arxiv_id": "2506.10551v2",
  "url": "https://arxiv.org/abs/2506.10551v2",
  "pdf_url": "https://arxiv.org/pdf/2506.10551v2.pdf",
  "title": "Impact of angle-dependent recombination on neutrino energy   reconstruction in LArTPCs",
  "abstract": "The technology of Liquid Argon Time-Projection Chambers (LArTPC) plays a very important role in modern neutrino physics. It allows precise tracking and calorimetry in detectors with very large volume and mass. One important component of LArTPC calorimetric energy reconstruction is the electron-ion recombination effect. Existing experiments have provided constraints to its empirical description, including an explicit dependence on the particle's angle with respect to the TPC's electric field.   In this paper we analyze the impact of angle-dependent recombination models on the reconstruction of neutrino energy in LArTPCs. We examine in detail the predictions of the existing models, showing that there is still considerable uncertainty for the angular dependence prediction at the low values of $dE/dx$ typical of minimum ionizing particles. We apply a simple correction to overcome unphysical predictions in the non-constrained energy loss regions and evaluate the consequences of that in the bias and linearity of electron neutrino energy responses, using generator-level and electron shower simulations for neutrino energies in the range of 0.5-5 GeV. Comparing prediction with and without angular-dependence, we observe an average energy bias between -0.9\\% at 0.5 GeV and -0.6\\% at 5 GeV. While small, these values are close to the typical requirement of 2\\% for the energy scale uncertainty of future experiments, and indicate the need to obtain actual experimental constraints at low $dE/dx$ and take the effect into account in order to achieve the best precision in future LAr TPC electron neutrino calorimetry.",
  "authors": [
    "J. Vences",
    "J. Maneira",
    "C. Vilela"
  ],
  "published": "2025-06-12T10:18:43Z",
  "updated": "2025-08-28T12:02:33Z",
  "categories": [
    "hep-ex",
    "physics.ins-det"
  ],
  "primary_category": "hep-ex"
}