{
  "arxiv_id": "2106.11404v15",
  "url": "https://arxiv.org/abs/2106.11404v15",
  "pdf_url": "https://arxiv.org/pdf/2106.11404v15.pdf",
  "title": "Maintaining a discharge using a travelling electromagnetic wave results in a linear decrease in electron density along the plasma column. This distribution corresponds to the power dissipated by the wave to heat electrons in the gas",
  "abstract": "A new category of plasma emerged at the end of the 1970s. It consists of a column of plasma maintained by the electric field component of radiofrequency (RF) and microwave (MW) waves that propagate at the interface between the outer surface of the dielectric tube containing the plasma and the ambient air (vacuum). This plasma column is known as a travelling wave discharge (TWD) and has the property that its length increases with the absorbed RF and MW power. It is also perfectly stable and reproducible. The electron density of this plasma column decreases linearly along its axis until it drops abruptly to a non-zero value, marking the end of wave propagation. The slope of its distribution depends solely on the externally set operating parameters, namely the pressure of the carrier gas, the frequency of the wave and the inner radius of the discharge tube. The model presented in this article is the only one that can reproduce all the experimental data exactly, particularly that relating to the end of the column, a feat that no other published model has achieved. Most publications on TWDs nowadays concern applications, and this field is growing all the time. Interest in TWDs began with the arrival of efficient RF and MW field applicators, which occupy only a few centimetres of the resulting plasma column that can eventually extend to several metres. The Surfatron, Surfaguide, waveguide Surfatron, Ro-Box and TIAGO (plasma in ambient gas) are all devices that are already in widespread use. All these devices have been patented, which testifies to the interest in the potential applications of TWDs. Another outstanding feature is their unrivalled wide range of operating parameters: gas pressure p (from a few mTorr (Pa) to at least twice atmospheric pressure); field frequency f (from a few MHz to at least 10 GHz); and tube inner radius R (from 0.5 mm to at least 150 mm)",
  "authors": [
    "Michel Moisan"
  ],
  "published": "2021-06-21T20:37:34Z",
  "updated": "2025-11-15T17:33:11Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}