{
  "arxiv_id": "2507.22145v3",
  "url": "https://arxiv.org/abs/2507.22145v3",
  "pdf_url": "https://arxiv.org/pdf/2507.22145v3.pdf",
  "title": "High-Precision Relativistic Time Scales for Cislunar Navigation",
  "abstract": "We present a unified post-Newtonian framework for relativistic timing and coordinate transformations covering six time scales (TCB, TCG, TT, TDB, TCL, TL) and three reference systems (BCRS, GCRS, LCRS). Extending the IAU conventions, we define a Lunicentric Celestial Reference System (LCRS) metric that retains all contributions above a fractional threshold of 5 x 10^{-18} and timing terms above 0.1 ps by expanding the lunar gravity field to spherical-harmonic degree l=9 with Love number variations and including external tidal and inertial multipoles to the octupole. We derive closed-form mappings among TCB, TCG, TT, TCL and TL, yielding proper-to-coordinate time transformations and two-way time-transfer corrections at sub-picosecond accuracy. We evaluate secular rate constants and periodic perturbations arising from kinematic dilation, lunar monopole and multipoles, Earth tides and gravitomagnetic effects for clocks on the lunar surface, in very low and low lunar orbits (vLLO/LLO), in elliptical lunar frozen orbits (ELFOs), at the Earth-Moon L1 point, and in near-rectilinear halo orbits (NRHOs). Our analysis demonstrates that harmonics through l=9 and tides through l=8 are sufficient to achieve 5 x 10^{-18} fractional stability for deep cislunar regimes (e.g., NRHO, Earth-Moon L1), supporting sub-picosecond clock synchronization and centimeter-level navigation; near-surface and vLLO realizations generally require a much higher spherical-harmonic degree, l_max >= 300, to meet the same stability goal. This framework underpins high-precision time and frequency transfer, relativistic geodesy, quantum communication links and fundamental physics experiments beyond low Earth orbit.",
  "authors": [
    "Slava G. Turyshev"
  ],
  "published": "2025-07-29T18:21:03Z",
  "updated": "2025-11-15T06:11:50Z",
  "categories": [
    "gr-qc",
    "astro-ph.IM",
    "physics.app-ph",
    "physics.ins-det"
  ],
  "primary_category": "gr-qc"
}