{
  "arxiv_id": "2511.12314v1",
  "url": "https://arxiv.org/abs/2511.12314v1",
  "pdf_url": "https://arxiv.org/pdf/2511.12314v1.pdf",
  "title": "High frame rate RIXS spectroscopy using a JUNGFRAU detector with an iLGAD sensor",
  "abstract": "Resonant inelastic X-ray scattering (RIXS) is a powerful photon-in, photon-out spectroscopy technique for probing electronic, magnetic, and lattice excitations in matter. Time-resolved RIXS extends this capability through a stroboscopic optical pump-probe scheme to characterize the time evolution of the photoexcitation and subsequent relaxation dynamics of a sample. This technique is, however, extremely photon-hungry, requiring high-repetition-rate and intense X-ray facilities. The Heisenberg RIXS (hRIXS) spectrometer at the Spectroscopy and Coherent Scattering (SCS) instrument of the European X-ray Free-Electron Laser (EuXFEL) is designed to exploit high-repetition-rates, while maintaining optimal time and energy resolution. In this work, we demonstrate the successful deployment of a JUNGFRAU detector equipped with an inverse Low Gain Avalanche Diode (iLGAD) sensor for time-resolved RIXS studies in the soft X-ray range, using the hRIXS spectrometer. A spatial resolution of $19.71 \\pm 0.7~μ\\mathrm{m}$ and a resolving power exceeding 10,000 were achieved at an unprecedented frame rate of 47 kHz. Intra-train resolved data measured with a high FEL peak fluence of $1.8~\\mathrm{mJ/cm^{2}}$ for a 928.5 eV ph photon energy and 1.1 MHz repetition rate from cupric oxide (CuO) revealed a decrease in the emitted signal by ~10% over a time interval of $340~μ\\mathrm{s}$, indicating FEL-induced effects that require monitoring when conducting high-repetition-rate experiments. These results establish the JUNGFRAU-iLGAD as a promising detector to harvest the full potential of the hRIXS spectrometer, and validate its suitability for soft X-ray applications.",
  "authors": [
    "Nuno Duarte",
    "Loïc Le Guyader",
    "Viktoria Hinger",
    "Marco Ramilli",
    "Justine Schlappa",
    "Robert Carley",
    "Maria Carulla",
    "Yi-Ping Chang",
    "Devesh Chopra",
    "Natalia Gerasimova",
    "Michael Grimes",
    "Aldo Mozzanica",
    "Sergii Parchenko",
    "Le Phuong Hoang",
    "Urs Staub",
    "Jiaguo Zhang",
    "Anna Bergamaschi",
    "Andreas Scherz",
    "Bernd Schmitt",
    "Monica Turcato"
  ],
  "published": "2025-11-15T18:01:56Z",
  "updated": "2025-11-15T18:01:56Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}