{
  "arxiv_id": "2511.09960v2",
  "url": "https://arxiv.org/abs/2511.09960v2",
  "pdf_url": "https://arxiv.org/pdf/2511.09960v2.pdf",
  "title": "High-throughput Parasitic-independent Probe Thermal Resistance Calibration for Robust Thermal Mapping with Scanning Thermal Microscopy",
  "abstract": "Nanostructured materials, critical for thermal management in semiconductor devices, exhibit a strong size dependence in thermal transport. Specifically, studying the variation of thermal resistance across grain boundaries is of critical importance in designing effective thermal interface materials for heterogeneous integration. Frequency-domain Thermoreflectance (FDTR)-based techniques can provide thermal resistance mapping at the micrometer length scale. Scanning Thermal Microscopy (SThM) has the potential for quantifying local thermal transport with orders of magnitude higher spatial resolution (<100 nm). However, challenges in accurately converting the raw signal to thermal conductivity and accounting for surface sensitivity limit its widespread adoption as a characterization standard for understanding nanoscale heat transport and defect-mediated modulation of thermal properties in nanostructured films. Here, we introduce a circuit-based probe thermal resistance (Rp) calibration technique that is independent of parasitic heat transport pathways; this calibration enables accurate measurement of the heat dissipated from the SThM probe and the resulting tip temperature change to extract the thermal resistance of the film (Rth). Following calibration, SThM achieved sub-100 nm spatial resolution in mapping thermal resistance across a 15 nm-thick Al film deposited by e-beam evaporation on a SiO2 substrate. Finally, the thermal resistance mapping is converted to thermal conductivity using a finite-element-modeling-based calibration approach, where the average of the pixel-level Rth values yields an effective thermal conductivity of 2.87 +/- 0.18 W m^-1 K^-1, in good agreement with published theoretical frameworks describing heat transport in ultrathin Al.",
  "authors": [
    "Ram Munde",
    "Heng-Ray Chuang",
    "Raisul Islam"
  ],
  "published": "2025-11-13T04:42:28Z",
  "updated": "2025-11-18T16:25:52Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}