{
  "arxiv_id": "2502.07195v2",
  "url": "https://arxiv.org/abs/2502.07195v2",
  "pdf_url": "https://arxiv.org/pdf/2502.07195v2.pdf",
  "title": "First experimental proof of PET imaging based on multi-anode MCP-PMTs   with Cherenkov radiator-integrated window",
  "abstract": "Improving the coincidence time resolution (CTR) of time-of-flight positron emission tomography (TOF-PET) systems to achieve a higher signal-to-noise ratio (SNR) gain or even direct positron emission imaging (dPEI) is of paramount importance for many advanced new clinical applications of PET imaging. This places higher demands on the timing performance of all aspects of PET systems. One effective approach is to use microchannel plate photomultiplier tubes (MCP-PMTs) for prompt Cherenkov photon detection. In this study, we developed a dual-module Cherenkov PET imaging experimental platform, utilising our proprietary 8 * 8-anode Cherenkov radiator-integrated window MCP-PMTs in combination with custom-designed multi-channel electronics, and designed a specific calibration and correction method for the platform. Using this platform, a CTR of 103 ps FWHM was achieved. We overcame the limitations of single-anode detectors in previous experiments, significantly enhanced imaging efficiency and achieved module-level Cherenkov PET imaging for the first time. Imaging experiments involving radioactive sources and phantoms of various shapes and types were conducted, which preliminarily validated the feasibility and advancement of this imaging method. In addition, the effects of normalisation correction and the interaction probability between the gamma rays and the MCP on the images and experimental results were analysed and verified.",
  "authors": [
    "Weiyan Pan",
    "Lingyue Chen",
    "Guorui Huang",
    "Jun Hu",
    "Wei Hou",
    "Xianchao Huang",
    "Xiaorou Han",
    "Xiaoshan Jiang",
    "Zhen Jin",
    "Daowu Li",
    "Jingwen Li",
    "Shulin Liu",
    "Zehong Liang",
    "Lishuang Ma",
    "Zhe Ning",
    "Sen Qian",
    "Ling Ren",
    "Jianning Sun",
    "Shuguang Si",
    "Yunhua Sun",
    "Long Wei",
    "Ning Wang",
    "Qing Wei",
    "Qi Wu",
    "Tianyi Wang",
    "Xin Wang",
    "Xingchao Wang",
    "Yangfu Wang",
    "Yifang Wang",
    "Yingjie Wang",
    "Zhi Wang",
    "Hang Yuan",
    "Jingbo Ye",
    "Xiongbo Yan",
    "Meiling Zhu",
    "Zhiming Zhang"
  ],
  "published": "2025-02-11T02:37:26Z",
  "updated": "2025-10-14T08:17:11Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}