{
  "arxiv_id": "2505.09023v2",
  "url": "https://arxiv.org/abs/2505.09023v2",
  "pdf_url": "https://arxiv.org/pdf/2505.09023v2.pdf",
  "title": "Probing arbitrary polarized photon pairs undergoing double Compton   scatterings by a dedicated MC simulator validated with experimental data",
  "abstract": "Quantum correlations in the polarization degrees of freedom of the two-photon system have been extensively studied and form our current understanding of the quantum nature of our world. Most of the studies are concentrated on the low-energy (optical) photon pairs, for which efficient polarization measurement devices exist. However, for high-energetic (MeV) pairs of photons, e.g. produced in the decay of positronium atoms, no polarizers are available. Partial information about the polarization degree of freedom can be extracted by exploiting the measurements of photon pairs that undergo double Compton scattering. We present a Geant4-based Monte Carlo Vienna-Warsaw model capable of simulating any initial polarization state of bipartite photons. This puts us in a position to derive the behavior of the experimental observable, the angular difference $\\Delta\\hat\\Phi$ formed by the two scattering planes. We validate our Vienna-Warsaw simulator with the high-statistics experimental sample -- based on a total of $3 \\times 10^5 $ event candidates -- of two-photon pairs measured with the J-PET Big Barrel detector. We deduce the value of the squared visibility (interference contrast) encoding the polarization in the angle difference of the two scattering planes, $\\Delta\\hat\\Phi$. The simulated spectra are in good agreement with the experimental correlation spectra and behave as predicted by theory.",
  "authors": [
    "M. Bala",
    "W. Krzemien",
    "B. C. Hiesmayr",
    "J. Baran",
    "K. Dulski",
    "K. Klimaszewski",
    "L. Raczynski",
    "R. Y. Shopa",
    "W. Wislicki"
  ],
  "published": "2025-05-13T23:37:02Z",
  "updated": "2025-10-13T05:58:28Z",
  "categories": [
    "physics.ins-det",
    "physics.med-ph",
    "quant-ph"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.1140/epjc/s10052-025-14862-y"
}