{
  "arxiv_id": "2510.11741v1",
  "url": "https://arxiv.org/abs/2510.11741v1",
  "pdf_url": "https://arxiv.org/pdf/2510.11741v1.pdf",
  "title": "Enhancing the mass resolving power of FRIB's proposed high-voltage   MR-ToF mass separator and spectrometer: addressing non-ideal conditions",
  "abstract": "Multi-reflection time-of-flight mass separators and spectrometers (MR-ToF MSs) are indispensable tools at radioactive ion beam (RIB) facilities. These electrostatic ion beam traps act as highly selective mass separators and high-precision mass spectrometers for rare and exotic nuclei. When well-tuned and designed to minimize higher-order flight-time aberrations, state-of-the-art MR-ToF MSs approach, and slightly exceed, mass resolving powers of \\( m / \\Delta m = 10^6 \\). Achieving \\( m / \\Delta m > 3 \\cdot 10^6 \\) would provide the ability to resolve \\( >90\\% \\) of all known isomeric states with half-lives above 10~\\text{ms}. However, the ability to mass separate in all practical setups is limited by non-ideal conditions which place such resolving powers out of reach. To this end, we present a simulated analysis of these conditions in the newly proposed high-voltage MR-ToF MS for the Facility for Rare Isotope Beams (FRIB). It is expected to store ions at 30~\\text{keV} beam energy and increase ion throughput by two orders of magnitude compared to current devices. Existing efforts to mitigate the effects of non-ideal conditions employed for current MR-ToF devices storing ions at \\( <3~\\text{keV} \\) beam energy will already enable mass resolving powers approaching \\( 10^6 \\) for FRIB's high-voltage MR-ToF device. Simulations of newly proposed mitigation strategies show that even mass resolving powers approaching \\( 10^7 \\) might become feasible.",
  "authors": [
    "Christian Michael Ireland",
    "Franziska Maria Maier",
    "Einstein Dhayal",
    "Erich Leistenschneider",
    "Ryan Ringle",
    "Austin Sjaarda"
  ],
  "published": "2025-10-10T21:03:16Z",
  "updated": "2025-10-10T21:03:16Z",
  "categories": [
    "physics.ins-det",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det"
}