{
  "arxiv_id": "2510.11929v1",
  "url": "https://arxiv.org/abs/2510.11929v1",
  "pdf_url": "https://arxiv.org/pdf/2510.11929v1.pdf",
  "title": "Bond-resolved STM with density-based methods",
  "abstract": "Bond-resolved STM (BRSTM) is a recent technique that combines the advantages of scanning tunneling microscopy (STM) with the outstanding intramolecular resolution provided by non-contact atomic force microscopy (ncAFM) using a CO-functionalized tips, offering unique insights into molecular interactions at surfaces. In this work, we present a novel and easily implementable approach for simulating BRSTM images, which we have applied to reproduce new experimental BRSTM data of Perylene-3,4,9,10-tetracarboxylic dianhydride (PTCDA) on Ag(111), obtained with unprecedented control of tip-sample separation ($\\sim$10~pm). Our method integrates the Full-Density-Based Model (FDBM) developed for High-Resolution Atomic Force Microscopy (HRAFM) with Chen's derivative approximation for tunneling channels, effectively capturing the contributions of both $\\sigma$ and $\\pi$ channels, while accounting for the CO-tip deflection induced by probe-sample interactions. This approach accurately reproduces the experimental results for both PTCDA/Ag(111) and 1,5,9-trioxo-13-azatriangulene (TOAT)/Cu(111) systems, including intricate tip-sample distance-dependent features. Furthermore, we also demonstrate the important role of substrate-induced effects, which can modify molecular orbital occupation and the relaxation of the CO probe, resulting in distinct BRSTM image characteristics.",
  "authors": [
    "Emiliano Ventura-Macias",
    "Jose Martinez-Castro",
    "Guillermo Haas",
    "Jara Trujillo-Mulero",
    "Pablo Pou",
    "Taner Esat",
    "Markus Ternes",
    "Ruslan Temirov",
    "F. Stefan Tautz",
    "Ruben Perez"
  ],
  "published": "2025-10-13T20:50:32Z",
  "updated": "2025-10-13T20:50:32Z",
  "categories": [
    "cond-mat.mtrl-sci",
    "physics.ins-det"
  ],
  "primary_category": "cond-mat.mtrl-sci"
}