{
  "arxiv_id": "2510.12142v1",
  "url": "https://arxiv.org/abs/2510.12142v1",
  "pdf_url": "https://arxiv.org/pdf/2510.12142v1.pdf",
  "title": "Polar Filaments Capture High Latitude Solar Poloidal Field Interactions   and can Foretell the Future Sunspot Cycle Amplitude before Polar Field   Precursors",
  "abstract": "Polar fields at the minimum of a sunspot cycle -- which are a manifestation of the radial component of the Sun's poloidal field -- are deemed to be the best indicator of the strength of the toroidal component, and hence the amplitude of the future sunspot cycle. However, the Sun's polar magnetic fields are difficult to constrain with ground-based or space-based observations from near the plane-of-ecliptic. In this context, polar filaments -- dark, elongated structures that overlie polarity inversion lines -- are known to offer critical insights into solar polar field dynamics. Through investigations of the long-term evolution of polar filament areas and length acquired from the Meudon Observatory and complimentary solar surface flux transport simulations, here we establish the common physical foundation connecting the Babcock-Leighton solar dynamo mechanism of solar polar field reversal and build-up with the origin and evolution of polar filaments. We discover a new relationship connecting the residual filament area of adjacent solar cycles with the amplitude of the next sunspot cycle -- which can serve as a new tool for solar cycle forecasts -- advancing the forecast window to earlier than polar field based precursors. We conclude that polar filament properties encapsulate the physics of interaction of the poloidal magnetic field of the previous and current sunspot cycles, the resultant of which is the net poloidal magnetic field at the end of the current cycle, thus encoding as a precursor the strength of the upcoming solar cycle.",
  "authors": [
    "Srinjana Routh",
    "Shaonwita Pal",
    "Dibyendu Nandy",
    "Subhamoy Chatterjee",
    "Dipankar Banerjee",
    "Mohd. Saleem Khan"
  ],
  "published": "2025-10-14T04:49:00Z",
  "updated": "2025-10-14T04:49:00Z",
  "categories": [
    "astro-ph.SR",
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.SR"
}