{
  "arxiv_id": "2512.04965v2",
  "url": "https://arxiv.org/abs/2512.04965v2",
  "pdf_url": "https://arxiv.org/pdf/2512.04965v2.pdf",
  "title": "Characterization of thin optical filters for high purity Cherenkov light readout from scintillating crystals",
  "abstract": "A hybrid dual-readout calorimeter concept, comprising both electromagnetic and hadronic sections, has recently been proposed to meet the performance requirements of experiments at future e$^{+}$e$^{-}$ colliders. The front compartment consists of a homogeneous electromagnetic calorimeter made of high-density crystals, each coupled to a pair of Silicon Photomultipliers (SiPMs) providing the simultaneous readout of scintillation and Cherenkov light. To efficiently detect Cherenkov photons in the presence of dominant scintillation signals, an optical filter is placed in front of one of the two SiPMs to suppress photons in the wavelength region corresponding to that of scintillation emission. % In this study, PWO, BGO, and BSO crystals with different dimensions were tested to measure their scintillation light yield and decay time, as well as their transmission and emission spectra. A set of $\\sim 100~\\rm μm$-thick optical filters was also characterized by measuring their transmittance curves. The experimental results were used to model and estimate the expected filter performance in attenuating scintillation light for the various crystals. % The performance of each filter was experimentally validated by measuring the crystal light output with and without the filter using a $^{22}$Na radioactive source and a LYSO:Ce crystal, confirming the accuracy of the calculations. % The results show that interference filters are unsuitable for this application because their transmittance strongly depends on the photon incidence angle. Conversely, two absorptive long-pass filters with cutoff wavelengths around 590~nm were found to block more than 99\\% of the scintillation light from PWO crystals, satisfying the calorimeter specifications.",
  "authors": [
    "Andrea Benaglia",
    "Flavia Cetorelli",
    "Marco Toliman Lucchini",
    "Etiennette Auffray",
    "Louis Roux",
    "Julie Delenne"
  ],
  "published": "2025-12-04T16:33:45Z",
  "updated": "2026-02-05T12:20:12Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}