{
  "arxiv_id": "2602.03273v1",
  "url": "https://arxiv.org/abs/2602.03273v1",
  "pdf_url": "https://arxiv.org/pdf/2602.03273v1.pdf",
  "title": "Production of GEM-like structures for cryogenic applications, using laser-cutting techniques",
  "abstract": "A novel concept for electroluminescence (EL) structures was recently proposed. In it, a wavelength-shifting material is deposited inside the holes of GEM-like structures which, after suitable optical treatment of its electrodes, improves the light collection and detection efficiency in noble gas TPCs. This new development directly addresses problems related with the scalability of future dual-phase TPCs for rare-event searches, matching (and potentially exceeding) the performance of conventional EL techniques.   We report the newest developments on the production of such structures using laser-based techniques, namely the manufacture of a first batch of the so-called FAT-GEMs. This process allows low-cost and reproducible manufacturing of a high volume of such structures.   In addition to the detailed description of the production, we present a performance assessment in pure argon, at a gas density close to the one expected in LAr conditions. An energy resolution of 23.5$\\pm$1~\\% (FWHM) at 5.9~keV was obtained, indicating a consistent improvement over previous batch. The optical treatment of the electrode surfaces has been greatly simplified and modestly improved, while charging-up effects arising from the use of laminates eliminated.",
  "authors": [
    "D. Rodas-Rodríguez",
    "A. F. V. Cortez",
    "M. Kuźniak",
    "D. González-Díaz",
    "P. A. O. C. Silva",
    "A. Gnat",
    "G. Nieradka",
    "T. Sworobowicz",
    "E. Alario",
    "C. D. R. Azevedo",
    "K. T. Floethner",
    "P. Gasik",
    "J. Llerena",
    "C. M. B. Monteiro",
    "R. Oliveira",
    "A. Pallas",
    "D. Tenreiro",
    "V. Peskov",
    "J. M. F. dos Santos"
  ],
  "published": "2026-02-03T08:58:10Z",
  "updated": "2026-02-03T08:58:10Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}