[
  {
    "arxiv_id": "2602.05782v1",
    "url": "https://arxiv.org/abs/2602.05782v1",
    "pdf_url": "https://arxiv.org/pdf/2602.05782v1.pdf",
    "title": "Vacuum Brazing",
    "abstract": "First, we describe vacuum brazing and vacuum soldering. Then, we demonstrate how vacuum assists in reducing specific metal oxides, significantly enhancing the wetting of the braze material. Examples of metal-to-metal brazing and soldering are provided. The brazing of large accelerating cavities, specifically Radio Frequency Quadrupoles (RFQ), is then explained in more detail to present a comprehensive procedure tailored for high-precision, large-scale assemblies. Finally, we discuss the process of brazing ceramics using both techniques: with metallisation and with active brazing alloy.",
    "authors": [
      "Serge Mathot"
    ],
    "published": "2026-02-05T15:39:17Z",
    "updated": "2026-02-05T15:39:17Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.05714v1",
    "url": "https://arxiv.org/abs/2602.05714v1",
    "pdf_url": "https://arxiv.org/pdf/2602.05714v1.pdf",
    "title": "Detecting gravitational wave background with equivalent configurations in the network of space based optical lattice clocks",
    "abstract": "The network of space based optical lattice clocks (OLCs) has been proposed to detect the stochastic gravitational wave background. We investigate the overlap reduction function (ORF) of the OLC detector network and analytically derive a transformation that leaves the ORF invariant. This transformation is applicable to configurations with two OLC detectors, each equipped with a one-way link. It can map a configuration with small separation and high noise correlation to another configuration with larger separation and reduced noise correlation. Using this transformation, we obtain a favourable OLC detector network configuration with high cross-correlation response, and compare its sensitivity to that of space-based laser interferometer gravitational wave detectors.",
    "authors": [
      "Mingzhi Lou",
      "Hong Su",
      "Tao Yang",
      "Yun-Long Zhang"
    ],
    "published": "2026-02-05T14:39:31Z",
    "updated": "2026-02-05T14:39:31Z",
    "categories": [
      "gr-qc",
      "astro-ph.CO",
      "astro-ph.IM",
      "hep-ph",
      "physics.ins-det"
    ],
    "primary_category": "gr-qc"
  },
  {
    "arxiv_id": "2504.09264v3",
    "url": "https://arxiv.org/abs/2504.09264v3",
    "pdf_url": "https://arxiv.org/pdf/2504.09264v3.pdf",
    "title": "Exploring the Design and Measurements of Next-Generation 4H-SiC LGADs",
    "abstract": "This contribution presents the design, production, and initial testing of newly developed 4H-SiC Low Gain Avalanche Detectors (LGADs). The evaluation includes performance metrics such as the internal gain layer's efficiency in enhancing signal generation. Initial laboratory and Transient Current Technique (TCT) measurements provide insight into the device's stability and response to the signal.   Due to the increase of availability provided by the industry, 4H-SiC is emerging as a strong candidate for the next-generation of semiconductor detectors. Such sensors are promising due to the inherent radiation tolerance of 4H-SiC and its stable operation across a wide temperature range. However, due to the wider-bandgap of 4H-SiC compared to standard silicon, and difficulty to produce high-quality layers thicker than 50 \\textmu m, an internal charge multiplication layer needs to be introduced.   The presented 4H-SiC LGADs, fabricated by onsemi, are optimized for an N-type substrate and epi wafer. The initial TCT and laboratory test results demonstrate fast charge collection and uniform multiplication across multiple samples produced on a single wafer.",
    "authors": [
      "Peter Švihra",
      "Jan Chochol",
      "Vladimír Kafka",
      "Adam Klimsza",
      "Adam Kozelsky",
      "Jiří Kroll",
      "Roman Malousek",
      "Mária Marčišovská",
      "Michal Marčišovský",
      "Marcela Mikeštíková",
      "Michael Moll",
      "David Novák",
      "Radek Novotný",
      "Peter Slovák",
      "Radim Špetík",
      "Moritz Wiehe"
    ],
    "published": "2025-04-12T15:54:38Z",
    "updated": "2026-02-05T14:17:24Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1016/j.nima.2025.170742"
  },
  {
    "arxiv_id": "2602.05653v1",
    "url": "https://arxiv.org/abs/2602.05653v1",
    "pdf_url": "https://arxiv.org/pdf/2602.05653v1.pdf",
    "title": "Dispersion in nonlinear interferometry: implications for optical coherence tomography with undetected photons",
    "abstract": "Nonlinear SU(1,1) quantum interferometers based on non-degenerate optical parametric down-conversion exhibit strong unbalanced group velocity dispersion (GVD). This feature is intrinsic to this type of interferometer as correlated photons of vastly different frequencies propagate through a dispersive nonlinear crystal; consequently, the dispersion arises from the source itself. The resulting GVD degrades the axial point-spread function (PSF) in optical coherence tomography (OCT) with undetected photons; and physical compensation is less straightforward, in particular for non-degenerate broadband regimes due to the limited number of suitable materials. In this contribution, we analyze dispersion in bulk nonlinear interferometry and describe its implications for OCT imaging. Aspects of hardware compensation are addressed, and a novel empirical numerical method of compensation is proposed. The approach is based on the extraction of the phase component directly from the time-domain modality (high precision linearized quantum Fourier transform infrared spectrometer) and its injection into the mid-IR spectral-domain OCT signals (central wavelength of around 3770 nm) before the Fourier transform. The proposed method is compared with an alternative numerical technique. The results demonstrate a 2.2-fold improvement in axial resolution and outperform the alternative correction method in overall imaging performance.",
    "authors": [
      "Ivan Zorin",
      "Paul Gattinger"
    ],
    "published": "2026-02-05T13:35:59Z",
    "updated": "2026-02-05T13:35:59Z",
    "categories": [
      "physics.optics",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2512.04965v2",
    "url": "https://arxiv.org/abs/2512.04965v2",
    "pdf_url": "https://arxiv.org/pdf/2512.04965v2.pdf",
    "title": "Characterization of thin optical filters for high purity Cherenkov light readout from scintillating crystals",
    "abstract": "A hybrid dual-readout calorimeter concept, comprising both electromagnetic and hadronic sections, has recently been proposed to meet the performance requirements of experiments at future e$^{+}$e$^{-}$ colliders. The front compartment consists of a homogeneous electromagnetic calorimeter made of high-density crystals, each coupled to a pair of Silicon Photomultipliers (SiPMs) providing the simultaneous readout of scintillation and Cherenkov light. To efficiently detect Cherenkov photons in the presence of dominant scintillation signals, an optical filter is placed in front of one of the two SiPMs to suppress photons in the wavelength region corresponding to that of scintillation emission. % In this study, PWO, BGO, and BSO crystals with different dimensions were tested to measure their scintillation light yield and decay time, as well as their transmission and emission spectra. A set of $\\sim 100~\\rm μm$-thick optical filters was also characterized by measuring their transmittance curves. The experimental results were used to model and estimate the expected filter performance in attenuating scintillation light for the various crystals. % The performance of each filter was experimentally validated by measuring the crystal light output with and without the filter using a $^{22}$Na radioactive source and a LYSO:Ce crystal, confirming the accuracy of the calculations. % The results show that interference filters are unsuitable for this application because their transmittance strongly depends on the photon incidence angle. Conversely, two absorptive long-pass filters with cutoff wavelengths around 590~nm were found to block more than 99\\% of the scintillation light from PWO crystals, satisfying the calorimeter specifications.",
    "authors": [
      "Andrea Benaglia",
      "Flavia Cetorelli",
      "Marco Toliman Lucchini",
      "Etiennette Auffray",
      "Louis Roux",
      "Julie Delenne"
    ],
    "published": "2025-12-04T16:33:45Z",
    "updated": "2026-02-05T12:20:12Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.06545v2",
    "url": "https://arxiv.org/abs/2508.06545v2",
    "pdf_url": "https://arxiv.org/pdf/2508.06545v2.pdf",
    "title": "Neural Networks for 3D Characterisation of AGATA Crystals",
    "abstract": "Precise localisation of gamma-ray interactions is crucial for the performance of the Advanced GAmma Tracking Array (AGATA). The Pulse Shape Analysis (PSA) method used for the position estimation of gamma-ray interactions relies on a simulated signal database. The Pulse Shape Comparison Scanning (PSCS) method was used to scan AGATA crystals in order to produce an experimental database of signals. This paper presents a novel approach using Long Short-Term Memory (LSTM) neural networks to determine the 3D interaction position of gamma rays within AGATA crystals, trained on data from IPHC Strasbourg, allowing for the construction of an experimental database. A custom masked loss function is introduced to enable training with incomplete position information. The database generated by this new method outperforms the existing simulated database, and the experimental database obtained from the conventional PSCS algorithm.",
    "authors": [
      "Mojahed Abushawish",
      "Guillaume Baulieu",
      "Jérémie Dudouet",
      "Olivier Stézowski"
    ],
    "published": "2025-08-05T20:42:45Z",
    "updated": "2026-02-05T11:35:34Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1140/epja/s10050-026-01793-9"
  },
  {
    "arxiv_id": "2510.11469v3",
    "url": "https://arxiv.org/abs/2510.11469v3",
    "pdf_url": "https://arxiv.org/pdf/2510.11469v3.pdf",
    "title": "Optimised neural networks for online processing of ATLAS calorimeter data on FPGAs",
    "abstract": "A study of neural network architectures for the reconstruction of the energy deposited in the cells of the ATLAS liquid-argon calorimeters under high pile-up conditions expected at the HL-LHC is presented. These networks are designed to run on the FPGA-based readout hardware of the calorimeters under strict size and latency constraints. Several architectures, including Dense, Recurrent (RNN), and Convolutional (CNN) neural networks, are optimised using a Bayesian procedure that balances energy resolution against network size. The optimised Dense, CNN, and combined Dense+RNN architectures achieve a transverse energy resolution of approximately 80 MeV, outperforming both the optimal filtering (OF) method currently in use and RNNs of similar complexity. A detailed comparison across the full dynamic range shows that Dense, CNN, and Dense+RNN accurately reproduce the energy scale, while OF and RNNs underestimate the energy. Deep Evidential Regression is implemented within the Dense architecture to address the need for reliable per-event energy uncertainties. This approach provides predictive uncertainty estimates with minimal increase in network size. The predicted uncertainty is found to be consistent, on average, with the difference between the true deposited energy and the predicted energy.",
    "authors": [
      "Georges Aad",
      "Raphael Bertrand",
      "Lauri Laatu",
      "Emmanuel Monnier",
      "Arno Straessner",
      "Nairit Sur",
      "Johann C. Voigt"
    ],
    "published": "2025-10-13T14:38:56Z",
    "updated": "2026-02-05T11:17:46Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1140/epjc/s10052-026-15321-y"
  },
  {
    "arxiv_id": "2512.20356v2",
    "url": "https://arxiv.org/abs/2512.20356v2",
    "pdf_url": "https://arxiv.org/pdf/2512.20356v2.pdf",
    "title": "Optimizing the interaction geometry of inverse Compton scattering x-ray sources",
    "abstract": "Inverse Compton scattering (ICS) is a promising method for generating coherent and tunable x-rays in a compact setup. In this paper, we present a theoretical framework describing the output of an ICS x-ray source for arbitrary interaction angles between pulsed electron and laser beams. This allows for analytic optimization of the x-ray beam properties by varying the parameters defining the geometry. In general, different x-ray applications require optimization of different x-ray beam properties, such as energy spread for x-ray spectroscopy and angular spread for x-ray scattering measurements. In this paper, we restrict ourselves to optimization of the x-ray brilliance, which is a comprehensive figure of merit for x-ray beam quality. We investigate two specific ICS interaction geometries in particular: head-on scattering of a laser beam off an electron beam; and scattering of a laser beam off an electron beam in a co-propagating geometry, interacting under a grazing angle. For head-on scattering we show that a tightly focused, cylindrically symmetric laser pulse, which balances laser intensity and interaction time, optimizes the x-ray brilliance. For a co-propagating, grazing angle geometry, an elliptical focus of the laser pulse is required to mitigate the effect of a reduced interaction time. We find that the latter geometry is especially useful for soft x-ray generation.",
    "authors": [
      "C. W. Sweers",
      "O. J. Luiten"
    ],
    "published": "2025-12-23T13:37:11Z",
    "updated": "2026-02-05T10:43:15Z",
    "categories": [
      "physics.acc-ph",
      "physics.optics"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.05530v1",
    "url": "https://arxiv.org/abs/2602.05530v1",
    "pdf_url": "https://arxiv.org/pdf/2602.05530v1.pdf",
    "title": "High-intensity LINACS: Dynamics, Instabilities and Mitigations",
    "abstract": "In this lecture we discuss the intensity limitations in hadron LINACs. First, we will detail what are the two main meanings of intensity limitations as they differ substantially between high power LINACs and high brightness LINACs. Then we will illustrate in detail the building blocks of hadron linacs focusing on the beam dynamics. We will conclude with few examples of intensity limitations and their mitigations.",
    "authors": [
      "Alessandra Lombardi"
    ],
    "published": "2026-02-05T10:42:58Z",
    "updated": "2026-02-05T10:42:58Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.05518v1",
    "url": "https://arxiv.org/abs/2602.05518v1",
    "pdf_url": "https://arxiv.org/pdf/2602.05518v1.pdf",
    "title": "Three-Dimensional Spiral Beam Injection:Design Principles and Experimental Verification",
    "abstract": "A proof of principle experiment of Three-dimensional spiral beam injection scheme has been carried out. This injection scheme requires a strongly x-y coupled beam to meet magnetic field distribution through solenoid magnet fringe field. In this paper, we introduce outline of experimental setup, results of x-y coupling adjustment with DC electron beam of 80 keV. The results of this experiment will be evaluated and improvements for actual operation will be discussed.",
    "authors": [
      "Hiromi Iinuma",
      "Ryota Matsushita",
      "Muhammad Abdul Rehman",
      "Hisayoshi Nakayama",
      "Satoshi Ohsawa",
      "Kazuro Furukawa"
    ],
    "published": "2026-02-05T10:23:36Z",
    "updated": "2026-02-05T10:23:36Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.00908v2",
    "url": "https://arxiv.org/abs/2509.00908v2",
    "pdf_url": "https://arxiv.org/pdf/2509.00908v2.pdf",
    "title": "Beam test results of the Intermediate Silicon Tracker for sPHENIX",
    "abstract": "The Intermediate Silicon Tracker (INTT), a two-layer barrel silicon strip tracker, is a key component of the tracking system for sPHENIX at the Relativistic Heavy Ion Collider (RHIC) at Brookhaven National Laboratory. The INTT is designed to enable the association of reconstructed tracks with individual RHIC bunch crossings. To evaluate the performance of preproduction INTT ladders and the readout chain, a beam test was conducted at the Research Center for Accelerator and Radioisotope Science, Tohoku University, Japan. This paper presents the performance of the INTT evaluated through studies of the signal-to-noise ratio, residual distribution, spatial resolution, hit-detection efficiency, and multiple track reconstruction.",
    "authors": [
      "C. W. Shih",
      "G. Nukazuka",
      "Y. Sugiyama",
      "Y. Akiba",
      "D. Cacace",
      "H. En'yo",
      "T. Hachiya",
      "S. Hasegawa",
      "M. Hata",
      "H. Imai",
      "C. M. Kuo",
      "M. Morita",
      "I. Nakagawa",
      "Y. Nakamura",
      "G. Nakano",
      "Y. Namimoto",
      "R. Nouicer",
      "R. Pisani",
      "M. Shibata",
      "M. Shimomura",
      "R. Takahama",
      "K. Toho",
      "H. Tsujibata",
      "M. Tsuruta",
      "M. Watanabe"
    ],
    "published": "2025-08-31T15:38:37Z",
    "updated": "2026-02-05T09:31:38Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1016/j.nima.2026.171312"
  },
  {
    "arxiv_id": "2602.05160v1",
    "url": "https://arxiv.org/abs/2602.05160v1",
    "pdf_url": "https://arxiv.org/pdf/2602.05160v1.pdf",
    "title": "The Methodology and Implementation of a Real Time Monitoring System for Cryogenic Fridges",
    "abstract": "Inspired by the dilution refrigerator and magnet monitoring system developed for HAYSTAC at Yale University, Speller Lab at Johns Hopkins University developed the Fridge Real Time Monitoring System (FRTMS). The FRTMS accesses logs saved locally by the dilution refrigerator, saves these logs to various backup locations, edits the logs into a format for upload to a MySQL database, and allows the logs to be remotely monitored in near-real time.",
    "authors": [
      "Tabitha Esposito",
      "Chloe Greenstein",
      "Danielle Speller"
    ],
    "published": "2026-02-05T00:26:00Z",
    "updated": "2026-02-05T00:26:00Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.04976v1",
    "url": "https://arxiv.org/abs/2602.04976v1",
    "pdf_url": "https://arxiv.org/pdf/2602.04976v1.pdf",
    "title": "Design and Linearity Assessment of the TRISTAN Detectors' Remote Analog to Digital Conversion DAQ System",
    "abstract": "The TRISTAN detector is an upgrade to the KATRIN experiment to enable a differential measurement of the tritium $β$-decay spectrum to search for the experimental signature of keV scale sterile neutrinos. The TRISTAN detector upgrade consists of performing precision electron spectroscopy with over 1000 silicon drift detector pixels, each responsible for recording event rates of $10^5$ counts per second. A project specific data acquisition (DAQ) system is developed to meet the experimental challenges with a remote analog to digital conversion (RADC) design. In this work, the conceptual design of the RADC DAQ is presented along with the built system for operating the TRISTAN detector upgrade. The system includes flexible signal processing logic and data management that is optimized for the high-rate precision measurement. The non-linearity of the system's readout channels are measured and shown to be stable over time. The systematic effect of this non-linearity is propagated to the sensitivity to the sterile neutrino signature and is demonstrated to be reducible to a subdominant contribution.",
    "authors": [
      "Andrew S. Gavin",
      "Matthias Balzer",
      "Suren Chilingaryan",
      "Reyco Henning",
      "Andreas Kopmann",
      "Susanne Mertens",
      "Jalal Mostafa",
      "Anthony Onillon",
      "Frank Simon",
      "Nicholas Tan Jerome",
      "Denis Tcherniakhovski",
      "Korbinian Urban",
      "John F. Wilkerson",
      "Sascha Wüstling"
    ],
    "published": "2026-02-04T19:06:43Z",
    "updated": "2026-02-04T19:06:43Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2505.23955v2",
    "url": "https://arxiv.org/abs/2505.23955v2",
    "pdf_url": "https://arxiv.org/pdf/2505.23955v2.pdf",
    "title": "Exploring the keV-scale physics potential of CUORE",
    "abstract": "We present the analysis techniques developed to explore the keV-scale energy region of the CUORE experiment, based on more than 2 tonne yr of data collected over 5 years. By prioritizing a stricter selection over a larger exposure, we are able to optimize data selection for thresholds at 10 keV and 3 keV with 691 kg yr and 11 kg yr of data, respectively. We study how the performance varies among the 988-detector array with different detector characteristics and data taking conditions. We achieve an average baseline resolution of 2.54 $\\pm$ 0.14 keV FWHM and 1.18 $\\pm$ 0.02 keV FWHM for the data selection at 10 keV and 3 keV, respectively. The analysis methods employed reduce the overall background by about an order of magnitude, reaching 2.06 $\\pm$ 0.05 counts/(keV kg days) and 16 $\\pm$ 2 counts/(keV kg days) at the thresholds of 10 keV and 3 keV. We evaluate for the first time the near-threshold reconstruction efficiencies of the CUORE experiment, and find these to be 26 $\\pm$ 4 \\% and 50 $\\pm$ 2 \\% at 3 keV and 10 keV, respectively. This analysis provides crucial insights into rare decay studies, new physics searches, and keV-scale background modeling with CUORE. We demonstrate that tonne-scale cryogenic calorimeters can operate across a wide energy range, from keV to MeV, establishing their scalability as versatile detectors for rare event and dark matter physics. These findings also inform the optimization of future large mass cryogenic calorimeters to enhance the sensitivity to low-energy phenomena.",
    "authors": [
      "CUORE Collaboration",
      "D. Q. Adams",
      "C. Alduino",
      "K. Alfonso",
      "A. Armatol",
      "F. T. Avignone",
      "O. Azzolini",
      "G. Bari",
      "F. Bellini",
      "G. Benato",
      "M. Beretta",
      "M. Biassoni",
      "A. Branca",
      "C. Brofferio",
      "C. Bucci",
      "J. Camilleri",
      "A. Caminata",
      "A. Campani",
      "J. Cao",
      "C. Capelli",
      "S. Capelli",
      "L. Cappelli",
      "L. Cardani",
      "P. Carniti",
      "N. Casali",
      "E. Celi",
      "D. Chiesa",
      "M. Clemenza",
      "S. Copello",
      "A. Cosoli",
      "O. Cremonesi",
      "R. J. Creswick",
      "A. DAddabbo",
      "I. Dafinei",
      "S. DellOro",
      "S. Di Domizio",
      "S. Di Lorenzo",
      "T. Dixon",
      "D. Q. Fang",
      "M. Faverzani",
      "E. Ferri",
      "F. Ferroni",
      "E. Fiorini",
      "M. A. Franceschi",
      "S. J. Freedman",
      "S. H. Fu",
      "B. K. Fujikawa",
      "S. Ghislandi",
      "A. Giachero",
      "M. Girola",
      "L. Gironi",
      "A. Giuliani",
      "P. Gorla",
      "C. Gotti",
      "P. V. Guillaumon",
      "T. D. Gutierrez",
      "K. Han",
      "E. V. Hansen",
      "K. M. Heeger",
      "D. L. Helis",
      "H. Z. Huang",
      "M. T. Hurst",
      "G. Keppel",
      "Yu. G. Kolomensky",
      "R. Kowalski",
      "R. Liu",
      "L. Ma",
      "Y. G. Ma",
      "L. Marini",
      "R. H. Maruyama",
      "D. Mayer",
      "Y. Mei",
      "M. N. Moore",
      "T. Napolitano",
      "M. Nastasi",
      "C. Nones",
      "E. B. Norman",
      "A. Nucciotti",
      "I. Nutini",
      "T. ODonnell",
      "M. Olmi",
      "B. T. Oregui",
      "S. Pagan",
      "C. E. Pagliarone",
      "L. Pagnanini",
      "M. Pallavicini",
      "L. Pattavina",
      "M. Pavan",
      "G. Pessina",
      "V. Pettinacci",
      "C. Pira",
      "S. Pirro",
      "E. G. Pottebaum",
      "S. Pozzi",
      "E. Previtali",
      "A. Puiu",
      "S. Quitadamo",
      "A. Ressa",
      "C. Rosenfeld",
      "B. Schmidt",
      "R. Serino",
      "A. Shaikina",
      "V. Sharma",
      "V. Singh",
      "M. Sisti",
      "D. Speller",
      "P. T. Surukuchi",
      "L. Taffarello",
      "C. Tomei",
      "A. Torres",
      "J. A. Torres",
      "K. J. Vetter",
      "M. Vignati",
      "S. L. Wagaarachchi",
      "R. Wang",
      "B. Welliver",
      "J. Wilson",
      "K. Wilson",
      "L. A. Winslow",
      "F. Xie",
      "T. Zhu",
      "S. Zimmermann",
      "S. Zucchelli"
    ],
    "published": "2025-05-29T19:09:41Z",
    "updated": "2026-02-04T18:10:01Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1103/fv25-bfgx"
  },
  {
    "arxiv_id": "2602.03458v2",
    "url": "https://arxiv.org/abs/2602.03458v2",
    "pdf_url": "https://arxiv.org/pdf/2602.03458v2.pdf",
    "title": "Hydrodynamic simulations of expanded warm dense foil heated by pulsed-power",
    "abstract": "Warm Dense Matter lies at the frontier between condensed matter and plasma, and plays a central role in various fields ranging from planetary science to inertial confinement fusion. Improving our understanding of this regime requires experimental data that can be directly compared with theoretical and numerical models over a broad range of conditions. In this work, a pulsed-power experiment is described in which thin metallic foils, confined within a sapphire cell, are Joule-heated to achieve the expanded warm dense matter regime. Designing such an experiment is challenging, as it requires simultaneously predicting the electrical response of the pulsed-power driver and the hydrodynamic evolution of the heated material. To tackle this challenge, a modeling framework has been developed that couples an electrical description of the pulsed-power system, including the driver, the switching stages and the load with a one-dimensional hydrodynamic code. This coupling allows the electrical energy deposition and the load thermodynamic evolution to be consistently linked through the material electrical conductivity. This approach takes advantage of the simplicity of a 1D geometry while retaining the essential physics and allowing to reproduce various measurements with good accuracy, such as expansion velocity, current and voltage. This numerical approach therefore constitutes a robust and efficient method for designing and optimizing future Warm Dense Matter experiments using pulsed-power facilities.",
    "authors": [
      "Luc Revello",
      "Laurent Videau",
      "Frédéric Zucchini",
      "Mathurin Lagrée",
      "Christophe Blancard",
      "Benjamin Jodar"
    ],
    "published": "2026-02-03T12:24:40Z",
    "updated": "2026-02-04T17:04:32Z",
    "categories": [
      "physics.plasm-ph",
      "hep-ex"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.04758v1",
    "url": "https://arxiv.org/abs/2602.04758v1",
    "pdf_url": "https://arxiv.org/pdf/2602.04758v1.pdf",
    "title": "Physics-Informed Neural Compression of High-Dimensional Plasma Data",
    "abstract": "High-fidelity scientific simulations are now producing unprecedented amounts of data, creating a storage and analysis bottleneck. A single simulation can generate tremendous data volumes, often forcing researchers to discard valuable information. A prime example of this is plasma turbulence described by the gyrokinetic equations: nonlinear, multiscale, and 5D in phase space. It constitutes one of the most computationally demanding frontiers of modern science, with runs taking weeks and yielding tens of terabytes of data dumps.The increasing storage demands underscore the importance of compression. However, reconstructed snapshots do not necessarily preserve essential physical quantities. We present a spatiotemporal evaluation pipeline, accounting for structural phenomena and multi-scale transient fluctuations to assess the degree of physical fidelity. Indeed, we find that various compression techniques lack preservation of both spatial mode structure and temporal turbulence characteristics. Therefore, we explore Physics-Informed Neural Compression (PINC), which incorporates physics-informed losses tailored to gyrokinetics and enables extreme compressions ratios of over 70,000x. Entropy coding on top of PINC further pushes it to 120,000x. This direction provides a viable and scalable solution to the prohibitive storage demands of gyrokinetics, enabling post-hoc analyses that were previously infeasible.",
    "authors": [
      "Gianluca Galletti",
      "Gerald Gutenbrunner Sandeep S. Cranganore",
      "William Hornsby",
      "Lorenzo Zanisi",
      "Naomi Carey",
      "Stanislas Pamela",
      "Johannes Brandstetter",
      "Fabian Paischer"
    ],
    "published": "2026-02-04T16:57:16Z",
    "updated": "2026-02-04T16:57:16Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.04710v1",
    "url": "https://arxiv.org/abs/2602.04710v1",
    "pdf_url": "https://arxiv.org/pdf/2602.04710v1.pdf",
    "title": "Nonlinear Saturation of the Acoustic Resonant Drag Instability",
    "abstract": "Resonant drag instabilities (RDIs) are a novel type of dust/fluid instability relevant to a diverse range of astrophysical environments. They are driven by a resonant interaction between streaming dust and waves in a background medium, which results in dust density fluctuations and amplification of the waves. This broad class of instabilities includes recently-proposed modes incorporating acoustic and magnetohydrodynamic waves, as well as the well-studied disk streaming instability. As the study of RDIs is at an early stage, their evolution beyond the linear regime is not well understood. In order to make inroads into the nonlinear theory of RDIs, we performed simulations of the simplest case, the acoustic RDI, in which sound waves in a gas are amplified by interaction with supersonically streaming dust. This particular instability is of interest both due its potential relevance in various poorly ionized environments, and due to its resemblance to the fast magnetosonic RDI. We find that the nonlinear growth and saturation of the instability are characterized by a balance between time scales of instability growth and turbulent eddy turnover. The simulations demonstrate a saturated state possessing an anisotropic outer forcing range in which this balance is maintained, and suggest the presence of an isotropic turbulent inertial range below this scale. By presenting a model for the nonlinear growth and saturated state of the acoustic RDI, this work provides a framework for further study of the nonlinear behavior of this and other RDIs.",
    "authors": [
      "Ben Y. Israeli",
      "Jonathan Squire",
      "Eric Moseley",
      "Amitava Bhattacharjee"
    ],
    "published": "2026-02-04T16:22:01Z",
    "updated": "2026-02-04T16:22:01Z",
    "categories": [
      "astro-ph.GA",
      "astro-ph.SR",
      "physics.flu-dyn",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.GA"
  },
  {
    "arxiv_id": "2602.04612v1",
    "url": "https://arxiv.org/abs/2602.04612v1",
    "pdf_url": "https://arxiv.org/pdf/2602.04612v1.pdf",
    "title": "Density Modulations of Zero Sound",
    "abstract": "We study the density modulation of an interacting Fermi gas caused by the uniform motion of an impurity at zero temperature. For strong enough interaction among Fermi atoms, the modulation propagates thanks to the excitation of the collective zero sound mode if the impurity speed is above the zero sound threshold. We are able to assess, via a semi-analytic evaluation, the extent of the zero sound contribution to the density oscillation over and above the incoherent background of particle-hole excitations. Given the strong dependence of the results on the features of the gas interaction potential, we also analyze how they vary depending on its strength, range and shape.",
    "authors": [
      "Leonardo Pisani"
    ],
    "published": "2026-02-04T14:39:16Z",
    "updated": "2026-02-04T14:39:16Z",
    "categories": [
      "cond-mat.quant-gas",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.quant-gas"
  },
  {
    "arxiv_id": "2602.04580v1",
    "url": "https://arxiv.org/abs/2602.04580v1",
    "pdf_url": "https://arxiv.org/pdf/2602.04580v1.pdf",
    "title": "Doberman: a modular and distributed slow control system for small- to medium-scale experiments",
    "abstract": "We present Doberman (Detector OBsERving and Monitoring ApplicatioN), a lightweight, modular, and open-source slow control system designed for small-to medium-scale physics experiments. Doberman addresses the gap between heavyweight industrial SCADA frameworks and ad hoc laboratory solutions by providing a flexible software architecture that supports heterogeneous instrumentation, distributed deployment, automated control, and robust alarm handling. The web-based graphical user interface Doberview provides live and continuously updated visualization, configuration, and control of the entire experiment, supporting both routine operation and rapid response to exceptional conditions. Doberman has been deployed and validated in multiple experimental setups, ranging from a remotely operated underground gamma-ray spectrometer to a large, highly instrumented liquid xenon test facility with several hundred monitored quantities.   Doberman and Doberview are released under permissive open-source licenses, and the software, documentation, and example device integrations are publicly available.",
    "authors": [
      "Jaron Grigat",
      "Darryl Masson",
      "Marc Schumann"
    ],
    "published": "2026-02-04T14:06:28Z",
    "updated": "2026-02-04T14:06:28Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.04545v1",
    "url": "https://arxiv.org/abs/2602.04545v1",
    "pdf_url": "https://arxiv.org/pdf/2602.04545v1.pdf",
    "title": "Nonlinear Dynamical Friction from the Doppler-Shifted Equilibrium Memory Kernel",
    "abstract": "We present a statistical mechanics framework for modeling non-equilibrium transport coefficients using the Generalized Langevin Equation (GLE). We show that the kernel, obtained via the Fluctuation-Dissipation Theorem (FDT) from the stochastic force autocorrelation measured in a thermal equilibrium state, is sufficient to model the dynamics of the system in a Non-Equilibrium Steady State (NESS). This approach provides a computationally efficient path to modeling complex transport problems. We apply this framework to the canonical problem of test particle drag in a uniform plasma. The GLE formalism is shown to naturally capture non-Markovian phenomena through the moments of the kernel, including an effective mass renormalization and oscillatory relaxation. We demonstrate that the standard Chandrasekhar stopping power formula arises naturally as the Markovian limit of this equilibrium memory kernel. These theoretical predictions are quantitatively validated by direct Particle-in-Cell simulations, which confirm the predicted oscillatory structure of the memory kernel. This work thus establishes a practical method for predicting non-equilibrium transport properties from first-principles equilibrium simulations.",
    "authors": [
      "N. R. Sree Harsha",
      "Zhenyuan Yu",
      "Chuang Ren",
      "Virginia Billings",
      "Michael Huang"
    ],
    "published": "2026-02-04T13:35:56Z",
    "updated": "2026-02-04T13:35:56Z",
    "categories": [
      "physics.plasm-ph",
      "cond-mat.stat-mech"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.04505v1",
    "url": "https://arxiv.org/abs/2602.04505v1",
    "pdf_url": "https://arxiv.org/pdf/2602.04505v1.pdf",
    "title": "PhoQuPy: A Python framework for Automation of Quantum Optics experiments",
    "abstract": "We present the automation of a confocal photoluminescence (PL) scanning system for the identification and characterization of single-photon emitters (SPEs) in quantum materials. The setup excites the sample with a laser and acquires a spectrum at each spatial coordinate in a raster scan pattern. A double-acquisition method is used to remove cosmic ray artifacts by comparing subsequent measurements at the same spatial coordinate. Once identified, the emitter is further characterized via a HBT setup, thereby measuring lifetime as well as second-order autocorrelation g(2) measurements to confirm singlephoton emission. The system integrates Python-based hardware control for motorized stages, spectrometer acquisition, and post-processing, with a migration to a galvo-mirror scanning approach for using it along with a cryostat for low temperature measurements. Our results demonstrate spatially resolved PL maps and temperature-dependent spectra, highlighting the capability of the setup to efficiently benchmark SPE performance. We further went on to perform automation of other experiments such as a Non-Linear Interferometry setup for Quantum Imaging with Undetected Light and a Fourier Transform Imaging Spectroscopy using a common path birefringence Interferometer to obtain hyperspectral images of our samples.",
    "authors": [
      "Srivatsa Murali",
      "Anshuman Kumar"
    ],
    "published": "2026-02-04T12:52:32Z",
    "updated": "2026-02-04T12:52:32Z",
    "categories": [
      "physics.optics",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2510.24766v2",
    "url": "https://arxiv.org/abs/2510.24766v2",
    "pdf_url": "https://arxiv.org/pdf/2510.24766v2.pdf",
    "title": "Data sorting modes of phoswich detector array",
    "abstract": "The different data-sorting modes of the phoswich detector array PARIS used for detecting high-energy (4$-$10 MeV) $γ$ rays are investigated. The characteristics including time resolution, energy resolution and detection efficiency under various modes are studied. The present study shows that PARIS has capabilities of rejecting escape and pileup events when used for decay spectroscopy. Notably, the methods presented in this work refer specifically to the $β$-decay experiment of $^{80g+m}$Ga conducted with three PARIS clusters comprising 27 phoswich detectors, rather than to a general report on the PARIS array or its overall performance for in-beam spectroscopy. Compared with the 2\"$\\times$2\"$\\times$2\" LaBr$_3$(Ce) detector (Ciemała et al., 2009), even in individual mode, PARIS provides significant suppression of single- and double-escape peaks and reduces background via vetoing function of the outer-volume NaI(Tl) crystals. In contrast to the common approach of adding back the energies in LaBr$_3$(Ce) and NaI(Tl) to increase the detection efficiency of the full-energy peak, using NaI(Tl) as a veto shield provides a superior trade-off for applications where spectral purity is essential. Employing add-back analysis within each cluster of nine phoswiches or between all phoswiches could enhance full-energy peak efficiency and further suppress escape peaks and background. Applying a multiplicity condition provides a further suppression but simultaneously lowers the statistics of full-energy peaks.",
    "authors": [
      "R. Li",
      "D. Verney",
      "C. Delafosse",
      "M. N. Harakeh",
      "A. Maj",
      "F. Didierjean",
      "L. Al Ayoubi",
      "H. Al Falou",
      "P. Bednarczyk",
      "G. Benzoni",
      "F. Le Blanc",
      "V. Bozkurt",
      "M. Ciemała",
      "F. C. L. Crespi",
      "I. Deloncle",
      "C. Gaulard",
      "A. Gottardo",
      "V. Guadilla",
      "J. Guillot",
      "K. Hadyńska-Klek",
      "F. Ibrahim",
      "N. Jovancevic",
      "A. Kankainen",
      "M. Kmiecik",
      "M. Lebois",
      "T. Martínez",
      "P. Napiorkowski",
      "B. Roussiere",
      "Yu. G. Sobolev",
      "M. Stanoiu",
      "I. Stefan",
      "S. Stukalov",
      "D. Thisse",
      "G. Tocabens"
    ],
    "published": "2025-10-24T00:45:41Z",
    "updated": "2026-02-04T12:52:22Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1016/j.nima.2026.171337"
  },
  {
    "arxiv_id": "2503.20904v4",
    "url": "https://arxiv.org/abs/2503.20904v4",
    "pdf_url": "https://arxiv.org/pdf/2503.20904v4.pdf",
    "title": "Experimental evidence of production of directional muons from a laser-wakefield accelerator",
    "abstract": "We report on experimental evidence of the generation of directional muons from a laser-wakefield accelerator driven by a PW-class laser. The muons were generated following the interaction of a GeV-scale high-charge electron beam with a 2cm-thick Pb target and were detected using a Timepix3 detector placed behind a suitable shielding configuration. Data analysis indicates a $(99.1\\pm0.5)$% confidence of muon detection over noise, in excellent agreement with numerical modelling. Extrapolation of the experimental setup to higher electron energies and charges suggests the potential to guide and separate from noise approximately $10^4$ muons/s onto cm$^2$-scale areas for applications using a 10 Hz PW laser. These results demonstrate the possibility of generating and transporting directional muon beams using high-power lasers and establish a foundation for the systematic application of laser-driven high-energy muon beams.",
    "authors": [
      "L. Calvin",
      "E. Gerstmayr",
      "C. Arran",
      "L. Tudor",
      "T. Foster",
      "K. Fleck",
      "B. Bergmann",
      "D. Doria",
      "B. Kettle",
      "H. Maguire",
      "V. Malka",
      "P. Manek",
      "S. P. D. Mangles",
      "P. McKenna",
      "R. E. Mihai",
      "S. Popa",
      "C. Ridgers",
      "J. Sarma",
      "P. Smolyanskiy",
      "R. Wilson",
      "R. M. Deas",
      "G. Sarri"
    ],
    "published": "2025-03-26T18:19:07Z",
    "updated": "2026-02-04T12:24:03Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.04483v1",
    "url": "https://arxiv.org/abs/2602.04483v1",
    "pdf_url": "https://arxiv.org/pdf/2602.04483v1.pdf",
    "title": "Passive Incoherent Ultrafast Mid-Infrared Upconversion Imaging and Its Calibration",
    "abstract": "Ultrafast mid-infrared (MIR) imaging is a key enabling capability for monitoring transient thermal and plasma phenomena in scientific diagnostics and industrial safety. However, conventional cryogenic MIR cameras face a fundamental trade-off between frame rate, noise, and pixel format. Here we report a passive, incoherent MIR imaging platform that leverages sum-frequency upconversion in chirped periodically poled lithium niobate (CPLN) to translate broadband 3--5um scenes to the near-infrared, enabling ultrafast acquisition on a silicon-based intensified CCD (iCCD). In fast-kinetics mode we achieve a physical frame rate of 100kHz with microsecond-scale gate control, and we directly capture the full evolution of an air-breakdown electric arc, resolving its rapid ignition, expansion, and decay dynamics. Beyond demonstrating ultrafast passive imaging, we introduce a drift-aware calibration workflow based on Allan deviation analysis to quantitatively select the gate width and averaging strategy under realistic slow-drift and multiplicative noise. This combined capability -- ultrafast passive MIR imaging plus operationally meaningful calibration -- provides a practical route toward real-time thermal surveillance and early-warning systems for hazardous fast transients.",
    "authors": [
      "Jin-Peng Li",
      "Zhi-You Li",
      "Zhao-Qi-Zhi Han",
      "Xiao-Hua Wang",
      "He Zhang",
      "Yin-Hai Li",
      "Bo-Wen Liu",
      "Wen-Tao Luo",
      "Zhi-Yuan Zhou",
      "Bao-Sen Shi"
    ],
    "published": "2026-02-04T12:09:38Z",
    "updated": "2026-02-04T12:09:38Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2511.11061v2",
    "url": "https://arxiv.org/abs/2511.11061v2",
    "pdf_url": "https://arxiv.org/pdf/2511.11061v2.pdf",
    "title": "Van-der-Waals exchange-correlation functionals and their high pressure and warm dense matter applications",
    "abstract": "We investigate basic hydrogen quantities like the molecular bond length, the molecular dissociation energy and the van-der-Waals interaction in idealized situations in an effort to discern a suitable exchange-correlation functional for the molecular to metal transition in warm dense hydrogen. The best reproduction of bond length and dissociation energy is given by the r2SCAN functional, several vdW functionals and also HSE06 fair qualitatively and quantitatively no better than PBE or worse. In addition we investigate quantities like the static and dynamic ion structure factor, and the electronic DOS to determine differences between exchange-correlation functionals with and without van-der-Waals corrections in the transition region from the molecular to the metallic regime of hydrogen.",
    "authors": [
      "Jan Vorberger",
      "Gabriel J. Smith",
      "William Z. Van Benschoten",
      "Hayley R. Petras",
      "Zhandos Moldabekov",
      "Tobias Dornheim",
      "James J. Shepherd"
    ],
    "published": "2025-11-14T08:22:34Z",
    "updated": "2026-02-04T09:31:27Z",
    "categories": [
      "physics.chem-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.chem-ph"
  },
  {
    "arxiv_id": "2509.11954v4",
    "url": "https://arxiv.org/abs/2509.11954v4",
    "pdf_url": "https://arxiv.org/pdf/2509.11954v4.pdf",
    "title": "A Pathway to Sub-meV Detection of the Dark Universe: Robust Electron Avalanche in the PN junction at 10 mK",
    "abstract": "The search for light dark matter and cosmic primordial neutrinos necessitates detectors with sub-millielectronvolt (sub-meV) energy thresholds. While superconducting quantum sensors have approached this sensitivity, they often face significant challenges regarding readout complexity and scalability. To address these limitations, we propose a hybrid Superconductor-Insulator-P-N (S-I-P-N) detector architecture. This concept combines the high sensitivity of superconducting Cooper pair breaking with the massive intrinsic gain of semiconductor electron avalanches. A critical prerequisite for this scheme is operation at millikelvin (mK) temperatures, raising the critical fundamental question of whether silicon PN junctions can sustain avalanche multiplication in a regime where carrier freeze-out is severe. Here, we experimentally validate the critical semiconductor amplification stage of the proposed detector. We demonstrate that Silicon Photomultipliers (SiPMs) retain robust Geiger-mode avalanche capabilities at 10 mK. We report a single-photoelectron gain of order 10$^6$ and a dark count rate as low as 5~mHz/mm$^2$, 7 orders of magnitude lower than at room temperature. These results confirm the viability of high-gain semiconductor readout in the deep cryogenic regime, clearing the primary obstacle regarding the semiconductor component for the realization of scalable, sub-meV threshold S-I-P-N detectors.",
    "authors": [
      "Aiqin Gao",
      "Yiming Guo",
      "Hengyu Wang",
      "Xilei Sun",
      "Xuegang Li",
      "Junhua Wang",
      "Junguang Lv",
      "Guopu Qu",
      "Lei Cao"
    ],
    "published": "2025-09-15T14:11:54Z",
    "updated": "2026-02-04T09:20:26Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.04338v1",
    "url": "https://arxiv.org/abs/2602.04338v1",
    "pdf_url": "https://arxiv.org/pdf/2602.04338v1.pdf",
    "title": "Improved Fluid Modeling of Space Debris Generated Ion-Acoustic Precursor Solitons",
    "abstract": "This study reexamines the excitation of ion-acoustic precursor solitons by a supersonically moving charged debris object, incorporating two previously overlooked physical factors: the dynamic charging of the debris and the impermeable nature of its surface. The influence of charging dynamics is explored using an enhanced one-dimensional fluid-Poisson model, where the source charge is treated as a dynamical variable and solved self-consistently alongside the core plasma equations. By comparing these results with prior fixed-charge models, we evaluate the effects on soliton onset and propagation, finding that charging dynamics does not hinder soliton generation or evolution. To assess the impact of the impermeability of debris surface, a two-dimensional fluid model simulates the interaction between an electrostatically biased, impenetrable object and a flowing plasma. Modeling the object as an infinite wall disconnects the upstream and downstream plasma regions, forming a sheath without solitons -- consistent with earlier fluid and particle-in-cell simulations. However, replacing the wall with a finite object enables plasma flow around it, restoring upstream-downstream connectivity and naturally generating precursor solitons.",
    "authors": [
      "Ajaz Mir",
      "Abhijit Sen",
      "Pintu Bandyopadhyay",
      "Sanat Tiwari",
      "Chris Crabtree",
      "Gurudas Ganguli"
    ],
    "published": "2026-02-04T09:00:46Z",
    "updated": "2026-02-04T09:00:46Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2502.04764v2",
    "url": "https://arxiv.org/abs/2502.04764v2",
    "pdf_url": "https://arxiv.org/pdf/2502.04764v2.pdf",
    "title": "Observations of Transition from Imbalanced to Balanced Kinetic Alfvénic Turbulence",
    "abstract": "We report observations of solar wind turbulence derived from measurements by the Parker Solar Probe. Our findings reveal the emergence of finite magnetic helicity within the transition range of the turbulence, aligning with signatures of kinetic Alfvén waves (KAWs). Notably, as the wave scale transitions from super-ion to sub-ion scales, the ratio of KAWs with opposing signs of magnetic helicity initially increases from approximately 1 to 6.5 before returning to 1. This observation provides, for the first time, compelling evidence for the transition from imbalanced kinetic Alfvénic turbulence to balanced kinetic Alfvénic turbulence.",
    "authors": [
      "Jinsong Zhao",
      "Trevor A. Bowen",
      "Stuart D. Bale",
      "Chen Shi",
      "Thierry Dudok de Wit",
      "Nikos Sioulas"
    ],
    "published": "2025-02-07T08:54:17Z",
    "updated": "2026-02-04T06:16:26Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2602.00312v3",
    "url": "https://arxiv.org/abs/2602.00312v3",
    "pdf_url": "https://arxiv.org/pdf/2602.00312v3.pdf",
    "title": "Self ordering to imposed ordering of dust -- a continuous spatial phase transition experiment in MDPX",
    "abstract": "Previous experiments conducted in the Magnetized Dusty Plasma eXperiment (MDPX) revealed an intriguing phenomenon first referred to as imposed ordering. This occurs when micron-sized dust particles become aligned with the geometry of a conducting mesh placed above the dust (at a distance much larger than the plasma Debye length or the ion-neutral or electron-neutral mean free paths) in the presence of a strong magnetic field perpendicular to the mesh. In this work, results of a transition experiment are presented wherein starting from a classical two-dimensional Coulomb crystal with hexagonal symmetry in an unmagnetized plasma $(B = 0\\,T)$, dust transitions to a state in which it flows along the geometry of a conducting mesh placed above it, mapping out the 4-fold symmetry of the boundary condition. It is hypothesized that beyond a certain magnetization, elongated electric potential structures emanating from the mesh drive the dust motion to reflect the mesh morphology, transitioning from a 6-fold self ordering to 4-fold imposed ordering. The various dust phases are quantified and a critical value of magnetic field is identified in the transition experiment indicating the onset of imposed ordering.",
    "authors": [
      "Siddharth Bachoti",
      "Saikat Chakraborty Thakur",
      "Rahul Banka",
      "Cameron Royer",
      "Edward Thomas"
    ],
    "published": "2026-01-30T21:03:28Z",
    "updated": "2026-02-04T05:08:14Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.21006v2",
    "url": "https://arxiv.org/abs/2601.21006v2",
    "pdf_url": "https://arxiv.org/pdf/2601.21006v2.pdf",
    "title": "A joint diffusion approach to multi-modal inference in inertial confinement fusion",
    "abstract": "A combination of physics-based simulation and experiments has been critical to achieving ignition in inertial confinement fusion (ICF). Simulation and experiment both produce a mixture of scalar and images outputs, however only a subset of simulated data are available experimentally. We introduce a generative framework, called JointDiff, which enables predictions of conditional simulation input and output distributions from partial, multi-modal observations. The model leverages joint diffusion to unify forward surrogate modeling, inverse inference, and output imputation into one architecture. We train our model on a large ensemble of three-dimensional Multi-Rocket Piston simulations and demonstrate high accuracy, statistical robustness, and transferability to experiments performed at the National Ignition Facility (NIF). This work establishes JointDiff as a flexible generative surrogate for multi-modal scientific tasks, with implications for understanding diagnostic constraints, aligning simulation to experiment, and accelerating ICF design.",
    "authors": [
      "Michael S. Jones",
      "Justin Kunimune",
      "Daniel Casey",
      "Bogdan Kustowski",
      "Eugene Kur",
      "Kelli Humbird"
    ],
    "published": "2026-01-28T20:02:10Z",
    "updated": "2026-02-04T01:31:42Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.04065v1",
    "url": "https://arxiv.org/abs/2602.04065v1",
    "pdf_url": "https://arxiv.org/pdf/2602.04065v1.pdf",
    "title": "Eigenmodes in an ultra-relativistic ultra-magnetized pair QED-plasma",
    "abstract": "Ultra-relativistic quantum-electrodynamic (QED) plasmas, characterized by magnetic field strengths approaching and even exceeding the Schwinger field of approximately $B_{Q} \\approx 4 \\times 10^{13}$ gauss, hold significant interest for laser-plasma experiments and astrophysical observations of neutron stars and magnetars. In this study, we investigate the joint modification of normal plasma modes in ultra-relativistic electron-positron plasmas, both charge neutral and non-neutral, by the super-strong magnetic field and plasma relativistic temperature. Our analysis shows that the most substantial modification concerns the reduction of the plasma frequency cutoff, resulting in relativistic and field-induced transparency. Additionally, we observe a temperature-independent modification of the index of refraction of electromagnetic waves, which coincides with the behavior observed in a cold QED plasma.",
    "authors": [
      "Ryan T. Low",
      "Mikhail V. Medvedev"
    ],
    "published": "2026-02-03T23:01:19Z",
    "updated": "2026-02-03T23:01:19Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.02894v2",
    "url": "https://arxiv.org/abs/2508.02894v2",
    "pdf_url": "https://arxiv.org/pdf/2508.02894v2.pdf",
    "title": "Nb3Sn coating of SRF cavity by co-sputtering from a composite target",
    "abstract": "We deposited Nb3Sn film on the inner surface of a 2.6 GHz Nb superconducting radiofrequency (SRF) cavity by co-sputtering using a composite of Nb and Sn tube targets in a DC cylindrical magnetron sputtering system, followed by thermal annealing of the coated cavity. An aluminum mockup cavity, replicating a 2.6 GHz Nb SRF cavity geometry, was utilized to optimize deposition parameters, resulting in co-sputtered Nb-Sn films with Sn content of 32 - 42 at. % on the beam tubes and equator positions. Several annealing conditions were investigated to improve the surface homogeneity of the Nb3Sn film. The best co-sputtered Nb-Sn film was achieved after annealing at 600 C for 6 h, followed by annealing at 950 C for 1 h. The best process was applied to a Nb cavity, which was RF tested in a cryogenic dewar. RF testing of the Nb3Sn-coated cavity demonstrated a superconducting transition temperature (Tc) close to the highest reported, at 17.78 K. The Nb3Sn cavity underwent a light Sn recoating process, followed by additional RF testing, resulting in enhancement of the RF performance, primarily due to improved surface homogeneity of the Nb3Sn coating.",
    "authors": [
      "Md Sharifuzzaman Shakel",
      "Grigory V. Eremeev",
      "Anne-Marie Valente-Feliciano",
      "Uttar Pudasaini",
      "Hani E. Elsayed-Ali"
    ],
    "published": "2025-08-04T20:46:17Z",
    "updated": "2026-02-03T20:40:13Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.03795v1",
    "url": "https://arxiv.org/abs/2602.03795v1",
    "pdf_url": "https://arxiv.org/pdf/2602.03795v1.pdf",
    "title": "ATLAS MDT TDC Simulations for LHC Run3 and HL-LHC",
    "abstract": "The Large Hadron Collider (LHC) started the Run 3 operation in 2022, and the peak instantaneous luminosity in Run 3 may reach 3 x 10^34 cm-2s-1. The ATLAS Monitored Drift Tube (MDT) chambers are the main component of the precision tracking system in the ATLAS muon spectrometer. It is important to understand any potential issues with the MDT Front-End (FE) readout electronics for an expected level-1 (L1) trigger rate of 100 kHz and a complex deadtime of over 5% for Run 3 operations. We use raw data collected in 2022 to emulate the expected hit rates in MDT chambers and perform a realistic simulation on the ATLAS Muon TDC (Time-to-Digital Converter) (AMT) chip with the current configuration. We study the AMT chip performances by analyzing the trigger/L1/readout buffer occupancies and hit loss fractions under different luminosities with L1 rate of 100 kHz by using the Modelsim software. The hit loss fraction of the hottest MDT chamber (BIL3C05) is lower than 5% due to FE readout, even at a luminosity of 5.01 x 10^34 cm-2s-1 with a deadtime of 5% and a L1 rate of 100 kHz, indicating that AMT can operate under Run 3 conditions without problems. The MDT trigger and readout electronics will be replaced for triggerless readout during High-Luminosity LHC (HL-LHC) runs. We also simulate the AMT behavior in the triggerless mode up to 7.44 x 10^34 cm-2s-1 and propose possible AMT configurations in case some FE electronics could not be replaced during the long shutdown 3 (LS3).",
    "authors": [
      "Jiajin Ge",
      "Bing Li",
      "Markus Fras",
      "Junjie Zhu",
      "Bing Zhou",
      "Tiesheng Dai"
    ],
    "published": "2026-02-03T17:59:02Z",
    "updated": "2026-02-03T17:59:02Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.03759v1",
    "url": "https://arxiv.org/abs/2602.03759v1",
    "pdf_url": "https://arxiv.org/pdf/2602.03759v1.pdf",
    "title": "A High-order piecewise field-aligned triangular finite element method for electromagnetic gyrokinetic particle simulations of tokamak plasmas with open field lines",
    "abstract": "A high-order piecewise field-aligned triangular finite element method is developed and implemented for global electromagnetic gyrokinetic particle-in-cell simulations of tokamak plasmas with open field lines. The approach combines locally field-aligned finite element basis functions with unstructured $C^{1}$ triangular meshes in cylindrical coordinates, enabling whole-volume simulations with substantially reduced computational effort, while avoiding the grid distortion associated with globally field-aligned coordinates and the associated singularity at the separatrix of diverted plasmas. The formulation is compatible with both $δf$ and full-$f$ models and employs mixed-variable representations, along with a generalized pullback scheme, to control numerical cancellation in electromagnetic simulations. The method is implemented in the TRIMEG-C1 code and demonstrated using linear and nonlinear electromagnetic simulations of the TCV-X21 configuration. The results indicate that the approach accurately captures the key features of electromagnetic ion-temperature-gradient and kinetic ballooning mode physics, including the separatrix regions in the simulation, thereby providing a robust framework for whole-volume electromagnetic gyrokinetic simulations in realistic tokamak geometries.",
    "authors": [
      "Zhixin Lu",
      "Guo Meng",
      "Eric Sonnendruecker",
      "Roman Hatzky",
      "Giorgio Daneri",
      "Gengxian Li",
      "Peiyou Jiang",
      "Klaus Reuter",
      "Matthias Hoelzl"
    ],
    "published": "2026-02-03T17:21:52Z",
    "updated": "2026-02-03T17:21:52Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.03754v1",
    "url": "https://arxiv.org/abs/2602.03754v1",
    "pdf_url": "https://arxiv.org/pdf/2602.03754v1.pdf",
    "title": "A numerical study on plasma acceleration processes with ion dynamics at the sub-nanosecond timescale",
    "abstract": "Plasma wakefield acceleration is a groundbreaking technique for accelerating particles, capable of sustaining gigavolt-per-meter accelerating fields. Understanding the physical mechanisms governing the recovery of plasma accelerating properties over time is essential for successfully achieving high-repetition-rate plasma acceleration, a key requirement for applicability in both research and commercial settings. In this paper, we present numerical simulations of the early-stage plasma evolution based on the parameters of the SPARC_LAB hydrogen plasma recovery time experiment (Pompili et al., Comm. Phys. 7, 241 (2024)), employing spatially resolved Particle-in-Cell and fluid models. The experiment reports on a non-monotonic dependence of the plasma recovery time on the initial plasma density, an effect for which ion motion has been invoked as a contributing factor. The simulations presented here provide further insight into the role of ion dynamics in shaping this behavior. Furthermore, comparing Particle-in-Cell and fluid approaches allows us to assess the quality of fluid models for describing this class of plasma dynamics.",
    "authors": [
      "G. Parise",
      "A. Cianchi",
      "M. Galletti",
      "F. Guglietta",
      "R. Pompili",
      "A. R. Rossi",
      "M. Sbragaglia",
      "D. Simeoni"
    ],
    "published": "2026-02-03T17:17:41Z",
    "updated": "2026-02-03T17:17:41Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.03631v1",
    "url": "https://arxiv.org/abs/2602.03631v1",
    "pdf_url": "https://arxiv.org/pdf/2602.03631v1.pdf",
    "title": "Fabrication and Characterization of p-type Inverted Coaxial Point Contact (ICPC) Detectors with a-Ge Dual-Blocking Contacts",
    "abstract": "We report the fabrication and characterization of two p-type inverted coaxial point contact (ICPC) high-purity germanium (HPGe) detectors, SAP16 and SAP17, produced from USD-grown crystals with net impurity concentrations of $\\sim 3\\times10^{10}\\,\\mathrm{cm^{-3}}$. Both devices employ \\emph{thin} amorphous-germanium (a-Ge) dual-blocking contacts, implemented here for the first time on ICPC detectors, to provide bipolar charge blocking while limiting dead-layer thickness. Electrical tests at 76~K demonstrate stable operation with picoampere-level leakage currents and sub-pF capacitance: SAP17 reached $\\sim 4.62$~pA at the maximum tested bias (500~V) and operated stably at 400~V with $C\\simeq 0.503$~pF. \\emph{Meanwhile,} SAP16 achieved superior spectroscopic performance, with energy resolutions of 2.42\\% at 59.5~keV and 0.36\\% at 662~keV. Gamma-ray spectroscopy with $^{241}$Am and $^{137}$Cs shows that modest geometric differences lead to measurable changes in depletion behavior and charge-collection uniformity, consistent with electrostatic modeling. Angular-response measurements further reveal pronounced directional sensitivity at 59.5~keV, whereas the 662~keV response is essentially isotropic over the measured range. These results validate thin a-Ge dual-blocking contacts for ICPC HPGe detectors and highlight geometry-driven trade-offs among leakage current, depletion, and energy resolution relevant to low-background and low-threshold applications.",
    "authors": [
      "S. A. Panamaldeniya",
      "K. M. Dong",
      "D. M. Mei"
    ],
    "published": "2026-02-03T15:19:14Z",
    "updated": "2026-02-03T15:19:14Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.03583v1",
    "url": "https://arxiv.org/abs/2602.03583v1",
    "pdf_url": "https://arxiv.org/pdf/2602.03583v1.pdf",
    "title": "Multi-Diagnostic Characterization of Laser-Produced Tin Plasmas for EUV Lithography",
    "abstract": "We present a comprehensive characterization of laser-produced tin (Sn) plasmas relevant to extreme ultraviolet (EUV) lithography using a multi-diagnostic suite integrated into the new experimental platform, \"SparkLight\". Tin plasmas are generated by irradiating a continuously moving tin-coated wire with laser pulses (1064 nm, 10 ns, up to $5.7\\times10^{10}$ W/cm$^2$) and probed via coherent Thomson scattering, laser interferometry, and EUV emission spectroscopy. Thomson scattering measurements reveal electron temperatures and densities that decay with distance from the target. Densities derived from Thomson scattering are cross-validated against laser interferometry, showing excellent agreement. Correlating the results of these laser diagnostics with spatially resolved EUV spectroscopy suggests that the bulk of useful EUV emission originates within 150 $μ$m of the target and is generated under suboptimal plasma conditions. This work demonstrates a practical integrated approach for plasma characterization in EUV source development.",
    "authors": [
      "Stanislav Musikhin",
      "Anatoli Morozov",
      "Alec Griffith",
      "Shurik Yatom",
      "Ahmed Diallo"
    ],
    "published": "2026-02-03T14:35:05Z",
    "updated": "2026-02-03T14:35:05Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.15329v2",
    "url": "https://arxiv.org/abs/2509.15329v2",
    "pdf_url": "https://arxiv.org/pdf/2509.15329v2.pdf",
    "title": "The hot-electron closure of the moment-based gyrokinetic plasma model",
    "abstract": "We derive the hot-electron-limit (HEL) closure for the moment hierarchy used to solve the gyrokinetic equations, known as the gyromoment (GM) approach. By expanding the gyroaveraging kernels in the small temperature ratio limit, τ = Ti/Te << 1, and retaining only the essential O(τ) terms, we obtain a closed system for the density, parallel velocity, and parallel and perpendicular temperatures. In a Z-pinch geometry, the GM system with the HEL closure is analytically equivalent to the one developed by Ivanov et al. (2022). Numerical benchmarks confirm the closure's accuracy, reproducing established linear growth rates, nonlinear heat transport, and low collisionality dynamics. An extension to the tokamak-relevant s-α geometry and a comparison with gyrokinetic simulations reveal the capabilities and limitations of the HEL-closed GM model: while transport levels and temporal dynamics are qualitatively preserved even at τ=1, the absence of higher-order kinetic moments prevents an accurate prediction of the Dimits shift and of transport suppression.",
    "authors": [
      "A. C. D. Hoffmann",
      "P. Giroud-Garampon",
      "P. Ricci"
    ],
    "published": "2025-09-18T18:20:37Z",
    "updated": "2026-02-03T14:10:54Z",
    "categories": [
      "physics.plasm-ph",
      "nlin.CD",
      "physics.app-ph",
      "physics.comp-ph",
      "physics.flu-dyn"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.11874v2",
    "url": "https://arxiv.org/abs/2510.11874v2",
    "pdf_url": "https://arxiv.org/pdf/2510.11874v2.pdf",
    "title": "Towards fully predictive gyrokinetic full-f simulations: validation and triangularity studies in TCV",
    "abstract": "Designing economical magnetic confinement fusion power plants motivates computational tools that can estimate plasma behavior from engineering parameters without direct reliance on experimental measurement of the plasma profiles. In this work, we present full-$f$ global gyrokinetic (GK) turbulence simulations of edge and scrape-off layer turbulence in tokamaks that use only magnetic geometry, heating power, and particle inventory as inputs. Unlike many modeling approaches that employ free parameters fitted to experimental data, raising uncertainties when extrapolating to reactor scales, his approach directly simulates turbulence and resulting profiles through GK without such empirical adjustments. This is achieved via an adaptive sourcing algorithm in Gkeyll that strictly controls energy injection and emulates particle sourcing due to neutral recycling. We show that the simulated kinetic profiles compare reasonably well with Thomson scattering and Langmuir probe data for Tokamak à Configuration Variable (TCV) discharge #65125, and that the simulations reproduce characteristic features such as blob transport and self-organized electric fields. Applying the same framework to study triangularity effects suggests mechanisms contributing to the improved confinement reported for negative triangularity (NT). Simulations of TCV discharges #65125 and #65130 indicate that NT increases the $E \\times B$ flow shear (by about 20% in these cases), which correlates with reduced turbulent losses and a modest change in the distribution of power exhaust to the vessel wall. While the physical models contain approximations that can be refined in future work, the predictive capability demonstrated here, evolving multiple profile relaxation times with kinetic electron and ion models in hundreds of GPU hours, indicates the feasibility of using Gkeyll to support design studies of fusion devices.",
    "authors": [
      "A. C. D. Hoffmann",
      "T. N. Bernard",
      "M. Francisquez",
      "G. W. Hammett",
      "A. Hakim",
      "J. Boedo",
      "R. Rizkallah",
      "C. K. Tsui",
      "the TCV team"
    ],
    "published": "2025-10-13T19:32:56Z",
    "updated": "2026-02-03T13:40:49Z",
    "categories": [
      "physics.plasm-ph",
      "physics.app-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2602.03504v1",
    "url": "https://arxiv.org/abs/2602.03504v1",
    "pdf_url": "https://arxiv.org/pdf/2602.03504v1.pdf",
    "title": "Characterization of Stitched Prototypes Chip for the ALICE ITS3 Upgrade",
    "abstract": "During LHC Long Shutdown 3, the ALICE experiment will replace the three innermost layers of its Inner Tracking System (ITS2) with a new vertex detector, the ITS3. This new detector will be assembled using wafer-scale, stitched Monolithic Active Pixel Sensors (MAPS) fabricated using a 65nm CMOS technology node, which will be thinned and bent to form truly cylindrical layers around the beam pipe. To validate the new technology, several prototypes were developed and extensively characterized. This work focuses on the results of a test beam campaign performed at the CERN PS in September 2024, using a \\SI{10}{\\giga\\eV} pion beam, to estimate detection efficiency and spatial resolution of the babyMOSS prototype, a smaller version of the MOnolithic Stitched Sensor (MOSS). Both non-irradiated and irradiated chips are tested, and the results confirm that the prototypes meet the ITS3 requirements, demonstrating a detection efficiency above 99\\%, with a fake-hit rate below 10$^{-6}$ hits/pixel/event and a spatial resolution around \\SI{5}{\\micro\\meter}.",
    "authors": [
      "Michele Rignanese"
    ],
    "published": "2026-02-03T13:22:41Z",
    "updated": "2026-02-03T13:22:41Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.03494v1",
    "url": "https://arxiv.org/abs/2602.03494v1",
    "pdf_url": "https://arxiv.org/pdf/2602.03494v1.pdf",
    "title": "Collisionless Larmor Coupling and Blob Formation in a Laser-Plasma Expanding into a Magnetized Ambient Plasma",
    "abstract": "Collisionless Larmor coupling is a fundamental process in space and astrophysical plasmas that enables momentum transfer between an expanding plasma and a magnetized ambient medium. In this paper, we report on the laboratory experimental study of Larmor coupling leading to the formation of a plasma blob associated with a laser-driven, super-Alfvénic plasma flow on the Large Plasma Device at the University of California, Los Angeles. The high-repetition rate enables systematic spatial and temporal scans of the plasma evolution using Doppler spectroscopy, as well as measurements of the magnetic field, electrostatic field, and self-emission of both debris and ambient ions using filtered imaging. We observe the self-focusing of the laser-produced plasma and the formation of a secondary diamagnetic cavity associated with a blob composed of background ions. Doppler spectroscopy reveals the transverse velocity distribution of the background ions, providing direct evidence of ion energization via Larmor coupling. The systematic spatial and temporal scans enabled by the high-repetition rate experiment allow for a detailed characterization of the ion dynamics. These experimental observations are supported by numerical simulations that provide more insight into the kinetic-scale physics associated with blob formation as well as the role of the ambient plasma density.",
    "authors": [
      "Lucas Rovige",
      "Robert S. Dorst",
      "Ari Le",
      "Carmen G. Constantin",
      "Haiping Zhang",
      "David J. Larson",
      "Stephen Vincena",
      "Shreekrishna Tripathi",
      "Misa M. Cowee",
      "Derek B. Schaeffer",
      "Christoph Niemann"
    ],
    "published": "2026-02-03T13:10:26Z",
    "updated": "2026-02-03T13:10:26Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.15818v2",
    "url": "https://arxiv.org/abs/2601.15818v2",
    "pdf_url": "https://arxiv.org/pdf/2601.15818v2.pdf",
    "title": "Muon beams towards muonium physics: progress and prospects",
    "abstract": "Advances in accelerator technology have led to significant improvements in the quality of muon beams over the past decades. Investigations of the muon and muonium enable precise measurements of fundamental constants, as well as searches for new physics beyond the Standard Model. Furthermore, by utilizing muon beams with high intensity and polarization, studies of the dynamics of the muon and muonium within atomic level can offer valuable insights into materials science. This review presents recent progress and prospects at the frontiers of muon beams and high-precision muonium physics. It also provides an overview of novel methods and detection techniques to achieve high sensitivities in different areas, including particle physics, nuclear physics, materials science and beyond.",
    "authors": [
      "Siyuan Chen",
      "Mingchen Sun",
      "Jian Tang"
    ],
    "published": "2026-01-22T10:05:19Z",
    "updated": "2026-02-03T11:59:31Z",
    "categories": [
      "hep-ex",
      "cond-mat.mtrl-sci",
      "physics.acc-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2511.11401v4",
    "url": "https://arxiv.org/abs/2511.11401v4",
    "pdf_url": "https://arxiv.org/pdf/2511.11401v4.pdf",
    "title": "GRANITE: High-Resolution Imaging and Electrical Qualification of Large-Area TPC Electrodes",
    "abstract": "Next-generation dual-phase time projection chambers (TPCs) for rare event searches will require large-scale, high-precision electrodes. To meet the stringent requirements for high-voltage performance of such an experiment, we have developed a scanning setup for comprehensive electrode quality assurance. The system is built around the GRANITE (Granular Robotic Assay for Novel Integrated TPC Electrodes) facility: a gantry robot on top of a $2.5\\,\\text{m}\\times1.8\\,\\text{m}$ granite table, equipped with a suite of non-contact metrology devices.   We developed a coaxial wire scanning head to measure and correlate localized high-voltage discharge currents in air with high-resolution surface images. We find that the identified discharge 'hotspots' are transient and show no significant correlation with static visual features. Next, we established a quantitative relationship between artificially induced abrasive surface damage on the wires and a reduction in the discharge inception voltage. This work provides a novel non-invasive tool for qualifying wires dedicated for use in electrodes for future low-background experiments.",
    "authors": [
      "Shumit A. Mitra",
      "Alexander Deisting",
      "Jan Lommler",
      "Uwe Oberlack",
      "Fabian Piermaier",
      "Quirin Weitzel",
      "Daniel Wenz"
    ],
    "published": "2025-11-14T15:28:26Z",
    "updated": "2026-02-03T11:12:31Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/21/01/P01034"
  },
  {
    "arxiv_id": "2511.11400v4",
    "url": "https://arxiv.org/abs/2511.11400v4",
    "pdf_url": "https://arxiv.org/pdf/2511.11400v4.pdf",
    "title": "GRANITE: Mechanical Characterization and Optical Inspection of Large-Area TPC Electrodes",
    "abstract": "Next-generation dual-phase time projection chambers (TPCs) for rare event searches will require large-scale, high-precision electrodes. To meet the stringent requirements for mechanical stability and high-voltage performance of such an experiment, we have developed a scanning setup for electrode quality assurance called GRANITE: Granular Robotic Assay for Novel Integrated TPC Electrodes. GRANITE is built around a gantry robot on top of a $2.5\\,\\text{m}\\times1.8\\,\\text{m}$ granite table, equipped with a suite of non-contact metrology devices.   We demonstrate the setup's capabilities in two key areas: first, using laser scanners, we characterize wire tension, and in an independent measurement wire deflection due to gravity and electrostatic forces is determined. The setup achieves a precision of $20\\,μ\\text{m}$ for the relative measurement of only electrostatic displacement. Furthermore, GRANITE can measure gravitational sag down to $200\\,μ\\text{m}$ in an absolute measurement; this precision improves to $50\\,μ\\text{m}$ when applying model-based corrections for systematic effects. The performance achieved exceeds the needs for the characterisation of the electrode sagging in future experiments, which typically aims to ensure a maximal sag on the order of $500\\,μ\\text{m}$.   Second, we use GRANITE's high resolution camera to image all wires of XENON1T's cathode grid. Subsets of these images are then hand sorted and used to train an autoencoder, to reliably classify wire images as either pristine wires or images containing severe anomalous features. These anomalies appear e.g. as staining and may be potential defects. The interpretation of the classification results is complicated by the fact that most wire segments are not spotless, but show a varying amount of anomalous features. Follow-up studies are needed to identify the exact nature of such features on wires.",
    "authors": [
      "Alexander Deisting",
      "Jan Lommler",
      "Shumit A. Mitra",
      "Uwe Oberlack",
      "Fabian Piermaier",
      "Quirin Weitzel",
      "Daniel Wenz"
    ],
    "published": "2025-11-14T15:28:24Z",
    "updated": "2026-02-03T11:07:22Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/21/01/P01033"
  },
  {
    "arxiv_id": "2602.03375v1",
    "url": "https://arxiv.org/abs/2602.03375v1",
    "pdf_url": "https://arxiv.org/pdf/2602.03375v1.pdf",
    "title": "Effect of static magnetic island on ITG of ADITYA-U tokamak",
    "abstract": "Magnetic islands play a crucial role in regulating plasma confinement in tokamaks by interacting with micro-instabilities, such as the ion temperature gradient (ITG) mode. This work presents a detailed investigation of the effects of static magnetic islands on ITG instability, relevant to the ADITYA-U tokamak, using the Global Gyrokinetic Code in Cylindrical Coordinates (G2C3), a particle-in-cell (PIC) framework that employs a neural-network-assisted projection scheme. A two-phase simulation strategy is adopted. In the first phase, static magnetic islands with mode numbers (m, n) = (2, 1) and (3, 1) are introduced by perturbing the equilibrium magnetic flux functions. Particle dynamics within these modified topologies result in the flattening of plasma density profiles in the island regions, confirming island formation and its impact on the equilibrium profiles. In the second phase, the flattened profiles serve as new equilibria for linear electrostatic gyrokinetic simulations with adiabatic electrons, enabling the study of the modified ITG behavior. Magnetic islands significantly restructure the ITG mode, producing a spatial redistribution of potential fluctuations within and around the island region. Moreover, as the island width increases, the growth rates of different toroidal ITG modes converge, suggesting a universal stabilization trend. A comparison between the (2,1) and (3,1) islands indicates that higher-q islands lead to a more spatially extended ITG mode structure, reflecting the longer magnetic connection lengths and weaker curvature drive at outer flux surfaces. These results demonstrate the pivotal role of island-induced equilibrium modifications in determining ITG stability and mode structure in tokamak plasmas.",
    "authors": [
      "Vibhor Kumar Singh",
      "Amal R Biju",
      "Jaya Kumar Alageshan",
      "Kaushalender Singh",
      "Deepti Sharma",
      "Joydeep Ghosh",
      "Nishant Sirse",
      "Abhijit Sen",
      "Sarveshwar Sharma",
      "Manjunatha Valmiki",
      "Sandeep Agrawal",
      "Sanjay Wandhekar",
      "Animesh Kuley"
    ],
    "published": "2026-02-03T10:53:10Z",
    "updated": "2026-02-03T10:53:10Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.07457v2",
    "url": "https://arxiv.org/abs/2512.07457v2",
    "pdf_url": "https://arxiv.org/pdf/2512.07457v2.pdf",
    "title": "Generalized density functional theory framework for the non-linear density response of quantum many-body systems",
    "abstract": "A density functional theory (DFT) framework is presented that links functional derivatives of free-energy functionals to non-linear static density response functions in quantum many-body systems. Within this framework, explicit expressions are derived for various higher-order response functions of systems that are homogeneous on average, including the first theoretical result for the cubic response at the first harmonic $χ_0^{(1,3)}(\\vec{q})$. Specifically, our framework includes hitherto neglected mode-coupling effects that are important for the non-linear density response even in the presence of a single harmonic perturbation. We compare these predictions for $χ_0^{(1,3)}(\\vec{q})$ to new Kohn-Sham DFT simulations, leading to excellent agreement between theory and numerical results. Exact analytical expressions are also obtained for the long-wavelength limits of the ideal quadratic and cubic response functions. Particular emphasis is placed on the connections between the third- and fourth-order functional derivatives of the non-interacting free-energy functional $F_s[n]$ and the ideal quadratic and cubic response functions of the uniform electron gas, respectively. These relations provide exact constraints that may prove useful for the future construction of improved approximations to $F_s[n]$, in particular for warm dense matter applications at finite temperatures. Here, we use this framework to assess several commonly employed approximations to $F_s[n]$ through orbital-free DFT simulations of the harmonically perturbed ideal electron gas. The results are compared with Kohn-Sham DFT calculations across temperatures ranging from the ground state to the warm dense regime. Additionally, we analyze in detail the temperature- and wavenumber-dependent non-monotonic behavior of the ideal quadratic and cubic response functions.",
    "authors": [
      "Zhandos A. Moldabekov",
      "Cheng Ma",
      "Xuecheng Shao",
      "Sebastian Schwalbe",
      "Pontus Svensson",
      "Panagiotis Tolias",
      "Jan Vorberger",
      "Tobias Dornheim"
    ],
    "published": "2025-12-08T11:30:34Z",
    "updated": "2026-02-03T10:02:51Z",
    "categories": [
      "cond-mat.stat-mech",
      "physics.chem-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.stat-mech"
  },
  {
    "arxiv_id": "2602.03273v1",
    "url": "https://arxiv.org/abs/2602.03273v1",
    "pdf_url": "https://arxiv.org/pdf/2602.03273v1.pdf",
    "title": "Production of GEM-like structures for cryogenic applications, using laser-cutting techniques",
    "abstract": "A novel concept for electroluminescence (EL) structures was recently proposed. In it, a wavelength-shifting material is deposited inside the holes of GEM-like structures which, after suitable optical treatment of its electrodes, improves the light collection and detection efficiency in noble gas TPCs. This new development directly addresses problems related with the scalability of future dual-phase TPCs for rare-event searches, matching (and potentially exceeding) the performance of conventional EL techniques.   We report the newest developments on the production of such structures using laser-based techniques, namely the manufacture of a first batch of the so-called FAT-GEMs. This process allows low-cost and reproducible manufacturing of a high volume of such structures.   In addition to the detailed description of the production, we present a performance assessment in pure argon, at a gas density close to the one expected in LAr conditions. An energy resolution of 23.5$\\pm$1~\\% (FWHM) at 5.9~keV was obtained, indicating a consistent improvement over previous batch. The optical treatment of the electrode surfaces has been greatly simplified and modestly improved, while charging-up effects arising from the use of laminates eliminated.",
    "authors": [
      "D. Rodas-Rodríguez",
      "A. F. V. Cortez",
      "M. Kuźniak",
      "D. González-Díaz",
      "P. A. O. C. Silva",
      "A. Gnat",
      "G. Nieradka",
      "T. Sworobowicz",
      "E. Alario",
      "C. D. R. Azevedo",
      "K. T. Floethner",
      "P. Gasik",
      "J. Llerena",
      "C. M. B. Monteiro",
      "R. Oliveira",
      "A. Pallas",
      "D. Tenreiro",
      "V. Peskov",
      "J. M. F. dos Santos"
    ],
    "published": "2026-02-03T08:58:10Z",
    "updated": "2026-02-03T08:58:10Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2602.03270v1",
    "url": "https://arxiv.org/abs/2602.03270v1",
    "pdf_url": "https://arxiv.org/pdf/2602.03270v1.pdf",
    "title": "Computational Tools in EN-MME: Implicit and Explicit Finite-Element Simulations",
    "abstract": "This paper recalls the principles of the finite-element methods (FEM) theory and declines its application in the EN-MME group, for the numerical modelling and study of particle accelerator equipment. Implicit and explicit methods are compared, and practical examples of their use are given.",
    "authors": [
      "Federico Carra",
      "Giuditta Coladonato",
      "Audrey Piccini",
      "Joanna Sylwia Swieszek",
      "Nikolina Vejnovic"
    ],
    "published": "2026-02-03T08:56:15Z",
    "updated": "2026-02-03T08:56:15Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2602.01504v2",
    "url": "https://arxiv.org/abs/2602.01504v2",
    "pdf_url": "https://arxiv.org/pdf/2602.01504v2.pdf",
    "title": "First Experimental Demonstration of Beam Storage by Three-Dimensional Spiral Injection Scheme for Ultra-Compact Storage Rings",
    "abstract": "Three-dimensional spiral injection scheme enables storage in ultra-compact rings with nanosecond revolution period. We report the first successful storage of a $297\\,\\mathrm{keV/}c$ electron beam in a $22\\,\\mathrm{cm}$ weak-focusing storage ring with a $4.7\\,\\mathrm{ns}$ revolution period using multi-turn vertical kick with a $140\\,\\mathrm{ns}$ kicker pulse. Using a scintillating-fiber detector, we observe a signal exceeding $5σ$ of the pre-injection rms noise for $\\geq 1\\,\\mathrm{μs}$, confirming beam storage. By varying the weak-focusing field configuration and measuring the stored beam distribution, we show that the storage beam resides within the predicted region by Monte Carlo simulations. This result is a key proof-of-principle for realizing ultra-compact storage rings for next-generation precision measurements including the muon experiments at J-PARC and PSI.",
    "authors": [
      "R. Matsushita",
      "H. Iinuma",
      "S. Ohsawa",
      "H. Nakayama",
      "K. Furukawa",
      "S. Ogawa",
      "N. Saito",
      "T. Mibe",
      "M. A. Rehman"
    ],
    "published": "2026-02-02T00:33:47Z",
    "updated": "2026-02-03T08:24:08Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.02292v2",
    "url": "https://arxiv.org/abs/2512.02292v2",
    "pdf_url": "https://arxiv.org/pdf/2512.02292v2.pdf",
    "title": "Solitary Alfvén Waves",
    "abstract": "We present the solitary Alfvén wave, an exact nonlinear solution of the ideal magnetohydrodynamic (MHD) equations, and construct a three-dimensional numerical model -- an \\emph{Alfvénon}. The model is characterized by an unperturbed far field, quasi-constant $|\\boldsymbol{B}|$, and open field-line topology. Direct MHD simulations of the Alfvénon demonstrate remarkable stability, confirming that it behaves as a nonlinear solitary Alfvénic solution under ideal MHD evolution.",
    "authors": [
      "Zesen Huang",
      "Marco Velli",
      "Chen Shi",
      "Yuliang Ding"
    ],
    "published": "2025-12-02T00:15:37Z",
    "updated": "2026-02-03T08:02:22Z",
    "categories": [
      "astro-ph.SR",
      "astro-ph.HE",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  }
]