{
  "arxiv_id": "2411.02212v2",
  "url": "https://arxiv.org/abs/2411.02212v2",
  "pdf_url": "https://arxiv.org/pdf/2411.02212v2.pdf",
  "title": "Radiopurity screening of materials for rare event searches by neutron   activation at the TRIGA reactor of Pavia",
  "abstract": "In the framework of physics experiments searching for rare events, the selection of extremely radiopure materials is a challenging task, as the signal of interest is often hidden by instrumental background. Neutron activation is a powerful technique to measure trace contaminants with high sensitivity but, to be properly applied, it requires a good characterization of neutron irradiation and $\\gamma$-spectroscopy facilities. This paper presents the state-of-the-art workflow adopted by the Radioactivity Laboratory of the University of Milano-Bicocca for radiopurity screening of materials by neutron activation performed at the TRIGA reactor in Pavia. The ultimate sensitivity of the described workflow, in the absence of interfering activation products and without the application of radiochemical and/or active background rejection techniques, is $<10^{-14}$ g/g for $^{40}$K, $<10^{-12}$ g/g for $^{238}$U and of the order of $10^{-12}$ g/g for $^{232}$Th contaminations. Further details are here provided to address systematic uncertainties related to neutron irradiation that may bias results. To this aim, a dedicated neutron activation campaign was performed and the data were analyzed exploiting a Monte Carlo simulation model of the reactor and applying an unfolding technique to obtain a comprehensive characterization of the neutron flux in typical irradiation configurations. The results of this work provide a valuable benchmark for the application of neutron activation in future radiopurity screening campaigns.",
  "authors": [
    "G. Baccolo",
    "A. Barresi",
    "D. Chiesa",
    "M. Nastasi",
    "E. Previtali",
    "M. Sisti"
  ],
  "published": "2024-11-04T16:07:50Z",
  "updated": "2025-10-06T08:47:37Z",
  "categories": [
    "physics.ins-det",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.1140/epjp/s13360-025-06232-0"
}