{
  "arxiv_id": "2504.15307v3",
  "url": "https://arxiv.org/abs/2504.15307v3",
  "pdf_url": "https://arxiv.org/pdf/2504.15307v3.pdf",
  "title": "Modeling frequency instability in high-quality resonant experiments",
  "abstract": "Modern resonant sensing tools can achieve increasingly high quality factors, which correspond to extremely narrow linewidths. In such systems, time-variation of the resonator's natural frequency can potentially impact its ability to accumulate power and its resulting sensitivity. One such example is the Dark SRF experiment, which utilizes superconducting radio frequency (SRF) cavities with quality factors of $Q\\sim10^{10}$. Microscopic deformations of the cavity lead to stochastic jittering of its resonant frequency with amplitude 20 times its linewidth. Naively, one may expect this to lead to a large suppression in accumulated power. In this work, we study in detail the effects of frequency instability on high-quality resonant systems, utilizing the Dark SRF experiment as a case study. We show that the timescale of jittering is crucial to determining its effect on power accumulation. Namely, when the resonant frequency varies sufficiently quickly, the system accumulates power as if there were no jittering at all. This implies that the sensitivity of a jittering resonator is comparable to that of a stable resonator. In the case of Dark SRF, we find that jittering only induces a $\\sim 10\\%$ loss in power. Our results allow the dark-photon exclusion bound from Dark SRF's pathfinder run to be refined, leading to a constraint that is an order of magnitude stronger than previously reported (corresponding to a signal-to-noise ratio which is four orders of magnitude larger). This result represents the world-leading constraint on dark photons over a wide range of masses below $6\\,\\rm \\mu eV$ and translates to the best laboratory-based limits on the photon mass $m_\\gamma<2.9\\times 10^{-48}\\,\\rm g$.",
  "authors": [
    "Hao-Ran Cui",
    "Saarik Kalia",
    "Zhen Liu"
  ],
  "published": "2025-04-18T19:22:27Z",
  "updated": "2025-10-06T10:47:37Z",
  "categories": [
    "physics.ins-det",
    "hep-ex",
    "hep-ph"
  ],
  "primary_category": "physics.ins-det"
}