{
  "arxiv_id": "2508.13417v2",
  "url": "https://arxiv.org/abs/2508.13417v2",
  "pdf_url": "https://arxiv.org/pdf/2508.13417v2.pdf",
  "title": "Full Spectrum Modeling of In Situ Gamma-ray Detector Measurements with a   Focus on Precipitation-Induced Transients",
  "abstract": "Gamma-ray detectors that are deployed outdoors experience increased event rates during precipitation due to the attendant increase in Rn-222 progeny at ground level. The increased radiation due to these decay products (Pb-214 and Bi-214) has been studied for many decades in applications such as atmospheric science and radiation protection. For those applications radon progeny signatures are the signal of interest, while in the fields of radiological and nuclear security and aerial radiological mapping they are a nuisance. When searching for radiological contamination or missing sources, an analyst must take precipitation into account to reduce false alarms, in addition to accounting for static background signatures. To train advanced search algorithms, an effort has been underway to generate synthetic gamma-ray event data that represent a realistic urban area, including occasional rain events to add to the realism. This manuscript describes an effort to analyze and model gamma-ray spectra measured during rainfall by a NaI(Tl) detector located outdoors in order to derive accurate source terms for Pb-214 and Bi-214 at a high frequency (less than 1 minute). All known sources of background were quantitatively modeled across the full gamma-ray spectrum, so that the Pb-214 and Bi-214 activity concentrations on the ground could be inferred from a linear model fit to each spectrum. A physically motivated model was applied to the data to further smooth the fits, which had the benefit of yielding information about the concentrations of the progeny in rainwater and their apparent age, making this the first time full-spectrum modeling has been used for continuous measurements of radon progeny. This approach could lead to studies of radon progeny on shorter timescales than previously possible.",
  "authors": [
    "Mark S. Bandstra",
    "James M. Ghawaly",
    "Douglas E. Peplow",
    "Daniel E. Archer",
    "Brian J. Quiter",
    "Tenzing H. Y. Joshi",
    "Andrew D. Nicholson",
    "Michael J. Willis",
    "Irakli Garishvili",
    "Andrew J. Rowe",
    "Brandon R. Longmire",
    "Jason T. Nattress"
  ],
  "published": "2025-08-19T00:31:16Z",
  "updated": "2025-10-07T07:43:26Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}