{
  "arxiv_id": "2510.05287v1",
  "url": "https://arxiv.org/abs/2510.05287v1",
  "pdf_url": "https://arxiv.org/pdf/2510.05287v1.pdf",
  "title": "Difference in Neoclassical Edge Flows Between Strongly Negative and   Positive Triangularities in the XGC Gyrokinetic Simulation",
  "abstract": "The neoclassical baseline study of a strongly negative triangularity (NT) plasma and the corresponding positive triangularity plasma is performed using the edge-specialized, total-f gyrokinetic code XGC. A DIII-D-like plasma is used, based on the negative triangularity discharge of DIII-D \\#193793. An artificial positive triangularity (PT) equilibrium has been constructed to compare the edge rotation physics at the same triangularity strength, but with opposite sign, while keeping the same elongation and other geometric parameters. Carbon(+6) ions are added to the deuterium plasma at an experimentally relevant level. By using the experimental profile of carbon toroidal rotation profile as an input, XGC finds that the deuteron rotation is significantly different from the carbon rotation at the inboard and outboard midplanes, mostly caused by the difference in the Pfirsch-Schluter rotation. More importantly, significant difference in the X-point orbit loss physics, thus the rotation source, is found between the positive and negative triangularity equilibrium models. However, it is also found that the agreement between the present neoclassical simulation and the experimental NT data is validated only within the middle of pedestal slope, indicating the importance of edge turbulence. This study could establish baseline for the multiphysics, multiscale studies that include turbulence of negative triangularity plasmas.",
  "authors": [
    "S. Ku",
    "C. S. Chang",
    "R. Hager",
    "L. W. Schmitz",
    "A. O. Nelson"
  ],
  "published": "2025-10-06T18:55:01Z",
  "updated": "2025-10-06T18:55:01Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}