{
  "arxiv_id": "2510.05461v1",
  "url": "https://arxiv.org/abs/2510.05461v1",
  "pdf_url": "https://arxiv.org/pdf/2510.05461v1.pdf",
  "title": "Analytic timing calculations and timing limits with prompt photons,   high-aspect-ratio crystals, and complex TOF-kernels in TOF-PET",
  "abstract": "Modeling the timing performance of light-based radiation detectors accurately is essential for optimizing time-of-flight positron emission tomography (TOF-PET). We present an analytic framework that combines existing models to predict the timing behavior of high-aspect ratio crystals, including contributions from prompt photons such as Cherenkov radiation. This framework is built on a closed-form solution for optical light transport, convolved with the photodetector response and photon production characteristics. Using conditional and joint probability distributions, we compute the first-photon arrival time distribution for hybrid detectors with scintillation and Cherenkov light. The detection time distribution is then self-convolved to derive the time delay spectra and three timing metrics are used to characterize complex TOF kernels. Additionally, we perform Cram\\'er-Rao Lower Bound calculations with and without depth-of-interaction bias to evaluate the theoretical timing limits. Our analytic predictions align well with Monte Carlo simulations for BGO detectors under varying crystal thicknesses and single photon time resolution considering a digital photodetector. We show that the TOF shape is significantly affected by prompt photon statistics, crystal thickness, scintillation yield, and photodetector properties resulting in distinct metric-dependent timing performance. The proposed model enables rapid timing predictions for polished crystals, with the calculation time of a detector configuration in under a second, allowing for comprehensive parametric studies. This makes it a powerful tool for guiding detector development in fast-timing applications.",
  "authors": [
    "Nicolaus Kratochwil",
    "Emilie Roncali",
    "Gerard Arino-Estrada"
  ],
  "published": "2025-10-06T23:47:30Z",
  "updated": "2025-10-06T23:47:30Z",
  "categories": [
    "physics.ins-det",
    "physics.med-ph"
  ],
  "primary_category": "physics.ins-det"
}