[
  {
    "arxiv_id": "2510.04385v2",
    "url": "https://arxiv.org/abs/2510.04385v2",
    "pdf_url": "https://arxiv.org/pdf/2510.04385v2.pdf",
    "title": "Structure-Preserving MHD-Driftkinetic Discretization for Wave-Particle   Interactions",
    "abstract": "We present a structure-preserving discretization of the hybrid magnetohydrodynamics (MHD)-driftkinetic system for simulations of low-frequency wave-particle interactions. The model equations are derived from a variational principle, assuring energetically consistent couplings between MHD fluids and driftkinetic particles. The spatial discretization is based on a finite-element-exterior-calculus (FEEC) framework for the MHD and a particle-in-cell (PIC) method for the driftkinetic. A key feature of the scheme is the inclusion of the non-quadratic particle magnetic moment energy term in the Hamiltonian, which is introduced by the guiding-center approximation. The resulting discrete Hamiltonian structure naturally organizes the dynamics into skew-symmetric subsystems, enabling balanced energy exchange. To handle the non-quadratic energy term, we develop energy-preserving time integrators based on discrete gradient methods. The algorithm is implemented in the open-source Python package $\\texttt{STRUPHY}$. Numerical experiments confirm the energy-conserving property of the scheme and demonstrate the capability to simulate energetic particles (EP) induced excitation of toroidal Alfv\\'en eigenmodes (TAE) without artificial dissipation or mode filtering. This capability highlights the potential of structure-preserving schemes for high-fidelity simulations of hybrid systems.",
    "authors": [
      "Byung Kyu Na",
      "Stefan Possanner",
      "Xin Wang"
    ],
    "published": "2025-10-05T22:34:28Z",
    "updated": "2025-10-08T16:41:00Z",
    "categories": [
      "physics.comp-ph",
      "cs.NA",
      "math.NA",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.comp-ph"
  },
  {
    "arxiv_id": "2506.18830v3",
    "url": "https://arxiv.org/abs/2506.18830v3",
    "pdf_url": "https://arxiv.org/pdf/2506.18830v3.pdf",
    "title": "Wave Topology in Hall MHD",
    "abstract": "Hall Magnetohydrodynamics (HMHD) extends ideal MHD by incorporating the Hall effect via the induction equation, making it more accurate for describing plasma behavior at length scales below the ion skin depth. Despite its importance, a comprehensive description of the eigenmodes in HMHD has been lacking. In this work, we derive the complete spectrum and eigenvectors of HMHD waves and identify their underlying topological structure. We prove that the HMHD wave spectrum is homotopic to that of ideal MHD, consisting of three distinct branches: the slow magnetosonic-Hall waves, the shear Alfv\\'en-Hall waves, and the fast magnetosonic-Hall waves, which continuously reduce to their ideal MHD counterparts in the limit of vanishing Hall parameter. Contrary to a recent claim, we find that HMHD does not admit any additional wave branches beyond those in ideal MHD. The key qualitative difference lies in the topological nature of the HMHD wave structure: it exhibits nontrivial topology characterized by a Weyl point-an isolated eigenmode degeneracy point-and associated nonzero Chern numbers of the eigenmode bundles over a 2-sphere in k-space surrounding the Weyl point.",
    "authors": [
      "Alejandro Mesa Dame",
      "Hong Qin",
      "Eric Palmerduca",
      "Yichen Fu"
    ],
    "published": "2025-06-23T16:46:34Z",
    "updated": "2025-10-08T05:16:13Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.04777v2",
    "url": "https://arxiv.org/abs/2510.04777v2",
    "pdf_url": "https://arxiv.org/pdf/2510.04777v2.pdf",
    "title": "Performance and long-term aging studies on Eco-Friendly Resistive Plate   Chamber detectors",
    "abstract": "Resistive Plate Chambers detectors are extensively used in several domains of Physics. In High Energy Physics, they are typically operated in avalanche mode with a high-performance gas mixture based on Tetrafluoroethane (C2H2F4), a fluorinated high Global Warming Potential greenhouse gas. The RPC EcoGas@GIF++ Collaboration has pursued an intensive R\\&D activity to search for new gas mixtures with low environmental impact, fulfilling the performance expected for the LHC operations as well as for future and different applications. Here, results obtained with new eco-friendly gas mixtures based on Tetrafluoropropene and carbon dioxide, even under high-irradiation conditions, will be presented. Long-term aging tests carried out at the CERN Gamma Irradiation Facility will be discussed along with their possible limits and future perspectives.",
    "authors": [
      "D. Ahmadi",
      "M. Tytgat"
    ],
    "published": "2025-10-06T12:53:05Z",
    "updated": "2025-10-07T17:37:42Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.06150v1",
    "url": "https://arxiv.org/abs/2510.06150v1",
    "pdf_url": "https://arxiv.org/pdf/2510.06150v1.pdf",
    "title": "Simulation of Muon-induced Backgrounds for the Colorado Underground   Research Institute (CURIE)",
    "abstract": "We present a comprehensive Monte Carlo simulation of muon-induced backgrounds for the Colorado Underground Research Institute (CURIE), a shallow-underground facility with $\\approx 415$~m.w.e. overburden. Using coupled \\textsc{mute} and \\textsc{geant4} frameworks, we characterize the production and transport of muon-induced secondaries through site-specific rock compositions and geometries, establishing a proof-of-concept for high-precision, end-to-end simulations. Our simulations employ angular-dependent muon energy distributions, which improve secondary flux accuracy. For the Subatomic Particle Hideout and Cryolab I research spaces, we predict total muon-induced neutron fluxes of $(3.78 \\pm 0.61_{\\text{sys}}) \\times 10^{-3}$~m$^{-2}$s$^{-1}$ and $(3.97 \\pm 0.65_{\\text{sys}}) \\times 10^{-3}$~m$^{-2}$s$^{-1}$, respectively, consistent with empirical depth parameterizations. The simulated neutron energy spectra exhibit the expected thermal, epithermal, evaporation, and spallation components extending to GeV energies. Electromagnetic backgrounds are expected to dominate the total flux, with $\\gamma$-ray components of $(5.54 \\pm 0.91_{\\text{sys}}) \\times 10^{-1}$~m$^{-2}$s$^{-1}$ and $(6.51 \\pm 1.06_{\\text{sys}}) \\times 10^{-1}$~m$^{-2}$s$^{-1}$ for the Subatomic Particle Hideout and Cryolab I facilities, respectively. These results provide quantitative background predictions for experimental design and sensitivity projections at shallow- and deep-underground facilities. They further demonstrate that local geology and overburden geometry influence muon-induced secondary yields and energy spectra, emphasizing the need for site-specific simulations for accurate underground background characterization. Therefore, the simulation framework has been made publicly available for the broader low-background physics community to enable meaningful inter-facility comparisons.",
    "authors": [
      "Dakota K. Keblbeck",
      "Eric Mayotte",
      "Uwe Greife",
      "Kyle G. Leach",
      "Wouter Van De Pontseele",
      "Caitlyn Stone-Whitehead",
      "Luke Wanner",
      "Grace Wagner"
    ],
    "published": "2025-10-07T17:21:18Z",
    "updated": "2025-10-07T17:21:18Z",
    "categories": [
      "hep-ex",
      "physics.comp-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2509.11255v2",
    "url": "https://arxiv.org/abs/2509.11255v2",
    "pdf_url": "https://arxiv.org/pdf/2509.11255v2.pdf",
    "title": "PhysDNet: Physics-Guided Decomposition Network of Side-Scan Sonar   Imagery",
    "abstract": "Side-scan sonar (SSS) has become an essential tool for seafloor mapping and underwater exploration. However, the measured intensity is entangled with seabed reflectivity, terrain elevation, and acoustic path loss, making the imagery highly view dependent and hindering robust interpretation. To address this challenge, we propose PhysDNet, a physics-guided multi-branch network that explicitly decouples SSS images into three interpretable fields: reflectivity, elevation, and path loss. The network employs attention augmented encoder decoder branches, imposes range wise consistency constraints on path loss, and incorporates a Lambertian based reconstruction to enable progressive selfsupervised training, thereby ensuring stable multi-task optimization while embedding physical priors into the learning process. Experiments demonstrate that the decomposed fields preserve geological structures, recover physically consistent illumination and attenuation, and enable accurate shadow prediction. These findings confirm that physics guided decomposition establishes a stable and interpretable domain for SSS analysis, enhancing both physical consistency and downstream applications such as registration and shadow interpretation.",
    "authors": [
      "Can Lei",
      "Hayat Rajani",
      "Nuno Gracias",
      "Rafael Garcia",
      "Huigang Wang"
    ],
    "published": "2025-09-14T12:54:42Z",
    "updated": "2025-10-07T16:27:38Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.08121v2",
    "url": "https://arxiv.org/abs/2508.08121v2",
    "pdf_url": "https://arxiv.org/pdf/2508.08121v2.pdf",
    "title": "Sensitivity of an Early Dark Matter Search using the Electromagnetic   Calorimeter as a Target for the Light Dark Matter eXperiment",
    "abstract": "The Light Dark Matter eXperiment (LDMX) is proposed to employ a thin tungsten target and a multi-GeV electron beam to carry out a missing momentum search for the production of dark matter candidate particles. We study the sensitivity for a complementary missing-energy-based search using the LDMX Electromagnetic Calorimeter as an active target with a focus on early running. In this context, we construct an event selection from a limited set of variables that projects sensitivity into previously-unexplored regions of light dark matter phase space -- down to an effective dark photon interaction strength $y$ of approximately $2\\times10^{-13}$ ($5\\times10^{-12}$) for a 1MeV (10MeV) dark matter candidate mass.",
    "authors": [
      "LDMX Collaboration",
      "Torsten Åkesson",
      "Elizabeth Berzin",
      "Cameron Bravo",
      "Liam Brennan",
      "Lene Kristian Bryngemark",
      "Pierfrancesco Butti",
      "Filippo Delzanno",
      "E. Craig Dukes",
      "Valentina Dutta",
      "Bertrand Echenard",
      "Ralf Ehrlich",
      "Thomas Eichlersmith",
      "Einar Elén",
      "Andrew Furmanski",
      "Victor Gomez",
      "Matt Graham",
      "Chiara Grieco",
      "Craig Group",
      "Hannah Herde",
      "Christian Herwig",
      "David G. Hitlin",
      "Tyler Horoho",
      "Joseph Incandela",
      "Nathan Jay",
      "Asahi Jige",
      "Wesley Ketchum",
      "Gordan Krnjaic",
      "Amina Li",
      "Zihan Ma",
      "Jeremiah Mans",
      "Cristina Mantilla Suarez",
      "Sanjit Masanam",
      "Phillip Masterson",
      "Steven Metallo",
      "Sophie Middleton",
      "Joseph Muse",
      "Timothy Nelson",
      "Rory O'Dwyer",
      "James Oyang",
      "Jessica Pascadlo",
      "Emrys Peets",
      "Luis Sarmiento Pico",
      "Ruth Pöttgen",
      "Philip Schuster",
      "Chris Sellgren",
      "Lauren Tompkins",
      "Natalia Toro",
      "Nhan Tran",
      "Tamas Vami",
      "Erik Wallin",
      "Yuxuan Wang",
      "Andrew Whitbeck",
      "Duncan Wilmot",
      "Xinyi Xu",
      "Danyi Zhang"
    ],
    "published": "2025-08-11T15:59:20Z",
    "updated": "2025-10-07T15:25:44Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2510.05954v1",
    "url": "https://arxiv.org/abs/2510.05954v1",
    "pdf_url": "https://arxiv.org/pdf/2510.05954v1.pdf",
    "title": "Kinetic collisionless model of the solar transition region and corona   with spatially intermittent heating",
    "abstract": "We develop a three-dimensional kinetic model of the solar transition region and corona in which the plasma above the chromosphere is collisionless and embedded in a uniform magnetic field. Heating occurs intermittently at discrete locations on the chromospheric surface, modeled through a surface coarse-graining procedure that produces non-thermal boundary conditions for the Vlasov equation. The resulting stationary distribution functions generate suprathermal particle populations and naturally lead to a temperature inversion via gravitational filtering, without any local coronal heating. The model reproduces realistic temperature and density profiles with a thin transition region and a hot corona, consistent with solar observations. These results demonstrate that the spatial intermittency of heating at the chromospheric interface is sufficient to account for the formation of the transition region and the high-temperature corona.",
    "authors": [
      "Luca Barbieri",
      "Pascal Démoulin"
    ],
    "published": "2025-10-07T14:11:19Z",
    "updated": "2025-10-07T14:11:19Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2510.02955v2",
    "url": "https://arxiv.org/abs/2510.02955v2",
    "pdf_url": "https://arxiv.org/pdf/2510.02955v2.pdf",
    "title": "On the existence of fibered three-dimensional perfect fluid equilibria   without continuous Euclidean symmetry",
    "abstract": "Following Lortz, we construct a family of smooth steady states of the ideal, incompressible Euler equation in three dimensions that possess no continuous Euclidean symmetry. As in Lortz, they do possess a planar reflection symmetry and, as such, all the orbits of the velocity are closed. Different from Lortz, our construction has a discrete m-fold symmetry and is foliated by invariant cylindrical level sets of a non-degenerate Bernoulli pressure. Such examples narrow the scope of validity of Grad's conjecture that the only solutions with a continuous symmetry can be fibered by pressure surfaces.",
    "authors": [
      "Theodore D. Drivas",
      "Tarek M. Elgindi",
      "Daniel Ginsberg"
    ],
    "published": "2025-10-03T12:47:27Z",
    "updated": "2025-10-07T14:08:44Z",
    "categories": [
      "math.AP",
      "physics.flu-dyn",
      "physics.plasm-ph",
      "35Q31, 76B03, 76W05"
    ],
    "primary_category": "math.AP"
  },
  {
    "arxiv_id": "2508.13858v3",
    "url": "https://arxiv.org/abs/2508.13858v3",
    "pdf_url": "https://arxiv.org/pdf/2508.13858v3.pdf",
    "title": "Numerical simulations of a RF-RF hybrid plasma torch with argon at   atmospheric pressure",
    "abstract": "We report numerical results regarding the minimum sustaining coil excitation current for a RF-RF hybrid torch operating at two different frequencies. The first coil is excited at a high-frequency, while the second coil is set at a medium frequency. The filling gas is argon, at atmospheric pressure. We use the modeling software COMSOL Multiphysics to describe the evolution of key parameters when: (i) the distance between the two coils changes, (ii) the power of the high frequency coil changes. We discuss the radial temperature profiles, the axial velocities and the heat convected at the end of the medium-frequency coil. The latter is compared with the total heat conduction to the plasma confinement tube wall.",
    "authors": [
      "Loann Terraz",
      "Biruk Alemu",
      "Santiago Eizaguirre"
    ],
    "published": "2025-08-19T14:17:59Z",
    "updated": "2025-10-07T14:01:40Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.05939v1",
    "url": "https://arxiv.org/abs/2510.05939v1",
    "pdf_url": "https://arxiv.org/pdf/2510.05939v1.pdf",
    "title": "Advances in Radiative Capture Studies at LUNA with a Segmented BGO   Detector",
    "abstract": "Studies of charged-particle reactions for low-energy nuclear astrophysics require high sensitivity, which can be achieved by means of detection setups with high efficiency and low backgrounds, to obtain precise measurements in the energy region of interest for stellar scenarios. High-efficiency total absorption spectroscopy is an established and powerful tool for studying radiative capture reactions, particularly if combined with the cosmic background reduction by several orders of magnitude obtained at the Laboratory for Underground Nuclear Astrophysics (LUNA). We present recent improvements in the detection setup with the Bismuth Germanium Oxide (BGO) detector at LUNA, aiming to reduce high-energy backgrounds and to increase the summing detection efficiency. The new design results in enhanced sensitivity of the BGO setup, as we demonstrate and discuss in the context of the first direct measurement of the 65 keV resonance ($E_{x} = 5672$ keV) of the $^{17}$O($p,\\gamma$)$^{18}$F reaction. Moreover, we show two applications of the BGO detector, which exploit its segmentation. In case of complex $\\gamma$-ray cascades, e.g. the de-excitation of $E_{x} = 5672$ keV in $^{18}$F, the BGO segmentation allows to identify and suppress the beam-induced background signals that mimic the sum peak of interest. We demonstrate another new application for such a detector in form of in-situ activation measurements of a reaction with $\\beta ^{+}$ unstable product nuclei, e.g., the $^{14}$N($p,\\gamma$)$^{15}$O reaction.",
    "authors": [
      "Jakub Skowronski",
      "Riccardo Maria Gesuè",
      "Axel Boeltzig",
      "Giovanni Francesco Ciani",
      "Denise Piatti",
      "David Rapagnani",
      "Marialuisa Aliotta",
      "Chemsedinne Ananna",
      "Francesco Barile",
      "Daniel Bemmerer",
      "Andreas Best",
      "Carlo Broggini",
      "Carlo Giovanni Bruno",
      "Antonio Caciolli",
      "Matteo Campostrini",
      "Francesca Cavanna",
      "Paolo Colombetti",
      "Alessandro Compagnucci",
      "Piero Corvisiero",
      "Laszlo Csedreki",
      "Tom Davinson",
      "Rosanna Depalo",
      "Antonino Di Leva",
      "Zoltan Elekes",
      "Federico Ferraro",
      "Alba Formicola",
      "Zsolt Fülöp",
      "Gianpiero Gervino",
      "Alessandra Guglielmetti",
      "Carlo Gustavino",
      "György Gyürky",
      "Gianluca Imbriani",
      "Matthias Junker",
      "Maria Lugaro",
      "Paola Marigo",
      "Eliana Masha",
      "Roberto Menegazzo",
      "Vincenzo Paticchio",
      "Roberto Perrino",
      "Paolo Prati",
      "Valentino Rigato",
      "Luigi Schiavulli",
      "Ragandeep Singh Sidhu",
      "Oscar Straniero",
      "Tamás Szűcs",
      "Sandra Zavatarelli"
    ],
    "published": "2025-10-07T13:50:13Z",
    "updated": "2025-10-07T13:50:13Z",
    "categories": [
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "nucl-ex",
    "doi": "10.1088/1361-6471/acb961"
  },
  {
    "arxiv_id": "2510.05918v1",
    "url": "https://arxiv.org/abs/2510.05918v1",
    "pdf_url": "https://arxiv.org/pdf/2510.05918v1.pdf",
    "title": "Low-energy Cross Section Measurements of   ${}^{\\mathsf{12}}\\mathsf{C}(\\mathsf{p},γ)$ Deep Underground at LUNA",
    "abstract": "The ${}^{\\mathsf{12}}\\mathsf{C}(\\mathsf{p},\\gamma)$ reaction cross section is currently under investigation in the low-background environment of the Laboratory for Underground Nuclear Astrophysics (LUNA). It is being studied using different types of solid targets, and employing two complementary detection techniques: HPGe spectroscopy and activation counting. To reduce systematic uncertainties, targets have been accurately characterized and their degradation under the intense beam of the LUNA-400 accelerator monitored. We present the experimental techniques and the corresponding analyses used to extract the reaction cross section.",
    "authors": [
      "Jakub Skowronski",
      "Axel Boeltzig"
    ],
    "published": "2025-10-07T13:29:09Z",
    "updated": "2025-10-07T13:29:09Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.SR",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1051/epjconf/202327903002"
  },
  {
    "arxiv_id": "2510.05912v1",
    "url": "https://arxiv.org/abs/2510.05912v1",
    "pdf_url": "https://arxiv.org/pdf/2510.05912v1.pdf",
    "title": "Investigating the Lower Hybrid Drift Instability in Reconnecting Current   Sheets Using a Hybrid Kinetic Model (ssV Code)",
    "abstract": "We investigate the nonlinear evolution of the lower hybrid drift instability (LHDI) in reconnecting current sheets using a hybrid kinetic simulation model implemented in the Super Simple Vlasov (ssV) code. The model treats ions kinetically and electrons with a drift-kinetic approximation, solving self-consistent coupled electrostatic and electromagnetic fields. A parametric study explores the effects of mass ratio, temperature ratio, plasma beta, and sheet thickness. In electrostatic cases, LHDI remains localized at the sheet edges, flattening density gradients. In electromagnetic regimes, turbulence induced by LHDI generates magnetic perturbations that kink the current sheet and enhance anomalous resistivity. These dynamics may facilitate fast magnetic reconnection under certain conditions. Our results bridge prior theoretical predictions and simulations, emphasizing the importance of kinetic instabilities in reconnection physics.",
    "authors": [
      "S. Thatikonda",
      "F. N. De Oliveira-Lopes",
      "A. Mustonen",
      "K. Pommois",
      "D. Told",
      "F. Jenko"
    ],
    "published": "2025-10-07T13:25:24Z",
    "updated": "2025-10-07T13:25:24Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.05910v1",
    "url": "https://arxiv.org/abs/2510.05910v1",
    "pdf_url": "https://arxiv.org/pdf/2510.05910v1.pdf",
    "title": "Superconducting Nanowire Single Photon Detectors based on NbRe nitride   ultrafilms",
    "abstract": "The influence of the reactive DC sputtering parameters on the superconducting properties of NbReN ultrathin films was investigated. A detailed study of the current-voltage characteristics of the plasma was performed to optimize the superconducting critical temperature, Tc. The thickness dependence of Tc for the films deposited under different conditions was analyzed down to the ultrathin limit. Optimized films were used to fabricate superconducting nanowire single photon detectors which, at T=3.5 K, show saturated internal detection efficiency (IDE) up to a wavelength of 1301 nm and 95% IDE at 1548 nm with recovery times and timing jitter of about 8 ns and 28 ps, respectively.",
    "authors": [
      "F. Avitabile",
      "F. Colangelo",
      "M. Yu. Mikhailov",
      "Z. Makhdoumi Kakhaki",
      "A. Kumar",
      "I. Esmaeil Zadeh",
      "C. Attanasio",
      "C. Cirillo"
    ],
    "published": "2025-10-07T13:21:28Z",
    "updated": "2025-10-07T13:21:28Z",
    "categories": [
      "cond-mat.supr-con",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.supr-con"
  },
  {
    "arxiv_id": "2510.05877v1",
    "url": "https://arxiv.org/abs/2510.05877v1",
    "pdf_url": "https://arxiv.org/pdf/2510.05877v1.pdf",
    "title": "Low-energy threshold demonstration for dark matter searches in TREX-DM   with an $^{37}$Ar source produced at CNA HiSPANoS",
    "abstract": "We report on the successful implementation of an $^{37}$Ar calibration source in the TREX-DM detector, a high-pressure time projection chamber designed for low-mass dark matter searches. The $^{37}$Ar source was produced through fast neutron activation of CaO powder at the HiSPANoS facility of Centro Nacional de Aceleradores (CNA) in Spain, yielding $O(1)$ kBq of activity. Using a novel combined GEM-Micromegas readout system, we successfully detected both characteristic emissions from $^{37}$Ar decay (2.82 keV and 270 eV) and achieved unprecedented energy threshold performance in TREX-DM, approaching the single-electron ionization energy of argon.",
    "authors": [
      "J. Castel",
      "S. Cebrián",
      "T. Dafni",
      "D. Díez-Ibáñez",
      "A. Ezquerro",
      "B. Fernández",
      "J. Galán",
      "J. A. García",
      "C. Guerrero",
      "I. G. Irastorza",
      "G. Luzón",
      "C. Margalejo",
      "H. Mirallas",
      "L. Obis",
      "A. Ortiz de Solórzano",
      "O. Pérez",
      "J. Porrón",
      "M. J. Puyuelo",
      "A. Quintana"
    ],
    "published": "2025-10-07T12:47:03Z",
    "updated": "2025-10-07T12:47:03Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.05278v2",
    "url": "https://arxiv.org/abs/2507.05278v2",
    "pdf_url": "https://arxiv.org/pdf/2507.05278v2.pdf",
    "title": "Neutron EDM Experiment with an Advanced Ultracold Neutron Source at   TRIUMF",
    "abstract": "The TRIUMF Ultracold Advanced Neutron (TUCAN) collaboration has been developing a high-intensity ultracold neutron (UCN) source aimed at searching for the neutron electric dipole moment (EDM) with a sensitivity goal of $10^{-27}\\ e{\\rm cm}$. This article reports on recent progress in commissioning of the UCN source and in the development of the neutron EDM spectrometer. In its final configuration, the accelerator-driven super-thermal UCN source will enable a neutron EDM experiment with two orders of magnitude improved statistics compared to the current best experiment. Substantial progress in 2024 allowed the collaboration to operate the complete source system, with the exception of the liquid deuterium cold moderator, resulting in the first production of UCNs. The status of the EDM spectrometer is also presented, with emphasis on UCN handling components and magnetic subsystems relevant to field control, shielding, and magnetometry.",
    "authors": [
      "T. Higuchi",
      "B. Algohi",
      "D. Anthony",
      "L. Barrón-Palos",
      "M. Bradley",
      "A. Brossard",
      "T. Bui",
      "J. Chak",
      "R. Chiba",
      "C. Davis",
      "R. de Vries",
      "K. Drury",
      "D. Fujimoto",
      "R. Fujitani",
      "M. Gericke",
      "P. Giampa",
      "R. Golub",
      "T. Hepworth",
      "G. Ichikawa",
      "S. Imajo",
      "A. Jaison",
      "B. Jamieson",
      "M. Katotoka",
      "S. Kawasaki",
      "M. Kitaguchi",
      "W. Klassen",
      "E. Korkmaz",
      "E. Korobkina",
      "M. Lavvaf",
      "T. Lindner",
      "N. Lo",
      "S. Longo",
      "K. Madison",
      "Y. Makida",
      "J. Malcolm",
      "J. Mammei",
      "R. Mammei",
      "Z. Mao",
      "C. Marshall",
      "J. W. Martin",
      "M. McCrea",
      "E. Miller",
      "M. Miller",
      "K. Mishima",
      "T. Mohammadi",
      "T. Momose",
      "T. Okamura",
      "H. J. Ong",
      "R. Patni",
      "R. Picker",
      "K. Qiao",
      "W. D. Ramsay",
      "W. Rathnakela",
      "D. Salazar",
      "J. Sato",
      "W. Schreyer",
      "T. Shima",
      "H. M. Shimizu",
      "S. Sidhu",
      "S. Stargardter",
      "P. Switzer",
      "I. Tanihata",
      "Tushar",
      "S. Vanbergen",
      "W. T. H. van Oers",
      "Y. Watanabe",
      "N. Yazdandoost",
      "Q. Ye",
      "A. Zahra",
      "M. Zhao"
    ],
    "published": "2025-07-04T08:09:45Z",
    "updated": "2025-10-07T12:46:44Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex",
      "physics.atom-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.05873v1",
    "url": "https://arxiv.org/abs/2510.05873v1",
    "pdf_url": "https://arxiv.org/pdf/2510.05873v1.pdf",
    "title": "Exploring Complexity Measures for Analysis of Solar Wind Structures and   Streams",
    "abstract": "In this paper we use statistical complexity and information theory metrics to study structure within solar wind time series. We explore this using entropy-complexity and information planes, where the measure for entropy is formed using either permutation entropy or the degree distribution of a horizontal visibility graph (HVG). The entropy is then compared to the Jensen complexity (Jensen-Shannon complexity plane) and Fisher information measure (Fisher-Shannon information plane), formed both from permutations and the HVG approach. Additionally we characterise the solar wind time series by studying the properties of the HVG degree distribution. Four types of solar wind intervals have been analysed, namely fast streams, slow streams, magnetic clouds and sheath regions, all of which have distinct origins and interplanetary characteristics. Our results show that, overall, different metrics give similar results but Fisher-Shannon, which gives a more local measure of complexity, leads to a larger spread of values in the entropy-complexity plane. Magnetic cloud intervals stood out in all approaches, in particular when analysing the magnetic field magnitude. Differences between solar wind types (except for magnetic clouds) were typically more distinct for larger time lags, suggesting universality in fluctuations for small scales. The fluctuations within the solar wind time series were generally found to be stochastic, in agreement with previous studies. The use of information theory tools in the analysis of solar wind time series can help to identify structures and provide insight into their origin and formation.",
    "authors": [
      "Venla Koikkalainen",
      "Emilia Kilpua",
      "Simon Good",
      "Adnane Osmane"
    ],
    "published": "2025-10-07T12:40:54Z",
    "updated": "2025-10-07T12:40:54Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR",
    "doi": "10.5194/npg-32-309-2025"
  },
  {
    "arxiv_id": "2510.05855v1",
    "url": "https://arxiv.org/abs/2510.05855v1",
    "pdf_url": "https://arxiv.org/pdf/2510.05855v1.pdf",
    "title": "Studies of ultrafast dynamics in substrate-free nanoparticles at ELI   using Timepix3 optical camera",
    "abstract": "We present a novel application of the Timepix3 optical camera (Tpx3Cam) for investigating ultrafast dynamics in substrate-free nanoparticles at the Extreme Light Infrastructure European Research Infrastructure Consortium (ELI ERIC). The camera, integrated into an ion imaging system based on a micro-channel plate (MCP) and a fast P47 scintillator, enables individual time-stamping of incoming ions with nanosecond timing precision and high spatial resolution. The detector successfully captured laser-induced ion events originating from free nanoparticles disintegrated by intense laser pulses. Owing to the broad size distribution of the nanoparticles (10-500 nm) and the variation in laser intensities within the interaction volume, the detected events range in occupancy from near-zero to extremely high, approaching the readout limits of the detector. By combining time-of-flight and velocity map imaging (VMI) techniques, detailed post-processing and analysis were performed. The results presented here focus on the performance of Tpx3Cam under high-occupancy conditions, which are of particular relevance to this study. These conditions approach the limitations imposed by the camera readout capabilities and challenge the effectiveness of standard post-processing algorithms. We investigated these limitations and associated trade-offs, and we present improved methods and algorithms designed to extract the most informative features from the data.",
    "authors": [
      "Dmitrij Ševaev",
      "Andrei Nomerotski",
      "Peter Švihra",
      "Keshav Sishodia",
      "Andreas Hult Roos",
      "Martin Albrecht",
      "Jakob Andreasson",
      "Maria Krikunova",
      "Eva Klimešová"
    ],
    "published": "2025-10-07T12:24:18Z",
    "updated": "2025-10-07T12:24:18Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.05842v1",
    "url": "https://arxiv.org/abs/2510.05842v1",
    "pdf_url": "https://arxiv.org/pdf/2510.05842v1.pdf",
    "title": "Short-Pulse High-Power THz Generation Using Optical Klystron FELs:   Simulation Results",
    "abstract": "We investigate the feasibility of extending the optical klystron (OK) concept into the terahertz (THz) regime, where strong radiation slippage and diffraction fundamentally challenge efficient free- electron laser (FEL) operation. Numerical simulations were carried out for resonant wavelengths of 10, 30, and 100 {\\mu}m using parameters relevant to the planned DALI facility. The results show that while long wavelengths exhibit rapid energy growth, they suffer from significant temporal broadening due to slippage, whereas shorter wavelengths require large dispersive strengths R56 to achieve sufficient bunching. Harmonic bunching is demonstrated as a viable alternative to reduce the required R56 at short wavelengths. Diffraction was analyzed and found not to limit the present design, as the radiation spot size remains well within the beamline aperture. To address the slippage challenge, we propose and numerically demonstrate a novel chicane-embedded optical delay scheme, which restores phase alignment between the radiation and microbunched electrons. Simulations confirm that careful tuning of the dispersive strengths allows staged amplification, preserving beam quality and reaching multi-megawatt output power. These results highlight the potential of THz- tailored optical klystrons to generate compact, short, and high-intensity THz pulses, and lay the groundwork for future experimental studies and facility implementation.",
    "authors": [
      "Najmeh Mirian"
    ],
    "published": "2025-10-07T12:05:28Z",
    "updated": "2025-10-07T12:05:28Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.05832v1",
    "url": "https://arxiv.org/abs/2510.05832v1",
    "pdf_url": "https://arxiv.org/pdf/2510.05832v1.pdf",
    "title": "SPARTA: Python-Based Automated Spectral Parameter Analysis and   Assessment System for Resonance Tracking",
    "abstract": "Accurately determining resonance frequencies and quality factors (Q) is crucial in accelerator physics and radiofrequency engineering, as these factors have direct impacts on system design, operational stability, and research results. The methods currently employed to facilitate resonance analysis are mostly manual, requiring operators and physicists to estimate resonant parameters and examine scattering parameter (S-parameter) data from vector network analyzers (VNAs). The current techniques therefore become laborious, operator-dependent and challenging to replicate when applied to large datasets or across multiple analyses. Despite the importance of these tasks for high-volume research organizations such as CERN where S-parameter measurements are regularly taken for cavity and beam diagnostic research, the currently widespread measures are outdated.   In order to automate the laborious resonance characterization process, this paper presents SPARTA (Spectral Parameter Analysis for Resonance Tracking and Assessment), a data analysis software framework based on Python. SPARTA has integrated data ingestion, preprocessing, resonance detection, quality factor estimation, visualization and persistent cloud storage into a reproducible and scalable workflow. SPARTA was developed with the scientific libraries NumPy, SciPy and scikit-rf for accurate and efficient numerical processing, Flask and Dash for interactive and lightweight visualization, and SQLite for easy database management. The three main contributions of this work are outlined as follows: Firstly, this paper presents a methodological framework for resonance detection and assessment based on established RF theory. The second section describes the system architecture and implementation of SPARTA, highlighting data handling, computation and visualization. Finally this paper discusses the results and advantages of automated analysis.",
    "authors": [
      "Kerem Semiz"
    ],
    "published": "2025-10-07T11:56:13Z",
    "updated": "2025-10-07T11:56:13Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.01875v2",
    "url": "https://arxiv.org/abs/2510.01875v2",
    "pdf_url": "https://arxiv.org/pdf/2510.01875v2.pdf",
    "title": "Enhancing the Efficiency of Time-Dependent Density Functional Theory   Calculations of Dynamic Response Properties",
    "abstract": "X-ray Thomson scattering (XRTS) constitutes an essential technique for diagnosing material properties under extreme conditions, such as high pressures and intense laser heating. Time-dependent density functional theory (TDDFT) is one of the most accurate available ab initio methods for modeling XRTS spectra, as well as a host of other dynamic material properties. However, strong thermal excitations, along with the need to account for variations in temperature and density as well as the finite size of the detector significantly increase the computational cost of TDDFT simulations compared to ambient conditions. In this work, we present a broadly applicable method for optimizing and enhancing the efficiency of TDDFT calculations. Our approach is based on a one-to-one mapping between the dynamic structure factor and the imaginary time density--density correlation function, which naturally emerges in Feynman's path integral formulation of quantum many-body theory. Specifically, we combine rigorous convergence tests in the imaginary time domain with a constraints-based noise attenuation technique to improve the efficiency of TDDFT modeling without the introduction of any significant bias. As a result, we can report a speed-up by up to an order of magnitude, thus potentially saving millions of CPU hours for modeling a single XRTS measurement of matter under extreme conditions.",
    "authors": [
      "Zhandos A. Moldabekov",
      "Sebastian Schwalbe",
      "Uwe Hernandez Acosta",
      "Thomas Gawne",
      "Jan Vorberger",
      "Michele Pavanello",
      "Tobias Dornheim"
    ],
    "published": "2025-10-02T10:31:46Z",
    "updated": "2025-10-07T09:31:17Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.chem-ph",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2407.01787v2",
    "url": "https://arxiv.org/abs/2407.01787v2",
    "pdf_url": "https://arxiv.org/pdf/2407.01787v2.pdf",
    "title": "Electron Capture and Bound-State $β$ Decays in Ions and Plasma",
    "abstract": "We present a new theory describing the variation of electron capture and bound-state $\\beta$-decays in atomic ions and (non) local thermodynamic equilibrium ((N)LTE) plasmas. We adopt the Takahashi-Yokoi nuclear model with added corrections to first calculate the decay rate for each atomic configuration of the isotope, and then evaluate the in-plasma decay rate by combining them with the charge state distribution (CSD) consistent with plasma density and temperature. Our approach expands the thermodynamic parameter space in which in-plasma $\\beta$-decays can be studied, opening the possibility to validate the model in low-density laboratory magnetoplasmas before application to stellar nucleosynthesis. The model is explained using $^{7}$Be, and then applied to higher mass isotopes such as $^{140}$Pr$^{0+,57+,58+}$, $^{142}$Pm$^{0+,59+,60+}$ and $^{163}$Dy$^{66+}$. Our model is therefore amenable to isotopes in a wide range of masses, in both single charge state or in a plasma-generated CSD.",
    "authors": [
      "Bharat Mishra",
      "Angelo Pidatella",
      "Simone Taioli",
      "Stefano Simonucci",
      "David Mascali"
    ],
    "published": "2024-07-01T20:28:04Z",
    "updated": "2025-10-07T08:48:37Z",
    "categories": [
      "physics.plasm-ph",
      "nucl-th",
      "physics.atom-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.05656v1",
    "url": "https://arxiv.org/abs/2510.05656v1",
    "pdf_url": "https://arxiv.org/pdf/2510.05656v1.pdf",
    "title": "Deposition rate and energy to substrate in chopped and standard HiPIMS:   identifying optimal pulse parameters",
    "abstract": "High-Power Impulse Magnetron Sputtering (HiPIMS) offers higher ionized flux fractions at the cost of lower deposition rates compared to conventional DCMS. A fine optimization of the deposition conditions is crucial for specific applications. Chopped or multi-pulse HiPIMS (segmenting pulses into shorter micropulses) has been proposed to mitigate ion back-attraction and promote working gas recovery. This study investigates how micropulse length, delay time between segments, and magnetic field strength influence energy flux, deposition rate, and ionized flux fraction in chopped and standard HiPIMS. These quantities are evaluated by passive thermal probe, biasable QCM and mass spectrometer measurements at the substrate position. Deposition-averaged and pulse-averaged power is kept constant for all conditions to facilitate meaningful comparison. Results indicate that chopping the HiPIMS pulse consistently leads to higher energy flux and total deposition rate compared to standard HiPIMS at the same total pulse length, primarily due to increased ion flux. A weaker unbalanced magnetic field configuration enhances deposition rates and ion transport. In chopped HiPIMS, increasing micropulse length decreased energy flux and deposition rates, whereas increasing the delay time between micropulses substantially improved these parameters. Importantly, standard HiPIMS, which operated at higher frequencies and short pulse lengths, demonstrated superior performance (with higher total energy and particle fluxes) than chopped HiPIMS when compared at similar short pulse durations. This suggests that consistent short pulse durations and sufficient off-times for complete gas refill are paramount for maximizing ion fluxes and deposition rates.",
    "authors": [
      "Mina Farahani",
      "Jiří Čapek",
      "Tomáš Kozák"
    ],
    "published": "2025-10-07T08:06:15Z",
    "updated": "2025-10-07T08:06:15Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.13417v2",
    "url": "https://arxiv.org/abs/2508.13417v2",
    "pdf_url": "https://arxiv.org/pdf/2508.13417v2.pdf",
    "title": "Full Spectrum Modeling of In Situ Gamma-ray Detector Measurements with a   Focus on Precipitation-Induced Transients",
    "abstract": "Gamma-ray detectors that are deployed outdoors experience increased event rates during precipitation due to the attendant increase in Rn-222 progeny at ground level. The increased radiation due to these decay products (Pb-214 and Bi-214) has been studied for many decades in applications such as atmospheric science and radiation protection. For those applications radon progeny signatures are the signal of interest, while in the fields of radiological and nuclear security and aerial radiological mapping they are a nuisance. When searching for radiological contamination or missing sources, an analyst must take precipitation into account to reduce false alarms, in addition to accounting for static background signatures. To train advanced search algorithms, an effort has been underway to generate synthetic gamma-ray event data that represent a realistic urban area, including occasional rain events to add to the realism. This manuscript describes an effort to analyze and model gamma-ray spectra measured during rainfall by a NaI(Tl) detector located outdoors in order to derive accurate source terms for Pb-214 and Bi-214 at a high frequency (less than 1 minute). All known sources of background were quantitatively modeled across the full gamma-ray spectrum, so that the Pb-214 and Bi-214 activity concentrations on the ground could be inferred from a linear model fit to each spectrum. A physically motivated model was applied to the data to further smooth the fits, which had the benefit of yielding information about the concentrations of the progeny in rainwater and their apparent age, making this the first time full-spectrum modeling has been used for continuous measurements of radon progeny. This approach could lead to studies of radon progeny on shorter timescales than previously possible.",
    "authors": [
      "Mark S. Bandstra",
      "James M. Ghawaly",
      "Douglas E. Peplow",
      "Daniel E. Archer",
      "Brian J. Quiter",
      "Tenzing H. Y. Joshi",
      "Andrew D. Nicholson",
      "Michael J. Willis",
      "Irakli Garishvili",
      "Andrew J. Rowe",
      "Brandon R. Longmire",
      "Jason T. Nattress"
    ],
    "published": "2025-08-19T00:31:16Z",
    "updated": "2025-10-07T07:43:26Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.05600v1",
    "url": "https://arxiv.org/abs/2510.05600v1",
    "pdf_url": "https://arxiv.org/pdf/2510.05600v1.pdf",
    "title": "A fluorescence microscopy platform for time-resolved studies of   spin-correlated radical pairs in biological systems",
    "abstract": "The importance of spin-correlated radical pairs in biology is increasingly recognized, with roles in biological effects of weak magnetic fields and emerging quantum spin-based biomedical applications. Fluorescence microscopy offers sufficient sensitivity to study magnetic field effects on radical pair reactions in living cells, but conventional techniques cannot directly resolve their dynamics because most biologically relevant radical pairs are non-emissive. To overcome this challenge, we introduce two novel microscopy techniques: single color pump-probe (PP) and pump-field-probe (PFP) fluorescence. Here, we describe their working principles, provide their mathematical formulation, and validate both techniques through theoretical analysis and experiments on well-established flavin-based magnetic field sensitive reactions. These approaches offer a sensitive and broadly applicable platform for quantifying and visualizing the quantum spin dynamics of radical pair chemical reactions in biological systems.",
    "authors": [
      "Noboru Ikeya",
      "Jonathan R. Woodward"
    ],
    "published": "2025-10-07T05:51:58Z",
    "updated": "2025-10-07T05:51:58Z",
    "categories": [
      "physics.bio-ph",
      "physics.chem-ph",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "physics.bio-ph"
  },
  {
    "arxiv_id": "2507.02167v2",
    "url": "https://arxiv.org/abs/2507.02167v2",
    "pdf_url": "https://arxiv.org/pdf/2507.02167v2.pdf",
    "title": "Probing Earth's core using atmospheric neutrino oscillations in the   presence of NSI at INO-ICAL",
    "abstract": "Neutrinos can serve as a complementary and independent tool to gravitational and seismic studies in exploring the interior of Earth, thanks to their unique properties: extremely low interaction cross sections and flavor oscillations. With the precise measurements of neutrino oscillation parameters and observation of the non-zero value of mixing angle $\\theta_{13}$, it has become feasible to detect the forward scattering of GeV-energy atmospheric neutrinos passing through Earth with ambient electrons in the form of matter effects on neutrino oscillation probabilities. These matter effects depend on both the neutrino energy and electron density distribution along their path, making them ideally suited for exploring the inner structure of Earth. Furthermore, in the presence of non-standard interactions (NSI) of neutrinos with matter, oscillation patterns undergo additional modifications. In this study, we quantify the capability of an atmospheric neutrino experiment, such as a magnetized iron calorimeter detector, to validate the Earth's core and measure the position of the core-mantle boundary in the presence of NSI. We perform this study considering a three-layered density profile of Earth. Our analysis demonstrates that neutrino non-standard interactions impact these Earth tomography measurements in comparison to standard interactions.",
    "authors": [
      "Krishnamoorthi J",
      "Anuj Kumar Upadhyay",
      "Anil Kumar",
      "Sanjib Kumar Agarwalla"
    ],
    "published": "2025-07-02T21:48:12Z",
    "updated": "2025-10-07T05:24:37Z",
    "categories": [
      "hep-ph",
      "hep-ex",
      "physics.geo-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2510.03653v2",
    "url": "https://arxiv.org/abs/2510.03653v2",
    "pdf_url": "https://arxiv.org/pdf/2510.03653v2.pdf",
    "title": "CCAT: Magnetic Sensitivity Measurements of Kinetic Inductance Detectors",
    "abstract": "The CCAT Observatory is a ground-based submillimeter to millimeter experiment located on Cerro Chajnantor in the Atacama Desert, at an altitude of 5,600 meters. CCAT features the 6-meter Fred Young Submillimeter Telescope (FYST), which will cover frequency bands from 210 GHz to 850 GHz using its first-generation science instrument, Prime-Cam. The detectors used in Prime-Cam are feedhorn-coupled, lumped-element superconducting microwave kinetic inductance detectors (KIDs). The telescope will perform wide-area surveys at speeds on the order of degrees per second. During telescope operation, the KIDs are exposed to changes in the magnetic field caused by the telescope's movement through Earth's magnetic field and internal sources within the telescope. We present and compare measurements of the magnetic sensitivity of three different CCAT KID designs at 100 mK. The measurements are conducted in a dilution refrigerator (DR) with a set of room temperature Helmholtz coils positioned around the DR. We discuss the implications of these results for CCAT field operations.",
    "authors": [
      "Benjamin J. Vaughan",
      "Yuhan Wang",
      "Cody J. Duell",
      "Jason Austermann",
      "James R. Burgoyne",
      "Scott Chapman",
      "Steve K. Choi",
      "Abigail T. Crites",
      "Eliza Gazda",
      "Ben Keller",
      "Michael D. Niemack",
      "Darshan A. Patel",
      "Anna Vaskuri",
      "Eve M. Vavagiakis",
      "Michael Vissers",
      "Samantha Walker",
      "Jordan Wheeler",
      "Ruixuan",
      "Xie"
    ],
    "published": "2025-10-04T03:51:00Z",
    "updated": "2025-10-07T03:17:24Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2510.05507v1",
    "url": "https://arxiv.org/abs/2510.05507v1",
    "pdf_url": "https://arxiv.org/pdf/2510.05507v1.pdf",
    "title": "Prediction of Spallation Induced Transmutation Rates For Long Lived   Fission Products via Proton Accelerator",
    "abstract": "Long lived fission products represent a major challenge in nuclear waste management due to persistent radiotoxicity over very long timescales. This study focuses on six of these fission products: Se-79, Zr-93, Tc-99, Sn-126, I-127, Cs-135. This study investigates the feasibility of spallation driven transmutation, in which a high energy proton beam strikes a heavy spallation target to generate neutrons that induce transmutation in the fission products surrounding the target. Lead and depleted uranium are identified as the principal spallation target candidates, reflecting contrasting trade offs in neutron yield, secondary reactions, and heat generation. Simulations assess nuclide specific behavior under reactor scale inventories and practical geometric constraints. Results demonstrate that technetium, iodine, and selenium are strong candidates for transmutation using this pathway, while tin shows partial resistance but benefits from thermal flux. By contrast, zirconium is neutron transparent and inefficient to transmute, and cesium suffers from low net reduction due to competition with lighter isotopes. Cost effectiveness is highly isotope dependent: technetium is most favorable, whereas cesium and zirconium remain expensive. These findings highlight the advantages and limitations of spallation driven systems and motivate strategies with optimized target-blanket designs.",
    "authors": [
      "Grigor Tukharyan",
      "William Reed Kendrick",
      "Areg Danagoulian",
      "Benoit Forget"
    ],
    "published": "2025-10-07T01:51:34Z",
    "updated": "2025-10-07T01:51:34Z",
    "categories": [
      "physics.acc-ph",
      "nucl-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.05461v1",
    "url": "https://arxiv.org/abs/2510.05461v1",
    "pdf_url": "https://arxiv.org/pdf/2510.05461v1.pdf",
    "title": "Analytic timing calculations and timing limits with prompt photons,   high-aspect-ratio crystals, and complex TOF-kernels in TOF-PET",
    "abstract": "Modeling the timing performance of light-based radiation detectors accurately is essential for optimizing time-of-flight positron emission tomography (TOF-PET). We present an analytic framework that combines existing models to predict the timing behavior of high-aspect ratio crystals, including contributions from prompt photons such as Cherenkov radiation. This framework is built on a closed-form solution for optical light transport, convolved with the photodetector response and photon production characteristics. Using conditional and joint probability distributions, we compute the first-photon arrival time distribution for hybrid detectors with scintillation and Cherenkov light. The detection time distribution is then self-convolved to derive the time delay spectra and three timing metrics are used to characterize complex TOF kernels. Additionally, we perform Cram\\'er-Rao Lower Bound calculations with and without depth-of-interaction bias to evaluate the theoretical timing limits. Our analytic predictions align well with Monte Carlo simulations for BGO detectors under varying crystal thicknesses and single photon time resolution considering a digital photodetector. We show that the TOF shape is significantly affected by prompt photon statistics, crystal thickness, scintillation yield, and photodetector properties resulting in distinct metric-dependent timing performance. The proposed model enables rapid timing predictions for polished crystals, with the calculation time of a detector configuration in under a second, allowing for comprehensive parametric studies. This makes it a powerful tool for guiding detector development in fast-timing applications.",
    "authors": [
      "Nicolaus Kratochwil",
      "Emilie Roncali",
      "Gerard Arino-Estrada"
    ],
    "published": "2025-10-06T23:47:30Z",
    "updated": "2025-10-06T23:47:30Z",
    "categories": [
      "physics.ins-det",
      "physics.med-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.05287v1",
    "url": "https://arxiv.org/abs/2510.05287v1",
    "pdf_url": "https://arxiv.org/pdf/2510.05287v1.pdf",
    "title": "Difference in Neoclassical Edge Flows Between Strongly Negative and   Positive Triangularities in the XGC Gyrokinetic Simulation",
    "abstract": "The neoclassical baseline study of a strongly negative triangularity (NT) plasma and the corresponding positive triangularity plasma is performed using the edge-specialized, total-f gyrokinetic code XGC. A DIII-D-like plasma is used, based on the negative triangularity discharge of DIII-D \\#193793. An artificial positive triangularity (PT) equilibrium has been constructed to compare the edge rotation physics at the same triangularity strength, but with opposite sign, while keeping the same elongation and other geometric parameters. Carbon(+6) ions are added to the deuterium plasma at an experimentally relevant level. By using the experimental profile of carbon toroidal rotation profile as an input, XGC finds that the deuteron rotation is significantly different from the carbon rotation at the inboard and outboard midplanes, mostly caused by the difference in the Pfirsch-Schluter rotation. More importantly, significant difference in the X-point orbit loss physics, thus the rotation source, is found between the positive and negative triangularity equilibrium models. However, it is also found that the agreement between the present neoclassical simulation and the experimental NT data is validated only within the middle of pedestal slope, indicating the importance of edge turbulence. This study could establish baseline for the multiphysics, multiscale studies that include turbulence of negative triangularity plasmas.",
    "authors": [
      "S. Ku",
      "C. S. Chang",
      "R. Hager",
      "L. W. Schmitz",
      "A. O. Nelson"
    ],
    "published": "2025-10-06T18:55:01Z",
    "updated": "2025-10-06T18:55:01Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.05274v1",
    "url": "https://arxiv.org/abs/2510.05274v1",
    "pdf_url": "https://arxiv.org/pdf/2510.05274v1.pdf",
    "title": "A note on thermal effects in non-linear models for plasma-based   acceleration",
    "abstract": "We investigate the impact of a non-negligible background temperature on relativistic plasma wakefields generated when a beam of charged particles passes through a neutral plasma at rest. Our analysis focuses on the blowout regime, where the plasma response is highly non-linear: plasma electrons are radially blown out and expelled away from the propagation axis of the beam particles, creating a region (bubble) of ions without electrons. Our study builds upon earlier investigations for non-linear models of plasma wakefields developed neglecting plasma temperature. In the presence of a non-zero background temperature, we characterize the bubble in terms of its transversal and longitudinal sizes as a function of the temperature. Model predictions and parametrizations are studied in combination with PIC simulations, and correctly reproduce the temperature induced contraction of both the longitudinal and transverse bubble sizes.",
    "authors": [
      "D. Simeoni",
      "G. Parise",
      "A. R. Rossi",
      "A. Frazzitta",
      "F. Guglietta",
      "M. Sbragaglia"
    ],
    "published": "2025-10-06T18:42:15Z",
    "updated": "2025-10-06T18:42:15Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.05259v1",
    "url": "https://arxiv.org/abs/2510.05259v1",
    "pdf_url": "https://arxiv.org/pdf/2510.05259v1.pdf",
    "title": "Direct measurement of photons from the electron-hadron bremsstrahlung at   the EIC",
    "abstract": "Direct detection of bremsstrahlung photons, in principle, offers the most straightforward and most robust method of luminosity determination at the EIC, but requires an extraordinary performance of the photon detector. In this paper, we first discuss the extreme working conditions for such detectors at the EIC and the resulting technology choices. Then, we report the initial results of Monte Carlo simulations, using Geant4, of the proposed sampling calorimeter, which is made of a copper absorber with embedded quartz fibres read out by silicon photomultipliers. Finally, the tentative requirements for appropriate readout electronics are formulated.",
    "authors": [
      "L. Adamczyk",
      "Y. Ali",
      "J. J. Chwastowski",
      "A. B. Kowalewska",
      "B. Pawlik",
      "K. Piotrzkowski",
      "M. Przybycien"
    ],
    "published": "2025-10-06T18:21:14Z",
    "updated": "2025-10-06T18:21:14Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.05100v1",
    "url": "https://arxiv.org/abs/2510.05100v1",
    "pdf_url": "https://arxiv.org/pdf/2510.05100v1.pdf",
    "title": "Rapid event extraction and tensorial event adaption: Libraries for   efficient access and generic reweighting of parton-level events and their   implementation in the MadtRex module",
    "abstract": "We present Rex and teaRex, C++17 libraries for efficient management of parton-level hard scattering event information and completely generic reweighting of such events, respectively. Rex is primarily an interfacing and I/O library for Les Houches Event format files and provides an internal event format designed with data parallelism in mind, and teaRex extends this format to provide full parton-level reweighting functionality with minimal code needing to be written by the end user. These libraries serve as the foundation for the MadtRex reweighting module for MadGraph5_aMC@NLO, extending the functionality of the CUDACPP plugin to allow for data-parallel model-generic leading order parameter reweighting on SIMD-enabled CPUs and SIMT GPUs, speeding up reweighting by more than two orders of magnitude compared to MadGraph5_aMC@NLO running on the exact same hardware while providing trivial scalability to larger and distributed systems.",
    "authors": [
      "Stefan Roiser",
      "Robert Schöfbeck",
      "Zenny Wettersten"
    ],
    "published": "2025-10-06T17:59:19Z",
    "updated": "2025-10-06T17:59:19Z",
    "categories": [
      "hep-ph",
      "hep-ex",
      "physics.acc-ph"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2510.05084v1",
    "url": "https://arxiv.org/abs/2510.05084v1",
    "pdf_url": "https://arxiv.org/pdf/2510.05084v1.pdf",
    "title": "Electrospray Thruster Plume Impingement on CubeSat Solar Arrays: A   Particle-Tracking Study",
    "abstract": "Electrospray thrusters are emerging as a leading propulsion technology for CubeSats, offering high specific impulse ($I_{sp} > 1000$ s) and low power requirements. However, the divergent ion plumes can impinge on spacecraft surfaces, particularly body-mounted solar arrays, causing contamination and thrust efficiency losses. This study presents a validated particle-tracking simulation to quantify the effects of thruster placement on thrust efficiency and surface contamination for 1U, 3U, and 6U CubeSats. The plume model employs a cosine power distribution ($k=1.8$) with half-angle $46^\\circ$, validated against experimental data with errors below 7%. Results show that thrust efficiency ranges from 53.6% for rear-mounted thrusters on 3U body-mounted configurations to 100% for side-mounted configurations with deployable arrays. CubeSat size significantly affects impingement: 3U platforms experience 46.4% contamination with rear-mounted thrusters compared to 16.6% for 1U. Deployable solar arrays reduce contamination by 77% compared to body-mounted arrays, while side-mounted thrusters eliminate impingement entirely at the cost of only 1.6% efficiency loss. Corner-mounted configurations at $30^\\circ$ cant provide intermediate performance with 88.9% efficiency and 11.1% contamination. These quantitative design guidelines enable mission planners to optimize thruster integration based on power budget and propellant mass constraints, with statistical uncertainty below 0.15% across all configurations.",
    "authors": [
      "Ethan Kahn"
    ],
    "published": "2025-10-06T17:51:46Z",
    "updated": "2025-10-06T17:51:46Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.05058v1",
    "url": "https://arxiv.org/abs/2510.05058v1",
    "pdf_url": "https://arxiv.org/pdf/2510.05058v1.pdf",
    "title": "Pushing the Frontiers of Light: Magnetized Plasma Lenses and Chirp   Tailoring for Extreme Intensities",
    "abstract": "In this work, an innovative scheme is proposed that exploits the response of magnetized plasmas to realize a refractive index exceeding unity for right circularly polarized (RCP) waves. Using two- and three-dimensional Particle-in-Cell (PIC) simulations with the OSIRIS 4.0 framework, it is shown that a shaped magnetized plasma lens (MPL) can act as a glass/solid-state-based convex lens, amplifying laser intensity via transverse focusing. Moreover, by integrating three key ingredients, a tailored plasma lens geometry, a spatially structured strong magnetic field, and a suitably chirped laser pulse, simultaneous focusing and compression of the pulse has been achieved. The simulations reveal up to a 100-fold increase in laser intensity, enabled by the combined action of the MPL and the chirped pulse profile. With recent advances in high-field magnet technology, shaped plasma targets, and controlled chirped laser systems, this approach offers a promising pathway toward experimentally reaching extreme intensities.",
    "authors": [
      "Trishul Dhalia",
      "Rohit Juneja",
      "Amita Das"
    ],
    "published": "2025-10-06T17:37:32Z",
    "updated": "2025-10-06T17:37:32Z",
    "categories": [
      "physics.plasm-ph",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.04847v1",
    "url": "https://arxiv.org/abs/2510.04847v1",
    "pdf_url": "https://arxiv.org/pdf/2510.04847v1.pdf",
    "title": "Characterisation of Thick Gaseous Electron Multipliers as charge readout   operated in pure argon",
    "abstract": "The gain measurements of several 1 mm-thick, 10$\\times$10 cm$^2$ Thick Gaseous Electron Multipliers (ThGEMs), operated in pure argon at 3.3 bar and room temperature are presented. Electrostatic simulations, performed with the COMSOL MultiPhysics software, were employed to guide the design of the detectors, and the field configurations are discussed. A modified ThGEM design, incorporating two embedded internal electrodes in addition to the conventional top and bottom electrodes, was developed to mitigate discharge-induced instabilities and to enable operation at higher gains. Several such structures were produced and compared to the standard 1 mm-thick two-electrode ThGEM. Gain measurements were conducted for every design described here over a wide range of applied electric fields and up to large values. The experimental setup and measurement methodology are described, alongside a comparative analysis of the performance of the different detector geometries.",
    "authors": [
      "G. Eurin",
      "A. Delbart",
      "R. De Oliveira",
      "A. Drozd",
      "P. Granger",
      "M. Karolak",
      "B. Mehl"
    ],
    "published": "2025-10-06T14:33:16Z",
    "updated": "2025-10-06T14:33:16Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.04301v2",
    "url": "https://arxiv.org/abs/2507.04301v2",
    "pdf_url": "https://arxiv.org/pdf/2507.04301v2.pdf",
    "title": "Laser Amplification in $e^{-}$-$μ^{-}$-ion Plasmas",
    "abstract": "We investigate laser amplification in $e^{-}$-$\\mu^{-}$-ion plasmas, where negative muons partially replace electrons. Theoretical results reveal a hybrid plasma wave, called $\\mu$-wave that exhibits ion-acoustic behavior in long-wavelength regime and Langmuir-like behavior in short-wavelength regime. Besides, the Landau damping of $\\mu$-wave is smaller than that of Langmuir wave. Particle-in-cell (PIC) simulations confirm the theoretical results of instabilities in$e^{-}$-$\\mu^{-}$-ion plasmas. The $\\mu$-wave enables efficient laser amplification by suppressing pump-driven spontaneous instabilities through enhanced Landau damping of Langmuir waves. Compared to Raman amplification, $\\mu$-wave amplification can maintain the Gaussian waveform of the seed laser, avoiding pulse splitting. Compared to strongcoupling Brillouin amplification, $\\mu$-wave amplification exhibits weaker filamentation instability. Our theoretical model can be generalized to other plasma systems containing two species of negatively charged particles, such as two-temperature electron plasmas and negative-ion plasma. These findings establish $e^{-}$-$\\mu^{-}$-ion plasma as a promising medium for advanced laser amplification schemes.",
    "authors": [
      "Y. Chen",
      "R. Ou",
      "H. Wang",
      "S. J. Chen",
      "Y. X. Zhong",
      "Y. G. Chen",
      "S. Tan",
      "Y. X. Li",
      "C. Y. Zheng",
      "Z. J. Liu",
      "L. H. Cao",
      "M. M. Zhang",
      "D. P. Feng",
      "W. J. Zuo",
      "C. Z. Xiao"
    ],
    "published": "2025-07-06T08:57:25Z",
    "updated": "2025-10-06T14:22:29Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.04820v1",
    "url": "https://arxiv.org/abs/2510.04820v1",
    "pdf_url": "https://arxiv.org/pdf/2510.04820v1.pdf",
    "title": "Lead tungstate calorimeter of the Jefferson Lab Eta Factory experiment",
    "abstract": "A new electromagnetic calorimeter (ECAL) consisting of 1596 lead tungstate PbWO$_{\\rm 4}$ scintillating crystals has been fabricated and installed in the experimental Hall D at Jefferson Lab (JLab). The high-granularity, high-resolution calorimeter is required by the JLab Eta Factory experiment, whose main physics goal is to study rare decays of eta mesons. The ECAL replaced the inner part of the forward lead glass calorimeter of the GlueX detector. Signals from the detector will be digitized using twelve-bit flash analog-to-digital converters operated at a sampling rate of 250 MHz. The ECAL is integrated into the trigger system of the GlueX detector using electronics modules designed at JLab. The ECAL is currently at the commissioning stage and should be ready for the physics run in January 2025. We will give an overview of the JEF experiment, the design and construction of the ECAL, and the integration of the detector and its infrastructure into the Hall D experimental setup.",
    "authors": [
      "Alexander Somov"
    ],
    "published": "2025-10-06T14:04:19Z",
    "updated": "2025-10-06T14:04:19Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1051/epjconf/202532000058"
  },
  {
    "arxiv_id": "2510.04768v1",
    "url": "https://arxiv.org/abs/2510.04768v1",
    "pdf_url": "https://arxiv.org/pdf/2510.04768v1.pdf",
    "title": "Experimental Reconstruction of Source 4D Phase Space Without Prior   Knowledge of Transfer Matrix",
    "abstract": "We experimentally demonstrate a method for reconstructing the transverse 4D phase space of an electron beam at the time of emission from downstream diagnostics of the 4D phase space. This method does not rely on detailed knowledge of the beamline transport, besides assuming that linearity and symplecticity are satisfied. We apply this method to measure the transverse position and momentum phase space of electrons emitted from a spatially-structured alkali-antimonide cathode. This method can uncover local correlations between emission location and momentum spread. We formulate this method analytically and investigate resolution limits.",
    "authors": [
      "Charles Zhang",
      "Elena Echeverria",
      "Abigail Flint",
      "William H Li",
      "Christopher M. Pierce",
      "Alice Galdi",
      "Chad Penningto",
      "Adam Bartnik",
      "Ivan Bazarov",
      "Jared Maxson"
    ],
    "published": "2025-10-06T12:42:12Z",
    "updated": "2025-10-06T12:42:12Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.04743v1",
    "url": "https://arxiv.org/abs/2510.04743v1",
    "pdf_url": "https://arxiv.org/pdf/2510.04743v1.pdf",
    "title": "Low-energy single-electron detector with sub-micron resolution",
    "abstract": "Single-electron detectors are a key component of electron microscopes and advanced electron optics experiments. We present a YAG:Ce scintillator-based single-electron detector with a spatial resolution of 1 micrometer at an electron energy of 17 keV. Single-electron detection events are identified with an efficiency and purity larger than 0.8 at an electron energy of 17 keV, reaching 0.96 at 30 keV. We show that the detector enables electron diffraction studies with a sample-detector distance comparable to the mean free path of electrons at atmospheric pressure, potentially enabling atmospheric electron diffraction studies.",
    "authors": [
      "Luis Alfredo Ixquiac Méndez",
      "Martino Zanetti",
      "Tilman Kraeft",
      "Thomas Juffmann"
    ],
    "published": "2025-10-06T12:16:43Z",
    "updated": "2025-10-06T12:16:43Z",
    "categories": [
      "physics.ins-det",
      "physics.app-ph",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.04729v1",
    "url": "https://arxiv.org/abs/2510.04729v1",
    "pdf_url": "https://arxiv.org/pdf/2510.04729v1.pdf",
    "title": "An Approach for Restoring Magnetic Field Uniformity in Openable   BIPM-Type Kibble Balance Magnets",
    "abstract": "The Kibble balance realizes the kilogram by linking mechanical and electrical quantities via a magnet system. In an improved BIPM-type magnet design by Tsinghua University, an open/close surface was incorporated, facilitating operation. However, an unavoidable mechanical air gap at the splitting plane introduces asymmetry in the magnetic flux density profile, degrading field uniformity. This study proposes a two-step yoke compensation method to restore symmetry by adjusting the upper outer yoke's inner radius and the splitting gap height. Finite element simulations show linear relationships between asymmetry and these parameters, enabling predictive compensation. Experimental results confirm that sequential tuning successfully eliminates asymmetry and recovers the designed uniform field range. The method provides an effective solution for enhancing magnetic field quality in openable Kibble balance magnets.",
    "authors": [
      "Nanjia Li",
      "Weibo Liu",
      "Yongchao Ma",
      "Wei Zhao",
      "Songling Huang",
      "Shisong Li"
    ],
    "published": "2025-10-06T11:50:21Z",
    "updated": "2025-10-06T11:50:21Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2504.15307v3",
    "url": "https://arxiv.org/abs/2504.15307v3",
    "pdf_url": "https://arxiv.org/pdf/2504.15307v3.pdf",
    "title": "Modeling frequency instability in high-quality resonant experiments",
    "abstract": "Modern resonant sensing tools can achieve increasingly high quality factors, which correspond to extremely narrow linewidths. In such systems, time-variation of the resonator's natural frequency can potentially impact its ability to accumulate power and its resulting sensitivity. One such example is the Dark SRF experiment, which utilizes superconducting radio frequency (SRF) cavities with quality factors of $Q\\sim10^{10}$. Microscopic deformations of the cavity lead to stochastic jittering of its resonant frequency with amplitude 20 times its linewidth. Naively, one may expect this to lead to a large suppression in accumulated power. In this work, we study in detail the effects of frequency instability on high-quality resonant systems, utilizing the Dark SRF experiment as a case study. We show that the timescale of jittering is crucial to determining its effect on power accumulation. Namely, when the resonant frequency varies sufficiently quickly, the system accumulates power as if there were no jittering at all. This implies that the sensitivity of a jittering resonator is comparable to that of a stable resonator. In the case of Dark SRF, we find that jittering only induces a $\\sim 10\\%$ loss in power. Our results allow the dark-photon exclusion bound from Dark SRF's pathfinder run to be refined, leading to a constraint that is an order of magnitude stronger than previously reported (corresponding to a signal-to-noise ratio which is four orders of magnitude larger). This result represents the world-leading constraint on dark photons over a wide range of masses below $6\\,\\rm \\mu eV$ and translates to the best laboratory-based limits on the photon mass $m_\\gamma<2.9\\times 10^{-48}\\,\\rm g$.",
    "authors": [
      "Hao-Ran Cui",
      "Saarik Kalia",
      "Zhen Liu"
    ],
    "published": "2025-04-18T19:22:27Z",
    "updated": "2025-10-06T10:47:37Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "hep-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.04658v1",
    "url": "https://arxiv.org/abs/2510.04658v1",
    "pdf_url": "https://arxiv.org/pdf/2510.04658v1.pdf",
    "title": "Numerical Demonstration of Kolmogorov Scaling in Magnetohydrodynamic   Turbulence",
    "abstract": "The two leading models of isotropic magnetohydrodynamic (MHD) turbulence have competing predictions: $k^{-5/3}$ (Kolmogorov) and $k^{-3/2}$ (Iroshnikov-Kraichnan) scalings. This paper identifies the valid MHD turbulence model using high-resolution numerical and diagnostics-structure functions, intermittency exponents, and energy spectra and fluxes of imbalance MHD. The energy spectra of our forced MHD simulations on $8192^2$, $4096^2$, $1024^3$, and $512^3$ support Kolmogorov's k^{-5/3} spectrum over Iroshnikov-Kraichnan's k^{-3/2} spectrum, but the difference in the spectral exponents is small. However, the numerically computed third-order structure functions and intermittency exponents support Kolmogorov scaling in both two and three dimensions. Also, the energy fluxes of the imbalance MHD follow the predictions of Kolmogorov scaling. These results would help in better modelling of solar wind, solar corona, and dynamos.",
    "authors": [
      "Manthan Verma",
      "Abhishek K. Jha",
      "Shashwat Nirgudkar",
      "Mahendra K. Verma"
    ],
    "published": "2025-10-06T10:02:52Z",
    "updated": "2025-10-06T10:02:52Z",
    "categories": [
      "physics.plasm-ph",
      "physics.flu-dyn"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2411.02212v2",
    "url": "https://arxiv.org/abs/2411.02212v2",
    "pdf_url": "https://arxiv.org/pdf/2411.02212v2.pdf",
    "title": "Radiopurity screening of materials for rare event searches by neutron   activation at the TRIGA reactor of Pavia",
    "abstract": "In the framework of physics experiments searching for rare events, the selection of extremely radiopure materials is a challenging task, as the signal of interest is often hidden by instrumental background. Neutron activation is a powerful technique to measure trace contaminants with high sensitivity but, to be properly applied, it requires a good characterization of neutron irradiation and $\\gamma$-spectroscopy facilities. This paper presents the state-of-the-art workflow adopted by the Radioactivity Laboratory of the University of Milano-Bicocca for radiopurity screening of materials by neutron activation performed at the TRIGA reactor in Pavia. The ultimate sensitivity of the described workflow, in the absence of interfering activation products and without the application of radiochemical and/or active background rejection techniques, is $<10^{-14}$ g/g for $^{40}$K, $<10^{-12}$ g/g for $^{238}$U and of the order of $10^{-12}$ g/g for $^{232}$Th contaminations. Further details are here provided to address systematic uncertainties related to neutron irradiation that may bias results. To this aim, a dedicated neutron activation campaign was performed and the data were analyzed exploiting a Monte Carlo simulation model of the reactor and applying an unfolding technique to obtain a comprehensive characterization of the neutron flux in typical irradiation configurations. The results of this work provide a valuable benchmark for the application of neutron activation in future radiopurity screening campaigns.",
    "authors": [
      "G. Baccolo",
      "A. Barresi",
      "D. Chiesa",
      "M. Nastasi",
      "E. Previtali",
      "M. Sisti"
    ],
    "published": "2024-11-04T16:07:50Z",
    "updated": "2025-10-06T08:47:37Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1140/epjp/s13360-025-06232-0"
  },
  {
    "arxiv_id": "2510.04415v1",
    "url": "https://arxiv.org/abs/2510.04415v1",
    "pdf_url": "https://arxiv.org/pdf/2510.04415v1.pdf",
    "title": "Beam-dust interactions in an e$^+$e$^-$ collider",
    "abstract": "In recent electron-positron colliders designed and operated with very low emittance and high current, the energy density of the beam has increased significantly compared to earlier designs. Under these conditions, interactions between the beam and residual materials within the beam pipe exert considerable mutual influence. The residual materials are heated by the beam, leading to evaporation, charging, and possible fission, eventually resulting in a plasma state. Conversely, the beam undergoes emittance growth due to electromagnetic interactions with the resulting plasma. We investigate the effects of such dust-induced plasma on the beam through numerical simulations of these processes.",
    "authors": [
      "Kazuhito Ohmi",
      "Hitoshi Fukuma",
      "Shinji Terui"
    ],
    "published": "2025-10-06T01:01:32Z",
    "updated": "2025-10-06T01:01:32Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.04356v1",
    "url": "https://arxiv.org/abs/2510.04356v1",
    "pdf_url": "https://arxiv.org/pdf/2510.04356v1.pdf",
    "title": "Non-local transport in Radiation-Hydrodynamics codes for ICF by   efficient coupling to an external Vlasov-Fokker-Planck code",
    "abstract": "Accurately incorporating non-local transport into radiation-hydrodynamics codes, and indeed any fluid system, has long been elusive. To date, a simplified and accurate theory that can be easily integrated has not been available. This limitation affects modeling in inertial confinement fusion and magnetic confinement fusion systems, among others, where non-local transport is well-known to be present. Here, we present a coupling methodology between a full Vlasov-Fokker-Planck (VFP) electron kinetic code and radiation-hydrodynamics (rad-hydro) codes. The VFP code is used to adjust native electron transport in the rad-hydro code, thus enabling improved transport without the need to integrate a full electron VFP solver into the rad-hydro code. This approach necessitates only occasional invocation of the VFP code, reducing computational intensity compared to following the dynamic evolution entirely with the VFP code on fluid time scales. We illustrate that the methodology is more accurate than other simplified methods in thermal decay systems relevant to inertial confinement fusion and can replicate standard theoretical results with high accuracy.",
    "authors": [
      "Abetharan Antony",
      "Robert Kingham",
      "Stefan Mijin",
      "Marty Marinak"
    ],
    "published": "2025-10-05T20:46:08Z",
    "updated": "2025-10-05T20:46:08Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.04298v1",
    "url": "https://arxiv.org/abs/2510.04298v1",
    "pdf_url": "https://arxiv.org/pdf/2510.04298v1.pdf",
    "title": "A Particle-in-Cell Simulation Framework for Thomson Scattering Analysis   in Inertial Confinement Fusion",
    "abstract": "In inertial confinement fusion (ICF), Thomson scattering (TS) is a widely used diagnostic technique for probing plasma conditions. We present a first-principles numerical approach to obtaining scattered light signals of ion acoustic features with high resolution in angle and frequency space using particle-in-cell simulations under typical ICF conditions. Our method demonstrates good agreement with existing theories for thermal collective TS. In the super-thermal collective regime, the results align with theory when the driven plasma modes are well-matched in wave vectors to the probe and collecting beams. Moreover, we also find that TS signals can remain significant even under imperfect wave-vector matching-a result that contradicts the conventional expectation that the TS spectrum strictly follows the plasma density spectrum. We attribute this discrepancy to a beating wave mechanism arising from the interaction between the probe beam and driven plasma density modulations. Our work thus provides a practical framework for interpreting TS signals from driven ion modes, a common yet complex feature in ICF plasmas.",
    "authors": [
      "Ziang Zhu",
      "Yifan Liu",
      "Jun Li",
      "Han Wen",
      "Shihui Cao",
      "Yin Shi",
      "Qing Jia",
      "Chaoxin Chen",
      "Yaoyuan Liu",
      "Hang Zhao",
      "Tao Gong",
      "Zhichao Li",
      "Dong Yang",
      "Jian Zheng"
    ],
    "published": "2025-10-05T17:25:25Z",
    "updated": "2025-10-05T17:25:25Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.04036v1",
    "url": "https://arxiv.org/abs/2510.04036v1",
    "pdf_url": "https://arxiv.org/pdf/2510.04036v1.pdf",
    "title": "A borehole muon detector with SiPM-on-tile technology",
    "abstract": "We developed a compact and rugged muon detector designed for deployment in boreholes. The detector uses a SiPM-on-tile approach in which silicon photomultipliers are directly coupled to scintillator tiles, thereby eliminating the need for wavelength-shifting fibers and long scintillator bars. The modular design is based on a 64-channel unit, 140~cm in length and 80~mm in diameter, composed of $5 \\times 5$~cm$^{2}$ scintillator tiles coupled to SiPMs, powered and read out using off-the-shelf electronics. The detector has an average muon detection efficiency above 95\\% and acceptance over 5$^\\circ$--60$^\\circ$ in zenith and 0$^\\circ$--360$^\\circ$ in azimuth. Simulations indicate that reconstruction combining hit positions and energy deposits achieves a zenith resolution of 1.5--4.0$^\\circ$ across most of the zenith range. This work demonstrates a compact, rugged, and cost-effective borehole muon detector based on the SiPM-on-tile approach, offering a new alternative for muon tomography.",
    "authors": [
      "Miguel Arratia",
      "Jiajun Huang",
      "Sean Preins",
      "Sebastian Ritter",
      "Christian P. Romero",
      "Sebastian Tapia"
    ],
    "published": "2025-10-05T05:03:12Z",
    "updated": "2025-10-05T05:03:12Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.04012v1",
    "url": "https://arxiv.org/abs/2510.04012v1",
    "pdf_url": "https://arxiv.org/pdf/2510.04012v1.pdf",
    "title": "The LCLStream Ecosystem for Multi-Institutional Dataset Exploration",
    "abstract": "We describe a new end-to-end experimental data streaming framework designed from the ground up to support new types of applications -- AI training, extremely high-rate X-ray time-of-flight analysis, crystal structure determination with distributed processing, and custom data science applications and visualizers yet to be created. Throughout, we use design choices merging cloud microservices with traditional HPC batch execution models for security and flexibility. This project makes a unique contribution to the DOE Integrated Research Infrastructure (IRI) landscape. By creating a flexible, API-driven data request service, we address a significant need for high-speed data streaming sources for the X-ray science data analysis community. With the combination of data request API, mutual authentication web security framework, job queue system, high-rate data buffer, and complementary nature to facility infrastructure, the LCLStreamer framework has prototyped and implemented several new paradigms critical for future generation experiments.",
    "authors": [
      "David Rogers",
      "Valerio Mariani",
      "Cong Wang",
      "Ryan Coffee",
      "Wilko Kroeger",
      "Murali Shankar",
      "Hans Thorsten Schwander",
      "Tom Beck",
      "Frédéric Poitevin",
      "Jana Thayer"
    ],
    "published": "2025-10-05T03:13:38Z",
    "updated": "2025-10-05T03:13:38Z",
    "categories": [
      "cs.IR",
      "physics.ins-det"
    ],
    "primary_category": "cs.IR"
  },
  {
    "arxiv_id": "2510.03960v1",
    "url": "https://arxiv.org/abs/2510.03960v1",
    "pdf_url": "https://arxiv.org/pdf/2510.03960v1.pdf",
    "title": "An Explicit Energy-Conserving Particle Method for the   Vlasov-Fokker-Planck Equation",
    "abstract": "We propose an explicit particle method for the Vlasov-Fokker-Planck equation that conserves energy at the fully discrete level. The method features two key components: a deterministic and conservative particle discretization for the nonlinear Fokker-Planck operator (also known as the Lenard-Bernstein or Dougherty operator), and a second-order explicit time integrator that ensures energy conservation through an accuracy-justifiable correction. We validate the method on several plasma benchmarks, including collisional Landau damping and two-stream instability, demonstrating its effectiveness.",
    "authors": [
      "Jiyoung Yoo",
      "Jingwei Hu",
      "Lee F. Ricketson"
    ],
    "published": "2025-10-04T22:03:14Z",
    "updated": "2025-10-04T22:03:14Z",
    "categories": [
      "physics.plasm-ph",
      "math-ph",
      "math.MP"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.16490v3",
    "url": "https://arxiv.org/abs/2506.16490v3",
    "pdf_url": "https://arxiv.org/pdf/2506.16490v3.pdf",
    "title": "Evaluation of the absolute single-photon detection efficiency of HRPPD",
    "abstract": "Pixelated High Rate Picosecond Photon Detectors (HRPPDs) by Incom Inc. are promising photosensors for use in Ring Imaging CHerenkov (RICH) detectors, where a high gain, sub-mm position resolution and sub-100ps timing resolution are required in a single photon mode. Quantum Efficiency (QE) has been measured for the first batch of EIC HRPPDs both by Incom and EIC research groups at Jefferson Lab and Brookhaven Lab, with peak values at $\\sim$365 nm typically exceeding 30%. In this study, we present a first direct measurement of Photon Detection Efficiency being equal to (17.1 $\\pm$ 0.1 [stat] $\\pm$ 0.3 [sys])% at 398.6 nm, for a pixel near the center of HRPPD, in a photoelectron pulse counting mode using a picosecond diode laser. HRPPD QE at the same spot and at the same wavelength was evaluated to be (24.4 $\\pm$ 0.1 [stat] $\\pm$ 0.3 [sys])%, leading to a Collection Efficiency estimate of (70.3 $\\pm$ 1.6)%, which is consistent with the expectations.",
    "authors": [
      "Yifan Jin",
      "Alexander Kiselev",
      "Sean Stoll"
    ],
    "published": "2025-06-19T17:37:01Z",
    "updated": "2025-10-04T17:23:04Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  }
]