{
  "arxiv_id": "2602.22951v1",
  "url": "https://arxiv.org/abs/2602.22951v1",
  "pdf_url": "https://arxiv.org/pdf/2602.22951v1.pdf",
  "title": "Growth-controlled photochromism in yttrium oxyhydride thin films deposited by HiPIMS and pulsed-DC magnetron sputtering",
  "abstract": "The present study investigates photochromic oxygen-containing yttrium hydride (YHO) thin films deposited by reactive high power impulse magnetron sputtering (HiPIMS) and compares their photochromic, optical, and structural properties with those of films synthesized by reactive pulsed direct current magnetron sputtering (pulsed-DCMS). Optical emission spectroscopy reveals that, unlike pulsed-DCMS where Ar$^{+}$ ions dominate, HiPIMS discharges are characterised by strong Y$^{+}$ emission, evidencing high yttrium ionisation and substantial self-sputter recycling. The critical working pressure (P$_c$) required to obtain transparent and photochromic films is higher for HiPIMS (Pc $\\approx$ 1.0 Pa) than for pulsed-DCMS (Pc $\\approx$ 0.5 Pa). Although films deposited near Pc exhibit similar solar transmittance (~72 %) and lattice parameters (5.38--5.39 Å), the pulsed-DCMS film shows a substantially higher relative photochromic contrast (34 %) and a lower optical band gap (2.70 eV) compared with the HiPIMS film (9 % contrast and 2.94 eV). This difference is partly attributed to a lower oxygen-to-hydrogen atomic ratio in the pulsed-DCMS film. Structurally, HiPIMS films are largely polycrystalline with random out-of-plane crystallographic orientation, whereas pulsed-DCMS films exhibit a pronounced <100> out-of-plane preferred orientation. These results demonstrate that, beyond composition, thin-film growth conditions and microstructure play a crucial role in governing the photochromic performance of YHO.",
  "authors": [
    "M. Zubkins",
    "E. Letko",
    "E. Strods",
    "V. Vibornijs",
    "D. Moldarev",
    "K. Sarakinos",
    "K. Mizohata",
    "K. Kundzins",
    "J. Purans"
  ],
  "published": "2026-02-26T12:43:26Z",
  "updated": "2026-02-26T12:43:26Z",
  "categories": [
    "cond-mat.mtrl-sci",
    "physics.app-ph",
    "physics.plasm-ph"
  ],
  "primary_category": "cond-mat.mtrl-sci",
  "doi": "10.1016/j.vacuum.2026.115214"
}