{
  "arxiv_id": "2602.22653v1",
  "url": "https://arxiv.org/abs/2602.22653v1",
  "pdf_url": "https://arxiv.org/pdf/2602.22653v1.pdf",
  "title": "Nonlinear entropy transfer via zonal flows in gyrokinetic plasma turbulence",
  "abstract": "Nonlinear entropy transfer processes in toroidal ion temperature gradient (ITG) and electron temperature gradient (ETG) driven turbulence are investigated based on the gyrokinetic entropy balance relations for zonal and non-zonal modes, which are coupled through the entropy transfer function regarded as a kinetic extension of the zonal-flow production due to the Reynolds stress. Spectral analyses of the \"triad\" entropy transfer function introduced in this study reveal not only the nonlinear interactions among the zonal and non-zonal modes, but also their effects on the turbulent transport level. Different types of the entropy transfer processes between the ITG and ETG turbulence are found: The entropy transfer from non-zonal to zonal modes is substantial in the saturation phase of the ITG instability, while, once the strong zonal flow is generated, the entropy transfer to the zonal modes becomes quite weak in the steady turbulence state. Instead, the zonal flows mediate the entropy transfer from non-zonal modes with low radial-wavenumbers (with contribution to the heat flux) to the other non-zonal modes with higher radial-wavenumbers (but with less contribution to the heat flux) through the triad interaction. The successive entropy transfer processes to the higher radial-wavenumber modes are associated with transport regulation in the steady turbulence state. In contrast, in both the instability-saturation and steady phases of the ETG turbulence, the entropy transfer processes among low-wavenumber non-zonal modes are dominant rather than the transfer via zonal modes.",
  "authors": [
    "Motoki Nakata",
    "Tomo-Hiko Watanabe",
    "Hideo Sugama"
  ],
  "published": "2026-02-26T06:13:19Z",
  "updated": "2026-02-26T06:13:19Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": "10.1063/1.3675855"
}