{
  "arxiv_id": "2601.22727v1",
  "url": "https://arxiv.org/abs/2601.22727v1",
  "pdf_url": "https://arxiv.org/pdf/2601.22727v1.pdf",
  "title": "A Wide Bandwidth Trans-impedance Amplifier for Picosecond-Scale SiPM Characterization in a Wide Temperature Range",
  "abstract": "Future high-energy physics experiments using SiPMs as photosensitive elements may require operation at low temperatures (down to 80 K) to measure single photons with high time resolution in a highly radioactive environment. This calls for a complete characterization of these sensors over a wide temperature range to find the best compromise between detector performance and cooling requirements. This paper presents the design of a transimpedance amplifier featuring high gain ($\\sim 7500$ $\\mathrm{V/A}$), very high speed ($ < 500$ $\\mathrm{ps}$ rise time) and low input noise ($\\lesssim 0.2$ $\\mathrm{pA/\\sqrt{Hz}}$), able to faithfully reproduce all the features of SiPM signals with very low noise and time jitter. These features make the amplifier suitable for precise measurements of the time-of-arrival of single-photon signals, as well as gain and recovery time. This article provides a detailed and thorough analysis of the circuit. The network was simulated and measured in two configurations that differ in their open-loop gain and dominant pole frequencies. After selecting the best configuration for our purposes, the amplifier was characterized in detail at ambient temperature and at 80 K. Finally, we evaluated the amplifier using a SiPM operated at low over-voltage. While SiPMs are typically characterized at high over-voltage to enhance gain and minimize timing jitter, testing at low over-voltage allowed us to assess the amplifier's performance under more challenging and realistic conditions for single-photon timing.",
  "authors": [
    "P. Carniti",
    "C. Gotti",
    "G. Pessina",
    "D. Trotta"
  ],
  "published": "2026-01-30T09:02:28Z",
  "updated": "2026-01-30T09:02:28Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}