{
  "arxiv_id": "2601.22186v1",
  "url": "https://arxiv.org/abs/2601.22186v1",
  "pdf_url": "https://arxiv.org/pdf/2601.22186v1.pdf",
  "title": "Performance evaluation of an offshore wave measurement buoy in monochromatic waves",
  "abstract": "The accurate measurement of waves underpins marine energy resource characterization, device design, and project development. Datawell wave buoys are widely deployed around the world and have long served as a trusted standard for wave measurements. We quantify the measurement performance, including wave elevation and energy flux estimation, of a Datawell DWR-MkIII buoy using prescribed monochromatic heave motions on a large-amplitude six-degree-of-freedom motion platform at the National Laboratory of the Rockies, assuming the buoy behaves as an ideal wave follower. Commanded motions were validated with an optical motion tracking system while buoy elevation and raw acceleration were recorded. Wave elevations were propagated to wave energy flux estimation using four methods, including one frequency-domain method and three time-domain methods. The Bayesian optimization was applied for design of experiments, and records from three test sites were also applied and evaluated in the present study. Results show two error regions within the nominal period range of 1.6s to 30s}. For wave periods between 5s and 25s, the buoy provides accurate wave height measurements. For short periods less than 5s, the 1.28Hz sampling frequency induces sub-Nyquist artifacts that bias elevation and can drive maximum energy flux estimation errors above 100%. For long periods exceeding 25s, the buoy reported elevation is underpredicted with error depending on period but relatively independent of wave height, with maximum wave height and wave energy flux errors reaching 64% and 87%, respectively. The analysis of field data also indicates that the currently recommended method for estimating wave energy flux may underestimate the wave energy flux.",
  "authors": [
    "Xuepeng Fu",
    "Frederick Driscoll",
    "Rebecca Fao",
    "Calum Kenny",
    "Kevin Patrick Griffin",
    "Mark Murphy",
    "Scott Lambert"
  ],
  "published": "2026-01-28T18:27:00Z",
  "updated": "2026-01-28T18:27:00Z",
  "categories": [
    "physics.ins-det",
    "physics.flu-dyn"
  ],
  "primary_category": "physics.ins-det"
}