{
  "arxiv_id": "2601.23002v1",
  "url": "https://arxiv.org/abs/2601.23002v1",
  "pdf_url": "https://arxiv.org/pdf/2601.23002v1.pdf",
  "title": "Unlocking the Power of Orbital-Free Density Functional Theory to Explore the Electronic Structure Under Extreme Conditions",
  "abstract": "Recent advances in X-ray free-electron laser diagnostics have enabled direct probing of the electronic structure under extreme pressures and temperatures, such as those encountered in stellar interiors and inertial confinement fusion experiments, challenging theoretical models for interpreting experimental data. Kohn-Sham density functional theory (KSDFT) has been successfully applied to analyze experimental X-ray scattering measurements, but its high computational cost renders routine application impractical. Orbital-free DFT (OFDFT) is a substantially more efficient alternative, with computational cost scaling linearly with system size and a weak temperature dependence, yet it often lacks the accuracy required for electronic structure description. Overcoming this limitation, we present a non-empirical Kohn-Sham-assisted orbital-free density functional framework for calculations at extreme conditions, which enables efficient OFDFT simulations with KSDFT-level accuracy for electron densities, electron-ion structure factors, and equations of state across a broad range of conditions. Benchmark comparisons with quantum Monte Carlo data for dense hydrogen and validation against Rayleigh weight measurements of hot dense beryllium demonstrate the reliability of the framework and speedups of up to several hundred times compared with KSDFT. We further show that even at temperatures on the order of 100 eV, quantum non-locality remains essential for correctly describing the electronic structure of dense hydrogen.",
  "authors": [
    "Cheng Ma",
    "Qiang Xu",
    "Zhenhao Zhang",
    "Ke Wang",
    "Ying Sun",
    "Wenhui Mi",
    "Zhandos A. Moldabekov",
    "Tobias Dornheim",
    "Jan Vorberger",
    "Sebastian Schwalbe",
    "Xuecheng Shao"
  ],
  "published": "2026-01-30T14:11:31Z",
  "updated": "2026-01-30T14:11:31Z",
  "categories": [
    "cond-mat.mtrl-sci",
    "physics.plasm-ph"
  ],
  "primary_category": "cond-mat.mtrl-sci"
}