{
  "arxiv_id": "2601.23106v1",
  "url": "https://arxiv.org/abs/2601.23106v1",
  "pdf_url": "https://arxiv.org/pdf/2601.23106v1.pdf",
  "title": "High-bandwidth frequency domain multiplexed readout of transition-edge sensors for neutrinoless double beta decay searches",
  "abstract": "The next-generation of cryogenic neutrinoless double-beta decay experiments require increasingly fast readout in order to improve background discrimination. These experiments, operated as cryogenic calorimeters at $\\sim$10 mK, are usually read out by high-impedance neutron transmutation doped (NTD) thermistors, which provide good energy resolution, but are limited by $\\sim$1 ms response times. Superconducting detectors, such as transition-edge sensors (TESs) with a time resolution of $\\sim$100 $μ$s, offer superior timing performance over NTD semiconductor bolometers. To make this technology viable for an application to a thousand or more channels, multiplexed readout is necessary in order to minimize the thermal load and radioactive contamination induced by the readout. Frequency-domain multiplexing readout (fMux) for TESs, previously developed at Berkeley Lab and McGill University, is currently in use for mm-wave telescopes with detector sampling rates in the order of 100 Hz. We demonstrate a new readout system, based on the McGill/Berkeley digital fMux readout, to satisfy the higher bandwidth and noise requirements of the next generation of TES-instrumented cryogenic calorimeters. The new readout samples detectors at 156 kHz, three orders of magnitude faster than its cosmology-oriented predecessor. Each multiplexing readout module comprises ten superconducting resonators in the MHz range and a superconducting quantum interference device (SQUID), interfaced to high-bandwidth field programmable gate array (FPGA)-based electronics for digital signal processing and low-latency feedback.",
  "authors": [
    "M. Adamič",
    "M. Beretta",
    "J. Camilleri",
    "C. Capelli",
    "M. A. Dobbs",
    "T. Elleflot",
    "B. K. Fujikawa",
    "Yu. G. Kolomensky",
    "D. Mayer",
    "J. Montgomery",
    "V. Novosad",
    "A. M. Sindhwad",
    "V. Singh",
    "G. Smecher",
    "A. Suzuki",
    "B. Welliver"
  ],
  "published": "2026-01-30T15:52:03Z",
  "updated": "2026-01-30T15:52:03Z",
  "categories": [
    "physics.ins-det",
    "astro-ph.IM",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det"
}