[
  {
    "arxiv_id": "2601.00740v1",
    "url": "https://arxiv.org/abs/2601.00740v1",
    "pdf_url": "https://arxiv.org/pdf/2601.00740v1.pdf",
    "title": "Electronic-Entropy-Driven Solid-Solid Phase Transitions in Elemental Metals",
    "abstract": "We compute the thermodynamic phase diagram of seventeen elemental metals with hexagonal close-packed (hcp), face-centered cubic (fcc), and body-centered cubic (bcc) crystal structures using finite-temperature density functional theory. Helmholtz free-energy differences between competing hcp, fcc, and bcc phases are evaluated as functions of electronic temperature up to 7 eV, allowing us to identify solid-solid phase transitions driven by electronic entropy. The systems studied include Zr, Ti, Cd, Zn, Co, and Mg (hcp), Ni, Cu, Ag, Al, Pt, and Pb (fcc), and Cr, W, V, Nb, and Mo (bcc) in their ground-state structures. From the free-energy crossings, we extract the transition electronic temperatures and analyze systematic trends across the metallic systems. We found that all the studied systems go through one or two solid-solid phase transition caused purely by electronic entropy except Mg and Pb. Our results establish electronic entropy as a key factor governing structural stability in metals under strong electronic excitation.",
    "authors": [
      "S. Azadi",
      "S. M. Vinko",
      "A. Principi",
      "T. D. Kuehne",
      "M. S. Bahramy"
    ],
    "published": "2026-01-02T16:45:04Z",
    "updated": "2026-01-02T16:45:04Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2512.16630v2",
    "url": "https://arxiv.org/abs/2512.16630v2",
    "pdf_url": "https://arxiv.org/pdf/2512.16630v2.pdf",
    "title": "Photon Accelerator in Magnetized Plasma",
    "abstract": "Strong magnetic fields and plasmas are intrinsically linked in both terrestrial laboratory experiments and in space phenomena. One of the most profound consequences of that is the change in relationship between the frequency and the wave number of electromagnetic waves propagating in plasma in the presence of such magnetic fields when compared to the case without these fields. Furthermore, magnetic fields alter electromagnetic wave interaction with relativistic plasma waves, resulting in different outcomes for particle and radiation generation. For a relativistic plasma wave-based photon acceleration this leads to an increased frequency gain, and, thus, potentially to higher efficiency. The influence of a magnetic field leads to quantitative and qualitative change in the properties of photon acceleration, amplifying the increase in the electromagnetic wave frequency.",
    "authors": [
      "Sergei Bulanov",
      "Stepan Bulanov",
      "Timur Esirkepov",
      "Gianluca Gregori",
      "Gabriele Grittani",
      "Brandon Russell",
      "Alec Thomas",
      "Petr Valenta"
    ],
    "published": "2025-12-18T15:06:33Z",
    "updated": "2026-01-02T15:41:33Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.00719v1",
    "url": "https://arxiv.org/abs/2601.00719v1",
    "pdf_url": "https://arxiv.org/pdf/2601.00719v1.pdf",
    "title": "Gravitational instability in partially ionized plasmas: A two-fluid approach",
    "abstract": "We propose a new two-fluid model for a partially ionized magnetoplasma under gravity, where electrons and neutrals are treated as a single fluid, and singly charged positive ions are a separate fluid. We observe that the classical result of gravitational instability (also known as Rayleigh-Taylor instability) in fully ionized plasmas is significantly modified by the influence of ion-neutral collisions (with frequency $ν_{\\rm{in}}$) and transverse wave numbers ($k_x$ and $k_y$). The instability growth rate can be enhanced or decreased depending on the values of the ratios $κ\\equiv k_x/k_y$ and $f\\equivν_{\\rm{in}}/Ω_{\\rm{ci}}$, where $Ω_{\\rm{ci}}$ is the ion-cyclotron frequency. We also estimate the growth rates relevant to the ionospheric E-region and solar atmosphere, noting that such growth rates can be maximized for $κ,~f\\ll1$, or for $κ>1$ and $f\\sim0.64$, and minimized for $f\\gg1$ irrespective of the value of $κ$. Furthermore, the timescale of instability ranges from $1$ minute to $2$ minutes in the solar atmosphere, while in the E region, it ranges from $1$ minute to $80$ minutes. The latter can be a satisfactory result for the reported lifetime of solar prominence threads.",
    "authors": [
      "A. P. Misra",
      "V. Krishan"
    ],
    "published": "2026-01-02T15:19:07Z",
    "updated": "2026-01-02T15:19:07Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2501.04886v5",
    "url": "https://arxiv.org/abs/2501.04886v5",
    "pdf_url": "https://arxiv.org/pdf/2501.04886v5.pdf",
    "title": "Distributed network of smartphone sensors: a new tool for scientific field measurements",
    "abstract": "Smartphones sensors are now commonly used by a worldwide audience thanks to their availability, high connectivity, and versatility. Here, we present a methodology to use a collection of smartphones, namely a fleet, as a distributed network of time-synchronized mechanical sensors. We first present the mechanical tests we develop to evaluate the smartphone sensor accuracy. We then describe how to use efficiently a distributed network of smartphones as autonomous sensors. We use a combination of an Android application hosted on each phone (Gobannos), and a server application (Phonefleet) on a controlling host to perform the tasks in parallel remotely. We implement in particular a time synchronization protocol based on UDP communication. We achieved an accuracy of the smartphone clock synchronisation of 60 microseconds. Using two test cases in realistic outdoor conditions, we eventually prove the reliability of a smartphone fleet to measure mechanical wave measurements in field conditions.",
    "authors": [
      "J. Zhang",
      "N. Mokus",
      "J. Casoli",
      "A. Eddi",
      "S. Perrard"
    ],
    "published": "2025-01-08T23:53:22Z",
    "updated": "2026-01-02T14:40:38Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.00686v1",
    "url": "https://arxiv.org/abs/2601.00686v1",
    "pdf_url": "https://arxiv.org/pdf/2601.00686v1.pdf",
    "title": "Stimulation of surface ionization waves by pulsed laser irradiation",
    "abstract": "The inclusion of semiconducting material within a composite barrier enables the perfectly uniform propagation of surface ionization waves (SIW) in air at atmospheric pressure regardless of the polarity of the applied electric field, unlike surface discharges generated using purely dielectric barriers. We exploit the photonic properties of silicon to stimulate the SIW using external irradiation by a 2-ns pulsed laser at 532 nm, with a fluence of 1.3 mJ/cm$^2$ per pulse at the surface. No effect is observed when irradiation occurs more than 3 $μ$s before plasma generation. This timescale is attributed to the ambipolar diffusion of photoexcited carriers away from the Si-SiO$_2$ interface. When this delay shortens to less than 3 $μ$s, the SIW propagates farther and with more intense optical emission. Furthermore, the energy of the discharge increases by up to 7%. The sensitivity to the laser-plasma delay demonstrates that the observed stimulation of the SIW cannot be due to the desorption of surface charge by irradiation.",
    "authors": [
      "Thomas Orrière",
      "David Z. Pai"
    ],
    "published": "2026-01-02T13:28:14Z",
    "updated": "2026-01-02T13:28:14Z",
    "categories": [
      "physics.plasm-ph",
      "physics.app-ph",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.00673v1",
    "url": "https://arxiv.org/abs/2601.00673v1",
    "pdf_url": "https://arxiv.org/pdf/2601.00673v1.pdf",
    "title": "Update on the design of the Columbia Stellarator eXperiment",
    "abstract": "We present the final configuration chosen to be build for the Columbia Stellarator eXperiment (CSX), a new stellartor experiment at Columbia University. In a recent publication, Baillod et al. (NF, 2025) discussed in detail the different objectives, constraints, and optimization algorithms used to find an optimal configuration for CSX. In this paper, we build upon this first publication and find a configuration that satisfies all the constraints. We describe this final configuration including discussion of the coil finite build effects, sensitivity analyses, and the plasma neoclassical physics properties using the SFINCS code. These post-processing calculations provide a confirmation that the experimental goals of CSX can be achieved with the presented configuration.",
    "authors": [
      "Antoine Baillod",
      "Avigdor Veksler",
      "Rohan Lopez",
      "Dylan Schmeling",
      "Michael Campagna",
      "Elizabeth Paul",
      "Alexey Knyazev"
    ],
    "published": "2026-01-02T12:41:01Z",
    "updated": "2026-01-02T12:41:01Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.00586v1",
    "url": "https://arxiv.org/abs/2601.00586v1",
    "pdf_url": "https://arxiv.org/pdf/2601.00586v1.pdf",
    "title": "Elaboration on the kinetic approach of Derbenev and Kondratenko to spin-polarized beams in electron storage rings",
    "abstract": "We present a detailed account of the kinetic approach for describing the effect of synchrotron radiation on electron and positron spin polarization in storage rings. This approach was introduced in 1974 by Derbenev and Kondratenko and was extended by us in 2019. The kinetic approach is much less frequently utilized but it is more general than the original non-kinetic approach of Derbenev and Kondratenko from 1972 since the kinetic approach is not centered on the invariant spin field. As with the non-kinetic approach the kinetic approach covers the radiative depolarization effect, the Sokolov-Ternov effect and its Baier-Katkov correction as well as the kinetic polarization effect but it enables the calculation of corrections to the original Derbenev-Kondratenko formulas and thereby provides estimates of the reliability of the latter. It is applicable to storage rings with energies from a few GeV up to the energies of the FCC-ee and CEPC and beyond. The kinetic approach is based on the spin-orbit Wigner functions which lead to the so-called Bloch equation for the polarization density which is a generalization of Fokker-Planck equations to spin motion. In turn, as discovered in 2019, the Bloch equation is based on stochastic ordinary differential equations which can be used to develop Monte-Carlo spin-tracking codes covering the key effects beyond just radiative depolarization.",
    "authors": [
      "Klaus Heinemann",
      "Dan T. Abell",
      "Jose Agudelo",
      "Desmond P. Barber",
      "Oleksii Beznosov",
      "Joseph P. Devlin",
      "James A. Ellison",
      "Eiad Hamwi",
      "Boaz Nash",
      "Mathias Vogt"
    ],
    "published": "2026-01-02T06:14:44Z",
    "updated": "2026-01-02T06:14:44Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.00518v1",
    "url": "https://arxiv.org/abs/2601.00518v1",
    "pdf_url": "https://arxiv.org/pdf/2601.00518v1.pdf",
    "title": "High-energy Emission from Turbulent Electron-ion Coronae of Accreting Black Holes",
    "abstract": "We develop a model of particle energization and emission from strongly turbulent black-hole coronae. Our local model is based on a set of 2D radiative particle-in-cell simulations with an electron-ion plasma composition, injection and diffusive escape of photons and charged particles, and self-consistent Compton scattering. We show that a radiatively compact turbulent corona generates extended nonthermal ion distributions, while producing X-ray spectra consistent with observations. As an example, we demonstrate excellent agreement with observed X-ray spectra of NGC 4151. The predicted emission spectra feature an MeV tail, which can be studied with future MeV-band instruments. The MeV tail is shaped by nonthermal electrons accelerated at turbulent current sheets. We also find that the corona regulates itself into a two-temperature state, with ions much hotter than electrons. The ions carry away roughly 60% to 70% of the dissipated power, and their energization is driven by a combination of shocks and reconnecting current sheets, embedded into the turbulent flow.",
    "authors": [
      "Daniel Groselj",
      "Alexander Philippov",
      "Andrei M. Beloborodov",
      "Richard Mushotzky"
    ],
    "published": "2026-01-02T00:45:22Z",
    "updated": "2026-01-02T00:45:22Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2601.00490v1",
    "url": "https://arxiv.org/abs/2601.00490v1",
    "pdf_url": "https://arxiv.org/pdf/2601.00490v1.pdf",
    "title": "Fisher-Information-Driven Adaptive Acquisition for Photon-Efficient FLIM: A Dual-Implementation Framework for TCSPC and Programmable Time-Gating",
    "abstract": "We present a Fisher-information (FI) framework for photon-efficient fluorescence lifetime imaging microscopy (FLIM) that treats temporal sampling as a controllable design variable under a fixed photon (dose) budget. Starting from a Poisson photon-counting model for bi-exponential fluorescence decays convolved with a finite instrument response function (IRF) and including additive background, we derive FI for both time-binned TCSPC histograms and programmable time-gated acquisitions. To ensure robustness when nuisance parameters such as IRF width, temporal offset, and background level are uncertain, we compute an effective FI using a Schur-complement marginalization and select hardware-feasible temporal designs by maximizing D-optimal criteria over candidate libraries. Across instrument-agnostic simulations spanning IRF broadening and increasing background fractions, FI-driven temporal designs consistently improve photon efficiency relative to uniform sampling, while nuisance-aware planning yields more stable gains under mismatch than naive optimization. Monte Carlo studies with maximum-likelihood estimation confirm that higher effective FI translates into reduced estimator variance and improved parametric map quality at fixed photon budgets. Finally, we map the same FI core to two practical deployment pathways: adaptive re-binning for TCSPC FLIM and adaptive gate placement/width selection for time-gated FLIM, enabling information-theoretic acquisition without hardware modification.",
    "authors": [
      "J. Sumaya-Martinez",
      "E. Torres-Garcia"
    ],
    "published": "2026-01-01T22:13:04Z",
    "updated": "2026-01-01T22:13:04Z",
    "categories": [
      "physics.ins-det",
      "physics.bio-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.00468v1",
    "url": "https://arxiv.org/abs/2601.00468v1",
    "pdf_url": "https://arxiv.org/pdf/2601.00468v1.pdf",
    "title": "Terrestrial Test of Shapiro Time Delay: Forth test of Einstein General Theory of Relativity",
    "abstract": "The Shapiro time delay is one of the four classical tests of Einstein general theory of relativity and is commonly interpreted as a constrain on the parametrized post Newtonian (PPN) parameter gamma, which is exactly unity in general relativity. To date all measurement of the Shapiro time delay have been confined to astrophysical and solar system observations, yielding constrains on the PPN parameter gamma at the 10-5 level. In this work, we propose a fiber based Sagnac interferometer for precision terrestrial measurements of the Shapiro time delay, enabling a laboratory scale determination of gamma with an intrinsic sensitivity approaching 10-9. This approach provides an independent test of general relativity in a previously unexplored regime.",
    "authors": [
      "Farhad Hakimi",
      "Hosain Hakimi"
    ],
    "published": "2026-01-01T20:40:04Z",
    "updated": "2026-01-01T20:40:04Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "gr-qc"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.00441v1",
    "url": "https://arxiv.org/abs/2601.00441v1",
    "pdf_url": "https://arxiv.org/pdf/2601.00441v1.pdf",
    "title": "Mass-loaded magnetic explosions in the context of Magnetar Giant Flares and Fast Radio Bursts",
    "abstract": "Magnetar flares are highly energetic and rare events where intense high-energy emission is released from strongly magnetised neutron stars. Fast radio bursts are short and intense pulses of coherent radio emission. Their large dispersion measures support an extragalactic origin. While their exact origin still remains elusive, a substantial number of models associates them with strong magnetic field and high-energy relativistic plasma found in the vicinity of magnetars. There is growing evidence that some fast radio bursts are associated to flare-type events from magnetars. We aim to provide a set of configurations describing a relativistic, spherical, mass-loaded, magnetic explosion. We proceed by solving the equations of relativistic magnetohydrodynamics, for a system that expands while maintaining its internal equilibrium. We employ a semi-analytical approach for the solution of the equations of relativistic magnetohydrodynamics. We assume self-similarity in time and radius, axial symmetry, and separation of variables. There exists a dichotomy of solutions that correspond to higher and lower density and thermal pressure compared to the external one. The ratio of the poloidal to toroidal field and the inclusion of pressure and mass density affect the expansion velocity. The classes of these solutions can be applied to magnetar giant flares and fast radio bursts. The ones corresponding to overdensities and higher pressure can be associated to magnetar flares, whereas the ones corresponding to underdensities can be relevant to fast radio bursts corresponding to magnetically dominated events with low mass loading.",
    "authors": [
      "Konstantinos N. Gourgouliatos"
    ],
    "published": "2026-01-01T19:00:14Z",
    "updated": "2026-01-01T19:00:14Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2601.00365v1",
    "url": "https://arxiv.org/abs/2601.00365v1",
    "pdf_url": "https://arxiv.org/pdf/2601.00365v1.pdf",
    "title": "Influence of Cathode Boundary and Initial Electron Swarm Width on Electron Swarm Parameter Determination with the Pulsed Townsend Experiment",
    "abstract": "The Pulsed Townsend experiment enables the extraction of relevant electron transport properties in different gases such as the electron drift velocity $W$ (or equivalently the mobility $μ$), the longitudinal diffusion coefficient $D_{\\mathrm{L}}$, and the effective ionization rate $R_{\\mathrm{net}}$ (or equivalently the effective ionization coefficient $α$). Existing analysis techniques lack an accurate representation of the experimental initial and boundary conditions. This work aims to provide an improved evaluation approach by appropriately considering both initial and boundary conditions in order to extract more accurate swarm parameters from measurement data. Simulative and experimental measurement results verify an increased evaluation accuracy. Furthermore, the longitudinal diffusion coefficient $D_{\\mathrm{L}}$ can now be accurately extracted from Pulsed Townsend measurements. The developed curve fitting code is made publicly available.",
    "authors": [
      "Mücahid Akbas"
    ],
    "published": "2026-01-01T14:53:12Z",
    "updated": "2026-01-01T14:53:12Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.00362v1",
    "url": "https://arxiv.org/abs/2601.00362v1",
    "pdf_url": "https://arxiv.org/pdf/2601.00362v1.pdf",
    "title": "On the Theory of Absorption of Sound Waves via the Bulk Viscosity in the Partially Ionized Solar Chromosphere",
    "abstract": "Bulk viscosity and thermodynamic variables of a hydrogen-helium cocktail: internal energy, enthalpy, pressure, their derivatives, heat capacities per constant density and pressure are obtained using temperature and density height profiles of the solar atmosphere [Avrett & Loeser, ApJS Vol. 175, 229 (2008)]. The qualitative evaluation for the necessary sound wave energy flux to heat the solar chromosphere is determined to be 320 kW/m$^2$. It is concluded that the bulk viscosity creates the dominating mechanism of acoustic waves damping and it is not necessary to introduce artificial viscosity or to conclude that shear viscosity is not sufficient for chromosphere heating; the volume viscosity induced wave absorption is sufficient.",
    "authors": [
      "Albert M. Varonov",
      "Todor M. Mishonov"
    ],
    "published": "2026-01-01T14:42:24Z",
    "updated": "2026-01-01T14:42:24Z",
    "categories": [
      "astro-ph.SR",
      "physics.flu-dyn",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2601.00320v1",
    "url": "https://arxiv.org/abs/2601.00320v1",
    "pdf_url": "https://arxiv.org/pdf/2601.00320v1.pdf",
    "title": "Multispectral UV Imaging on Capacitive CMOS Arrays Enabled by Solution-Processed Metal-Oxide Nanoparticles",
    "abstract": "Ultraviolet (UV) imagers are important for a variety of applications, such as quality inspection in the semiconductor industry, forensics and food quality inspection, but are often costly because they require dedicated semiconductor process flows. Here, an imaging chip is introduced that has been fabricated using standard 40 nm complementary metal-oxidesemiconductor (CMOS) technology. Instead of using a conventional charge-based photodetection principle, the imager uses a capacitive operation principle where UV-light causes capacitance changes via the photodielectric effect in a functionalization layer, which are measured by the underlying CMOS circuitry. This spin-coated or inkjet-printed functionalization layer consists of solution-processed, wide-bandgap, semiconducting metaloxide nanoparticles, and facilitates multispectral imaging. The sensors exhibit low noiseequivalent powers (17-138 fW Hz^-1/2) across the UV bands. Unlike conventional silicon CMOS imagers, the present capacitive-CMOS platform is inherently visible-blind, providing selective UV detection. This work positions late-functionalized capacitive-CMOS arrays as a route toward reducing the cost of UV imagers, which can lead to their more widespread implementation in consumer and low-volume application-specific products.",
    "authors": [
      "Suman Kundu",
      "Tao Shen",
      "Kai Betlem",
      "Murali K Ghatkesar",
      "Peter G Steeneken",
      "Frans P Widdershoven"
    ],
    "published": "2026-01-01T12:05:10Z",
    "updated": "2026-01-01T12:05:10Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mtrl-sci",
      "physics.app-ph",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.00298v1",
    "url": "https://arxiv.org/abs/2601.00298v1",
    "pdf_url": "https://arxiv.org/pdf/2601.00298v1.pdf",
    "title": "Enhanced wakefield generation in homogeneous plasma via two co-propagating laser pulses",
    "abstract": "This investigation deals with enhanced plasma wakefield amplitude generated using two co-propagating laser pulses in homogeneous plasma. The configuration consists of a seed pulse followed by a trailing pulse, both linearly polarized and sharing identical laser parameters. The enhancement in wakefield amplitude corresponding to fixed spatial separation is optimized for various pulse widths and intensities of the seed and trailing lasers. Analytical modelling and particle-in-cell simulations reveal that the maximum amplification in wakefield amplitude is obtained when spatial separation equals the plasma wavelength (λ_p). The spatial intervals between laser pulses critically influence the wakefield amplification. These findings confirm that the two co-propagating lasers scheme provides a promising route toward stronger plasma wakefield excitation, potentially important for various applications.",
    "authors": [
      "Abhishek Kumar Maurya",
      "Dinkar Mishra",
      "Bhupesh Kumar",
      "Ramesh C Sharma",
      "Lal C Mangal",
      "Binoy K Das",
      "Vijay K Saraswat",
      "Brijesh Kumar"
    ],
    "published": "2026-01-01T10:37:41Z",
    "updated": "2026-01-01T10:37:41Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.00241v1",
    "url": "https://arxiv.org/abs/2601.00241v1",
    "pdf_url": "https://arxiv.org/pdf/2601.00241v1.pdf",
    "title": "Revisiting p-$^{11}$B Fusion: Updated Cross-sections, Reactivity, and Energy Balance",
    "abstract": "Recent experimental progress has substantially improved the available cross-section data for the p-$^{11}$B fusion reaction, particularly in energy regions that previously lacked direct measurements. In this study, we develop a high-precision analytical parameterization of the p-$^{11}$B reaction cross-section over the 0--10 MeV energy range, incorporating the new experimental data into a continuous and numerically efficient representation. Using this parameterization, we evaluate the thermonuclear reactivity of the p-$^{11}$B reaction and examine the effects of the dominant resonance at 0.6 MeV and a newly observed resonance around 4.7 MeV. Furthermore, we assess the energy balance by analyzing the fusion power density and the electron bremsstrahlung power density. Our results indicate that p-$^{11}$B fusion is not precluded by bremsstrahlung constraints when contemporary cross-section data and self-consistent thermal modeling are employed.",
    "authors": [
      "Hong-Yi Wang",
      "Yu-Qi Li",
      "Qian Wu",
      "Zhu-Fang Cui"
    ],
    "published": "2026-01-01T07:21:52Z",
    "updated": "2026-01-01T07:21:52Z",
    "categories": [
      "nucl-th",
      "astro-ph.HE",
      "nucl-ex",
      "physics.plasm-ph"
    ],
    "primary_category": "nucl-th"
  },
  {
    "arxiv_id": "2601.00236v1",
    "url": "https://arxiv.org/abs/2601.00236v1",
    "pdf_url": "https://arxiv.org/pdf/2601.00236v1.pdf",
    "title": "Transient spark dielectric barrier post-discharge plasma reactor with a liquid electrode for dye degradation: A primary study",
    "abstract": "The potential application of non-thermal plasma in treating textile industrial wastewater motivates researchers to develop innovative techniques at a laboratory scale to achieve the goal of wastewater mineralization. In line with this objective, a dielectric barrier post-discharge plasma reactor with a liquid electrode has been built for the study of synthetic dye degradation. The plasma reactor was optimized by altering various operating conditions to achieve a higher degradation efficiency at given discharge conditions. The reaction kinetics of crystal violet degradation were studied, and the same plasma reactor was tested for other synthetic dyes (wastewater model samples). The results suggest that the proposed dielectric barrier post-discharge plasma reactor may offer a promising solution for treating dye effluents from the textile industry.",
    "authors": [
      "Mangilal Choudhary",
      "Vanshika",
      "Surya"
    ],
    "published": "2026-01-01T06:58:22Z",
    "updated": "2026-01-01T06:58:22Z",
    "categories": [
      "physics.plasm-ph",
      "physics.app-ph",
      "physics.bio-ph",
      "physics.chem-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.00157v1",
    "url": "https://arxiv.org/abs/2601.00157v1",
    "pdf_url": "https://arxiv.org/pdf/2601.00157v1.pdf",
    "title": "Towards a temperature-insensitive composite diamond clock",
    "abstract": "Frequency references based on solid state spins promise simplicity, compactness, robustness, multifunctionality, ease of integration, and high densities of emitters. Nitrogen-vacancy (NV) centers in diamond are a natural candidate, but the electronic zero-field splitting exhibits a large fractional temperature dependence, which has precluded its use as a stable clock transition. Here we show that this limitation can be overcome by forming a composite frequency reference that combines measurements of the electronic splitting D with the nuclear quadrupole splitting of the $^{14}$N nuclear spin intrinsic to the NV center. We further benchmark this composite approach against alternative strategies for mitigating temperature sensitivity. By implementing a specially designed pulse sequence with an eight-phase control scheme that suppresses pulse imperfections, we interleave measurements of D and Q in a high-density NV ensemble and demonstrate a temperature-compensated composite frequency reference. The stability of this composite diamond clock is characterized over a 10-day period at room temperature through a comparison to a Rb vapor-cell clock, yielding a fractional instability below $5 \\times 10^{-9}$ for an averaging time of $τ= 200$ s and below $1 \\times 10^{-8}$ at $τ= 2 \\times 10^5$ s, corresponding to measured improvements by a factor of 4 and 200, respectively, over a clock based purely on the single frequency D for the same periods. By characterizing the residual sensitivity to magnetic fields, optical power, and radio-frequency drive amplitudes, we find that temperature is no longer the dominant source of instability. These results establish complementary electron- and nuclear-spin transitions in diamond as a viable route to thermally robust frequency metrology, providing a pathway toward compact, multifunctional solid-state clocks and quantum sensors.",
    "authors": [
      "Sean Lourette",
      "Andrey Jarmola",
      "Jabir Chathanathil",
      "Victor M. Acosta",
      "A. Glen Birdwell",
      "Peter Blümler",
      "Dmitry Budker",
      "Sebastián C. Carrasco",
      "Tony G. Ivanov",
      "Shimon Kolkowitz",
      "Vladimir S. Malinovsky"
    ],
    "published": "2026-01-01T01:17:43Z",
    "updated": "2026-01-01T01:17:43Z",
    "categories": [
      "quant-ph",
      "physics.app-ph",
      "physics.atom-ph",
      "physics.ins-det"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2510.07502v2",
    "url": "https://arxiv.org/abs/2510.07502v2",
    "pdf_url": "https://arxiv.org/pdf/2510.07502v2.pdf",
    "title": "Factors Controlling the Statistics of Magnetic Reconnection in MHD Turbulence",
    "abstract": "We study the statistics of dynamical quantities associated with magnetic reconnection events embedded in a sea of strong background magnetohydrodynamic (MHD) turbulence using direct numerical simulations. We focus on the relationship of the reconnection properties to the statistics of global turbulent fields. For the first time, we show that the distribution in turbulence of reconnection rates (determined by upstream fields) is strongly correlated with the magnitude of the global turbulent magnetic field at the correlation scale. The average reconnection rates, and associated dissipation rates, during turbulence are thus much larger than predicted by using turbulent magnetic field fluctuation amplitudes at the dissipation or kinetic scales. Magnetic reconnection may therefore be playing a major role in energy dissipation in astrophysical and heliospheric turbulence.",
    "authors": [
      "M. B. Khan",
      "M. A. Shay",
      "S. Oughton",
      "W. H. Matthaeus",
      "C. C. Haggerty",
      "S. Adhikari",
      "P. A. Cassak",
      "S. Fordin",
      "D. O'Donnell",
      "Y. Yang",
      "R. Bandyopadhyay",
      "S. Roy"
    ],
    "published": "2025-10-08T19:56:03Z",
    "updated": "2025-12-31T23:13:02Z",
    "categories": [
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1103/yjh7-hy2s"
  },
  {
    "arxiv_id": "2601.00134v1",
    "url": "https://arxiv.org/abs/2601.00134v1",
    "pdf_url": "https://arxiv.org/pdf/2601.00134v1.pdf",
    "title": "Generation and characterization of coherent terahertz radiation from 100-TW laser-wakefield acceleration",
    "abstract": "We experimentally characterized terahertz (THz) radiation emitted from laser-wakefield acceleration (LWFA) driven at 100-TW laser power. Simultaneous measurements of the laser energy, electron-bunch charge, and THz energy reveal a quadratic dependence of the THz energy on both charge and laser energy. This behavior indicates coherent collective emission in the generation process and provides a useful scaling law for THz output. Microbolometer-based beam profiling shows a relatively large THz beam divergence (~0.2 rad). Single-shot THz interferometry further shows that the emitted THz pulse is sub-picosecond in duration and broadband. Combining the beam-profile and interferometric measurements, the THz spectrum is expected to span approximately 1-20 THz. Together, these results support coherent acceleration radiation as the dominant mechanism for THz generation in 100-TW LWFA.",
    "authors": [
      "Taegyu Pak",
      "Dae Hee Wi",
      "Sang Beom Kim",
      "Jaewon Lim",
      "Jae Hee Sung",
      "Seong Ku Lee",
      "Ki-Yong Kim"
    ],
    "published": "2025-12-31T22:33:52Z",
    "updated": "2025-12-31T22:33:52Z",
    "categories": [
      "physics.plasm-ph",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.25021v1",
    "url": "https://arxiv.org/abs/2512.25021v1",
    "pdf_url": "https://arxiv.org/pdf/2512.25021v1.pdf",
    "title": "Detector Response Matrices, Effective Areas, and Flash-Effective Areas for Radiation Detectors",
    "abstract": "A Detector Response Matrix (DRM) is a discrete representation of an instrument's Detector Response Function (DRF), which quantifies how many discrete energy depositions occur in a detector volume for a given distribution of particles incident on the detector. For simple radiation detectors that can count such energy depositions (such as scintillators, Proportional Counter Tubes (PCTs), etc), we consider the ideal counting DRF, $\\mathbf{G}_\\varphi (E_\\mathrm{in}, E_\\mathrm{dep})$, which relates the detector's counting histogram (number of energy depositions within a given channel) to an incident particles characterization, $\\varphi$ (e.g. incident flux, fluence, intensity). From the counting DRF we can derive the counting DRM, the effective area, and the flash effective area (which measures the total energy deposited in the detector from a large, instantaneous fluence).",
    "authors": [
      "Gregory Bowers",
      "Eve Chase",
      "William Ford",
      "Daniel Coupland",
      "Brian Larsen",
      "Caleb Roecker",
      "Karl Smith",
      "Kurtis Bartlett",
      "Katherine Gattiker Katherine Mesick"
    ],
    "published": "2025-12-31T18:20:10Z",
    "updated": "2025-12-31T18:20:10Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "math-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2503.20475v3",
    "url": "https://arxiv.org/abs/2503.20475v3",
    "pdf_url": "https://arxiv.org/pdf/2503.20475v3.pdf",
    "title": "An electron-hadron collider at the high-luminosity LHC",
    "abstract": "We discuss a concept of a lower-energy version of the Large Hadron-electron Collider (LHeC), delivering electron-hadron collisions concurrently to the hadron-hadron collisions at the high-luminosity LHC at CERN. Assuming the use of a 20 GeV electron Energy Recovery Linac (ERL), we report the results on the optimised beam dynamics, accelerator technologies, and detector constraints required for such a \"phase-one\" LHeC. Finally, we also discuss the ERL configurations and the possibility of delivering electron-hadron collisions during the planned {Run5} of the LHC, which opens excellent research capabilities - the unique scientific potential of the proposed facility is outlined.",
    "authors": [
      "Kevin David J André",
      "Laurent Forthomme",
      "Bernhard Holzer",
      "Krzysztof Piotrzkowski"
    ],
    "published": "2025-03-26T11:59:29Z",
    "updated": "2025-12-31T16:26:15Z",
    "categories": [
      "hep-ex",
      "physics.acc-ph"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1088/1367-2630/ae2e31"
  },
  {
    "arxiv_id": "2512.18355v2",
    "url": "https://arxiv.org/abs/2512.18355v2",
    "pdf_url": "https://arxiv.org/pdf/2512.18355v2.pdf",
    "title": "Discrete Electron Emission",
    "abstract": "Analysis of space-charge effects on electron emission typically makes some assumption of continuity and smoothness, whether this is continuity of charge as in the classical derivation of the Child-Langmuir current, or the mean-field approximation used in particle-in-cell simulations. However, when studying the physics of electron emission and propagation at the mesoscale it becomes necessary to consider the discrete nature of electronic charge to account for the space-charge effect of each individual point charge. In this paper we give an extensive analysis of some previous work on the distribution of electrons under space-charge limited conditions. We examine the spacing of electrons as they are emitted from a planar surface, We present simplified models for analysis of such conditions to derive scaling laws for emission and compare them to computer simulations.",
    "authors": [
      "Arnar Jonsson",
      "Kristinn Torfason",
      "Andrei Manolescu",
      "Agust Valfells"
    ],
    "published": "2025-12-20T12:51:32Z",
    "updated": "2025-12-31T15:03:59Z",
    "categories": [
      "physics.acc-ph",
      "cond-mat.mes-hall"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.07800v2",
    "url": "https://arxiv.org/abs/2510.07800v2",
    "pdf_url": "https://arxiv.org/pdf/2510.07800v2.pdf",
    "title": "Constraints on inelastic dark matter from the CDEX-1B experiment",
    "abstract": "We present limits on spin-independent inelastic weakly interacting massive particles (WIMP)-nucleus scattering using the 737.1 kg$\\cdot$day dataset from the CDEX-1B experiment. Expected nuclear recoil spectra for various inelastic WIMP masses $m_χ$ and mass splittings $δ$ are calculated under the standard halo model. An accurate background model of CDEX-1B is constructed by simulating all major background sources. The model parameters are then determined through maximum likelihood estimation and Markov chain Monte Carlo fitting. The resulting 90\\% confidence level upper limits on the WIMP-nucleon cross section $σ_{\\mathrm{n}}$ exclude certain DAMA/LIBRA allowed regions: the $χ^2 < 4$ regions for $δ< 30$ keV at $m_χ= 250$ GeV and the $χ^2 < 9$ region for $δ< 50$ keV at $m_χ= 500$ GeV. The method is applicable to other inelastic dark matter scenarios, and the upcoming CDEX-50 experiment is expected to improve sensitivity by four orders of magnitude.",
    "authors": [
      "Y. F. Liang",
      "L. T. Yang",
      "Q. Yue",
      "K. J. Kang",
      "Y. J. Li",
      "H. P. An",
      "Greeshma C.",
      "J. P. Chang",
      "H. Chen",
      "Y. H. Chen",
      "J. P. Cheng",
      "J. Y. Cui",
      "W. H. Dai",
      "Z. Deng",
      "Y. X. Dong",
      "C. H. Fang",
      "H. Gong",
      "Q. J. Guo",
      "T. Guo",
      "X. Y. Guo",
      "L. He",
      "J. R. He",
      "H. X. Huang",
      "T. C. Huang",
      "S. Karmakar",
      "Y. S. Lan",
      "H. B. Li",
      "H. Y. Li",
      "J. M. Li",
      "J. Li",
      "M. C. Li",
      "Q. Y. Li",
      "R. M. J. Li",
      "X. Q. Li",
      "Y. L. Li",
      "B. Liao",
      "F. K. Lin",
      "S. T. Lin",
      "J. X. Liu",
      "R. Z. Liu",
      "S. K. Liu",
      "Y. D. Liu",
      "Y. Liu",
      "Y. Y. Liu",
      "H. Ma",
      "Y. C. Mao",
      "A. Mureed",
      "H. Pan",
      "N. C. Qi",
      "J. Ren",
      "X. C. Ruan",
      "M. B. Shen",
      "H. Y. Shi",
      "M. K. Singh",
      "T. X. Sun",
      "W. L. Sun",
      "C. J. Tang",
      "Y. Tian",
      "H. F. Wan",
      "G. F. Wang",
      "J. Z. Wang",
      "L. Wang",
      "Q. Wang",
      "Q. Wang",
      "Y. F. Wang",
      "Y. X. Wang",
      "H. T. Wong",
      "Y. C. Wu",
      "H. Y. Xing",
      "K. Z. Xiong",
      "R. Xu",
      "Y. Xu",
      "T. Xue",
      "Y. L. Yan",
      "N. Yi",
      "C. X. Yu",
      "H. J. Yu",
      "X. Yu",
      "M. Zeng",
      "Z. Zeng",
      "F. S. Zhang",
      "P. Zhang",
      "P. Zhang",
      "Z. Y. Zhang",
      "M. G. Zhao",
      "J. F. Zhou",
      "Z. Y. Zhou",
      "J. J. Zhu"
    ],
    "published": "2025-10-09T05:29:23Z",
    "updated": "2025-12-31T14:37:50Z",
    "categories": [
      "hep-ex",
      "hep-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1103/cyyp-7w7g"
  },
  {
    "arxiv_id": "2512.24878v1",
    "url": "https://arxiv.org/abs/2512.24878v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24878v1.pdf",
    "title": "Image-Plane Detection of Spatially Entangled Photon Pairs with a CMOS Camera",
    "abstract": "Spatially entangled photon pairs (biphotons) generated by spontaneous parametric down-conversion offer unique opportunities for quantum imaging, but image-plane biphoton correlations are difficult to observe with camera-based detectors. Previous camera-based biphoton imaging experiments have relied on photon-counting detection, which necessitates operation deep in the photon-sparse regime and requires extremely low dark rates.   Here, we demonstrate the detection of spatial biphoton joint probability distributions in both the image plane and the pupil plane (also termed \"near-field plane\" and \"far-field plane\" respectively) using a conventional scientific CMOS camera operated in linear mode. We work at mesoscopic intensity levels, corresponding to a photon flux approximately four orders of magnitude higher than typical photon-counting approaches. From the measured image- and pupil plane correlations, we observe position and momentum correlations consistent with an EPR-type entanglement witness.   A tailored correlation analysis suited for image plane imaging suppresses detector artifacts and intensity fluctuations, enabling acquisition with significantly fewer frames. Our results demonstrate that spatially entangled-light imaging can be performed efficiently with standard imaging hardware, extending quantum imaging techniques beyond the photon-counting regime.",
    "authors": [
      "David McFadden",
      "Rainer Heintzmann"
    ],
    "published": "2025-12-31T14:15:59Z",
    "updated": "2025-12-31T14:15:59Z",
    "categories": [
      "quant-ph",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2512.24837v1",
    "url": "https://arxiv.org/abs/2512.24837v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24837v1.pdf",
    "title": "A Low Background Beta Detection System using a Time Projection Chamber",
    "abstract": "In this paper, we present a Time Projection Chamber (TPC) system for low-background beta radiation measurements. The system consists of a TPC with two-dimensional-strip readout Micromegas and an anti-coincidence detector with readout pads for cosmic ray veto. The detector system utilize an AGET-based waveform sampling system for data acquisition.   The beta detection capability of the system was verified through experimental test using $^{90}$Sr beta source. Additionally, a dedicated simulation program based on Geant4 was developed to model the entire detection process, including responses to both the beta source and background radiation. Simulation results were compared with experimental data for both beta and background samples, showing good agreements.   The simulation samples were utilized to optimize and train classification models for beta and background discrimination. By applying the selected model into test data, the system achieved a background rate of 0.49 $\\rm cpm/cm^2$ while retaining more than 55% of $^{90}$Sr beta signals within a 7 cm diameter detection region. Further analysis revealed that approximately 70% of the background originates from environmental gamma radiation, while the remaining contribution mainly comes from intrinsic radioactivity of detector materials, particularly the FR-4 based field cage and readout plane. Based on the knowledge gained from the experiments and simulations, an optimization of the TPC system has been proposed, with simulation predicting a potential reduction of the background rate to 0.0012 $\\rm cpm/cm^2$.",
    "authors": [
      "Ruiyang Zhang",
      "Zhiyong Zhang",
      "Zengxuan Huang",
      "Yong Zhou",
      "Jianbei Liu",
      "Songsong Tang",
      "Yuanfei Cheng",
      "Changqing Feng",
      "Ming Shao",
      "Yi Zhou"
    ],
    "published": "2025-12-31T12:58:05Z",
    "updated": "2025-12-31T12:58:05Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2506.07213v4",
    "url": "https://arxiv.org/abs/2506.07213v4",
    "pdf_url": "https://arxiv.org/pdf/2506.07213v4.pdf",
    "title": "AttoSHINE: Generation of continuous-wave terawatt-scale attosecond X-ray pulses at SHINE",
    "abstract": "Attosecond X-ray pulses are a critical tool for tracking ultrafast electron dynamics in condensed matter, molecular systems, and strongly correlated materials. Recent breakthroughs have pushed X-ray free electron lasers (XFELs) into the attosecond domain, significantly surpassing their previous femtosecond capabilities. Building on these advancements, this work investigates the potential of the Shanghai High Repetition Rate XFEL and Extreme Light Facility (SHINE), China's first continuous-wave (CW) XFEL, to generate intense attosecond X-ray pulses, thereby offering transformative capabilities for X-ray science. Through comprehensive start-to-end simulations, we show that SHINE is capable of producing hard X-ray pulses with peak powers reaching the terawatt-scale and average pulse durations of approximately 300 as. This is achieved using a self-chirping scheme within the existing machine configuration, requiring no additional hardware. Our findings demonstrate that CW XFELs can generate intense attosecond X-ray pulses at megahertz repetition rates, opening new opportunities for real-time studies of electronic dynamics in complex systems.",
    "authors": [
      "Bingyang Yan",
      "Chenzhi Xu",
      "Si Chen",
      "Duan Gu",
      "Ye Chen",
      "Jiawei Yan",
      "Haixiao Deng"
    ],
    "published": "2025-06-08T16:32:35Z",
    "updated": "2025-12-31T10:11:43Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.24760v1",
    "url": "https://arxiv.org/abs/2512.24760v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24760v1.pdf",
    "title": "Runaway electron avalanche and macroscopic beam formation: simulations of the DTT full power scenario",
    "abstract": "The transition of the Divertor Tokamak Test (DTT) facility from its initial commissioning phase (Day-0, plasma current $I_{p}=2$ MA) to the full power scenario ($I_{p}=5.5$ MA) introduces a critical shift in the dynamics of runaway electrons (REs) generation. While previous predictive studies of the low-current scenario indicated a robust safety margin against RE beam formation, this work reveals that the exponential scaling of the RE avalanche gain with plasma current severely narrows the safe operational window in the full power scenario. Using the non-linear magnetohydrodynamic code JOREK, we perform comprehensive 2D simulations of the current quench (CQ) phase of several disruption scenarios, systematically scanning initial RE seed currents and injected impurity levels. The results demonstrate that in the full power scenario, the avalanche multiplication factor is sufficiently high ($G_\\text{av} \\approx 1.3 \\cdot 10^5$) to convert a mere 5.5 A seed current into macroscopic RE beams of $\\approx 0.7$ MA when large amounts of impurities are present. For even higher RE seeds, the RE current can peak at $ \\approx 3.2$ MA, constituting up to $\\approx$ 80% of the total plasma current during the CQ. These findings suggest that, unlike the Day-0 phase, the disruption mitigation strategy for the full power scenario involves a careful balance between thermal load mitigation and RE avoidance, necessitating a well-chosen quantity of injected impurities. This work provides the baseline needed for future estimations of RE loads on the plasma-facing components of DTT, which will be essential for designing and positioning mitigation components like sacrificial limiters.",
    "authors": [
      "E. Emanuelli",
      "F. Vannini",
      "M. Hoelzl",
      "E. Nardon",
      "V. Bandaru",
      "N. Schwarz",
      "D. Bonfiglio",
      "G. Ramogida",
      "F. Subba",
      "JOREK Team"
    ],
    "published": "2025-12-31T10:09:27Z",
    "updated": "2025-12-31T10:09:27Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.24723v1",
    "url": "https://arxiv.org/abs/2512.24723v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24723v1.pdf",
    "title": "Cataloging the nonlinear waves excited by moving a charged body in the dusty plasma medium",
    "abstract": "The nonlinear waves excited by the movement of a charged body in the dusty plasma medium are studied. A charged body moving through a dusty plasma medium can generate diverse nonlinear waves, such as precursors and pinned solitons. These wave excitations under weakly nonlinear and dispersive limits are described theoretically by the forced Korteweg-de Vries (fKdV) type equation. We have examined the role of the driver in shaping and evolving these wave excitations. In particular we studied the effect of primarily three source parameters, namely, amplitude, width, and flow speed, on the evolution of nonlinear structures. The driver generates a perturbation in the stable system configuration, which couples with medium characteristics and eventually evolves into propagating excitations. Our finding shows that the excitation of nonlinear structure by a moving body in a plasma medium is not just dictated by the mach number but also the features of the source such as amplitude and width. As a novel finding apart from pinned and precursor solitons, we observe another nonlinear structure that lags behind the source term, maintaining its shape and speed as it propagates. These features are the first ever theoretical depiction of such lagging structures.",
    "authors": [
      "Swathi S Krishna",
      "S. K. Mishra",
      "S. Jaiswal"
    ],
    "published": "2025-12-31T08:40:39Z",
    "updated": "2025-12-31T08:40:39Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.24719v1",
    "url": "https://arxiv.org/abs/2512.24719v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24719v1.pdf",
    "title": "Achieving High Efficiency And Enhanced Beam Quality In Laser Wakefield Acceleration",
    "abstract": "Laser wakefield acceleration, characterized by the extremely high electric field gradient exceeding 100GV/m, is regarded as a compact and cost affordable technology for the next generation of particle colliders and light sources. However, it has always been a major challenge to effectively increase the energy transfer efficiency from the laser to the accelerated beam, while ensuring the beam quality remains suitable for practical applications. This study demonstrates that the laser with shorter pulse duration allows for a two-step dechirping process of the accelerated electron beam with charge of nanocoulomb level. The electron beams with an energy spread of 1% can be generated with the energy transfer efficiency of 10% to 30% in a large parameter space. For example, one electron beam with the energy of 420MeV, the charge of 5.5nC and the RMS energy spread of 2% can be produced using an 8.3J laser pulse with 7.2fs duration.",
    "authors": [
      "Jia Wang",
      "Ming Zeng",
      "Dazhang Li",
      "Wentao Wang",
      "Song Li",
      "Ke Feng",
      "Jie Gao"
    ],
    "published": "2025-12-31T08:32:22Z",
    "updated": "2025-12-31T08:32:22Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.24544v1",
    "url": "https://arxiv.org/abs/2512.24544v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24544v1.pdf",
    "title": "Computing Flux-Surface Shapes in Tokamaks and Stellarators",
    "abstract": "There is currently no agreed-upon methodology for characterizing a stellarator magnetic field geometry, and yet modern stellarator designs routinely attain high levels of magnetic-field quasi-symmetry through careful flux-surface shaping. Here, we introduce a general method for computing the shape of an ideal-MHD equilibrium that can be used in both axisymmetric and non-axisymmetric configurations. This framework uses a Fourier mode analysis to define the shaping modes (e.g. elongation, triangularity, squareness, etc.) of cross-sections that can be non-planar. Relative to an axisymmetric equilibrium, the additional degree of freedom in a non-axisymmetric equilibrium manifests as a rotation of each shaping mode about the magnetic axis. Using this method, a shaping analysis is performed on non-axisymmetric configurations with precise quasi-symmetry and select cases from the QUASR database spanning a range of quasi-symmetry quality. Empirically, we find that quasi-symmetry results from a spatial resonance between shape complexity and shape rotation about the magnetic axis. The quantitative features of this resonance correlate closely with a configuration's rotational transform and number of field periods. Based on these observations, it is conjectured that this shaping paradigm can facilitate systematic investigations into the relationship between general flux-surface geometries and other figures of merit.",
    "authors": [
      "M. J. Gerard",
      "M. J. Pueschel",
      "S. Stewart",
      "H. O. M. Hillebrecht",
      "B. Geiger"
    ],
    "published": "2025-12-31T01:02:11Z",
    "updated": "2025-12-31T01:02:11Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2505.00288v6",
    "url": "https://arxiv.org/abs/2505.00288v6",
    "pdf_url": "https://arxiv.org/pdf/2505.00288v6.pdf",
    "title": "Nyström Type Exponential Integrators for Strongly Magnetized Charged Particle Dynamics",
    "abstract": "Solving for charged particle motion in electromagnetic fields (i.e. the particle pushing problem) is a computationally intensive component of particle-in-cell (PIC) methods for plasma physics simulations. This task is especially challenging when the plasma is strongly magnetized due numerical stiffness arising from the wide range of time scales between highly oscillatory gyromotion and long term macroscopic behavior. A promising approach to solve these problems is by a class of methods known as exponential integrators that can solve linear problems exactly and are A-stable. This work extends the standard exponential integration framework to derive Nyström-type exponential integrators that integrates the Newtonian equations of motion as a second-order differential equation directly. In particular, we derive second-order and third-order Nyström-type exponential integrators for strongly magnetized particle pushing problems. Numerical experiments show that the Nyström-type exponential integators exhibit significant improvement in computation speed over the standard exponential integrators.",
    "authors": [
      "Tri P. Nguyen",
      "Ilon Joseph",
      "Mayya Tokman"
    ],
    "published": "2025-05-01T04:22:49Z",
    "updated": "2025-12-31T00:32:05Z",
    "categories": [
      "physics.comp-ph",
      "math.NA",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.comp-ph",
    "doi": "10.1016/j.cpc.2025.109848"
  },
  {
    "arxiv_id": "2512.24363v1",
    "url": "https://arxiv.org/abs/2512.24363v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24363v1.pdf",
    "title": "The sun as colliding beam, betatron cosmic ray factory",
    "abstract": "A theory of cosmic ray production within the solar system (not extra-galactic) is presented. The sun's time variable magnetic flux linkage makes the sun (as well, perhaps, as Jupiter) a natural, all-purpose, betatron storage ring, with semi-infinite acceptance aperture, capable of storing and accelerating counter-circulating, opposite-sign, colliding beams.   The puzzle of how positrons and anti-protons can be well represented at all energies, is explained, initially, by the low energy capture of particles of either sign by the sun's magnetic dipole field. Later, as the magnetic field bending has become negligible compared to the gravitational bending, both positive and negative beams will have survived the gradual transition from predominantly magnetic to predominantly gravitational bending. Later, anti-particles produced in QED beam-beam collisions of sufficiently high energy, are also accelerated.   The high quality of cosmic ray data collected over recent decades, at steadily increasing energies, especially by the International Space Station (ISS), make the study of cosmic ray production mechanisms both timely and essential.   The paper describes how longitudinal electric fields, explained by the Parker solar wind theory can enable the sun to serve as a ``booster'' accelerator of cosmic rays, increasing the maximum cosmic ray energies enough to produce the observed 13 orders of magnitude maximum particle energy and the energy flux needed to maintain the observed cosmic ray atmosphere equilibrium within the solar system.   A steady state mechanism is described, based on semi-quantitative discussion of a relativistic Hamilton-Jacobi formalism, according to which the highest energy cosmic rays observed can have been produced by the Parker longitudinal electric field component, during fractionally brief, but periodic, circular or semi-circular turns centered on the sun.",
    "authors": [
      "Richard M. Talman"
    ],
    "published": "2025-12-30T17:19:39Z",
    "updated": "2025-12-30T17:19:39Z",
    "categories": [
      "physics.acc-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.19290v2",
    "url": "https://arxiv.org/abs/2512.19290v2",
    "pdf_url": "https://arxiv.org/pdf/2512.19290v2.pdf",
    "title": "Optimal operating parameters for next-generation xenon gas time projection chambers",
    "abstract": "The next-generation of neutrinoless double beta decay ($0νββ$) searches are targeting half-life sensitivities towards 10$^{27}$--10$^{28}$ years. Gaseous xenon time projection chamber (GXeTPC) detectors are a technology that may be able to meet this challenge due to their excellent background rejection power, scalability, and energy resolution. This paper explores how the design choices of a next-generation GXeTPC time projection chamber can impact the overall performance of the experiment. We study the performance of systems using xenon enriched in the isotope $^{136}$Xe or natural xenon, focusing on scenarios that incorporate one tonne of source isotope. The detector size, copper shielding mass, energy resolution, pressure, and diffusion amount are surveyed to evaluate the overall performance dependencies on these parameters. A detector optimized for using enriched xenon is preferred, with a factor of 10 lower background rate, driven by the large intrinsic backgrounds introduced by the copper shielding used in the detector. The performance of three types of gas TPC technologies was also explored based on different gas additives used to reduce diffusion to different levels. For all TPC technologies, we find background rates of a fraction of a count per tonne year in the region of interest are achievable. These performances are contingent on suitable energy resolution and event position placement in the drift direction being achieved for the specific detector technology. When factoring in the considerations for the construction of the detector in addition to the selection performance, there is no clear optimum pressure, with advantages and disadvantages if a high or low pressure default configuration is chosen.",
    "authors": [
      "K. Mistry",
      "D. R. Nygren"
    ],
    "published": "2025-12-22T11:31:52Z",
    "updated": "2025-12-30T16:18:07Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.00705v3",
    "url": "https://arxiv.org/abs/2508.00705v3",
    "pdf_url": "https://arxiv.org/pdf/2508.00705v3.pdf",
    "title": "An Online Data Analysis Framework for Small-Scale Physics Experiments",
    "abstract": "A robust and flexible architecture capable of providing real-time analysis on diagnostic data is of crucial importance to physics experiments. In this paper, we present such an online framework, used in June 2025 as part of the HRMT-68 experiment, performed at the HiRadMat facility at CERN, using the Super Proton Synchrotron (SPS) beam line. HRMT-68 was a fixed-target laboratory astrophysics experiment aiming to identify plasma instabilities generated by a relativistic electron-positron beam during traversal of an argon plasma. This framework was essential for experimental data acquisition and analysis, and can be adapted for a broad range of experiments with a variety of experimental diagnostics. The framework's modular and customizable design enabled us to rapidly observe and extract emergent features from a diverse range of diagnostic data. Simultaneously, it allowed for both the introduction of new diagnostic devices and the modification of our analysis as features of interest were identified. As a result, we were able to effectively diagnose equipment malfunction, and infer the beam's response to varying bunch duration, beam intensity, and the plasma state without resorting to offline analysis, at which time adjustment or improvement would have been impossible. We present the features of this agile framework, whose codebase we have made publicly available, which can be adapted for future experiments with minimal modification.",
    "authors": [
      "Hayden Ramm",
      "Pascal Simon",
      "Paraskevi Alexaki",
      "Christopher Arran",
      "Robert Bingham",
      "Alice Goillot",
      "Jon Tomas Gudmundsson",
      "Jonathan Halliday",
      "Bryn Lloyd",
      "Eva Los",
      "Vasiliki Stergiou",
      "Sifei Zhang",
      "Gianluca Gregori",
      "Nikolaos Charitonidis"
    ],
    "published": "2025-08-01T15:20:24Z",
    "updated": "2025-12-30T16:07:07Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.24305v1",
    "url": "https://arxiv.org/abs/2512.24305v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24305v1.pdf",
    "title": "Coordinates based on a magnetic mirror field",
    "abstract": "We construct a coordinate system fitting the geometry of a given, cylindrically symmetric, magnetic field.",
    "authors": [
      "R. D. Hazeltine"
    ],
    "published": "2025-12-30T15:54:17Z",
    "updated": "2025-12-30T15:54:17Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.24290v1",
    "url": "https://arxiv.org/abs/2512.24290v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24290v1.pdf",
    "title": "Fast reconstruction-based ROI triggering via anomaly detection in the CYGNO optical TPC",
    "abstract": "Optical-readout Time Projection Chambers (TPCs) produce megapixel-scale images whose fine-grained topological information is essential for rare-event searches, but whose size challenges real-time data selection. We present an unsupervised, reconstruction-based anomaly-detection strategy for fast Region-of-Interest (ROI) extraction that operates directly on minimally processed camera frames. A convolutional autoencoder trained exclusively on pedestal images learns the detector noise morphology without labels, simulation, or fine-grained calibration. Applied to standard data-taking frames, localized reconstruction residuals identify particle-induced structures, from which compact ROIs are extracted via thresholding and spatial clustering. Using real data from the CYGNO optical TPC prototype, we compare two pedestal-trained autoencoder configurations that differ only in their training objective, enabling a controlled study of its impact. The best configuration retains (93.0 +/- 0.2)% of reconstructed signal intensity while discarding (97.8 +/- 0.1)% of the image area, with an inference time of approximately 25 ms per frame on a consumer GPU. The results demonstrate that careful design of the training objective is critical for effective reconstruction-based anomaly detection and that pedestal-trained autoencoders provide a transparent and detector-agnostic baseline for online data reduction in optical TPCs.",
    "authors": [
      "F. D. Amaro",
      "R. Antonietti",
      "E. Baracchini",
      "L. Benussi",
      "C. Capoccia",
      "M. Caponero",
      "L. G. M. de Carvalho",
      "G. Cavoto",
      "I. A. Costa",
      "A. Croce",
      "M. D'Astolfo",
      "G. D'Imperio",
      "G. Dho",
      "E. Di Marco",
      "J. M. F. dos Santos",
      "D. Fiorina",
      "F. Iacoangeli",
      "Z. Islam",
      "E. Kemp",
      "H. P. Lima",
      "G. Maccarrone",
      "R. D. P. Mano",
      "D. J. G. Marques",
      "G. Mazzitelli",
      "P. Meloni",
      "A. Messina",
      "V. Monno",
      "C. M. B. Monteiro",
      "R. A. Nobrega",
      "G. M. Oppedisano",
      "I. F. Pains",
      "E. Paoletti",
      "F. Petrucci",
      "S. Piacentini",
      "D. Pierluigi",
      "D. Pinci",
      "F. Renga",
      "A. Russo",
      "G. Saviano",
      "P. A. O. C. Silva",
      "N. J. Spooner",
      "R. Tesauro",
      "S. Tomassini",
      "D. Tozzi"
    ],
    "published": "2025-12-30T15:28:18Z",
    "updated": "2025-12-30T15:28:18Z",
    "categories": [
      "physics.ins-det",
      "cs.LG",
      "physics.data-an"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.24254v1",
    "url": "https://arxiv.org/abs/2512.24254v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24254v1.pdf",
    "title": "GPT-like transformer model for silicon tracking detector simulation",
    "abstract": "Simulating physics processes and detector responses is essential in high energy physics and represents significant computing costs. Generative machine learning has been demonstrated to be potentially powerful in accelerating simulations, outperforming traditional fast simulation methods. The efforts have focused primarily on calorimeters. This work presents the very first studies on using neural networks for silicon tracking detectors simulation. The GPT-like transformer architecture is determined to be optimal for this task and applied in a fully generative way, ensuring full correlations between individual hits. Taking parallels from text generation, hits are represented as a flat sequence of feature values. The resulting tracking performance, evaluated on the Open Data Detector, is comparable with the full simulation.",
    "authors": [
      "Tadej Novak",
      "Borut Paul Kerševan"
    ],
    "published": "2025-12-30T14:28:14Z",
    "updated": "2025-12-30T14:28:14Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.24209v1",
    "url": "https://arxiv.org/abs/2512.24209v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24209v1.pdf",
    "title": "Performance of an LYSO-Based Active Converter for a Photon Pair-Spectrometer aiming for 52.8 MeV photon detection in Future $μ^+ \\to e^+ γ$ Search Experiments",
    "abstract": "For future $μ^+ \\to e^+ γ$ search experiments with a branching-ratio sensitivity of $10^{-15}$, we are developing a photon pair-spectrometer employing an active LYSO converter, aiming at target resolutions of 30 ps in timing and 200 keV in energy measurement for detecting 52.8 MeV photons. The converter generates electron-positron pairs from incident photons while simultaneously measuring their energy deposition and timing. On the basis of simulation studies, we optimized the converter thickness and segment dimensions, and accordingly fabricated prototype LYSO segments. Their single-MIP detection performance was evaluated using an electron beam at the KEK PF-AR test beamline. The prototypes exhibited excellent performance, achieving a time resolution of 25 ps and a light yield of $10^4$ photoelectrons, both substantially surpassing the design requirements.",
    "authors": [
      "Sei Ban",
      "Lukas Gerritzen",
      "Fumihito Ikeda",
      "Toshiyuki Iwamoto",
      "Wataru Ootani",
      "Atsushi Oya",
      "Rei Sakakibara",
      "Rintaro Yokota"
    ],
    "published": "2025-12-30T13:22:15Z",
    "updated": "2025-12-30T13:22:15Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.24191v1",
    "url": "https://arxiv.org/abs/2512.24191v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24191v1.pdf",
    "title": "Soft x-rays with Orbital Angular Momentum for resonant scattering experiments at the SOLEIL synchrotron",
    "abstract": "The paper presents a comprehensive description of a new setup implemented and commissioned at the SEXTANTS beamline of the SOLEIL synchrotron for absorption and scattering experiments with x-ray beams carrying an orbital angular momentum, also known as twisted x-ray beams. Two alternative methods have been implemented, based on the use of either spiral zone plates or fork gratings devices, and we show how they can be used for both defining and assessing the orbital angular momentum of an x-ray beam. We show also how multiple devices can be used in sequence to define an integer arithmetic of the orbital angular momentum of the final x-ray beam. Finally, we report the results of the first resonant scattering pilot experiments in transmission and reflection mode, intended to assess the feasibility of future users measurements. The availability of twisted soft x-rays complements the range of experimental techniques in elastic, resonant and coherent scattering available at the SEXTANTS beamline of the SOLEIL synchrotron.",
    "authors": [
      "Pietro Carrara",
      "Franck Fortuna",
      "Renaud Delaunay",
      "Joan Vila-Comamala",
      "Benedikt Rösner",
      "Christian David",
      "Stefania Pizzini",
      "Clément Fourniols",
      "Laurent Vila",
      "Matteo Pancaldi",
      "Carlo Spezzani",
      "Flavio Capotondi",
      "Pierre Nonnon",
      "Mauro Fanciulli",
      "Thierry Ruchon",
      "Nicolas Jaouen",
      "Horia Popescu",
      "Maurizio Sacchi"
    ],
    "published": "2025-12-30T12:48:45Z",
    "updated": "2025-12-30T12:48:45Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.acc-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2512.24054v1",
    "url": "https://arxiv.org/abs/2512.24054v1",
    "pdf_url": "https://arxiv.org/pdf/2512.24054v1.pdf",
    "title": "The role of particle feedback on particle acceleration in magnetic reconnection",
    "abstract": "Magnetic reconnection is a ubiquitous process in astrophysical plasmas and an efficient mechanism for particle acceleration. Using 2.5D magnetohydrodynamic (MHD) simulations with a co-evolving fluid-particle framework, we investigate how particle feedback affects reconnection and acceleration. Our simulations demonstrate that particle feedback to the fluid amplifies shear flows within magnetic islands, which strengthens the convective electric field and thereby boosts particle acceleration. This mechanism results in a higher maximum particle energy and a harder non-thermal energy spectrum. The guide field suppresses both the increase in gas internal energy and particle acceleration. These findings highlight the complex interplay between feedback, guide fields, and reconnection dynamics.",
    "authors": [
      "Shimin Liang",
      "Nianyu Yi"
    ],
    "published": "2025-12-30T07:55:01Z",
    "updated": "2025-12-30T07:55:01Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.23974v1",
    "url": "https://arxiv.org/abs/2512.23974v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23974v1.pdf",
    "title": "Design, construction, and testing of the PandaX-xT cryogenics system",
    "abstract": "The PandaX-xT is a next-generation experiment with broad scientific goals, including the search for dark matter, Neutrinoless Double Beta Decay, and astrophysical neutrinos, using a dual-phase time projection chamber with about 43 tons of liquid xenon. A new cryogenics system of the PandaX-xT is described in this paper. It is developed to handle large mass of liquid xenon efficiently and safely, including two cooling towers for normal operation and one liquid-nitrogen coil for emergency case. Each cooling tower equipped with an AL600 Gifford-McMahon cryocooler features a 1300 W heater, specifically designed to maintain the cold finger's temperature at the desired setpoint. The performance of the cooling tower and the coil has been tested. The cryogenics system with two cooling towers has achieved about 1900~W cooling power at 178~K. The liquid nitrogen coil provides emergency cooling power of more than 1500~W at liquid xenon temperature. For the prototype of a 1-tonne liquid xenon detector, the fluctuation of xenon saturated vapor pressure remains below 1 kPa over one month, while the pressure is around 210~kPa.",
    "authors": [
      "Xu Wang",
      "Li Zhao",
      "Xiang Xiao",
      "Xiangyi Cui",
      "Shuaijie Li",
      "Jianglai Liu"
    ],
    "published": "2025-12-30T04:07:26Z",
    "updated": "2025-12-30T04:07:26Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.22446v2",
    "url": "https://arxiv.org/abs/2512.22446v2",
    "pdf_url": "https://arxiv.org/pdf/2512.22446v2.pdf",
    "title": "Electrode Geometry Optimization in Vortex-Type Seawater Magnetohydrodynamic Generators",
    "abstract": "Magnetohydrodynamics (MHD) generators present a promising pathway for clean energy conversion by directly transforming conductive fluids' kinetic energy into electricity. This study investigates the impact of electrode geometry modifications on the performance of a vortex-type seawater MHD generator. Three electrode designs, partial, whole-area, and spiral, are analyzed through combined analytical and numerical simulations using COMSOL Multiphysics. The study focuses on internal resistance reduction, current density distribution, and overall power output. The results indicate that electrode area and spacing are critical determinants of performance. The whole-area electrode achieves the highest output, with a 155 percent increase in power compared to the baseline partial electrode. The spiral electrode demonstrates reduced internal resistance and improved current flow but exhibits lower open-circuit voltage due to reduced electrode spacing. The simulations show strong agreement with theoretical models, with deviations of less than 4 percent in open-circuit voltage predictions. These findings highlight the importance of geometric optimization for advancing seawater-based MHD generators as sustainable and efficient energy conversion systems.",
    "authors": [
      "Arleen Natalie",
      "Budiarso",
      "Ridho Irwansyah"
    ],
    "published": "2025-12-27T03:07:35Z",
    "updated": "2025-12-30T03:44:29Z",
    "categories": [
      "physics.flu-dyn",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.flu-dyn"
  },
  {
    "arxiv_id": "2512.23072v2",
    "url": "https://arxiv.org/abs/2512.23072v2",
    "pdf_url": "https://arxiv.org/pdf/2512.23072v2.pdf",
    "title": "Thermodynamically Consistent Vibrational-Electron Heating: Generalized Model for Multi-Quantum Transitions",
    "abstract": "Accurate prediction of electron temperature ($T_{\\rm e}$) is critical for non-equilibrium plasma applications ranging from hypersonic flight to plasma-assisted combustion. We recently proposed a thermodynamically consistent model for vibrational-electron heating [Phys. Fluids 37, 096141 (2025)] that enforces the convergence of $T_{\\rm e}$ to the vibrational temperature ($T_{\\rm v}$) at equilibrium. However, the original derivation was restricted to single-quantum transitions, limiting its validity to low-temperature regimes ($T_{\\rm e} \\lesssim 1.5$ eV). In this Letter, we generalize the model to include multi-quantum overtone transitions, extending its applicability to high-energy regimes. We demonstrate that previous models neglecting hot-band transitions incur a systematic heating error of $\\exp(-θ_{\\rm v}/T_{\\rm v})$, where $θ_{\\rm v}$ is the characteristic vibrational temperature. This error exceeds 40\\% when $T_{\\rm v}$ is greater than $θ_{\\rm v}$, effectively preventing thermal relaxation. To correct this, we derive a formulation where the total heating rate is a summation of channel-specific cooling rates $Q_{\\rm e-v}^{(m)}$, each associated with a quantum jump $m$, scaled by a thermodynamic factor $\\exp(mθ_{\\rm v}/T_{\\rm e}-mθ_{\\rm v}/T_{\\rm v})$. This generalized model preserves thermodynamic consistency by ensuring zero net energy transfer at equilibrium.",
    "authors": [
      "Bernard Parent",
      "Felipe Martin Rodriguez Fuentes"
    ],
    "published": "2025-12-28T20:34:04Z",
    "updated": "2025-12-30T02:53:17Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.23885v1",
    "url": "https://arxiv.org/abs/2512.23885v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23885v1.pdf",
    "title": "Control and read-out of the HEPD-02 tracking system onboard CSES-02 satellite",
    "abstract": "The High Energy Particle Detector (HEPD-02) is a payload of the second China Seismo-Electromagnetic Satellite (CSES-02), designed and built by the Italian Limadou collaboration. Its purpose is to detect cosmic rays and trapped particles of radiation belts, in the kinetic energy range 3-100 MeV for electrons, 30-200 MeV for protons. HEPD-02 is the first space detector to use a tracking detector based on Monolithic Active Pixel Sensors (MAPS). The MAPS provides high spatial resolution, low noise, increased robustness, and low production costs. Operating MAPS in space presents a significant challenge due to strict power consumption requirements. To meet such constraints, a custom Tracker Data Acquisition (TDAQ) board and firmware have been designed and implemented, by using a commercial low-power Field Programmable Gate Array (FPGA). This paper addresses the design features of the TDAQ unit, enabling the tracking detector to be operated efficiently, with particular focus on the power consumption performance.",
    "authors": [
      "S. Bartocci",
      "R. Battiston",
      "S. Beolè",
      "F. Benotto",
      "P. Cipollone",
      "S. Coli",
      "A. Contin",
      "M. Cristoforetti",
      "C. De Donato",
      "C. De Santis",
      "A. Di Luca",
      "F. Dumitrache",
      "F. M. Follega",
      "S. Garrafa Botta",
      "G. Gebbia",
      "R. Iuppa",
      "A. Lega",
      "M. Lolli",
      "G. Masciantonio",
      "M. Mergè",
      "M. Mese",
      "R. Nicolaidis",
      "F. Nozzoli",
      "A. Oliva",
      "G. Osteria",
      "F. Palma",
      "F. Palmonari",
      "B. Panico",
      "S. Perciballi",
      "F. Perfetto",
      "P. Picozza",
      "M. Pozzato",
      "E. Ricci",
      "M. Ricci",
      "S. B. Ricciarini",
      "Z. Sahnoun",
      "U. Savino",
      "V. Scotti",
      "E. Serra",
      "A. Sotgiu",
      "R. Sparvoli",
      "P. Ubertini",
      "V. Vilona",
      "S. Zoffoli",
      "P. Zuccon"
    ],
    "published": "2025-12-29T22:22:39Z",
    "updated": "2025-12-29T22:22:39Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.23884v1",
    "url": "https://arxiv.org/abs/2512.23884v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23884v1.pdf",
    "title": "Autoregressive long-horizon prediction of plasma edge dynamics",
    "abstract": "Accurate modeling of scrape-off layer (SOL) and divertor-edge dynamics is vital for designing plasma-facing components in fusion devices. High-fidelity edge fluid/neutral codes such as SOLPS-ITER capture SOL physics with high accuracy, but their computational cost limits broad parameter scans and long transient studies. We present transformer-based, autoregressive surrogates for efficient prediction of 2D, time-dependent plasma edge state fields. Trained on SOLPS-ITER spatiotemporal data, the surrogates forecast electron temperature, electron density, and radiated power over extended horizons. We evaluate model variants trained with increasing autoregressive horizons (1-100 steps) on short- and long-horizon prediction tasks. Longer-horizon training systematically improves rollout stability and mitigates error accumulation, enabling stable predictions over hundreds to thousands of steps and reproducing key dynamical features such as the motion of high-radiation regions. Measured end-to-end wall-clock times show the surrogate is orders of magnitude faster than SOLPS-ITER, enabling rapid parameter exploration. Prediction accuracy degrades when the surrogate enters physical regimes not represented in the training dataset, motivating future work on data enrichment and physics-informed constraints. Overall, this approach provides a fast, accurate surrogate for computationally intensive plasma edge simulations, supporting rapid scenario exploration, control-oriented studies, and progress toward real-time applications in fusion devices.",
    "authors": [
      "Hunor Csala",
      "Sebastian De Pascuale",
      "Paul Laiu",
      "Jeremy Lore",
      "Jae-Sun Park",
      "Pei Zhang"
    ],
    "published": "2025-12-29T22:19:27Z",
    "updated": "2025-12-29T22:19:27Z",
    "categories": [
      "physics.plasm-ph",
      "cs.AI"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "1512.08282v3",
    "url": "https://arxiv.org/abs/1512.08282v3",
    "pdf_url": "https://arxiv.org/pdf/1512.08282v3.pdf",
    "title": "Positron Bunch Radiation in the System of Tightly Packed Nanotubes",
    "abstract": "Radiation emitted by a bunch of positrons channeled in nanotubes at zero emission angle is studied taking into account medium polarization. The formation of radiation is characterized by an energy threshold that depends on the oscillation amplitude of each positron. When the bunch energy reaches the maximum value of the threshold energy, radiation is produced by all positrons in the bunch. The nanotube potential barrier is described using a harmonic model. The spectral line shape of the radiation from the positron bunch, the fundamental radiation frequency, and the number of emitted photons are determined. It is shown that a system of tightly packed carbon nanotubes can generate an intense, quasi-monochromatic, and directed beam of circularly polarized soft X-ray photons with an energy of about $3$~\\SI{}{\\kilo\\electronvolt} (wavelength $4.1$~\\SI{}{\\angstrom}).",
    "authors": [
      "Hayk L. Gevorgyan",
      "Koryun L. Gevorgyan",
      "Lekdar A. Gevorgian"
    ],
    "published": "2015-12-27T21:54:18Z",
    "updated": "2025-12-29T19:22:19Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.23682v1",
    "url": "https://arxiv.org/abs/2512.23682v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23682v1.pdf",
    "title": "Predicting core transport in ITER baseline discharges with neon injections",
    "abstract": "Achieving self-consistent performance predictions for ITER requires integrated modeling of core transport and divertor power exhaust under realistic impurity conditions. We present results from the first systematic power-flow and impurity-content study for the ITER 15 MA baseline scenario constrained directly by existing SOLPS-ITER neon-seeded divertor solutions. Using the OMFIT STEP workflow, stationary temperature and density profiles are predicted with TGYRO for $1.5 \\le Z_{\\rm eff} \\le 2.5$, and the corresponding power crossing the separatrix $P_{\\rm sep}$ is evaluated. We find that $P_{\\rm sep}$ varies by more than a factor of 1.7 across this scan and matches the $\\sim 100$~MW SOLPS-ITER prediction when $Z_{\\rm eff} \\simeq 1.6$ or when auxiliary heating is reduced to $\\sim 75\\%$ of nominal. Rotation-sensitivity studies show that plausible variations in toroidal flow magnitude modify $P_{\\rm sep}$ by $\\lesssim 20\\%$, while AURORA modeling confirms that charge-exchange radiation inside the separatrix is dynamically negligible under predicted ITER neutral densities. These results identify a restricted compatibility window, $Z_{\\rm eff} \\approx 1.6$--1.75 and $0.75 \\lesssim f_{P_{\\rm aux}} \\le 1.0$, in which core transport predictions remain aligned with neon-seeded divertor protection targets. This self-consistent, model-constrained framework provides actionable guidance for impurity control and auxiliary-heating scheduling in early ITER operation and supports future whole-device scenario optimization.",
    "authors": [
      "Dmitri M Orlov",
      "Joseph McClenaghan",
      "Jeff Candy",
      "Jeremy D Lore",
      "Nathan T Howard",
      "Francesco Sciortino",
      "Christopher Holland"
    ],
    "published": "2025-12-29T18:40:00Z",
    "updated": "2025-12-29T18:40:00Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.23612v1",
    "url": "https://arxiv.org/abs/2512.23612v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23612v1.pdf",
    "title": "High-resolution 3D-printed plastic scintillators with tertiary dye",
    "abstract": "Additive manufacturing offers efficient production of plastic scintillators with nontrivial geometries using vat polymerization, allowing fabrication of geometries which would be difficult or even impossible to produce using conventional subtractive manufacturing. This work presents a novel photocurable scintillator formula that includes coumarin 450 as a tertiary dye to enable high-resolution 3D printing via the manipulation of the 405 nm cure light. Bulk photocured and 3D printed (with and without tertiary dye) samples were compared through observational assessment and spectral response. All samples showed pulse shape discrimination between neutron and gamma events. Inclusion of the tertiary dye has minimal impact on emission spectrum and light output, but significant impact on print resolution as shown by comparison of printed high-complexity geometries and feature resolution test objects. With the use of a cure-limiting dye, unsupported features, such as freestanding pillars, were resolvable down to 0.7 mm. Even finer resolution at or below 0.1 mm was achieved in fully supported, integrated structures printed with off-the-shelf 405 nm desktop 3D printer. Scintillators demonstrated a light output up to 50% of EJ-200 with a PSD figure of merit up to 1.35 at 0.9-1.1 MeVee.",
    "authors": [
      "Chandler Moore",
      "Michael Febbraro",
      "Juan Manfredi",
      "Allen Wood",
      "Daniel Rutstrom",
      "Thomas Ruland",
      "Brennan Hackett",
      "Paul Hausladen"
    ],
    "published": "2025-12-29T17:13:25Z",
    "updated": "2025-12-29T17:13:25Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex",
      "physics.app-ph"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/10/P10043"
  },
  {
    "arxiv_id": "2512.23556v1",
    "url": "https://arxiv.org/abs/2512.23556v1",
    "pdf_url": "https://arxiv.org/pdf/2512.23556v1.pdf",
    "title": "The new generation lunar gravitational wave detectors: sky map resolution and joint analysis",
    "abstract": "Lunar-based gravitational-wave interferometry is a fascinating endeavor, and was proposed as a promising approach to bridge the observational gap between space-borne and ground-based detectors. In this work, we adopt the Fisher-matrix method to examine the angular-resolution performance of the newly proposed Crater Interferometry Gravitational-wave Observatory (CIGO) on the lunar crater rim near the north pole, together with TianQin and LISA, for monochromatic sources in the 0.1-10 Hz band. We find that above 0.1 Hz, CIGO achieves better localization accuracy than the other two space-based missions and dominates the combined detector network's performance, provided that lunar noise mitigation is achieved in the 0.1-2.87 Hz frequency range. We further explore an upgraded Tetrahedron configuration, TCIGO, with a fourth station at the bottom of a crater, which forms a regular tetrahedral constellation on the lunar surface. The result shows that TCIGO yields a five-fold improvement in angular-resolution capability over CIGO and gets better sky coverage across the target frequency band.",
    "authors": [
      "Xiaolin Zhang",
      "Chengye Yu",
      "Haoran Li",
      "Sobhan Kazempour",
      "Mingqiu Li",
      "Sichun Sun"
    ],
    "published": "2025-12-29T15:52:13Z",
    "updated": "2025-12-29T15:52:13Z",
    "categories": [
      "gr-qc",
      "astro-ph.IM",
      "hep-ph",
      "physics.ins-det"
    ],
    "primary_category": "gr-qc"
  }
]