{
  "arxiv_id": "2303.18100v2",
  "url": "https://arxiv.org/abs/2303.18100v2",
  "pdf_url": "https://arxiv.org/pdf/2303.18100v2.pdf",
  "title": "Asymmetric Electrostatic Dodecapole: Compact Bandpass Filter with Low Aberrations for Momentum Microscopy",
  "abstract": "Imaging energy filters in photoelectron microscopes and momentum microscopes use spherical fields with deflection angles of 90°, 180°, and even 2 x 180°. These instruments are optimized for high energy resolution, but exhibit image aberrations when operated in high transmission mode at medium energy resolution. Here we present a new approach for bandpass-filtered imaging in real or reciprocal space using an electrostatic dodecapole with an asymmetric electrode array. In addition to energy-dispersive beam deflection, this multipole allows aberration correction up to the 3rd order. Here we describe its use as a bandpass prefilter in a time-of-flight momentum microscope at the hard X-ray beamline P22 of PETRA III. The entire instrument is housed in a straight vacuum tube because the deflection angle is only 4° and the beam displacement in the filter is only 8 mm. The multipole is framed by transfer lenses in the entrance and exit branches. Two sets of 16 different sized entrance and exit apertures on piezomotor driven mounts allow selection of the desired bandpass. For pass energies between 100 and 1400 eV and slit widths between 0.5 and 4 mm the transmitted kinetic energy intervals are between 10 eV and a few hundred eV (FWHM). The filter eliminates all higher or lower energy signals outside the selected bandpass, significantly improving the signal-to-background ratio in the ToF analyzer.",
  "authors": [
    "O. Tkach",
    "S. Babenkov",
    "Y. Lytvynenko",
    "O. Fedchenko",
    "K. Medjanik",
    "D. Vasilyev",
    "H. -J. Elmers",
    "G. Schönhense"
  ],
  "published": "2023-03-31T14:44:15Z",
  "updated": "2026-01-15T09:25:30Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.1107/S1600577524003540"
}