{
  "arxiv_id": "2601.08910v1",
  "url": "https://arxiv.org/abs/2601.08910v1",
  "pdf_url": "https://arxiv.org/pdf/2601.08910v1.pdf",
  "title": "Towards a Self-Driving Trigger at the LHC: Adaptive Response in Real Time",
  "abstract": "Real-time data filtering and selection -- or trigger -- systems at high-throughput scientific facilities such as the experiments at the Large Hadron Collider (LHC) must process extremely high-rate data streams under stringent bandwidth, latency, and storage constraints. Yet these systems are typically designed as static, hand-tuned menus of selection criteria grounded in prior knowledge and simulation. In this work, we further explore the concept of a self-driving trigger, an autonomous data-filtering framework that reallocates resources and adjusts thresholds dynamically in real-time to optimize signal efficiency, rate stability, and computational cost as instrumentation and environmental conditions evolve. We introduce a benchmark ecosystem to emulate realistic collider scenarios and demonstrate real-time optimization of a menu including canonical energy sum triggers as well as modern anomaly-detection algorithms that target non-standard event topologies using machine learning. Using simulated data streams and publicly available collision data from the Compact Muon Solenoid (CMS) experiment, we demonstrate the capability to dynamically and automatically optimize trigger performance under specific cost objectives without manual retuning. Our adaptive strategy shifts trigger design from static menus with heuristic tuning to intelligent, automated, data-driven control, unlocking greater flexibility and discovery potential in future high-energy physics analyses.",
  "authors": [
    "Shaghayegh Emami",
    "Cecilia Tosciri",
    "Giovanna Salvi",
    "Zixin Ding",
    "Yuxin Chen",
    "Abhijith Gandrakota",
    "Christian Herwig",
    "David W. Miller",
    "Jennifer Ngadiuba",
    "Nhan Tran"
  ],
  "published": "2026-01-13T19:00:02Z",
  "updated": "2026-01-13T19:00:02Z",
  "categories": [
    "physics.ins-det",
    "cs.AI",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}