{
  "arxiv_id": "2601.10139v1",
  "url": "https://arxiv.org/abs/2601.10139v1",
  "pdf_url": "https://arxiv.org/pdf/2601.10139v1.pdf",
  "title": "Effect of hole pitch reduction on electron transport and diffusion: A comparative simulation study of Triple GEM detectors",
  "abstract": "Advances in fabrication techniques and high-performance electronics have facilitated the development of fine-pitch Gas Electron Multipliers (GEMs). Earlier experimental and simulation findings suggest that these reduced-pitch GEMs can outperform the standard configuration in terms of effective gain, collection efficiency, and position resolution. However, a noticeable fraction of avalanche electrons is lost within the GEM systems, resulting in a degradation of charge collection efficiency. Therefore, a comprehensive simulation-based study is essential to provide deeper insights into the extent of degradation and its contributing factors. In this context, we employ ANSYS and Garfield++ to model the Triple GEM detectors with reduced pitch sizes of 90 and 60 $μ$m, and perform a comparative performance analysis with the standard configuration (pitch size: 140 $μ$m). At first, the simulation framework is validated by comparing the results of the standard configuration with available experimental data and previously reported simulation outcomes. Despite the characteristic gain offset, the framework remains physically consistent and reliable in capturing microscopic avalanche dynamics, reproducing the experimental trend. Following validation, we investigate electron losses at the metal electrodes and within the Kapton holes, electron transmission through the transfer and induction regions, electron diffusion on the induction electrode, and the overall collection efficiency. These parameters are analyzed as functions of GEM potential, outer hole diameter, inner hole diameter, Kapton thickness, metal thickness, and gas composition, thereby offering insights for designing efficient GEM detectors.",
  "authors": [
    "Rajiv Gupta",
    "Sunidhi Saxena",
    "Ajay Kumar"
  ],
  "published": "2026-01-15T07:30:08Z",
  "updated": "2026-01-15T07:30:08Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}