{
  "arxiv_id": "2601.08830v1",
  "url": "https://arxiv.org/abs/2601.08830v1",
  "pdf_url": "https://arxiv.org/pdf/2601.08830v1.pdf",
  "title": "Forbidden second harmonics in centrosymmetric bilayer crystals",
  "abstract": "Optical spectroscopy based on second-order nonlinearity is a critical technique for characterizing two-dimensional (2D) crystals as well as bioimaging and quantum optics. It is generally believed that second-harmonic generation (SHG) in centrosymmetric crystals, such as graphene and other bilayer 2D crystals, is negligible without externally breaking the inversion symmetry. Here, we show that with a new homodyne detection technique, we can apparently circumvent this symmetry-imposed constraint and observe robust SHG in pristine centrosymmetric crystals, without any symmetry-breaking field. With its exceptional sensitivity, we resolve polarization-resolved SHG in bilayer hexagonal boron nitride (h-BN), bilayer 2H-WSe$_2$, and remarkably, Bernal-stacked bilayer graphene, allowing us to unambiguously identify the crystallographic orientation in these crystals via SHG for the first time. We also demonstrate that the new technique can be used to non-invasively detect uniaxial strain and optical geometric phase in these crystals. The observed SHG in our experiments is attributed to second-order nonlinearity in the quadrupole channel, which is controlled by the presence of the $C_2$ symmetry instead of the inversion symmetry. Our new technique expands the capability of nonlinear optical spectroscopy to encompass a large class of centrosymmetric materials that could never be measured before, and can be used for quantum sensing of moiré materials and twisted epitaxial films.",
  "authors": [
    "Haoning Tang",
    "Zhitong Ding",
    "Tianyi Ruan",
    "Zeyu Hao",
    "Kenji Watanabe",
    "Takashi Taniguchi",
    "Haozhe Wang",
    "Ali Javey",
    "Feng Wang",
    "Yuan Cao"
  ],
  "published": "2026-01-13T18:59:53Z",
  "updated": "2026-01-13T18:59:53Z",
  "categories": [
    "cond-mat.mes-hall",
    "cond-mat.mtrl-sci",
    "physics.ins-det",
    "physics.optics"
  ],
  "primary_category": "cond-mat.mes-hall"
}