[
  {
    "arxiv_id": "2601.10694v1",
    "url": "https://arxiv.org/abs/2601.10694v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10694v1.pdf",
    "title": "Increasing the opening speed of the plasma opening switch on an direct action accelerator with an inductive energy storage device",
    "abstract": "To increase the voltage multiplication factor in a small-sized direct-acting electron accelerator DIN-2K with an inductive energy storage and a plasma opening switch, it is necessary to ensure an increase in the rate of change of the current and its amplitude during the POS opening for the purpose of obtaining an explosive electron emission with the formation of an electron beam and a virtual cathode. However, the opening process depends on many electrical parameters of the plant, and it re-quires determining their joint and individual effect on its dynamics. The purpose of this research is to study and determine the effects of electrical parameters, including those of the discharge voltages of the entire electrical circuit of the accelerator on the dynamics of the plasma opening switch, in particular opening speed, current amplitudes, and opening time, as well as to give recommendations on optimizing the operation of accelerators of this type and highlight possible ways to increase the voltage multiplication factor. Methodology. A method for determining the induced voltage according to experimental current oscillograms has been proposed. The methodology was verified by the coincidence of its data with the results of measurements by a capacitive voltage divider with the data spread of less than 20%. Scientific novelty. The rates of change in the current at the plasma switch opening stage were determined depending on the main electrical parameters of the DIN-2K accelerator. The diagnostics of the voltage induced during the POS opening were provided using no capacitive voltage divider in the internal volume of the accelerator, which enabled the removal of some diagnostic tools from the working volume of the chamber. Practical significance.",
    "authors": [
      "D. V. Vinnikov",
      "O. M. Ozerov",
      "V. V. Katrechko",
      "V. I. Tkachov",
      "O. V. Manuilenko",
      "I. N. Onishchenko"
    ],
    "published": "2026-01-15T18:52:26Z",
    "updated": "2026-01-15T18:52:26Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.10571v1",
    "url": "https://arxiv.org/abs/2601.10571v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10571v1.pdf",
    "title": "Corrections for systematic errors in slit-profiler transverse phase space measurements",
    "abstract": "In photo injectors, the transverse emittance is one of the key measures of beam quality as it defines the possible performance of the whole facility. As such it is important to measure the emittance in photo injectors and ensure the accuracy of these measurements. While there are many different methods of measuring the emittance, this paper focuses on quantifying the systematic errors present in transverse phase space measurements taken with slit-profiler methods, i.e. scanning a narrow slit over the beam and continually measuring the passed beamlets' divergence with a downstream profiler. The measurement errors include effects of the slit size, beamlet imaging, and residual space charge. While these effects are generally small, they can have significant impact on the measured emittance when the 2D phase space is strongly coupled. The systematic effects studied and corrections are demonstrated with simulations and measurements from the Photo Injector Test facility at DESY in Zeuthen (PITZ) using a slit-screen emittance scanner.",
    "authors": [
      "C. Richard",
      "M. Krasilnikov",
      "N. Aftab",
      "Z. Amirkhanyan",
      "D. Dmytriiev",
      "A. Hoffmann",
      "M. Gross",
      "X. -K. Li",
      "Z. Lotfi",
      "F. Stephan",
      "G. Vashchenko",
      "S. Zeeshan"
    ],
    "published": "2026-01-15T16:37:09Z",
    "updated": "2026-01-15T16:37:09Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.10570v1",
    "url": "https://arxiv.org/abs/2601.10570v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10570v1.pdf",
    "title": "Canonical Vorticity Perspective on Magnetogenesis: Unifying Weibel, Biermann, and Beyond",
    "abstract": "We briefly review the current status of magnetogenesis, a cross-disciplinary field that bridges cosmology and plasma physics, studying the origin of magnetic fields in the universe. We formulate a canonical vorticity framework to investigate kinetic plasma physics-based magnetogenesis processes in a collisionless plasma. By considering canonical vorticity, a weighted sum of the fluid vorticity and the magnetic field as the canonical variable, this framework unifies several magnetogenesis processes, including the Biermann battery, the Weibel instability, and predicts several new pressure tensorial configurations as the fundamental source of self-generated magnetic field and vorticity in plasma. The framework is further extended to relativistic regime where an additional source of canonical vorticity, termed as kineclinicity effect, is identified. The theoretical predictions are systematically validated using particle-in-cell simulations, highlighting their implications for laboratory and astrophysical plasma environments.",
    "authors": [
      "Modhuchandra Laishram",
      "Young Dae Yoon"
    ],
    "published": "2026-01-15T16:34:10Z",
    "updated": "2026-01-15T16:34:10Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2501.04619v2",
    "url": "https://arxiv.org/abs/2501.04619v2",
    "pdf_url": "https://arxiv.org/pdf/2501.04619v2.pdf",
    "title": "Fast physics-based launcher optimization for electron cyclotron current drive",
    "abstract": "With the increased urgency to design fusion pilot plants, fast optimization of electron cyclotron current drive (ECCD) launchers is paramount. Traditionally, this is done by coarsely sampling the 4-D parameter space of possible launch conditions consisting of (1) the launch location (constrained to lie along the reactor vessel), (2) the launch frequency, (3) the toroidal launch angle, and (4) the poloidal launch angle. For each initial condition, a ray-tracing simulation is performed to evaluate the ECCD efficiency. Unfortunately, this approach often requires a large number of simulations (sometimes millions in extreme cases) to build up a dataset that adequately covers the plasma volume, which must then be repeated every time the design point changes. Here we adopt a different approach. Rather than launching rays from the plasma periphery and hoping for the best, we instead directly reconstruct the optimal ray for driving current at a given flux surface using a reduced physics model coupled with a commercial ray-tracing code. Repeating this throughout the plasma volume requires only hundreds of simulations, constituting a significant speedup. The new method is validated on two separate example tokamak profiles, and is shown to reliably drive localized current at the specified flux surface with the same optimal efficiency as obtained from the traditional approach.",
    "authors": [
      "N A Lopez",
      "A Alieva",
      "S A M McNamara",
      "X Zhang"
    ],
    "published": "2025-01-08T17:03:08Z",
    "updated": "2026-01-15T16:26:44Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1088/1361-6587/adcae7"
  },
  {
    "arxiv_id": "2406.10979v2",
    "url": "https://arxiv.org/abs/2406.10979v2",
    "pdf_url": "https://arxiv.org/pdf/2406.10979v2.pdf",
    "title": "Collisional whistler instability and electron temperature staircase in inhomogeneous plasma",
    "abstract": "High-beta magnetized plasmas often exhibit anomalously structured temperature profiles, as seen from galaxy cluster observations and recent experiments. It is well known that when such plasmas are collisionless, temperature gradients along the magnetic field can excite whistler waves that efficiently scatter electrons to limit their heat transport. Only recently has it been shown that parallel temperature gradients can excite whistler waves also in collisional plasmas. Here we develop a Wigner--Moyal theory for the collisional whistler instability starting from Braginskii-like fluid equations in a slab geometry. This formalism is necessary because, for a large region in parameter space, the fastest-growing whistler waves have wavelengths comparable to the background temperature gradients. We find additional damping terms in the expression for the instability growth rate involving inhomogeneous Nernst advection and resistivity. They (i) enable whistler waves to re-arrange the electron temperature profile via growth, propagation, and subsequent dissipation, and (ii) allow non-constant temperature profiles to exist stably. For high-beta plasmas, the marginally stable solutions take the form of a temperature staircase along the magnetic field lines. The electron heat flux can also be suppressed by the Ettingshausen effect when the whistler intensity profile is sufficiently peaked and oriented opposite the background temperature gradient. This mechanism allows cold fronts without magnetic draping, might reduce parallel heat losses in inertial fusion experiments, and generally demonstrates that whistler waves can regulate transport even in the collisional limit.",
    "authors": [
      "N. A. Lopez",
      "A. F. A. Bott",
      "A. A. Schekochihin"
    ],
    "published": "2024-06-16T15:30:15Z",
    "updated": "2026-01-15T16:19:52Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1017/S0022377825000078"
  },
  {
    "arxiv_id": "2601.10509v1",
    "url": "https://arxiv.org/abs/2601.10509v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10509v1.pdf",
    "title": "Reply to \"Comment on Nuclear Fusion 66, 016012 (2026) by Richard Fitzpatrick, A Simple Model of Current Ramp-Up and Ramp-Down in Tokamaks\" by A.H. Boozer",
    "abstract": "This report is a follow up to my paper \"A simple model of current ramp-up and ramp-down in tokamaks\" [Nucl. Fusion 66, 016012 (2026)] in the light of comments on the paper recently made by Dr. A.H. Boozer (arXiv:2601.05977).",
    "authors": [
      "Richard Fitzpatrick"
    ],
    "published": "2026-01-15T15:34:42Z",
    "updated": "2026-01-15T15:34:42Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2501.11029v2",
    "url": "https://arxiv.org/abs/2501.11029v2",
    "pdf_url": "https://arxiv.org/pdf/2501.11029v2.pdf",
    "title": "Laser-induced plasma formation and cavitation in water: from nanoeffects to extreme states of matter",
    "abstract": "We present an in-depth analysis of the energy dependence of optical breakdown in water by tightly focused laser pulses, from plasma formation to shock waves and cavitation. Laser pulses of fs to ns durations and UV to IR wavelengths are aberration-free focused through microscope objectives. Photography captures luminescent plasmas with submicrometer resolution, and bubble threshold and size are determined via probe beam scattering. The energy dependence of mechanical effects is quantified through the maximum bubble radius Rmax. We find three key scenarios depicting the interaction between multiphoton and avalanche ionization, recombination, and thermal ionization from nanoeffects near threshold to extreme energy densities. They include a previously unknown scenario that emerges with single-longitudinal-mode UV ns pulses from compact lasers. It enables cost-effective creation of nanoeffects, as demonstrated on corneal tissue and glass. High-resolution photography reveals new insights in the spatiotemporal dynamics of plasma formation, with an interplay of breakdown waves, string formation by local instabilities of avalanche ionization, and radiative energy transport. Plasma volume data from photographs together with absorption measurements show that the average energy density of luminescent fs and ns plasmas is similar, ranging between 10 and 40 kJ/cm^3 . However, small hot regions with up to 400 kJ/cm^3 are formed in ns breakdown. From the hot regions, energy is spread out via X-ray bremsstrahlung, forming a luminescent halo. Well above threshold, Rmax scales with E^(1/3) across all scenarios, with 15% - 20% conversion of laser energy into bubble energy. With increasing plasma energy density, an ever-larger energy fraction is converted into shock wave energy (75% at 40 kJ/cm^3 ). The results provide guidelines for parameter selection in laser surgery and material processing.",
    "authors": [
      "Norbert Linz",
      "Sebastian Freidank",
      "Xiao-Xuan Liang",
      "Alfred Vogel"
    ],
    "published": "2025-01-19T12:35:05Z",
    "updated": "2026-01-15T15:02:05Z",
    "categories": [
      "physics.flu-dyn",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.flu-dyn",
    "doi": "10.1088/1361-6633/adedb3"
  },
  {
    "arxiv_id": "2601.10472v1",
    "url": "https://arxiv.org/abs/2601.10472v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10472v1.pdf",
    "title": "From Weibel seeds to collisionless dynamos beyond pair-plasmas",
    "abstract": "Bridging the spatiotemporal scales of magnetic seed field generation and subsequent dynamo amplification in the weakly collisional intracluster medium presents an extreme numerical challenge. We perform collisionless turbulence simulations with initially unmagnetized electrons that capture both magnetic seed generation via the electron Weibel instability and the ensuing dynamo amplification. Going beyond existing pair-plasma studies, we use an ion-to-electron mass ratio of 100 for which we find electron and ion dynamics are sufficiently decoupled. These simulations are enabled by the 10-moment collisionless fluid solver of Gkeyll, which evolves the full pressure tensor for all species. The electron heat-flux closure regulates pressure isotropization and effectively sets the magnetic Reynolds number. We investigate how the strength of of the closure influences the transition between a regime reminiscent of previous kinetic pair-plasma simulations and a more MHD-like dynamo regime.",
    "authors": [
      "Lise Hanebring",
      "James Juno",
      "Ammar Hakim",
      "Jason M. TenBarge",
      "Istvan Pusztai"
    ],
    "published": "2026-01-15T14:57:57Z",
    "updated": "2026-01-15T14:57:57Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.CO"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.10430v1",
    "url": "https://arxiv.org/abs/2601.10430v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10430v1.pdf",
    "title": "Active interrogation of underground piezoelectric fabrics using high energy muon beams propagating across seismogenic faults",
    "abstract": "In this paper we extend a previous analysis of a newly conceived technique based on active interrogation of tectonic stress evolution in regions hosting active seismogenic faults. The aim is to monitor and detect stable and reliable precursor signals on an adequate time scale, well before an earthquake event, that can play a crucial role in activating alarms for civil protection systems. The precursor signal relies on continuous measurements of the time evolution of tectonic stress, obtained by interrogating underground, with a high energy collimated muon beam, the piezoelectric fabrics present in quartz rich granite like rocks surrounding a known seismogenic fault in the Earth crust. Beam propagation through the rock across the active fault conveys to a detector at the exit of the traversal information on the amplitude of the piezoelectric field, which scales with the tectonic stress applied to quartz crystals embedded in the rock. The system, named ERMES (Earthquake Reconnaissance using Muon beam Evolution in Silicon dioxide), differs from other techniques under study detecting electromagnetic signals generated by piezoelectricity outside the Earth crust, as it probes piezoelectric effects directly inside the source region of the associated electromagnetic field, namely the near field within quartz crystals rather than the far field in open space. We present a focused analysis of muon beam manipulation after rock traversal and before detection using a newly conceived muonic lens, and we explore the maximum rock penetration capability of a high energy muon beam, reaching about 3 km of rock thickness for a 10 TeV beam. Owing to the peculiarity of muon propagation through such kilometer scale targets, we cross checked previous FLUKA Monte Carlo simulations with Geant4 to clarify the secondary muons role generated by primary muon interactions in solid matter over long propagation lengths.",
    "authors": [
      "L. Serafini",
      "A. Bacci",
      "L. Bandiera",
      "F. Broggi",
      "I. Drebot",
      "A. Frazzitta",
      "A. M. Marotta",
      "G. Muttoni",
      "G. Paternò",
      "V. Petrillo",
      "M. Rossetti Conti",
      "A. R. Rossi",
      "S. Samsam",
      "M. Voltolini",
      "M. Zucali"
    ],
    "published": "2026-01-15T14:26:10Z",
    "updated": "2026-01-15T14:26:10Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.10363v1",
    "url": "https://arxiv.org/abs/2601.10363v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10363v1.pdf",
    "title": "A compact Optical Liquid Argon Facility at Roma Tre",
    "abstract": "In this paper we present a compact test facility for the measurement of optical properties of liquid argon as scintillation detector. The setup is under preparation at Roma Tre and it has a volume of 40 L liquid argon, which is liquefied from argon gas with a purity of $\\ge 99.9999\\%$ vol. To readout the scintillation photons from liquid argon with the highest intensity near 127 nm, we use the vacuum ultraviolet silicon photomultipliers from Hamamatsu. By submerging the photon detectors directly inside the liquid argon, we can eliminate the systematics from the wave length shifter and light guides which have been commonly used to detect the scintillation photons of liquid argon.",
    "authors": [
      "Hexi Shi",
      "Valerio D'Andrea",
      "Krzysztof Szczepaniec",
      "Giuseppe Salamanna",
      "Diego Tagnani"
    ],
    "published": "2026-01-15T13:10:24Z",
    "updated": "2026-01-15T13:10:24Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.06651v5",
    "url": "https://arxiv.org/abs/2512.06651v5",
    "pdf_url": "https://arxiv.org/pdf/2512.06651v5.pdf",
    "title": "A Capacitor Model of the Helical Deflector: Revisiting Shamaev's Proposal and the Textbook Model",
    "abstract": "An RF helical deflector is a type of electron and ion optics device that applies a time-dependent rotating transverse electric or magnetic field by means of time-dependent RF voltage applied on two opposite conducting helical structures (wires, ribbons or other) to deflect charged particles (a single, bunch or beam) in a circular or spiral path. It is a perspective indirect timing system being concurrent for reaching picosecond time resolution, and have promise being excellent candidate for high precision time-of-flight detection. As a timing system, it converts the temporal structure of an electron beam into a spatial pattern -- particularly, an ellipse in the case of a single-frequency RF voltage and continuous electron pencil beam.   I propose a capacitor model of an RF helical deflector and compare it with the existing textbook model \\cite{ZhigarevBook, Gevorgian2015}, interpret them and provide understanding of them. Furthermore, I analyze the latter, finding analytical formulas for the applied electric field, ellipse sizes (semi-axes) and rotation angle, lengths of the ellipse line, corresponding to the duration of electron pencil bunches or beams. The present article touches the topics of getting circle on resonance limit and of deflection sensitivity.",
    "authors": [
      "Hayk Lekdar Gevorgyan"
    ],
    "published": "2025-12-07T04:27:08Z",
    "updated": "2026-01-15T11:50:43Z",
    "categories": [
      "physics.acc-ph",
      "physics.app-ph",
      "physics.class-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.10295v1",
    "url": "https://arxiv.org/abs/2601.10295v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10295v1.pdf",
    "title": "Design, Fabrication and Testing of a D-Shaped High Temperature Superconducting Magnet",
    "abstract": "High-temperature technical superconductors are potential candidates for compact and high-field tokamak magnets. The demand for higher fusion power can be met with an on-axis high magnetic field due to toroidal magnets. An R&D activity has been initiated at the Institute for Plasma Research, India, to develop a compact D-shaped superconducting magnet utilizing REBCO high-temperature superconducting tapes. Under this initiative, a toroidal configuration with a major radius of 0.42 m, consisting of eight D-shaped, four poloidal field, and a central solenoid high-temperature superconducting magnets producing an on-axis toroidal magnetic field of 0.23 T has been conceptualized. The fabrication feasibility of a D-shaped coil for this toroidal configuration also envisaged using stacked high-temperature superconducting cable. In this paper, we report the design of a compact D-shaped coil, the fabrication of a long length HTS cable, a winding pack, and its integration with a cryogenic casing and vacuum enclosure. The winding pack terminations, joints, its interfacing with the power supply, and performance testing are also reported in this paper.",
    "authors": [
      "Upendra Prasad",
      "Mahesh Ghate",
      "Piyush Raj",
      "Deven Kanabar",
      "Pankaj Varmora",
      "Swati Roy",
      "Arun Panchal",
      "Dhaval Bhavsar",
      "Anees Bano",
      "Nitish Kumar",
      "Bhadresh Parghi",
      "Akhilesh Yadav",
      "Mohd. Umer",
      "Vijay Vasava",
      "Raton Mandal",
      "Rajkumar Ahirwar",
      "Megha Thaker"
    ],
    "published": "2026-01-15T11:13:18Z",
    "updated": "2026-01-15T11:13:18Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2601.10293v1",
    "url": "https://arxiv.org/abs/2601.10293v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10293v1.pdf",
    "title": "Updated electrical design of the Diagnostic Neutral Beam Injector in RFX-mod2",
    "abstract": "The Diagnostic Neutral Beam Injector of the RFX-mod2 experiment (Consorzio RFX, Padova) is expected to provide novel and significant information about the Reversed Field Pinch confinement of fusion plasmas. The injection of the hydrogen beam in the plasma will allow Charge Exchange Recombination Spectroscopy (CXRS) and Motional Stark Effect diagnostics (MSE) to measure several quantities: ion speed, ion temperature, impurity content, intensity and pitch of the magnetic field. The DNBI is of particular importance for allowing the determination of these quantities at the core of the plasma. The present DNBI, built by the Budker Institute of Plasma Physics, features an arc discharge H+ source, coupled to a 4-grid 50 keV acceleration system. The 50 ms, 5 A ion beam is neutralized by charge exchange by means of a gas target; residual ions are then deflected by a magnetic field before injection in the torus chamber. The beam can be modulated at maximum 250 Hz. The DNBI will undergo extraordinary maintenance and a structural upgrade to improve its reliability and safety. This contribution presents the latest upgrades of the electrical plants and of the control system of the DNBI.",
    "authors": [
      "Marco Barbisan",
      "Bruno Laterza",
      "Luca Cinnirella",
      "Lionello Marrelli",
      "Federico Molon",
      "Simone Peruzzo",
      "Enrico Zampiva"
    ],
    "published": "2026-01-15T11:11:05Z",
    "updated": "2026-01-15T11:11:05Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2303.18100v2",
    "url": "https://arxiv.org/abs/2303.18100v2",
    "pdf_url": "https://arxiv.org/pdf/2303.18100v2.pdf",
    "title": "Asymmetric Electrostatic Dodecapole: Compact Bandpass Filter with Low Aberrations for Momentum Microscopy",
    "abstract": "Imaging energy filters in photoelectron microscopes and momentum microscopes use spherical fields with deflection angles of 90°, 180°, and even 2 x 180°. These instruments are optimized for high energy resolution, but exhibit image aberrations when operated in high transmission mode at medium energy resolution. Here we present a new approach for bandpass-filtered imaging in real or reciprocal space using an electrostatic dodecapole with an asymmetric electrode array. In addition to energy-dispersive beam deflection, this multipole allows aberration correction up to the 3rd order. Here we describe its use as a bandpass prefilter in a time-of-flight momentum microscope at the hard X-ray beamline P22 of PETRA III. The entire instrument is housed in a straight vacuum tube because the deflection angle is only 4° and the beam displacement in the filter is only 8 mm. The multipole is framed by transfer lenses in the entrance and exit branches. Two sets of 16 different sized entrance and exit apertures on piezomotor driven mounts allow selection of the desired bandpass. For pass energies between 100 and 1400 eV and slit widths between 0.5 and 4 mm the transmitted kinetic energy intervals are between 10 eV and a few hundred eV (FWHM). The filter eliminates all higher or lower energy signals outside the selected bandpass, significantly improving the signal-to-background ratio in the ToF analyzer.",
    "authors": [
      "O. Tkach",
      "S. Babenkov",
      "Y. Lytvynenko",
      "O. Fedchenko",
      "K. Medjanik",
      "D. Vasilyev",
      "H. -J. Elmers",
      "G. Schönhense"
    ],
    "published": "2023-03-31T14:44:15Z",
    "updated": "2026-01-15T09:25:30Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1107/S1600577524003540"
  },
  {
    "arxiv_id": "2601.10139v1",
    "url": "https://arxiv.org/abs/2601.10139v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10139v1.pdf",
    "title": "Effect of hole pitch reduction on electron transport and diffusion: A comparative simulation study of Triple GEM detectors",
    "abstract": "Advances in fabrication techniques and high-performance electronics have facilitated the development of fine-pitch Gas Electron Multipliers (GEMs). Earlier experimental and simulation findings suggest that these reduced-pitch GEMs can outperform the standard configuration in terms of effective gain, collection efficiency, and position resolution. However, a noticeable fraction of avalanche electrons is lost within the GEM systems, resulting in a degradation of charge collection efficiency. Therefore, a comprehensive simulation-based study is essential to provide deeper insights into the extent of degradation and its contributing factors. In this context, we employ ANSYS and Garfield++ to model the Triple GEM detectors with reduced pitch sizes of 90 and 60 $μ$m, and perform a comparative performance analysis with the standard configuration (pitch size: 140 $μ$m). At first, the simulation framework is validated by comparing the results of the standard configuration with available experimental data and previously reported simulation outcomes. Despite the characteristic gain offset, the framework remains physically consistent and reliable in capturing microscopic avalanche dynamics, reproducing the experimental trend. Following validation, we investigate electron losses at the metal electrodes and within the Kapton holes, electron transmission through the transfer and induction regions, electron diffusion on the induction electrode, and the overall collection efficiency. These parameters are analyzed as functions of GEM potential, outer hole diameter, inner hole diameter, Kapton thickness, metal thickness, and gas composition, thereby offering insights for designing efficient GEM detectors.",
    "authors": [
      "Rajiv Gupta",
      "Sunidhi Saxena",
      "Ajay Kumar"
    ],
    "published": "2026-01-15T07:30:08Z",
    "updated": "2026-01-15T07:30:08Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.10039v1",
    "url": "https://arxiv.org/abs/2601.10039v1",
    "pdf_url": "https://arxiv.org/pdf/2601.10039v1.pdf",
    "title": "Effects of parallel magnetic fields on sheaths near biased electrodes in a highly collisional Z-pinch plasma",
    "abstract": "Sheath formation near biased electrodes in magnetic fields parallel to the wall is an understudied topic, especially within the context of Z-pinch fusion experiments. We perform 1X-2V Boltzmann-Poisson simulations of an axial cut at the pinch radius of a Z-pinch plasma between two biased electrodes with a magnetic field parallel to the wall. The collision frequencies are artificially increased to enhance thermalization of the plasma in the smaller simulation domain versus the actual experiment size; this increases the perpendicular mobility and partially de-magnetizes the ions resulting in non-monotonic sheath profiles with the potential increasing away from the wall to a peak before decaying. A classical sheath forms within an electron gyroradius from the wall not due to the natural thermal motion of the electrons, but due to the magnetized electrons gyrating into the wall; therefore, the sheath structure does not significantly change with bias potential or between electrodes. With increasing bias potential, a current is induced perpendicular to the wall due to changes in ion flow, differing from unmagnetized cases where current is induced by changes in electron flow. The magnetic field acts as a high resistivity with the perpendicular current density being three orders of magnitude lower than unmagnetized theoretical predictions. There is, however, significant flow parallel to the wall from the force balance between the pressure tensor and Lorentz force. These parallel flows induce a parallel current density three orders of magnitude larger than the perpendicular current density.",
    "authors": [
      "C. R. Skolar",
      "B. Srinivasan"
    ],
    "published": "2026-01-15T03:34:07Z",
    "updated": "2026-01-15T03:34:07Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.04332v2",
    "url": "https://arxiv.org/abs/2509.04332v2",
    "pdf_url": "https://arxiv.org/pdf/2509.04332v2.pdf",
    "title": "Detection of ultracold neutrons with powdered scintillator screens",
    "abstract": "Zinc sulfide (ZnS:Ag) scintillators coated with a thin 10B layer are widely used for ultracold neutron (UCN) detection, but their application is limited by long decay times and significant phosphorescence. We investigated two possible replacement scintillators: yttrium aluminum perovskite (YAP:Ce) and lutetium ttrium orthosilicate (LYSO:Ce). Both exhibit decay times on the order of 30-40 ns, which can help reduce dead time in high-count-rate experiments. YAP:Ce showed approximately 60% lower phosphorescence than ZnS:Ag after 2 days and detected about 20% more UCN. In contrast, LYSO:Ce exhibited higher phosphorescence and produced fewer UCN counts compared to both ZnS:Ag and YAP:Ce. While both tested scintillators are capable UCN detectors, YAP:Ce consistently outperformed LYSO:Ce across all measured performance metrics.",
    "authors": [
      "M. Krivos",
      "N. C. Floyd",
      "C. L. Morris",
      "Z. Tang",
      "M. Blatnik",
      "S. M. Clayton",
      "C. B. Cude-Woods",
      "A. Fratangelo",
      "A. T. Holley",
      "D. E. Hooks",
      "T. M. Ito",
      "C. -Y. Liu",
      "M. Makela",
      "M. R. Martinez",
      "A. S. C. Navazo",
      "C.",
      "M. O'Shaughnessy",
      "R. W. Pattie",
      "E. L. Renner",
      "T. A. Sandborn",
      "T. J. Schaub",
      "M. Singh",
      "I. L. Smythe",
      "F. W. Uhrich",
      "N. K. Washecheck",
      "Z. Wang",
      "A. R. Young"
    ],
    "published": "2025-09-04T15:51:09Z",
    "updated": "2026-01-15T01:35:43Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.09963v1",
    "url": "https://arxiv.org/abs/2601.09963v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09963v1.pdf",
    "title": "Near-Unity-Efficiency Gas Gratings for Ultraviolet, Visible, and Infrared High-Power Lasers",
    "abstract": "Interfering deep ultraviolet (DUV) lasers can induce substantial density modulations in an ozone-doped gas flow via photochemical reactions, creating volume diffraction gratings. These transient optics are immune to target debris and shrapnel and feature orders-of-magnitude higher damage thresholds than conventional solid optics, providing a promising method for efficiently manipulating high-energy lasers. In this work, we describe gas gratings that can efficiently diffract probe beams across a variety of wavelengths and pulse durations, ranging from deep ultraviolet to near-infrared and from nanosecond to femtosecond, achieving a full beam diffraction efficiency up to 99% while preserving the focusability and wavefront quality. In addition, we present a comprehensive characterization of the performance of the gas gratings under various experimental conditions, including imprint fluence, gas composition, and grating geometries, showing significant enhancement of this process with the addition of carbon dioxide. We also demonstrate stable performance over hours of operation. Our results validate a previously developed theoretical model and suggest optimal parameters to efficiently scale gas gratings to high-energy applications.",
    "authors": [
      "Ke Ou",
      "Harsha Rajesh",
      "Sida Cao",
      "Debolina Chakraborty",
      "Victor M. Perez-Ramirez",
      "Devdigvijay Singh",
      "Caleb Redshaw",
      "Pelin Dedeler",
      "Albertine Oudin",
      "Eugene Kur",
      "Michelle M. Wang",
      "Julia M. Mikhailova",
      "Livia Lancia",
      "Caterina Riconda",
      "Pierre Michel",
      "Matthew R. Edwards"
    ],
    "published": "2026-01-15T00:56:13Z",
    "updated": "2026-01-15T00:56:13Z",
    "categories": [
      "physics.optics",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2511.05643v2",
    "url": "https://arxiv.org/abs/2511.05643v2",
    "pdf_url": "https://arxiv.org/pdf/2511.05643v2.pdf",
    "title": "Transmission Efficiency of the Recoil Mass Spectrometer EMMA at TRIUMF",
    "abstract": "The mean transmission efficiency of the EMMA recoil mass spectrometer at TRIUMF has been measured with 6 different angular apertures at 17 kinetic energy/charge deviations with respect to the central, reference trajectory. Measurements performed using a 148Gd alpha source installed at the target position of the spectrometer are compared to ion-optical calculations and Monte Carlo simulations. The transmission efficiency as a function of angle and kinetic energy/charge is described empirically using piecewise Gaussian functions whose parameters are fit to the data.",
    "authors": [
      "B. Davids",
      "N. E. Esker",
      "J. Jaeyoung",
      "Y. K. Kim",
      "K. Pak",
      "M. Williams"
    ],
    "published": "2025-11-07T18:39:08Z",
    "updated": "2026-01-15T00:19:38Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.09906v1",
    "url": "https://arxiv.org/abs/2601.09906v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09906v1.pdf",
    "title": "A feasibility study for a Doppler Reflectometer System in the JT-60SA tokamak",
    "abstract": "In this work we present a study on the viability and practicality of installing a Doppler reflectometer (DR) system in the JT-60SA advanced tokamak. First, we discuss its scientific scope in the context of the JT-60SA research plan. We identify a number of fields in which a DR would be very relevant for the accomplishment of said plan and outline a scientific program for the diagnostic. Then, starting from a number of design hypothesis, we use a ray tracing code to carry out a feasibility study for a number of relevant scenarios and identify a geometric solution for the installation of a DR such that both core and edge can be probed in the prescribed wave number range, thus achieving the proposed scientific objectives. Finally, we perform a preliminary discussion on the different possibilities for a conceptual design (including a minimum viable system and a baseline system) and their requirements in terms of components and space. We conclude that a viable conceptual design could be carried out using a small fraction of a horizontal port, leaving room for additional diagnostic systems.",
    "authors": [
      "D. Carralero",
      "T. Happel",
      "T. Estrada",
      "T. Tokuzawa",
      "J. Martínez",
      "E. de la Luna",
      "A. Cappa",
      "J. García"
    ],
    "published": "2026-01-14T22:29:05Z",
    "updated": "2026-01-14T22:29:05Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1016/j.fusengdes.2021.112803."
  },
  {
    "arxiv_id": "2507.09106v2",
    "url": "https://arxiv.org/abs/2507.09106v2",
    "pdf_url": "https://arxiv.org/pdf/2507.09106v2.pdf",
    "title": "CycleGAN-Driven Transfer Learning for Electronics Response Emulation in High-Purity Germanium Detectors",
    "abstract": "High-Purity Germanium (HPGe) detectors are a key technology for rare-event searches such as neutrinoless double-beta decay (\\ensuremath{0νββ}) and dark matter experiments. Pulse shapes from these detectors vary with interaction topology and thus encode information critical for event classification. Pulse shape simulations (PSS) are essential for modeling analysis cuts that distinguish signal events from backgrounds and for generating reliable simulations of energy spectra. Traditional PSS methods rely on a series of first-principles corrections to replicate the effect of readout electronics, requiring challenging fits over large parameter spaces and often failing to accurately model the data. We present a neural network architecture, the Cyclic Positional U-Net (https://github.com/aobol/CPU-Net), that performs translations of simulated pulses so that they closely resemble measured detector signals. Using a Cycle Generative Adversarial Network (CycleGAN) framework, this {Response Emulation Network} (REN) learns a data-driven mapping between simulated and measured pulses with high fidelity, without requiring a predetermined response model. We use data from a High-Purity Germanium (HPGe) detector with an inverted-coaxial point contact (ICPC) geometry to show that \\texttt{CPU-Net} effectively captures and reproduces critical pulse shape features, allowing more realistic simulations without detector-specific tuning. \\texttt{CPU-Net} achieves up to a factor-of-four improvement in distribution-level agreement for pulse shape parameter reconstruction, while preserving the topology-dependent information required for pulse-shape discrimination.",
    "authors": [
      "Kevin Bhimani",
      "Julieta Gruszko",
      "Morgan Clark",
      "John Wilkerson",
      "Aobo Li"
    ],
    "published": "2025-07-12T01:36:59Z",
    "updated": "2026-01-14T21:00:17Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/2632-2153/ae3052"
  },
  {
    "arxiv_id": "2510.00493v2",
    "url": "https://arxiv.org/abs/2510.00493v2",
    "pdf_url": "https://arxiv.org/pdf/2510.00493v2.pdf",
    "title": "Correlation function metrology for warm dense matter: Recent developments and practical guidelines",
    "abstract": "X-ray Thomson scattering (XRTS) has emerged as a valuable diagnostic for matter under extreme conditions, as it captures the intricate many-body physics of the probed sample. Recent advances, such as the model-free temperature diagnostic of Dornheim et al. [Nat.Commun. 13, 7911 (2022)], have demonstrated how much information can be extracted directly within the imaginary-time formalism. However, since the imaginary-time formalism is a concept often difficult to grasp, we provide here a systematic overview of its theoretical foundations and explicitly demonstrate its practical applications to temperature inference, including relevant subtleties. Furthermore, we present recent developments that enable the determination of the absolute normalization, Rayleigh weight, and density from XRTS measurements without reliance on uncontrolled model assumptions. Finally, we outline a unified workflow that guides the extraction of these key observables, offering a practical framework for applying the method to interpret experimental measurements.",
    "authors": [
      "Maximilian Peter Böhme",
      "Willow Martin",
      "Hannah Bellenbaum",
      "Margaret Berrens",
      "Jan Vorberger",
      "Sebastian Schwalbe",
      "Zhandos Moldabekov",
      "Thomas Gawne",
      "Sebastien Hamel",
      "Brianna Aguilar-Solis",
      "Abhiraj Sharma",
      "Frank Graziani",
      "Tilo Döppner",
      "Siegfried Glenzer",
      "Tobias Dornheim",
      "David Bishel"
    ],
    "published": "2025-10-01T04:22:31Z",
    "updated": "2026-01-14T19:30:23Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.09675v1",
    "url": "https://arxiv.org/abs/2601.09675v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09675v1.pdf",
    "title": "Radiation tolerance tests on key components of the ePIC-dRICH readout card",
    "abstract": "The dual-radiator RICH detector of the ePIC experiment will employ over 300000 SiPM pixels as photosensors, organized into more than 1000 Photon Detection Units. Each PDU is a compact module, approximately 5x5x12 cm^3 in size, including four custom ASICs connected to 256 SiPMs and an FPGA-based readout card (RDO) responsible for data acquisition and control. Considering the moderately harsh radiation environment expected in the dRICH detector, this study reports on proton irradiation tests performed on key components of the RDO card to assess their tolerance to cumulative Total Ionizing Dose (TID) and Single Event Effects (SEE). All tested components demonstrated radiation tolerance beyond the TID levels expected for the dRICH environment, with the exception of the ATtiny417 microcontroller, which showed destructive failure. Furthermore, as expected, the observed Single Event Upset (SEU) rates call for appropriate mitigation strategies in the final system design.",
    "authors": [
      "S. Geminiani",
      "B. R. Achari",
      "N. Agrawal",
      "M. Alexeev",
      "C. Alice",
      "R. Ammendola",
      "P. Antonioli",
      "C. Baldanza",
      "L. Barion",
      "A. Biagioni",
      "A. Calivà",
      "M. Capua",
      "F. Capuani",
      "A. Ciardiello",
      "E. Cisbani",
      "M. Chiosso",
      "M. Contalbrigo",
      "F. Cossio",
      "M. Da Rocha Rolo",
      "A. De Caro",
      "D. De Gruttola",
      "G. Dellacasa",
      "D. Falchieri",
      "S. Fazio",
      "O. Frezza",
      "N. Funicello",
      "M. Garbini",
      "N. Jacazio",
      "F. Lo Cicero",
      "A. Lonardo",
      "R. Malaguti",
      "F. Mammoliti",
      "M. Martinelli",
      "M. Mignone",
      "C. Mingioni",
      "M. Nenni",
      "F. Noto",
      "L. Occhiuto",
      "A. Paladino",
      "D. Panzieri",
      "P. Perticaroli",
      "S. Plavully",
      "L. Polizzi",
      "L. Pontisso",
      "R. Preghenella",
      "R. Ricci",
      "L. Rignanese",
      "C. Ripoli",
      "C. Rossi",
      "E. Rovati",
      "N. Rubini",
      "M. Ruspa",
      "A. Saputi",
      "F. Simula",
      "F. Spizzo",
      "U. Tamponi",
      "E. Tassi",
      "G. Torromeo",
      "C. Tuvè",
      "G. M. Urciuoli",
      "S. Vallarino",
      "P. Vicini",
      "R. Wheadon"
    ],
    "published": "2026-01-14T18:18:23Z",
    "updated": "2026-01-14T18:18:23Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.16408v2",
    "url": "https://arxiv.org/abs/2511.16408v2",
    "pdf_url": "https://arxiv.org/pdf/2511.16408v2.pdf",
    "title": "Development & Characterization of Electrodes for large-scale Xenon Time Projection Chambers",
    "abstract": "Dual-phase liquid xenon time projection chambers are the core detector elements of many experiments that conduct searches for Dark Matter and rare events, as well as in neutrino and high-energy physics. As part of this detector technology, high-voltage electrodes are instrumental for the generation of observable signals and their physical interpretation. Thus, electrode design and manufacturing has to fulfill stringent requirements, and their production is associated with significant engineering challenges. In this work we describe the successful development of electrodes on the 1.5 m-scale, from their design and simulation to subsequent assembly and high-voltage testing in a gaseous argon environment. The produced electrodes were recently installed as an anode and a cathode during an upgrade to the XENONnT experiment.",
    "authors": [
      "A. Elykov",
      "S. Vetter",
      "V. H. S. Wu",
      "A. Deisting",
      "K. Eitel",
      "R. Gumbsheimer",
      "M. Kara",
      "S. Lichter",
      "S. Lindemann",
      "T. Luce",
      "Y. Ma",
      "J. Müller",
      "K. Müller",
      "K. Ni",
      "U. Oberlack",
      "M. Schumann",
      "P. Shagin",
      "K. Valerius",
      "M. Zhong"
    ],
    "published": "2025-11-20T14:29:16Z",
    "updated": "2026-01-14T18:13:53Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.07848v2",
    "url": "https://arxiv.org/abs/2601.07848v2",
    "pdf_url": "https://arxiv.org/pdf/2601.07848v2.pdf",
    "title": "Cyclotron Radiation Signal Characterization in Resonant Cavities for the Project 8 Neutrino Mass Experiment",
    "abstract": "Many experimental methods in physics require understanding radiation from single particles into non-trivial electromagnetic mode structures. Such characterization is critical for Cyclotron Radiation Emission Spectroscopy (CRES), an advancing new measurement technique that has the potential to greatly benefit fundamental physics measurements. In CRES, charged particles emit cyclotron radiation at frequencies that provide their energy measurement. As a notable example, the Project 8 experiment aims to kinematically infer the neutrino mass by measuring the energies of electrons emitted in tritium beta decay using CRES. In near-term realizations of Project 8, resonant cylindrical cavities will be used for CRES readout, in a configuration with a magnetic field oriented along the symmetry axis, and electrons following helical cyclotron trajectories confined to the cavity interior. The physics of electromagnetic radiation in these environments is complicated, since it involves both the motion of the emitting particle and the mode structure imposed by the cavity. In this work, we derive and validate an analytic model for how an oscillating, trapped electron radiates into cavity modes, and the power and frequency content of the radiation that can be read out from these events. These results can be used to guide the design of cavities for future CRES and other experiments.",
    "authors": [
      "A. Ashtari Esfahani",
      "S. Bhagvati",
      "H. P. Binney",
      "S. Böser",
      "M. J. Brandsema",
      "N. Buzinsky",
      "R. Cabral",
      "M. C. Carmona-Benitez",
      "C. Claessens",
      "L. de Viveiros",
      "A. El Boustani",
      "M. G. Elliott",
      "S. Enomoto",
      "M. Fertl",
      "J. A. Formaggio",
      "B. T. Foust",
      "J. K. Gaison",
      "P. Harmston",
      "K. M. Heeger",
      "B. J. P. Jones",
      "E. Karim",
      "K. Kazkaz",
      "P. T. Kolbeck",
      "A. Kurmus",
      "M. Li",
      "A. Lindman",
      "C. -Y. Liu",
      "T. Luo",
      "C. Matthé",
      "R. Mohiuddin",
      "B. Monreal",
      "B. Mucogllava",
      "R. Mueller",
      "A. Negi",
      "J. A. Nikkel",
      "E. Novitski",
      "N. S. Oblath",
      "M. Oueslati",
      "J. I. Peña",
      "W. Pettus",
      "A. W. P. Poon",
      "V. S. Ranatunga",
      "R. Reimann",
      "A. L. Reine",
      "R. G. H. Robertson",
      "G. Rybka",
      "L. Saldaña",
      "V. Sharma",
      "P. L. Slocum",
      "F. Spanier",
      "J. Stachurska",
      "Y. -H. Sun",
      "P. T. Surukuchi",
      "A. B. Telles",
      "F. Thomas",
      "L. A. Thorne",
      "T. Thümmler",
      "M. Turqueti",
      "W. Van De Pontseele",
      "B. A. VanDevender",
      "T. E. Weiss",
      "M. Wynne",
      "A. Ziegler"
    ],
    "published": "2026-01-07T21:31:03Z",
    "updated": "2026-01-14T18:13:15Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.11725v2",
    "url": "https://arxiv.org/abs/2510.11725v2",
    "pdf_url": "https://arxiv.org/pdf/2510.11725v2.pdf",
    "title": "Towards High-Efficiency Particle Detection Using Superconducting Microwire Arrays",
    "abstract": "We present a detailed study of an 8-channel $1\\times1$ mm$^{2}$ WSi superconducting microwire single photon detector (SMSPD) array exposed to 120 GeV hadron beam and 120 GeV muon beam at the CERN Super Proton Synchrotron H6 beamline. Following up on our first detailed characterization of the efficiency and response of an SMSPD fabricated on a 3 nm WSi film, we report measurements of enhanced particle detection efficiency using a sensor fabricated from a thicker 4.7nm-thick WSi film. We also report the first SMSPD detection efficiency measurement made for muons. Measurements are enabled by a silicon tracking telescope providing 10 $μ$m in-situ spatial resolution. The results show a fill factor-normalized detection efficiency of 75% and a time resolution of about 130 ps across pixels. These findings represent a significant advancement toward developing high-efficiency SMSPD charged particle tracking systems with simultaneous precision timing, with potential applications in future accelerator-based experiments such as the FCC-ee and Muon Collider.",
    "authors": [
      "Christina Wang",
      "Cristián Peña",
      "Adolf Bornheim",
      "Shuoxing Wu",
      "Alexander Albert",
      "Thomas Sievert",
      "Artur Apresyan",
      "Emanuel Knehr",
      "Boris Korzh",
      "Jamie Luskin",
      "Ludovico Mori",
      "Sahil Patel",
      "Guillermo Reales Gutiérrez",
      "Manish Sahu",
      "Ekkehart Schmidt",
      "Matthew Shaw",
      "Elise Sledge",
      "Maria Spiropulu",
      "Towsif Taher",
      "Si Xie"
    ],
    "published": "2025-10-08T13:01:48Z",
    "updated": "2026-01-14T17:05:59Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/12/P12033"
  },
  {
    "arxiv_id": "2507.13864v2",
    "url": "https://arxiv.org/abs/2507.13864v2",
    "pdf_url": "https://arxiv.org/pdf/2507.13864v2.pdf",
    "title": "Muon tracking in a LiquidO opaque scintillator detector",
    "abstract": "LiquidO is an innovative radiation detector concept. The core idea is to exploit stochastic light confinement in a highly scattering medium to self-segment the detector volume. In this paper, we demonstrate event-by-event muon tracking in a LiquidO opaque scintillator detector prototype. The detector consists of a 30 mm cubic scintillator volume instrumented with 64 wavelength-shifting fibres arranged in an 8$\\times$8 grid with a 3.2 mm pitch and read out by silicon photomultipliers. A wax-based opaque scintillator with a scattering length of approximately 0.5 mm is used. The tracking performance of this LiquidO detector is characterised with cosmic-ray muons and the position resolution is demonstrated to be 450 $μ$m per row of fibres. These results highlight the potential of LiquidO opaque scintillator detectors to achieve fine spatial resolution, enabling precise particle tracking and imaging.",
    "authors": [
      "LiquidO Collaboration",
      "J. Apilluelo",
      "L. Asquith",
      "E. F. Bannister",
      "N. P. Barradas",
      "C. L. Baylis",
      "J. L. Beney",
      "M. Berberan e Santos",
      "X. de la Bernardie",
      "T. J. C. Bezerra",
      "M. Bongrand",
      "C. Bourgeois",
      "D. Breton",
      "J. Busto",
      "A. Cabrera",
      "A. Cadiou",
      "E. Calvo",
      "M. de Carlos Generowicz",
      "E. Chauveau",
      "B. J. Cattermole",
      "M. Chen",
      "P. Chimenti",
      "D. F. Cowen",
      "S. Kr. Das",
      "S. Dusini",
      "A. Earle",
      "M. Felizardo",
      "C. Frigerio Martins",
      "J. Galán",
      "J. A. García",
      "A. Gibson-Foster",
      "C. Girard-Carillo",
      "W. C. Griffith",
      "J. J. Gómez-Cadenas",
      "M. Guitière",
      "F. Haddad",
      "J. Hartnell",
      "A. Holin",
      "I. G. Irastorza",
      "I. Jovanovic",
      "A. Kling",
      "L. Koch",
      "P. Lasorak",
      "J. F. Le Du",
      "F. Lefevre",
      "P. Loaiza",
      "J. A. Lock",
      "G. Luzón",
      "J. Maalmi",
      "J. P. Malhado",
      "F. Mantovani",
      "J. G. Marques",
      "C. Marquet",
      "M. Martínez",
      "J. T. Moffat",
      "D. Navas-Nicolás",
      "H. Nunokawa",
      "J. P. Ochoa-Ricoux",
      "T. Palmeira",
      "C. Palomares",
      "D. Petyt",
      "P. Pillot",
      "A. Pin",
      "J. C. C. Porter",
      "M. S. Pravikoff",
      "S. Richards",
      "N. Rodrigues",
      "M. Roche",
      "R. Rosero",
      "B. Roskovec",
      "M. L. Sarsa",
      "S. Schoppmann",
      "A. Serafini",
      "C. Shepherd-Themistocleous",
      "W. Shorrock",
      "M. Silva",
      "L. Simard",
      "S. R. Soleti",
      "D. Stocco",
      "V. Strati",
      "J. S. Stutzmann",
      "F. Suekane",
      "N. Tuccori",
      "A. Verdugo",
      "B. Viaud",
      "S. M. Wakely",
      "A. Weber",
      "G. Wendel",
      "A. S. Wilhelm",
      "A. W. R. Wong",
      "M. Yeh",
      "F. Yermia"
    ],
    "published": "2025-07-18T12:39:06Z",
    "updated": "2026-01-14T17:05:09Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/21/01/P01010"
  },
  {
    "arxiv_id": "2601.09629v1",
    "url": "https://arxiv.org/abs/2601.09629v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09629v1.pdf",
    "title": "Characterization of Silicon-Membrane TES Microcalorimeters for Large-Format X-ray Spectrometers with Integrated Microwave SQUID Readout",
    "abstract": "We present the electro-thermal characterization of transition-edge sensor (TES) detectors suspended on Si membranes fabricated using a silicon-on-insulator (SOI) wafer. The use of an all-silicon fabrication platform, in contrast to the more commonly used silicon nitride membranes, is compatible with monolithic fabrication of integrated TES and SQUID circuits. The all-silicon architecture additionally allows efficient use of focal plane area; the readout circuitry may be positioned out of the focal plane by bending a thinned portion of the chip. Compatibility with integrated fabrication and efficient use of focal plane area provide a path to an efficient soft X-ray spectrometer.   This work is motivated by our goal to develop a 10,000-pixel TES spectrometer to overcome critical measurement limitations in catalysis research. The characterization of fragile, carbon-based intermediates via techniques like Resonant Inelastic X-ray Scattering (RIXS) is often precluded by the slow, high-flux nature of existing technologies. The new instrument will allow for fast RIXS measurements to be made without causing sample damage. We verify the detector models and measure the energy resolution using a pulsed optical laser, demonstrating the viability of this approach for the final instrument to be deployed at the National Synchrotron Light Source II (NSLS-II).",
    "authors": [
      "Avirup Roy",
      "Robinjeet Singh",
      "Joel C. Weber",
      "W. B. Doriese",
      "Johnathon Gard",
      "Mark W. Keller",
      "John A. B. Mates",
      "Kelsey M. Morgan",
      "Nathan J. Ortiz",
      "Daniel S. Swetz",
      "Daniel R. Schmidt",
      "Joel N. Ullom",
      "Evan P. Jahrman",
      "Thomas C. Allison",
      "Sasawat Jamnuch",
      "John Vinson",
      "Charles J. Titus",
      "Cherno Jaye",
      "Daniel A. Fischer",
      "Galen C. O'Neil"
    ],
    "published": "2026-01-14T17:01:34Z",
    "updated": "2026-01-14T17:01:34Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.supr-con",
      "quant-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.09617v1",
    "url": "https://arxiv.org/abs/2601.09617v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09617v1.pdf",
    "title": "Comparison of plasma response models for RMP effects on the divertor and scrape-off layer in KSTAR",
    "abstract": "Resonant magnetic perturbations (RMPs) are beneficial for control of edge localized modes (ELMs) in tokamaks. Nevertheless, a side effect is the appearance of a helical striations in the particle and heat loads onto divertor targets. The extent and field line connection of these striations is significantly altered by the plasma response to external perturbations. For an ELM suppressed H-mode plasma at KSTAR, magnetic footprints are computed by FLARE based on plasma response from GPEC, MARS-F, M3D-C1 and JOREK with substantial differences in the resulting footprints (from 2 cm to 14 cm). This is reflected in EMC3-EIRENE simulations of the resulting heat loads: it is found that either the peak value or the extent of the striations appear to be overestimated compared to IRTV measurements. Reasonable agreement can only be achieved for the smallest footprint for lower input power and lower cross-field transport, or for higher upstream density and radiative power losses.",
    "authors": [
      "H. Frerichs",
      "J. Van Blarcum",
      "T. Cote",
      "S. K. Kim",
      "Y. Q. Liu",
      "S. M. Yang"
    ],
    "published": "2026-01-14T16:41:37Z",
    "updated": "2026-01-14T16:41:37Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.09596v1",
    "url": "https://arxiv.org/abs/2601.09596v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09596v1.pdf",
    "title": "Plasma wakes driven by Compton scattering: Non-linear regime and particle acceleration",
    "abstract": "We investigate plasma wake generation via Compton scattering from photon bursts, a non-ponderomotive process relevant when the photon wavelength is smaller than the interparticle distance but larger than the Compton wavelength. In this regime, electrons can reach relativistic velocities. We extend linear theory to the nonlinear regime, showing that plasma waves can reach the wave-breaking limit. Perfectly collimated drivers produce wakes propagating at the speed of light, allowing electron phase-locking (limited by driver depletion). Non-collimated drivers induce subluminal phase velocities, limiting acceleration via dephasing. Two-dimensional simulations reveal unique transverse fields compared to laser wakefields, with a DC magnetic field leading to consistent focusing. The work considers observational prospects in laboratory and astrophysical scenarios such as around highly luminous compact objects (e.g., pulsars, gamma-ray bursts) interacting with tenuous interstellar or intergalactic plasmas, where conditions favor Comptondominated wakefield acceleration.",
    "authors": [
      "Thomas Grismayer",
      "Fabrizio Del Gaudio",
      "Luís O. Silva"
    ],
    "published": "2026-01-14T16:14:00Z",
    "updated": "2026-01-14T16:14:00Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.09574v1",
    "url": "https://arxiv.org/abs/2601.09574v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09574v1.pdf",
    "title": "Square matrix-based six-dimensional convergence map for nonlinear beam dynamics analysis",
    "abstract": "The square matrix-based convergence map (CM) method has proven effective in characterizing nonlinear dynamics in several 4-D dynamical systems. However, when time-dependent perturbations, such as crabbing kicks in colliders, are present, a comprehensive 6-D analysis becomes essential to accurately capture the coupling between transverse and longitudinal motions. In this work, we extend the CM method to the full 6-D phase space by employing an eigen-decomposition-based formulation of the square matrix combined with iterative procedures. The proposed 6-D CM approach is first validated using a simplified crabbing map. We demonstrate that the 6-D CM preserves computational efficiency by using only one-turn map, while successfully resolving high-order resonance structures that remain unresolved by conventional frequency map analysis (FMA). This method is subsequently applied to the dynamic aperture (DA) study of the future Electron-Ion Collider (EIC). The results obtained from the CM analysis exhibit close agreement with those derived from FMA, demonstrating its potential as a powerful tool for nonlinear beam dynamics analysis and DA evaluation, as well as for broader applications in other nonlinear dynamical systems.",
    "authors": [
      "Jinyu Wan",
      "Yue Hao"
    ],
    "published": "2026-01-14T15:45:22Z",
    "updated": "2026-01-14T15:45:22Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.10107v2",
    "url": "https://arxiv.org/abs/2509.10107v2",
    "pdf_url": "https://arxiv.org/pdf/2509.10107v2.pdf",
    "title": "Experimental Evidence for the Breakdown of Uniform-Electron-Gas Models in Warm Dense Aluminium",
    "abstract": "The robust diagnosis of thermodynamic conditions in warm dense matter experiments remains a central challenge. We report angle-resolved femtosecond x-ray Thomson scattering measurements of shock-compressed aluminum at approximately 50 GPa over a wide range of scattering wavevectors at the European XFEL. The measured plasmon dispersion and line shape demonstrate that the standard analysis of x-ray Thomson scattering spectra based on uniform electron gas models systematically overestimates the plasmon resonance energy by up to 8 eV. In contrast, an analysis based on ab initio calculations reproduces both the dispersion and spectral shape within experimental uncertainty. Our results show that shock-induced disorder plays a critical role in the interpretation of x-ray Thomson scattering from compressed solids and provide direct evidence that ab initio approaches are required for reliable inference of thermodynamic conditions in warm dense aluminum.",
    "authors": [
      "Dmitrii S. Bespalov",
      "Ulf Zastrau",
      "Zhandos A. Moldabekov",
      "Thomas Gawne",
      "Tobias Dornheim",
      "Moyassar Meshhal",
      "Alexis Amouretti",
      "Michal Andrzejewski",
      "Karen Appel",
      "Carsten Baehtz",
      "Erik Brambrink",
      "Khachiwan Buakor",
      "Carolina Camarda",
      "David Chin",
      "Gilbert Collins",
      "Céline Crépeisson",
      "Adrien Descamps",
      "Jon Eggert",
      "Luke Fletcher",
      "Alessandro Forte",
      "Gianluca Gregori",
      "Marion Harmand",
      "Oliver S. Humphries",
      "Hauke Höppner",
      "Jonas Kuhlke",
      "William Lynn",
      "Julian Lütgert",
      "Masruri Masruri",
      "Emma M. McBride",
      "Ryan Stewart McWilliams",
      "Alan Augusto Sanjuan Mora",
      "Jean-Paul Naedler",
      "Paul Neumayer",
      "Charlotte Palmer",
      "Alexander Pelka",
      "Lea Pennacchioni",
      "Calum Prestwood",
      "Natalia A. Pukhareva",
      "Chongbing Qu",
      "Divyanshu Ranjan",
      "Ronald Redmer",
      "Michael Roper",
      "Christoph Sahle",
      "Samuel Schumacher",
      "Jan-Patrick Schwinkendorf",
      "Melanie J. Sieber",
      "Madison Singleton",
      "Ethan Smith",
      "Christian Sternemann",
      "Thomas Stevens",
      "Michael Stevenson",
      "Cornelius Strohm",
      "Minxue Tang",
      "Monika Toncian",
      "Toma Toncian",
      "Thomas Tschentscher",
      "Sam M. Vinko",
      "Justin S. Wark",
      "Max Wilke",
      "Dominik Kraus",
      "Thomas R. Preston"
    ],
    "published": "2025-09-12T09:57:49Z",
    "updated": "2026-01-14T13:31:03Z",
    "categories": [
      "physics.plasm-ph",
      "cond-mat.str-el"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.09458v1",
    "url": "https://arxiv.org/abs/2601.09458v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09458v1.pdf",
    "title": "Breakeven in Nuclear Fusion via Electron-Free Target",
    "abstract": "Nuclear fusion promises a nearly limitless energy source, but achieving breakeven-where fusion output exceeds input-requires extreme plasma conditions and complex confinement systems. Here we propose an alternative approach based on beam-target interactions, introducing a simple energy-based criterion that compares fusion energy generation with energy loss. By creating electron-free targets, stopping power is drastically reduced, enabling conditions where fusion energy surpasses beam energy deposition under practical scenarios. This approach offers a viable alternative pathway to fusion energy without high-temperature plasma confinement and warrants further experimental investigation.",
    "authors": [
      "Tadafumi Kishimoto"
    ],
    "published": "2026-01-14T13:04:45Z",
    "updated": "2026-01-14T13:04:45Z",
    "categories": [
      "nucl-ex",
      "physics.plasm-ph"
    ],
    "primary_category": "nucl-ex"
  },
  {
    "arxiv_id": "2508.13858v4",
    "url": "https://arxiv.org/abs/2508.13858v4",
    "pdf_url": "https://arxiv.org/pdf/2508.13858v4.pdf",
    "title": "Numerical simulations of a RF-RF hybrid plasma torch with argon at atmospheric pressure",
    "abstract": "We report numerical results regarding the minimum sustaining coil excitation current for a RF-RF hybrid torch operating at two different frequencies. The first coil is excited at a high-frequency, while the second coil is set at a medium frequency. The filling gas is argon, at atmospheric pressure. We use the modeling software COMSOL Multiphysics to describe the evolution of key parameters when: (i) the distance between the two coils changes, (ii) the power of the high frequency coil changes. We discuss the radial temperature profiles, the axial velocities and the heat convected at the end of the medium-frequency coil. The latter is compared with the total heat conduction to the plasma confinement tube wall.",
    "authors": [
      "Loann Terraz",
      "Biruk Alemu",
      "Santiago Eizaguirre"
    ],
    "published": "2025-08-19T14:17:59Z",
    "updated": "2026-01-14T12:36:46Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.46298/ops.16373"
  },
  {
    "arxiv_id": "2601.09408v1",
    "url": "https://arxiv.org/abs/2601.09408v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09408v1.pdf",
    "title": "The ePIC Silicon Vertex Tracker: Design and Status",
    "abstract": "The ePIC collaboration is developing a multidetector system to explore the fundamental properties of the strong interaction at the future Electron-Ion Collider (EIC), to be built at Brookhaven National Laboratory. A key component of the ePIC detector is the Silicon Vertex Tracker (SVT), which provides high-precision tracking and microvertex reconstruction. The SVT consists of the Inner Barrel (IB), the Outer Barrel (OB), and the Forward/Backward Disks, all based on Monolithic Active Pixel Sensors (MAPS) that combine high granularity, low power consumption, and minimal material budget. This paper presents a concise overview of the SVT design and its development status.",
    "authors": [
      "R. Turrisi"
    ],
    "published": "2026-01-14T11:53:37Z",
    "updated": "2026-01-14T11:53:37Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.09368v1",
    "url": "https://arxiv.org/abs/2601.09368v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09368v1.pdf",
    "title": "Analysis of wave processes using beam-driven Langmuir/$\\mathcal{Z}$-mode waveforms generated in Particle-In-Cell simulations",
    "abstract": "During Type III solar radio bursts, beam-driven upper-hybrid wave turbulence is converted into electromagnetic emissions at the fundamental plasma frequency and its harmonic, through a chain of various linear and nonlinear wave processes. In this work, we mainly investigate the relative roles and interplay of two key mechanisms: the nonlinear decay of Langmuir/$\\mathcal Z$-mode waves and their linear transformations on random density fluctuations and, in particular, their mode conversion at constant frequency into electromagnetic waves. Using two-dimensional Particle-In-Cell simulations, we employ a diagnostic approach based on large ensembles of virtual satellites that record local waveforms, enabling detailed temporal and spatial characterization of wave processes in randomly inhomogeneous plasmas. This method allows robust statistical analysis and direct comparison with spacecraft observations. The study focuses on the dependence of wave dynamics on the average level of density fluctuations and the plasma magnetization. Our results quantify the occurrence rate of decay under varying physical conditions and demonstrate how developed plasma density turbulence can significantly alter the balance between nonlinear wave-wave interactions and linear wave transformations. These findings provide new insights into the mechanisms responsible for electromagnetic emissions during type III radio bursts and strengthen the connection between numerical simulations and in situ solar wind measurements, offering a valuable framework for the interpretation of future space-based waveform observations.",
    "authors": [
      "Francisco Javier Polanco-Rodríguez",
      "Catherine Krafft",
      "Philippe Savoini"
    ],
    "published": "2026-01-14T10:50:35Z",
    "updated": "2026-01-14T10:50:35Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.18384v3",
    "url": "https://arxiv.org/abs/2510.18384v3",
    "pdf_url": "https://arxiv.org/pdf/2510.18384v3.pdf",
    "title": "Diagnostics of a Multicusp-Assisted Inductively-Coupled Radio-Frequency Plasma Source for Plasma Immersion Ion Implantation",
    "abstract": "In this article, we present a detailed characterisation of a multicusp-assisted inductively coupled RF plasma source for plasma immersion ion implantation (PIII). Using laser-induced fluorescence (LIF) and RF-compensated Langmuir probe diagnostics, we measured ion temperature T i and drift velocity v z in argon plasmas near an immersed electrode. The multicusp configuration enhances plasma density at low pressure, enabling stable operation down to 0.8 mTorr. Timeaveraged measurements show no detectable perturbation near the pulsed electrode, indicating full plasma recovery between high-voltage pulses. LIF-derived potential profiles match Riemann's presheath theory, and ion velocity distributions reveal acceleration consistent with sheath dynamics. These results support the use of LIF for steady-state characterisation of the bulk and presheath regions in PIII systems.",
    "authors": [
      "Moreno Joel",
      "Jimenez Marilyn",
      "Okerstrom Daniel",
      "Bradley Michael P.",
      "Couëdel Lénaïc"
    ],
    "published": "2025-10-21T08:03:30Z",
    "updated": "2026-01-14T10:45:18Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.22308v2",
    "url": "https://arxiv.org/abs/2511.22308v2",
    "pdf_url": "https://arxiv.org/pdf/2511.22308v2.pdf",
    "title": "Timing resolution from very thin LGAD sensors tested on particle beam down to 12 ps",
    "abstract": "The paper reports on the timing resolution obtained with the Low-Gain Avalanche Diode (LGAD) sensors for extreme fluences at the DESY Test Beam Facility with 4 GeV/c electrons. The LGADs adopt an $n$-in-$p$ technology with a $p^{+}$-type boron gain implant, co-implanted with carbon to mitigate acceptor deactivation. The substrate thickness of the sensors varies from 20 $μ$m to 45 $μ$m, with an active area spanning from 0.75 $\\times$ 0.75 to 1.28 $\\times$ 1.28 mm$^{2}$. A set of 30 $μ$m sensors irradiated with neutrons at fluences between 4 $\\times$ 10$^{14}$ and 2.5 $\\times$ 10$^{15}$ n$_{\\textrm{1 MeV eq.}}$cm$^{-2}$ were tested on the beam. The gain was measured between 7 and 40 across all non-irradiated sensors in the study, and between 7 and 30 in irradiated sensors. The experimental setup consisted of a 45 $μ$m-thick trigger sensor with an active area of 3.6 $\\times$ 3.6 mm$^{2}$, four device-under-test (DUT) planes, and a Photonis micro-channel plate photomultiplier tube (MCP) as a time reference. The timing resolution was calculated from Gaussian fitting of the difference in times of arrival of a particle at a DUT and the MCP, using the constant fraction discrimination technique. A timing resolution of 26.4 ps was achieved in 45 $μ$m sensors, and down to 16.6 ps in 20 $μ$m sensors. The combination of two 20 $μ$m LGAD sensors reached a timing resolution of 12.2 ps. A timing resolution of below 20 ps was obtained in all irradiated 30 $μ$m sensors.",
    "authors": [
      "Robert Stephen White",
      "Marco Ferrero",
      "Valentina Sola",
      "Anna Rita Altamura",
      "Roberta Arcidiacono",
      "Maurizio Boscardin",
      "Nicolo Cartglia",
      "Matteo Centis Vignali",
      "Tommaso Croci",
      "Matteo Durando",
      "Simone Galletto",
      "Alessandro Fondacci",
      "Leonardo Lanteri",
      "Luca Menzio",
      "Francesco Moscatelli",
      "Giovanni Paternoster",
      "Federico Siviero"
    ],
    "published": "2025-11-27T10:39:44Z",
    "updated": "2026-01-14T10:03:41Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.14884v2",
    "url": "https://arxiv.org/abs/2509.14884v2",
    "pdf_url": "https://arxiv.org/pdf/2509.14884v2.pdf",
    "title": "Applying reinforcement learning to optical cavity locking tasks: considerations on actor-critic architectures and real-time hardware implementation",
    "abstract": "This proceedings contains our considerations made during and after fruitful discussions held at EuCAIFCon 2025. We explore the use of deep reinforcement learning for autonomous locking of Fabry-Perot optical cavities in non-linear regimes, with relevance to gravitational-wave detectors. A custom Gymnasium environment with a time-domain simulator enabled training of agents such as deep deterministic policy gradient, achieving reliable lock acquisition for both low- and high-finesse cavities, including Virgo-like parameters. We also discuss possible improvements with Twin Delayed DDPG, Soft Actor Critic and meta-reinforcement learning, as well as strategies for low-latency execution and off-line policy updates to address hardware limitations. These studies lay the groundwork for future deployment of reinforcement learning-based control in real optical setups.",
    "authors": [
      "Mateusz Bawaj",
      "Andrea Svizzeretto"
    ],
    "published": "2025-09-18T12:06:40Z",
    "updated": "2026-01-14T10:01:13Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.05069v2",
    "url": "https://arxiv.org/abs/2507.05069v2",
    "pdf_url": "https://arxiv.org/pdf/2507.05069v2.pdf",
    "title": "Towards replacing detector simulation with heterogeneous GNNs in flavour physics analyses",
    "abstract": "Driven by the increasing volume of recorded data, the demand for simulation from experiments based at the Large Hadron Collider will rise sharply in the coming years. Addressing this demand solely with existing computationally intensive workflows is not feasible. This paper introduces a new fast simulation tool designed to address this demand at the LHCb experiment. This tool emulates the detector response to arbitrary multibody decay topologies at LHCb. Rather than memorising specific decay channels, the model learns generalisable patterns within the response, allowing it to interpolate to channels not present in the training data. Novel heterogeneous graph neural network architectures are employed that are designed to embed the physical characteristics of the task directly into the network structure. We demonstrate the performance of the tool across a range of decay topologies, showing the networks can correctly model the relationships between complex variables. The architectures and methods presented are generic and could readily be adapted to emulate workflows at other simulation-intensive particle physics experiments.",
    "authors": [
      "Guillermo Hijano",
      "Davide Lancierini",
      "Alexander Mclean Marshall",
      "Andrea Mauri",
      "Patrick Owen",
      "Mitesh Patel",
      "Konstantinos Petridis",
      "Shah Rukh Qasim",
      "Nicola Serra",
      "William Sutcliffe",
      "Hanae Tilquin"
    ],
    "published": "2025-07-07T14:51:19Z",
    "updated": "2026-01-14T09:04:42Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1103/k9ls-9pwc"
  },
  {
    "arxiv_id": "2601.09764v1",
    "url": "https://arxiv.org/abs/2601.09764v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09764v1.pdf",
    "title": "DC response of an interferometer topology with an L-shaped cavity: a tabletop study",
    "abstract": "A new interferometer topology for kilohertz gravitational-wave detection was recently proposed in [Zhang et al. Phys. Rev. X 13, 021019 (2023)]. The design is based on an L-shaped optical cavity pumped through a Sagnac-like vortex. We report a tabletop experiment that characterizes the interferometer's optical response near DC. When the laser frequency is locked to the resonance of the L-shaped cavity, we observe that the cavity input coupler becomes effectively transparent, yielding a simple Michelson-like response. Moreover, the Sagnac vortex separates into upper and lower paths, which behave as two independent pumping paths driving the cavity. These observations are in agreement with theoretical predictions. Our results provide an intuitive physical picture of this interferometer topology and offer insight into its lock acquisition strategy.",
    "authors": [
      "Junlang Li",
      "Jiehong Huang",
      "Xinyao Guo",
      "Haixing Miao",
      "Yuchao Chen",
      "Xiaoman Huang",
      "Yuan Pan",
      "Chenjie Zhou",
      "Raffaele Flaminio",
      "Jameson Graef Rollins",
      "Bram Slagmolen",
      "Fan Zhang",
      "Teng Zhang",
      "Mengyao Wang"
    ],
    "published": "2026-01-14T08:59:01Z",
    "updated": "2026-01-14T08:59:01Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "gr-qc",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.08054v2",
    "url": "https://arxiv.org/abs/2601.08054v2",
    "pdf_url": "https://arxiv.org/pdf/2601.08054v2.pdf",
    "title": "The Topological Origin of Bohm Resistivity in Magnetic Reconnection",
    "abstract": "The physical origin of 'anomalous' resistivity in magnetic reconnection remains one of the longest-standing problems in space plasma physics. While the empirical Bohm diffusion scaling ($η~\\propto~T/B$) is widely invoked to explain fast reconnection rates, it lacks a rigorous derivation from first principles. Here, we derive this scaling by modeling the magnetized electron fluid as an overdamped spintronic condensate governed by the Landau-Lifshitz-Gilbert equation. We demonstrate that the breakdown of the \"frozen-in\" condition is rigorously identified as an Adler-Ohmic bifurcation in the model: a topological phase transition where electron gyro-axes lose synchronization with the magnetic field. By rigorously mapping the breakdown of adiabatic invariance to electron gyro axis slippage on the unit sphere, we show that the resulting resistivity naturally saturates at the Bohm limit. Numerical simulations of the $XY$ universality class confirm that the onset of this resistive state is explosive, following a logistic trigger consistent with the impulsive phase of solar flares. Furthermore, the topological defects in the condensate decay via a $t^{-0.75}$ power law, consistent with magnetic island coalescence as the mechanism of anomalous transport. These results suggest that Bohm resistivity is a universal topological property of magnetized matter at the critical point of reconnection.",
    "authors": [
      "Magnus F Ivarsen"
    ],
    "published": "2026-01-12T22:48:40Z",
    "updated": "2026-01-14T08:52:37Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR",
      "cond-mat.soft",
      "cond-mat.stat-mech",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.09189v1",
    "url": "https://arxiv.org/abs/2601.09189v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09189v1.pdf",
    "title": "Experimental verification of the conservation of the magnetic moment and the longitudinal invariant",
    "abstract": "Adiabatic invariants are fundamental to plasma physics but are often treated as purely theoretical concepts in undergraduate courses due to the difficulty of experimentally demonstrating them. This paper presents a pedagogical experiment to visualize and quantitatively verify the conservation of the magnetic moment ($μ$) and the longitudinal invariant ($J$) using a standard educational electron charge-to-mass ratio apparatus configured as a magnetic bottle. By analyzing long-exposure photographs of the electron beam trajectory, we reconstructed the helical motion and calculated the invariants under different magnetic field configurations. Our results verify the conservation of the longitudinal invariant ($J$) with a ratio of 0.98 between configurations. The magnetic moment ($μ$) exhibited a coefficient of variation of approximately 7\\%, a deviation consistent with the presence of collisional effects in the tube. These findings demonstrate that complex plasma dynamics can be effectively studied using accessible laboratory equipment, providing a valuable bridge between theory and experiment for physics students.",
    "authors": [
      "Juan Carlos Agurto",
      "Felipe Darmazo",
      "Amanda Guerra",
      "Erick Burgos-Parra"
    ],
    "published": "2026-01-14T05:42:02Z",
    "updated": "2026-01-14T05:42:02Z",
    "categories": [
      "physics.ed-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.ed-ph"
  },
  {
    "arxiv_id": "2601.09135v1",
    "url": "https://arxiv.org/abs/2601.09135v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09135v1.pdf",
    "title": "Transient fields in oblique scattering from an infinite planar dielectric interface -- a qubit lattice simulation",
    "abstract": "An initial value algorithm is utilized to examine the time dependent evolution of the electromagnetic fields arising from oblique scattering of bounded pulses from an infinite planar dielectric interface. Since the qubit lattice algorithm (QLA) is almost fully unitary, one finds excellent conservation of electromagnetic energy. Various Gaussian envelope pulses are considered in regimes where the incident angle is below that needed for total internal reflection. While the reflected pulse retains its overall Gaussian shape, the transmitted pulse exhibits a combination of a Gaussian envelope along with Huygen-like emitted wave fronts from the collision point of the initial pulse with the infinite dielectric interface. The strength of these Huygen wavefronts depends on the width of the incident pulse.",
    "authors": [
      "Min Soe",
      "George Vahala",
      "Linda Vahala",
      "Efstratios Koukoutsis",
      "Abhay K. Ram",
      "Kyriakos Hizanidis"
    ],
    "published": "2026-01-14T04:18:42Z",
    "updated": "2026-01-14T04:18:42Z",
    "categories": [
      "quant-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2601.09055v1",
    "url": "https://arxiv.org/abs/2601.09055v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09055v1.pdf",
    "title": "Multi parameter discrimination using multiple spectral troughs in a cascaded fiber sensor",
    "abstract": "Accurate monitoring of temperature, axial strain, and refractive index is critical for structural health monitoring, industrial process control, and environmental sensing. However, conventional optical fiber sensors are often limited by strong parameter cross sensitivity, poor discrimination capability, and increased system complexity when multiple sensing units are required. In this work, a compact multi-parameter optical fiber sensing platform is proposed based on a cascaded single-mode fiber, multimode fiber, and long-period fiber grating structure, combined with a wavelength-based spectral demodulation strategy. Within the cascaded configuration, multiple characteristic spectral troughs arising from distinct physical mechanisms coexist in a single transmission spectrum. Interference-induced troughs are generated by the multimode fiber section, while a resonance-induced trough is introduced by the long-period fiber grating. Although none of these troughs responds exclusively to a single parameter, each exhibits simultaneous and linearly independent responses to temperature, axial strain, and refractive index with distinct sensitivity magnitudes and trends. Consequently, each trough can be described by a unique sensitivity vector, enabling robust multi-parameter discrimination through multi-wavelength spectral demodulation.",
    "authors": [
      "Riming Xu",
      "Yanbo Li",
      "Xingnan Chen",
      "Jin Wang"
    ],
    "published": "2026-01-14T00:49:19Z",
    "updated": "2026-01-14T00:49:19Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2601.09047v1",
    "url": "https://arxiv.org/abs/2601.09047v1",
    "pdf_url": "https://arxiv.org/pdf/2601.09047v1.pdf",
    "title": "Unperturbed-orbit integration and the 3D kinetic dispersion relation of the electron cyclotron drift instability",
    "abstract": "High-frequency instabilities in crossed-field ($\\bm E\\times\\bm B$) plasmas are widely implicated in anomalous cross-field electron transport in Hall thrusters and related devices. Building on the fully kinetic 3D electrostatic dispersion relations reported by Ducrocq \\emph{et al.} and later by Lafleur \\emph{et al.}, we provide a concise, self-contained derivation of the key missing step: the magnetized-electron density perturbation $n_{e1}$ obtained from the linearized Vlasov equation via a retarded integration along unperturbed orbits, including finite-Larmor-radius effects and cyclotron harmonics. We collect the required mathematical identities in appendices and clarify the mapping between the Ducrocq Poisson-form and the Lafleur dielectric-form representations, including ion closures (cold-fluid versus kinetic Landau response). We conclude with a brief discussion of the assumptions and possible extensions toward more realistic configurations.",
    "authors": [
      "Yinjian Zhao"
    ],
    "published": "2026-01-14T00:30:22Z",
    "updated": "2026-01-14T00:30:22Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.11890v2",
    "url": "https://arxiv.org/abs/2510.11890v2",
    "pdf_url": "https://arxiv.org/pdf/2510.11890v2.pdf",
    "title": "Loading non-Maxwellian Velocity Distributions in Particle Simulations",
    "abstract": "Numerical procedures for generating non-Maxwellian velocity distributions in particle simulations are presented. First, Monte Carlo methods for an $(r,q)$ distribution that generalizes flattop and kappa distributions are discussed. Then, two rejection methods for the regularized kappa distribution are presented, followed by a comparison in the $κ$ space. A simple recipe is proposed for the subtracted kappa distribution. Properties and numerical recipes for the ring and shell distributions with a finite Gaussian width are discussed. The ring and shell Maxwellians are further introduced as alternatives to the ring and shell distributions. Finally, methods for the super-Gaussian and the filled-shell distributions are presented.",
    "authors": [
      "Seiji Zenitani",
      "Shunsuke Usami",
      "Shuichi Matsukiyo"
    ],
    "published": "2025-10-13T19:49:16Z",
    "updated": "2026-01-13T23:25:44Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph",
      "physics.space-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2601.08934v1",
    "url": "https://arxiv.org/abs/2601.08934v1",
    "pdf_url": "https://arxiv.org/pdf/2601.08934v1.pdf",
    "title": "Hybrid-Contact Planar HPGe Process Vehicle Toward Ring-Contact Designs",
    "abstract": "Rare-event searches including dark matter, coherent elastic neutrino--nucleus scattering (CE$ν$NS), and neutrinoless double-beta decay (0$νββ$) require high-purity germanium (HPGe) detectors with ultralow noise, stable backgrounds, and electrode geometries that can scale to larger single-crystal masses. Ring-contact (ring-and-groove) designs address scalability by shaping the electric field to preserve low-capacitance readout, but their nonplanar topology motivates a lithium-contact process that is compatible with conformal deposition and robust high-voltage operation. As a process demonstration toward future ring-contact prototypes, we fabricate and characterize a hybrid-contact planar HPGe device, KL01. Here, ``hybrid'' denotes an $n^{+}$ contact formed by an in-house lithium-suspension paint followed by controlled thermal diffusion, combined with an AJA-developed a-Ge/Al $p^{+}$ contact and a-Ge sidewall passivation. At 77~K the device exhibits pA-scale leakage current under kV bias, a depletion plateau near $V_{\\mathrm{dep}}\\approx 1300$~V, and energy resolutions of 1.57~keV FWHM at 59.5~keV and 2.57~keV FWHM at 662~keV. These results validate the compatibility of the paint-and-diffuse lithium process with thin-film a-Ge/Al contacts and establish a practical fabrication workflow to be extended to ring-and-groove electrodes for next-generation rare-event HPGe modules.",
    "authors": [
      "Kunming Dong",
      "Dongming Mei",
      "Shasika Panamaldeniya",
      "Anupama Karki",
      "Patrick Burns",
      "Sanjay Bhataarai"
    ],
    "published": "2026-01-13T19:12:53Z",
    "updated": "2026-01-13T19:12:53Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.08910v1",
    "url": "https://arxiv.org/abs/2601.08910v1",
    "pdf_url": "https://arxiv.org/pdf/2601.08910v1.pdf",
    "title": "Towards a Self-Driving Trigger at the LHC: Adaptive Response in Real Time",
    "abstract": "Real-time data filtering and selection -- or trigger -- systems at high-throughput scientific facilities such as the experiments at the Large Hadron Collider (LHC) must process extremely high-rate data streams under stringent bandwidth, latency, and storage constraints. Yet these systems are typically designed as static, hand-tuned menus of selection criteria grounded in prior knowledge and simulation. In this work, we further explore the concept of a self-driving trigger, an autonomous data-filtering framework that reallocates resources and adjusts thresholds dynamically in real-time to optimize signal efficiency, rate stability, and computational cost as instrumentation and environmental conditions evolve. We introduce a benchmark ecosystem to emulate realistic collider scenarios and demonstrate real-time optimization of a menu including canonical energy sum triggers as well as modern anomaly-detection algorithms that target non-standard event topologies using machine learning. Using simulated data streams and publicly available collision data from the Compact Muon Solenoid (CMS) experiment, we demonstrate the capability to dynamically and automatically optimize trigger performance under specific cost objectives without manual retuning. Our adaptive strategy shifts trigger design from static menus with heuristic tuning to intelligent, automated, data-driven control, unlocking greater flexibility and discovery potential in future high-energy physics analyses.",
    "authors": [
      "Shaghayegh Emami",
      "Cecilia Tosciri",
      "Giovanna Salvi",
      "Zixin Ding",
      "Yuxin Chen",
      "Abhijith Gandrakota",
      "Christian Herwig",
      "David W. Miller",
      "Jennifer Ngadiuba",
      "Nhan Tran"
    ],
    "published": "2026-01-13T19:00:02Z",
    "updated": "2026-01-13T19:00:02Z",
    "categories": [
      "physics.ins-det",
      "cs.AI",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2601.08830v1",
    "url": "https://arxiv.org/abs/2601.08830v1",
    "pdf_url": "https://arxiv.org/pdf/2601.08830v1.pdf",
    "title": "Forbidden second harmonics in centrosymmetric bilayer crystals",
    "abstract": "Optical spectroscopy based on second-order nonlinearity is a critical technique for characterizing two-dimensional (2D) crystals as well as bioimaging and quantum optics. It is generally believed that second-harmonic generation (SHG) in centrosymmetric crystals, such as graphene and other bilayer 2D crystals, is negligible without externally breaking the inversion symmetry. Here, we show that with a new homodyne detection technique, we can apparently circumvent this symmetry-imposed constraint and observe robust SHG in pristine centrosymmetric crystals, without any symmetry-breaking field. With its exceptional sensitivity, we resolve polarization-resolved SHG in bilayer hexagonal boron nitride (h-BN), bilayer 2H-WSe$_2$, and remarkably, Bernal-stacked bilayer graphene, allowing us to unambiguously identify the crystallographic orientation in these crystals via SHG for the first time. We also demonstrate that the new technique can be used to non-invasively detect uniaxial strain and optical geometric phase in these crystals. The observed SHG in our experiments is attributed to second-order nonlinearity in the quadrupole channel, which is controlled by the presence of the $C_2$ symmetry instead of the inversion symmetry. Our new technique expands the capability of nonlinear optical spectroscopy to encompass a large class of centrosymmetric materials that could never be measured before, and can be used for quantum sensing of moiré materials and twisted epitaxial films.",
    "authors": [
      "Haoning Tang",
      "Zhitong Ding",
      "Tianyi Ruan",
      "Zeyu Hao",
      "Kenji Watanabe",
      "Takashi Taniguchi",
      "Haozhe Wang",
      "Ali Javey",
      "Feng Wang",
      "Yuan Cao"
    ],
    "published": "2026-01-13T18:59:53Z",
    "updated": "2026-01-13T18:59:53Z",
    "categories": [
      "cond-mat.mes-hall",
      "cond-mat.mtrl-sci",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "cond-mat.mes-hall"
  }
]