{
  "arxiv_id": "2501.18529v3",
  "url": "https://arxiv.org/abs/2501.18529v3",
  "pdf_url": "https://arxiv.org/pdf/2501.18529v3.pdf",
  "title": "Characterization of NBI-driven shear Alfvén waves in the TJ-II   stellarator using Mirnov probes and electrostatic potential fluctuation   measurements",
  "abstract": "We present the first experimental measurements of the toroidal mode number of shear Alfv\\'en waves in the TJ-II stellarator. A series of experiments were carried out in three different magnetic configurations to investigate counter-NBI driven modes. Co- and counter- electron-cyclotron current drive was used to modify the rotational transform (\\iotabar) profile leading to the destabilization of a varied set of Alfv\\'en eigenmodes with different frequencies and mode numbers. To characterize the spatial structure of the modes we have used two Mirnov probe arrays, one dedicated to the measurement of the poloidal mode number and the other, a recently commissioned helical tri-axial array, dedicated to the measurement of the toroidal mode number. A heavy ion beam probe, operated in radial sweep mode, was employed to characterize the radial location of the modes. We show that the induced changes in \\iotabar, that are fundamental when it comes to validation studies, cannot be measured experimentally with motional Stark effect so, instead, the shielding current diffusion equation is solved in cylindrical geometry to estimate these changes. We calculate the incompressible shear Alfv\\'en continuum for selected cases using \\texttt{STELLGAP} and find reasonable consistency with observations. A database with the observed modes has been created, so that it can be used in future work for theory validation purposes.",
  "authors": [
    "P. Pons-Villalonga",
    "Á. Cappa",
    "E. Ascasíbar",
    "O. S. Kozachok",
    "M. B. Dreval",
    "K. J. McCarthy",
    "J. de la Riva Villén",
    "J. Martínez-Fernández",
    "TJ-II Team"
  ],
  "published": "2025-01-30T17:51:29Z",
  "updated": "2025-09-23T18:41:01Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}