{
  "arxiv_id": "2509.18558v1",
  "url": "https://arxiv.org/abs/2509.18558v1",
  "pdf_url": "https://arxiv.org/pdf/2509.18558v1.pdf",
  "title": "Polarization Transmission in the Electron-Ion Collider's Hadron Storage   Ring",
  "abstract": "The successful operation of the future Electron-Ion Collider is contingent on maintaining high hadron beam polarization up to 275 GeV. The Hadron Storage Ring lattice, however, features a symmetry-breaking interaction region that excites strong, non-systematic spin resonances, posing a significant threat to polarization preservation. This paper systematically investigates two complementary strategies to ensure high polarization transmission. The first method involves optimizing the vertical betatron phase advance between Siberian snakes to orchestrate a cancellation of depolarizing kicks across the ring. We demonstrate through simulations that both dynamic and fixed-optics solutions based on this principle can successfully preserve polarization through the strongest resonances. The second, more powerful approach involves optimizing the snake rotation axes to suppress resonance driving terms at their source. We revisit established symmetric configurations, such as the Lee-Courant schemes, and introduce a novel, highly symmetric ``Doubly Lee-Courant\" (DLC) scheme, which enforces a local \\(\\pi\\) spin phase advance across every consecutive pair of snakes. Our analysis reveals a clear performance hierarchy, with the DLC configuration providing an exceptionally robust and energy-insensitive baseline for polarization preservation. We conclude that a hybrid strategy, using a DLC snake scheme as a symmetric foundation and betatron phase tuning for fine corrections, offers the most effective path forward for the EIC and future high-energy polarized beam facilities.",
  "authors": [
    "Eiad Hamwi",
    "Georg H. Hoffstaetter"
  ],
  "published": "2025-09-23T02:32:55Z",
  "updated": "2025-09-23T02:32:55Z",
  "categories": [
    "physics.acc-ph"
  ],
  "primary_category": "physics.acc-ph"
}