{
  "arxiv_id": "2510.26747v2",
  "url": "https://arxiv.org/abs/2510.26747v2",
  "pdf_url": "https://arxiv.org/pdf/2510.26747v2.pdf",
  "title": "Spectral Deconvolution without the Deconvolution: Extracting Temperature from X-ray Thomson Scattering Spectra without the Source-and-Instrument Function",
  "abstract": "X-ray Thomson scattering (XRTS) probes the dynamic structure factor of the system, but the measured spectrum is broadened by the combined source-and-instrument function (SIF) of the setup. In order to extract properties such as temperature from an XRTS spectrum, the broadening by the SIF needs to be removed. Recent work [Dornheim et al. Nature Commun. 13, 7911 (2022)] has suggested that the SIF may be deconvolved using the two-sided Laplace transform. However, the extracted information can depend strongly on the shape of the input SIF, and the SIF is in practice challenging to measure accurately. Here, we propose an alternative approach: we demonstrate that considering ratios of Laplace-transformed XRTS spectra collected at different scattering angles is equivalent to performing the deconvolution, but without the need for explicit knowledge of the SIF. From these ratios, it is possible to directly extract the temperature from the scattering spectra, when the system is in thermal equilibrium. We find the method to be generally robust to spectral noise and physical differences between the spectrometers, and we explore situations in which the method breaks down. Furthermore, the fact that consistent temperatures can be extracted for systems in thermal equilibrium indicates that non-equilibrium effects could be identified by inconsistent temperatures of a few eV between the ratios of three or more scattering angles.",
  "authors": [
    "Thomas Gawne",
    "Alina Kononov",
    "Andrew Baczewski",
    "Hannah Bellenbaum",
    "Maximilian P Böhme",
    "Zhandos Moldabekov",
    "Thomas R Preston",
    "Sebastian Schwalbe",
    "Jan Vorberger",
    "Tobias Dornheim"
  ],
  "published": "2025-10-30T17:40:50Z",
  "updated": "2026-02-23T16:11:24Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}