{
  "arxiv_id": "2512.16643v2",
  "url": "https://arxiv.org/abs/2512.16643v2",
  "pdf_url": "https://arxiv.org/pdf/2512.16643v2.pdf",
  "title": "Temperature dependence of the long-term annealing behavior of neutron irradiated diodes from 8-inch p-type silicon wafers",
  "abstract": "To face the higher levels of radiation due to the 10-fold increase in integrated luminosity during the High-Luminosity LHC, the CMS detector will replace the current Calorimeter Endcap (CE) using the High-Granularity Calorimeter (HGCAL) concept. The high-radiation regions of the the CE, where fluences between $1\\cdot10^{14}~n_{eq}/cm^{2}$ and $1\\cdot10^{16}~n_{eq}/cm^{2}$ and doses of up to 2\\,MGy are expected considering an integrated luminosity of $3\\,ab^{-1}$, will be equipped with silicon pad sensors. This includes the entire electromagnetic as well as parts of the hadronic section of the CE. The silicon sensors are processed on 8-inch p-type wafers with an active thickness of 300\\,\\textmu m, 200\\,\\textmu m and 120\\,\\textmu m and cut into hexagonal shapes for optimal use of the full wafer area and tiling. With each main sensor, several small test structures (e.g. pad diodes) are hosted on the wafers, used for quality assurance and radiation hardness tests. In order to investigate the radiation-induced bulk damage, these diodes have been irradiated with reactor neutrons at JSI (Jozef Stefan Institute, Ljubljana, Slovenia) to fluences between $5\\cdot10^{14}~n_{eq}/cm^{2}$ and $1.5\\cdot10^{16}~n_{eq}/cm^{2}$. This study focuses on the isothermal annealing behavior of the bulk material at different temperatures between 5.5°C and 60°C using electrical characterization and charge collection measurements. The results are used to extract the annealing time constants for this material and fluence range based on the Hamburg model approach to allow an estimation of the expected annealing effects in silicon sensors during the year-end technical stops and the long HL-LHC shutdowns. The annealing parameters found will make it possible to model the annealing behavior of p-type silicon detector projects at HL-LHC fluence ranges better than the existing Hamburg model.",
  "authors": [
    "Leena Diehl",
    "Oliwia Kaluzinska",
    "Marie Mühlnikel",
    "Max Andersson",
    "Natalya Gerassyova",
    "Jenan Amer",
    "Eva Sicking",
    "Dana Groner",
    "Jan Kieseler",
    "Matteo Defranchis"
  ],
  "published": "2025-12-18T15:15:21Z",
  "updated": "2026-02-23T14:38:44Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}