{
  "arxiv_id": "2601.00441v2",
  "url": "https://arxiv.org/abs/2601.00441v2",
  "pdf_url": "https://arxiv.org/pdf/2601.00441v2.pdf",
  "title": "Magnetic plasmoid explosions in the context of magnetar giant flares and fast radio bursts",
  "abstract": "Magnetar flares are highly energetic and rare events in which intense X and γ-ray emission is released from strongly magnetised neutron stars. The events are also accompanied by mass ejection from the neutron star. Fast radio bursts are short and intense pulses of coherent radio emission. Their large dispersion measures support an extragalactic origin. While their exact origin still remains elusive, a substantial number of models associates them with strong magnetic field and high-energy relativistic plasma found in the vicinity of magnetars. There is growing evidence that some fast radio bursts are associated with flare-type events from magnetars. We provide a set of configurations describing a relativistic, spherical, magnetic plasmoid explosion. We proceed by solving the equations of relativistic magnetohydrodynamics for a system that expands while maintaining its internal equilibrium. We find the interdependent relation between pressure, mass density, Lorentz factor, and magnetic field that determines the detailed properties of the solutions. A dichotomy of solutions exists that correspond to higher and lower density and thermal pressure compared to the external one. For stronger toroidal magnetic fields, the maximum permitted expansion velocity becomes lower than the weaker toroidal fields. These solution classes can be applied to magnetar giant flares and fast radio bursts. Those that corresponding to over densities and higher pressure can be associated with magnetar flares, and those corresponding to underdensities can be relevant to fast radio bursts that correspond to magnetically dominated events with low mass loading. [Abridged]",
  "authors": [
    "Konstantinos N. Gourgouliatos"
  ],
  "published": "2026-01-01T19:00:14Z",
  "updated": "2026-02-22T18:15:37Z",
  "categories": [
    "astro-ph.HE",
    "physics.plasm-ph"
  ],
  "primary_category": "astro-ph.HE"
}