{
  "arxiv_id": "2602.20369v1",
  "url": "https://arxiv.org/abs/2602.20369v1",
  "pdf_url": "https://arxiv.org/pdf/2602.20369v1.pdf",
  "title": "LANTERN: Characterization technology for low threshold cryogenic detectors",
  "abstract": "The use of low-temperature detectors, such as cryogenic calorimeters, has pioneered the recent advancements in low-energy rare event searches. These detectors provide a low-noise environment essential for the direct detection of dark matter and neutrinos. Characterizing these detectors within the region of interest (ROI), typically spanning from O(10~eV) to O(1~keV), has proven to be a challenging task. Conventional radioactive sources produce signals above this range, leading to nonlinearities and saturation effects. Moreover, these detectors are usually deployed in low background environments, meaning that having a radioactive source during physics runs can spoil the measurement making the use of this type of solution unfeasible.   As a solution to these issues, we introduce LANTERN, an optical calibration system designed for highly segmented cryogenic calorimeters. LANTERN utilizes the photostatistics resulting from the absorption of monochromatic UV-Vis photons emitted by LEDs to analyze the detector response curve, without needing prior knowledge of the total energy deposited. The system employs a fast-switching LED matrix that operates at excitation times faster than the typical response of cryogenic detectors and can currently characterize up to 64 calorimeters independently.   In this work, the validation of the final electronics designed for the project is shown. The first test was carried out by calibrating one of the cryogenic detectors of the BULLKID-DM experiment and checking the energy-reconstruction error of the spectral features produced by the surrounding lead casing. An error of $\\approx 2\\%$ has been observed in the energy reconstruction. The second validation was carried out by cross-calibrating one of the CALDER thin detectors with a commercial LED driver, and compatible results between the two setups were achieved.",
  "authors": [
    "Giorgio Del Castello"
  ],
  "published": "2026-02-23T21:14:10Z",
  "updated": "2026-02-23T21:14:10Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}