{
  "arxiv_id": "2602.19472v1",
  "url": "https://arxiv.org/abs/2602.19472v1",
  "pdf_url": "https://arxiv.org/pdf/2602.19472v1.pdf",
  "title": "Three Dimensional Multiphysics Modelling of Helicon Wave Heating and Antenna Plasma Coupling for Boundary Density Control in Toroidal Fusion Plasmas",
  "abstract": "Active control of scrape off layer density is emerging as a critical requirement for improving ion cyclotron resonance heating and enabling high performance steady state operation in future magnetic confinement fusion devices. Helicon wave excitation offers a promising physics based approach to generating high density boundary plasmas with high ionization efficiency and low impurity release. In this work, we develop THEMIS code, a fully three dimensional (3D) multiphysics model of helicon wave propagation and power deposition in a toroidal fusion relevant configuration, employing a finite temperature thermal dielectric tensor. The code quantifies the relative contributions of Doppler shifted cyclotron damping, anomalous Doppler damping, collisional damping, and Landau damping, and demonstrates that slow wave propagation and electron Landau damping dominate the accessible heating regime in Helimak device. A comparative study of four planar antenna geometries under the present protruding window configuration shows that geometric cutoffs and SOL density gradients severely limit power penetration into the core accessible region. To address this constraint, we introduce a recessed window launch scheme that positions the dielectric window inside the vacuum vessel and perform systematic parameter scans of window position, antenna geometry, and installation orientation. From these analyses, we identify the key physics driven principles governing efficient helicon wave coupling: the importance of open circuit termination, maximized strap length and width, controlled inter turn spacing, and sufficient clearance from metallic walls to avoid near field suppression. Guided by these principles, we designed an optimized racetrack spiral antenna that increases coupling efficiency by more than an order of magnitude compared with conventional short circuited rectangular spiral antenna.",
  "authors": [
    "Hua Zhou",
    "Lei Chang",
    "GuoSheng Xu",
    "YiWei Zhang",
    "Matthew Hole",
    "Dan Du",
    "ZhiSong Qu",
    "MuQuan Wu"
  ],
  "published": "2026-02-23T03:31:03Z",
  "updated": "2026-02-23T03:31:03Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}