{
  "arxiv_id": "2511.16185v2",
  "url": "https://arxiv.org/abs/2511.16185v2",
  "pdf_url": "https://arxiv.org/pdf/2511.16185v2.pdf",
  "title": "Multiplexed SiPM Readout of Plastic Scintillating Fiber Detector for Muon Tomography",
  "abstract": "Muon tomography is a non-destructive imaging technique that uses cosmic-ray muons to probe dense materials. A plastic Scintillating Fiber (SciFi) detector with a one-dimensional SiPM array offers a compact and high-resolution solution. However, constructing a large-area SciFi detector demands reducing the number of readout channels while maintaining detector performance. To address this challenge, we present a multiplexing scheme based on a diode-based symmetric charge division circuit combined with a position-encoding algorithm, enabling up to $N_{\\textrm{SiPM}}^{\\textrm{max}}=C^{2}_{N_{\\textrm{ele}}}$ SiPM channels to be read out using only ${N_{\\textrm{ele}}}$ electronic channels. Circuit simulations confirm the feasibility of the multiplexing design and guide the choice of appropriate diodes to preserve SiPM signal integrity. A multiplexed SciFi detector module comprising 21 SiPM channels read out through 7 electronic channels are constructed. Electronic tests show that this module exhibits low crosstalk between electronic channels, and preserves linearity over a dynamic range from $\\sim$10 to 122 photoelectrons. Cosmic-ray measurements further show that the multiplexed SciFi detector achieves a detection efficiency above 95\\% and a spatial resolution of about 0.65~mm, with only minor degradation compared to the direct (per SiPM channel) readout. These results verify that the proposed method provides a scalable and cost-effective readout solution for large-area muon tomography systems.",
  "authors": [
    "Chenghan Lv",
    "Kun Hu",
    "Huiling Li",
    "Hui Liang",
    "Cong Liu",
    "Hongbo Wang",
    "Zibing Wu",
    "Weiwei Xu"
  ],
  "published": "2025-11-20T09:50:13Z",
  "updated": "2025-11-23T02:09:26Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}