{
  "arxiv_id": "2511.17395v1",
  "url": "https://arxiv.org/abs/2511.17395v1",
  "pdf_url": "https://arxiv.org/pdf/2511.17395v1.pdf",
  "title": "Investigating the growth cycles of titania and carbonaceous nano dusty plasmas",
  "abstract": "Solid nanoparticles which range in size from 1 to 500 nm can spontaneously grow from reactive gaseous precursors in nonthermal plasmas. This dissertation studies the particle size, and growth time with and without a background magnetic field in the plasma. Traditionally, studies have focused on the growth of either carbonaceous or silicate dust from either acetylene or silane, respectively. However, recently, there have been a shift towards studying new kinds of dust. For example, recent studies have grown polymers and metallic dust. This dissertation first introduces and studies the growth of titanium dioxide dust from the metal-organic vapor precursor of titanium tetraisopropoxide. The as-grown materials are amorphous but high temperature annealing crystallizes the samples into anatase and subsequently rutile. Then, the growth of titania dusty plasma is and compared to the growth of carbonaceous dust from acetylene, in argon plasma. They are grown during the presence and absence of weak magnetic fields of 500 Gauss. Both kinds of dust growth exhibit a growth cycle, which had already been shown for various nano dusty plasma. This occurs because once the dust accumulates a critical radius and mass, they move away from the central region of the plasma, allowing a new generation of growth begins. Ultimately, the new generation of growth also moves away leading to a continuous cycle of particle formation and transport as long as the plasma is on. However, with the presence of the magnetic field, the cycle time decreases, and the spatial distribution of the dust cloud appears differently. Finally, we focus on the growth cycle time of carbonaceous dust and how it decreases with a gradual increase in magnetic field, varying from 20 - 1000 Gauss. We particularly noticed a minimum at 330 Gauss, which coincides with electron magnetization.",
  "authors": [
    "Bhavesh Ramkorun"
  ],
  "published": "2025-11-21T16:54:26Z",
  "updated": "2025-11-21T16:54:26Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}