{
  "arxiv_id": "2511.19195v1",
  "url": "https://arxiv.org/abs/2511.19195v1",
  "pdf_url": "https://arxiv.org/pdf/2511.19195v1.pdf",
  "title": "Insights into neutron transport in a new multipurpose nuclear reactor",
  "abstract": "Neutron transport inside the reflector tank of the new Brazilian nuclear reactor, called the RMB (Brazilian Multipurpose Reactor), is investigated using the stochastic Monte Carlo method. One of the main characteristics of research nuclear reactors is the core power density, which is proportional to the neutron flux generated in the fission reaction. The RMB is part of the new generation of multipurpose reactors, and studying neutron transport is essential for the project to meet its objectives of producing radioisotopes, irradiating materials, and generating neutron beams for scientific investigations. The neutron moderation process in the reflector tank is very well described by Maxwellian distributions, which provide temperatures ranging from T = 331.5 K in the core to T = 266.8 K in the peripheral regions. The relative proportions reveal the predominance (52%) of epithermal neutrons in the reactor core, followed by thermal (29%) and fast (19%) neutrons. The moderation process proves to be effective, considering that 100% of the neutrons fall within the thermal spectrum near the reflector tank wall. The fits using Maxwellian distributions reveal another effect of neutron moderation, a shift in the peak wavelength from 1.07 Å to 1.19 Å. The same effect is observed along the tube that supplies a neutron beam to the RMB imaging instrument, with $λ_{peak}$ = 1.18 Å increasing to $λ_{peak}$ = 1.21 Å.",
  "authors": [
    "Luiz Paulo de Oliveira",
    "Alexandre Pinho dos Santos Souza",
    "Carlos Gabriel da Silva Santos",
    "Iberê Souza Ribeiro Júnior",
    "Barbara Perez Gonçalves Silva",
    "Marco Antonio Stanojev Pereira",
    "Frederico Antonio Genezini"
  ],
  "published": "2025-11-24T15:05:04Z",
  "updated": "2025-11-24T15:05:04Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}