[
  {
    "arxiv_id": "2511.20424v1",
    "url": "https://arxiv.org/abs/2511.20424v1",
    "pdf_url": "https://arxiv.org/pdf/2511.20424v1.pdf",
    "title": "Planar Josephson junctions for sensors and electronics:Different geometry, new functionality",
    "abstract": "Josephson junctions are key elements in superconducting electronics. The most common type is the overlap (sandwich-type) junction, formed by vertically stacking two superconducting layers. In contrast, planar junctions are fabricated without overlap, at the edge of two superconducting films within a single plane. This geometric distinction has a significant impact on their physical properties. The planar geometry greatly enhances sensitivity to magnetic fields and improves impedance matching for terahertz (THz) devices. Its two-dimensional structure allows for simple and flexible electronic component design, enabling drastic miniaturization. Here I highlight recent advances in the application of planar junctions for novel technologies, including junction-on-cantilever sensors for super-resolution magnetic imaging, vortex-based memory cells, and programmable superconducting diodes. I will also discuss the general requirements, future perspectives, and key challenges in the evolving field of superconducting electronics.",
    "authors": [
      "Vladimir M. Krasnov"
    ],
    "published": "2025-11-25T15:51:19Z",
    "updated": "2025-11-25T15:51:19Z",
    "categories": [
      "cond-mat.supr-con",
      "physics.app-ph",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.supr-con"
  },
  {
    "arxiv_id": "2511.20417v1",
    "url": "https://arxiv.org/abs/2511.20417v1",
    "pdf_url": "https://arxiv.org/pdf/2511.20417v1.pdf",
    "title": "Future Colliders Comparative Evaluation - Working Group Report",
    "abstract": "In anticipation of the completion of the High-Luminosity Large Hadron Collider (HL-LHC) programme by the end of 2041, CERN is preparing to launch a new major facility in the mid-2040s. According to the 2020 European Strategy for Particle Physics (ESPP), the highest-priority next collider is an electron-positron Higgs factory, followed in the longer term by a hadron-hadron collider at the highest achievable energy. The CERN directorate established a Future Colliders Comparative Evaluation working group in June 2023. This group brings together project leaders and domain experts to conduct a consistent evaluation of the Future Circular Collider (FCC) and alternative scenarios based on shared assumptions and standardized criteria. This report presents a comparative evaluation of proposed future collider projects submitted as input for the Update of the European Strategy for Particle Physics. These proposals are compared considering main performance parameters, environmental impact and sustainability, technical maturity, cost of construction and operation, required human resources, and realistic implementation timelines. An overview of the international collider projects within a similar timeframe, notably the CEPC in China and the ILC in Japan is also presented, as well as a short review of the status and prospects of new accelerator techniques.",
    "authors": [
      "G. Arduini",
      "M. Benedikt",
      "F. Gianotti",
      "K. Jakobs",
      "M. Lamont",
      "R. Losito",
      "M. Meddahi",
      "J. Mnich",
      "N. Mounet",
      "D. Schulte",
      "F. Sonnemann",
      "S. Stapnes",
      "F. Zimmermann"
    ],
    "published": "2025-11-25T15:41:09Z",
    "updated": "2025-11-25T15:41:09Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.20400v1",
    "url": "https://arxiv.org/abs/2511.20400v1",
    "pdf_url": "https://arxiv.org/pdf/2511.20400v1.pdf",
    "title": "Optimization of the X-Arapuca Photon Collection Efficiency for the DUNE Horizontal Drift Far Detector",
    "abstract": "The Deep Underground Neutrino Experiment (DUNE) Far Detector (FD) Photon Detection System (PDS) employs the X-Arapuca concept, a photon trapping system relying on reflective surfaces and dichroic filters. In this paper are reported measurements, performed at the University of Milano-Bicocca, aimed at increasing the FD Horizontal Drift (HD) PDS module efficiency. The baseline implementation of the X-Arapuca concept for the FD-HD PDS module is close to the DUNE requirements as demonstrated in the collaborations laboratory testing. However, an increased performance would provide a safety margin for a detector planned to be operated for 30 years, without possibility of performing maintenance. A higher detector performance would also benefit the DUNE low energy physics program. The already proven Milano-Bicocca setup has been utilized to test different PDS module configurations comparing them to the original baseline. Exploiting prior knowledge of the X-Arapuca components and Geant4 based optical simulations it has been possible to achieve up to an ~84% performance increase over the baseline design. In the following it is presented the testing procedure, the performed measurements and a brief discussion on the obtained results.",
    "authors": [
      "E. Bertolini",
      "C. Brizzolari",
      "F. Bruni",
      "P. Carniti",
      "C. M. Cattadori",
      "S. Copello",
      "E. Cristaldo",
      "M. Delgado",
      "F. Galizzi",
      "C. Gotti",
      "D. Guffanti",
      "A. A. Machado",
      "L. Malinverni",
      "L. Meazza",
      "F. Meinardi",
      "G. Pessina",
      "G. Raselli",
      "M. Rossella",
      "E. Segreto",
      "H. Souza",
      "F. Terranova",
      "D. Warner"
    ],
    "published": "2025-11-25T15:27:39Z",
    "updated": "2025-11-25T15:27:39Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2406.12869v3",
    "url": "https://arxiv.org/abs/2406.12869v3",
    "pdf_url": "https://arxiv.org/pdf/2406.12869v3.pdf",
    "title": "Graph Neural Network-Based Pipeline for Track Finding in the Velo at LHCb",
    "abstract": "Over the next decade, increases in instantaneous luminosity and detector granularity will amplify the amount of data that has to be analysed by high-energy physics experiments, whether in real time or offline, by an order of magnitude. The reconstruction of charged particle tracks, which has always been a crucial element of offline data processing pipelines, must increasingly be deployed from the very first stages of the real time processing to enable experiments to achieve their physics goals. Graph Neural Networks (GNNs) have received a great deal of attention in the community because their computational complexity scales nearly linearly with the number of hits in the detector, unlike conventional algorithms which often scale quadratically or worse. This paper presents ETX4VELO, a GNN-based track-finding pipeline tailored for the Run 3 LHCb experiment's Vertex Locator, in the context of LHCb's fully GPU-based first-level trigger system, Allen. Currently implemented in Python, ETX4VELO offers the ability to reconstruct tracks with shared hits using a novel triplet-based method. When benchmarked against the traditional track-finding algorithm in Allen, this GNN-based approach not only matches but occasionally surpasses its physics performance. In particular, the fraction of fake tracks is reduced from over 2% to below 1% and the efficiency to reconstruct electrons is improved. While achieving comparable physics performance is a milestone, the immediate priority remains implementing ETX4VELO in Allen in order to determine and optimise its throughput, to meet the demands of this high-rate environment.",
    "authors": [
      "Anthony Correia",
      "Fotis I. Giasemis",
      "Nabil Garroum",
      "Vladimir Vava Gligorov",
      "Bertrand Granado"
    ],
    "published": "2024-04-23T14:34:01Z",
    "updated": "2025-11-25T14:38:23Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "physics.data-an"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.20219v1",
    "url": "https://arxiv.org/abs/2511.20219v1",
    "pdf_url": "https://arxiv.org/pdf/2511.20219v1.pdf",
    "title": "Evaluating a Transition-jump System for the Fermilab Main Injector Using Xsuite",
    "abstract": "We describe an Xsuite simulation framework for the Fermilab Main Injector (MI) along with an evaluation of transition-crossing behaviors in the accelerator. In particular, we studied the introduction of quadrupole magnets into the lattice as part of a transition-jump system that will be implemented through the $2^{nd}$ Proton Improvement Plan (PIP-II). Simulated beam losses spurred by transition-induced instabilities were assessed under several systematic effects, including MI quad errors, magnet-to-magnet variability in the jump magnets, power-supply errors, and timing jitter.",
    "authors": [
      "A. P. Schreckenberger",
      "R. Ainsworth",
      "M. Xiao"
    ],
    "published": "2025-11-25T11:47:06Z",
    "updated": "2025-11-25T11:47:06Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.18429/JACoW-NAPAC2025-THP031"
  },
  {
    "arxiv_id": "2504.20128v2",
    "url": "https://arxiv.org/abs/2504.20128v2",
    "pdf_url": "https://arxiv.org/pdf/2504.20128v2.pdf",
    "title": "Gas-cell development for nuclear astrophysics motivated studies on noble gas targets and the $^3$He($α$,$γ$)$^7$Be reaction",
    "abstract": "In many astrophysical scenarios, alpha induced reactions on noble gas nuclei play a crucial role. Studying these reactions in the laboratory requires the noble gas atoms to be confined in a sufficient amount to allow the reactions. At Atomki thin-windowed gas-cell targets were developed and improved for studying alpha induced reactions on noble gases. Several stages of the gas-cell design used for activation experiments and lately a version to be used for particle scattering experiments will be presented.   A new experimental study of the $^3$He($α$,$γ$)$^7$Be reaction with one of the activation gas-cell targets was performed. This reaction plays an important role both in the solar pp-chains and in big bang nucleosynthesis. The reaction cross section was measured in the past in several works, however, there are still energy regions lacking experimental data, rendering the extrapolations towards the astrophysically relevant energies uncertain. New experimental total cross section of the $^3$He($α$,$γ$)$^7$Be reaction was thus determined here in the energy range of $E_\\mathrm{c.m.} = 2600-3000$ keV in about 50 keV energy steps. These results confirm the overall trend, and also the absolute scale set by the only one previous measurement in this energy range.   In addition, two pilot experiments with the scattering cell were performed aiming to study the $^4$He($α$,$α$)$^4$He and $^{124}$Xe($α$,$α$)$^{124}$Xe reactions at $E_α= 18$ MeV. These studies benchmark the performance of the cell and detection system both for light and heavy noble gas targets.",
    "authors": [
      "Á. Tóth",
      "Z. Elekes",
      "Zs. Fülöp",
      "Gy. Gyürky",
      "Z. Halász",
      "M. M. Juhász",
      "G. G. Kiss",
      "S. R. Kovács",
      "Zs. Mátyus",
      "T. N. Szegedi",
      "T. Szücs"
    ],
    "published": "2025-04-28T17:11:10Z",
    "updated": "2025-11-25T10:49:12Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2503.11285v3",
    "url": "https://arxiv.org/abs/2503.11285v3",
    "pdf_url": "https://arxiv.org/pdf/2503.11285v3.pdf",
    "title": "Knock Out Slow Extraction Using Betatron Sidebands at High Harmonics",
    "abstract": "Radio frequency knock out resonant slow extraction is a standard method for extracting stored particle beams from synchrotrons by transverse excitation. Excitation signals comprising many betatron sidebands have shown to reduce intensity fluctuations of the extracted beam spill and are used at several facilities. In this contribution, the effect of individual sidebands at different harmonics on the spill quality is systematically studied using efficient noise excitation signals fully covering the respective sidebands. Particle tracking simulations show a clear correlation between the chosen excitation frequency and the spill quality. This relation is attributed to the spectrum of particle motion shortly before their extraction, and an empiric relation between the spectrum, the excitation frequency, and the resulting spill quality is given. Experiments show an additional reduction of pile-up when using higher excitation frequencies. These insights have implications for an optimal design of excitation waveforms and hardware for Knock Out extraction systems.",
    "authors": [
      "Philipp Niedermayer",
      "Rahul Singh",
      "Eike Feldmeier",
      "Christian Schömers",
      "Marcel Hun"
    ],
    "published": "2025-03-14T10:46:10Z",
    "updated": "2025-11-25T08:56:06Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.19817v1",
    "url": "https://arxiv.org/abs/2511.19817v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19817v1.pdf",
    "title": "Calibration Plan for the SBC 10-kg Liquid Argon Detector with 100 eV Target Threshold",
    "abstract": "The Scintillating Bubble Chamber (SBC) Collaboration is designing a new generation of low background, noble liquid bubble chamber experiments with sub-keV nuclear recoil threshold. These experiments combine the electronic recoil blindness of a bubble chamber with the energy resolution of noble liquid scintillation, and maintain electron recoil discrimination at higher degrees of superheat (lower nuclear recoil thresholds) than Freon-based bubble chambers. A 10-kg liquid argon bubble chamber has the potential to set world leading limits on the dark matter nucleon cross-section for $O(\\mathrm{GeV}/c^{2})$ masses, and to perform a high statistics coherent elastic neutrino nuclear scattering measurement with reactor neutrinos. This work presents a detailed calibration plan to measure the detector response of these experiments, combining photoneutron scattering with two new techniques to induce sub-keV nuclear recoils: nuclear Thomson scattering and thermal neutron capture.",
    "authors": [
      "SBC collaboration"
    ],
    "published": "2025-11-25T01:14:36Z",
    "updated": "2025-11-25T01:14:36Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.19807v1",
    "url": "https://arxiv.org/abs/2511.19807v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19807v1.pdf",
    "title": "Beam Steering and Radiation Generation of Electrons in Bent Crystals in the Sub-GeV Domain",
    "abstract": "We present an investigation into beam steering and radiation emission by sub-GeV electrons traversing bent silicon crystals. Using 855, 600, and 300~MeV electron beams at the Mainz Microtron (MAMI), we explored orientational coherent effects and particle dynamics in a 15~$μ$m-thick crystal bent along the (111) planes. Combined experimental and simulation analyses enabled the classification and quantitative assessment of the contributions from channeling, dechanneling, rechanneling, and volume capture to both beam deflection and radiation emission. Crystal steering remained effective even at 300~MeV, with measured channeling efficiencies exceeding 50\\%, a record at such low energy. Channeling and volume reflection enhanced radiation emission by up to a factor of six compared to the misaligned orientation, highlighting strong orientational coherence effects in the sub-GeV regime. These findings confirm the feasibility of using bent crystals for efficient beam manipulation and high-intensity photon generation at low energies, supporting the development of novel light sources and beam control strategies at accelerator facilities operating in this energy range.",
    "authors": [
      "R. Negrello",
      "M. Romagnoni",
      "A. Sytov",
      "N. Canale",
      "D. De Salvador",
      "P. Fedeli",
      "V. Guidi",
      "V. V. Haurylavets",
      "P. Klag",
      "W. Lauth",
      "L. Malagutti",
      "A. Mazzolari",
      "G. Paternò",
      "F. Sgarbossa",
      "M. Soldani",
      "V. V. Tikhomirov",
      "D. Valzani",
      "L. Bandiera"
    ],
    "published": "2025-11-25T00:27:49Z",
    "updated": "2025-11-25T00:27:49Z",
    "categories": [
      "physics.acc-ph",
      "hep-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.19772v1",
    "url": "https://arxiv.org/abs/2511.19772v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19772v1.pdf",
    "title": "Analog Signal Multiplexing System for the Iota Proton Injector",
    "abstract": "The Fermilab Accelerator Science and Technology (FAST) Facility at FNAL is a dedicated research and development center focused on advancing particle accelerator technologies for future applications worldwide. Currently, a key objective of FAST Operations is to commission the 2.5&#8239;MeV IOTA Proton Injector (IPI) and enable proton injection into the Integrable Optics Test Accelerator (IOTA) storage ring. The low and medium-energy sections of the IPI include four frame-style dipole trims and two multi-function correctors with independently controlled coils, requiring readout of 32 analog channels for current and voltage monitoring in total. To reduce cost and optimize rack space within the PLC-based control system, a 32-to-4 analog signal multiplexing system was designed and implemented. This system enables real-time readback of excitation parameters from all magnetic correctors. This paper presents the design, construction, implementation, and performance of the multiplexing system.",
    "authors": [
      "Daniel R. MacLean",
      "Dean R. Edstrom"
    ],
    "published": "2025-11-24T22:57:09Z",
    "updated": "2025-11-24T22:57:09Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.18429/JACoW-NAPAC2025-MOP004"
  },
  {
    "arxiv_id": "2511.19658v1",
    "url": "https://arxiv.org/abs/2511.19658v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19658v1.pdf",
    "title": "Mechanical Design of the PIP-II ORBUMP Pulsed Dipole Magnet",
    "abstract": "The Proton Improvement Plan II (PIP-II) project is a vital upgrade to the Fermilab accelerator complex. The magnet pulse rate of the PIP-II Injection system requires an increase from the current rate of 15 Hz to 20 Hz as well as a roughly 30% increase in the magnetic field of the new Orbital Bump (ORBUMP) pulsed dipole magnets in the Booster. The ORBUMP magnet mechanical design is presented in this paper. The ORBUMP magnet is secured in a vacuum box and the core is made up of 0.127 mm thick, low carbon steel laminations with a C-5 inorganic magnesium phosphate coating. The core is clamped using external tie bars welded to the core end plates. ANSYS Finite Element Analysis (FEA) was used to evaluate the clamping design to minimize the deflection of the core post welding of the tie bars. The water-cooled, single turn coil, which shapes the magnetic field by acting as the pole tips, is critical for the integrated field homogeneity. The coil manufacturing tolerances and fabrication techniques were evaluated to ensure the magnetic properties of the magnet could be obtained. The coil is electrically isolated from the core using virgin Polyether ether ketone (PEEK) insulating material in the gap. An investigation into the high voltage performance of the virgin PEEK insulator was conducted via partial discharge testing using a 1:1 scale sample.",
    "authors": [
      "D. Karas",
      "K. Badgley",
      "Z. Chen",
      "V. Chernenok",
      "M. Davidson",
      "D. Harding",
      "D. Johnson",
      "V. Kashikhin",
      "W. Robotham",
      "T. Strauss",
      "B. Szabo",
      "J. Vander Meulen"
    ],
    "published": "2025-11-24T19:44:58Z",
    "updated": "2025-11-24T19:44:58Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2109.08873v3",
    "url": "https://arxiv.org/abs/2109.08873v3",
    "pdf_url": "https://arxiv.org/pdf/2109.08873v3.pdf",
    "title": "Formulation and verification of multiscale gyrokinetic simulation of kinetic-MHD processes in toroidal plasmas",
    "abstract": "A comprehensive gyrokinetic simulation model has been implemented in the global toroidal gyrokinetic code (GTC) and verified for studying low-frequency waves and turbulence in magnetic fusion plasmas by treating all kinetic-MHD processes on an equal footing. A theoretical framework has been formulated to unify various methods for efficiently solving the electron drift kinetic equation in multiscale simulations by separating electron responses into analytic and non-analytic parts based on the smallness parameter of electron-to-ion mass ratio. The model can be reduced to the ideal MHD model with both the linear dispersion relation and the nonlinear ponderomotive force in theory and simulation. The model is used for the verification and validation of simulating internal kink modes in the DIII-D tokamak with accurate calculations of equilibrium parallel current and compressible magnetic perturbation. A large simulation database has been generated to train a surrogate model to predict the kink instability. Statistical analysis shows that the radial location of safety factor q=1 flux-surface and the plasma beta inside the q=1 surface are the most important parameters for predicting the kink instability.",
    "authors": [
      "Xishuo Wei",
      "Pengfei Liu",
      "Gyungjin Choi",
      "Guillaume Brochard",
      "Jian Bao",
      "Javier H Nicolau",
      "Yuehao Ma",
      "Haotian Chen",
      "Handi Huang",
      "Shuying Sun",
      "Yangyang Yu",
      "Ethan Green",
      "Fernando Eizaguirre",
      "Zhihong Lin"
    ],
    "published": "2021-09-18T08:17:02Z",
    "updated": "2025-11-24T18:43:38Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.15320v2",
    "url": "https://arxiv.org/abs/2509.15320v2",
    "pdf_url": "https://arxiv.org/pdf/2509.15320v2.pdf",
    "title": "Anisotropic Cosmic Ray Transport in strong MHD Turbulence due to Magnetic Mirroring and Resonant Curvature Scattering",
    "abstract": "The transport of cosmic rays through turbulent astrophysical plasmas still constitutes an open problem. Building on recent progress, we study the combined effect of magnetic mirroring and resonant curvature scattering on parallel and perpendicular transport. We conduct test-particle simulations in snapshots of an anisotropic magnetohydrodynamics simulation with $δB/B_0\\sim 1$ and record magnetic moment variation and field line curvature around pitch-angle reversals. We find for strongly magnetized particles that (i) pitch-angle reversals may occur either in coherent regions of the field with small variation of the magnetic moment via magnetic mirroring or in chaotic regions of the field with strong variation of the magnetic moment via resonant curvature scattering; (ii) parallel transport can be modeled as a Lévy walk with a truncated power-law distribution based on pitch-angle reversal times; and (iii) perpendicular transport is enhanced by resonant curvature scattering in synergy with chaotic field line separation and diminished by magnetic mirroring due to confinement in locally ordered field line bundles. While magnetic mirroring constitutes the bulk of reversal events, resonant curvature scattering additionally acts on trajectories that fall in the loss cones of typical mirroring structures and thus provides the cut-off for the reversal time distribution. Our results, which highlight the role of the magnetic field line geometry in cosmic-ray transport processes, are consistent with energy-independent diffusion coefficients. We conclude by considering how energy-dependent observations could arise from an intermittently inhomogeneous interstellar medium.",
    "authors": [
      "Jeremiah Lübke",
      "Frederic Effenberger",
      "Mike Wilbert",
      "Horst Fichtner",
      "Rainer Grauer"
    ],
    "published": "2025-09-18T18:09:56Z",
    "updated": "2025-11-24T17:44:18Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2511.02814v2",
    "url": "https://arxiv.org/abs/2511.02814v2",
    "pdf_url": "https://arxiv.org/pdf/2511.02814v2.pdf",
    "title": "Production of High-Specific-Activity Radioisotopes Using High-Energy Fusion Neutrons",
    "abstract": "We show that transmutation driven by high-energy neutrons from deuterium-tritium (D-T) fusion reactions can produce many important medical radioisotopes - including $^{32}$P, $^{60}$Co, $^{64}$Cu, $^{89}$Sr, $^{90}$Y, $^{89}$Zr, $^{99}$Mo/$^{99\\mathrm{m}}$Tc, $^{103}$Pd, $^{111}$In, $^{117}$In/$^{117\\mathrm{m}1}$Sn, $^{123}$I, $^{125}$I, $^{131}$I, $^{133}$Xe, $^{153}$Sm, $^{166}$Ho, $^{177}$Lu, $^{188}$Re, and $^{192}$Ir-and emerging isotopes such as $^{47}$Sc, $^{67}$Cu, $^{103}$Ru/$^{103\\mathrm{m}}$Rh, $^{103}$Pd/$^{103\\mathrm{m}}$Rh, $^{119}$Sb, $^{124}$I, $^{155}$Tb, $^{161}$Tb, $^{195\\mathrm{m}1}$Ir/$^{195\\mathrm{m}}$Pt, and $^{225}$Ac with high specific activity and in large quantities. These reactions involve stable, abundant feedstocks and non-fission transmutation channels that change the proton number, enabling chemical separation of the product. Fusion-based transmutation could provide a flexible and proliferation-resistant platform for supply of high-purity isotopes. A D-T neutron source operating at a few megawatts of fusion power could meet or exceed global demand for most major radioisotopes. Further research is required to develop tailored approaches for feedstock processing and product extraction.",
    "authors": [
      "J. F. Parisi",
      "A. Rutkowski",
      "J. Harter",
      "J. A. Schwartz",
      "S. Chen"
    ],
    "published": "2025-11-04T18:38:38Z",
    "updated": "2025-11-24T17:09:37Z",
    "categories": [
      "nucl-ex",
      "physics.med-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "nucl-ex"
  },
  {
    "arxiv_id": "2511.19281v1",
    "url": "https://arxiv.org/abs/2511.19281v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19281v1.pdf",
    "title": "Two-Stream Instability and Bernstein-Greene-Kruskal Mode Formation in Coulomb One Component Plasma",
    "abstract": "We investigate the Two-Stream Instability in a strongly coupled plasma using classical molecular dynamics simulations with long-range Coulomb interactions between particles. The nonlinear evolution of the instability is identified by the emergence of a Bernstein-Greene-Kruskal (BGK) mode. Our simulations capture key microscopic effects, such as inter-particle correlations, collisional dynamics, and coherent wave-particle interactions-features often absent in traditional fluid and kinetic models, including Particle-In-Cell and Vlasov approaches. In the linear regime, the instability grows rapidly and saturates within a few tens of plasma periods. As the system transitions into the nonlinear saturation phase, a single BGK mode emerges. This mode (or phase-space hole) becomes dynamically unstable in the nonlinear regime, characterized by a continuous decay of electrostatic energy over time. An energy budget analysis reveals a bump in an otherwise thermal spectrum, indicating the excitation of a coherent mode, further confirmed through a numerical rendering of the dispersion relation. The pairwise interaction plays a crucial role: pronounced instability and BGK mode formation occur with long-range Coulomb forces, while such structures are suppressed under shielded Coulomb interactions. We observe the emergence of a single BGK mode across all coupling strengths in the fluid regime, provided the streaming velocity exceeds a critical threshold.",
    "authors": [
      "Ajaz Mir",
      "Rauoof Wani",
      "Sanat Tiwari",
      "Abhijit Sen"
    ],
    "published": "2025-11-24T16:30:38Z",
    "updated": "2025-11-24T16:30:38Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.19230v1",
    "url": "https://arxiv.org/abs/2511.19230v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19230v1.pdf",
    "title": "FPGA-Based Spill Regulation System for the Muon Delivery Ring at Fermilab",
    "abstract": "The Muon to Electron Experiment (Mu2e) requires a uniform beam profile from the Muon Delivery Ring to meet their experimental needs. A specialized Spill Regulation System (SRS) has been developed to help achieve consistent spill uniformity. The system is based on a custom-designed carrier board featuring an Arria 10 SoC, capable of executing real-time feedback control. The FPGA processes beam pulses of approximately 200 ns every 1.695 $μ$s, allowing for continuous monitoring of the extracted spill intensity through fast bunch integration. The system directly controls three quadrupole magnets, which work in conjunction with sextupole magnets to achieve third-order resonant extraction. Furthermore, the board interfaces with Fermilab's Accelerator Control Network (ACNET), enabling operators to modify spill regulation settings in real-time via the control network while providing diagnostic waveforms. These waveforms help operators monitor the process and fine-tune the feedback mechanisms. This paper presents an overview of the board's architecture and its initial progress toward regulating beam extraction. This initial version of the regulation system aims to evaluate baseline performance to inform future system improvements.",
    "authors": [
      "J. R. Berlioz",
      "D. Bracey",
      "B. Fellenz",
      "M. A. Ibrahim",
      "V. Nagaslaev",
      "A. Narayanan",
      "P. Prieto",
      "K. Danison-Fieldhouse",
      "W. Sullivan"
    ],
    "published": "2025-11-24T15:43:35Z",
    "updated": "2025-11-24T15:43:35Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.18429/JACoW-NAPAC2025-MOP042"
  },
  {
    "arxiv_id": "2511.19195v1",
    "url": "https://arxiv.org/abs/2511.19195v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19195v1.pdf",
    "title": "Insights into neutron transport in a new multipurpose nuclear reactor",
    "abstract": "Neutron transport inside the reflector tank of the new Brazilian nuclear reactor, called the RMB (Brazilian Multipurpose Reactor), is investigated using the stochastic Monte Carlo method. One of the main characteristics of research nuclear reactors is the core power density, which is proportional to the neutron flux generated in the fission reaction. The RMB is part of the new generation of multipurpose reactors, and studying neutron transport is essential for the project to meet its objectives of producing radioisotopes, irradiating materials, and generating neutron beams for scientific investigations. The neutron moderation process in the reflector tank is very well described by Maxwellian distributions, which provide temperatures ranging from T = 331.5 K in the core to T = 266.8 K in the peripheral regions. The relative proportions reveal the predominance (52%) of epithermal neutrons in the reactor core, followed by thermal (29%) and fast (19%) neutrons. The moderation process proves to be effective, considering that 100% of the neutrons fall within the thermal spectrum near the reflector tank wall. The fits using Maxwellian distributions reveal another effect of neutron moderation, a shift in the peak wavelength from 1.07 Å to 1.19 Å. The same effect is observed along the tube that supplies a neutron beam to the RMB imaging instrument, with $λ_{peak}$ = 1.18 Å increasing to $λ_{peak}$ = 1.21 Å.",
    "authors": [
      "Luiz Paulo de Oliveira",
      "Alexandre Pinho dos Santos Souza",
      "Carlos Gabriel da Silva Santos",
      "Iberê Souza Ribeiro Júnior",
      "Barbara Perez Gonçalves Silva",
      "Marco Antonio Stanojev Pereira",
      "Frederico Antonio Genezini"
    ],
    "published": "2025-11-24T15:05:04Z",
    "updated": "2025-11-24T15:05:04Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2505.11473v2",
    "url": "https://arxiv.org/abs/2505.11473v2",
    "pdf_url": "https://arxiv.org/pdf/2505.11473v2.pdf",
    "title": "Application of the Portable Diagnostic Package to the Wisconsin High-temperature-superconducting Axisymmetric Mirror (WHAM)",
    "abstract": "We present an application of the Portable Diagnostic Package (PDP) on the Wisconsin HTS Axisymmetric Mirror (WHAM), which integrates an optical emission spectroscopy (OES) system and an active Thomson scattering (TS) system. Due to the designed portability of our system, we realized the installation of the PDP OES and TS measurements on WHAM in $\\sim$6 months. The OES system facilitates a comprehensive impurity line survey and enables flow measurements through the Doppler effect observed on impurity lines. Notably, plasma rotation profiles were successfully derived from doubly charged carbon lines. In addition, the TS system enabled the first measurements of the electron temperature in commissioning plasmas on WHAM. These successes underscore the diagnostic package's potential for advancing experimental plasma studies.",
    "authors": [
      "Keisuke Fujii",
      "Douglass Endrizzi",
      "Jay K. Anderson",
      "Cary B. Forest",
      "Jonathan Pizzo",
      "Tony Qian",
      "Mason Yu",
      "Theodore M. Biewer"
    ],
    "published": "2025-05-16T17:29:55Z",
    "updated": "2025-11-24T14:54:21Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1063/5.0281806"
  },
  {
    "arxiv_id": "2511.09863v2",
    "url": "https://arxiv.org/abs/2511.09863v2",
    "pdf_url": "https://arxiv.org/pdf/2511.09863v2.pdf",
    "title": "Topmetal-L: A Low Noise Charge-Sensitive Pixel Sensor for POLAR2/LPD",
    "abstract": "POLAR-2 is a next-generation space astronomy platform led by China, with its core scientific objective focused on high-precision polarization measurements of gamma-ray bursts. As one of its key payloads, the Low-energy Polarization Detector (LPD) is designed to perform wide-field surveys to capture X-ray polarization information from gamma-ray bursts in the 2$\\sim$10 keV energy range. This paper presents Topmetal-L, a dedicated charge-sensitive pixel sensor developed for the LPD prototype upgrade. Fabricated in a 130 nm CMOS process in 2024, the chip integrates a 356 $\\times$ 512 pixel array with a pixel pitch of 45 $μ$m. Each pixel incorporates a 26 $\\times$ 26 $μ$m$^2$ charge-collecting window and is capable of simultaneously outputting both energy and position information of deposited charges. Topmetal-L has been systematically optimized for power consumption, noise performance, and readout efficiency. It exhibits an input dynamic range of 0$\\sim$4 ke$^{-}$, a typical charge-to-voltage conversion gain of 76.04 $μ$V/e$^{-}$, an average equivalent noise charge of approximately 22.8 e$^{-}$, a sensitive area exceeding 3.69 cm$^2$, and a total power consumption of 720 mW per chip. To meet the requirements of large-area, high-frame-rate readout for gas-based polarization detectors, a sentinel readout scheme is proposed, reducing the full-frame readout time to 730 $μ$s. A prototype Topmetal-L-based gas polarization detection system was evaluated across key energies: it exhibited a residual modulation of 0.26% $\\pm$ 0.45% at 5.90 keV, a modulation factor of 66.67% $\\pm$ 0.45% for a linearly polarized 8.05 keV source, and a count rate saturated at 15 k counts$\\cdot$cm$^{-2}$$\\cdot$s$^{-1}$ when tested at 5.40 keV.",
    "authors": [
      "Li-rong Xie",
      "Shi-Qiang Zhou",
      "Di-Fan Yi",
      "Huan-Bo Feng",
      "Zhu-Ke Feng",
      "Dong Wang",
      "Chao-song Gao",
      "En-Wei Liang",
      "Xiang-Ming Sun",
      "Hong-Bang Liu"
    ],
    "published": "2025-11-13T01:43:37Z",
    "updated": "2025-11-24T14:26:15Z",
    "categories": [
      "astro-ph.IM",
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2511.19144v1",
    "url": "https://arxiv.org/abs/2511.19144v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19144v1.pdf",
    "title": "Approximate resolution convolution function for fitting a dispersion gap measured on a triple-axis spectrometer",
    "abstract": "We present an analytic convoluted-gap function, eq. 11 in the manuscript, for fitting dispersion gaps measured on triple-axis spectrometers (TAS). At the gap, the instrumental resolution skews the signal, producing a high-energy tail that complicates fitting. Our function assumes an instrumental $Q$-resolution with two equal wide and one narrow direction (typical of focused TAS instruments), and a parabolic dispersion at the gap, which is exact for quadratic and accurate for linear dispersions if the resolution is moderate. We demonstrate, that our function outperforms previous methods of fitting a gap, by giving a better fit and more accurate gap determination, seen in figure 4. Here, the anti-ferromagnetically gapped material; MnF$_2$ is simulated in a double-focusing TAS instrument. We also tested our function on experimental data on MnF$_2$ from a TAS-like instrument, where we reproduce the gap size from previous accurate experimentally determined measurements. The function is simple to implement, converges reliably, and we recommend its use for future gap fitting on TAS data.",
    "authors": [
      "Emma Y. Lenander",
      "Silas B. Schack",
      "Kim Lefmann",
      "Henrik M. Rønnow"
    ],
    "published": "2025-11-24T14:08:52Z",
    "updated": "2025-11-24T14:08:52Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.other"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.19141v1",
    "url": "https://arxiv.org/abs/2511.19141v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19141v1.pdf",
    "title": "Automated RF Phase Adjustment for Beam Stabilization in the Fermilab Linac",
    "abstract": "The Fermilab Linac experiences longitudinal beam phase drift, leading to increased particle loss, conventionally corrected through labor-intensive manual RF adjustments. This project explores machine learning-based automation for drift correction, employing a prototype-based classification approach. Our model utilizes a 34-dimensional feature set (RF settings and BPM readings) and leverages a 7x27 response matrix for system modeling. To overcome limited real-world data, we generate synthetic data, enhancing model training and generalizability. Custom loss functions, including a surrogate energy-consistent loss and a temporal smoothness constraint, ensure physically plausible drift predictions. The goal is a robust system for autonomous phase adjustments, ensuring stable beam acceleration and reduced manual intervention.",
    "authors": [
      "R. R. Chichili",
      "J. A. Sulskis",
      "R. Sharankova",
      "B. Vamanan",
      "S. Ravi"
    ],
    "published": "2025-11-24T14:06:20Z",
    "updated": "2025-11-24T14:06:20Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.18429/JACoW-NAPAC2025-MOP011"
  },
  {
    "arxiv_id": "2511.19136v1",
    "url": "https://arxiv.org/abs/2511.19136v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19136v1.pdf",
    "title": "Abnormal Polarity Effect on the DC Breakdown Voltage in Short SF6 Gap",
    "abstract": "In this Letter, through the comparison between experiment and numerical simulation, we reveal the dynamic mechanism underlying the abnormal polarity effect in SF6 short-gap DC breakdown, as well as a novel criterion for predicting negative breakdown voltage. Using the traditional single-streamer breakdown criterion, the simulated positive breakdown voltage agrees well with experimental measurements, whereas the simulated negative breakdown voltage deviates markedly from the experiments, so the single-streamer breakdown criterion fails to reproduce the abnormal polarity effect observed experimentally. In addressing this, we propose an ion-ion plasma breakdown criterion for negative breakdown voltage. When this novel criterion is applied, the simulated negative breakdown voltage agrees with the experiments and reflects the abnormal polarity effect. Analysis of the spatiotemporal evolution of key physical parameters reveals that, the dynamic mechanism for ion-ion plasma breakdown for negative polarity can be divided into four stages: primary streamer stage, ion accumulation stage, reconstructive ionization stage, and ion-ion plasma propagation stage. Notably, the ion-ion plasma propagation stage is dominated by photoionization-driven negative-ion accumulation rather than conventional impact ionization.",
    "authors": [
      "Zihao Feng"
    ],
    "published": "2025-11-24T13:59:44Z",
    "updated": "2025-11-24T13:59:44Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.19114v1",
    "url": "https://arxiv.org/abs/2511.19114v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19114v1.pdf",
    "title": "Physics-informed Neural Operator Learning for Nonlinear Grad-Shafranov Equation",
    "abstract": "As artificial intelligence emerges as a transformative enabler for fusion energy commercialization, fast and accurate solvers become increasingly critical. In magnetic confinement nuclear fusion, rapid and accurate solution of the Grad-Shafranov equation (GSE) is essential for real-time plasma control and analysis. Traditional numerical solvers achieve high precision but are computationally prohibitive, while data-driven surrogates infer quickly but fail to enforce physical laws and generalize poorly beyond training distributions. To address this challenge, we present a Physics-Informed Neural Operator (PINO) that directly learns the GSE solution operator, mapping shape parameters of last closed flux surface to equilibrium solutions for realistic nonlinear current profiles. Comprehensive benchmarking of five neural architectures identifies the novel Transformer-KAN (Kolmogorov-Arnold Network) Neural Operator (TKNO) as achieving highest accuracy (0.25% mean L2 relative error) under supervised training (only data-driven). However, all data-driven models exhibit large physics residuals, indicating poor physical consistency. Our unsupervised training can reduce the residuals by nearly four orders of magnitude through embedding physics-based loss terms without labeled data. Critically, semi-supervised learning--integrating sparse labeled data (100 interior points) with physics constraints--achieves optimal balance: 0.48% interpolation error and the most robust extrapolation performance (4.76% error, 8.9x degradation factor vs 39.8x for supervised models). Accelerated by TensorRT optimization, our models enable millisecond-level inference, establishing PINO as a promising pathway for next-generation fusion control systems.",
    "authors": [
      "Siqi Ding",
      "Zitong Zhang",
      "Guoyang Shi",
      "Xingyu Li",
      "Xiang Gu",
      "Yanan Xu",
      "Huasheng Xie",
      "Hanyue Zhao",
      "Yuejiang Shi",
      "Tianyuan Liu"
    ],
    "published": "2025-11-24T13:46:38Z",
    "updated": "2025-11-24T13:46:38Z",
    "categories": [
      "physics.plasm-ph",
      "cs.AI"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.19099v1",
    "url": "https://arxiv.org/abs/2511.19099v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19099v1.pdf",
    "title": "Fast Adaptive Neural Control of Resonant Extraction at Fermilab",
    "abstract": "We present progress on the development of a machine learning (ML) regulation system for third-order resonant extraction of the beam delivered to the Mu2e experiment at Fermilab. We consider classical and ML-based controllers optimized on semi-analytic simulations and provide performance comparisons for several models. Additionally, we discuss the efficiency of each model in training, which has implications for future work on adaptive control. We also discuss progress on developing optimized implementations of ML models for edge-based inference.",
    "authors": [
      "A. Whitbeck",
      "J. Berlioz",
      "K. Danison-Fieldhouse",
      "K. Hazelwood",
      "M. Khan",
      "J. Mitrevski",
      "A. Narayanan",
      "J. St. John",
      "N. Tran",
      "J. Ji",
      "M. Walter"
    ],
    "published": "2025-11-24T13:36:34Z",
    "updated": "2025-11-24T13:36:34Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.18429/JACoW-NAPAC2025-MOP039"
  },
  {
    "arxiv_id": "2511.19095v1",
    "url": "https://arxiv.org/abs/2511.19095v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19095v1.pdf",
    "title": "Cryogenic characterization of FBK NUV-HD-Cryo 3T SiPM sensors for the DUNE photon detection system",
    "abstract": "The Deep Underground Neutrino Experiment (DUNE) is a long-baseline neutrino experiment based in the USA and composed of a Near Detector (ND) complex at Fermi National Laboratory (FNAL), and a Far Detector (FD) complex located at the Sanford Underground Research Facility (SURF) $\\sim$1300\\,km distant. DUNE will study neutrino oscillations looking for unresolved issues of the Standard Model of particle physics (SM) such as CP violation in the leptonic sector, neutrino mass ordering and others, starting from the early 2030s. The FD, with a mass of $\\sim$17\\,kt, that will exploit both ionization and scintillation signals to detect neutrino interactions with Argon. Scintillating photons in LAr will be detected by the photon detection system (PDS) based on light collectors coupled to Silicon Photomultipliers (SiPMs). During a test campaign, different laboratories of the collaboration performed an investigation of the best SiPM candidates that fulfill the DUNE FD requirements. We identified two models of SiPM, produced by Hamamatsu Photonics K.K. (HPK) and Fondazione Bruno Kessler (FBK), respectively. In this paper, we focus on the FBK selected model showing its main features. We will describe the characterization protocol, the results at both room and cryogenic temperatures and the photon detection efficiency measurements.",
    "authors": [
      "F. Acerbi",
      "M. Andreotti",
      "A. Balboni",
      "E. Bertolini",
      "S. Bertolucci",
      "G. Botogoske",
      "F. Bramati",
      "A. Branca",
      "C. Brizzolari",
      "G. Brunetti",
      "R. Calabrese",
      "E. Calvo",
      "N. Canci",
      "P. Carniti",
      "D. Casazza",
      "C. Cattadori",
      "A. Cervera",
      "F. Chiapponi",
      "S. Chiozzi",
      "V. Cicero",
      "A. Cotta Ramusino",
      "E. Cristaldo Morales",
      "C. Cuesta",
      "R. D Amico",
      "L. Degli Esposti",
      "M. Delgado Gonzalez",
      "F. Di Capua",
      "D. Di Ferdinando",
      "A. Dyshkant",
      "M. Eads",
      "A. Falcone",
      "E. Fialova",
      "A. Ficorella",
      "P. Filip",
      "G. Fiorillo",
      "M. Fiorini",
      "K. Francis",
      "A. Gabrielli",
      "F. Galizzi",
      "G. Gallina",
      "D. Garcia-Gamez",
      "M. A. Garcia-Peris",
      "T. Giammaria",
      "I. Gil-Botella",
      "A. Gola",
      "C. Gotti",
      "M. Guarise",
      "D. Guffanti",
      "G. Ingratta",
      "I. Lax",
      "I. Lopez de Rego",
      "E. Luppi",
      "S. Manthey",
      "J. Martin-Albo",
      "N. Mauri",
      "L. Meazza",
      "A. Mengarelli",
      "A. Minotti",
      "E. Montagna",
      "A. Montanari",
      "I. Neri",
      "F. J. Nicolas-Arnaldos",
      "C. Palomares",
      "L. Parellada-Monreal",
      "L. Pasqualini",
      "G. Paternoster",
      "L. Perez-Molina",
      "G. Pessina",
      "V. Pia",
      "L. Pierini",
      "F. Poppi",
      "M. Pozzato",
      "M. Querol",
      "F. Retiere",
      "J. Rocabado",
      "A. Ruggeri",
      "A. Saadana",
      "A. Sanchez-Castillo",
      "P. Sanchez-Lucas",
      "A. Scanu",
      "F. S. Schifano",
      "G. Sirri",
      "J. Smolik",
      "M. Tenti",
      "F. Terranova",
      "V. Togo",
      "L. Tomassetti",
      "M. Torti",
      "N. Tosi",
      "C. Valieri",
      "A. Verdugo de Osa",
      "H. Vieira de Souza",
      "J. Zalesak",
      "B. Zamorano",
      "S. Zucchelli",
      "V. Zutshi"
    ],
    "published": "2025-11-24T13:34:06Z",
    "updated": "2025-11-24T13:34:06Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.19081v1",
    "url": "https://arxiv.org/abs/2511.19081v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19081v1.pdf",
    "title": "Simulating neutron diffraction from deformed mosaic crystals in McStas",
    "abstract": "Monochromator and analyzer systems that rely on bent single crystals are in use throughout the neutron scattering community. We here introduce a new component to the neutron simulation software package McStas, that simulates these bent single crystals. We then compare the performance of this component to like software in SIMRES, and Ncrystal. These simulations show excellent agreement across the different software programs. Finally we compare simulations of the new McStas component with analytical calculations of secondary extinction, based on the Darwin transfer equations. Here we also find excellent agreement, further validating this new component.",
    "authors": [
      "Daniel Lomholt Christensen",
      "Sandra Cabeza",
      "Thilo Pirling",
      "Kim Lefmann",
      "Jan Saroun"
    ],
    "published": "2025-11-24T13:22:30Z",
    "updated": "2025-11-24T13:22:30Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.19028v1",
    "url": "https://arxiv.org/abs/2511.19028v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19028v1.pdf",
    "title": "Bell Plesset Effects on Rayleigh Taylor Instability of Three Dimensional Spherical Geometry",
    "abstract": "We develop a weakly nonlinear, multi-mode theory for the Rayleigh-Taylor instability (RTI) on a time-varying spherical interface, fully incorporating mode couplings and the Bell-Plesset (BP) effects arising from interface convergence. Our model extends prior analyses, which have been largely restricted to static backgrounds, 2D cylindrical geometries, or single-mode initial conditions. We present a framework capable of evolving arbitrary, fully three-dimensional initial perturbations on a dynamic background. At the first order, mode amplitudes respond to the time-varying interface acceleration with an exponential-like growth, in qualitative agreement with classic static results. At second order, nonlinear mode coupling reveals a powerful selection rule: energy is preferentially channeled into axisymmetric (m=0) modes. We find that the BP effects dramatically amplify the instability growth by a few orders of magnitude, with this amplification being even more significant for second order couplings. Despite this strong channeling, the second order amplitudes remain small relative to the first order, validating the perturbative approach. These findings offer new physical insights into time-dependent interface instabilities relevant to applications such as astrophysical shell collapse and inertial confinement fusion, highlighting the uniquely dominant role of axisymmetric modes in BP-driven convergent flows.",
    "authors": [
      "Xilai Li",
      "Yilin Wu",
      "Zhengnuo Chen",
      "Mengqi Yang",
      "Jie Zhang"
    ],
    "published": "2025-11-24T12:03:23Z",
    "updated": "2025-11-24T12:03:23Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.18956v1",
    "url": "https://arxiv.org/abs/2511.18956v1",
    "pdf_url": "https://arxiv.org/pdf/2511.18956v1.pdf",
    "title": "Ion Temperature Anisotropy Limits from Magnetic Curvature Scattering in Magnetotail Reconnection Jets",
    "abstract": "In collisionless plasmas, relaxation of the deviations of ion velocity distribution functions (VDFs) from local thermodynamic equilibrium (LTE) occurs through particle interactions with electromagnetic fields. In particular, in the Earth's magnetotail, the deviations of the ion VDFs, typically consisting of multiple components, from the equilibrium must be limited to maintain stability of the current sheet. Curvature scattering is a leading candidate mechanism to limit such deviations, but its role remains insufficiently understood. We investigate the limits of ion temperature anisotropy in a magnetotail-like configuration by modeling a quasi-1D current sheet with a finite magnetic field curvature and three ion populations. We derive analytical thresholds for anisotropy based on current sheet stability and validate against spacecraft observations and numerical results. Our findings demonstrate that curvature scattering imposes limits on ion anisotropies, thereby maintaining the stability of the current sheet.",
    "authors": [
      "Louis Richard",
      "Anton V. Artemyev",
      "Cecilia Norgren",
      "Xin An",
      "Sergey R. Kamaletdinov",
      "Yuri V. Khotyaintsev"
    ],
    "published": "2025-11-24T10:18:43Z",
    "updated": "2025-11-24T10:18:43Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.19533v1",
    "url": "https://arxiv.org/abs/2511.19533v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19533v1.pdf",
    "title": "Experimental Demonstration of an On-Axis Laser Ranging Interferometer for Future Gravity Missions",
    "abstract": "We experimentally demonstrate a novel interferometric architecture for next-generation gravity missions, featuring a laser ranging interferometer (LRI) that enables monoaxial transmission and reception of laser beams between two optical benches with a heterodyne frequency of 7.3 MHz. Active beam steering loops, utilizing differential wavefront sensing (DWS) signals, ensure co-alignment between the receiving (RX) beam and the transmitting (TX) beam. With spacecraft attitude jitter simulated by hexapod-driven rotations, the interferometric link achieves a pointing stability below 10 urad/$\\mathrm{\\sqrt{Hz}}$ in the frequency range between 2 mHz and 0.5 Hz, and the fluctuation of the TX beam's polarization state results in a reduction of 0.14\\% in the carrier-to-noise-density ratio over a 15-hour continuous measurement. Additionally, tilt-to-length (TTL) coupling is experimentally investigated using the periodic scanning of the hexapod. Experimental results show that the on-axis LRI enables the inter-spacecraft ranging measurements with nanometer accuracy, making it a potential candidate for future GRACE-like missions.",
    "authors": [
      "Daikang Wei",
      "Christoph Bode",
      "Kohei Yamamoto",
      "Yongho Lee",
      "Germán Fernández Barranco",
      "Vitali Müller",
      "Miguel Dovale Álvarez",
      "Juan José Esteban Delgado",
      "Gerhard Heinzel"
    ],
    "published": "2025-11-24T09:11:19Z",
    "updated": "2025-11-24T09:11:19Z",
    "categories": [
      "physics.optics",
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2511.18863v1",
    "url": "https://arxiv.org/abs/2511.18863v1",
    "pdf_url": "https://arxiv.org/pdf/2511.18863v1.pdf",
    "title": "Strong Energy Dependent Transition Radiation in a Photonic Crystal",
    "abstract": "Radiation of a charged particle crossing an alternating stack of slabs in the optical region is considered. Both disordered and periodic stacks are investigated. It is shown that for special type of alternating disordered and periodic stacks the radiation problem can be solved exactly for backward and forward Brewster observation angles. Strong $N^2$ dependence of radiation intensity on slab number is re-established in special case of the disordered stack. This leads to strong directivity either on forward or on backward Brewster angles depending on the type of stack randomness. In certain type of periodic photonic crystal, a strong energy dependence $E^4$ for relativistic particles of the radiation intensity, observed at Brewster's angle is found. Further increment of particle energy leads to saturation. The band structure of the corresponding photonic crystal (PhC) has a behavior, analogous to the Dirac cones in graphene. We suggest this special type $1D$ photonic crystal for application as a detector of relativistic particles.",
    "authors": [
      "V. Gareyan",
      "Zh. Gevorkian"
    ],
    "published": "2025-11-24T08:08:06Z",
    "updated": "2025-11-24T08:08:06Z",
    "categories": [
      "physics.acc-ph",
      "cond-mat.mes-hall",
      "physics.optics"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.18693v1",
    "url": "https://arxiv.org/abs/2511.18693v1",
    "pdf_url": "https://arxiv.org/pdf/2511.18693v1.pdf",
    "title": "Development of a dual-phase xenon time projection chamber prototype for the RELICS experiment",
    "abstract": "The RELICS (REactor neutrino LIquid xenon Coherent elastic Scattering) experiment aims to detect coherent elastic neutrino-nucleus scattering from reactor antineutrinos using a dual-phase xenon time projection chamber. To validate the detector concept and ensure technical reliability for the full-scale experiment, a dedicated prototype was designed, constructed, and operated. This work presents an overview of the design, construction, and operational performance of the prototype, with emphasis on its major subsystems, including the TPC, cryogenic and xenon purification systems, slow control, and data acquisition. During operation, the detector demonstrated the capability to achieve a sub-keV energy threshold required for the RELICS physics program, as reflected by a measured single electron gain of 34.30~$\\pm$~0.01~(stat.)~PE/e$^-$ and the successful detection of 0.27~keV L-shell decay events from $^{37}$Ar. In addition, essential data analysis techniques and simulation frameworks were developed and validated, establishing the methodological foundation for future RELICS operations. The successful construction and operation of this prototype confirm the feasibility of the core technologies and provide a crucial experimental basis for the final RELICS detector.",
    "authors": [
      "Lingfeng Xie",
      "Jiajun Liu",
      "Yifei Zhao",
      "Chang Cai",
      "Guocai Chen",
      "Jiangyu Chen",
      "Huayu Dai",
      "Rundong Fang",
      "Hongrui Gao",
      "Fei Gao",
      "Jingfan Gu",
      "Xiaoran Guo",
      "Jiheng Guo",
      "Chengjie Jia",
      "Gaojun Jin",
      "Fali Ju",
      "Yanzhou Hao",
      "Xu Han",
      "Yang Lei",
      "Kaihang Li",
      "Meng Li",
      "Minhua Li",
      "Ruize Li",
      "Shengchao Li",
      "Siyin Li",
      "Tao Li",
      "Qing Lin",
      "Sheng Lv",
      "Guang Luo",
      "Yuanyuan Ren",
      "Chuanping Shen",
      "Mingzhuo Song",
      "Lijun Tong",
      "Yuhuang Wan",
      "Xiaoyu Wang",
      "Wei Wang",
      "Xiaoping Wang",
      "Zihu Wang",
      "Yuehuan Wei",
      "Liming Weng",
      "Xiang Xiao",
      "Yikai Xu",
      "Jijun Yang",
      "Litao Yang",
      "Long Yang",
      "Jingqiang Ye",
      "Jiachen Yu",
      "Qian Yue",
      "Yuyong Yue",
      "Tianyuan Zha",
      "Bingwei Zhang",
      "Yuming Zhang",
      "Chenhui Zhu"
    ],
    "published": "2025-11-24T02:28:01Z",
    "updated": "2025-11-24T02:28:01Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.18650v1",
    "url": "https://arxiv.org/abs/2511.18650v1",
    "pdf_url": "https://arxiv.org/pdf/2511.18650v1.pdf",
    "title": "Performance of the High-Angle Time Projection Chambers in the Upgraded T2K Off-Axis Near Detector",
    "abstract": "The off-axis magnetic near detector of the T2K experiment has undergone a significant upgrade, including the construction and installation of two new Time Projection Chambers featuring innovative resistive Micromegas technology and a field cage composed of thin composite walls. This paper provides a detailed description of the new components of the chambers, including the gas system, gas monitoring chambers, and data acquisition system. Additionally, it reports the results of extensive testing using both neutrino beams and cosmic rays, with comparisons between data and Monte Carlo simulations. The new detectors achieve improved spatial resolution and enhanced particle identification capabilities which are crucial for the precision goals of the T2K experiment.",
    "authors": [
      "K. Aivazelis",
      "D. Attié",
      "P. Billoir",
      "A. Blanchet",
      "G. Bortolato",
      "S. Bolognesi",
      "R. Boullon",
      "N. F. Calabria",
      "D. Calvet",
      "M. P. Casado",
      "M. G. Catanesi",
      "M. Cicerchia",
      "G. Cogo",
      "G. Collazuol",
      "P. Colas",
      "D. Cotte",
      "D. D'Ago",
      "C. Dalmazzone",
      "T. Daret",
      "R. de Oliveira",
      "A. Delbart",
      "J. Dumarchez",
      "K. Dygnarowicz",
      "S. Emery-Schrenk",
      "A. Ershova",
      "G. Eurin",
      "M. Feltre",
      "C. Forza",
      "A. N. Gacino Olmedo",
      "A. Gambalonga",
      "C. Giganti",
      "F. Gramegna",
      "P. Granger",
      "R. Guida",
      "M. Guigue",
      "S. Hassani",
      "D. Henaff",
      "F. Iacob",
      "C. Jesús-Valls",
      "S. Joshi",
      "R. Kurjata",
      "M. Lamoureux",
      "J. F. Laporte",
      "M. Lehuraux",
      "S. Levorato",
      "A. Longhin",
      "T. Lux",
      "L. Magaletti",
      "T. Marchi",
      "D. Marchesini",
      "L. Mareso",
      "M. Mattiazzi",
      "M. Mezzetto",
      "B. Mehl",
      "E. Miller",
      "L. Mellet",
      "L. Munteanu",
      "Q. V. Nguyen",
      "N. Ospina",
      "Y. Orain",
      "R. Palumbo",
      "C. Pastore",
      "J. -M. Parraud",
      "E. Pierre",
      "C. Pio",
      "O. Pizzirusso",
      "B. Popov",
      "F. Pupilli",
      "E. Radicioni",
      "Ch. Riccio",
      "L. Rinaldi",
      "F. Rossi",
      "S. Roth",
      "L. Russo",
      "S. Russo",
      "A. Rychter",
      "W. Saenz Arevalo",
      "L. Scomparin",
      "Ph. Schune",
      "D. Smyczek",
      "R. Spina",
      "J. Steinmann",
      "S. Suvorov",
      "N. Thamm",
      "D. Terront",
      "A. Teixeira",
      "F. Toussenel",
      "V. Valentino",
      "D. Vargas",
      "M. Varghese",
      "G. Vasseur",
      "C. Vuillemin",
      "U. Virginet",
      "Ch. Winterstein",
      "U. Yevarouskaya",
      "M. Ziembicki",
      "M. Zito"
    ],
    "published": "2025-11-23T23:10:12Z",
    "updated": "2025-11-23T23:10:12Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.18529v1",
    "url": "https://arxiv.org/abs/2511.18529v1",
    "pdf_url": "https://arxiv.org/pdf/2511.18529v1.pdf",
    "title": "From LIGO to Fiber- Compact Sagnac Interferometer for Gravitational-Wave Detection",
    "abstract": "Gravitational wave detection has transformed astrophysics, granting us direct access to black hole mergers, neutron star collisions, and the cataclysms of stellar death. Yet the great observatories of today, LIGO, Virgo, KAGRA, and the planned Einstein Telescope, rest on Michelson interferometers that, despite their triumphs, confront fundamental barriers of scale, cost, and environmental vulnerability. We envision a new path, a Sagnac-based fiber interferometer that leverages reciprocity and inherent robustness. Its meter-scale, modular design compact enough to fit within a small facility, offers dramatic gains in scalability and affordability over kilometer scale Michelson systems. Tunable to frequency bands where conventional detectors lose sensitivity, it opens the door to compact, versatile, and accessible GW observatories, empowering universities and research centers worldwide. Linked together in a global network, such facilities could transcend mere detection, they could localize cosmic sources and reconstruct them into images, much as black holes were first directly revealed, ushering in a new era of gravitational-wave astronomy and multi-messenger discovery.",
    "authors": [
      "Farhad Hakimi",
      "Hosain Hakimi"
    ],
    "published": "2025-11-23T16:50:30Z",
    "updated": "2025-11-23T16:50:30Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "gr-qc"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.18308v1",
    "url": "https://arxiv.org/abs/2511.18308v1",
    "pdf_url": "https://arxiv.org/pdf/2511.18308v1.pdf",
    "title": "Radiation tolerance test and damage of single-crystal CVD Diamond sensor under high fluence particles",
    "abstract": "Single-crystal chemical vapor deposition (CVD) diamond is a promising material for radiation detectors operating in extreme environments, owing to its outstanding radiation hardness. As nuclear and high-energy physics applications demand particle detectors that withstand higher radiation fluences, understanding the damage thresholds and degradation mechanisms of diamond-based detectors is essential. In this study, single-crystal CVD diamond sensors were exposed to fast neutron irradiation at fluences up to $3.3\\times10^{17}$ ${n/cm^2}$. Modules exhibited stable output confirming potential for application in future high-dose radiation environments. The dominant defects were identified as point defects including <100> self interstitials, vacancies, and lattice disorder. Macroscopic defects including nanocavities and cracks were observed with areal densities approaching $10^7$ $cm^{-2}$. The impact of 100 MeV proton irradiation on diamond detector response was quantified by extracting a damage constant of $k^{100 MeV}_{proton}=(1.452\\pm0.006)\\times10^{-18}cm^2/(p\\cdotμm)$ from a linear carrier drift degradation model. The mean free path of carriers was found to exhibit saturation behavior beyond a fluence of $4\\times10^{16}$ ${p/cm^2}$ under 100 MeV proton irradiation. Monte Carlo together with molecular dynamics simulations were performed to assess irradiation induced defect and its influence on carrier transport. By considering saturation effects and defect-interaction corrections, we develop an enhanced carrier-drift degradation model that accurately captures detector response under high-dose irradiation. Furthermore, the simulation framework was applied to evaluate damage induced by protons and pions on diamond at various energies, yielding results that show better agreement with experimental data than conventional NIEL based estimates.",
    "authors": [
      "Jialiang Zhang",
      "Shuo Li",
      "Yilun Wang",
      "Shuxian Liu",
      "Guojun Yu",
      "Zifeng Xu",
      "Lifu Hei",
      "Fanxiu Lv",
      "Lei Zhang",
      "Ming Qi"
    ],
    "published": "2025-11-23T06:41:18Z",
    "updated": "2025-11-23T06:41:18Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.16185v2",
    "url": "https://arxiv.org/abs/2511.16185v2",
    "pdf_url": "https://arxiv.org/pdf/2511.16185v2.pdf",
    "title": "Multiplexed SiPM Readout of Plastic Scintillating Fiber Detector for Muon Tomography",
    "abstract": "Muon tomography is a non-destructive imaging technique that uses cosmic-ray muons to probe dense materials. A plastic Scintillating Fiber (SciFi) detector with a one-dimensional SiPM array offers a compact and high-resolution solution. However, constructing a large-area SciFi detector demands reducing the number of readout channels while maintaining detector performance. To address this challenge, we present a multiplexing scheme based on a diode-based symmetric charge division circuit combined with a position-encoding algorithm, enabling up to $N_{\\textrm{SiPM}}^{\\textrm{max}}=C^{2}_{N_{\\textrm{ele}}}$ SiPM channels to be read out using only ${N_{\\textrm{ele}}}$ electronic channels. Circuit simulations confirm the feasibility of the multiplexing design and guide the choice of appropriate diodes to preserve SiPM signal integrity. A multiplexed SciFi detector module comprising 21 SiPM channels read out through 7 electronic channels are constructed. Electronic tests show that this module exhibits low crosstalk between electronic channels, and preserves linearity over a dynamic range from $\\sim$10 to 122 photoelectrons. Cosmic-ray measurements further show that the multiplexed SciFi detector achieves a detection efficiency above 95\\% and a spatial resolution of about 0.65~mm, with only minor degradation compared to the direct (per SiPM channel) readout. These results verify that the proposed method provides a scalable and cost-effective readout solution for large-area muon tomography systems.",
    "authors": [
      "Chenghan Lv",
      "Kun Hu",
      "Huiling Li",
      "Hui Liang",
      "Cong Liu",
      "Hongbo Wang",
      "Zibing Wu",
      "Weiwei Xu"
    ],
    "published": "2025-11-20T09:50:13Z",
    "updated": "2025-11-23T02:09:26Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.08533v3",
    "url": "https://arxiv.org/abs/2508.08533v3",
    "pdf_url": "https://arxiv.org/pdf/2508.08533v3.pdf",
    "title": "Transition to Petschek Reconnection in Subrelativistic Pair Plasmas: Implications for Particle Acceleration",
    "abstract": "While relativistic magnetic reconnection in pair plasmas has emerged in recent years as a candidate for the origin of radiation from extreme astrophysical environments, the corresponding subrelativistic pair plasma regime has remained less explored, leaving open the question of how relativistic physics affects reconnection. In this paper, we investigate the differences between these regimes by contrasting 2D particle-in-cell simulations of reconnection in pair plasmas with relativistic magnetization ($σ\\gg 1$) and subrelativistic magnetization ($σ< 1$). By utilizing unprecedentedly large domain sizes and outflow boundary conditions, we demonstrate that lowering the magnetization results in a change in the reconnection geometry from a plasmoid chain to a Petschek geometry, where laminar exhausts bounded by slow-mode shocks emanate from a single diffusion region. We attribute this change to the reduced plasmoid production rate in the low-$σ$ case: when the secondary tearing rate is sufficiently low, plasmoids are too few in number to prevent the system from relaxing into a stable Petschek configuration. This geometric change also affects particle energization: we show that while high-$σ$ plasmoid chains generate power-law energy spectra, low-$σ$ Petschek exhausts merely heat incoming plasma and yield negligible nonthermal acceleration. These results have implications for predicting the global current sheet geometry and the resulting energy spectrum in a variety of systems.",
    "authors": [
      "Adam Robbins",
      "Anatoly Spitkovsky"
    ],
    "published": "2025-08-12T00:22:43Z",
    "updated": "2025-11-22T23:55:17Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.18061v1",
    "url": "https://arxiv.org/abs/2511.18061v1",
    "pdf_url": "https://arxiv.org/pdf/2511.18061v1.pdf",
    "title": "Three Dimensional Effects on Proton Acceleration with Grooved Hydrocarbon Targets",
    "abstract": "Recently, using two-dimensional particle-in-cell simulations, it has been demonstrated that in laser based proton acceleration with micro-structured targets, a single rectangular groove on the target front offers significant proton cut-off enhancement with linearly polarised laser pulses. In the present work, three-dimensional investigations are carried out to identify notable differences between cylindrical and cuboidal groove geometries both of which correspond to a rectangular groove in a two-dimensional case. In particular, a waveguide model is employed to analyse the effect of the groove geometry and extensive three-dimensional particle-in-cell simulations are performed to demonstrate the distinct behaviour of laser pulse and electrons for cylindrical and cuboidal grooves. Further, the effect of a circular polarisation of the incident laser pulse on the spectra of accelerated protons is studied. It is shown that contrary to our initial expectations, cylindrical symmetry and circular polarisation do not play well together and cause as much as 15$\\%$ decay in proton cut-off energies as compared to the case of cylindrical symmetry and linear polarisation.",
    "authors": [
      "Imran Khan",
      "Mohammad Yasir",
      "Vikrant Saxena"
    ],
    "published": "2025-11-22T13:43:20Z",
    "updated": "2025-11-22T13:43:20Z",
    "categories": [
      "physics.plasm-ph",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.18044v1",
    "url": "https://arxiv.org/abs/2511.18044v1",
    "pdf_url": "https://arxiv.org/pdf/2511.18044v1.pdf",
    "title": "Space-Charge Effects During Half-Integer Resonance Crossing in the CERN PSB",
    "abstract": "The survival of charged particles in synchrotrons requires avoiding setting the beam on machine resonances, the most dangerous of which are the integer and half-integer. Nevertheless, operationally, the transverse tunes may change dynamically, crossing these resonances, and resulting in unwanted beam quality degradation and beam loss. For high intensity beams the process of resonance crossing is even more critical as space charge, in addition to the incoherent effects, may generate also coherent effects on the beam envelope dynamics. The interplay of the speed of resonance crossing, the space charge incoherent tune spread, and half-integer resonance width are fundamental for the beam behavior. In this paper we study the crossing of the half-integer resonance $2Q_y=9$ in the CERN Proton Synchrotron Booster~(PSB) for a range of parameters using a coasting beam. We take advantage of the newly commissioned PSB to investigate the beam response experimentally. The experimental findings are also discussed with the support of simulations.",
    "authors": [
      "Tirsi Prebibaj",
      "Fanouria Antoniou",
      "Foteini Asvesta",
      "Hannes Bartosik",
      "Giuliano Franchetti"
    ],
    "published": "2025-11-22T12:48:26Z",
    "updated": "2025-11-22T12:48:26Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.02939v2",
    "url": "https://arxiv.org/abs/2511.02939v2",
    "pdf_url": "https://arxiv.org/pdf/2511.02939v2.pdf",
    "title": "Characterization of the first full-size production for ePIC TOF layers",
    "abstract": "Low-Gain Avalanche Detectors (LGADs) are characterized by a fast rise time (500 ps) and extremely good time resolution (down to 17 ps). The intrinsic low granularity of LGADs and the large power consumption of readout chips for precise timing are problematic in near-future experiments such as e+e- Higgs factories (FCC-ee) and the ePIC detector at the Electron-Ion Collider. AC-coupled LGADs, where the readout metal is AC-coupled through an insulating oxide layer, could solve both issues at the same time thanks to the 100% fill factor and charge-sharing capabilities. Charge sharing between electrodes allows a hit position resolution well below the pitch/$\\sqrt12$ of standard segmented detectors. At the same time, it relaxes the channel density and power consumption requirements of readout chips. Extensive laboratory characterization of AC-LGAD devices from the first full-size (up to 3x4 cm) production from HPK for ePIC will be shown in this contribution. Both pixel and strip geometry was produced and tested. This study was conducted within the scope of the ePIC detector time of flight (TOF) layer R&D program at the EIC.",
    "authors": [
      "M. Davis",
      "G. Stage",
      "A. Borjigin",
      "S. Beringer",
      "N. Lynch",
      "S. Nakarmi",
      "C. Galmes Altafulla",
      "A. Drumm",
      "A. Molnar",
      "A. Tiernan",
      "S. M. Mazza",
      "H. Sadrozinski",
      "B. A. Schumm",
      "A. Seiden",
      "F. MartinezMckinney",
      "T. Shin"
    ],
    "published": "2025-11-04T19:40:16Z",
    "updated": "2025-11-22T10:28:57Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.17850v1",
    "url": "https://arxiv.org/abs/2511.17850v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17850v1.pdf",
    "title": "Efficient Dynamic and Momentum Aperture Optimization for Lattice Design Using Multipoint Bayesian Algorithm Execution",
    "abstract": "We demonstrate that multipoint Bayesian algorithm execution can overcome fundamental computational challenges in storage ring design optimization. Dynamic (DA) and momentum (MA) optimization is a multipoint, multiobjective design task for storage rings, ultimately informing the flux of x-ray sources and luminosity of colliders. Current state-of-art black-box optimization methods require extensive particle-tracking simulations for each trial configuration; the high computational cost restricts the extent of the search to $\\sim 10^3$ configurations, and therefore limits the quality of the final design. We remove this bottleneck using multipointBAX, which selects, simulates, and models each trial configuration at the single particle level. We demonstrate our approach on a novel design for a fourth-generation light source, with neural-network powered multipointBAX achieving equivalent Pareto front results using more than two orders of magnitude fewer tracking computations compared to genetic algorithms. The significant reduction in cost positions multipointBAX as a promising alternative to black-box optimization, and we anticipate multipointBAX will be instrumental in the design of future light sources, colliders, and large-scale scientific facilities.",
    "authors": [
      "Z. Zhang",
      "I. Agapov",
      "S. Gasiorowski",
      "T. Hellert",
      "W. Neiswanger",
      "X. Huang",
      "D. Ratner"
    ],
    "published": "2025-11-22T00:32:44Z",
    "updated": "2025-11-22T00:32:44Z",
    "categories": [
      "physics.acc-ph",
      "cs.LG"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.17788v1",
    "url": "https://arxiv.org/abs/2511.17788v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17788v1.pdf",
    "title": "WavePID: Studies of DOM-level waveform timing for track vs. cascade discrimination in IceCube at 5-100 GeV",
    "abstract": "The IceCube Neutrino Observatory is a cubic-kilometer Cherenkov detector embedded in the Antarctic ice at the South Pole. Its densely instrumented sub-array and dedicated low-energy analyses provide sensitivity to neutrinos in the 5-100 GeV range, enabling precision studies of neutrino oscillations and searches for new physics. This work focuses specifically on this low-energy regime, where sparse hit patterns limit the performance of topology-based reconstruction and classification methods. We introduce Waveform-based Particle Identification (WavePID), a statistically rigorous and interpretable likelihood-ratio discriminator for track-cascade separation, built from Monte Carlo templates in timing-aware, physics-motivated observables and validated through dedicated simulations. Applied to both Monte Carlo and 11.1 years of IceCube data, WavePID suggests improved cascade purity by about 5 percentage points at a fixed 20% down-selection rate relative to the current leading cascade selection, while maintaining Data-MC agreement within detector systematics. The approach is compact and robust to sparse observations, demonstrating the value of waveform-level timing for low-energy reconstruction.",
    "authors": [
      "Steven Young Eulig"
    ],
    "published": "2025-11-21T21:25:22Z",
    "updated": "2025-11-21T21:25:22Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.HE",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.17771v1",
    "url": "https://arxiv.org/abs/2511.17771v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17771v1.pdf",
    "title": "Upgrade to Fixed and Translating Scintillation-based Loss Detector System in the Fermilab Drift Tube Linac",
    "abstract": "The closed-off structure of the Fermilab Drift Tube Linac precludes a robust array of instrumentation from directly monitoring the H- beam that is accelerated from 750 keV to 116 MeV. To improve beam tuning and operational assessment of Drift Tube Linac performance, scintillator-based loss monitors were previously installed along the exterior of the first two accelerating cavities to assess low energy beam losses. Here we present a recent upgrade to the loss monitor system, including significant improvements in analog signal processing to address baseline-interfering noise; digitization of the signals to enable regular operational use and tuning; and a new remote operation upgrade of the translating loss monitor with precise positioning of the loss monitor along its nine-foot track. Data from the fixed and translating detectors collected under varying beam conditions validate the utility of the upgrade.",
    "authors": [
      "E. V. Chen",
      "A. L. Saewert",
      "R. V. Sharankova"
    ],
    "published": "2025-11-21T20:36:21Z",
    "updated": "2025-11-21T20:36:21Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.18429/JACoW-NAPAC2025-MOP096"
  },
  {
    "arxiv_id": "2511.17710v1",
    "url": "https://arxiv.org/abs/2511.17710v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17710v1.pdf",
    "title": "Entity -- Hardware-agnostic Particle-in-Cell Code for Plasma Astrophysics. I: Curvilinear Special Relativistic Module",
    "abstract": "Entity is a new-generation, fully open-source particle-in-cell (PIC) code developed to overcome key limitations in astrophysical plasma modeling, particularly the extreme separation of scales and the performance challenges associated with evolving, GPU-centric computing infrastructures. It achieves hardware-agnostic performance portability across various GPU and CPU architectures using the Kokkos library. Crucially, Entity maintains a high standard for usability, clarity, and customizability, offering a robust and easy-to-use framework for developing new algorithms and grid geometries, which allows extensive control without requiring edits to the core source code. This paper details the core general-coordinate special-relativistic module. Entity is the first PIC code designed to solve the Vlasov-Maxwell system in general coordinates, enabling a coordinate-agnostic framework that provides the foundational structure for straightforward extension to arbitrary coordinate geometries. The core methodology achieves numerical stability by solving particle equations of motion in the global orthonormal Cartesian basis, despite using generalized coordinates like Cartesian, axisymmetric spherical, and quasi-spherical grids. Charge conservation is ensured via a specialized current deposition technique using conformal currents. The code exhibits robust scalability and performance portability on major GPU platforms (AMD MI250X, NVIDIA A100, and Intel Max Series), with the 3D particle pusher and the current deposition operating efficiently at about 2 nanoseconds per particle per timestep. Functionality is validated through a comprehensive suite of standard Cartesian plasma tests and the accurate modeling of relativistic magnetospheres in curvilinear axisymmetric geometries.",
    "authors": [
      "Hayk Hakobyan",
      "Ludwig M. Böss",
      "Yangyang Cai",
      "Alexander Chernoglazov",
      "Alisa Galishnikova",
      "Evgeny A. Gorbunov",
      "Jens F. Mahlmann",
      "Alexander Philippov",
      "Siddhant Solanki",
      "Arno Vanthieghem",
      "Muni Zhou"
    ],
    "published": "2025-11-21T19:01:46Z",
    "updated": "2025-11-21T19:01:46Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2511.17395v1",
    "url": "https://arxiv.org/abs/2511.17395v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17395v1.pdf",
    "title": "Investigating the growth cycles of titania and carbonaceous nano dusty plasmas",
    "abstract": "Solid nanoparticles which range in size from 1 to 500 nm can spontaneously grow from reactive gaseous precursors in nonthermal plasmas. This dissertation studies the particle size, and growth time with and without a background magnetic field in the plasma. Traditionally, studies have focused on the growth of either carbonaceous or silicate dust from either acetylene or silane, respectively. However, recently, there have been a shift towards studying new kinds of dust. For example, recent studies have grown polymers and metallic dust. This dissertation first introduces and studies the growth of titanium dioxide dust from the metal-organic vapor precursor of titanium tetraisopropoxide. The as-grown materials are amorphous but high temperature annealing crystallizes the samples into anatase and subsequently rutile. Then, the growth of titania dusty plasma is and compared to the growth of carbonaceous dust from acetylene, in argon plasma. They are grown during the presence and absence of weak magnetic fields of 500 Gauss. Both kinds of dust growth exhibit a growth cycle, which had already been shown for various nano dusty plasma. This occurs because once the dust accumulates a critical radius and mass, they move away from the central region of the plasma, allowing a new generation of growth begins. Ultimately, the new generation of growth also moves away leading to a continuous cycle of particle formation and transport as long as the plasma is on. However, with the presence of the magnetic field, the cycle time decreases, and the spatial distribution of the dust cloud appears differently. Finally, we focus on the growth cycle time of carbonaceous dust and how it decreases with a gradual increase in magnetic field, varying from 20 - 1000 Gauss. We particularly noticed a minimum at 330 Gauss, which coincides with electron magnetization.",
    "authors": [
      "Bhavesh Ramkorun"
    ],
    "published": "2025-11-21T16:54:26Z",
    "updated": "2025-11-21T16:54:26Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.17324v1",
    "url": "https://arxiv.org/abs/2511.17324v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17324v1.pdf",
    "title": "First operation of poly(ethylene naphthalate) enclosures for high-purity germanium detectors in liquid argon for $^{42}$K/$^{42}$Ar mitigation",
    "abstract": "Commercial argon contains cosmogenic $^{42}$Ar whose progeny $^{42}$K is a critical background component for the Large Enriched Germanium Experiment for Neutrinoless $ββ$ Decay (LEGEND). LEGEND operates High-Purity Germanium (HPGe) detectors bare in liquid argon. $^{42}$K is attracted by the HPGe detectors' electric fields, and drifts toward the germanium surface, where it undergoes beta decay. LEGEND-1000 will mitigate $^{42}$K-induced background by using underground-sourced argon, depleted in cosmogenic isotopes. If underground argon is not available, mitigation techniques must be employed. Poly(ethylene naphthalate) (PEN) enclosures were proposed to hinder the ion drift, decrease the beta-particle's energy, and produce scintillation light. In this paper, we report on operating two HPGe detectors, both bare and PEN-enclosed, in $^{42}$Ar-enriched liquid argon, and find no evidence for deterioration of energy stability or resolution due to the enclosures. We monitor the beta and gamma rates of $^{42}$K, find complex time-dependencies extending to roughly 30 days after applying the HPGe detectors' high-voltage, and qualitatively demonstrate the $^{42}$K suppression capabilities of enclosures.",
    "authors": [
      "Christoph Vogl",
      "Tommaso Comellato",
      "Konstantin Gusev",
      "Brennan Hackett",
      "Patrick Krause",
      "Andreas Leonhardt",
      "Bela Majorovits",
      "Niko N. P. N. Lay",
      "Moritz Neuberger",
      "Nadezda Rumyantseva",
      "Mario Schwarz",
      "Michael Willers",
      "Stefan Schönert"
    ],
    "published": "2025-11-21T15:43:52Z",
    "updated": "2025-11-21T15:43:52Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.11255v3",
    "url": "https://arxiv.org/abs/2509.11255v3",
    "pdf_url": "https://arxiv.org/pdf/2509.11255v3.pdf",
    "title": "A Geometrically Consistent Matching Framework for Side-Scan Sonar Mapping",
    "abstract": "Robust matching of side-scan sonar imagery remains a fundamental challenge in seafloor mapping due to view-dependent backscatter, shadows, and geometric distortion. This paper proposes a novel matching framework that combines physical decoupling and geometric consistency to enhance correspondence accuracy and consistency across viewpoints. A multi-branch network, derived from the Lambertian reflection model, decomposes raw sonar images into seabed reflectivity, terrain elevation, and acoustic path loss. The reflectivity map, serving as a stable matching domain, is used in conjunction with a training-free matching pipeline combining SuperPoint and MINIMA-LightGlue. Geometry-aware outlier rejection leverages both terrain elevation and its physically derived shadow map to further remove mismatches in acoustically occluded and topographically inconsistent regions, thereby improving registration accuracy. Quantitative and visual evaluations against traditional, CNN-, and Transformer-based state-of-the-art methods demonstrate that our method achieves lower matching error, higher geometric consistency, and greater robustness to viewpoint variations. The proposed approach provides a data-efficient, physically interpretable solution for high-precision side-scan sonar image matching in complex seafloor environments.",
    "authors": [
      "Can Lei",
      "Hayat Rajani",
      "Nuno Gracias",
      "Rafael Garcia",
      "Huigang Wang"
    ],
    "published": "2025-09-14T12:54:42Z",
    "updated": "2025-11-21T15:36:51Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.17314v1",
    "url": "https://arxiv.org/abs/2511.17314v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17314v1.pdf",
    "title": "Characterisation and mitigation of RF knockout during beam stacking",
    "abstract": "Beam stacking allows a Fixed Field alternating gradient Accelerator (FFA) to increase the extracted beam current whilst also allowing for a flexible time structure making FFAs a promising candidate for future spallation neutron sources and high beam intensity applications. For successful beam stacking, beam loss caused by RF knockout must be avoided. RF knockout can occur during beam stacking because of the finite dispersion function at the RF cavity location, which is unavoidable in a scaling FFA. In this work, the RF knockout resonance is characterised and through a series of experiments at the ISIS Neutron and Muon Source, we show that it is possible to suppress the loss from RF knockout.",
    "authors": [
      "Carl Jolly",
      "David Kelliher",
      "Jean-Baptiste Lagrange",
      "Alan Letchford",
      "Shinji Machida",
      "David Posthuma de Boer",
      "Chris Rogers",
      "Andrew Seville"
    ],
    "published": "2025-11-21T15:32:10Z",
    "updated": "2025-11-21T15:32:10Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.17305v1",
    "url": "https://arxiv.org/abs/2511.17305v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17305v1.pdf",
    "title": "Efficient calculation of magnetic fields from ferromagnetic materials near strong electromagnets, and application to stellarator coil optimization",
    "abstract": "In fusion reactor design, steels under consideration for the blanket are ferromagnetic, so the steel's effect on the plasma physics must be examined. For efficient calculation of these fields, we can exploit the fact that the magnetic material gives a small perturbation relative to the fields from the electromagnetic coils and plasma. Moreover the magnetization is saturated due to the strong fields in typical fusion systems. These approximations significantly reduce the nonlinearity of the problem, so the magnetic materials can be described by an array of point dipoles of known magnitude, oriented in the direction of the coil and plasma field. The approach is verified by comparison to finite-element calculations with commercial software and shown to be accurate. As no linear or nonlinear solve is required, only evaluation of Biot-Savart-type integrals, the method here is significantly simpler to implement than other methods, and extremely fast. The method is compatible with arbitrary CAD geometry, and also allows rapid computation of the magnetic forces. We demonstrate adding the ferromagnetic effects to free-boundary MHD equilibrium calculations, assessing the effect on plasma properties such as confinement and stability. Moreover, it is straightforward to differentiate through the model to get the derivative of the field with respect to the electromagnet parameters. We thereby demonstrate gradient-based coil optimization for a quasi-isodynamic stellarator in which the field contribution from a ferromagnetic blanket is included. Even a significant steel volume is found to have little impact on the plasma physics properties, with the main effects being a slight destabilization of ballooning modes and a radial shift of the edge islands due to decrease in rotational transform. Both issues are corrected by minor reoptimization of the coil shapes to account for the field from the steel.",
    "authors": [
      "Matt Landreman",
      "Humberto Torreblanca",
      "Antoine Cerfon"
    ],
    "published": "2025-11-21T15:19:49Z",
    "updated": "2025-11-21T15:19:49Z",
    "categories": [
      "physics.plasm-ph",
      "physics.app-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.17287v1",
    "url": "https://arxiv.org/abs/2511.17287v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17287v1.pdf",
    "title": "The impact of ionising collisions on channeling and radiation emission for high-energy electrons and positrons",
    "abstract": "This paper presents a quantitative analysis of the impact of inelastic collisions with atoms in a crystalline environment on the channeling efficiency and intensity of the channeling radiation for high-energy electrons and positrons passing through oriented crystalline targets. This analysis is based on numerical simulations of the channeling process, which were performed using the MBN Explorer software package. Ionising collisions are considered random, fast and local events, and are incorporated into the classical relativistic molecular dynamics framework according to the previously described algorithm. The case studies presented refer to 10 GeV electrons and positrons incident on single crystals of diamond and silicon, oriented along the (110) and (111) planes, with thicknesses of up to 1 mm for electrons and 6 mm for positrons. To elucidate the role of ionising collisions, simulations were performed with and without accounting for them. It is shown that, for electrons, both approaches lead to similar results with regard to both the channelling efficiency and the radiation intensity. In practical terms, this means that numerical simulations can be carried out without accounting for ionising collisions, which are much faster yet produce similar results. For positrons, the ionising collisions reduce significantly the channeling efficiency. However, their impact on the radiation intensity strongly depends on the opening angle of the cone within which the radiation emission is collected. A quantitative analysis of this feature is presented in the paper.",
    "authors": [
      "Andrei V. Korol",
      "Andrey V. Solov'yov"
    ],
    "published": "2025-11-21T14:52:56Z",
    "updated": "2025-11-21T14:52:56Z",
    "categories": [
      "physics.acc-ph",
      "physics.atom-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2511.17286v1",
    "url": "https://arxiv.org/abs/2511.17286v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17286v1.pdf",
    "title": "A DSMC method for the space homogeneous multispecies Landau equation",
    "abstract": "We present a Direct Simulation Monte Carlo (DSMC) method for the spatially homogeneous multispecies Landau-Fokker-Planck equation. The scheme is derived from a first-order approximation of the multispecies Boltzmann operator in the grazing collision limit and employs a regularized, easy-to-sample scattering kernel that removes the need for iterative solvers while preserving the fundamental invariants of the Landau dynamics. The method is fully mesh-free -- being a Monte Carlo particle algorithm -- which makes it naturally scalable to high-dimensional velocity spaces and straightforward to couple with particle-in-cell (PIC) solvers via operator splitting. A notable feature of our approach is its ability to treat realistic mass ratios: we show accurate simulations up to the physical proton-electron ($p$-$e$) mass ratio $m_p/m_e \\approx 1836$. We validate the method against the multispecies BKW benchmark for Maxwellian interactions and study collisional relaxation for Coulomb interactions, showing conservation of mass, momentum, and energy, and the expected trend towards Maxwellian equilibria.",
    "authors": [
      "Andrea Medaglia"
    ],
    "published": "2025-11-21T14:50:24Z",
    "updated": "2025-11-21T14:50:24Z",
    "categories": [
      "physics.comp-ph",
      "math.NA",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.comp-ph"
  }
]