{
  "arxiv_id": "2502.01006v3",
  "url": "https://arxiv.org/abs/2502.01006v3",
  "pdf_url": "https://arxiv.org/pdf/2502.01006v3.pdf",
  "title": "Imaging simulation of a dual-panel PET geometry with ultrafast TOF   detectors",
  "abstract": "In positron emission tomography (PET), time-of-flight (TOF) information localizes source positions along lines of response. Cherenkov-radiator-integrated microchannel-plate photomultiplier tubes have achieved 30 ps TOF resolution, demonstrating cross-sectional imaging without reconstruction. Such ultrafast TOF detectors would free PET from conventional ring geometries. Therefore, this study aimed at investigating imaging characteristics of a dual-panel PET with ultrafast TOF detectors using Geant4 simulation. Two detector panels ($137 \\times 137~\\text{mm}^2$), which consisted of 5.0 mm-thick bismuth germanate pixelized crystals with a 5.75 mm pitch, were placed face-to-face at a 300 mm distance. Imaging characteristics with various TOF resolutions from 30 to 90 ps were evaluated. Because degraded efficiency may cancel TOF gain in image quality, detection efficiency was also parameterized by reducing coincidence counts. Data acquisitions for a numerical multi-rod and uniform phantom (21 MBq) and a modified NEMA NU2 image quality phantom were simulated for 600 s. Results of the maximum likelihood expectation maximization (MLEM) reconstruction were compared with those of a backprojection (i.e., no reconstruction). The dual-panel PET required a 40 ps TOF resolution to have a similar spatial resolution to that of a non-TOF ring PET (300 mm in diameter) for the same detection efficiency. TOF showed benefit in the reconstruction of image quality phantom with 40% efficiency, and the image noise with 20% efficiency at 30 ps TOF was similar to the complete efficiency at 40 ps TOF. MLEM provided better imaging performance than backprojection, even at 30 ps TOF. The feasibility of the proposed dual-panel PET was shown.",
  "authors": [
    "Taiyo Ishikawa",
    "Go Akamatsu",
    "Hideaki Tashima",
    "Fumihiko Nishikido",
    "Fumio Hashimoto",
    "Ryosuke Ota",
    "Hideaki Haneishi",
    "Sun Il Kwon",
    "Simon R. Cherry",
    "Taiga Yamaya"
  ],
  "published": "2025-02-03T02:58:42Z",
  "updated": "2025-07-30T01:04:53Z",
  "categories": [
    "physics.med-ph",
    "physics.ins-det"
  ],
  "primary_category": "physics.med-ph"
}