{
  "arxiv_id": "2505.10669v3",
  "url": "https://arxiv.org/abs/2505.10669v3",
  "pdf_url": "https://arxiv.org/pdf/2505.10669v3.pdf",
  "title": "Enhanced energy gain through higher-order resonances during direct laser   acceleration with superluminal phase velocity",
  "abstract": "Ultra-high intensity laser-plasma interactions can produce ultra-relativistic electrons via direct laser acceleration, assisted by quasi-static plasma magnetic and electric fields. These fields transversely confine electron motion and induce betatron oscillations. The net energy gain is strongly influenced by the interplay between two frequencies: the betatron frequency and the frequency of laser field oscillations experienced by the electron. Prior work has shown that energy gain is enabled by a resonance between the betatron oscillations and the oscillations of the laser field. In particular, higher-order resonances occur when the laser field completes multiple cycles during one betatron oscillation, allowing additional regimes of energy transfer beyond the fundamental (betatron) resonance. In this work, we demonstrate that such resonances become particularly effective when the laser's phase velocity is superluminal. Although the two frequencies generally evolve differently with increasing electron energy, which leads to detuning, a superluminal phase velocity introduces a non-monotonic frequency ratio with a global minimum. This minimum allows sustained frequency matching over a broad energy range, thereby enabling enhanced energy gain. As the phase velocity increases, the betatron resonance becomes ineffective due to premature frequency detuning. At the same time, higher-order resonances become increasingly effective, emerging as the dominant mechanisms for enhanced energy gain in this regime of direct laser acceleration.",
  "authors": [
    "I-Lin Yeh",
    "Kavin Tangtartharakul",
    "Rohan Bhakta",
    "Hongmei Tang",
    "Louise Willingale",
    "Alexey Arefiev"
  ],
  "published": "2025-05-15T19:19:00Z",
  "updated": "2025-07-26T14:44:45Z",
  "categories": [
    "physics.plasm-ph",
    "physics.acc-ph",
    "physics.optics"
  ],
  "primary_category": "physics.plasm-ph"
}