{
  "arxiv_id": "2505.10353v3",
  "url": "https://arxiv.org/abs/2505.10353v3",
  "pdf_url": "https://arxiv.org/pdf/2505.10353v3.pdf",
  "title": "Photomultiplier Requirements and Pre-Calibration for the SABRE South   Liquid Scintillator Veto",
  "abstract": "We present a study of the oil-proof base Hamamatsu R5912 photomultiplier tubes that will be used in the SABRE South linear-alkylbenzene liquid scintillator veto. SABRE South is a dark matter direct detection experiment at the Stawell Underground Physics Laboratory, aiming to test the DAMA/LIBRA dark matter annual modulation signal. We discuss the requirements of the liquid scintillator system and its photomultipliers, outline the methods and analysis used for the characterisation measurements, and results from initial tests. We discuss the impact of these measurements on the performance of the active veto system and explore analysis methods to allow for low threshold operation. Finally, we include results from a small scale liquid scintillator detector prototype used to assess the future performance of pulse shape discrimination in the liquid scintillator veto, and how well accommodated it is by the R5912 PMTs.",
  "authors": [
    "L. J. Milligan",
    "P. Urquijo",
    "E. Barberio",
    "V. U. Bashu",
    "L. J. Bignell",
    "I. Bolognino",
    "S. S. Chhun",
    "F. Dastgiri",
    "T. Fruth",
    "G. Fu",
    "G. C. Hill",
    "Y. Hua",
    "R. S. James",
    "K. Janssens",
    "S. Kapoor",
    "G. J. Lane",
    "K. T. Leaver",
    "P. McGee",
    "L. J. McKie",
    "J. McKenzie",
    "P. C. McNamara",
    "W. J. D. Melbourne",
    "M. Mews",
    "W. H. Ng",
    "K. J. Rule",
    "Z. Slavkovská",
    "O. Stanley",
    "A. E. Stuchbery",
    "B. Suerfu",
    "G. N. Taylor",
    "D. Tempra",
    "T. Tunningley",
    "A. G. Williams",
    "Y. Y. Zhong",
    "M. J. Zurowski"
  ],
  "published": "2025-05-15T14:43:42Z",
  "updated": "2025-07-29T17:13:33Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.1088/1748-0221/20/07/P07049"
}