{
  "arxiv_id": "2410.06798v8",
  "url": "https://arxiv.org/abs/2410.06798v8",
  "pdf_url": "https://arxiv.org/pdf/2410.06798v8.pdf",
  "title": "TCAD Parameters for 4H-SiC: A Review",
  "abstract": "In this literature review we investigate the permittivity, density-of-state mass, band gap, impact ionization, charge carrier recombination, incomplete ionization and mobility in 4H silicon carbide. We provide a comprehensive overview over characterization methods, models and parameters to lower the entrance barrier for newcomers and allow a critical evaluation of common material property descriptions. We further highlight areas for future research by identifying gaps in the current knowledge base.   For each investigated property we found a large amount of models and parameter sets based on measurements, calculations or fittings. With literal and/or graphical comparisons we reveal qualitative good agreement but also flawed data values, misinterpretations of research results and inconsistencies among multiple investigations, even those directly referencing each other. We identify parameter variations, e.g., due to temperature, with high impact that are rarely considered in 4H-SiC analyses and common values that are based on old research of deviating materials or properties. We further show the slow accommodation of recent research results within the scientific community and reveal missing characterization data but also insufficient models in state-of-the-art technology computer aided design (TCAD) tools. Overall, our review enables scientifically based decisions on 4H-SiC material parameters and unravels the demand for further investigations to validate commonly used values, confirm hypothesis and cover additional dependencies.",
  "authors": [
    "Jürgen Burin",
    "Philipp Gaggl",
    "Simon Waid",
    "Andreas Gsponer",
    "Thomas Bergauer"
  ],
  "published": "2024-10-09T11:53:47Z",
  "updated": "2025-12-19T18:17:34Z",
  "categories": [
    "cond-mat.mtrl-sci",
    "physics.ins-det"
  ],
  "primary_category": "cond-mat.mtrl-sci"
}