{
  "arxiv_id": "2512.16028v1",
  "url": "https://arxiv.org/abs/2512.16028v1",
  "pdf_url": "https://arxiv.org/pdf/2512.16028v1.pdf",
  "title": "Direct calculation of steady-state hydrodynamic solar wind solutions with newtonian viscosity",
  "abstract": "Steady-state solutions to the Navier-Stokes equations are known to admit solutions that are singular at the sonic point. Consequently, inviscid solar wind models require special treatment of the solution near the sonic points, and this has proven to be a significant impediment to efficient modeling of the solar wind. In this paper we revisit the governing hydrodynamic equations for the expanding solar wind, with the inclusion of the classical (Newtonian) viscous stress , and we show how this inclusion eliminates the singularities that emerge from the inviscid equations. This result has been previously reported and used to generate solar wind profiles from initial conditions in the asymptotic limit; however, those studies did not include realistic treatments of the inner corona, and generally rejected the prospect of extrapolating solutions outward from the Sun into the heliosphere. Here, we expand this method to include external heating and optically thin radiative losses and show that solutions can be computed from initial conditions near the solar surface, thereby capturing the entire range of scales from below the transition region to the outer heliosphere in a single solution. Our approach is to cast the steady-state Navier-Stokes equations as a system of five coupled, ordinary differential equations (ODEs), which we solve using conventional methods, without any special treatment of the governing equations in the vicinity of the sonic point. The representative solutions that we present here demonstrate the utility and efficiency of this extrapolation method, which is considerably more realistic than commonly used analytical or empirical models. This method provides a direct approach to generating accurate solar wind profiles subject to observationally motivated initial conditions near the solar surface, at a fraction of the computational cost of comparable relaxation-based models.",
  "authors": [
    "Roger B. Scott",
    "Stephen J. Bradshaw",
    "Mark G. Linton",
    "Chris Lowder",
    "Leonard Strachan"
  ],
  "published": "2025-12-17T23:21:33Z",
  "updated": "2025-12-17T23:21:33Z",
  "categories": [
    "astro-ph.SR",
    "physics.flu-dyn",
    "physics.plasm-ph",
    "physics.space-ph"
  ],
  "primary_category": "astro-ph.SR",
  "doi": "10.1051/0004-6361/202555327"
}