{
  "arxiv_id": "2512.16604v1",
  "url": "https://arxiv.org/abs/2512.16604v1",
  "pdf_url": "https://arxiv.org/pdf/2512.16604v1.pdf",
  "title": "Disruption Modelling for Engineering and Physics Design of Tokamak Energy ST-E1 Fusion Power Plant",
  "abstract": "Plasma disruptions represent a critical challenge for high-performance tokamak operations, as they can compromise machine integrity and reduce operational availability. Although future fusion devices essentially need to incorporate strategies to minimise disruption occurrence, complete avoidance remains unattainable. Consequently, assessing and characterising unmitigated disruption consequences is fundamental for the design and qualification of next-generation fusion power plants. This work supports the pre-conceptual design of ST-E1, a low aspect-ratio Tokamak Fusion Power Plant developed by Tokamak Energy Ltd., by presenting a comprehensive disruption modelling approach applied across different design stages. The methodology integrates both physics and engineering considerations to evaluate the impact of disruptions on machine performance and structural integrity. From an engineering perspective, several ST-E1 layout options were analysed to investigate the electromagnetic response of key components under disruption-induced loads, enabling comparison between alternative design solutions. On the physics side, a broad set of disruption scenarios was explored, scanning operational space parameters, plasma-material interactions, and associated thermal loads. Furthermore, the study examined variations in disruption behaviour arising from different reference equilibria, focusing on a range starting from Double Null to Single Null configurations, reflecting the increasing up-down asymmetry consequences. The results reveal significant contrasts in plasma dynamics and structures electromagnetic behaviour between configurations, highlighting the importance of disruption modelling in guiding design choices. These analyses have proven instrumental in shaping ST-E1 development, offering critical insights for mitigating risks and optimising future fusion reactor designs.",
  "authors": [
    "M. Scarpari",
    "X. Zhang",
    "K. Borowiec",
    "P. F. Buxton",
    "G. Calabro",
    "S. Carusotti",
    "A. Ciula",
    "V. Godhani",
    "J. D. Lore",
    "E. N. J. Maartensson",
    "S. A. M. McNamara",
    "J. H. Nichols",
    "M. Notazio",
    "M. Robinson",
    "M. Romanelli",
    "J. Willis",
    "ST-E1 Team"
  ],
  "published": "2025-12-18T14:46:08Z",
  "updated": "2025-12-18T14:46:08Z",
  "categories": [
    "physics.plasm-ph",
    "physics.comp-ph"
  ],
  "primary_category": "physics.plasm-ph"
}