{
  "arxiv_id": "2512.17357v1",
  "url": "https://arxiv.org/abs/2512.17357v1",
  "pdf_url": "https://arxiv.org/pdf/2512.17357v1.pdf",
  "title": "Quantitative phase nano-imaging with a laboratory source",
  "abstract": "Investigating the structure of matter at the nanoscale non destructively is a key capability enabled by X-ray imaging. One of the most powerful nano-imaging methods is X-ray ptychography, a coherent diffraction imaging technique that has become the go-to method at synchrotron facilities for applications ranging from brain imaging to battery materials. However, the requirements in terms of X-ray beam quality have limited its use to large synchrotron facilities and, to date, only one attempt has been made to translate the technique to a small-scale laboratory. To unleash the power of this technique to the broad user community of laboratory X-ray sources, there are outstanding questions to answer including whether the quantitativeness of the information is preserved in a laboratory despite the drastic decrease in X-ray flux of several orders of magnitude, with respect to synchrotron instruments. In this study not only we demonstrate that the quantitativeness of X-ray ptychography is preserved in a laboratory setting, but we also apply the method to the imaging of a brain tissue phantom. Finally, we describe the current challenges and limitations, and we set the basis for further development and future directions of quantitative nano-imaging with laboratory X-ray sources.",
  "authors": [
    "Luca Fardin",
    "Chris Armstrong",
    "Alberto Astolfo",
    "Sebastian Ignacio Allen Binet",
    "Matthieu N. Boone",
    "Rebecca Fitzgarrald",
    "Yong Ma",
    "Alexander Thomas",
    "Darren J. Batey",
    "Alessandro Olivo",
    "Silvia Cipiccia"
  ],
  "published": "2025-12-19T08:54:37Z",
  "updated": "2025-12-19T08:54:37Z",
  "categories": [
    "physics.comp-ph",
    "physics.ins-det",
    "physics.optics"
  ],
  "primary_category": "physics.comp-ph"
}