{
  "arxiv_id": "2512.17824v1",
  "url": "https://arxiv.org/abs/2512.17824v1",
  "pdf_url": "https://arxiv.org/pdf/2512.17824v1.pdf",
  "title": "First results of a Monolithic Active Pixel Sensor with Internal Signal Gain Fully Integrated in a 180 nm CMOS Technology",
  "abstract": "Dense tracking environments in experiments at CERN's High-Luminosity LHC and future FCC experiments call for an increased use of timing information in addition to the position measurement of pixel detectors. This adds one dimension to the information available, and is essential for pile-up mitigation at high luminosity. The CASSIA sensor project (CMOS Active SenSor with Internal Amplification) focuses on the development of pixel matrices with internal charge multiplication based on monolithic CMOS sensor technologies suitable for application as charged particle tracking and timing detectors. CMOS sensors with in-pixel internal amplification would result in higher signal amplitudes having an improved signal-to-noise ratio, better time resolution and increased sensitivity, making them attractive for high-radiation environments. Their monolithic integration in small pixels reduces the input capacitance of a front-end amplifier and power dissipation making it suitable for fine-pitch low-power detectors. Fast signal rise time due to internal charge amplification improves the response time and timing resolution, all of which makes such a technology attractive for future 4D tracking applications in HEP experiments. This paper presents the first results of the CASSIA sensor, a novel MAPS which uses gain layers fully integrated in a 180nm imaging process to achieve internal signal amplification. In the first measurements presented here we demonstrate the gain behaviour of different pixel implant designs and show that the sensor can be operated with low gain proportional mode as LGAD sensor at lower voltages and as SPAD sensor at higher voltages.",
  "authors": [
    "Heinz Pernegger",
    "Emma Kate Anderson",
    "Paula Bartulović",
    "Ivan Berdalović",
    "Marc Giroux de Foiard Brown",
    "Sebastian Haberl",
    "Matija Jugović",
    "Anastasia Kotsokechagia",
    "Jenny Lunde",
    "Borna Požar",
    "Tomislav Suligoj"
  ],
  "published": "2025-12-19T17:33:06Z",
  "updated": "2025-12-19T17:33:06Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}