{
  "arxiv_id": "2512.17536v1",
  "url": "https://arxiv.org/abs/2512.17536v1",
  "pdf_url": "https://arxiv.org/pdf/2512.17536v1.pdf",
  "title": "Fully stabilized 25 GHz frequency comb for frequency calibration of optical spectrum analyzer",
  "abstract": "Optical spectrometers are widely used in scientific and industrial applications, and precise frequency calibration is essential for ensuring their reliable performance. Traditionally, spectrometers have been calibrated using reference gas cells or reference lamps. However, such conventional methods are not enough to meet the demands for high accuracy and stability. Although frequency-stabilized lasers offer excellent frequency uncertainty, they provide only a single calibration point at a fixed frequency, which is unsuitable for wide-range spectrometer calibration. In this work, we demonstrate a fully stabilized, high-repetition rate electro-optic frequency comb (EO comb) as an absolute frequency reference providing multiple calibration points over a broad spectral range. Our 25 GHz EO comb provides a broadband spectrum spanning from 189.5 THz to 196 THz (corresponding to 1530 nm to 1582 nm), traceable to a frequency standard with a relative standard uncertainty of 10^-13. The well-defined and evenly spaced comb modes can be spectrally resolved by conventional optical spectrometers, enabling wide-range, high-precision frequency calibration. We directly calibrated a commercial spectrometer by referencing its measured frequency values to our well-defined comb modes, thereby evaluating the frequency error with a standard uncertainty of 20 MHz (or relative standard uncertainty of 10^-7), which is limited by the Type A uncertainty (repeatability) of the spectrometer. The proposed method is simple to implement and provides multiple calibration points referenced to the frequency standards over a broad spectral range. This approach improves both the calibration and performance evaluation of spectrometers, and it contributes to the advancement of optical metrology.",
  "authors": [
    "Yoonkwon On",
    "Dae Hee Kim",
    "Sujin Kim",
    "Yong Jin Kim",
    "Jong-Ahn Kim",
    "Sunghoon Eom",
    "Jae Yong Lee",
    "Yoon-Soo Jang"
  ],
  "published": "2025-12-19T13:00:36Z",
  "updated": "2025-12-19T13:00:36Z",
  "categories": [
    "physics.optics",
    "physics.ins-det"
  ],
  "primary_category": "physics.optics"
}