[
  {
    "arxiv_id": "2512.18779v1",
    "url": "https://arxiv.org/abs/2512.18779v1",
    "pdf_url": "https://arxiv.org/pdf/2512.18779v1.pdf",
    "title": "From Natural Language to Control Signals: A Conceptual Framework for Semantic Channel Finding in Complex Experimental Infrastructure",
    "abstract": "Modern experimental platforms such as particle accelerators, fusion devices, telescopes, and industrial process control systems expose tens to hundreds of thousands of control and diagnostic channels accumulated over decades of evolution. Operators and AI systems rely on informal expert knowledge, inconsistent naming conventions, and fragmented documentation to locate signals for monitoring, troubleshooting, and automated control, creating a persistent bottleneck for reliability, scalability, and language-model-driven interfaces. We formalize semantic channel finding-mapping natural-language intent to concrete control-system signals-as a general problem in complex experimental infrastructure, and introduce a four-paradigm framework to guide architecture selection across facility-specific data regimes. The paradigms span (i) direct in-context lookup over curated channel dictionaries, (ii) constrained hierarchical navigation through structured trees, (iii) interactive agent exploration using iterative reasoning and tool-based database queries, and (iv) ontology-grounded semantic search that decouples channel meaning from facility-specific naming conventions. We demonstrate each paradigm through proof-of-concept implementations at four operational facilities spanning two orders of magnitude in scale-from compact free-electron lasers to large synchrotron light sources-and diverse control-system architectures, from clean hierarchies to legacy environments. These implementations achieve 90-97% accuracy on expert-curated operational queries.",
    "authors": [
      "Thorsten Hellert",
      "Nikolay Agladze",
      "Alex Giovannone",
      "Jan Jug",
      "Frank Mayet",
      "Mark Sherwin",
      "Antonin Sulc",
      "Chris Tennant"
    ],
    "published": "2025-12-21T15:46:33Z",
    "updated": "2025-12-21T15:46:33Z",
    "categories": [
      "cs.CL",
      "physics.acc-ph"
    ],
    "primary_category": "cs.CL"
  },
  {
    "arxiv_id": "2512.18769v1",
    "url": "https://arxiv.org/abs/2512.18769v1",
    "pdf_url": "https://arxiv.org/pdf/2512.18769v1.pdf",
    "title": "Source quantification by mobile gamma-ray spectrometry systems: A Bayesian approach",
    "abstract": "Accurately quantifying gamma-ray sources from mobile gamma-ray spectrometry surveys has remained a fundamentally elusive, long-standing inverse problem at the interface of nuclear and computational physics. Here, we present a full-spectrum Bayesian inference framework that resolves this inverse problem by combining high-fidelity, platform-dynamic Monte Carlo template generation with Bayesian inversion. Applying this methodology to airborne measurements benchmarked against laboratory and in-situ ground truths, we demonstrate accurate and robust quantification of both natural and anthropogenic radionuclides under field conditions. By improving activity estimates by an order of magnitude, providing principled uncertainty quantification, and rigorously accounting for overdispersion, this framework opens the way to a more statistically rigorous and physics-informed era of mobile gamma-ray spectrometry, unlocking enhanced inference capabilities in emergency response, environmental monitoring, nuclear security, and planetary exploration.",
    "authors": [
      "David Breitenmoser",
      "Alberto Stabilini",
      "Malgorzata Magdalena Kasprzak",
      "Sabine Mayer"
    ],
    "published": "2025-12-21T15:17:52Z",
    "updated": "2025-12-21T15:17:52Z",
    "categories": [
      "physics.ins-det",
      "physics.app-ph",
      "physics.comp-ph",
      "physics.data-an",
      "physics.geo-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.11401v3",
    "url": "https://arxiv.org/abs/2511.11401v3",
    "pdf_url": "https://arxiv.org/pdf/2511.11401v3.pdf",
    "title": "GRANITE: High-Resolution Imaging and Electrical Qualification of Large-Area TPC Electrodes",
    "abstract": "Next-generation dual-phase time projection chambers (TPCs) for rare event searches will require large-scale, high-precision electrodes. To meet the stringent requirements for high-voltage performance of such an experiment, we have developed a scanning setup for comprehensive electrode quality assurance. The system is built around the GRANITE (Granular Robotic Assay for Novel Integrated TPC Electrodes) facility: a gantry robot on top of a $2.5\\,\\text{m}\\times1.8\\,\\text{m}$ granite table, equipped with a suite of non-contact metrology devices.   We developed a coaxial wire scanning head to measure and correlate localized high-voltage discharge currents in air with high-resolution surface images. We find that the identified discharge 'hotspots' are transient and show no significant correlation with static visual features. Next, we established a quantitative relationship between artificially induced abrasive surface damage on the wires and a reduction in the discharge inception voltage. This work provides a novel non-invasive tool for qualifying wires dedicated for use in electrodes for future low-background experiments.",
    "authors": [
      "Shumit A. Mitra",
      "Alexander Deisting",
      "Jan Lommler",
      "Uwe Oberlack",
      "Fabian Piermaier",
      "Quirin Weitzel",
      "Daniel Wenz"
    ],
    "published": "2025-11-14T15:28:26Z",
    "updated": "2025-12-21T10:51:25Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.18641v1",
    "url": "https://arxiv.org/abs/2512.18641v1",
    "pdf_url": "https://arxiv.org/pdf/2512.18641v1.pdf",
    "title": "The Choice of Line Lengths in Multiline Thru-Reflect-Line Calibration",
    "abstract": "This paper presents an analysis and rigorous procedure for determining the optimal lengths of line standards in multiline thru-reflect-line (TRL) calibration of vector network analyzers (VNAs). The solution is obtained through nonlinear constrained optimization of the eigenvalue problem in multiline TRL calibration. Additionally, we propose a simplified approach for near-optimal length selection based on predefined sparse rulers. Alongside the length calculation, we discuss the required number of lines to meet bandwidth requirements. The sensitivity of the proposed procedure is evaluated numerically via Monte Carlo simulations, demonstrating that the derived lengths have lower uncertainty than those from existing industry standards. Practical examples are provided for various applications, including lossy and dispersive lines, as well as banded solutions for waveguides.",
    "authors": [
      "Ziad Hatab",
      "Michael Gadringer",
      "Wolfgang Bösch"
    ],
    "published": "2025-12-21T08:31:08Z",
    "updated": "2025-12-21T08:31:08Z",
    "categories": [
      "eess.SP",
      "physics.ins-det"
    ],
    "primary_category": "eess.SP"
  },
  {
    "arxiv_id": "2509.09736v2",
    "url": "https://arxiv.org/abs/2509.09736v2",
    "pdf_url": "https://arxiv.org/pdf/2509.09736v2.pdf",
    "title": "A data-driven method to estimate contamination from light ion beam transmutation at colliders",
    "abstract": "Collisions of relativistic light ions such as oxygen, neon, and magnesium, have been proposed as a way to examine the system-size dependence of dynamics typically associated with the quark-gluon plasma produced in collisions of heavier ions such as xenon, gold, or lead. Recent efforts at both the Relativistic Heavy Ion Collider (RHIC) and Large Hadron Collider (LHC) have produced large datasets of proton-oxygen, oxygen-oxygen, and neon-neon collisions, catalyzing intense interest in experimental backgrounds associated with light ion collisions. In particular, electromagnetic dissociation of light ions while they are circulating in a collider can result in beam contamination that is difficult to simulate precisely. Here we propose a data-driven method for evaluating the potential impact of beam contaminants on physics analyses. The method exploits the time-dependence and smaller size of contaminant ion species to define control regions that can be used to quantify potential contamination effects. A simple model is used to illustrate the method and to study its robustness. This method can inform studies of recent LHC and RHIC data and could also be useful for future light ion programs at the LHC and beyond.",
    "authors": [
      "Sruthy Jyothi Das",
      "Austin Baty"
    ],
    "published": "2025-09-10T17:02:35Z",
    "updated": "2025-12-21T06:51:44Z",
    "categories": [
      "physics.acc-ph",
      "nucl-ex"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.20390v4",
    "url": "https://arxiv.org/abs/2509.20390v4",
    "pdf_url": "https://arxiv.org/pdf/2509.20390v4.pdf",
    "title": "Optical characterization of wavelength-shifting and scintillating-wavelength-shifting fibers",
    "abstract": "We report results of optical characterizations of new wavelength-shifting and scintillating-wavelength-shifting fibers EJ-182 and EJ-160 from Eljen Technology and compare them to the wavelength-shifting fiber BCF-91A from Saint-Gobain. The wavelength-dependence of attenuation was derived from spectral measurements confirming that the long attenuation length increases with wavelength, while short attenuation effects become less significant at longer wavelengths. The impact of the environmental refractive index was studied by immersing the EJ-160II fiber in water. Immersing the fiber in water reduced the overall light output and suppressed the short attenuation component, which can be explained by reduced light-collection efficiency due to the smaller refractive-index contrast between the fiber cladding and the surrounding medium.",
    "authors": [
      "W. Bae",
      "J. Cesar",
      "K. Chen",
      "J. Cho",
      "D. Du",
      "J. Edgar",
      "L. Earthman",
      "O. M. Falana",
      "M. Gajda",
      "C. Hurlbut",
      "M. Jackson",
      "K. Lang",
      "C. Lee",
      "J. Y. Lee",
      "E. Liang",
      "J. Liu",
      "C. Maxwell",
      "C. Murthy",
      "D. Myers",
      "S. Nguyen",
      "T. O'Brien",
      "M. Proga",
      "T. Rodriguez",
      "S. Syed",
      "M. Zalikha",
      "J. Zey"
    ],
    "published": "2025-09-22T22:15:06Z",
    "updated": "2025-12-20T14:51:59Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2506.17820v2",
    "url": "https://arxiv.org/abs/2506.17820v2",
    "pdf_url": "https://arxiv.org/pdf/2506.17820v2.pdf",
    "title": "Full-spectrum modeling of mobile gamma-ray spectrometry systems in scattering media",
    "abstract": "Mobile gamma-ray spectrometry (MGRS) systems are essential for localizing, identifying, and quantifying gamma-ray sources in complex environments. Full-spectrum template matching offers the highest accuracy and sensitivity for these tasks but is limited by the computational cost of generating the required spectral templates. Here, we present a generalized full-spectrum modeling framework for MGRS systems in scattering media, enabling near-real-time template generation through dynamic, anisotropic instrument response functions. Benchmarked against high-fidelity brute-force Monte Carlo simulations, our method yields a computational speedup by a factor of $\\mathcal{O}(10^7)$, while achieving comparable accuracy with median spectral deviations below 6%. The methodology presented is platform-agnostic and applicable across marine, terrestrial, and airborne domains, unlocking new capabilities for MGRS in a variety of applications, such as environmental monitoring, geophysical exploration, nuclear safeguards, and radiological emergency response.",
    "authors": [
      "David Breitenmoser",
      "Alberto Stabilini",
      "Malgorzata Magdalena Kasprzak",
      "Sabine Mayer"
    ],
    "published": "2025-06-21T21:23:40Z",
    "updated": "2025-12-20T14:51:37Z",
    "categories": [
      "physics.ins-det",
      "physics.app-ph",
      "physics.comp-ph",
      "physics.geo-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.18355v1",
    "url": "https://arxiv.org/abs/2512.18355v1",
    "pdf_url": "https://arxiv.org/pdf/2512.18355v1.pdf",
    "title": "Discrete Electron Emission",
    "abstract": "Analysis of space-charge effects on electron emission typically makes some assumption of continuity and smoothness, whether this is continuity of charge as in the classical derivation of the Child-Langmuir current, or the mean-field approximation used in particle-in-cell simulations. However, when studying the physics of electron emission and propagation at the mesoscale it becomes necessary to consider the discrete nature of electronic charge to account for the space-charge effect of each individual point charge. In this paper we give an extensive analysis of some previous work on the distribution of electrons under space-charge limited conditions. We examine the spacing of electrons as they are emitted from a planar surface, We present simplified models for analysis of such conditions to derive scaling laws for emission and compare them to computer simulations.",
    "authors": [
      "Arnar Jonsson",
      "Kristinn Torfason",
      "Andrei Manolescu",
      "Agust Valfells"
    ],
    "published": "2025-12-20T12:51:32Z",
    "updated": "2025-12-20T12:51:32Z",
    "categories": [
      "physics.acc-ph",
      "cond-mat.mes-hall"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.18290v1",
    "url": "https://arxiv.org/abs/2512.18290v1",
    "pdf_url": "https://arxiv.org/pdf/2512.18290v1.pdf",
    "title": "Robust and scalable simulation-based inference for gravitational wave signals with gaps",
    "abstract": "The Laser Interferometer Space Antenna (LISA) data stream will inevitably contain gaps due to maintenance and environmental disturbances, introducing nonstationarities and spectral leakage that compromise standard frequency-domain likelihood evaluations. We present a scalable Simulation-Based Inference (SBI) framework capable of robust parameter estimation directly from gapped time-series data. We employ Flow Matching Posterior Estimation (FMPE) conditioned on a learned summary of the data, optimized through an end-to-end training strategy. To address the computational challenges of long-duration signals, we propose a dual-pathway summarizer architecture: a 1D Convolutional Neural Network (CNN) operating on the time domain for high precision, and a novel wavelet-based 2D CNN utilizing asymmetric, dilated kernels to achieve scalability for datasets spanning months. We demonstrate the efficacy of this framework on simulated Galactic Binary-like signals, showing that our joint training approach yields tighter, unbiased posteriors compared to two-stage reconstruction pipelines. Furthermore, we provide the first systematic comparison showing that FMPE offers superior stability and coverage calibration over conventional Normalizing Flows in the presence of severe data artifacts.",
    "authors": [
      "Ruiting Mao",
      "Jeong Eun Lee",
      "Matthew C. Edwards"
    ],
    "published": "2025-12-20T09:30:10Z",
    "updated": "2025-12-20T09:30:10Z",
    "categories": [
      "astro-ph.IM",
      "gr-qc",
      "physics.data-an",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2410.06798v8",
    "url": "https://arxiv.org/abs/2410.06798v8",
    "pdf_url": "https://arxiv.org/pdf/2410.06798v8.pdf",
    "title": "TCAD Parameters for 4H-SiC: A Review",
    "abstract": "In this literature review we investigate the permittivity, density-of-state mass, band gap, impact ionization, charge carrier recombination, incomplete ionization and mobility in 4H silicon carbide. We provide a comprehensive overview over characterization methods, models and parameters to lower the entrance barrier for newcomers and allow a critical evaluation of common material property descriptions. We further highlight areas for future research by identifying gaps in the current knowledge base.   For each investigated property we found a large amount of models and parameter sets based on measurements, calculations or fittings. With literal and/or graphical comparisons we reveal qualitative good agreement but also flawed data values, misinterpretations of research results and inconsistencies among multiple investigations, even those directly referencing each other. We identify parameter variations, e.g., due to temperature, with high impact that are rarely considered in 4H-SiC analyses and common values that are based on old research of deviating materials or properties. We further show the slow accommodation of recent research results within the scientific community and reveal missing characterization data but also insufficient models in state-of-the-art technology computer aided design (TCAD) tools. Overall, our review enables scientifically based decisions on 4H-SiC material parameters and unravels the demand for further investigations to validate commonly used values, confirm hypothesis and cover additional dependencies.",
    "authors": [
      "Jürgen Burin",
      "Philipp Gaggl",
      "Simon Waid",
      "Andreas Gsponer",
      "Thomas Bergauer"
    ],
    "published": "2024-10-09T11:53:47Z",
    "updated": "2025-12-19T18:17:34Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2512.17866v1",
    "url": "https://arxiv.org/abs/2512.17866v1",
    "pdf_url": "https://arxiv.org/pdf/2512.17866v1.pdf",
    "title": "Data-Driven Calibration of Large Liquid Detectors with Unsupervised Learning",
    "abstract": "This paper demonstrates a novel method to extract photomultiplier tube (PMT) calibration timing constants in large liquid scintillation detectors from physics data using the machinery of unsupervised deep learning. The approach uses a simplified physical model of optical photon transport in the loss function, with PMT calibration constants treated as free parameters, and the simple assumption that individual events represent point-like emission. The problem is, thus, effectively reduced to that of regression on a very large scale, made tractable by deep learning architectures and automatic differentiation frameworks. Using data from the 9,300 PMTs in the SNO+ detector, the method has been shown to reliably extract 3 calibration constants for each of the over 7,500 online PMTs using radioactive background events. We believe that this basic approach can be straightforwardly generalised for a wide range of applications.",
    "authors": [
      "Scott DeGraw",
      "Steve Biller",
      "Armin Reichold"
    ],
    "published": "2025-12-19T18:16:55Z",
    "updated": "2025-12-19T18:16:55Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.17824v1",
    "url": "https://arxiv.org/abs/2512.17824v1",
    "pdf_url": "https://arxiv.org/pdf/2512.17824v1.pdf",
    "title": "First results of a Monolithic Active Pixel Sensor with Internal Signal Gain Fully Integrated in a 180 nm CMOS Technology",
    "abstract": "Dense tracking environments in experiments at CERN's High-Luminosity LHC and future FCC experiments call for an increased use of timing information in addition to the position measurement of pixel detectors. This adds one dimension to the information available, and is essential for pile-up mitigation at high luminosity. The CASSIA sensor project (CMOS Active SenSor with Internal Amplification) focuses on the development of pixel matrices with internal charge multiplication based on monolithic CMOS sensor technologies suitable for application as charged particle tracking and timing detectors. CMOS sensors with in-pixel internal amplification would result in higher signal amplitudes having an improved signal-to-noise ratio, better time resolution and increased sensitivity, making them attractive for high-radiation environments. Their monolithic integration in small pixels reduces the input capacitance of a front-end amplifier and power dissipation making it suitable for fine-pitch low-power detectors. Fast signal rise time due to internal charge amplification improves the response time and timing resolution, all of which makes such a technology attractive for future 4D tracking applications in HEP experiments. This paper presents the first results of the CASSIA sensor, a novel MAPS which uses gain layers fully integrated in a 180nm imaging process to achieve internal signal amplification. In the first measurements presented here we demonstrate the gain behaviour of different pixel implant designs and show that the sensor can be operated with low gain proportional mode as LGAD sensor at lower voltages and as SPAD sensor at higher voltages.",
    "authors": [
      "Heinz Pernegger",
      "Emma Kate Anderson",
      "Paula Bartulović",
      "Ivan Berdalović",
      "Marc Giroux de Foiard Brown",
      "Sebastian Haberl",
      "Matija Jugović",
      "Anastasia Kotsokechagia",
      "Jenny Lunde",
      "Borna Požar",
      "Tomislav Suligoj"
    ],
    "published": "2025-12-19T17:33:06Z",
    "updated": "2025-12-19T17:33:06Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.14758v2",
    "url": "https://arxiv.org/abs/2510.14758v2",
    "pdf_url": "https://arxiv.org/pdf/2510.14758v2.pdf",
    "title": "Design optimization of silicon nitride nanomechanical resonators for thermal infrared detectors: a guide through key figures of merit",
    "abstract": "Thermomechanical infrared (IR) detectors have emerged as promising alternatives to traditional photon and thermoelectric sensors, offering broadband sensitivity and low noise without the need for cryogenic cooling. Despite recent advances, the field still lacks a unified framework to guide the design of these nanomechanical systems. This work addresses that gap by providing a comprehensive design guide for IR thermal detectors based on silicon nitride drumhead and trampolines. Leveraging a validated analytical model, we systematically explore how geometry, tensile stress, and optical properties influence key performance metrics such as thermal time constant, noise-equivalent power, and specific detectivity. The analysis encompasses both bare silicon nitride and structures with broadband absorber layers, revealing how different parameter regimes affect the trade-off between sensitivity and response speed. Rather than focusing on a single device architecture, this study maps out a broad design space, enabling performance prediction and optimisation for a variety of application requirements. As such, it serves not only as a reference for benchmarking existing devices but also as a practical tool for engineering next-generation IR sensors that can operate close to the fundamental detection limit. This work is intended as a foundational resource for researchers and designers aiming to tailor IR detectors to specific use cases.",
    "authors": [
      "Paolo Martini",
      "Kostas Kanellopulos",
      "Silvan Schmid"
    ],
    "published": "2025-10-16T14:57:44Z",
    "updated": "2025-12-19T17:32:42Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2405.00645v3",
    "url": "https://arxiv.org/abs/2405.00645v3",
    "pdf_url": "https://arxiv.org/pdf/2405.00645v3.pdf",
    "title": "HGQ: High Granularity Quantization for Real-time Neural Networks on FPGAs",
    "abstract": "Neural networks with sub-microsecond inference latency are required by many critical applications. Targeting such applications deployed on FPGAs, we present High Granularity Quantization (HGQ), a quantization-aware training framework that optimizes parameter bit-widths through gradient descent. Unlike conventional methods, HGQ determines the optimal bit-width for each parameter independently, making it suitable for hardware platforms supporting heterogeneous arbitrary precision arithmetic. In our experiments, HGQ shows superior performance compared to existing network compression methods, achieving orders of magnitude reduction in resource consumption and latency while maintaining the accuracy on several benchmark tasks. These improvements enable the deployment of complex models previously infeasible due to resource or latency constraints. HGQ is open-source and is used for developing next-generation trigger systems at the CERN ATLAS and CMS experiments for particle physics, enabling the use of advanced machine learning models for real-time data selection with sub-microsecond latency.",
    "authors": [
      "Chang Sun",
      "Zhiqiang Que",
      "Thea K. Årrestad",
      "Vladimir Loncar",
      "Jennifer Ngadiuba",
      "Wayne Luk",
      "Maria Spiropulu"
    ],
    "published": "2024-05-01T17:18:46Z",
    "updated": "2025-12-19T16:57:39Z",
    "categories": [
      "cs.LG",
      "physics.ins-det"
    ],
    "primary_category": "cs.LG",
    "doi": "10.1145/3748173.3779200"
  },
  {
    "arxiv_id": "2510.11463v3",
    "url": "https://arxiv.org/abs/2510.11463v3",
    "pdf_url": "https://arxiv.org/pdf/2510.11463v3.pdf",
    "title": "Characterisation of the first wafer-scale prototype for the ALICE ITS3 upgrade: the monolithic stitched sensor (MOSS)",
    "abstract": "This paper presents the characterisation and testing of the first wafer-scale monolithic stitched sensor (MOSS) prototype developed for the ALICE ITS3 upgrade that is to be installed during the LHC Long Shutdown 3 (2026-2030). The MOSS chip design is driven by the truly cylindrical detector geometry that imposes that each layer is built out of two wafer-sized, bent silicon chips. The stitching technique is employed to fabricate sensors with dimensions of 1.4 $\\times$ 25.9 cm, thinned to 50 $μ$m. The chip architecture, in-pixel front-end, laboratory and in-beam characterisation, susceptibility to single-event effects, and series testing are discussed. The testing campaign validates the design of a wafer-scale stitched sensor and the performance of the pixel matrix to be within the ITS3 requirements. The MOSS chip demonstrates the feasibility of the ITS3 detector concept and provides insights for further optimisation and development.",
    "authors": [
      "Omar Abdelrahman",
      "Gianluca Aglieri Rinella",
      "Luca Aglietta",
      "Giacomo Alocco",
      "Matias Antonelli",
      "Roberto Baccomi",
      "Francesco Barile",
      "Pascal Becht",
      "Franco Benotto",
      "Stefania Maria Beolè",
      "Marcello Borri",
      "Daniela Bortoletto",
      "Naseem Bouchhar",
      "Giuseppe Eugenio Bruno",
      "Matthew Daniel Buckland",
      "Szymon Bugiel",
      "Paolo Camerini",
      "Francesca Carnesecchi",
      "Marielle Chartier",
      "Domenico Colella",
      "Angelo Colelli",
      "Giacomo Contin",
      "Giuseppe De Robertis",
      "Wenjing Deng",
      "Antonello Di Mauro",
      "Vittorio Di Trapani",
      "Maurice Donner",
      "Ana Dorda Martin",
      "Piotr Dorosz",
      "Floarea Dumitrache",
      "Lars Döpper",
      "Gregor Hieronymus Eberwein",
      "Domenico Elia",
      "Simone Emiliani",
      "Laura Fabbietti",
      "Tommaso Fagotto",
      "Xiaochao Fang",
      "Henrik Fribert",
      "Roman Gernhäuser",
      "Piero Giubilato",
      "Laura Gonella",
      "Karl Gran Grodaas",
      "Ola Slettevoll Groettvik",
      "Vladimir Gromov",
      "Malte Grönbeck",
      "Philip Hauer",
      "Hartmut Hillemanns",
      "Guen Hee Hong",
      "Yu Hu",
      "Minyoung Chris Hwang",
      "Marc Alain Imhoff",
      "Barbara Jacak",
      "Daniel Matthew Jones",
      "Antoine Junique",
      "Filip Křížek",
      "Jetnipit Kaewjai",
      "Anouk Kaiser",
      "Jesper Karlsson Gumprecht",
      "Markus Keil",
      "Bernhard Ketzer",
      "Jiyoung Kim",
      "Lena Kirchner",
      "Kritsada Kittimanapun",
      "Alex Kluge",
      "Chinorat Kobdaj",
      "Artem Kotliarov",
      "Thanushan Kugathasan",
      "Marc König",
      "Paola La Rocca",
      "Natthawut Laojamnongwong",
      "Lukas Lautner",
      "Corentin Lemoine",
      "Long Li",
      "Beatrice Eva Liang-Gilman",
      "Francesco Licciulli",
      "Sanghoon Lim",
      "Bong-Hwi Lim",
      "Jian Liu",
      "Flavio Loddo",
      "Matteo Lupi",
      "Magnus Mager",
      "Philipp Mann",
      "Georgios Mantzaridis",
      "Davide Marras",
      "Paolo Martinengo",
      "Silvia Masciocchi",
      "Annalisa Mastroserio",
      "Soniya Mathew",
      "Serena Mattiazzo",
      "Marius Wilm Menzel",
      "Nicola Minafra",
      "Frederic Morel",
      "Alice Mulliri",
      "Anjali Ila Nambrath",
      "Rajendra Nath Patra",
      "Iaroslav Panasenko",
      "Styliani Paniskaki",
      "Caterina Pantouvakis",
      "Cosimo Pastore",
      "Stefania Perciballi",
      "Francesco Piro",
      "Adithya Pulli",
      "Alexander Rachev",
      "Alexander Rachevski",
      "Ivan Ravasenga",
      "Felix Reidt",
      "Michele Rignanese",
      "Giacomo Ripamonti",
      "Isabella Sanna",
      "Valerio Sarritzu",
      "Umberto Savino",
      "Iain Sedgwick",
      "Serhiy Senyukov",
      "Danush Shekar",
      "Sabyasachi Siddhanta",
      "David Silvermyr",
      "Walter Snoeys",
      "Joey Staa",
      "Alessandro Sturniolo",
      "Miljenko Šuljić",
      "Timea Szollosova",
      "Daniel Tapia Takaki",
      "Livia Terlizzi",
      "Nicolas Tiltmann",
      "Antonio Trifirò",
      "Christina Tsolanta",
      "Rosario Turrisi",
      "Berkin Ulukutlu",
      "Gianluca Usai",
      "Isabelle Valin",
      "Giovanni Vecil",
      "Pedro Vicente Leitao",
      "Anna Villani",
      "Chunzheng Wang",
      "Zhenyu Ye",
      "Emma Rose Yeats",
      "Asli Yelkenci",
      "Zijun Zhao",
      "Alessandra Zingaretti"
    ],
    "published": "2025-10-13T14:35:53Z",
    "updated": "2025-12-19T16:28:06Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.16060v2",
    "url": "https://arxiv.org/abs/2512.16060v2",
    "pdf_url": "https://arxiv.org/pdf/2512.16060v2.pdf",
    "title": "Frequency Extraction from Invariant Flows",
    "abstract": "In non-degenerate integrable Hamiltonian systems, invariant tori can be parameterized equivalently by action variables or by their fundamental frequencies. We introduce an invariant-flow formulation for extracting fundamental frequencies of integrable Hamiltonian systems. By treating invariants as generators of commuting Hamiltonian flows, the frequencies are obtained from time-of-flight parameters along these flows, providing a direct alternative to action-angle constructions and spectral methods based on long time series. The approach yields an explicit numerical procedure that extends naturally to systems with multiple degrees of freedom. Its effectiveness is demonstrated using the McMillan map, where machine-precision accuracy is achieved.",
    "authors": [
      "Derong Xu",
      "Yongjun Li",
      "Yue Hao",
      "Sergei Nagaitsev"
    ],
    "published": "2025-12-18T01:00:58Z",
    "updated": "2025-12-19T15:43:21Z",
    "categories": [
      "nlin.SI",
      "physics.acc-ph"
    ],
    "primary_category": "nlin.SI"
  },
  {
    "arxiv_id": "2512.13179v2",
    "url": "https://arxiv.org/abs/2512.13179v2",
    "pdf_url": "https://arxiv.org/pdf/2512.13179v2.pdf",
    "title": "A nanopore-gated sub-attoliter silicon nanocavity for single-molecule trapping and analysis",
    "abstract": "Biomolecules exhibit dynamic conformations critical to their functions, yet observing these processes at the single-molecule level under native conditions remains a formidable challenge. While surface immobilization has been widely used to extend observation times, it could disrupt molecular dynamics and impede biological function. Moreover, the study of weak molecular interactions requires high local concentrations, often leading to problems with signal saturation in fluorescence-based approaches. Recent advancements in single-molecule trapping techniques have addressed some limitations, but achieving precise, controllable, long-term trapping in a molecularly crowded environment without external forces remains difficult. Here, we introduce a nanopore-gated sub-attoliter silicon nanocavity that enables precise, non-perturbative trapping of individual biomolecules for extended observation times, eliminating the need for external forces. Using nucleosomes as model systems, we demonstrate single-molecule Förster resonance energy transfer (smFRET) to monitor relative distances. Our data also show that an applied electric field can modulate the conformational properties of macromolecules, emphasizing a key advantage of our device: it does not require an electric field to retain trapped molecules. We envision this nanocavity platform as a powerful tool for interrogating molecular dynamics in physiologically relevant environments, offering unperturbed access to weak and transient interactions that are central to biological regulation.",
    "authors": [
      "Funing Liu",
      "Qitao Hu",
      "Anton Sabantsev",
      "Giovanni Di Muccio",
      "Shuangshuang Zeng",
      "Mauro Chinappi",
      "Sebastian Deindl",
      "Zhen Zhang"
    ],
    "published": "2025-12-15T10:38:33Z",
    "updated": "2025-12-19T14:39:02Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2504.12906v3",
    "url": "https://arxiv.org/abs/2504.12906v3",
    "pdf_url": "https://arxiv.org/pdf/2504.12906v3.pdf",
    "title": "Water activation using Ar-H$_2$ atmospheric pressure plasma jets",
    "abstract": "Whether for materials processing or medical applications, the use of atmospheric pressure plasma jets (APPJs) has emerged as a relevant alternative to conventional methods. Within the APPJs research field, the search for innovation aims not only to solve existing problems but also to explore novel options for generating plasma jets and find new possible applications. In this work, the properties of Ar-H$_2$ APPJs generated using two plasma sources that differ in the frequency, amplitude, and waveform of the generated voltage signal were studied through electrical, thermal, and optical characterization. The discharge parameters were analyzed as a function of the H$_2$ content in the gas mixture, with this parameter varying from 0\\% to 3.5\\%. Optical emission spectroscopy revealed that the same reactive species were produced for both plasma sources, except nitric oxide (NO), which was observed only for the source operated at a higher frequency (PS #1). Applications for water activation were performed without H$_2$ and with 3.5% H$_2$ in the gas mixture. The results of water treatment revealed that ammonia is also produced when H$_2$ is added to the working gas. This finding suggests that the water treated by a Ar-H$_2$ plasma jet can be an attractive option for use in agriculture.",
    "authors": [
      "Fellype do Nascimento",
      "Ananias Alves Barbosa",
      "Konstantin Georgiev Kostov"
    ],
    "published": "2025-04-17T12:52:45Z",
    "updated": "2025-12-19T14:29:21Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1016/j.vacuum.2025.115027"
  },
  {
    "arxiv_id": "2512.17536v1",
    "url": "https://arxiv.org/abs/2512.17536v1",
    "pdf_url": "https://arxiv.org/pdf/2512.17536v1.pdf",
    "title": "Fully stabilized 25 GHz frequency comb for frequency calibration of optical spectrum analyzer",
    "abstract": "Optical spectrometers are widely used in scientific and industrial applications, and precise frequency calibration is essential for ensuring their reliable performance. Traditionally, spectrometers have been calibrated using reference gas cells or reference lamps. However, such conventional methods are not enough to meet the demands for high accuracy and stability. Although frequency-stabilized lasers offer excellent frequency uncertainty, they provide only a single calibration point at a fixed frequency, which is unsuitable for wide-range spectrometer calibration. In this work, we demonstrate a fully stabilized, high-repetition rate electro-optic frequency comb (EO comb) as an absolute frequency reference providing multiple calibration points over a broad spectral range. Our 25 GHz EO comb provides a broadband spectrum spanning from 189.5 THz to 196 THz (corresponding to 1530 nm to 1582 nm), traceable to a frequency standard with a relative standard uncertainty of 10^-13. The well-defined and evenly spaced comb modes can be spectrally resolved by conventional optical spectrometers, enabling wide-range, high-precision frequency calibration. We directly calibrated a commercial spectrometer by referencing its measured frequency values to our well-defined comb modes, thereby evaluating the frequency error with a standard uncertainty of 20 MHz (or relative standard uncertainty of 10^-7), which is limited by the Type A uncertainty (repeatability) of the spectrometer. The proposed method is simple to implement and provides multiple calibration points referenced to the frequency standards over a broad spectral range. This approach improves both the calibration and performance evaluation of spectrometers, and it contributes to the advancement of optical metrology.",
    "authors": [
      "Yoonkwon On",
      "Dae Hee Kim",
      "Sujin Kim",
      "Yong Jin Kim",
      "Jong-Ahn Kim",
      "Sunghoon Eom",
      "Jae Yong Lee",
      "Yoon-Soo Jang"
    ],
    "published": "2025-12-19T13:00:36Z",
    "updated": "2025-12-19T13:00:36Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2512.17522v1",
    "url": "https://arxiv.org/abs/2512.17522v1",
    "pdf_url": "https://arxiv.org/pdf/2512.17522v1.pdf",
    "title": "H-mode transition in the TJ-II stellarator plasmas",
    "abstract": "Since the first H-mode transitions were observed in TJ-II plasmas in 2008, an extensive experimental effort has been done aiming a better physics understanding of confinement transitions. In this paper, an overview of the main findings related to the L-H transition in TJ-II is presented including how the radial electric field is driven, which are the possible mechanisms for turbulence suppression, and what are the related temporal and spatial scales which can impact the transition. The trigger of the L-H transition in TJ-II plasmas is found to be more correlated with the development of fluctuating $E\\times B$ flows than with steady-state $E_r$ effects, pointing to the role played by zonal flows in mediating the transition. Experimental evidence supporting the predator-prey relationship between turbulence and flows as the basis for the L-H transition, found for the first time in TJ-II, reinforces this conclusion. Besides, the reduction in the turbulent transport at the transition is detected at the barrier region but also in a wider radial range with weak or even zero $E\\times B$ flow shear, what points to other mechanisms beyond the turbulence suppression by local sheared flows.",
    "authors": [
      "T. Estrada",
      "C. Hidalgo"
    ],
    "published": "2025-12-19T12:45:42Z",
    "updated": "2025-12-19T12:45:42Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1098/rsta.2021.0229"
  },
  {
    "arxiv_id": "2512.17497v1",
    "url": "https://arxiv.org/abs/2512.17497v1",
    "pdf_url": "https://arxiv.org/pdf/2512.17497v1.pdf",
    "title": "Towards Halbach Spheres -- Icosahedral Symmetry Is Not Just Cool Anymore",
    "abstract": "Halbach spheres provide a theoretically elegant means of generating highly homogeneous magnetic fields, but practical implementation is hindered by challenging fabrication and restricted interior access. This study examines discrete spherical Halbach configurations assembled from permanent magnets placed at the vertices of Platonic and Archimedean solids. Analytical calculations, numerical field simulations, and experimental measurements indicate that polyhedra with icosahedral symmetry achieve the most favorable balance among field strength, homogeneity, and interior accessibility. They produce exceptionally flat fourth-order central saddle points, resulting in a usable homogeneous field volume up to a factor of 260 larger than that of traditional Halbach disk or cylindrical arrays. Several magnet assemblies composed of cubical NdFeB magnets are fabricated and their three dimensional field distributions characterized, demonstrating homogeneous regions of up to several cubic centimeters with deviations below 1%. The findings establish discrete icosahedrally symmetric magnet arrays as practical, scalable building blocks for compact, highly homogeneous magnetic field sources suited to mobile magnetic resonance, and magnetophoretic applications.",
    "authors": [
      "Ingo Rehberg",
      "Peter Blümler"
    ],
    "published": "2025-12-19T12:06:49Z",
    "updated": "2025-12-19T12:06:49Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.17395v1",
    "url": "https://arxiv.org/abs/2512.17395v1",
    "pdf_url": "https://arxiv.org/pdf/2512.17395v1.pdf",
    "title": "In situ substrate birefringence characterization in gravitational wave detectors using a heterodyne polarimetry method",
    "abstract": "High-quality test mass substrates play essential roles in laser interferometric gravitational wave detectors. Inhomogeneous birefringence distribution in test mass substrates, however, can degrade the sensitivity of the detector by introducing the optical loss and disturbing the interferometer controls. In this paper, we present a heterodyne polarimetry method that enables in situ birefringence characterizations, hence diagnosing the gravitational wave interferometer. We experimentally demonstrate the proposed method with a tabletop setup. We also discuss its applicability to current and future gravitational wave detectors and the detectable limit.",
    "authors": [
      "Satoshi Tanioka",
      "Terri Pearce",
      "Yuta Michimura",
      "Kazuhiro Agatsuma",
      "Martin Van Beuzekom",
      "Alberto Vecchio",
      "Stephen Webster",
      "Matteo Leonardi",
      "Keiko Kokeyama"
    ],
    "published": "2025-12-19T09:47:41Z",
    "updated": "2025-12-19T09:47:41Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM",
      "gr-qc"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.17366v1",
    "url": "https://arxiv.org/abs/2512.17366v1",
    "pdf_url": "https://arxiv.org/pdf/2512.17366v1.pdf",
    "title": "Supersampled scanning transmission X-ray microscopy for high-resolution vibration-free imaging",
    "abstract": "Scanning transmission X-ray microscopy (STXM) is a nanoscale imaging technique that can utilize several powerful contrast mechanisms for the quantitative mapping of chemical and physical materials properties. Spatial resolutions down to 7~nm at the soft X-ray energy range have been demonstrated. A limiting factor for high-resolution STXM imaging is given by the positioning precision of the sample with respect to the focusing optic, with the current state-of-the-art leading to significant overheads, especially at low pixel dwell times, and being vulnerable to unavoidable external vibrations sources. In this work, we present a method, called supersampled scanning microscopy, that allows for a significant reduction of overhead times while simultaneously removing the effects of vibrational noise by sampling the position of the sample at a rate significantly higher than the vibration spectrum and reconstructing the sample transmission image from the recorded list of positions and detector counts. We demonstrate the performance of the technique with a set of proof-of-concept high-resolution imaging experiments.",
    "authors": [
      "Simone Finizio",
      "Benjamin Watts",
      "Benedikt Rösner",
      "Jörg Raabe"
    ],
    "published": "2025-12-19T09:06:39Z",
    "updated": "2025-12-19T09:06:39Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.17357v1",
    "url": "https://arxiv.org/abs/2512.17357v1",
    "pdf_url": "https://arxiv.org/pdf/2512.17357v1.pdf",
    "title": "Quantitative phase nano-imaging with a laboratory source",
    "abstract": "Investigating the structure of matter at the nanoscale non destructively is a key capability enabled by X-ray imaging. One of the most powerful nano-imaging methods is X-ray ptychography, a coherent diffraction imaging technique that has become the go-to method at synchrotron facilities for applications ranging from brain imaging to battery materials. However, the requirements in terms of X-ray beam quality have limited its use to large synchrotron facilities and, to date, only one attempt has been made to translate the technique to a small-scale laboratory. To unleash the power of this technique to the broad user community of laboratory X-ray sources, there are outstanding questions to answer including whether the quantitativeness of the information is preserved in a laboratory despite the drastic decrease in X-ray flux of several orders of magnitude, with respect to synchrotron instruments. In this study not only we demonstrate that the quantitativeness of X-ray ptychography is preserved in a laboratory setting, but we also apply the method to the imaging of a brain tissue phantom. Finally, we describe the current challenges and limitations, and we set the basis for further development and future directions of quantitative nano-imaging with laboratory X-ray sources.",
    "authors": [
      "Luca Fardin",
      "Chris Armstrong",
      "Alberto Astolfo",
      "Sebastian Ignacio Allen Binet",
      "Matthieu N. Boone",
      "Rebecca Fitzgarrald",
      "Yong Ma",
      "Alexander Thomas",
      "Darren J. Batey",
      "Alessandro Olivo",
      "Silvia Cipiccia"
    ],
    "published": "2025-12-19T08:54:37Z",
    "updated": "2025-12-19T08:54:37Z",
    "categories": [
      "physics.comp-ph",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "physics.comp-ph"
  },
  {
    "arxiv_id": "2512.17355v1",
    "url": "https://arxiv.org/abs/2512.17355v1",
    "pdf_url": "https://arxiv.org/pdf/2512.17355v1.pdf",
    "title": "SPIDER, a Waveform Digitizer ASIC for picosecond timing in LHCb PicoCal",
    "abstract": "We present the architecture, design and first test results of SPIDER, the first prototype of a TSMC CMOS 65 nm ASIC designed for the time measurement path of LHCb Electromagnetic Calorimeter after LS4 Upgrade.   The main requirements for the readout of this detector are a time resolution below 15 ps rms above 5 GeV, and a channel occupancy up to 30\\% (12 Mevent/s).   The first prototype called SPIDER\\_V0 is a 2-channel waveform digitizer locked on the LHC clock allowing precise time reconstruction by digital algorithms. The architecture is based on 2 DLLs in series controlling respectively the phase of the sampling window and the sampling frequency, the latter covering the range between 2 and 20 GS/s. Each self-triggering channel houses 8 banks of 32 analog memory cells and a massively parallel Wilkinson ADC for conversion at 5 GHz over 10 bits with a maximal conversion time of 200 ns.   SPIDER targets not only LHCb, but all fast detectors mounted on current and future accelerators. Its sampling frequency can indeed be adjusted to different signal risetimes. Its main frequency of 40 MHz could even be eventually locked to another value by modifying only one of the DLLs in the chip design.",
    "authors": [
      "Ludovic Alvado",
      "Nicolas Arveuf",
      "Edouard Bechetoille",
      "Guillaume Blanchard",
      "Dominique Breton",
      "Baptiste Joly",
      "Laurent Leterrier",
      "Jihane Maalmi",
      "Samuel Manen",
      "Hervé Mathez",
      "Christophe Sylvia",
      "Philippe Vallerand",
      "Richard Vandaele"
    ],
    "published": "2025-12-19T08:52:33Z",
    "updated": "2025-12-19T08:52:33Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.17337v1",
    "url": "https://arxiv.org/abs/2512.17337v1",
    "pdf_url": "https://arxiv.org/pdf/2512.17337v1.pdf",
    "title": "Influence of plasma shaping on the parity of core-localized toroidal Alfvén eigenmode in an advanced tokamak configuration",
    "abstract": "Toroidal Alfvén eigenmodes (TAEs) and energetic particle modes (EPMs) can both be excited by energetic particles from auxiliary heating and fusion-born alpha particles in a tokamak. Using the hybrid kinetic-MHD model implemented in the NIMROD code, the excitation of these modes and their properties are investigated in an advanced tokamak configuration with reversed magnetic shear in the core region. The dominant TAE/EPM is found to exhibit odd parity with an anti-ballooning structure when the plasma has elongated, non-circular two-dimensional shaping. As the plasma shaping becomes more circular with reduced elongation, the mode parity undergoes a transition to even parity accompanied by a ballooning structure. These results may help explain the dominant parity of TAE/EPMs observed in advanced tokamak configurations with different plasma shaping.",
    "authors": [
      "Shiwei Xue",
      "Ping Zhu",
      "Haolong Li"
    ],
    "published": "2025-12-19T08:30:30Z",
    "updated": "2025-12-19T08:30:30Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.17269v1",
    "url": "https://arxiv.org/abs/2512.17269v1",
    "pdf_url": "https://arxiv.org/pdf/2512.17269v1.pdf",
    "title": "Asymptotic state of nonlinear Landau damping in one-dimensional plasma",
    "abstract": "In this work, the asymptotic state of nonlinear Landau damping in one-dimensional plasma has been examined using a quasi-linear model and a second-order symplectic integrator. The dispersion relation of the plateau distribution function for the steady-state solution of the quasi-linear mode is extended to the complex plane and compared with the nonlinear simulation. We determine that the asymptotic state of the collisionless plasma is a multi-wave BGK structure. This structure is characterized by multiple vortices in phase space, which correspond to distinct peaks in the frequency-wavenumber (ω, k) spectrum of the electric field",
    "authors": [
      "Yifei Ouyang",
      "Ping Zhu",
      "Chung-Sang Ng"
    ],
    "published": "2025-12-19T06:34:16Z",
    "updated": "2025-12-19T06:34:16Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.09125v2",
    "url": "https://arxiv.org/abs/2512.09125v2",
    "pdf_url": "https://arxiv.org/pdf/2512.09125v2.pdf",
    "title": "Bayesian Optimization of Laser-Wakefield Acceleration via Spectral Pulse Shaping",
    "abstract": "In this paper, we investigate the effect of spectral pulse shaping of the laser driver on the performance of channel-guided, laser-plasma accelerators. The study was carried out with the assistance of Bayesian optimization using particle-in-cell simulations. We used a realistic plasma profile based on a novel optical-field-ionized channel technique with ionization injection and low on-axis plasma densities to maximize the energy gain of the electron bunch trailing the laser. Spectral shaping allows us to modify the temporal profile of the laser driver while keeping the laser energy constant, affecting the acceleration and injection processes. Given the complexity and breadth of the parameter space in question, we used numerical optimization to identify high performers. In particular, we found laser profiles with additional spectral content that, when used with optimal plasma channel parameters, result in charge content an order of magnitude higher than the baseline Gaussian case while also increasing the mean energy of the electron bunch.",
    "authors": [
      "B. Z. Djordjević",
      "C. Benedetti",
      "A. D. McNaughton",
      "R. Lehe",
      "H. -E. Tsai",
      "S. C. Wilks",
      "B. A. Reagan",
      "G. J. Williams",
      "J. van Tilborg",
      "C. B. Schroeder"
    ],
    "published": "2025-12-09T21:10:45Z",
    "updated": "2025-12-19T06:33:59Z",
    "categories": [
      "physics.plasm-ph",
      "math.OC",
      "physics.acc-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.17252v1",
    "url": "https://arxiv.org/abs/2512.17252v1",
    "pdf_url": "https://arxiv.org/pdf/2512.17252v1.pdf",
    "title": "Deep Learning Enabled Nanoscale X-ray Photoemission Electron Microscopy (nanoXPEEM)",
    "abstract": "Understanding and manipulating two-dimensional materials for real-world applications remains challenging due to a lack of effective and high-throughput characterization techniques. Soft X-ray time-of-flight photoemission electron microscopy (XPEEM) provides element- and depth-sensitive information of materials and buried interfaces. However, chromatic and spherical aberrations cannot be corrected with electron-lens combinations. These aberrations, combined with astigmatism and space-charge effects, significantly degrade the spatial and energy resolutions. To overcome this limitation, we outline a spatial-attention based deep learning approach to automatically correct for these effects and attain nanometer resolution over the entire field-of-view (FoV). The combination of this corrective algorithm with XPEEM, termed as nanoXPEEM, establishes a new record of 48-nm spatial resolution with a 232-micrometer diameter FoV in the soft x-ray regime (700-1000 eV). nanoXPEEM provides unique spatial mapping of the element-specificity, depth-sensitivity, and local structure on the nanoscale. It can bridge the current gap to achieve angstrom (atomic) scale resolution.",
    "authors": [
      "Aashwin Mishra",
      "Daniel Ratner",
      "Quynh Nguyen"
    ],
    "published": "2025-12-19T05:40:58Z",
    "updated": "2025-12-19T05:40:58Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2512.17176v1",
    "url": "https://arxiv.org/abs/2512.17176v1",
    "pdf_url": "https://arxiv.org/pdf/2512.17176v1.pdf",
    "title": "Doppler-induced continuous spectral broadening of ultraviolet lasers",
    "abstract": "We propose a compact scheme based on ultrafast-rotating phase plates (URPPs) to achieve continuous spectral broadening of ultraviolet lasers. The rapid rotation elements behave as a random oscillator which induces Doppler frequency shift into the ultraviolet lasers. As an example, for a disk-shaped phase plate, with the beam acting on the edge at a radius of 10 cm, a rotation frequency of 1 kHz, and a phase-element size of 10 nm, the continuous spectral broadening reaches 0.07%. Further increasing the rotation speed or reducing the phase-element can lead to greater spectral broadening. When multiple URPPs are arranged in series, the superimposed spatiotemporal modulation further enhances the continuous spectral broadening and achieves more effective speckle smoothing. The scheme is applicable to broadening the independent spectrum of optical frequency combs as well as to the mitigation of laser-plasma instabilities in inertial fusion energy.",
    "authors": [
      "Huanhuan Wu",
      "Yuhan Liu",
      "Shengqiang Zhong",
      "Yaozhi Yi",
      "Zhuwen Lin",
      "Hongwei Yin",
      "Yilin Xu",
      "Fan Yang",
      "Xiantao Jiang",
      "Yao Zhao"
    ],
    "published": "2025-12-19T02:31:18Z",
    "updated": "2025-12-19T02:31:18Z",
    "categories": [
      "physics.optics",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2512.16867v1",
    "url": "https://arxiv.org/abs/2512.16867v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16867v1.pdf",
    "title": "Electric field diagnostics in a continuous rf plasma using Rydberg-EIT",
    "abstract": "We present a non-invasive spectroscopic technique to measure electric fields in plasma, leveraging large polarizabilities and Stark shifts of Rydberg atoms. Rydberg Stark shifts are measured with high precision using narrow-linewidth lasers via Electromagnetically Induced Transparency (EIT) of rubidium vapor seeded into a continuous, inductively coupled radio-frequency (rf) plasma in a few mTorr of argon gas. Without plasma, the Rydberg-EIT spectra exhibit rf modulation sidebands caused by electric- and magnetic-dipole transitions in the rf drive coil. With the plasma present, the rf modulation sidebands vanish due to screening of the rf drive field from the plasma interior. The lineshapes of the EIT spectra in the plasma reflect the plasma's Holtsmark microfield distribution, allowing us to determine plasma density and collisional line broadening over a range of pressures and rf drive powers. The work is expected to have applications in non-invasive spatio-temporal electric-field diagnostics of low-pressure plasma, plasma sheaths, process plasma and dusty plasma.",
    "authors": [
      "Bineet Dash",
      "Xinyan Xiang",
      "Dingkun Feng",
      "Eric Paradis",
      "Georg Raithel"
    ],
    "published": "2025-12-18T18:37:58Z",
    "updated": "2025-12-18T18:37:58Z",
    "categories": [
      "physics.atom-ph",
      "physics.plasm-ph",
      "quant-ph"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2512.16839v1",
    "url": "https://arxiv.org/abs/2512.16839v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16839v1.pdf",
    "title": "A MAPS Detector for High Resolution Low Dose EBSD",
    "abstract": "The use of highly sensitive pixelated direct detectors has dramatically improved the performance of high energy instrumentation such as transmission electron microscopy. Here, we describe a recently developed monolithic active pixel sensor designed for low energy scanning electron microscopy applications. This detector enables electron backscatter diffraction (EBSD) at lower energies and dose than are accessible with existing scintillator-coupled detectors, expanding grain orientation mapping capabilities to materials such as ceramics that are poor electron conductors. The high detector sensitivity allows collection of rich diffraction information - providing dislocation defect contrast that is otherwise not accessible via EBSD. Indeed, even the energy of single electron interaction events can be measured with this detector, which we demonstrate to energy filter diffraction patterns revealing details of how diffraction occurs at low energy.",
    "authors": [
      "Barnaby D. A. Levin",
      "Kalani Moore",
      "Nicolò M. Della Ventura",
      "McLean P. Echlin",
      "Tresa M. Pollock",
      "Daniel S. Gianola"
    ],
    "published": "2025-12-18T18:17:29Z",
    "updated": "2025-12-18T18:17:29Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mes-hall",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.16789v1",
    "url": "https://arxiv.org/abs/2512.16789v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16789v1.pdf",
    "title": "Evaluation of a large-area double-sided silicon strip detector for quality assurance in ion-beam radiotherapy",
    "abstract": "Designed to provide quality assurance for ion-beam radiotherapy, the prototype fIVI (filtered Interaction Vertex Imaging) Range Monitoring System is a two-layer tracker which employs double-sided strip-segmented silicon detectors. To meet the high demands of a clinical environment, a large sensitive area is required, along with a fast and compact readout. As this device utilizes sensors and readout electronics adapted from particle physics, where the expected energy and count rate differ significantly from radiotherapy, validation was necessary to ensure that these sensors would function effectively at the order 100 MeV/u energies and order MHz count rates expected during clinical irradiation. Tests were conducted using scattered subclinical 19 MeV protons at high intensity, and clinical 207 MeV/u carbon ions at low intensity to independently validate these variables. The detection system is found to operate at rates up to 1.3 MHz, with a negligible fraction of events being affected by pileup. The efficiency of hit reconstruction is high, with a timestamp resolution of 6.25 ns, and a coincidence window of 31.25 ns, as is required for clinical event rates. With these settings, over 90% of particle interactions are able to reconstruct unique hit positions and contribute to track formation. This device is the first system using large-area, high-resolution detectors which meets the demanding count rate requirements associated with clinical radiotherapy.",
    "authors": [
      "Devin Hymers",
      "Sebastian Schroeder",
      "Olga Bertini",
      "Johann Heuser",
      "Joerg Lehnert",
      "Christian Joachim Schmidt",
      "Dennis Mücher"
    ],
    "published": "2025-12-18T17:24:53Z",
    "updated": "2025-12-18T17:24:53Z",
    "categories": [
      "physics.ins-det",
      "physics.med-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.16769v1",
    "url": "https://arxiv.org/abs/2512.16769v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16769v1.pdf",
    "title": "Operation of silicon photomultipliers in a dilution refrigerator down to 9.4 mK towards a cryogenic cosmic ray muon veto system",
    "abstract": "We report the characterisation of a FBK NUV-HD-cryo silicon photomultiplier (SiPM) sensor operated in an 9.4 $\\pm$ 0.2 mK environment inside a dilution refrigerator, towards the development of a cryogenic cosmic ray muon veto system to be operated internal to a dilution refrigerator required for low background experiments such as the QUEST-DMC dark matter search experiment. We characterise the single photon response and the gain (the charge produced per detected photon), the dark count noise rate, and correlated noise contributions as a function of operating voltage. This paper also reports first proof of concept measurements of using a SiPM directly coupled to scintillator in a 9.4 mK temperature environment, towards detecting candidate cosmic ray muon signals.",
    "authors": [
      "QUEST-DMC Collaboration",
      ":",
      "A. Kemp",
      "S. Autti",
      "E. Bloomfield",
      "A. Casey",
      "N. Darvishi",
      "N. Eng",
      "P. Franchini",
      "R. P. Haley",
      "P. J. Heikkinen",
      "A. Jennings",
      "S. Koulosousas",
      "E. Leason",
      "L. V. Levitin",
      "J. March-Russell",
      "A. Mayer",
      "J. Monroe",
      "D. Münstermann",
      "M. T. Noble",
      "J. R. Prance",
      "X. Rojas",
      "T. Salmon",
      "J. Saunders",
      "J. Smirnov",
      "R. Smith",
      "M. D. Thompson",
      "A. Thomson",
      "A. Ting",
      "V. Tsepelin",
      "S. M. West",
      "L. Whitehead",
      "D. E. Zmeev"
    ],
    "published": "2025-12-18T17:02:51Z",
    "updated": "2025-12-18T17:02:51Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.14649v4",
    "url": "https://arxiv.org/abs/2509.14649v4",
    "pdf_url": "https://arxiv.org/pdf/2509.14649v4.pdf",
    "title": "Intensified optical camera with Timepix4 readout",
    "abstract": "We report the first characterization results of an optical time-stamping camera based on the Timepix4 chip coupled to a fully depleted optical silicon sensor and fast image intensifier, enabling sub-nanosecond scale, time-resolved imaging for single photons. The system achieves an RMS time resolution of 0.3 ns in direct detection mode without the intensifier and from 0.6 to 1.5 ns in the single-photon regime with an intensifier for different amplitude-based signal selections. This shows that Timepix4 provides a significant improvement over previous Timepix3-based cameras in terms of timing precision, and also in pixel count and data throughput. We analyze key factors that affect performance, including sensor bias and timewalk effect, and demonstrate effective correction methods to recover high temporal accuracy. The camera's temporal resolution, event-driven readout and high rate capability make it a scalable platform for a wide range of applications, including quantum optics, ultrafast imaging, and time-correlated photon counting experiments.",
    "authors": [
      "Erik Hogenbirk",
      "Andrei Nomerotski",
      "Bram Bouwens",
      "Gabriel Diaz",
      "Shazia Farooq",
      "Sergei Kulkov",
      "Erik Maddox",
      "Ondrej Matousek",
      "Peter Svihra",
      "Henrique Zanoli"
    ],
    "published": "2025-09-18T06:09:03Z",
    "updated": "2025-12-18T16:48:13Z",
    "categories": [
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.05067v2",
    "url": "https://arxiv.org/abs/2507.05067v2",
    "pdf_url": "https://arxiv.org/pdf/2507.05067v2.pdf",
    "title": "Quantifying Resolution Limits in Pedestal Profile Measurements with Gaussian Process Regression",
    "abstract": "Edge transport barriers (ETBs) in magnetically confined fusion plasmas, commonly known as pedestals, play a crucial role in achieving high confinement plasmas. However, their defining characteristic, a steep rise in plasma pressure over short length scales, makes them challenging to diagnose experimentally. In this work, we use Gaussian Process Regression (GPR) to develop first-principles metrics for quantifying the spatiotemporal resolution limits of inferring differentiable profiles of temperature, pressure, or other quantities from experimental measurements. Although we focus on pedestals, the methods are fully general and can be applied to any setting involving the inference of profiles from discrete measurements. First, we establish a correspondence between GPR and low-pass filtering, giving an explicit expression for the effective `cutoff frequency' associated with smoothing incurred by GPR. Second, we introduce a novel information-theoretic metric, \\(N_{eff}\\), which measures the effective number of data points contributing to the inferred value of a profile or its derivative. These metrics enable a quantitative assessment of the trade-off between `over-fitting' and `over-regularization', providing both practitioners and consumers of GPR with a systematic way to evaluate the credibility of inferred profiles. We apply these tools to develop practical advice for using GPR in both time-independent and time-dependent settings, and demonstrate their usage on inferring pedestal profiles using measurements from the DIII-D tokamak.",
    "authors": [
      "Norman M. Cao",
      "David R. Hatch",
      "Craig Michoski",
      "Todd A. Oliver",
      "David Eldon",
      "Andrew Oakleigh Nelson",
      "Matthew Waller"
    ],
    "published": "2025-07-07T14:49:56Z",
    "updated": "2025-12-18T16:16:22Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1088/1741-4326/ae2d6f"
  },
  {
    "arxiv_id": "2512.16689v1",
    "url": "https://arxiv.org/abs/2512.16689v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16689v1.pdf",
    "title": "CARONTE: a Physics-Informed Extreme Learning Machine-Based Algorithm for Plasma Boundary Reconstruction in Magnetically Confined Fusion Devices",
    "abstract": "In this work, we propose a novel physics informed neural network based algorithm for real time plasma boundary reconstruction in tokamak devices. The approach is based on a single Extreme Learning Machine network used to solve the homogeneous Grad Shafranov equation, which is required to identify the plasma boundary. This architecture enables the real time training of the network parameters using the available magnetic sensor data and, consequently, dynamically adapting the network output to the evolving plasma equilibrium. We demonstrate that, the network performs accurate plasma boundary reconstruction for complex configurations, outperforming well established methods, such as the algorithm used for decades at the Joint European Torus, the world's largest tokamak, until it ceased operation in 2023. Indeed, compared to the latter, the proposed solution better generalizes the poloidal flux function, without requiring algorithm retuning across different plasma equilibria. The proposed neural network reconstructor demonstrates also greater robustness with respect to noise on the magnetic measurements. Moreover, this method takes advantage of the generalization power of neural networks but without the need for extensive, time consuming training based on a huge amount of experimental data, making its implementation on existing devices straightforward.",
    "authors": [
      "Federico Fiorenza",
      "Sara Dubbioso",
      "Gianmaria De Tommasi",
      "Alfredo Pironti"
    ],
    "published": "2025-12-18T15:55:33Z",
    "updated": "2025-12-18T15:55:33Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.16643v1",
    "url": "https://arxiv.org/abs/2512.16643v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16643v1.pdf",
    "title": "Temperature dependence of the long-term annealing behavior of neutron irradiated diodes from 8-inch p-type silicon wafers",
    "abstract": "To face the higher levels of radiation due to the 10-fold increase in integrated luminosity during the High-Luminosity LHC, the CMS detector will replace the current Calorimeter Endcap (CE) using the High-Granularity Calorimeter (HGCAL) concept. The high-radiation regions of the the CE, where fluences between $1\\cdot10^{14}~n_{eq}/cm^{2}$ and $1\\cdot10^{16}~n_{eq}/cm^{2}$ and doses of up to 2\\,MGy are expected considering an integrated luminosity of $3\\,ab^{-1}$, will be equipped with silicon pad sensors. This includes the entire electromagnetic as well as parts of the hadronic section of the CE. The silicon sensors are processed on 8-inch p-type wafers with an active thickness of 300\\,\\textmu m, 200\\,\\textmu m and 120\\,\\textmu m and cut into hexagonal shapes for optimal use of the full wafer area and tiling. With each main sensor, several small test structures (e.g. pad diodes) are hosted on the wafers, used for quality assurance and radiation hardness tests. In order to investigate the radiation-induced bulk damage, these diodes have been irradiated with reactor neutrons at JSI (Jozef Stefan Institute, Ljubljana, Slovenia) to fluences between $5\\cdot10^{14}~n_{eq}/cm^{2}$ and $1.5\\cdot10^{16}~n_{eq}/cm^{2}$. This study focuses on the isothermal annealing behavior of the bulk material at different temperatures between 5.5°C and 60°C using electrical characterization and charge collection measurements. The results are used to extract the annealing time constants for this material and fluence range based on the Hamburg model approach to allow an estimation of the expected annealing effects in silicon sensors during the year-end technical stops and the long HL-LHC shutdowns. The annealing parameters found will make it possible to model the annealing behavior of p-type silicon detector projects at HL-LHC fluence ranges better than the existing Hamburg model.",
    "authors": [
      "Leena Diehl",
      "Oliwia Kaluzinska",
      "Marie Mühlnikel",
      "Max Andersson",
      "Natalya Gerassyova",
      "Jenan Amer",
      "Eva Sicking",
      "Dana Groner",
      "Jan Kieseler",
      "Matteo Defranchis"
    ],
    "published": "2025-12-18T15:15:21Z",
    "updated": "2025-12-18T15:15:21Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.16630v1",
    "url": "https://arxiv.org/abs/2512.16630v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16630v1.pdf",
    "title": "Photon Accelerator in Magnetized Plasma",
    "abstract": "Strong magnetic fields and plasmas are intrinsically linked in both terrestrial laboratory experiments and in space phenomena. One of the most profound consequences of that is the change in relationship between the frequency and the wave number of electromagnetic waves propagating in plasma in the presence of such magnetic fields when compared to the case without these fields. Furthermore, magnetic fields alter electromagnetic wave interaction with relativistic plasma waves, resulting in different outcomes for particle and radiation generation. For a relativistic plasma wave-based photon acceleration this leads to an increased frequency gain, and, thus, potentially to higher efficiency. The influence of a magnetic field leads to quantitative and qualitative change in the properties of photon acceleration, amplifying the increase in the electromagnetic wave frequency.",
    "authors": [
      "Sergei Bulanov",
      "Stepan Bulanov",
      "Timur Esirkepov",
      "Gianluca Gregori",
      "Gabriele Grittani",
      "Brandon Russell",
      "Alec Thomas",
      "Petr Valenta"
    ],
    "published": "2025-12-18T15:06:33Z",
    "updated": "2025-12-18T15:06:33Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.04205v2",
    "url": "https://arxiv.org/abs/2509.04205v2",
    "pdf_url": "https://arxiv.org/pdf/2509.04205v2.pdf",
    "title": "Toward precision physics tests with future COHERENT detectors",
    "abstract": "We present a comprehensive sensitivity study of future CE$ν$NS detectors, focusing on a cryogenic cesium iodide detector and a tonne-scale liquid argon one, currently being developed by the COHERENT Collaboration. These setups will enable precision measurements of the weak mixing angle at low energies and allow accurate extraction of the neutron nuclear distribution radius. We also demonstrate that next-generation detectors will place constraints on the neutrino charge radius comparable to or better than current global fits. In addition, we explore the sensitivity to non standard neutrino electromagnetic properties, such as magnetic moments and millicharges, as well as new mediators. These findings reinforce the role of CE$ν$NS experiments in the upcoming precision era, with future detectors playing a key role in advancing our understanding of neutrino interactions and electroweak physics at low energies.",
    "authors": [
      "M. Atzori Corona",
      "M. Cadeddu",
      "N. Cargioli",
      "F. Dordei",
      "C. Giunti",
      "R. Pavarani"
    ],
    "published": "2025-09-04T13:31:19Z",
    "updated": "2025-12-18T14:48:12Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "hep-ph"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.3390/universe11120416"
  },
  {
    "arxiv_id": "2512.16604v1",
    "url": "https://arxiv.org/abs/2512.16604v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16604v1.pdf",
    "title": "Disruption Modelling for Engineering and Physics Design of Tokamak Energy ST-E1 Fusion Power Plant",
    "abstract": "Plasma disruptions represent a critical challenge for high-performance tokamak operations, as they can compromise machine integrity and reduce operational availability. Although future fusion devices essentially need to incorporate strategies to minimise disruption occurrence, complete avoidance remains unattainable. Consequently, assessing and characterising unmitigated disruption consequences is fundamental for the design and qualification of next-generation fusion power plants. This work supports the pre-conceptual design of ST-E1, a low aspect-ratio Tokamak Fusion Power Plant developed by Tokamak Energy Ltd., by presenting a comprehensive disruption modelling approach applied across different design stages. The methodology integrates both physics and engineering considerations to evaluate the impact of disruptions on machine performance and structural integrity. From an engineering perspective, several ST-E1 layout options were analysed to investigate the electromagnetic response of key components under disruption-induced loads, enabling comparison between alternative design solutions. On the physics side, a broad set of disruption scenarios was explored, scanning operational space parameters, plasma-material interactions, and associated thermal loads. Furthermore, the study examined variations in disruption behaviour arising from different reference equilibria, focusing on a range starting from Double Null to Single Null configurations, reflecting the increasing up-down asymmetry consequences. The results reveal significant contrasts in plasma dynamics and structures electromagnetic behaviour between configurations, highlighting the importance of disruption modelling in guiding design choices. These analyses have proven instrumental in shaping ST-E1 development, offering critical insights for mitigating risks and optimising future fusion reactor designs.",
    "authors": [
      "M. Scarpari",
      "X. Zhang",
      "K. Borowiec",
      "P. F. Buxton",
      "G. Calabro",
      "S. Carusotti",
      "A. Ciula",
      "V. Godhani",
      "J. D. Lore",
      "E. N. J. Maartensson",
      "S. A. M. McNamara",
      "J. H. Nichols",
      "M. Notazio",
      "M. Robinson",
      "M. Romanelli",
      "J. Willis",
      "ST-E1 Team"
    ],
    "published": "2025-12-18T14:46:08Z",
    "updated": "2025-12-18T14:46:08Z",
    "categories": [
      "physics.plasm-ph",
      "physics.comp-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.21375v2",
    "url": "https://arxiv.org/abs/2510.21375v2",
    "pdf_url": "https://arxiv.org/pdf/2510.21375v2.pdf",
    "title": "Picosecond Precision Heavy Ion Detector for Λ Hypernuclei Lifetime Studies",
    "abstract": "In this paper, we present the design and preliminary performance evaluation of a new heavy ion detector for direct measurements of heavy Λ hypernuclei lifetime. The detector employs the previously developed 10 picosecond resolution Radio Frequency (RF) Timer, which converts the temporal information of incident particles into spatial coordinates of secondary or photoelectrons on a position-sensitive detector by means of circular RF scanning in the 500-1000 MHz range. Here, we report the detector design to achieve efficient suppression of accidental background and effective separation of prompt reaction products and delayed events from Λ hypernuclei decays, results of test studies carried out with RF synchronized laser as well as preliminary results obtained by using alpha particles. Dedicated Monte-Carlo simulations have been performed to estimate the detector's performance under realistic experimental conditions at RF-driven electron, photon, or proton beams. The results confirm the feasibility of the proposed design and provide a basis for upcoming experimental measurements, based on the delayed fission detection.",
    "authors": [
      "Simon Zhamkochyan",
      "Sergey Abrahamyan",
      "Amur Margaryan",
      "Hayk Elbakyan",
      "Aram Kakoyan",
      "Samvel Mayilyan",
      "Artashes Papyan",
      "Hasmik Rostomyan",
      "Anna Safaryan",
      "Gagik Sughyan",
      "Narek Margaryan",
      "Garnik Ayvazyan",
      "John Annand",
      "Kenneth Livingston",
      "Rachel Montgomery",
      "Patrick Achenbach",
      "Josef Pochodzalla",
      "Dimiter Balabanski",
      "Satoshi Nakamura",
      "Ani Aprahamian",
      "Vanik Kakoyan"
    ],
    "published": "2025-10-24T11:58:51Z",
    "updated": "2025-12-18T14:24:27Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.16546v1",
    "url": "https://arxiv.org/abs/2512.16546v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16546v1.pdf",
    "title": "SCOPE: Simple Coil Optimization for Plasma and Engineering",
    "abstract": "Designing superconducting coils for a tokamak fusion device is a highly coupled, non-linear design problem. The coils have many disparate engineering requirements from structural to power electronics, as well strict limits placed on the system by the high temperature superconducting (HTS) cables. Simultaneously, the coils must be able to contain multiple plasma scenarios from inception, through ramp up, to flat top, and ramp down, all whilst applying a large, controlled, inductive voltage to drive current. In addition, we wish to optimize divertor separatrices to increase the likelihood of designing a suitable divertor strikepoint. Lastly, the physical limits of the entire tokamak must be taken into account and space reserved for support structures, access for maintenance schemes, and installation limits. The method outlined here uses a combined simulated annealing method to find optimal coil sizes and positions with a constrained quadratic or quartic optimization for the coil currents. The method is designed to optimize coils for multiple scenarios simultaneously, including ramp-ups, to avoid over optimization of a single design point. A key enabler is the efficient implementation that allows millions of evaluations to be performed in a few hours with modest computational power. This optimization method is part of a larger, iterative workflow which enables further, detailed design work to feedback on the optimization.",
    "authors": [
      "Nathan Welch",
      "Chris Marsden"
    ],
    "published": "2025-12-18T13:53:18Z",
    "updated": "2025-12-18T13:53:18Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.15853v2",
    "url": "https://arxiv.org/abs/2509.15853v2",
    "pdf_url": "https://arxiv.org/pdf/2509.15853v2.pdf",
    "title": "Electron-positron pair generation using a single kJ-class laser pulse in a foam-reflector setup",
    "abstract": "We investigate the process of creating electron-positron pairs from laser-matter interaction in pre-ionised foam targets using particle-in-cell simulations. A high-intensity laser pulse drives electrons via direct laser acceleration up to a cone-shaped reflector. The high-energy electrons interact with the reflected laser pulse, generating abundant pairs. The effects of the plasma-channel shape on the propagation of the laser pulse and subsequent pair production is studied. The results show that the number of Compton emission and Breit-Wheeler pair creation events is highly sensitive to the diffraction of the laser due to its interaction with the foam.",
    "authors": [
      "Oliver Mathiak",
      "Lars Reichwein",
      "Alexander Pukhov"
    ],
    "published": "2025-09-19T10:44:00Z",
    "updated": "2025-12-18T09:37:29Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.16311v1",
    "url": "https://arxiv.org/abs/2512.16311v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16311v1.pdf",
    "title": "Bunch-by-Bunch Prediction of Beam Transverse Position, Phase, and Length in a Storage Ring Using Neural Networks",
    "abstract": "Real-time, bunch-by-bunch monitoring of transverse position, longitudinal phase, and bunch length is crucial for beam control in diffraction-limited storage rings, where complex collective dynamics pose unprecedented diagnostic challenges. This study presents a neural network framework that simultaneously predicts these parameters directly from beam position monitor waveforms. The hybrid architecture integrates specialized Multi-Layer Perceptron (MLP), Convolutional Neural Network (CNN), and Long Short-Term Memory with Attention (LSTM-Attention) sub-networks, overcoming key limitations of traditional methods such as serial processing chains and batch-mode operation. Validated on experimental data from the Shanghai Synchrotron Radiation Facility and Hefei Light Source, the model achieves high prediction accuracy with a sub-millisecond latency of 0.042 ms per bunch. This performance demonstrates its potential as a core tool for real-time, multi-parameter diagnostics and active feedback in next-generation light sources.",
    "authors": [
      "Can Liu",
      "Xing Yang",
      "Youming Deng",
      "Qingqing Duan",
      "Yongbin Leng"
    ],
    "published": "2025-12-18T08:51:01Z",
    "updated": "2025-12-18T08:51:01Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2502.19061v2",
    "url": "https://arxiv.org/abs/2502.19061v2",
    "pdf_url": "https://arxiv.org/pdf/2502.19061v2.pdf",
    "title": "Conceptual study on using Doppler backscattering to measure magnetic pitch angle in tokamak plasmas",
    "abstract": "We introduce a new approach to measure the magnetic pitch angle profile in tokamak plasmas with Doppler backscattering (DBS), a technique traditionally used for measuring flows and density fluctuations. The DBS signal is maximised when its probe beam's wavevector is perpendicular to the magnetic field at the cutoff location, independent of the density fluctuations. Hence, if one could isolate this effect, DBS would then yield information about the magnetic pitch angle. By varying the toroidal launch angle, the DBS beam reaches cutoff with different angles with respect to the magnetic field, but with other properties remaining similar. Hence, the toroidal launch angle which gives maximum backscattered power is thus that which is matched to the pitch angle at the cutoff location, enabling inference of the magnetic pitch angle. We performed systematic scans of the DBS toroidal launch angle for repeated DIII-D tokamak discharges. Experimental DBS data from this scan were analysed and combined with Gaussian beam-tracing simulations using the Scotty code. The pitch-angle inferred from DBS is consistent with that from magnetics-only and motional-Stark-effect-constrained (MSE) equilibrium reconstruction in the edge. In the core, the pitch angles from DBS and magnetics-only reconstructions differ by one to two degrees, while simultaneous MSE measurements were not available. The uncertainty in these measurements was under a degree; we show that this uncertainty is primarily due to the error in toroidal steering, the number of toroidally separated measurements, and shot-to-shot repeatability. We find that the error of pitch-angle measurements can be reduced by optimising the poloidal launch angle and initial beam properties.",
    "authors": [
      "AK Yeoh",
      "VH Hall-Chen",
      "QT Pratt",
      "BS Victor",
      "J Damba",
      "TL Rhodes",
      "NA Crocker",
      "KR Fong",
      "JC Hillesheim",
      "FI Parra",
      "J Ruiz Ruiz"
    ],
    "published": "2025-02-26T11:38:54Z",
    "updated": "2025-12-18T08:11:00Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.16196v1",
    "url": "https://arxiv.org/abs/2512.16196v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16196v1.pdf",
    "title": "Toward the Origins of Binding Energy Shifts and Satellites Formation During Plasma-XPS Measurements",
    "abstract": "In plasma X ray photoelectron spectroscopy emerges as a powerful platform for real time, in situ chemical analysis under conditions relevant to semiconductor processing and other plasma enabled technologies. This study investigates the origins of binding energy shifts and satellite peaks formation observed during plasma XPS measurements across conductive, dielectric, and gas phase systems. Using a standard laboratory based ambient pressure XPS apparatus coupled with an alternating current driven capacitively coupled plasma source, we show that metastable surface species, such as transient Au oxides, can be detected during plasma exposure, revealing chemical states hardly accessible using conventional ultrahigh vacuum XPS. In dielectric samples, we observe pressure- and plasma type dependent BE shifts up to 50 eV, attributed to X ray induced and plasma mediated surface charging. These shifts are mitigated at higher pressures plasmas or in electronegative plasmas, the latter due to enhanced charge compensation mechanisms involving slow negative ions. For gas phase species, AC plasma excitation leads to spectral broadening and the emergence of satellite peaks with a few eV energy separations, linked to oscillating local plasma potentials in the probing volume. These findings highlight the important and complex interplay of plasma parameters, surface charging, and local electric fields in shaping XPS spectra. Overall, plasma XPS emerges as a critical metrological tool for probing transient surface chemistry, with implications for semiconductor processing, material synthesis, and plasma diagnostics.",
    "authors": [
      "J. Trey Diulus",
      "Ashley R. Head",
      "Jorge Anibal Boscoboinik",
      "Carles Corbella Roca",
      "Alexander Tselev",
      "Andrei Kolmakov"
    ],
    "published": "2025-12-18T05:37:38Z",
    "updated": "2025-12-18T05:37:38Z",
    "categories": [
      "physics.plasm-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.08421v4",
    "url": "https://arxiv.org/abs/2506.08421v4",
    "pdf_url": "https://arxiv.org/pdf/2506.08421v4.pdf",
    "title": "High-precision Beam Optics Calculation of the HIAF-BRing Using Measured Fields",
    "abstract": "The construction of the High Intensity heavy ion Accelerator Facility (HIAF) has been completed, with current efforts focused on subsystem commissioning. Beam commissioning is scheduled for autumn 2025, marking a critical milestone in the HIAF project. This paper presents high-precision optics calculations for the Booster Ring (BRing) of HIAF, a key component for achieving stable heavy-ion beam acceleration. Leveraging high-precision magnetic field data, each magnet is divided into hundreds of slices, thus establishing a high-precision sliced optics model for BRing. Detailed calculations of BRing's optics are presented in this work. Critical parameters including tunes and betatron functions of the lattice based on the measured magnetic fields and those of the ideal lattice have been compared. The results highlight the impact of realistic magnetic field on beam dynamics and provide essential insights for accelerator tuning and optimization. These findings serve as a fundamental reference for beam commissioning and long-term operation, ensuring beam stability and performance reproducibility in HIAF.",
    "authors": [
      "Ke Wang",
      "Li-Na Sheng",
      "Geng Wang",
      "Wei-Ping Chai",
      "You-Jin Yuan",
      "Jian-Cheng Yang",
      "Guo-Dong Shen",
      "Liang Lu"
    ],
    "published": "2025-06-10T03:47:11Z",
    "updated": "2025-12-18T04:36:49Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.1088/1748-0221/20/08/P08023"
  },
  {
    "arxiv_id": "2512.16028v1",
    "url": "https://arxiv.org/abs/2512.16028v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16028v1.pdf",
    "title": "Direct calculation of steady-state hydrodynamic solar wind solutions with newtonian viscosity",
    "abstract": "Steady-state solutions to the Navier-Stokes equations are known to admit solutions that are singular at the sonic point. Consequently, inviscid solar wind models require special treatment of the solution near the sonic points, and this has proven to be a significant impediment to efficient modeling of the solar wind. In this paper we revisit the governing hydrodynamic equations for the expanding solar wind, with the inclusion of the classical (Newtonian) viscous stress , and we show how this inclusion eliminates the singularities that emerge from the inviscid equations. This result has been previously reported and used to generate solar wind profiles from initial conditions in the asymptotic limit; however, those studies did not include realistic treatments of the inner corona, and generally rejected the prospect of extrapolating solutions outward from the Sun into the heliosphere. Here, we expand this method to include external heating and optically thin radiative losses and show that solutions can be computed from initial conditions near the solar surface, thereby capturing the entire range of scales from below the transition region to the outer heliosphere in a single solution. Our approach is to cast the steady-state Navier-Stokes equations as a system of five coupled, ordinary differential equations (ODEs), which we solve using conventional methods, without any special treatment of the governing equations in the vicinity of the sonic point. The representative solutions that we present here demonstrate the utility and efficiency of this extrapolation method, which is considerably more realistic than commonly used analytical or empirical models. This method provides a direct approach to generating accurate solar wind profiles subject to observationally motivated initial conditions near the solar surface, at a fraction of the computational cost of comparable relaxation-based models.",
    "authors": [
      "Roger B. Scott",
      "Stephen J. Bradshaw",
      "Mark G. Linton",
      "Chris Lowder",
      "Leonard Strachan"
    ],
    "published": "2025-12-17T23:21:33Z",
    "updated": "2025-12-17T23:21:33Z",
    "categories": [
      "astro-ph.SR",
      "physics.flu-dyn",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR",
    "doi": "10.1051/0004-6361/202555327"
  },
  {
    "arxiv_id": "2510.09579v2",
    "url": "https://arxiv.org/abs/2510.09579v2",
    "pdf_url": "https://arxiv.org/pdf/2510.09579v2.pdf",
    "title": "The impact of plasma turbulence on atomic reaction rates in detached divertors",
    "abstract": "Numerical modeling of the edge and scrape-off layer (SOL) must account for atomic processes such as hydrogenic ionization and recombination, charge-exchange, and line radiation. Their reaction rates depend non-linearly on density and temperature and are thus sensitive to turbulent fluctuations, whose inclusion/omission may significantly affect model outcomes. We quantify the impact of fluctuations by studying global turbulence simulations of the edge and SOL of ASDEX-Upgrade in both attached and detached conditions. While the effect of fluctuations is minimal for the attached state, pronounced discrepancies emerge in colder, detached conditions. When accounting for turbulent fluctuations, ionization and radiation rates at the detachment front are reduced by a factor of 2 when compared to mean-field calculations. The effect arises from fluctuations crossing below the ionization temperature threshold, facilitated by low mean temperature and increased fluctuation amplitudes at the detachment front. The rate reduction (rather than rate increase) is explained by the character of divertor fluctuations (negative density-temperature correlation, i.e. cold and dense blobs), notably distinct from characteristic fluctuations found at the outboard-midplane (positive correlation, i.e. hot and dense blobs). Furthermore, the cold and dense fluctuations enable efficient plasma recombination even at average temperatures above the recombination threshold. In detached conditions, the combined plasma particle source from ionization and recombination is therefore effectively reduced by at least 50% when compared to the standard mean-field source.",
    "authors": [
      "Konrad Eder",
      "Wladimir Zholobenko",
      "Andreas Stegmeir",
      "Kaiyu Zhang",
      "Frank Jenko"
    ],
    "published": "2025-10-10T17:34:48Z",
    "updated": "2025-12-17T22:37:28Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  }
]