{
  "arxiv_id": "2512.19268v1",
  "url": "https://arxiv.org/abs/2512.19268v1",
  "pdf_url": "https://arxiv.org/pdf/2512.19268v1.pdf",
  "title": "Precise control of high-frequency ultrasounds in thin crystals for the development of tunable narrowband and directional gamma-ray sources",
  "abstract": "This work presents a complete methodology for the precise characterization of the acoustic field inside crystal-based devices driven by high-frequency ultrasounds towards the generation of tunable narrowband and directional gamma radiation via undulation of ultra-relativistic charged particles. Such gamma-ray sources have long been anticipated by the scientific community, as they promise new powerful tools for the study of high-energy physical phenomena and the development of novel nuclear technologies. In such devices, a piezoelectric transducer induces tens of MHz harmonic waves inside a silicon monocrystal. Ultra-relativistic charged particles traversing the crystal get trapped within the channels formed by the extremely strong electric fields of the acoustically modulated lattice planes, undergoing undulation and emitting gamma radiation. Precise characterization of the acoustic field in the crystal is crucial for the determination of the expected characteristics of the secondarily generated gamma rays. For this purpose, fast laser refraction imaging is used here to image the acoustic waves by exploiting the spatial redistribution of a laser beam optical intensity caused by the acoustic field. A dedicated computational model is developed for the estimation of the spatial distribution of the pressure and lattice deformation inside the crystal. This methodology provides a framework for future novel gamma-ray sources in high-energy facilities.",
  "authors": [
    "Emmanouil Kaniolakis-Kaloudis",
    "Nektarios Papadogiannis",
    "Yannis Orphanos",
    "Makis Bakarezos",
    "Konstantinos Kaleris"
  ],
  "published": "2025-12-22T11:04:22Z",
  "updated": "2025-12-22T11:04:22Z",
  "categories": [
    "physics.acc-ph",
    "physics.app-ph",
    "physics.optics"
  ],
  "primary_category": "physics.acc-ph",
  "doi": "10.1121/10.0039880"
}