{
  "arxiv_id": "2506.02832v2",
  "url": "https://arxiv.org/abs/2506.02832v2",
  "pdf_url": "https://arxiv.org/pdf/2506.02832v2.pdf",
  "title": "Testing strong-field QED with the avalanche precursor",
  "abstract": "A two-beam high-power laser facility is essential for the study of one of the most captivating phenomena predicted by strong-field quantum electrodynamics (QED) and yet unobserved experimentally: the avalanche-type cascade. In such a cascade, the energy of intense laser light can be efficiently transformed into high-energy radiation and electron-positron pairs. The future 50-petawatt-scale laser facility NSF OPAL will provide unique opportunities for studying such strong-field QED effects, as it is designed to deliver two ultra-intense, tightly focused laser pulses onto the interaction point. In this work, we investigate the potential of such a facility for studying elementary particle and plasma dynamics deeply in the quantum radiation-dominated regime, and the generation of QED avalanches. With 3D particle-in-cell simulations, we demonstrate that QED avalanche precursors can be reliably triggered under realistic laser parameters and layout (namely, focusing $f/2$, tilted optical axes, and non-ideal co-pointing) with the anticipated capabilities of NSF OPAL. We demonstrate that seed electrons can be efficiently injected into the laser focus by using targets of three types: a gas of heavy atoms, an overcritical plasma, and a thin foil. A strong positron and high-energy photon signal is generated in all cases. The cascade properties can be identified from the final particle distributions, which have a clear directional pattern. At increasing laser field intensity, such distributions provide signatures of the transition, first, to the radiation-dominated interaction regime, and then to a QED avalanche. Our findings can also be used for designing related future experiments.",
  "authors": [
    "A. A. Mironov",
    "S. S. Bulanov",
    "A. Di Piazza",
    "M. Grech",
    "L. Lancia",
    "S. Meuren",
    "J. Palastro",
    "C. Riconda",
    "H. G. Rinderknecht",
    "P. Tzeferacos",
    "G. Gregori"
  ],
  "published": "2025-06-03T13:00:14Z",
  "updated": "2025-09-17T13:01:09Z",
  "categories": [
    "physics.plasm-ph",
    "hep-ph"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": "10.1063/5.0283438"
}