{
  "arxiv_id": "2509.15669v1",
  "url": "https://arxiv.org/abs/2509.15669v1",
  "pdf_url": "https://arxiv.org/pdf/2509.15669v1.pdf",
  "title": "A novel method of half-life determination for highly charged ions based   on isochronous mass spectrometry",
  "abstract": "The lifetime of the isomeric state in fully stripped 94Ru44+ ions has been measured using isochronous mass spectrometry (IMS) at the experimental Cooler Storage Ring (CSRe) of the Heavy Ion Research Facility in Lanzhou (HIRFL). Previously, the isomeric lifetime was determined by analyzing the decay time points of individual decay events. In this paper, we present a novel approach to determine the isomeric lifetime based on the survival time of ions obtained from IMS. The survival lifetimes of the ground and isomeric states of 94Ru44+ were measured to be s and s in the laboratory, respectively. Given that the ground state of 94Ru44+ has a natural lifetime of approximately 75 min, its survival lifetime in the experimental setup was predominantly determined by the beam-loss lifetime, including interactions with residual gas in the storage ring and carbon foil of the detector. In contrast, the survival lifetime of 94mRu44+ was governed by its intrinsic nuclear lifetime and additional beam-loss effects. The nuclear decay lifetime of 94mRu44+ was extracted through differential survival lifetime analysis between ground and isomeric states, under the assumption that the beam-loss lifetimes for both quantum systems are identical. Using this novel methodology, the lifetime measured in the laboratory frame was s. After relativistic time-dilation corrections, the corresponding rest-frame half-life was calculated to be s. This result demonstrates excellent consistency with previous experimental results, validating the reliability of the new method. This method is suitable for determining half-lives of highly charged ions in the range of several tens of microseconds to milliseconds using IMS.",
  "authors": [
    "Qi Zeng",
    "Bushi Huang",
    "Tingwei Peng",
    "Hongfu Li",
    "Xing XuYuanming Xing",
    "Huaiqiang Zhang",
    "Jiankun Zhao",
    "Xu Zhou"
  ],
  "published": "2025-09-19T06:43:55Z",
  "updated": "2025-09-19T06:43:55Z",
  "categories": [
    "physics.ins-det",
    "nucl-ex",
    "physics.acc-ph"
  ],
  "primary_category": "physics.ins-det",
  "doi": "10.1088/1674-1137/ade959"
}