{
  "arxiv_id": "2509.16159v1",
  "url": "https://arxiv.org/abs/2509.16159v1",
  "pdf_url": "https://arxiv.org/pdf/2509.16159v1.pdf",
  "title": "A novel agile THz Pulsed Spectropolarimeter measuring 2D distributions   of the magnetic field, density and ion temperature of fusion reactor   equilibria",
  "abstract": "With the recent inception of intense pulsed THz sources via optical rectification using crystalline lithium niobate, non-perturbative measurements of the internal local magnetic field are now possible using Pulsed Polarimetry on any magnetic fusion device. Pulsed Polarimetry resolves the sightline magnetic field and density, analogous to RADAR measurements of the spatial distribution of precipitation. With a suitable sightline, the FRC midplane density and axial field profiles can be determined with the azimuthal current density given by Ampere's law. Pulsed Polarimetry can be enhanced to measure the sightline distributed electron temperature by adding spectroscopy. A THz Pulsed Spectropolarimeter using a heterodyne receiver is appropriate if collective Thomson backscatter is induced. In this case, electronic filtering provides spatial distributions of the ion spectral density function. The sightline bulk ion temperature as well as confined fast ion velocity distributions can be measured which is of particular importance to plasmas that are heated and sustained by NBI. The ability to steer the sightline without loss of alignment distinguishes this diagnostic from crossbeam diagnostics. The term, diagnostic agility denotes a diagnostic's ability to provide both temporal and spatial real-time feedback on demand across the poloidal plane analogous to 2D imaging Doppler RADAR. THz Pulsed Spectropolarimetry is extensively detailed along with simulated measurements on an FRC equilibrium. Comparisons are made with long pulse CTS crossbeam diagnostics. The role this technique can play within the wider MFE program towards future fusion reactors as an advanced diagnostic is explored. The nature and breadth of the measurements fulfills the mission of future diagnostics to maintain and optimize fusion reactor performance.",
  "authors": [
    "Roger J Smith"
  ],
  "published": "2025-09-19T17:10:22Z",
  "updated": "2025-09-19T17:10:22Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}