[
  {
    "arxiv_id": "2509.15383v2",
    "url": "https://arxiv.org/abs/2509.15383v2",
    "pdf_url": "https://arxiv.org/pdf/2509.15383v2.pdf",
    "title": "Integration and commissioning plan of Full Flow Purifier at Muon Campus",
    "abstract": "The Full Flow Purifier for Fermilab's Muon Campus uses a charcoal bed surrounded by a liquid nitrogen jacket to purify up to 240 g/s of helium gas. Fabrication by Ability Engineering Technology Inc. has been completed and the purifier delivered to Fermilab. It is the largest purifier to be used at Fermilab based on both capacity and size. A previous paper discussed the design of purifier for various operational conditions and horizontal shipping. The purifier is designed to withstand 5g force in vertical and 2g force in lateral and longitudinal directions. Transportation experience from vendor to Fermilab and within site is discussed. Integration of the purifier involved design and fabrication of a liquid nitrogen transfer line, regeneration system, and helium piping to connect it to Muon Campus cryogenic system. It also involved establishing electrical, instrumentation and controls connections to the system. Integration of the purifier is discussed in detail. The purifier is to be commissioned using up to 4 MYCOM helium compressors to supply helium and liquid nitrogen supplied by a 60,000-liter tank. Actual effectiveness of the 3-stream heat exchanger is to be estimated based on measured temperatures and flow rate. Impurity levels will be monitored at inlet and outlet of the purifier. Theoretical adsorption capacity of the purifier is calculated based on the measured temperatures and flowrates and is compared to actual adsorption capacity over time.",
    "authors": [
      "J. Subedi",
      "T. Tope",
      "B. Hansen",
      "M. White",
      "J. Tillman",
      "V. Patel",
      "W. Cyko",
      "J. Dong"
    ],
    "published": "2025-09-18T19:40:34Z",
    "updated": "2025-09-22T14:11:05Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.16159v1",
    "url": "https://arxiv.org/abs/2509.16159v1",
    "pdf_url": "https://arxiv.org/pdf/2509.16159v1.pdf",
    "title": "A novel agile THz Pulsed Spectropolarimeter measuring 2D distributions   of the magnetic field, density and ion temperature of fusion reactor   equilibria",
    "abstract": "With the recent inception of intense pulsed THz sources via optical rectification using crystalline lithium niobate, non-perturbative measurements of the internal local magnetic field are now possible using Pulsed Polarimetry on any magnetic fusion device. Pulsed Polarimetry resolves the sightline magnetic field and density, analogous to RADAR measurements of the spatial distribution of precipitation. With a suitable sightline, the FRC midplane density and axial field profiles can be determined with the azimuthal current density given by Ampere's law. Pulsed Polarimetry can be enhanced to measure the sightline distributed electron temperature by adding spectroscopy. A THz Pulsed Spectropolarimeter using a heterodyne receiver is appropriate if collective Thomson backscatter is induced. In this case, electronic filtering provides spatial distributions of the ion spectral density function. The sightline bulk ion temperature as well as confined fast ion velocity distributions can be measured which is of particular importance to plasmas that are heated and sustained by NBI. The ability to steer the sightline without loss of alignment distinguishes this diagnostic from crossbeam diagnostics. The term, diagnostic agility denotes a diagnostic's ability to provide both temporal and spatial real-time feedback on demand across the poloidal plane analogous to 2D imaging Doppler RADAR. THz Pulsed Spectropolarimetry is extensively detailed along with simulated measurements on an FRC equilibrium. Comparisons are made with long pulse CTS crossbeam diagnostics. The role this technique can play within the wider MFE program towards future fusion reactors as an advanced diagnostic is explored. The nature and breadth of the measurements fulfills the mission of future diagnostics to maintain and optimize fusion reactor performance.",
    "authors": [
      "Roger J Smith"
    ],
    "published": "2025-09-19T17:10:22Z",
    "updated": "2025-09-19T17:10:22Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.16130v1",
    "url": "https://arxiv.org/abs/2509.16130v1",
    "pdf_url": "https://arxiv.org/pdf/2509.16130v1.pdf",
    "title": "On the enhanced Balmer emission of hydrogen in helium Capacitively   Coupled Radio Frequency (CCRF) plasma",
    "abstract": "The present study investigates the observation and enhancement in the intensity of the hydrogen Balmer series emission in a He CCRF plasma using optical emission spectroscopy (OES). In addition to the characteristic line emission of He atoms, the Balmer series of hydrogen and the molecular emission of N2 are also observed in the He discharge. These emissions were primarily attributed to the presence of water vapor in the chamber. In order to confirm the role of He, the study is also performed using air and Ar where no such Balmer series emissions is seen. Experimental evidence suggests that He metastables transfer energy to trace amount of water content present in the vacuum chamber. The results point towards the hypothesis that energy exchange between metastable He and water molecules could be the underlying mechanism. Since the energy of He metastables exceeds the ionization energy of H or H2O molecule, Penning ionization is expected to occur upon their interaction. The H ions formed as a result, consequently recombine with electrons in the plasma, emitting the Balmer series. Furthermore, the emission intensity of the Balmer series of H depends on the electron density of the He plasma. Experiments also show significant deviations in the intensity ratios of the Balmer series from conventional discharges, indicating difference in the underlying population mechanism. A Collisional Radiative (CR) model for measured plasma parameters was used to estimate the metastable population density to understand the mechanism behind the enhancement of the emission intensity. The increase in the metastable densities as well as the radiative recombination cross section appear to be responsible for the observed enhancement. We believe these results will be significant in terms of applications, in addition to providing a fundamental understanding of energy transfer between metastables of He and H2O.",
    "authors": [
      "Varsha S",
      "Prabhakar Srivastav",
      "Yukti Goel",
      "Milaan Patel",
      "Hem Chandra Joshi",
      "Jinto Thomas"
    ],
    "published": "2025-09-19T16:27:16Z",
    "updated": "2025-09-19T16:27:16Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.09722v2",
    "url": "https://arxiv.org/abs/2507.09722v2",
    "pdf_url": "https://arxiv.org/pdf/2507.09722v2.pdf",
    "title": "Compression and Reconnection Investigations of the MagnetoPause (CRIMP):   A Mission Concept to Uncover the Impact of Mesoscale Reconnection and Plasma   Outflow Processes at the Dayside Magnetopause",
    "abstract": "The Compression and Reconnection Investigations of the Magnetopause (CRIMP) mission is a Heliophysics Medium-Class Explorer (MIDEX) Announcement of Opportunity (AO) mission concept designed to study mesoscale structures and particle outflow along Earth's magnetopause using two identical spacecraft. CRIMP would uncover the impact of magnetosheath mesoscale drivers, dayside magnetopause mesoscale phenomenological processes and structures, and localized plasma outflows on magnetic reconnection and the energy transfer process in the dayside magnetosphere. CRIMP accomplishes this through uniquely phased spacecraft configurations that allow multipoint, contemporaneous measurements at the magnetopause. This enables an unparalleled look at mesoscale spatial differences along the dayside magnetopause on the scale of 1-3 Earth Radii (Re). Through these measurements, CRMIP will uncover how local mass density enhancements affect global reconnection, how mesoscale structures drive magnetopause dynamics, and if the magnetopause acts as a perfectly absorbing boundary for radiation belt electrons. This allows CRIMP to determine the spatial scale, extent, and temporal evolution of energy and mass transfer processes at the magnetopause - crucial measurements to determine how the solar wind energy input in the magnetosphere is transmitted between regions and across scales. This concept was conceived as a part of the 2024 NASA Heliophysics Mission Design School.",
    "authors": [
      "Jason M. H. Beedle",
      "Bryan C. Cline",
      "Samuel T. Badman",
      "Humberto Caldelas II",
      "Kelly Cantwell",
      "Alex Hoffmann",
      "Christian Hofmann",
      "India Jackson",
      "Tre'Shunda James",
      "Miguel Martinez-Ledesma",
      "Bruno Mattos",
      "Brett A. McCuen",
      "Sophie R. Phillips",
      "Bryan Reynolds",
      "Julie Rolla",
      "Orlando M. Romeo",
      "Frances A. Staples",
      "Michael J. Starkey",
      "Olga P. Verkhoglyadova",
      "Andres Romero-Wolf",
      "Alfred E. Nash"
    ],
    "published": "2025-07-13T17:40:42Z",
    "updated": "2025-09-19T15:11:46Z",
    "categories": [
      "physics.space-ph",
      "astro-ph.EP",
      "astro-ph.IM",
      "astro-ph.SR",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.space-ph"
  },
  {
    "arxiv_id": "2505.22097v3",
    "url": "https://arxiv.org/abs/2505.22097v3",
    "pdf_url": "https://arxiv.org/pdf/2505.22097v3.pdf",
    "title": "From the Rose-DuBois Ansatz of Hot Spot Fields to the Instanton   Solution: a Pedestrian Presentation",
    "abstract": "This paper gives a pedestrian presentation of some technical results recently published in mathematical physics with non-trivial implications for laser-plasma interaction. The aim is to get across the main results without going into the details of the calculations, nor offering a specialist's user guide, but by focusing conceptually on how these results modify the commonly-held description -- in terms of laser hot spot fields -- of backscattering instabilities with a spatially smoothed laser beam. The intended readers are plasma physicists as well as graduate students interested in laser-plasma interaction. No prior knowledge of scattering instabilities is required. Step by step, we explain how the laser hot spots are gradually replaced with other structures, called instantons, as the amplification of the scattered light increases. In the amplification range of interest for laser-plasma interaction, instanton--hot spot complexes tend to appear in the laser field (in addition to the expected hot spots), with a non-negligible probability. For even larger amplifications and systems longer than a hot spot length, the hot spot field description is clearly invalidated by the instanton takeover.",
    "authors": [
      "Philippe Mounaix"
    ],
    "published": "2025-05-28T08:18:42Z",
    "updated": "2025-09-19T13:13:35Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.15853v1",
    "url": "https://arxiv.org/abs/2509.15853v1",
    "pdf_url": "https://arxiv.org/pdf/2509.15853v1.pdf",
    "title": "Electron-positron pair generation using a single kJ-class laser pulse in   a foam-reflector setup",
    "abstract": "We investigate the process of creating electron-positron pairs from laser-matter interaction in pre-ionised foam targets using particle-in-cell simulations. A high-intensity laser pulse drives electrons via direct laser acceleration up to a cone-shaped reflector. The high-energy electrons interact with the reflected laser pulse, generating abundant pairs. The effects of the plasma-channel shape on the propagation of the laser pulse and subsequent pair production is studied. The results show that the number of Compton emission and Breit-Wheeler pair creation events is highly sensitive to the diffraction of the laser due to its interaction with the foam.",
    "authors": [
      "Oliver Mathiak",
      "Lars Reichwein",
      "Alexander Pukhov"
    ],
    "published": "2025-09-19T10:44:00Z",
    "updated": "2025-09-19T10:44:00Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.15821v1",
    "url": "https://arxiv.org/abs/2509.15821v1",
    "pdf_url": "https://arxiv.org/pdf/2509.15821v1.pdf",
    "title": "Modeling of runaway electron induced damage on boron-nitride tiles in   WEST",
    "abstract": "The runaway electron (RE) - induced damage on boron nitride (BN) tiles mounted on the inner bumpers of the WEST tokamak is modeled employing available empirical input and experimental constraints, concerning the post-mortem documentation of the damaged material topology and infra-red camera observations of the long-time decay of the surface temperature. A newly developed work-flow for the modeling of brittle failure due to RE impacts, recently validated against a controlled DIII-D experiment, is employed. Monte Carlo simulations of RE transport into BN provide volumetric heat source maps for finite-element simulations of the linear thermoelastic material response, while the brittle failure onset is predicted on the basis of the Rankine criterion. The physics of thermal stress driven failure and explosion are well captured by this model, which exhibits high sensitivity to RE impact parameters. Despite the accidental nature of the damage events, the workflow predicts failure in accordance with observations for realistic loading specifications expected in WEST disruptions.",
    "authors": [
      "Tommaso Rizzi",
      "Svetlana Ratynskaia",
      "Panagiotis Tolias",
      "Yann Corre",
      "Mathilde Diez",
      "Mehdi Firdaouss",
      "Jonathan Gerardin",
      "Raphael Mitteau",
      "Cedric Reux",
      "Artem Kulachenko",
      "the WEST team",
      "the EUROfusion Tokamak Exploitation Team"
    ],
    "published": "2025-09-19T09:53:10Z",
    "updated": "2025-09-19T09:53:10Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.15818v1",
    "url": "https://arxiv.org/abs/2509.15818v1",
    "pdf_url": "https://arxiv.org/pdf/2509.15818v1.pdf",
    "title": "Scalable CVD Graphene Field-Effect Transistor Platform for Viral   Detection: Application to COVID-19",
    "abstract": "The rapid and global spread of coronavirus disease 2019 (COVID-19), caused by the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), underscored the urgent need for fast, reliable, and adaptable diagnostic tools capable of responding to current and future viral threats. Early diagnosis is key to limiting transmission, and biosensors based on nanomaterials offer promising solutions for accurate and rapid bioanalyte detection. In this work, we present a scalable matrix of graphene-based field-effect transistors (GFETs) for the direct and rapid detection of the SARS-CoV-2 spike protein. High-quality graphene is functionalized in a single step with ACE2-His, enabling detection of the spike protein with a limit of detection as low as 1 fg/mL in phosphate-buffered saline (PBS). A robust statistical analysis, based on measurements from approximately 70 devices per analyte concentration, demonstrates the reproducibility and reliability of the platform. This label-free, scalable, and reproducible COVID-19 antigen sensor can be readily adapted to detect emerging SARS-CoV-2 variants or other viral pathogens, offering a flexible approach for future diagnostic applications.",
    "authors": [
      "Leonardo Martini",
      "Ylea Vlamidis",
      "Ileana Armando",
      "Domenica Convertino",
      "Vaidotas Mišeikis",
      "Valerio Voliani",
      "Camilla Coletti"
    ],
    "published": "2025-09-19T09:45:41Z",
    "updated": "2025-09-19T09:45:41Z",
    "categories": [
      "physics.bio-ph",
      "physics.chem-ph",
      "physics.ins-det",
      "physics.med-ph"
    ],
    "primary_category": "physics.bio-ph"
  },
  {
    "arxiv_id": "2507.14628v2",
    "url": "https://arxiv.org/abs/2507.14628v2",
    "pdf_url": "https://arxiv.org/pdf/2507.14628v2.pdf",
    "title": "Electromagnetic Flow Control in Hypersonic Rarefied Environment",
    "abstract": "The Unified Gas-Kinetic Wave-Particle (UGKWP) method, developed for multiscale simulation of partially ionized plasmas, has been extended to unstructured meshes, enabling the modeling of electromagnetic flows around a hemisphere across near-continuum to rarefied regimes. To the best of our knowledge, this work represents the first application of a multiscale plasma solver to this problem. In our approach, neutrals, ions, and electrons are treated as distinct species, with electrons modeled beyond the conventional fluid approximation. The numerical implementation is validated through comparison with reference solutions for neutral hypersonic flow around a sphere, as well as benchmarking against experimental data for a Mach 4.75 pre-ionized argon flow. In both cases, the UGKWP results show good agreement with the reference and experimental data. The findings reveal that rarefied effects play a significant role in the prediction of electromagnetic flow control, underscoring the necessity of multiscale modeling in plasma flow applications.",
    "authors": [
      "Zhigang Pu",
      "Kun Xu"
    ],
    "published": "2025-07-19T13:50:47Z",
    "updated": "2025-09-19T09:37:09Z",
    "categories": [
      "physics.plasm-ph",
      "physics.flu-dyn"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.07846v2",
    "url": "https://arxiv.org/abs/2508.07846v2",
    "pdf_url": "https://arxiv.org/pdf/2508.07846v2.pdf",
    "title": "Introducing a Markov Chain-Based Time Calibration Procedure for   Multi-Channel Particle Detectors: Application to the SuperFGD and ToF   Detectors of the T2K Experiment",
    "abstract": "Inter-channel mis-synchronisation can be a limiting factor to the time resolution of high performance timing detectors with multiple readout channels and independent electronics units. In these systems, time calibration methods employed must be able to efficiently correct for minimal mis-synchronisation between channels and achieve the best detector performance. We present an iterative time calibration method based on Markov Chains, suitable for detector systems with multiple readout channels. Starting from correlated hit pairs alone, and without requiring an external reference time measurement, the method solves for fixed per-channel offsets, with precision limited only by the intrinsic single-channel resolution. A mathematical proof that the method is able to find the correct time offsets to be assigned to each detector channel in order to achieve inter-channel synchronisation is given, and it is shown that the number of iterations to reach convergence within the desired precision is controllable with a single parameter. Numerical studies are used to confirm unbiased recovery of true offsets. Finally, the application of the calibration method to the Super Fine-Grained Detector (SuperFGD) and the Time of Flight (TOF) detector at the upgraded T2K near detector (ND280) shows good improvement in overall timing resolution, demonstrating the effectiveness in a real-world scenario and scalability.",
    "authors": [
      "S. Abe",
      "H. Alarakia-Charles",
      "I. Alekseev",
      "C. Alt",
      "T. Arai",
      "T. Arihara",
      "S. Arimoto",
      "A. M. Artikov",
      "Y. Awataguchi",
      "N. Babu",
      "V. Baranov",
      "G. Barr",
      "D. Barrow",
      "L. Bartoszek",
      "L. Bernardi",
      "L. Berns",
      "S. Bhattacharjee",
      "A. V. Boikov",
      "A. Blanchet",
      "A. Blondel",
      "A. Bonnemaison",
      "S. Bordoni",
      "M. H. Bui",
      "T. H. Bui",
      "F. Cadoux",
      "S. Cap",
      "A. Cauchois",
      "J. Chakrani",
      "P. S. Chong",
      "A. Chvirova",
      "P. Collard",
      "M. Danilov",
      "C. Davis",
      "V. Davouloury",
      "Yu. I. Davydov",
      "A. Dergacheva",
      "C. Domangue",
      "D. Douqa",
      "T. A. Doyle",
      "O. Drapier",
      "A. Eguchi",
      "J. Elias",
      "G. Erofeev",
      "Y. Favre",
      "D. Fedorova",
      "S. Fedotov",
      "D. Ferlewicz",
      "Y. Fujii",
      "R. Fujita",
      "Y. Furui",
      "F. Gastaldi",
      "A. Gendotti",
      "A. Germer",
      "L. Giannessi",
      "C. Giganti",
      "V. Glagolev",
      "R. Guillaumat",
      "G. Ha",
      "N. C. Hastings",
      "I. Heitkamp",
      "J. Hu",
      "C. Husi",
      "A. K. Ichikawa",
      "T. H. Ishida",
      "A. Izmaylov",
      "K. Iwamoto",
      "M. Jakkapu",
      "C. Jesús-Valls",
      "J. Y. Ji",
      "P. Jonsson",
      "C. K. Jung",
      "H. Kakuno",
      "V. S. Kasturi",
      "M. Kawaue",
      "P. T. Keener",
      "M. Khabibullin",
      "N. V. Khomutov",
      "A. Khotjantsev",
      "T. Kikawa",
      "H. Kikutani",
      "N. V. Kirichkov",
      "A. Klustová",
      "H. Kobayashi",
      "T. Kobayashi",
      "L. Koch",
      "S. Kodama",
      "A. O. Kolesnikov",
      "M. Kolupanova",
      "A. Korzenev",
      "T. Koto",
      "Y. Kudenko",
      "S. Kuribayashi",
      "T. Kutter",
      "M. Lachat",
      "K. Lachner",
      "M. Lamers James",
      "D. Last",
      "N. Latham",
      "M. Lawe",
      "T. A. Le",
      "D. Leon Silverio",
      "B. Li",
      "W. Li",
      "C. Lin",
      "M. Louzir",
      "T. Lux",
      "K. K. Mahtani",
      "S. Manly",
      "D. A. Martinez Caicedo",
      "N. Mashin",
      "T. Matsubara",
      "C. Mauger",
      "K. S. McFarland",
      "C. McGrew",
      "J. McKean",
      "A. Mefodiev",
      "E. Miller",
      "O. Mineev",
      "A. Minamino",
      "A. L. Moreno",
      "A. Muñoz",
      "T. Nakadaira",
      "K. Nakagiri",
      "T. Nakaya",
      "J. Nanni",
      "L. Nicolas",
      "A. D. Nguyen",
      "D. T. Nguyen",
      "H. Nguyen",
      "V. Nguyen",
      "E. Noah Messomo",
      "T. Nosek",
      "H. M. O'Keeffe",
      "T. Ogawa",
      "W. Okinaga",
      "L. Osu",
      "V. Paolone",
      "G. Pelleriti",
      "L. Pickering",
      "M. A. Ramírez",
      "M. Reh",
      "G. Reina",
      "C. Riccio",
      "S. Roth",
      "A. Rubbia",
      "F. Saadi",
      "K. Sakashita",
      "N. Sallin",
      "S. Samani",
      "F. Sanchez",
      "T. Schefke",
      "C. Schloesser",
      "D. Sgalaberna",
      "A. Shaikovskiy",
      "A. Shvartsman",
      "Y. Shiraishi",
      "N. Shvarev",
      "N. Skrobova",
      "D. Smyczek",
      "M. Smy",
      "A. Speers",
      "D. Svirida",
      "M. Ta",
      "S. Tairafune",
      "M. Tani",
      "H. Tanigawa",
      "A. Teklu",
      "S. Tereshchenko",
      "V. V. Tereshchenko",
      "T. Thaiduc",
      "T. Tsushima",
      "M. Tzanov",
      "Y. Uchida",
      "I. I. Vasilyev",
      "E. Villa",
      "T. Vladisavljevic",
      "D. Wakabayashi",
      "H. Wallace",
      "A. Weber",
      "N. Whitney",
      "C. Wret",
      "Y. Xu",
      "Y. Yang",
      "N. Yershov",
      "A. J. P. Yrey",
      "M. Yokoyama",
      "Y. Yoshimoto",
      "X. Y. Zhao",
      "H. Zheng",
      "H. Zhong",
      "T. Zhu",
      "E. D. Zimmerman",
      "M. Zito"
    ],
    "published": "2025-08-11T11:06:37Z",
    "updated": "2025-09-19T08:14:42Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.15729v1",
    "url": "https://arxiv.org/abs/2509.15729v1",
    "pdf_url": "https://arxiv.org/pdf/2509.15729v1.pdf",
    "title": "The Role of Phase and Spatial Modes in Wave-Induced Plasma Transport",
    "abstract": "We derive a two-dimensional symplectic map for particle motion at the plasma edge by modeling the electrostatic potential as a superposition of integer spatial harmonics with relative phase shift, then reduce it to a two-wave model to study the transport dependence on the perturbation amplitudes, relative phase, and spatial-mode choice. Using particle transmissivity as a confinement criterion, identical-mode pairs exhibit phase-controlled behavior: anti-phase waves produce destructive interference and strong confinement while in-phase waves add constructively and drive chaotic transport. Mode-mismatched pairs produce richer phase-space structure with higher-order resonances and sticky regions; the transmissivity boundaries become geometrically complex. Box-counting dimensions quantify this: integer dimension smooth boundaries for identical modes versus non-integer fractal-like dimension for distinct modes, demonstrating that phase and spectral content of waves jointly determine whether interference suppresses or promotes transport.",
    "authors": [
      "L. F. B. Souza",
      "Y. Elskens",
      "R. Egydio de Carvalho",
      "I. L. Caldas"
    ],
    "published": "2025-09-19T08:00:57Z",
    "updated": "2025-09-19T08:00:57Z",
    "categories": [
      "physics.plasm-ph",
      "nlin.CD"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.15721v1",
    "url": "https://arxiv.org/abs/2509.15721v1",
    "pdf_url": "https://arxiv.org/pdf/2509.15721v1.pdf",
    "title": "Runaway electrons during a coil quench in stellarators",
    "abstract": "It is shown that avalanches of runaway electrons can arise in stellarators, even if there is no net toroidal current in the plasma or the magnetic-field coils, if the current in the latter varies rapidly enough, e.g. due to a superconductor quench. In present-day devices such as W7-X, significant runaway generation is theoretically possible only at very low gas or plasma density in the vacuum vessel, e.g. between discharges, if a seed population of free electrons is present. In reactor-scale stellarators, more dangerous runaway generation may occur both between discharges and during low-density plasma operation. Since a radiation-induced seed population is necessarily present in an activated device, an accidental coil ramp-down could convert substantial magnetic energy into wall-damaging runaway currents. There is however much more time to mitigate such events than in tokamaks disruptions.",
    "authors": [
      "Pavel Aleynikov",
      "Per Helander",
      "Håkan M Smith"
    ],
    "published": "2025-09-19T07:52:49Z",
    "updated": "2025-09-19T07:52:49Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.15669v1",
    "url": "https://arxiv.org/abs/2509.15669v1",
    "pdf_url": "https://arxiv.org/pdf/2509.15669v1.pdf",
    "title": "A novel method of half-life determination for highly charged ions based   on isochronous mass spectrometry",
    "abstract": "The lifetime of the isomeric state in fully stripped 94Ru44+ ions has been measured using isochronous mass spectrometry (IMS) at the experimental Cooler Storage Ring (CSRe) of the Heavy Ion Research Facility in Lanzhou (HIRFL). Previously, the isomeric lifetime was determined by analyzing the decay time points of individual decay events. In this paper, we present a novel approach to determine the isomeric lifetime based on the survival time of ions obtained from IMS. The survival lifetimes of the ground and isomeric states of 94Ru44+ were measured to be s and s in the laboratory, respectively. Given that the ground state of 94Ru44+ has a natural lifetime of approximately 75 min, its survival lifetime in the experimental setup was predominantly determined by the beam-loss lifetime, including interactions with residual gas in the storage ring and carbon foil of the detector. In contrast, the survival lifetime of 94mRu44+ was governed by its intrinsic nuclear lifetime and additional beam-loss effects. The nuclear decay lifetime of 94mRu44+ was extracted through differential survival lifetime analysis between ground and isomeric states, under the assumption that the beam-loss lifetimes for both quantum systems are identical. Using this novel methodology, the lifetime measured in the laboratory frame was s. After relativistic time-dilation corrections, the corresponding rest-frame half-life was calculated to be s. This result demonstrates excellent consistency with previous experimental results, validating the reliability of the new method. This method is suitable for determining half-lives of highly charged ions in the range of several tens of microseconds to milliseconds using IMS.",
    "authors": [
      "Qi Zeng",
      "Bushi Huang",
      "Tingwei Peng",
      "Hongfu Li",
      "Xing XuYuanming Xing",
      "Huaiqiang Zhang",
      "Jiankun Zhao",
      "Xu Zhou"
    ],
    "published": "2025-09-19T06:43:55Z",
    "updated": "2025-09-19T06:43:55Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex",
      "physics.acc-ph"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1674-1137/ade959"
  },
  {
    "arxiv_id": "2505.01002v3",
    "url": "https://arxiv.org/abs/2505.01002v3",
    "pdf_url": "https://arxiv.org/pdf/2505.01002v3.pdf",
    "title": "High Voltage Delivery and Distribution for the NEXT-100 Time Projection   Chamber",
    "abstract": "A critical element in the realization of large liquid and gas time projection chambers (TPCs) is the delivery and distribution of high voltages into and around the detector. Such experiments require of order tens of kilovolts to enable electron drift over meter-scale distances. This paper describes the design and operation of the cathode feedthrough and high voltage distribution through the field cage of the NEXT-100 experiment, an underground TPC that will search for neutrinoless double beta decay $0\\nu\\beta\\beta$. The feedthrough has been demonstrated to hold pressures up to 20~bar and sustain voltages as high as -65~kV, and the TPC is operating stably at its design high voltages. The system has been realized within the constraints of a stringent radiopurity budget and is now being used to execute a suite of sensitive double beta decay analyses.",
    "authors": [
      "NEXT Collaboration",
      "C. Adams",
      "H. Almazán",
      "V. Álvarez",
      "K. Bailey",
      "R. Guenette",
      "B. J. P. Jones",
      "S. Johnston",
      "K. Mistry",
      "F. Monrabal",
      "D. R. Nygren",
      "B. Palmeiro",
      "L. Rogers",
      "J. Waldschmidt",
      "B. Aparicio",
      "A. I. Aranburu",
      "L. Arazi",
      "I. J. Arnquist",
      "F. Auria-Luna",
      "S. Ayet",
      "C. D. R. Azevedo",
      "F. Ballester",
      "M. del Barrio-Torregrosa",
      "A. Bayo",
      "J. M. Benlloch-Rodríguez",
      "F. I. G. M. Borges",
      "A. Brodolin",
      "S. Cárcel",
      "A. Castillo",
      "L. Cid",
      "C. A. N. Conde",
      "T. Contreras",
      "F. P. Cossío",
      "R. Coupe",
      "E. Dey",
      "G. Díaz",
      "C. Echevarria",
      "M. Elorza",
      "J. Escada",
      "R. Esteve",
      "R. Felkai",
      "L. M. P. Fernandes",
      "P. Ferrario",
      "A. L. Ferreira",
      "F. W. Foss",
      "Z. Freixa",
      "J. García-Barrena",
      "J. J. Gómez-Cadenas",
      "J. W. R. Grocott",
      "R. Guenette",
      "J. Hauptman",
      "C. A. O. Henriques",
      "J. A. Hernando Morata",
      "P. Herrero-Gómez",
      "V. Herrero",
      "C. Hervés Carrete",
      "Y. Ifergan",
      "F. Kellerer",
      "L. Larizgoitia",
      "A. Larumbe",
      "P. Lebrun",
      "F. Lopez",
      "N. López-March",
      "R. Madigan",
      "R. D. P. Mano",
      "A. P. Marques",
      "J. Martín-Albo",
      "G. Martínez-Lema",
      "M. Martínez-Vara",
      "R. L. Miller",
      "J. Molina-Canteras",
      "F. Monrabal",
      "C. M. B. Monteiro",
      "F. J. Mora",
      "P. Novella",
      "A. Nuñez",
      "E. Oblak",
      "J. Palacio",
      "B. Palmeiro",
      "A. Para",
      "A. Pazos",
      "J. Pelegrin",
      "M. Pérez Maneiro",
      "M. Querol",
      "J. Renner",
      "I. Rivilla",
      "C. Rogero",
      "B. Romeo",
      "C. Romo-Luque",
      "V. San Nacienciano",
      "F. P. Santos",
      "J. M. F. dos Santos",
      "M. Seemann",
      "I. Shomroni",
      "P. A. O. C. Silva",
      "A. Simón",
      "S. R. Soleti",
      "M. Sorel",
      "J. Soto-Oton",
      "J. M. R. Teixeira",
      "S. Teruel-Pardo",
      "J. F. Toledo",
      "C. Tonnelé",
      "S. Torelli",
      "J. Torrent",
      "A. Trettin",
      "A. Usón",
      "P. R. G. Valle",
      "J. F. C. A. Veloso",
      "J. Waiton",
      "A. Yubero-Navarro"
    ],
    "published": "2025-05-02T04:57:06Z",
    "updated": "2025-09-18T23:34:50Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.15425v1",
    "url": "https://arxiv.org/abs/2509.15425v1",
    "pdf_url": "https://arxiv.org/pdf/2509.15425v1.pdf",
    "title": "Structure-preserving long-time simulations of turbulence in magnetized   ideal fluids",
    "abstract": "We address three two-dimensional magnetohydrodynamics models: reduced magnetohydrodynamics (RMHD), Hazeltine's model, and the Charney-Hasegawa-Mima (CHM) equation. These models are derived to capture the basic features of magnetohydrodynamic turbulence and plasma behaviour. They all possess non-canonical Hamiltonian formulations in terms of Lie-Poisson brackets, which imply an infinite number of conservation laws along with symplecticity of the phase flow. This geometric structure in phase space affects the statistical long-time behaviour. Therefore, to capture the qualitative features in long-time numerical simulations, it is critical to use a discretization that preserves the rich phase space geometry. Here, we use the matrix hydrodynamics approach to achieve structure-preserving discretizations for each model. We furthermore carry out long-time simulations with randomized initial data and a comparison between the models. The study shows consistent behaviour for the magnetic potential: both RMHD and Hazeltine's model produce magnetic dipoles (in CHM, the magnetic potential is prescribed). These results suggest an inverse cascade of magnetic energy and of the mean-square magnetic potential, which is empirically verified via spectral scaling diagrams. On the other hand, the vorticity field dynamics differs between the models: RMHD forms sharp vortex filaments with rapidly growing vorticity values, whereas Hazeltine's model and CHM show only small variation in the vorticity values. Related to this observation, both Hazeltine's model and CHM give spectral scaling diagrams indicating an inverse cascade of kinetic energy not present in RMHD.",
    "authors": [
      "Klas Modin",
      "Michael Roop"
    ],
    "published": "2025-09-18T21:04:46Z",
    "updated": "2025-09-18T21:04:46Z",
    "categories": [
      "physics.plasm-ph",
      "37M15, 65P10, 76W05"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.15388v1",
    "url": "https://arxiv.org/abs/2509.15388v1",
    "pdf_url": "https://arxiv.org/pdf/2509.15388v1.pdf",
    "title": "Development of BPM electronics for PIP-II at Fermilab",
    "abstract": "This paper presents the uTCA4.0-based BPM electronics for PIP-II, featuring four 250 MSPS ADCs and a Xilinx UltraScale+ MPSoC FPGA with 10 GbE uplink. Design elements include signal conditioning, clock, and thermal management. The FPGA performs signal processing, time tagging, digital down-conversion, and phase drift compensation. Position and phase resolution, and thermal stability - is validated through dedicated testing.",
    "authors": [
      "Shengli Liu",
      "Nathan Eddy",
      "A. Semenov",
      "Brian Fellenz"
    ],
    "published": "2025-09-18T19:52:56Z",
    "updated": "2025-09-18T19:52:56Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.15377v1",
    "url": "https://arxiv.org/abs/2509.15377v1",
    "pdf_url": "https://arxiv.org/pdf/2509.15377v1.pdf",
    "title": "Accelerating Garfield++ with CUDA",
    "abstract": "Garfield++ is extensively used within the gaseous detector community for comprehensive detector simulations, supporting the full experimental life cycle from design to operation and calibration. The emergence of micro-pattern gaseous detectors has necessitated computationally intensive microscopic avalanche simulations. The acceleration of one of Garfield++'s most demanding algorithms, AvalancheMicroscopic, by porting it to graphics processing units using NVIDIA's CUDA framework is described. The modifications are integrated into the Garfield++ codebase and are accessible to end users with only minor adjustments to their existing code. Benchmark results demonstrate substantial speed-up, especially for high-gain avalanches involving thousands of electrons, thereby enabling more efficient and detailed detector simulations.",
    "authors": [
      "T. Neep",
      "K. Nikolopoulos",
      "M. Slater"
    ],
    "published": "2025-09-18T19:29:31Z",
    "updated": "2025-09-18T19:29:31Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.15369v1",
    "url": "https://arxiv.org/abs/2509.15369v1",
    "pdf_url": "https://arxiv.org/pdf/2509.15369v1.pdf",
    "title": "Fermilab PIP-II CDS and CM Cryogenic Controls System",
    "abstract": "Details on Final design for Cryogenic Electrical & Controls System for Fermilab' s next-gen particle accelerator PIP-II. Electrical Controls System includes instrumentation and controls of Cryogenics Distribution System and Cryomodules. Design includes Siemens PCS7 Controls System with 26 Remote IO Rittal Cabinets and 48 Relay Racks for Temperature Readouts, Valve Positioners, Level, Heater Controls etc. Electrical Drawings and Design have been completed with focus now on fabrication of the 26 Rittal Cabinets and 48 Relay Racks. All materials have been procured. EPICS will be used as a SCADA system communicating to S7 Controllers via OPC UA.",
    "authors": [
      "Pratik Patel",
      "Ram Dhuley",
      "Ahmed Faraj",
      "Alexander Martinez",
      "Vrushank Patel",
      "William Soyars",
      "Sungwoon Yoon"
    ],
    "published": "2025-09-18T19:16:48Z",
    "updated": "2025-09-18T19:16:48Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.15367v1",
    "url": "https://arxiv.org/abs/2509.15367v1",
    "pdf_url": "https://arxiv.org/pdf/2509.15367v1.pdf",
    "title": "Fabrication of the HFVMTF Double-Bath Cryostat",
    "abstract": "The High Field Vertical Magnet Test Facility (HFVMTF) at Fermilab is designed to test superconducting magnets up to 20 tons and 1.3 meters in diameter. Central to the facility is a double-bath superfluid helium cryostat reaching 1.8 K at 1.2 bar. Integrated with a 15 T superconducting dipole from LBNL, HFVMTF supports HTS cable testing for fusion applications. This paper presents the design and fabrication of the cryostat, with a focus on two complex components: the 2 K heat exchanger and the lambda plate. The heat exchanger thermally links sub-atmospheric and pressurized helium baths. The 1.4-meter lambda plate provides thermal isolation and structural support for over 20 tons under 1.3 bar pressure differential. Finite Element Analysis validated the vessel's integrity under maximum load conditions.",
    "authors": [
      "R Bruce",
      "V Nikolic",
      "T Tope",
      "O Oshinowo",
      "G Velev",
      "T Vo",
      "M Maurisak"
    ],
    "published": "2025-09-18T19:10:41Z",
    "updated": "2025-09-18T19:10:41Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.15364v1",
    "url": "https://arxiv.org/abs/2509.15364v1",
    "pdf_url": "https://arxiv.org/pdf/2509.15364v1.pdf",
    "title": "Advancing 1D thermo-hydraulic tools for large cryogenic facilities",
    "abstract": "The Cryogenic Division at Fermilab develops large-scale cryogenic systems for particle accelerators and superconducting magnet test facilities. To support design and diagnostics, a Python-based code was created to calculate pressure drops in components such as valves and pipes. This paper presents recent enhancements to the code, including new heat transfer functions that improve the accuracy of thermal and hydraulic predictions. The first application models pressure and temperature changes in Proton Improvement Plant PIP-II relief pipes, aiding pipe sizing and protecting relief valves. The second example analyses heat load evolution in a pipe carrying sub-atmospheric helium, helping interpret temperature sensor data and understand gas return behavior to cold compressors. These improvements significantly expand the tool's capabilities, offering a practical resource for designing and troubleshooting cryogenic systems under dynamic thermal and flow conditions.",
    "authors": [
      "R Beckwith",
      "R Bruce",
      "S Koshelev"
    ],
    "published": "2025-09-18T19:03:50Z",
    "updated": "2025-09-18T19:03:50Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.15329v1",
    "url": "https://arxiv.org/abs/2509.15329v1",
    "pdf_url": "https://arxiv.org/pdf/2509.15329v1.pdf",
    "title": "The hot-electron closure of the moment-based gyrokinetic plasma model",
    "abstract": "We derive the hot-electron limit (HEL) closure of the moment hierarchy used to solve the gyrokinetic equations, denoted as gyromoment (GM). By expanding gyroaveraging kernels in the small temperature ratio Ti/Te limit and retaining only essential O(Ti/Te) terms, we obtain a closed system for density, parallel velocity, and parallel and perpendicular temperatures. In the Z-pinch geometry, the GM system with HEL closure is analytically equivalent to the one developed by Ivanov et al. (2022). Numerical benchmarks confirm the closure's accuracy in Z-pinch geometry, reproducing established linear growth rates, nonlinear heat transport, and low-collisionality dynamics. Extension to tokamak-relevant s-alpha geometry, and comparison with gyrokinetic simulations, reveals the HEL closed GM model capabilities and limitations: while transport levels and temporal dynamics are qualitatively preserved even at Ti/Te=1, the absence of higher-order kinetic moments prevents accurate Dimits shift prediction and transport suppression.",
    "authors": [
      "A. C. D. Hoffmann",
      "P. Giroud-Garampon",
      "P. Ricci"
    ],
    "published": "2025-09-18T18:20:37Z",
    "updated": "2025-09-18T18:20:37Z",
    "categories": [
      "physics.plasm-ph",
      "nlin.CD",
      "physics.app-ph",
      "physics.comp-ph",
      "physics.flu-dyn"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.15320v1",
    "url": "https://arxiv.org/abs/2509.15320v1",
    "pdf_url": "https://arxiv.org/pdf/2509.15320v1.pdf",
    "title": "Anisotropic Cosmic Ray Transport resulting from Magnetic Mirroring and   Resonant Curvature Scattering",
    "abstract": "The transport of cosmic rays through turbulent astrophysical plasmas still constitutes an open problem. Building on recent progress, we study the combined effect of magnetic mirroring and resonant curvature scattering on parallel and perpendicular transport. We conduct test particle simulations in snapshots of an anisotropic magnetohydrodynamics simulation, and record magnetic moment variation and field line curvature around pitch angle reversals. We find for strongly magnetized particles that (i) pitch angle reversals may occur either in coherent regions of the field with small variation of the magnetic moment via magnetic mirroring, or in chaotic regions of the field with strong variation of the magnetic moment via resonant curvature scattering; (ii) parallel transport can be modeled as a L\\'evy walk with a truncated power-law distribution based on pitch angle reversal times; and (iii) perpendicular transport is enhanced by resonant curvature scattering in synergy with chaotic field line separation, and diminished by magnetic mirroring due to confinement in locally ordered field line bundles. While magnetic mirroring constitutes the bulk of reversal events, resonant curvature scattering additionally acts on trajectories which fall in the loss cones of typical mirroring structures and thus provides the cut-off for the reversal time distribution. Our results, which highlight the role of the magnetic field line geometry in cosmic ray transport processes, are consistent with energy-independent diffusion coefficients. We conclude by considering how energy-dependent observations could arise from an intermittently inhomogeneous interstellar medium.",
    "authors": [
      "Jeremiah Lübke",
      "Frederic Effenberger",
      "Mike Wilbert",
      "Horst Fichtner",
      "Rainer Grauer"
    ],
    "published": "2025-09-18T18:09:56Z",
    "updated": "2025-09-18T18:09:56Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2509.15285v1",
    "url": "https://arxiv.org/abs/2509.15285v1",
    "pdf_url": "https://arxiv.org/pdf/2509.15285v1.pdf",
    "title": "Simultaneous Speedmeter and Position-Meter Response in a Single Tabletop   Interferometer",
    "abstract": "Quantum radiation-pressure noise (QRPN) limits the low-frequency sensitivity of gravitational wave detectors. The established method for suppressing QRPN is the injection of frequency-dependent squeezed light. It requires long-baseline filter cavities introducing substantial experimental complexity. A completely different interferometer concept is the speedmeter. It avoids QRPN at the source by measuring test mass speed instead of position. While extensively researched theoretically, speedmeters are yet to be demonstrated with a moving test mass in an optomechanical setting. In this work, we present the first experimental observation of speedmeter behavior in a system with a movable test mass. We realize a novel hybrid readout cavity configuration that enables simultaneous extraction of position and speed signals from two distinct output ports. We compare the optical transfer functions associated with each channel and observe the expected scaling behavior that distinguishes a speedmeter from a position-meter. We support our observations with a detailed theoretical model, showing how the hybrid readout cavity implements key speedmeter features. Our results underscore the relevance of the speedmeter concept as an alternative for mitigating QRPN in future detectors and lay the groundwork for further experimental exploration.",
    "authors": [
      "Mikhail Korobko",
      "Xiang Li",
      "Torben Sobottke",
      "Yiqiu Ma",
      "Yanbei Chen",
      "Roman Schnabel"
    ],
    "published": "2025-09-18T15:14:43Z",
    "updated": "2025-09-18T15:14:43Z",
    "categories": [
      "quant-ph",
      "astro-ph.IM",
      "gr-qc",
      "physics.ins-det"
    ],
    "primary_category": "quant-ph"
  },
  {
    "arxiv_id": "2507.07127v2",
    "url": "https://arxiv.org/abs/2507.07127v2",
    "pdf_url": "https://arxiv.org/pdf/2507.07127v2.pdf",
    "title": "Amplitude Walk in Fast Timing: The Role of Dual Thresholds",
    "abstract": "In preparation for HL-LHC operation, a number of new detector systems are being constructed with timing precision on physics objects of $\\leq50$ picoseconds. These time stamps will reduce the level of pileup induced backgrounds as the number of interactions per crossing will reach of order 100-200\\cite{Shiltsev}.   In this report we note that this high pileup level will necessitate a new approach to calibration of these large timing arrays (typically with several $\\times10^5$ channels) . Since the usual tools required for walk correction (a single t$_{0}$ reference and tracking) may not be readily available on Day-1, an initial calibration technique using only data internal to the timing array would be a benefit.   We demonstrate that enhancing the usual pair of timing ASIC data (ie threshold time and amplitude or time-over-threshold) with a 2nd threshold time greatly simplifies the analysis of amplitude walk. Walk dependence on the slope at threshold (derived from the two thresholds) is quite generally given by a single linear expression. Furthermore the Amplitude Walk Coefficient (AWC) can usually be determined in advance, as we will show.   While this technique results in calibration precision equivalent to the familiar brute force technique it should be emphasized that it is applicable when the tools required for the latter technique are not available.",
    "authors": [
      "Sebastian White",
      "Alessio Boletti"
    ],
    "published": "2025-07-08T19:25:02Z",
    "updated": "2025-09-18T13:37:17Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.14906v1",
    "url": "https://arxiv.org/abs/2509.14906v1",
    "pdf_url": "https://arxiv.org/pdf/2509.14906v1.pdf",
    "title": "Multi-color XFEL pulses with variable color separation and time delay   for multi-frame diffraction imaging",
    "abstract": "X-ray free-electron lasers (XFELs) of high brightness have opened new opportunities for exploring ultrafast dynamical processes in matter, enabling imaging and movies of single molecules and particles at atomic resolution. In this paper, we present a straightforward method for multi-frame diffraction imaging, using the same electron beam to generate four-color XFEL pulses with adjustable wavelength separation and time delay. The optical klystron scheme is introduced to enhance FEL intensity and reduce the total length of undulators. The time delay is tuned via a magnetic chicane between the undulators with various colors. Using parameters of SHINE, start-to-end simulations demonstrate the effectiveness and tunability of our method, achieving representative results such as time delays of hundreds of femtoseconds and four-color XFEL pulses spanning 1.8 to 2.7 nm with 0.3 nm intervals. The proposed scheme enables the recording of multi-frame diffraction images in a single exposure, providing a new perspective for ultrafast molecular and atomic dynamics studies.",
    "authors": [
      "Xiaodan Liu",
      "Hanxiang Yang",
      "Bingyang Yan",
      "Yue Wang",
      "Nanshun Huang",
      "Liqi Han",
      "Jie Cai",
      "Han Wen",
      "Jinqing Yu",
      "Haixiao Deng",
      "Xueqing Yan"
    ],
    "published": "2025-09-18T12:31:06Z",
    "updated": "2025-09-18T12:31:06Z",
    "categories": [
      "physics.acc-ph",
      "physics.optics"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.14892v1",
    "url": "https://arxiv.org/abs/2509.14892v1",
    "pdf_url": "https://arxiv.org/pdf/2509.14892v1.pdf",
    "title": "Supersonic gas curtain based real-time ionization profile monitor for   hadron therapy",
    "abstract": "Accurate control and monitoring of the beam is essential for precise dose delivery to tumor tissues during radiotherapy. Real-time monitoring of ion beam profiles and positions improves beam control, patient safety, and treatment reliability by providing immediate feedback. This becomes even more critical in FLASH therapy, where the short corrective window during high-dose delivery demands precise beam control. Existing devices are often limited to in vitro calibration or focus on monitoring a single parameter during treatment. This study aims to develop a device that can simultaneously monitor beam position, profile, current, and energy in real-time, without perturbing the beam, using a supersonic gas curtain system. A supersonic gas curtain beam profile monitor was developed at the Cockcroft Institute to assess its performance and suitability for applications in hadron-beam therapy. The system was integrated with one of the beamlines of the Pelletron accelerator at the Dalton Cumbrian Facility, UK and 2D profile measurements of carbon beams were conducted. The monitor successfully measured the beam profiles within 100ms to 1s across various beam currents (1 - 100 nA), energies (12 - 24 MeV), and charge states (2-5) of carbon. Recorded data was used to estimate detector performance by introducing a parameter called detection limit to quantify sensitivity of the monitor, identifying the threshold number of ions required for detection onset. A method to quantify sensitivity under different beam conditions is then discussed in detail, illustrated with an example case of FLASH beam parameters. This proof-of-concept study demonstrates the performance of the gas curtain-based ionization profile monitor for 2D transverse beam profile measurement of carbon ions. The sensitivity is quantified and evaluated against an example case for FLASH conditions.",
    "authors": [
      "Narender Kumar",
      "Milaan Patel",
      "William Butcher",
      "Hao Zhang",
      "Oliver Stringer",
      "Joseph Wolfenden",
      "Carsten P Welsch"
    ],
    "published": "2025-09-18T12:15:31Z",
    "updated": "2025-09-18T12:15:31Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.14884v1",
    "url": "https://arxiv.org/abs/2509.14884v1",
    "pdf_url": "https://arxiv.org/pdf/2509.14884v1.pdf",
    "title": "Applying reinforcement learning to optical cavity locking tasks:   considerations on actor-critic architectures and real-time hardware   implementation",
    "abstract": "This proceedings contains our considerations made during and after fruitful discussions held at EuCAIFCon 2025. We explore the use of deep reinforcement learning for autonomous locking of Fabry-Perot optical cavities in non-linear regimes, with relevance to gravitational-wave detectors. A custom Gymnasium environment with a time-domain simulator enabled training of agents such as deep deterministic policy gradient, achieving reliable lock acquisition for both low- and high-finesse cavities, including Virgo-like parameters. We also discuss possible improvements with Twin Delayed DDPG, Soft Actor Critic and meta-reinforcement learning, as well as strategies for low-latency execution and off-line policy updates to address hardware limitations. These studies lay the groundwork for future deployment of reinforcement learning-based control in real optical setups.",
    "authors": [
      "Mateusz Bawaj",
      "Andrea Svizzeretto"
    ],
    "published": "2025-09-18T12:06:40Z",
    "updated": "2025-09-18T12:06:40Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2507.08942v2",
    "url": "https://arxiv.org/abs/2507.08942v2",
    "pdf_url": "https://arxiv.org/pdf/2507.08942v2.pdf",
    "title": "Electromagnetic Energy Extraction from Kerr Black Holes: Ab-Initio   Calculations",
    "abstract": "The possibility of extracting energy from a rotating black hole via the Blandford-Znajek mechanism represents a cornerstone of relativistic astrophysics. We present general-relativistic collisionless kinetic simulations of Kerr black-hole magnetospheres covering a wide range in the black-hole spin. Considering a classical split-monopole magnetic field, we can reproduce with these ab-initio calculations the force-free electrodynamics of rotating black holes and measure the power of the jet launched as a function of the spin. The Blandford-Znajek luminosity we find is in very good agreement with analytic calculations and compatible with general-relativistic magnetohydrodynamics simulations via a simple rescaling. These results provide strong evidence of the robustness of the Blandford-Znajek mechanism and accurate estimates of the electromagnetic luminosity to be expected in those scenarios involving rotating black holes across the mass scale.",
    "authors": [
      "Claudio Meringolo",
      "Filippo Camilloni",
      "Luciano Rezzolla"
    ],
    "published": "2025-07-11T18:04:52Z",
    "updated": "2025-09-18T11:35:01Z",
    "categories": [
      "gr-qc",
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "gr-qc",
    "doi": "10.3847/2041-8213/ae06a6"
  },
  {
    "arxiv_id": "2509.14733v1",
    "url": "https://arxiv.org/abs/2509.14733v1",
    "pdf_url": "https://arxiv.org/pdf/2509.14733v1.pdf",
    "title": "Effect of construction steels on PMTs detection efficiency at JUNO",
    "abstract": "We study the impact of the carbon steel rebars and the steel TT bridge within the JUNO structure on the shielding effect of the coils. Our simulations demonstrate that despite the presence of carbon steel structures of the rebars of the water pool and the TT bridge within the central detector vicinity, the residual magnetic field experienced by the PMTs remains within the acceptable limit established by the JUNO experiment of 10% for CD-PMTs and 20% for Veto-PMTs, compared to the geomagnetic field. The maximum magnetic fields experienced by the CD-PMTs and Veto-PMTs are 9% and 18% of the geomagnetic field strength, respectively. These findings indicate that the residual magnetic field has minimal impacts on the PMTs detection efficiency.",
    "authors": [
      "T. Yan",
      "J. Songwadhana",
      "A. Limphirat",
      "Y. Yan",
      "H. Lu",
      "F. Ning",
      "P. Zheng",
      "C. Yang",
      "G. Zhang",
      "W. Sreethawong",
      "K. Khosonthongkee",
      "N. Suwonjandee"
    ],
    "published": "2025-09-18T08:34:07Z",
    "updated": "2025-09-18T08:34:07Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.07525v2",
    "url": "https://arxiv.org/abs/2508.07525v2",
    "pdf_url": "https://arxiv.org/pdf/2508.07525v2.pdf",
    "title": "Experimental search for neutron-antineutron oscillation with use of   ultra-cold neutrons revisited",
    "abstract": "Neutron-antineutron oscillation (nnbar-osc) is a baryon-number-violating process and a sensitive probe for physics beyond the Standard Model. Ultra-cold neutrons (UCNs) are attractive for nnbar-osc searches because of their long storage time, but earlier analyses indicated that phase shifts on wall reflection differ for neutron and antineutron, leading to severe decoherence and loss of sensitivity. Here we revisit this problem by numerically solving the time-dependent Schroedinger equation for the two-component n/nbar wave function, explicitly including wall interactions. We show that decoherence can be strongly suppressed by selecting a wall material whose neutron and antineutron optical potentials are nearly equal. Using coherent scattering length data and estimates for antineutrons, we identify a Ni-Al alloy composition that matches the potentials within a few percent while providing a high absolute value, enabling long UCN storage. With such a bottle and an improved UCN source, the sensitivity could reach an oscilla-tion period tau_nnbar of order 10^10 s, covering most of the range predicted by certain grand-unified models. This approach revives the feasibility of high-sensitivity nnbar-osc searches using stored UCNs and offers a clear path to probe baryon-number violation far beyond existing limits.",
    "authors": [
      "Tatsushi Shima"
    ],
    "published": "2025-08-11T01:02:33Z",
    "updated": "2025-09-18T07:48:07Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.3390/sym17091524"
  },
  {
    "arxiv_id": "2501.07452v3",
    "url": "https://arxiv.org/abs/2501.07452v3",
    "pdf_url": "https://arxiv.org/pdf/2501.07452v3.pdf",
    "title": "Efficient cosmic ray generator for particle detector simulations",
    "abstract": "Traditional cosmic ray simulations make use of the Montecarlo method in a very naive way to randomise energy and direction for each simulated particle. The flux of cosmic rays is modelled as a rain coming from a plane above the object of interest (detectors in particle physics applications, planes in dosimetry studies, etc.) with an experimental angular and energy distributions. This strategy is very inefficient because many of the particles never touch the detector. Here a refined way of implementing the Montecarlo method is proposed in order to generate a sample of events that hit the target volume whose angular distribution coincides with the one from the naive implementation. It is based on the projection of a sphere containing the target volume onto a plane tangent to it with a fixed angle, we call it the secant method. This configuration allows to compute the probability of a cosmic particle hitting the sphere with this incoming angle as proportional to the area of the corresponding section of a cylinder. The performance of this method is faster in terms of computing time and identical physical results are achieved. It has been implemented in REST-for-Physics framework and it is tested with the geometry of a real detector, the IAXO-D0 Micromegas X-ray detector for the future axion helioscope BabyIAXO. Our method is 37 times more efficient than the traditional Montecarlo schema for the same accuracy, being more useful when the target volume departs from spherical shape",
    "authors": [
      "David Díez Ibáñez",
      "Luis Obis Aparicio"
    ],
    "published": "2025-01-13T16:26:18Z",
    "updated": "2025-09-18T07:46:54Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex",
    "doi": "10.1016/j.cpc.2025.109805"
  },
  {
    "arxiv_id": "2509.14674v1",
    "url": "https://arxiv.org/abs/2509.14674v1",
    "pdf_url": "https://arxiv.org/pdf/2509.14674v1.pdf",
    "title": "Performance evaluation of compact plastic scintillating fiber modules   for muon tomography applications",
    "abstract": "Muon tomography is a non-destructive imaging technique that exploits cosmic-ray muons from multiple directions. Its performance critically relies on stable, large-area, and high-resolution position-sensitive detectors. In this work, we report on the development of four compact scintillating fiber modules, each 100 cm long and composed of two staggered layers of 1 mm diameter fibers. The fibres are read out at one end by one-dimensional silicon photomultiplier arrays with a 2 mm pitch, coupled to Citiroc1A-based front-end electronics. The modules were characterised with cosmic-ray muons, yielding a detection efficiency above 97\\% and a mean spatial resolution of about 0.56 mm, with uniform response over different distances from the readout end. These results demonstrate the suitability of this detector design for compact and large-area systems in muon tomography applications.",
    "authors": [
      "Yiyue Li",
      "Huiling Li",
      "Hui Liang",
      "Cong Liu",
      "Chenghan Lv",
      "Hongbo Wang",
      "Weiwei Xu"
    ],
    "published": "2025-09-18T07:05:01Z",
    "updated": "2025-09-18T07:05:01Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.14649v1",
    "url": "https://arxiv.org/abs/2509.14649v1",
    "pdf_url": "https://arxiv.org/pdf/2509.14649v1.pdf",
    "title": "Intensified optical camera with Timepix4 readout",
    "abstract": "We report the first characterization results of an optical time-stamping camera based on the Timepix4 chip coupled to a fully depleted optical silicon sensor and fast image intensifier, enabling sub-nanosecond scale, time-resolved imaging for single photons. The system achieves an RMS time resolution of 0.27 ns in direct detection mode without the intensifier and from 0.55 to 1.4 ns in the single-photon regime with intensifier for different amplitude-based signal selections. This shows that Timepix4 provides a significant improvement over previous Timepix3-based cameras in terms of timing precision, pixel count, and data throughput. We analyze key factors that affect performance, including sensor bias and time-walk, and demonstrate effective correction methods to recover high temporal accuracy. The camera temporal resolution, event-driven readout and high rate capability make it a scalable platform for a wide range of applications, including quantum optics, ultrafast imaging, and time-correlated photon counting experiments.",
    "authors": [
      "Erik Hogenbirk",
      "Andrei Nomerotski",
      "Bram Bouwens",
      "Gabriel Diaz",
      "Shazia Farooq",
      "Erik Maddox",
      "Ondrej Matousek",
      "Peter Svihra",
      "Henrique Zanoli"
    ],
    "published": "2025-09-18T06:09:03Z",
    "updated": "2025-09-18T06:09:03Z",
    "categories": [
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.14439v1",
    "url": "https://arxiv.org/abs/2509.14439v1",
    "pdf_url": "https://arxiv.org/pdf/2509.14439v1.pdf",
    "title": "Performance Enhancement of Medium-Temperature Baked Niobium SRF Cavity   by Surface Contamination Removal",
    "abstract": "Medium temperature (mid-T) baking, typically conducted at 300 350 C, enhances the quality factor of niobium (Nb) superconducting radio frequency cavities. High vacuum furnace baking is commonly preferred for its practicality in large-scale processing. However, surface contamination, such as niobium carbide formed during vacuum furnace baking, can limit the quench field and degrade the quality factor of the cavity. To investigate this effect, a 1.3 GHz single-cell Nb cavity underwent mid-T baking, followed by a chemical treatment to remove the surface contaminants. Post-treatment measurements revealed a significant improvement in both the quality factor and the quench field.",
    "authors": [
      "V. Chouhan",
      "D. Bice",
      "A. Cravatta",
      "A. Murthy",
      "A. Netepenko",
      "T. Ring",
      "D. Smith",
      "G. Wu"
    ],
    "published": "2025-09-17T21:25:20Z",
    "updated": "2025-09-17T21:25:20Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.14410v1",
    "url": "https://arxiv.org/abs/2509.14410v1",
    "pdf_url": "https://arxiv.org/pdf/2509.14410v1.pdf",
    "title": "Consideration of REBCO rapid-cycling diploe magnet for staged muon   acceleration",
    "abstract": "A possible application of the HTS (ReBCO) rapid-cycling dipole magnet [1] in the first stages of muon acceleration consisting of Recirculating Linear Accelerator (RLA) and followed-up first Rapid Cycling Synchrotron (RCS-1) is presented. The projected ReBCO magnet hysteresis loss is discussed in terms of the liquid helium coolant choice and the option with the striated ReBCO conductor for the further significant reduction of the hysteresis power loss.",
    "authors": [
      "Henryk Piekarz"
    ],
    "published": "2025-09-17T20:23:30Z",
    "updated": "2025-09-17T20:23:30Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.14400v1",
    "url": "https://arxiv.org/abs/2509.14400v1",
    "pdf_url": "https://arxiv.org/pdf/2509.14400v1.pdf",
    "title": "Electron Inertia and Magnetic Reconnection",
    "abstract": "The finite electron mass can cause magnetic reconnection even in the absence of any other non-ideal effect in a magnetic evolution. It will be shown that when electron inertia is the only non-ideal effect in the evolution of the magnetic field $\\vec{B}$, there is a related field that evolves ideally. This field is $\\vec{\\mathcal{B}} \\equiv \\vec{B} + \\vec{\\nabla}\\times \\left( (m_e/n e^2) \\vec{j} \\right)$ with $m_e$ the electron mass, $n$ the electron number density, and $\\vec{j}$ the current density. Although the magnetic field is modified from its ideal evolution form by the electron inertia, the effect on particle trajectories, even electron trajectories, is small unless the current lies in thin sheets, which make $\\vec{j}$ extremely large. The field $\\vec{\\mathcal{B}}$ is closely related to Voigt normalized magnetic field, which is defined by a Laplacian smoothing of $\\vec{B}$. The difference between $\\vec{\\mathcal{B}}$ and $\\vec{B}$ involves the relativistically invariant four-space Laplacian acting on $\\vec{B}$ with a $c/\\omega_{pe}$ smoothing distance; $\\omega_{pe}$ is the plasma frequency.",
    "authors": [
      "Allen H Boozer"
    ],
    "published": "2025-09-17T20:02:37Z",
    "updated": "2025-09-17T20:02:37Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.14375v1",
    "url": "https://arxiv.org/abs/2509.14375v1",
    "pdf_url": "https://arxiv.org/pdf/2509.14375v1.pdf",
    "title": "Booster Cavity Damper Redesign for PIP-II",
    "abstract": "A new Higher Order Mode (HOM) damper was designed and tested for the Booster accelerator cavity at Fermilab. In anticipation of the PIP-II upgrade, it was discovered that the higher beam intensity of PIP-II may cause beam instability due to an excited mode at 105 MHz. This unfortunately corresponds with the cavity's 2nd order harmonic mode, which will sweep from 86-105.7 MHz. The new damper is a modification of an existing damper that was designed to reduce an existing static HOM at 83 MHz, with the new design intending to cover the 2nd order HOM as well. The existing damper uses an inductive coupling loop to extract RF energy from the cavity which then goes through a filter in order to reflect the fundamental frequency back into the cavity while passing HOMs to a dump load. The new damper intends to replace the filter portion of the system with a wider band variant while also changing the topology from a coaxial cable loop filter to a componentized PCB-based design. Primary design challenges include bandwidth coverage, impedance matching of the various modes, long term thermal and mechanical stability, radiation hardness, and high voltage handling. Initial designs achieved the desired damping but were found to quickly succumb to destructive arcing due to the voltages present. More finalized designs intend to address this problem through circuit redesigns and the use of hardier components.",
    "authors": [
      "Dustin Pieper",
      "Brian Vaughn",
      "Robyn Madrak"
    ],
    "published": "2025-09-17T19:22:34Z",
    "updated": "2025-09-17T19:22:34Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.14369v1",
    "url": "https://arxiv.org/abs/2509.14369v1",
    "pdf_url": "https://arxiv.org/pdf/2509.14369v1.pdf",
    "title": "Test results of the LQXFA/B02 and LQXFA/B03 cryo-assemblies for the High   Luminosity LHC upgrade",
    "abstract": "The US High-Luminosity LHC Accelerator Upgrade Project (AUP) is responsible for delivering cryo-assemblies for the Q1/Q3 quadrupole optical components of the High Luminosity LHC upgrade at CERN. Total of 10 cryo-assemblies containing two Nb3Sn quadrupole magnets per cold mass will be delivered within this program. After the successful test of the first pre-series cryo-assembly in 2023, two more cryo-assemblies were tested at Fermilab's horizontal test facility. Production overview and the test results of the LQXFA/B02 and LQXFA/B03 cryo-assemblies are summarized in this paper. After the first test, to increase the capability of the horizontal test facility, various improvements have been made. These improvements are also described in this paper.",
    "authors": [
      "G. Chlachidze",
      "G. Ambrosio",
      "M. Anerella",
      "G. Apollinari",
      "M. Baldini",
      "J. DiMarco",
      "S. Feher",
      "P. Ferracin",
      "V. Nikolic",
      "F. Nobrega",
      "C. Orozco",
      "D. Orris",
      "S. Prestemon",
      "R. Rabehl",
      "S. Stoynev",
      "A. Vouris"
    ],
    "published": "2025-09-17T19:09:09Z",
    "updated": "2025-09-17T19:09:09Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2509.14320v1",
    "url": "https://arxiv.org/abs/2509.14320v1",
    "pdf_url": "https://arxiv.org/pdf/2509.14320v1.pdf",
    "title": "Probing the meV QCD Axion with the $\\texttt{SQWARE}$ Quantum   Semiconductor Haloscope",
    "abstract": "We propose the Semiconductor-Quantum-Well Axion Radiometer Experiment ($\\texttt{SQWARE}$) -- a new experimental platform for direct detection of axion dark matter in the meV mass range -- based on resonantly enhanced axion-photon conversion through the inverse Primakoff effect in engineered quantum semiconductor heterostructures. The core of the radiometer is a GaAs/AlGaAs multiple quantum well structure forming a magnetoplasmonic cavity, containing an ultrahigh-mobility two-dimensional electron gas, which realizes a tunable epsilon-near-zero resonance in the terahertz frequency range. By controlling the orientation of the cavity within a strong external magnetic field, both the resonance frequency and the axion-induced current are optimized $\\textit{in situ}$, enabling efficient scanning across a broad mass range without complex mechanical adjustment. The axion-induced electromagnetic signal radiatively emitted from the magnetoplasmonic cavity is detected by a state-of-the-art photodetector. We present the theoretical basis for resonant enhancement, detail the experimental design and benchmarks through extensive simulations, and project the sensitivity of $\\texttt{SQWARE}$ for several realistic configurations. Our results demonstrate that $\\texttt{SQWARE}$ can probe the well-motivated quantum chromodynamics axion parameter space and close a critical gap in direct searches at meV masses.",
    "authors": [
      "Jaanita Mehrani",
      "Tao Xu",
      "Andrey Baydin",
      "Michael J. Manfra",
      "Henry O. Everitt",
      "Andrew J. Long",
      "Kuver Sinha",
      "Junichiro Kono",
      "Shengxi Huang"
    ],
    "published": "2025-09-17T18:00:10Z",
    "updated": "2025-09-17T18:00:10Z",
    "categories": [
      "hep-ph",
      "astro-ph.CO",
      "cond-mat.mes-hall",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "hep-ph"
  },
  {
    "arxiv_id": "2509.14214v1",
    "url": "https://arxiv.org/abs/2509.14214v1",
    "pdf_url": "https://arxiv.org/pdf/2509.14214v1.pdf",
    "title": "Time-of-flight Energy Measurements with BPMs",
    "abstract": "The energy of a bunched non-relativistic ion beam can be deduced from measuring the beam phases in neighbouring Beam Position Monitors (BPMs). This report discusses implementation of such a procedure at the PIP-II H- linac being constructed at Fermilab. The case when the flight time between BPMs is longer than the period of BPM frequency is considered in more detail. When absolute BPM phase calibration is not available, the BPM phase information can be used to track deviations of the beam energy from the de-sired value. Such \"energy deviation\" parameter is operationally implemented at the transfer line between 400 MeV Linac and the Booster, and its analog is expected to be used in the transfer line from PIP-II as well.",
    "authors": [
      "A. Shemyakin",
      "J. Kuharik",
      "R. Sharankova"
    ],
    "published": "2025-09-17T17:46:37Z",
    "updated": "2025-09-17T17:46:37Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.08663v3",
    "url": "https://arxiv.org/abs/2507.08663v3",
    "pdf_url": "https://arxiv.org/pdf/2507.08663v3.pdf",
    "title": "A Neutron Sensitive Detector Using 3D-Printed Scintillators",
    "abstract": "This work reports on the performance of a novel neutron-sensitive scintillating detector fabricated using Fused-Deposition Modelling (FDM) additive manufacturing. FDM is a cost-effective 3D-printing method employing flexible plastic filaments to create custom-shaped components. Scintillating filaments, based on polystyrene doped with \\emph{p}-terphenyl and 1,4-bis (5-phenyloxazol-2-yl) benzene, and enriched with $^6$LiF to enable neutron sensitivity were manufactured in house and achieved visible scintillation with a light output of 30$\\pm$5~photons per MeV. Printed scintillators were then integrated into a detector system consisting of an image intensified TimePix3 camera, offering high spatial and temporal resolution. The detector performance was compared with Geant4 simulations of the scintillating sensor's response to electrons, gamma-rays, and thermal neutrons. A novel event discrimination algorithm, using the properties of the TimePix3 camera, enabled the separation of neutron signatures from the gamma-ray background.",
    "authors": [
      "Adam Barr",
      "Cinzia da Vià",
      "Mosst Tasnim Binte Shawkat",
      "Stephen Watts",
      "John Allison",
      "Gabriele D'Amen",
      "Tianqi Gao"
    ],
    "published": "2025-07-11T15:03:12Z",
    "updated": "2025-09-17T15:51:15Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.14045v1",
    "url": "https://arxiv.org/abs/2509.14045v1",
    "pdf_url": "https://arxiv.org/pdf/2509.14045v1.pdf",
    "title": "Thermal Cycling Reliability of Hybrid Pixel Sensor Modules for The ATLAS   High Granularity Timing Detector",
    "abstract": "The reliability of bump connection structures has become a critical aspect of future silicon detectors for particle physics. The High Granularity Timing Detector (HGTD) for the ATLAS experiment at the High-Luminosity Large Hadron Collider will require 8032 hybrid pixel sensor modules, composed of two Low Gain Avalanche Diode sensors bump-bonded to two readout ASICs and glued to a passive PCB. The detector will operate at low temperature (-30 degrees Celsius) to mitigate the impact of irradiation. The thermomechanical reliability of flip-chip bump connections in HGTD modules is a critical concern, particularly due to their characteristically lower bump density (pixel pitch dimensions of 1.3 mm by 1.3 mm). This paper elaborates on the challenges arising from this design characteristic. Finite element analysis and experimental testing were employed to investigate failure modes in the flip-chip bump structures under thermal cycling from -45 degrees Celsius to 40 degrees Celsius and to guide the module redesign. The optimized design demonstrates significantly enhanced robustness and is projected to fulfill the full lifetime requirements of the HGTD.",
    "authors": [
      "Y. Li",
      "A. Aboulhorma",
      "M. Ait Tamlihat",
      "H. M. Alfanda",
      "N. Atanov",
      "O. Atanova",
      "I. Azzouzi",
      "J. Barreiro Guimarães Da Costa",
      "T. Beau",
      "D. Benchekroun",
      "F. Bendebba",
      "Y. Bimgdi",
      "A. Blot",
      "A. Boikov",
      "J. Bonis",
      "D. Boumediene",
      "C. Brito",
      "A. S. Brogna",
      "A. M. Burger",
      "L. Cadamuro",
      "Y. Cai",
      "N. Cartalade",
      "R. Casanova Mohr",
      "Y. Che",
      "X. Chen",
      "R. Cherkaoui El Moursli",
      "E. Y. S. Chow",
      "L. D. Corpe",
      "C. G. Crozatier",
      "L. D'Eramo",
      "S. Dahbi",
      "D. Dannheim",
      "G. Daubard",
      "Y. I. Davydov",
      "C. de La Taille",
      "J. Debevc",
      "Y. Degerli",
      "E. Delagnes",
      "F. Deliot",
      "M. Dhellot",
      "G. Di Gregorio",
      "P. Dinaucourt",
      "P. J. Dos Santos De Assis",
      "C. Duan",
      "O. Duarte",
      "F. Dulucq",
      "J. Ehrecke",
      "Y. El Ghazali",
      "A. El Moussaouy",
      "R. Estevam",
      "A. Falou",
      "L. Fan",
      "Z. Fan",
      "Y. Fan",
      "K. Farman",
      "F. Fassi",
      "Y. Feng",
      "M. Ferreira",
      "F. Filthaut",
      "F. Fischer",
      "J. Fu",
      "P. Fusté",
      "G. Gaspar De Andrade",
      "Z. Ge",
      "R. Gonçalo",
      "M. Gouighri",
      "S. Grinstein",
      "K. Gritsay",
      "F. Guilloux",
      "S. Guindon",
      "A. Haddad",
      "S. E. D. Hammoud",
      "L. Han",
      "A. M. Henriques Correia",
      "M. Hidaoui",
      "B. Hiti",
      "J. Hofner",
      "S. Hou",
      "P. J. Hsu",
      "K. Hu",
      "Y. Huang",
      "X. Huang",
      "C. Insa",
      "J. Jeglot",
      "X. Jia",
      "G. Kramberger",
      "M. Kuriyama",
      "B. Y. Ky",
      "D. Lacour",
      "A. Lafarge",
      "B. Lakssir",
      "A. Lantheaume",
      "D. Laporte",
      "A. Leopold",
      "M. Li",
      "S. Li",
      "L. Li",
      "S. Li",
      "H. Li",
      "Z. Li",
      "Z. Liang",
      "S. Liang",
      "M. A. Lisboa Leite",
      "B. Liu",
      "Y. L. Liu",
      "K. Liu",
      "K. Liu",
      "Y. W. Liu",
      "M. Lu",
      "Y. J. Lu",
      "F. L. Lucio Alves",
      "F. Lyu",
      "X. Ma",
      "K. Ma",
      "D. Macina",
      "R. Madar",
      "N. Makovec",
      "S. Malyukov",
      "I. Mandić",
      "T. Manoussos",
      "S. Manzoni",
      "G. Martin-Chassard",
      "F. Martins",
      "L. Masetti",
      "R. Mazini",
      "E. Mazzeo",
      "R. Menegasso",
      "J. -P. Meyer",
      "Y. Miao",
      "A. Migayron",
      "M. Mihovilovic",
      "M. Milovanovic",
      "M. Missio",
      "V. Moskalenko",
      "N. Mouadili",
      "A. Moussa",
      "I. Nikolic-Audit",
      "C. C. Ohm",
      "H. Okawa",
      "S. Okkerman",
      "M. Ouchrif",
      "C. Pénélaud",
      "A. Parreira",
      "B. Pascual Dias",
      "J. Pinol Bel",
      "P. -O. Puhl",
      "M. Puklavec",
      "M. Qi",
      "J. Qin",
      "H. Ren",
      "H. Riani",
      "S. Ridaouni",
      "V. Rogozin",
      "L. Royer",
      "F. Rudnyckyj",
      "E. F. Saad",
      "G. T. Saito",
      "A. Salem",
      "H. Santos",
      "Ph. Schwemling",
      "N. Seguin-Moreau",
      "L. Serin",
      "R. P. Serrano Fernandez",
      "Q. Sha",
      "A. Shaikovskii",
      "L. Shan",
      "R. Shen",
      "X. Shi",
      "P. Skomina",
      "H. Smitmanns",
      "H. L. Snoek",
      "A. P. Soulier",
      "A. Stein",
      "H. Stenzel",
      "J. Strandberg",
      "W. Sun",
      "X. Sun",
      "Y. Sun",
      "Y. Tan",
      "K. Tariq",
      "Y. Tayalati",
      "S. Terzo",
      "A. Torrento Coello",
      "S. Trincaz-Duvoid",
      "U. M. Vande Voorde",
      "I. Velkovska",
      "R. P. Vieira",
      "L. A. Vieira Lopes",
      "A. Visibile",
      "J. Wan",
      "W. Wang",
      "C. Wang",
      "Y. Wang",
      "Y. Wang",
      "A. Wang",
      "T. Wang",
      "T. Wang",
      "S. M. Wang",
      "Q. Weitzel",
      "J. Wu",
      "W. Wu",
      "Y. Wu",
      "M. Wu",
      "L. Xia",
      "H. Xu",
      "D. Xu",
      "L. Xu",
      "Z. Yan",
      "X. Yang",
      "X. Yang",
      "H. Yang",
      "H. Yang",
      "J. Ye",
      "I. Youbi",
      "J. Yuan",
      "I. Zahir",
      "H. Zeng",
      "T. Zhang",
      "J. Zhang",
      "Z. Zhang",
      "L. Zhang",
      "D. Zhang",
      "M. Zhao",
      "Z. Zhao",
      "X. Zheng",
      "Z. Zhou",
      "Y. Zhu",
      "X. Zhuang"
    ],
    "published": "2025-09-17T14:50:50Z",
    "updated": "2025-09-17T14:50:50Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.13937v1",
    "url": "https://arxiv.org/abs/2509.13937v1",
    "pdf_url": "https://arxiv.org/pdf/2509.13937v1.pdf",
    "title": "Generating 10 GW-class isolated zeptosecond x-ray bursts through   bootstrapping two plasma-based accelerator stages",
    "abstract": "A method is proposed to generate coherent, intense zeptosecond x-ray pulses by using the electron beam produced by a laser wakefield accelerator (LWFA) stage as the driver for a beam driven plasma wakefield accelerator (PWFA) stage. The LWFA injector stage requires a readily available 100 TW laser driver to produce a GeV class self-injected electron beam. This beam is focused and used as the driver in a PWFA stage that utilizes a solid-density plasma with a modulated density downramp. The concept is shown to be capable of producing an ultra-short electron beam with unprecedented density ($10^{26}~\\mathrm{cm^{-3}}$) and brightness ($ 10^{24}~\\ampere/\\meter^2/\\radian ^2$), that is also pre-bunched on 0.1 Angstrom scales. By colliding this pre-bunched extreme beam with an optical undulator, an intense zeptosecond pulse can be emitted if the spatially focusing region is matched with the lasing region of the beam. Multi-dimensional particle-in-cell simulations are performed of the entire concept to demonstrate that an isolated 10 GW-class zeptosecond pulse with a full-width-half-maximum duration of 700 zs can be generated in a tapered laser pulse. Such an intense zeptosecond pulse generation scheme may provide an essential probe for nuclear physics and quantum electrodynamics processes.",
    "authors": [
      "Qianyi Ma",
      "Yuhui Xia",
      "Zhenan Wang",
      "Yuekai Chen",
      "Letian Liu",
      "Zhiyan Yang",
      "Chao Feng",
      "Xinlu Xu",
      "Xueqing Yan",
      "Chan Joshi",
      "Warren B. Mori"
    ],
    "published": "2025-09-17T13:06:25Z",
    "updated": "2025-09-17T13:06:25Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2506.02832v2",
    "url": "https://arxiv.org/abs/2506.02832v2",
    "pdf_url": "https://arxiv.org/pdf/2506.02832v2.pdf",
    "title": "Testing strong-field QED with the avalanche precursor",
    "abstract": "A two-beam high-power laser facility is essential for the study of one of the most captivating phenomena predicted by strong-field quantum electrodynamics (QED) and yet unobserved experimentally: the avalanche-type cascade. In such a cascade, the energy of intense laser light can be efficiently transformed into high-energy radiation and electron-positron pairs. The future 50-petawatt-scale laser facility NSF OPAL will provide unique opportunities for studying such strong-field QED effects, as it is designed to deliver two ultra-intense, tightly focused laser pulses onto the interaction point. In this work, we investigate the potential of such a facility for studying elementary particle and plasma dynamics deeply in the quantum radiation-dominated regime, and the generation of QED avalanches. With 3D particle-in-cell simulations, we demonstrate that QED avalanche precursors can be reliably triggered under realistic laser parameters and layout (namely, focusing $f/2$, tilted optical axes, and non-ideal co-pointing) with the anticipated capabilities of NSF OPAL. We demonstrate that seed electrons can be efficiently injected into the laser focus by using targets of three types: a gas of heavy atoms, an overcritical plasma, and a thin foil. A strong positron and high-energy photon signal is generated in all cases. The cascade properties can be identified from the final particle distributions, which have a clear directional pattern. At increasing laser field intensity, such distributions provide signatures of the transition, first, to the radiation-dominated interaction regime, and then to a QED avalanche. Our findings can also be used for designing related future experiments.",
    "authors": [
      "A. A. Mironov",
      "S. S. Bulanov",
      "A. Di Piazza",
      "M. Grech",
      "L. Lancia",
      "S. Meuren",
      "J. Palastro",
      "C. Riconda",
      "H. G. Rinderknecht",
      "P. Tzeferacos",
      "G. Gregori"
    ],
    "published": "2025-06-03T13:00:14Z",
    "updated": "2025-09-17T13:01:09Z",
    "categories": [
      "physics.plasm-ph",
      "hep-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1063/5.0283438"
  },
  {
    "arxiv_id": "2412.19859v2",
    "url": "https://arxiv.org/abs/2412.19859v2",
    "pdf_url": "https://arxiv.org/pdf/2412.19859v2.pdf",
    "title": "Statistical research on determining sensitivity of neutrinoless double   beta decays",
    "abstract": "The determination of experimental sensitivity is a key step in the search for neutrinoless double beta decay ($0\\nu\\beta\\beta$), providing a quantitative benchmark for detector design. Two commonly used statistical approaches are the counting method, which estimates sensitivity from the number of events in a predefined region of interest (RoI), and the fitting method, which extracts the signal contribution by fitting the full energy spectrum. In this work, we investigate both discovery sensitivity and exclusion sensitivity within these two approaches. Through statistical derivation and simulation verification, we show that the relative performance of the methods depends on both energy resolution and exposure, while at higher exposures the fitting method consistently yields more stringent sensitivity. These results provide guidance for selecting the optimal statistical method in future $0\\nu\\beta\\beta$ experiments.",
    "authors": [
      "Haoyang Fu",
      "Wentai Luo",
      "Xiangpan Ji",
      "Shaomin Chen"
    ],
    "published": "2024-12-26T03:45:15Z",
    "updated": "2025-09-17T09:27:22Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.13847v1",
    "url": "https://arxiv.org/abs/2509.13847v1",
    "pdf_url": "https://arxiv.org/pdf/2509.13847v1.pdf",
    "title": "Measurement of radiant spectrum for excess heat generation in NiCu and   Ni thin film during hydrogen gas desorption",
    "abstract": "Heat production in Ni-based thin films interacting with hydrogen gas was studied using a radiation calorimeter equipped with a composite photon-detector system. Measurements were performed on pure Ni foil and NiCu composite thin films. Electromagnetic radiation emitted from samples heated to approximately 1100 K in vacuum was recorded over the energy range of 0.05 - 2.5 eV. In this study,detailed spectra were obtained, particularly in the low-energy region below 0.5 eV. The peak of the thermal radiation spectrum was observed around 0.2 eV, deviating from that expected for simple graybody radiation. Spectral variations depending on the presence or absence of hydrogen differed between the NiCu and pure Ni samples. The total radiated energy was determined directly from the measured radiation power, without relying on radiation models. The excess heat generated in the NiCu sample was estimated to be approximately 1.1 W. A comparable but slightly smaller excess heat generation was also observed in Ni. Long-term measurements of the NiCu sample demonstrated sustained excess heat production for at least 215 hours, with a decay time exceeding 2000 hours.",
    "authors": [
      "J. Kasagi",
      "T. Itoh",
      "Y. Shibasaki",
      "Y. Iwamura"
    ],
    "published": "2025-09-17T09:24:15Z",
    "updated": "2025-09-17T09:24:15Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2509.13831v1",
    "url": "https://arxiv.org/abs/2509.13831v1",
    "pdf_url": "https://arxiv.org/pdf/2509.13831v1.pdf",
    "title": "Signal Processing and Machine Learning Algorithms for Precise Timing   with PICOSEC Micromegas Detectors",
    "abstract": "High particle rates in current and future experiments make pile-up phenomena a critical issue for extracting useful information. In this context, timing can be important as the 4$^{\\mathrm{th}}$ dimension parameter for triggering or event reconstruction. The PICOSEC-Micromegas detector has been shown to offer precise timing of the order of tens of\\,ps. In this work, novel signal processing algorithms are being developed and evaluated to demonstrate the technology's ability for online precise timing. We propose, an algorithm based on Artificial Neural Networks (ANN). This algorithm uses a model to train the ANN. The performance of the different algorithms is evaluated using experimental data, resulting in a timing resolution of 18.3 $\\pm$ 0.6\\,ps, comparable to the standard analysis based on the Constant Fraction Discrimination technique. Additionally, an alternative algorithm using the charge of the pulse exceeding a threshold as a parameter to correct for systematic effects is reported.",
    "authors": [
      "A. Kallitsopoulou",
      "I. Maniatis",
      "I. Manthos",
      "T. Papaevangelou",
      "L. Sohl",
      "A. Tsiamis",
      "S. E. Tzamarias"
    ],
    "published": "2025-09-17T08:56:21Z",
    "updated": "2025-09-17T08:56:21Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2508.15605v2",
    "url": "https://arxiv.org/abs/2508.15605v2",
    "pdf_url": "https://arxiv.org/pdf/2508.15605v2.pdf",
    "title": "Monochromatic Cherenkov diffraction radiation from continuous coupling   of an electron beam to a thin dielectric slab waveguide",
    "abstract": "A scheme for generation of monochromatic Cherenkov radiation in a thin dielectric layer is proposed. The electrons travel in vacuum parallel to a dielectric, exciting a single synchronous electromagnetic waveguide mode. The proposed scheme is studied quantitatively for near-infrared radiation in silicon induced by a 100-keV electron beam, using time-domain and frequency-domain numerical simulations, with material absorption and dispersion taken into account. This method of radiation generation can be scaled from ultraviolet to terahertz radiation by changing the thickness of the dielectric layer and choosing a material with low loss at the desired wavelength. Comparison with conventional Cherenkov Radiation and Cherenkov Diffraction Radiation is also presented.",
    "authors": [
      "Andrzej Szczepkowicz",
      "Po-Wei Kuo",
      "Yen-Cheh Huang"
    ],
    "published": "2025-08-21T14:30:16Z",
    "updated": "2025-09-17T08:54:44Z",
    "categories": [
      "physics.optics",
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2509.13668v1",
    "url": "https://arxiv.org/abs/2509.13668v1",
    "pdf_url": "https://arxiv.org/pdf/2509.13668v1.pdf",
    "title": "Phase Transition Dynamics Induced by Strong Radio-Frequency Fields in   ReBCO High Temperature Superconductors",
    "abstract": "Probing the dynamics of superconductor phase transitions induced by strong electromagnetic fields is vital to designing high power devices leveraging these materials. The development of high temperature superconductors (HTS) is particularly interesting due to critical temperatures ($T_c$) approaching 90 K, the ability to support high current densities, and their ability to operate in strong static magnetic fields. This work aims to determine the transition dynamics of these materials at radio-frequencies (rf) in the microwave range where they have enormous potential for new applications ranging from particle accelerators to dark matter searches. We have tested two types of coatings formed from rare earth barium copper oxide (REBCO): a film deposited by electron-beam physical vapor deposition, and HTS conductor tapes soldered to a copper substrate with exposed REBCO surfaces. Testing was performed via a hemispherical transverse-electric mode cavity that maximizes the surface rf magnetic field and minimizes the surface electric field on a 2-inch diameter sample. We report on steady-state measurements at low rf power, as well as fully time-resolved transition dynamics on the microsecond timescale seen for the first time with strong surface rf fields.",
    "authors": [
      "Ankur Dhar",
      "Mitchell E. Schneider",
      "Emilio A. Nanni",
      "Jessica Golm",
      "Patrick Krkotić",
      "Walter Wuensch",
      "Sergio Calatroni",
      "Neil Lamas",
      "Teresa Puig",
      "Joffre Gutierrez"
    ],
    "published": "2025-09-17T03:42:51Z",
    "updated": "2025-09-17T03:42:51Z",
    "categories": [
      "physics.acc-ph",
      "cond-mat.supr-con"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.07500v2",
    "url": "https://arxiv.org/abs/2508.07500v2",
    "pdf_url": "https://arxiv.org/pdf/2508.07500v2.pdf",
    "title": "Ionization rate vs. laser intensity determined from ion count vs. peak   intensity due to neutral gas exposure to an 800 nm ultrashort pulsed laser",
    "abstract": "The optical cycle-averaged ionization rate of Ar, O$_{2}$, and N$_{2}$ vs. local instantaneous laser intensity $I$ for linear polarized $800$ nm light is determined up to approx. $300$ TW/cm$^{2}$ by numerically inverting published time-of-flight ion spectrometer data. The published Ar$^{+}$ collection efficiency of the microchannel plate (MCP) at the end of the spectrometer and its $I_{0}$ scale are recalibrated by fitting it to its high $I_{0}$ solution. The relative collection efficiencies of the other species are determined by published MCP cathode data. Results for O$_2$ are consistent with a reevaluation of published data used to determine its cross section $\\sigma_8$ in the multiphoton (low $I$) regime.",
    "authors": [
      "Edward L. Ruden"
    ],
    "published": "2025-08-10T22:26:18Z",
    "updated": "2025-09-17T00:39:43Z",
    "categories": [
      "physics.atom-ph",
      "physics.optics",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.atom-ph"
  }
]