{
  "arxiv_id": "2503.14005v2",
  "url": "https://arxiv.org/abs/2503.14005v2",
  "pdf_url": "https://arxiv.org/pdf/2503.14005v2.pdf",
  "title": "Flexible BiSel/NiO-based X-ray synapses bridging the functions of detection and memory",
  "abstract": "Currently, the X-ray detectors are widely used in medical imaging, industrial inspection, aerospace, and other fields, as the market demand for high-efficiency, flexible, and low-power detectors is increased. Although the traditional inorganic X-ray detection materials have achieved great success and effectiveness, they have their own limitations and let alone flexibility/bendability and memory function. In this study, we present the design of a BiSeI/NiO-based X-ray synaptic detector and its application in the simulation of biological synaptic processes. Herein, the BiSeI, a quasi-1D inorganic semiconductor, stands out as an ideal choice for the X-ray detectors, especially for flexible and portable devices due to its large atomic number, large photoelectric absorption coefficient, and mechanical plasticity. Meanwhile, the NiO-based materials provide the memory function required for the intelligent detection systems. Moreover, our devices offer notable advantages in terms of low power consumption, compared with traditional X-ray detectors. The BiSeI/NiO detectors demonstrate advanced features with an ultrahigh sensitivity, an ultralow detection limit, and include the paired-pulse facilitation (PPF) and the transition from short- to long-term memory, maintaining the functionality on flexible substrates. This design represents a significant step toward the development of intelligent and flexible X-ray detectors.",
  "authors": [
    "Qiao Wang",
    "Pengfei Li",
    "Yushou Song",
    "Jalu Li",
    "Haiying Xiao",
    "Yuqing Wang",
    "Guoliang Ma",
    "Hsu-Sheng Tsai",
    "Ping-An Hu"
  ],
  "published": "2025-03-18T08:10:50Z",
  "updated": "2025-12-06T01:41:51Z",
  "categories": [
    "physics.ins-det",
    "cond-mat.mtrl-sci",
    "physics.optics"
  ],
  "primary_category": "physics.ins-det"
}