{
  "arxiv_id": "2505.09700v2",
  "url": "https://arxiv.org/abs/2505.09700v2",
  "pdf_url": "https://arxiv.org/pdf/2505.09700v2.pdf",
  "title": "Turbulence and Magnetic Reconnection in Relativistic Multispecies Plasmas",
  "abstract": "Simulations of relativistic plasmas traditionally focus on the dynamics of two-species mixtures of charged particles under the influence of external magnetic fields and those generated by particle currents. However, the extreme conditions of astrophysical plasmas near compact objects such as black holes and neutron stars are often characterized by mixtures of electrons, protons, and positrons, whose dynamics can differ significantly because of the considerable mass contrast. We present the first two-dimensional particle-in-cell simulations of relativistic turbulence and magnetic reconnection in a three-species plasma, varying the relative abundance of electrons, protons, and positrons while employing realistic mass ratios to achieve unprecedented accuracy. We find that turbulence leads to the formation of magnetic islands, current sheets, and plasmoids. Reconnection occurs between these structures, with plasma composition playing a key role in determining the number of reconnection sites and their energy-conversion efficiency. In particular, as the proton fraction increases, very small-scale features of the turbulence are washed out, while global dissipative effects are amplified. Finally, using a novel generalization of Ohm's law for a relativistic multi-species plasma, we find that the reconnection rate is primarily governed by the electric fields associated to the divergence of the positron and electron pressure tensors. These results provide new insights into dissipation and particle acceleration in turbulent relativistic plasmas, such as those near black holes and neutron stars, and can be used to interpret their high-energy emission and phenomenology.",
  "authors": [
    "Mario Imbrogno",
    "Claudio Meringolo",
    "Alejandro Cruz-Osorio",
    "Luciano Rezzolla",
    "Benoît Cerutti",
    "Sergio Servidio"
  ],
  "published": "2025-05-14T18:02:34Z",
  "updated": "2025-12-05T11:20:22Z",
  "categories": [
    "physics.plasm-ph",
    "astro-ph.GA",
    "astro-ph.HE",
    "gr-qc"
  ],
  "primary_category": "physics.plasm-ph",
  "doi": "10.3847/2041-8213/adfb4c"
}