{
  "arxiv_id": "2512.06053v1",
  "url": "https://arxiv.org/abs/2512.06053v1",
  "pdf_url": "https://arxiv.org/pdf/2512.06053v1.pdf",
  "title": "Ferromagnetic Phase Transition of DPPH Induced by a Magic Angle Helical Magnetic Field",
  "abstract": "We report the results and unique instrument configuration of a novel experiment in which we successfully transitioned a DPPH sample from its natural paramagnetic state and essentially a non-magnetic material to a ferromagnetic state at room temperature. This was achieved using a specifically applied helical flux magnetic field. The DPPH sample (2,2-diphenyl-1-picrylhydrazyl) remained ferromagnetic for at least one hour after the experiment, indicating that a transformation in the material was induced by the external field rather than being merely a temporary magnetic phase transition observed only during the experiment. The external magnetic field used had a helical pitch angle of approximately $54.7°$, known mathematically as the Magic Angle, relative to the +z-axis, which is aligned with the normal S to N external field's magnetic moment vector. Based on the phenomenology of the experiment, we infer that this specific magic angle corresponding to the known quantization precession spin angle of free electrons under a homogeneous straight flux magnetic field potentially enhances the percentage of unpaired valence electrons within the DPPH material, allowing them to align in parallel with the applied external field. Typically, in paramagnetic materials, the distribution of unpaired electrons' quantum spins relative to an external field is nearly random, showing roughly a 50% chance of either parallel or antiparallel alignment. Only a slight majority preference exists in one alignment direction due to the Boltzmann thermal distribution, which contributes to the paramagnetic nature of these materials. In our measurements, we found that the induced ferromagnetism of the DPPH sample resulted in an abnormal thousand-fold decimal value increase in relative magnetic permeability at $μ{\\approx}1.4$, compared to its typical paramagnetic value of $1.0001$ for this material.",
  "authors": [
    "Emmanouil Markoulakis",
    "John Chatzakis",
    "Antonios Konstantaras",
    "Iraklis Rigakis",
    "Emmanuel Antonidakis"
  ],
  "published": "2025-12-05T12:04:28Z",
  "updated": "2025-12-05T12:04:28Z",
  "categories": [
    "cond-mat.mtrl-sci",
    "physics.app-ph",
    "physics.ins-det",
    "quant-ph"
  ],
  "primary_category": "cond-mat.mtrl-sci"
}