{
  "arxiv_id": "2512.05709v1",
  "url": "https://arxiv.org/abs/2512.05709v1",
  "pdf_url": "https://arxiv.org/pdf/2512.05709v1.pdf",
  "title": "Modeling the effect of MHD activity on runaway electron generation during SPARC disruptions",
  "abstract": "Magnetohydrodynamic (MHD) instabilities and runaway electrons (REs) interact in several ways, making it important to self-consistently model these interactions for accurate predictions of RE generation and the design of mitigation strategies, such as massive gas injection (MGI). Using M3D-C1 - an extended MHD code with a RE fluid model - we investigate the effects of 3-D nonlinear MHD activity, material injection, and 2-D axisymmetric vertical displacement events (VDEs) on RE evolution during disruptions on SPARC - a high-field, high-current tokamak designed to achieve a fusion gain Q > 1. Several cases, comprising different combinations of neon (Ne) and deuterium ($\\text{D}_2$) injection, are considered. Our results demonstrate key effects that arise from the self-consistent RE + MHD coupling, such as an initial increase in RE generation due to MHD instability growth, decreased saturation energies of the m/n = 1/1 mode driving sawteeth-like activity, RE losses in stochastic magnetic fields, and subsequent RE confinement and plateau formation due to re-healing of flux surfaces. Large RE plateaus (>5 MA) are obtained with Ne-only injection ($2-5 \\times 10^{21}$ atoms), while combined $\\text{D}_2$ + Ne injection ($2 \\times 10^{21}$ Ne atoms; $1.8 \\times 10^{22} \\, \\text{D}_2$ molecules) produces a lower RE current (<2 MA). With $\\text{D}_2$ + Ne injection, a post thermal quench \"cold\" VDE terminates the RE beam, preventing a steady plateau. These simulations couple REs, 3-D MHD instabilities, MGI, and axisymmetric VDEs for the first time in SPARC disruption simulations and represent a crucial step in understanding RE generation and mitigation in high-current devices like SPARC.",
  "authors": [
    "R Datta",
    "C Clauser",
    "N Ferraro",
    "R Sweeney",
    "R A Tinguely"
  ],
  "published": "2025-12-05T13:35:20Z",
  "updated": "2025-12-05T13:35:20Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}