{
  "arxiv_id": "2512.05434v1",
  "url": "https://arxiv.org/abs/2512.05434v1",
  "pdf_url": "https://arxiv.org/pdf/2512.05434v1.pdf",
  "title": "Comparison of filament properties in real-size GBS simulations and experiments of TCV-X21",
  "abstract": "A direct quantitative comparison of Scrape-Off Layer (SOL) filament properties from fluid turbulence simulations using the GBS code and from experiments on the TCV tokamak is performed within the TCV-X21 validation case. This comparison is made possible by extending the open TCV-X21 dataset with 2D turbulence measurements obtained with Gas Puff Imaging (GPI), providing critical information on the size, velocity, and other key characteristics of turbulent filaments at the outboard midplane and in the divertor region. For the comparison, GBS simulations of TCV-X21 are analyzed using a dedicated synthetic GPI diagnostic that models the neutral helium-plasma interaction and emission processes and accounts for line-integration effects. Poloidal and radial filament velocities are found to be in good agreement between simulations and experiments, while the simulations overestimate the filament radial and poloidal sizes and underestimate the relative fluctuation levels. The simulations further indicate that filaments in the SOL are predominantly represented by density perturbations rather than temperature perturbations, consistent with previous assumptions in experimental analyses of cross-field turbulent transport from GPI data. The poloidal velocity direction of the filaments agrees with the time-averaged $\\boldsymbol{E}\\times\\boldsymbol{B}$ direction at the outboard midplane and X-point region, but not in the divertor leg. Possible explanations are proposed and discussed, highlighting the influence of the instantaneous $\\boldsymbol{E}\\times\\boldsymbol{B}$ velocity components in both poloidal and radial directions. This study provides new insights into turbulent filament behavior and contributes to guiding future efforts to improve first-principles simulations of the boundary plasma.",
  "authors": [
    "Y. Wang",
    "C. Wüthrich",
    "C. Theiler",
    "S. García Herreros",
    "D. S. Oliveira",
    "D. Mancini",
    "T. Golfinopoulos",
    "P. Ricci",
    "T. Body",
    "the TCV team"
  ],
  "published": "2025-12-05T05:18:23Z",
  "updated": "2025-12-05T05:18:23Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}