{
  "arxiv_id": "2512.06507v1",
  "url": "https://arxiv.org/abs/2512.06507v1",
  "pdf_url": "https://arxiv.org/pdf/2512.06507v1.pdf",
  "title": "Observation of two nuclear recoil peaks induced by neutron capture on Al2O3",
  "abstract": "We report the observation of two nuclear recoil peaks induced by neutron capture on aluminum in a cryogenic Al$_2$O$_3$ detector developed by the NUCLEUS collaboration for the detection of reactor neutrinos via coherent elastic neutrino-nucleus (CEvNS) process. Data collected at the Technical University of Munich in 2024 with a $^{252}$Cf source reveal a main recoil line at 1145 eV from single-$γ$ de-excitation of $^{28}$Al and a newly observed structure near 575 eV originating from several two-$γ$ cascades. The latter constitutes the first direct measurement of a nuclear recoil line induced by multi-$γ$ cascades. It is predicted by our simulations when the recoiling nucleus has time to stop before the emission of the next $γ$-ray in the cascade. These results demonstrate the potential performance of the CRAB (Calibration Recoil for Accurate Bolometry) method for in situ nuclear recoil calibration and highlight the importance of accurately modeling recoil stopping and nuclear de-excitation times in cryogenic detectors of CEvNS and dark matter interactions.",
  "authors": [
    "H. Abele",
    "P. Ajello",
    "B. Arnold",
    "E. Bossio",
    "J. Burkhart",
    "F. Cappella",
    "N. Casali",
    "R. Cerulli",
    "J-P. Crocombette",
    "G. del Castello",
    "M. del Gallo Roccagiovine",
    "P. de Marcillac",
    "S. Dorer",
    "C. Doutre",
    "A. Erhart",
    "S. Fichtinger",
    "M. Friedl",
    "C. Goupy",
    "D. Hauff",
    "E. Jericha",
    "M. Kaznacheeva",
    "H. Kluck",
    "T. Lasserre",
    "D. Lhuillier",
    "O. Litaize",
    "S. Marnieros",
    "R. Martin",
    "E. Namuth",
    "T. Ortmann",
    "L. Peters",
    "D. V. Poda",
    "F. Reindl",
    "W. Reindl",
    "J. Rothe",
    "N. Schermer",
    "J. Schieck",
    "S. Schönert",
    "C. Schwertner",
    "G. Soum-Sidikov",
    "R. Strauss",
    "R. Thalmeier",
    "L. Thulliez",
    "M. Vignati",
    "M. Vivier",
    "P. Wasser",
    "A. Wex"
  ],
  "published": "2025-12-06T17:37:10Z",
  "updated": "2025-12-06T17:37:10Z",
  "categories": [
    "physics.ins-det",
    "nucl-ex"
  ],
  "primary_category": "physics.ins-det"
}