{
  "arxiv_id": "2512.05678v1",
  "url": "https://arxiv.org/abs/2512.05678v1",
  "pdf_url": "https://arxiv.org/pdf/2512.05678v1.pdf",
  "title": "Fast electrostatic microinstability evaluation in arbitrary toroidal magnetic geometry using a variational approach",
  "abstract": "Small-scale turbulence originating from microinstabilities limits the energy confinement time in magnetic confinement fusion. Here we develop a semi-analytical dispersion relation based on lowest-order solutions to the gyrokinetic equations in an asymptotic expansion in the ratio of transit (bounce) frequency to the mode frequency for ions (electrons), capable of describing two common instabilities: the ion temperature gradient (ITG) mode and trapped-electron mode (TEM), in the electrostatic limit. The dispersion relation, which is valid in arbitrary toroidal geometry, takes into account resonances with the magnetic ion and bounce-averaged electron drifts, incorporates non-local effects along the magnetic field line, is valid for arbitrary sign of the growth rate and magnetic curvature, and is shown to satisfy a variational property. Several common approximation models are introduced for both the magnetic drift and finite Larmor radius (FLR) damping, with the Padé approximation for FLR effect in particular resulting in remarkable agreement with the baseline dispersion relation model at significantly reduced costs. The baseline model is verified by comparing solutions of the dispersion relation model to high-fidelity linear gyrokinetic simulations, where the exact eigenfunction of the electrostatic potential from simulations is used as a trial function, showing good quantitative agreement for ITGs and TEMs in (shaped) tokamaks as well as low-magnetic-shear stellarators.",
  "authors": [
    "M. C. L. Morren",
    "P. Mulholland",
    "J. H. E. Proll",
    "M. J. Pueschel",
    "L. Podavini",
    "D. D. Kiszkiel",
    "J. A. Schuurmans",
    "A. Zocco"
  ],
  "published": "2025-12-05T12:47:08Z",
  "updated": "2025-12-05T12:47:08Z",
  "categories": [
    "physics.plasm-ph"
  ],
  "primary_category": "physics.plasm-ph"
}