[
  {
    "arxiv_id": "2511.14782v3",
    "url": "https://arxiv.org/abs/2511.14782v3",
    "pdf_url": "https://arxiv.org/pdf/2511.14782v3.pdf",
    "title": "A synchronization-free one-way ranging observable for detecting and characterizing coherent orbital-period systematics in GRACE-FO laser ranging data",
    "abstract": "We present a synchronization-free differential observable for one-way inter-satellite laser ranging, designed to suppress first-order Doppler effects without requiring clock synchronization between spacecraft. The observable is constructed from successive pulse-interval differences, which isolate time-varying signatures while eliminating static and slowly varying biases. Applied to GRACE-FO Laser Ranging Interferometer (LRI) Level-1B data over four seasonal epochs in 2019, the method reveals a stable, spectrally narrow modulation at the orbital frequency. The amplitude and phase of the detected signature remain consistent across all datasets, demonstrating a deterministic, mission-internal origin. The detection is independently confirmed through synthetic-signal injection, shuffle-based significance testing, and cross-comparison with K-band ranging data. These results show that the proposed observable provides a sensitive diagnostic for identifying coherent orbital-period systematics that may remain hidden in conventional range-rate analysis. The method offers a pathway toward improved characterization of instrument and dynamical effects in current and future satellite gravity missions.",
    "authors": [
      "S. H. Wassegh"
    ],
    "published": "2025-11-08T20:02:41Z",
    "updated": "2025-12-07T09:30:27Z",
    "categories": [
      "gr-qc",
      "astro-ph.IM",
      "physics.data-an",
      "physics.ins-det"
    ],
    "primary_category": "gr-qc"
  },
  {
    "arxiv_id": "2512.06651v1",
    "url": "https://arxiv.org/abs/2512.06651v1",
    "pdf_url": "https://arxiv.org/pdf/2512.06651v1.pdf",
    "title": "A Capacitor Model of the Helical Deflector: Revisiting Shamaev's Proposal and the Model in the Book",
    "abstract": "A RF helical deflector is a type of electron and ion optics device that applies a time-dependent rotating transverse electric or magnetic field by means of time-dependent RF voltage applied on two opposite conducting helical structures (wires, ribbons or other) to deflect charged particles (a single, bunch or beam) in a circular or spiral path. It is a perspective direct timing system being concurrent for reaching picosecond time resolution, and have promise being excellent candidate for high precision time-of-flight detection. As a timing system, it converts the temporal structure of an electron beam into a spatial pattern -- particularly, an ellipse in the case of a single-frequency RF voltage and continuous electron beam.   I propose a capacitor model of a RF helical deflector and compare it with the existing model in the Book, interpret it and provide understanding of it. Furthermore, I analyze the latter finding analytical formulas for the applied electric field, for ellipse sizes (semi-axes) and rotation angle, lengths of the ellipse line corresponding to the duration of electron bunches or beams. The present article touches the topic of getting circle on resonance limit and the deflection sensitivity.",
    "authors": [
      "Hayk L. Gevorgyan"
    ],
    "published": "2025-12-07T04:27:08Z",
    "updated": "2025-12-07T04:27:08Z",
    "categories": [
      "physics.acc-ph",
      "physics.app-ph",
      "physics.class-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2501.04886v4",
    "url": "https://arxiv.org/abs/2501.04886v4",
    "pdf_url": "https://arxiv.org/pdf/2501.04886v4.pdf",
    "title": "Distributed network of smartphone sensors: a new tool for scientific field measurements",
    "abstract": "Smartphones sensors are now commonly used by a worldwide audience thanks to their availability, high connectivity, and versatility. Here, we present a methodology to use a collection of smartphones, namely a fleet, as a distributed network of time-synchronized mechanical sensors. We first present the mechanical tests we develop to evaluate the smartphone sensor accuracy. We then describe how to use efficiently a distributed network of smartphones as autonomous sensors. We use a combination of an Android application hosted on each phone (Gobannos), and a server application (Phonefleet) on a controlling host to perform the tasks in parallel remotely. We implement in particular a time synchronization protocol based on UDP communication. We achieved an accuracy of the smartphone clock synchronisation of 60 microseconds. Using two test cases in realistic outdoor conditions, we eventually prove the reliability of a smartphone fleet to measure mechanical wave measurements in field conditions.",
    "authors": [
      "J. Zhang",
      "N. Mokus",
      "J. Casoli",
      "A. Eddi",
      "S. Perrard"
    ],
    "published": "2025-01-08T23:53:22Z",
    "updated": "2025-12-07T00:15:07Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.06528v1",
    "url": "https://arxiv.org/abs/2512.06528v1",
    "pdf_url": "https://arxiv.org/pdf/2512.06528v1.pdf",
    "title": "Laser-written reconfigurable photonic integrated circuit directly coupled to a single-photon avalanche diode array",
    "abstract": "To date, most integrated quantum photonics experiments rely on single-photon detectors operating at cryogenic temperatures coupled to photonic integrated circuits (PICs) through single-mode optical fibers. This approach presents significant challenges due to the detection complexity, as cryogenic conditions hinder the development of scalable systems. In addition, going towards fully-integrated devices or, at least, removing the optical fibers would be also advantageous to develop compact and cost-efficient solutions featuring a high number of optical modes. This work reports on the direct coupling of a PIC, fabricated by femtosecond laser writing (FLW), and a silicon single-photon avalanche diode (SPAD) array, fabricated in a custom planar technology and compatible with the operation at room temperature. The effectiveness of this solution is shown by achieving perfect coupling and a system detection efficiency as high as 41.0% at a wavelength of 561 nm, which is the highest value reported to date among both heterogeneous/hybrid integrated and directly coupled systems. We also show the robustness of the coupling to misalignments, demonstrating that costly alignment procedures are not needed. Finally, we exploit the SPAD array to characterize a reconfigurable Mach-Zehnder interferometer, i.e., the basic building block of multimode reconfigurable PICs. This solution provides a new avenue to the design and implementation of quantum photonics experiments, especially effective when compact and cost-efficient systems are needed.",
    "authors": [
      "Giulio Gualandi",
      "Simone Atzeni",
      "Marco Gardina",
      "Antonino Caime",
      "Giacomo Corrielli",
      "Ivan Labanca",
      "Angelo Gulinatti",
      "Ivan Rech",
      "Roberto Osellame",
      "Giulia Acconcia",
      "Francesco Ceccarelli"
    ],
    "published": "2025-12-06T18:34:09Z",
    "updated": "2025-12-06T18:34:09Z",
    "categories": [
      "physics.optics",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "physics.optics",
    "doi": "10.1038/s41377-025-01854-6"
  },
  {
    "arxiv_id": "2512.06507v1",
    "url": "https://arxiv.org/abs/2512.06507v1",
    "pdf_url": "https://arxiv.org/pdf/2512.06507v1.pdf",
    "title": "Observation of two nuclear recoil peaks induced by neutron capture on Al2O3",
    "abstract": "We report the observation of two nuclear recoil peaks induced by neutron capture on aluminum in a cryogenic Al$_2$O$_3$ detector developed by the NUCLEUS collaboration for the detection of reactor neutrinos via coherent elastic neutrino-nucleus (CEvNS) process. Data collected at the Technical University of Munich in 2024 with a $^{252}$Cf source reveal a main recoil line at 1145 eV from single-$γ$ de-excitation of $^{28}$Al and a newly observed structure near 575 eV originating from several two-$γ$ cascades. The latter constitutes the first direct measurement of a nuclear recoil line induced by multi-$γ$ cascades. It is predicted by our simulations when the recoiling nucleus has time to stop before the emission of the next $γ$-ray in the cascade. These results demonstrate the potential performance of the CRAB (Calibration Recoil for Accurate Bolometry) method for in situ nuclear recoil calibration and highlight the importance of accurately modeling recoil stopping and nuclear de-excitation times in cryogenic detectors of CEvNS and dark matter interactions.",
    "authors": [
      "H. Abele",
      "P. Ajello",
      "B. Arnold",
      "E. Bossio",
      "J. Burkhart",
      "F. Cappella",
      "N. Casali",
      "R. Cerulli",
      "J-P. Crocombette",
      "G. del Castello",
      "M. del Gallo Roccagiovine",
      "P. de Marcillac",
      "S. Dorer",
      "C. Doutre",
      "A. Erhart",
      "S. Fichtinger",
      "M. Friedl",
      "C. Goupy",
      "D. Hauff",
      "E. Jericha",
      "M. Kaznacheeva",
      "H. Kluck",
      "T. Lasserre",
      "D. Lhuillier",
      "O. Litaize",
      "S. Marnieros",
      "R. Martin",
      "E. Namuth",
      "T. Ortmann",
      "L. Peters",
      "D. V. Poda",
      "F. Reindl",
      "W. Reindl",
      "J. Rothe",
      "N. Schermer",
      "J. Schieck",
      "S. Schönert",
      "C. Schwertner",
      "G. Soum-Sidikov",
      "R. Strauss",
      "R. Thalmeier",
      "L. Thulliez",
      "M. Vignati",
      "M. Vivier",
      "P. Wasser",
      "A. Wex"
    ],
    "published": "2025-12-06T17:37:10Z",
    "updated": "2025-12-06T17:37:10Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.06397v1",
    "url": "https://arxiv.org/abs/2512.06397v1",
    "pdf_url": "https://arxiv.org/pdf/2512.06397v1.pdf",
    "title": "Measuring the buried interphase between solid electrolytes and lithium metal using neutrons",
    "abstract": "Interfaces are the key to next generation high energy batteries including solid state Li metal batteries. In solid state batteries, the buried nature of solid solid electrolyte electrode interfaces makes studying them difficult. Neutrons have significant potential to non destructively probe these buried solid solid interfaces. This work presents a comparative study using both neutron depth profiling (NDP) and neutron reflectometry (NR) to study a model lithium metal-lithium phosphorus oxynitride (LiPON) solid electrolyte system. In the NDP data, no distinct interphase is observed at the interface. NR shows a difference between electrodeposited, and vapor deposited LiPON -Li interfaces but finds both are gradient interphases that are less than 30 nm thick. Additional simulations of the LiPON-Li2O-Li system demonstrate that NDP has an excellent resolution in the 50 nm-1 mm regime while NR has an ideal resolution from 0.1 - 200 nm with different sample requirements. Together NDP and NR can provide a complementary understanding of interfaces between Li metal and solid electrolytes across relevant length scales.",
    "authors": [
      "Andrew S. Westover",
      "Katie L. Browning",
      "Antonino Cannavo",
      "Ralph Gilles",
      "Jiri Vacik",
      "James F. Browning",
      "Neelima Paul",
      "Giovanni Ceccio",
      "Vasyl Lavrentiev"
    ],
    "published": "2025-12-06T10:59:46Z",
    "updated": "2025-12-06T10:59:46Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "doi": "10.1039/d5ta05758b"
  },
  {
    "arxiv_id": "2503.14005v2",
    "url": "https://arxiv.org/abs/2503.14005v2",
    "pdf_url": "https://arxiv.org/pdf/2503.14005v2.pdf",
    "title": "Flexible BiSel/NiO-based X-ray synapses bridging the functions of detection and memory",
    "abstract": "Currently, the X-ray detectors are widely used in medical imaging, industrial inspection, aerospace, and other fields, as the market demand for high-efficiency, flexible, and low-power detectors is increased. Although the traditional inorganic X-ray detection materials have achieved great success and effectiveness, they have their own limitations and let alone flexibility/bendability and memory function. In this study, we present the design of a BiSeI/NiO-based X-ray synaptic detector and its application in the simulation of biological synaptic processes. Herein, the BiSeI, a quasi-1D inorganic semiconductor, stands out as an ideal choice for the X-ray detectors, especially for flexible and portable devices due to its large atomic number, large photoelectric absorption coefficient, and mechanical plasticity. Meanwhile, the NiO-based materials provide the memory function required for the intelligent detection systems. Moreover, our devices offer notable advantages in terms of low power consumption, compared with traditional X-ray detectors. The BiSeI/NiO detectors demonstrate advanced features with an ultrahigh sensitivity, an ultralow detection limit, and include the paired-pulse facilitation (PPF) and the transition from short- to long-term memory, maintaining the functionality on flexible substrates. This design represents a significant step toward the development of intelligent and flexible X-ray detectors.",
    "authors": [
      "Qiao Wang",
      "Pengfei Li",
      "Yushou Song",
      "Jalu Li",
      "Haiying Xiao",
      "Yuqing Wang",
      "Guoliang Ma",
      "Hsu-Sheng Tsai",
      "Ping-An Hu"
    ],
    "published": "2025-03-18T08:10:50Z",
    "updated": "2025-12-06T01:41:51Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mtrl-sci",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.06217v1",
    "url": "https://arxiv.org/abs/2512.06217v1",
    "pdf_url": "https://arxiv.org/pdf/2512.06217v1.pdf",
    "title": "Filters and Redundancies: An Exploration of Novel Coherent Noise Filters for High Energy Physics",
    "abstract": "This work presents radiation-tolerant implementations for the SALSA front-end readout ASIC through redundancy methods applied to two median-finding algorithms designed for coherent noise suppression. Bit-wise Median Finder (BWMF) and Combinatorial Sum Median Finder (CSMF) were implemented in TSMC \\SI{65}{\\nano\\meter} and evaluated in terms of area, power, and latency. Three redundancy techniques were applied in this work to compare their impact: simple TMR, full TMR, and temporal TMR (TTMR). The simple and full TMR approach was applied in both algorithms to establish comparisons and TTMR was applied to CSMF as an improvement. The results indicate that the BWMF achieves efficient performance in terms of area and power under the simple TMR scheme, but exhibits significantly higher power consumption when using the more robust full TMR approach. The TTMR technique, in turn, offers reliable fault tolerance while maintaining a feasible balance between area and power.",
    "authors": [
      "Felipe Costa",
      "Nicolas Guimarães",
      "Guilherme Milani",
      "Bruno Sanches",
      "Irakli Mandjavidze",
      "Damien Neyret",
      "Wilhelmus Van Noije"
    ],
    "published": "2025-12-05T23:47:25Z",
    "updated": "2025-12-05T23:47:25Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.19817v2",
    "url": "https://arxiv.org/abs/2511.19817v2",
    "pdf_url": "https://arxiv.org/pdf/2511.19817v2.pdf",
    "title": "Calibration Plan for the SBC 10-kg Liquid Argon Detector with 100 eV Target Threshold",
    "abstract": "The Scintillating Bubble Chamber (SBC) Collaboration is designing a new generation of low background, noble liquid bubble chamber experiments with sub-keV nuclear recoil threshold. These experiments combine the electronic recoil blindness of a bubble chamber with the energy resolution of noble liquid scintillation, and maintain electron recoil discrimination at higher degrees of superheat (lower nuclear recoil thresholds) than Freon-based bubble chambers. A 10-kg liquid argon bubble chamber has the potential to set world leading limits on the dark matter nucleon cross-section for $O(\\mathrm{GeV}/c^{2})$ masses, and to perform a high statistics coherent elastic neutrino nuclear scattering measurement with reactor neutrinos. This work presents a detailed calibration plan to measure the detector response of these experiments, combining photoneutron scattering with two new techniques to induce sub-keV nuclear recoils: nuclear Thomson scattering and thermal neutron capture.",
    "authors": [
      "E. Alfonso-Pita",
      "D. Baxter",
      "E. Behnke",
      "J. Corbett",
      "M. Crisler",
      "C. E. Dahl",
      "K. Dering",
      "A. de St. Croix",
      "D. Durnford",
      "P. Giampa",
      "J. Hall",
      "O. Harris",
      "H. Hawley-Herrera",
      "L. Joseph",
      "A. Kucich",
      "N. Lamb",
      "M. Laurin",
      "I. Levine",
      "W. H. Lippincott",
      "B. Mitra",
      "R. Neilson",
      "O. Nicholson",
      "M. -C. Piro",
      "G. Putnam",
      "D. Pyda",
      "Z. Sheng",
      "G. Sweeney",
      "O. Valdés-Martínez",
      "E. Vázquez-Jáuregui",
      "S. Westerdale",
      "T. J. Whitis",
      "S. Windle",
      "A. Wright",
      "E. Wyman",
      "R. Zhang"
    ],
    "published": "2025-11-25T01:14:36Z",
    "updated": "2025-12-05T19:59:50Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.06061v1",
    "url": "https://arxiv.org/abs/2512.06061v1",
    "pdf_url": "https://arxiv.org/pdf/2512.06061v1.pdf",
    "title": "GPU acceleration of optical photon propagation in low photon yield applications: Opticks for the Electron Ion Collider",
    "abstract": "The bulk of time spent in the simulation of Cherenkov and other scintillation detectors is spent on optical-photon transport, i.e. ray tracing, a task that GPUs are uniquely qualified to perform. We present EIC-Opticks, a fork of Opticks, which uses event aggregation to drastically accelerate photon transport simulation for low-to-moderate photon yield experiments. During the full Geant4 Monte Carlo simulation of a given detector, optical photon simulation is performed on GPU(s) using the NVIDIA OptiX framework. We validate this approach using the ePIC pfRICH detector. We find GPU and CPU simulations in excellent agreement. For $5\\times 10^4$ electrons with a momentum of $p=5~\\mathrm{MeV}/c$ in the test case of the pfRICH detector, EIC-Opticks shows an order-of-magnitude speedup over multi-threaded Geant4, and a factor of up to 161$\\pm$3 over single-threaded execution. In the case of low-to-moderate applications event aggregation reduces the per-photon simulation time from $\\sim60\\,μ\\mathrm{s}$ for single events to $\\sim20\\,\\mathrm{ns}$ with batching, a factor of $\\sim3000$. In order to make EIC-Opticks easily installable, we authored a Spack package that makes it possible to install it with a single command. Additionally, a Docker container is provided for users with EIC-Opticks installed. EIC-Opticks provides guardrails for common pitfalls (e.g. nested volume conversion, ray tracing setting optimization).",
    "authors": [
      "Gabor Galgoczi",
      "Kolja Kauder",
      "Maxim Potekhin",
      "Sakib Rahman",
      "Dmitri Smirnov",
      "Torre Wenaus"
    ],
    "published": "2025-12-05T18:21:33Z",
    "updated": "2025-12-05T18:21:33Z",
    "categories": [
      "physics.ins-det",
      "hep-ex",
      "nucl-ex",
      "physics.acc-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.05921v1",
    "url": "https://arxiv.org/abs/2512.05921v1",
    "pdf_url": "https://arxiv.org/pdf/2512.05921v1.pdf",
    "title": "Thermodynamics of Shear Equilibration During Magnetic Reconnection Onset in Mixed-Equilibrium Current Sheets",
    "abstract": "Magnetic shear across the polarity inversion line (PIL) plays an important role in the explosive nature of reconnection onset and in the equilibration of current sheets, acting as a source of free energy that can enhance or inhibit the onset process under certain conditions. In this study, we use a 2D PIC simulation to examine the local interaction between the reconnection guide field and thermodynamic variables during reconnection onset in a region of initially depleted thermal energy and enhanced magnetic energy in a large guide field background. We identify critical stages of the equilibration process, characterize intervals based on whether the pressure evolution is driven by changes in density or temperature, and discuss what these intervals imply about the evolution of local heat and work density. Finally, we examine power densities associated with electromagnetic field time evolution and electromagnetic energy transfer and compare to those related to thermodynamic changes.",
    "authors": [
      "Dominic Payne",
      "Marc Swisdak",
      "James Drake",
      "Tak Chu Li"
    ],
    "published": "2025-12-05T17:59:09Z",
    "updated": "2025-12-05T17:59:09Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.05904v1",
    "url": "https://arxiv.org/abs/2512.05904v1",
    "pdf_url": "https://arxiv.org/pdf/2512.05904v1.pdf",
    "title": "Transverse envelope dynamics of beam slices in a uniform charged ellipsoidal model of the plasma bubble regime",
    "abstract": "We consider a pair of driver/witness electron bunches propagating in an ionized gas background a configuration similar to the one produced in a capillary discharge where a plasma oscillation has been excited by a driving pulse. We assume as in the plasma nonlinear regime that the plasma electrons behind the driver are completely expelled and an ellipsoidal cavity filled with ions only is formed. The fields are linear in both longitudinal and transverse directions, at least in the region of interest for particle acceleration, as the one produced by a uniform ion distribution within a uniformly charged ellipsoidal volume. The fields produced by the ions and experienced by a witness electron beam are purely electrostatic, being the ions at rest in the laboratory frame on the time scale of interest and it can be represented with the field distribution produced by a 3D charged ellipsoidal. The energy spread and emittance degradation has been studied by slicing the bunch in an array of cylinders and solving envelope equations for each bunch slice. The properties of transverse envelope and emittance oscillations and energy spread degradation have been analyzed together with the related matching conditions for optimal transport and acceleration.",
    "authors": [
      "Abdul Mannan",
      "Alessio Del Dotto",
      "Massimo Ferrario"
    ],
    "published": "2025-12-05T17:37:11Z",
    "updated": "2025-12-05T17:37:11Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.05903v1",
    "url": "https://arxiv.org/abs/2512.05903v1",
    "pdf_url": "https://arxiv.org/pdf/2512.05903v1.pdf",
    "title": "Computer simulations of the Stark effect in the helium-beta complex of krypton in ICF conditions",
    "abstract": "There is an ongoing interest in using spectroscopy in inertial confinement fusion (ICF) experiments, where dopants such as krypton can provide vital information about the temperature and density of the imploding plasma. While the most advanced tools for calculating Stark profiles are computer simulation models (CSMs), their application to complex lineshapes under the extreme conditions of ICF experiments is computationally challenging. In this manuscript, we present results of several CSM realizations applied to the Stark shape of the krypton He-beta line and its satellites at ICF-relevant conditions (ne = 1e24 to 1e25 cm-3, Te = 3keV). We demonstrate that codes with the same underlying physics but different numerical approaches yield identical results and analyze the differences in the line profile caused by various physical effects.",
    "authors": [
      "G. Pérez-Callejo",
      "E. Stambulchik",
      "R. Florido",
      "M. A. Gigosos"
    ],
    "published": "2025-12-05T17:35:07Z",
    "updated": "2025-12-05T17:35:07Z",
    "categories": [
      "physics.plasm-ph",
      "physics.atom-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2511.15937v2",
    "url": "https://arxiv.org/abs/2511.15937v2",
    "pdf_url": "https://arxiv.org/pdf/2511.15937v2.pdf",
    "title": "Asymptotic-preserving semi-implicit finite volume scheme for Extended Magnetohydrodynamics",
    "abstract": "A Finite Volume (FV) scheme is developed for solving the extended magnetohydrodynamic (XMHD) equations, yielding accurate results in the ideal, resistive, and Hall MHD limits. This is accomplished by first re-writing the XMHD equations such that it allows the algorithm to retain the use of ideal MHD Riemann solvers and the constrained transport method to preserve divergence-free magnetic fields. Incorporation of electron inertia and displacement current introduces additional numerical stiffness which motivates a semi-implicit FV scheme that re-formulates the XMHD model as a relaxation system. The equations are then advanced in time using an explicit 2nd-order Runge-Kutta scheme with operator splitting applied to the implicit source term updates at each sub-stage. For additional numerical stability, a density-dependent slope limiter is implemented to increase flux diffusivity at low density regions where non-ideal effects become significant. The algorithm is subsequently implemented in a scalable adaptive mesh refinement (AMR) framework. As the new algorithm retains many aspects of the ideal MHD formulations, it asymptotes naturally to the ideal MHD limit. Moreover, it shows promising results at the resistive and Hall MHD limits. This is verified against reference test problems for ideal, resistive and Hall MHD.",
    "authors": [
      "Yi Han Toh",
      "Joshua Dolence",
      "Karthik Duraisamy"
    ],
    "published": "2025-11-20T00:02:46Z",
    "updated": "2025-12-05T17:11:35Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.05849v1",
    "url": "https://arxiv.org/abs/2512.05849v1",
    "pdf_url": "https://arxiv.org/pdf/2512.05849v1.pdf",
    "title": "Construction and characterization of a seven-chip GridPix X-ray detector for solar axion searches",
    "abstract": "In the scope of solar axion searches, detectors which are able to measure low energetic X-rays with high efficiency are required. For this purpose a detector based on the GridPix technology was built for the CAST experiment at CERN. The GridPix is a pixelised readout ASIC (Timepix) with a Micromegas-like gas amplification stage (grid) built photolithographically on top. In order to reduce the detector's background level, several hardware and software vetoes were implemented.   Hardware-wise, these vetoes consist of a ring of six GridPixes around a central GridPix, a readout of the induced grid signal, and two scintillators. On the software side, multiple approaches to distinguish between background events and X-ray photons are implemented. Here, also the hardware features, like the six surrounding GridPixes, are used.   The new detector was tested in a long ($3500\\,\\text{h}$) background data taking campaign. The performance of the new vetoes was evaluated. The detector performance itself, for low energetic X-rays, was also evaluated with a variable X-ray generator using eight different energies from 0 to $10\\,\\text{keV}$. The efficiency for very low energetic X-rays and the energy resolution was determined.",
    "authors": [
      "Klaus Desch",
      "Jochen Kaminski",
      "Christoph Krieger",
      "Tobias Schiffer",
      "Sebastian Schmidt"
    ],
    "published": "2025-12-05T16:23:11Z",
    "updated": "2025-12-05T16:23:11Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.05709v1",
    "url": "https://arxiv.org/abs/2512.05709v1",
    "pdf_url": "https://arxiv.org/pdf/2512.05709v1.pdf",
    "title": "Modeling the effect of MHD activity on runaway electron generation during SPARC disruptions",
    "abstract": "Magnetohydrodynamic (MHD) instabilities and runaway electrons (REs) interact in several ways, making it important to self-consistently model these interactions for accurate predictions of RE generation and the design of mitigation strategies, such as massive gas injection (MGI). Using M3D-C1 - an extended MHD code with a RE fluid model - we investigate the effects of 3-D nonlinear MHD activity, material injection, and 2-D axisymmetric vertical displacement events (VDEs) on RE evolution during disruptions on SPARC - a high-field, high-current tokamak designed to achieve a fusion gain Q > 1. Several cases, comprising different combinations of neon (Ne) and deuterium ($\\text{D}_2$) injection, are considered. Our results demonstrate key effects that arise from the self-consistent RE + MHD coupling, such as an initial increase in RE generation due to MHD instability growth, decreased saturation energies of the m/n = 1/1 mode driving sawteeth-like activity, RE losses in stochastic magnetic fields, and subsequent RE confinement and plateau formation due to re-healing of flux surfaces. Large RE plateaus (>5 MA) are obtained with Ne-only injection ($2-5 \\times 10^{21}$ atoms), while combined $\\text{D}_2$ + Ne injection ($2 \\times 10^{21}$ Ne atoms; $1.8 \\times 10^{22} \\, \\text{D}_2$ molecules) produces a lower RE current (<2 MA). With $\\text{D}_2$ + Ne injection, a post thermal quench \"cold\" VDE terminates the RE beam, preventing a steady plateau. These simulations couple REs, 3-D MHD instabilities, MGI, and axisymmetric VDEs for the first time in SPARC disruption simulations and represent a crucial step in understanding RE generation and mitigation in high-current devices like SPARC.",
    "authors": [
      "R Datta",
      "C Clauser",
      "N Ferraro",
      "R Sweeney",
      "R A Tinguely"
    ],
    "published": "2025-12-05T13:35:20Z",
    "updated": "2025-12-05T13:35:20Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.05678v1",
    "url": "https://arxiv.org/abs/2512.05678v1",
    "pdf_url": "https://arxiv.org/pdf/2512.05678v1.pdf",
    "title": "Fast electrostatic microinstability evaluation in arbitrary toroidal magnetic geometry using a variational approach",
    "abstract": "Small-scale turbulence originating from microinstabilities limits the energy confinement time in magnetic confinement fusion. Here we develop a semi-analytical dispersion relation based on lowest-order solutions to the gyrokinetic equations in an asymptotic expansion in the ratio of transit (bounce) frequency to the mode frequency for ions (electrons), capable of describing two common instabilities: the ion temperature gradient (ITG) mode and trapped-electron mode (TEM), in the electrostatic limit. The dispersion relation, which is valid in arbitrary toroidal geometry, takes into account resonances with the magnetic ion and bounce-averaged electron drifts, incorporates non-local effects along the magnetic field line, is valid for arbitrary sign of the growth rate and magnetic curvature, and is shown to satisfy a variational property. Several common approximation models are introduced for both the magnetic drift and finite Larmor radius (FLR) damping, with the Padé approximation for FLR effect in particular resulting in remarkable agreement with the baseline dispersion relation model at significantly reduced costs. The baseline model is verified by comparing solutions of the dispersion relation model to high-fidelity linear gyrokinetic simulations, where the exact eigenfunction of the electrostatic potential from simulations is used as a trial function, showing good quantitative agreement for ITGs and TEMs in (shaped) tokamaks as well as low-magnetic-shear stellarators.",
    "authors": [
      "M. C. L. Morren",
      "P. Mulholland",
      "J. H. E. Proll",
      "M. J. Pueschel",
      "L. Podavini",
      "D. D. Kiszkiel",
      "J. A. Schuurmans",
      "A. Zocco"
    ],
    "published": "2025-12-05T12:47:08Z",
    "updated": "2025-12-05T12:47:08Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.06053v1",
    "url": "https://arxiv.org/abs/2512.06053v1",
    "pdf_url": "https://arxiv.org/pdf/2512.06053v1.pdf",
    "title": "Ferromagnetic Phase Transition of DPPH Induced by a Magic Angle Helical Magnetic Field",
    "abstract": "We report the results and unique instrument configuration of a novel experiment in which we successfully transitioned a DPPH sample from its natural paramagnetic state and essentially a non-magnetic material to a ferromagnetic state at room temperature. This was achieved using a specifically applied helical flux magnetic field. The DPPH sample (2,2-diphenyl-1-picrylhydrazyl) remained ferromagnetic for at least one hour after the experiment, indicating that a transformation in the material was induced by the external field rather than being merely a temporary magnetic phase transition observed only during the experiment. The external magnetic field used had a helical pitch angle of approximately $54.7°$, known mathematically as the Magic Angle, relative to the +z-axis, which is aligned with the normal S to N external field's magnetic moment vector. Based on the phenomenology of the experiment, we infer that this specific magic angle corresponding to the known quantization precession spin angle of free electrons under a homogeneous straight flux magnetic field potentially enhances the percentage of unpaired valence electrons within the DPPH material, allowing them to align in parallel with the applied external field. Typically, in paramagnetic materials, the distribution of unpaired electrons' quantum spins relative to an external field is nearly random, showing roughly a 50% chance of either parallel or antiparallel alignment. Only a slight majority preference exists in one alignment direction due to the Boltzmann thermal distribution, which contributes to the paramagnetic nature of these materials. In our measurements, we found that the induced ferromagnetism of the DPPH sample resulted in an abnormal thousand-fold decimal value increase in relative magnetic permeability at $μ{\\approx}1.4$, compared to its typical paramagnetic value of $1.0001$ for this material.",
    "authors": [
      "Emmanouil Markoulakis",
      "John Chatzakis",
      "Antonios Konstantaras",
      "Iraklis Rigakis",
      "Emmanuel Antonidakis"
    ],
    "published": "2025-12-05T12:04:28Z",
    "updated": "2025-12-05T12:04:28Z",
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.app-ph",
      "physics.ins-det",
      "quant-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci"
  },
  {
    "arxiv_id": "2505.09700v2",
    "url": "https://arxiv.org/abs/2505.09700v2",
    "pdf_url": "https://arxiv.org/pdf/2505.09700v2.pdf",
    "title": "Turbulence and Magnetic Reconnection in Relativistic Multispecies Plasmas",
    "abstract": "Simulations of relativistic plasmas traditionally focus on the dynamics of two-species mixtures of charged particles under the influence of external magnetic fields and those generated by particle currents. However, the extreme conditions of astrophysical plasmas near compact objects such as black holes and neutron stars are often characterized by mixtures of electrons, protons, and positrons, whose dynamics can differ significantly because of the considerable mass contrast. We present the first two-dimensional particle-in-cell simulations of relativistic turbulence and magnetic reconnection in a three-species plasma, varying the relative abundance of electrons, protons, and positrons while employing realistic mass ratios to achieve unprecedented accuracy. We find that turbulence leads to the formation of magnetic islands, current sheets, and plasmoids. Reconnection occurs between these structures, with plasma composition playing a key role in determining the number of reconnection sites and their energy-conversion efficiency. In particular, as the proton fraction increases, very small-scale features of the turbulence are washed out, while global dissipative effects are amplified. Finally, using a novel generalization of Ohm's law for a relativistic multi-species plasma, we find that the reconnection rate is primarily governed by the electric fields associated to the divergence of the positron and electron pressure tensors. These results provide new insights into dissipation and particle acceleration in turbulent relativistic plasmas, such as those near black holes and neutron stars, and can be used to interpret their high-energy emission and phenomenology.",
    "authors": [
      "Mario Imbrogno",
      "Claudio Meringolo",
      "Alejandro Cruz-Osorio",
      "Luciano Rezzolla",
      "Benoît Cerutti",
      "Sergio Servidio"
    ],
    "published": "2025-05-14T18:02:34Z",
    "updated": "2025-12-05T11:20:22Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.GA",
      "astro-ph.HE",
      "gr-qc"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.3847/2041-8213/adfb4c"
  },
  {
    "arxiv_id": "2510.25636v3",
    "url": "https://arxiv.org/abs/2510.25636v3",
    "pdf_url": "https://arxiv.org/pdf/2510.25636v3.pdf",
    "title": "Mode Composition Shapes Magnetic Anisotropy in Solar Wind Turbulence",
    "abstract": "Turbulence is a ubiquitous process that transfers energy across many spatial and temporal scales, thereby influencing particle transport and heating. Recent progress has improved our understanding of the anisotropy of turbulence with respect to the mean magnetic field; however, its exact form and implications for magnetic topology and energy transfer remain unclear. In this study, we investigate the nature of magnetic anisotropy in compressible magnetohydrodynamic (MHD) turbulence within low-$β$ solar wind using measurements from the Cluster spacecraft. By decomposing small-amplitude fluctuations into Alfvén and compressible modes, we reveal that magnetic anisotropy is largely mode dependent: Alfvenic fluctuations are broadly distributed in propagation angle, whereas compressible fluctuations are concentrated near the quasi-parallel (slab) direction, a feature closely linked to collisionless damping of compressible modes. For $β\\rightarrow0$, compressible modes become dominant within the slab component at smaller scales. These findings advance our understanding of magnetic anisotropy in solar wind turbulence and offer a new perspective on the three-dimensional turbulence cascade, with broad implications for particle transport, acceleration, and magnetic reconnection.",
    "authors": [
      "Siqi Zhao",
      "Huirong Yan",
      "Terry Z. Liu",
      "Chuanpeng Hou"
    ],
    "published": "2025-10-29T15:49:52Z",
    "updated": "2025-12-05T10:47:03Z",
    "categories": [
      "astro-ph.SR",
      "physics.plasm-ph",
      "physics.space-ph"
    ],
    "primary_category": "astro-ph.SR"
  },
  {
    "arxiv_id": "2512.05589v1",
    "url": "https://arxiv.org/abs/2512.05589v1",
    "pdf_url": "https://arxiv.org/pdf/2512.05589v1.pdf",
    "title": "Design and Performance of a 96-channel Resistive Micromegas Detector for ENUBET",
    "abstract": "The PICOSEC-Micromegas (PICOSEC-MM) detector is a fast gaseous detector that achieves picosecond-level timing by coupling a Cherenkov radiator, typically an MgF2 crystal, to a Micromegas-based photodetector with a photocathode. This configuration allows the fast photoelectron-induced signal to suppress the intrinsic time jitter of gaseous detectors, enabling sub-20 ps timing precision while preserving the robustness and scalability of micro-pattern gaseous detector technologies. The 96-pad PICOSEC-MM detector is a large-area demonstrator optimized for precision timing in high-energy physics, building on research and development insights from earlier 7-pad resistive prototypes to validate scalability, uniformity, and robustness for the ENUBET project. It employs a 2.5 nm diamond-like carbon photocathode and a Micromegas board with a surface resistivity of 10 megaohms per square, and was characterized using 150 GeV/c muons at the CERN SPS beamline, with one-third of the active area instrumented per run. A dedicated alignment procedure for multi-pad PICOSEC-MM systems was used to reconstruct pad centers and merge measurements across regions, yielding a timing resolution of 43 ps and uniform signal arrival time distributions over the tested area. Mechanical flatness was identified as a key factor, with planarity tolerances within 10 micrometers required to maintain good timing resolution, and the successful operation of the 96-pad demonstrator confirms the scalability of the PICOSEC-MM concept toward robust, high-granularity, picosecond-level gaseous timing detectors for monitored neutrino beam experiments such as ENUBET.",
    "authors": [
      "A. Kallitsopoulou",
      "S. Aune",
      "Y. Angelis",
      "R. Aleksan",
      "A. Bonenfant",
      "J. Bortfeldt",
      "F. Brunbauer",
      "M. Brunoldi",
      "J. Datta",
      "D. Desforge",
      "G. Fanourakis",
      "D. Fiorina",
      "K. J. Floethner",
      "M. Gallinaro",
      "F. Garcia",
      "I. Giomataris",
      "K. Gnanvo",
      "F. J. Iguaz",
      "D. Janssens",
      "F. Jeanneau",
      "M. Kebbiri",
      "M. Kovacic",
      "B. Kross",
      "P. Legou",
      "M. Lisowska",
      "J. Liu",
      "C. Loiseau",
      "M. Lupberger",
      "I. Maniatis",
      "J. McKisson",
      "B. Moreno",
      "Y. Meng",
      "H. Muller",
      "E. Oliveri",
      "G. Orlandini",
      "A. Pandey",
      "T. Papaevangelou",
      "M. Pomorski",
      "E. F. Ribas",
      "L. Ropelewski",
      "D. Sampsonidis",
      "L. Scharenberg",
      "T. Schneider",
      "E. Scorsone",
      "L. Sohl",
      "M. van Stenis",
      "Y. Tsipolitis",
      "S. E. Tzamarias",
      "A. Utrobicic",
      "I. Vai",
      "R. Veenhof",
      "P. Vitulo",
      "X. Wang",
      "S. White",
      "W. Xi",
      "Z. Zhang",
      "Y. Zhou"
    ],
    "published": "2025-12-05T10:23:46Z",
    "updated": "2025-12-05T10:23:46Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.05532v1",
    "url": "https://arxiv.org/abs/2512.05532v1",
    "pdf_url": "https://arxiv.org/pdf/2512.05532v1.pdf",
    "title": "CryoDE: a Digital Cryogenic Detector Emulator for Microwave SQUID Multiplexed Systems",
    "abstract": "Simultaneous readout of large-scale cryogenic detector arrays relies on multiplexing schemes such as the FDM (Frequency-Division Multiplexing) with microwave SQUID multiplexers and highly customized readout electronics. In traditional detector systems, where mixed-signal ASICs are used in detector front-ends and typically provide a digital interface, HIL (Hardware-in-the-Loop) testing can be readily implemented by reusing the existing digital logic of the front-end for emulation purposes. Such straightforward emulation is not possible for FDM low-temperature detectors, where the sensor signal is encoded in a high-frequency microwave carrier via a two-stage modulation scheme depending on the cryogenic resonators and the SQUID response. To address this challenge, we present CryoDE, a digital cryogenic-detector emulator for microwave SQUID multiplexed detector systems. CryoDE generates the encoded detector signals, including realistic pulse responses, enabling full HIL testing of the room-temperature DAQ system without requiring the cryogenic hardware. This resource-efficient FPGA-based detector twin integrates seamlessly into existing DAQ systems and allows experiment-specific adjustment of detector-signal parameters. We describe the internal architecture and capabilities of CryoDE within our custom HIL framework and demonstrate its use in evaluating the performance of real-time signal processing firmware optimized for different microwave SQUID multiplexed cryogenic-detector experiments.",
    "authors": [
      "Timo Muscheid",
      "Daniel Crovo",
      "Robert Gartmann",
      "Eduardo Gerlein",
      "Oliver Sander",
      "Sebastian Kempf",
      "Luis E. Ardila-Perez"
    ],
    "published": "2025-12-05T08:44:06Z",
    "updated": "2025-12-05T08:44:06Z",
    "categories": [
      "physics.ins-det",
      "eess.SP"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2511.19114v2",
    "url": "https://arxiv.org/abs/2511.19114v2",
    "pdf_url": "https://arxiv.org/pdf/2511.19114v2.pdf",
    "title": "Physics-informed Neural Operator Learning for Nonlinear Grad-Shafranov Equation",
    "abstract": "As artificial intelligence emerges as a transformative enabler for fusion energy commercialization, fast and accurate solvers become increasingly critical. In magnetic confinement nuclear fusion, rapid and accurate solution of the Grad-Shafranov equation (GSE) is essential for real-time plasma control and analysis. Traditional numerical solvers achieve high precision but are computationally prohibitive, while data-driven surrogates infer quickly but fail to enforce physical laws and generalize poorly beyond training distributions. To address this challenge, we present a Physics-Informed Neural Operator (PINO) that directly learns the GSE solution operator, mapping shape parameters of last closed flux surface to equilibrium solutions for realistic nonlinear current profiles. Comprehensive benchmarking of five neural architectures identifies the novel Transformer-KAN (Kolmogorov-Arnold Network) Neural Operator (TKNO) as achieving highest accuracy (0.25% mean L2 relative error) under supervised training (only data-driven). However, all data-driven models exhibit large physics residuals, indicating poor physical consistency. Our unsupervised training can reduce the residuals by nearly four orders of magnitude through embedding physics-based loss terms without labeled data. Critically, semi-supervised learning--integrating sparse labeled data (100 interior points) with physics constraints--achieves optimal balance: 0.48% interpolation error and the most robust extrapolation performance (4.76% error, 8.9x degradation factor vs 39.8x for supervised models). Accelerated by TensorRT optimization, our models enable millisecond-level inference, establishing PINO as a promising pathway for next-generation fusion control systems.",
    "authors": [
      "Siqi Ding",
      "Zitong Zhang",
      "Guoyang Shi",
      "Xingyu Li",
      "Xiang Gu",
      "Yanan Xu",
      "Huasheng Xie",
      "Hanyue Zhao",
      "Yuejiang Shi",
      "Tianyuan Liu"
    ],
    "published": "2025-11-24T13:46:38Z",
    "updated": "2025-12-05T06:26:54Z",
    "categories": [
      "physics.plasm-ph",
      "cs.AI"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.05434v1",
    "url": "https://arxiv.org/abs/2512.05434v1",
    "pdf_url": "https://arxiv.org/pdf/2512.05434v1.pdf",
    "title": "Comparison of filament properties in real-size GBS simulations and experiments of TCV-X21",
    "abstract": "A direct quantitative comparison of Scrape-Off Layer (SOL) filament properties from fluid turbulence simulations using the GBS code and from experiments on the TCV tokamak is performed within the TCV-X21 validation case. This comparison is made possible by extending the open TCV-X21 dataset with 2D turbulence measurements obtained with Gas Puff Imaging (GPI), providing critical information on the size, velocity, and other key characteristics of turbulent filaments at the outboard midplane and in the divertor region. For the comparison, GBS simulations of TCV-X21 are analyzed using a dedicated synthetic GPI diagnostic that models the neutral helium-plasma interaction and emission processes and accounts for line-integration effects. Poloidal and radial filament velocities are found to be in good agreement between simulations and experiments, while the simulations overestimate the filament radial and poloidal sizes and underestimate the relative fluctuation levels. The simulations further indicate that filaments in the SOL are predominantly represented by density perturbations rather than temperature perturbations, consistent with previous assumptions in experimental analyses of cross-field turbulent transport from GPI data. The poloidal velocity direction of the filaments agrees with the time-averaged $\\boldsymbol{E}\\times\\boldsymbol{B}$ direction at the outboard midplane and X-point region, but not in the divertor leg. Possible explanations are proposed and discussed, highlighting the influence of the instantaneous $\\boldsymbol{E}\\times\\boldsymbol{B}$ velocity components in both poloidal and radial directions. This study provides new insights into turbulent filament behavior and contributes to guiding future efforts to improve first-principles simulations of the boundary plasma.",
    "authors": [
      "Y. Wang",
      "C. Wüthrich",
      "C. Theiler",
      "S. García Herreros",
      "D. S. Oliveira",
      "D. Mancini",
      "T. Golfinopoulos",
      "P. Ricci",
      "T. Body",
      "the TCV team"
    ],
    "published": "2025-12-05T05:18:23Z",
    "updated": "2025-12-05T05:18:23Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.04447v2",
    "url": "https://arxiv.org/abs/2512.04447v2",
    "pdf_url": "https://arxiv.org/pdf/2512.04447v2.pdf",
    "title": "GPU-Portable Real-Space Density Functional Theory Implementation on Unified-Memory Architectures",
    "abstract": "We present a GPU-portable implementation of a real-space density functional theory (DFT) code ``QUMASUN'' and benchmark it on the new Plasma Simulator featuring Intel Xeon 6980P CPUs, and AMD MI300A GPUs. Additional tests were performed on an NVIDIA GH200 GPU. In particular MI300A supports unified memory and GH200 supports coherent memory interconnect, simplifying GPU porting. A lightweight C++ lambda-based layer enables CPU, CUDA, and HIP execution without OpenMP/OpenACC preprocessor directives. For diamond (216 atoms) and tungsten (128 atoms) systems, MI300A and GH200 achieve 2.0-2.8 $\\times$ and 2.3-2.4 $\\times$ speedups over a 256-core Xeon node. The compute-bound kernels, which are fast Fourier transforms (FFT), dense matrix-matrix multiplications (GEMM) and eigenvalue solver, show substantial acceleration on both GPUs, indicating that the present GPU-portable approach can benefit a wide range of plasma-fusion simulation codes beyond DFT.",
    "authors": [
      "Atsushi M. Ito"
    ],
    "published": "2025-12-04T04:37:33Z",
    "updated": "2025-12-05T03:37:20Z",
    "categories": [
      "physics.comp-ph",
      "cond-mat.mtrl-sci",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.comp-ph"
  },
  {
    "arxiv_id": "2512.05313v1",
    "url": "https://arxiv.org/abs/2512.05313v1",
    "pdf_url": "https://arxiv.org/pdf/2512.05313v1.pdf",
    "title": "Finding the Maximal Contrast of Two Elliptical Gaussian Mode Beams with Aligned Ellipticities",
    "abstract": "Interferometric contrast is a key factor limiting the sensitivity of precision optical measurements, including the laser interferometers used in gravitational-wave detection. While standard formulas describe the interference of circular Gaussian beams, many real systems use beams with elliptical cross sections, where differing waists and radii of curvature can reduce fringe visibility. This paper derives an analytic expression for the maximum contrast achievable between two aligned elliptical Gaussian beams, written entirely in terms of their geometric and power parameters. We then test the formula using a free-space Michelson interferometer in which all beam parameters are independently measured through beam profiling and nonlinear fitting. In our experiment, the predicted maximum contrast was 0.968 while the experimentally optimized value was 0.950. The small discrepancy is consistent with expected imperfections such as beam rotation, mode mismatch, and non-Gaussian aberrations. This work provides a practical tool for modeling and optimizing elliptical-beam interferometers.",
    "authors": [
      "Mark Zhu",
      "Sina M. Koehlenbeck",
      "Edgard Bonilla",
      "Brian Lantz"
    ],
    "published": "2025-12-04T23:24:20Z",
    "updated": "2025-12-04T23:24:20Z",
    "categories": [
      "physics.optics",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2512.05298v1",
    "url": "https://arxiv.org/abs/2512.05298v1",
    "pdf_url": "https://arxiv.org/pdf/2512.05298v1.pdf",
    "title": "A Conservative Discontinuous Galerkin Algorithm for Particle Kinetics on Smooth Manifolds",
    "abstract": "A novel, conservative discontinuous Galerkin algorithm is presented for particle kinetics on manifolds. The motion of particles on the manifold is represented using using both canonical and non-canonical Hamiltonian formulations. Our schemes apply to either formulations, but the canonical formulation results in a particularly efficient scheme that also conserves particle density and energy exactly. The collisionless update is coupled to a Bhatnagar-Gross-Krook (BGK) collision operator that provides a simplified model for relaxation to local thermodynamic equilibrium. An iterative scheme is constructed to ensure collisional invariants (density, momentum and energy) are preserved numerically. Rotation of the manifold is incorporated by modifying the Hamiltonian while ensuring a canonical formulation. Several test problems, including a kinetic version of the classical Sod-shock problem, Kelvin-Helmholtz instability on the surfaces of a sphere and a paraboloid, with and without rotations, is presented. A prospectus for further development of this approach to simulation of kinetic theory in general relativity is presented.",
    "authors": [
      "Grant Johnson",
      "Ammar Hakim",
      "James Juno"
    ],
    "published": "2025-12-04T22:33:37Z",
    "updated": "2025-12-04T22:33:37Z",
    "categories": [
      "physics.comp-ph",
      "gr-qc",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.comp-ph"
  },
  {
    "arxiv_id": "2509.21506v3",
    "url": "https://arxiv.org/abs/2509.21506v3",
    "pdf_url": "https://arxiv.org/pdf/2509.21506v3.pdf",
    "title": "Electrostatic waves in astrophysical Druyvesteyn plasmas: I. Langmuir waves",
    "abstract": "Plasmas in various astrophysical systems are in non-equilibrium states as evidenced by direct in-situ measurements in the solar wind, solar corona and planetary environments as well as by indirect observations of nonthermal sources of waves and emissions. Specific to observed non-equilibrium plasmas are non-Maxwellian velocity distributions with suprathermal tails, most often described by Kappa (power-law) distributions. In this paper, we introduce an alternative modeling for linear waves in plasmas described by the generalized Druyvesteyn distribution model. This model can reproduce not only high-energy tails, but also low-energy flat-tops of velocity distributions, like those of electrons in interplanetary shocks and the solar transition region. The wave dispersion relation of longitudinal waves is derived in terms of the newly introduced Druyvesteyn dispersion function. The dispersion curves as well as damping rates of high-frequency Langmuir waves are numerically computed for the isotropic case, and their analytical approximations are provided in the limit of weak damping. We thus offer a new tool for modeling longitudinal waves, and in particular Langmuir waves under the specific conditions of Druyvesteyn distributions.",
    "authors": [
      "Simon Tischmann",
      "Rudi Gaelzer",
      "Dustin Schröder",
      "Marian Lazar",
      "Horst Fichtner"
    ],
    "published": "2025-09-25T19:59:11Z",
    "updated": "2025-12-04T21:39:16Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.SR"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2509.18517v2",
    "url": "https://arxiv.org/abs/2509.18517v2",
    "pdf_url": "https://arxiv.org/pdf/2509.18517v2.pdf",
    "title": "Data-driven optimization of pixelated CdZnTe spectrometers for uranium enrichment assay",
    "abstract": "In recent work [Vavrek et al. (2025)], we developed the performance optimization framework spectre-ml for gamma spectrometers with variable performance across many readout channels. The framework uses non-negative matrix factorization (NMF) and clustering to learn groups of similarly-performing channels and sweep through various learned channel combinations to optimize the performance tradeoff of including worse-performing channels for better total efficiency. In this work, we integrate the pyGEM uranium enrichment assay code with our spectre-ml framework, and show that the U-235 enrichment relative uncertainty can be directly used as an optimization target. We find that this optimization reduces relative uncertainties after a 30-minute measurement by an average of 20%, as tested on six different H3D M400 CdZnTe spectrometers, which can significantly improve uranium non-destructive assay measurement times in nuclear safeguards contexts. Additionally, this work demonstrates that the spectre-ml optimization framework can accommodate arbitrary end-user spectroscopic analysis code and performance metrics, enabling future optimizations for complex Pu spectra.",
    "authors": [
      "Jayson R. Vavrek",
      "Thomas D. MacDonald",
      "Hannah S. Parrilla",
      "Nikhil S. Deshmukh",
      "Mital A. Zalavadia",
      "Benjamin S. McDonald"
    ],
    "published": "2025-09-23T01:26:57Z",
    "updated": "2025-12-04T21:15:02Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.05194v1",
    "url": "https://arxiv.org/abs/2512.05194v1",
    "pdf_url": "https://arxiv.org/pdf/2512.05194v1.pdf",
    "title": "Lagrangian versus Eulerian Methods for Toroidally-Magnetized Isothermal Disks",
    "abstract": "A number of simulations have seen the emergence of strongly-toroidally-magnetized accretion disks from interstellar medium inflows. Recently, Guo et al. 2025 (G25) studied an idealized test problem of toroidally-magnetized disks in isothermal ideal MHD with an Eulerian static-mesh method, and argued the midplane behavior changes qualitatively (with a significant loss of toroidal magnetic flux) when the the thermal scale-length is resolved ($Δx < H_{\\rm thermal}$). We rerun the G25 test problem with two Lagrangian methods: meshless finite-mass, and meshless finite-volume. We show that Lagrangian methods reproduce the high-resolution ($Δx \\ll H_{\\rm thermal}$) Eulerian G25 results. At low resolution ($Δx \\gg H_{\\rm thermal}$), behaviors differ: Lagrangian methods still lose flux and evolve 'as close as possible' to the converged solution, while Eulerian methods show no evolution. We argue this difference in convergence behavior is related to the ability of Lagrangian codes to follow flows to an arbitrarily thin midplane layer, analogous to the well-studied difference in Jeans fragmentation problems. This and results from other higher-resolution simulations and different codes suggest that the sustained midplane toroidal fields seen in recent Lagrangian multi-scale, multi-physics simulations cannot be a numerical resolution effect, and some physical difference between those simulations and the G25 test problem explains their different behaviors.",
    "authors": [
      "Yashvardhan Tomar",
      "Philip F. Hopkins"
    ],
    "published": "2025-12-04T19:01:28Z",
    "updated": "2025-12-04T19:01:28Z",
    "categories": [
      "astro-ph.HE",
      "astro-ph.GA",
      "astro-ph.IM",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2504.08021v2",
    "url": "https://arxiv.org/abs/2504.08021v2",
    "pdf_url": "https://arxiv.org/pdf/2504.08021v2.pdf",
    "title": "Off-line Commissioning of the St. Benedict Radiofrequency Quadrupole Cooler-Buncher",
    "abstract": "The St. Benedict ion trapping system, which aims to measure the $β-ν$ angular correlation parameter in superallowed-mixed mirror transitions, is under construction at the University of Notre Dame. These measurements will provide much-needed data to improve the accuracy of the $V_{ud}$ element of the CKM matrix. One of the major components of this system is the radio frequency quadrupole cooler-buncher, which is necessary to create low-emittance ion bunches for injection into the measurement Paul trap. The off-line commissioning of the cooler-buncher, using a potassium ion source, determined that the device could produce cooled ion bunches characterized by a 50-ns full-width-half-maximum time width. The commissioning results also determined the trapping efficiency to be 93(1)$\\%$ and the trapping half-life to be 20.0(5) s.",
    "authors": [
      "D. P. Burdette",
      "R. Zite",
      "M. Brodeur",
      "A. A. Valverde",
      "O. Bruce",
      "R. Bualuan",
      "A. Cannon",
      "J. A. Clark",
      "C. Davis",
      "T. Florenzo",
      "A. T. Gallant",
      "J. Harkin",
      "A. M. Houff",
      "J. Li",
      "B. Liu",
      "J. Long",
      "P. D. O'Malley",
      "W. S. Porter",
      "C. Quick",
      "R. Ringle",
      "F. Rivero",
      "G. Savard",
      "M. A. Yeck"
    ],
    "published": "2025-04-10T17:31:38Z",
    "updated": "2025-12-04T19:00:50Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1016/j.nima.2025.171187"
  },
  {
    "arxiv_id": "2512.05181v1",
    "url": "https://arxiv.org/abs/2512.05181v1",
    "pdf_url": "https://arxiv.org/pdf/2512.05181v1.pdf",
    "title": "Development of a Modular ODMR Setup for Optical Experiments in a Variable Temperature Insert",
    "abstract": "We developed an optically detected magnetic resonance (ODMR) setup designed for compatibility with a widely used, commercially available helium bath cryostat equipped with a variable temperature insert. The optical path extends nearly two meters, spanning the full length of the cryostat insert, enabling excitation of the nitrogen-vacancy (NV) centers and detection of the resulting fluorescence from outside the cryostat. The setup preserves optical alignment and beam quality along this extended path allowing integration into existing cryogenic systems without significant modifications. We demonstrate the setup's performance by measuring the temperature dependence of the resonance signal and its behavior under small applied magnetic fields, as well as the magnetic transition of a SrRuO$_3$ sample, thereby showcasing the feasibility of NV magnetometry on a sample in constrained cryogenic environments.",
    "authors": [
      "Anh Tong",
      "Andreas Bauer",
      "Markus Kleinhans",
      "James S. Schilling",
      "Christian H. Back",
      "Karl D. Briegel",
      "Fabian A. Freire-Moschovitis",
      "Dominik B. Bucher",
      "Christian Pfleiderer"
    ],
    "published": "2025-12-04T19:00:01Z",
    "updated": "2025-12-04T19:00:01Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.other",
      "cond-mat.str-el"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.04982v1",
    "url": "https://arxiv.org/abs/2512.04982v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04982v1.pdf",
    "title": "Operator Formalism for Laser-Plasma Wakefield Acceleration",
    "abstract": "In this paper, we develop an operator-based framework for laser--plasma wakefield acceleration (LPWA) in capillary discharges, providing a compact and systematic description of the coupled dynamics of laser fields and plasma response. The formalism employs key operators: the transverse modal operator $\\hat{K}$, the nonlinear plasma operator $\\hat{N}[Ψ]$, the plasma oscillation operator $\\hatΩ_p^{\\,2}$, and the ponderomotive source operator $\\hatα$, which together describe mode coupling, plasma oscillations, and nonlinear feedback induced by the ponderomotive force. In the linear regime, the system is characterized by invariant subspaces associated with stable modal structures, while nonlinear interactions break these invariances, leading to mode mixing and complex dynamics. The approach establishes a direct connection between LPWA and Hilbert-space operator theory, including the invariant subspace, providing a formal mathematical interpretation of energy transfer and wakefield formation. Furthermore, the operator formalism integrates with neural operator methods, allowing efficient approximation of $\\hat{N}$ and $\\hatα$ for reduced-order modeling and predictive control. This hybrid physics--AI framework offers a robust foundation for modeling, analysis, and optimization of high-intensity laser--plasma interactions in next-generation accelerator experiments.",
    "authors": [
      "Mostafa Behtouei",
      "Carlos Salgado Lopez",
      "Giancarlo Gatti"
    ],
    "published": "2025-12-04T16:54:15Z",
    "updated": "2025-12-04T16:54:15Z",
    "categories": [
      "physics.plasm-ph",
      "math-ph",
      "physics.acc-ph",
      "quant-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.05727v4",
    "url": "https://arxiv.org/abs/2506.05727v4",
    "pdf_url": "https://arxiv.org/pdf/2506.05727v4.pdf",
    "title": "Bennett Vorticity: A family of nonlinear Shear-Flow Stabilized Z-pinch equilibria",
    "abstract": "The Bennett profile is a classic form for the plasma number density of an equilibrium Z-pinch that has been studied for almost a century by plasma physicists interested in nonlinear plasma pinch science, and fusion energy. By transferring the nonlinearity entirely from the number density to the plasma flow velocity the current density of the resulting flowing Z-pinch equilibrium remains unchanged whilst now being defined by a vortical flow which previously did not exist in the classic case. Due to the positive-definite structure of the nonlinearity's first derivative, in the ideal limit this equilibrium conforms globally to the validity criterion for a shear-flow stabilized Z-pinch when the form of the temperature profile satisfies certain constraints. For a cubic temperature the equilibrium has an analytic solution which is investigated.",
    "authors": [
      "Matt Russell"
    ],
    "published": "2025-06-06T04:20:38Z",
    "updated": "2025-12-04T16:49:02Z",
    "categories": [
      "physics.plasm-ph",
      "nlin.SI"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2512.04965v1",
    "url": "https://arxiv.org/abs/2512.04965v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04965v1.pdf",
    "title": "Characterization of thin optical filters for high purity Cherenkov light readout from scintillating crystals",
    "abstract": "A hybrid dual-readout calorimeter concept, comprising both electromagnetic and hadronic sections, has recently been proposed to meet the performance requirements of experiments at future e$^{+}$e$^{-}$ colliders. The front compartment consists of a homogeneous electromagnetic calorimeter made of high-density crystals, each coupled to a pair of Silicon Photomultipliers (SiPMs) providing the simultaneous readout of scintillation and Cherenkov light. To efficiently detect Cherenkov photons in the presence of dominant scintillation signals, an optical filter is placed in front of one of the two SiPMs to suppress photons in the wavelength region corresponding to that of scintillation emission. % In this study, PWO, BGO, and BSO crystals with different dimensions were tested to measure their scintillation light yield and decay time, as well as their transmission and emission spectra. A set of $\\sim 100~\\rm μm$-thick optical filters was also characterized by measuring their transmittance curves. The experimental results were used to model and estimate the expected filter performance in attenuating scintillation light for the various crystals. % The performance of each filter was experimentally validated by measuring the crystal light output with and without the filter using a $^{22}$Na radioactive source and a LYSO:Ce crystal, confirming the accuracy of the calculations. % The results show that interference filters are unsuitable for this application because their transmittance strongly depends on the photon incidence angle. Conversely, two absorptive long-pass filters with cutoff wavelengths around 590~nm were found to block more than 99\\% of the scintillation light from PWO crystals, satisfying the calorimeter specifications.",
    "authors": [
      "Andrea Benaglia",
      "Flavia Cetorelli",
      "Marco Toliman Lucchini",
      "Etiennette Auffray",
      "Louis Roux",
      "Julie Delenne"
    ],
    "published": "2025-12-04T16:33:45Z",
    "updated": "2025-12-04T16:33:45Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.06030v1",
    "url": "https://arxiv.org/abs/2512.06030v1",
    "pdf_url": "https://arxiv.org/pdf/2512.06030v1.pdf",
    "title": "The program Simourg for simulating the response functions of gamma detectors with simple geometries",
    "abstract": "The program Simourg (Simulator of Usually Requested Geometries) is based on the Geant4 toolkit and created for Monte Carlo simulation of gamma-ray spectrometric nuclear detectors with a simple axial symmetric geometry, which is typical for many tasks of studying the decay of long-lived nuclei and measuring the radioactivity of natural objects. The program is designed for quick estimation of the effectiveness and the response function of the detector to monoenergetic gamma quanta in the energy range from keV to several MeV.",
    "authors": [
      "V. V. Kobychev"
    ],
    "published": "2025-12-04T15:47:59Z",
    "updated": "2025-12-04T15:47:59Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.15407/jnpae2011.03.301"
  },
  {
    "arxiv_id": "2512.04901v1",
    "url": "https://arxiv.org/abs/2512.04901v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04901v1.pdf",
    "title": "Adaptive Optics-Enhanced Michelson Interferometer for Spectroscopy of Narrow-Band Light Sources",
    "abstract": "Adaptive optics enables the deployment of interferometer-based spectroscopy without the need for moving parts necessary for scanning the interferometer arms. Here, we employ a Michelson Interferometer in conjunction with a Spatial Light Modulator (SLM) for determining the spectral profile of a narrow-band light source. Interestingly, we observe that the fringes across the interferometer output beam are inherently shifted in wavelength even when a constant phase profile is provided to the SLM. We calibrate the spectral shifts as a function of fringe spatial location by measuring the incident light spectrum at various points across the fringe pattern, and observe that the spectral peak traces out a `teardrop' shape, whose width is dependent on the spectral bandwidth of the source, the relative tilt and path difference between the two arms of the interferometer, and the divergence of the beam. Next, we demonstrate that this inherent spectral variation of the fringes can be used to perform fast single-snapshot spectroscopy of narrow-band light sources, while a time-varied phase profile provided to the SLM leads to multi-step spectroscopy with lower noise, higher resolution, and better contrast. Our findings establish that the Michelson Interferometer can be used to perform spectroscopy of any source within a certain spectral range from simple images of the fringe pattern, so as to facilitate exciting applications towards hyperspectral imaging.",
    "authors": [
      "Jesneil Lauren Lewis",
      "Ayan Banerjee"
    ],
    "published": "2025-12-04T15:29:32Z",
    "updated": "2025-12-04T15:29:32Z",
    "categories": [
      "physics.optics",
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2512.04866v1",
    "url": "https://arxiv.org/abs/2512.04866v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04866v1.pdf",
    "title": "Degrees of universality in wave turbulence",
    "abstract": "Turbulence of weakly interacting waves displays a great deal of universality: independence of the details of the interaction and of the pumping and dissipation scales. Here we study how inverse turbulent cascades (from small to large scales) transition from weak to strong. We find that while one-loop corrections can be dependent on excitation and dissipation scales, new types of universality appear in strong turbulence. We contrast turbulence of spin waves in ferromagnets with turbulent cascades in the Nonlinear Schrödinger Equation (NSE) and in an MMT-like model in higher dimensions having a multiplicative interaction vertex: vertex renormalization gives rise to dependence on the pumping (UV scale) in the former but not in the latter. As a result of this spectral nonlocality, spin-wave turbulence stops being weak if one is sufficiently far from the pumping scale, even when the interaction of waves with comparable wavenumbers is weak. We paraphrase this as: nonlocality enhances nonlinearity.   We then describe strong turbulence in a multi-component version of these models with a large number of components. We argue that strong spin-wave turbulence is similar to turbulence of the focusing NSE, as it realizes a critical-balance state. However, UV nonlocality causes the level of spin-wave turbulence at large scales to decrease with increasing pumping level, culminating in a state that is independent of the level of pumping.",
    "authors": [
      "Jiasheng Liu",
      "Vladimir Rosenhaus",
      "Gregory Falkovich"
    ],
    "published": "2025-12-04T14:49:12Z",
    "updated": "2025-12-04T14:49:12Z",
    "categories": [
      "cond-mat.stat-mech",
      "hep-th",
      "nlin.CD",
      "physics.flu-dyn",
      "physics.plasm-ph"
    ],
    "primary_category": "cond-mat.stat-mech"
  },
  {
    "arxiv_id": "2512.04842v1",
    "url": "https://arxiv.org/abs/2512.04842v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04842v1.pdf",
    "title": "Performance Optimization and Characterization of 7-pad Resistive PICOSEC Micromegas Detectors",
    "abstract": "We present a comprehensive characterization of resistive PICOSEC Micromegas detector prototypes, tested under identical conditions, constant drift gap, field configurations, and photocathode at the CERN SPS H4 beam line. This work provides a proof of concept for the use of resistive layer technology in gaseous timing detectors, demonstrating that robustness can be improved without compromising the excellent timing performance of PICOSEC Micromegas. Different resistive architectures and values were explored to optimize stability and ensure reliable long-term operation in challenging experimental environments. The prototype with a 10MΩ resistive layer achieved the best overall performance, with a timing resolution of 22.900 {\\pm} 0.002 ps and a spatial resolution of 1.190 {\\pm} 0.003 mm, while charge sharing across multiple pads enabled combined timing resolutions below 28 ps. A lower-resistivity (200kΩ) configuration exhibited enhanced charge spread, leading to minor systematic offsets in reconstructed pad centers, yet maintained robust timing and spatial performance. Capacitive charge-sharing architectures improved spatial resolution in some regions but suffered from signal attenuation and nonuniform charge distributions, resulting in slightly degraded timing (33.300 {\\pm} 0.002 ps) and complex localization patterns. Mechanical precision, particularly readout planarity and photocathode alignment, was identified as critical for uniform detector response. These studies benchmark the potential of resistive layers for gaseous timing detectors and provide a foundation for scalable designs with optimized timing and spatial resolution across diverse experimental applications.",
    "authors": [
      "A. Kallitsopoulou",
      "R. Aleksan",
      "S. Aune",
      "J. Bortfeldt",
      "F. Brunbauer",
      "M. Brunoldi",
      "J. Datta",
      "D. Desforge",
      "G. Fanourakis",
      "D. Fiorina",
      "K. J. Floethner",
      "M. Gallinaro",
      "F. Garcia",
      "I. Giomataris",
      "K. Gnanvo",
      "F. J. Iguaz",
      "D. Janssens",
      "F. Jeanneau",
      "M. Kovacic",
      "B. Kross",
      "P. Legou",
      "M. Lisowska",
      "J. Liu",
      "M. Lupberger",
      "I. Maniatis",
      "J. McKisson",
      "Y. Meng",
      "H. Muller",
      "E. Oliveri",
      "G. Orlandini",
      "A. Pandey",
      "T. Papaevangelou",
      "M. Pomorski",
      "E. F. Ribas",
      "L. Ropelewski",
      "D. Sampsonidis",
      "L. Scharenberg",
      "T. Schneider",
      "E. Scorsone",
      "L. Sohl",
      "M. van Stenis",
      "Y. Tsipolitis",
      "S. E. Tzamarias",
      "A. Utrobicic",
      "I. Vai",
      "R. Veenhof",
      "P. Vitulo",
      "X. Wang",
      "S. White",
      "W. Xi",
      "Z. Zhang",
      "Y. Zhou"
    ],
    "published": "2025-12-04T14:27:08Z",
    "updated": "2025-12-04T14:27:08Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.04816v1",
    "url": "https://arxiv.org/abs/2512.04816v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04816v1.pdf",
    "title": "Spaceflight KID Readout Electronics for PRIMA",
    "abstract": "We present the design and testing of a prototype multiplexing kinetic inductance detector (KID) readout electronics for the PRobe far-Infrared Mission for Astrophysics (PRIMA) space mission. PRIMA is a Probe-class astrophysics mission concept that will answer fundamental questions about the formation of planetary systems, the co-evolution of stars and supermassive black holes in galaxies, and the rise of heavy elements and dust over cosmic time. The readout electronics for PRIMA must be compatible with operation at Earth-Sun L2 and capable of multiplexing more than 1000 detectors over 2.5 GHz bandwidth while consuming around 30 W per readout chain. The electronics must also be capable of switching between the two instruments, which have different readout bands: the hyperspectral imager (PRIMAger, 2.6-4.9 GHz) and the spectrometer (FIRESS, 0.4-2.4 GHz). The PRIMA readout electronics use high-heritage SpaceCube digital electronics with a build-to-print SpaceCube Mini v3.0 board using a radiation-tolerant Kintex KU060 field programmable gate array (FPGA) and a custom high-speed digitizer board, along with RF electronics that provide filtering and power conditioning. We present the driving requirements for the system, as well as the hardware, firmware, software, and system-level design that meets those requirements.",
    "authors": [
      "Thomas Essinger-Hileman",
      "C. Matt Bradford",
      "Patrick Brown",
      "Sean Bryan",
      "Jesse Coldsmith",
      "Jennifer Corekin",
      "Sumit Dahal",
      "Thomas Devlin",
      "Marc Foote",
      "Draisy Friedman",
      "Alessandro Geist",
      "Jason Glenn",
      "Christopher Green",
      "Tracee Jamison-Hooks",
      "Kevin Horgan",
      "Jared Lucey",
      "Philip Mauskopf",
      "Lynn Miles",
      "Sanetra Bailey Newman",
      "Gerard Quilligan",
      "Cody Roberson",
      "Adrian Sinclair",
      "Salman Sheikh",
      "Eric Weeks",
      "Christopher Wilson",
      "Travis Wise"
    ],
    "published": "2025-12-04T14:05:16Z",
    "updated": "2025-12-04T14:05:16Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2510.15997v2",
    "url": "https://arxiv.org/abs/2510.15997v2",
    "pdf_url": "https://arxiv.org/pdf/2510.15997v2.pdf",
    "title": "Frequency domain laser ultrasound for inertial confinement fusion target wall thickness measurements",
    "abstract": "In inertial confinement fusion experiments hollow, spherical mm-sized capsules are used as a container for nuclear fuel. To achieve maximum implosion efficiency, a perfect capsule geometry is required. This paper presents a wall thickness measurement method based on zero-group velocity guided elastic wave resonances. They are measured with a non-destructive, contactless frequency domain laser ultrasound microscopy system. Wall thickness measurements along the equator of a high-density carbon capsule with a diameter of around 2 mm and a wall thickness of around 80 $\\unicode{x00B5}$m excellently agree with infrared interferometry reference measurements. In addition, the multi-resonant nature of a spherical shell is studied by complementing experimental observations with plate dispersion calculations and finite element wave propagation simulations. The presented method is scalable and can be applied to a broad range of target materials, including metals, or metal-doped targets.",
    "authors": [
      "Martin Ryzy",
      "Guqi Yan",
      "Clemens Grünsteidl",
      "Georg Watzl",
      "Kevin Sequoia",
      "Pavel Lapa",
      "Haibo Huang"
    ],
    "published": "2025-10-14T08:56:55Z",
    "updated": "2025-12-04T13:42:40Z",
    "categories": [
      "physics.ins-det",
      "cond-mat.mtrl-sci",
      "physics.app-ph",
      "physics.optics",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.04788v1",
    "url": "https://arxiv.org/abs/2512.04788v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04788v1.pdf",
    "title": "High-repetition-rate, all-reflective optical guiding and electron acceleration in helium using an off-axis axicon",
    "abstract": "We present recent results on high-power guiding and laser wakefield acceleration (LWFA) in the ELBA beamline at ELI Beamlines, using the L3-HAPLS laser system (13 J, 30 fs, 0.2 Hz). By employing self-waveguiding in a 20 cm plasma channel in helium, we achieved stable acceleration of electron beams to energies approaching 5 GeV. A novel all-reflective optical setup, including an off-axis reflective axicon, enabled efficient acceleration at 0.2 Hz and guiding at repetition rates up to 3.3 Hz. This compact single laser, single compressor implementation of plasma channels for electron acceleration stabilizes electron pointing and enhances energy gain without requiring modifications to the laser system, paving the way for broader adoption of the technology across user facilities.",
    "authors": [
      "Jiří Šišma",
      "Michal Nevrkla",
      "Filip Vitha",
      "Sebastian Lorenz",
      "Illia Zymak",
      "Alžběta Špádová",
      "Andrea Kollárová",
      "Matěj Jech",
      "Alexandr Jančárek",
      "Davorin Peceli",
      "Carlo M. Lazzarini",
      "Leonardo V. N. Goncalves",
      "Gabriele M. Grittani",
      "Sergei V. Bulanov",
      "Jaron E. Shrock",
      "Ela Rockafellow",
      "Ari J. Sloss",
      "Bo Miao",
      "Scott W. Hancock",
      "Howard M. Milchberg"
    ],
    "published": "2025-12-04T13:37:40Z",
    "updated": "2025-12-04T13:37:40Z",
    "categories": [
      "physics.acc-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.04787v1",
    "url": "https://arxiv.org/abs/2512.04787v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04787v1.pdf",
    "title": "2bNIRS: a portable, multi-distance, broadband oximeter and cytochrome-c-oxidase monitoring system for in vivo applications",
    "abstract": "Conventional near-infrared spectroscopy (NIRS) instruments typically employ 2-3 wavelengths for monitoring tissue haemodynamics. However, the use of broadband illumination (hundreds of wavelengths) unlocks also the targeting of tissue metabolism by exploiting the wide differential-redox peak of absorption of cytochrome-c-oxidase (CCO). For this purpose, we present here a novel, broadband (780-900nm), multi-distance NIRS system, called 2bNIRS. Compact and portable (20 x 30 x 40 cm3), 2bNIRS was validated using a dynamic, optical phantom con-taining blood and yeast, and benchmarked against a multi-wavelength time-domain NIRS (TD-NIRS) system. Validation confirmed its accuracy in tracking haemody-namic and metabolic changes, with superior oximetry performance achieved via our BRUNO algorithm, which integrates broadband spectral fitting with spatially-re-solved analysis. Preliminary in vivo, human applications demonstrated 2bNIRS ap-plicability to monitoring both muscle tissue, during arm cuff occlusions, and the brain, during frontal cortex activation.",
    "authors": [
      "Luca Giannoni",
      "Archie Barraclough",
      "Chiara Carnati",
      "Frederic Lange",
      "Ilias Tachtsidis"
    ],
    "published": "2025-12-04T13:34:35Z",
    "updated": "2025-12-04T13:34:35Z",
    "categories": [
      "physics.med-ph",
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "physics.med-ph"
  },
  {
    "arxiv_id": "2509.00732v2",
    "url": "https://arxiv.org/abs/2509.00732v2",
    "pdf_url": "https://arxiv.org/pdf/2509.00732v2.pdf",
    "title": "Classical and Quantum Beam Dynamics Simulation of the RF Photoinjector Test Bench at JINR",
    "abstract": "We present beam-dynamics simulations for an S-band RF photoinjector test bench under development at JINR, aimed at producing high-quality electron beams and enabling future generation of relativistic vortex electrons. Simulations of the 1.5-cell photogun under the presently available RF gradient of ~45 MV/m demonstrate stable bunch formation at low charge (Q = 0.63 pC), where space-charge forces are weak, and the transverse emittance is dominated by RF-induced correlations. Optimization of the injection phase and cathode-region solenoid yields a robust emittance-stabilization regime with a final normalized emittance of ~3.2 pi mm mrad. To assess prospects for accelerating structured electron beams, we additionally model the quantum evolution of single-electron Laguerre-Gaussian wave packets. The results show that multi-MeV acceleration suppresses free-space spreading and preserves the wave-packet's initial OAM structure, indicating that the test bench provides suitable conditions for forthcoming experimental studies of relativistic vortex electrons.",
    "authors": [
      "A. S. Dyatlov",
      "A. V. Afanasyev",
      "V. V. Kobets",
      "A. E. Levichev",
      "M. V. Maksimov",
      "D. A. Nikiforov",
      "M. A. Nozdrin",
      "K. A. Sibiryakova",
      "K. E. Yunenko",
      "D. V. Karlovets"
    ],
    "published": "2025-08-31T07:52:04Z",
    "updated": "2025-12-04T13:30:21Z",
    "categories": [
      "physics.acc-ph",
      "physics.atom-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.04722v1",
    "url": "https://arxiv.org/abs/2512.04722v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04722v1.pdf",
    "title": "Optimization of laser illumination configuration for directly driven inertial confinement fusion",
    "abstract": "Optimum laser configurations are presented to achieve high illumination uniformity with directly driven inertial confinement fusion targets. Assuming axisymmetric absorption pattern of individual laser beams, theoretical models are reviewed in terms of the number of laser beams, system imperfection, and laser beam patterns. Utilizing a self-organizing system of charged particles on a sphere, a simple numerical model is provided to give an optimal configuration for an arbitrary number of laser beams. As a result, such new configurations as M48 and M60 are found to show substantially higher illumination uniformity than any other existing direct drive systems. A new polar direct-drive scheme is proposed with the laser axes keeping off the target center, which can be applied to laser configurations designed for indirectly driven inertial fusion.",
    "authors": [
      "Masakatsu Murakami",
      "Daiki Nishi"
    ],
    "published": "2025-12-04T12:06:25Z",
    "updated": "2025-12-04T12:06:25Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1016/j.mre.2016.12.002"
  },
  {
    "arxiv_id": "2512.04715v1",
    "url": "https://arxiv.org/abs/2512.04715v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04715v1.pdf",
    "title": "Generation of ultrahigh field by micro-bubble implosion",
    "abstract": "Breaking the 100-MeV barrier for proton acceleration will help elucidate fundamental physics and advance practical applications from inertial confinement fusion to tumour therapy. Herein we propose a novel concept of bubble implosions. A bubble implosion combines micro-bubbles and ultraintense laser pulses of 10^20-10^22W/cm^2 to generate ultrahigh fields and relativistic protons. The bubble wall protons undergo volumetric acceleration toward the centre due to the spherically symmetric Coulomb force and the innermost protons accumulate at the centre with a density comparable to the interior of a white dwarf. Then an unprecedentedly high electric field is formed, which produces an energetic proton flash. Three-dimensional particle simulations confirm the robustness of Coulomb-imploded bubbles, which behave as nano-pulsars with repeated implosions and explosions to emit protons. Current technologies should be sufficient to experimentally verify concept of bubble implosions.",
    "authors": [
      "M. Murakami",
      "A. Arefiev",
      "M. A. Zosa"
    ],
    "published": "2025-12-04T12:01:51Z",
    "updated": "2025-12-04T12:01:51Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1038/541598-018-25594-3"
  },
  {
    "arxiv_id": "2509.13831v3",
    "url": "https://arxiv.org/abs/2509.13831v3",
    "pdf_url": "https://arxiv.org/pdf/2509.13831v3.pdf",
    "title": "Signal Processing and Machine Learning Algorithms for Precise Timing with PICOSEC Micromegas Detectors",
    "abstract": "High particle rates in current and future experiments make pile-up phenomena a critical issue for extracting useful information. In this context, timing can be important as the 4$^{\\mathrm{th}}$ dimension parameter for triggering or event reconstruction. The PICOSEC-Micromegas detector has been shown to offer precise timing of the order of tens of\\,ps. In this work, novel signal processing algorithms are being developed and evaluated to demonstrate the technology's ability for online precise timing. We propose, an algorithm based on Artificial Neural Networks (ANN). This algorithm uses a model to train the ANN. The performance of the different algorithms is evaluated using experimental data, resulting in a timing resolution of 18.3 $\\pm$ 0.6\\,ps, comparable to the standard analysis based on the Constant Fraction Discrimination technique. Additionally, an alternative algorithm using the charge of the pulse exceeding a threshold as a parameter to correct for systematic effects is reported.",
    "authors": [
      "A. Kallitsopoulou",
      "I. Maniatis",
      "I. Manthos",
      "T. Papaevangelou",
      "L. Sohl",
      "A. Tsiamis",
      "S. E. Tzamarias"
    ],
    "published": "2025-09-17T08:56:21Z",
    "updated": "2025-12-04T11:31:10Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2512.01656v2",
    "url": "https://arxiv.org/abs/2512.01656v2",
    "pdf_url": "https://arxiv.org/pdf/2512.01656v2.pdf",
    "title": "Impact of local bunching factors in single-pass THz free electron lasers",
    "abstract": "In simulations for modern free-electron lasers (FEL), shot noise plays a crucial role. While it is inversely proportional to the number of electrons, shot noise is typically modeled using macroparticles, with their bunching factors corresponding to the bunching factors of the much larger number of electrons. For short-wavelength FELs, the macroparticles are assumed to be uniformly distributed on the scale of the resonant wavelength, since shot noise dominates the initial radiation - for instance, in the self-amplified spontaneous emission (SASE) regime. In this paper, we show that this assumption does not hold at longer wavelengths, particularly in the THz range, where the bunch current profile is not uniform even within the length of the resonant wavelength. Instead, the current profile dominates the initial bunching factors, which can be several orders of magnitude higher than shot noise. The slice-based bunching factors and bunching phases are derived for Gaussian distributions and compared with shot noise under the assumption that the current within each slice remains constant. Using the THz FEL at the photoinjector test facility at DESY in Zeuthen (PITZ) as a case study, the influence of the current profile has been benchmarked through simulations under very low bunch charge, where the full number of electrons can be modeled using the Genesis1.3 code. Additional simulations with the nominal working parameters of PITZ THz FEL have been compared with experimental data, indicating better agreement when the actual current profile is taken into account.",
    "authors": [
      "Xiangkun Li",
      "Mikhail Krasilnikov"
    ],
    "published": "2025-12-01T13:29:53Z",
    "updated": "2025-12-04T11:22:47Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2512.04669v1",
    "url": "https://arxiv.org/abs/2512.04669v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04669v1.pdf",
    "title": "Progress towards a microchannel plate detector with AlGaN photocathode and cross-strip anode for ultraviolet astronomy",
    "abstract": "Microchannel plates (MCPs) were the driving detector technology for ultraviolet (UV) astronomy over many years, and still today MCP-based detectors are the baseline for several planned UV instruments. The development of advanced MCP detectors is ongoing and pursues the major goals of maximizing sensitivity, resolution, and lifetime, while at the same time decreasing weight, volume, and power consumption.   Development efforts for an MCP-based detector system for the UV are running at IAAT at the University of Tübingen. In this publication, we present our latest results towards coating aluminum gallium nitride (AlGaN) photocathodes directly on MCPs, to improve quantum detection efficiency in the far- and extreme-UV. Furthermore, we report on the implementation of a non-iterative centroiding algorithm for our coplanar cross-strip anode directly in an FPGA.",
    "authors": [
      "S. Diebold",
      "J. Barnstedt",
      "L. Conti",
      "H. R. Elsener",
      "L. Hanke",
      "M. Höltzli",
      "C. Kalkuhl",
      "D. Rau",
      "D. Schaadt",
      "T. Schanz",
      "B. Stelzer",
      "K. Werner"
    ],
    "published": "2025-12-04T11:03:00Z",
    "updated": "2025-12-04T11:03:00Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM",
    "doi": "10.1117/1.JATIS.11.4.042230"
  },
  {
    "arxiv_id": "2512.03914v2",
    "url": "https://arxiv.org/abs/2512.03914v2",
    "pdf_url": "https://arxiv.org/pdf/2512.03914v2.pdf",
    "title": "Integrating High Performance In-Memory Data Streaming and In-Situ Visualization in Hybrid MPI+OpenMP PIC MC Simulations Towards Exascale",
    "abstract": "Efficient simulation of complex plasma dynamics is crucial for advancing fusion energy research. Particle-in-Cell (PIC) Monte Carlo (MC) simulations provide insights into plasma behavior, including turbulence and confinement, which are essential for optimizing fusion reactor performance. Transitioning to exascale simulations introduces significant challenges, with traditional file input/output (I/O) inefficiencies remaining a key bottleneck. This work advances BIT1, an electrostatic PIC MC code, by improving the particle mover with OpenMP task-based parallelism, integrating the openPMD streaming API, and enabling in-memory data streaming with ADIOS2's Sustainable Staging Transport (SST) engine to enhance I/O performance, computational efficiency, and system storage utilization. We employ profiling tools such as gprof, perf, IPM and Darshan, which provide insights into computation, communication, and I/O operations. We implement time-dependent data checkpointing with the openPMD API enabling seamless data movement and in-situ visualization for real-time analysis without interrupting the simulation. We demonstrate improvements in simulation runtime, data accessibility and real-time insights by comparing traditional file I/O with the ADIOS2 BP4 and SST backends. The proposed hybrid BIT1 openPMD SST enhancement introduces a new paradigm for real-time scientific discovery in plasma simulations, enabling faster insights and more efficient use of exascale computing resources.",
    "authors": [
      "Jeremy J. Williams",
      "Stefan Costea",
      "Daniel Medeiros",
      "Jordy Trilaksono",
      "Pratibha Hegde",
      "David Tskhakaya",
      "Leon Kos",
      "Ales Podolnik",
      "Jakub Hromadka",
      "Kevin A. Huck",
      "Allen D. Malony",
      "Frank Jenko",
      "Erwin Laure",
      "Stefano Markidis"
    ],
    "published": "2025-12-03T15:59:14Z",
    "updated": "2025-12-04T10:33:41Z",
    "categories": [
      "physics.plasm-ph",
      "cs.DC",
      "cs.PF"
    ],
    "primary_category": "physics.plasm-ph"
  }
]