{
  "arxiv_id": "2510.21375v1",
  "url": "https://arxiv.org/abs/2510.21375v1",
  "pdf_url": "https://arxiv.org/pdf/2510.21375v1.pdf",
  "title": "Picosecond Precision Heavy Ion Detector for Λ hypernuclei   lifetimes studies",
  "abstract": "In this paper, we present the design and preliminary performance evaluation of a new heavy ion detector for direct measurements of heavy {\\Lambda} hypernuclei lifetimes. The detector employs the previously developed 10 picosecond resolution Radio Frequency (RF) Timer, which converts the temporal information of incident particles into spatial coordinates of secondary or photoelectrons on a position-sensitive detector by means of circular RF scanning in the 500-1000 MHz range. Here, we report the detector design to achieve efficient suppression of accidental background and effective separation of prompt reaction products and delayed events from {\\Lambda} hypernuclei decays, results of test studies carried out with RF synchronized laser as well as preliminary results obtained by using alpha particles. Dedicated Monte-Carlo simulations have been performed to estimate the detector's performance under realistic experimental conditions at RF-driven electron, photon, or proton beams. The results confirm the feasibility of the proposed design and provide a basis for upcoming experimental measurements, based on the delayed fission detection.",
  "authors": [
    "Simon Zhamkochyan",
    "Sergey Abrahamyan",
    "Amur Margaryan",
    "Hayk Elbakyan",
    "Aram Kakoyan",
    "Samvel Mayilyan",
    "Artashes Papyan",
    "Hasmik Rostomyan",
    "Anna Safaryan",
    "Gagik Sughyan",
    "Narek Margaryan",
    "Garnik Ayvazyan",
    "John Annand",
    "Kenneth Livingston",
    "Rachel Montgomery",
    "Patrick Achenbach",
    "Josef Pochodzalla",
    "Dimiter Balabanski",
    "Satoshi Nakamura",
    "Ani Aprahamian",
    "Vanik Kakoyan"
  ],
  "published": "2025-10-24T11:58:51Z",
  "updated": "2025-10-24T11:58:51Z",
  "categories": [
    "physics.ins-det"
  ],
  "primary_category": "physics.ins-det"
}