[
  {
    "arxiv_id": "2510.21676v1",
    "url": "https://arxiv.org/abs/2510.21676v1",
    "pdf_url": "https://arxiv.org/pdf/2510.21676v1.pdf",
    "title": "Constructing Field Aligned Coordinate Systems for Gyrokinetic   Simulations of Tokamaks in X-point Geometries",
    "abstract": "Structures in tokamak plasmas are elongated along the direction of the magnetic field and short in the directions perpendicular to the magnetic field. Many tokamak simulation codes take advantage of this by using a field aligned coordinate system. However, field aligned coordinate systems have a coordinate singularity at magnetic X-points where the poloidal magnetic field vanishes, which makes it difficult to use field aligned coordinate systems when simulating the core and scrape-off layer (SOL) simultaneously. Here we present an algorithm for computing geometric quantities in a standard field aligned coordinate system that avoids the singularity and allows one to conduct 2D axisymmetric simulations in X-point geometries. We demonstrate the efficacy of this algorithm with an example simulation of the Spherical Tokamak for Energy Production (STEP).",
    "authors": [
      "Akash Shukla",
      "Ammar Hakim",
      "James Juno",
      "Gregory Hammett",
      "Manaure Francisquez"
    ],
    "published": "2025-10-24T17:31:59Z",
    "updated": "2025-10-24T17:31:59Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.21675v1",
    "url": "https://arxiv.org/abs/2510.21675v1",
    "pdf_url": "https://arxiv.org/pdf/2510.21675v1.pdf",
    "title": "Counter-Streaming Beams in Collisionless Pair Plasma Instability Systems   III: Collisionless Heating, Acceleration, and Radiation",
    "abstract": "Energetic astrophysical phenomena, such as $\\gamma$-ray bursts and supernova explosion-driven shocks in collisionless plasmas, involve various plasma kinetic instabilities, such as the Weibel instability. These systems support various types of particle acceleration and radiation through a variety of mechanisms. In this paper, we explore the energy transformations and dynamical effects of violent filament mergers seen between the large current filaments formed by the Weibel instability. The radiative processes involved in the Weibel instability filament building are also discussed in relation to jitter and synchrotron radiation.",
    "authors": [
      "Michael C. Sitarz"
    ],
    "published": "2025-10-24T17:30:14Z",
    "updated": "2025-10-24T17:30:14Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.21666v1",
    "url": "https://arxiv.org/abs/2510.21666v1",
    "pdf_url": "https://arxiv.org/pdf/2510.21666v1.pdf",
    "title": "Counter-Streaming Beams in Collisionless Pair Plasma Instability Systems   II: Spectral Cone and Spectral Wave Mode Analysis",
    "abstract": "Energetic astrophysical phenomena, such as $\\gamma$-ray bursts, supernova explosions, and magnetar flares occur in collisionless plasmas and involve various plasma kinetic and magnetohydrodynamic instabilities. In this paper, we explore the spectral trends of the Weibel instability using spectral analysis of particle-in-cell simulations. Power dependence on viewing angle and frequency are explored and the relation to the results of the first paper in this series is discussed.",
    "authors": [
      "Michael C. Sitarz"
    ],
    "published": "2025-10-24T17:24:02Z",
    "updated": "2025-10-24T17:24:02Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.19568v2",
    "url": "https://arxiv.org/abs/2508.19568v2",
    "pdf_url": "https://arxiv.org/pdf/2508.19568v2.pdf",
    "title": "Molecular structure, electric property, and scintillation and quenching   of liquid scintillators",
    "abstract": "Liquid scintillators are widely used in particle and nuclear physics. Understanding the scintillation and quenching mechanisms is a fundamental issue in designing a high-light-yield liquid scintillator. In this work, the basic scintillation process for two-component liquid scintillators is reviewed, highlighting the processes of excitation, ionization, anion-cation recombination, and electric dipole-dipole energy transfer. A molecule's polar group, polarization characteristics, and the corresponding material's dielectric constant are found to be correlated with a liquid scintillator's scintillation efficiency. Polar groups and high relative dielectric constant (permittivity) can cause severe quenching and should be avoided. The tellurium loading scheme in the liquid scintillator of the SNO+ experiment, TeBD, is discussed. The hydroxyl groups introduce polar structures in the TeBD, and the relative dielectric constant of our reproduced sample is measured to be $17\\pm2$. These discussions explain part of the quenching of the TeBD liquid scintillator.",
    "authors": [
      "Zhe Wang",
      "Ye Liang",
      "Haozhe Sun"
    ],
    "published": "2025-08-27T04:55:20Z",
    "updated": "2025-10-24T16:18:27Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.21534v1",
    "url": "https://arxiv.org/abs/2510.21534v1",
    "pdf_url": "https://arxiv.org/pdf/2510.21534v1.pdf",
    "title": "TES Proton Irradiation Result Analysis for Future Space Applications",
    "abstract": "As observed on the signal of the Planck-HFI highly sensitive bolometers, the effect of cosmic rays on detectors is a major concern for future similar space missions. Their instruments will have a larger detection surface, increased sensitivity, and more stringent requirements on the suppression of systematic effects. To study the impact of cosmic rays on detector prototypes in operational conditions, IAS has designed a state-of-the-art cryogenic system to irradiate particles by coupling this facility to particle accelerators. An irradiation campaign has been carried out on LiteBIRD-HFT TES prototypes to study their response to particle hits. In this article, we present the results and the analysis of this first test campaign.",
    "authors": [
      "A. Besnard",
      "V. Sauvage",
      "S. L. Stever",
      "B. Maffei",
      "P. dal Bo",
      "T. Lari",
      "M. de Lucia",
      "A. Tartari",
      "G. Signorelli",
      "J. Hubmayr",
      "G. Jaehnig"
    ],
    "published": "2025-10-24T15:01:02Z",
    "updated": "2025-10-24T15:01:02Z",
    "categories": [
      "physics.ins-det",
      "astro-ph.IM"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.20517v2",
    "url": "https://arxiv.org/abs/2510.20517v2",
    "pdf_url": "https://arxiv.org/pdf/2510.20517v2.pdf",
    "title": "Basic considerations in the design of an electrostatic electron   monochromator",
    "abstract": "Monochromators are an essential component in electron microscopy and spectroscopy for enhancing the spatial and energy resolution. However, its adoption in scanning electron microscopes remains limited because of its high cost and operational complexity. Through a thin-deflector analysis of an electrostatic homogeneous-field deflector, the extreme sensitivity of current monochromators to power supply drift and mechanical imperfections is demonstrated. These stringent alignment requirements for achieving optimal energy resolution often necessitate the use of additional correcting elements, adding to both cost and complexity. We demonstrate that the fringe-field deflector is instead less sensitive to these issues. Hence, a cost effective and simple monochromator design approach based on pure fringe fields is proposed. This monochromator does not need extra correcting elements and its optimal energy resolution is achieved by including momentary deceleration lenses surrounding the main deflector. This fully electrostatic design could be realized using MEMS technology, offering a simpler and more accessible approach for filtering beam energies.",
    "authors": [
      "M. J. Adriaans",
      "J. P. Hoogenboom",
      "A. Mohammadi-Gheidari"
    ],
    "published": "2025-10-23T13:00:31Z",
    "updated": "2025-10-24T14:34:06Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.21458v1",
    "url": "https://arxiv.org/abs/2510.21458v1",
    "pdf_url": "https://arxiv.org/pdf/2510.21458v1.pdf",
    "title": "Constraints on ultra-heavy dark matter from the CDEX-10 experiment at   the China Jinping Underground Laboratory",
    "abstract": "We report a search for ultra-heavy dark matter (UHDM) with the CDEX-10 experiment at the China Jinping Underground Laboratory (CJPL). Using a Monte Carlo framework that incorporates Earth shielding effects, we simulated UHDM propagation and energy deposition in p-type point-contact germanium detectors ($p$PCGe). Analysis of 205.4 kg$\\cdot$day exposure in the 0.16-4.16 keVee range showed no excess above background. Our results exclude the spin-independent UHDM-nucleon scattering with two cross section scales, with the UHDM mass from $10^6$ GeV to $10^{11}$ GeV, and provide the most stringent constraints with solid-state detectors below $10^8$ GeV.",
    "authors": [
      "Y. F. Wang",
      "L. T. Yang",
      "Q. Yue",
      "K. J. Kang",
      "Y. J. Li",
      "H. P. An",
      "Greeshma C.",
      "J. P. Chang",
      "H. Chen",
      "Y. H. Chen",
      "J. P. Cheng",
      "J. Y. Cui",
      "W. H. Dai",
      "Z. Deng",
      "Y. X. Dong",
      "C. H. Fang",
      "H. Gong",
      "Q. J. Guo",
      "T. Guo",
      "X. Y. Guo",
      "L. He",
      "J. R. He",
      "H. X. Huang",
      "T. C. Huang",
      "S. Karmakar",
      "Y. S. Lan",
      "H. B. Li",
      "H. Y. Li",
      "J. M. Li",
      "J. Li",
      "M. C. Li",
      "Q. Y. Li",
      "R. M. J. Li",
      "X. Q. Li",
      "Y. L. Li",
      "Y. F. Liang",
      "B. Liao",
      "F. K. Lin",
      "S. T. Lin",
      "J. X. Liu",
      "R. Z. Liu",
      "S. K. Liu",
      "Y. D. Liu",
      "Y. Liu",
      "Y. Y. Liu",
      "H. Ma",
      "Y. C. Mao",
      "A. Mureed",
      "H. Pan",
      "N. C. Qi",
      "J. Ren",
      "X. C. Ruan",
      "M. B. Shen",
      "H. Y. Shi",
      "M. K. Singh",
      "T. X. Sun",
      "W. L. Sun",
      "C. J. Tang",
      "Y. Tian",
      "H. F. Wan",
      "G. F. Wang",
      "J. Z. Wang",
      "L. Wang",
      "Q. Wang",
      "Q. Wang",
      "Y. X. Wang",
      "H. T. Wong",
      "Y. C. Wu",
      "H. Y. Xing",
      "K. Z. Xiong",
      "R. Xu",
      "Y. Xu",
      "T. Xue",
      "Y. L. Yan",
      "N. Yi",
      "C. X. Yu",
      "H. J. Yu",
      "X. Yu",
      "M. Zeng",
      "Z. Zeng",
      "F. S. Zhang",
      "P. Zhang",
      "P. Zhang",
      "Z. Y. Zhang",
      "M. G. Zhao",
      "J. F. Zhou",
      "Z. Y. Zhou",
      "J. J. Zhu"
    ],
    "published": "2025-10-24T13:38:21Z",
    "updated": "2025-10-24T13:38:21Z",
    "categories": [
      "hep-ex",
      "hep-ph",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2510.21375v1",
    "url": "https://arxiv.org/abs/2510.21375v1",
    "pdf_url": "https://arxiv.org/pdf/2510.21375v1.pdf",
    "title": "Picosecond Precision Heavy Ion Detector for Λ hypernuclei   lifetimes studies",
    "abstract": "In this paper, we present the design and preliminary performance evaluation of a new heavy ion detector for direct measurements of heavy {\\Lambda} hypernuclei lifetimes. The detector employs the previously developed 10 picosecond resolution Radio Frequency (RF) Timer, which converts the temporal information of incident particles into spatial coordinates of secondary or photoelectrons on a position-sensitive detector by means of circular RF scanning in the 500-1000 MHz range. Here, we report the detector design to achieve efficient suppression of accidental background and effective separation of prompt reaction products and delayed events from {\\Lambda} hypernuclei decays, results of test studies carried out with RF synchronized laser as well as preliminary results obtained by using alpha particles. Dedicated Monte-Carlo simulations have been performed to estimate the detector's performance under realistic experimental conditions at RF-driven electron, photon, or proton beams. The results confirm the feasibility of the proposed design and provide a basis for upcoming experimental measurements, based on the delayed fission detection.",
    "authors": [
      "Simon Zhamkochyan",
      "Sergey Abrahamyan",
      "Amur Margaryan",
      "Hayk Elbakyan",
      "Aram Kakoyan",
      "Samvel Mayilyan",
      "Artashes Papyan",
      "Hasmik Rostomyan",
      "Anna Safaryan",
      "Gagik Sughyan",
      "Narek Margaryan",
      "Garnik Ayvazyan",
      "John Annand",
      "Kenneth Livingston",
      "Rachel Montgomery",
      "Patrick Achenbach",
      "Josef Pochodzalla",
      "Dimiter Balabanski",
      "Satoshi Nakamura",
      "Ani Aprahamian",
      "Vanik Kakoyan"
    ],
    "published": "2025-10-24T11:58:51Z",
    "updated": "2025-10-24T11:58:51Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.21288v1",
    "url": "https://arxiv.org/abs/2510.21288v1",
    "pdf_url": "https://arxiv.org/pdf/2510.21288v1.pdf",
    "title": "Bayesian approach for spatial super-resolution of heterodyne wind lidars",
    "abstract": "Wind speed measurements using heterodyne lidars are limited in spatial resolution because of the current signal processing methods. This limit is equal to c $\\tau$ ( c is the speed of light and $\\tau$ is the laser pulse duration) corresponding to the length of the atmosphere contributing to the wind speed measurement at one distance. To go beyond this limit, we use an inverse problem approach based on a model of the spectrogram (concatenation of periodograms of each range) and prior distributions on our unknowns: backscattering amplitude and wind speed at each range. We apply our inversion method to simulated and experimental spectrograms, demonstrating a gain in resolution by a factor of 2 to 2.5 depending on the signal-to-noise ratio.",
    "authors": [
      "Theo Martin",
      "Laurent Mugnier",
      "Matthieu Valla",
      "Pierre Etienne Allain",
      "David Tomline Michel"
    ],
    "published": "2025-10-24T09:37:42Z",
    "updated": "2025-10-24T09:37:42Z",
    "categories": [
      "physics.ins-det",
      "physics.optics"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.21261v1",
    "url": "https://arxiv.org/abs/2510.21261v1",
    "pdf_url": "https://arxiv.org/pdf/2510.21261v1.pdf",
    "title": "Benchmark for two-dimensional large scale coherent structures in   partially magnetized ExB plasmas -- Community collaboration & lessons learned",
    "abstract": "Low-temperature plasmas are essential to both fundamental scientific research and critical industrial applications. As in many areas of science, numerical simulations have become a vital tool for uncovering new physical phenomena and guiding technological development. Code benchmarking remains crucial for verifying implementations and evaluating performance. This work continues the Landmark benchmark initiative, a series specifically designed to support the verification of low-temperature plasma codes. In this study, seventeen simulation codes from a collaborative community of nineteen international institutions modeled a partially magnetized ExB Penning discharge. The emergence of large scale coherent structures, or rotating plasma spokes, endows this configuration with an enormous range of time scales, making it particularly challenging to simulate. The codes showed excellent agreement on the rotation frequency of the spoke as well as key plasma properties, including time-averaged ion density, plasma potential, and electron temperature profiles. Achieving this level of agreement came with challenges, and we share lessons learned on how to conduct future benchmarking campaigns. Comparing code implementations, computational hardware, and simulation runtimes also revealed interesting trends, which are summarized with the aim of guiding future plasma simulation software development.",
    "authors": [
      "Andrew T. Powis",
      "Eduardo Ahedo",
      "Alejandro Álvarez Laguna",
      "Nicolas Barléon",
      "Enrique Bello-Benítez",
      "Lucas Beving",
      "Jean-Pierre Boeuf",
      "Guillaume Bogopolsky",
      "Anne Bourdon",
      "Filippo Cichocki",
      "Bénédicte Cuenot",
      "Andrew Denig",
      "Zoltán Donkó",
      "Paul-Quentin Elias",
      "Miguel P. Encinar",
      "Denis Eremin",
      "Pablo Fajardo",
      "Farbod Faraji",
      "Gwenael Fubiani",
      "Laurent Garrigues",
      "Kentaro Hara",
      "Peter Hartmann",
      "Matthew Hopkins",
      "Igor D. Kaganovich",
      "Aaron Knoll",
      "Giovanni Lapenta",
      "Thierry E. Magin",
      "Alberto Marín-Cebrián",
      "Mario Merino",
      "Pierpaolo Minelli",
      "Mina Papahn Zadeh",
      "Pietro Parodi",
      "Federico Petronio",
      "Maryam Reza",
      "Andrei I. Smolyakov",
      "Dmytro Sydorenko",
      "Francesco Taccogna",
      "Miles M. Turner",
      "Olivier Vermorel",
      "Willca Villafana",
      "Liang Xu"
    ],
    "published": "2025-10-24T08:47:57Z",
    "updated": "2025-10-24T08:47:57Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.20728v2",
    "url": "https://arxiv.org/abs/2508.20728v2",
    "pdf_url": "https://arxiv.org/pdf/2508.20728v2.pdf",
    "title": "Photon reconstruction using the Hough transform in imaging calorimeters",
    "abstract": "Photon reconstruction in calorimeters represents a crucial challenge in particle physics experiments, especially in high-density environments where shower overlapping probabilities become significant. We present an energy-core-based photon reconstruction method. It is achieved through extending the application of the Hough transform to exploit the energy-core structure of photon showers. The method, validated through simulations of the CEPC crystal electromagnetic calorimeter, demonstrates outstanding performance. It achieves a reconstruction efficiency of nearly 100% for photons with energies exceeding 2 GeV and a separation efficiency approaching 100% for two 5 GeV photons, when the distance between them reaches the granularity limit of the calorimeter. This energy-core-based photon reconstruction method, integrated with an energy splitting technique, enhances the performance of photon measurement and provides a promising tool for imaging calorimeters, particularly those requiring high precision in photon detection in complex event topologies with high multiplicity.",
    "authors": [
      "Yang Zhang",
      "Shengsen Sun",
      "Weizheng Song",
      "Fangyi Guo",
      "Yuanzhan Wang",
      "Linghui Wu",
      "Yifang Wang"
    ],
    "published": "2025-08-28T12:50:29Z",
    "updated": "2025-10-24T08:33:46Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.21239v1",
    "url": "https://arxiv.org/abs/2510.21239v1",
    "pdf_url": "https://arxiv.org/pdf/2510.21239v1.pdf",
    "title": "Laboratory formation of scaled astrophysical outflows",
    "abstract": "Astrophysical systems exhibit a rich diversity of outflow morphologies, yet their mechanisms and existence conditions remain among the most persistent puzzles in the field. Here we present scaled laboratory experiments based on laser-driven plasma outflow into magnetized ambient gas, which mimic five basic astrophysical outflows regulated by interstellar medium, namely collimated jets, blocked jets, elliptical bubbles, as well as spherical winds and bubbles. Their morphologies and existence conditions are found to be uniquely determined by the external Alfvenic and sonic Mach numbers Me-a and Me-s, i.e. the relative strengths of the outflow ram pressure against the magnetic/thermal pressures in the interstellar medium, with transitions occurring at Me-a ~ 2 and 0.5, as well as Me-s ~ 1. These results are confirmed by magnetohydrodynamics simulations and should also be verifiable from existing and future astronomical observations. Our findings provide a quantitative framework for understanding astrophysical outflows.",
    "authors": [
      "Shun-yi Yang",
      "Tao Tao",
      "Guang-yue Hu",
      "Chao Xiong",
      "Tian-yi Li",
      "Xue-cheng Li",
      "Hui-bo Tang",
      "Shuo-ting Shao",
      "Xiang Lv",
      "Chen Zhang",
      "Ming-yang Yang"
    ],
    "published": "2025-10-24T08:20:07Z",
    "updated": "2025-10-24T08:20:07Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2406.14234v2",
    "url": "https://arxiv.org/abs/2406.14234v2",
    "pdf_url": "https://arxiv.org/pdf/2406.14234v2.pdf",
    "title": "Feed-forward active magnetic shielding",
    "abstract": "Magnetic fields from the brain are tiny relative to ambient fields which therefore need to be suppressed. The common solution of passive shielding is expensive, bulky and insufficiently effective, thus motivating research into the alternative of active shielding which comes in two flavours: feed-back and feed-forward. In feed-back designs (the most common), corrective fields are created by coils driven from sensors within the area that they correct, for example from the main sensors of an MEG device. In feed-forward designs (less common), corrective fields are driven from dedicated reference sensors outside the area they correct. Feed-forward can achieve better performance than feed-back, in principle, however its implementation is hobbled by an unavoidable coupling between coils and reference sensors, which reduces the effectiveness of the shielding and may affect stability, complicating the design. This paper suggests a solution that relies on a ``decoupling matrix,\" inserted in the signal pathway between sensors and corrective coils, to counteract the spurious coupling. This allows feed-forward shielding do reduce the ambient field to zero across the full frequency range, in principle, although performance may be limited by other factors such as current noise. The solution, which is fully data-driven and does not require geometric calculations, high-tolerance fabrication, or physical calibration, has been evaluated by simulation, but not implemented in hardware. It might contribute to the deployment of a new generation of measurement systems based on optically-pumped magnetometers (OPM). The lower cost and reduced constraints of those systems are a strong incentive to likewise reduce the cost and constraints of the shielding required to operate them, hence the appeal of active shielding.",
    "authors": [
      "Alain de Cheveigné"
    ],
    "published": "2024-06-20T11:57:11Z",
    "updated": "2025-10-24T08:17:43Z",
    "categories": [
      "physics.med-ph",
      "cs.HC",
      "eess.SP",
      "physics.ins-det",
      "q-bio.NC"
    ],
    "primary_category": "physics.med-ph"
  },
  {
    "arxiv_id": "2504.19236v2",
    "url": "https://arxiv.org/abs/2504.19236v2",
    "pdf_url": "https://arxiv.org/pdf/2504.19236v2.pdf",
    "title": "Neutron source-based event reconstruction algorithm in large liquid   scintillator detectors",
    "abstract": "We developed an event reconstruction algorithm, applicable to large liquid scintillator detectors, built primarily upon neutron calibration data. We employ a likelihood method using photon detection time and charge information from individual photomultiplier tubes. Detector response tables in the likelihood function were derived from americium-carbon neutron source events, 2.2~MeV $\\gamma$-ray events from cosmic-ray muon spallation neutrons, and laser calibration events. This algorithm can reconstruct the event position, energy, and also has capability to differentiate particle types for events within the energy range of reactor neutrinos. Using the detector simulation of the Jiangmen Underground Neutrino Observatory (JUNO) experiment as a large liquid scintillator detector example, we demonstrate that the presented reconstruction algorithm has a reconstructed position accuracy within $\\pm$4~cm, and a reconstructed energy non-uniformity under 0.5\\% throughout the central detector volume. The vertex resolution for positron events at 1~MeV is estimated to be around 9~cm, and the energy resolution is confirmed to be comparable to that in the JUNO official publication. Furthermore, the algorithm can eliminate 80\\% (45\\%) of $\\alpha$-particle (fast-neutron) events while maintaining a positron event selection efficiency of approximately 99\\%.",
    "authors": [
      "Akira Takenaka",
      "Zhangming Chen",
      "Arran Freegard",
      "Junting Huang",
      "Jiaqi Hui",
      "Haojing Lai",
      "Rui Li",
      "Yilin Liao",
      "Jianglai Liu",
      "Yue Meng",
      "Iwan Morton-Blake",
      "Ziqian Xiang",
      "Ping Zhang"
    ],
    "published": "2025-04-27T13:39:02Z",
    "updated": "2025-10-24T07:11:39Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1140/epjc/s10052-025-14808-4"
  },
  {
    "arxiv_id": "2510.16936v2",
    "url": "https://arxiv.org/abs/2510.16936v2",
    "pdf_url": "https://arxiv.org/pdf/2510.16936v2.pdf",
    "title": "Ionization quenching factors and W-values of low-energy H$_2^+$ and   He$^+$ ions in Ar gas at low pressure measured with a bulk resistive   MICROMEGAS",
    "abstract": "The ionization quenching factor, the fraction of an ion's initial kinetic energy lost through ionization in a medium, was measured for H$_2^+$ and He$^+$ ions within the 2.5-5 keV energy range in an Ar/CO$_2$ gas mixture at pressures between 75 and 150 mbar. The mixture was contained in the active volume of a MICROMEGAS type Micro Pattern Gaseous Detector (MPGD), which was connected to an ion source via a high vacuum system. The results showed a significant decrease in ionization as the ion energy decreased, although no dependence on gas pressure was observed within the low pressure range studied. Additionally, significant deviations from the predictions of SRIM (Stopping and Range of Ions in Matter) simulations were found. These measurements also allowed the first determination of $W$ values (the average energy required to create an electron-ion pair in the gas) for H$_2^+$ and He$^+$ ions in Ar at this particular energy range, which had not been previously explored for these projectile-target combinations. These findings are essential for accurate ion energy reconstruction in low-pressure MPGDs, with particular relevance for space-based energetic neutral atom detection, as proposed by the Italian Space Agency's SWEATERS project.",
    "authors": [
      "A. Foresi",
      "G. Antonelli",
      "C. Avanzini",
      "G. Balestri",
      "G. Bigongiari",
      "E. Bossini",
      "M. G. Callaini",
      "R. Carosi",
      "E. De Angelis",
      "F. Frasconi",
      "P. Maestro",
      "F. Morsani",
      "A. Mura",
      "L. Orsini",
      "G. Petragnani",
      "F. Pilo",
      "R. Rispoli",
      "G. Terreni"
    ],
    "published": "2025-10-19T17:15:49Z",
    "updated": "2025-10-24T06:46:05Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1016/j.nima.2025.171066"
  },
  {
    "arxiv_id": "2510.21187v1",
    "url": "https://arxiv.org/abs/2510.21187v1",
    "pdf_url": "https://arxiv.org/pdf/2510.21187v1.pdf",
    "title": "Dissipation and particle acceleration at intermittent structures with   velocity and magnetic shear: Interaction of Kelvin-Helmholtz and Drift-Kink   instabilities",
    "abstract": "We present two-dimensional (2D) particle-in-cell simulations of a magnetized, collisionless, relativistic pair plasma subjected to combined velocity and magnetic-field shear, a scenario typical at intermittent structures in plasma turbulence. We create conditions where only the Kelvin-Helmholtz (KH) and Drift-Kink (DK) instabilities can develop, while tearing modes are forbidden. The interaction of DKI and KHI generates qualitatively new structures, marked by a thickened shear layer with very weak electromagnetic field, modulated by KH vortices. Over a range of moderately strong velocity shears explored, the interaction of DKI and KHI results in a significant enhancement of dissipation over cases with only velocity shear or only magnetic shear. Moreover, we observe a new and efficient way of particle acceleration where particles are stochastically accelerated by the motional electric field exterior to the shear layer as they meander in an S-shaped pattern in and out of it. This process takes advantage of the bent geometry of the shear layer caused by the DK-KHI interaction and is responsible for most of the highest-energy particles produced in our simulations. These results further our understanding of dissipation and particle acceleration at intermittent structures, which are present in plasma turbulence across a wide range of astrophysical contexts such as in AGN jet sheaths, potentially relevant to limb-brightened emission, etc., and highlight the sensitivity of dissipation to multiple interacting instabilities, thus providing a strong motivation for further studies of their nonlinear interaction at the kinetic level.",
    "authors": [
      "Tsun Hin Navin Tsung",
      "Gregory R. Werner",
      "Dmitri A. Uzdensky",
      "Mitchell C. Begelman"
    ],
    "published": "2025-10-24T06:32:30Z",
    "updated": "2025-10-24T06:32:30Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2510.21170v1",
    "url": "https://arxiv.org/abs/2510.21170v1",
    "pdf_url": "https://arxiv.org/pdf/2510.21170v1.pdf",
    "title": "Inhomogeneous mixing: From microscopic dynamics to mesoscopic staircases",
    "abstract": "Inhomogeneous mixing and the consequent mesoscopic layered structure have been observed in many physical systems, including magnetically confined fusion plasmas. Especially, in plasmas, mixing can be enhanced through turbulence spreading by intermittent coherent structures (blobs/voids), or suppressed due to the formation of transport barriers (sheared zonal flows). Interestingly, blobs/voids and zonal flows are not independent, and they can co-exist in a state of inhomogeneous mixing, often called the E x B staircase. In this paper, we first introduce recent experimental progress on the physics of blobs/voids: how turbulence spreading by blobs/voids occurs, the consequences of enhanced turbulence spreading for the power decay length, and the interaction between blobs/voids and zonal flows. Then, we provide a brief review of experimental results on staircases, or more generally layered mesoscopic transport barriers. Staircases are often elusive and different complementary methods have been utilized to identify them, but our understanding is still incomplete. This paper serves as an initial step toward applying insights gained from inhomogeneous mixing due to blobs/voids to the understanding of a staircase.",
    "authors": [
      "T. Long",
      "M. J. Choi",
      "P. H. Diamond"
    ],
    "published": "2025-10-24T05:50:33Z",
    "updated": "2025-10-24T05:50:33Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2508.04232v2",
    "url": "https://arxiv.org/abs/2508.04232v2",
    "pdf_url": "https://arxiv.org/pdf/2508.04232v2.pdf",
    "title": "Enhanced sensitivity to trace $^{238}$U impurity of sapphire via   coincidence neutron activation analysis",
    "abstract": "Sapphire has mechanical and electrical properties that are advantageous for the construction of internal components of radiation detectors such as time projection chambers and bolometers. However, it has proved difficult to assess its $\\rm ^{232}Th$ and $\\rm ^{238}U$ content down to the picogram per gram level. This work reports an experimental verification of a computational study that demonstrates $\\gamma\\gamma$ coincidence counting, coupled with neutron activation analysis (NAA), can reach ppt sensitivities. Combining results from $\\gamma\\gamma$ coincidence counting with those of earlier single-$\\gamma$ counting based NAA shows that a sample of Saint Gobain sapphire has $\\rm ^{232}Th$ and $\\rm ^{238}U$ concentrations of $<0.26$ ppt and $<2.3$ ppt, respectively; the best constraints on the radiopurity of sapphire.",
    "authors": [
      "D. Chernyak",
      "I. J. Arnquist",
      "T. Daniels",
      "S. W. Finch",
      "L. Hissong",
      "M. Hughes",
      "R. MacLellan",
      "A. Piepke",
      "A. Pocar",
      "R. Roshong",
      "R. Saldanha",
      "R. H. M. Tsang"
    ],
    "published": "2025-08-06T09:15:19Z",
    "updated": "2025-10-24T02:29:29Z",
    "categories": [
      "nucl-ex",
      "physics.ins-det"
    ],
    "primary_category": "nucl-ex",
    "doi": "10.1103/zgzm-w5f4"
  },
  {
    "arxiv_id": "2510.21064v1",
    "url": "https://arxiv.org/abs/2510.21064v1",
    "pdf_url": "https://arxiv.org/pdf/2510.21064v1.pdf",
    "title": "Efficient Water-Cooled Bitter-Type Electromagnet for Zeeman Slowing in   Cold-Atom Experiments",
    "abstract": "We describe the design, construction, and characterization of a Bitter-type electromagnet that produces a spatially-dependent magnetic field used for Zeeman slowing in cold-atom experiments. The coil consists of stacked copper arcs separated by PTFE spacers of varying thicknesses, generating a near-optimal field profile using a single power supply. With an electrical resistance of $26.5(3)$~m$\\Omega$ and self-inductance of $19.1(1)$~$\\mu$H, our design achieves a fast electrical switching time of $\\tau \\approx 180$~$\\mu$s in a compact, 30-cm-long package. Water circulating helically through holes in the copper and channels in the spacers ensures efficient thermal management, limiting the temperature rise to $\\sim 5^\\circ$~C over $36$~s of continuous operation at $200$~A.",
    "authors": [
      "Rishav Koirala",
      "Ben A. Olsen"
    ],
    "published": "2025-10-24T00:36:17Z",
    "updated": "2025-10-24T00:36:17Z",
    "categories": [
      "physics.atom-ph",
      "physics.ins-det"
    ],
    "primary_category": "physics.atom-ph"
  },
  {
    "arxiv_id": "2506.12550v2",
    "url": "https://arxiv.org/abs/2506.12550v2",
    "pdf_url": "https://arxiv.org/pdf/2506.12550v2.pdf",
    "title": "Emission Properties of a Hybrid Metallized Diamond(001) Photocathode",
    "abstract": "The spectral emission characteristics of a proof-of-concept hybrid metallized diamond(001) photocathode are presented. The quantum efficiency (QE) is shown to be determined by the photo-injection efficiency across the ohmic contact at the back metallized face, whereas the mean transverse energy (MTE) of the photoemitted electrons is consistent with a (optical)phonon-assisted and momentum-resonant Franck-Condon mechanism [Phys. Rev. Applied 23, 054065 (2025)] following electron drift transport to the untreated diamond(001) front emission face. Emission is observed from both the lower and upper conduction bands of diamond with positive and negative electron affinity respectively. A potential route to the realization of a red-visible photocathode based on this concept with a sub-50meV MTE and a QE greater than 0.1% is discussed.",
    "authors": [
      "Louis A. Angeloni",
      "Ir-Jene Shan",
      "W. Andreas Schroeder"
    ],
    "published": "2025-06-14T15:48:21Z",
    "updated": "2025-10-23T23:49:02Z",
    "categories": [
      "physics.acc-ph",
      "cond-mat.mtrl-sci",
      "cond-mat.other"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.21036v1",
    "url": "https://arxiv.org/abs/2510.21036v1",
    "pdf_url": "https://arxiv.org/pdf/2510.21036v1.pdf",
    "title": "LLRF System Analysis for the Fermilab PIP-II Superconducting LINAC",
    "abstract": "PIP-II is a superconducting linac that is in the initial acceleration chain for the Fermilab accelerator complex. The RF system consists of a warm front-end with an RFQ and buncher cavities along with 25 superconducting cryo-modules comprised of cavities with five different acceleration \\(\\beta\\). The LLRF system for the linac has to provide field and resonance control for a total of 125 RF cavities. Various components of the LLRF system have been tested with and without beam at the PIP-II test stands. The LLRF system design is derived from the LCLS-II project with its self-excited loop architecture used in the majority of the cryo-modules. The PIP-II beam loading at 2 mA is much higher than the LCLS-II linac. The control system architecture is analyzed and evaluated for the operational limits of feedback gains and their ability to meet the project regulation requirements for cavity field amplitude and phase regulation.",
    "authors": [
      "P. Varghese",
      "S. Raman",
      "M. Guran",
      "L. Reyes",
      "L. Doolittle",
      "Q. Du",
      "S. Murthy"
    ],
    "published": "2025-10-23T22:40:26Z",
    "updated": "2025-10-23T22:40:26Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.20980v1",
    "url": "https://arxiv.org/abs/2510.20980v1",
    "pdf_url": "https://arxiv.org/pdf/2510.20980v1.pdf",
    "title": "Grain Boundary Diffusion in Yukawa Crystals",
    "abstract": "We present calculations of diffusion coefficients in grain boundaries in Yukawa crystals for astrophysics. Our methods follow from our recent work calculating diffusion coefficients in perfect body-centered cubic crystals. These diffusion coefficients show only a weak dependence on the crystal orientations at the grain boundary and are consistent with those expected for a supercooled liquid scaled down by one to two orders of magnitude. We argue that the local disorder at the grain boundary produces a landscape of potential barriers similar to that of an amorphous liquid thin film, significantly reducing activation barriers to diffusive hops relative to the bulk solid. This also introduces a screening dependence, such that boundary diffusion does not exhibit the same universality as the bulk crystal. These diffusion coefficients suggest that grain boundaries may be a dominant source of viscous dissipation in neutron star crusts.",
    "authors": [
      "Matthew E. Caplan",
      "Nevin T. Smith",
      "Dany Yaacoub",
      "Roberto F. Serrano",
      "Elias Taira",
      "Ashley Bransgrove"
    ],
    "published": "2025-10-23T20:17:51Z",
    "updated": "2025-10-23T20:17:51Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.HE",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.20977v1",
    "url": "https://arxiv.org/abs/2510.20977v1",
    "pdf_url": "https://arxiv.org/pdf/2510.20977v1.pdf",
    "title": "Significant Amplification of Turbulent Energy Dissipation through the   Shock Transition at Mars",
    "abstract": "Turbulence is fundamental to energy transfer across scales in space and astrophysical plasmas. Bow shock interactions have long been hypothesized to significantly modify turbulence in planetary environments, yet the quantification of such effects and their parametric dependencies remain largely unaddressed. Using in situ long-term high-time resolution measurements from NASA's MAVEN mission, we report the first observational characterization of the evolution and parametric dependence of the turbulence energy cascade rate $\\varepsilon_C$ at magnetohydrodynamic (MHD) scales. Key findings reveal an averaged three-order-of-magnitude enhancement in $\\varepsilon_C$ when transitioning from the solar wind to the magnetosheath. Notably, downstream measurements of oblique and quasi-perpendicular shocks exhibit higher energy dissipation rates than those of quasi-parallel configurations. These results provide the first direct evidence linking shock obliquity to turbulence amplification, offering key insights into shock-mediated turbulence in similar but inaccessible systems.",
    "authors": [
      "Wence Jiang",
      "Hui Li",
      "Nahuel Andrés",
      "Lina Hadid",
      "Daniel Verscharen",
      "Chi Wang"
    ],
    "published": "2025-10-23T20:14:41Z",
    "updated": "2025-10-23T20:14:41Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.20924v1",
    "url": "https://arxiv.org/abs/2510.20924v1",
    "pdf_url": "https://arxiv.org/pdf/2510.20924v1.pdf",
    "title": "Boron Nitride Coatings for the Enhanced Detection of Neutrons in CR-39",
    "abstract": "The neutron detection efficiency of Columbia Resin 39 (CR-39) nuclear track detectors was assessed for AmBe, 252Cf, and D-T (14 MeV) neutron source spectra. A boron nitride (BN) coating for CR-39 was developed to enhance the neutron detection efficiency by converting neutrons into energetic alpha particles through the well-known 10B(n,a)7Li reaction. Separate partially coated CR-39 pieces were exposed to each neutron source and subsequently analyzed under optical microscope and through large-area Scanning Electron Microscopy (SEM) imaging over the irradiated area. The detection efficiency (tracks per neutron) was evaluated for each source spectra under optical and scanning electron microscopes and with or without BN coating. This resulted in a comprehensive guide to neutron detection with various sources using CR-39.",
    "authors": [
      "Noah DAmico",
      "Sandeep Puri",
      "Ian Jones",
      "Andrew Gillespie",
      "Cuikun Lin",
      "Bo Zhao",
      "R. V. Duncan"
    ],
    "published": "2025-10-23T18:22:52Z",
    "updated": "2025-10-23T18:22:52Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2502.04808v2",
    "url": "https://arxiv.org/abs/2502.04808v2",
    "pdf_url": "https://arxiv.org/pdf/2502.04808v2.pdf",
    "title": "Tracking electron capture processes in classical molecular dynamics   simulations for spectral line broadening in plasmas",
    "abstract": "Plasma spectroscopy is a fundamental tool for diagnosing laboratory and astrophysical plasmas. Accurate interpretation of spectra depends upon precise modeling and comprehension of Stark broadening and other mechanisms affecting spectral lines. In this context, computer simulations have emerged as valuable tools, offering idealized experiments with well-defined conditions. Molecular dynamics simulations, in particular, excel at replicating the particle interactions within the plasma and their impact on the state of a radiating atom or ion. However, these simulations present challenges in tracking electron capture processes, since setting an unambiguous criterion to distinguish between bound and free electrons is not trivial. In this paper we introduce a new algorithm that, within a classical framework, precisely identifies the scenario in which an electron is captured by an ion and then follows a stable orbit around it. The algorithm's applicability extends to emitters with charges Z >= 1. The procedure enables the correct identification of valid time-histories of the electric microfield perturbing the emitting ion, which will be used for subsequent line shape calculations. The ionization balance results obtained from the application of this algorithm are compared with an additional method based on the potential energy of the particles in the simulations, finding good agreement, therefore validating the use of this approach.",
    "authors": [
      "D. González-Herrero",
      "G. Pérez-Callejo",
      "R. Florido",
      "M. A. Gigosos"
    ],
    "published": "2025-02-07T10:23:32Z",
    "updated": "2025-10-23T17:52:01Z",
    "categories": [
      "physics.plasm-ph",
      "astro-ph.IM",
      "physics.atom-ph",
      "physics.comp-ph",
      "physics.optics"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.20775v1",
    "url": "https://arxiv.org/abs/2510.20775v1",
    "pdf_url": "https://arxiv.org/pdf/2510.20775v1.pdf",
    "title": "The Opacity Project: R-Matrix Calculations for Opacities of   High-Energy-Density Astrophysical and Laboratory Plasmas",
    "abstract": "Accurate determination of opacity is critical for understanding radiation transport in both astrophysical and laboratory plasmas. We employ atomic data from R-Matrix calculations to investigate radiative properties in high-energy-density (HED) plasma sources. Specifically, we analyze environments such as the base of the convective zone (BCZ) of the Sun 2 x 10^6$ K, N_e = 10^{23}/cc and the inertial confinement fusion (ICF) device at the Sandia Z facility 2.11 x 10^6 K, N_e = 3.16 x 10^{22}/cc. We calculate Rosseland Mean Opacities (RMO) within a range of temperatures and densities and analyze how they vary under different plasma conditions. In this study, we specifically focus on electron collisional and Stark ion microfield broadening effects on autoionizing resonances in photoabsorption cross sections. Our results are relevant to astrophysical models, particularly in the context of the solar opacity problem, and provide insights into discrepancies between theoretical calculations and experimental measurements. In addition, we investigate the equation-of-state (EOS) and its impact on opacities. In addition, we examine the equation-of-state (EOS) and its impact on opacities of the \"chemical picture\" Mihalas-Hummer-Dappen EOS with respect to level populations of excited levels included in the R-matrix calculations. This study should contribute to improving opacity models of HED sources such as stellar interiors adn laboratory fusion plasma experiments.",
    "authors": [
      "Anil K. Pradhan",
      "Sultana N. Nahar"
    ],
    "published": "2025-10-23T17:47:36Z",
    "updated": "2025-10-23T17:47:36Z",
    "categories": [
      "astro-ph.HE",
      "astro-ph.SR",
      "physics.atom-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE",
    "doi": "10.3390/atoms13100085"
  },
  {
    "arxiv_id": "2508.12111v2",
    "url": "https://arxiv.org/abs/2508.12111v2",
    "pdf_url": "https://arxiv.org/pdf/2508.12111v2.pdf",
    "title": "CosmicWatch: The Desktop Muon Detector(v3X)",
    "abstract": "The CosmicWatch Desktop Muon Detector (v3X) is a compact, low-cost, and portable device designed for detecting ionizing radiation, including cosmic-ray muons. Building on previous iterations, the v3X introduces significant hardware and firmware improvements that enhance sensitivity, usability, and data acquisition capabilities. The detector integrates a plastic scintillator and silicon photomultiplier (SiPM), custom designed electronics for signal processing, onboard data storage, OLED display, environmental sensors, and USB connectivity. With a total component cost under \\$100 and a build time suitable for high school students, the v3X is ideal for education, outreach, and introductory research applications in particle and astroparticle physics. This paper details the design, performance, and potential use cases of the v3X, supported by example measurements demonstrating its functionality.",
    "authors": [
      "Spencer Axani",
      "Masooma Sarfraz",
      "Miles Garcia",
      "Collin Owens",
      "Katarzyna Frankiewicz",
      "Janet M. Conrad"
    ],
    "published": "2025-08-16T17:32:22Z",
    "updated": "2025-10-23T17:07:53Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/10/P10040"
  },
  {
    "arxiv_id": "2503.19657v2",
    "url": "https://arxiv.org/abs/2503.19657v2",
    "pdf_url": "https://arxiv.org/pdf/2503.19657v2.pdf",
    "title": "Homogenized harmonic balance finite element method for nonlinear eddy   current simulations of fast corrector magnets",
    "abstract": "This paper develops a homogenized harmonic balance finite element method (HomHBFEM) to predict the dynamic behavior of magnets with fast excitation cycles, including eddy current and skin effects. A homogenization technique for laminated yokes avoids resolving the individual laminates and the skin depth in the finite element (FE) mesh. Instead, the yoke is represented by a bulk surrogate material with frequency-dependent parameters. The ferromagnetic saturation of the yoke at higher excitation currents is tackled by a harmonic balance method, which accounts for a coupled set of frequency components. Thereby, a computationally expensive time-stepping of the eddy-current field problem and a convolution of the homogenized yoke model are avoided. The HomHBFEM enables, for the first time, to conduct nonlinear simulations of fast corrector magnets, which are embedded in a fast orbit feedback system to counteract orbit disturbances over a broad frequency spectrum, and thus guarantee a stable light-source operation. The results show the impact of the nonlinearity on the phase lag and the field attenuation as well as the eddy current losses at frequencies up to 65 kHz. The numerical validation for a C-dipole magnet example shows that the HomHBFEM achieves a sufficient accuracy at an affordable computational effort, with simulation times of a few hours. In comparison, standard 3D transient FE simulations need to resolve the lamination thickness and the skin depth in space and the largest relevant frequency in time, which leads to a two to three orders of magnitude larger mesh and prohibitive computational effort, with simulation times of a few weeks on a contemporary computer server.",
    "authors": [
      "Jan-Magnus Christmann",
      "Laura Anna Maria D'Angelo",
      "Herbert De Gersem",
      "Sven Pfeiffer",
      "Sajjad Hussain Mirza",
      "Matthias Thede",
      "Alexander Aloev",
      "Holger Schlarb"
    ],
    "published": "2025-03-25T13:44:46Z",
    "updated": "2025-10-23T16:30:18Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph",
    "doi": "10.1103/9mnn-w7lj"
  },
  {
    "arxiv_id": "2510.20880v1",
    "url": "https://arxiv.org/abs/2510.20880v1",
    "pdf_url": "https://arxiv.org/pdf/2510.20880v1.pdf",
    "title": "Concepts Rookie Book",
    "abstract": "This book begins with the basic accelerator knowledge required to understand the latter chapters. This is followed by topics from Fermilab accelerator specifics to general accelerator physics concepts. These chapters are accompanied by descriptions of the instrumentation and utilities required to operate a high-energy physics laboratory. Last, we discuss the role of operators in safety at the lab.",
    "authors": [
      "Dennis Barak",
      "Beau F. Harrison",
      "Adam Watts"
    ],
    "published": "2025-10-23T16:17:07Z",
    "updated": "2025-10-23T16:17:07Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2507.18369v2",
    "url": "https://arxiv.org/abs/2507.18369v2",
    "pdf_url": "https://arxiv.org/pdf/2507.18369v2.pdf",
    "title": "Reducing suspension control noise with interferometric sensors -- an   experimental concept",
    "abstract": "One of the limiting noise sources of ground-based gravitational wave detectors at frequencies below 30 Hz is control-induced displacement noise. Compact laser interferometric sensors are a prime candidate for improved local displacement sensing. In this paper we present the design of an experiment that aims to demonstrate the advantages of interferometric sensors over shadow sensors. We focus on the compact balanced readout interferometer (COBRI) - a sensor currently in development that is based on deep frequency modulation. We mount COBRIs on two HAM Relay Triple Suspension (HRTS) systems that suspend two mirrors forming an optical cavity. By measuring the length stability of this cavity relative to a stable reference we aim to probe the direct motion reduction when using COBRIs for active damping and we aim to investigate their behavior and auxiliary functions, such as absolute ranging, in the context of the 6 degree-of-freedom controls of the suspensions. Here we describe the design of the experiment and simulations of the achievable noise levels that were obtained using mechanical models of the HRTS suspensions. We discuss all relevant noise sources, the modeled influence of the interferometric sensor damping and the current limitations and necessary improvements of our testing facility in terms of seismic pre-isolation to achieve a shadow sensor limited noise at around 5 Hz, where, according to our simulations, we can demonstrate superior performance for COBRIs in the longitudinal degree of freedom.",
    "authors": [
      "Nils Leander Weickhardt",
      "Artem Basalaev",
      "Oliver Gerberding"
    ],
    "published": "2025-07-24T12:47:51Z",
    "updated": "2025-10-23T15:41:50Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.20628v1",
    "url": "https://arxiv.org/abs/2510.20628v1",
    "pdf_url": "https://arxiv.org/pdf/2510.20628v1.pdf",
    "title": "Magnetic Field-Line Curvature and Its Role in Particle Acceleration by   Magnetically Dominated Turbulence",
    "abstract": "We employ first-principles, fully kinetic particle-in-cell simulations to investigate magnetic field-line curvature in magnetically dominated turbulent plasmas and its role in particle acceleration through curvature-drift motion along the motional electric field. By varying the fluctuation-to-mean magnetic-field ratio $\\delta B_0/B_0$, we examine curvature $\\kappa$ statistics and their connection to particle acceleration. The curvature probability densities display broad power-law wings, scaling linearly in $\\kappa$ below the peak and developing hard high-$\\kappa$ tails for $\\delta B_0/B_0 \\gtrsim 1$. As the mean field strengthens, the high-$\\kappa$ tails steepen, and large-curvature events are suppressed when $\\delta B_0/B_0 \\ll 1$. The probability density functions of magnetic field-line contraction, ${\\bf v}_E \\cdot {\\bf \\kappa}$, with ${\\bf v}_E$ the field-line velocity, develop power-law tails well described by a symmetric Pareto distribution, characteristic of stochastic energy exchanges, with the tails becoming harder as $\\delta B_0/B_0$ increases. Our guiding-center analysis shows that curvature-drift acceleration accounts for a substantial fraction of the energization via the motional electric field, and that it strengthens with increasing $\\delta B_0/B_0$. For well-magnetized particles, curvature-drift acceleration typically exceeds ${\\bf\\nabla}B$ drift, polarization drift, and betatron contributions. These results identify curvature-drift acceleration as a principal pathway through which magnetized turbulence transfers energy to nonthermal particles in astrophysical plasmas.",
    "authors": [
      "Samuel Sebastian",
      "Luca Comisso"
    ],
    "published": "2025-10-23T15:02:34Z",
    "updated": "2025-10-23T15:02:34Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2501.08787v2",
    "url": "https://arxiv.org/abs/2501.08787v2",
    "pdf_url": "https://arxiv.org/pdf/2501.08787v2.pdf",
    "title": "Calibration-free Rydberg Atomic Receiver for Sub-MHz Wireless   Communications and Sensing",
    "abstract": "The exploitation of sub-MHz (\\textless 1 MHz) can be beneficial for a plethora of applications like underwater vehicular communication, subsurface exploration, low-frequency navigation etc. The traditional electrical receivers in this band are either hundreds of meters long or, when miniaturized, inefficient and bandwidth-limited, making them inapplicable for practical underwater implementations. Such obstacles can be circumvented by the emerging Rydberg atomic receiving technology, which is capable of detecting fields from DC up to the terahertz regime with compact structure. Against this background, we propose a method to detect sub-MHz electric fields without further calibration. Specifically, a physics-based model of the combined DC and AC-Stark response is established. Based on the model, we modulate the DC-Stark spectrum with the received signal and extract its amplitude by fitting the cycle-averaged, symmetric Stark-split peaks. Then we map this swing directly to the intrinsic atomic polarizability. By such operations, the proposed method can remove the dependence on electrode spacing or field-amplitude references. For performance evaluation, six-level Lindblad simulations and experiments are conducted at a low-frequency field of 30 kHz demonstrate a minimum detectable field of 5.3 \\text{mV}/\\text{cm}, with stable readout across practical optical-power variations. The approach manages to expand operating range of Rydberg atomic receivers below 1 MHz, and enables compact, calibration-free quantum front ends for underwater and subsurface receivers.",
    "authors": [
      "Minze Chen",
      "Tianqi Mao",
      "Wei Xiao",
      "Zhonghuai Wu",
      "Dapeng Li",
      "Mingyao Cui",
      "Qunsong Zeng",
      "Dezhi Zheng",
      "Kaibin Huang",
      "Zhaocheng Wang"
    ],
    "published": "2025-01-15T13:22:11Z",
    "updated": "2025-10-23T11:30:19Z",
    "categories": [
      "physics.ins-det",
      "physics.atom-ph"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2506.18705v2",
    "url": "https://arxiv.org/abs/2506.18705v2",
    "pdf_url": "https://arxiv.org/pdf/2506.18705v2.pdf",
    "title": "Flux-driven turbulent transport using penalisation in the   Hasegawa-Wakatani system",
    "abstract": "First numerical results from the newly-developed pseudo-spectral code P-FLARE (Penalised FLux-driven Algorithm for REduced models) are presented. This flux-driven turbulence/transport code uses a pseudo-spectral formulation with the penalisation method in order to impose radial boundary conditions. Its concise, flexible structure allows implementing various quasi-two dimensional reduced fluid models in flux-driven formulation. Here, results from simulations of the modified Hasegawa-Wakatani system are discussed, where particle transport and zonal flow formation, together with profile relaxation, are studied. It is shown that coupled spreading/profile relaxation that one obtains for this system is consistent with a simple one dimensional model of coupled spreading/transport equations. Then, the effect of a particle source is investigated, which results in the observation of sandpile-like critical behaviour. The model displays profile stiffness for certain parameters, with very different input fluxes resulting in very similar mean density gradients. This is due to different zonal flow levels around the critical value for the control parameter (i.e. the ratio of the adiabaticity parameter to the mean gradient) and the existence for this system of a hysteresis loop for the transition from 2D turbulence to a zonal flow dominated state.",
    "authors": [
      "Pierre L. Guillon",
      "Özgür D. Gürcan",
      "Guilhem Dif-Pradalier",
      "Yanick Sarazin",
      "Nicolas Fedorczak"
    ],
    "published": "2025-06-23T14:44:02Z",
    "updated": "2025-10-23T07:28:17Z",
    "categories": [
      "physics.plasm-ph",
      "physics.flu-dyn"
    ],
    "primary_category": "physics.plasm-ph",
    "doi": "10.1017/S0022377825100895"
  },
  {
    "arxiv_id": "2510.20105v1",
    "url": "https://arxiv.org/abs/2510.20105v1",
    "pdf_url": "https://arxiv.org/pdf/2510.20105v1.pdf",
    "title": "High Gain Fusion Target Design using Generative Artificial Intelligence",
    "abstract": "By returning to the topological basics of fusion target design, Generative Artificial Intelligence (genAI) is used to specify how to initially configure and drive the optimally entangled topological state, and stabilize that topological state from disruption. This can be applied to all methods; including tokamaks, laser-driven schemes, and pulsed-power driven schemes. The result is practical, room temperature targets that can yield up to 10 GJ of energy, driven by as little as 3 MJ of absorbed energy. The genAI is based on the concept of Ubuntu that replaces the Deep Convolutional Neural Network approximation of a functional, with the formula for the generating functional of a canonical transformation from the domain of the canonical field momentums and fields, to the domain of the canonical momentums and coordinates, that is the Reduced Order Model. This formula is a logical process of renormalization, enabling Heisenberg's canonical approach to field theory, via calculation of the S-matrix, given observation of the fields. This can be viewed as topological characterization and control of collective, that is complex, systems.",
    "authors": [
      "Michael E. Glinsky"
    ],
    "published": "2025-10-23T01:17:29Z",
    "updated": "2025-10-23T01:17:29Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2507.09086v3",
    "url": "https://arxiv.org/abs/2507.09086v3",
    "pdf_url": "https://arxiv.org/pdf/2507.09086v3.pdf",
    "title": "Long Term Study of Sedimentation and Biofouling at Cascadia Basin, the   Site of the Pacific Ocean Neutrino Experiment",
    "abstract": "STRings for Absorption Length in Water (STRAW)-a and b were pathfinder instruments deployed to characterize the anticipated site of the Pacific Ocean Neutrino Experiment (P-ONE), which is a future neutrino telescope that will be located in the North Pacific Ocean. Measurements of the evolution of the optical transmission efficiency from STRAW-a showed a decline over the detector's lifetime for the upward-facing modules. Video footage of the pathfinders strongly suggested this decline was caused by biofouling and sedimentation. We measure the effect of biofouling and sedimentation to be a decrease in the transparency of upward-facing optical surfaces over 5 years of operations. A majority of downward-facing optical surfaces, which will dominate P-ONE's sensitivity to astrophysical sources, showed no visible biofouling. Extrapolations motivated by biological growth models estimated that these losses started around 2.5 years after deployment, and suggest a reduction in transparency ranging from 35$\\%$ of the original to complete obscuration for the upward-facing modules. Samples of biofouling were taken in order to identify the microbial diversity of these organisms and inform potential intervention strategies. Results of the microbial samples and a candidate anti-biofouling strategy that will be tested on upcoming P-ONE instruments are discussed.",
    "authors": [
      "O. Aghaei",
      "M. Agostini",
      "S. Agreda",
      "A. Alexander Wight",
      "P. S. Barbeau",
      "A. J. Baron",
      "S. Bash",
      "C. Bellenghi",
      "B. Biffard",
      "M. Boehmer",
      "M. Brandenburg",
      "D. Brussow",
      "N. Cedarblade-Jones",
      "M. Charlton",
      "B. Crudele",
      "M. Danninger",
      "F. C. De Leo",
      "T. DeYoung",
      "F. Fuchs",
      "A. Gärtner",
      "J. Garriz",
      "D. Ghuman",
      "L. Ginzkey",
      "V. Gousy-Leblanc",
      "D. Grant",
      "A. Grimes",
      "C. Haack",
      "R. Halliday",
      "D. Hembroff",
      "F. Henningsen",
      "J. Hutchinson",
      "R. Jenkyns",
      "S. Karanth",
      "T. Kerscher",
      "S. Kershtein",
      "K. Kopański",
      "C. Kopper",
      "P. Krause",
      "C. B. Krauss",
      "I. Kulin",
      "N. Kurahashi",
      "C. Lagunas Gualda",
      "A. Lam",
      "T. Lavallee",
      "K. Leismüller",
      "R. Li",
      "S. Loipolder",
      "A. Magaña Ponce",
      "S. Magel",
      "P. Malecki",
      "G. G. Marshall",
      "T. Martin",
      "S. Mihaly",
      "C. Miller",
      "N. Molberg",
      "R. Moore",
      "B. Nührenbörger",
      "B. Nichol",
      "W. Noga",
      "R. Ørsøe",
      "L. Papp",
      "V. Parrish",
      "M. Paulson",
      "P. Pfahler",
      "B. Pirenne",
      "E. Price",
      "A. Rahlin",
      "M. Rangen",
      "E. Resconi",
      "C. Ridsdale",
      "S. Robertson",
      "A. Round",
      "D. Salazar-Gallegos",
      "A. Scholz",
      "L. Schumacher",
      "S. Sharma",
      "C. Spannfellner",
      "J. Stacho",
      "I. Taboada",
      "A. R. Thurber",
      "M. Tradewell",
      "J. P. Twagirayezu",
      "M. Un Nisa",
      "B. Veenstra",
      "S. Wagner",
      "C. Weaver",
      "N. Whitehorn",
      "L. Winter",
      "M. Wolf",
      "R. Wroński",
      "J. H. Wynne",
      "J. P. Yañez",
      "A. Zaalishvili"
    ],
    "published": "2025-07-12T00:07:18Z",
    "updated": "2025-10-22T22:07:18Z",
    "categories": [
      "hep-ex",
      "physics.ins-det"
    ],
    "primary_category": "hep-ex"
  },
  {
    "arxiv_id": "2510.12960v2",
    "url": "https://arxiv.org/abs/2510.12960v2",
    "pdf_url": "https://arxiv.org/pdf/2510.12960v2.pdf",
    "title": "Master Oscillator and Phase Reference Line Design for the PIP-II Linac",
    "abstract": "The phase averaging reference line system provides the RF phase reference, LO and clock signals to the LLRF and other accelerator sub-systems. The PIP-II linac has RF systems at three frequencies - 162.5 MHz, 325 MHz and 650 MHz. A temperature-stabilized, low-phase-noise oscillator is used as the master oscillator. Phase reference signals at 162.5 MHz, 325 MHz, and 650 MHz, along with LO signals at 182.5 MHz, 345 MHz, 670 MHz and LLRF clocks at 1320 MHz and 1300 MHz, are generated in temperature-controlled RF modules at each frequency section. A phase reference from each module travels to the next section, where it is doubled to produce required frequencies. The reference also travels alongside the accelerating cavities in the tunnel, allowing cavity probe and reference cables to temperature track and reduce measurement errors from temperature changes or phase drift.",
    "authors": [
      "A. Syed",
      "B. Vaughn",
      "P. Varghese",
      "E. Cullerton",
      "S. Stevenson",
      "D. Pieper",
      "D. Peterson",
      "J. Holzbauer",
      "R. Madrak",
      "A. Mosher",
      "D. Klepec"
    ],
    "published": "2025-10-14T20:11:32Z",
    "updated": "2025-10-22T21:04:03Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.19786v1",
    "url": "https://arxiv.org/abs/2510.19786v1",
    "pdf_url": "https://arxiv.org/pdf/2510.19786v1.pdf",
    "title": "First Observation of Dispersive Shock Waves in an Electron Beam",
    "abstract": "Dispersive shock waves (DSWs) are expanding nonlinear wave trains that arise when dispersion regularizes a steepening front, a phenomenon observed in fluids, plasmas, optics, and superfluids. Here we report the first experimental observation of DSWs in an intense electron beam, using the University of Maryland Electron Ring (UMER). A localized induction-cell perturbation produced a negative density pulse that evolved into a leading soliton-like peak followed by an expanding train of oscillations. The leading peak satisfied soliton scaling laws for width^2 vs inverse amplitude and velocity vs amplitude, while the total wave-train width increased linearly with time, consistent with Korteweg--de Vries (KdV) predictions. Successive peaks showed decreasing amplitude and velocity toward the trailing edge, in agreement with dispersive shock ordering. These results demonstrate that intense charged particle beams provide a new laboratory platform for studying dispersive hydrodynamics, extending nonlinear wave physics into the high-intensity beam regime.",
    "authors": [
      "H. McCright",
      "I. G. Abel",
      "I. Haber",
      "P. G. O'Shea",
      "B. L. Beaudoin"
    ],
    "published": "2025-10-22T17:21:26Z",
    "updated": "2025-10-22T17:21:26Z",
    "categories": [
      "physics.acc-ph",
      "nlin.PS",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2510.19729v1",
    "url": "https://arxiv.org/abs/2510.19729v1",
    "pdf_url": "https://arxiv.org/pdf/2510.19729v1.pdf",
    "title": "Coupling of neutrino beam-driven MHD waves and resonant instabilities in   rotating magnetoplasmas with neutrino two-flavor oscillations",
    "abstract": "We present an analysis of neutrino-driven magnetohydrodynamic (MHD) waves and instabilities in a rotating magnetoplasma with weak neutrino interactions. We show, for the first time, that neutrino-driven shear Alfv{\\'e}n and oblique magnetosonic waves can be coupled by the Coriolis force, forming new wave modes affected by this force, as well as neutrino beam and two neutrino flavor oscillations. Our work extends previous theories by demonstrating that shear Alfv{\\'e}n waves are influenced by neutrino effects and by identifying instabilities resulting from resonant interactions with both a streaming neutrino beam and flavor oscillations. We find that the Coriolis force, as well as plasma density and magnetic field strength, have a significant impact on the profiles of the instability growth rates. Our findings may shed new light on the physical mechanisms underlying core-collapse supernovae.",
    "authors": [
      "Jyoti Turi",
      "Amar P. Misra"
    ],
    "published": "2025-10-22T16:17:32Z",
    "updated": "2025-10-22T16:17:32Z",
    "categories": [
      "astro-ph.HE",
      "physics.plasm-ph"
    ],
    "primary_category": "astro-ph.HE"
  },
  {
    "arxiv_id": "2510.19724v1",
    "url": "https://arxiv.org/abs/2510.19724v1",
    "pdf_url": "https://arxiv.org/pdf/2510.19724v1.pdf",
    "title": "Afterpulse prediction for SUBMET experiment",
    "abstract": "The SUB-Millicharge ExperimenT (SUBMET) investigates an unexplored parameter space of millicharged particles with mass $m_\\chi < $ 1.6 GeV/c$^2$ and charge $Q_\\chi < 10^{-3}e$. The detector consists of an Eljen-200 plastic scintillator coupled to a Hamamatsu Photonics R7725 photomultiplier tube (PMT). PMT afterpulses, delayed pulses produced after an energetic pulse, have been observed in the SUBMET readout system, especially following primary pulses with a large area. We present a prediction method for afterpulse rates based on measurable parameters, which reproduces the observed rate with approximately 20\\% precision. This approach enables a better understanding of afterpulse contributions and, consequently, improves the reliability of background predictions.",
    "authors": [
      "Claudio Campagnari",
      "Sungwoong Cho",
      "Suyong Choi",
      "Seokju Chung",
      "Matthew Citron",
      "Ryan De Los Santos",
      "Albert De Roeck",
      "Martin Gastal",
      "Seungkyu Ha",
      "Andy Haas",
      "Christopher Scott Hill",
      "Byeong Jin Hong",
      "Haeyun Hwang",
      "Insung Hwang",
      "Hoyong Jeong",
      "Minseo Kim",
      "Hyunki Moon",
      "Jayashri Padmanaban",
      "Ryan Schmitz",
      "Changhyun Seo",
      "David Stuart",
      "Juan Salvador Tafoya Vargas",
      "Eunil Won",
      "Jae Hyeok Yoo",
      "Jinseok Yoo",
      "Ayman Youssef",
      "Ahmad Zaraket",
      "Haitham Zaraket",
      "Collin Zheng"
    ],
    "published": "2025-10-22T16:08:34Z",
    "updated": "2025-10-22T16:08:34Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.19690v1",
    "url": "https://arxiv.org/abs/2510.19690v1",
    "pdf_url": "https://arxiv.org/pdf/2510.19690v1.pdf",
    "title": "Modification of ion-temperature-gradient turbulence by impurities in   stellarator plasmas",
    "abstract": "Recent nonlinear gyrokinetic simulations have shown that impurities can strongly modify the turbulent heat flux in stellarator plasmas. Here, the ion-temperature-gradient (ITG) dispersion relation in a plasma containing impurities is analytically solved in certain limits and an expression for the modification of the ITG growth rate by impurities is derived. The analytical expression is the sum of three terms corresponding to three different physical causes (impurity density gradient, impurity temperature gradient and dilution) of the change in the growth rate. The scalings predicted analytically for the modification of the growth rate are shown to be reproduced by linear gyrokinetic simulations. The conditions for reduction or increase of the ITG growth by impurities are also correctly predicted by the analytical solution to the dispersion relation. Finally, a remarkable correlation is found between the analytical expression for the modification of the growth rate and the modification of the turbulent heat flux obtained from nonlinear gyrokinetic simulations.",
    "authors": [
      "Ivan Calvo",
      "Felix I. Parra",
      "Hanne Thienpondt",
      "Jose Manuel Garcia-Regaña"
    ],
    "published": "2025-10-22T15:38:02Z",
    "updated": "2025-10-22T15:38:02Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.13192v2",
    "url": "https://arxiv.org/abs/2510.13192v2",
    "pdf_url": "https://arxiv.org/pdf/2510.13192v2.pdf",
    "title": "RFSoC Based LLRF System Design at ALS",
    "abstract": "The Advanced Light Source (ALS) at LBNL is upgrading several LLRF systems for its Linac and Sub-Harmonic Bunchers, where it is desired to have a unified LLRF system design to support various RF frequencies (at 125MHz, 500MHz and 3GHz) and configurations. This paper demonstrates an open-source, direct sampling RFSoC based LLRF system design, featuring: sample-to-sample Multi-Tile Synchronization, deterministic latency, digital up/down conversion, arbitrary waveform generation and acquisition, in-pulse closed loop control, timing and EPICS integration, modular RF frontend and hardware designs. Measured RF characteristics show that the RFSoC based LLRF system is able to meet the system requirements.",
    "authors": [
      "Qiang Du",
      "Shreeharshini Murthy",
      "Victoria Moore",
      "Angel Jurado Lopez",
      "Michael Chin",
      "Shree Subhasish Basak",
      "David Nett",
      "Benjamin Flugstad"
    ],
    "published": "2025-10-15T06:29:08Z",
    "updated": "2025-10-22T14:11:01Z",
    "categories": [
      "physics.acc-ph"
    ],
    "primary_category": "physics.acc-ph"
  },
  {
    "arxiv_id": "2508.14657v4",
    "url": "https://arxiv.org/abs/2508.14657v4",
    "pdf_url": "https://arxiv.org/pdf/2508.14657v4.pdf",
    "title": "Phase space transport, quasilinear diffusion and locality in phase   velocity",
    "abstract": "In this paper, we address the motion of charged particles subjected to a discrete spectrum of electrostatic waves. We focus on situations when transport dominates, leading to significant variations in particle velocity. Nonetheless, these velocity changes remain finite due to the presence of KAM tori bounding phase space. We analyze the conditions under which transport can be modeled as a diffusion process and evaluate the relevance of the so-called quasilinear value of the diffusion coefficient. We distinguish between traditional quasilinear diffusion, when wave-particle interaction is perturbative, and the so-called chaotic regime of diffusion, when the particle motion looks erratic. In the perturbative regime, we demonstrate both numerically and theoretically that diffusion occurs only when wave-particle interaction is local in phase velocity; that is, when wave contributions from phase velocities far from the particles instantaneous velocities are negligible. Conversely, numerical results indicate that chaotic diffusion can occur even when wave-particle interaction is not local. However, without locality, the diffusion coefficient is not the quasilinear one. Furthermore, in regimes when quasilinear diffusion is applicable, we introduce a simple analytical expression for the time evolution of the velocity distribution function, that accounts for phase space boundaries.",
    "authors": [
      "Didier Bénisti"
    ],
    "published": "2025-08-20T12:16:51Z",
    "updated": "2025-10-22T13:26:35Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2510.19543v1",
    "url": "https://arxiv.org/abs/2510.19543v1",
    "pdf_url": "https://arxiv.org/pdf/2510.19543v1.pdf",
    "title": "Microtearing Turbulence and Its Role in High-Density-Gradient Plasmas in   Wendelstein 7-X",
    "abstract": "Gyrokinetic simulations reveal that microtearing mode (MTM) turbulence dominates transport in a Wendelstein 7-X (W7-X) discharge characterized by large density gradients, moderate temperature gradients, and low plasma beta. This conclusion is supported by the close agreement between simulated and experimentally measured heat and particle fluxes. The emergence of MTMs is attributed to the absence of competing instabilities -- such as ion temperature gradient modes and density-gradient-driven trapped-electron modes -- under these plasma conditions, together with the stabilizing influence of the W7-X max-J magnetic configuration. Furthermore, moderate collisionality and low magnetic shear are found to facilitate MTM onset. These findings advance the understanding of high-density-gradient regimes, which are essential for achieving high-performance operation in W7-X plasmas.",
    "authors": [
      "H. Cu-Castillo",
      "A. Bañón Navarro",
      "G. Merlo",
      "F. Reimold",
      "T. Romba",
      "O. Ford",
      "S. Bannmann",
      "L. Vanó",
      "M. Wappl",
      "J. Geiger",
      "A. Zocco",
      "F. Jenko",
      "the W7-X team"
    ],
    "published": "2025-10-22T12:50:15Z",
    "updated": "2025-10-22T12:50:15Z",
    "categories": [
      "physics.plasm-ph"
    ],
    "primary_category": "physics.plasm-ph"
  },
  {
    "arxiv_id": "2506.15738v3",
    "url": "https://arxiv.org/abs/2506.15738v3",
    "pdf_url": "https://arxiv.org/pdf/2506.15738v3.pdf",
    "title": "Simulation studies of the isovector reorientation effect of deuteron   scattering on heavy target",
    "abstract": "The isovector reorientation (IVR) effect of deuteron scattering on heavy target provides a novel means to probe the nuclear isovector potential, which gives rise to the nuclear symmetry energy. The simulation studies on the experimental measurement of IVR effect using the SAMURAI terminal at RIKEN Nishina center have been performed to demonstrate the feasibility of the experiment. By introducing a well-designed polarimeter to detect the $\\mathrm{p}(\\vec{\\mathrm{d}}, \\mathrm{d})\\mathrm{p}$ elastic scattering, monitoring of the tensor polarization of the deuteron beam can be implemented. The protons and neutrons produced by the breakup of polarized deuterons scattering off heavy targets are designed to be measured by proton drift chamber (PDC) combined with the SAMURAI magnet and NEBULA detector, respectively. The detector responses are simulated using Geant4 framework, where the events of the deuteron elastic breakup are generated by an Improved Quantum Molecular Dynamics model. The results of reconstructing the deuteron breakup events demonstrate the feasibility of detecting the IVR effect at SAMURAI with both longitudinal and transverse tensor polarized deuteron beams with a polarization degree of approximately 80\\%.",
    "authors": [
      "Baiting Tian",
      "Boyuan Zhang",
      "Dawei Si",
      "Sheng Xiao",
      "Yijie Wang",
      "Tadaaki Isobe",
      "Hideaki Otsu",
      "Li Ou",
      "Zhigang Xiao"
    ],
    "published": "2025-06-17T08:55:22Z",
    "updated": "2025-10-22T12:33:34Z",
    "categories": [
      "physics.ins-det",
      "nucl-ex",
      "nucl-th"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.17280v2",
    "url": "https://arxiv.org/abs/2510.17280v2",
    "pdf_url": "https://arxiv.org/pdf/2510.17280v2.pdf",
    "title": "Leakage current of high-fluence neutron-irradiated 8\" silicon sensors   for the CMS Endcap Calorimeter Upgrade",
    "abstract": "The HL-LHC will challenge the detectors with a nearly 10-fold increase in integrated luminosity compared to the previous LHC runs combined, thus the CMS detector will be upgraded to face the higher levels of radiation and the larger amounts of collision data to be collected. The High-Granularity Calorimeter will replace the current endcap calorimeters of the CMS detector. It will facilitate the use of particle-flow calorimetry with its unprecedented transverse and longitudinal readout/trigger segmentation, with more than 6M readout channels. The electromagnetic section as well as the high-radiation regions of the hadronic section of the HGCAL (fluences above $10^{14}~n_{eq.}/cm^{2}$) will be equipped with silicon pad sensors, covering a total area of 620 m$^2$. Fluences up to $10^{16}~n_{eq.}/cm^{2}$ and doses up to 1.5 MGy are expected. The sensors are processed on novel 8\" p-type wafers with an active thickness of 300 $\\mu{}m$, 200 $\\mu{}m$ and 120 $\\mu{}m$ and cut into hexagonal shapes for optimal use of the wafer area and tiling. Each sensor contains several hundred individually read out cells of two sizes (around 0.6 cm$^2$ or 1.2 cm$^2$). To investigate the radiation-induced bulk damage, the sensors have been irradiated with neutrons at RINSC to fluences between $6.5 \\times 10^{14}~n_{eq.}/cm^{2}$ and $1.4 \\times 10^{16}~n_{eq.}/cm^{2}$. Electrical characterization results are presented for full sensors, as well as for partial sensors cut from multi-geometry wafers with internal dicing lines on the HV potential within the active sensor area. Leakage current behaviour is investigated for various sensor types and fluence levels, including its temperature dependence. Finally, methods to limit the annealing time of the sensors during irradiation are investigated by analysing the impact of splitting high-fluence irradiations.",
    "authors": [
      "CMS HGCAL collaboration"
    ],
    "published": "2025-10-20T08:12:49Z",
    "updated": "2025-10-22T12:19:02Z",
    "categories": [
      "physics.ins-det"
    ],
    "primary_category": "physics.ins-det"
  },
  {
    "arxiv_id": "2510.19519v1",
    "url": "https://arxiv.org/abs/2510.19519v1",
    "pdf_url": "https://arxiv.org/pdf/2510.19519v1.pdf",
    "title": "Acceleration gradients in dielectric laser accelerators with   triangular-shaped gratings",
    "abstract": "The study investigated transparent on-chip structures with a rectangular profile and triangular profiles with grating ridge base angles of $\\alpha = 36^\\circ$, $30^\\circ$, and $20^\\circ$. Each triangular structure had both left- and right-handed profile orientations. For all variants, a modified version with a reflective gold coating was additionally considered. The maximum energy gains and accelerating gradients were determined and quantified for all structure classes: transparent and reflective (with both rectangular and triangular profiles).",
    "authors": [
      "O. O. Svystunov",
      "I. V. Beznosenko",
      "A. V. Vasyliev",
      "R. R. Kniaziev",
      "G. V. Sotnikov"
    ],
    "published": "2025-10-22T12:18:21Z",
    "updated": "2025-10-22T12:18:21Z",
    "categories": [
      "physics.optics",
      "physics.acc-ph",
      "physics.comp-ph",
      "78A40, 78A50, 78A60,",
      "I.6.8; J.2; K.8.1"
    ],
    "primary_category": "physics.optics"
  },
  {
    "arxiv_id": "2510.19469v1",
    "url": "https://arxiv.org/abs/2510.19469v1",
    "pdf_url": "https://arxiv.org/pdf/2510.19469v1.pdf",
    "title": "Advances in detector response and background modelling in the ANAIS-112   experiment for annual modulation and other rare event searches",
    "abstract": "Numerous astronomical and cosmological observations point to the existence of dark matter, which constitutes about 27% of the Universe. Despite extensive efforts, only the DAMA/LIBRA experiment, using NaI(Tl) detectors at Gran Sasso National Laboratory, has reported a positive dark matter signal. To independently verify this result, using the same NaI target is essential. This is the goal of ANAIS-112, operating with 112.5 kg of NaI(Tl) scintillators since 2017 at the Canfranc Underground Laboratory (LSC). This thesis presents work within ANAIS-112, focusing on data analysis and the development of Geant4-based simulations to reduce systematics and increase sensitivity. Efforts have focused on understanding the ANAIS-112 crystals' response to nuclear recoils. Systematic uncertainties related to the scintillation quenching factors (QFs) of sodium and iodine recoiling in NaI(Tl) must be addressed to ensure reliable comparisons with DAMA/LIBRA and other experiments. For that purpose, onsite neutron calibrations in ANAIS-112 have been performed since 2021 at LSC using 252Cf sources. This work has compared calibration data with Geant4-based neutron simulations, which has revealed Geant4 deficiencies in certain decay processes and cross sections in some versions. The simulations have proven highly sensitive to the QF used, favouring models in which the QF increases with energy and disfavouring DAMA values. In parallel, this thesis has contributed to improving the ANAIS-112 background model through a multiparametric fit of its background components. New physics searches have been conducted using ANAIS-112 data, including a reanalysis of the annual modulation signal and a search for solar axions using six years of exposure. Finally, this thesis also includes work within the COSINUS experiment, focused on background modelling and the impact of internal backgrounds on the experiment's sensitivity.",
    "authors": [
      "Tamara Pardo Yanguas"
    ],
    "published": "2025-10-22T11:04:14Z",
    "updated": "2025-10-22T11:04:14Z",
    "categories": [
      "astro-ph.IM",
      "physics.ins-det"
    ],
    "primary_category": "astro-ph.IM"
  },
  {
    "arxiv_id": "2404.03580v5",
    "url": "https://arxiv.org/abs/2404.03580v5",
    "pdf_url": "https://arxiv.org/pdf/2404.03580v5.pdf",
    "title": "The CCube reconstruction algorithm for the SoLid experiment",
    "abstract": "The SoLid experiment is a very-short-baseline experiment aimed at searching for nuclear reactor-produced active to sterile antineutrino oscillations. The detection principle is based on the pairing of two types of solid scintillators: polyvinyl toluene and $^6$LiF:ZnS(Ag), which is a new technology used in this field of Physics. In addition to good neutron-gamma discrimination, this setup allows the detector to be highly segmented (the basic detection unit is a 5 cm side cube). High segmentation provides numerous advantages, including the precise location of Inverse Beta Decay (IBD) products, the derivation of the considerate antineutrino energy estimator, and a powerful background reduction tool based on the topological signature of the signal. Finally, the system is read out by a network of wavelength-shifting fibres coupled to a photodetector (MPPC). This paper describes the design of the reconstruction algorithm that allows maximum use of the granularity of the detector. The goal of the algorithm is to convert the output of the optical-fibre readout to the list of the detection units from which it originated. This paper provides a performance comparison for three methods and concludes with a choice of the baseline approach for the experiment.",
    "authors": [
      "The SoLid collaboration"
    ],
    "published": "2024-04-04T16:42:41Z",
    "updated": "2025-10-22T10:44:46Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1016/j.nima.2024.169628"
  },
  {
    "arxiv_id": "2507.05180v4",
    "url": "https://arxiv.org/abs/2507.05180v4",
    "pdf_url": "https://arxiv.org/pdf/2507.05180v4.pdf",
    "title": "Electromagnetic energy calibration of the SoLid detector with horizontal   muons",
    "abstract": "SoLid is a neutrino experiment at very-short baseline searching for active-to-sterile oscillations of reactor antineutrinos. The detection principle is based on the pairing of two types of solid scintillators: polyvinyl toluene and $^6$Li:ZnS(Ag), which is a new technology used in this field of Physics. In addition to good neutron-gamma discrimination, this setup allows the detector to be highly segmented; the basic detection unit is a 5 cm cube. High segmentation provides numerous advantages including precise localisation of the Inverse Beta Decay (IBD) products, the derivation of an antineutrino energy estimator based on the isolated positron energy, and a powerful background reduction tool that relies on the topological signature of the signal. Finally, the system is read out by a network of WLS fibres coupled to photosensors. A relative electromagnetic calibration is performed with horizontal cosmic muons. This source poses the simplest calibration problem in which a single detection unit is involved. In addition, large muon energy deposits allow us to perform a calibration at the most detailed level (i.e. per fibre) and to accurately define the fraction of energy escaping to neighbouring detection cells. A statistical precision at the sub-percent level is reached. The paper also discusses two methods to calibrate the absolute energy scale. The first method relies on horizontal muons, though the precision is limited to around 10\\% because of the uncertainty in the energy distribution of such muons. A novel, alternative method based on the radioactive AmBe source is proposed. It takes advantage of the electron-positron pair-production process and provides a calibration point at 3.4 MeV (i.e. in the core of the IBD positron spectrum). The paper is concluded with various cross-check including a determination of the energy spectrum of the standard cosmogenic background candle: $^{12}$B.",
    "authors": [
      "SoLid collaboration"
    ],
    "published": "2025-07-07T16:35:32Z",
    "updated": "2025-10-22T10:30:41Z",
    "categories": [
      "physics.ins-det",
      "hep-ex"
    ],
    "primary_category": "physics.ins-det",
    "doi": "10.1088/1748-0221/20/10/P10022"
  },
  {
    "arxiv_id": "2510.09113v2",
    "url": "https://arxiv.org/abs/2510.09113v2",
    "pdf_url": "https://arxiv.org/pdf/2510.09113v2.pdf",
    "title": "Influence of an external static magnetic field on prebreakdown electron   emission and heating",
    "abstract": "High magnetic fields can increase the occurrence of vacuum arcing, suggesting that both electric and magnetic fields can play a role in the vacuum arcing process. The mechanism of vacuum arcing in high magnetic fields is believed to involve both the cathode and the anode, with the cathode serving as the originator of field-emitting nanoprotrusions or tips, while the anode serves a secondary role. Significant heating of the anode surface can be achieved by magnetic focusing of the emitted electron beam, leading to increased heat flux due to greater current density. We simulated the emitted electron beam in different configurations of the electric and magnetic fields using the particle-in-cell (PIC) and finite element methods (FEM). The heating caused by the impacting electron beam was simulated for magnetic fields ranging from 0 T to 30 T. The directions of the electric and magnetic fields were found to play a major role in the focusing of the electron beam. We found that a sufficient temperature increase on the anode surface for evaporation can be reached at magnetic fields on the order of 10-30 T, suggesting the possibility of plasma initiation on the anode side.",
    "authors": [
      "Roni Koitermaa",
      "Marzhan Toktaganova",
      "Andreas Kyritsakis",
      "Tauno Tiirats",
      "Alexej Grudiev",
      "Veronika Zadin",
      "Flyura Djurabekova"
    ],
    "published": "2025-10-10T08:05:37Z",
    "updated": "2025-10-22T09:55:25Z",
    "categories": [
      "physics.acc-ph",
      "cond-mat.mtrl-sci",
      "physics.comp-ph",
      "physics.plasm-ph"
    ],
    "primary_category": "physics.acc-ph"
  }
]