{
  "arxiv_id": "2412.10205v3",
  "url": "https://arxiv.org/abs/2412.10205v3",
  "pdf_url": "https://arxiv.org/pdf/2412.10205v3.pdf",
  "title": "Partially Coherent X-Ray Oscilex Radiation from a FEL-Modulated Positron Bunch during Its Planar Channeling in a Crystalline Undulator",
  "abstract": "The radiation emitted at zero angle by a microbunched positron bunch undergoing planar channeling in a crystalline undulator (CU) is studied. The bunch energy is assumed to be far above the threshold for radiation generation in the dispersive CU medium. Besides the usual ``hard'' undulator radiation produced by channeling oscillations (channeling undulator radiation) and by the CU bending (crystalline undulator radiation), a ``soft'' medium-polarization component also appears at zero angle due to the oscillations that excite atomic electrons. We refer to this soft component as Oscilex (oscillationally-excited) radiation. Since the two types of oscillations have different frequencies, they yield two distinct frequency components of both undulator and Oscilex radiation. The Oscilex frequencies are set by the plasma frequency and the characteristic oscillation frequency and are, to high accuracy, independent of the positron energy. The CU period is chosen so that the radiation wavelength is not shorter than the microbunch length, ensuring coherent emission from microbunches and partially coherent Oscilex emission from the full bunch. Analytical expressions are obtained for the spectral line shapes and the number of photons of spontaneous Oscilex radiation. For partially coherent emission, Gaussian distributions are used for both the bunch and microbunches. Gain factors for the two Oscilex components, including longitudinal form-factors, and the total number of partially coherent photons are derived. A positron bunch with LCLS parameters, modulated by SASE XFEL, channeling between (1 1 0) planes of a periodically bent diamond crystal is analyzed. The number of spontaneously emitted Oscilex photons exceeds the number of positrons by $1\\text{รท}2$ orders of magnitude, and the gain factors reach $10^3 \\text{รท} 10^4$.",
  "authors": [
    "Hayk L. Gevorgyan",
    "Lekdar A. Gevorgian"
  ],
  "published": "2024-12-13T15:26:33Z",
  "updated": "2025-12-10T19:35:17Z",
  "categories": [
    "physics.acc-ph",
    "hep-ex",
    "hep-ph",
    "physics.class-ph",
    "physics.optics"
  ],
  "primary_category": "physics.acc-ph"
}