{
  "arxiv_id": "2506.03712v2",
  "url": "https://arxiv.org/abs/2506.03712v2",
  "pdf_url": "https://arxiv.org/pdf/2506.03712v2.pdf",
  "title": "Simulation of MAPS and a MAPS-based Inner Tracker for the Super Tau-Charm Facility",
  "abstract": "Monolithic Active Pixel Sensors (MAPS) are a promising detector candidate for the inner tracker of the Super Tau-Charm Facility (STCF). To evaluate the performance of MAPS and the MAPS-based inner tracker, a dedicated simulation workflow has been developed, offering essential insights for detector design and optimization.   The intrinsic characteristics of MAPS, designed using several fabrication processes and pixel geometries, were investigated through a combination of Technology Computer Aided Design (TCAD) and Monte Carlo simulations. Simulations were conducted with both minimum ionizing particles and $^{55}$Fe X-rays to assess critical parameters such as detection efficiency, cluster size, spatial resolution, and charge collection efficiency. Based on these evaluations, a MAPS sensor featuring a strip-like pixel and a high-resistivity epitaxial layer is selected as the baseline sensor design for the STCF inner tracker due to its excellent performance.   Using this optimized MAPS design, a three-layer MAPS-based inner tracker was modeled and simulated. The simulation demonstrated an average detection efficiency exceeding 99%, spatial resolutions of 44.8$\\rm{μm}$ in the $z$ direction and 8.2$\\rm{μm}$ in the $r-φ$ direction, and an intrinsic sensor time resolution of 5.9ns for 1GeV/c $μ^-$ particles originating from the interaction point. These promising results suggest that the MAPS-based inner tracker fulfills the performance requirements of the STCF experiment.",
  "authors": [
    "Ruiyang Zhang",
    "Dongwei Xuan",
    "Jiajun Qin",
    "Lei Zhao",
    "Le Xiao",
    "Xiangming Sun",
    "Lailin Xu",
    "Jianbei Liu"
  ],
  "published": "2025-06-04T08:44:56Z",
  "updated": "2025-12-11T02:55:16Z",
  "categories": [
    "physics.ins-det",
    "hep-ex"
  ],
  "primary_category": "physics.ins-det"
}