{
  "arxiv_id": "2510.06150v2",
  "url": "https://arxiv.org/abs/2510.06150v2",
  "pdf_url": "https://arxiv.org/pdf/2510.06150v2.pdf",
  "title": "Simulation of Muon-induced Backgrounds for the Colorado Underground Research Institute (CURIE)",
  "abstract": "We present a comprehensive Monte Carlo simulation of muon-induced backgrounds for the Colorado Underground Research Institute (CURIE), a shallow-underground facility with $\\approx 415$~m.w.e. overburden. Using coupled \\textsc{mute} and \\textsc{geant4} frameworks, we characterize the production and transport of muon-induced secondaries through site-specific rock compositions and geometries, establishing a proof-of-concept for high-precision, end-to-end simulations. Our simulations employ angular-dependent muon energy distributions, which improve secondary flux accuracy. For the Subatomic Particle Hideout and Cryolab I research spaces, we predict total muon-induced neutron fluxes of $(8.52 \\pm 1.30_{\\text{sys}}) \\times 10^{-3}$~m$^{-2}$s$^{-1}$ and $(8.86 \\pm 1.62_{\\text{sys}}) \\times 10^{-3}$~m$^{-2}$s$^{-1}$, respectively. Additionally, we develop a Depth-Intensity Relation (DIR) to predict the muon-induced neutron flux as a function of facility depth, which is consistent with measurements across a broad range of underground depths. These results provide quantitative background predictions for experimental design and sensitivity projections at shallow- and deep-underground facilities. They further demonstrate that local geology and overburden geometry influence muon-induced secondary yields and energy spectra, emphasizing the need for site-specific simulations for accurate underground background characterization. Therefore, the simulation framework has been made publicly available at \\href{https://doi.org/10.5281/zenodo.17196581}{https://doi.org/10.5281/zenodo.17196581}, for the broader low-background physics community to enable meaningful inter-facility comparisons.",
  "authors": [
    "Dakota K. Keblbeck",
    "Eric Mayotte",
    "Uwe Greife",
    "Kyle G. Leach",
    "Wouter Van De Pontseele",
    "Caitlyn Stone-Whitehead",
    "Luke Wanner",
    "Grace Wagner"
  ],
  "published": "2025-10-07T17:21:18Z",
  "updated": "2025-12-10T21:08:32Z",
  "categories": [
    "hep-ex",
    "physics.comp-ph",
    "physics.ins-det"
  ],
  "primary_category": "hep-ex"
}